[
{"url": "https://www.goodreads.com/book/show/10335337-mr-fox", "num_ratings": "6,943", "num_reviews": "1,168", "avg_ratings": 3.58, "genres": ["Fiction", "Magical Realism", "Fantasy", "Literary Fiction", "Contemporary"], "title": "Mr. Fox", "description": ["It’s a bright afternoon in 1938 and Mary Foxe is in a confrontational mood. St John Fox, celebrated novelist, hasn’t seen her in six years. He’s unprepared for her afternoon visit, not least because she doesn’t exist. He’s infatuated with her. But he also made her up.", "“You’re a villain,” she tells him. ‘A serial killer . . . can you grasp that?”", "Will Mr Fox meet his muse’s c", "It’s a bright afternoon in 1938 and Mary Foxe is in a confrontational mood. St John Fox, celebrated novelist, hasn’t seen her in six years. He’s unprepared for her afternoon visit, not least because she doesn’t exist. He’s infatuated with her. But he also made her up.", "“You’re a villain,” she tells him. ‘A serial killer . . . can you grasp that?”", "Will Mr Fox meet his muse’s challenge, to stop murdering his heroines and explore something of love? What will his wife Daphne think of this sudden change in her husband? Can there be a happy ending – this time?"], "author": "Helen Oyeyemi", "num_pages": "278", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2011)", "Hurston/Wright Legacy Award for Fiction (2012)"], "places": ["New York City, New York"], "character_names": ["St John Fox", "Daphne Fox", "Mary Foxe"], "language": "English", "publish_date": "2011-06-03 00:00:00", "ISBN": "0330536265"},
{"url": "https://www.goodreads.com/book/show/11359.Tar_Baby", "num_ratings": "15,450", "num_reviews": "444", "avg_ratings": 3.91, "genres": ["Fiction", "Cultural", "African American", "Classics", "Literature"], "title": "Tar Baby", "description": ["Ravishingly beautiful and emotionally incendiary, ", "is Toni Morrison’s reinvention of the love story. Jadine Childs is a black fashion model with a white patron, a white boyfriend, and a coat made out of ninety perfect sealskins. Son is a black fugitive who embodies everything she loathes and desires. As Morrison follows their affair, which plays out from the Caribb", "Ravishingly beautiful and emotionally incendiary, ", "is Toni Morrison’s reinvention of the love story. Jadine Childs is a black fashion model with a white patron, a white boyfriend, and a coat made out of ninety perfect sealskins. Son is a black fugitive who embodies everything she loathes and desires. As Morrison follows their affair, which plays out from the Caribbean to Manhattan and the deep South, she charts all the nuances of obligation and betrayal between blacks and whites, masters and servants, and men and women."], "author": "Toni Morrison", "num_pages": "320", "awards": [], "places": ["New York City, New York"], "character_names": ["Valerian Street"], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "1400033446"},
{"url": "https://www.goodreads.com/book/show/60931.Kindred", "num_ratings": "60,457", "num_reviews": "7,258", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Science Fiction", "Fantasy", "Science Fiction", "Time Travel"], "title": "Kindred", "description": ["The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into ante", "The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into antebellum Maryland. After saving a drowning white boy there, she finds herself staring into the barrel of a shotgun and is transported back to the present just in time to save her life. During numerous such time-defying episodes with the same young man, she realizes the challenge she’s been given: to protect this young slaveholder until he can father her own great-grandmother."], "author": "Octavia E. Butler", "num_pages": "287", "awards": [], "places": ["Maryland", "Altadena, California"], "character_names": ["Dana Franklin", "Kevin Franklin", "Rufus Weylin", "Tom Weylin", "Margaret Weylin", "Alice Greenwood"], "language": "English", "publish_date": "2004-02-01 00:00:00", "ISBN": "0807083690"},
{"url": "https://www.goodreads.com/book/show/19161852-the-fifth-season", "num_ratings": "55,517", "num_reviews": "7,665", "avg_ratings": 4.31, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia"], "title": "The Fifth Season", "description": ["This is the way the world ends. Again.", "Three terrible things happen in a single day. Essun, a woman living an ordinary life in a small town, comes home to find that her husband has brutally murdered their son and kidnapped their daughter. Meanwhile, mighty Sanze — the world-spanning empire whose innovations have been civilization’s bedrock for a thousand years — collapses a", "This is the way the world ends. Again.", "Three terrible things happen in a single day. Essun, a woman living an ordinary life in a small town, comes home to find that her husband has brutally murdered their son and kidnapped their daughter. Meanwhile, mighty Sanze — the world-spanning empire whose innovations have been civilization’s bedrock for a thousand years — collapses as most of its citizens are murdered to serve a madman’s vengeance. And worst of all, across the heart of the vast continent known as the Stillness, a great red rift has been torn into the heart of the earth, spewing ash enough to darken the sky for years. Or centuries.", "Now Essun must pursue the wreckage of her family through a deadly, dying land. Without sunlight, clean water, or arable land, and with limited stockpiles of supplies, there will be war all across the Stillness: a battle royale of nations not for power or territory, but simply for the basic resources necessary to get through the long dark night. Essun does not care if the world falls apart around her. She’ll break it herself, if she must, to save her daughter."], "author": "N.K. Jemisin", "num_pages": "468", "awards": ["Hugo Award for Best Novel (2016)", "Nebula Award Nominee for Best Novel (2015)", "Locus Award Nominee for Best Fantasy Novel (2016)", "World Fantasy Award Nominee for Best Novel (2016)", "The Kitschies Nominee for Red Tentacle (Novel) (2015)", "Goodreads Choice Award Nominee for Fantasy (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13210.Wouldn_t_Take_Nothing_for_My_Journey_Now", "num_ratings": "7,689", "num_reviews": "385", "avg_ratings": 4.26, "genres": ["Nonfiction", "Autobiography", "Memoir", "Poetry", "Biography"], "title": "Wouldn't Take Nothing for My Journey Now", "description": ["Maya Angelou, one of the best-loved authors of our time, shares the wisdom of a remarkable life in this best-selling spiritual classic. This is Maya Angelou talking from the heart, down to earth and real, but also inspiring. This is a book to treasured, a book about being in all ways a woman, about living well, about the power of the word, and about the power do spirituali", "Maya Angelou, one of the best-loved authors of our time, shares the wisdom of a remarkable life in this best-selling spiritual classic. This is Maya Angelou talking from the heart, down to earth and real, but also inspiring. This is a book to treasured, a book about being in all ways a woman, about living well, about the power of the word, and about the power do spirituality to move and shape your life. Passionate, lively, and lyrical, Maya Angelou's latest unforgettable work offers a gem of truth on every page."], "author": "Maya Angelou", "num_pages": "127", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-05-12 00:00:00", "ISBN": "0553380176"},
{"url": "https://www.goodreads.com/book/show/32313894-the-hate-u-give", "num_ratings": "168,959", "num_reviews": "28,489", "avg_ratings": 4.56, "genres": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "title": "The Hate U Give", "description": ["Sixteen-year-old Starr Carter moves between two worlds: the poor neighborhood where she lives and the fancy suburban prep school she attends. The uneasy balance between these worlds is shattered when Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Khalil was unarmed.", "Soon afterward, his death is a national headline. S", "Sixteen-year-old Starr Carter moves between two worlds: the poor neighborhood where she lives and the fancy suburban prep school she attends. The uneasy balance between these worlds is shattered when Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Khalil was unarmed.", "Soon afterward, his death is a national headline. Some are calling him a thug, maybe even a drug dealer and a gangbanger. Protesters are taking to the streets in Khalil’s name. Some cops and the local drug lord try to intimidate Starr and her family. What everyone wants to know is: what ", " went down that night? And the only person alive who can answer that is Starr. ", "But what Starr does—or does not—say could upend her community. It could also endanger her life."], "author": "Angie Thomas", "num_pages": "464", "awards": ["National Book Award Nominee for Young People's Literature (2017)", "Odyssey Award (2018)", "Los Angeles Times Book Prize Nominee for Young Adult Literature (2017)", "Edgar Award Nominee for Best Young Adult (2018)", "Coretta Scott King Award Nominee for Author Honor (2018)", "Boston Globe-Horn Book Award for Fiction (2017)", "Lincoln Award Nominee (2019)", "Kirkus Prize Nominee for Young Readers' Literature (2017)", "Goodreads Choice Award for Young Adult Fiction & for Debut Goodreads Author (2017)", "Carnegie Medal Nominee (2018)", "NAACP Image Award Nominee for Youth/Teens (2018)", "Michael L. Printz Honor Award (2018)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2017-02-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/31411922-a-torch-against-the-night", "num_ratings": "53,215", "num_reviews": "7,669", "avg_ratings": 4.34, "genres": ["Fantasy", "Young Adult", "Romance"], "title": "A Torch Against the Night", "description": ["A Torch Against the Night takes readers into the heart of the Empire as Laia and Elias fight their way north to liberate Laia’s brother from the horrors of Kauf Prison. Hunted by Empire soldiers, manipulated by the Commandant, and haunted by their pasts, Laia and Elias must outfox their enemies and confront the treacherousness of their own", "A Torch Against the Night takes readers into the heart of the Empire as Laia and Elias fight their way north to liberate Laia’s brother from the horrors of Kauf Prison. Hunted by Empire soldiers, manipulated by the Commandant, and haunted by their pasts, Laia and Elias must outfox their enemies and confront the treacherousness of their own hearts.", "In the city of Serra, Helene Aquilla finds herself bound to the will of the Empire’s twisted new leader, Marcus. When her loyalty is questioned, Helene finds herself taking on a mission to prove herself—a mission that might destroy her, instead."], "author": "Sabaa Tahir", "awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2016)"], "places": [], "character_names": ["Laia", "Elias Veturius", "Helene Aquilla", "Keris Veturia", "Marcus Farrar"], "language": "English", "publish_date": "2016-08-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/32920226-sing-unburied-sing", "num_ratings": "50,982", "num_reviews": "7,272", "avg_ratings": 4.06, "genres": ["Fiction", "Contemporary", "Literary Fiction", "Magical Realism", "Cultural", "African American"], "title": "Sing, Unburied, Sing", "description": ["An intimate portrait of a family and an epic tale of hope and struggle, ", " examines the ugly truths at the heart of the American story and the power – and limitations – of family bonds. ", "Jojo is thirteen years old and trying to understand what it means to be a man. His mother, Leonie, is in constant conflict with herself and those around her. She is black", "An intimate portrait of a family and an epic tale of hope and struggle, ", " examines the ugly truths at the heart of the American story and the power – and limitations – of family bonds. ", "Jojo is thirteen years old and trying to understand what it means to be a man. His mother, Leonie, is in constant conflict with herself and those around her. She is black and her children’s father is white. Embattled in ways that reflect the brutal reality of her circumstances, she wants to be a better mother, but can’t put her children above her own needs, especially her drug use. ", "When the children’s father is released from prison, Leonie packs her kids and a friend into her car and drives north to the heart of Mississippi and Parchman Farm, the State Penitentiary. At Parchman, there is another boy, the ghost of a dead inmate who carries all of the ugly history of the South with him in his wandering. He too has something to teach Jojo about fathers and sons, about legacies, about violence, about love. ", "Rich with Ward’s distinctive, lyrical language, ", " brings the archetypal road novel into rural twenty-first century America. It is a majestic new work from an extraordinary and singular author."], "author": "Jesmyn Ward", "num_pages": "285", "awards": ["National Book Award for Fiction (2017)", "Los Angeles Times Book Prize Nominee for Fiction (2017)", "National Book Critics Circle Award Nominee for Fiction (2017)", "Women's Prize for Fiction Nominee (2018)", "Andrew Carnegie Medal Nominee for Fiction (2018)", "Kirkus Prize Nominee for Fiction (2017)", "Goodreads Choice Award Nominee for Fiction (2017)", "NAACP Image Award Nominee for Fiction (2018)", "Book of the Month Book of the Year Award Nominee (2017)", "Reading Women Award Nominee for Fiction (2017)"], "places": ["Mississippi", "Gulf Coast, Mississippi"], "character_names": [], "language": "English", "publish_date": "2017-09-05 00:00:00", "ISBN": "1501126067"},
{"url": "https://www.goodreads.com/book/show/1159206.Ella_Deloria_s_Iron_Hawk", "num_ratings": "4", "num_reviews": "1", "avg_ratings": 3.5, "genres": [], "title": "Ella Deloria's Iron Hawk", "description": ["Ella Deloria, the bilingual and bicultural Lakota ethnologist and linguist, wrote hundreds of traditional narratives, autobiographies, anecdotes, and reminiscences in both Lakota and English during the 1920s and 1930s. Iron Hawk represents the culmination of Deloria's colloquial style of synthesizing from memory rather than transcribing from tape or written notes. The stor", "Ella Deloria, the bilingual and bicultural Lakota ethnologist and linguist, wrote hundreds of traditional narratives, autobiographies, anecdotes, and reminiscences in both Lakota and English during the 1920s and 1930s. Iron Hawk represents the culmination of Deloria's colloquial style of synthesizing from memory rather than transcribing from tape or written notes. The story traces the development of a culture hero, from his early education by a grandfather, through a series of instructive adolescent mistakes, to the achievement of marriage and leadership in the tribe. But in refusing to romanticize camp circle life, Deloria also includes Iron Hawk's captivation by a seductive woman, and his return to the work of tribal continuance, when he is rescued by his son. A series of interpretive chapters follow the text to provide suggestions for literary criticism, as well as information on child-rearing and the symbolism of meadowlarks, fire, clothing, and eastward movement."], "author": "Ella Cara Deloria", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-10-01 00:00:00", "ISBN": "0826314473"},
{"url": "https://www.goodreads.com/book/show/348729.Waterlily", "num_ratings": "1,299", "num_reviews": "98", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Academic", "School", "Academic", "Read For School"], "title": "Waterlily", "description": ["This novel of the Dakota Sioux written by Sioux ethnologist Deloria takes protagonist Waterlily through the everyday and the extraordinary events of a Sioux woman's life."], "author": "Ella Cara Deloria", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-08-01 00:00:00", "ISBN": "0803265794"},
{"url": "https://www.goodreads.com/book/show/26228034-the-obelisk-gate", "num_ratings": "32,813", "num_reviews": "3,132", "avg_ratings": 4.34, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia"], "title": "The Obelisk Gate", "description": ["The season of endings grows darker as civilization fades into the long cold night. Alabaster Tenring – madman, world-crusher, savior – has returned with a mission: to train his successor, Essun, and thus seal the fate of the Stillness forever.", "It continues with a lost daughter, found by the enemy.", "It continues with the obel", "The season of endings grows darker as civilization fades into the long cold night. Alabaster Tenring – madman, world-crusher, savior – has returned with a mission: to train his successor, Essun, and thus seal the fate of the Stillness forever.", "It continues with a lost daughter, found by the enemy.", "It continues with the obelisks, and an ancient mystery converging on answers at last.", "The Stillness is the wall which stands against the flow of tradition, the spark of hope long buried under the thickening ashfall. And it will not be broken."], "author": "N.K. Jemisin", "num_pages": "410", "awards": ["Hugo Award for Best Novel (2017)", "Nebula Award Nominee for Best Novel (2016)", "World Fantasy Award Nominee for Best Novel (2016)", "James Tiptree Jr. Award Nominee for Longlist (2016)", "Goodreads Choice Award Nominee for Fantasy (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-18 00:00:00", "ISBN": "0356508366"},
{"url": "https://www.goodreads.com/book/show/60940.The_Way_Forward_is_with_a_Broken_Heart", "num_ratings": "1,345", "num_reviews": "117", "avg_ratings": 3.9, "genres": ["Fiction", "Short Stories", "Feminism", "Cultural", "African American"], "title": "The Way Forward is with a Broken Heart", "description": ["'These are the stories that came to me to be told after hte close of a magical marriage to an extraordinary man that ended ina less-than-magical divorce. I found myself unmoored, unmated, ungrounded in a way that challenged everything I'd ever thought about human relationships. Situated squarely in that terrifying paradise called freedom, precipitously out on so many emoti", "'These are the stories that came to me to be told after hte close of a magical marriage to an extraordinary man that ended ina less-than-magical divorce. I found myself unmoored, unmated, ungrounded in a way that challenged everything I'd ever thought about human relationships. Situated squarely in that terrifying paradise called freedom, precipitously out on so many emotional limbs, it was as if I had been born; and in fact I was being reborn as the woman I was to become' The Way Forward is with a Broken Heart starts with a lyrical, autobiographical story of the breakdown of a marriage during the early years of the civil rights movement. Alice Walker then goes on to imagine stories that grew out of the life following that marriage. Filled with wonder at the capacity of humans to move through love and loss, this is an uplifting read that showcases the authors warmth, wit and wisdom."], "author": "Alice Walker", "num_pages": "245", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-12 00:00:00", "ISBN": "0753819724"},
{"url": "https://www.goodreads.com/book/show/20821284-brown-girl-dreaming", "num_ratings": "46,048", "num_reviews": "6,840", "avg_ratings": 4.13, "genres": ["Poetry", "Autobiography", "Memoir", "Nonfiction", "Childrens", "Middle Grade", "Biography"], "title": "Brown Girl Dreaming", "description": ["Jacqueline Woodson, one of today's finest writers, tells the moving story of her childhood in mesmerizing verse.", "Raised in South Carolina and New York, Woodson always felt halfway home in each place. In vivid poems, she shares what it was like to grow up as an African American in the 1960s and 1970s, living with the remnants of Jim Crow and her growing awareness of the Civi", "Jacqueline Woodson, one of today's finest writers, tells the moving story of her childhood in mesmerizing verse.", "Raised in South Carolina and New York, Woodson always felt halfway home in each place. In vivid poems, she shares what it was like to grow up as an African American in the 1960s and 1970s, living with the remnants of Jim Crow and her growing awareness of the Civil Rights movement. Touching and powerful, each poem is both accessible and emotionally charged, each line a glimpse into a child’s soul as she searches for her place in the world. Woodson’s eloquent poetry also reflects the joy of finding her voice through writing stories, despite the fact that she struggled with reading as a child. Her love of stories inspired her and stayed with her, creating the first sparks of the gifted writer she was to become."], "author": "Jacqueline Woodson", "num_pages": "337", "awards": ["Newbery Medal Nominee (2015)", "National Book Award for Young People's Literature (2014)", "Sibert Medal Nominee (2015)", "Coretta Scott King Award for Author (2015)", "Boston Globe-Horn Book Award Nominee for Nonfiction (2015)", "Claudia Lewis Award for Older Readers (2015)", "Goodreads Choice Award Nominee for Middle Grade & Children's (2014)", "YALSA Award Nominee for Excellence in Nonfiction (2015)"], "places": ["South Carolina"], "character_names": [], "language": "English", "publish_date": "2014-08-28 00:00:00", "ISBN": "0399252517"},
{"url": "https://www.goodreads.com/book/show/60944.Meridian", "num_ratings": "4,503", "num_reviews": "183", "avg_ratings": 3.7, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Classics", "Feminism", "Literature", "Novels", "American", "African American Literature", "Academic", "School", "Literature", "American"], "title": "Meridian", "description": ["The second novel written by Alice Walker, preceding ", " is a heartfelt and moving story about one woman's personal revolution as she joins the Civil Rights Movement. Set in the American South in the 1960s it follows Meridian Hill, a courageous young woman who dedicates herself heart and soul to her civil rights work, touching the lives of those around her even", "The second novel written by Alice Walker, preceding ", " is a heartfelt and moving story about one woman's personal revolution as she joins the Civil Rights Movement. Set in the American South in the 1960s it follows Meridian Hill, a courageous young woman who dedicates herself heart and soul to her civil rights work, touching the lives of those around her even as her own health begins to deteriorate. Hers is a lonely battle, but it is one she will not abandon, whatever the costs. This is classic Alice Walker, beautifully written, intense and passionate."], "author": "Alice Walker", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "075381949X"},
{"url": "https://www.goodreads.com/book/show/60935.Possessing_the_Secret_of_Joy", "num_ratings": "13,255", "num_reviews": "518", "avg_ratings": 4.07, "genres": ["Fiction", "Feminism", "Cultural", "African American", "Cultural", "Africa"], "title": "Possessing the Secret of Joy", "description": [" is the story of Tashi, a tribal African woman who lives much of her adult life in North America. As a young woman, a misguided loyalty to the customs of her people led her to voluntarily submit to the tsunga's knife and be genitally mutilated (pharoanoically circumcised). Severely traumatized by this experience, she spends the rest of her life", " is the story of Tashi, a tribal African woman who lives much of her adult life in North America. As a young woman, a misguided loyalty to the customs of her people led her to voluntarily submit to the tsunga's knife and be genitally mutilated (pharoanoically circumcised). Severely traumatized by this experience, she spends the rest of her life battling madness, trying desperately through psychotherapy - she is treated by disciples of both Freud and C.G. Jung, and even by Jung himself - to regain the ability to recognize her own reality and to feel. It is only with the help of the most unlikely ally she can imagine that she begins to study the mythological \"reasons\" invented by her ancient ancestors for what was done to her and to millions of other women and girls over thousands of years. As her understanding grows, so does her capacity to encounter her overwhelming grief. Underneath this grief is her glowing anger. Anger propels her to act. Action brings both feeling - life, the ability to exist with awareness in the moment - and death, of which she finds she has completely lost her fear.", "While not a sequel to ", " or ", ", ", " follows the life of a barely-glimpsed character from those books. Combining fact and fiction, communing with the spirits of the living and the dead, Alice Walker in this novel strikes with graceful power at the heart of one of the most controversial issues of our time."], "author": "Alice Walker", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-12-02 00:00:00", "ISBN": "0671789457"},
{"url": "https://www.goodreads.com/book/show/60937.The_Temple_of_My_Familiar", "num_ratings": "12,630", "num_reviews": "431", "avg_ratings": 4.05, "genres": ["Fiction", "Cultural", "African American", "Feminism", "Magical Realism"], "title": "The Temple of My Familiar", "description": ["A visionary cast of characters weave together their past and present in a brilliantly intricate tapestry of tales.", "It is the story of the dispossessed and displaced, of peoples whose history is ancient and whose future is yet to come. Here we meet Lissie, a woman of many pasts; Arveyda the great guitarist and his Latin American wife who has had to flee her homeland; Suwelo,", "A visionary cast of characters weave together their past and present in a brilliantly intricate tapestry of tales.", "It is the story of the dispossessed and displaced, of peoples whose history is ancient and whose future is yet to come. Here we meet Lissie, a woman of many pasts; Arveyda the great guitarist and his Latin American wife who has had to flee her homeland; Suwelo, the history teacher, and his former wife Fanny who has fallen in love with spirits. Hovering tantalisingly above their stories are Miss Celie and Shug, the beloved characters from THE COLOUR PURPLE."], "author": "Alice Walker", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-09-16 00:00:00", "ISBN": "0753819481"},
{"url": "https://www.goodreads.com/book/show/97331.The_Opposite_of_Fate", "num_ratings": "6,922", "num_reviews": "673", "avg_ratings": 3.92, "genres": ["Nonfiction", "Autobiography", "Memoir", "Language", "Writing", "Biography"], "title": "The Opposite of Fate: Memories of a Writing Life", "description": ["Amy Tan has touched millions of readers with haunting and sympathetic novels of cultural complexity and profound empathy. With the same spirit and humor that characterize her acclaimed novels, she now shares", "Amy Tan has touched millions of readers with haunting and sympathetic novels of cultural complexity and profound empathy. With the same spirit and humor that characterize her acclaimed novels, she now shares her insight into her own life and how she escaped the curses of her past to make a future of her own. She takes us on a journey from her childhood of tragedy and comedy to the present day and her arrival as one of the world's best-loved novelists. Whether recalling arguments with her mother in suburban California or introducing us to the ghosts that inhabit her computer, ", " offers vivid portraits of choices, attitudes, charms, and luck in action--a refreshing antidote to the world-weariness and uncertainties we all face today."], "author": "Amy Tan", "num_pages": "398", "awards": ["Audie Award for Nonfiction, Abridged (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-09-28 00:00:00", "ISBN": "0142004898"},
{"url": "https://www.goodreads.com/book/show/15811545-a-tale-for-the-time-being", "num_ratings": "67,090", "num_reviews": "9,117", "avg_ratings": 3.99, "genres": ["Fiction", "Cultural", "Japan", "Historical", "Historical Fiction", "Magical Realism", "Contemporary"], "title": "A Tale for the Time Being", "description": ["In Tokyo, sixteen-year-old Nao has decided there’s only one escape from her aching loneliness and her classmates’ bullying, but before she ends it all, Nao plans to document the life of her great-grandmother, a Buddhist nun who’s lived more than a century. A diary is Nao’s only solace—and will touch lives in a ways she can scarcely imagine.", "Across the Pacific, we meet Ruth,", "In Tokyo, sixteen-year-old Nao has decided there’s only one escape from her aching loneliness and her classmates’ bullying, but before she ends it all, Nao plans to document the life of her great-grandmother, a Buddhist nun who’s lived more than a century. A diary is Nao’s only solace—and will touch lives in a ways she can scarcely imagine.", "Across the Pacific, we meet Ruth, a novelist living on a remote island who discovers a collection of artifacts washed ashore in a Hello Kitty lunchbox—possibly debris from the devastating 2011 tsunami. As the mystery of its contents unfolds, Ruth is pulled into the past, into Nao’s drama and her unknown fate, and forward into her own future. ", "Full of Ozeki’s signature humour and deeply engaged with the relationship between writer and reader, past and present, fact and fiction, quantum physics, history, and myth, ", " is a brilliantly inventive, beguiling story of our shared humanity and the search for home."], "author": "Ruth Ozeki", "num_pages": "422", "awards": ["Man Booker Prize Nominee (2013)", "Sunburst Award for Adult (2014)", "Los Angeles Times Book Prize for Fiction (2013)", "PEN Open Book Award Nominee for Longlist (2014)", "National Book Critics Circle Award Nominee for Fiction (2013)", "The Kitschies for Red Tentacle (Novel) (2013)", "Andrew Carnegie Medal Nominee for Fiction (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "Asian/Pacific American Award for Literature for Adult Fiction (2013)"], "places": ["Tokyo", "Cortes Island, British Columbia"], "character_names": ["Naoko Yasutani", "Ruth Ozeki", "Haruki Yasutani", "Jiko Yasutani"], "language": "English", "publish_date": "2013-03-12 00:00:00", "ISBN": "0670026638"},
{"url": "https://www.goodreads.com/book/show/18079683-boy-snow-bird", "num_ratings": "22,077", "num_reviews": "3,568", "avg_ratings": 3.34, "genres": ["Fiction", "Literary Fiction", "Fantasy", "Fairy Tales", "Adult Fiction", "Adult"], "title": "Boy, Snow, Bird", "description": ["BOY Novak turns twenty and decides to try for a brand-new life. Flax Hill, Massachusetts, isn’t exactly a welcoming town, but it does have the virtue of being the last stop on the bus route she took from New York. Flax Hill is also the hometown of Arturo Whitman –- craftsman, widower, and father of Snow. SNOW is mild-mannered, radiant and deeply cherished –- exactly the so", "BOY Novak turns twenty and decides to try for a brand-new life. Flax Hill, Massachusetts, isn’t exactly a welcoming town, but it does have the virtue of being the last stop on the bus route she took from New York. Flax Hill is also the hometown of Arturo Whitman –- craftsman, widower, and father of Snow. SNOW is mild-mannered, radiant and deeply cherished –- exactly the sort of little girl Boy never was, and Boy is utterly beguiled by her. If Snow displays a certain inscrutability at times, that’s simply a characteristic she shares with her father, harmless until Boy gives birth to Snow’s sister, Bird. When BIRD is born Boy is forced to re-evaluate the image Arturo’s family have presented to her, and Boy, Snow and Bird are broken apart. Sparkling with wit and vibrancy, ", " is a deeply moving novel about three women and the strange connection between them. It confirms Helen Oyeyemi’s place as one of the most original and dynamic literary voices of her generation."], "author": "Helen Oyeyemi", "num_pages": "308", "awards": [], "places": ["Massachusetts"], "character_names": [], "language": "English", "publish_date": "2014-03-06 00:00:00", "ISBN": "1594631395"},
{"url": "https://www.goodreads.com/book/show/106540.Tales_of_Burning_Love", "num_ratings": "2,194", "num_reviews": "143", "avg_ratings": 3.87, "genres": ["Fiction", "Literary Fiction", "Novels"], "title": "Tales of Burning Love", "description": ["In her boldest and most darkly humorous novel yet, award-winning, critically acclaimed and bestselling novelist Louise Erdrich tells the intimate and powerful stories of five Great Plains women whose lives are connected through one man. Stranded in a North Dakota blizzard, Jack Mauser's former wives huddle for warmth and pass the endless night by remembering the stories of", "In her boldest and most darkly humorous novel yet, award-winning, critically acclaimed and bestselling novelist Louise Erdrich tells the intimate and powerful stories of five Great Plains women whose lives are connected through one man. Stranded in a North Dakota blizzard, Jack Mauser's former wives huddle for warmth and pass the endless night by remembering the stories of how each came to love, marry and ultimately move beyond Jack. At times painful, at times heartbreaking and often times comic, their tales become the adhesive that holds them together in their love for Jack and in their lives as women.", "Erdrich, with her characteristic powers of observation and luminescent prose, brings these women's unforgettable stories to life with astonishing candor and warmth. Filled with keen perceptions about the apparatus for survival, the force of passion and the necessity of hope, \"Tales of Burning Love\" is a tour de force from one of the most formidable American writers at work today.\"Her most daring and perhaps her most compelling....A wise, wonderful, and wickedly funny novel.\" \"--Booklist\""], "author": "Louise Erdrich", "num_pages": "464", "awards": ["Minnesota Book Award for Novels (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-14 00:00:00", "ISBN": "0060928360"},
{"url": "https://www.goodreads.com/book/show/29540318-year-of-yes", "num_ratings": "41,464", "num_reviews": "4,921", "avg_ratings": 4.07, "genres": ["Nonfiction", "Autobiography", "Memoir", "Audiobook", "Self Help"], "title": "Year of Yes", "description": ["In this poignant, hilarious and deeply intimate call to arms, Hollywood's most powerful woman, the mega-talented creator of Grey's Anatomy and Scandal and executive producer of How to Get Away with Murder and Catch, reveals how saying YES changed her life - and how it can change yours too. With three hit shows on television and three children at home, Shonda Rhimes had lot", "In this poignant, hilarious and deeply intimate call to arms, Hollywood's most powerful woman, the mega-talented creator of Grey's Anatomy and Scandal and executive producer of How to Get Away with Murder and Catch, reveals how saying YES changed her life - and how it can change yours too. With three hit shows on television and three children at home, Shonda Rhimes had lots of good reasons to say no when invitations arrived. Hollywood party? No. Speaking engagement? No. Media appearances? No. And to an introvert like Shonda, who describes herself as 'hugging the walls' at social events and experiencing panic attacks before press interviews, there was a particular benefit to saying no: nothing new to fear. Then came Thanksgiving 2013, when Shonda's sister Delorse muttered six little words at her: You never say yes to anything. Profound, impassioned and laugh-out-loud funny, in Year of Yes Shonda Rhimes reveals how saying YES changed - and saved - her life. And inspires readers everywhere to change their own lives with one little word: Yes."], "author": "Shonda Rhimes", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-20 00:00:00", "ISBN": "1471157326"},
{"url": "https://www.goodreads.com/book/show/91437.Four_Souls", "num_ratings": "3,139", "num_reviews": "294", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Literary Fiction", "Novels"], "title": "Four Souls", "description": ["This small but incredibly rich chapter in Erdrich's ongoing Native American saga is a continuation of the story of the enigmatic Fleur Pillager, begun in ", " (1988).", " begins with Fleur Pillager's journey from North Dakota to Minneapolis, where she plans to avenge the loss of her family's land to a white man. After a dream vision that gives her a powerful new na", "This small but incredibly rich chapter in Erdrich's ongoing Native American saga is a continuation of the story of the enigmatic Fleur Pillager, begun in ", " (1988).", " begins with Fleur Pillager's journey from North Dakota to Minneapolis, where she plans to avenge the loss of her family's land to a white man. After a dream vision that gives her a powerful new name, Four Souls, she enters the household of John James Mauser. A man notorious for his wealth and his mansion on a hill, Mauser became rich by deceiving young Indian women and taking possession of their ancestral lands. What promises to be a straightforward tale of revenge, however, slowly metamorphoses into a more complex evocation of human nature. The story of anger and retribution that begins in ", " becomes a story of healing and love in ", "."], "author": "Louise Erdrich", "num_pages": "210", "awards": ["WILLA Literary Award Nominee for Historical Fiction (Finalist) (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-29 00:00:00", "ISBN": "0060935227"},
{"url": "https://www.goodreads.com/book/show/195326.The_Bingo_Palace", "num_ratings": "3,952", "num_reviews": "152", "avg_ratings": 3.87, "genres": ["Fiction", "Novels", "Literature"], "title": "The Bingo Palace", "description": ["At a crossroads in his life, Lipsha Morrissey is summoned by his grandmother to return to the reservation. There, he falls in love for the very first time--with the beautiful Shawnee Ray, who's already considering a marriage proposal from Lipsha's wealthy entrepreneurial boss, Lyman Lamartine. But when all efforts to win Shwawnee's affections go hopelessly awry, Lipsha see", "At a crossroads in his life, Lipsha Morrissey is summoned by his grandmother to return to the reservation. There, he falls in love for the very first time--with the beautiful Shawnee Ray, who's already considering a marriage proposal from Lipsha's wealthy entrepreneurial boss, Lyman Lamartine. But when all efforts to win Shwawnee's affections go hopelessly awry, Lipsha seeks out his great-grandmother for a magical solution to his romantic dilemma--on sacred ground where a federally sanctioned bingo palace is slated for construction.", "Louise Erdrich's luminous novel ", " is a tale of spiritual death and reawakening; of money, desperate love, and wild hope; and of the enduring power of cherished dreams. (Harper Perennial)"], "author": "Louise Erdrich", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-13 00:00:00", "ISBN": "0061129755"},
{"url": "https://www.goodreads.com/book/show/23209971-girl-at-war", "num_ratings": "19,311", "num_reviews": "2,322", "avg_ratings": 3.99, "genres": ["Historical", "Historical Fiction", "Fiction", "War", "Historical"], "title": "Girl at War", "description": ["Zagreb, summer of 1991. Ten-year-old Ana Jurić is a carefree tomboy who runs the streets of Croatia's capital with her best friend, Luka, takes care of her baby sister, Rahela, and idolizes her father. But as civil war breaks out across Yugoslavia, soccer games and school lessons are supplanted by sniper fire and air raid drills. When tragedy suddenly strikes, Ana is lost", "Zagreb, summer of 1991. Ten-year-old Ana Jurić is a carefree tomboy who runs the streets of Croatia's capital with her best friend, Luka, takes care of her baby sister, Rahela, and idolizes her father. But as civil war breaks out across Yugoslavia, soccer games and school lessons are supplanted by sniper fire and air raid drills. When tragedy suddenly strikes, Ana is lost to a world of guerilla warfare and child soldiers; a daring escape plan to America becomes her only chance for survival.", "Ten years later Ana is a college student in New York. She's been hiding her past from her boyfriend, her friends, and most especially herself. Haunted by the events that forever changed her family, she returns alone to Croatia, where she must rediscover the place that was once her home and search for the ghosts of those she's lost."], "author": "Sara Nović", "num_pages": "320", "awards": ["ALA Alex Award (2016)", "Women's Prize for Fiction Nominee for Longlist (2016)", "The Center for Fiction First Novel Prize Nominee for Longlist (2015)", "Goodreads Choice Award Nominee for Fiction, and for Goodreads Debut Author (2015)"], "places": ["Croatia", "New York City, New York", "Pennsylvania"], "character_names": ["Ana Jurić"], "language": "English", "publish_date": "2015-05-12 00:00:00", "ISBN": "0812996348"},
{"url": "https://www.goodreads.com/book/show/7603.Reading_Lolita_in_Tehran", "num_ratings": "104,156", "num_reviews": "6,975", "avg_ratings": 3.59, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Reading Lolita in Tehran: A Memoir in Books", "author": "Azar Nafisi", "num_pages": "356", "awards": ["Book Sense Book of the Year Award for Adult Nonfiction (2004)", "Prix du Meilleur Livre Étranger for Essai (2004)"], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Azar Nafisi"], "language": "English", "publish_date": "2003-12-30 00:00:00", "ISBN": "081297106X"},
{"url": "https://www.goodreads.com/book/show/159666.The_Birchbark_House", "num_ratings": "5,104", "num_reviews": "784", "avg_ratings": 3.94, "genres": ["Historical", "Historical Fiction", "Fiction", "Childrens", "Childrens", "Middle Grade", "Historical", "Young Adult"], "title": "The Birchbark House", "description": ["Nineteenth-century American pioneer life was introduced to thousands of young readers by Laura Ingalls Wilder's beloved Little House books. With ", ", award-winning author Louise Erdrich's first novel for young readers, this same slice of history is seen through the eyes of the spirited, 7-year-old Ojibwa girl Omakayas, or Little Frog, so named because her f", "Nineteenth-century American pioneer life was introduced to thousands of young readers by Laura Ingalls Wilder's beloved Little House books. With ", ", award-winning author Louise Erdrich's first novel for young readers, this same slice of history is seen through the eyes of the spirited, 7-year-old Ojibwa girl Omakayas, or Little Frog, so named because her first step was a hop. The sole survivor of a smallpox epidemic on Spirit Island, Omakayas, then only a baby girl, was rescued by a fearless woman named Tallow and welcomed into an Ojibwa family on Lake Superior's Madeline Island, the Island of the Golden-Breasted Woodpecker. We follow Omakayas and her adopted family through a cycle of four seasons in 1847, including the winter, when a historically documented outbreak of smallpox overtook the island. ", "Readers will be riveted by the daily life of this Native American family, in which tanning moose hides, picking berries, and scaring crows from the cornfield are as commonplace as encounters with bear cubs and fireside ghost stories. Erdrich--a member of the Turtle Mountain Band of Ojibwa--spoke to Ojibwa elders about the spirit and significance of Madeline Island, read letters from travelers, and even spent time with her own children on the island, observing their reactions to woods, stones, crayfish, bear, and deer. The author's softly hewn pencil drawings infuse life and authenticity to her poetic, exquisitely wrought narrative. Omakayas is an intense, strong, likable character to whom young readers will fully relate--from her mixed emotions about her siblings, to her discovery of her unique talents, to her devotion to her pet crow Andeg, to her budding understanding of death, life, and her role in the natural world. We look forward to reading more about this brave, intuitive girl--and wholeheartedly welcome Erdrich's future series to the canon of children's classics. (Ages 9 and older) --Karin Snelson"], "author": "Louise Erdrich", "num_pages": "244", "awards": ["Jane Addams Children's Book Award Nominee for Older Children (2000)", "Dorothy Canfield Fisher Children's Book Award Nominee (2001)", "American Indian Youth Literature Award for Best Middle School Book (2006)", "Chapman Award for Shared Reading Nominee for Fiction (2000)", "National Book Award Finalist for Young People's Literature (1999)", "National Cowboy Hall of Fame Western Heritage Award for Juvenile Book (2000)"], "places": [], "character_names": ["Omakayas"], "language": "English", "publish_date": "2002-05-13 00:00:00", "ISBN": "0786814543"},
{"url": "https://www.goodreads.com/book/show/10335308-is-everyone-hanging-out-without-me", "num_ratings": "351,067", "num_reviews": "20,468", "avg_ratings": 3.85, "genres": ["Nonfiction", "Humor", "Autobiography", "Memoir", "Biography"], "title": "Is Everyone Hanging Out Without Me? (And Other Concerns)", "description": ["Mindy Kaling has lived many lives: the obedient child of immigrant professionals, a timid chubster afraid of her own bike, a Ben Affleck–impersonating Off-Broadway performer and playwright, and, finally, a comedy writer and actress prone to starting fights with her friends and coworkers with the sentence “Can I just say one last thing about this, and then I swear I’ll shut", "Mindy Kaling has lived many lives: the obedient child of immigrant professionals, a timid chubster afraid of her own bike, a Ben Affleck–impersonating Off-Broadway performer and playwright, and, finally, a comedy writer and actress prone to starting fights with her friends and coworkers with the sentence “Can I just say one last thing about this, and then I swear I’ll shut up about it?” ", " ", "Perhaps you want to know what Mindy thinks makes a great best friend (someone who will fill your prescription in the middle of the night), or what makes a great guy (one who is aware of all elderly people in any room at any time and acts accordingly), or what is the perfect amount of fame (so famous you can never get convicted of murder in a court of law), or how to maintain a trim figure (you will not find that information in these pages). If so, you’ve come to the right book, mostly!", " ", "In ", "Mindy invites readers on a tour of her life and her unscientific observations on romance, friendship, and Hollywood, with several conveniently placed stopping points for you to run errands and make phone calls. Mindy Kaling really is just a Girl Next Door—not so much literally anywhere in the continental United States, but definitely if you live in India or Sri Lanka."], "author": "Mindy Kaling", "num_pages": "222", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-11-01 00:00:00", "ISBN": "0307886263"},
{"url": "https://www.goodreads.com/book/show/16280._Why_Are_All_The_Black_Kids_Sitting_Together_in_the_Cafeteria_", "num_ratings": "8,830", "num_reviews": "636", "avg_ratings": 4.15, "genres": ["Nonfiction", "Education", "Race", "Psychology", "Sociology", "Social Movements", "Social Justice", "Teaching"], "title": "\"Why Are All The Black Kids Sitting Together in the Cafeteria?\": A Psychologist Explains the Development of Racial Identity", "description": [" Walk into any racially mixed high school and you will see Black, White, and Latino youth clustered in their own groups. Is this self-segregation a problem to address or a coping strategy? Beverly Daniel Tatum, a renowned authority on the psychology of racism, argues that straight talk", " Walk into any racially mixed high school and you will see Black, White, and Latino youth clustered in their own groups. Is this self-segregation a problem to address or a coping strategy? Beverly Daniel Tatum, a renowned authority on the psychology of racism, argues that straight talk about our racial identities is essential if we are serious about enabling communication across racial and ethnic divides. These topics have only become more urgent as the national conversation about race is increasingly acrimonious. This fully revised edition is essential reading for anyone seeking to understand the dynamics of race in America."], "author": "Beverly Daniel Tatum", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-01-17 00:00:00", "ISBN": "0465083617"},
{"url": "https://www.goodreads.com/book/show/7362158-girl-in-translation", "num_ratings": "40,337", "num_reviews": "5,034", "avg_ratings": 3.97, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Contemporary", "Cultural", "China", "Adult Fiction"], "title": "Girl in Translation", "description": ["When Kimberly Chang and her mother emigrate from Hong Kong to Brooklyn squalor, she quickly begins a secret double life: exceptional schoolgirl during the day, Chinatown sweatshop worker in the evenings. Disguising the more di", "When Kimberly Chang and her mother emigrate from Hong Kong to Brooklyn squalor, she quickly begins a secret double life: exceptional schoolgirl during the day, Chinatown sweatshop worker in the evenings. Disguising the more difficult truths of her life like the staggering degree of her poverty, the weight of her family’s future resting on her shoulders, or her secret love for a factory boy who shares none of her talent or ambition. Kimberly learns to constantly translate not just her language but herself back and forth between the worlds she straddles.", "Through Kimberly’s story, author Jean Kwok, who also emigrated from Hong Kong as a young girl, brings to the page the lives of countless immigrants who are caught between the pressure to succeed in America, their duty to their family, and their own personal desires, exposing a world that we rarely hear about. ", "Written in an indelible voice that dramatizes the tensions of an immigrant girl growing up between two cultures, surrounded by a language and world only half understood, ", " is an unforgettable and classic novel of an American immigrant-a moving tale of hardship and triumph, heartbreak and love, and all that gets lost in translation."], "author": "Jean Kwok", "num_pages": "290", "awards": ["ALA Alex Award (2011)", "Lincoln Award Nominee (2016)", "Suburban Mosaic Book of the Year (2011)", "Chinese Library Association Best Book (2010)", "John Gardner Book Award Nominee for Fiction (2011)", "Goodreads Choice Award Nominee for Fiction, Debut Author (2010)"], "places": ["Brooklyn, New York City, New York"], "character_names": ["Kimberly Chang", "Aunt Paula", "Uncle Bob", "Matt Wu", "Annette Avery", "Curt"], "language": "English", "publish_date": "2010-04-29 00:00:00", "ISBN": "1594487561"},
{"url": "https://www.goodreads.com/book/show/1544801.The_African_American_Heritage_Cookbook", "num_ratings": "33", "num_reviews": "2", "avg_ratings": 4.3, "genres": ["Food and Drink", "Cookbooks", "Food and Drink", "Cooking", "Food and Drink", "Food"], "title": "The African American Heritage Cookbook: Traditional Recipes and Fond Remembrances from Alabama's Renowned Tuskegee Institute", "description": ["Captures not only the traditional tastes, but also the emotions of Tuskegee, the historic black university founded by former slave Booker T. Washington."], "author": "Carolyn Quick Tillery", "num_pages": "210", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-01-01 00:00:00", "ISBN": "1559723254"},
{"url": "https://www.goodreads.com/book/show/15925032-the-taming-of-women", "num_ratings": "29", "num_reviews": "3", "avg_ratings": 3.59, "genres": ["Fiction", "Literary Fiction"], "title": "The Taming of Women", "description": ["As Anandhayi gives birth to her fifth child downstairs, with only her ancient mother-in-law for help, upstairs her husband Periyannan sleeps with a woman he has summoned to spend the night with him. Women of many generations live in that house at the end of the road, with the tyrannical and charismatic Periyannan always trying to bring them under his control. Voracious in", "As Anandhayi gives birth to her fifth child downstairs, with only her ancient mother-in-law for help, upstairs her husband Periyannan sleeps with a woman he has summoned to spend the night with him. Women of many generations live in that house at the end of the road, with the tyrannical and charismatic Periyannan always trying to bring them under his control. Voracious in his appetites, for both power and sex, Periyannan is a domineering antagonist to the tender but tenacious Anandhayi.", "In her most celebrated novel, Sivakami vividly evokes a world where women and men are in constant conflict, scrambling for the little power to which they can hold on. It is her superb satiric eye—capturing in comic vignettes of exquisite detail the life of women in a village transforming into a small town—that brings relief to this bleak, blistering vision of humanity, leaving the reader simultaneously amused and devastated."], "author": "P. Sivakami", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-17 00:00:00", "ISBN": "0143104101"},
{"url": "https://www.goodreads.com/book/show/6673172-shadow-tag", "num_ratings": "5,985", "num_reviews": "1,323", "avg_ratings": 3.38, "genres": ["Fiction", "Literary Fiction", "Contemporary", "Novels"], "title": "Shadow Tag", "description": ["“Erdrich is a true original… [and] one of our major writers.” —", ", the brilliant new novel by Louise Erdrich, is a stunning tour-de-force from the National Book Critics Circle Award–winning and ", "–bestselling author of ", " and Pulitzer-Prize-finalist ", ". In the vein of the novels of such contemporarie", "“Erdrich is a true original… [and] one of our major writers.” —", ", the brilliant new novel by Louise Erdrich, is a stunning tour-de-force from the National Book Critics Circle Award–winning and ", "–bestselling author of ", " and Pulitzer-Prize-finalist ", ". In the vein of the novels of such contemporaries as Zoe Heller and Susan Minot, ", " is an intense and heart-wrenching story of a troubled marriage and a family in disarray—and a radical departure from Erdrich’s previous acclaimed work."], "author": "Louise Erdrich", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-02-02 00:00:00", "ISBN": "0061536091"},
{"url": "https://www.goodreads.com/book/show/22521951-written-in-the-stars", "num_ratings": "4,664", "num_reviews": "1,054", "avg_ratings": 3.96, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction", "Realistic Fiction"], "title": "Written in the Stars", "description": ["This heart-wrenching novel explores what it is like to be thrust into an unwanted marriage. Has Naila’s fate been written in the stars? Or can she still make her own destiny?", " ", "Naila’s conservative immigrant parents have always said the same thing: She may choose what to study, how to wear her hair, and what to be when she grows up—but they will choose her husband. Following", "This heart-wrenching novel explores what it is like to be thrust into an unwanted marriage. Has Naila’s fate been written in the stars? Or can she still make her own destiny?", " ", "Naila’s conservative immigrant parents have always said the same thing: She may choose what to study, how to wear her hair, and what to be when she grows up—but they will choose her husband. Following their cultural tradition, they will plan an arranged marriage for her. And until then, dating—even friendship with a boy—is forbidden. When Naila breaks their rule by falling in love with Saif, her parents are livid. Convinced she has forgotten who she truly is, they travel to Pakistan to visit relatives and explore their roots. But Naila’s vacation turns into a nightmare when she learns that plans have changed—her parents have found her a husband and they want her to marry him, now! Despite her greatest efforts, Naila is aghast to find herself cut off from everything and everyone she once knew. Her only hope of escape is Saif . . . if he can find her before it’s too late."], "author": "Aisha Saeed", "num_pages": "277", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-24 00:00:00", "ISBN": "0399171703"},
{"url": "https://www.goodreads.com/book/show/23468051-culturally-responsive-teaching-and-the-brain", "num_ratings": "425", "num_reviews": "54", "avg_ratings": 4.31, "genres": ["Education", "Teaching", "Nonfiction"], "title": "Culturally Responsive Teaching and the Brain: Promoting Authentic Engagement and Rigor Among Culturally and Linguistically Diverse Students", "description": [" ", " ", " To close the achievement gap, diverse classrooms need a proven framework for optimizing student engagement. Culturally responsive instruction has shown promise, but many teachers have struggled with its implementation--until now. In this book, Zaretta Hammond draws on cutting-edge neuroscience r", " ", " ", " To close the achievement gap, diverse classrooms need a proven framework for optimizing student engagement. Culturally responsive instruction has shown promise, but many teachers have struggled with its implementation--until now. In this book, Zaretta Hammond draws on cutting-edge neuroscience research to offer an innovative approach for designing and implementing brain-compatible culturally responsive instruction. The book includes: Information on how one's culture programs the brain to process data and affects learning relationships Ten \"key moves\" to build students' learner operating systems and prepare them to become independent learners Prompts for action and valuable self-reflection"], "author": "Zaretta Lynn Hammond", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-12-01 00:00:00", "ISBN": "1483308014"},
{"url": "https://www.goodreads.com/book/show/9209763-sangati", "num_ratings": "64", "num_reviews": "2", "avg_ratings": 3.58, "genres": ["Biography", "Autobiography", "Nonfiction", "Feminism"], "title": "Sangati: Events", "description": ["Sangati is a startling insight into the lives of Dalit women who face the double disadvantage of caste and gender discrimination. Written in a colloquial style, the original Tamil version overturns the decorum and aesthetics of upper-caste, upper-class Tamil literature and culture and, in turn, projects a positive cultural identity for Dalits in general and for Dalit women", "Sangati is a startling insight into the lives of Dalit women who face the double disadvantage of caste and gender discrimination. Written in a colloquial style, the original Tamil version overturns the decorum and aesthetics of upper-caste, upper-class Tamil literature and culture and, in turn, projects a positive cultural identity for Dalits in general and for Dalit women in particular. ", "Sangati flouts received notions about what a novel should be and has no plot in the normal sense. It relates the mindscape of a Dalit woman who steps out of her small town community, only to enter a caste-ridden and hierarchical society, which constantly questions her caste status. Realizing that leaving her community is no escape, she has to come to terms with her identity as an educated, economically independent woman who chooses to live alone. In relating this tale, Bama turns Sangati into the story not just of one individual, but of a pariah community."], "author": "Bama", "num_pages": "126", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-04-01 00:00:00", "ISBN": "0195698436"},
{"url": "https://www.goodreads.com/book/show/13320466-the-twelve-tribes-of-hattie", "num_ratings": "33,016", "num_reviews": "4,884", "avg_ratings": 3.47, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Historical", "Audiobook"], "title": "The Twelve Tribes of Hattie", "description": ["A debut of extraordinary distinction: Ayana Mathis tells the story of the children of the Great Migration through the trials of one unforgettable family. ", " In 1923, fifteen-year-old Hattie Shepherd flees Georgia and settles in Philadelphia, hoping for a chance at a better life. Instead, she marries a man who will bring her nothing but disappointment and watches helplessly a", "A debut of extraordinary distinction: Ayana Mathis tells the story of the children of the Great Migration through the trials of one unforgettable family. ", " In 1923, fifteen-year-old Hattie Shepherd flees Georgia and settles in Philadelphia, hoping for a chance at a better life. Instead, she marries a man who will bring her nothing but disappointment and watches helplessly as her firstborn twins succumb to an illness a few pennies could have prevented.  Hattie gives birth to nine more children whom she raises with grit and mettle and not an ounce of the tenderness they crave.  She vows to prepare them for the calamitous difficulty they are sure to face in their later lives, to meet a world that will not love them, a world that will not be kind. Captured here in twelve luminous narrative threads, their lives tell the story of a mother’s monumental courage and the journey of a nation. ", " Beautiful and devastating, Ayana Mathis’s ", " is wondrous from first to last—glorious, harrowing, unexpectedly uplifting, and blazing with life. An emotionally transfixing page-turner, a searing portrait of striving in the face of insurmountable adversity, an indelible encounter with the resilience of the human spirit and the driving force of the American dream, Mathis’s first novel heralds the arrival of a major new voice in contemporary fiction. "], "author": "Ayana Mathis", "num_pages": "243", "awards": ["Black Caucus of the American Library Association Literary Award for 1st Novelist (2013)", "Hurston/Wright Legacy Award Nominee for Fiction (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-06 00:00:00", "ISBN": "0385350287"},
{"url": "https://www.goodreads.com/book/show/11208.How_the_Garc_a_Girls_Lost_Their_Accents", "num_ratings": "20,396", "num_reviews": "1,401", "avg_ratings": 3.63, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult"], "title": "How the García Girls Lost Their Accents", "description": ["Uprooted from their family home in the Dominican Republic, the four Garcia sisters - Carla, Sandra, Yolanda, and Sofia - arrive in New York City in 1960 to find a life far different from the genteel existence of maids, manicures, and extended family they left behind. What they have lost - and what they find - is revealed in the fifteen interconnected stories that make up t", "Uprooted from their family home in the Dominican Republic, the four Garcia sisters - Carla, Sandra, Yolanda, and Sofia - arrive in New York City in 1960 to find a life far different from the genteel existence of maids, manicures, and extended family they left behind. What they have lost - and what they find - is revealed in the fifteen interconnected stories that make up this exquisite novel from one of the premier novelists of our time."], "author": "Julia Alvarez", "num_pages": "304", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2005-10-04 00:00:00", "ISBN": "0452287073"},
{"url": "https://www.goodreads.com/book/show/13598379-father-may-be-an-elephant-and-mother-only-a-small-basket-but", "num_ratings": "19", "num_reviews": "1", "avg_ratings": 3.79, "genres": ["Fiction", "Short Stories", "Cultural", "India"], "title": "Father May Be an Elephant and Mother Only a Small Basket, But...", "description": ["Gogu Shyamala’s stories dissolve borders as they work their magic on orthodox forms of realism, psychic allegory and political fable. Whether she is describing the setting sun or the way people are gathered at a village council like ‘thickly strewn grain on the threshing floor’, the varied rhythms of a dalit drum or a young woman astride her favorite buffalo, Shyamala walk", "Gogu Shyamala’s stories dissolve borders as they work their magic on orthodox forms of realism, psychic allegory and political fable. Whether she is describing the setting sun or the way people are gathered at a village council like ‘thickly strewn grain on the threshing floor’, the varied rhythms of a dalit drum or a young woman astride her favorite buffalo, Shyamala walks us through a world that is at once particular and small, and simultaneously universal.", "Set in the madiga quarter of a Telangana village, the stories spotlight different settings, events and experiences, and offer new propositions on how to see, think and be touched by life in that world. There is a laugh lurking around every other corner as the narrative picks an adroit step past the grandiose authority of earlier versions of such places and their people—romantic, gandhian, administrative—and the idiom in which they spoke. These stories overturn the usual agendas of exit—from the village, from madiga culture, from these little communities—to hold this life up as one of promise for everyone.", "With her intensely beautiful and sharply political writing, Shyamala makes a clean break with the tales of oppression and misery decreed the true subject of dalit writing."], "author": "Gogu Shyamala", "num_pages": "263", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-06 00:00:00", "ISBN": "8189059513"},
{"url": "https://www.goodreads.com/book/show/129136.A_River_Sutra", "num_ratings": "1,928", "num_reviews": "151", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "India", "Asian Literature", "Indian Literature", "Short Stories", "Literature", "Cultural", "Asia"], "title": "A River Sutra", "description": ["With imaginative lushness and narrative elan, Mehta provides a novel that combines Indian storytelling with thoroughly modern perceptions into the nature of love--love both carnal and sublime, treacherous and redeeming. \"Conveys a world that is spiritual, foreign, and entirely accessible.\"--Vanity Fair. Reading tour."], "author": "Gita Mehta", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-06-28 00:00:00", "ISBN": "0679752471"},
{"url": "https://www.goodreads.com/book/show/126381.Purple_Hibiscus", "num_ratings": "44,044", "num_reviews": "4,215", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her bro", "Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her brother away to stay with their aunt, a University professor, whose house is noisy and full of laughter. There, Kambili and her brother discover a life and love beyond the confines of their father’s authority. The visit will lift the silence from their world and, in time, give rise to devotion and defiance that reveal themselves in profound and unexpected ways. ", "This is a book about the promise of freedom; about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new."], "author": "Chimamanda Ngozi Adichie", "num_pages": "307", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2005-08-12 00:00:00", "ISBN": "0007189885"},
{"url": "https://www.goodreads.com/book/show/20432382-the-gypsy-goddess", "num_ratings": "193", "num_reviews": "43", "avg_ratings": 3.82, "genres": ["Cultural", "India", "Fiction", "Asian Literature", "Indian Literature", "Literary Fiction"], "title": "The Gypsy Goddess", "description": ["Tamil Nadu, 1968. Landlords rule over a feudal system that forces peasants to break their backs in the fields or be punished. As a small spark of defiance begins to spread among communities, the landlords vow to break them; party organizers suffer grisly deaths and the flow of food into the marketplaces dries up. But it only strengthens the villagers' resistance. Finally,", "Tamil Nadu, 1968. Landlords rule over a feudal system that forces peasants to break their backs in the fields or be punished. As a small spark of defiance begins to spread among communities, the landlords vow to break them; party organizers suffer grisly deaths and the flow of food into the marketplaces dries up. But it only strengthens the villagers' resistance. Finally, the landlords descend on one village to set an example for the others. An exciting new release from this Chennai-based poet, writer and activist."], "author": "Meena Kandasamy", "num_pages": "283", "awards": ["Dylan Thomas Prize Nominee for Longlist (2014)", "Tata Literature Live! First Book Award Nominee for Fiction (2014)", "DSC Prize Nominee for South Asian Literature  for Longlist (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2521458.The_Sandal_Trees_And_Other_Stories", "num_ratings": "53", "num_reviews": "3", "avg_ratings": 3.79, "genres": ["Fiction", "Short Stories"], "title": "The Sandal Trees And Other Stories", "description": ["This is the first collection of translations in English of stories originally written in Malayalam by Kamala Das under the pen name Madhavikutty. They amply demonstrate Kamala Das's special contribution to the short story in Malayalam. All the major attributes of her writing are evident: her subtlety and power in dealing with human relationships and intrigues of love, life", "This is the first collection of translations in English of stories originally written in Malayalam by Kamala Das under the pen name Madhavikutty. They amply demonstrate Kamala Das's special contribution to the short story in Malayalam. All the major attributes of her writing are evident: her subtlety and power in dealing with human relationships and intrigues of love, life and death and her earthiness, sensuousness and sensuality."], "author": "Kamala Suraiyya Das", "num_pages": "142", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-08-12 00:00:00", "ISBN": "8125002634"},
{"url": "https://www.goodreads.com/book/show/2227528.The_Plague_of_Doves", "num_ratings": "11,437", "num_reviews": "1,708", "avg_ratings": 3.76, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Novels"], "title": "The Plague of Doves", "author": "Louise Erdrich", "num_pages": "313", "awards": ["Pulitzer Prize Nominee for Fiction (2009)", "Anisfield-Wolf Book Award (2009)", "Dayton Literary Peace Prize Nominee for Fiction (2009)", "Minnesota Book Award for Novel & Short Story (2009)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2008-04-29 00:00:00", "ISBN": "0060515120"},
{"url": "https://www.goodreads.com/book/show/588234.Ceremony", "num_ratings": "14,947", "num_reviews": "1,122", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Academic", "School"], "title": "Ceremony", "description": ["Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind o", "Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind of comfort and resolution. Tayo's quest leads him back to the Indian past and its traditions, to beliefs about witchcraft and evil, and to the ancient stories of his people. The search itself becomes a ritual, a curative ceremony that defeats the most virulent of afflictions—despair."], "author": "Leslie Marmon Silko", "num_pages": "262", "awards": ["American Book Award (1980)"], "places": [], "character_names": [], "language": "English", "publish_date": "1986-03-04 00:00:00", "ISBN": "0140086838"},
{"url": "https://www.goodreads.com/book/show/18108179-motherwit", "num_ratings": "12", "num_reviews": "3", "avg_ratings": 4.17, "genres": ["Short Stories"], "title": "Motherwit", "description": ["A Dalit, a Buddhist and a feminist: Urmila Pawar’s self-definition as all three identities informs her stories about women who are brave in the face of caste oppression, strong in the face of family pressures, defiant when at the receiving end of insult, and determined when guarding their interests and those of their sisters.", "Using the classic short story form with its surp", "A Dalit, a Buddhist and a feminist: Urmila Pawar’s self-definition as all three identities informs her stories about women who are brave in the face of caste oppression, strong in the face of family pressures, defiant when at the receiving end of insult, and determined when guarding their interests and those of their sisters.", "Using the classic short story form with its surprise endings to great effect, Pawar brings to life strong and clever women who drive the reader to laughter, anger, tears or despair. Her harsh, sometimes vulgar and hard-hitting language subverts another stereotype—that of the soft-spoken woman writer.", "Pawar’s protagonists may not always be Dalit, and the mood not always one of anger, but caste is never far from the context and informs the subtext of each story. As critic Eleanor Zelliot notes, there is ‘tucked in every story, a note about a Buddhist vihara or Dr Ambedkar.... All her stories come from the Dalit world, revealing the great variety of Dalit life now.’"], "author": "Urmila Pawar", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-12 00:00:00", "ISBN": "938101762X"},
{"url": "https://www.goodreads.com/book/show/15852479-we-need-new-names", "num_ratings": "14,809", "num_reviews": "2,008", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "We Need New Names", "description": ["An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by", "An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by paramilitary policemen, before the school closed, before the fathers left for dangerous jobs abroad.", "But Darling has a chance to escape: she has an aunt in America. She travels to this new land in search of America's famous abundance only to find that her options as an immigrant are perilously few. NoViolet Bulawayo's debut calls to mind the great storytellers of displacement and arrival who have come before her--from Junot Diaz to Zadie Smith to J.M. Coetzee--while she tells a vivid, raw story all her own."], "author": "NoViolet Bulawayo", "num_pages": "298", "awards": ["Man Booker Prize Nominee (2013)", "Guardian First Book Award Nominee (2013)", "PEN/Hemingway Foundation Award (2014)", "Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee (2015)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)", "Betty Trask Award (2014)"], "places": ["Tsholotsho", "Detroit, Michigan", "bulawayo"], "character_names": [], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "0316230812"},
{"url": "https://www.goodreads.com/book/show/91440.Love_Medicine", "num_ratings": "18,495", "num_reviews": "1,265", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Short Stories", "Novels"], "title": "Love Medicine", "description": ["The first book in Louise Erdrich's highly acclaimed \"Native American\" trilogy that includes \"The Beet Queen,\" \"Tracks,\" and \"The Bingo Palace,\" re-sequenced and expanded to include never-before-published chapters.", "\"A dazzling series of family portraits.... This novel is simply about the power of love.\" --"], "author": "Louise Erdrich", "num_pages": "367", "awards": ["American Book Award (1985)", "Los Angeles Times Book Prize for Fiction (1985)", "Sue Kaufman Prize for First Fiction (1985)", "Great Lakes Colleges Association New Writers Award for Fiction (1985)", "National Book Critics Circle Award for Fiction (1984)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "0060786469"},
{"url": "https://www.goodreads.com/book/show/20907222-a-man-is-just-a-man", "num_ratings": "59", "num_reviews": "33", "avg_ratings": 4.25, "genres": ["Womens Fiction", "Chick Lit", "Romance", "Love"], "title": "A Man Is Just A Man (A Loving Nate Novella)", "description": ["A Man Is Just A Man is Leah's story of falling in love with Mr. Perfect. Leah falls fast and hard, losing all sense of reasoning. Love can do that to a gal, especially when the guy is as smooth as Nathan Moore. A Man Is Just A Man is about Leah's journey of falling in love, when she should have been standing in love. ", "⭐⭐A", "A Man Is Just A Man is Leah's story of falling in love with Mr. Perfect. Leah falls fast and hard, losing all sense of reasoning. Love can do that to a gal, especially when the guy is as smooth as Nathan Moore. A Man Is Just A Man is about Leah's journey of falling in love, when she should have been standing in love. ", "⭐️⭐️Author’s Note⭐️⭐️ ", "I’ve decided to provide two very different endings to this novella. Have you ever made a decision and wondered whether or not it was the right choice? Or perhaps you made the right choice because you knew that the alternative would’ve been disastrous? This is my gift to readers. Regardless of Leah’s final choice, I wanted readers to be able to reflect on the possibilities."], "author": "Janice  Ross", "num_pages": "158", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1658569.The_Grip_of_Change", "num_ratings": "33", "num_reviews": "2", "avg_ratings": 3.79, "genres": ["Asian Literature", "Indian Literature", "Feminism", "Classics", "Biography"], "title": "The Grip of Change", "description": ["The Grip of Change is the English translation of Pazhaiyana Kazhithalum, the first full-length novel by P. Sivakami, an important Tamil writer. This translation also features Asiriyar Kurippu, the sequel in which Sivakami revisits her work. The protagonist of Book 1, Kathamuthu, is a charismatic Parayar leader. He intervenes on behalf of a Parayar woman, Thangam, beaten up", "The Grip of Change is the English translation of Pazhaiyana Kazhithalum, the first full-length novel by P. Sivakami, an important Tamil writer. This translation also features Asiriyar Kurippu, the sequel in which Sivakami revisits her work. The protagonist of Book 1, Kathamuthu, is a charismatic Parayar leader. He intervenes on behalf of a Parayar woman, Thangam, beaten up by the relatives of her upper caste lover. Kathamuthu works the state machinery and the village caste hierarchy to achieve some sort of justice for Thangam. The first Tamil novel by a Dalit woman, Pazhaiyana Kazhithalum, went beyond condemning caste fanatics. Sivakami is critical of the Dalit movement and Dalit patriarchy, and yet does not become a ‘caste traitor’ because of her participation in the search for solutions. The novel became an expression of Dalit youth—eager and working for change. In Book 2, Author’s Note, Kathamuthu’s daughter Gowri, the author of Book 1, traces the circumstances and events of her novel. The result is a fascinating exploration of the disjunctures between what happens in the author’s family and community, and her fictional interpretations of those happenings. The Series: The books in the Literature in Translation series are translations of significant literature from Indian languages. The books in the Dalit Studies series deal with Dalit life and thought."], "author": "P. Sivakami", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2006-08-12 00:00:00", "ISBN": "8125030204"},
{"url": "https://www.goodreads.com/book/show/1103.Snow_Flower_and_the_Secret_Fan", "num_ratings": "310,184", "num_reviews": "16,526", "avg_ratings": 4.06, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "China", "Historical", "Cultural", "Asia", "Book Club", "Adult", "Adult Fiction", "Literature", "Asian Literature", "Novels"], "title": "Snow Flower and the Secret Fan", "description": ["In nineteenth-century China, in a remote Hunan county, a girl named Lily, at the tender age of seven, is paired with a laotong, “old same,” in an emotional match that will last a lifetime. The laotong, Snow Flower, introduces herself by sending Lily a silk fan on which she’s painted a poem in nu shu, a unique language that Chinese women created in order to communicate in s", "In nineteenth-century China, in a remote Hunan county, a girl named Lily, at the tender age of seven, is paired with a laotong, “old same,” in an emotional match that will last a lifetime. The laotong, Snow Flower, introduces herself by sending Lily a silk fan on which she’s painted a poem in nu shu, a unique language that Chinese women created in order to communicate in secret, away from the influence of men.", "As the years pass, Lily and Snow Flower send messages on fans, compose stories on handkerchiefs, reaching out of isolation to share their hopes, dreams, and accomplishments. Together, they endure the agony of foot-binding, and reflect upon their arranged marriages, shared loneliness, and the joys and tragedies of motherhood. The two find solace, developing a bond that keeps their spirits alive. But when a misunderstanding arises, their deep friendship suddenly threatens to tear apart."], "author": "Lisa See", "num_pages": "269", "awards": ["California Book Award for Fiction (Silver) (2005)", "Lincoln Award Nominee (2008)", "Asian/Pacific American Award for Literature for Adult Fiction Honor (2005)"], "places": ["Hunan"], "character_names": ["Snowflower", "Lily"], "language": "English", "publish_date": "2006-02-21 00:00:00", "ISBN": "0812968069"},
{"url": "https://www.goodreads.com/book/show/21481566-the-inheritance-trilogy", "num_ratings": "3,243", "num_reviews": "257", "avg_ratings": 4.17, "genres": ["Fantasy", "Fiction", "Fantasy", "High Fantasy"], "title": "The Inheritance Trilogy", "description": ["In this omnibus edition of N.K. Jemisin's brilliantly original award-winning fantasy series, a young woman becomes entangled in a power struggle of mythic proportions.", "A REALM OF GODS AND MORTALS.", "Yeine Darr is an outcast from the barbarian north. But when her mother dies under mysterious circumstances, she is summoned to the majestic city of Sky. There, to her shock, Yeine", "In this omnibus edition of N.K. Jemisin's brilliantly original award-winning fantasy series, a young woman becomes entangled in a power struggle of mythic proportions.", "A REALM OF GODS AND MORTALS.", "Yeine Darr is an outcast from the barbarian north. But when her mother dies under mysterious circumstances, she is summoned to the majestic city of Sky. There, to her shock, Yeine is named an heiress to the king. But the throne of the Hundred Thousand Kingdoms is not easily won, and Yeine is thrust into a vicious power struggle.", "The Inheritance Trilogy omnibus includes the novels: The Hundred Thousand Kingdoms, The Broken Kingdoms, and The Kingdom of Gods."], "author": "N.K. Jemisin", "num_pages": "1442", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-09 00:00:00", "ISBN": "0316334006"},
{"url": "https://www.goodreads.com/book/show/142900.The_Master_Butchers_Singing_Club", "num_ratings": "19,792", "num_reviews": "1,588", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Literary Fiction", "Book Club"], "title": "The Master Butchers Singing Club", "description": ["From National Book Award-winning, ", "-bestselling author Louise Erdrich, a profound and enchanting new novel: a richly imagined world “where butchers sing like angels.”", "Having survived World War I, Fidelis Waldvogel returns to his quiet German village and marries the pregnant widow of his best friend, killed in action. With a suitcase full of sausages and a maste", "From National Book Award-winning, ", "-bestselling author Louise Erdrich, a profound and enchanting new novel: a richly imagined world “where butchers sing like angels.”", "Having survived World War I, Fidelis Waldvogel returns to his quiet German village and marries the pregnant widow of his best friend, killed in action. With a suitcase full of sausages and a master butcher's precious knife set, Fidelis sets out for America. In Argus, North Dakota, he builds a business, a home for his family—which includes Eva and four sons—and a singing club consisting of the best voices in town. When the Old World meets the New—in the person of Delphine Watzka—the great adventure of Fidelis's life begins. Delphine meets Eva and is enchanted. She meets Fidelis, and the ground trembles. These momentous encounters will determine the course of Delphine's life, and the trajectory of this brilliant novel."], "author": "Louise Erdrich", "num_pages": "416", "awards": [], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2016-08-23 00:00:00", "ISBN": "0060837055"},
{"url": "https://www.goodreads.com/book/show/60941.Everyday_Use", "num_ratings": "2,851", "num_reviews": "136", "avg_ratings": 3.88, "genres": ["Short Stories", "Classics", "Fiction", "Academic", "School", "Cultural", "African American", "Academic", "Read For School"], "title": "Everyday Use", "description": ["Alice Walker's early story, \"Everyday Use,\" has remained a cornerstone of her work. Her use of quilting as a metaphor for the creative legacy that African Americans inherited from their maternal ancestors changed the way we define art, women's culture, and African American lives. By putting African American women's voices at the center of the narrative for the first time,", "Alice Walker's early story, \"Everyday Use,\" has remained a cornerstone of her work. Her use of quilting as a metaphor for the creative legacy that African Americans inherited from their maternal ancestors changed the way we define art, women's culture, and African American lives. By putting African American women's voices at the center of the narrative for the first time, \"Everyday Use\" anticipated the focus of an entire generation of black women writers. ", "This casebook includes an introduction by the editor, a chronology of Walker's life, an authoritative text of \"Everyday Use\" and of \"In Search of Our Mothers' Gardens,\" an interview with Walker, six critical essays, and a bibliography. The contributors are Charlotte Pierce-Baker, Houston A. Baker, Jr., Thadious M. Davis, Margot Anne Kelley, John O'Brien, Elaine Showalter, and Mary Helen Washington."], "author": "Alice Walker", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-06-01 00:00:00", "ISBN": "0813520762"},
{"url": "https://www.goodreads.com/book/show/20868283-strange-weather-in-tokyo", "num_ratings": "7,378", "num_reviews": "929", "avg_ratings": 3.75, "genres": ["Cultural", "Japan", "Fiction", "Asian Literature", "Japanese Literature", "Romance", "Contemporary"], "title": "Strange Weather in Tokyo", "description": ["Tsukiko is in her late 30s and living alone when one night she happens to meet one of her former high school teachers, 'Sensei', in a bar. He is at least thirty years her senior, retired and, she presumes, a widower. After this initial encounter, the pair continue to meet occasionally to share food and drink sake, and as the seasons pass - from spring cherry blossom to aut", "Tsukiko is in her late 30s and living alone when one night she happens to meet one of her former high school teachers, 'Sensei', in a bar. He is at least thirty years her senior, retired and, she presumes, a widower. After this initial encounter, the pair continue to meet occasionally to share food and drink sake, and as the seasons pass - from spring cherry blossom to autumnal mushrooms - Tsukiko and Sensei come to develop a hesitant intimacy which tilts awkwardly and poignantly into love.", "Perfectly constructed, funny, and moving, ", " is a tale of modern Japan and old-fashioned romance."], "author": "Hiromi Kawakami", "num_pages": "176", "awards": ["Man Asian Literary Prize Nominee (2012)", "Independent Foreign Fiction Prize Nominee (2014)", "Tanizaki Prize 谷崎潤一郎賞 (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-01 00:00:00", "ISBN": "1846275105"},
{"url": "https://www.goodreads.com/book/show/3088979-the-toss-of-a-lemon", "num_ratings": "2,658", "num_reviews": "474", "avg_ratings": 3.77, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Cultural"], "title": "The Toss of a Lemon", "description": ["The year of the marriage proposal, Sivakami is ten. She is neither tall nor short for her age, but she will not grow much more. Her shoulders are narrow but appear solid, as though the blades are fused to protect her heart from the back. She carries herself with an attractive stiffness: her shoulders straight and always aligned. She looks capable of bearing great burdens,", "The year of the marriage proposal, Sivakami is ten. She is neither tall nor short for her age, but she will not grow much more. Her shoulders are narrow but appear solid, as though the blades are fused to protect her heart from the back. She carries herself with an attractive stiffness: her shoulders straight and always aligned. She looks capable of bearing great burdens, not as though born to yoke but perhaps as though born with a yoke within her.", "Spanning the lifetime of one woman (1896–1962), ", "brings us intimately into a Brahmin household, into an India we’ve never before seen.", "Married at ten, widowed at eighteen, left with two children, Sivakami must wear widow’s whites, shave her head, and touch no one from dawn to dusk. She is not allowed to remarry, and in the next sixty years she ventures outside her family compound only three times. She is extremely orthodox in her behavior except for one defiant act: She moves back to her dead husband’s house and village to raise her children. That decision sets the course of her children’s and grandchildren’s lives, twisting their fates in surprising, sometimes heartbreaking ways.", "Inspired by her grandmother's stories, Padma Viswanathan masterfully brings to life a profoundly exotic yet utterly recognizable family in the midst of social and political upheaval. ", "is the debut of a major new writer. "], "author": "Padma Viswanathan", "num_pages": "640", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2008-09-08 00:00:00", "ISBN": "0151015333"},
{"url": "https://www.goodreads.com/book/show/5186.Breath_Eyes_Memory", "num_ratings": "24,390", "num_reviews": "1,196", "avg_ratings": 3.87, "genres": ["Fiction", "Historical", "Historical Fiction"], "title": "Breath, Eyes, Memory", "description": ["At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new novelists, a writer who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.  ", "At the age of twelve, Sophie Caco is sent from her imp", "At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new novelists, a writer who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.  ", "At the age of twelve, Sophie Caco is sent from her impoverished village of Croix-des-Rosets to New York, to be reunited with a mother she barely remembers. There she discovers secrets that no child should ever know, and a legacy of shame that can be healed only when she returns to Haiti--to the women who first reared her. What ensues is a passionate journey through a landscape charged with the supernatural and scarred by political violence, in a novel that bears witness to the traditions, suffering, and wisdom of an entire people."], "author": "Edwidge Danticat", "num_pages": "234", "awards": [], "places": ["Haiti", "New York (the state)"], "character_names": [], "language": "English", "publish_date": "1998-05-18 00:00:00", "ISBN": "037570504X"},
{"url": "https://www.goodreads.com/book/show/65696.At_the_Altar", "num_ratings": "1,047", "num_reviews": "44", "avg_ratings": 3.87, "genres": ["Classics", "Fiction", "Short Stories", "Young Adult", "Romance", "Historical", "Historical Fiction"], "title": "At the Altar: Matrimonial Tales", "description": ["L.M. Montgomery proves that love does conquer all in this collection of nineteen funny and romantic short stories. Couples make it to the altar despite myriad obstacles, including mistaken identities, family obligations, meddling gossips--even one very determined cat--and their journeys couldn't be more delightful for the reader. Fans of Anne of Green Gables books as well", "L.M. Montgomery proves that love does conquer all in this collection of nineteen funny and romantic short stories. Couples make it to the altar despite myriad obstacles, including mistaken identities, family obligations, meddling gossips--even one very determined cat--and their journeys couldn't be more delightful for the reader. Fans of Anne of Green Gables books as well as hopeless romantics everywhere will treasure this book."], "author": "L.M. Montgomery", "num_pages": "228", "awards": [], "places": ["Canada"], "character_names": [], "language": "English", "publish_date": "1995-05-01 00:00:00", "ISBN": "0553567489"},
{"url": "https://www.goodreads.com/book/show/25663781-what-lies-between-us", "num_ratings": "1,392", "num_reviews": "334", "avg_ratings": 3.89, "genres": ["Fiction", "Contemporary", "Mystery", "Adult", "Mystery", "Crime", "Adult Fiction"], "title": "What Lies Between Us", "description": ["In the idyllic hill country of Sri Lanka, a young girl grows up with her loving family; but even in the midst of this paradise, terror lurks in the shadows. When tragedy strikes, she and her mother must seek safety by immigrating to America. There the girl reinvents herself as an American teenager to survive, with the help of her cousin; but even as she assimilates and thr", "In the idyllic hill country of Sri Lanka, a young girl grows up with her loving family; but even in the midst of this paradise, terror lurks in the shadows. When tragedy strikes, she and her mother must seek safety by immigrating to America. There the girl reinvents herself as an American teenager to survive, with the help of her cousin; but even as she assimilates and thrives, the secrets and scars of her past follow her into adulthood. In this new country of freedom, everything she has built begins to crumble around her, and her hold on reality becomes more and more tenuous. When the past and the present collide, she sees only one terrible choice."], "author": "Nayomi Munaweera", "num_pages": "310", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-02-16 00:00:00", "ISBN": "1250043948"},
{"url": "https://www.goodreads.com/book/show/2046181.No_Onions_Nor_Garlic", "num_ratings": "181", "num_reviews": "30", "avg_ratings": 3.39, "genres": ["Fiction", "Female Authors"], "title": "No Onions Nor Garlic", "description": ["Amandeep, Murugesh, Rufus and Sundar are bucks who talk dirty for the same reason that they remove the mufflers from their motorcycle exhausts— it makes them feel like men. Like libertines. To their hormonal despair, when Professor Ram stages his remake of A Midsummer Night's Dream at their college fest, he casts these four as fairies. The farce that follows gradually take", "Amandeep, Murugesh, Rufus and Sundar are bucks who talk dirty for the same reason that they remove the mufflers from their motorcycle exhausts— it makes them feel like men. Like libertines. To their hormonal despair, when Professor Ram stages his remake of A Midsummer Night's Dream at their college fest, he casts these four as fairies. The farce that follows gradually takes over the lives of the rest of the characters in this achingly funny novel about the pratfalls that accompany caste pride. On and off the campus of Chennai University, you will encounter onion-and-garlic-free TamBrahms who rewrite Shakespeare to uphold the Hindu order, smug NRIs who call the shots in matrimonials, visiting Canadians who are aghast at the plight of Dalits (pronounced 'daylights') and, at the apex of the whole tumbling structure, a bibulous builder who invokes the gods even as he defrauds his clients. Tailing the characters around this plot is an unseen but all-seeing spectator. You may never guess who that is, but will laugh all the way to the answer."], "author": "Srividya Natarajan", "num_pages": "326", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-01 00:00:00", "ISBN": "0143099612"},
{"url": "https://www.goodreads.com/book/show/6775396-black-mamba-boy", "num_ratings": "1,078", "num_reviews": "147", "avg_ratings": 3.72, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Eastern Africa", "Somalia", "Literature", "African Literature"], "title": "Black Mamba Boy", "description": ["For fans of Half of a Yellow Sun, a stunning novel set in 1930s Somalia spanning a decade of war and upheaval, all seen through the eyes of a small boy alone in the world.", "Aden, Yemen, 1935; a city vibrant, alive, and full of hidden dangers. And home to Jama, a ten year-old boy. But then his mother dies unexpectedly and he finds himself alone in the world.", "Jama is forced hom", "For fans of Half of a Yellow Sun, a stunning novel set in 1930s Somalia spanning a decade of war and upheaval, all seen through the eyes of a small boy alone in the world.", "Aden, Yemen, 1935; a city vibrant, alive, and full of hidden dangers. And home to Jama, a ten year-old boy. But then his mother dies unexpectedly and he finds himself alone in the world.", "Jama is forced home to his native Somalia, the land of his nomadic ancestors. War is on the horizon and the fascist Italian forces who control parts of East Africa are preparing for battle. Yet Jama cannot rest until he discovers whether his father, who has been absent from his life since he was a baby, is alive somewhere.", "And so begins an epic journey which will take Jama north through Djibouti, war-torn Eritrea and Sudan, to Egypt. And from there, aboard a ship transporting Jewish refugees just released from German concentration camps, across the seas to Britain and freedom.", "This story of one boy's long walk to freedom is also the story of how the Second World War affected Africa and its people; a story of displacement and family."], "author": "Nadifa Mohamed", "num_pages": "280", "awards": ["Orange Prize Nominee for Fiction Longlist (2010)", "Guardian First Book Award Nominee (2010)", "John Llewellyn Rhys Prize Nominee (2010)", "Dylan Thomas Prize Nominee (2010)", "Betty Trask Prize (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-07 00:00:00", "ISBN": "0007315740"},
{"url": "https://www.goodreads.com/book/show/24594555-anu-the-yo-yo-years", "num_ratings": "1", "num_reviews": "1", "avg_ratings": 5.0, "genres": ["Cultural", "India", "Literature", "20th Century", "Nonfiction", "Autobiography", "Memoir"], "title": "Anu The Yo-yo Years", "description": ["Third volume in the biography of Anu Vasisht.", "The long battle to extricate herself from an unhappy marriage exposed Anu to many personal dangers , as well as the constant terror of losing her three daughters . Determined to bring up her children single-handedly, Anu returned to work , starting at the bottom of the ladder and quickly rising to the top of her career. However,", "Third volume in the biography of Anu Vasisht.", "The long battle to extricate herself from an unhappy marriage exposed Anu to many personal dangers , as well as the constant terror of losing her three daughters . Determined to bring up her children single-handedly, Anu returned to work , starting at the bottom of the ladder and quickly rising to the top of her career. However, professional success, too, was eventually blighted by disappointments and betrayals. Anu faced her challenges with typical courage and faith, until circumstances forced her to make a decision. But that's another story . . ."], "author": "Shabnam Vasisht", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-03 00:00:00", "ISBN": "190714093X"},
{"url": "https://www.goodreads.com/book/show/10846336-salvage-the-bones", "num_ratings": "29,201", "num_reviews": "4,302", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "African American", "Contemporary", "Literary Fiction"], "title": "Salvage the Bones", "description": [" ", "A hurricane is building over the Gulf of Mexico, threatening the coastal town of Bois Sauvage, Mississippi, and Esch's father is growing concerned. A hard drinker, largely absent, he doesn't show concern for much else. Esch and her three brothers are stocking food, but there isn't much to save. Lately, Esch can't keep down", " ", "A hurricane is building over the Gulf of Mexico, threatening the coastal town of Bois Sauvage, Mississippi, and Esch's father is growing concerned. A hard drinker, largely absent, he doesn't show concern for much else. Esch and her three brothers are stocking food, but there isn't much to save. Lately, Esch can't keep down what food she gets; she's fourteen and pregnant. Her brother Skeetah is sneaking scraps for his prized pitbull's new litter, dying one by one in the dirt. While brothers Randall and Junior try to stake their claim in a family long on child's play and short on parenting. As the twelve days that comprise the novel's framework yield to the final day and Hurricane Katrina, the unforgettable family at the novel's heart--motherless children sacrificing for each other as they can, protecting and nurturing where love is scarce--pulls itself up to struggle for another day. A wrenching look at the lonesome, brutal, and restrictive realities of rural poverty, \"Salvage the Bone\" is muscled with poetry, revelatory, and real."], "author": "Jesmyn Ward", "num_pages": "261", "awards": ["National Book Award for Fiction (2011)", "New York Public Library Young Lions Fiction Award Nominee (2012)", "ALA Alex Award (2012)", "Dayton Literary Peace Prize Nominee for Fiction (2012)", "Hurston/Wright Legacy Award Nominee for Fiction (2012)", "International DUBLIN Literary Award Nominee (2013)"], "places": ["Mississippi"], "character_names": [], "language": "English", "publish_date": "2011-08-12 00:00:00", "ISBN": "1608195228"},
{"url": "https://www.goodreads.com/book/show/961242.Maire", "num_ratings": "1,023", "num_reviews": "62", "avg_ratings": 4.08, "genres": ["Christian Fiction", "Historical", "Historical Fiction", "Romance", "Christian", "Historical", "Fiction", "Romance", "Christian Romance"], "title": "Maire", "description": ["A fanciful, romantic tale of passion and faith that invites readers to the \"God-graced mountains and plains\" of Ireland. Maire, Gleannmara's warrior queen, finds her fierce heart is gentled when she takes a reformed mercenary -- a Christian, no less -- as hostage during a raid. At first she wonders what kind of God would make a fine warrior like Rowan of Emerys such a cowa", "A fanciful, romantic tale of passion and faith that invites readers to the \"God-graced mountains and plains\" of Ireland. Maire, Gleannmara's warrior queen, finds her fierce heart is gentled when she takes a reformed mercenary -- a Christian, no less -- as hostage during a raid. At first she wonders what kind of God would make a fine warrior like Rowan of Emerys such a coward. But as she comes to know Rowan and witnesses the force of his beliefs, she learns that meekness and humility to the one true God are stronger than any blade of steel. And in the process, Maire discovers the transforming power of love and faith."], "author": "Linda Windsor", "num_pages": "364", "awards": [], "places": [], "character_names": ["Rowan of Emerys", "Maire, Gleannmara's warrior queen"], "language": "English", "publish_date": "2000-08-11 00:00:00", "ISBN": "1576736253"},
{"url": "https://www.goodreads.com/book/show/262033.Breast_Stories", "num_ratings": "165", "num_reviews": "12", "avg_ratings": 4.05, "genres": ["Feminism", "Fiction", "Short Stories", "Cultural", "India", "Literature"], "title": "Breast Stories", "description": ["*Translated and introduced by Gayatry Chakravorty Spivak*", "As Gayatri Chakravorty Spivak points out in her introduction, the breast is far more than a symbol in these stories - it is the means of harshly indicting an explotative social system.", "In \"Draupadi\", the protagonist, Dopdi Mejhen, is a tribal revolutionary, who, arrested and gang-raped in custody, turns the terrible w", "*Translated and introduced by Gayatry Chakravorty Spivak*", "As Gayatri Chakravorty Spivak points out in her introduction, the breast is far more than a symbol in these stories - it is the means of harshly indicting an explotative social system.", "In \"Draupadi\", the protagonist, Dopdi Mejhen, is a tribal revolutionary, who, arrested and gang-raped in custody, turns the terrible wounds of her breast into a counter-offensive,", "In \"Breast-giver\", a woman who becomes a professional wet nurse to support her family, dies of painful breast cancer, betrayed alike by the breasts that had for years been her chief identity and the dozens of 'sons' she had suckled.", "In \"Behind the Bodice\", migrant labourer Gangor's 'statuesque' breasts excite the attention of ace photographer Upin Puri, triggering off a train of violence that ends in tragedy.", "Spivak introduces this cycle of 'breast stories' with thought-provoking essays which probe the texts of the stories, opening them up to a complex of interpretation and meaning."], "author": "Mahasweta Devi", "num_pages": "166", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-15 00:00:00", "ISBN": "8170461405"},
{"url": "https://www.goodreads.com/book/show/18372689-children-of-the-jacaranda-tree", "num_ratings": "2,529", "num_reviews": "486", "avg_ratings": 3.45, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Historical"], "title": "Children of the Jacaranda Tree", "description": ["A COUNTRY DIVIDED BY REVOLUTION A PEOPLE UNITED BY LOVE", "Neda is born in Tehran’s Evin Prison, where her mother is allowed to nurse her for a few months before the arms of a guard appear at the cell door one day and, simply, take her away. In another part of the city, three-year-old Omid witnesses the arrests of his political activist parents from his perch at their kitchen", "A COUNTRY DIVIDED BY REVOLUTION A PEOPLE UNITED BY LOVE", "Neda is born in Tehran’s Evin Prison, where her mother is allowed to nurse her for a few months before the arms of a guard appear at the cell door one day and, simply, take her away. In another part of the city, three-year-old Omid witnesses the arrests of his political activist parents from his perch at their kitchen table, yogurt dripping from his fingertips. More than twenty years after the violent, bloody purge that took place inside Tehran’s prisons, Sheida learns that her father was one of those executed, that the silent void firmly planted between her and her mother all these years was not just the sad loss that comes with death, but the anguish and the horror of murder.", "These are the ", ". Set in post-revolutionary Iran from 1983 to 2011, this stunning debut novel follows a group of mothers, fathers, children, and lovers, some related by blood, others brought together by the tide of history that washes over their lives. Finally, years later, it is the next generation that is left with the burden of the past and their country’s tenuous future as a new wave of protest and political strife begins.", "is an evocative portrait of three generations of men and women inspired by love and poetry, burning with idealism, chasing dreams of justice and freedom. Written in Sahar Delijani’s spellbinding prose, capturing the intimate side of revolution in a country where the weight of history is all around, it is a moving tribute to anyone who has ever answered its call."], "author": "Sahar Delijani", "num_pages": "269", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-06-06 00:00:00", "ISBN": "0297869027"},
{"url": "https://www.goodreads.com/book/show/2696506-definitely-cool", "num_ratings": "10", "num_reviews": "0", "avg_ratings": 3.3, "genres": ["Academic", "School", "Fiction", "Cultural", "African American"], "title": "Definitely Cool", "description": ["Roxanne desperately wants to be part of the cool crowd at her new school. But Roxanne feels pressured to keep up with this flashy crowd. And when they watn her to break the rules, Roxanne knows she must figure out what's really cool. A truly contemporary novel that realistically portrays a young girl's growing up."], "author": "Brenda Wilkinson", "num_pages": "167", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-01-01 00:00:00", "ISBN": "0590461869"},
{"url": "https://www.goodreads.com/book/show/6483054-a-most-peculiar-malaysian-murder", "num_ratings": "2,026", "num_reviews": "299", "avg_ratings": 3.57, "genres": ["Mystery", "Mystery", "Crime", "Fiction", "Cultural", "Asia", "Mystery", "Detective"], "title": "A Most Peculiar Malaysian Murder", "description": ["Inspector Singh is in a bad mood. He's been sent from his home in Singapore to Kuala Lumpur to solve a murder that has him stumped. Chelsea Liew – the famous Singaporean model – is on death row for the murder of her ex-husband. She swears she didn't do it, he thinks she didn't do it, but no matter how hard he tries to get to the bottom of things, he still arrives back at t", "Inspector Singh is in a bad mood. He's been sent from his home in Singapore to Kuala Lumpur to solve a murder that has him stumped. Chelsea Liew – the famous Singaporean model – is on death row for the murder of her ex-husband. She swears she didn't do it, he thinks she didn't do it, but no matter how hard he tries to get to the bottom of things, he still arrives back at the same place – that Chelsea's husband was shot at point blank range, and that Chelsea had the best motivation to pull the trigger: he was taking her kids away from her. Now Inspector Singh must pull out all the stops to crack a crime that could potentially free a beautiful and innocent woman and reunite a mother with her children. There's just one problem – the Malaysian police refuse to play ball..."], "author": "Shamini Flint", "num_pages": "295", "awards": ["POPULAR-The Star Readers’ Choice Awards Nominee for Fiction (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-12 00:00:00", "ISBN": "0749929758"},
{"url": "https://www.goodreads.com/book/show/2133787.A_Girl_and_a_River", "num_ratings": "24", "num_reviews": "9", "avg_ratings": 3.54, "genres": ["Fiction", "Asian Literature", "Indian Literature", "Novels"], "title": "A Girl and a River", "description": ["It is the 1930s and the fire of the freedom movement from distant Bengal and Delhi is warming the languid bones of the small town of Mysore, where Kaveri and Setu grow up. Theirs is a liberal, prosperous household and the family takes its privileges for granted. But not everyone is as lucky."], "author": "Usha K.R.", "num_pages": "336", "awards": ["Crossword Book Award for Fiction (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-11-26 00:00:00", "ISBN": "0143101234"},
{"url": "https://www.goodreads.com/book/show/6483055-a-bali-conspiracy-most-foul", "num_ratings": "999", "num_reviews": "135", "avg_ratings": 3.77, "genres": ["Mystery", "Mystery", "Crime", "Fiction", "Cultural", "Asia"], "title": "A Bali Conspiracy Most Foul", "author": "Shamini Flint", "num_pages": "292", "awards": ["POPULAR-The Star Readers’ Choice Awards Nominee for Fiction (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0749929766"},
{"url": "https://www.goodreads.com/book/show/15985815-in-the-shadow-of-the-banyan", "num_ratings": "15,965", "num_reviews": "2,255", "avg_ratings": 4.04, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Asia", "War", "Historical"], "title": "In the Shadow of the Banyan", "description": ["For seven-year-old Raami, the shattering end of childhood begins with the footsteps of her father returning home in the early dawn hours bringing details of the civil war that has overwhelmed the streets of Phnom Penh, Cambodia’s capital. Soon the family’s world of carefully guarded royal privilege is swept up in the chaos of revolution and forced exodus.", "Over the next four", "For seven-year-old Raami, the shattering end of childhood begins with the footsteps of her father returning home in the early dawn hours bringing details of the civil war that has overwhelmed the streets of Phnom Penh, Cambodia’s capital. Soon the family’s world of carefully guarded royal privilege is swept up in the chaos of revolution and forced exodus.", "Over the next four years, as she endures the deaths of family members, starvation, and brutal forced labor, Raami clings to the only remaining vestige of childhood—the mythical legends and poems told to her by her father. In a climate of systematic violence where memory is sickness and justification for execution, Raami fights for her improbable survival.", "Displaying the author’s extraordinary gift for language, ", " is testament to the transcendent power of narrative and a brilliantly wrought tale of human resilience."], "author": "Vaddey Ratner", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-01 00:00:00", "ISBN": "1849837597"},
{"url": "https://www.goodreads.com/book/show/35276743-damselfly", "num_ratings": "183", "num_reviews": "68", "avg_ratings": 3.52, "genres": ["Young Adult", "Adventure", "Survival", "Adventure", "Contemporary", "Fiction", "Action", "Young Adult", "Teen"], "title": "Damselfly", "description": ["In the wake of crash-landing on a deserted tropical island, a group of private-school teens must rely on their wits and one another to survive. ", "Having just survived a plane crash, Samantha Mishra finds herself isolated and injured in the thick of the jungle. She has no idea where she is or where anybody else is -- she doesn't even know if anybody else is alive. Once Sam co", "In the wake of crash-landing on a deserted tropical island, a group of private-school teens must rely on their wits and one another to survive. ", "Having just survived a plane crash, Samantha Mishra finds herself isolated and injured in the thick of the jungle. She has no idea where she is or where anybody else is -- she doesn't even know if anybody else is alive. Once Sam connects with her best friend, Mel, and they locate the others, they set up camp and hope for rescue. But as the days pass, the survivors, all teammates on the Drake Rosemont fencing team, realize that they're on their own -- with the exception of a mysterious presence who taunts and threatens them. When their initial attempts to escape the island fail, the teens find they need to survive more than the jungle . . . they need to survive each other.", "This taut novel, with a setting evocative of Lord of the Flies, is by turns cinematic and intimate, and always thought-provoking."], "author": "Chandra Prasad", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-03-27 00:00:00", "ISBN": "0545907926"},
{"url": "https://www.goodreads.com/book/show/13748166-a-written-republic", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 4.0, "genres": [], "title": "A Written Republic: Cicero's Philosophical Politics", "description": ["In the 40s BCE, during his forced retirement from politics under Caesar's dictatorship, Cicero turned to philosophy, producing a massive and important body of work. As he was acutely aware, this was an unusual undertaking for a Roman statesman because Romans were often hostile to philosophy, perceiving it as foreign and incompatible with fulfilling one's duty as a citizen.", "In the 40s BCE, during his forced retirement from politics under Caesar's dictatorship, Cicero turned to philosophy, producing a massive and important body of work. As he was acutely aware, this was an unusual undertaking for a Roman statesman because Romans were often hostile to philosophy, perceiving it as foreign and incompatible with fulfilling one's duty as a citizen. How, then, are we to understand Cicero's decision to pursue philosophy in the context of the political, intellectual, and cultural life of the late Roman republic? In ", ", Yelena Baraz takes up this question and makes the case that philosophy for Cicero was not a retreat from politics but a continuation of politics by other means, an alternative way of living a political life and serving the state under newly restricted conditions.", " Baraz examines the rhetorical battle that Cicero stages in his philosophical prefaces--a battle between the forces that would oppose or support his project. He presents his philosophy as intimately connected to the new political circumstances and his exclusion from politics. His goal--to benefit the state by providing new moral resources for the Roman elite--was traditional, even if his method of translating Greek philosophical knowledge into Latin and combining Greek sources with Roman heritage was unorthodox.", " provides a new perspective on Cicero's conception of his philosophical project while also adding to the broader picture of late-Roman political, intellectual, and cultural life."], "author": "Yelena Baraz", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-29 00:00:00", "ISBN": "0691153329"},
{"url": "https://www.goodreads.com/book/show/335258.Imaginary_Maps", "num_ratings": "186", "num_reviews": "17", "avg_ratings": 3.82, "genres": ["Fiction", "Short Stories", "Cultural", "India", "Literature"], "title": "Imaginary Maps", "description": [" presents three stories from noted Bengali writer Mahasweta Devi in conjunction with readings of these tales by famed cultural and literary critic, Gayatri Chakravorty Spivak. Weaving history, myth and current political realities, these stories explore troubling motifs in contemporary Indian life through the figures and narratives of indigenous tribes in In", " presents three stories from noted Bengali writer Mahasweta Devi in conjunction with readings of these tales by famed cultural and literary critic, Gayatri Chakravorty Spivak. Weaving history, myth and current political realities, these stories explore troubling motifs in contemporary Indian life through the figures and narratives of indigenous tribes in India. At once delicate and violent, Devi's stories map the experiences of the \"tribals\" and tribal life under decolonization. In \"The Hunt,\" \"Douloti the Bountiful\" and the deftly wrought allegory of tribal agony \"Pterodactyl, Pirtha, and Puran Sahay,\" Ms. Devi links the specific fate of tribals in India to that of marginalized peoples everywhere.", "Gayatri Spivak's readings of these stories connect the necessary \"power lines\" within them, not only between local and international structures of power (patriarchy, nationalisms, late capitalism), but also to the university."], "author": "Mahasweta Devi", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-03-02 00:00:00", "ISBN": "0415904633"},
{"url": "https://www.goodreads.com/book/show/6544214-beneath-the-lion-s-gaze", "num_ratings": "1,894", "num_reviews": "310", "avg_ratings": 3.87, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Ethiopia", "Historical", "Historical Fiction", "War", "Literature", "African Literature", "Novels"], "title": "Beneath the Lion's Gaze", "description": [" ", "This memorable, heartbreaking story opens in Addis Ababa, Ethiopia, 1974, on the eve of a revolution. Yonas kneels in his mother’s prayer room, pleading to his god for an end to the violence that has wracked his family and country. His father, Hai", " ", "This memorable, heartbreaking story opens in Addis Ababa, Ethiopia, 1974, on the eve of a revolution. Yonas kneels in his mother’s prayer room, pleading to his god for an end to the violence that has wracked his family and country. His father, Hailu, a prominent doctor, has been ordered to report to jail after helping a victim of state-sanctioned torture to die. And Dawit, Hailu’s youngest son, has joined an underground resistance movement—a choice that will lead to more upheaval and bloodshed across a ravaged Ethiopia. ", " tells a gripping story of family, of the bonds of love and friendship set in a time and place that has rarely been explored in fiction. It is a story about the lengths human beings will go in pursuit of freedom and the human price of a national revolution. Emotionally gripping, poetic, and indelibly tragic, ", " is a transcendent and powerful debut. ."], "author": "Maaza Mengiste", "num_pages": "308", "awards": ["Dayton Literary Peace Prize for Fiction (Runner-up) (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-11 00:00:00", "ISBN": "0393071766"},
{"url": "https://www.goodreads.com/book/show/6758150-the-thing-around-your-neck", "num_ratings": "18,368", "num_reviews": "1,810", "avg_ratings": 4.21, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Contemporary", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "The Thing Around Your Neck", "description": ["These twelve dazzling stories from Chimamanda Ngozi Adichie — the Orange Broadband Prize–winning author of ", " — are her most intimate works to date.", "In these stories Adichie turns her penetrating eye to the ties that bind men and women, parents and children, Nigeria and the United States. In “A Private Experience,” a medical student hides from a violent ri", "These twelve dazzling stories from Chimamanda Ngozi Adichie — the Orange Broadband Prize–winning author of ", " — are her most intimate works to date.", "In these stories Adichie turns her penetrating eye to the ties that bind men and women, parents and children, Nigeria and the United States. In “A Private Experience,” a medical student hides from a violent riot with a poor Muslim woman, and the young mother at the centre of “Imitation” finds her comfortable life in Philadelphia threatened when she learns that her husband has moved his mistress into their Lagos home. ", "Searing and profound, suffused with beauty, sorrow and longing, this collection is a resounding confirmation of Adichie’s prodigious literary powers."], "author": "Chimamanda Ngozi Adichie", "num_pages": "240", "awards": ["John Llewellyn Rhys Prize Nominee (2009)", "O. Henry Award for 'The American Embassy' (2003)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-22 00:00:00", "ISBN": "0307397890"},
{"url": "https://www.goodreads.com/book/show/20560137-an-ember-in-the-ashes", "num_ratings": "122,502", "num_reviews": "17,571", "avg_ratings": 4.32, "genres": ["Fantasy", "Young Adult", "Romance", "Science Fiction", "Dystopia"], "title": "An Ember in the Ashes", "description": ["Under the Martial Empire, defiance is met with death. Those who do not vow their blood and bodies to the Emperor risk the execution of their loved ones and the destruction of all they hold dear.", "It is in this brutal world, inspired by ancient Rome, that Laia lives with her grandparents and older brother. The family ekes o", "Under the Martial Empire, defiance is met with death. Those who do not vow their blood and bodies to the Emperor risk the execution of their loved ones and the destruction of all they hold dear.", "It is in this brutal world, inspired by ancient Rome, that Laia lives with her grandparents and older brother. The family ekes out an existence in the Empire’s impoverished backstreets. They do not challenge the Empire. They’ve seen what happens to those who do.", "But when Laia’s brother is arrested for treason, Laia is forced to make a decision. In exchange for help from rebels who promise to rescue her brother, she will risk her life to spy for them from within the Empire’s greatest military academy.", "There, Laia meets Elias, the school’s finest soldier—and secretly, its most unwilling. Elias wants only to be free of the tyranny he’s being trained to enforce. He and Laia will soon realize that their destinies are intertwined—and that their choices will change the fate of the Empire itself."], "author": "Sabaa Tahir", "num_pages": "446", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Milwaukee County Teen Book Award Nominee (2016)", "Dioraphte Jongerenliteratuurprijs Nominee for Vertaald boek (2016)", "Lincoln Award Nominee (2018)", "Goodreads Choice Award Nominee for Debut Goodreads Author, and for Young Adult Fantasy & Science Fiction (2015)", "The Magnolia Award Nominee for 9-12 (2018)", "Missouri Gateway Readers Award Nominee (2017)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2015)"], "places": [], "character_names": ["Laia", "Elias Veturius", "Helene Aquilla", "Marcus Farrar", "Keris Veturia"], "language": "English", "publish_date": "2015-04-28 00:00:00", "ISBN": "1595148035"},
{"url": "https://www.goodreads.com/book/show/27071239-twisted-in-a-positive-way", "num_ratings": "41", "num_reviews": "33", "avg_ratings": 4.41, "genres": ["Literature", "African Literature", "Fiction", "Cultural", "Africa"], "title": "Twisted in a Positive Way", "description": ["A girl with big dreams. A land with strict societal rules. A spirit that will never die. Young Adaugo has lived her life according to cultural expectations. Any semblance of building a life of her own was actively discouraged for young women like her. But, Adaugo is not like others who came before her; she is born of strong sp", "A girl with big dreams. A land with strict societal rules. A spirit that will never die. Young Adaugo has lived her life according to cultural expectations. Any semblance of building a life of her own was actively discouraged for young women like her. But, Adaugo is not like others who came before her; she is born of strong spirit and mind, she knows there’s something more for her in the universe, but finding that will take strength she never knew she had and a deep understanding of what it is to listen to the voice within and grasp all life has to offer, no matter the obstacles placed in front of her. Follow Adaugo as she navigates through life, loss and heartache in a world built to stifle her loving spirit. Will she be able to stave off the temptation to give in to societal expectations to live life as her authentic self? Or will she give in like those gone before her?"], "author": "Chikamso C. Efobi", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-20 00:00:00", "ISBN": "0993354203"},
{"url": "https://www.goodreads.com/book/show/32969150-stay-with-me", "num_ratings": "16,108", "num_reviews": "2,436", "avg_ratings": 4.03, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Contemporary", "Literary Fiction", "Western Africa", "Nigeria"], "title": "Stay with Me", "description": ["Yejide and Akin have been married since they met and fell in love at university. Though many expected Akin to take several wives, he and Yejide have always agreed: polygamy is not for them. But four years into their marriage--after consulting fertility doctors and healers, trying strange teas and unlikely cures--Yejide is still not pregnant. She assumes she still has time-", "Yejide and Akin have been married since they met and fell in love at university. Though many expected Akin to take several wives, he and Yejide have always agreed: polygamy is not for them. But four years into their marriage--after consulting fertility doctors and healers, trying strange teas and unlikely cures--Yejide is still not pregnant. She assumes she still has time--until her family arrives on her doorstep with a young woman they introduce as Akin's second wife. Furious, shocked, and livid with jealousy, Yejide knows the only way to save her marriage is to get pregnant, which, finally, she does, but at a cost far greater than she could have dared to imagine. An electrifying novel of enormous emotional power, ", " asks how much we can sacrifice for the sake of family."], "author": "Ayobami Adebayo", "num_pages": "260", "awards": ["Wellcome Book Prize Nominee for Longlist (2018)", "Dylan Thomas Prize Nominee for Longlist (2018)", "Women's Prize for Fiction Nominee (2017)", "Goodreads Choice Award Nominee for Debut Goodreads Author (2017)", "Reading Women Award Nominee for Fiction (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-22 00:00:00", "ISBN": "0451494601"},
{"url": "https://www.goodreads.com/book/show/361825.Mixed", "num_ratings": "189", "num_reviews": "31", "avg_ratings": 3.75, "genres": ["Short Stories", "Race", "Fiction", "Sociology", "Anthologies", "Anthologies", "Collections"], "title": "Mixed: An Anthology of Short Fiction on the Multiracial Experience", "description": ["Though multiracialism has recently become a popular aspect of many memoirs and novels, \"Mixed\" is the first of its kind: a fiction anthology with racial overlap as its compass. With original pieces by both established and emerging writers, \"Mixed\" explores the complexities of identity that come with being a multiracial person.", "Every story, crafted by authors who are themsel", "Though multiracialism has recently become a popular aspect of many memoirs and novels, \"Mixed\" is the first of its kind: a fiction anthology with racial overlap as its compass. With original pieces by both established and emerging writers, \"Mixed\" explores the complexities of identity that come with being a multiracial person.", "Every story, crafted by authors who are themselves mixed-race, broaches multiracialism through character or theme. With contributors such as Cristina Garcia, Danzy Senna, Ruth Ozeki, Mat Johnson, Wayde Compton, Diana Abu-Jaber, Emily Raboteau, Mary Yukari Waters, and Peter Ho Davies, and an illuminating introduction by Rebecca Walker, \"Mixed\" gives narrative voice to the multiple identities of the rising generation.", "Contents:", "The anthropologists' kids by Ruth Ozeki", "Effigies by Lucinda Roy", "Minotaur by Peter Ho Davies", "Mrs. Turner's lawn Jockeys by Emily Raboteau", "Footnote by Carmit Delman", "My Elizabeth by Diana Abu-Jaber", "Gift giving by Mat Johnson", "Shadey by Stewart David Ikeda", "Unacknowledged by Brian Ascalon Roley", "Caste system by Mary Yukari Waters", "Wayward by Chandra Prasad", "Falling sky by Cristina Garcia", "The non-Babylonians by Wayde Compton", "Hollywood by Marina Budhos", "Human mathematics by Mamle Kabu", "Bing-Chen by Neela Vaswani", "The lost sparrow by Kien Nguyen", "Triad by Danzy Senna"], "author": "Chandra Prasad", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-17 00:00:00", "ISBN": "0393327868"},
{"url": "https://www.goodreads.com/book/show/2418888.Skim", "num_ratings": "10,260", "num_reviews": "1,069", "avg_ratings": 3.79, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Lgbt", "Fiction"], "title": "Skim", "description": ["Heartbreakingly funny, moving and vibrantly drawn, ", " is an extraordinary book--a smart and sensitive graphic novel of the highest literary and artistic quality, by and about young women.", "\"Skim\" is Kimberly Keiko Cameron, a not-slim, would-be Wiccan goth who goes to a private girls' school. When Skim's classmate Katie Matthews is dumped by her boyfriend, who then kills hi", "Heartbreakingly funny, moving and vibrantly drawn, ", " is an extraordinary book--a smart and sensitive graphic novel of the highest literary and artistic quality, by and about young women.", "\"Skim\" is Kimberly Keiko Cameron, a not-slim, would-be Wiccan goth who goes to a private girls' school. When Skim's classmate Katie Matthews is dumped by her boyfriend, who then kills himself, the entire school goes into mourning overdrive. As concerned guidance counselors provide lectures on the \"cycle of grief,\" and the popular clique starts a new club (Girls Celebrate Life!) to bolster school spirit, Skim sinks into an ever-deepening depression. ", "And falling in love only makes things worse...", "Suicide, depression, love, being gay or not, crushes, cliques, and finding a way to be your own fully human self--are all explored in this brilliant collaboration by cousins Mariko and Jillian Tamaki. An edgy, keenly observed and poignant glimpse into the heartache of being young."], "author": "Mariko Tamaki", "num_pages": "143", "awards": ["Ignatz Award for Outstanding Graphic Novel (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "Doug Wright Award for Best Book (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["Toronto, Ontario"], "character_names": ["Kimberly Keiko Cameron, aka \"Skim\"", "Lisa Soor", "Ms. Archer"], "language": "English", "publish_date": "2008-01-01 00:00:00", "ISBN": "0888997531"},
{"url": "https://www.goodreads.com/book/show/6364018-the-dark-holds-no-terrors", "num_ratings": "210", "num_reviews": "17", "avg_ratings": 3.67, "genres": ["Cultural", "India", "Feminism", "Womens", "Novels"], "title": "The Dark Holds No Terrors", "description": ["Why are you still alive—why didn’t you die?”", "Years later, Sarita still remembers her mother’s bitter words uttered when, as a little girl, she was unable to save her younger brother from drowning. Now, her mother is dead and Sarita returns to the family home, ostensibly to take care of her father, but in reality to escape the nightmarish brutality her husband inflicts on he", "Why are you still alive—why didn’t you die?”", "Years later, Sarita still remembers her mother’s bitter words uttered when, as a little girl, she was unable to save her younger brother from drowning. Now, her mother is dead and Sarita returns to the family home, ostensibly to take care of her father, but in reality to escape the nightmarish brutality her husband inflicts on her. In the quiet of her father’s company, Sarita reflects on the events of her life: her stultifying small town childhood, her domineering mother, her marriage to the charismatic young poet Manohar (who turned vicious when he realized his career was going nowhere and that his wife’s professional success was exceeding his own), her children . . . As she struggles with her emotions and anxieties, Sarita gradually realizes that there is more to life than dependency on marriage and family—she resolves to use her new found truths to make a better life for herself."], "author": "Shashi Deshpande", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-12 00:00:00", "ISBN": "1933372672"},
{"url": "https://www.goodreads.com/book/show/8965997-lyrics-alley", "num_ratings": "1,070", "num_reviews": "188", "avg_ratings": 3.69, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Northern Africa", "Sudan", "Northern Africa", "Egypt", "Literature", "African Literature"], "title": "Lyrics Alley", "description": [" is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades. ", "Their fortune threatened by shifting powers in Sudan and their heir's debilitating accident, a powerful family under the leadership of Mahmoud Bey is torn between the traditional and mode", " is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades. ", "Their fortune threatened by shifting powers in Sudan and their heir's debilitating accident, a powerful family under the leadership of Mahmoud Bey is torn between the traditional and modern values of Mahmoud's two wives and his son's efforts to break with cultural limits."], "author": "Leila Aboulela", "num_pages": "310", "awards": ["Orange Prize Nominee for Fiction Longlist (2011)", "Scottish Trust Book Award for Fiction"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "0802119514"},
{"url": "https://www.goodreads.com/book/show/25152052-the-japanese-lover", "num_ratings": "44,300", "num_reviews": "5,224", "avg_ratings": 3.8, "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Audiobook"], "title": "The Japanese Lover", "description": ["In 1939, as Poland falls under the shadow of the Nazis, young Alma Belasco's parents send her away to live in safety with an aunt and uncle in their opulent mansion in San Francisco. There, as the rest of the world goes to war, she encounters Ichimei Fukuda, the quiet and gentle son of the family's Japanese gardener. Unnoticed by those around them, a tender love affair beg", "In 1939, as Poland falls under the shadow of the Nazis, young Alma Belasco's parents send her away to live in safety with an aunt and uncle in their opulent mansion in San Francisco. There, as the rest of the world goes to war, she encounters Ichimei Fukuda, the quiet and gentle son of the family's Japanese gardener. Unnoticed by those around them, a tender love affair begins to blossom. Following the Japanese attack on Pearl Harbor, the two are cruelly pulled apart as Ichimei and his family, like thousands of other Japanese Americans are declared enemies and forcibly relocated to internment camps run by the United States government. Throughout their lifetimes, Alma and Ichimei reunite again and again, but theirs is a love that they are forever forced to hide from the world.", "Decades later, Alma is nearing the end of her long and eventful life. Irina Bazili, a care worker struggling to come to terms with her own troubled past, meets the elderly woman and her grandson, Seth, at San Francisco's charmingly eccentric Lark House nursing home. As Irina and Seth forge a friendship, they become intrigued by a series of mysterious gifts and letters sent to Alma, eventually learning about Ichimei and this extraordinary secret passion that has endured for nearly seventy years."], "author": "Isabel Allende", "num_pages": "322", "awards": [], "places": ["San Francisco, California"], "character_names": ["Irina Bazili", "Alma Belasco", "Ichimei Fukuda", "Seth"], "language": "English", "publish_date": "2015-11-03 00:00:00", "ISBN": "1501116975"},
{"url": "https://www.goodreads.com/book/show/3328537-the-pirate-s-daughter", "num_ratings": "2,323", "num_reviews": "294", "avg_ratings": 3.48, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance"], "title": "The Pirate's Daughter", "description": ["A multi-generational story based around the extraordinary true story of Errol Flynn's arrival in 1940s Jamaica. The Pirate's Daughter follows Ida, a young girl who falls for Flynn's legendary charms. Through the eyes of Ida and her daughter, May, it also tells the story of their home, Jamaica before and after independence."], "author": "Margaret Cezair-Thompson", "num_pages": "503", "awards": ["Essence Literary Award for Fiction"], "places": ["Jamaica"], "character_names": [], "language": "English", "publish_date": "2008-06-12 00:00:00", "ISBN": "075534359X"},
{"url": "https://www.goodreads.com/book/show/11346.Sula", "num_ratings": "46,704", "num_reviews": "2,596", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Literature", "Novels", "Literary Fiction", "Academic", "School", "Feminism", "Literature", "American"], "title": "Sula", "description": ["This rich and moving novel traces the lives of two black heroines from their close-knit childhood in a small Ohio town, through their sharply divergent paths of womanhood, to their ultimate confrontation and reconciliation.", "Nel Wright has chosen to stay in the place where she was born, to marry, raise a family, and become a pillar of the black community. Sula Peace has reje", "This rich and moving novel traces the lives of two black heroines from their close-knit childhood in a small Ohio town, through their sharply divergent paths of womanhood, to their ultimate confrontation and reconciliation.", "Nel Wright has chosen to stay in the place where she was born, to marry, raise a family, and become a pillar of the black community. Sula Peace has rejected the life Nel has embraced, escaping to college, and submerging herself in city life. When she returns to her roots, it is as a rebel and a wanton seductress. Eventually, both women must face the consequences of their choices. Together, they create an unforgettable portrait of what it means and costs to be a black woman in America."], "author": "Toni Morrison", "num_pages": "192", "awards": ["Audie Award for Narration by the Author or Authors (1998)", "National Book Award Finalist for Fiction (1975)"], "places": [], "character_names": ["Nel Wright Greene", "Sula Peace", "Helene Wright", "Eva Peace", "Hannah Peace"], "language": "English", "publish_date": "2002-04-05 00:00:00", "ISBN": "0452283868"},
{"url": "https://www.goodreads.com/book/show/6149.Beloved", "num_ratings": "265,658", "num_reviews": "8,673", "avg_ratings": 3.79, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Literature", "Magical Realism"], "title": "Beloved", "description": ["Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by", "Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by the ghost of her baby, who died nameless and whose tombstone is engraved with a single word: Beloved. ", "Filled with bitter poetry and suspense as taut as a rope, ", " is a towering achievement by Nobel Prize laureate Toni Morrison."], "author": "Toni Morrison", "num_pages": "324", "awards": ["Pulitzer Prize for Fiction (1988)", "American Book Award (1988)", "Anisfield-Wolf Book Award (1988)", "National Book Critics Circle Award Nominee for Fiction (1987)", "Frederic G. Melcher Book Award (1988)", "National Book Award Finalist for Fiction (1987)"], "places": ["Delaware", "Ohio", "Kentucky"], "character_names": ["Baby Suggs", "Sethe", "Beloved", "Paul D Garner", "Denver"], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "1400033411"},
{"url": "https://www.goodreads.com/book/show/37398.Jazz", "num_ratings": "18,476", "num_reviews": "969", "avg_ratings": 3.79, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Cultural", "African American", "Literature"], "title": "Jazz", "description": ["In the winter of 1926, when everybody everywhere sees nothing but good things ahead, Joe Trace, middle-aged door-to-door salesman of Cleopatra beauty products, shoots his teenage lover to death. At the funeral, Joe’s wife, Violet, attacks the girl’s corpse. This passionate, profound story of love and obsession brings us back and forth in time, as a narrative is assembled f", "In the winter of 1926, when everybody everywhere sees nothing but good things ahead, Joe Trace, middle-aged door-to-door salesman of Cleopatra beauty products, shoots his teenage lover to death. At the funeral, Joe’s wife, Violet, attacks the girl’s corpse. This passionate, profound story of love and obsession brings us back and forth in time, as a narrative is assembled from the emotions, hopes, fears, and deep realities of black urban life."], "author": "Toni Morrison", "num_pages": "229", "awards": [], "places": ["Harlem, New York City, New York"], "character_names": [], "language": "English", "publish_date": "1993-04-01 00:00:00", "ISBN": "0452269652"},
{"url": "https://www.goodreads.com/book/show/139253.The_House_on_Mango_Street", "num_ratings": "97,871", "num_reviews": "8,134", "avg_ratings": 3.6, "genres": ["Fiction", "Young Adult", "Classics", "Short Stories", "Academic", "School"], "title": "The House on Mango Street", "description": ["Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up", "Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up in Chicago, inventing for herself who and what she will become. Few other books in our time have touched so many readers."], "author": "Sandra Cisneros", "num_pages": "110", "awards": ["American Book Award (1985)", "George C. Stone Center for Children's Books Recognition of Merit Award (1994)"], "places": ["Chicago, Illinois"], "character_names": ["Esperanza", "Nenny"], "language": "English", "publish_date": "2009-04-03 00:00:00", "ISBN": "0679734775"},
{"url": "https://www.goodreads.com/book/show/106542.The_Antelope_Wife", "num_ratings": "3,055", "num_reviews": "278", "avg_ratings": 3.8, "genres": ["Fiction", "Fantasy", "Magical Realism", "Historical", "Historical Fiction"], "title": "The Antelope Wife", "description": ["One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life", "One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life the people who live in or around this midwestern city. And like a modern city itself, it portrays people of all backgrounds and is a mixture of vibrant cultures and ideas. But also like a modern city, it has an edge, troubled by violence.", "\"New York Times\" bestselling author Louise Erdrich has twice won the National Magazine Award and her work has been included in both the O. Henry and the Best American collections several times."], "author": "Louise Erdrich", "num_pages": "256", "awards": ["World Fantasy Award for Best Novel (1999)"], "places": ["Minneapolis, Minnesota"], "character_names": [], "language": "English", "publish_date": "1998-10-12 00:00:00", "ISBN": "0007136366"},
{"url": "https://www.goodreads.com/book/show/37415.Their_Eyes_Were_Watching_God", "num_ratings": "216,544", "num_reviews": "10,217", "avg_ratings": 3.88, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Academic", "School", "Cultural", "African American"], "title": "Their Eyes Were Watching God", "description": ["Fair and long-legged, independent and articulate, Janie Crawford sets out to be her own person -- no mean feat for a black woman in the '30s. Janie's quest for identity takes her through three marriages and into a journey back to her roots."], "author": "Zora Neale Hurston", "num_pages": "219", "awards": ["Audie Award for Solo Narration - Female (2001)"], "places": ["Florida", "Everglades, Florida"], "character_names": ["Eleanor", "Sam Watson", "Shelby", "Janie Starks", "Pheoby Watson", "Nanny", "Leafy", "Johnny Taylor", "Logan Killicks", "Jody Starks", "Tea Cake", "Pearl Stone", "Mrs. Sumpkins", "Lulu Moss", "Mis' Washburn", "Mr. Washburn", "Miss Nellie", "Mayrella"], "language": "English", "publish_date": "2006-05-30 00:00:00", "ISBN": "0061120065"},
{"url": "https://www.goodreads.com/book/show/15796700-americanah", "num_ratings": "169,140", "num_reviews": "16,393", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Literary Fiction", "Feminism"], "title": "Americanah", "description": ["Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a d", "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London. Fifteen years later, they reunite in a newly democratic Nigeria, and reignite their passion—for each other and for their homeland.", "Source: chimamanda.com"], "author": "Chimamanda Ngozi Adichie", "num_pages": "477", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0307271080"},
{"url": "https://www.goodreads.com/book/show/9503.Saving_Fish_from_Drowning", "num_ratings": "27,221", "num_reviews": "2,725", "avg_ratings": 3.42, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia"], "title": "Saving Fish from Drowning", "description": ["San Francisco art patron Bibi Chen has planned a journey of the senses along the famed Burma Road for eleven lucky friends. But after her mysterious death, Bibi watches aghast from her ghostly perch as the travelers veer off her itinerary and embark on a trail paved with cultural gaffes and tribal curses, Buddhist illusions and romantic desires. On Christmas morning, the t", "San Francisco art patron Bibi Chen has planned a journey of the senses along the famed Burma Road for eleven lucky friends. But after her mysterious death, Bibi watches aghast from her ghostly perch as the travelers veer off her itinerary and embark on a trail paved with cultural gaffes and tribal curses, Buddhist illusions and romantic desires. On Christmas morning, the tourists cruise across a misty lake and disappear.", "With picaresque characters and mesmerizing imagery, ", " gives us a voice as idiosyncratic, sharp, and affectionate as the mothers of ", ". Bibi is the observant eye of human nature–the witness of good intentions and bad outcomes, of desperate souls and those who wish to save them. In the end, Tan takes her readers to that place in their own heart where hope is found."], "author": "Amy Tan", "num_pages": "472", "awards": ["Asian/Pacific American Award for Literature for Adult Fiction Honor (2005)"], "places": ["Myanmar", "Burma"], "character_names": ["Bibi Chen"], "language": "English", "publish_date": "2006-09-26 00:00:00", "ISBN": "034546401X"},
{"url": "https://www.goodreads.com/book/show/13602426-the-round-house", "num_ratings": "83,069", "num_reviews": "8,625", "avg_ratings": 3.92, "genres": ["Fiction", "Mystery", "Historical", "Historical Fiction", "Young Adult", "Coming Of Age"], "title": "The Round House", "description": ["An exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family.", "One of the most revered novelists of our time - a brilliant chronicler of Native-American life - Louise Erdrich returns to the territory of her bestselling, Pulitzer Prize finalist The Plague of Doves wi", "An exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family.", "One of the most revered novelists of our time - a brilliant chronicler of Native-American life - Louise Erdrich returns to the territory of her bestselling, Pulitzer Prize finalist The Plague of Doves with The Round House, transporting readers to the Ojibwe reservation in North Dakota. It is an exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family. ", "Riveting and suspenseful, arguably the most accessible novel to date from the creator of Love Medicine, The Beet Queen, and The Bingo Palace, Erdrich’s The Round House is a page-turning masterpiece of literary fiction - at once a powerful coming-of-age story, a mystery, and a tender, moving novel of family, history, and culture."], "author": "Louise Erdrich", "num_pages": "323", "awards": ["National Book Award for Fiction (2012)", "American Book Award (2013)", "ALA Alex Award (2013)", "Indies Choice Book Award for Adult Fiction (2013)", "Dayton Literary Peace Prize Nominee for Fiction (2013)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2013)", "Minnesota Book Award for Novel & Short Story (2013)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2012-10-02 00:00:00", "ISBN": "0062065246"},
{"url": "https://www.goodreads.com/book/show/12557.The_Kitchen_God_s_Wife", "num_ratings": "65,885", "num_reviews": "1,905", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia", "Contemporary"], "title": "The Kitchen God's Wife", "description": ["Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside", "Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside Shanghai in the 1920s, and other places in China during World War II, and traces the happy and desperate events that led to Winnie's coming to America in 1949."], "author": "Amy Tan", "num_pages": "416", "awards": [], "places": ["United States of America"], "character_names": ["Winnie", "Auntie Helen", "Pearl Bright", "Mary", "Frank Russell", "Roger \"Bao Bao\"", "Doug Cheu", "Phil Brandt", "Tessa Russo", "Cleo", "Mimi Wong", "Loy Fong", "Edna Fong", "New Aunt", "Old Aunt", "Wen Fu", "Huazheng \"Peanut\"", "Uncle Henry"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038109"},
{"url": "https://www.goodreads.com/book/show/5439.Interpreter_of_Maladies", "num_ratings": "138,359", "num_reviews": "9,026", "avg_ratings": 4.13, "genres": ["Short Stories", "Fiction", "Cultural", "India"], "title": "Interpreter of Maladies", "description": ["Navigating between the Indian traditions they've inherited and the baffling new world, the characters in Jhumpa Lahiri's elegant, touching stories seek love beyond the barriers of culture and generations. In \"A Temporary Matter,\" published in ", ", a young Indian-American couple faces the heartbreak of a stillborn birth while their Boston neighborhood copes with", "Navigating between the Indian traditions they've inherited and the baffling new world, the characters in Jhumpa Lahiri's elegant, touching stories seek love beyond the barriers of culture and generations. In \"A Temporary Matter,\" published in ", ", a young Indian-American couple faces the heartbreak of a stillborn birth while their Boston neighborhood copes with a nightly blackout. In the title story, an interpreter guides an American family through the India of their ancestors and hears an astonishing confession. Lahiri writes with deft cultural insight reminiscent of Anita Desai and a nuanced depth that recalls Mavis Gallant."], "author": "Jhumpa Lahiri", "num_pages": "198", "awards": ["Pulitzer Prize for Fiction (2000)", "PEN/Hemingway Foundation Award (2000)", "Puddly Award for Short Stories (2001)"], "places": ["Boston, Massachusetts", "Kolkata", "Odisha", "Connecticut"], "character_names": ["Dev", "Elliot", "Miranda", "Shobha", "Lilia", "Shukumar", "Mr. Pirzada", "Mr. Das", "Mrs. Das", "Mr. Kapasi", "Boori Maa", "Mrs. Dalal", "Laxmi", "Mrs. Sen", "Sanjeev", "Twinkle"], "language": "English", "publish_date": "2000-05-22 00:00:00", "ISBN": "0618101365"},
{"url": "https://www.goodreads.com/book/show/63837.The_Last_Report_on_the_Miracles_at_Little_No_Horse", "num_ratings": "8,639", "num_reviews": "999", "avg_ratings": 4.18, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Novels"], "title": "The Last Report on the Miracles at Little No Horse", "description": ["This is the story of Father Damien Modeste, priest to his beloved people, the Ojibwe. Modeste, nearing the end of his life, dreads the discovery of his physical identity -- for he is a woman who has lived as a man.", "For more than a half century, Father Damien Modeste has served his beloved people, the Ojibwe, on the remote reservation of Little No Horse. To complicate his fe", "This is the story of Father Damien Modeste, priest to his beloved people, the Ojibwe. Modeste, nearing the end of his life, dreads the discovery of his physical identity -- for he is a woman who has lived as a man.", "For more than a half century, Father Damien Modeste has served his beloved people, the Ojibwe, on the remote reservation of Little No Horse. To complicate his fears, his quiet life changes when a troubled colleague comes to the reservation to investigate the life of the perplexing, difficult, possibly false saint Sister Leopolda. Father Damien alone knows the strange truth of Sister Leopolda's piety and is faced with the most difficult decision of his life: Should he reveal all he knows and risk everything? Or should he manufacture a protective history though he believes Leopolda's wonder-working is motivated by evil?"], "author": "Louise Erdrich", "num_pages": "368", "awards": ["Minnesota Book Award for Novel & Short Story (2002)", "National Book Award Finalist for Fiction (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-12 00:00:00", "ISBN": "0007136358"},
{"url": "https://www.goodreads.com/book/show/91439.The_Beet_Queen", "num_ratings": "11,639", "num_reviews": "483", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "Literary Fiction", "Contemporary"], "title": "The Beet Queen", "description": ["On a spring morning in 1932, young Karl and Mary Adare arrive by boxcar in Argus, North Dakota. After being orphaned in a most peculiar way, they seek refuge in the butcher shop of their aunt and her husband. So begins an exhilarating forty-year saga brimming with colorful, unforgettable characters: ordinary Mary, who will cause a miracle; seductive Karl, who lacks his sis", "On a spring morning in 1932, young Karl and Mary Adare arrive by boxcar in Argus, North Dakota. After being orphaned in a most peculiar way, they seek refuge in the butcher shop of their aunt and her husband. So begins an exhilarating forty-year saga brimming with colorful, unforgettable characters: ordinary Mary, who will cause a miracle; seductive Karl, who lacks his sister's gift for survival; Sita, their lovely but disturbed cousin; and the half-Native American Celestine James, who will become Mary’s best friend. Theirs is a story grounded in the tenacity of relationships, the extraordinary magic of natural events, and the unending mystery of the human condition.", "Bestselling, National Book Award-winning author Louise Erdrich dazzles in this vibrant and heartfelt tale of abandonment and sexual obsession, jealousy and unstinting love that explores with empathy, humor, and power the eternal mystery of the human condition."], "author": "Louise Erdrich", "num_pages": "368", "awards": ["National Book Critics Circle Award Nominee for Fiction (1986)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2017-05-23 00:00:00", "ISBN": "0060835273"},
{"url": "https://www.goodreads.com/book/show/78887.Tracks", "num_ratings": "9,728", "num_reviews": "524", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Academic", "School"], "title": "Tracks", "description": ["Set earliest in time within the cycle of her prizewinning and bestselling books, Love Medicine and The Beet Queen, Tracks takes readers to North Dakota at a time when Indian tribes were struggling to keep what little remained of their land. Features many familiar characters."], "author": "Louise Erdrich", "num_pages": "226", "awards": [], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "1989-08-07 00:00:00", "ISBN": "0060972459"},
{"url": "https://www.goodreads.com/book/show/23129839-octavia-s-brood", "num_ratings": "1,481", "num_reviews": "248", "avg_ratings": 3.95, "genres": ["Short Stories", "Fiction", "Science Fiction", "Feminism", "Fantasy", "Speculative Fiction", "Social Movements", "Social Justice"], "title": "Octavia's Brood: Science Fiction Stories from Social Justice Movements", "description": ["Whenever we envision a world without war, without prisons, without capitalism, we are producing visionary fiction. Organizers and activists envision, and try to create, such worlds all the time. This book brings twenty of them together in the first anthology of short stories to explore the connections between radical speculative fiction and movements for social change. The", "Whenever we envision a world without war, without prisons, without capitalism, we are producing visionary fiction. Organizers and activists envision, and try to create, such worlds all the time. This book brings twenty of them together in the first anthology of short stories to explore the connections between radical speculative fiction and movements for social change. The visionary tales of ", " span genres—sci-fi, fantasy, horror, magical realism—but all are united by an attempt to experiment with new ways of understanding ourselves, the world around us, and all the selves and worlds that could be. The collection is rounded off with essays by Tananarive Due and Mumia Abu-Jamal, and a foreword by Sheree Renée Thomas."], "author": "adrienne maree brown", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-15 00:00:00", "ISBN": "1849352097"},
{"url": "https://www.goodreads.com/book/show/52528.The_Painted_Drum", "num_ratings": "6,372", "num_reviews": "793", "avg_ratings": 3.85, "genres": ["Fiction", "Historical", "Historical Fiction", "Audiobook"], "title": "The Painted Drum", "description": ["When a woman named Faye Travers is called upon to appraise the estate of a family in her small New Hampshire town, she isn't surprised to discover a forgotten cache of valuable Native American artifacts. After all, the family descends from an Indian agent who worked on the North Dakota Ojibwe reservation that is home to her mother's family. However, she stops dead in her t", "When a woman named Faye Travers is called upon to appraise the estate of a family in her small New Hampshire town, she isn't surprised to discover a forgotten cache of valuable Native American artifacts. After all, the family descends from an Indian agent who worked on the North Dakota Ojibwe reservation that is home to her mother's family. However, she stops dead in her tracks when she finds in the collection a rare drum—a powerful yet delicate object, made from a massive moose skin stretched across a hollow of cedar, ornamented with symbols she doesn't recognize and dressed in red tassels and a beaded belt and skirt—especially since, without touching the instrument, she hears it sound. And so begins an illuminating journey both backward and forward in time, following the strange passage of a powerful yet delicate instrument, and revealing the extraordinary lives it has touched and defined.", "Compelling and unforgettable, bestselling author Louise Erdrich's ", " explores the often fraught relationship between mothers and daughters, the strength of family, and the intricate rhythms of grief with all the grace, wit, and startling beauty that characterizes this acclaimed author's finest work."], "author": "Louise Erdrich", "num_pages": "304", "awards": ["Chicago Tribune Heartland Prize for Fiction (2006)", "Minnesota Book Award for Novel & Short Story (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-22 00:00:00", "ISBN": "0060515112"},
{"url": "https://www.goodreads.com/book/show/11334.Song_of_Solomon", "num_ratings": "70,114", "num_reviews": "2,636", "avg_ratings": 4.03, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Literature"], "title": "Song of Solomon", "description": ["Milkman Dead was born shortly after a neighborhood eccentric hurled himself off a rooftop in a vain attempt at flight. For the rest of his life he, too, will be trying to fly. With this brilliantly imagined novel, Toni Morrison transfigures the coming-of-age story as audaciously as Saul Bellow or Gabriel García Márquez. As she follows Milkman from his rustbelt city to the", "Milkman Dead was born shortly after a neighborhood eccentric hurled himself off a rooftop in a vain attempt at flight. For the rest of his life he, too, will be trying to fly. With this brilliantly imagined novel, Toni Morrison transfigures the coming-of-age story as audaciously as Saul Bellow or Gabriel García Márquez. As she follows Milkman from his rustbelt city to the place of his family’s origins, Morrison introduces an entire cast of strivers and seeresses, liars and assassins, the inhabitants of a fully realized black world."], "author": "Toni Morrison", "num_pages": "337", "awards": ["Janet Heidinger Kafka Prize (1977)", "National Book Critics Circle Award for Fiction (1977)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "140003342X"},
{"url": "https://www.goodreads.com/book/show/13211.And_Still_I_Rise", "num_ratings": "3,863", "num_reviews": "293", "avg_ratings": 4.4, "genres": ["Poetry", "Classics", "Nonfiction", "Feminism", "Cultural", "African American"], "title": "And Still I Rise", "description": ["In this inspiring poem, Maya Angelou celebrates the courage of the human spirit over the harshest of obstacles. An ode to the power that resides in us all to overcome the most difficult circumstances, this poem is truly an inspiration and affirmation of the faith that restores and nourishes the soul. Entwined with the vivid paintings of Diego Rivera, the renowned Mexican a", "In this inspiring poem, Maya Angelou celebrates the courage of the human spirit over the harshest of obstacles. An ode to the power that resides in us all to overcome the most difficult circumstances, this poem is truly an inspiration and affirmation of the faith that restores and nourishes the soul. Entwined with the vivid paintings of Diego Rivera, the renowned Mexican artist, Angelou's words paint a portrait of the amazing human spirit, its quiet dignity, and pools of strength and courage. ", "An ideal gift for a friend, lover, or family member, this special edition will be treasured by all who receive it."], "author": "Maya Angelou", "num_pages": "54", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-08-07 00:00:00", "ISBN": "0375505962"},
{"url": "https://www.goodreads.com/book/show/13214.I_Know_Why_the_Caged_Bird_Sings", "num_ratings": "322,031", "num_reviews": "7,764", "avg_ratings": 4.21, "genres": ["Nonfiction", "Classics", "Autobiography", "Memoir", "Biography", "Biography", "Autobiography"], "title": "I Know Why the Caged Bird Sings", "description": ["Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Yea", "Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Years later, in San Francisco, Maya learns that love for herself, the kindness of others, her own strong spirit, and the ideas of great authors (\"I met and fell in love with William Shakespeare\") will allow her to be free instead of imprisoned.", "Poetic and powerful, ", " will touch hearts and change minds for as long as people read."], "author": "Maya Angelou", "num_pages": "246", "awards": ["Coretta Scott King Award for Author Honor (1971)"], "places": ["Arkansas", "Louisiana", "California", "Missouri"], "character_names": ["Marguerite Johnson 'Maya'", "Bailey Johnson Jr.", "Annie Henderson 'Momma'", "Uncle Willie", "Bailey Johnson", "Vivian Baxter"], "language": "English", "publish_date": "1993-11-12 00:00:00", "ISBN": "0553279378"},
{"url": "https://www.goodreads.com/book/show/11486.The_Color_Purple", "num_ratings": "435,349", "num_reviews": "11,068", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "295", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "0671727796"},
{"url": "https://www.goodreads.com/book/show/19286587-island-of-a-thousand-mirrors", "num_ratings": "2,631", "num_reviews": "503", "avg_ratings": 3.96, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Asia", "War", "Literary Fiction"], "title": "Island of a Thousand Mirrors", "description": ["A stunning literary debut of two young women on opposing sides of the devastating Sri Lankan Civil War—winner of the Commonwealth Book Prize for Asia, longlisted for the Man Asian Literary Prize ", "Before violence tore apart the tapestry of Sri Lanka and turned its pristine beaches red, there were two families. Yasodhara tells the story of her own Sinhala family, rich in love", "A stunning literary debut of two young women on opposing sides of the devastating Sri Lankan Civil War—winner of the Commonwealth Book Prize for Asia, longlisted for the Man Asian Literary Prize ", "Before violence tore apart the tapestry of Sri Lanka and turned its pristine beaches red, there were two families. Yasodhara tells the story of her own Sinhala family, rich in love, with everything they could ask for. As a child in idyllic Colombo, Yasodhara's and her siblings' lives are shaped by social hierarchies, their parents' ambitions, teenage love and, subtly, the differences between the Tamil and Sinhala people—but this peace is shattered by the tragedies of war. Yasodhara's family escapes to Los Angeles. But Yasodhara's life has already become intertwined with a young Tamil girl's… ", "Saraswathie is living in the active war zone of Sri Lanka, and hopes to become a teacher. But her dreams for the future are abruptly stamped out when she is arrested by a group of Sinhala soldiers and pulled into the very heart of the conflict that she has tried so hard to avoid – a conflict that, eventually, will connect her and Yasodhara in unexpected ways. ", "In the tradition of Michael Ondatjee's Anil's Ghost and Arundhati Roy's The God of Small Things, Island of a Thousand Mirrors is an emotionally resonant saga of cultural heritage, heartbreaking conflict and deep family bonds. Narrated in two unforgettably authentic voices and spanning the entirety of the decades-long civil war, it offers an unparalleled portrait of a beautiful land during its most difficult moment by a spellbinding new literary talent who promises tremendous things to come."], "author": "Nayomi Munaweera", "num_pages": "256", "awards": ["Man Asian Literary Prize Nominee (2012)", "Commonwealth Writers' Prize for Asia (2013)", "DSC Prize Nominee for South Asian Literature (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-02 00:00:00", "ISBN": "125004393X"},
{"url": "https://www.goodreads.com/book/show/33917.The_Namesake", "num_ratings": "204,296", "num_reviews": "10,541", "avg_ratings": 3.97, "genres": ["Fiction", "Cultural", "India", "Contemporary"], "title": "The Namesake", "description": ["Jhumpa Lahiri's ", " established this young writer as one the most brilliant of her generation. Her stories are one of the very few debut works -- and only a handful of collections -- to have won the Pulitzer Prize for fiction. Among the many other awards and honors it received were the New Yorker Debut of the Year award, the PEN/Hemingway Award, and the", "Jhumpa Lahiri's ", " established this young writer as one the most brilliant of her generation. Her stories are one of the very few debut works -- and only a handful of collections -- to have won the Pulitzer Prize for fiction. Among the many other awards and honors it received were the New Yorker Debut of the Year award, the PEN/Hemingway Award, and the highest critical praise for its grace, acuity, and compassion in detailing lives transported from India to America.", "In ", ", Lahiri enriches the themes that made her collection an international bestseller: the immigrant experience, the clash of cultures, the conflicts of assimilation, and, most poignantly, the tangled ties between generations. Here again Lahiri displays her deft touch for the perfect detail — the fleeting moment, the turn of phrase — that opens whole worlds of emotion.", " takes the Ganguli family from their tradition-bound life in Calcutta through their fraught transformation into Americans. On the heels of their arranged wedding, Ashoke and Ashima Ganguli settle together in Cambridge, Massachusetts. An engineer by training, Ashoke adapts far less warily than his wife, who resists all things American and pines for her family. When their son is born, the task of naming him betrays the vexed results of bringing old ways to the new world. Named for a Russian writer by his Indian parents in memory of a catastrophe years before, Gogol Ganguli knows only that he suffers the burden of his heritage as well as his odd, antic name. ", "Lahiri brings great empathy to Gogol as he stumbles along the first-generation path, strewn with conflicting loyalties, comic detours, and wrenching love affairs. With penetrating insight, she reveals not only the defining power of the names and expectations bestowed upon us by our parents, but also the means by which we slowly, sometimes painfully, come to define ourselves."], "author": "Jhumpa Lahiri", "num_pages": "291", "awards": ["Orange Prize Nominee for Fiction Longlist (2004)"], "places": [], "character_names": ["Ashoke Ganguli", "Ashima Ganguli", "Gogol/Nikhil Ganguli", "Sonia/Sonali Ganguli", "Maxine", "Moushumi Mazoomdar"], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "0618485228"},
{"url": "https://www.goodreads.com/book/show/17851885-i-am-malala", "num_ratings": "290,487", "num_reviews": "16,808", "avg_ratings": 4.09, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Feminism"], "title": "I Am Malala: The Story of the Girl Who Stood Up for Education and Was Shot by the Taliban", "description": ["When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at p", "When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at point-blank range while riding the bus home from school, and few expected her to survive. ", "Instead, Malala's miraculous recovery has taken her on an extraordinary journey from a remote valley in northern Pakistan to the halls of the United Nations in New York. At sixteen, she has become a global symbol of peaceful protest and the youngest-ever Nobel Peace Prize laureate.", " is the remarkable tale of a family uprooted by global terrorism, of the fight for girls' education, of a father who, himself a school owner, championed and encouraged his daughter to write and attend school, and of brave parents who have a fierce love for their daughter in a society that prizes sons."], "author": "Malala Yousafzai", "num_pages": "327", "awards": ["Lincoln Award Nominee (2017)", "Goodreads Choice Award for Memoir & Autobiography (2013)"], "places": ["Lembah Swat"], "character_names": ["Malala Yousafzai"], "language": "English", "publish_date": "2013-10-08 00:00:00", "ISBN": "0316322407"},
{"url": "https://www.goodreads.com/book/show/11337.The_Bluest_Eye", "num_ratings": "130,552", "num_reviews": "5,687", "avg_ratings": 4.0, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Cultural", "African American", "Literature"], "title": "The Bluest Eye", "description": [" is Toni Morrison's first novel, a book heralded for its richness of language and boldness of vision. Set in the author's girlhood hometown of Lorain, Ohio, it tells the story of black, eleven-year-old Pecola Breedlove. Pecola prays for her eyes to turn blue so that she will be as beautiful and beloved as all the blond, blue-eyed children in America. In the a", " is Toni Morrison's first novel, a book heralded for its richness of language and boldness of vision. Set in the author's girlhood hometown of Lorain, Ohio, it tells the story of black, eleven-year-old Pecola Breedlove. Pecola prays for her eyes to turn blue so that she will be as beautiful and beloved as all the blond, blue-eyed children in America. In the autumn of 1941, the year the marigolds in the Breedloves' garden do not bloom. Pecola's life does change- in painful, devastating ways.", "What its vivid evocation of the fear and loneliness at the heart of a child's yearning, and the tragedy of its fulfillment. ", " remains one of Tony Morrisons's most powerful, unforgettable novels- and a significant work of American fiction."], "author": "Toni Morrison", "num_pages": "216", "awards": ["National Book Critics Circle Award"], "places": ["United States of America", "Lorain, Ohio"], "character_names": ["Pauline Breedlove", "Cholly Breedlove", "Pecola Breedlove"], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0452287065"},
{"url": "https://www.goodreads.com/book/show/6952.Like_Water_for_Chocolate", "num_ratings": "297,470", "num_reviews": "7,289", "avg_ratings": 3.94, "genres": ["Fiction", "Romance", "Magical Realism", "Historical", "Historical Fiction", "Classics", "Fantasy", "Food and Drink", "Food"], "title": "Like Water for Chocolate", "description": ["Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico became a best-selling phenomenon with its winning blend of poignant romance and bittersweet wit.", "The number one bestseller in Mexico and America for almost two years, and subsequently a bestseller around the world, ", " is a romantic, poignant tale, touched with", "Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico became a best-selling phenomenon with its winning blend of poignant romance and bittersweet wit.", "The number one bestseller in Mexico and America for almost two years, and subsequently a bestseller around the world, ", " is a romantic, poignant tale, touched with moments of magic, graphic earthiness, bittersweet wit - and recipes. ", "A sumptuous feast of a novel, it relates the bizarre history of the all-female De La Garza family. Tita, the youngest daughter of the house, has been forbidden to marry, condemned by Mexican tradition to look after her mother until she dies. But Tita falls in love with Pedro, and he is seduced by the magical food she cooks. In desperation, Pedro marries her sister Rosaura so that he can stay close to her, so that Tita and Pedro are forced to circle each other in unconsummated passion. Only a freakish chain of tragedies, bad luck and fate finally reunite them against all the odds."], "author": "Laura Esquivel", "num_pages": "221", "awards": ["Prêmio Jabuti for Tradução (1994)", "American Booksellers Book Of The Year  Award for Adult Trade (1994)"], "places": ["Mexico"], "character_names": ["Tita de la Garza", "Gertrudis de la Garza", "Rosaura de la Garza", "Mamá Elena", "Pedro Muzquiz", "John Brown", "Nacha", "Chencha", "Juan Alejandrez"], "language": "English", "publish_date": "1996-10-01 00:00:00", "ISBN": "0552995878"},
{"url": "https://www.goodreads.com/book/show/34091699-the-victoria-in-my-head", "num_ratings": "208", "num_reviews": "55", "avg_ratings": 3.94, "genres": ["Contemporary", "Young Adult", "Romance", "Music"], "title": "The Victoria in My Head", "description": ["Victoria Cruz inhabits two worlds: In one, she is a rock star, thrashing the stage with her husky voice and purple-streaked hair. In the other, currently serving as her reality, Victoria is a shy teenager with overprotective Cuban parents, who sleepwalks through her life at the prestigious Evanston Academy. Unable to overcome the whole paralyzing-stage-fright thing, Victor", "Victoria Cruz inhabits two worlds: In one, she is a rock star, thrashing the stage with her husky voice and purple-streaked hair. In the other, currently serving as her reality, Victoria is a shy teenager with overprotective Cuban parents, who sleepwalks through her life at the prestigious Evanston Academy. Unable to overcome the whole paralyzing-stage-fright thing, Victoria settles for living inside her fantasies, where nothing can go wrong and everything is set to her expertly crafted music playlists.", "But after a chance encounter with an unattainably gorgeous boy named Strand, whose band seeks a lead singer, Victoria is tempted to turn her fevered daydreams into reality. To do that, she must confront her insecurities and break away from the treadmill that is her life. Suddenly, Victoria is faced with the choice of staying on the path she’s always known and straying off-course to find love, adventure, and danger.", "From debut author Janelle Milanes comes a hilarious and heartfelt tale of the spectacular things that can happen when you go after what you really want."], "author": "Janelle Milanes", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-19 00:00:00", "ISBN": "1481480898"},
{"url": "https://www.goodreads.com/book/show/18749.Half_of_a_Yellow_Sun", "num_ratings": "69,327", "num_reviews": "6,158", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21", "Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed. ", "With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another. ", "Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had."], "author": "Chimamanda Ngozi Adichie", "num_pages": "433", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "1400044162"},
{"url": "https://www.goodreads.com/book/show/7763.The_Joy_Luck_Club", "num_ratings": "548,144", "num_reviews": "7,382", "avg_ratings": 3.91, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Cultural", "China", "Contemporary"], "title": "The Joy Luck Club", "description": ["In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her se", "In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her secrets, trying to unravel the truth about her life, the strings become more tangled, more entwined..."], "author": "Amy Tan", "num_pages": "288", "awards": ["California Book Award for Fiction (Gold) (1989)", "Los Angeles Times Book Prize Nominee for Fiction (1989)", "Northern California Book Awards for Fiction (1989)", "National Book Critics Circle Award Nominee for Fiction (1989)", "National Book Award Finalist for Fiction (1989)"], "places": ["San Francisco, California", "China"], "character_names": ["Suyuan Woo", "June Woo", "Lindo Jong", "Waverly Jong", "An-Mei Hsu", "Rose Hsu Jordan", "Ying-Ying St. Clair", "Lena St. Clair"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038095"},
{"url": "https://www.goodreads.com/book/show/30112502-the-woman-who-breathed-two-worlds", "num_ratings": "3,955", "num_reviews": "359", "avg_ratings": 4.12, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "Asia"], "title": "The Woman Who Breathed Two Worlds", "description": ["Facing challenges in an increasingly colonial world, Chye Hoon, a rebellious young girl, must learn to embrace her mixed Malayan-Chinese identity as a Nyonya—and her destiny as a cook, rather than following her first dream of attending school like her brother.", "Amidst the smells of chillies and garlic frying, Chye Hoon begins to appreciate the richness of her traditions, eve", "Facing challenges in an increasingly colonial world, Chye Hoon, a rebellious young girl, must learn to embrace her mixed Malayan-Chinese identity as a Nyonya—and her destiny as a cook, rather than following her first dream of attending school like her brother.", "Amidst the smells of chillies and garlic frying, Chye Hoon begins to appreciate the richness of her traditions, eventually marrying Wong Peng Choon, a Chinese man. Together, they have ten children. At last, she can pass on the stories she has heard—magical tales of men from the sea—and her warrior’s courage, along with her wonderful ", " (cakes).", "But the cultural shift towards the West has begun. Chye Hoon finds herself afraid of losing the heritage she so prizes as her children move more and more into the modernising Western world."], "author": "Selina Siak Chin Yoke", "num_pages": "474", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-11-01 00:00:00", "ISBN": "1503939340"},
{"url": "https://www.goodreads.com/book/show/33859098-when-the-future-comes-too-soon", "num_ratings": "417", "num_reviews": "62", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Asia", "Historical"], "title": "When the Future Comes Too Soon", "description": ["In Japanese-occupied Malaya, lives are shattered and a woman discovers her inner strength in a world ravaged by war.", "Following the death of their matriarch, the lives of Chye Hoon’s family turned upside down. Now that the British have fled and the Japanese have conquered, their once-benign world changes overnight.", "Amid the turmoil, Chye Hoon’s daughter-in-law, Mei Foong, mus", "In Japanese-occupied Malaya, lives are shattered and a woman discovers her inner strength in a world ravaged by war.", "Following the death of their matriarch, the lives of Chye Hoon’s family turned upside down. Now that the British have fled and the Japanese have conquered, their once-benign world changes overnight.", "Amid the turmoil, Chye Hoon’s daughter-in-law, Mei Foong, must fend for her family as her husband, Weng Yu, becomes increasingly embittered. Challenged in ways she never could have imagined and forced into hiding, Mei Foong finds a deep reservoir of resilience she did not know she had and soon draws the attentions of another man.", "Is Mei Foong’s resolve enough to save herself, her marriage, and her family? Only when peace returns to Malaya will she learn the full price she must pay for survival."], "author": "Selina Siak Chin Yoke", "num_pages": "322", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-07-18 00:00:00"}
]