[
{"url": "https://www.goodreads.com/book/show/17257686-book-uncle-and-me", "num_ratings": "407", "num_reviews": "113", "avg_ratings": 3.9, "genres": ["Childrens", "Middle Grade", "Childrens", "Realistic Fiction", "Fiction", "Cultural", "India"], "title": "Book Uncle and Me", "description": ["Nine-year-old Yasmin intends to read a book a day for the rest of her life. Book Uncle, who runs a free lending library on the street corner, always has the perfect book for her. But when Book Uncle seems to be in trouble, Yasmin has to take her nose out of her book and do something. With the elections coming up and the grown-ups busy with their own affairs, what differenc", "Nine-year-old Yasmin intends to read a book a day for the rest of her life. Book Uncle, who runs a free lending library on the street corner, always has the perfect book for her. But when Book Uncle seems to be in trouble, Yasmin has to take her nose out of her book and do something. With the elections coming up and the grown-ups busy with their own affairs, what difference can Yasmin and her friends possibly make? Will they get help from Karate Samuel, the eccentric superstar who's standing for Mayor? Yasmin gets to work, ideas begin to fly like feathers, and soon everything starts to spin out of control."], "author": "Uma Krishnaswami", "num_pages": "103", "awards": ["Crossword Book Award for Children's Literature (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-12 00:00:00", "ISBN": "8184778503"},
{"url": "https://www.goodreads.com/book/show/3606114-refugees", "num_ratings": "78", "num_reviews": "19", "avg_ratings": 3.36, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "Historical", "Historical Fiction"], "title": "Refugees", "description": ["Two teenagers on opposite sides of the globe flee everything they know. In a world turned upside down by tragedy, they are refugees.", "Sixteen-year-old Dawn runs away from her unhappy foster home in California and travels to New York City. Johar, an Afghani teenager, sees his world crumble before him. He flees his war-ravaged village and the Taliban, and mak", "Two teenagers on opposite sides of the globe flee everything they know. In a world turned upside down by tragedy, they are refugees.", "Sixteen-year-old Dawn runs away from her unhappy foster home in California and travels to New York City. Johar, an Afghani teenager, sees his world crumble before him. He flees his war-ravaged village and the Taliban, and makes a dangerous trek to a refugee camp in Pakistan. Thanks to his knowledge of English, Johar finds a job at the camp assisting Louise, the Red Cross doctor—and Dawn’s foster mother. Through e-mails and phone calls, Dawn and Johar begin to share and protect each other’s secrets, fears, and dreams, and a remarkable bond forms that gives each of them hope and the courage to find a path home."], "author": "Catherine Stine", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-02-08 00:00:00", "ISBN": "0385731795"},
{"url": "https://www.goodreads.com/book/show/25893705-fifteen-lanes", "num_ratings": "319", "num_reviews": "109", "avg_ratings": 3.91, "genres": ["Young Adult", "Contemporary", "Realistic Fiction", "Fiction", "Cultural", "Cultural", "India"], "title": "Fifteen Lanes", "description": ["Noor has lived all of her fourteen years in the fifteen lanes of Mumbai’s red light district. Born into a brothel, she is destined for the same fate as her mother: a desperate life trapped in the city’s sex trade. She must act soon to have any chance of escaping this grim future.", "Across the sprawling city, fifteen-year-old Grace enjoys a life of privilege. Her father, the C", "Noor has lived all of her fourteen years in the fifteen lanes of Mumbai’s red light district. Born into a brothel, she is destined for the same fate as her mother: a desperate life trapped in the city’s sex trade. She must act soon to have any chance of escaping this grim future.", "Across the sprawling city, fifteen-year-old Grace enjoys a life of privilege. Her father, the CEO of one of India’s largest international banks, has brought his family to Mumbai where they live in unparalleled luxury. But Grace’s seemingly perfect life is shattered when she becomes a victim of a cruel online attack.", "When their paths intersect, Noor and Grace will be changed forever. Can two girls living in vastly different worlds find a common path?"], "author": "S.J. Laidlaw", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-05 00:00:00", "ISBN": "1101917806"},
{"url": "https://www.goodreads.com/book/show/13518789-the-ink-bridge", "num_ratings": "167", "num_reviews": "33", "avg_ratings": 3.62, "genres": ["Young Adult"], "title": "The Ink Bridge", "description": ["Each step becomes a heartbeat and I feel the distance between Omed and me closing. I remember when I first met him - when he had showed me what bravery meant. How he had stood up for what he believed. In the end that had been his undoing. The Ink Bridge is the compelling story of two young men: Omed, an Afghani refugee who flees the Taliban and undertakes a perilous journe", "Each step becomes a heartbeat and I feel the distance between Omed and me closing. I remember when I first met him - when he had showed me what bravery meant. How he had stood up for what he believed. In the end that had been his undoing. The Ink Bridge is the compelling story of two young men: Omed, an Afghani refugee who flees the Taliban and undertakes a perilous journey to seek asylum in Australia; and Hector, an Australian boy afflicted by grief, who has given up on school and retreated into silence. Their paths meet at a candle factory where they both find work. But secrets fester behind the monotonous routine: secrets with terrible consequences. Powerful and compelling, Omed's and Hector's story will grip hold of your heart and not let go. 'A moving story that gives an insight into a well publicised yet unknown issue. The writing was wonderful and made it a pleasure to read.' Jemima, 15 'I loved this novel, not only does it show the reality of life in third world countries but also the purity of human emotions in realistic situations. The way the book is written is awesome.' Matt, 15"], "author": "Neil Grant", "num_pages": "288", "awards": ["Queensland Literary Awards for Young Adult Book (2012)"], "places": ["Australia"], "character_names": [], "language": "English", "publish_date": "2012-03-01 00:00:00", "ISBN": "174237669X"},
{"url": "https://www.goodreads.com/book/show/36086513-amal-unbound", "num_ratings": "1,841", "num_reviews": "436", "avg_ratings": 4.31, "genres": ["Childrens", "Middle Grade", "Realistic Fiction", "Young Adult", "Contemporary", "Fiction"], "title": "Amal Unbound", "description": ["Life is quiet and ordinary in Amal's Pakistani village, but she had no complaints, and besides, she's busy pursuing her dream of becoming a teacher one day. Her dreams are temporarily dashed when—as the eldest daughter—she must stay home from school to take care of her siblings. Amal is upset, but she doesn't lose hope and finds ways to continue learning. Then the unimagin", "Life is quiet and ordinary in Amal's Pakistani village, but she had no complaints, and besides, she's busy pursuing her dream of becoming a teacher one day. Her dreams are temporarily dashed when—as the eldest daughter—she must stay home from school to take care of her siblings. Amal is upset, but she doesn't lose hope and finds ways to continue learning. Then the unimaginable happens—after an accidental run-in with the son of her village's corrupt landlord, Amal must work as his family's servant to pay off her own family's debt. ", "Life at the opulent Khan estate is full of heartbreak and struggle for Amal—especially when she inadvertently makes an enemy of a girl named Nabila. Most troubling, though, is Amal's growing awareness of the Khans' nefarious dealings. When it becomes clear just how far they will go to protect their interests, Amal realizes she will have to find a way to work with others if they are ever to exact change in a cruel status quo, and if Amal is ever to achieve her dreams."], "author": "Aisha Saeed", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-05-08 00:00:00", "ISBN": "0399544682"},
{"url": "https://www.goodreads.com/book/show/13491300-the-best-day-of-my-life", "num_ratings": "93", "num_reviews": "17", "avg_ratings": 3.92, "genres": ["Young Adult", "Realistic Fiction", "Cultural", "Cultural", "India"], "title": "The Best Day of My Life", "description": ["'The best day of my life was the day I found out I was all alone in the world.'Even though Valli spends her days picking coal and fighting with her cousins, life in the coal town of Jharia, India, is the only life she knows. The only sight that fills her with terror is the monsters who live on the other side of the train tracks - the lepers. When Valli discovers that that", "'The best day of my life was the day I found out I was all alone in the world.'Even though Valli spends her days picking coal and fighting with her cousins, life in the coal town of Jharia, India, is the only life she knows. The only sight that fills her with terror is the monsters who live on the other side of the train tracks - the lepers. When Valli discovers that that her 'aunt' is a stranger who was paid money to take Valli off her own family's hands, she leaves Jharia and begins a series of adventures that takes her to Kolkata, the city of the gods. Valli finds that she really doesn't need much to live and is very resourceful. But a chance encounter with a doctor reveals that she has leprosy. Unable to bear the thought that she is one of the monsters she has always feared, Valli rejects help and begins an uncertain life on the street."], "author": "Deborah Ellis", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1628198.Bifocal", "num_ratings": "500", "num_reviews": "56", "avg_ratings": 3.59, "genres": ["Young Adult", "Cultural", "Canada", "Fiction", "Contemporary", "Realistic Fiction", "Novels"], "title": "Bifocal", "description": ["On the White Ravens' Outstanding New International Books for Children and Young Adults list, 2008", "'s Book of the Year Awards Bronze Medal Winner (YA Fiction category), 2007", "Snow Willow Award nominee, 2008", "CCBC's Best Books for Kids and Teens, 2008", "Two bestselling authors join forces to write a powerful novel about racism.", "A student arrested on suspicions of ter", "On the White Ravens' Outstanding New International Books for Children and Young Adults list, 2008", "'s Book of the Year Awards Bronze Medal Winner (YA Fiction category), 2007", "Snow Willow Award nominee, 2008", "CCBC's Best Books for Kids and Teens, 2008", "Two bestselling authors join forces to write a powerful novel about racism.", "A student arrested on suspicions of terrorism. A high school torn apart by racism. Two boys from two different sets of circumstances forced to choose sides.", "These are the issues at the heart of ", ", a ground-breaking new novel for young-adults.", "The story is told from two different points of view. Haroon is a serious student devoted to his family. His grandparents emigrated from Afghanistan. Jay is a football star devoted to his team. He is white.", "One day their high school is put on lockdown, and the police arrest a Muslim student on suspicion of terrorist affiliations. He might be guilty. Or is he singled out because of his race?", "The entire student body fragments along racial lines and both Haroon and Jay find that their differences initially put them at odds. The Muslim students become targets and a smoke-bomb is set off near their lockers while Jay and his teammates believe they've been set-up to look like racists.", " is, by no stretch, an easy book. Award-winning authors Deborah Ellis and Eric Walters deliver a serious, hard-hitting book about racism that does not talk down to young people."], "author": "Deborah Ellis", "num_pages": "273", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-01 00:00:00", "ISBN": "155455036X"},
{"url": "https://www.goodreads.com/book/show/13584773-my-name-is-parvana", "num_ratings": "1,704", "num_reviews": "194", "avg_ratings": 4.14, "genres": ["Young Adult", "Realistic Fiction", "Historical", "Historical Fiction", "War", "Fiction"], "title": "My Name Is Parvana", "description": ["On a military base in post-Taliban Afghanistan, American authorities have just imprisoned a teenaged girl found in a bombed-out school. The army major thinks she may be a terrorist working with the Taliban. The girl does not respond to questions in any language and remains silent, even when she is threatened, harassed and mistreated over several days. The only clue to her", "On a military base in post-Taliban Afghanistan, American authorities have just imprisoned a teenaged girl found in a bombed-out school. The army major thinks she may be a terrorist working with the Taliban. The girl does not respond to questions in any language and remains silent, even when she is threatened, harassed and mistreated over several days. The only clue to her identity is a tattered shoulder bag containing papers that refer to people named Shauzia, Nooria, Leila, Asif, Hassan — and Parvana.", "In this long-awaited sequel to ", " Parvana is now fifteen years old. As she waits for foreign military forces to determine her fate, she remembers the past four years of her life. Reunited with her mother and sisters, she has been living in a village where her mother has finally managed to open a school for girls. But even though the Taliban has been driven from the government, the country is still at war, and many continue to view the education and freedom of girls and women with suspicion and fear.", "As her family settles into the routine of running the school, Parvana, a bit to her surprise, finds herself restless and bored. She even thinks of running away. But when local men threaten the school and her family, she must draw on every ounce of bravery and resilience she possesses to survive the disaster that kills her mother, destroys the school, and puts her own life in jeopardy.", "A riveting page-turner, Deborah Ellis’s new novel is at once harrowing, inspiring and thought-provoking. And, yes, in the end, Parvana is reunited with her childhood friend, Shauzia."], "author": "Deborah Ellis", "num_pages": "201", "awards": ["OLA Forest of Reading Red Maple Award Nominee for Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-01 00:00:00", "ISBN": "1554982979"},
{"url": "https://www.goodreads.com/book/show/515475.Mud_City", "num_ratings": "3,206", "num_reviews": "231", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Realistic Fiction", "Childrens", "War", "Childrens", "Middle Grade", "Young Adult", "Teen", "Childrens", "Juvenile", "Cultural"], "title": "Mud City", "description": ["Parvana's best friend, fourteen-year-old Shauzia, has escaped the misery of her life in Kabul, only to end up in a refugee camp in Pakistan. Shauzia finally decides to leave the camp and try her luck on the streets. She is determined to earn money", "Parvana's best friend, fourteen-year-old Shauzia, has escaped the misery of her life in Kabul, only to end up in a refugee camp in Pakistan. Shauzia finally decides to leave the camp and try her luck on the streets. She is determined to earn money to buy her passage out of the country. An incident with a dishonest man lands her in jail, where she spends the night, terrified and despairing, before well-meaning Americans she met when she was begging rescue her. They take her to their home in a residential part of Peshawar, and for a time she has a taste of a life where children have food to eat and warm beds and toys to play with, and she feels safe for the first time. But just when she thinks the family will ask her to stay with them, disaster ensues, and Shauzia finds herself driven back to the refugee camp, where she discovers the old choices are not so easy any more.", "This is a powerful and very human story of a feisty, driven girl who tries to take control of her own life.", "A map, glossary and author's note provide young readers with background and context. Royalties from the sale of this book will go to Street Kids International."], "author": "Deborah Ellis", "num_pages": "176", "awards": ["Hackmatack Children's Choice Award for English Fiction (2005)"], "places": ["Afghanistan", "Pakistan"], "character_names": [], "language": "English", "publish_date": "2003-09-01 00:00:00", "ISBN": "0888995423"},
{"url": "https://www.goodreads.com/book/show/834019.Parvana_s_Journey", "num_ratings": "5,800", "num_reviews": "477", "avg_ratings": 4.07, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Realistic Fiction", "War"], "title": "Parvana's Journey", "description": ["In ", ", the Taliban still control Afghanistan, but Kabul is in ruins. Parvana's father has just died, and her mother, sister, and brother could be anywhere in the country. Parvana knows she must find them. Despite her youth, Parvana sets out alone, masquerading as a boy. She soon meets other children who are victims of war -- an infant boy in a bombed-out vil", "In ", ", the Taliban still control Afghanistan, but Kabul is in ruins. Parvana's father has just died, and her mother, sister, and brother could be anywhere in the country. Parvana knows she must find them. Despite her youth, Parvana sets out alone, masquerading as a boy. She soon meets other children who are victims of war -- an infant boy in a bombed-out village, a nine-year-old girl who thinks she has magic powers over landmines, and a boy with one leg. The children travel together, forging a kind of family out of sheer need. The strength of their bond makes it possible to survive the most desperate conditions.", "All royalties from the sale of this book will go to Women for Women, an organization that helps women in Afghanistan."], "author": "Deborah Ellis", "num_pages": "199", "awards": ["Jane Addams Children's Book Award for Older Children (2003)", "Ruth and Sylvia Schwartz Children's Book Award for Adult Middle Reader (2003)"], "places": ["Afghanistan"], "character_names": [], "language": "English", "publish_date": "2002-10-01 00:00:00", "ISBN": "0888995199"},
{"url": "https://www.goodreads.com/book/show/828015.The_Breadwinner", "num_ratings": "16,280", "num_reviews": "1,753", "avg_ratings": 3.95, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Realistic Fiction", "Academic", "School", "Childrens"], "title": "The Breadwinner", "description": ["Since the Taliban took over Afghanistan, 11-year-old Parvana has rarely been outdoors. Barred from attending school, shopping at the market, or even playing in the streets of Kabul, the heroine of Deborah Ellis's engrossing children's novel ", " is trapped inside her family's one-room home. That is, until the Taliban hauls away her father and Parvana realizes th", "Since the Taliban took over Afghanistan, 11-year-old Parvana has rarely been outdoors. Barred from attending school, shopping at the market, or even playing in the streets of Kabul, the heroine of Deborah Ellis's engrossing children's novel ", " is trapped inside her family's one-room home. That is, until the Taliban hauls away her father and Parvana realizes that it's up to her to become the \"breadwinner\" and disguise herself as a boy to support her mother, two sisters, and baby brother. Set in the early years of the Taliban regime, this topical novel for middle readers explores the harsh realities of life for girls and women in modern-day Afghanistan. A political activist whose first book for children, ", ", dealt with poverty in Toronto, Ellis based ", " on the true-life stories of women in Afghan refugee camps. "], "author": "Deborah Ellis", "num_pages": "171", "awards": ["Manitoba Young Readers' Choice Award (2002)", "Hackmatack Children's Choice Award for English Fiction (2003)", "Rocky Mountain Book Award (2003)"], "places": ["Afghanistan"], "character_names": ["Parvana", "Nooria"], "language": "English", "publish_date": "2001-10-25 00:00:00", "ISBN": "0888994168"},
{"url": "https://www.goodreads.com/book/show/11460347-no-ordinary-day", "num_ratings": "857", "num_reviews": "185", "avg_ratings": 3.94, "genres": ["Realistic Fiction", "Fiction", "Cultural", "India", "Young Adult", "Childrens", "Middle Grade", "Cultural"], "title": "No Ordinary Day", "description": ["Even though Valli spends her days picking coal and fighting with her cousins, life in the coal town of Jharia, India, is the only life she knows. The only sight that fills her with terror is the monsters who live on the other side of the train tracks — the lepers. When Valli discovers that that her “aunt” is a stranger who was paid money to take Valli off her own family’s", "Even though Valli spends her days picking coal and fighting with her cousins, life in the coal town of Jharia, India, is the only life she knows. The only sight that fills her with terror is the monsters who live on the other side of the train tracks — the lepers. When Valli discovers that that her “aunt” is a stranger who was paid money to take Valli off her own family’s hands, she leaves Jharia and begins a series of adventures that takes her to Kolkata, the city of the gods. Valli finds that she really doesn’t need much to live and is very resourceful. But a chance encounter with a doctor reveals that she has leprosy. Unable to bear the thought that she is one of the monsters she has always feared, Valli rejects help and begins an uncertain life on the street."], "author": "Deborah Ellis", "num_pages": "160", "awards": ["CLA Book of the Year for Children Award Nominee (2012)", "OLA Forest of Reading Golden Oak Award Nominee (2013)", "South Asia Book Award Nominee for Grades 6 & Above (2012)"], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2011-09-10 00:00:00", "ISBN": "1554981344"},
{"url": "https://www.goodreads.com/book/show/1203008.Camel_Rider", "num_ratings": "380", "num_reviews": "80", "avg_ratings": 3.39, "genres": ["Young Adult", "Academic", "School", "Childrens", "Middle Grade"], "title": "Camel Rider", "description": ["War has broken out in the Middle East and all foreigners are fleeing. Instead of escaping with his neighbors, Adam sneaks off to save his dog, which has been left behind. Lost in the desert, Adam meets Walid, an abused camel boy who is on the run. Together they struggle to survive the elements and elude the revengeful master from whom Walid has fled. Cultural and language", "War has broken out in the Middle East and all foreigners are fleeing. Instead of escaping with his neighbors, Adam sneaks off to save his dog, which has been left behind. Lost in the desert, Adam meets Walid, an abused camel boy who is on the run. Together they struggle to survive the elements and elude the revengeful master from whom Walid has fled. Cultural and language barriers are wide, but with ingenuity and determination the two boys bridge their differences, helping each other to survive and learn what true friendship is."], "author": "Prue Mason", "num_pages": "208", "awards": ["Queensland Premier's Literary Awards for Children's Book (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-07-01 00:00:00", "ISBN": "1580893147"},
{"url": "https://www.goodreads.com/book/show/1104246.Naming_Maya", "num_ratings": "85", "num_reviews": "13", "avg_ratings": 3.48, "genres": ["Cultural", "Cultural", "India", "Family", "Young Adult"], "title": "Naming Maya", "description": ["Although Maya has done her best to avoid it, she is spending part of her summer in Chennai, India, with her mother, who is trying to sell her grandfather's old house. Soon Maya is drawn into a complicated friendship with eccentric Kamala Mami, who has been a housekeeper and cook for years in Maya's extended family. At the same time, Maya is thrust into an oc", "Although Maya has done her best to avoid it, she is spending part of her summer in Chennai, India, with her mother, who is trying to sell her grandfather's old house. Soon Maya is drawn into a complicated friendship with eccentric Kamala Mami, who has been a housekeeper and cook for years in Maya's extended family. At the same time, Maya is thrust into an ocean of memories, all coming at her too quickly for her to understand. In particular, she is forced to examine the history of her parents' divorce -- all the more painful because she believes the trouble began with the choosing of her name. For years the tension has simmered in a cauldron of anxiety, secrets, and misunderstandings. It is only with the help of Kamala Mami and Maya's cousin Sumati that Maya is able to see what happened to her parents. ", "In this compelling first novel, a young Indian American girl finally learns that she can choose which memories to keep and which to let go."], "author": "Uma Krishnaswami", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-06 00:00:00", "ISBN": "0374354855"},
{"url": "https://www.goodreads.com/book/show/21929297-tiger-boy", "num_ratings": "240", "num_reviews": "57", "avg_ratings": 3.94, "genres": ["Childrens", "Middle Grade", "Realistic Fiction", "Cultural", "India", "Fiction", "Animals", "Adventure", "Childrens"], "title": "Tiger Boy", "description": ["When a tiger cub escapes from a nature reserve near Neel’s island village, the rangers and villagers hurry to find her before the cub’s anxious mother follows suit and endangers them all. Mr. Gupta, a rich newcomer to the island, is also searching—he wants to sell the cub’s body parts on the black market. Neel and hi", "When a tiger cub escapes from a nature reserve near Neel’s island village, the rangers and villagers hurry to find her before the cub’s anxious mother follows suit and endangers them all. Mr. Gupta, a rich newcomer to the island, is also searching—he wants to sell the cub’s body parts on the black market. Neel and his sister, Rupa, resolve to find the cub first and bring her back to the reserve where she belongs.", "The hunt for the cub interrupts Neel’s preparations for an exam to win a prestigious scholarship at a boarding school far from home. Neel doesn’t mind—he dreads the exam and would rather stay on his beloved island in the Sunderbans of West Bengal with his family and friends.", "But through his encounter with the cub, Neil learns that sometimes you have to take risks to preserve what you love. And sometimes you have to sacrifice the present for the chance to improve the future."], "author": "Mitali Perkins", "num_pages": "144", "awards": ["NCTE Charlotte Huck Honor Book (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-14 00:00:00", "ISBN": "158089660X"},
{"url": "https://www.goodreads.com/book/show/9504209-vanished", "num_ratings": "391", "num_reviews": "92", "avg_ratings": 3.74, "genres": ["Mystery", "Childrens", "Middle Grade", "Fiction", "Childrens", "Adventure"], "title": "Vanished", "description": ["Eleven-year-old Neela dreams of being a famous musician, performing for admiring crowds on her traditional Indian stringed instrument. Her particular instrument was a gift from her grandmother-intricately carved with a mysterious-looking dragon. ", "When this special family heirloom vanishes from a local church, strange clues surface: a tea kettle ornamented with a familiar po", "Eleven-year-old Neela dreams of being a famous musician, performing for admiring crowds on her traditional Indian stringed instrument. Her particular instrument was a gift from her grandmother-intricately carved with a mysterious-looking dragon. ", "When this special family heirloom vanishes from a local church, strange clues surface: a tea kettle ornamented with a familiar pointy-faced dragon, a threatening note, a connection to a famous dead musician, and even a legendary curse. The clues point all the way to India, where it seems that Neela's instrument has a long history of vanishing and reappearing. Even if Neela does track it down, will she be able to stop it from disappearing again?", "Sheela Chari's debut novel is a finely tuned story of coincidence and fate, trust and deceit, music and mystery."], "author": "Sheela Chari", "num_pages": "336", "awards": ["Asian/Pacific American Award for Literature for Children Honor (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-07-26 00:00:00", "ISBN": "1423131630"},
{"url": "https://www.goodreads.com/book/show/12023617-tina-s-mouth", "num_ratings": "1,467", "num_reviews": "280", "avg_ratings": 3.72, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Fiction", "Sequential Art", "Comics", "Young Adult", "Teen", "Young Adult", "Coming Of Age"], "title": "Tina's Mouth: An Existential Comic Diary", "description": ["In the tradition of ", "and ", ", a wise and funny high school heroine comes of age. ", "Tina M., sophomore, is a wry observer of the cliques and mores of Yarborough Academy, and of the foibles of her Southern California intellectual Indian family. She's on a first-name basis with Jean-Paul Sartre, the result of an English honors class assignment to kee", "In the tradition of ", "and ", ", a wise and funny high school heroine comes of age. ", "Tina M., sophomore, is a wry observer of the cliques and mores of Yarborough Academy, and of the foibles of her Southern California intellectual Indian family. She's on a first-name basis with Jean-Paul Sartre, the result of an English honors class assignment to keep an “existential diary.” ", "Keshni Kashyap’s compulsively readable graphic novel packs in existential high school drama—from Tina getting dumped by her smart-girl ally to a kiss on the mouth (Tina’s mouth, but not technically her first kiss) from a cute skateboarder, Neil Strumminger. And it memorably answers the pressing question: Can an English honors assignment be one fifteen-year-old girl’s path to enlightenment? "], "author": "Keshni Kashyap", "num_pages": "248", "awards": ["Asian/Pacific American Award for Literature for Young Adult (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-03 00:00:00", "ISBN": "0618945199"},
{"url": "https://www.goodreads.com/book/show/25094215-you-re-not-proper", "num_ratings": "27", "num_reviews": "8", "avg_ratings": 3.26, "genres": ["Young Adult"], "title": "You're Not Proper", "description": ["Karen thinks she's not proper white. ", "Her dad is Pakistani and her mother is white Christian, and somehow she feels as if she doesn't quite fit in... anywhere. So she's made a choice: she's switching sides. ", "Karen’s going to convert to Islam to find her true identity. ", "But Shamshad, her Hijab-wearing school mate, isn’t making things easy for her. What's her deal, anyway? Is S", "Karen thinks she's not proper white. ", "Her dad is Pakistani and her mother is white Christian, and somehow she feels as if she doesn't quite fit in... anywhere. So she's made a choice: she's switching sides. ", "Karen’s going to convert to Islam to find her true identity. ", "But Shamshad, her Hijab-wearing school mate, isn’t making things easy for her. What's her deal, anyway? Is Shamshad really any more proper than herself? ", "Trouble and turmoil await in the old textile mill town of Boardhead East, as school battles are replaced by family troubles, name calling turns to physical confrontation and cataclysmic secrets are unveiled. ", "Set against a backdrop of seething Islamaphobia, You're Not Proper is the first in the Striker series, written by Tariq Mahmood to shine a light on issues of identity, religion, politics and class affecting young people today – a unique new series in young adult fiction."], "author": "Tariq Mehmood", "num_pages": "190", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-05-16 00:00:00", "ISBN": "1908446307"},
{"url": "https://www.goodreads.com/book/show/16124553-offside", "num_ratings": "36", "num_reviews": "19", "avg_ratings": 3.11, "genres": ["Young Adult", "Teen", "Young Adult", "Sports and Games", "Sports"], "title": "Offside", "description": ["Between finishing late school projects and looking after her brothers and sister, Faith Patel barely has time to play soccer. And when she's at practice, surrounded by girls who can afford to play in club leagues, she doesn't even feel like part of the team. So when Coach Berg starts to give Faith extra attention, she feels . . . really special. It might be crazy, but sudd", "Between finishing late school projects and looking after her brothers and sister, Faith Patel barely has time to play soccer. And when she's at practice, surrounded by girls who can afford to play in club leagues, she doesn't even feel like part of the team. So when Coach Berg starts to give Faith extra attention, she feels . . . really special. It might be crazy, but suddenly Faith has a crush on her coach. Can she keep her head in the game? ", "The situation gets worse after Faith's frenemy Caitlyn decides that Faith's getting special treatment. Will Caitlyn tell the rest of the teamand make Faith into a total outcast?"], "author": "M.G. Higgins", "num_pages": "112", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-28 00:00:00", "ISBN": "1467703052"},
{"url": "https://www.goodreads.com/book/show/371329.Rickshaw_Girl", "num_ratings": "778", "num_reviews": "164", "avg_ratings": 3.89, "genres": ["Fiction", "Childrens", "Cultural", "Childrens", "Middle Grade", "Realistic Fiction", "Cultural", "Asia", "Family"], "title": "Rickshaw Girl", "description": ["In her Bangladesh village, ten-year-old Naima excels at painting designs called alpanas, but to help her impoverished family financially she would have to be a boy--or disguise herself as one."], "author": "Mitali Perkins", "num_pages": "96", "awards": ["Jane Addams Children's Book Award Nominee for Older Children (2008)"], "places": ["Bangladesh"], "character_names": [], "language": "English", "publish_date": "2007-02-01 00:00:00", "ISBN": "1580893082"},
{"url": "https://www.goodreads.com/book/show/12243049-under-the-same-stars", "num_ratings": "1,879", "num_reviews": "118", "avg_ratings": 3.95, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Cultural", "Pakistan"], "title": "Under The Same Stars", "description": ["A young woman must choose between family, tradition and an unexpected love in this story set in Pakistan. The sequel to 'Daughter of the Wind'."], "author": "Suzanne Fisher Staples", "num_pages": "341", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-03 00:00:00", "ISBN": "1406308196"},
{"url": "https://www.goodreads.com/book/show/3302175-superstar-babes", "num_ratings": "53", "num_reviews": "4", "avg_ratings": 3.98, "genres": ["Fiction"], "title": "Superstar Babes", "description": ["Amber, Jazz and Geena are three sisters on a mission. They really want to have something to act as a memorial to their mum, but what could go for? They eventually settle on a great idea – they’ll get the new library at school named after her but they must first raise some money to stock it with books! They plan to stage an amazing reality experiment in their school and tur", "Amber, Jazz and Geena are three sisters on a mission. They really want to have something to act as a memorial to their mum, but what could go for? They eventually settle on a great idea – they’ll get the new library at school named after her but they must first raise some money to stock it with books! They plan to stage an amazing reality experiment in their school and turn it into Big Brother for one week only! With Bollywood stars and love-struck boys in the mix, they know it’s not going to be easy but surely the Babes can handle it – can’t they?"], "author": "Narinder Dhami", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-03 00:00:00", "ISBN": "0440867290"},
{"url": "https://www.goodreads.com/book/show/328863.Shiva_s_Fire", "num_ratings": "1,542", "num_reviews": "142", "avg_ratings": 3.97, "genres": ["Young Adult", "Cultural", "India", "Fiction", "Historical", "Historical Fiction", "Fantasy", "Childrens", "Middle Grade"], "title": "Shiva's Fire", "description": ["Newbery Honor author Suzanne Fisher Staples turns to India for her newest novel, published to starred reviews, about a young girl whose destiny calls her to dance."], "author": "Suzanne Fisher Staples", "num_pages": "276", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-11-01 00:00:00", "ISBN": "0064409791"},
{"url": "https://www.goodreads.com/book/show/1842609.The_House_of_Djinn", "num_ratings": "554", "num_reviews": "100", "avg_ratings": 3.69, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Cultural", "Pakistan"], "title": "The House of Djinn", "description": ["It has been ten years since Shabanu staged her death to secure the safety of her daughter, Mumtaz, from her husband's murderous brother. Mumtaz has been raised by her father's family with the education and security her mother desired for her, but with little understanding and love. Only her American cousin Jameel, her closest confidant and friend, and the beloved family pa", "It has been ten years since Shabanu staged her death to secure the safety of her daughter, Mumtaz, from her husband's murderous brother. Mumtaz has been raised by her father's family with the education and security her mother desired for her, but with little understanding and love. Only her American cousin Jameel, her closest confidant and friend, and the beloved family patriarch, Baba, understand the pain of her loneliness. When Baba unexpectedly dies, Jameel's succession as the Amirzai tribal leader and the arrangement of his marriage to Mumtaz are revealed, causing both to question whether fulfilling their duty to the family is worth giving up their dreams for the future.", "A commanding sequel to the novels ", " and ", ", ", "stands on its own. Suzanne Fisher Staples returns to modern-day Pakistan to reexamine the juxtaposition of traditional Islamic values with modern ideals of love.", " is a 2009 Bank Street - Best Children's Book of the Year."], "author": "Suzanne Fisher Staples", "num_pages": "207", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "0374399360"},
{"url": "https://www.goodreads.com/book/show/219570.Haveli", "num_ratings": "1,879", "num_reviews": "118", "avg_ratings": 3.95, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Cultural", "Pakistan"], "title": "Haveli", "description": ["The world of Newbery Honor book \"Shabanu\" is vividly re-created in this novel of a young Pakistani woman's heartbreaking struggle against the tyranny of custom and ancient law. Shabanu, now a mother at 18, faces daily challenges", "to her position in her husband's household, even as she plans for her young", "daughter's education and uncertain future. Then, during a visit to the", " \"", "The world of Newbery Honor book \"Shabanu\" is vividly re-created in this novel of a young Pakistani woman's heartbreaking struggle against the tyranny of custom and ancient law. Shabanu, now a mother at 18, faces daily challenges", "to her position in her husband's household, even as she plans for her young", "daughter's education and uncertain future. Then, during a visit to the", " \"haveli, \" their home in the city of Lahore, Shabanu falls in love with", "Omar, in spite of traditions that forbid their union. \"Again, Staples imbues", "Shabanu and her beautiful, brutally repressive world with a splendid reality", "that transcends the words on the page. Admirers of the intelligent and", "courageous Shabanu will thirst for more.\"--(starred) \"Kirkus.\""], "author": "Suzanne Fisher Staples", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-05-16 00:00:00", "ISBN": "0679865691"},
{"url": "https://www.goodreads.com/book/show/970478.Bhangra_Babes", "num_ratings": "191", "num_reviews": "24", "avg_ratings": 3.46, "genres": ["Fiction", "Young Adult", "Childrens", "Childrens", "Juvenile", "Humor", "Childrens", "Chapter Books"], "title": "Bhangra Babes", "description": ["It’s Amber, Jazz, and Geena Dhillon’s dream come true: Their interfering Auntie is finally getting married and moving out. The girls can’t wait to get the house and their dad back to themselves, and they certainly won’t miss their nosy Auntie at all–right? Meanwhile, Amber tangles with a new girl with a bad attitude, and falls head over heels for a would-be rapper whose at", "It’s Amber, Jazz, and Geena Dhillon’s dream come true: Their interfering Auntie is finally getting married and moving out. The girls can’t wait to get the house and their dad back to themselves, and they certainly won’t miss their nosy Auntie at all–right? Meanwhile, Amber tangles with a new girl with a bad attitude, and falls head over heels for a would-be rapper whose attitude might be even worse. The girls’ friend Kim just might be the only one in their group with any sense, and–could it be? Has dorky George Botley blossomed into a Man of Style? Will Amber get her love life straightened out before it ruins Auntie’s wedding? And will the girls learn to survive without Auntie around to keep them in line?"], "author": "Narinder Dhami", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-11 00:00:00", "ISBN": "0385733186"},
{"url": "https://www.goodreads.com/book/show/356284.Under_the_Persimmon_Tree", "num_ratings": "1,135", "num_reviews": "176", "avg_ratings": 3.63, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Cultural", "Pakistan", "Cultural"], "title": "Under the Persimmon Tree", "author": "Suzanne Fisher Staples", "num_pages": "275", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-08 00:00:00", "ISBN": "0374380252"},
{"url": "https://www.goodreads.com/book/show/9208646-artichoke-hearts", "num_ratings": "1,115", "num_reviews": "132", "avg_ratings": 3.81, "genres": ["Childrens", "Middle Grade", "Young Adult", "Realistic Fiction", "Contemporary", "Childrens", "Fiction", "Romance", "Family", "Death", "Young Adult", "Coming Of Age"], "title": "Artichoke Hearts", "description": ["Twelve-year-old Mira comes from a chaotic, artistic and outspoken family where it’s not always easy to be heard. As her beloved Nana Josie's health declines, Mira begins to discover the secrets of those around her, and also starts to keep some of her own. She is drawn to mysterious Jidé, a boy who is clearly hiding a troubled past and has grown hardened layers - like those", "Twelve-year-old Mira comes from a chaotic, artistic and outspoken family where it’s not always easy to be heard. As her beloved Nana Josie's health declines, Mira begins to discover the secrets of those around her, and also starts to keep some of her own. She is drawn to mysterious Jidé, a boy who is clearly hiding a troubled past and has grown hardened layers - like those of an artichoke - around his heart. As Mira is experiencing grief for the first time, she is also discovering the wondrous and often mystical world around her."], "author": "Sita Brahmachari", "num_pages": "321", "awards": ["Romantic Novel of the Year (RoNa's) Award Nominee for Young Adult (2012)", "Carnegie Medal Nominee (2012)", "FAB Award Nominee (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-22 00:00:00", "ISBN": "0330517910"},
{"url": "https://www.goodreads.com/book/show/6116974-guantanamo-boy", "num_ratings": "1,101", "num_reviews": "181", "avg_ratings": 3.74, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Contemporary", "War"], "title": "Guantanamo Boy", "description": ["Khalid, a fifteen-year-old Muslim boy from Rochdale, is abducted from Pakistan while on holiday with his family. He is taken to Guantanamo Bay and held without charge, where his hopes and dreams are crushed under the cruellest of circumstances. An innocent denied his freedom at a time when Western boys are finding theirs, Khalid tries and fails to understand what's happeni", "Khalid, a fifteen-year-old Muslim boy from Rochdale, is abducted from Pakistan while on holiday with his family. He is taken to Guantanamo Bay and held without charge, where his hopes and dreams are crushed under the cruellest of circumstances. An innocent denied his freedom at a time when Western boys are finding theirs, Khalid tries and fails to understand what's happening to him and cannot fail to be a changed young man."], "author": "Anna Perera", "num_pages": "288", "awards": ["Costa Book Award Nominee for Children's (2009)", "Sakura Medal Nominee for High School Book (2010)", "North East Teenage Book Award Nominee (2009)", "Carnegie Medal Nominee (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-24 00:00:00", "ISBN": "0141326077"},
{"url": "https://www.goodreads.com/book/show/6148571-wanting-mor", "num_ratings": "861", "num_reviews": "184", "avg_ratings": 3.88, "genres": ["Fiction", "Young Adult", "Family", "Historical", "Historical Fiction", "Cultural", "Childrens", "Chapter Books", "Realistic Fiction", "Cultural", "International"], "title": "Wanting Mor", "description": ["Jameela and her family live in a poor, war-torn village in Afghanistan. Even with her cleft lip and lack of educational opportunities, Jameela feels relatively secure, sustained by her Muslim faith and the love of her mother, Mor. But when Mor dies, Jameela’s father impulsively decides to start a new life in Kabul. Jameela is appalled as he succumbs to alcohol and drugs, t", "Jameela and her family live in a poor, war-torn village in Afghanistan. Even with her cleft lip and lack of educational opportunities, Jameela feels relatively secure, sustained by her Muslim faith and the love of her mother, Mor. But when Mor dies, Jameela’s father impulsively decides to start a new life in Kabul. Jameela is appalled as he succumbs to alcohol and drugs, then suddenly remarries, a situation that soon has her a virtual slave to a demanding stepmother. After she’s discovered trying to learn to read, Jameela is abandoned in a busy market, eventually landing in an orphanage run by the same army that killed so many members of her family. Throughout it all, the memory of her mother sustains her, giving Jameela the strength to face her father and stepmother when fate brings them together again. Inspired by a true story, and set in a world far removed from that of Western readers, this powerful novel reveals that the desire for identity and self-understanding is universal."], "author": "Rukhsana Khan", "num_pages": "192", "awards": [], "places": ["Afghanistan"], "character_names": [], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0888998589"},
{"url": "https://www.goodreads.com/book/show/970479.Bollywood_Babes", "num_ratings": "258", "num_reviews": "28", "avg_ratings": 3.38, "genres": ["Fiction", "Cultural", "Womens Fiction", "Chick Lit", "Young Adult", "Teen", "Young Adult", "Humor", "Childrens"], "title": "Bollywood Babes", "description": ["Those fiesty Bindi Babes are back – and someone tougher than their auntie has moved in too!", "Geena, Amber and Jazz throw a Bollywood party to raise funds for their school. They plan to deliver a real Bollywood actress for a live performance but their star turns out to more of a handful than they ever expected!"], "author": "Narinder Dhami", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-08 00:00:00", "ISBN": "0385902158"},
{"url": "https://www.goodreads.com/book/show/8078021-thunder-over-kandahar", "num_ratings": "588", "num_reviews": "120", "avg_ratings": 3.85, "genres": ["Young Adult", "Fiction", "War", "Realistic Fiction"], "title": "Thunder Over Kandahar", "description": ["A powerful novel of enduring friendship set amid the terror and chaos of present-day Afghanistan. Best friends Tamanna and Yasmine cannot believe their good fortune when a school is set up in their Afghan village; however, their dreams for the future are shattered when the Taliban burns down the school and threatens the teacher and students with death. As Tamanna faces an", "A powerful novel of enduring friendship set amid the terror and chaos of present-day Afghanistan. Best friends Tamanna and Yasmine cannot believe their good fortune when a school is set up in their Afghan village; however, their dreams for the future are shattered when the Taliban burns down the school and threatens the teacher and students with death. As Tamanna faces an arranged marriage to an older man, and the Taliban targets Yasmine’s western-educated family, the girls realize they must flee. Traveling through the heart of Taliban territory, the two unaccompanied young women find themselves in mortal danger. After suffering grave injuries—Tamanna from a fall and Yasmine from a suicide bombing—the girls are left without the one thing that has helped them survive—each other. The book features stunning photographs by award-winning photojournalist Rafal Gerszak (The New York Times, BBC World News) that bring readers an immediate sense of the faces and landscape of Afghanistan. Filled with tension and drama, Thunder Over Kandahar paints a vivid portrait of the perils of contemporary Afghanistan."], "author": "Sharon E. McKay", "num_pages": "264", "awards": ["Next Generation Indie Book Awards for Young Adult (2011)"], "places": ["Afghanistan"], "character_names": [], "language": "English", "publish_date": "2010-09-01 00:00:00", "ISBN": "1554512662"},
{"url": "https://www.goodreads.com/book/show/25311520-save-me-a-seat", "num_ratings": "5,519", "num_reviews": "914", "avg_ratings": 4.06, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Academic", "School", "Fiction"], "title": "Save Me a Seat", "description": ["Joe and Ravi might be from very different places, but they're both stuck in the same place: SCHOOL.", "Joe's lived in the same town all his life, and was doing just fine until his best friends moved away and left him on his own.", "Ravi's family just moved to America from India, and he's finding it pretty hard to figure out where he fits in.", "Joe and Ravi don't think they have anyth", "Joe and Ravi might be from very different places, but they're both stuck in the same place: SCHOOL.", "Joe's lived in the same town all his life, and was doing just fine until his best friends moved away and left him on his own.", "Ravi's family just moved to America from India, and he's finding it pretty hard to figure out where he fits in.", "Joe and Ravi don't think they have anything in common -- but soon enough they have a common enemy (the biggest bully in their class) and a common mission: to take control of their lives over the course of a single crazy week."], "author": "Sarah Weeks", "num_pages": "240", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (2018)", "Bluestem Book Award Nominee (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-10 00:00:00", "ISBN": "0545846609"},
{"url": "https://www.goodreads.com/book/show/1443203.Swimming_in_the_Monsoon_Sea", "num_ratings": "763", "num_reviews": "64", "avg_ratings": 3.75, "genres": ["Young Adult", "Lgbt", "Fiction", "Glbt", "Queer", "Glbt", "Gay"], "title": "Swimming in the Monsoon Sea", "description": ["The setting is Sri Lanka, 1980, and it is the season of monsoons. Fourteen-year-old Amrith is caught up in the life of the cheerful, well-to-do household in which he is being raised by his vibrant Auntie Bundle and kindly Uncle Lucky. He tries not to think of his life “before,” when his", "The setting is Sri Lanka, 1980, and it is the season of monsoons. Fourteen-year-old Amrith is caught up in the life of the cheerful, well-to-do household in which he is being raised by his vibrant Auntie Bundle and kindly Uncle Lucky. He tries not to think of his life “before,” when his doting mother was still alive. Amrith’s holiday plans seem unpromising: he wants to appear in his school’s production of ", " and he is learning to type at Uncle Lucky’s tropical fish business. Then, like an unexpected monsoon, his cousin arrives from Canada and Amrith’s ordered life is storm-tossed. He finds himself falling in love with the Canadian boy. ", " with its powerful theme of disastrous jealousy, is the backdrop to the drama in which Amrith finds himself immersed.", "Shyam Selvadurai’s brilliant novels, ", " and ", " have garnered him international acclaim. In this, his first young adult novel, he explores first love with clarity, humor, ", "and compassion."], "author": "Shyam Selvadurai", "num_pages": "274", "awards": ["Canadian Library Association Young Adult Book Award (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-08-14 00:00:00", "ISBN": "0887768342"},
{"url": "https://www.goodreads.com/book/show/6116947-blue-boy", "num_ratings": "1,186", "num_reviews": "180", "avg_ratings": 3.65, "genres": ["Fiction", "Humor", "Lgbt", "Glbt", "Queer", "Young Adult"], "title": "Blue Boy", "description": ["Meet Kiran Sharma: lover of music, dance, and all things sensual; son of immigrants, social outcast, spiritual seeker. A boy who doesn't quite understand his lot--until he realizes he's a god. . .", " As an only son, Kiran has obligations--to excel in his studies, to honor the deities, to find a nice Indian girl, and, above all, to make his mother and father proud--standard st", "Meet Kiran Sharma: lover of music, dance, and all things sensual; son of immigrants, social outcast, spiritual seeker. A boy who doesn't quite understand his lot--until he realizes he's a god. . .", " As an only son, Kiran has obligations--to excel in his studies, to honor the deities, to find a nice Indian girl, and, above all, to make his mother and father proud--standard stuff for a boy of his background. If only Kiran had anything in common with the other Indian kids besides the color of his skin. They reject him at every turn, and his cretinous public schoolmates are no better. Cincinnati in the early 1990s isn't exactly a hotbed of cultural diversity, and Kiran's not-so-well-kept secrets don't endear him to any group. Playing with dolls, choosing ballet over basketball, taking the annual talent show way too seriously. . .the very things that make Kiran who he is also make him the star of his own personal freak show. . .", "Surrounded by examples of upstanding Indian Americans--in his own home, in his temple, at the weekly parties given by his parents' friends--Kiran nevertheless finds it impossible to get the knack of \"normalcy.\" And then one fateful day, a revelation: perhaps his desires aren't too earthly, but too divine. Perhaps the solution to the mystery of his existence has been before him since birth. For Kiran Sharma, a long, strange trip is about to begin--a journey so sublime, so ridiculous, so painfully beautiful, that it can only lead to the truth. . .", "\"The best fiction reminds us that humanity is much, much larger than our personal world, our own little reality. ", " shows us a world too funny and sad and sweet to be based on anything but the truth.\" --Chuck Palahniuk", " Bestselling Author"], "author": "Rakesh Satyal", "num_pages": "276", "awards": ["Edmund White Award for Debut Fiction Nominee (2010)", "Lambda Literary Award for Gay Debut Fiction (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-01 00:00:00", "ISBN": "0758231369"},
{"url": "https://www.goodreads.com/book/show/28250907-watched", "num_ratings": "398", "num_reviews": "114", "avg_ratings": 3.54, "genres": ["Young Adult", "Realistic Fiction", "Young Adult", "Teen", "Cultural", "Fiction", "Contemporary"], "title": "Watched", "description": [" ", "Naeem is far from the “model teen.” Moving fast in his immigrant neighborhood in Queens is the only way he can outrun the eyes of his hardworking Bangladeshi parents and their gossipy neighbors. Even wors", " ", "Naeem is far from the “model teen.” Moving fast in his immigrant neighborhood in Queens is the only way he can outrun the eyes of his hardworking Bangladeshi parents and their gossipy neighbors. Even worse, they’re not the only ones watching. Cameras on poles. Mosques infiltrated. Everyone knows: Be careful what you say and who you say it to. Anyone might be a watcher.", " ", "Naeem thinks he can charm his way through anything, until his mistakes catch up with him and the cops offer a dark deal. Naeem sees a way to be a hero—a protector—like the guys in his brother’s comic books. Yet what is a hero? What is a traitor? And where does Naeem belong? ", " ", "Acclaimed author", "Marina Budhos delivers a riveting story that’s as vivid and involving as today’s headlines."], "author": "Marina Budhos", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-09-13 00:00:00", "ISBN": "055353419X"},
{"url": "https://www.goodreads.com/book/show/93173.How_Opal_Mehta_Got_Kissed_Got_Wild_and_Got_a_Life", "num_ratings": "2,228", "num_reviews": "224", "avg_ratings": 2.81, "genres": ["Fiction", "Young Adult", "Womens Fiction", "Chick Lit"], "title": "How Opal Mehta Got Kissed, Got Wild, and Got a Life", "description": ["Opal Mehta is a young woman with a laser focus: getting into Harvard. Since her birth, Amal and Meena Mehta have raised their only daughter with Harvard emblazoned on her pajamas, her walls, and her brain. Everything she does is meant to add up to the perfect Harvard application. There have been flowcharts, diagrams, and endless checklists. At seventeen, Opal is valedictor", "Opal Mehta is a young woman with a laser focus: getting into Harvard. Since her birth, Amal and Meena Mehta have raised their only daughter with Harvard emblazoned on her pajamas, her walls, and her brain. Everything she does is meant to add up to the perfect Harvard application. There have been flowcharts, diagrams, and endless checklists. At seventeen, Opal is valedictorian, president of three honor societies, and founder of the Science Bowl team. She ven took welding classes to appear well-rounded. With SAT and AP scores to die for, getting in looks like a sure thing.", "Then, at her interview with Harvard’s Dean of Admissions, he sets aside her résumé and asks her the single question she never prepped for:", "“What do you like to do for fun?”", "For once, Opal is at a loss. The interview screeches to a nightmarish halt. The Dean says she still has a chance—but only if she can show that she is more than just another 4.0 GPA.", "And so the Mehtas turn their ingenuity and determination to a whole new plan: getting Opal a life. Dating, partying, and popularity are the new subjects of late-night cramming, and Opal’s study guides are now MTV and the WB, ", " and ", ". The girl who wore high-water cords and hung out with her cat for fun is now rocking Manolos, cutting class to shop with the queen bees, and winning the attention of her longtime lust object.", "But when Opal finally faces the Dean again—this time in a Diane von Furstenberg blouse and Theory pants—she is more confused than ever. Does lip gloss actually matter? Does life have to have a crimson theme? What—and whom—does she really love?", "For anyone who’s ever sweated a crisis, ", " is a hilarious and painfully real novel about family, love, and daring to push your life to the limit."], "author": "Kaavya Viswanathan", "num_pages": "314", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-04 00:00:00", "ISBN": "0316059889"},
{"url": "https://www.goodreads.com/book/show/715579.Broken_Moon", "num_ratings": "146", "num_reviews": "27", "avg_ratings": 3.75, "genres": ["Young Adult", "Fiction", "Cultural", "Realistic Fiction", "Young Adult", "Teen"], "title": "Broken Moon", "description": [" ", " Nadira is spoiled goods. Scars from a beating she received for a crime that her older brother allegedly committed tell the world that she is worth less than nothing -- except to her little brother, Umar, who sees beauty in her scar", " ", " Nadira is spoiled goods. Scars from a beating she received for a crime that her older brother allegedly committed tell the world that she is worth less than nothing -- except to her little brother, Umar, who sees beauty in her scars and value in her. ", " But Umar is gone -- perhaps kidnapped or maybe sold. All Nadira knows is that Umar has been taken into the desert to ride camels for rich sheiks. He could be lost to her forever. ", " For Umar, Nadira will risk everything. So she disguises herself as a boy and searches out the men who took him. They are not hard to find, and soon she, too, is headed to the desert to be a camel jockey. ", " Life in the desert is more brutal than Nadira imagined. All she has to protect her and the boys she meets are a bit of chai tea, some stories, and the hope that she has enough of both to keep going until she finds Umar. "], "author": "Kim Antieau", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-27 00:00:00", "ISBN": "1416917675"},
{"url": "https://www.goodreads.com/book/show/29451548-a-girl-like-that", "num_ratings": "1,486", "num_reviews": "418", "avg_ratings": 3.84, "genres": ["Young Adult", "Contemporary", "Fiction"], "title": "A Girl Like That", "description": [" ", "Sixteen-year-old Zarin Wadia is many things: a bright and vivacious student, an orphan, a risk taker. She’s also the kind of girl that parents warn their kids to stay away from: a troublemaker whose many romances are the subject of endless gossip at school. ", " ", "Sixteen-year-old Zarin Wadia is many things: a bright and vivacious student, an orphan, a risk taker. She’s also the kind of girl that parents warn their kids to stay away from: a troublemaker whose many romances are the subject of endless gossip at school. ", ", they say. So how is it that eighteen-year-old Porus Dumasia has only ever had eyes for her? And how did Zarin and Porus end up dead in a car together, crashed on the side of a highway in Jeddah, Saudi Arabia? When the religious police arrive on the scene, everything everyone thought they knew about Zarin is questioned. And as her story is pieced together, told through multiple perspectives, it becomes clear that she was far more than just a girl like that."], "author": "Tanaz Bhathena", "num_pages": "378", "awards": [], "places": ["Jeddah"], "character_names": [], "language": "English", "publish_date": "2018-02-27 00:00:00", "ISBN": "0374305447"},
{"url": "https://www.goodreads.com/book/show/17931571-the-leaving-of-things", "num_ratings": "2,394", "num_reviews": "246", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "India", "Contemporary", "Young Adult"], "title": "The Leaving of Things", "description": ["Vikram is not your model Indian-American teenager. Rebellious and adrift in late 1980s Wisconsin, he is resentful of his Indian roots and has no clue what he wants from his future—other than to escape his family’s life of endless moving and financial woes. But after a drunken weekend turns disastrous, Vikram’s outraged parents decide to pack up the family and return to Ind", "Vikram is not your model Indian-American teenager. Rebellious and adrift in late 1980s Wisconsin, he is resentful of his Indian roots and has no clue what he wants from his future—other than to escape his family’s life of endless moving and financial woes. But after a drunken weekend turns disastrous, Vikram’s outraged parents decide to pack up the family and return to India—permanently.", "So begins a profound journey of self-discovery as Vikram, struggling with loneliness, culture shock, and the chaos of daily Indian life, finds his creativity awakened by a new romance and an old camera. His artistic gifts bring him closer to a place and family he barely knew. But a devastating family crisis challenges Vikram’s sense of his destiny, hurtling him toward a crossroads where he must make the fateful choice between India, the land of his soul, and America, the land of his heart."], "author": "Jay Antani", "num_pages": "368", "awards": ["Kindle Book Award for Literary Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-12 00:00:00", "ISBN": "0988419300"},
{"url": "https://www.goodreads.com/book/show/31437727-stained", "num_ratings": "44", "num_reviews": "18", "avg_ratings": 4.23, "genres": ["Fiction", "Contemporary"], "title": "Stained", "description": ["Selina, a beautiful, British-born Pakistani young woman recently lost her father, and finds herself struggling to cope with life, in particular with some aspects of her studies. Matters go from bad to worse, when a trusted family friend from the mosque offers to tutor her, and rapes her instead. With the threat of dishonour to her family at her back, Selina goes to extreme", "Selina, a beautiful, British-born Pakistani young woman recently lost her father, and finds herself struggling to cope with life, in particular with some aspects of her studies. Matters go from bad to worse, when a trusted family friend from the mosque offers to tutor her, and rapes her instead. With the threat of dishonour to her family at her back, Selina goes to extreme lengths to avoid scandal, and prevent shame being brought to her widowed mother’s door. It will take all the strength and courage Selina can muster when her life travels down a dangerous path, from which there may be no return…"], "author": "Abda Khan", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-03 00:00:00", "ISBN": "1941861229"},
{"url": "https://www.goodreads.com/book/show/25832342-hidden-husband", "num_ratings": "217", "num_reviews": "67", "avg_ratings": 3.79, "genres": ["Romance"], "title": "Hidden Husband", "description": ["Aisha is trapped in her own secret which makes her life hell. Her love for Raghav is true. But hailing from two very different cultures is the basis of their continued friction. Aisha is a Punjabi girl from Gurgaon and Raghav a Bihari from Ranchi. Raghav's family will certainly not accept a girl from outside their community. And yet, he continues giving her false hopes thr", "Aisha is trapped in her own secret which makes her life hell. Her love for Raghav is true. But hailing from two very different cultures is the basis of their continued friction. Aisha is a Punjabi girl from Gurgaon and Raghav a Bihari from Ranchi. Raghav's family will certainly not accept a girl from outside their community. And yet, he continues giving her false hopes through his efforts and promises. And then they take a step which entangles her life further. Will she manage to come out of this quandary or must she continue to live in her self-created web? Explore her journey that makes her realise the atrocities being committed on women in the Indian society and the tough decisions she must take, keeping her most loved ones oblivious to everything happening in her life."], "author": "Shikha Kaul", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-29 00:00:00", "ISBN": "9384382078"},
{"url": "https://www.goodreads.com/book/show/25692161-panther", "num_ratings": "101", "num_reviews": "33", "avg_ratings": 4.16, "genres": ["Fiction"], "title": "Panther", "description": ["'I see you. Legs like toothpicks, body and face all ribs and cheekbones. And that hair. Come on, what is it? Like friggin' barbed wire. I see you with a hand-me-down cracked bat creaming a leather ball, in a sock, hanging from the branch of a mango tree.' ", "Being accepted into an elite international school on a cricket scholarship doesn't mean your life is going to change. E", "'I see you. Legs like toothpicks, body and face all ribs and cheekbones. And that hair. Come on, what is it? Like friggin' barbed wire. I see you with a hand-me-down cracked bat creaming a leather ball, in a sock, hanging from the branch of a mango tree.' ", "Being accepted into an elite international school on a cricket scholarship doesn't mean your life is going to change. Except it does, because hunky Indika - I for Indika, I for Incredible - takes you under his wing, drags you to posh restaurants and shows you pictures from glossy magazines of women who ... well, never mind, that's not the point. The point is: if your best friend snogs your girlfriend, can he still be Incredible? Was he ever? But don't sweat the small stuff. There are cricket matches to win, examinations to pass, a horrifying past to forget, a sinister schoolmaster to avoid ... and, of course, a first kiss to finally experience. Prabu's life is never going to be the same again. ", "Funny, diamond-sharp and unapologetic, ", " is a novel about that familiar, fractured passage to adulthood that can make us magnificent if it does not kill us."], "author": "Chhimi Tenduf-La", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-24 00:00:00", "ISBN": "9351772209"},
{"url": "https://www.goodreads.com/book/show/483330.Anita_and_Me", "num_ratings": "1,835", "num_reviews": "95", "avg_ratings": 3.66, "genres": ["Fiction", "Contemporary", "Young Adult", "Coming Of Age", "Young Adult", "Cultural", "India", "European Literature", "British Literature", "Humor"], "title": "Anita and Me", "description": [", which has been compared to ", ", tells the story of Meena, the daughter of the only Punjabi family in the British village of Tollington. With great warmth and humor, Meera Syal brings to life a quirky, spirited 1960s mining town and creates in her protagonist what the ", " calls a “female Huck Finn.” The novel follows nine-year-old", ", which has been compared to ", ", tells the story of Meena, the daughter of the only Punjabi family in the British village of Tollington. With great warmth and humor, Meera Syal brings to life a quirky, spirited 1960s mining town and creates in her protagonist what the ", " calls a “female Huck Finn.” The novel follows nine-year-old Meena through a year spiced with pilfered sweets and money, bad words, and compulsive, yet inventive, lies. ", " offers a fresh, sassy look at a childhood caught between two cultures."], "author": "Meera Syal", "num_pages": "336", "awards": ["Orange Prize Nominee for Fiction Longlist (1997)", "Betty Trask Award (1996)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-06-01 00:00:00", "ISBN": "1565845293"},
{"url": "https://www.goodreads.com/book/show/26001198-child-of-spring", "num_ratings": "36", "num_reviews": "13", "avg_ratings": 3.14, "genres": ["Childrens", "Middle Grade", "Social Issues", "Poverty", "Cultural", "Islam", "Muslims"], "title": "Child of Spring", "description": ["Engaging writing and a delightful protagonist bring life in a contemporary Indian village to life. Basanta longs for the beautiful ring worn by her young mistress, but when it comes into her possession, she realizes that it's not the wonderful possession she expected. Increasingly aware of the struggles of her less privileged friends, Lali and Bala, she finds a way to impr", "Engaging writing and a delightful protagonist bring life in a contemporary Indian village to life. Basanta longs for the beautiful ring worn by her young mistress, but when it comes into her possession, she realizes that it's not the wonderful possession she expected. Increasingly aware of the struggles of her less privileged friends, Lali and Bala, she finds a way to improve their lives and entertain their community and the beautiful ring takes on new meaning."], "author": "Farhana Zia", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-03-01 00:00:00", "ISBN": "1561459046"},
{"url": "https://www.goodreads.com/book/show/972571.Looking_For_Bapu", "num_ratings": "74", "num_reviews": "17", "avg_ratings": 3.85, "genres": ["Family", "Childrens", "Death", "Cultural", "India", "Fiction", "Realistic Fiction"], "title": "Looking For Bapu", "description": ["Anu's beloved grandfather Bapu moved from India to Anu's home in the Pacific Northwest when Anu was small, and Anu is devastated when Bapu dies. But when he is visited by Bapu's ghost, he knows that there must be a way to bring him back to life -- he's just not sure how. Anu enlists his friends Izzy and Unger to help him. From shaving his head to making up fortunes in the", "Anu's beloved grandfather Bapu moved from India to Anu's home in the Pacific Northwest when Anu was small, and Anu is devastated when Bapu dies. But when he is visited by Bapu's ghost, he knows that there must be a way to bring him back to life -- he's just not sure how. Anu enlists his friends Izzy and Unger to help him. From shaving his head to making up fortunes in the hope of becoming more holy, Anu tries everything. He even journeys to the island of the Mystery Museum. Perhaps there, Karnak the Magician will be able to help?"], "author": "Anjali Banerjee", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-04 00:00:00", "ISBN": "0385746571"},
{"url": "https://www.goodreads.com/book/show/17904531-swimming-through-clouds", "num_ratings": "254", "num_reviews": "80", "avg_ratings": 4.17, "genres": ["Young Adult", "Contemporary", "Fiction"], "title": "Swimming Through Clouds", "description": ["I live in the in between. Between what if and what is. It’s how I manage. It’s the only way I know. Everyone has their way. This is mine.", "Senior year kicks off when a Post-it note sparks a sticky romance between two unlikely friends. Transfer student Talia Vanderbilt has one goal at her new school: to blend in with the walls. Hoops and homework occupy Lagan Desai until some", "I live in the in between. Between what if and what is. It’s how I manage. It’s the only way I know. Everyone has their way. This is mine.", "Senior year kicks off when a Post-it note sparks a sticky romance between two unlikely friends. Transfer student Talia Vanderbilt has one goal at her new school: to blend in with the walls. Hoops and homework occupy Lagan Desai until something moves to the top of his list: befriend the new girl. ", "One Post-it note at a time, Lagan moves past Talia's caution-taped heart, revealing a world where hope seems to lie around the corner...she never turns.", "From Award-winning author Rajdeep Paulus comes a story that reminds us that life is battle we don't fight alone."], "author": "Rajdeep Paulus", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6596545-seaglass-summer", "num_ratings": "457", "num_reviews": "68", "avg_ratings": 3.72, "genres": ["Realistic Fiction", "Animals", "Childrens", "Middle Grade", "Childrens", "Childrens", "Juvenile"], "title": "Seaglass Summer", "description": ["Eleven-year-old Poppy Ray longs to be a veterinarian, but she's never had a pet. This summer, she's going to spend a month with her uncle Sanjay, veterinarian and owner of the Furry Friends Animal Clinic on an island off the Washington coast. ", "Poppy is in for big surprises. She loves tending to the dogs, cats, and even a bird, and she discovers the fun of newborn puppies an", "Eleven-year-old Poppy Ray longs to be a veterinarian, but she's never had a pet. This summer, she's going to spend a month with her uncle Sanjay, veterinarian and owner of the Furry Friends Animal Clinic on an island off the Washington coast. ", "Poppy is in for big surprises. She loves tending to the dogs, cats, and even a bird, and she discovers the fun of newborn puppies and the satisfaction of doing a good job. But she learns that there's more to caring for animals than the stethoscope and cotton swabs in her Deluxe Veterinarian First-Aid Kit. She's not prepared for quirky pet owners, gross stuff, or scary emergencies. With help from a boy named Hawk, a chunk of seaglass, and a touch of intuition, Poppy gains a deeper understanding of the pain and joy of working with animals. ", "With warmth and humor, Anjali Banerjee tells the story of a resourceful, determined girl who can't wait to grow up, but begins to realize just how much she has left to discover."], "author": "Anjali Banerjee", "num_pages": "160", "awards": [], "places": ["Washington (the state)"], "character_names": [], "language": null, "publish_date": "2010-05-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1364006.White_House_Rules", "num_ratings": "172", "num_reviews": "24", "avg_ratings": 3.59, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Young Adult", "Teen", "Parenting", "Adoption", "Cultural", "Romance", "Childrens", "Middle Grade"], "title": "White House Rules", "description": ["In ", ", Sameera showed the United States it was ready for a Pakistani-born First Daughter. With her brains and bravado, she helped her dad win the presidential election. Now she’s living in the ", ". Fabulous! Right? Actually, it’s no fairy tale. The Secret Service and the paparazzi follow Sameera everywhere. She misses her frie", "In ", ", Sameera showed the United States it was ready for a Pakistani-born First Daughter. With her brains and bravado, she helped her dad win the presidential election. Now she’s living in the ", ". Fabulous! Right? Actually, it’s no fairy tale. The Secret Service and the paparazzi follow Sameera everywhere. She misses her friends—and even her school—back home. So Sameera decides to escape. Will she be able to pull it off, or will her plan backfire on the entire First Family? This smart and funny novel continues the adventures of a Pakistani- American teen in the spotlight."], "author": "Mitali Perkins", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-24 00:00:00", "ISBN": "0525479511"},
{"url": "https://www.goodreads.com/book/show/465019.Indie_Girl", "num_ratings": "325", "num_reviews": "50", "avg_ratings": 3.47, "genres": ["Young Adult", "Fiction", "Womens Fiction", "Chick Lit", "Contemporary", "Realistic Fiction"], "title": "Indie Girl", "description": ["FIFTEEN-YEAR-OLD INDIE KONKIPUDDI HAS ALWAYS DREAMED OF BECOMING A FASHION REPORTER. She'd do anything to land an internship with glamorous ", " magazine -- even babysit publisher Aaralyn Taylor's two-year-old son. Indie's neurosurgeon dad can't understand why Indie would want to spend her weekends picking Play-Doh off of someone else's Persian carpets, and pret", "FIFTEEN-YEAR-OLD INDIE KONKIPUDDI HAS ALWAYS DREAMED OF BECOMING A FASHION REPORTER. She'd do anything to land an internship with glamorous ", " magazine -- even babysit publisher Aaralyn Taylor's two-year-old son. Indie's neurosurgeon dad can't understand why Indie would want to spend her weekends picking Play-Doh off of someone else's Persian carpets, and pretty soon she starts asking herself the same thing.", "Then Indie finds out that (1) ", " is in trouble, and (2) Hollywood's hottest star is having her wedding dress made in a village in India. Indie's sure she's scored the juiciest gossip in town -- the kind ofstory that will put the magazine back on the map and finally land her the internship! But when things don't pan out exactly as planned, Indie wonders -- will Aaralyn ever see her as anything more than just the hired help?"], "author": "Kavita Daswani", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-09 00:00:00", "ISBN": "1416948929"},
{"url": "https://www.goodreads.com/book/show/677242.What_I_Meant_", "num_ratings": "269", "num_reviews": "57", "avg_ratings": 3.67, "genres": ["Young Adult", "Realistic Fiction", "Humor", "Womens Fiction", "Chick Lit", "Romance", "Family"], "title": "What I Meant...", "description": ["After 15 years of being a good daughter and loyal friend, wouldn't you expect the people closest to you to believe you? To at least try to understand what you mean? Since my evil aunt moved in, everything has gone wrong.", "My little sister thinks I'm a thief.", "My best friend thinks I'm a jerk.", "My parents think I'm bulimic.", "And the boy I love thinks I'm not into him at all.", "Somehow", "After 15 years of being a good daughter and loyal friend, wouldn't you expect the people closest to you to believe you? To at least try to understand what you mean? Since my evil aunt moved in, everything has gone wrong.", "My little sister thinks I'm a thief.", "My best friend thinks I'm a jerk.", "My parents think I'm bulimic.", "And the boy I love thinks I'm not into him at all.", "Somehow I have to set the record straight before I totally lose my mind.", "Marie Lamba's debut novel tells the story of how 15-year-old Sangeet Jumnal's sleepy suburban life suddenly gets super complicated."], "author": "Marie Lamba", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-07-24 00:00:00", "ISBN": "0375840915"},
{"url": "https://www.goodreads.com/book/show/9266792-lovetorn", "num_ratings": "453", "num_reviews": "101", "avg_ratings": 3.28, "genres": ["Young Adult", "Romance", "Contemporary", "Realistic Fiction", "Cultural", "India"], "title": "Lovetorn", "description": ["When Shalini’s father gets a new job in L.A., she is torn away from her life in India and the boy to whom she’s been betrothed since she was three. L.A. is so different, and Shalini dresses and talks all wrong. She isn’t sure she’ll survive high school in America without her fiancé, Vikram, and now she has to cope with her mom’s homesickness and depression. A new friend, c", "When Shalini’s father gets a new job in L.A., she is torn away from her life in India and the boy to whom she’s been betrothed since she was three. L.A. is so different, and Shalini dresses and talks all wrong. She isn’t sure she’ll survive high school in America without her fiancé, Vikram, and now she has to cope with her mom’s homesickness and depression. A new friend, chill and confident Renuka, helps Shalini find her way and get up the courage to join the Food4Life club at school. But she gets more than just a friend when she meets Toby—she gets a major crush. Shalini thinks she loves Vikram, but he never made her feel like this.", "In Lovetorn, Shalini discovers that your heart ultimately makes its own choices, even when it seems as if your destiny has already been chosen.", "Author Kavita Daswani has always been fascinated by child marriages and betrothals, and this story of a traditional girl from India, who is exposed to so many more freedoms and experiences after being dropped in a completely alien culture, is a fresh and contemporary look at the subject."], "author": "Kavita Daswani", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-17 00:00:00", "ISBN": "0061673110"},
{"url": "https://www.goodreads.com/book/show/8452801-words-in-the-dust", "num_ratings": "2,692", "num_reviews": "520", "avg_ratings": 4.02, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Historical", "Historical Fiction", "Childrens", "Middle Grade"], "title": "Words in the Dust", "description": ["Zulaikha hopes. She hopes for peace, now that the Taliban have been driven from Afghanistan; a good relationship with her hard stepmother; and one day even to go to school, or to have her cleft palate fixed. Zulaikha knows all will be provided for her--\"Inshallah,\" God willing. ", "Then she meets Meena, who offers to teach her the Afghan poetry she taught her late mother. And", "Zulaikha hopes. She hopes for peace, now that the Taliban have been driven from Afghanistan; a good relationship with her hard stepmother; and one day even to go to school, or to have her cleft palate fixed. Zulaikha knows all will be provided for her--\"Inshallah,\" God willing. ", "Then she meets Meena, who offers to teach her the Afghan poetry she taught her late mother. And the Americans come to her village, promising not just new opportunities and dangers, but surgery to fix her face. These changes could mean a whole new life for Zulaikha--but can she dare to hope they'll come true?"], "author": "Trent Reedy", "num_pages": "286", "awards": ["Christopher Award (2011)", "SCBWI Golden Kite Award", "Cybils Award Nominee for Middle Grade Fiction (2011)", "Society of Midland Authors Award for Children's Fiction (2012)", "Rebecca Caudill Young Readers' Book Award Nominee (2014)"], "places": ["Afghanistan"], "character_names": [], "language": "English", "publish_date": "2011-01-01 00:00:00", "ISBN": "0545261252"},
{"url": "https://www.goodreads.com/book/show/8642687-island-s-end", "num_ratings": "319", "num_reviews": "77", "avg_ratings": 3.66, "genres": ["Young Adult", "Historical", "Historical Fiction", "Cultural", "Asia", "Fiction", "Cultural", "Adventure", "Young Adult", "Teen", "Young Adult", "Coming Of Age", "Historical", "Realistic Fiction"], "title": "Island's End", "description": ["From the acclaimed author of ", " comes a fascinating story set on a remote island untouched by time. Uido is ecstatic about becoming her tribe's spiritual leader, but her new position brings her older brother's jealousy and her best friend's mistrust. And looming above these troubles are the recent visits of strangers from the mainland who have little regar", "From the acclaimed author of ", " comes a fascinating story set on a remote island untouched by time. Uido is ecstatic about becoming her tribe's spiritual leader, but her new position brings her older brother's jealousy and her best friend's mistrust. And looming above these troubles are the recent visits of strangers from the mainland who have little regard for nature or the spirits, and tempt the tribe members with gifts, making them curious about modern life. When Uido's little brother falls deathly ill, she must cross the ocean and seek their help. Having now seen so many new things, will Uido have the strength to believe in herself and the old ways? And will her people trust her to lead them to safety when a catastrophic tsunami threatens? Uido must overcome everyone's doubts, including her own, if she is to keep her people safe and preserve the spirituality that has defined them.", " Drawing on firsthand experience from her travels to the Andaman Islands, Padma Venkatraman was inspired to write this story after meeting natives who survived the 2004 tsunami and have been able to preserve their unique way of life. Uido's transformation from a young girl to tribal leader will touch both your heart and mind."], "author": "Padma Venkatraman", "num_pages": "240", "awards": ["South Asia Book Award for Grades 6 & Above (2012)", "Boston Author's Club Young Reader Award Nominee (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-04 00:00:00", "ISBN": "0399250999"},
{"url": "https://www.goodreads.com/book/show/8492302-the-latte-rebellion", "num_ratings": "599", "num_reviews": "138", "avg_ratings": 3.24, "genres": ["Young Adult", "Realistic Fiction", "Contemporary", "Fiction", "Cultural"], "title": "The Latte Rebellion", "description": [" —from the Latte Rebellion Manifesto", "When high school senior Asha Jamison gets called a \"towel head\" at a pool party, the racist insult gives Asha and her best friend Carey a great money-making idea for a post-graduation trip. They'll sell T-shirts promoting the Latte Rebellion, a club that raises awareness of mixed-ra", " —from the Latte Rebellion Manifesto", "When high school senior Asha Jamison gets called a \"towel head\" at a pool party, the racist insult gives Asha and her best friend Carey a great money-making idea for a post-graduation trip. They'll sell T-shirts promoting the Latte Rebellion, a club that raises awareness of mixed-race students.", "Seemingly overnight, their \"cause\" goes viral and the T-shirts become a nationwide fad. As new chapters spring up from coast to coast, Asha realizes that her simple marketing plan has taken on a life of its own-and it's starting to ruin hers. Asha's once-stellar grades begin to slip, threatening her Ivy League dreams, and her friendship with Carey is hanging by a thread. And when the peaceful underground movement turns militant, Asha's school launches a disciplinary hearing. Facing expulsion, Asha must decide how much she's willing to risk for something she truly believes in."], "author": "Sarah Jamila Stevenson", "num_pages": "327", "awards": ["Independent Publisher Book Award (IPPY) for Bronze Medal (0)", "Multicultural Children's Fiction"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-08 00:00:00", "ISBN": "0738722782"},
{"url": "https://www.goodreads.com/book/show/217253._Un_arranged_Marriage", "num_ratings": "822", "num_reviews": "94", "avg_ratings": 3.35, "genres": ["Young Adult", "Cultural", "India", "Fiction", "Academic", "School", "Romance"], "title": "(Un)arranged Marriage", "description": ["Set partly in the UK and partly in the Punjab region of India, this is a fresh, bitingly perceptive and totally up-to-the minute look at one young man's fight to free himself from family expectations and to be himself, free to dance to his own tune."], "author": "Bali Rai", "num_pages": "272", "awards": ["North East Teenage Book Award Nominee (2001)"], "places": ["Leicester, England", "Punjab"], "character_names": [], "language": "English", "publish_date": "2001-05-03 00:00:00", "ISBN": "0552547344"},
{"url": "https://www.goodreads.com/book/show/24585386-a-tale-of-highly-unusual-magic", "num_ratings": "414", "num_reviews": "97", "avg_ratings": 3.82, "genres": ["Childrens", "Middle Grade", "Fantasy", "Young Adult", "Fantasy", "Magic", "Fiction", "Childrens", "Childrens", "Juvenile"], "title": "A Tale of Highly Unusual Magic", "description": ["Bestseller and author of the popular middle grade series Confectionately Yours Lisa Papademetriou is back with a magical, page-turning adventure for readers of all ages—a touching tale about destiny and the invisible threads that link us all, ultimately, to one another.", "Kai and Leila are both finally having an adventure. For Leila, that means a globe-crossing journey to vis", "Bestseller and author of the popular middle grade series Confectionately Yours Lisa Papademetriou is back with a magical, page-turning adventure for readers of all ages—a touching tale about destiny and the invisible threads that link us all, ultimately, to one another.", "Kai and Leila are both finally having an adventure. For Leila, that means a globe-crossing journey to visit family in Pakistan for the summer; for Kai, it means being stuck with her crazy great-aunt in Texas while her mom looks for a job. In each of their bedrooms, they discover a copy of a blank, old book called The Exquisite Corpse. Kai writes three words on the first page—and suddenly, they magically appear in Leila's copy on the other side of the planet. Kai's words are soon followed by line after line of the long-ago, romantic tale of Ralph T. Flabbergast and his forever-love, Edwina Pickle. As the two take turns writing, the tale unfolds, connecting both girls to each other, and to the past, in a way they never could have imagined.", "A heartfelt, vividly told multicultural story about fate and how our stories shape it."], "author": "Lisa Papademetriou", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-10-06 00:00:00", "ISBN": "0062371215"},
{"url": "https://www.goodreads.com/book/show/10788983-same-sun-here", "num_ratings": "2,277", "num_reviews": "381", "avg_ratings": 3.93, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Fiction", "Young Adult", "Cultural"], "title": "Same Sun Here", "description": ["Meena and River have a lot in common: fathers forced to work away from home to make ends meet, grandmothers who mean the world to them, and faithful dogs. But Meena is an Indian immi", "Meena and River have a lot in common: fathers forced to work away from home to make ends meet, grandmothers who mean the world to them, and faithful dogs. But Meena is an Indian immigrant girl living in New York City’s Chinatown, while River is a Kentucky coal miner’s son. As Meena’s family studies for citizenship exams and River's town faces devastating mountaintop removal, this unlikely pair become pen pals, sharing thoughts and, as their camaraderie deepens, discovering common ground in their disparate experiences. With honesty and humor, Meena and River bridge the miles between them, creating a friendship that inspires bravery and defeats cultural misconceptions. Narrated in two voices, each voice distinctly articulated by a separate gifted author, this chronicle of two lives powerfully conveys the great value of being and having a friend and the joys of opening our lives to others who live beneath the same sun."], "author": "Silas House", "num_pages": "297", "awards": ["Audie Award for Children's Titles Ages 8-12 (2013)", "Dorothy Canfield Fisher Children's Book Award Nominee (2014)"], "places": ["Kentucky", "Chinatown, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2012-02-14 00:00:00", "ISBN": "0763656844"},
{"url": "https://www.goodreads.com/book/show/6580712-boys-without-names", "num_ratings": "2,124", "num_reviews": "335", "avg_ratings": 3.93, "genres": ["Realistic Fiction", "Young Adult", "Cultural", "India", "Childrens", "Middle Grade", "Cultural", "Fiction"], "title": "Boys Without Names", "description": ["For eleven-year-old Gopal and his family, life in their rural Indian village is over: We stay, we starve, his baba has warned. So they must flee to the big city of Mumbai in hopes of finding work and a brighter future. Gopal is eager to help support his struggling family until school starts, so when a stranger approaches him with the promise of a factory job, he jumps at t", "For eleven-year-old Gopal and his family, life in their rural Indian village is over: We stay, we starve, his baba has warned. So they must flee to the big city of Mumbai in hopes of finding work and a brighter future. Gopal is eager to help support his struggling family until school starts, so when a stranger approaches him with the promise of a factory job, he jumps at the offer.", "But Gopal has been deceived. There is no factory but, instead, a small, stuffy sweatshop, where he and five other boys are forced to make beaded frames for no money and little food. The boys are forbidden to talk or even to call one another by their real names. In this atmosphere of distrust and isolation, locked in a rundown building in an unknown part of the city, Gopal despairs of ever seeing his family again.", "Then, late one night when Gopal decides to share kahanis, or stories, he realizes that storytelling might be the boys' key to holding on to their sense of self and their hope for any kind of future. If he can make them feel more like brothers than enemies, their lives will be more bearable in the shop—and they might even find a way to escape."], "author": "Kashmira Sheth", "num_pages": "320", "awards": ["Washington State Sasquatch Award Nominee (2014)", "Rebecca Caudill Young Readers' Book Award Nominee (2014)"], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2010-01-19 00:00:00", "ISBN": "0061857602"},
{"url": "https://www.goodreads.com/book/show/434467.Ask_Me_No_Questions", "num_ratings": "1,772", "num_reviews": "390", "avg_ratings": 3.35, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Young Adult", "Teen", "Historical", "Historical Fiction", "Cultural", "Contemporary", "Academic", "School", "Family", "Adventure"], "title": "Ask Me No Questions", "description": ["Nadira and her family are illegal aliens, fleeing to the Canadian border -- running from the country they thought was their home. For years since emigrating from Bangladesh, they have lived on expired visas in New York City, hoping they could someday realize their dream of becoming legal citizens of the United States. But after 9/11, everything changes. Suddenly, being Mus", "Nadira and her family are illegal aliens, fleeing to the Canadian border -- running from the country they thought was their home. For years since emigrating from Bangladesh, they have lived on expired visas in New York City, hoping they could someday realize their dream of becoming legal citizens of the United States. But after 9/11, everything changes. Suddenly, being Muslim means being dangerous, a suspected terrorist. And when Nadira's father is arrested and detained at the border, Nadira and her older sister, Aisha, are sent back to Queens and told to carry on, as if everything is the same. ", " But of course nothing is the same. Nadira and Aisha live in fear they'll have to return to a Bangladesh they hardly know. Aisha, always the responsible one, falls apart. It's up to Nadira to find a way to bring her family back together again. ", " Critically acclaimed author Marina Budhos has given us a searing portrait of contemporary America in the days of terrorism, orange alerts, and the Patriot Act, and a moving and important story about something most people take for granted -- citizenship and acceptance in their country."], "author": "Marina Budhos", "num_pages": "176", "awards": ["James Cook Book Award (2007)"], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "1416903518"},
{"url": "https://www.goodreads.com/book/show/219563.Shabanu", "num_ratings": "6,485", "num_reviews": "560", "avg_ratings": 3.77, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Cultural", "Pakistan"], "title": "Shabanu: Daughter of the Wind", "description": ["Life is both sweet and cruel to strong-willed young Shabanu, whose home is the windswept Cholistan Desert of Pakistan. The second daughter in a family with no sons, she' s been allowed freedoms forbidden to most Muslim girls. But when a tragic encounter with a wealthy and powerful landowner ruins the marriage plans of her older sister, Shabanu is called upon to sacrifice e", "Life is both sweet and cruel to strong-willed young Shabanu, whose home is the windswept Cholistan Desert of Pakistan. The second daughter in a family with no sons, she' s been allowed freedoms forbidden to most Muslim girls. But when a tragic encounter with a wealthy and powerful landowner ruins the marriage plans of her older sister, Shabanu is called upon to sacrifice everything she' s dreamed of. Should she do what is necessary to uphold her family' s honor-- or listen to the stirrings of her own heart?"], "author": "Suzanne Fisher Staples", "num_pages": "240", "awards": ["Newbery Medal Nominee (1990)", "Dorothy Canfield Fisher Children's Book Award Nominee (1991)"], "places": ["Pakistan"], "character_names": ["Shabanu", "Phulan", "Mama", "Dadi", "Auntie"], "language": "English", "publish_date": "2003-08-12 00:00:00", "ISBN": "0440238560"},
{"url": "https://www.goodreads.com/book/show/970477.Bindi_Babes", "num_ratings": "510", "num_reviews": "71", "avg_ratings": 3.42, "genres": ["Young Adult", "Fiction", "Young Adult", "Teen", "Realistic Fiction", "Cultural", "India", "Childrens", "Middle Grade", "Cultural"], "title": "Bindi Babes", "description": ["Meet Amber, Jazz, and Geena Dhillon—a.k.a. the Bindi Babes. They’re three fabulous sisters with a reputation for being the coolest, best-dressed girls at their school. But their classmates don’t know that the Dhillon sisters work extra hard to look perfect and together to all of their friends . . . while privately trying not to think how much they miss their mom, who died", "Meet Amber, Jazz, and Geena Dhillon—a.k.a. the Bindi Babes. They’re three fabulous sisters with a reputation for being the coolest, best-dressed girls at their school. But their classmates don’t know that the Dhillon sisters work extra hard to look perfect and together to all of their friends . . . while privately trying not to think how much they miss their mom, who died a year ago. What these struggling sisters certainly don’t need is an interfering auntie from India inviting herself into their household to cramp their style. Unfortunately, that’s exactly what their dad allows to happen.", "Soon the sisters’ pushover dad is saying no to designer clothes and expensive sneakers, and Auntie is butting into every area of their lives. What are the Bindi babes to do? There’s only one way to be rid of Auntie: marry her off to some unsuspecting guy. Will Amber, Jazz, and Geena find a man who can put up with Auntie before she completely ruins their lives? Or are Auntie’s new rules doomed to make the fabulous Dhillon sisters just . . . average?"], "author": "Narinder Dhami", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-11-08 00:00:00", "ISBN": "0440420199"},
{"url": "https://www.goodreads.com/book/show/11164727-the-whole-story-of-half-a-girl", "num_ratings": "981", "num_reviews": "204", "avg_ratings": 3.8, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Young Adult", "Fiction", "Cultural", "Childrens", "Juvenile"], "title": "The Whole Story of Half a Girl", "description": ["After her father loses his job, Sonia Nadhamuni, half Indian and half Jewish American, finds herself yanked out of private school and thrown into the unfamiliar wor", "After her father loses his job, Sonia Nadhamuni, half Indian and half Jewish American, finds herself yanked out of private school and thrown into the unfamiliar world of public education. For the first time, Sonia's mixed heritage makes her classmates ask questions—questions Sonia doesn't always know how to answer—as she navigates between a group of popular girls who want her to try out for the cheerleading squad and other students who aren't part of the \"in\" crowd. ", "At the same time that Sonia is trying to make new friends, she's dealing with what it means to have an out-of-work parent—it's hard for her family to adjust to their changed circumstances. And then, one day, Sonia's father goes missing. Now Sonia wonders if she ever really knew him. As she begins to look for answers, she must decide what really matters and who her true friends are—and whether her two halves, no matter how different, can make her a whole."], "author": "Veera Hiranandani", "num_pages": "224", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (2014)"], "places": [], "character_names": ["Sonia Nadhamuni"], "language": "English", "publish_date": "2012-01-10 00:00:00", "ISBN": "0385741286"},
{"url": "https://www.goodreads.com/book/show/2791008-child-of-dandelions", "num_ratings": "397", "num_reviews": "88", "avg_ratings": 3.77, "genres": ["Historical", "Historical Fiction", "Young Adult", "Cultural", "Africa", "Fiction", "Cultural", "Historical", "Eastern Africa", "Uganda"], "title": "Child of Dandelions", "description": ["A breathtaking account of one girl's determination to triumph over a devastating historical event. In Uganda in 1972, President Idi Amin, also known as the Last King of Scotland, announces that foreign Indians must be \"weeded\" out of Uganda in ninety days. Fifteen-year-old Sabine's life is changed forever. The president's message, broadcast on the radio every day, becomes", "A breathtaking account of one girl's determination to triumph over a devastating historical event. In Uganda in 1972, President Idi Amin, also known as the Last King of Scotland, announces that foreign Indians must be \"weeded\" out of Uganda in ninety days. Fifteen-year-old Sabine's life is changed forever. The president's message, broadcast on the radio every day, becomes Sabine's \"countdown monster,\" and it follows her through days of terror. Sabine's father is convinced that, as Ugandan citizens, their family will be unaffected, but her mother insists it's too dangerous to stay. When her beloved uncle disappears and her best friend abandons her, Sabine begins to understand her mother's fears. She becomes desperate to leave, but Bapa, her grandfather, refuses to accompany her. How can she leave him, and where will her family go to begin a new life?"], "author": "Shenaaz Nanji", "num_pages": "213", "awards": ["Geoffrey Bilson Award for Historical Fiction for Young People Nominee (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-01 00:00:00", "ISBN": "1932425934"},
{"url": "https://www.goodreads.com/book/show/8098718-saraswati-s-way", "num_ratings": "212", "num_reviews": "45", "avg_ratings": 3.67, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Cultural", "India", "Young Adult", "Fiction"], "title": "Saraswati's Way", "description": ["Saraswati's Way"], "author": "Monika Schröder", "num_pages": "240", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2010-11-09 00:00:00", "ISBN": "0374364117"},
{"url": "https://www.goodreads.com/book/show/3852015-secret-keeper", "num_ratings": "548", "num_reviews": "147", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Young Adult", "Cultural", "India", "Cultural", "Fiction", "Family", "Historical", "Realistic Fiction"], "title": "Secret Keeper", "description": ["When her father loses his job and leaves India to look for work in America, Asha Gupta, her older sister, Reet, and their mother must wait with Baba’s brother and his family, as well as their grandmother, in Calcutta. Uncle is welcoming, but in a country steeped in tradition, the three women must abide by his decisions. Asha knows this is temporary—just until Baba sends fo", "When her father loses his job and leaves India to look for work in America, Asha Gupta, her older sister, Reet, and their mother must wait with Baba’s brother and his family, as well as their grandmother, in Calcutta. Uncle is welcoming, but in a country steeped in tradition, the three women must abide by his decisions. Asha knows this is temporary—just until Baba sends for them. But with scant savings and time passing, the tension builds: Ma, prone to spells of sadness, finds it hard to submit to her mother- and sister-in-law; Reet’s beauty attracts unwanted marriage proposals; and Asha's promise to take care of Ma and Reet leads to impulsive behavior. What follows is a firestorm of rebuke—and secrets revealed! Asha’s only solace is her rooftop hideaway, where she pours her heart out in her diary, and where she begins a clandestine friendship with Jay Sen, the boy next door. Asha can hardly believe that she, and not Reet, is the object of Jay’s attention. Then news arrives about Baba . . . and Asha must make a choice that will change their lives forever."], "author": "Mitali Perkins", "num_pages": "240", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2009-01-13 00:00:00", "ISBN": "0385733402"},
{"url": "https://www.goodreads.com/book/show/9843661-jazz-in-love", "num_ratings": "75", "num_reviews": "26", "avg_ratings": 3.6, "genres": ["Young Adult", "Romance", "Contemporary", "Fiction", "Realistic Fiction"], "title": "Jazz in Love", "description": ["Jasbir, a.k.a. Jazz, has always been a stellar student and an obedient, albeit wise-cracking, daughter. Everything has gone along just fine--she has good friends in the \"genius\" program she's been in since kindergarten, her teachers and principal adore her, and her parents dote on her. But now, in her junior year of high school, her mother hears that Jazz was seen hugging", "Jasbir, a.k.a. Jazz, has always been a stellar student and an obedient, albeit wise-cracking, daughter. Everything has gone along just fine--she has good friends in the \"genius\" program she's been in since kindergarten, her teachers and principal adore her, and her parents dote on her. But now, in her junior year of high school, her mother hears that Jazz was seen hugging a boy on the street and goes ballistic. Mom immediately implements the Guided Dating Plan, which includes setting up blind dates with \"suitable,\" pre-screened Indian candidates. The boy her mother sets her up with, however, is not at all what anyone expects; and the new boy at school, the very UNsuitable hottie, is the one who sets Jazz's blood boiling. When Jazz makes a few out-of-the-ordinary decisions, everything explodes, and she realizes she'll need a lot more than her genius education to get out of the huge mess she's in. Can Jazz find a way to follow her own heart, and still stay in the good graces of her parents?"], "author": "Neesha Meminger", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-03 00:00:00", "ISBN": "0983158304"},
{"url": "https://www.goodreads.com/book/show/656159.Extreme_American_Makeover", "num_ratings": "278", "num_reviews": "55", "avg_ratings": 3.64, "genres": ["Young Adult", "Parenting", "Adoption", "Young Adult", "Teen", "Realistic Fiction", "Fiction", "Cultural", "Politics", "Childrens", "Middle Grade", "Family", "Contemporary"], "title": "Extreme American Makeover", "description": ["Adopted from Pakistan when she was three, Sameera \"Sparrow\" Righton is not your typical all-American girl. None of this used to matter, but that was before her father decided to run for president of the United States. Now some of her father's campaign staffers think that maybe a dark-skinned, adopted daughter could hurt his chances. They begin to pressure Sameera to change", "Adopted from Pakistan when she was three, Sameera \"Sparrow\" Righton is not your typical all-American girl. None of this used to matter, but that was before her father decided to run for president of the United States. Now some of her father's campaign staffers think that maybe a dark-skinned, adopted daughter could hurt his chances. They begin to pressure Sameera to change her name to Sammy and to be more \"American.\" Sameera is torn between molding herself into the perfect daughter and being true to herself. Who will win out? Sparrow? Or Sammy?"], "author": "Mitali Perkins", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-06-14 00:00:00", "ISBN": "0525478000"},
{"url": "https://www.goodreads.com/book/show/3559996-shine-coconut-moon", "num_ratings": "420", "num_reviews": "92", "avg_ratings": 3.64, "genres": ["Young Adult", "Contemporary", "Cultural", "Fiction", "Realistic Fiction", "Religion", "Young Adult", "Teen"], "title": "Shine, Coconut Moon", "description": ["Seventeen-year-old Samar -- a.k.a. Sam -- has never known much about her Indian heritage. Her mom has deliberately kept Sam away from her old-fashioned family. It's never bothered Sam, who is busy with school, friends, and a really cute but demanding boyfriend.But things change after 9/11. A guy in a turban shows up at Sam's house, and he turns out to be her uncle. He want", "Seventeen-year-old Samar -- a.k.a. Sam -- has never known much about her Indian heritage. Her mom has deliberately kept Sam away from her old-fashioned family. It's never bothered Sam, who is busy with school, friends, and a really cute but demanding boyfriend.But things change after 9/11. A guy in a turban shows up at Sam's house, and he turns out to be her uncle. He wants to reconcile the family and teach Sam about her Sikh heritage. Sam isn't sure what to do, until a girl at school calls her a coconut -- brown on the outside, white on the inside. That decides it: Why shouldn't Sam get to know her family? What is her mom so afraid of? Then some boys attack her uncle, shouting, \"Go back home, Osama!\" and Sam realizes she could be in danger -- and also discovers how dangerous ignorance can be. Sam will need all her smarts and savvy to try to bridge two worlds and make them both her own."], "author": "Neesha Meminger", "num_pages": "256", "awards": [], "places": ["Linton, New Jersey"], "character_names": ["Samar Ahluwahlia", "Sharanjit Ahluwahlia", "Sandeep Ahluwahlia", "Molly MacFadden", "Mike Brezinsky"], "language": "English", "publish_date": "2009-03-10 00:00:00", "ISBN": "1416954953"},
{"url": "https://www.goodreads.com/book/show/3124412-beneath-my-mother-s-feet", "num_ratings": "689", "num_reviews": "135", "avg_ratings": 3.68, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Cultural", "Pakistan"], "title": "Beneath My Mother's Feet", "description": [" ", " Nazia doesn't mind when her friends tease and call her a good beti, a dutiful daughter. Growing up in a working-class family in Karachi, Pakistan, Nazia knows that obedience is the least she can give to her mother, who has spent years saving and preparing for her dowry. But every daughter m", " ", " Nazia doesn't mind when her friends tease and call her a good beti, a dutiful daughter. Growing up in a working-class family in Karachi, Pakistan, Nazia knows that obedience is the least she can give to her mother, who has spent years saving and preparing for her dowry. But every daughter must grow up, and for fourteen-year-old Nazia that day arrives suddenly when her father gets into an accident at work, and her family finds themselves without money for rent or food. ", " Being the beti that she is, Nazia drops out of school to help her mother clean houses, all the while wondering when she managed to lose control of her life that had been full of friends and school. Working as a maid is a shameful obligation that could be detrimental to her future -- after all, no one wants a housekeeper for a daughter-in-law. As Nazia finds herself growing up much too quickly, the lessons of hardship that seem unbearable turn out to be a lot more liberating than she ever imagined."], "author": "Amjed Qamar", "num_pages": "198", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-17 00:00:00", "ISBN": "1416947280"},
{"url": "https://www.goodreads.com/book/show/22524101-my-so-called-bollywood-life", "num_ratings": "864", "num_reviews": "293", "avg_ratings": 3.68, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "My So-Called Bollywood Life", "description": ["Winnie Mehta was never really convinced that Raj was her soulmate, but their love was written in the stars. Literally, a pandit predicted Winnie would find the love of her life before her 18th birthday, and Raj meets all of the qualifications. Which is why Winnie is shocked to return from her summer at film camp to find her boyfriend of three years hooking up with Jenny Di", "Winnie Mehta was never really convinced that Raj was her soulmate, but their love was written in the stars. Literally, a pandit predicted Winnie would find the love of her life before her 18th birthday, and Raj meets all of the qualifications. Which is why Winnie is shocked to return from her summer at film camp to find her boyfriend of three years hooking up with Jenny Dickens. Worse, Raj is crowned chair of the student film festival, a spot Winnie was counting on for her film school applications. As a self-proclaimed Bollywood expert, Winnie knows this is not how her perfect ending is scripted.", "Then there’s Dev, a fellow film geek, and one of the few people Winnie can count on to help her reclaim control of her story. Dev is smart charming, and challenges Winnie to look beyond her horoscope to find someone she’d pick for herself. But does falling for Dev mean giving up on her prophecy, and her chance to live happily ever after? To get her Bollywood-like life on track, Winnie will need a little bit of help from fate, family, and of course, a Bollywood movie star. ", "Like an expertly choreographed Bollywood dance scene, Nisha Sharma’s off-beat love story dazzles in the lime light."], "author": "Nisha Sharma", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-05-15 00:00:00", "ISBN": "0553523252"},
{"url": "https://www.goodreads.com/book/show/12980968-jasmine-skies", "num_ratings": "381", "num_reviews": "56", "avg_ratings": 3.88, "genres": ["Young Adult", "Realistic Fiction", "Cultural", "India", "Fiction"], "title": "Jasmine Skies", "description": ["14-year-old Mira Levenson travels to India to finally meet her family and is quickly swept into a sweltering, chaotic world - full of new sights, smells and deeply buried family secrets."], "author": "Sita Brahmachari", "num_pages": "336", "awards": ["Carnegie Medal Nominee (2013)"], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2012-03-29 00:00:00", "ISBN": "1447205189"},
{"url": "https://www.goodreads.com/book/show/388658.Motherland", "num_ratings": "201", "num_reviews": "38", "avg_ratings": 3.43, "genres": ["Cultural", "India", "Fiction", "Young Adult", "Cultural", "Contemporary", "Cultural", "Asia"], "title": "Motherland", "description": ["In this quiet but engaging debut novel, an American teenager spends the summer with her relatives in southern India and gains new insight into her past, her family and her heritage. Born in Kerala, Maya spent the first four years of her life there, cared for mainly by her grandmother, Ammamma, until she was sent to live with her parents in New York. At 15, with her parents", "In this quiet but engaging debut novel, an American teenager spends the summer with her relatives in southern India and gains new insight into her past, her family and her heritage. Born in Kerala, Maya spent the first four years of her life there, cared for mainly by her grandmother, Ammamma, until she was sent to live with her parents in New York. At 15, with her parents' marriage undergoing a rough patch, she is sent back to India to stay with her Aunt Reema and Uncle Sanjay, their 10-year-old daughter, Brindha, and Ammamma at their house in the tea hills above Coimbatore. It's been years since Maya came to visit, and this time she is keenly aware of cultural differences: the different spheres of men and women and the persistence of the caste system. She feels stifled by the attentions of Ammamma and resentful of the time she must spend with the old woman. When Maya suffers an accident while most of the family is away, she and Ammamma grow closer, and Maya learns a hidden family fact. But only when Ammamma falls ill and the entire family gathers, including Maya's parents from New York, does Maya begin to comprehend more deeply the complexities of relationships."], "author": "Vineeta Vijayaraghavan", "num_pages": "240", "awards": ["ALA Alex Award (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-07-01 00:00:00", "ISBN": "1569472831"},
{"url": "https://www.goodreads.com/book/show/539108.Maya_Running", "num_ratings": "144", "num_reviews": "25", "avg_ratings": 3.58, "genres": ["Young Adult", "Cultural", "India", "Fantasy", "Childrens", "Middle Grade", "Cultural", "Canada", "Fiction", "Young Adult", "Coming Of Age", "Childrens", "Historical", "Historical Fiction", "Realistic Fiction"], "title": "Maya Running", "description": ["Maya Mukherjee doesn’t fit in. She was born in India and her parents moved to Canada when she was a baby. Now it’s the 1970s, and she’s a middle schooler in Manitoba, land of moose and snow. She wants to run on the tundra beneath the Northern Lights, make igloos or snow-angels, see John Travolta, and ride elephants through the Bengal jungle the way her great-grandfather di", "Maya Mukherjee doesn’t fit in. She was born in India and her parents moved to Canada when she was a baby. Now it’s the 1970s, and she’s a middle schooler in Manitoba, land of moose and snow. She wants to run on the tundra beneath the Northern Lights, make igloos or snow-angels, see John Travolta, and ride elephants through the Bengal jungle the way her great-grandfather did. Then her gorgeous cousin Pinky comes from India for a visit, bringing a statue of the god Ganesh, the Remover of Obstacles. Maya asks Ganesh to remove all obstacles to her dreams. Like most wishes, it backfires in hilarious and painful ways. Maya must journey across continents to restore the truth and find out who she is."], "author": "Anjali Banerjee", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-08 00:00:00", "ISBN": "0553494244"},
{"url": "https://www.goodreads.com/book/show/18048966-saving-kabul-corner", "num_ratings": "296", "num_reviews": "60", "avg_ratings": 3.76, "genres": ["Mystery", "Childrens", "Middle Grade", "Realistic Fiction", "Fiction", "Family"], "title": "Saving Kabul Corner", "description": ["A rough and tumble tomboy, twelve-year-old Ariana couldn’t be more different from her cousin Laila, who just arrived from Afghanistan with her family. Laila is a proper, ladylike Afghan girl, one who can cook, sew, sing, and who is well versed in Pukhtun culture and manners. Arianna hates her. Laila not only invades Ariana’s bedroom in their cramped Fremont townhouse, but", "A rough and tumble tomboy, twelve-year-old Ariana couldn’t be more different from her cousin Laila, who just arrived from Afghanistan with her family. Laila is a proper, ladylike Afghan girl, one who can cook, sew, sing, and who is well versed in Pukhtun culture and manners. Arianna hates her. Laila not only invades Ariana’s bedroom in their cramped Fremont townhouse, but she also becomes close with Mariam Nurzai, Ariana’s best friend.", "Then a rival Afghan grocery store opens near Ariana’s family store, reigniting a decades-old feud tracing back to Afghanistan. The cousins, Mariam, and their newfound frenemy, Waleed Ghilzai, must ban together to help the families find a lasting peace before it destroys both businesses and everything their parents have worked for."], "author": "N.H. Senzai", "num_pages": "288", "awards": ["Edgar Award Nominee for Best Juvenile (2015)"], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-04 00:00:00", "ISBN": "1442484969"},
{"url": "https://www.goodreads.com/book/show/198517.The_Not_So_Star_Spangled_Life_of_Sunita_Sen", "num_ratings": "390", "num_reviews": "74", "avg_ratings": 3.64, "genres": ["Young Adult", "Realistic Fiction", "Cultural", "India", "Childrens", "Middle Grade", "Cultural", "Fiction"], "title": "The Not-So-Star-Spangled Life of Sunita Sen", "description": ["As Indian culture continues to curry the movies, music, and literature of American culture, the time is perfect to re-introduce this Indian-themed novel about a young girl's heart-felt attempt to straddle her two worlds. Like any other eighth grader, smart and spunky Sunita Sen just wants to fit in. She feels she's doing pretty well, especially as her friendship with the s", "As Indian culture continues to curry the movies, music, and literature of American culture, the time is perfect to re-introduce this Indian-themed novel about a young girl's heart-felt attempt to straddle her two worlds. Like any other eighth grader, smart and spunky Sunita Sen just wants to fit in. She feels she's doing pretty well, especially as her friendship with the school's tennis star starts to blossom into something more. But when Sunita's grandparents come from India to stay with her family, her lifestyle changes, and Sunita suddenly becomes aware of identity issues she's never before faced. Should she hide her heritage and be like everyone else, or can she find a way to embrace it? Originally published in 1993 as The Sunita Experiment, this touching yet light-hearted tale is back in print in hard and soft cover with a snappy new title, a spectacular jacket design, and a reader's guide."], "author": "Mitali Perkins", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-06 00:00:00", "ISBN": "0316734535"},
{"url": "https://www.goodreads.com/book/show/7788379-shooting-kabul", "num_ratings": "3,893", "num_reviews": "749", "avg_ratings": 3.92, "genres": ["Historical", "Historical Fiction", "Young Adult", "Realistic Fiction", "Fiction", "Childrens", "Middle Grade", "Cultural"], "title": "Shooting Kabul", "description": ["In the summer of 2001, twelve-year-old Fadi's parents make the difficult decision to illegally leave Afghanistan and move the family to the United States. When their underground transport arrives at the rendezvous point, chaos ensues, and Fadi is left dragging his younger sister Mariam through the crush of people. But Mariam accidentally lets go of his hand and becomes los", "In the summer of 2001, twelve-year-old Fadi's parents make the difficult decision to illegally leave Afghanistan and move the family to the United States. When their underground transport arrives at the rendezvous point, chaos ensues, and Fadi is left dragging his younger sister Mariam through the crush of people. But Mariam accidentally lets go of his hand and becomes lost in the crowd, just as Fadi is snatched up into the truck. With Taliban soldiers closing in, the truck speeds away, leaving Mariam behind. "], "author": "N.H. Senzai", "num_pages": "272", "awards": ["Asian/Pacific American Award for Literature for Young Adult (2010)", "Rebecca Caudill Young Readers' Book Award Nominee (2013)"], "places": ["Kabul"], "character_names": [], "language": "English", "publish_date": "2010-06-22 00:00:00", "ISBN": "144240194X"},
{"url": "https://www.goodreads.com/book/show/16074827-a-moment-comes", "num_ratings": "426", "num_reviews": "101", "avg_ratings": 3.64, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Cultural", "India", "Fiction", "Romance"], "title": "A Moment Comes", "description": ["As the partition of India nears in 1947 bringing violence even to Jalandhar, Tariq, a Muslim, finds himself caught between his forbidden interest in Anupreet, a Sikh girl, and Margaret, a British girl whose affection for him might help with his dream of studying at Oxford."], "author": "Jennifer Bradbury", "num_pages": "288", "awards": [], "places": ["Jalandhar"], "character_names": [], "language": "English", "publish_date": "2013-06-25 00:00:00", "ISBN": "1416978763"},
{"url": "https://www.goodreads.com/book/show/20487349-ticket-to-india", "num_ratings": "143", "num_reviews": "37", "avg_ratings": 3.83, "genres": ["Childrens", "Middle Grade", "Realistic Fiction", "Adventure", "Historical", "Historical Fiction", "Cultural", "India", "Travel", "Fiction", "Family"], "title": "Ticket to India", "description": ["A trip to India turns into a grand adventure in this contemporary novel about the Great Partition, from the award-winning author of Saving Kabul Corner and Shooting Kabul.", "A map, two train tickets, and a mission. These are things twelve-year-old Maya and her big sister Zara have when they set off on their own from Delhi to their grandmother’s childhood home of Aminpur, a sm", "A trip to India turns into a grand adventure in this contemporary novel about the Great Partition, from the award-winning author of Saving Kabul Corner and Shooting Kabul.", "A map, two train tickets, and a mission. These are things twelve-year-old Maya and her big sister Zara have when they set off on their own from Delhi to their grandmother’s childhood home of Aminpur, a small town in Northern India. Their goal is to find a chest of family treasures that their grandmother’s family left behind when they fled from India to Pakistan during the Great Partition. But soon the sisters become separated, and Maya is alone. Determined to find her grandmother’s lost chest, she continues her trip, on the way enlisting help from an orphan by named Jai.", "Maya’s grand adventure through India is as thrilling as it is warm: a journey through her family’s history becomes a real coming-of-age quest."], "author": "N.H. Senzai", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-11-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17267943-the-garden-of-my-imaan", "num_ratings": "293", "num_reviews": "92", "avg_ratings": 3.73, "genres": ["Childrens", "Middle Grade", "Realistic Fiction", "Religion", "Islam", "Muslims", "Religion", "Islam", "Cultural"], "title": "The Garden of My Imaan", "description": ["Aliya already struggles with trying to fit in, feeling confident enough to talk to the cute boy or stand up to mean kids — the fact that shes Muslim is just another thing to deal with. When Marwa, a Moroccan girl who shares her faith if not her culture, comes to Aliya's school, Aliya wonders even more about who she is, what she believes, and where she fits in. Should she f", "Aliya already struggles with trying to fit in, feeling confident enough to talk to the cute boy or stand up to mean kids — the fact that shes Muslim is just another thing to deal with. When Marwa, a Moroccan girl who shares her faith if not her culture, comes to Aliya's school, Aliya wonders even more about who she is, what she believes, and where she fits in. Should she fast for Ramadan? Should she wear the hijab? Shes old enough for both, but does she really want to call attention to herself?"], "author": "Farhana Zia", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-01 00:00:00", "ISBN": "1561456985"},
{"url": "https://www.goodreads.com/book/show/3873259-skunk-girl", "num_ratings": "461", "num_reviews": "93", "avg_ratings": 3.34, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Cultural", "Humor", "Contemporary"], "title": "Skunk Girl", "description": ["If Nina Khan were to rate herself on the unofficial Pakistani prestige point system – the one she's sure all the aunties and uncles use to determine the most attractive marriage prospects for their children – her scoring might go something like this: ", "for getting excellent grades ", "for failing to live up to expectations set by genius older sister ", "If Nina Khan were to rate herself on the unofficial Pakistani prestige point system – the one she's sure all the aunties and uncles use to determine the most attractive marriage prospects for their children – her scoring might go something like this: ", "for getting excellent grades ", "for failing to live up to expectations set by genius older sister ", "for dutifully obeying parents and never, ever going to parties, no matter how antisocial that makes her seem to everyone at Deer Hook High ", "for harboring secret jealousy of her best friends, who are allowed to date like normal teenagers ", "for never drinking an alcoholic beverage ", "for obsessing about Asher Richelli, who talks to Nina like she's not a freak at all, even though he knows that she has a disturbing line of hair running down her back", "In this wryly funny debut novel, the smart, sassy, and utterly lovable Nina Khan tackles friends, family, and love, and learns that it's possible to embrace two very different cultures – even if things can get a little bit, well, ", "."], "author": "Sheba Karim", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-31 00:00:00", "ISBN": "0374370117"},
{"url": "https://www.goodreads.com/book/show/18267068-the-art-of-secrets", "num_ratings": "943", "num_reviews": "215", "avg_ratings": 3.49, "genres": ["Young Adult", "Mystery", "Contemporary", "Realistic Fiction", "Fiction", "Art"], "title": "The Art of Secrets", "description": ["When Saba Khan’s apartment burns in a mysterious fire, possibly a hate crime, her Chicago high school rallies around her. Her family moves rent-free into a luxury apartment, Saba’s Facebook page explodes, and she starts (secretly) dating a popular boy. Then a quirky piece of art donated to a school fund-rais", "When Saba Khan’s apartment burns in a mysterious fire, possibly a hate crime, her Chicago high school rallies around her. Her family moves rent-free into a luxury apartment, Saba’s Facebook page explodes, and she starts (secretly) dating a popular boy. Then a quirky piece of art donated to a school fund-raising effort for the Khans is revealed to be an unknown work by a famous artist, worth hundreds of thousands of dollars, and Saba’s life turns upside down again. Should Saba’s family have all that money? Or should it go to the students who found the art? Or to the school? And just what caused that fire? Greed, jealousy, and suspicion create an increasingly tangled web as students and teachers alike debate who should get the money and begin to point fingers and make accusations. The true story of the fire that sets events in motion and what happens afterward gradually comes together in an innovative narrative made up of journal entries, interviews, articles, letters, text messages, and other documents."], "author": "James Klise", "num_pages": "272", "awards": ["Edgar Award for Best Young Adult (2015)", "Dorothy Canfield Fisher Children's Book Award Nominee (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-22 00:00:00", "ISBN": "1616201959"},
{"url": "https://www.goodreads.com/book/show/37612.Monsoon_Summer", "num_ratings": "610", "num_reviews": "112", "avg_ratings": 3.81, "genres": ["Young Adult", "Cultural", "India", "Fiction", "Contemporary", "Young Adult", "Teen", "Realistic Fiction", "Romance"], "title": "Monsoon Summer", "description": ["Jasmine “Jazz” Gardner heads off to India during the monsoon season. The family trip is her mother’s doing: Mrs. Gardner wants to volunteer at the orphanage that cared for her when she was young. But going to India isn’t Jazz’s idea of a great summer vacation. She wants no part of her mother’s do-gooder endeavors.", "What’s more, Jazz is heartsick. She’s leaving the business s", "Jasmine “Jazz” Gardner heads off to India during the monsoon season. The family trip is her mother’s doing: Mrs. Gardner wants to volunteer at the orphanage that cared for her when she was young. But going to India isn’t Jazz’s idea of a great summer vacation. She wants no part of her mother’s do-gooder endeavors.", "What’s more, Jazz is heartsick. She’s leaving the business she and her best friend, Steve Morales, started—as well as Steve himself. Jazz is crazy in love with the guy. If only he knew!", "Only when Jazz reluctantly befriends Danita, a girl who cooks for her family, and who faces a tough dilemma, does Jazz begin to see how she can make a difference—to her own family, to Danita, to the children at the orphanage, even to Steve. As India claims Jazz, the monsoon works its madness ", " its magic."], "author": "Mitali Perkins", "num_pages": "257", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2006-04-11 00:00:00", "ISBN": "0440238404"},
{"url": "https://www.goodreads.com/book/show/18378827-abby-spencer-goes-to-bollywood", "num_ratings": "322", "num_reviews": "101", "avg_ratings": 3.86, "genres": ["Childrens", "Middle Grade", "Realistic Fiction", "Contemporary", "Cultural", "Young Adult", "Childrens", "Fiction"], "title": "Abby Spencer Goes to Bollywood", "description": ["What thirteen-year-old Abby wants most is to meet her father. She just never imagined he would be a huge film star--in Bollywood! Now she's traveling to Mumbai to get to know her famous father. Abby is overwhelmed by the culture clash, the pressures of being the daughter of India's most famous celebrity, and the burden of keeping her identity a secret. But as she learns to", "What thirteen-year-old Abby wants most is to meet her father. She just never imagined he would be a huge film star--in Bollywood! Now she's traveling to Mumbai to get to know her famous father. Abby is overwhelmed by the culture clash, the pressures of being the daughter of India's most famous celebrity, and the burden of keeping her identity a secret. But as she learns to navigate her new surroundings, she just might discover where she really belongs."], "author": "Varsha Bajaj", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-03-01 00:00:00", "ISBN": "0807563633"},
{"url": "https://www.goodreads.com/book/show/201114.Sold", "num_ratings": "42,306", "num_reviews": "5,282", "avg_ratings": 4.2, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Poetry", "Sociology", "Abuse"], "title": "Sold", "description": ["Although Lakshmi's family is desperately poor her life still contains simple pleasures; but, when the harsh Himalayan monsoons wash away all the family’s crops, Lakshmi’s stepfather sends her away to take a job to support her family. When she arrives at “Happiness House”, full of hope, she learns the unthinkable truth: she has been sold into prostitution. An exceptional no", "Although Lakshmi's family is desperately poor her life still contains simple pleasures; but, when the harsh Himalayan monsoons wash away all the family’s crops, Lakshmi’s stepfather sends her away to take a job to support her family. When she arrives at “Happiness House”, full of hope, she learns the unthinkable truth: she has been sold into prostitution. An exceptional novel suitable for teens and adults.", "Lakshmi is a thirteen-year-old girl who lives with her family in a small hut in the mountains of Nepal. Her family is desperately poor, but her life is full of simple pleasures, like raising her black-and-white speckled goat, and having her mother brush her hair by the light of an oil lamp. But when the harsh Himalayan monsoons wash away all that remains of the family’s crops, Lakshmi’s stepfather says she must leave home and take a job to support her family. ", "He introduces her to a glamorous stranger who tells her she will find her a job as a maid working for a wealthy woman in the city. Glad to be able to help, Lakshmi undertakes the long journey to India and arrives at “Happiness House” full of hope. But she soon learns the unthinkable truth: she has been sold into prostitution. ", "An old woman named Mumtaz rules the brothel with cruelty and cunning. She tells Lakshmi that she is trapped there until she can pay off her family’s debt – then cheats Lakshmi of her meager earnings so that she can never leave. ", "Lakshmi’s life becomes a nightmare from which she cannot escape. Still, she lives by her mother’s words – “Simply to endure is to triumph” – and gradually, she forms friendships with the other girls that enable her to survive in this terrifying new world. Then the day comes when she must make a decision – will she risk everything for a chance to reclaim her life? ", "Written in spare and evocative vignettes, this powerful novel renders a world that is as unimaginable as it is real, and a girl who not only survives but triumphs. ", "To research Sold, Patricia McCormick traveled to India and Nepal where she interviewed the women of Calcutta’s red-light district and girls who have been rescued from the sex trade. She is the author of the acclaimed novels Cut and My Brother’s Keeper."], "author": "Patricia McCormick", "num_pages": "268", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2009)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2009)", "California Young Readers Medal for Young Adult (2009)", "Lincoln Award Nominee (2009)", "James Cook Book Award Nominee (2007)", "National Book Award Finalist for Young People's Literature (2006)", "Missouri Gateway Readers Award Nominee (2009)"], "places": ["Nepal"], "character_names": [], "language": "English", "publish_date": "2006-09-15 00:00:00", "ISBN": "0786851716"},
{"url": "https://www.goodreads.com/book/show/18350034-the-secret-sky", "num_ratings": "834", "num_reviews": "182", "avg_ratings": 3.86, "genres": ["Young Adult", "Romance", "Realistic Fiction", "Fiction", "Contemporary", "Cultural", "Historical", "Historical Fiction", "Young Adult", "Teen", "War", "Religion"], "title": "The Secret Sky", "description": ["Fatima is a Hazara girl. She was raised to be obedient, to be dutiful, and to honour the traditions of her family, her village, and her religion. Samiullah is a Pashtun boy. He was raised to be a landowner, to increase his family's power, and to defend the traditions of his tribe, his village, and his religion. ", "They were not meant to fall in love. ", "But they do."], "author": "Atia Abawi", "num_pages": "320", "awards": [], "places": ["Afghanistan"], "character_names": [], "language": null, "publish_date": "2014-09-02 00:00:00", "ISBN": "0399160787"},
{"url": "https://www.goodreads.com/book/show/17290271-my-basmati-bat-mitzvah", "num_ratings": "578", "num_reviews": "160", "avg_ratings": 3.71, "genres": ["Childrens", "Middle Grade", "Realistic Fiction", "Young Adult", "Cultural", "Contemporary", "Fiction"], "title": "My Basmati Bat Mitzvah", "description": ["During the fall leading up to her bat mitzvah, Tara (Hindi for \"star\") Feinstein has a lot more than her Torah portion on her mind. Between Hebrew school and study sessions with the rabbi, there doesn’t seem to be enough time to hang out with her best friend Ben-o--who might also be her boyfriend--and her other best friend, Rebecca, who’s getting a little too cozy with tha", "During the fall leading up to her bat mitzvah, Tara (Hindi for \"star\") Feinstein has a lot more than her Torah portion on her mind. Between Hebrew school and study sessions with the rabbi, there doesn’t seem to be enough time to hang out with her best friend Ben-o--who might also be her boyfriend--and her other best friend, Rebecca, who’s getting a little too cozy with that snotty Sheila Rosenberg. Not to mention working on her robotics project with the class clown Ryan Berger, or figuring out what to do with a priceless heirloom sari that she accidentally ruined. Amid all this drama, Tara considers how to balance her Indian and Jewish identities and what it means to have a bat mitzvah while questioning her faith."], "author": "Paula J. Freedman", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-01 00:00:00", "ISBN": "1419708066"},
{"url": "https://www.goodreads.com/book/show/427805.Koyal_Dark_Mango_Sweet", "num_ratings": "655", "num_reviews": "82", "avg_ratings": 3.77, "genres": ["Young Adult", "Cultural", "India", "Fiction", "Romance", "Young Adult", "Teen", "Realistic Fiction"], "title": "Koyal Dark, Mango Sweet", "description": ["Jeetas family is caught up in the whirlwind of arranging marriages for her two older sisters, but the drama and excitement leave Jeeta cold. She knows that tradition demands the parade of suitors, the marriage negotiations, the elaborate displays, the expensive wedding parties but where is the love and romance that the movies promise? She dreads her turn on the matrimonial", "Jeetas family is caught up in the whirlwind of arranging marriages for her two older sisters, but the drama and excitement leave Jeeta cold. She knows that tradition demands the parade of suitors, the marriage negotiations, the elaborate displays, the expensive wedding parties but where is the love and romance that the movies promise? She dreads her turn on the matrimonial circuit, especially since Mummy is always complaining about how difficult it will be to find Jeeta a good husband, with her dark skin and sharp tongue. As Jeeta spends more time with her new friend from school, Sarina, and Sarinas educated, liberal parents, she begins to question her tradition-bound familys expectations. And when she falls in love with Sarinas cousin Neel, Jeeta realizes that she must strike a balance between independence and duty and follow her own path. With its gentle humor and a rich sense of place, Koyal Dark, Mango Sweet is an engaging coming-of-age novel set in contemporary Mumbai, India."], "author": "Kashmira Sheth", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0786838574"},
{"url": "https://www.goodreads.com/book/show/20578974-bombay-blues", "num_ratings": "215", "num_reviews": "64", "avg_ratings": 2.98, "genres": ["Young Adult", "Romance", "Fiction", "Realistic Fiction", "Cultural", "Contemporary", "Cultural", "India"], "title": "Bombay Blues", "description": ["The long-anticipated sequel to Tanuja Desai Hidier's groundbreaking BORN CONFUSED!", "In BORN CONFUSED, Indian-American just-turned-17-year-old Dimple Rohitbhai Lala found love, friendship, art, and home where she least expected it. But a lot's gone on in the years that have followed. And what happens if what you thought you wanted wasn't what you wanted after all? As she lear", "The long-anticipated sequel to Tanuja Desai Hidier's groundbreaking BORN CONFUSED!", "In BORN CONFUSED, Indian-American just-turned-17-year-old Dimple Rohitbhai Lala found love, friendship, art, and home where she least expected it. But a lot's gone on in the years that have followed. And what happens if what you thought you wanted wasn't what you wanted after all? As she learns during adventures that take her from India to New York to London and back, with a little luck and a lot of vision, the journey home might prove just as magical as what you left behind to make it."], "author": "Tanuja Desai Hidier", "num_pages": "560", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-26 00:00:00", "ISBN": "0545384788"},
{"url": "https://www.goodreads.com/book/show/251462.Blue_Jasmine", "num_ratings": "506", "num_reviews": "81", "avg_ratings": 3.87, "genres": ["Young Adult", "Realistic Fiction", "Cultural", "India", "Fiction", "Cultural", "Childrens", "Juvenile", "Childrens", "Middle Grade"], "title": "Blue Jasmine", "description": ["When twelve-year-old Seema Trivedi learns that she and her family must move from their small Indian town to Iowa City, she realizes she'll have to say good-bye to the purple-jeweled mango trees and sweet-smelling jasmine, to the monsoon rains and the bustling market. More important, she must leave behind her best friend and cousin, Raju. Everything is different in Iowa Cit", "When twelve-year-old Seema Trivedi learns that she and her family must move from their small Indian town to Iowa City, she realizes she'll have to say good-bye to the purple-jeweled mango trees and sweet-smelling jasmine, to the monsoon rains and the bustling market. More important, she must leave behind her best friend and cousin, Raju. Everything is different in Iowa City, where Seema feels like an outsider to the language and traditions. As she begins to plant roots in the foreign soil, however, her confidence starts to bloom, and she learns she can build a bridge between two homes. With lyrical language and poignant scenes, Kashmira Sheth unearths the meaning of \"home\" and \"family\" in this tender debut novel. Kashmira Sheth's own experiences as a teenager who moved by herself from India to America inspired her to write this novel. She is a microbiologist and lives with her family in Madison, Wisconsin."], "author": "Kashmira Sheth", "num_pages": "192", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0786855657"},
{"url": "https://www.goodreads.com/book/show/8828714-karma", "num_ratings": "1,482", "num_reviews": "257", "avg_ratings": 3.85, "genres": ["Young Adult", "Historical", "Historical Fiction", "Poetry", "Historical", "Fiction"], "title": "Karma", "description": ["On October 31, 1984, Indira Gandhi is gunned down by two Sikh bodyguards. The murder sparks riots in Delhi and for three days Sikh families are targeted and killed in retribution for the Prime Minister’s death. It is into this chaos that sixteen-year-old Maya and her Sikh father, Amar, arrive from their home in Canada. India’s political instability is the backdrop and cata", "On October 31, 1984, Indira Gandhi is gunned down by two Sikh bodyguards. The murder sparks riots in Delhi and for three days Sikh families are targeted and killed in retribution for the Prime Minister’s death. It is into this chaos that sixteen-year-old Maya and her Sikh father, Amar, arrive from their home in Canada. India’s political instability is the backdrop and catalyst for Maya’s awakening to the world."], "author": "Cathy Ostlere", "num_pages": "528", "awards": ["Canadian Library Association Young Adult Book Award Nominee (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-31 00:00:00", "ISBN": "1595143386"},
{"url": "https://www.goodreads.com/book/show/22060619-enter-title-here", "num_ratings": "1,176", "num_reviews": "360", "avg_ratings": 3.46, "genres": ["Young Adult", "Contemporary", "Realistic Fiction", "Fiction", "Young Adult", "Young Adult Contemporary"], "title": "Enter Title Here", "description": ["Reshma is a college counselor’s dream. She’s the top-ranked senior at her ultra-competitive Silicon Valley high school, with a spotless academic record and a long roster of extracurriculars. But there are plenty of perfect students in the country, and if", "Reshma is a college counselor’s dream. She’s the top-ranked senior at her ultra-competitive Silicon Valley high school, with a spotless academic record and a long roster of extracurriculars. But there are plenty of perfect students in the country, and if Reshma wants to get into Stanford, and into med school after that, she needs the hook to beat them all.", "What's a habitual over-achiever to do? Land herself a literary agent, of course. Which is exactly what Reshma does after agent Linda Montrose spots an article she wrote for Huffington Post. Linda wants to represent Reshma, and, with her new agent's help scoring a book deal, Reshma knows she’ll finally have the key to Stanford.", "But she’s convinced no one would want to read a novel about a study machine like her. To make herself a more relatable protagonist, she must start doing all the regular American girl stuff she normally ignores. For starters, she has to make a friend, then get a boyfriend. And she's already planned the perfect ending: after struggling for three hundred pages with her own perfectionism, Reshma will learn that meaningful relationships can be more important than success—a character arc librarians and critics alike will enjoy.", "Of course, even with a mastermind like Reshma in charge, things can’t always go as planned. And when the valedictorian spot begins to slip from her grasp, she’ll have to decide just how far she’ll go for that satisfying ending. (Note: It’s pretty far.)"], "author": "Rahul Kanakia", "num_pages": "343", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-02 00:00:00", "ISBN": "1484723872"},
{"url": "https://www.goodreads.com/book/show/22521951-written-in-the-stars", "num_ratings": "4,664", "num_reviews": "1,054", "avg_ratings": 3.96, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction", "Realistic Fiction"], "title": "Written in the Stars", "description": ["This heart-wrenching novel explores what it is like to be thrust into an unwanted marriage. Has Naila’s fate been written in the stars? Or can she still make her own destiny?", " ", "Naila’s conservative immigrant parents have always said the same thing: She may choose what to study, how to wear her hair, and what to be when she grows up—but they will choose her husband. Following", "This heart-wrenching novel explores what it is like to be thrust into an unwanted marriage. Has Naila’s fate been written in the stars? Or can she still make her own destiny?", " ", "Naila’s conservative immigrant parents have always said the same thing: She may choose what to study, how to wear her hair, and what to be when she grows up—but they will choose her husband. Following their cultural tradition, they will plan an arranged marriage for her. And until then, dating—even friendship with a boy—is forbidden. When Naila breaks their rule by falling in love with Saif, her parents are livid. Convinced she has forgotten who she truly is, they travel to Pakistan to visit relatives and explore their roots. But Naila’s vacation turns into a nightmare when she learns that plans have changed—her parents have found her a husband and they want her to marry him, now! Despite her greatest efforts, Naila is aghast to find herself cut off from everything and everyone she once knew. Her only hope of escape is Saif . . . if he can find her before it’s too late."], "author": "Aisha Saeed", "num_pages": "277", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-24 00:00:00", "ISBN": "0399171703"},
{"url": "https://www.goodreads.com/book/show/18263530-a-time-to-dance", "num_ratings": "2,576", "num_reviews": "488", "avg_ratings": 4.08, "genres": ["Young Adult", "Poetry", "Realistic Fiction", "Cultural", "India", "Fiction"], "title": "A Time to Dance", "description": ["Padma Venkatraman’s inspiring story of a young girl’s struggle to regain her passion and find a new peace is told lyrically through verse that captures the beauty and mystery of India and the ancient ", " dance form. This is a stunning novel about spiritual awakening, the power of art, and above all, the courage and resilience of the human spirit.", " ", "Veda, a classica", "Padma Venkatraman’s inspiring story of a young girl’s struggle to regain her passion and find a new peace is told lyrically through verse that captures the beauty and mystery of India and the ancient ", " dance form. This is a stunning novel about spiritual awakening, the power of art, and above all, the courage and resilience of the human spirit.", " ", "Veda, a classical dance prodigy in India, lives and breathes dance—so when an accident leaves her a below-knee amputee, her dreams are shattered. For a girl who’s grown used to receiving applause for her dance prowess and flexibility, adjusting to a prosthetic leg is painful and humbling. But Veda refuses to let her disability rob her of her dreams, and she starts all over again, taking beginner classes with the youngest dancers. Then Veda meets Govinda, a young man who approaches dance as a spiritual pursuit. As their relationship deepens, Veda reconnects with the world around her, and begins to discover who she is and what dance truly means to her."], "author": "Padma Venkatraman", "num_pages": "320", "awards": ["Rebecca Caudill Young Readers' Book Award Nominee (2017)"], "places": ["India"], "character_names": [], "language": null, "publish_date": "2014-05-01 00:00:00", "ISBN": "0399257101"},
{"url": "https://www.goodreads.com/book/show/766319.Born_Confused", "num_ratings": "4,718", "num_reviews": "452", "avg_ratings": 3.8, "genres": ["Young Adult", "Fiction", "Romance", "Contemporary", "Young Adult", "Coming Of Age"], "title": "Born Confused", "description": ["Dimple Lala doesn't know what to think. Her parents are from India, and she's spent her whole life resisting their traditions. Then suddenly she gets to high school and everything Indian is trendy. To make matters worse, her parents arrange for her to meet a \"suitable boy.\" Of course it doesn't go well -- until Dimple goes to a club and finds him spinning a magical web . S", "Dimple Lala doesn't know what to think. Her parents are from India, and she's spent her whole life resisting their traditions. Then suddenly she gets to high school and everything Indian is trendy. To make matters worse, her parents arrange for her to meet a \"suitable boy.\" Of course it doesn't go well -- until Dimple goes to a club and finds him spinning a magical web . Suddenly the suitable boy is suitable because of his sheer unsuitability. Complications ensue. This is a funny, thoughtful story about finding your heart, finding your culture, and finding your place in America."], "author": "Tanuja Desai Hidier", "num_pages": "512", "awards": ["Lincoln Award Nominee (2005)", "Asian/Pacific American Award for Literature for Children and Young Adult Honor (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-07-01 00:00:00", "ISBN": "0439510112"}
]