[
{"url": "https://www.goodreads.com/book/show/20883158-robin-hood-of-the-desert", "num_ratings": "195", "num_reviews": "10", "avg_ratings": 3.71, "genres": ["Novels", "Literature", "Cultural", "Iran"], "title": "Robin Hood of the Desert", "description": ["Set mainly during the time of Naser al-Din Shah Qajar in Iran, the stories of this book are true stories about people and events that once everyone remembered but with the passing of time they have slipped from memory. One may wonder about what impact these stories will have if they are told again; whether people will remember them; and if they will get the attention they", "Set mainly during the time of Naser al-Din Shah Qajar in Iran, the stories of this book are true stories about people and events that once everyone remembered but with the passing of time they have slipped from memory. One may wonder about what impact these stories will have if they are told again; whether people will remember them; and if they will get the attention they once had. The answer to these questions was the temptation behind this compilation. It led to an effort to bring these memories back to the forefront of people s minds. The hope is that people will eventually love them again the stories as well as the story makers. These stories are not fiction; some parts do have traces in history though they are not history either. The people in these stories were once well known but now their memory is buried under years and years of history. They can be likened, more than anything else, to old photographs in which faces are distorted by creases and the colors tarnished. Someone has made an effort to retouch them and brighten the rusty colors to his taste. But in the eyes of the beholder, the picture may sometimes appear as a true version of reality of our world or a reflection of an amateur painter s imagination."], "author": "Masoud Behnoud", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "9642667533"},
{"url": "https://www.goodreads.com/book/show/25919031-the-water-urn", "num_ratings": "18", "num_reviews": "1", "avg_ratings": 4.39, "genres": ["Cultural", "Iran", "Childrens"], "title": "The Water Urn", "description": ["A children's novel set in a two-room schoolhouse in mid-20th century Iran, this story about the daily misadventures and experiences of the village children and their beloved schoolmaster, Mr. Samadi will warm your heart. Through this nostalgic portrayal of the daily hardship and human drama of rural life so many years ago, Houshang Moradi Kermani's memorable characters pro", "A children's novel set in a two-room schoolhouse in mid-20th century Iran, this story about the daily misadventures and experiences of the village children and their beloved schoolmaster, Mr. Samadi will warm your heart. Through this nostalgic portrayal of the daily hardship and human drama of rural life so many years ago, Houshang Moradi Kermani's memorable characters provide an inspiring look at provincial life in a quintessential Iranian village where survival means that members of a community must learn to work together to achieve a common goal."], "author": "Houshang Moradi Kermani", "num_pages": "196", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24554472-the-veil-of-tears", "num_ratings": "3", "num_reviews": "2", "avg_ratings": 2.0, "genres": [], "title": "The Veil of Tears", "description": ["While at first glance ‘The Veil of Tears’ appears to be a tragic soap opera, closer inspection reveals a book which provides a glimpse to how the culture and laws of a country, in this case Iran, impact on the lives of the men and women in that nation state. The two murders, which take place during the course of this story, bring these issues into sharp focus. The narrativ", "While at first glance ‘The Veil of Tears’ appears to be a tragic soap opera, closer inspection reveals a book which provides a glimpse to how the culture and laws of a country, in this case Iran, impact on the lives of the men and women in that nation state. The two murders, which take place during the course of this story, bring these issues into sharp focus. The narrative exposes the path that the majority of young people still travel down in their journey towards marriage; its poignancy lies in its enduring legitimacy in the 20th century. Amongst the humour, interwoven throughout the fabric of the text, the reader will find an astonishing depth to family ties and a familial closeness that clearly has far-reaching consequences. In this culture, members of both the immediate and extended family will stop at nothing in their efforts to help each other; we learn that troubled marriages can often be saved by the intervention of elders. As the story unfolds, one begins to appreciate the intensity of affection and profound sense of responsibility that is innate in a mother’s love, something which highlights the huge sacrifices that she is prepared to make for her children.", "Vakili uses her heroine, Shirin, to shine a spotlight on the lives of many women: a mother; a stepmother;a grandmother; a sister-in-law;a lover;a maid; and a neighbour. Set in Tehran in the Iran of the 1990s, Shohreh Vakili opens the prologue of her story with the lines: ‘Throughout my childhood my ideals remained tantalisingly beyond my fingertips so I was determined to reach my eighteenth birthday so that I could ‘legally’ decide my own future... Turning eighteen became as delicious and as pleasurable as approaching Eftar when the Muslims break their fast after sunset during Ramadan. I had honoured the ritual of fasting over the years but now, as I stood on the threshold of my eighteenth year, I looked forward to a future where I could finally taste what had previously been forbidden to me.’"], "author": "shohreh vakili", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/179944.The_Rose_Garden_Gulistan_of_Saadi", "num_ratings": "2,244", "num_reviews": "159", "avg_ratings": 4.48, "genres": ["Poetry", "Literature", "Classics", "Cultural", "Iran"], "title": "The Rose Garden (Gulistan) of Saadi", "description": ["Book annotation not available for this title."], "author": "Saadi", "num_pages": "235", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-06-19 00:00:00", "ISBN": "2909347060"},
{"url": "https://www.goodreads.com/book/show/46349.Funny_in_Farsi", "num_ratings": "15,835", "num_reviews": "2,278", "avg_ratings": 3.78, "genres": ["Autobiography", "Memoir", "Nonfiction", "Humor", "Biography"], "title": "Funny in Farsi: A Memoir of Growing Up Iranian in America", "description": ["In 1972, when she was seven, Firoozeh Dumas and her family moved from Iran to Southern California, arriving with no firsthand knowledge of this country beyond her father's glowing memories of his graduate school years here. More family soon followed, and the clan has been here ever since. ", " chronicles the American journey of Dumas's wonderfully engaging family", "In 1972, when she was seven, Firoozeh Dumas and her family moved from Iran to Southern California, arriving with no firsthand knowledge of this country beyond her father's glowing memories of his graduate school years here. More family soon followed, and the clan has been here ever since. ", " chronicles the American journey of Dumas's wonderfully engaging family: her engineer father, a sweetly quixotic dreamer who first sought riches on ", " and in Las Vegas, and later lost his job during the Iranian revolution; her elegant mother, who never fully mastered English (nor cared to); her uncle, who combated the effects of American fast food with an army of miraculous American weight-loss gadgets; and Firoozeh herself, who as a girl changed her name to Julie, and who encountered a second wave of culture shock when she met and married a Frenchman, becoming part of a one-couple melting pot."], "author": "Firoozeh Dumas", "num_pages": "240", "awards": ["Thurber Prize Nominee for American Humor (2005)"], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2004-01-13 00:00:00", "ISBN": "0812968379"},
{"url": "https://www.goodreads.com/book/show/15846382-doing-psychoanalysis-in-tehran", "num_ratings": "130", "num_reviews": "26", "avg_ratings": 3.52, "genres": ["Psychology", "Cultural", "Iran", "Nonfiction", "Psychology", "Psychoanalysis", "Autobiography", "Memoir", "Sociology"], "title": "Doing Psychoanalysis in Tehran", "description": ["Is psychoanalysis possible in the Islamic Republic of Iran? This is the question that Gohar Homayounpour poses to herself, and to us, at the beginning of this memoir of displacement, nostalgia, love, and pain. Twenty years after leaving her country, Homayounpour, an Iranian, Western-trained psychoanalyst, returns to Tehran to establish a psychoanalytic practice. When an Am", "Is psychoanalysis possible in the Islamic Republic of Iran? This is the question that Gohar Homayounpour poses to herself, and to us, at the beginning of this memoir of displacement, nostalgia, love, and pain. Twenty years after leaving her country, Homayounpour, an Iranian, Western-trained psychoanalyst, returns to Tehran to establish a psychoanalytic practice. When an American colleague exclaims, “I do not think that Iranians can free-associate!” Homayounpour responds that in her opinion Iranians do nothing but. Iranian culture, she says, revolves around stories. Why wouldn’t Freud’s methods work, given Iranians’ need to talk?", "Thus begins a fascinating narrative of interlocking stories that resembles--more than a little--a psychoanalytic session. Homayounpour recounts the pleasure and pain of returning to her motherland, her passion for the work of Milan Kundera, her complex relationship with Kundera’s Iranian translator (her father), and her own and other Iranians’ anxieties of influence and disobedience. Woven throughout the narrative are glimpses of her sometimes frustrating, always candid, sessions with patients. Ms. N, a famous artist, dreams of abandonment and sits in the analyst’s chair rather than on the analysand’s couch; a young chador-clad woman expresses shame because she has lost her virginity; an eloquently suicidal young man cannot kill himself.", "As a psychoanalyst, Homayounpour knows that behind every story told is another story that remains untold. Doing Psychoanalysis in Tehran connects the stories, spoken and unspoken, that ordinary Iranians tell about their lives before their hour is up.", "About the Author", "Gohar Homayounpour is a practicing psychoanalyst in Tehran. She trains and supervises the psychoanalysts of the Freudian Group of Tehran and is Professor of Psychology at Shahid Besheti University Tehran."], "author": "Gohar Homayounpour", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-14 00:00:00", "ISBN": "026201792X"},
{"url": "https://www.goodreads.com/book/show/2441475.Laughing_Without_an_Accent", "num_ratings": "2,770", "num_reviews": "418", "avg_ratings": 3.77, "genres": ["Nonfiction", "Autobiography", "Memoir", "Humor", "Cultural", "Iran", "Biography"], "title": "Laughing Without an Accent: Adventures of an Iranian American, at Home and Abroad", "description": ["In the bestselling memoir ", ", Firoozeh Dumas recounted her adventures growing up Iranian American in Southern California. Now she again mines her rich Persian heritage in ", ", sharing stories both tender and humorous on being a citizen of the world, on her well-meaning family, and on amusing cultural conundrums, all told with insights int", "In the bestselling memoir ", ", Firoozeh Dumas recounted her adventures growing up Iranian American in Southern California. Now she again mines her rich Persian heritage in ", ", sharing stories both tender and humorous on being a citizen of the world, on her well-meaning family, and on amusing cultural conundrums, all told with insights into the universality of the human condition. (Hint: It may have to do with brushing and flossing daily.)", "With dry wit and a bold spirit, Dumas puts her own unique mark on the themes of family, community, and tradition. She braves the uncommon palate of her French-born husband and learns the nuances of having her book translated for Persian audiences (the censors edit out all references to ham). And along the way, she reconciles her beloved Iranian customs with her Western ideals.", "Explaining crossover cultural food fare, Dumas says, “The weirdest American culinary marriage is yams with melted marshmallows. I don’t know who thought of this Thanksgiving tradition, but I’m guessing a hyperactive, toothless three-year-old.” On Iranian wedding anniversaries: “It just initially seemed odd to celebrate the day that ‘our families decided we should marry even though I had never met you, and frankly, it’s not working out so well.’” On trying to fit in with her American peers: “At the time, my father drove a Buick LeSabre, a fancy French word meaning ‘OPEC thanks you.’” ", "Dumas also documents her first year as a new mother, the familial chaos that ensues after she removes the television set from the house, the experience of taking fifty-one family members on a birthday cruise to Alaska, and a road trip to Iowa with an American once held hostage in Iran.", "Droll, moving, and relevant, Laughing ", " shows how our differences can unite us–and provides indelible proof that Firoozeh Dumas is a humorist of the highest order."], "author": "Firoozeh Dumas", "num_pages": "226", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-29 00:00:00", "ISBN": "0345499565"},
{"url": "https://www.goodreads.com/book/show/25754064-pink-cloud", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 4.0, "genres": [], "title": "Pink Cloud", "description": ["Each short story is a research about existence; a non-definitive and complete one, but if it reaches to the tipping point of the literature, it would create a mirror that everyone can see himself and his own image of the world in it. All stories in this collection have a world of their own, and yet; a hidden exclusive vision at the bottom layers that connect them all toget", "Each short story is a research about existence; a non-definitive and complete one, but if it reaches to the tipping point of the literature, it would create a mirror that everyone can see himself and his own image of the world in it. All stories in this collection have a world of their own, and yet; a hidden exclusive vision at the bottom layers that connect them all together. Each of these short stories have a different experience facing with a simple or large public concept and writer have tried to rediscover all these concerns and associate them in a tale. The author of this story was born in Iran and lived and wrote there. Stories of a country with terrible stormy events in its contemporary history; a narration that is a reflection of such devastating events: revolution, wars and social destruction and more can be found in the theme and even the structure of these stories. An attempt of a human being who tries to shoot himself out from the rubble and bloom."], "author": "Alireza Mahmoudi Iranmehr", "num_pages": "46", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1038088.The_Septembers_of_Shiraz", "num_ratings": "6,342", "num_reviews": "858", "avg_ratings": 3.79, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Literature", "Jewish"], "title": "The Septembers of Shiraz", "description": ["In the aftermath of the Iranian revolution, rare-gem dealer Isaac Amin is arrested, wrongly accused of being a spy. Terrified by his disappearance, his family must reconcile a new world of cruelty and chaos with the collapse of everything they have known. ", "As Isaac navigates the tedium and terrors of prison, forging tenuous trusts, his wife feverishly searches for him, susp", "In the aftermath of the Iranian revolution, rare-gem dealer Isaac Amin is arrested, wrongly accused of being a spy. Terrified by his disappearance, his family must reconcile a new world of cruelty and chaos with the collapse of everything they have known. ", "As Isaac navigates the tedium and terrors of prison, forging tenuous trusts, his wife feverishly searches for him, suspecting, all the while, that their once-trusted housekeeper has turned on them and is now acting as an informer. ", "And as his daughter, in a childlike attempt to stop the wave of baseless arrests, engages in illicit activities, his son, sent to New York before the rise of the Ayatollahs, struggles to find happiness even as he realizes that his family may soon be forced to embark on a journey of incalculable danger. ", "A page-turning literary debut, ", " simmers with questions of identity, alienation, and love, not simply for a spouse or a child, but for all the intangible sights and smells of the place we call home."], "author": "Dalia Sofer", "num_pages": "340", "awards": ["Orange Prize Nominee for Fiction Longlist (2008)", "PEN/Robert W. Bingham Prize (2008)", "Sami Rohr Prize Nominee for Jewish Literature (2009)"], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2007-07-24 00:00:00", "ISBN": "0061130400"},
{"url": "https://www.goodreads.com/book/show/18046716-het-boek-der-koningen", "num_ratings": "3,551", "num_reviews": "226", "avg_ratings": 4.51, "genres": ["Poetry", "Classics", "History", "Cultural", "Iran", "Fantasy", "Mythology", "Literature"], "title": "Het boek der koningen: de verhalen van Rostam", "description": ["Dutch translation of a selection from ", ".", "Vertaling van een keuze uit ", ".", " (1010) is hét epos is over het oude Iran. Ferdowsi (gestorven ca. 1025) beschrijft de geschiedenis vanaf het ontstaan der aarde tot en met de val van de Sasanieden en de komst van de Arabieren en islam halverwege de zevende eeuw. ", "Deze Nederlandse prozavertaling is een", "Dutch translation of a selection from ", ".", "Vertaling van een keuze uit ", ".", " (1010) is hét epos is over het oude Iran. Ferdowsi (gestorven ca. 1025) beschrijft de geschiedenis vanaf het ontstaan der aarde tot en met de val van de Sasanieden en de komst van de Arabieren en islam halverwege de zevende eeuw. ", "Deze Nederlandse prozavertaling is een selectie uit het eerste en bijzonder levendige deel van dit epos. Het bevat mythe, legende en geromantiseerde geschiedenis. Het zijn vooral de persoonlijke avonturen van de helden van Sistn, en meer in het bijzonder die van Rostam, de geduchte krijger 'met het lijf van een olifant', die hebben gemaakt dat dit ", " nog steeds populair is onder Iraniërs. Deze avonturen worden afgewisseld met oorlogen tussen Iran en Turn, een strijd waarin Iran zegeviert maar omstreeks 650 wordt veroverd door de Arabieren."], "author": "Abolqasem Ferdowsi", "num_pages": "496", "awards": [], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Sohrab", "Rostam", "Esfandiar", "Simorgh &..."], "language": "Dutch", "publish_date": "2012-11-12 00:00:00", "ISBN": "9054601817"},
{"url": "https://www.goodreads.com/book/show/10734339-de-koning", "num_ratings": "675", "num_reviews": "92", "avg_ratings": 3.64, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Iran", "Literature"], "title": "De Koning", "description": ["Aan het einde van de negentiende eeuw bestijgt een nieuwe sjah de Perzische troon. Hij volgt zijn vader op, maar hij mist de daadkracht en de ambitie om zijn stempel op het bestuur te drukken. De koning heeft meer oog voor zijn harem, de kersentuin, de jacht en zijn rijkdommen dan voor de situatie waarin het volk en het land verkeren. Het leiderschap in het economische mac", "Aan het einde van de negentiende eeuw bestijgt een nieuwe sjah de Perzische troon. Hij volgt zijn vader op, maar hij mist de daadkracht en de ambitie om zijn stempel op het bestuur te drukken. De koning heeft meer oog voor zijn harem, de kersentuin, de jacht en zijn rijkdommen dan voor de situatie waarin het volk en het land verkeren. Het leiderschap in het economische machtsspel waarin Perzië met Engeland, Frankrijk en Rusland is verwikkeld, laat hij over aan zijn raadgever, de vizier.", "De handige politicus ziet in de samenwerking met de westerse landen grote mogelijkheden om hervormingen door te voeren die voorspoed zullen brengen. Maar tegen welke prijs?", "In een prachtig historisch en tegelijkertijd actueel verhaal vol betoverende personages verweeft Kader Abdolah de harde strijd om bodemschatten, land en macht met de magische sfeer van het aloude Perzië."], "author": "Kader Abdolah", "num_pages": "412", "awards": [], "places": [], "character_names": [], "language": "Dutch", "publish_date": "2011-03-12 00:00:00", "ISBN": "904451542X"},
{"url": "https://www.goodreads.com/book/show/758283.Symphony_of_the_Dead", "num_ratings": "8,909", "num_reviews": "733", "avg_ratings": 4.11, "genres": ["Novels", "Fiction", "Literature"], "title": "Symphony of the Dead", "description": ["This novel traces the fate of the Urkhani family in the Iranian town of Ardabil before & after the Second World War through the trials & ghostly recollections of its very individual members, who include: Ideen, the frustrated poet; Urhan, his greedy & talentless younger brother; & Yousef, whose childhood antics left him paralysed."], "author": "Abbas Maroufi", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-12-21 00:00:00", "ISBN": "0955233968"},
{"url": "https://www.goodreads.com/book/show/37506437-darius-the-great-is-not-okay", "num_ratings": "244", "num_reviews": "130", "avg_ratings": 4.26, "genres": ["Young Adult", "Contemporary", "Lgbt", "Fiction", "Glbt", "Queer", "Realistic Fiction", "Cultural", "Iran", "Mental Health", "Mental Illness", "Health", "Mental Health", "Young Adult", "Teen"], "title": "Darius the Great Is Not Okay", "description": ["Darius Kellner speaks better Klingon than Farsi, and he knows more about Hobbit social cues than Persian ones. He's about to take his first-ever trip to Iran, and it's pretty overwhelming--especially whe", "Darius Kellner speaks better Klingon than Farsi, and he knows more about Hobbit social cues than Persian ones. He's about to take his first-ever trip to Iran, and it's pretty overwhelming--especially when he's also dealing with clinical depression, a disapproving dad, and a chronically anemic social life. In Iran, he gets to know his ailing but still formidable grandfather, his loving grandmother, and the rest of his mom's family for the first time. And he meets Sohrab, the boy next door who changes everything.", "Sohrab makes sure people speak English so Darius can understand what's going on. He gets Darius an Iranian National Football Team jersey that makes him feel like a True Persian for the first time. And he understand that sometimes, best friends don't have to talk. Darius has never had a true friend before, but now he's spending his days with Sohrab playing soccer, eating rosewater ice cream, and sitting together for hours in their special place, a rooftop overlooking the Yazdi skyline.", "Sohrab calls him Darioush--the original Persian version of his name--and Darius has never felt more like himself than he does now that he's Darioush to Sohrab. When it's time to go home to America, he'll have to find a way to be Darioush on his own."], "author": "Adib Khorram", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0525552960"},
{"url": "https://www.goodreads.com/book/show/37570620-what-we-owe", "num_ratings": "231", "num_reviews": "35", "avg_ratings": 4.04, "genres": ["European Literature", "Swedish Literature", "Fiction", "Contemporary"], "title": "What We Owe", "description": ["Nahid has six months left to live. Or so the doctors say. But Nahid is not the type to trust anyone. She resents the cancer diagnosis she has been given and the doctor who has given it to her. Bubbling inside her is also resentment toward life as it turned out, and the fact that it will go on without her. She feels alone, alone with her illness and alone with her thoughts.", "Nahid has six months left to live. Or so the doctors say. But Nahid is not the type to trust anyone. She resents the cancer diagnosis she has been given and the doctor who has given it to her. Bubbling inside her is also resentment toward life as it turned out, and the fact that it will go on without her. She feels alone, alone with her illness and alone with her thoughts. She yearns yet fails to connect with her only daughter, Aram. As the rawness of death draws near, Nahid should want to protect Aram from pain. She knows she should. Yet what is a daughter but one born to share in her mother’s pain?", "At fifty, Nahid is no stranger to death. As a Marxist revolutionary in eighties Iran, she saw loved ones killed in the street and was forced to flee to Sweden. She and her husband abandoned their roots to build a new life in a new country. They told themselves they did it for their newborn daughter, so she could live free. But now as she stands on the precipice facing death, Nahid understands that what you thought you escaped will never let you go. And without roots, can you ever truly be free?"], "author": "Golnaz Hashemzadeh Bonde", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1328995089"},
{"url": "https://www.goodreads.com/book/show/29877789-der-kern-der-sache---fabeln-und-erz-hlungen-aus-dem-persischen", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Der Kern der Sache - Fabeln und Erzählungen aus dem Persischen", "description": ["Wie lässt sich ein Streit anzetteln und wie kann man ihn schlichten? Wie rettet sich ein lahmer Esel vor dem hungrigen Wolf? Was können Spatzen gegen einen uneinsichtigen Elefanten ausrichten? Wie besiegen Mäuse ihre Angst vor den Katzen? Warum kämpft der Löwe nicht mit dem Hund? Darf man einen Ziegel küssen? Wie findet man die Lösung eines Problems?", " 101 Frage stellen sich", "Wie lässt sich ein Streit anzetteln und wie kann man ihn schlichten? Wie rettet sich ein lahmer Esel vor dem hungrigen Wolf? Was können Spatzen gegen einen uneinsichtigen Elefanten ausrichten? Wie besiegen Mäuse ihre Angst vor den Katzen? Warum kämpft der Löwe nicht mit dem Hund? Darf man einen Ziegel küssen? Wie findet man die Lösung eines Problems?", " 101 Frage stellen sich den Lesern der Fabeln und Erzählungen, die der berühmte und mehrfach ausgezeichnete Kinder- und Jugendbuchautor Mehdi Azar Yazdi aus alten persischen Büchern ausgewählt und für junge Leser von heute spannend, scharfsinnig und mit Witz nacherzählt hat. Und 101 Lebensweisheit oder mehr können der Leser und die Leserin darin entdecken", " Ein Buch, das zum Nachdenken ermutigt – auch für Erwachsene ein außergewöhnliches und buntes Lesevergnügen."], "author": "Mehdi Azar Yazdi", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "German", "publish_date": "2015-05-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/332020._", "num_ratings": "2,612", "num_reviews": "191", "avg_ratings": 4.28, "genres": ["Novels", "Literature"], "title": "کلیدر", "description": ["محمود دولتآبادی متولد ۱۳۱۹ اهل دولت آباد سبزوار از بلاد خراسان", "محمود دولت‌آبادی متولد ۱۳۱۹ اهل دولت آباد سبزوار از بلاد خراسان"], "author": "Mahmoud Dowlatabadi", "awards": [], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": [], "language": null, "publish_date": "2006-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7439120-het-huis-van-de-moskee", "num_ratings": "6,071", "num_reviews": "447", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "Iran", "European Literature", "Dutch Literature", "Historical", "Historical Fiction"], "title": "Het huis van de moskee", "description": ["Al achthonderd jaar heeft de familie van Aga Djan een centrale positie in de stad. Al zolang ze er wonen brengen ze de geestelijk leider van de moskee voort. De imam is een belangrijk man, maar zeker zo belangrijk is Aga Djan, het hoofd van de bazaar.", "Als er een radicale stroming onder de ayatollahs ontstaat en Khomeini in Parijs een omwenteling voorbereidt, komt de Iraanse", "Al achthonderd jaar heeft de familie van Aga Djan een centrale positie in de stad. Al zolang ze er wonen brengen ze de geestelijk leider van de moskee voort. De imam is een belangrijk man, maar zeker zo belangrijk is Aga Djan, het hoofd van de bazaar.", "Als er een radicale stroming onder de ayatollahs ontstaat en Khomeini in Parijs een omwenteling voorbereidt, komt de Iraanse samenleving zoals Aga Djan die kent onder druk te staan. Vrienden worden vijanden. Liefde wordt haat. Zelfs Aga Djan kan het tij niet keren."], "author": "Kader Abdolah", "num_pages": "410", "awards": ["Publieksprijs voor het Nederlandse Boek Nominee (2006)"], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "Dutch", "publish_date": "2009-02-12 00:00:00", "ISBN": "9044514067"},
{"url": "https://www.goodreads.com/book/show/110106.My_Sister_Guard_Your_Veil_My_Brother_Guard_Your_Eyes", "num_ratings": "293", "num_reviews": "39", "avg_ratings": 3.8, "genres": ["Cultural", "Iran", "Nonfiction", "History", "Writing", "Essays", "Religion", "Islam", "Politics"], "title": "My Sister, Guard Your Veil; My Brother, Guard Your Eyes: Uncensored Iranian Voices", "description": ["In the first anthology of its kind, Lila Azam Zanganeh argues that although Iran looms large in the American imagination, it is grossly misunderstood-seen either as the third pillar of Bush's infamous \"axis of evil\" or as a nation teeming with youths clamoring for revolution.", "This collection showcases the real scope and complexity of Iran through the work of a stellar group", "In the first anthology of its kind, Lila Azam Zanganeh argues that although Iran looms large in the American imagination, it is grossly misunderstood-seen either as the third pillar of Bush's infamous \"axis of evil\" or as a nation teeming with youths clamoring for revolution.", "This collection showcases the real scope and complexity of Iran through the work of a stellar group of contributors-including Azar Nafisi and with original art by Marjane Satrapi. Their collective goal is to counter the many existing cultural and political clich�s about Iran. Some of the pieces concern feminism, sexuality, or eroticism under the Islamic Republic; others are unorthodox political testimonies or about race and religion. Almost all these contributors have broken artistic and cultural taboos in their work.", "Journalist Reza Aslan, author of ", " explains why Iran is not a theocracy but, rather, a \"mullahcracy.\" Mehrangiz Kar, a lawyer and human rights activist who was jailed in Iran and is currently a fellow at Harvard's Kennedy School of Government, argues that the Iranian Revolution actually engendered the birth of feminism in Iran. Journalist Azadeh Moaveni reveals the underground parties and sex culture in Tehran, while Gelareh Asayesh, author of ", " writes poignantly on why Iranians are not considered white in America, even though they think they are. Poet and writer Naghmeh Zarbafian expounds on the surreal experience of reading censored books in Iran, while Roya Hakakian, author of ", " recalls the happy days of Iranian Jews. With a sharp, incisive introduction by Lila Azam Zanganeh, this diverse collection will alter what you thought you knew about Iran.", "\"", " aims to corrode fixed ideas and turns cultural and political clich�s on their heads . . . Iranians themselves live in a complex and schizophrenic reality, at a surreal crossroads between political Islam and satellite television, massive national oil revenues, and searing social inequalities.\"--From the Introduction by Lila Azam Zanganeh", "Contributors include: Azar Nafisi, author of the best-selling ", ", Marjane Satrapi, author of ", ", Shirin Neshat, internationally acclaimed visual artist, Abbas Kiarostami, award-winning filmmaker of ", ", Shohreh Aghdashloo, Oscar nominee for ", ", Azadeh Moaveni, author of "], "author": "Lila Azam Zanganeh", "num_pages": "132", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0807004634"},
{"url": "https://www.goodreads.com/book/show/9847770-zonder-soloetsj", "num_ratings": "3,174", "num_reviews": "296", "avg_ratings": 4.08, "genres": ["Novels", "Fiction", "Cultural", "Iran", "Literature", "Unfinished", "Literature", "20th Century", "Historical", "Historical Fiction", "Cultural"], "title": "Zonder Soloetsj", "description": ["Sinds dagen hebben ze geen woord meer tegen elkaar gesproken, Soloetsj en zijn vrouw Mergan. Op een avond legt hij zich bij de oven te slapen; de volgende ochtend is hij geruisloos verdwenen. De plek naast Mergan is leeg: Soloetsj heeft zijn familie verlaten.", "Mergan staat er nu alleen voor. Hadjer, haar twaalfjarige dochter, wordt uitgehuwelijkt aan een oude man. Ebroo, de", "Sinds dagen hebben ze geen woord meer tegen elkaar gesproken, Soloetsj en zijn vrouw Mergan. Op een avond legt hij zich bij de oven te slapen; de volgende ochtend is hij geruisloos verdwenen. De plek naast Mergan is leeg: Soloetsj heeft zijn familie verlaten.", "Mergan staat er nu alleen voor. Hadjer, haar twaalfjarige dochter, wordt uitgehuwelijkt aan een oude man. Ebroo, de jongste zoon, raakt verwikkeld in de intriges van een gehaaide speculante die haar oog heeft laten vallen op de gemeenschappelijke landbouwgrond van de dorpsbewoners. Abbas, de oudste zoon van zeventien, maakt een totale gedaanteverandering door als hij op een nacht, achternagezeten door een kameel, in een waterput vol slangen valt. Hij zal nooit meer een woord spreken.", "In indrukwekkende beelden wordt het uiteenvallen van een traditionele gemeenschap en de verpaupering van een dorp in de noordoostelijke woestenij van Iran neergezet."], "author": "Mahmoud Dowlatabadi", "num_pages": "442", "awards": ["BTBA Best Translated Book Award Nominee for Fiction shortlist (2008)"], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": [], "language": "Dutch", "publish_date": "2008-11-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/184711.Strange_Times_My_Dear", "num_ratings": "80", "num_reviews": "15", "avg_ratings": 3.9, "genres": ["Cultural", "Iran", "Fiction", "Short Stories", "Literature", "Poetry"], "title": "Strange Times, My Dear: The PEN Anthology of Contemporary Iranian Literature", "description": ["A stunning collection of newly-discovered writing, this is a richly varied collection of short stories, novel extracts and poetry, revealed to the Western world for the first time. Despite war, repression and censorship, a renaissance has taken place in Iran over the last 25 years - a renaissance hidden from Westerners since the Iranian revolution of 1979. \"Strange Times,", "A stunning collection of newly-discovered writing, this is a richly varied collection of short stories, novel extracts and poetry, revealed to the Western world for the first time. Despite war, repression and censorship, a renaissance has taken place in Iran over the last 25 years - a renaissance hidden from Westerners since the Iranian revolution of 1979. \"Strange Times, My Dear\" brings the first ever translated selection of work from three generations worth of the best in Iranian writing - featuring short stories, novel extracts and poems from over 40 contributors - to the English speaking world. For thousands of years, multiple ethnicities, languages and religions have co-existed in Iran - and continue to do so despite traumatic events and the oppression of recent decades. Their literature has flourished in adversity, producing works of diverse beauty and incalculable importance. \"Strange Times, My Dear\" reveals a major and largely undiscovered branch of world literature for the first time."], "author": "Nahid Mozaffari", "num_pages": "496", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-17 00:00:00", "ISBN": "1559708050"},
{"url": "https://www.goodreads.com/book/show/9302604-de-rozentuin", "num_ratings": "2,244", "num_reviews": "159", "avg_ratings": 4.48, "genres": ["Poetry", "Literature", "Classics", "Cultural", "Iran"], "title": "De Rozentuin", "description": [" is een onbetwist hoogtepunt in de klassieke Perzische literatuur. Het is een prozawerk met veel korte gedichten, zodat het ook tot de poëzie kan worden gerekend. Het gaat over machtigen en rijken tegenover onderdrukten, over oprechtheid tegenover veinzerij, over mystiek, erotiek en morele waarden. ", "Saadi (ca. 1212-1295) was zowel mysticus als hoveling, maar bov", " is een onbetwist hoogtepunt in de klassieke Perzische literatuur. Het is een prozawerk met veel korte gedichten, zodat het ook tot de poëzie kan worden gerekend. Het gaat over machtigen en rijken tegenover onderdrukten, over oprechtheid tegenover veinzerij, over mystiek, erotiek en morele waarden. ", "Saadi (ca. 1212-1295) was zowel mysticus als hoveling, maar bovenal dichter. Na zijn opleiding in Bagdad reisde hij rond in de islamitische wereld. Zijn boek geeft weer wat hij leerde over vorsten en bedelmonniken, hovelingen en krijgslieden, kooplieden en pelgrims. ", " was het eerste literaire werk uit Perzië dat in Europa bekend werd. In 1654 verscheen er een Nederlandse vertaling via het Duits, later hebben Bilderdijk en Leopold er fragmenten van vertaald. Saadi wordt - niet alleen door de Perzen - bewonderd om zijn puntige stijl en nuchtere wijsheid."], "author": "Saadi", "num_pages": "271", "awards": [], "places": [], "character_names": [], "language": "Dutch", "publish_date": "2005-08-12 00:00:00", "ISBN": "905460025x"},
{"url": "https://www.goodreads.com/book/show/17262709-thirst", "num_ratings": "81", "num_reviews": "16", "avg_ratings": 3.57, "genres": ["Fiction", "Cultural", "Iran", "Literature"], "title": "Thirst: A Novel of the Iran-Iraq War", "description": ["“Dowlatabadi draws a detailed, realist picture of Iranian life . . . in language that is complex and lyrical.”", "In the midst of the Iran–Iraq War, an Iraqi journalist is given a tour of a military prison. The Major in charge of the camp informs the writer of what is expected: he is to write a fabricated report about a murder that has occurred in the camp", "“Dowlatabadi draws a detailed, realist picture of Iranian life . . . in language that is complex and lyrical.”", "In the midst of the Iran–Iraq War, an Iraqi journalist is given a tour of a military prison. The Major in charge of the camp informs the writer of what is expected: he is to write a fabricated report about a murder that has occurred in the camp, with the aim of demoralizing Iranian soldiers. ", "Reluctant to write the report, the writer spends a long night talking and drinking with the Major and detailing a work of fiction he is composing about a group of soldiers trapped on a hill, dying of thirst as they battle for a water tank with a group of enemy soldiers perched on the opposite hill. The tank remains undamaged, but neither group has a hope of reaching it without being killed. ", "In a narrative riddled with surreal images, shifting perspectives, and dark humor, Mahmoud Dowlatabadi—widely acknowledged as the most important living Iranian writer—offers a kaleidoscopic portrait of the warring countries as he questions the meaning of national identity and does something that has been nearly impossible to do in Iran for the last century: tell a true story."], "author": "Mahmoud Dowlatabadi", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-24 00:00:00", "ISBN": "1612193005"},
{"url": "https://www.goodreads.com/book/show/14289102-the-colonel", "num_ratings": "429", "num_reviews": "89", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Iran", "Historical", "Historical Fiction", "Literature", "Novels"], "title": "The Colonel", "description": ["A pitch black, rainy night in a small Iranian town. Inside his house, the colonel stared at the portrait of the famous military hero –The Colonel, long executed. He thinks of his own children, one of whom died supporting the Shah, another of whom fought for the Ayatollah, another of whom -his fourteen-year old daughter- has been captured handing out leaflets against the re", "A pitch black, rainy night in a small Iranian town. Inside his house, the colonel stared at the portrait of the famous military hero –The Colonel, long executed. He thinks of his own children, one of whom died supporting the Shah, another of whom fought for the Ayatollah, another of whom -his fourteen-year old daughter- has been captured handing out leaflets against the regime. The Colonel has fought against the British…he fought for the Shah… he fought for the Ayatollah…he’s dedicated his life to his country…the house is quiet.", "Could they really be coming…for him?"], "author": "Mahmoud Dowlatabadi", "num_pages": "220", "awards": ["Man Asian Literary Prize Nominee (2011)", "BTBA Best Translated Book Award Nominee for Fiction shortlist (2013)", "Prix Jan Michalski (2013)"], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2012-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/318741._", "num_ratings": "580", "num_reviews": "64", "avg_ratings": 3.55, "genres": ["Cultural", "Iran", "Fiction", "Novels", "Historical", "Historical Fiction", "Literature"], "title": "طوبا و معنای شب", "description": ["\"With this bold, insightful novel Parsipur makes a stylishly original contribution to modern feminist literature.\" --Publishers Weekly (starred review)", "\"Parsipur should be admired both as a courageous woman who endured jail and torture and as a writer and innovator.\" --Azar Nafisi, author of Reading Lolita in Tehran", "Now available in paperback, this complex epic captures the", "\"With this bold, insightful novel Parsipur makes a stylishly original contribution to modern feminist literature.\" --Publishers Weekly (starred review)", "\"Parsipur should be admired both as a courageous woman who endured jail and torture and as a writer and innovator.\" --Azar Nafisi, author of Reading Lolita in Tehran", "Now available in paperback, this complex epic captures the changing fortunes of Iranian women in the twentieth century from the era of colonialism to the rule of two shahs. ", "The Iranian best-selling author of eleven books, including Women Without Men, Shahrnush Parsipur now lives in exile in the United States."], "author": "شهرنوش پارسی‌پور", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1990-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16130324-children-of-the-jacaranda-tree", "num_ratings": "2,529", "num_reviews": "486", "avg_ratings": 3.45, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Historical"], "title": "Children of the Jacaranda Tree", "description": ["A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. ", "We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of", "A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. ", "We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of a guard appear at the cell door one day and, simply, take her away. Omid, at age three, witnesses the arrests of his political activist parents from his perch at their kitchen table, yogurt dripping from his fingertips. More than twenty years after the violent, bloody purge that took place inside Tehran's prisons, Sheida learns that her father was one of those executed, that the silent void firmly planted between her and her mother all these years was not just the sad loss that comes with death, but the anguish and the horror of murder. ", "Neda, Omid, and Sheida are just three of the many unforgettable characters in Sahar Delijani's startling debut novel, Children of the Jacaranda Tree. Set in post-revolutionary Iran, from 1983 to 2011, it follows a group of mothers, fathers, children, and lovers, some connected by family, others brought together by the tide of history that forces its way into their lives. Finally, years later, it is the next generation that is left with the burden of the past and their country's tenuous future as a new wave of protest and political strife begins. ", "Based on the harrowing experiences of Delijani, her family, and friends, Children of the Jacaranda Tree is a moving, timely drama about three generations of men and women moved by love, inspired by poetry, and motivated by dreams of justice and freedom. For fans of The Kite Runner and In the Shadow of the Banyan, it is a stunningly evocative look at the intimate side of revolution and a brilliant tribute to anyone who has answered the call of history."], "author": "Sahar Delijani", "num_pages": "282", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-06-18 00:00:00", "ISBN": "1476709092"},
{"url": "https://www.goodreads.com/book/show/7557297-the-age-of-orphans", "num_ratings": "322", "num_reviews": "74", "avg_ratings": 3.47, "genres": ["Fiction", "Cultural", "Iran", "Historical", "Historical Fiction", "War"], "title": "The Age of Orphans: A Novel", "description": ["Told with an evocative richness of language that recalls Michael Ondaatje or Anita Desai, the story of Reza Khourdi is that of the 20th century everyman, cast out from the clan in the name of nation, progress and modernity who cannot help but leave behind a shadow that yearns for the impossible dreams of love, land and home. ", "Before following his father into battle, he had", "Told with an evocative richness of language that recalls Michael Ondaatje or Anita Desai, the story of Reza Khourdi is that of the 20th century everyman, cast out from the clan in the name of nation, progress and modernity who cannot help but leave behind a shadow that yearns for the impossible dreams of love, land and home. ", "Before following his father into battle, he had been like any other Kurdish boy: in love with his Maman, fascinated by birds and the rugged Zagros mountains, dutiful to his stern and powerful Baba. But after he becomes orphaned in a massacre by the armies of Iran's new Shah, Reza Pahlavi I.; he is taken in by the very army that has killed his parents, re-named Reza Khourdi, and indoctrinated into the modern, seductive ways of the newly minted nation, careful to hide his Kurdish origins with every step. ", " follows Reza on his meteoric rise in ranks, his marriage to a proud Tehrani woman and his eventual deployment, as Capitan, back to the Zagros Mountains and the ever-defiant Kurds. Here Reza is responsible for policing, and sometimes killing, his own people, and it is here that his carefully crafted persona begins to fissure and crack."], "author": "Laleh Khadivi", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "1608190420"},
{"url": "https://www.goodreads.com/book/show/150373.Women_Without_Men", "num_ratings": "1,701", "num_reviews": "184", "avg_ratings": 3.58, "genres": ["Fiction", "Cultural", "Iran", "Feminism", "Novels", "Magical Realism", "Literature"], "title": "Women Without Men: A Novel of Modern Iran", "description": ["Shortly after the 1989 publication of ", " in her native Iran, Shahrnush Parsipur was arrested and jailed for her frank and defiant portrayal of women’s sexuality. Now banned in Iran, this small masterpiece was eventually translated into several languages and introduces U.S. readers to the work of a brilliant Persian writer. With a tone that is stark, and bold", "Shortly after the 1989 publication of ", " in her native Iran, Shahrnush Parsipur was arrested and jailed for her frank and defiant portrayal of women’s sexuality. Now banned in Iran, this small masterpiece was eventually translated into several languages and introduces U.S. readers to the work of a brilliant Persian writer. With a tone that is stark, and bold, ", " creates an evocative allegory of life for contemporary Iranian women. In the interwoven destinies of five women, simple situations such as walking down a road or leaving the house become, in the tumult of post-WWII Iran, horrific and defiant as women escape the narrow confines of family and society only to face daunting new challenges.", "Now in political exile, ", " lives in the Bay Area. She is the author of several short story collections including ", " and the ", "."], "author": "Shahrnush Parsipur", "num_pages": "179", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-03-01 00:00:00", "ISBN": "1558614524"},
{"url": "https://www.goodreads.com/book/show/83256.Savushun", "num_ratings": "4,823", "num_reviews": "312", "avg_ratings": 3.86, "genres": ["Novels", "Fiction", "Cultural", "Iran", "Literature"], "title": "Savushun: A Novel About Modern Iran", "description": ["Savushun chronicles the life of a Persian family during the Allied occupation of Iran during World War II. It is set in Shiraz, a town which evokes images of Persepolis and pre-Islamic monuments, the great poets, the shrines, Sufis, and nomadic tribes within a historical web of the interests, privilege and influence of foreign powers; corruption, incompetence and arrogance", "Savushun chronicles the life of a Persian family during the Allied occupation of Iran during World War II. It is set in Shiraz, a town which evokes images of Persepolis and pre-Islamic monuments, the great poets, the shrines, Sufis, and nomadic tribes within a historical web of the interests, privilege and influence of foreign powers; corruption, incompetence and arrogance of persons in authority; the paternalistic landowner-peasant relationship; tribalism; and the fear of famine. The story is seen through the eyes of Zari, a young wife and mother, who copes with her idealistic and uncompromising husband while struggling with her desire for traditional family life and her need for individual identity. "], "author": "Simin Daneshvar", "num_pages": "324", "awards": [], "places": [], "character_names": ["Zari", "Yousef"], "language": "English", "publish_date": "2001-10-01 00:00:00", "ISBN": "0934211310"},
{"url": "https://www.goodreads.com/book/show/4836021-censoring-an-iranian-love-story", "num_ratings": "1,570", "num_reviews": "305", "avg_ratings": 3.66, "genres": ["Fiction", "Cultural", "Iran", "Romance", "Magical Realism", "Contemporary"], "title": "Censoring an Iranian Love Story", "description": ["From one of Iran’s most acclaimed and controversial contemporary writers, his first novel to appear in English—a dazzlingly inventive work of fiction that opens a revelatory window onto what it’s like to live, to love, and to be an artist in today’s Iran. ", "The novel entwines two equally powerful narratives. A writer named Shahriar—the author’s fictional alter ego—has strugg", "From one of Iran’s most acclaimed and controversial contemporary writers, his first novel to appear in English—a dazzlingly inventive work of fiction that opens a revelatory window onto what it’s like to live, to love, and to be an artist in today’s Iran. ", "The novel entwines two equally powerful narratives. A writer named Shahriar—the author’s fictional alter ego—has struggled for years against the all-powerful censor at the Ministry of Culture and Islamic Guidance. Now, on the threshold of fifty, tired of writing dark and bitter stories, he has come to realize that the “world around us has enough death and destruction and sorrow.” He sets out instead to write a bewitching love story, one set in present-day Iran. It may be his greatest challenge yet. ", "Beautiful black-haired Sara and fiercely proud Dara fall in love in the dusty stacks of the library, where they pass secret messages to each other encoded in the pages of their favorite books. But Iran’s Campaign Against Social Corruption forbids their being alone together. Defying the state and their disapproving parents, they meet in secret amid the bustling streets, Internet cafés, and lush private gardens of Tehran. ", "Yet writing freely of Sara and Dara’s encounters, their desires, would put Shahriar in as much peril as his lovers. Thus we read not just the scenes Shahriar has written but also the sentences and words he’s crossed out or merely imagined, knowing they can never be published. ", "Laced with surprising humor and irony, at once provocative and deeply moving, Censoring an Iranian Love Story takes us unforgettably to the heart of one of the world’s most alluring yet least understood cultures. It is an ingenious, wholly original novel—a literary tour de force that is a triumph of art and spirit."], "author": "Shahriar Mandanipour", "num_pages": "295", "awards": ["The Athens Prize for Literature - Περιοδικό (δέ)κατα (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-05 00:00:00", "ISBN": "0307269787"},
{"url": "https://www.goodreads.com/book/show/45967.The_Blind_Owl", "num_ratings": "14,335", "num_reviews": "1,184", "avg_ratings": 3.98, "genres": ["Fiction", "Novels", "Cultural", "Iran", "Literature"], "title": "The Blind Owl", "description": ["Considered the most important work of modern Iranian literature, The Blind Owl is a haunting tale of loss and spiritual degradation. Replete with potent symbolism and terrifying surrealistic imagery, Sadegh Hedayat's masterpice details a young man's despair after losing a mysterious lover. And as the author gradually drifts into frenzy and madness, the reader becomes caugh", "Considered the most important work of modern Iranian literature, The Blind Owl is a haunting tale of loss and spiritual degradation. Replete with potent symbolism and terrifying surrealistic imagery, Sadegh Hedayat's masterpice details a young man's despair after losing a mysterious lover. And as the author gradually drifts into frenzy and madness, the reader becomes caught in the sandstorm of Hedayat's bleak vision of the human condition. The Blind Owl, which has been translated into many foreign languages, has often been compared to the writing of Edgar Allan Poe."], "author": "Sadegh Hedayat", "num_pages": "148", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-01-11 00:00:00", "ISBN": "0802131808"},
{"url": "https://www.goodreads.com/book/show/6001011-rooftops-of-tehran", "num_ratings": "6,243", "num_reviews": "842", "avg_ratings": 4.04, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Iran", "Romance"], "title": "Rooftops of Tehran", "author": "Mahbod Seraji", "num_pages": "348", "awards": [], "places": [], "character_names": ["Pasha Shahed", "Zari", "Ahmed", "Faheemeh"], "language": "English", "publish_date": "2009-08-12 00:00:00", "ISBN": "045122681X"},
{"url": "https://www.goodreads.com/book/show/21402543-tehran-moonlight", "num_ratings": "113", "num_reviews": "27", "avg_ratings": 4.07, "genres": ["Cultural", "Iran", "Fiction", "Contemporary", "Novels"], "title": "Tehran Moonlight", "description": ["Love, loyalty and identity collide in Azin Sametipour's compelling debut novel, Tehran Moonlight. ", "Vividly set in a country where women have no voice, one woman's fight for love and her own identity result in unimaginable consequences. She was 23, beautiful, a violinist in love with her passion. A rebel born into a conservative family where belief was everything and honor s", "Love, loyalty and identity collide in Azin Sametipour's compelling debut novel, Tehran Moonlight. ", "Vividly set in a country where women have no voice, one woman's fight for love and her own identity result in unimaginable consequences. She was 23, beautiful, a violinist in love with her passion. A rebel born into a conservative family where belief was everything and honor shackled women in place. Then she met Ashkan. He was 27, gorgeous, born to an Iranian father in Boston. A successful architect in the States who had returned to Iran to find his past. Then he met Mahtab."], "author": "Azin Sametipour", "num_pages": "278", "awards": [], "places": ["Teharan"], "character_names": [], "language": "English", "publish_date": "2014-03-07 00:00:00", "ISBN": "1491265191"}
]