[
{"url": "https://www.goodreads.com/book/show/26116460-unrivaled", "num_ratings": "2,162", "num_reviews": "505", "avg_ratings": 3.46, "genres": ["Mystery", "Young Adult", "Romance", "Did Not Finish"], "title": "Unrivaled", "description": ["Everyone wants to be someone.", "Layla Harrison wants to leave her beach-bum days for digs behind a reporter’s desk. Aster Amirpour wants to scream at the next casting director who tells her “we need ethnic but not your kind of ethnic.” Tommy Phillips dreams of buying a twelve-string guitar and using it to shred his way back into his famous absentee dad’s life.", "But Madison Broo", "Everyone wants to be someone.", "Layla Harrison wants to leave her beach-bum days for digs behind a reporter’s desk. Aster Amirpour wants to scream at the next casting director who tells her “we need ethnic but not your kind of ethnic.” Tommy Phillips dreams of buying a twelve-string guitar and using it to shred his way back into his famous absentee dad’s life.", "But Madison Brooks took destiny and made it her bitch a long time ago.", "She’s Hollywood’s hottest starlet, and the things she did to become the name on everyone’s lips are merely a stain on the pavement, ground beneath her Louboutin heel.", "That is, until Layla, Aster, and Tommy find themselves with a VIP invite to the glamorous and gritty world of Los Angeles’s nightlife and lured into a high-stakes competition where Madison Brooks is the target. Just as their hopes begin to gleam like stars through the California smog, Madison Brooks goes missing. . . . And all of their hopes are blacked out in the haze of their lies.", " is #1 ", "bestselling author Alyson Noël’s first book in a thrilling suspense trilogy about how our most desperate dreams can become our darkest nightmares."], "author": "Alyson Noel", "num_pages": "420", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-10 00:00:00", "ISBN": "0062324527"},
{"url": "https://www.goodreads.com/book/show/30653880-the-ship-beyond-time", "num_ratings": "2,474", "num_reviews": "445", "avg_ratings": 3.91, "genres": ["Fantasy", "Young Adult", "Science Fiction", "Time Travel", "Historical", "Historical Fiction"], "title": "The Ship Beyond Time", "description": ["After what seems like a lifetime of following her father across the globe and through the centuries, Nix has finally taken the helm of their time-traveling ship. Her future—and the horizon—is bright.", "Until she learns she is destined to lose the one she loves. To end up like her father: alone, heartbroken.", "Unable to face losing Kashmir—best fr", "After what seems like a lifetime of following her father across the globe and through the centuries, Nix has finally taken the helm of their time-traveling ship. Her future—and the horizon—is bright.", "Until she learns she is destined to lose the one she loves. To end up like her father: alone, heartbroken.", "Unable to face losing Kashmir—best friend, thief, charmer extraordinaire—Nix sails her crew to a mythical utopia to meet a man who promises he can teach her how to manipulate time, to change history. But no place is perfect, not even paradise. And everything is constantly changing on this utopian island, including reality itself.", "If Nix can read the ever-shifting tides, perhaps she will finally harness her abilities. Perhaps she can control her destiny, too.", "Or perhaps her time will finally run out."], "author": "Heidi Heilig", "num_pages": "456", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-28 00:00:00", "ISBN": "0062380788"},
{"url": "https://www.goodreads.com/book/show/35279009-a-wild-and-unremarkable-thing", "num_ratings": "93", "num_reviews": "79", "avg_ratings": 4.03, "genres": ["Fantasy", "Young Adult"], "title": "A Wild and Unremarkable Thing", "description": ["Cayda has spent her entire life training to slay a Fire Scale. Now the time has come to leave her dragon-ravaged village behind, march into the Summer Alps, and reap the rewards of a Champion. But the road between poverty and prosperity is rife with beasts, betrayals, and baser temptations. Sensible Cayda soon discovers she’s not the only Champion with her eye on the prize", "Cayda has spent her entire life training to slay a Fire Scale. Now the time has come to leave her dragon-ravaged village behind, march into the Summer Alps, and reap the rewards of a Champion. But the road between poverty and prosperity is rife with beasts, betrayals, and baser temptations. Sensible Cayda soon discovers she’s not the only Champion with her eye on the prize, or the only one wearing a disguise.", "A Wild and Unremarkable Thing pits girl against dragon in a stunning blend of Greek mythology and medieval lore. Don’t miss the thrilling novella that readers are calling poetic, enchanting, and a must-read for fans of fantasy!"], "author": "Jen Castleberry", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-01-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24974996-dear-martin", "num_ratings": "13,341", "num_reviews": "2,944", "avg_ratings": 4.39, "genres": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "title": "Dear Martin", "description": ["Raw, captivating, and undeniably real, Nic Stone joins industry giants Jason Reynolds and Walter Dean Myers as she boldly tackles American race relations in this stunning debut.", "Justyce McAllister is top of his class and set for the Ivy League—but none of that matters to the police officer who just put him in handcuffs. And despite leaving his rough neighborhood behind, he", "Raw, captivating, and undeniably real, Nic Stone joins industry giants Jason Reynolds and Walter Dean Myers as she boldly tackles American race relations in this stunning debut.", "Justyce McAllister is top of his class and set for the Ivy League—but none of that matters to the police officer who just put him in handcuffs. And despite leaving his rough neighborhood behind, he can't escape the scorn of his former peers or the ridicule of his new classmates. Justyce looks to the teachings of Dr. Martin Luther King Jr. for answers. But do they hold up anymore? He starts a journal to Dr. King to find out.", "Then comes the day Justyce goes driving with his best friend, Manny, windows rolled down, music turned up—way up, sparking the fury of a white off-duty cop beside them. Words fly. Shots are fired. Justyce and Manny are caught in the crosshairs. In the media fallout, it's Justyce who is under attack."], "author": "Nic Stone", "num_pages": "210", "awards": ["William C. Morris YA Debut Award Nominee (2018)"], "places": ["Atlanta, Georgia"], "character_names": [], "language": "English", "publish_date": "2017-10-17 00:00:00", "ISBN": "1101939494"},
{"url": "https://www.goodreads.com/book/show/34885059-blue-bottle-tree", "num_ratings": "38", "num_reviews": "32", "avg_ratings": 3.71, "genres": ["Fantasy", "Fiction", "Fantasy", "Magic", "Fantasy", "Supernatural"], "title": "Blue Bottle Tree", "description": ["There’s no such thing as Voodoo. At least that’s what most of the Baptists in Bellin tell themselves. But Seven LaVey knows better. ", "In a small rural town just outside of Nashville, Voodoo conjures and curses simmer and seethe under the noses of the many who will never know. Seventeen-year-old Seven romanticizes about the meaning of life while held captive as a zombie under", "There’s no such thing as Voodoo. At least that’s what most of the Baptists in Bellin tell themselves. But Seven LaVey knows better. ", "In a small rural town just outside of Nashville, Voodoo conjures and curses simmer and seethe under the noses of the many who will never know. Seventeen-year-old Seven romanticizes about the meaning of life while held captive as a zombie under the shell of a kiddie pool. He's counting on the strength - and maybe even love - of a certain redheaded clarinet player to save him. But will she?", "Filled with betrayal and revenge, two families struggle with a curse that stretches back to Queen of the Voodoos Marie Laveau in this contemporary Southern Gothic adventure. Prepare for a wildly original twist on the paranormal."], "author": "Beaird Glover", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30312796-the-truth-of-right-now", "num_ratings": "267", "num_reviews": "64", "avg_ratings": 3.46, "genres": ["Young Adult", "Contemporary", "Romance", "Realistic Fiction", "Young Adult", "Coming Of Age", "Did Not Finish"], "title": "The Truth of Right Now", "description": ["Lily is returning to her privileged Manhattan high school after a harrowing end to her sophomore year and it’s not pretty. She hates chemistry and her spiteful lab partner, her friends are either not speaking to her or suffocating her with concerned glances, and nothing seems to give he", "Lily is returning to her privileged Manhattan high school after a harrowing end to her sophomore year and it’s not pretty. She hates chemistry and her spiteful lab partner, her friends are either not speaking to her or suffocating her with concerned glances, and nothing seems to give her joy anymore. Worst of all, she can’t escape her own thoughts about what drove her away from everyone in the first place.", "Enter Dari (short for Dariomauritius), the artistic and mysterious transfer student, adept at cutting class. Not that he’d rather be at home with his domineering Trinidadian father. Dari is everything that Lily needs: bright, creative, honest, and unpredictable. And in a school where no one really stands out, Dari finds Lily’s sensitivity and openness magnetic. Their attraction ignites immediately, and for the first time in what feels like forever, Lily and Dari find happiness in each other.", "In twenty-first-century New York City, the fact that Lily is white and Dari is black shouldn’t matter that much, but nothing’s as simple as it seems. When tragedy becomes reality, can friendship survive even if romance cannot?"], "author": "Kara Lee Corthron", "num_pages": "279", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-01-03 00:00:00", "ISBN": "1481459473"},
{"url": "https://www.goodreads.com/book/show/29008379-you-don-t-know-me-but-i-know-you", "num_ratings": "320", "num_reviews": "97", "avg_ratings": 3.6, "genres": ["Young Adult", "Contemporary", "Realistic Fiction"], "title": "You Don't Know Me But I Know You", "description": ["There’s a box in the back of Audrey’s closet that she rarely thinks about.", "Inside is a letter, seventeen years old, from a mother she’s never met, handed to her by the woman she’s called Mom her whole life.", "Being adopted, though, is just one piece in the puzzle of Audrey’s life—the picture painstakingly put together by Audrey herself, consisting not only of the greatest fami", "There’s a box in the back of Audrey’s closet that she rarely thinks about.", "Inside is a letter, seventeen years old, from a mother she’s never met, handed to her by the woman she’s called Mom her whole life.", "Being adopted, though, is just one piece in the puzzle of Audrey’s life—the picture painstakingly put together by Audrey herself, consisting not only of the greatest family ever but of a snarky, loyal, sometimes infuriating best friend, Rose; a sweet, smart musician boyfriend, Julian; and a beloved camera that turns the most fleeting moments of her day-to-day routine into precious, permanent memories.", "But when Audrey realizes that she’s pregnant, she feels something—a tightly sealed box in the closet corners of her heart—crack open, spilling her dormant fears and unanswered questions all over the life she loves.", "Almost two decades ago, a girl in Audrey’s situation made a choice, one that started Audrey’s entire story. Now Audrey is paralyzed by her own what-ifs and terrified by the distance she feels growing between her and Rose. Down every possible path is a different unfamiliar version of her life, and as she weighs the options in her mind, she starts to wonder—what does it even mean to be Audrey Spencer?", "Rebecca Barrow’s bright, honest debut novel about chance, choice, and unconditional love is a heartfelt testament to creating the future you truly want, one puzzle piece at a time."], "author": "Rebecca Barrow", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30635582-light-years", "num_ratings": "153", "num_reviews": "39", "avg_ratings": 3.41, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fiction"], "title": "Light Years", "description": ["“A searingly beautiful page-turner.” —Jennifer Niven, New York Times bestselling author", "“A thrilling, thoughtful meditation on life and death.” —Hello Giggles", "“Gorgeously written.” —School Library Journal (starred review)", "\"A supernatural romantic thriller that defies convention.\" --Kirkus Reviews ", "\"...Reminiscent of the works of Madeleine L'Engle....Shockingly timely.\" --Shelf", "“A searingly beautiful page-turner.” —Jennifer Niven, New York Times bestselling author", "“A thrilling, thoughtful meditation on life and death.” —Hello Giggles", "“Gorgeously written.” —School Library Journal (starred review)", "\"A supernatural romantic thriller that defies convention.\" --Kirkus Reviews ", "\"...Reminiscent of the works of Madeleine L'Engle....Shockingly timely.\" --Shelf Awareness", "Luisa is ready for her life to start. Five minutes ago. And she could be on her way, as her extraordinary coding skills have landed her a finalist spot for a fellowship sponsored by Thomas Bell, the world’s most brilliant and mercurial tech entrepreneur. Being chosen means funding, mentorship, and most importantly, freedom from her overbearing mother. Maybe Lu will even figure out how to control the rare condition that plagues her: whenever her emotions run high, her physical senses kick into overload, with waves of colour, sound, taste, and touch flooding her body.", "But Luisa’s life is thrust into chaos as a deadly virus sweeps across the globe, killing thousands and sending her father into quarantine. When Lu receives a cryptic message from someone who might hold the key to stopping the epidemic, she knows she must do something to save her family—and the world."], "author": "Emily Ziff Griffin", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-05 00:00:00", "ISBN": "1507200056"},
{"url": "https://www.goodreads.com/book/show/34373958-allerleirauh", "num_ratings": "205", "num_reviews": "136", "avg_ratings": 4.01, "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Fiction", "Fairy Tales", "Fairy Tale Retellings", "Retellings"], "title": "Allerleirauh", "description": ["Once Upon a Time…", "In the kingdom of Tranen, a king makes a promise to his dying wife that he'll only remarry a woman who possesses her golden hair. In time, the king's eyes are turned by his daughter. Realizing her father’s intentions, Princess Aurelia tries to trick him by requesting impossible gifts: dresses created by the sun, moon and stars, and a coat made of a thousan", "Once Upon a Time…", "In the kingdom of Tranen, a king makes a promise to his dying wife that he'll only remarry a woman who possesses her golden hair. In time, the king's eyes are turned by his daughter. Realizing her father’s intentions, Princess Aurelia tries to trick him by requesting impossible gifts: dresses created by the sun, moon and stars, and a coat made of a thousand furs. But when he is successful, Aurelia sacrifices her privileged life and flees her kingdom, disguised by the cloak and a new name, Allerleirauh.", "She enters the safe haven of Saarland der Licht, where the handsome and gentle Prince Klaus takes her under his care. Hoping not to be discovered by her father’s courtiers, Allerleirauh tries to remain hidden under her new identity when she finds unexpected love with Prince Klaus, even though his arranged marriage to the princess of a neighboring kingdom approaches. Risking everything, Allerleirauh must face her troubled past and her fears of the future along her journey to self-acceptance in this triumphant retelling of the classic Grimm Fairy Tale."], "author": "Chantal Gadoury", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26114524-the-only-thing-worse-than-me-is-you", "num_ratings": "2,424", "num_reviews": "658", "avg_ratings": 4.1, "genres": ["Young Adult", "Contemporary", "Romance", "Retellings", "Young Adult", "Young Adult Contemporary", "Fiction"], "title": "The Only Thing Worse Than Me Is You", "description": ["Trixie Watson has two very important goals for senior year: to finally save enough to buy the set of Doctor Who figurines at the local comic books store, and to place third in her class and knock Ben West--and his horrendous new mustache that he spent all summer growing--down to number four.", "Trixie will do anything to get her name ranked over Ben's, including give up sleep", "Trixie Watson has two very important goals for senior year: to finally save enough to buy the set of Doctor Who figurines at the local comic books store, and to place third in her class and knock Ben West--and his horrendous new mustache that he spent all summer growing--down to number four.", "Trixie will do anything to get her name ranked over Ben's, including give up sleep and comic books--well, maybe not comic books--but definitely sleep. After all, the war of Watson v. West is as vicious as the Doctor v. Daleks and Browncoats v. Alliance combined, and it goes all the way back to the infamous monkey bars incident in the first grade. Over a decade later, it's time to declare a champion once and for all.", "The war is Trixie's for the winning, until her best friend starts dating Ben's best friend and the two are unceremoniously dumped together and told to play nice. Finding common ground is odious and tooth-pullingly-painful, but Trixie and Ben's cautious truce slowly transforms into a fandom-based tentative friendship. When Trixie's best friend gets expelled for cheating and Trixie cries foul play, however, they have to choose who to believe and which side they're on--and they might not pick the same side."], "author": "Lily  Anderson", "num_pages": "352", "awards": [], "places": ["Oregon"], "character_names": ["Beatrice Watson", "Benedict \"Ben\" West", "Harper Leonard", "Cornell Aaron", "Peter Donnelly", "Jack Donnelly"], "language": "English", "publish_date": "2016-05-17 00:00:00", "ISBN": "1250079098"},
{"url": "https://www.goodreads.com/book/show/32181158-fragile-chaos", "num_ratings": "66", "num_reviews": "39", "avg_ratings": 3.95, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Romance", "Fiction"], "title": "Fragile Chaos", "description": ["A god of war seeking restoration. An unwilling sacrificial bride. Betrayal that could destroy them both. ", "Theodric, the young God of War, has a talent for inciting conflict and bloodshed. After being stripped of his powers by his older brother, King of Gods, he sets out to instigate a mortal war to prove himself wort", "A god of war seeking restoration. An unwilling sacrificial bride. Betrayal that could destroy them both. ", "Theodric, the young God of War, has a talent for inciting conflict and bloodshed. After being stripped of his powers by his older brother, King of Gods, he sets out to instigate a mortal war to prove himself worthy of being restored to power.", "Sixteen-year-old Cassia, like many in the modern era, believes gods and goddesses to be just a myth. Enemy to her country and an orphan of the war, she has no time for fairy tales. That’s until religious zealots from Theo’s sect offer her up as a sacrifice.", "Can Cassia and Theo end the mortal war and return balance to the earth and heavens? Or, will their game of fate lead down a path of destruction, betrayal, and romance neither of them saw coming?"], "author": "Amber R. Duell", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-07-11 00:00:00", "ISBN": "1946024007"},
{"url": "https://www.goodreads.com/book/show/30844667-begin-end-begin", "num_ratings": "502", "num_reviews": "151", "avg_ratings": 4.01, "genres": ["Short Stories", "Young Adult", "Anthologies", "Contemporary"], "title": "Begin, End, Begin: A #LoveOzYA Anthology", "description": ["The YA event of the year. Bestsellers. Award-winners. Superstars. This anthology has them all. With brilliantly entertaining short stories from beloved young adult authors Amie Kaufman, Melissa Keil, Will Kostakis, Ellie Marney, Jaclyn Moriarty, Michael Pryor, Alice Pung, Gabrielle Tozer, Lili Wilkinson and Danielle Binks, this all-new collection will show the world exactl", "The YA event of the year. Bestsellers. Award-winners. Superstars. This anthology has them all. With brilliantly entertaining short stories from beloved young adult authors Amie Kaufman, Melissa Keil, Will Kostakis, Ellie Marney, Jaclyn Moriarty, Michael Pryor, Alice Pung, Gabrielle Tozer, Lili Wilkinson and Danielle Binks, this all-new collection will show the world exactly how much there is to love about Aussie YA."], "author": "Danielle Binks", "num_pages": "336", "awards": ["Australian Book Industry Award (ABIA) for Older Children Age 13+ (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-04-24 00:00:00", "ISBN": "1460752317"},
{"url": "https://www.goodreads.com/book/show/30801623-when-planets-fall", "num_ratings": "39", "num_reviews": "27", "avg_ratings": 4.44, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia"], "title": "When Planets Fall", "description": ["Breaker's home is cleaved by blood. The three tribes on the planet Scarlatti, whose only difference is their blood color, each want to exploit Breaker's valley for themselves. The feudal tension has already claimed red-blood Breaker's leg and his older brother. Now all this 18-year old wants is to maintain the tenuous peace in order to keep his little 'stroid of a brother", "Breaker's home is cleaved by blood. The three tribes on the planet Scarlatti, whose only difference is their blood color, each want to exploit Breaker's valley for themselves. The feudal tension has already claimed red-blood Breaker's leg and his older brother. Now all this 18-year old wants is to maintain the tenuous peace in order to keep his little 'stroid of a brother alive. Malani, a red-blood raised blue, is a kidnapped POW and only wants to return to her adoptive home with her dangerous blue secrets. Luka, a red-blood stewing for trouble, wants to right wrongs done to his family and bathe his home in justice.", "All three intersect when Breaker discovers a wrecked starship and is given seven days by the green-bloods to fix and hand it over as a weapon. Breaker must decide if aiding his enemies is worth the home he knows and his family's life. War is coming. And war respects no boundaries. And war leaves no survivors."], "author": "Abby J. Reed", "num_pages": "413", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-05-10 00:00:00", "ISBN": "1682913104"},
{"url": "https://www.goodreads.com/book/show/22524101-my-so-called-bollywood-life", "num_ratings": "864", "num_reviews": "293", "avg_ratings": 3.68, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "My So-Called Bollywood Life", "description": ["Winnie Mehta was never really convinced that Raj was her soulmate, but their love was written in the stars. Literally, a pandit predicted Winnie would find the love of her life before her 18th birthday, and Raj meets all of the qualifications. Which is why Winnie is shocked to return from her summer at film camp to find her boyfriend of three years hooking up with Jenny Di", "Winnie Mehta was never really convinced that Raj was her soulmate, but their love was written in the stars. Literally, a pandit predicted Winnie would find the love of her life before her 18th birthday, and Raj meets all of the qualifications. Which is why Winnie is shocked to return from her summer at film camp to find her boyfriend of three years hooking up with Jenny Dickens. Worse, Raj is crowned chair of the student film festival, a spot Winnie was counting on for her film school applications. As a self-proclaimed Bollywood expert, Winnie knows this is not how her perfect ending is scripted.", "Then there’s Dev, a fellow film geek, and one of the few people Winnie can count on to help her reclaim control of her story. Dev is smart charming, and challenges Winnie to look beyond her horoscope to find someone she’d pick for herself. But does falling for Dev mean giving up on her prophecy, and her chance to live happily ever after? To get her Bollywood-like life on track, Winnie will need a little bit of help from fate, family, and of course, a Bollywood movie star. ", "Like an expertly choreographed Bollywood dance scene, Nisha Sharma’s off-beat love story dazzles in the lime light."], "author": "Nisha Sharma", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-05-15 00:00:00", "ISBN": "0553523252"},
{"url": "https://www.goodreads.com/book/show/34601342-if-birds-fly-back", "num_ratings": "503", "num_reviews": "134", "avg_ratings": 3.92, "genres": ["Contemporary", "Young Adult", "Romance"], "title": "If Birds Fly Back", "description": ["Linny has been fascinated by disappearances, ever since her sister Grace ran away in the middle of the night without saying goodbye.", "Sebastian can tell you how many galaxies there are, and knows how much plutonium weighs. But the one thing he can’t figure out is the identity of his birth father. ", "They’ve never met, but Linny and Sebastian have one thing in common: an obsessi", "Linny has been fascinated by disappearances, ever since her sister Grace ran away in the middle of the night without saying goodbye.", "Sebastian can tell you how many galaxies there are, and knows how much plutonium weighs. But the one thing he can’t figure out is the identity of his birth father. ", "They’ve never met, but Linny and Sebastian have one thing in common: an obsession with famous novelist and filmmaker Alvaro Herrera, who went missing three years ago and has just reappeared. As they learn more about the mystery of Alvaro, Linny and Sebastian uncover the answers they’ve been searching for."], "author": "Carlie Sorosiak", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-27 00:00:00", "ISBN": "0062563963"},
{"url": "https://www.goodreads.com/book/show/33602144-not-now-not-ever", "num_ratings": "495", "num_reviews": "190", "avg_ratings": 3.77, "genres": ["Young Adult", "Contemporary", "Romance", "Realistic Fiction"], "title": "Not Now, Not Ever", "description": ["The sequel to ", ", inspired by ", "Elliot Gabaroche is very clear on what she isn't going to do this summer. ", "1. She isn't going to stay home in Sacramento, where she'd have to sit through her stepmother's sixth community theater production of ", "2. She isn't going to mock trial camp at", "The sequel to ", ", inspired by ", "Elliot Gabaroche is very clear on what she isn't going to do this summer. ", "1. She isn't going to stay home in Sacramento, where she'd have to sit through her stepmother's sixth community theater production of ", "2. She isn't going to mock trial camp at UCLA.", "3. And she certainly isn't going to the Air Force summer program on her mother's base in Colorado Springs. As cool as it would be to live-action-role-play Ender's Game, Ellie's seen three generations of her family go through USAF boot camp up close, and she knows that it's much less Luke/Yoda/\"feel the force,\" and much more one hundred push-ups on three days of no sleep. And that just isn't appealing, no matter how many Xenomorphs from ", " she'd be able to defeat afterwards.", "What she is going to do is pack up her attitude, her favorite Octavia Butler novels, and her Jordans, and go to summer camp. Specifically, a cutthroat academic-decathlon-like competition for a full scholarship to Rayevich College, the only college with a Science Fiction Literature program. And she's going to start over as Ever Lawrence, on her own terms, without the shadow of all her family’s expectations. Because why do what’s expected of you when you can fight other genius nerds to the death for a shot at the dream you’re sure your family will consider a complete waste of time?", "This summer's going to be great."], "author": "Lily  Anderson", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-11-21 00:00:00", "ISBN": "1250142105"},
{"url": "https://www.goodreads.com/book/show/34091699-the-victoria-in-my-head", "num_ratings": "208", "num_reviews": "55", "avg_ratings": 3.94, "genres": ["Contemporary", "Young Adult", "Romance", "Music"], "title": "The Victoria in My Head", "description": ["Victoria Cruz inhabits two worlds: In one, she is a rock star, thrashing the stage with her husky voice and purple-streaked hair. In the other, currently serving as her reality, Victoria is a shy teenager with overprotective Cuban parents, who sleepwalks through her life at the prestigious Evanston Academy. Unable to overcome the whole paralyzing-stage-fright thing, Victor", "Victoria Cruz inhabits two worlds: In one, she is a rock star, thrashing the stage with her husky voice and purple-streaked hair. In the other, currently serving as her reality, Victoria is a shy teenager with overprotective Cuban parents, who sleepwalks through her life at the prestigious Evanston Academy. Unable to overcome the whole paralyzing-stage-fright thing, Victoria settles for living inside her fantasies, where nothing can go wrong and everything is set to her expertly crafted music playlists.", "But after a chance encounter with an unattainably gorgeous boy named Strand, whose band seeks a lead singer, Victoria is tempted to turn her fevered daydreams into reality. To do that, she must confront her insecurities and break away from the treadmill that is her life. Suddenly, Victoria is faced with the choice of staying on the path she’s always known and straying off-course to find love, adventure, and danger.", "From debut author Janelle Milanes comes a hilarious and heartfelt tale of the spectacular things that can happen when you go after what you really want."], "author": "Janelle Milanes", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-19 00:00:00", "ISBN": "1481480898"},
{"url": "https://www.goodreads.com/book/show/29456598-starfish", "num_ratings": "2,590", "num_reviews": "613", "avg_ratings": 4.05, "genres": ["Contemporary", "Young Adult", "Health", "Mental Health", "Fiction", "Mental Health", "Mental Illness"], "title": "Starfish", "description": ["Kiko Himura has always had a hard time saying exactly what she’s thinking. With a mother who makes her feel unremarkable and a half-Japanese heritage she doesn’t quite understand, Kiko prefers to keep her head down, certain that once she makes it into her dream art school, Prism, her real life will begin.", "But then Kiko doesn’t get into Prism, at the same time her abusive un", "Kiko Himura has always had a hard time saying exactly what she’s thinking. With a mother who makes her feel unremarkable and a half-Japanese heritage she doesn’t quite understand, Kiko prefers to keep her head down, certain that once she makes it into her dream art school, Prism, her real life will begin.", "But then Kiko doesn’t get into Prism, at the same time her abusive uncle moves back in with her family. So when she receives an invitation from her childhood friend to leave her small town and tour art schools on the west coast, Kiko jumps at the opportunity in spite of the anxieties and fears that attempt to hold her back. And now that she is finally free to be her own person outside the constricting walls of her home life, Kiko learns life-changing truths about herself, her past, and how to be brave."], "author": "Akemi Dawn Bowman", "num_pages": "340", "awards": ["William C. Morris YA Debut Award Nominee (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-26 00:00:00", "ISBN": "1481487728"},
{"url": "https://www.goodreads.com/book/show/28220660-redux", "num_ratings": "78", "num_reviews": "27", "avg_ratings": 4.22, "genres": ["Science Fiction", "Science Fiction", "Dystopia", "Young Adult"], "title": "Redux", "description": ["The domed city of Evanescence is in ruins. With nowhere to go, prodigy hacker Ellani “Ella” Drexel and a small band of survivors flee to the Undertunnel below their city.", "To escape the wasteland ", " unknowingly created.", "But sanctuary is hard to find. With malfunctioning androids and angry rebels at their backs, the group hopes to press on for the neighboring city of Cadence.", "The domed city of Evanescence is in ruins. With nowhere to go, prodigy hacker Ellani “Ella” Drexel and a small band of survivors flee to the Undertunnel below their city.", "To escape the wasteland ", " unknowingly created.", "But sanctuary is hard to find. With malfunctioning androids and angry rebels at their backs, the group hopes to press on for the neighboring city of Cadence. But Ella’s chosen path is challenging…life-threatening, even. Worse, the boy she loves is acting distant, and not at all like the person she first met in ", ".", "But then Ella learns a secret…and it changes ", ".", "Ella knows she needs to turn back and make a stand to reclaim her home. She’s determined to bring a new—and better—life to all who’ve suffered.", "Or die trying."], "author": "A.L. Davroe", "num_pages": "428", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-03-21 00:00:00", "ISBN": "163375507X"},
{"url": "https://www.goodreads.com/book/show/25558608-a-torch-against-the-night", "num_ratings": "53,206", "num_reviews": "7,669", "avg_ratings": 4.34, "genres": ["Fantasy", "Young Adult", "Romance"], "title": "A Torch Against the Night", "description": ["Elias and Laia are running for their lives. After the events of the Fourth Trial, Martial soldiers hunt the two fugitives as they flee the city of Serra and undertake a perilous journey through the heart of the Empire.", "Laia is determined to break into Kauf—the Empire’s most secure and dangerous prison—to save her brother, who is the key to the Scholars’ survival. And Elias", "Elias and Laia are running for their lives. After the events of the Fourth Trial, Martial soldiers hunt the two fugitives as they flee the city of Serra and undertake a perilous journey through the heart of the Empire.", "Laia is determined to break into Kauf—the Empire’s most secure and dangerous prison—to save her brother, who is the key to the Scholars’ survival. And Elias is determined to help Laia succeed, even if it means giving up his last chance at freedom.", "But dark forces, human and otherworldly, work against Laia and Elias. The pair must fight every step of the way to outsmart their enemies: the bloodthirsty Emperor Marcus, the merciless Commandant, the sadistic Warden of Kauf, and, most heartbreaking of all, Helene—Elias’s former friend and the Empire’s newest Blood Shrike.", "Bound to Marcus’s will, Helene faces a torturous mission of her own—one that might destroy her: find the traitor Elias Veturius and the Scholar slave who helped him escape…and kill them both."], "author": "Sabaa Tahir", "num_pages": "452", "awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2016)"], "places": [], "character_names": ["Laia", "Elias Veturius", "Helene Aquilla", "Keris Veturia", "Marcus Farrar"], "language": "English", "publish_date": "2016-08-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/31123249-saints-and-misfits", "num_ratings": "2,980", "num_reviews": "775", "avg_ratings": 3.83, "genres": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "title": "Saints and Misfits", "description": ["There are three kinds of people in my world:", "1. Saints, those special people moving the world forward. Sometimes you glaze over them. Or, at least, I do. They’re in your face so much, you can’t see them, like how you can’t see your nose.", "2. Misfits, people who don’t belong. Like me—the way I don’t fit into Dad’s brand-new family or in the leftover one composed of Mom and my", "There are three kinds of people in my world:", "1. Saints, those special people moving the world forward. Sometimes you glaze over them. Or, at least, I do. They’re in your face so much, you can’t see them, like how you can’t see your nose.", "2. Misfits, people who don’t belong. Like me—the way I don’t fit into Dad’s brand-new family or in the leftover one composed of Mom and my older brother, Mama’s-Boy-Muhammad.", "Also, there’s Jeremy and me. Misfits. Because although, alliteratively speaking, Janna and Jeremy sound good together, we don’t go together. Same planet, different worlds.", "But sometimes worlds collide and beautiful things happen, right?", "3. Monsters. Well, monsters wearing saint masks, like in Flannery O’Connor’s stories.", "Like the monster at my mosque.", "People think he’s holy, untouchable, but nobody has seen under the mask.", "Except me."], "author": "S.K. Ali", "num_pages": "352", "awards": ["William C. Morris YA Debut Award Nominee (2018)", "Asian/Pacific American Award Nominee for Young Adult Literature (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/29939047-a-crown-of-wishes", "num_ratings": "4,677", "num_reviews": "1,096", "avg_ratings": 4.17, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Mythology"], "title": "A Crown of Wishes", "description": ["She is the princess of Bharata—captured by her kingdom’s enemies, a prisoner of war. Now that she faces a future of exile and scorn, Gauri has nothing left to lose. But should she trust Vikram, the notoriously cunning prince of a neighboring land? He", "She is the princess of Bharata—captured by her kingdom’s enemies, a prisoner of war. Now that she faces a future of exile and scorn, Gauri has nothing left to lose. But should she trust Vikram, the notoriously cunning prince of a neighboring land? He promises her freedom in exchange for her battle prowess. Together they can team up and win the Tournament of Wishes, a competition held in a mythical city where the Lord of Wealth promises a wish to the victor. It seems like a foolproof plan—until Gauri and Vikram arrive at the tournament and find that danger takes on new shapes: poisonous courtesans, mischievous story birds, a feast of fears, and twisted fairy revels. New trials will test their devotion, strength, and wits. But what Gauri and Vikram will soon discover is that there’s nothing more dangerous than what they most desire."], "author": "Roshani Chokshi", "num_pages": "369", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-03-28 00:00:00", "ISBN": "1250085497"},
{"url": "https://www.goodreads.com/book/show/28458598-when-dimple-met-rishi", "num_ratings": "26,404", "num_reviews": "6,687", "avg_ratings": 3.76, "genres": ["Young Adult", "Romance", "Contemporary", "Fiction"], "title": "When Dimple Met Rishi", "description": ["Dimple Shah has it all figured out. With graduation behind her, she’s more than ready for a break from her family, from Mamma’s inexplicable obsession with her finding the “Ideal Indian Husband.” Ugh. Dimple knows they must respect her principles on some level, though. If they truly believed she needed a husband right now, they wouldn’t have paid for her to attend a summer", "Dimple Shah has it all figured out. With graduation behind her, she’s more than ready for a break from her family, from Mamma’s inexplicable obsession with her finding the “Ideal Indian Husband.” Ugh. Dimple knows they must respect her principles on some level, though. If they truly believed she needed a husband right now, they wouldn’t have paid for her to attend a summer program for aspiring web developers…right?", "Rishi Patel is a hopeless romantic. So when his parents tell him that his future wife will be attending the same summer program as him—wherein he’ll have to woo her—he’s totally on board. Because as silly as it sounds to most people in his life, Rishi wants to be arranged, believes in the power of tradition, stability, and being a part of something much bigger than himself.", "The Shahs and Patels didn’t mean to start turning the wheels on this “suggested arrangement” so early in their children’s lives, but when they noticed them both gravitate toward the same summer program, they figured, Why not?", "Dimple and Rishi may think they have each other figured out. But when opposites clash, love works hard to prove itself in the most unexpected ways."], "author": "Sandhya Menon", "num_pages": "380", "awards": ["Lincoln Award Nominee (2019)", "Goodreads Choice Award Nominee for Young Adult Fiction (2017)"], "places": ["San Francisco Bay Area, California"], "character_names": ["Dimple Shah", "Rishi Patel", "Celia Ramirez", "Ashish Patel"], "language": "English", "publish_date": "2017-05-30 00:00:00", "ISBN": "1481478680"},
{"url": "https://www.goodreads.com/book/show/28763485-the-sun-is-also-a-star", "num_ratings": "82,783", "num_reviews": "13,673", "avg_ratings": 4.11, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "The Sun Is Also a Star", "description": ["Natasha: I’m a girl who believes in science and facts. Not fate. Not destiny. Or dreams that will never come true. I’m definitely not the kind of girl who meets a cute boy on a crowded New York City street and falls in love with him. Not when my family is twelve hours away from being deported to Jamaica. Falling in love with him won’t be my story.", "Daniel: I’ve always been t", "Natasha: I’m a girl who believes in science and facts. Not fate. Not destiny. Or dreams that will never come true. I’m definitely not the kind of girl who meets a cute boy on a crowded New York City street and falls in love with him. Not when my family is twelve hours away from being deported to Jamaica. Falling in love with him won’t be my story.", "Daniel: I’ve always been the good son, the good student, living up to my parents’ high expectations. Never the poet. Or the dreamer. But when I see her, I forget about all that. Something about Natasha makes me think that fate has something much more extraordinary in store—for both of us.", "The Universe: Every moment in our lives has brought us to this single moment. A million futures lie before us. Which one will come true?"], "author": "Nicola Yoon", "num_pages": "348", "awards": ["California Book Award for Young Adult (Gold) (2016)", "Michael L. Printz Award Nominee (2017)", "John Steptoe New Talent Author Award (2017)", "Goodreads Choice Award Nominee for Young Adult Fiction (2016)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2016-11-01 00:00:00", "ISBN": "0553496689"},
{"url": "https://www.goodreads.com/book/show/24382227-dreamland-burning", "num_ratings": "3,900", "num_reviews": "778", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Young Adult", "Mystery", "Fiction", "Historical"], "title": "Dreamland Burning", "description": ["When seventeen-year-old Rowan Chase finds a skeleton on her family’s property, she has no idea that investigating the brutal century-old murder will lead to a summer of painful discoveries about the past, the present, and herself.", "One hundred years earlier, a single violent encounter propels seventeen-year-old Will", "When seventeen-year-old Rowan Chase finds a skeleton on her family’s property, she has no idea that investigating the brutal century-old murder will lead to a summer of painful discoveries about the past, the present, and herself.", "One hundred years earlier, a single violent encounter propels seventeen-year-old Will Tillman into a racial firestorm. In a country rife with violence against blacks and a hometown segregated by Jim Crow, Will must make hard choices on a painful journey towards self discovery and face his inner demons in order to do what’s right the night Tulsa burns."], "author": "Jennifer Latham", "num_pages": "365", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-21 00:00:00", "ISBN": "0316384933"}
]