[
{"url": "https://www.goodreads.com/book/show/762476.Kokoro", "num_ratings": "12,975", "num_reviews": "1,033", "avg_ratings": 4.0, "genres": ["Cultural", "Japan", "Fiction", "Asian Literature", "Japanese Literature", "Classics", "Literature"], "title": "Kokoro", "description": ["Hailed by The New Yorker as ", " Kokoro — ", " — is the work of one of Japan's most popular authors. This thought-provoking trilogy of stories explores the very essence of loneliness and stands as a stirring introduction to modern Japanese literature."], "author": "Sōseki Natsume", "num_pages": "248", "awards": [], "places": ["Kamakura", "Tokyo"], "character_names": [], "language": "English", "publish_date": "1996-07-01 00:00:00", "ISBN": "0809260956"},
{"url": "https://www.goodreads.com/book/show/11077.The_Sex_Lives_of_Cannibals", "num_ratings": "18,972", "num_reviews": "2,100", "avg_ratings": 3.87, "genres": ["Travel", "Nonfiction", "Humor", "Autobiography", "Memoir"], "title": "The Sex Lives of Cannibals: Adrift in the Equatorial Pacific", "description": ["At the age of twenty-six, Maarten Troost who had been pushing the snooze button on the alarm clock of life by racking up useless graduate degrees and muddling through a series of temp jobs decided to pack up his flip-flops and move to Tarawa, a remote South Pacific island in the Republic of Kiribati. He was restless and lacked direction, and the idea of dropping everything", "At the age of twenty-six, Maarten Troost who had been pushing the snooze button on the alarm clock of life by racking up useless graduate degrees and muddling through a series of temp jobs decided to pack up his flip-flops and move to Tarawa, a remote South Pacific island in the Republic of Kiribati. He was restless and lacked direction, and the idea of dropping everything and moving to the ends of the Earth was irresistibly romantic. He should have known better. ", " tells the hilarious story of what happens when Troost discovers that Tarawa is not the island paradise he dreamed of. Falling into one amusing misadventure after another, Troost struggles through relentless, stifling heat, a variety of deadly bacteria, polluted seas, toxic fish, and worst of all, no television or coffee. And that's just the first day. Sunburned, emaciated, and stinging with sea lice, Troost spends the next two years battling incompetent government officials, alarmingly large critters, erratic electricity, and a paucity of food options. He contends with a cast of bizarre local characters, including \"Half-Dead Fred\" and the self-proclaimed Poet Laureate of Tarawa (a British drunkard who's never written a poem in his life), and eventually settles into the ebb and flow of island life, just before his return to the culture shock of civilization. With the rollicking wit of Bill Bryson, the brilliant travel exposition of Paul Theroux, and a hipster edge that is entirely Troost's own, ", " is the ultimate vicarious adventure. Readers may never long to set foot on Tarawa, but they'll want to travel with Troost time and time again."], "author": "J. Maarten Troost", "num_pages": "272", "awards": [], "places": ["Kiribati"], "character_names": [], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "0767915305"},
{"url": "https://www.goodreads.com/book/show/649361.Farewell_to_Manzanar", "num_ratings": "9,884", "num_reviews": "1,004", "avg_ratings": 3.55, "genres": ["Nonfiction", "History", "Autobiography", "Memoir", "Biography", "Academic", "School", "Historical"], "title": "Farewell to Manzanar: A True Story of Japanese American Experience During and After the World War II Internment", "description": ["Jeanne Wakatsuki was seven years old in 1942 when her family was uprooted from their home and sent to live at Manzanar internment camp—with 10,000 other Japanese Americans. Along with searchlight towers and armed guards, Manzanar ludicrously featured cheerleaders, Boy Scouts, sock hops, baton twirling lessons and a dance band called the Jive Bombers who would play any popu", "Jeanne Wakatsuki was seven years old in 1942 when her family was uprooted from their home and sent to live at Manzanar internment camp—with 10,000 other Japanese Americans. Along with searchlight towers and armed guards, Manzanar ludicrously featured cheerleaders, Boy Scouts, sock hops, baton twirling lessons and a dance band called the Jive Bombers who would play any popular song except the nation's #1 hit: \"Don't Fence Me In.\"", " is the true story of one spirited Japanese-American family's attempt to survive the indignities of forced detention—and of a native-born American child who discovered what it was like to grow up behind barbed wire in the United States."], "author": "Jeanne Wakatsuki Houston", "num_pages": "203", "awards": [], "places": ["Independence"], "character_names": [], "language": "English", "publish_date": "1995-08-12 00:00:00", "ISBN": "0553272586"},
{"url": "https://www.goodreads.com/book/show/24041443-we-never-asked-for-wings", "num_ratings": "15,283", "num_reviews": "1,992", "avg_ratings": 3.82, "genres": ["Contemporary", "Fiction", "Adult Fiction"], "title": "We Never Asked for Wings", "description": ["From the beloved New York Times bestselling author of The Language of Flowers comes her much-anticipated new novel about young love, hard choices, and hope against all odds.", "For fourteen years, Letty Espinosa has worked three jobs around San Francisco to make ends meet while her mother raised her children—Alex, now fifteen, and Luna, six—in their tiny apartment on a forgott", "From the beloved New York Times bestselling author of The Language of Flowers comes her much-anticipated new novel about young love, hard choices, and hope against all odds.", "For fourteen years, Letty Espinosa has worked three jobs around San Francisco to make ends meet while her mother raised her children—Alex, now fifteen, and Luna, six—in their tiny apartment on a forgotten spit of wetlands near the bay. But now Letty’s parents are returning to Mexico, and Letty must step up and become a mother for the first time in her life.", "Navigating this new terrain is challenging for Letty, especially as Luna desperately misses her grandparents and Alex, who is falling in love with a classmate, is unwilling to give his mother a chance. Letty comes up with a plan to help the family escape the dangerous neighborhood and heartbreaking injustice that have marked their lives, but one wrong move could jeopardize everything she’s worked for and her family’s fragile hopes for the future.", "Vanessa Diffenbaugh blends gorgeous prose with compelling themes of motherhood, undocumented immigration, and the American Dream in a powerful and prescient story about family."], "author": "Vanessa Diffenbaugh", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-18 00:00:00", "ISBN": "055339231X"},
{"url": "https://www.goodreads.com/book/show/20702546-gabi-a-girl-in-pieces", "num_ratings": "7,883", "num_reviews": "1,204", "avg_ratings": 3.95, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Contemporary", "Poetry", "Young Adult", "Teen"], "title": "Gabi, a Girl in Pieces", "description": ["Gabi Hernandez chronicles her last year in high school in her diary: college applications, Cindy's pregnancy, Sebastian's coming out, the cute boys, her father's meth habit, and the food she craves. And best of all, the poetry that helps forge her identity.", "Gabi Hernandez chronicles her last year in high school in her diary: college applications, Cindy's pregnancy, Sebastian's coming out, the cute boys, her father's meth habit, and the food she craves. And best of all, the poetry that helps forge her identity.", " is a library technician in the Inland Empire. She is also the events coordinator for Orange Monkey and helps edit the poetry journal ", ". ", " is her debut novel."], "author": "Isabel Quintero", "num_pages": "284", "awards": ["California Book Award for Young Adult (Gold) (2014)", "William C. Morris YA Debut Award (2015)", "Lincoln Award Nominee (2017)", "Tomás Rivera Mexican American Children’s Book Award (2015)"], "places": ["Santa Maria, California"], "character_names": [], "language": "English", "publish_date": "2014-10-14 00:00:00", "ISBN": "1935955950"},
{"url": "https://www.goodreads.com/book/show/12000020-aristotle-and-dante-discover-the-secrets-of-the-universe", "num_ratings": "158,561", "num_reviews": "23,908", "avg_ratings": 4.35, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "Aristotle and Dante Discover the Secrets of the Universe", "description": ["Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this fr", "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be."], "author": "Benjamin Alire Sáenz", "num_pages": "359", "awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2013)", "Michael L. Printz Award Nominee (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2015)", "Lambda Literary Award for LGBT Children's/Young Adult (2013)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2015)", "Amelia Elizabeth Walden Award Nominee (2013)", "Lincoln Award Nominee (2016)", "Pura Belpré Award for Narrative (2013)", "Les Incorruptibles (2017)"], "places": ["El Paso, Texas", "Texas"], "character_names": ["Aristotle \"Ari\" Mendoza", "Dante Quintana"], "language": "English", "publish_date": "2012-02-21 00:00:00", "ISBN": "1442408928"},
{"url": "https://www.goodreads.com/book/show/642709.The_Tequila_Worm", "num_ratings": "1,287", "num_reviews": "242", "avg_ratings": 3.81, "genres": ["Young Adult", "Cultural", "Realistic Fiction", "Fiction", "Family", "Young Adult", "Coming Of Age"], "title": "The Tequila Worm", "description": ["Sofia comes from a family of storytellers. Here are her tales of growing up in the barrio, full of the magic and mystery of family traditions: making Easter ", ", celebrating ", "preparing for ", "rejoicing in the Christmas ", ", and curing homesickness by eating the tequila worm. When Sofia is singled out to receive a scholarship to", "Sofia comes from a family of storytellers. Here are her tales of growing up in the barrio, full of the magic and mystery of family traditions: making Easter ", ", celebrating ", "preparing for ", "rejoicing in the Christmas ", ", and curing homesickness by eating the tequila worm. When Sofia is singled out to receive a scholarship to an elite boarding school, she longs to explore life beyond the barrio, even though it means leaving her family to navigate a strange world of rich, privileged kids. It's a different ", ", but one where Sofia's traditions take on new meaning and illuminate her path."], "author": "Viola Canales", "num_pages": "208", "awards": ["Judy Lopez Memorial Award for Children's Literature Nominee (2006)", "Pura Belpré Award for Narrative (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-13 00:00:00", "ISBN": "0375840893"},
{"url": "https://www.goodreads.com/book/show/15195.The_Complete_Maus", "num_ratings": "98,065", "num_reviews": "5,614", "avg_ratings": 4.54, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "History", "Biography"], "title": "The Complete Maus", "description": ["Combined for the first time here are Maus I: A Survivor's Tale and Maus II - the complete story of Vladek Spiegelman and his wife, living and surviving in Hitler's Europe. By addressing the horror of the Holocaust through cartoons, the author captures the everyday reality of fear and is able to explore the guilt, relief and extraordinary sensation of survival - and how the", "Combined for the first time here are Maus I: A Survivor's Tale and Maus II - the complete story of Vladek Spiegelman and his wife, living and surviving in Hitler's Europe. By addressing the horror of the Holocaust through cartoons, the author captures the everyday reality of fear and is able to explore the guilt, relief and extraordinary sensation of survival - and how the children of survivors are in their own way affected by the trials of their parents. A contemporary classic of immeasurable significance."], "author": "Art Spiegelman", "num_pages": "296", "awards": ["Pulitzer Prize for Special Citation (1992)", "American Book Award (1992)"], "places": ["Sosnowiec", "Auschwitz"], "character_names": ["Vladek Spiegelman", "Anja Spiegelman", "Art Spiegelman", "Mala Spiegelman"], "language": "English", "publish_date": "2003-10-02 00:00:00", "ISBN": "0141014083"},
{"url": "https://www.goodreads.com/book/show/10564965-my-name-is-not-easy", "num_ratings": "1,577", "num_reviews": "310", "avg_ratings": 3.63, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical"], "title": "My Name is Not Easy", "description": ["Luke knows his I'nupiaq name is full of sounds white people can't say. He knows he'll have to leave it behind when he and his brothers are sent to boarding school hundreds of miles from their Arctic village. At Sacred Heart School things are different. Instead of family, there are students -- Eskimo, Indian, White -- who line up on different sides of the cafeteria like the", "Luke knows his I'nupiaq name is full of sounds white people can't say. He knows he'll have to leave it behind when he and his brothers are sent to boarding school hundreds of miles from their Arctic village. At Sacred Heart School things are different. Instead of family, there are students -- Eskimo, Indian, White -- who line up on different sides of the cafeteria like there's some kind of war going on. And instead of comforting words like tutu and maktak, there's English. Speaking I'nupiaq -- or any native language -- is forbidden. And Father Mullen, whose fury is like a force of nature, is ready to slap down those who disobey. Luke struggles to survive at Sacred Heart. But he's not the only one. There's smart-aleck Amiq, a daring leader -- if he doesn't self destruct; Chickie, blond and freckled, a different kind of outsider; and small quiet Junior, noticing everything and writing it all down. Each has their own story to tell. But once their separate stories come together, things at Sacred Heart School -- and in the wider world -- will never be the same."], "author": "Debby Dahl Edwardson", "num_pages": "248", "awards": ["National Book Award Finalist for Young People's Literature (2011)"], "places": ["Alaska"], "character_names": [], "language": "English", "publish_date": "2011-10-01 00:00:00", "ISBN": "0761459804"},
{"url": "https://www.goodreads.com/book/show/297673.The_Brief_Wondrous_Life_of_Oscar_Wao", "num_ratings": "199,878", "num_reviews": "17,884", "avg_ratings": 3.9, "genres": ["Fiction", "Contemporary", "Magical Realism", "Novels"], "title": "The Brief Wondrous Life of Oscar Wao", "description": ["Things have never been easy for Oscar, a sweet but disastrously overweight, lovesick Dominican ghetto nerd. From his home in New Jersey, where he lives with his old-world mother and rebellious sister, Oscar dreams of becoming the Dominican J. R. R. Tolkien and, most of all, of finding love. But he may never get what he wants, thanks to the Fukœ—the curse that has haunted t", "Things have never been easy for Oscar, a sweet but disastrously overweight, lovesick Dominican ghetto nerd. From his home in New Jersey, where he lives with his old-world mother and rebellious sister, Oscar dreams of becoming the Dominican J. R. R. Tolkien and, most of all, of finding love. But he may never get what he wants, thanks to the Fukœ—the curse that has haunted the Oscar's family for generations, dooming them to prison, torture, tragic accidents, and, above all, ill-starred love. Oscar, still waiting for his first kiss, is just its most recent victim. ", "Diaz immerses us in the tumultuous life of Oscar and the history of the family at large, rendering with genuine warmth and dazzling energy, humor, and insight the Dominican-American experience, and, ultimately, the endless human capacity to persevere in the face of heartbreak and loss. A true literary triumph, ", " confirms Junot Diaz as one of the best and most exciting voices of our time."], "author": "Junot Díaz", "num_pages": "335", "awards": ["Pulitzer Prize for Fiction (2008)", "Anisfield-Wolf Book Award (2008)", "Massachusetts Book Award for Fiction (2008)", "Dayton Literary Peace Prize for Fiction (2008)", "National Book Critics Circle Award for Fiction (2007)", "Hurston/Wright Legacy Award for Fiction (2008)", "The Rooster - The Morning News Tournament of Books (2008)", "The Center for Fiction First Novel Prize (2007)"], "places": ["Dominican Republic", "Washington Heights, New York", "Paterson, New Jersey"], "character_names": ["Oscar de León", "Lola de León", "Hypatía Belicia \"Beli\" Cabral de León", "La Inca", "Yunior de Las Casas", "Ybón Pimentel", "Dr Abelard Luis Cabral"], "language": "English", "publish_date": "2007-09-06 00:00:00", "ISBN": "1594489580"},
{"url": "https://www.goodreads.com/book/show/25256386-out-of-darkness", "num_ratings": "2,440", "num_reviews": "619", "avg_ratings": 4.08, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Romance", "Fiction", "Young Adult", "Teen"], "title": "Out of Darkness", "description": ["New London, Texas. 1937. Naomi Vargas and Wash Fuller know about the lines in East Texas as well as anyone. They know the signs that mark them.", "They know the people who enforce them.", "New London, Texas. 1937. Naomi Vargas and Wash Fuller know about the lines in East Texas as well as anyone. They know the signs that mark them.", "They know the people who enforce them.", "But sometimes the attraction between two people is so powerful it breaks through even the most entrenched color lines. And the consequences can be explosive.", "Ashley Hope Pérez takes the facts of the 1937 New London school explosion—the worst school disaster in American history—as a backdrop for a riveting novel about segregation, love, family, and the forces that destroy people."], "author": "Ashley Hope Pérez", "num_pages": "402", "awards": ["Michael L. Printz Award Nominee (2016)", "Lincoln Award Nominee (2018)", "Américas Award (2016)", "Tomás Rivera Mexican American Children’s Book Award (2016)"], "places": ["East Texas", "Texas"], "character_names": ["Roberto \"Beto\"", "Naomi Vargas", "Wash Fuller", "Henry (Out of Darkness)", "The Gang"], "language": "English", "publish_date": "2015-09-01 00:00:00", "ISBN": "1467742023"},
{"url": "https://www.goodreads.com/book/show/14362.Bless_Me_Ultima", "num_ratings": "22,602", "num_reviews": "1,947", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "Young Adult", "Magical Realism", "Academic", "School"], "title": "Bless Me, Ultima", "description": ["Antonio Marez is six years old when Ultima enters his life. She is a curandera, one who heals with herbs and magic. 'We cannot let her live her last days in loneliness,' says Antonio's mother. 'It is not the way of our people,' agrees his father. And so Ultima comes to live with Antonio's family in New Mexico. Soon Tony will journey to the threshold of manhood. Always, Ult", "Antonio Marez is six years old when Ultima enters his life. She is a curandera, one who heals with herbs and magic. 'We cannot let her live her last days in loneliness,' says Antonio's mother. 'It is not the way of our people,' agrees his father. And so Ultima comes to live with Antonio's family in New Mexico. Soon Tony will journey to the threshold of manhood. Always, Ultima watches over him. She graces him with the courage to face childhood bigotry, diabolical possession, the moral collapse of his brother, and too many violent deaths. Under her wise guidance, Tony will probe the family ties that bind him, and he will find in himself the magical secrets of the pagan past—a mythic legacy equally as palpable as the Catholicism of Latin America in which he has been schooled. At each turn in his life there is Ultima who will nurture the birth of his soul."], "author": "Rudolfo Anaya", "num_pages": "290", "awards": ["Premio Quinto Sol"], "places": ["United States of America", "New Mexico"], "character_names": ["Antonio Marez", "Ultima, la Grande", "Tenorio", "Narciso"], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "0446675369"},
{"url": "https://www.goodreads.com/book/show/33600.Shantaram", "num_ratings": "126,556", "num_reviews": "11,185", "avg_ratings": 4.27, "genres": ["Fiction", "Cultural", "India", "Travel", "Adventure"], "title": "Shantaram", "description": ["\"It took me a long time and most of the world to learn what I know about love and fate and the choices we make, but the heart of it came to me in an instant, while I was chained to a wall and being tortured.\"", "So begins this epic, mesmerizing first novel set in the underworld of contemporary Bombay. Shantaram is narrated by Lin, an escaped convict with a false passport who f", "\"It took me a long time and most of the world to learn what I know about love and fate and the choices we make, but the heart of it came to me in an instant, while I was chained to a wall and being tortured.\"", "So begins this epic, mesmerizing first novel set in the underworld of contemporary Bombay. Shantaram is narrated by Lin, an escaped convict with a false passport who flees maximum security prison in Australia for the teeming streets of a city where he can disappear.", "Accompanied by his guide and faithful friend, Prabaker, the two enter Bombay's hidden society of beggars and gangsters, prostitutes and holy men, soldiers and actors, and Indians and exiles from other countries, who seek in this remarkable place what they cannot find elsewhere.", "As a hunted man without a home, family, or identity, Lin searches for love and meaning while running a clinic in one of the city's poorest slums, and serving his apprenticeship in the dark arts of the Bombay mafia. The search leads him to war, prison torture, murder, and a series of enigmatic and bloody betrayals. The keys to unlock the mysteries and intrigues that bind Lin are held by two people. The first is Khader Khan: mafia godfather, criminal-philosopher-saint, and mentor to Lin in the underworld of the Golden City. The second is Karla: elusive, dangerous, and beautiful, whose passions are driven by secrets that torment her and yet give her a terrible power.", "Burning slums and five-star hotels, romantic love and prison agonies, criminal wars and Bollywood films, spiritual gurus and mujaheddin guerrillas – this huge novel has the world of human experience in its reach, and a passionate love for India at its heart. Based on the life of the author, it is by any measure the debut of an extraordinary voice in literature."], "author": "Gregory David Roberts", "num_pages": "936", "awards": ["Commonwealth Writers' Prize Nominee for Best First Book (the Pacific Region) (2004)"], "places": ["Bombay", "Afghanistan"], "character_names": ["Lin Ford", "Karla Saraanen", "Lisa", "Prabaker", "Abdel Khader Khan", "Abdullah Taheri", "Nazeer", "Didier"], "language": "English", "publish_date": "2004-08-12 00:00:00", "ISBN": "192076920X"},
{"url": "https://www.goodreads.com/book/show/11451112-in-darkness", "num_ratings": "3,639", "num_reviews": "603", "avg_ratings": 3.74, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Historical", "Young Adult", "Teen"], "title": "In Darkness", "description": ["In darkness I count my blessings like Manman taught me. One: I am alive. Two: there is no two. In the aftermath of the Haitian earthquake a boy is trapped beneath the rubble of a ruined hospital: thirsty, terrified and alone. 'Shorty' is a child of the slums, a teenage boy who has seen enough violence to last a lifetime, and who has been inexorably drawn into the world of", "In darkness I count my blessings like Manman taught me. One: I am alive. Two: there is no two. In the aftermath of the Haitian earthquake a boy is trapped beneath the rubble of a ruined hospital: thirsty, terrified and alone. 'Shorty' is a child of the slums, a teenage boy who has seen enough violence to last a lifetime, and who has been inexorably drawn into the world of the gangsters who rule Site Soleil: men who dole out money with one hand and death with the other. But Shorty has a secret: a flame of revenge that blazes inside him and a burning wish to find the twin sister he lost five years ago. And he is marked. Marked in a way that links him with Toussaint L'Ouverture, the Haitian rebel who two-hundred years ago led the slave revolt and faced down Napoleon to force the French out of Haiti. As he grows weaker, Shorty relives the journey that took him to the hospital, a bullet wound in his arm. In his visions and memories he hopes to find the strength to survive, and perhaps then Toussaint can find a way to be free ...", "Watch the official "], "author": "Nick Lake", "num_pages": "337", "awards": ["Michael L. Printz Award (2013)", "Carnegie Medal Nominee (2013)"], "places": ["Haiti"], "character_names": [], "language": "English", "publish_date": "2012-01-05 00:00:00", "ISBN": "140881997X"},
{"url": "https://www.goodreads.com/book/show/589995.The_Lesser_Blessed", "num_ratings": "836", "num_reviews": "92", "avg_ratings": 3.93, "genres": ["Cultural", "Canada", "Fiction", "Young Adult", "Contemporary"], "title": "The Lesser Blessed", "description": ["A fresh, funny look at growing up Native in the North, by award-winning author Richard Van Camp.", "Larry is a Dogrib Indian growing up in the small northern town of Fort Simmer. His tongue, his hallucinations and his fantasies are hotter than the sun. At sixteen, he loves Iron Maiden, the North and Juliet Hope, the high school \"tramp.\" When Johnny Beck, a Metis from Hay River", "A fresh, funny look at growing up Native in the North, by award-winning author Richard Van Camp.", "Larry is a Dogrib Indian growing up in the small northern town of Fort Simmer. His tongue, his hallucinations and his fantasies are hotter than the sun. At sixteen, he loves Iron Maiden, the North and Juliet Hope, the high school \"tramp.\" When Johnny Beck, a Metis from Hay River, moves to town, Larry is ready for almost anything.", "In this powerful and often very funny first novel, Richard Van Camp gives us one of the most original teenage characters in fiction. Skinny as spaghetti, nervy and self-deprecating, Larry is an appealing mixture of bravado and vulnerability. His past holds many terrors: an abusive father, blackouts from sniffing gasoline, an accident that killed several of his cousins. But through his friendship with Johnny, he’s ready now to face his memories—and his future.", "Marking the debut of an exciting new writer, The Lesser Blessed is an eye-opening depiction of what it is to be a young Native man in the age of AIDS, disillusionment with Catholicism and a growing world consciousness.", "A coming-of-age story that any fan of The Catcher in the Rye will enjoy."], "author": "Richard Van Camp", "num_pages": "128", "awards": ["Deutscher Jugendliteraturpreis for Jugendbuch (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-06 00:00:00", "ISBN": "1550545256"},
{"url": "https://www.goodreads.com/book/show/178478.The_Poet_Slave_of_Cuba", "num_ratings": "709", "num_reviews": "184", "avg_ratings": 4.02, "genres": ["Poetry", "Biography", "Nonfiction", "Cultural", "Childrens", "Middle Grade", "Childrens", "Historical", "Young Adult", "Teen", "Biography Memoir", "Childrens", "Juvenile"], "title": "The Poet Slave of Cuba: A Biography of Juan Francisco Manzano", "description": ["Born into the household of a wealthy slave owner in Cuba in 1797, Juan Francisco Manzano spent his early years by the side of a woman who made him call her Mama, even though he had a mama of his own. Denied an education, young Juan still showed an exceptional talent for poetry. His verses reflect", "Born into the household of a wealthy slave owner in Cuba in 1797, Juan Francisco Manzano spent his early years by the side of a woman who made him call her Mama, even though he had a mama of his own. Denied an education, young Juan still showed an exceptional talent for poetry. His verses reflect the beauty of his world, but they also expose its hideous cruelty.", "Powerful, haunting poems and breathtaking illustrations create a portrait of a life in which even the pain of slavery could not extinguish the capacity for hope.", " is the winner of the 2008 Pura Belpre Medal for Narrative and a 2007 Bank Street - Best Children's Book of the Year.", "Latino Interest."], "author": "Margarita Engle", "num_pages": "192", "awards": ["IRA Children’s and Young Adult’s Book Award for Young Adult–Nonfiction (2007)", "Américas Award (2006)", "Pura Belpré Award for Narrative (2008)"], "places": ["Cuba"], "character_names": [], "language": "English", "publish_date": "2006-04-04 00:00:00", "ISBN": "0805077065"},
{"url": "https://www.goodreads.com/book/show/8537327-inside-out-back-again", "num_ratings": "31,898", "num_reviews": "5,069", "avg_ratings": 4.1, "genres": ["Historical", "Historical Fiction", "Poetry", "Childrens", "Middle Grade", "Young Adult", "Fiction", "Childrens"], "title": "Inside Out & Back Again", "description": ["For all the ten years of her life, Hà has only known Saigon: the thrills of its markets, the joy of its traditions, and the warmth of her friends close by. But now the Vietnam War has reached her home. Hà and her family are forced to flee as Saigon falls, and they board a ship headed toward hope. In America, Hà discovers the foreign world of Alabama: the coldness of its st", "For all the ten years of her life, Hà has only known Saigon: the thrills of its markets, the joy of its traditions, and the warmth of her friends close by. But now the Vietnam War has reached her home. Hà and her family are forced to flee as Saigon falls, and they board a ship headed toward hope. In America, Hà discovers the foreign world of Alabama: the coldness of its strangers, the dullness of its food . . . and the strength of her very own family."], "author": "Thanhha Lai", "num_pages": "272", "awards": ["Newbery Medal Nominee (2012)", "National Book Award for Young People's Literature (2011)", "Jane Addams Children's Book Award Nominee for Older Children (2012)", "Pennsylvania Young Readers' Choice Award Nominee for Grades 6-8 (2014)", "Dorothy Canfield Fisher Children's Book Award Nominee (2013)", "Washington State Sasquatch Award Nominee (2014)", "Rebecca Caudill Young Readers' Book Award Nominee (2013)"], "places": ["Saigon", "Alabama"], "character_names": ["Mother", "Kim Ha", "Miss Washington", "Brother Quang", "Vu Lee", "Brother Khoi", "Cowboy"], "language": "English", "publish_date": "2011-02-22 00:00:00", "ISBN": "0061962783"},
{"url": "https://www.goodreads.com/book/show/21943020-the-train-to-crystal-city", "num_ratings": "1,593", "num_reviews": "343", "avg_ratings": 4.06, "genres": ["History", "Nonfiction", "War", "World War II", "North American Hi...", "American History", "War"], "title": "The Train to Crystal City: FDR's Secret Prisoner Exchange Program and America's Only Family Internment Camp During World War II", "description": ["The dramatic and never-before-told story of a secret FDR-approved American internment camp in Texas during World War II, where thousands of families - many US citizens - were incarcerated. From 1942 to 1948, trains delivered more than 10,000 civilians from the United States and Latin America to Crystal City, Texas, a small desert town at the southern tip of Texas. The trai", "The dramatic and never-before-told story of a secret FDR-approved American internment camp in Texas during World War II, where thousands of families - many US citizens - were incarcerated. From 1942 to 1948, trains delivered more than 10,000 civilians from the United States and Latin America to Crystal City, Texas, a small desert town at the southern tip of Texas. The trains carried Japanese, German, Italian immigrants and their American-born children. The only family internment camp during World War II, Crystal City was the center of a government prisoner exchange program called \"quiet passage.\" During the course of the war, hundreds of prisoners in Crystal City, including their American-born children, were exchanged for other more important Americans - diplomats, businessmen, soldiers, physicians, and missionaries - behind enemy lines in Japan and Germany. Focusing her story on two American-born teenage girls who were interned, author Jan Jarboe Russell uncovers the details of their years spent in the camp; the struggles of their fathers; their families; subsequent journeys to war-devastated Germany and Japan; and their years-long attempt to survive and return to the United States, transformed from incarcerated enemies to American loyalists. Their stories of day-to-day life at the camp, from the ten-foot high security fence to the armed guards, daily roll call, and censored mail, have never been told. Combining big-picture World War II history with a little-known event in American history that has long been kept quiet, \"The Train to Crystal City\" reveals the war-time hysteria against the Japanese and Germans in America, the secrets of FDR's tactics to rescue high-profile POWs in Germany and Japan, and how the definition of American citizenship changed under the pressure of war."], "author": "Jan Jarboe Russell", "num_pages": "416", "awards": ["PEN/John Kenneth Galbraith Award for Nonfiction Nominee for Longlist (2017)"], "places": [], "character_names": [], "language": null, "publish_date": "2015-01-20 00:00:00", "ISBN": "1451693680"},
{"url": "https://www.goodreads.com/book/show/2462153.Wild_Kids", "num_ratings": "36", "num_reviews": "5", "avg_ratings": 3.33, "genres": ["Literature", "Asian Literature", "Fiction", "Unfinished", "Literature"], "title": "Wild Kids: Two Novels about Growing Up", "description": ["These two searingly funny and unsettling portraits of teenagers beyond the control and largely beneath the notice of adults in 1980s Taiwan are the first English translations of works by Taiwan's most famous and best-selling literary cult figure. Chang Ta-chun's intricate narrative and keen, ironic sense of humor poignantly and piercingly convey the disillusionment and cyn", "These two searingly funny and unsettling portraits of teenagers beyond the control and largely beneath the notice of adults in 1980s Taiwan are the first English translations of works by Taiwan's most famous and best-selling literary cult figure. Chang Ta-chun's intricate narrative and keen, ironic sense of humor poignantly and piercingly convey the disillusionment and cynicism of modern Taiwanese youth.", "Interweaving the events between the birth of the narrator's younger sister and her abortion at the age of nineteen, the first novel, \"My Kid Sister, \" evokes the complex emotional impressions of youth and the often bizarre social dilemmas of adolescence. Combining discussions of fate, existentialism, sexual awakening, and everyday \"absurdities\" in a typically dysfunctional household, it documents the loss of innocence and the deconstruction of a family.", "In \"Wild Child, \" fourteen-year-old Hou Shichun drops out of school, runs away from home, and descends into the Taiwanese underworld, where he encounters an oddball assortment of similarly lost adolescents in desperate circumstances. This novel will inevitably invite comparisons with the classic \"The Catcher in the Rye, \" but unlike Holden Caulfield, Hou isn't given any second chances. With characteristic frankness and irony, Chang's teenagers bear witness to a new form of cultural and spiritual bankruptcy."], "author": "Chang Ta-chun", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-08-31 00:00:00", "ISBN": "0231120966"},
{"url": "https://www.goodreads.com/book/show/5967064-the-photographer", "num_ratings": "2,904", "num_reviews": "373", "avg_ratings": 4.24, "genres": ["Sequential Art", "Graphic Novels", "Nonfiction", "Sequential Art", "Comics", "History", "Art", "Photography", "Autobiography", "Memoir"], "title": "The Photographer", "description": ["In 1986, Afghanistan was torn apart by a war with the Soviet Union. This graphic novel/photo-journal is a record of one reporters arduous and dangerous journey through Afghanistan, accompanying the Doctors Without Borders. Didier Lefevres photography, paired with the art of Emmanuel Guibert, tells the powerful story of a mission undertaken by men and women dedicated to men", "In 1986, Afghanistan was torn apart by a war with the Soviet Union. This graphic novel/photo-journal is a record of one reporter\u0092s arduous and dangerous journey through Afghanistan, accompanying the Doctors Without Borders. Didier Lefevre\u0092s photography, paired with the art of Emmanuel Guibert, tells the powerful story of a mission undertaken by men and women dedicated to mending the wounds of war."], "author": "Emmanuel Guibert", "num_pages": "288", "awards": ["Will Eisner Comic Industry Awards for Best U.S. Edition of International Material (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-12 00:00:00", "ISBN": "1596433752"},
{"url": "https://www.goodreads.com/book/show/37781.Things_Fall_Apart", "num_ratings": "236,002", "num_reviews": "11,119", "avg_ratings": 3.63, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Academic", "School", "Literature"], "title": "Things Fall Apart", "description": ["THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict betw", "THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict between the individual and society. ", "The second story, which is as modern as the first is ancient, and which elevates the book to a tragic plane, concerns the clash of cultures and the destruction of Okonkwo's world through the arrival of aggressive, proselytizing European missionaries. These twin dramas are perfectly harmonized, and they are modulated by an awareness capable of encompassing at once the life of nature, human history, and the mysterious compulsions of the soul. THINGS FALL APART is the most illuminating and permanent monument we have to the modern African experience as seen from within."], "author": "Chinua Achebe", "num_pages": "209", "awards": [], "places": ["Africa"], "character_names": ["Okonkwo"], "language": "English", "publish_date": "1994-09-01 00:00:00", "ISBN": "0385474547"},
{"url": "https://www.goodreads.com/book/show/886134.The_Killing_Sea", "num_ratings": "1,822", "num_reviews": "210", "avg_ratings": 3.74, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Adventure", "Survival", "Adventure"], "title": "The Killing Sea", "description": [" ", " Aceh, Indonesia. December 2004. Ruslan, an Indonesian boy, and Sarah, an American girl, are brought together in t", " ", " Aceh, Indonesia. December 2004. Ruslan, an Indonesian boy, and Sarah, an American girl, are brought together in the aftermath of the devastating tsunami. Ruslan is searching for his missing father, while Sarah is trying to get medical treatment for her sick brother. Together they travel through the destruction, barely believing all that they see. ", " is a high-stakes survival story that puts a human face on a terrible tragedy. Richard Lewis, who lives in Indonesia, was there during the tsunami and worked as a relief worker in Aceh in the days and weeks following it. This novel is based on his firsthand experiences."], "author": "Richard Lewis", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-05 00:00:00", "ISBN": "1416911650"},
{"url": "https://www.goodreads.com/book/show/18749.Half_of_a_Yellow_Sun", "num_ratings": "69,327", "num_reviews": "6,158", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21", "Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed. ", "With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another. ", "Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had."], "author": "Chimamanda Ngozi Adichie", "num_pages": "433", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "1400044162"},
{"url": "https://www.goodreads.com/book/show/43015.A_Long_Way_Gone", "num_ratings": "139,376", "num_reviews": "9,673", "avg_ratings": 4.15, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Africa", "Biography", "War"], "title": "A Long Way Gone: Memoirs of a Boy Soldier", "description": ["The devastating story of war through the eyes of a child soldier. Beah tells how, at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and became a soldier.", "My new friends have begun to suspect I haven’t told them the full story of my life.", "“Why did you leave Sierra Le", "The devastating story of war through the eyes of a child soldier. Beah tells how, at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and became a soldier.", "My new friends have begun to suspect I haven’t told them the full story of my life.", "“Why did you leave Sierra Leone?”", "“Because there is a war.”", "“You mean, you saw people running around with guns and shooting each other?”", "“Yes, all the time.”", "“Cool.”", "I smile a little.", "“You should tell us about it sometime.”", "“Yes, sometime.” ", "This is how wars are fought now: by children, hopped-up on drugs and wielding AK-47s. Children have become soldiers of choice. In the more than fifty conflicts going on worldwide, it is estimated that there are some 300,000 child soldiers. Ishmael Beah used to be one of them. ", "What is war like through the eyes of a child soldier? How does one become a killer? How does one stop? Child soldiers have been profiled by journalists, and novelists have struggled to imagine their lives. But until now, there has not been a first-person account from someone who came through this hell and survived.", "In A Long Way Gone, Beah, now twenty-five years old, tells a riveting story: how at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and Beah, at heart a gentle boy, found that he was capable of truly terrible acts. ", "This is a rare and mesmerizing account, told with real literary force and heartbreaking honesty."], "author": "Ishmael Beah", "num_pages": "229", "awards": ["Christopher Award (2008)", "ALA Alex Award (2008)", "Lincoln Award Nominee (2010)", "NAIBA Book of the Year for Nonfiction (2007)", "Bill Duthie Booksellers’ Choice Award Nominee (2008)"], "places": ["Sierra Leone", "New York City, New York"], "character_names": ["Ishmael Beah", "Musa", "Esther", "\"Junior\" Beah", "Talloi", "Kanei", "Alhaji", "Jumah", "Moriba", "Saidu", "Khalilou"], "language": "English", "publish_date": "2007-02-13 00:00:00", "ISBN": "0374105235"},
{"url": "https://www.goodreads.com/book/show/79876.Does_My_Head_Look_Big_in_This_", "num_ratings": "9,430", "num_reviews": "1,429", "avg_ratings": 3.65, "genres": ["Young Adult", "Fiction", "Contemporary", "Religion", "Realistic Fiction", "Young Adult", "Teen"], "title": "Does My Head Look Big in This?", "description": ["Sixteen-year-old Amal makes the decision to start wearing the hijab full-time and everyone has a reaction. Her parents, her teachers, her friends, people on the street. But she stands by her decision to embrace her faith and all that it is, even if it", "Sixteen-year-old Amal makes the decision to start wearing the hijab full-time and everyone has a reaction. Her parents, her teachers, her friends, people on the street. But she stands by her decision to embrace her faith and all that it is, even if it does make her a little different from everyone else.", "Can she handle the taunts of \"towel head,\" the prejudice of her classmates, and still attract the cutest boy in school? Brilliantly funny and poignant, Randa Abdel-Fattah's debut novel will strike a chord in all teenage readers, no matter what their beliefs."], "author": "Randa Abdel-Fattah", "num_pages": "360", "awards": ["Lincoln Award Nominee (2010)"], "places": ["Melbourne, Victoria"], "character_names": ["Amal"], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "0439919479"},
{"url": "https://www.goodreads.com/book/show/14342632-summer-of-the-mariposas", "num_ratings": "568", "num_reviews": "135", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Magical Realism", "Fantasy", "Mythology", "Fiction", "Cultural", "Childrens", "Middle Grade"], "title": "Summer of the Mariposas", "description": ["When Odilia and her four sisters find a dead body in the swimming hole, they embark on a hero’s journey to return the dead man to his family in Mexico. But returning home to Texas turns into an odyssey that would rival Homer’s original tale.", "With the supernatural aid of ghostly La Llorona via a magical earring, Odilia and her little sisters travel a road of tribulation to t", "When Odilia and her four sisters find a dead body in the swimming hole, they embark on a hero’s journey to return the dead man to his family in Mexico. But returning home to Texas turns into an odyssey that would rival Homer’s original tale.", "With the supernatural aid of ghostly La Llorona via a magical earring, Odilia and her little sisters travel a road of tribulation to their long-lost grandmother’s house. Along the way, they must outsmart a witch and her Evil Trinity: a wily warlock, a coven of vicious half-human barn owls, and a bloodthirsty livestock-hunting chupacabras. Can these fantastic trials prepare Odilia and her sisters for what happens when they face their final test, returning home to the real world, where goddesses and ghosts can no longer help them? ", " is not just a magical Mexican American retelling of The Odyssey, it is a celebration of sisterhood and maternal love."], "author": "Guadalupe Garcia McCall", "num_pages": "355", "awards": ["Andre Norton Award Nominee (2012)"], "places": ["Texas"], "character_names": [], "language": "English", "publish_date": "2012-10-20 00:00:00", "ISBN": "1600609007"},
{"url": "https://www.goodreads.com/book/show/230861.The_Land_of_Green_Plums", "num_ratings": "3,615", "num_reviews": "481", "avg_ratings": 3.64, "genres": ["Fiction", "Cultural", "Romania", "Nobel Prize", "European Literature", "German Literature", "Historical", "Historical Fiction", "Literature"], "title": "The Land of Green Plums", "description": ["Set in Romania at the height of Ceausescu's reign of terror, this novel tells the story of a group of young students, each of whom has left the impoverished provinces in search of better prospects in the city."], "author": "Herta Müller", "num_pages": "242", "awards": ["Aristeion Prize (1995)", "Kleist-Preis (1994)", "International DUBLIN Literary Award (1998)", "Mikael Agricola -palkinto (1997)"], "places": ["Romania"], "character_names": ["Edgar", "Kurt", "Georg", "Lola", "Ich", "Hauptmann Pjele"], "language": "English", "publish_date": "2009-11-01 00:00:00", "ISBN": "1862072604"},
{"url": "https://www.goodreads.com/book/show/25614492-salt-to-the-sea", "num_ratings": "72,217", "num_reviews": "12,582", "avg_ratings": 4.36, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "War", "World War II"], "title": "Salt to the Sea", "description": ["World War II is drawing to a close in East Prussia and thousands of refugees are on a desperate trek toward freedom, many with something to hide. Among them are Joana, Emilia, and Florian, whose paths converge en route to the ship that promises salvation, the ", ". Forced by circumstance to unite, the three find their strength, courage, and trust in each other", "World War II is drawing to a close in East Prussia and thousands of refugees are on a desperate trek toward freedom, many with something to hide. Among them are Joana, Emilia, and Florian, whose paths converge en route to the ship that promises salvation, the ", ". Forced by circumstance to unite, the three find their strength, courage, and trust in each other tested with each step closer to safety.", "Just when it seems freedom is within their grasp, tragedy strikes. Not country, nor culture, nor status matter as all ten thousand people—adults and children alike—aboard must fight for the same thing: survival."], "author": "Ruta Sepetys", "num_pages": "393", "awards": ["SCBWI Golden Kite Award for Fiction (2016)", "Audie Award for Young Adult (2017)", "Milwaukee County Teen Book Award Nominee (2017)", "California Young Readers Medal for Young Adult (2018)", "Lincoln Award Nominee (2018)", "Goodreads Choice Award for Young Adult Fiction (2016)", "Carnegie Medal (2017)", "The Magnolia Award Nominee for 9-12 (2018)"], "places": ["World War II (WW II)", "East Prussia"], "character_names": ["Joana", "Alfred Frick", "Florian Beck", "Emilia"], "language": "English", "publish_date": "2016-02-02 00:00:00", "ISBN": "0399160302"},
{"url": "https://www.goodreads.com/book/show/22521951-written-in-the-stars", "num_ratings": "4,664", "num_reviews": "1,054", "avg_ratings": 3.96, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction", "Realistic Fiction"], "title": "Written in the Stars", "description": ["This heart-wrenching novel explores what it is like to be thrust into an unwanted marriage. Has Naila’s fate been written in the stars? Or can she still make her own destiny?", " ", "Naila’s conservative immigrant parents have always said the same thing: She may choose what to study, how to wear her hair, and what to be when she grows up—but they will choose her husband. Following", "This heart-wrenching novel explores what it is like to be thrust into an unwanted marriage. Has Naila’s fate been written in the stars? Or can she still make her own destiny?", " ", "Naila’s conservative immigrant parents have always said the same thing: She may choose what to study, how to wear her hair, and what to be when she grows up—but they will choose her husband. Following their cultural tradition, they will plan an arranged marriage for her. And until then, dating—even friendship with a boy—is forbidden. When Naila breaks their rule by falling in love with Saif, her parents are livid. Convinced she has forgotten who she truly is, they travel to Pakistan to visit relatives and explore their roots. But Naila’s vacation turns into a nightmare when she learns that plans have changed—her parents have found her a husband and they want her to marry him, now! Despite her greatest efforts, Naila is aghast to find herself cut off from everything and everyone she once knew. Her only hope of escape is Saif . . . if he can find her before it’s too late."], "author": "Aisha Saeed", "num_pages": "277", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-24 00:00:00", "ISBN": "0399171703"}
]