[
{"url": "https://www.goodreads.com/book/show/26742484-the-posthumous-papers-of-the-pickwick-club-volume-3", "num_ratings": "11", "num_reviews": "0", "avg_ratings": 4.36, "genres": [], "title": "The Posthumous Papers of the Pickwick Club, Volume 3", "description": ["This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most impor", "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work.This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.As a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant."], "author": "Charles Dickens", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-08-22 00:00:00", "ISBN": "1297933125"},
{"url": "https://www.goodreads.com/book/show/26960918-the-posthumous-papers-of-the-pickwick-club-volume-2-of-2-illustratio", "num_ratings": "100", "num_reviews": "5", "avg_ratings": 3.99, "genres": ["Fiction"], "title": "The Posthumous Papers of the Pickwick Club, Volume 2 (of 2) (Illustrations) (The Posthumous Papers of the Pickwick Club Series)", "description": ["Example in this ebook ", "CHAPTER I ", "The Story of the Goblins who Stole a Sexton ", "In an old abbey town, down in this part of the country, a long, long while ago—so long, that the story must be a true one, because our great-grandfathers implicitly believed it—there officiated as sexton and grave-digger in the churchyard, one Gabriel Grub. It by no means follows that because a man", "Example in this ebook ", "CHAPTER I ", "The Story of the Goblins who Stole a Sexton ", "In an old abbey town, down in this part of the country, a long, long while ago—so long, that the story must be a true one, because our great-grandfathers implicitly believed it—there officiated as sexton and grave-digger in the churchyard, one Gabriel Grub. It by no means follows that because a man is a sexton, and constantly surrounded by the emblems of mortality, therefore he should be a morose and melancholy man; your undertakers are the merriest fellows in the world; and I once had the honour of being on intimate terms with a mute, who in private life, and off duty, was as comical and jocose a little fellow as ever chirped out a devil-may-care song, without a hitch in his memory, or drained off the contents of a good stiff glass without stopping for breath. But, notwithstanding these precedents to the contrary, Gabriel Grub was an ill-conditioned, cross-grained, surly fellow—a morose and lonely man, who consorted with nobody but himself, and an old wicker bottle which fitted into his large deep waistcoat pocket—and who eyed each merry face, as it passed him by, with such a deep scowl of malice and ill-humour, as it was difficult to meet, without feeling something the worse for. ", "“A little before twilight, one Christmas Eve, Gabriel shouldered his spade, lighted his lantern, and betook himself towards the old churchyard; for he had got a grave to finish by next morning, and, feeling very low, he thought it might raise his spirits, perhaps, if he went on with his work at once. As he went his way, up the ancient street, he saw the cheerful light of blazing fires gleam through[2] the old casements, and heard the loud laugh and the cheerful shouts of those who were assembled around them; he marked the bustling preparations for next day’s cheer, and smelt the numerous savoury odours consequent thereupon, as they steamed up from the kitchen windows in clouds. All this was gall and wormwood to the heart of Gabriel Grub: and when groups of children bounded out of the houses, tripped across the road, and were met, before they could knock at the opposite door, by half a dozen curly-headed little rascals who crowded round them as they flocked up-stairs to spend the evening in their Christmas games, Gabriel smiled grimly, and clutched the handle of his spade with a firmer grasp, as he thought of measles, scarlet-fever, thrush, hooping-cough, and a good many other sources of consolation besides. ", "“In this happy frame of mind, Gabriel strode along: returning a short, sullen growl to the good-humoured greetings of such of his neighbours as now and then passed him: until he turned into the dark lane which led to the churchyard. Now, Gabriel had been looking forward to reaching the dark lane, because it was, generally speaking, a nice, gloomy, mournful place, into which the townspeople did not much care to go, except in broad daylight, and when the sun was shining; consequently, he was not a little indignant to hear a young urchin roaring out some jolly song about a merry Christmas, in this very sanctuary, which had been called Coffin Lane ever since the days of the old abbey, and the time of the shaven-headed monks. As Gabriel walked on, and the voice drew nearer, he found it proceeded from a small boy, who was hurrying along, to join one of the little parties in the old street, and who, partly to keep himself company, and partly to prepare himself for the occasion, was shouting out the song at the highest pitch of his lungs. So Gabriel waited until the boy came up, and then dodged him into a corner, and rapped him over the head with his lantern five or six times, to teach him to modulate his voice."], "author": "Charles Dickens", "num_pages": "486", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6977981-the-mystery-of-edwin-drood-and-humphrey-s-clock", "num_ratings": "12", "num_reviews": "1", "avg_ratings": 3.17, "genres": ["Fiction", "Literature"], "title": "The Mystery of Edwin Drood and Humphrey's Clock", "description": ["Many of the earliest books, particularly those dating back to the 1900s and before, are now extremely scarce and increasingly expensive. We are republishing these classic works in affordable, high quality, modern editions, using the original text and artwork."], "author": "Charles Dickens", "num_pages": "488", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-12 00:00:00", "ISBN": "1443701521"},
{"url": "https://www.goodreads.com/book/show/28330764-the-uncommercial-traveller-with-biographical-introduction", "num_ratings": "256", "num_reviews": "30", "avg_ratings": 3.5, "genres": ["Classics", "Fiction", "Travel"], "title": "The Uncommercial Traveller [with Biographical Introduction]", "description": ["The Uncommercial Traveller [with Biographical Introduction]"], "author": "Charles Dickens", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-07-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6433786-christmas-stories-uncommercial-traveller", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Christmas Stories/  Uncommercial Traveller", "description": ["Includes A Christmas Carol, The Chimes, The Cricket on the Hearth, The Battle of Life and The Haunted Man."], "author": "Charles Dickens", "num_pages": "758", "awards": [], "places": ["United Kingdom"], "character_names": [], "language": "English", "publish_date": "1884-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/28179573-the-uncommercial-traveller", "num_ratings": "256", "num_reviews": "30", "avg_ratings": 3.5, "genres": ["Classics", "Fiction", "Travel"], "title": "The Uncommercial Traveller: (Annotated)", "description": ["The Uncommercial Traveller is a collection of literary sketches and reminiscences written by Charles Dickens. ", "In 1859 Dickens founded a new journal called All the Year Round and the Uncommercial Traveller articles would be among his main contributions. He seems to have chosen the title and persona of the Uncommercial Traveller as a result of a speech he gave on the 22 Dece", "The Uncommercial Traveller is a collection of literary sketches and reminiscences written by Charles Dickens. ", "In 1859 Dickens founded a new journal called All the Year Round and the Uncommercial Traveller articles would be among his main contributions. He seems to have chosen the title and persona of the Uncommercial Traveller as a result of a speech he gave on the 22 December 1859 to the Commercial Travellers' School London in his role as honorary chairman and treasurer. The persona sits well with a writer who liked to travel, not only as a tourist, but also to research and report what he found; visiting Europe, America and giving book readings throughout Britain. ", "Dickens began by writing seventeen episodes, which were printed in All the Year Round between 28 January and 13 October 1860 and these were published in a single edition in 1861. He sporadically produced eleven more articles between 1863-65 and an expanded edition of the work was printed in 1866. Once more he returned to the persona with some more sketches written 1868-69 and a complete set of these articles was published posthumously in 1875."], "author": "Charles Dickens", "num_pages": "363", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6715486-holiday-romance", "num_ratings": "151", "num_reviews": "23", "avg_ratings": 3.39, "genres": ["Classics", "Fiction", "Short Stories", "Holiday", "Christmas", "Literature", "19th Century"], "title": "Holiday Romance", "description": ["A Holiday Romance is a collection of four short interconnected stories written from the point of view of four children. The children are on holiday and are living out their fantasies, which come from all manner of adventure and romance stories and involve everything from weddings to courts martial, to pass the time. With this work, Dickens seeks not only to entertain but t", "A Holiday Romance is a collection of four short interconnected stories written from the point of view of four children. The children are on holiday and are living out their fantasies, which come from all manner of adventure and romance stories and involve everything from weddings to courts martial, to pass the time. With this work, Dickens seeks not only to entertain but to advocate for freedom of imagination and fancy."], "author": "Charles Dickens", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-11 00:00:00", "ISBN": "1406554642"},
{"url": "https://www.goodreads.com/book/show/2311937.No_Thoroughfare_Other_Stories", "num_ratings": "5", "num_reviews": "1", "avg_ratings": 3.4, "genres": [], "title": "No Thoroughfare & Other Stories", "description": ["First serialized in the 1850s and 1860s, these short stories range from humour to social criticism, from satirical bite to high drama. Many of the stories were written in collaboration by the two authors."], "author": "Charles Dickens", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-01-01 00:00:00", "ISBN": "0862998360"},
{"url": "https://www.goodreads.com/book/show/1627387.No_Thoroughfare", "num_ratings": "235", "num_reviews": "36", "avg_ratings": 3.54, "genres": ["Classics", "Fiction", "Literature", "19th Century", "Mystery"], "title": "No Thoroughfare", "description": ["This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally importan", "This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide."], "author": "Charles Dickens", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-11 00:00:00", "ISBN": "1426404972"},
{"url": "https://www.goodreads.com/book/show/2999310-our-mutual-friend--volume-1", "num_ratings": "15", "num_reviews": "3", "avg_ratings": 4.33, "genres": ["Fiction"], "title": "Our Mutual Friend- Volume 1", "description": ["This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally importan", "This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide."], "author": "Charles Dickens", "num_pages": "460", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-11 00:00:00", "ISBN": "1434673340"},
{"url": "https://www.goodreads.com/book/show/22313384-the-signal-man-annotated-charles-dickens", "num_ratings": "1,504", "num_reviews": "144", "avg_ratings": 3.66, "genres": ["Short Stories", "Classics", "Horror", "Fiction", "Gothic", "Literature", "19th Century"], "title": "The Signal Man (Annotated) + Charles Dickens: A Critical Study by G.K. Chesterton", "description": ["“The Signal Man” is a ghost story written by English author Charles Dickens (1812-1870). It was first published in 1866. ", "This edition also contains the beautiful biography “Charles Dickens” written by English writer Gilbert K. Chesterton (1874-1936) in 1906."], "author": "Charles Dickens", "num_pages": "177", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26628749-mrs-lirriper-s-lodgings-mrs-lirriper-s-legacy", "num_ratings": "8", "num_reviews": "1", "avg_ratings": 3.25, "genres": [], "title": "Mrs Lirriper's Lodgings/ Mrs Lirriper's Legacy (Annotated)", "description": ["Whoever would begin to be worried with letting Lodgings that wasn't a lone woman with a living to get is a thing inconceivable to me, my dear; excuse the familiarity, but it comes natural to me in my own little room, when wishing to open my mind to those that I can trust, and I should be truly thankful if they were all mankind"], "author": "Charles Dickens", "num_pages": "90", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-08-24 00:00:00", "ISBN": "1517029740"},
{"url": "https://www.goodreads.com/book/show/27129208-mrs-lirriper-s-lodgings-legacy", "num_ratings": "8", "num_reviews": "1", "avg_ratings": 3.25, "genres": [], "title": "Mrs. Lirriper's Lodgings & Legacy", "description": ["Charles Dickens was an English writer and social critic. He created some of the world's best-known fictional characters and is regarded as the greatest novelist of the Victorian era. His works enjoyed unprecedented popularity during his lifetime, and by the twentieth century critics and scholars had recognised him as a literary genius. His novels and short stories enjoy la", "Charles Dickens was an English writer and social critic. He created some of the world's best-known fictional characters and is regarded as the greatest novelist of the Victorian era. His works enjoyed unprecedented popularity during his lifetime, and by the twentieth century critics and scholars had recognised him as a literary genius. His novels and short stories enjoy lasting popularity. Dickens preferred the style of the 18th century picaresque novels that he found in abundance on his father's shelves. According to Ackroyd, other than these, perhaps the most important literary influence on him was derived from the fables of The Arabian Nights. His writing style is marked by a profuse linguistic creativity. Satire, flourishing in his gift for caricature, is his forte. An early reviewer compared him to Hogarth for his keen practical sense of the ludicrous side of life, though his acclaimed mastery of varieties of class idiom may in fact mirror the conventions of contemporary popular theatre. Dickens worked intensively on developing arresting names for his characters that would reverberate with associations for his readers, and assist the development of motifs in the storyline, giving what one critic calls an \"allegorical impetus\" to the novels' meanings. To cite one of numerous examples, the name Mr. Murdstone in David Copperfield conjures up twin allusions to \"murder\" and stony coldness. His literary style is also a mixture of fantasy and realism. His satires of British aristocratic snobbery-he calls one character the \"Noble Refrigerator\"-are often popular. Comparing orphans to stocks and shares, people to tug boats, or dinner-party guests to furniture are just some of Dickens's acclaimed flights of fancy."], "author": "Charles Dickens", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-09-28 00:00:00", "ISBN": "1517563356"},
{"url": "https://www.goodreads.com/book/show/26186619-somebody-s-luggage", "num_ratings": "116", "num_reviews": "10", "avg_ratings": 3.41, "genres": ["Classics", "Fiction", "Short Stories", "Classics", "Classic Literature"], "title": "Somebody's Luggage (annotated)", "description": ["The writer of these humble lines being a Waiter, and having come of a family of Waiters, and owning at the present time five brothers who are all Waiters, and likewise an only sister who is a Waitress, would wish to offer a few words respecting his calling; first having the pleasure of hereby in a friendly manner offering the Dedication of the same unto JOSEPH, much respec", "The writer of these humble lines being a Waiter, and having come of a family of Waiters, and owning at the present time five brothers who are all Waiters, and likewise an only sister who is a Waitress, would wish to offer a few words respecting his calling; first having the pleasure of hereby in a friendly manner offering the Dedication of the same unto JOSEPH, much respected Head Waiter at the Slamjam Coffee-house, London, E.C., than which a individual more eminently deserving of the name of man, or a more amenable honour to his own head and heart, whether considered in the light of a Waiter or regarded as a human being, do not exist."], "author": "Charles Dickens", "num_pages": "79", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/575841.Somebody_s_Luggage", "num_ratings": "116", "num_reviews": "10", "avg_ratings": 3.41, "genres": ["Classics", "Fiction", "Short Stories", "Classics", "Classic Literature"], "title": "Somebody's Luggage", "description": ["Reprinted in its entirety for the first time since its original publication in 1862, ", " is a rediscovered gem from Dickens's later life.", "Stumbling upon some luggage that has been left behind in the hotel where he works, a waiter searches through it to identify its owner. He fails to discover this, but he does find, secreted away in different parts of the lug", "Reprinted in its entirety for the first time since its original publication in 1862, ", " is a rediscovered gem from Dickens's later life.", "Stumbling upon some luggage that has been left behind in the hotel where he works, a waiter searches through it to identify its owner. He fails to discover this, but he does find, secreted away in different parts of the luggage, quite a number of stories. Impressed by their quality, he succeeds in getting them published, although the identity of their author remains a mystery until a visitor comes calling. Written with Dickens's characteristic wit and descriptive skill—and boasting contributions by eminent Victorian writers Wilkie Collins, Adelaide Anne Procter, and Elizabeth Gaskell—", " is a wonderful composite of tales. Charles Dickens (1812–70) is one of England’s most important literary figures. His works enjoyed enormous success in his day and are still regarded as among the most popular and widely read classics of all time."], "author": "Charles Dickens", "num_pages": "135", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "184391140X"},
{"url": "https://www.goodreads.com/book/show/198323.The_Haunted_House", "num_ratings": "1,045", "num_reviews": "139", "avg_ratings": 3.13, "genres": ["Classics", "Fiction", "Short Stories", "Horror"], "title": "The Haunted House", "description": ["Compiled by Charles Dickens, and counting Elizabeth Gaskell and Wilkie ", "Collins among its contributors,", " is an ingenious tale of the supernatural with touches of pure Dickensian comedy. When the narrator espies a deserted house from his railway carriage, he cannot resist the challenge of taking up residence in a place no one else will inhabit. Local legend h", "Compiled by Charles Dickens, and counting Elizabeth Gaskell and Wilkie ", "Collins among its contributors,", " is an ingenious tale of the supernatural with touches of pure Dickensian comedy. When the narrator espies a deserted house from his railway carriage, he cannot resist the challenge of taking up residence in a place no one else will inhabit. Local legend has terrified the nearby villagers, and they, in turn, convince his servants to abandon ship. Undaunted, he and his sister invite a group of friends to join them. Having shared out the household tasks, the guests are then commissioned to rout out the supernatural from their respective rooms. On Twelfth Night they meet to share their ghostly tales. The result is a feast of lively and bizarre storytelling, uniting the finest in Victorian literary talent. \"As a document of self-revelation, ", " is of the utmost significance for anyone interested in exploring the ", "genius of Charles Dickens.\" - Peter Ackroyd in the Foreword", "Tales included are: ", "Mortals in the House by Charles Dickens ", "Ghost in the Clock Room by Hesba Stretton ", "Ghost in the Double Room by George Augustus Sala ", "Ghost in the Picture Room by Adelaide Anne Procter ", "Ghost in the Cupboard Room by Wilkie Collins ", "Ghost in Master B.'s Room by Charles Dickens ", "Ghost in the Garden Room by Elizabeth Gaskell ", "Ghost in the Corner Room by Charles Dickens"], "author": "Charles Dickens", "num_pages": "126", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-10-12 00:00:00", "ISBN": "0812973062"},
{"url": "https://www.goodreads.com/book/show/9748274-a-tale-of-two-cities-great-expectations", "num_ratings": "15,375", "num_reviews": "190", "avg_ratings": 3.98, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction", "Classics", "Classic Literature", "Historical", "Academic", "School", "Literature", "19th Century", "European Literature", "British Literature", "Literature", "English Literature"], "title": "A Tale of Two Cities / Great Expectations", "description": ["A TALE OF TWO CITIES ", " After eighteen years as a political prisoner in the Bastille, the ageing Doctor Manette is finally released and reunited with his daughter in England. There the lives of the two very different men, Charles Darnay, an exiled French aristocrat, and Sydney", "A TALE OF TWO CITIES ", " After eighteen years as a political prisoner in the Bastille, the ageing Doctor Manette is finally released and reunited with his daughter in England. There the lives of the two very different men, Charles Darnay, an exiled French aristocrat, and Sydney Carton, a disreputable but brilliant English lawyer, become enmeshed through their love for Lucie Manette. From the tranquil roads of London, they are drawn against their will to the vengeful, bloodstained streets of Paris at the height of the Reign of Terror, and they soon fall under the lethal shadow of the guillotine.", "GREAT EXPECTATIONS ", " A terrifying encounter with an escaped convict in a graveyard on the wild Kent marshes; a summons to meet the bitter, decaying Miss Havisham and her beautiful, cold-hearted ward Estella; the sudden generosity of a mysterious benefactor- these form a series of events that changes the orphaned Pip's life forever, and he eagerly abandons his humble origins to begin a new life as a gentleman. Dickens's haunting late novel depicts Pip's education and development through adversity as he discovers the true nature of his \"great expectations.\"", "This deluxe paperback edition features ", " *French flaps ", " *rough-cut high-quality paper ", " *complimentary front- and back-cover designs highlighting each novel and including foil and debossing"], "author": "Charles Dickens", "num_pages": "834", "awards": [], "places": ["United Kingdom"], "character_names": [], "language": "English", "publish_date": "2010-12-06 00:00:00", "ISBN": "0142196584"},
{"url": "https://www.goodreads.com/book/show/27804524-the-lazy-tour-of-two-idle-apprentices", "num_ratings": "137", "num_reviews": "23", "avg_ratings": 3.39, "genres": ["Classics", "Fiction", "Travel", "Short Stories", "Literature", "19th Century"], "title": "The Lazy Tour of Two Idle Apprentices", "description": ["Charles John Huffam Dickens was an English writer and social critic. He created some of the world's best-known fictional characters and is regarded as the greatest novelist of the Victorian era. His works enjoyed unprecedented popularity during his lifetime, and by the twentieth century critics and scholars had recognised him as a literary genius. His novels and short stor", "Charles John Huffam Dickens was an English writer and social critic. He created some of the world's best-known fictional characters and is regarded as the greatest novelist of the Victorian era. His works enjoyed unprecedented popularity during his lifetime, and by the twentieth century critics and scholars had recognised him as a literary genius. His novels and short stories enjoy lasting popularity."], "author": "Charles Dickens", "num_pages": "103", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1037106.The_Lazy_Tour_Of_Two_Idle_Apprentices", "num_ratings": "137", "num_reviews": "23", "avg_ratings": 3.39, "genres": ["Classics", "Fiction", "Travel", "Short Stories", "Literature", "19th Century"], "title": "The Lazy Tour Of Two Idle Apprentices", "description": [" In autumn 1857, Charles Dickens embarked on a sightseeing trip to Cumberland with his friend, the rising star of literature Wilkie Collins. Writing together, they reported their adventures for Dickens' periodical ", ", producing a showcase of both", " In autumn 1857, Charles Dickens embarked on a sightseeing trip to Cumberland with his friend, the rising star of literature Wilkie Collins. Writing together, they reported their adventures for Dickens' periodical ", ", producing a showcase of both long-cherished and entirely novel sides of these well-loved men of letters. Boasting two ghost stories from undisputed masters of the genre, it also uniquely demonstrates their glee in caricaturing themselves and one another—Collins assumes the identity of Thomas Idle (a born-and-bred idler) and Dickens that of Francis Goodchild (laboriously idle). Through their fictional counterparts, the men relentlessly satirize Dickens' maniacal energy and Collins' idleness. The result is an exuberant diary of a journey and a rare insight into one of literature's most famed and intriguing friendships."], "author": "Charles Dickens", "num_pages": "111", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2004-05-31 00:00:00", "ISBN": "1576467120"},
{"url": "https://www.goodreads.com/book/show/12691331-the-holly-tree-inn-and-a-christmas-tree", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 4.0, "genres": ["Fiction"], "title": "The Holly Tree Inn, and a Christmas Tree", "description": ["This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into pri", "This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book."], "author": "Charles Dickens", "num_pages": "170", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-07-28 00:00:00", "ISBN": "1176300954"},
{"url": "https://www.goodreads.com/book/show/25573493-the-holly-tree-inn", "num_ratings": "116", "num_reviews": "6", "avg_ratings": 3.32, "genres": ["Classics", "Fiction", "Short Stories", "European Literature", "British Literature"], "title": "The Holly-Tree Inn (Annotated)", "description": ["“The Holly-Tree Inn” is a short story written by English author Charles Dickens (1812-1870). First published in 1855, it is a tale on travel and loneliness. ", "This edition also contains the beautiful biography “Charles Dickens” written by English writer Gilbert K. Chesterton (1874-1936) in 1906."], "author": "Charles Dickens", "num_pages": "52", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/949025.David_Copperfield_Volume_I_of_II", "num_ratings": "519", "num_reviews": "28", "avg_ratings": 4.16, "genres": ["Fiction", "Classics", "Literature"], "title": "David Copperfield, Volume I of II", "description": ["Throughout his long writing life, Dickens sought to tell his own story, over and over. It is a story of a young man who, born into confusion, eventually makes order of his own life -- usually despite, rather than because of, his family heritage. Perhaps the greatest of Dickens' orphans, David Copperfield is a happy child, living with his kind and gentle mother and nurse Pe", "Throughout his long writing life, Dickens sought to tell his own story, over and over. It is a story of a young man who, born into confusion, eventually makes order of his own life -- usually despite, rather than because of, his family heritage. Perhaps the greatest of Dickens' orphans, David Copperfield is a happy child, living with his kind and gentle mother and nurse Peggotty, until his mother remarries. Unfortunately for David, his stepfather is the hard, cruel Mr. Murdstone, who brings his dark, life-crushing eminence into David's home, along with his equally cold and unyielding sister, Miss Murdstone. David's mother is powerless to stop their cruelties toward her young son -- and after one of literature's most-satisfying bites, David is sent away. After an idyllic visit with Peggotty's family at their upside-down boat house beside the sea, where David befriends dear little Em'ly, one of Dickens' most beloved characters, David is sent away to school. At school, he meets the formative friends of his life -- the ambiguous and handsome Steerforth, and the unlikely future hero, Tommy Traddles. After his frail mother's death, David once again returns home, where he makes the acquaintance of another of Dickens' great characters -- the improvident Mr. Micawber, he of many children -- loosely based on Dickens' own financially-incompetent father. After experiencing the chaos of the Micawber house, David then finds his outspoken aunt, Betsy Trotwood, and through her, meets Agnes Wickfield -- the young woman who eventually becomes his \"bright star, ever pointing upward.\" At this point, returning to school, David encounters the oily, hand-wringing, cringing Uriah Heep -- and no one's life will be the same again."], "author": "Charles Dickens", "awards": [], "places": ["United Kingdom"], "character_names": [], "language": "English", "publish_date": "2007-02-01 00:00:00", "ISBN": "1603120548"},
{"url": "https://www.goodreads.com/book/show/31247.A_Christmas_Carol_and_Other_Christmas_Books", "num_ratings": "670", "num_reviews": "99", "avg_ratings": 4.0, "genres": ["Classics", "Fiction", "Short Stories", "Holiday", "Christmas"], "title": "A Christmas Carol and Other Christmas Books", "description": [" has gripped the public imagination since it was first published in 1843, and it is now as much a part of the holiday season as is mistletoe or Santa's reindeer. Here is a wonderful collection of Dickens' Christmas stories, graced with many of the original drawings that appeared in the first edition. Pride of place goes to ", ", of course, but", " has gripped the public imagination since it was first published in 1843, and it is now as much a part of the holiday season as is mistletoe or Santa's reindeer. Here is a wonderful collection of Dickens' Christmas stories, graced with many of the original drawings that appeared in the first edition. Pride of place goes to ", ", of course, but the book also includes four other marvelous tales: ", ". All five stories show Dickens at his unpredictable best, jumbling together comedy and melodrama, genial romance and urgent social satire. The volume also features an excellent introduction by Robert Douglas-Fairhurst, who offers invaluable background to the Christmas stories, illuminating the social questions they address, outlining their reception and the enduring popularity of ", " and highlighting how their style and themes resonate in more complex ways in his major fictions. In addition, the book includes two appendices containing Dickens's article, ", " and facsimile pages from Dickens's reading version of ", "."], "author": "Charles Dickens", "num_pages": "438", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-11-01 00:00:00", "ISBN": "0192806947"},
{"url": "https://www.goodreads.com/book/show/24069874-christmas-stories", "num_ratings": "832", "num_reviews": "114", "avg_ratings": 3.26, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Horror", "Short Stories"], "title": "Christmas Stories : The Haunted Man and the Ghost's Bargain by Charles Dickens(Exclusive Bonus Features)(Annotated)", "description": [" Christmas Stories : The Haunted Man and the Ghost's Bargain by Charles Dickens(Exclusive Bonus Features)(Annotated) ", " FREE FOR KINDLE UNLIMITED NOW ", " ", "Bonus ", " - Charles DickensBiography", " - Charles Dickens Facts", " - And more Bonus "], "author": "Charles Dickens", "num_pages": "124", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2122753.A_Christmas_Carol_The_Cricket_on_the_Hearth", "num_ratings": "56", "num_reviews": "9", "avg_ratings": 3.98, "genres": ["Fiction"], "title": "A Christmas Carol / The Cricket on the Hearth", "description": ["A Christmas Carol", "Renowned for his penny-pinching ways, Scrooge's magical encounters with the Ghosts of Christmas Past, Present and Future result in a delightful surprise for Tiny Tim and the whole Crachit family.", "The Cricket on the Hearth", "The fairy-like influence of the cricket helps solve a misunderstanding that threatens to upset the happiness of John Peerybingle, and his", "A Christmas Carol", "Renowned for his penny-pinching ways, Scrooge's magical encounters with the Ghosts of Christmas Past, Present and Future result in a delightful surprise for Tiny Tim and the whole Crachit family.", "The Cricket on the Hearth", "The fairy-like influence of the cricket helps solve a misunderstanding that threatens to upset the happiness of John Peerybingle, and his young wife Dot."], "author": "Charles Dickens", "num_pages": "199", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1981-08-12 00:00:00", "ISBN": "0706415612"},
{"url": "https://www.goodreads.com/book/show/18685251-master-humphrey-s-clock-volume-three", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Master Humphrey's Clock. Volume Three", "description": ["Volume 3 of a set of three volumes, 1st Editions of Master Humphreys Clock (1840/41). Containing The Olde Curiosity Shop, Barnaby Rudge and Master Humphrey's Clock."], "author": "Charles Dickens", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1841-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4789521-esquisses-de-boz---martin-chuzzlewit", "num_ratings": "13,351", "num_reviews": "488", "avg_ratings": 3.83, "genres": ["Classics", "Fiction", "Literature"], "title": "Esquisses de Boz - Martin Chuzzlewit", "description": ["While writing ", " - his sixth novel - Dickens declared it 'immeasurably the best of my stories.' He was already famous as the author of ", " and ", " . Set partly in America, which Dickens had visited in 1842, the novel includes a searing satire on the United States. Martin Chuzzlewit is the story of two Chuzzlewits, Martin and Jonas, w", "While writing ", " - his sixth novel - Dickens declared it 'immeasurably the best of my stories.' He was already famous as the author of ", " and ", " . Set partly in America, which Dickens had visited in 1842, the novel includes a searing satire on the United States. Martin Chuzzlewit is the story of two Chuzzlewits, Martin and Jonas, who have inherited the characteristic Chuzzlewit selfishness. It contrasts their diverse fates of moral redemption and worldly success for one, with increasingly desperate crime for the other. This powerful black comedy involves hypocrisy, greed and blackmail, as well as the most famous of Dickens's grotesques, Mrs Gamp."], "author": "Charles Dickens", "num_pages": "1808", "awards": [], "places": [], "character_names": ["Martin Chuzzlewit", "Mr. Pecksniff", "Mrs. Sarah Gamp"], "language": "French", "publish_date": "1986-09-25 00:00:00", "ISBN": "2070111105"},
{"url": "https://www.goodreads.com/book/show/26628651-master-humphrey-s-clock", "num_ratings": "167", "num_reviews": "16", "avg_ratings": 3.27, "genres": ["Classics", "Fiction", "Short Stories"], "title": "Master Humphrey's Clock (Annotated)", "description": ["I am not a churlish old man. Friendless I can never be, for all mankind are my kindred, and I am on ill terms with no one member of my great family. But for many years I have led a lonely, solitary life; - what wound I sought to heal, what sorrow to forget, originally, matters not now; it is sufficient that retirement has become a habit with me, and that I am unwilling to", "I am not a churlish old man. Friendless I can never be, for all mankind are my kindred, and I am on ill terms with no one member of my great family. But for many years I have led a lonely, solitary life; - what wound I sought to heal, what sorrow to forget, originally, matters not now; it is sufficient that retirement has become a habit with me, and that I am unwilling to break the spell which for so long a time has shed its quiet influence upon my home and heart."], "author": "Charles Dickens", "num_pages": "130", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-08-24 00:00:00", "ISBN": "151702479X"},
{"url": "https://www.goodreads.com/book/show/330017.Master_Humphrey_s_Clock_and_a_Child_s_History_of_England", "num_ratings": "22", "num_reviews": "7", "avg_ratings": 3.95, "genres": ["Classics", "History"], "title": "Master Humphrey's Clock and a Child's History of England", "description": ["This volume combines two titles of great biographical interest. The weekly miscellany, ", " besides providing the original setting for ", " and ", " was the scene of Dickens's revival of Mr. Pickwick and the Wellers. ", " is not representative of Victorian schoolroom history: filled with distrust for t", "This volume combines two titles of great biographical interest. The weekly miscellany, ", " besides providing the original setting for ", " and ", " was the scene of Dickens's revival of Mr. Pickwick and the Wellers. ", " is not representative of Victorian schoolroom history: filled with distrust for the 'good old days,' writes Derek Hudson in the Introduction, it gives 'an unsparing picture of prolongued wickedness in high places, exposed with lurid detail and much rough sarcasm.'"], "author": "Charles Dickens", "num_pages": "544", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-10-22 00:00:00", "ISBN": "0192545205"},
{"url": "https://www.goodreads.com/book/show/2909729-the-pickwick-papers-volume-i", "num_ratings": "171", "num_reviews": "9", "avg_ratings": 3.93, "genres": ["Classics", "Fiction"], "title": "The Pickwick Papers, Volume I", "description": ["Charles John Huffam Dickens (1812-1870), also known as \"Boz,\" was the foremost English novelist of the Victorian era, as well as a vigorous social campaigner. Considered one of the English language's greatest writers, he was acclaimed for his rich storytelling and memorable characters, and achieved massive worldwide popularity in his lifetime. The popularity of his novels", "Charles John Huffam Dickens (1812-1870), also known as \"Boz,\" was the foremost English novelist of the Victorian era, as well as a vigorous social campaigner. Considered one of the English language's greatest writers, he was acclaimed for his rich storytelling and memorable characters, and achieved massive worldwide popularity in his lifetime. The popularity of his novels and short stories has meant that not one has ever gone out of print. Dickens wrote serialised novels, the usual format for fiction at the time, and each new part of his stories was eagerly anticipated by the reading public. Among his best-known works are Sketches by Boz (1836), The Pickwick Papers (1837), Oliver Twist (1838), Nicholas Nickleby (1839), Barnaby Rudge (1841), A Christmas Carol (1843), Martin Chuzzlewit (1844), David Copperfield (1850), Bleak House (1853), Little Dorrit (1857), A Tale of Two Cities (1859), Great Expectations (1861) and Our Mutual Friend (1865)."], "author": "Charles Dickens", "num_pages": "444", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-11 00:00:00", "ISBN": "1406554855"},
{"url": "https://www.goodreads.com/book/show/2909728-the-pickwick-papers-vol-2", "num_ratings": "101", "num_reviews": "5", "avg_ratings": 4.0, "genres": ["Fiction"], "title": "The Pickwick Papers, Vol 2", "description": ["Charles John Huffam Dickens (1812-1870), also known as \"Boz,\" was the foremost English novelist of the Victorian era, as well as a vigorous social campaigner. Considered one of the English language's greatest writers, he was acclaimed for his rich storytelling and memorable characters, and achieved massive worldwide popularity in his lifetime. The popularity of his novels", "Charles John Huffam Dickens (1812-1870), also known as \"Boz,\" was the foremost English novelist of the Victorian era, as well as a vigorous social campaigner. Considered one of the English language's greatest writers, he was acclaimed for his rich storytelling and memorable characters, and achieved massive worldwide popularity in his lifetime. The popularity of his novels and short stories has meant that not one has ever gone out of print. Dickens wrote serialised novels, the usual format for fiction at the time, and each new part of his stories was eagerly anticipated by the reading public. Among his best-known works are Sketches by Boz (1836), The Pickwick Papers (1837), Oliver Twist (1838), Nicholas Nickleby (1839), Barnaby Rudge (1841), A Christmas Carol (1843), Martin Chuzzlewit (1844), David Copperfield (1850), Bleak House (1853), Little Dorrit (1857), A Tale of Two Cities (1859), Great Expectations (1861) and Our Mutual Friend (1865)."], "author": "Charles Dickens", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-11 00:00:00", "ISBN": "1406554863"},
{"url": "https://www.goodreads.com/book/show/8348825-speeches-letters-and-sayings-of-charles-dickens", "num_ratings": "9", "num_reviews": "1", "avg_ratings": 4.11, "genres": ["Classics", "Nonfiction"], "title": "Speeches, Letters and Sayings of Charles Dickens", "description": ["Charles John Huffam Dickens (1812-1870), also known as \"Boz,\" was the foremost English novelist of the Victorian era, as well as a vigorous social campaigner. Considered one of the English language's greatest writers, he was acclaimed for his rich storytelling and memorable characters, and achieved massive worldwide popularity in his lifetime. The popularity of his novels", "Charles John Huffam Dickens (1812-1870), also known as \"Boz,\" was the foremost English novelist of the Victorian era, as well as a vigorous social campaigner. Considered one of the English language's greatest writers, he was acclaimed for his rich storytelling and memorable characters, and achieved massive worldwide popularity in his lifetime. The popularity of his novels and short stories has meant that not one has ever gone out of print. Dickens wrote serialised novels, the usual format for fiction at the time, and each new part of his stories was eagerly anticipated by the reading public. Among his best-known works are Sketches by Boz (1836), The Pickwick Papers (1837), Oliver Twist (1838), Nicholas Nickleby (1839), Barnaby Rudge (1841), A Christmas Carol (1843), Martin Chuzzlewit (1844), David Copperfield (1850), Bleak House (1853), Little Dorrit (1857), A Tale of Two Cities (1859), Great Expectations (1861) and Our Mutual Friend (1865)."], "author": "Charles Dickens", "num_pages": "148", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-12-18 00:00:00", "ISBN": "0898756332"},
{"url": "https://www.goodreads.com/book/show/5342.The_Life_of_Our_Lord", "num_ratings": "1,706", "num_reviews": "357", "avg_ratings": 4.0, "genres": ["Classics", "Religion", "Holiday", "Christmas", "Nonfiction", "Childrens"], "title": "The Life of Our Lord: Written for His Children During the Years 1846 to 1849", "description": ["In this charming, simple retelling of the life of Jesus Christ, adapted from the Gospel of St. Luke, Dickens hoped to teach his young children about religion and faith. Author: Charles DickensFormat: 128 pages, HardcoverPublisher: Simon Schuster (November 9, 1999) ISBN: 978-0684865379"], "author": "Charles Dickens", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-11-09 00:00:00", "ISBN": "0684865378"},
{"url": "https://www.goodreads.com/book/show/13385143-londoner-skizzen", "num_ratings": "1,040", "num_reviews": "79", "avg_ratings": 3.72, "genres": ["Fiction", "Short Stories", "Classics", "Historical", "Victorian", "European Literature", "British Literature"], "title": "Londoner Skizzen (Sketches by Boz)", "description": ["Dieses Werk ist Teil der Buchreihe TREDITION CLASSICS. Der Verlag tredition aus Hamburg ver ffentlicht in der Buchreihe TREDITION CLASSICS Werke aus mehr als zwei Jahrtausenden. Diese waren zu einem Gro teil vergriffen oder nur noch antiquarisch erh ltlich. Mit der Buchreihe TREDITION CLASSICS verfolgt tredition das Ziel, tausende Klassiker der Weltliteratur verschiedener", "Dieses Werk ist Teil der Buchreihe TREDITION CLASSICS. Der Verlag tredition aus Hamburg ver ffentlicht in der Buchreihe TREDITION CLASSICS Werke aus mehr als zwei Jahrtausenden. Diese waren zu einem Gro teil vergriffen oder nur noch antiquarisch erh ltlich. Mit der Buchreihe TREDITION CLASSICS verfolgt tredition das Ziel, tausende Klassiker der Weltliteratur verschiedener Sprachen wieder als gedruckte B cher zu verlegen - und das weltweit! Die Buchreihe dient zur Bewahrung der Literatur und F rderung der Kultur. Sie tr gt so dazu bei, dass viele tausend Werke nicht in Vergessenheit geraten."], "author": "Charles Dickens", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "German", "publish_date": "2012-05-08 00:00:00", "ISBN": "3842418175"},
{"url": "https://www.goodreads.com/book/show/338536.American_Notes_and_Pictures_from_Italy", "num_ratings": "54", "num_reviews": "8", "avg_ratings": 3.37, "genres": ["Travel", "Classics", "Nonfiction", "Literature", "19th Century"], "title": "American Notes and Pictures from Italy", "description": ["Dickens went to America in 1842 expecting to find a brave new world whose institutions embodied his own political views. The Americans expected him to extol their new nation. Dickens, however, became deeply disturbed by American culture. American Notes attempts to portray fairly the young Republic's new cities, strange landscapes and bustling people, but is coloured by Dic", "Dickens went to America in 1842 expecting to find a brave new world whose institutions embodied his own political views. The Americans expected him to extol their new nation. Dickens, however, became deeply disturbed by American culture. American Notes attempts to portray fairly the young Republic's new cities, strange landscapes and bustling people, but is coloured by Dicken's doubts about the failings of democratic politics in an egalitarian society."], "author": "Charles Dickens", "num_pages": "454", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-10-22 00:00:00", "ISBN": "0192545191"},
{"url": "https://www.goodreads.com/book/show/5391184-memoirs-of-joseph-grimaldi", "num_ratings": "20", "num_reviews": "3", "avg_ratings": 3.75, "genres": ["Nonfiction", "Classics", "Biography", "European Literature", "British Literature"], "title": "Memoirs of Joseph Grimaldi (Pushkin Collection)", "description": ["Joseph Grimald (1778 - 1837), one of the greatest English clowns and pantomimes of all time, was born in London to an Italian ballet-master and a dancer in the theatre’s corps-de-ballet. The death of Grimaldi’s father when he was nine plunged the family into debt. He was introduced to the stage at the age of two and began performing at the Sadler’s Wells theatre at the age", "Joseph Grimald (1778 - 1837), one of the greatest English clowns and pantomimes of all time, was born in London to an Italian ballet-master and a dancer in the theatre’s corps-de-ballet. The death of Grimaldi’s father when he was nine plunged the family into debt. He was introduced to the stage at the age of two and began performing at the Sadler’s Wells theatre at the age of three.", "Grimaldi’s fame as a pantomime clown was unequalled and he is credited as an innovator. He introduced the tradition of audience participation, of poking fun at spectators, and presented to the world in his performance as Joey, the modern clown as a central character. He was the original 'Clown Joey', the term 'Joey' being used to describe clowns since his day. Of his own name he punned 'I am grim all day-but I make you laugh at night!' Yet he died a poor and physically crippled man.", "A memorial service is held every year in Hackney on the first Sunday joined by hundreds of clowns from all over the world and followed by a show for children.", "In 1837 Charles Dickens, then twenty-five years old, was asked to ‘tidy up’ Grimaldi’s autobiography. He ended up re-writing most of it and the result is a work comparable to Dickens’s famous early successes, ", " and ", ", both of which had appeared the year before."], "author": "Charles Dickens", "num_pages": "360", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-01 00:00:00", "ISBN": "1901285944"},
{"url": "https://www.goodreads.com/book/show/400866.American_Notes_For_General_Circulation", "num_ratings": "650", "num_reviews": "91", "avg_ratings": 3.56, "genres": ["Classics", "Nonfiction", "Travel", "History"], "title": "American Notes For General Circulation", "description": [" When Charles Dickens set out for America in 1842 he was the most famous man of his day to travel there - curious about the revolutionary new civilization that had captured the English imagination. His frank and often humorous descriptions cover everything from h", " When Charles Dickens set out for America in 1842 he was the most famous man of his day to travel there - curious about the revolutionary new civilization that had captured the English imagination. His frank and often humorous descriptions cover everything from his comically wretched sea voyage to his sheer astonishment at the magnificence of the Niagara Falls, while he also visited hospitals, prisons and law courts and found them exemplary. But Dickens's opinion of America as a land ruled by money, built on slavery, with a corrupt press and unsavoury manners, provoked a hostile reaction on both sides of the Atlantic. ", " is an illuminating account of a great writer's revelatory encounter with the New World. In her introduction, Patricia Ingham examines the response the book received when it was published, and compares it with similar travel writings of the period and with Dickens's fiction, in particular", ". This edition includes an updated chronology, appendices and notes. ", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."], "author": "Charles Dickens", "num_pages": "312", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-07-01 00:00:00", "ISBN": "0140436499"},
{"url": "https://www.goodreads.com/book/show/6125261-the-village-coquettes", "num_ratings": "7", "num_reviews": "1", "avg_ratings": 3.0, "genres": ["Drama", "Fiction", "Classics"], "title": "The Village Coquettes: An Operatic Burletta in Two Acts (1883)", "description": ["This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most impor", "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work. This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.As a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant."], "author": "Charles Dickens", "num_pages": "24", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-11-01 00:00:00", "ISBN": "0548695172"},
{"url": "https://www.goodreads.com/book/show/8146674-reprinted-pieces-and-the-lazy-tour-of-two-idle-apprentices", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "Reprinted Pieces and the Lazy Tour of Two Idle Apprentices", "description": ["This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into pri", "This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book."], "author": "Charles Dickens", "num_pages": "446", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-02-24 00:00:00", "ISBN": "1145514804"},
{"url": "https://www.goodreads.com/book/show/11426642-edwin-drood-and-reprinted-pieces", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.5, "genres": [], "title": "Edwin Drood, and Reprinted Pieces", "description": ["Publisher: London : Chapman", "Reprinted pieces consists of works that were originally published in Household words, 1850-1856"], "author": "Charles Dickens", "num_pages": "350", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-03 00:00:00", "ISBN": "1152642731"},
{"url": "https://www.goodreads.com/book/show/14444384-selections-from-sketches-by-boz-unabridged-selections", "num_ratings": "2", "num_reviews": "2", "avg_ratings": 3.5, "genres": [], "title": "Selections from Sketches by Boz (Unabridged Selections) (Naxos Classic Fiction)", "description": ["Dickens's renowned skill for keen social observation and, more specifically, his incredibly detailed knowledge of London and its theatres, prisons and inns is perfectly released in Sketches by Boz. Many of the themes he goes on to explore in his great novels are foreshadowed in this early collection of short accounts that centre on London and its inhabitants."], "author": "Charles Dickens", "num_pages": "4", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-30 00:00:00", "ISBN": "1843796007"},
{"url": "https://www.goodreads.com/book/show/20529032-little-dorrit", "num_ratings": "9", "num_reviews": "1", "avg_ratings": 4.0, "genres": [], "title": "Little Dorrit: II (Little Dorrit, #2)", "description": ["All texts are based on the Clarendon Edition of the Works of Charles Dickens."], "author": "Charles Dickens", "num_pages": "498", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1970-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20528999-little-dorrit", "num_ratings": "82", "num_reviews": "12", "avg_ratings": 3.82, "genres": ["Classics", "Fiction", "Romance"], "title": "Little Dorrit: I (Little Dorrit, #1)", "description": ["Little Dorrit was a serial novel by Charles Dickens published originally between 1855 and 1857. It is a work of satire on the shortcomings of the government and society of the period. Much of Dickens' ire is focused upon the institutions of debtors' prisons, in which people who owed money were imprisoned, unable to work, until they repaid their debts. The representative pr", "Little Dorrit was a serial novel by Charles Dickens published originally between 1855 and 1857. It is a work of satire on the shortcomings of the government and society of the period. Much of Dickens' ire is focused upon the institutions of debtors' prisons, in which people who owed money were imprisoned, unable to work, until they repaid their debts. The representative prison in this case is the Marshalsea where the author's own father had been imprisoned. Most of Dickens' other critiques in this particular novel concern the social safety net: industry, and the treatment and safety of workers; the bureaucracy of the British Treasury, and the separation of people based on the lack of communication between the classes."], "author": "Charles Dickens", "num_pages": "533", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1970-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7022501-bleak-house-volume-i", "num_ratings": "122", "num_reviews": "12", "avg_ratings": 4.25, "genres": ["Classics", "Fiction"], "title": "Bleak House, Volume I", "description": ["This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally importan", "This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide."], "author": "Charles Dickens", "num_pages": "556", "awards": [], "places": [], "character_names": ["Miss Esther Summerson", "Mr. Richard Carstone", "Miss Ada Clare", "Mr. John Jarndyce", "Mr. Harold Skimpole", "Mr. Lawrence Boythorn", "Mr. Kenge", "Mr. Snagsby", "Mrs. Snagsby", "Guster", "Miss Flite", "Mr. William Guppy", "Mr. Bucket", "Mrs. Jellyby", "Peepy Jellyby", "Caddy Jellyby", "Mr. Krook", "Mr. Bayham Badger", "Mrs. Bayham Badger"], "language": "English", "publish_date": "2009-04-30 00:00:00", "ISBN": "0559069944"},
{"url": "https://www.goodreads.com/book/show/7550026-the-complete-works-of-charles-dickens-in-30-volumes-illustrated", "num_ratings": "10", "num_reviews": "2", "avg_ratings": 4.1, "genres": ["Fiction"], "title": "The Complete Works of Charles Dickens (in 30 Volumes, Illustrated): Martin Chuzzlewit, Vol. I", "description": ["It is impossible to overstate the importance of British novelist CHARLES DICKENS (1812-1870) not only to literature in the English language, but to Western civilization on the whole. He is arguably the first fiction writer to have become an international celebrity. He popularized episodic fiction and the cliffhanger, which had a profound influence on the development of fil", "It is impossible to overstate the importance of British novelist CHARLES DICKENS (1812-1870) not only to literature in the English language, but to Western civilization on the whole. He is arguably the first fiction writer to have become an international celebrity. He popularized episodic fiction and the cliffhanger, which had a profound influence on the development of film and television. He is entirely responsible for the popular image of Victorian London that still lingers today, and his characters-from Oliver Twist to Ebenezer Scrooge, from Miss Havisham to Uriah Heep-have become not merely iconic, but mythic. But it was his stirring portraits of ordinary people-not the upper classes or the aristocracy-and his fervent cries for social, moral, and legal justice for the working poor, and in particular for poor children, in the grim early decades of the Industrial Revolution that powerfully impacted social concerns well into the 20th century. Without Charles Dickens, we may never have seen the likes of Sherlock Holmes, Upton Sinclair, or even Bob Dylan. Here, in 30 beautiful volumes-complete with all the original illustrations-is every published word written by one of the most important writers ever. The essential collector's set will delight anyone who cherishes English literature...and who takes pleasure in constantly rediscovering its joys. This volume contains Part I of The Life and Adventures of Martin Chuzzlewit, which was originally serialized in standalone installments in 1843-44. The work Dickens considered his best, it is a satire on selfishness, revolving around the Chuzzlewit family, and is notable for what is perceived by some as anti-American attitudes, though Dickens intended his less than positive depictions of Americans as satirical, too."], "author": "Charles Dickens", "num_pages": "460", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-11-01 00:00:00", "ISBN": "1616400056"},
{"url": "https://www.goodreads.com/book/show/7549981-the-complete-works-of-charles-dickens-in-30-volumes-illustrated", "num_ratings": "9", "num_reviews": "2", "avg_ratings": 3.78, "genres": ["Classics"], "title": "The Complete Works of Charles Dickens (in 30 Volumes, Illustrated): Martin Chuzzlewit, Vol. II", "description": ["It is impossible to overstate the importance of British novelist CHARLES DICKENS (1812-1870) not only to literature in the English language, but to Western civilization on the whole. He is arguably the first fiction writer to have become an international celebrity. He popularized episodic fiction and the cliffhanger, which had a profound influence on the development of fil", "It is impossible to overstate the importance of British novelist CHARLES DICKENS (1812-1870) not only to literature in the English language, but to Western civilization on the whole. He is arguably the first fiction writer to have become an international celebrity. He popularized episodic fiction and the cliffhanger, which had a profound influence on the development of film and television. He is entirely responsible for the popular image of Victorian London that still lingers today, and his characters-from Oliver Twist to Ebenezer Scrooge, from Miss Havisham to Uriah Heep-have become not merely iconic, but mythic. But it was his stirring portraits of ordinary people-not the upper classes or the aristocracy-and his fervent cries for social, moral, and legal justice for the working poor, and in particular for poor children, in the grim early decades of the Industrial Revolution that powerfully impacted social concerns well into the 20th century. Without Charles Dickens, we may never have seen the likes of Sherlock Holmes, Upton Sinclair, or even Bob Dylan. Here, in 30 beautiful volumes-complete with all the original illustrations-is every published word written by one of the most important writers ever. The essential collector's set will delight anyone who cherishes English literature...and who takes pleasure in constantly rediscovering its joys. This volume contains Part II of The Life and Adventures of Martin Chuzzlewit, which was originally serialized in standalone installments in 1843-44. The work Dickens considered his best, it is a satire on selfishness, revolving around the Chuzzlewit family, and is notable for what is perceived by some as anti-American attitudes, though Dickens intended his less than positive depictions of Americans as satirical, too."], "author": "Charles Dickens", "num_pages": "452", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-11-30 00:00:00", "ISBN": "1616400080"},
{"url": "https://www.goodreads.com/book/show/3099835-the-cricket-on-the-hearth-doctor-marigold", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 4.33, "genres": ["Classics", "Classic Literature"], "title": "The Cricket on the Hearth & Doctor Marigold", "author": "Charles Dickens", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-12-17 00:00:00", "ISBN": "8184562314"},
{"url": "https://www.goodreads.com/book/show/752944.The_Cricket_on_the_Hearth_and_Other_Christmas_Stories", "num_ratings": "101", "num_reviews": "11", "avg_ratings": 3.5, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Literature"], "title": "The Cricket on the Hearth and Other Christmas Stories", "description": ["Dickens's delightful evocations of a Victorian Christmas include the title story, a heartwarming fable of home life; \"The Holly-Tree,\" concerning love reclaimed at a country inn; and \"The Haunted House,\" an entertaining account of a belligerent ghost. Combining realism and fantasy, these tales attest to their author's flair for characterization and the picturesque."], "author": "Charles Dickens", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-20 00:00:00", "ISBN": "048628039X"},
{"url": "https://www.goodreads.com/book/show/1196117.The_Old_Curiosity_Shop_Vol_2", "num_ratings": "36", "num_reviews": "3", "avg_ratings": 3.64, "genres": ["Classics", "Fiction"], "title": "The Old Curiosity Shop, Vol 2", "description": ["This volume is produced from digital images created through the University of Michigan University Library's preservation reformatting program."], "author": "Charles Dickens", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-12-20 00:00:00", "ISBN": "1425530915"},
{"url": "https://www.goodreads.com/book/show/2284055.The_Life_and_Adventures_of_Nicholas_Nickleby_Volume_1", "num_ratings": "81", "num_reviews": "3", "avg_ratings": 3.88, "genres": ["Fiction", "Classics"], "title": "The Life and Adventures of Nicholas Nickleby- Volume 1", "description": ["This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally importan", "This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide."], "author": "Charles Dickens", "num_pages": "504", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-05-29 00:00:00", "ISBN": "1434673332"},
{"url": "https://www.goodreads.com/book/show/60773.The_Adventures_of_Oliver_Twist_A_Child_s_History_of_England", "num_ratings": "24", "num_reviews": "1", "avg_ratings": 4.25, "genres": ["Classics", "Fiction", "European Literature", "British Literature"], "title": "The Adventures of Oliver Twist/A Child's History of England", "description": ["\"Oh you really expect him to come back, do you?\" inquired Mr. Grimwig. \"Don't you?\" asked Mr. Brownlow, smiling. The spirit of contradiction was strong in Mr. Grimwig's breast, at the moment; and it was rendered stronger by his friend's confident smile. \"No,\" he said, smiting the table with his fist, \"I do not. The boy has a new suit of clothes on his back, a set of valuab", "\"Oh you really expect him to come back, do you?\" inquired Mr. Grimwig. \"Don't you?\" asked Mr. Brownlow, smiling. The spirit of contradiction was strong in Mr. Grimwig's breast, at the moment; and it was rendered stronger by his friend's confident smile. \"No,\" he said, smiting the table with his fist, \"I do not. The boy has a new suit of clothes on his back, a set of valuable books under his arm, and a five-pound note in his pocket. He'll join his old friends the thieves, and laugh at you. If ever that boy returns to this house, sir, I'll eat my head.\" -from Chapter XIV In February 1837, the new British magazine Bentley's Miscellany published the first installment in a serial story written by its editor. Its star was a good-hearted orphan boy; its author was Charles Dickens; and by the time it concluded in March 1839, Oliver Twist would become one of the most beloved of Dickens' novels. First published in book form in 1838, it has never been out of print, and little wonder: it is the classic rags-to-riches story, and a foundation of modern popular fiction that is required and highly enjoyable reading for all lovers of literature. Also in this volume: Dickens' A Child's History of England, a charming survey of the story of the Sceptred Isle from the time of the Romans through the 1830s. Simply written but wide-ranging, it's a delightful read for Dickens devotees. British author CHARLES DICKENS (1812-1870) remains one of the most popular writers in the world. A spinner of stories of satire and social criticism-including Great Expectations, Nicholas Nickleby, A Tale of Two Cities, A Christmas Carol, and the work considered his greatest, David Copperfield-his writings have entertainedgenerations of readers and influenced generations of writers."], "author": "Charles Dickens", "num_pages": "656", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-12-01 00:00:00", "ISBN": "1596052465"},
{"url": "https://www.goodreads.com/book/show/22307960-a-tale-of-two-cities-the-adventures-of-oliver-twist", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 4.0, "genres": [], "title": "A Tale of Two Cities/The Adventures of Oliver Twist (Collected Works)", "author": "Charles Dickens", "num_pages": "1011", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1928-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10007851-the-adventures-of-oliver-twist-pictures-from-italy-american-notes", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 4.0, "genres": ["History", "Classics"], "title": "The Adventures of Oliver Twist; Pictures from Italy; American Notes", "description": ["This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into pri", "This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book."], "author": "Charles Dickens", "num_pages": "940", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-11 00:00:00", "ISBN": "1172371849"},
{"url": "https://www.goodreads.com/book/show/1079632.What_Christmas_Is_as_We_Grow_Older", "num_ratings": "106", "num_reviews": "12", "avg_ratings": 2.96, "genres": ["Holiday", "Christmas", "Classics", "Short Stories", "Fiction"], "title": "What Christmas Is as We Grow Older", "description": ["Kessinger Publishing is the place to find hundreds of thousands of rare and hard-to-find books with something of interest for everyone"], "author": "Charles Dickens", "num_pages": "36", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "1432558668"},
{"url": "https://www.goodreads.com/book/show/1431039.The_Magic_Fish_bone", "num_ratings": "252", "num_reviews": "40", "avg_ratings": 3.49, "genres": ["Classics", "Childrens", "Childrens", "Picture Books", "Fiction", "Fantasy", "Short Stories"], "title": "The Magic Fish-bone", "description": ["This is the extraordinary story of a very nearly ordinary princess named Alicia. Given a magic fish-bone by a good fairy, Alicia can have whatever she wishes-provided she wishes for it at the right time. But it's never clear when the right time is, and sometimes the best magic is no magic at all....", "Perfectly matched by Robert Florczak's spectacular illustrations, this funn", "This is the extraordinary story of a very nearly ordinary princess named Alicia. Given a magic fish-bone by a good fairy, Alicia can have whatever she wishes-provided she wishes for it at the right time. But it's never clear when the right time is, and sometimes the best magic is no magic at all....", "Perfectly matched by Robert Florczak's spectacular illustrations, this funny and unexpectedly touching tale reveals a Victorian world that existed nowhere but in the mind of a child."], "author": "Charles Dickens", "num_pages": "40", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-10-01 00:00:00", "ISBN": "0152010807"},
{"url": "https://www.goodreads.com/book/show/1204009.Christmas_at_Dingley_Dell", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 4.33, "genres": ["European Literature", "British Literature"], "title": "Christmas at Dingley Dell: From the Posthumous Papers of the Pickwick Club", "description": ["Kessinger Publishing is the place to find hundreds of thousands of rare and hard-to-find books with something of interest for everyone"], "author": "Charles Dickens", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "143256255X"},
{"url": "https://www.goodreads.com/book/show/922878.The_Child_s_Story", "num_ratings": "243", "num_reviews": "39", "avg_ratings": 3.88, "genres": ["Short Stories", "Classics", "Fiction", "Holiday", "Christmas"], "title": "The Child's Story", "description": ["Everyone ", "begins life's journey ", "as a child. From one of the world's most beloved writers comes this memorable parable of life's transitions.", "Originally published by Charles Dickens in the mid-1800s, \"The Child's Story\" is a timeless account of the journey we all take, from carefree childhood and spontaneous youth, through adulthood and marriage, and into our golden years. No", "Everyone ", "begins life's journey ", "as a child. From one of the world's most beloved writers comes this memorable parable of life's transitions.", "Originally published by Charles Dickens in the mid-1800s, \"The Child's Story\" is a timeless account of the journey we all take, from carefree childhood and spontaneous youth, through adulthood and marriage, and into our golden years. Now, almost 150 years after its original publication, acclaimed artist Harvey Chan adds his stirring images to Dickens's classic words, creating a unique and powerful reading experience that's ideal for children of all ages."], "author": "Charles Dickens", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-10-01 00:00:00", "ISBN": "0689834829"},
{"url": "https://www.goodreads.com/book/show/7009060-the-pickwick-papers-or-the-posthumous-papers-of-the-pickwick-club-part", "num_ratings": "171", "num_reviews": "9", "avg_ratings": 3.93, "genres": ["Classics", "Fiction"], "title": "The Pickwick Papers or The Posthumous Papers of the Pickwick Club, Part 1 of 3", "description": ["With its scores of delightful, improbably named characters, this story of the celebrated Pickwick Club--wherein the members report on their journeys, adventures, and observations of manner--reels with joyous fantasy, infectious good humor, and a touch of the macabre. 8 cassettes."], "author": "Charles Dickens", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1987-12-28 00:00:00", "ISBN": "0786105666"},
{"url": "https://www.goodreads.com/book/show/10975557-a-child-s-dream-of-a-star", "num_ratings": "136", "num_reviews": "26", "avg_ratings": 3.52, "genres": ["Short Stories", "Classics", "Fiction", "Fantasy"], "title": "A Child's Dream of a Star", "description": ["This early work is Charles Dickens 1871 short children s story, A Child's Dream of a Star . It is the charming and heart-warming tale of a brother and sister s musings on life and death inspired by night-time star-gazing. This timeless and delightfully-illustrated story would make for a fantastic addition to any family collection, and is not to be missed by lovers of Dicke", "This early work is Charles Dickens 1871 short children s story, A Child's Dream of a Star . It is the charming and heart-warming tale of a brother and sister s musings on life and death inspired by night-time star-gazing. This timeless and delightfully-illustrated story would make for a fantastic addition to any family collection, and is not to be missed by lovers of Dickens seminal work. Charles John Huffam Dickens (1812 1870) was an English author widely considered to be the most important novelist of the Victorian era. Many classic books such as this are becoming increasingly rare and expensive. We are republishing this volume now in an affordable, modern, high-quality edition complete with a specially commissioned new biography of the author.\""], "author": "Charles Dickens", "num_pages": "30", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-01 00:00:00", "ISBN": "1409798585"},
{"url": "https://www.goodreads.com/book/show/20834694-the-schoolboy-s-story", "num_ratings": "49", "num_reviews": "5", "avg_ratings": 3.29, "genres": ["Short Stories", "Fiction", "Holiday", "Christmas", "Classics", "Adult"], "title": "The Schoolboy's Story", "description": ["The Schoolboy's Story is a short stories by Charles Dickens. Charles John Huffam Dickens (7 February 1812 - 9 June 1870) was an English writer and social critic. He created some of the world's most memorable fictional characters and is generally regarded as the greatest novelist of the Victorian period. During his life, his works enjoyed unprecedented fame, and by the twen", "The Schoolboy's Story is a short stories by Charles Dickens. Charles John Huffam Dickens (7 February 1812 - 9 June 1870) was an English writer and social critic. He created some of the world's most memorable fictional characters and is generally regarded as the greatest novelist of the Victorian period. During his life, his works enjoyed unprecedented fame, and by the twentieth century his literary genius was broadly acknowledged by critics and scholars. His novels and short stories continue to be widely popular. Born in Portsmouth, England, Dickens was forced to leave school to work in a factory when his father was thrown into debtors' prison. Although he had little formal education, his early impoverishment drove him to succeed. Over his career he edited a weekly journal for 20 years, wrote 15 novels, five novellas and hundreds of short stories and non-fiction articles, lectured and performed extensively, was an indefatigable letter writer, and campaigned vigorously for children's rights, education, and other social reforms. Dickens sprang to fame with the 1836 serial publication of The Pickwick Papers. Within a few years he had become an international literary celebrity, famous for his humour, satire, and keen observation of character and society. His novels, most published in monthly or weekly installments, pioneered the serial publication of narrative fiction, which became the dominant Victorian mode for novel publication. The installment format allowed Dickens to evaluate his audience's reaction, and he often modified his plot and character development based on such feedback. For example, when his wife's chiropodist expressed distress at the way Miss Mowcher in David Copperfield seemed to reflect her disabilities, Dickens went on to improve the character with positive features. Fagin in Oliver Twist apparently mirrors the famous fence Ikey Solomon; His caricature of Leigh Hunt in the figure of Mr Skimpole in Bleak House was likewise toned down on advice from some of his friends, as they read episodes. In the same novel, both Lawrence Boythorne and Mooney the beadle are drawn from real life-Boythorne from Walter Savage Landor and Mooney from 'Looney', a beadle at Salisbury Square. His plots were carefully constructed, and Dickens often wove in elements from topical events into his narratives. Masses of the illiterate poor chipped in ha'pennies to have each new monthly episode read to them, opening up and inspiring a new class of readers."], "author": "Charles Dickens", "num_pages": "24", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-08 00:00:00", "ISBN": "1495484408"},
{"url": "https://www.goodreads.com/book/show/7820512-master-humphrey-s-clock", "num_ratings": "167", "num_reviews": "16", "avg_ratings": 3.27, "genres": ["Classics", "Fiction", "Short Stories"], "title": "Master Humphrey's Clock", "description": ["Charles Dickens, the foremost British writer, is memorable for his interesting characters and rich plots. He was a social activist who wrote plays and novels during the Victorian period. His best known novels include Tale of Two Cities, Oliver Twist, David Copperfield and others. . Master Humphrey's Clock was a weekly periodical edited and written entirely by Charles Dicke", "Charles Dickens, the foremost British writer, is memorable for his interesting characters and rich plots. He was a social activist who wrote plays and novels during the Victorian period. His best known novels include Tale of Two Cities, Oliver Twist, David Copperfield and others. . Master Humphrey's Clock was a weekly periodical edited and written entirely by Charles Dickens from April 4, 1840-December 4, 1841. It began with a frame story in which Master Humphrey tells about himself and his small circle of friends. Master Humphrey was a lonely man who lived in London. He kept old manuscripts in an antique grandfather's clock by the chimney-corner. He decided that he would start a club, called Master Humphrey's Clock, where the members would read aloud their manuscripts to the others."], "author": "Charles Dickens", "num_pages": "396", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2005-06-30 00:00:00", "ISBN": "0735105812"},
{"url": "https://www.goodreads.com/book/show/5340.Pictures_from_Italy", "num_ratings": "402", "num_reviews": "53", "avg_ratings": 3.55, "genres": ["Classics", "Travel", "Cultural", "Italy", "Nonfiction"], "title": "Pictures from Italy", "description": ["A delightful travelogue in the unique style of one of the greatest writers in the English language, the Penguin Classics edition of Charles Dickens's ", "is edited with notes and an introduction by and notes by Kate Flint.", "In 1844, Charles Dickens took a break from novel writing to travel through Italy for almost a year and Pictures from Italy is an illumina", "A delightful travelogue in the unique style of one of the greatest writers in the English language, the Penguin Classics edition of Charles Dickens's ", "is edited with notes and an introduction by and notes by Kate Flint.", "In 1844, Charles Dickens took a break from novel writing to travel through Italy for almost a year and Pictures from Italy is an illuminating account of his experiences there. He presents the country like a magic-lantern show, as vivid images ceaselessly appear before his - and his readers' - eyes. Italy's most famous sights are all to be found here - St Peter's in Rome, Naples with Vesuvius smouldering in the background, the fairytale buildings and canals of Venice - but Dickens's chronicle is not simply that of a tourist. Avoiding preconceptions and stereotypes, he portrays a nation of great contrasts: between grandiose buildings and squalid poverty, and between past and present, as he observes everyday life beside ancient monuments. Combining thrilling travelogue with piercing social commentary, ", " is a revealing depiction of an exciting and disquieting journey.", "In her introduction, Kate Flint discusses nineteenth-century travel writing, and Dickens's ideas about perception, memory and Italian politics. This edition also includes a chronology, further reading, notes and an appendix.", "Charles Dickens is one of the best-loved novelists in the English language, whose 200th anniversary was celebrated in 2012. His most famous books, including ", ", ", ", ", ", ", " and ", ", have been adapted for stage and screen and read by millions.", "If you enjoyed ", ", you might like Dickens's ", "also available in Penguin Classics."], "author": "Charles Dickens", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-01-29 00:00:00", "ISBN": "0140434313"},
{"url": "https://www.goodreads.com/book/show/23630966-christmas-stories-and-related-tales", "num_ratings": "52,370", "num_reviews": "284", "avg_ratings": 4.11, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Fantasy"], "title": "Christmas Stories and Related Tales: A Christmas Carol, The Chimes, The Cricket on the Hearth", "description": ["The perfect gift and coffee table book for the readers on your list. After the year 1843 the one literary work which Dickens never neglected was to furnish a Christmas story for his readers; and it is due in some measure to the help of these stories, brimming over with good cheer, that Christmas has become in all English-speaking countries a season of gladness, of gift giv", "The perfect gift and coffee table book for the readers on your list. After the year 1843 the one literary work which Dickens never neglected was to furnish a Christmas story for his readers; and it is due in some measure to the help of these stories, brimming over with good cheer, that Christmas has become in all English-speaking countries a season of gladness, of gift giving at home, and of remembering those less fortunate than ourselves, who are still members of a common brotherhood. If we read nothing else of Dickens, once a year, at Christmas time, we should remember him and renew our youth by reading one of his holiday stories,--The Cricket on the Hearth, The Chimes, and above all the unrivaled Christmas Carol. The latter especially will be read and loved as long as men are moved by the spirit of Christmas."], "author": "Charles Dickens", "num_pages": "334", "awards": [], "places": [], "character_names": ["Scrooge"], "language": "English", "publish_date": "2014-11-28 00:00:00", "ISBN": "1505229170"},
{"url": "https://www.goodreads.com/book/show/28255356-the-signal-man", "num_ratings": "1,504", "num_reviews": "144", "avg_ratings": 3.66, "genres": ["Short Stories", "Classics", "Horror", "Fiction", "Gothic", "Literature", "19th Century"], "title": "The Signal-Man", "description": ["When the narrator of Charles Dickens' masterful ghost story 'The Signalman' climbs down into a lonely railway siding on a whim, he finds himself in 'as solitary and dismal a place as ever I saw ... it struck chill to me, as if I had left the natural world.'", "His misgivings turn out to be justified, for the signalman who lives there has a secret, a ghostly visitor who has twi", "When the narrator of Charles Dickens' masterful ghost story 'The Signalman' climbs down into a lonely railway siding on a whim, he finds himself in 'as solitary and dismal a place as ever I saw ... it struck chill to me, as if I had left the natural world.'", "His misgivings turn out to be justified, for the signalman who lives there has a secret, a ghostly visitor who has twice warned him of impending disaster, and now appears again, foretelling a coming catastrophe that neither man can predict or understand.", "This volume also contains Dickens' comic gem 'The Boy at Mugby', a rollicking satire on customer service which rings as true today as it did in the author's own time."], "author": "Charles Dickens", "num_pages": "28", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-12-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/400885.Sketches_by_Boz", "num_ratings": "1,040", "num_reviews": "79", "avg_ratings": 3.72, "genres": ["Fiction", "Short Stories", "Classics", "Historical", "Victorian", "European Literature", "British Literature"], "title": "Sketches by Boz", "description": ["Charles Dickens's first published book, Sketches by Boz (1836) heralded an exciting new voice in English literature. This richly varied collection of observation, fancy and fiction shows the London he knew so intimately at its best and worst - its streets, theatres, inns, pawnshops, law courts, prisons, omnibuses and the river Thames - in honest and visionary descriptions", "Charles Dickens's first published book, Sketches by Boz (1836) heralded an exciting new voice in English literature. This richly varied collection of observation, fancy and fiction shows the London he knew so intimately at its best and worst - its streets, theatres, inns, pawnshops, law courts, prisons, omnibuses and the river Thames - in honest and visionary descriptions of everyday life and people. Through pen portraits that often anticipate characters from his great novels, we see the condemned man in his prison cell, garrulous matrons, vulgar young clerks and Scrooge-like bachelors, while Dickens's powers for social critique are never far from the surface, in unflinching depictions of the vast metropolis's forgotten citizens, from child workers to prostitutes. A startling mixture of humour and pathos, these Sketches reveal London as wonderful terrain for an extraordinary young writer.Sketches is a remarkable achievement, and looks towards Dickens's giant novels in its profusion of characters, its glimpses of surreal modernity and its limitless fund of pathos and comic invention."], "author": "Charles Dickens", "num_pages": "182", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-10-26 00:00:00", "ISBN": "0140433457"},
{"url": "https://www.goodreads.com/book/show/1775352.A_Child_s_History_of_England", "num_ratings": "471", "num_reviews": "61", "avg_ratings": 3.74, "genres": ["History", "Classics", "Nonfiction"], "title": "A Child's History of England", "description": ["If you look at a Map of the World, you will see, in the left-hand upper corner of the Eastern Hemisphere, two Islands lying in the sea. They are England and Scotland, and Ireland. England and Scotland form the greater part of these Islands. Ireland is the next in size. The little neighbouring islands, which are so small upon the Map as to be mere dots, are chiefly little b", "If you look at a Map of the World, you will see, in the left-hand upper corner of the Eastern Hemisphere, two Islands lying in the sea. They are England and Scotland, and Ireland. England and Scotland form the greater part of these Islands. Ireland is the next in size. The little neighbouring islands, which are so small upon the Map as to be mere dots, are chiefly little bits of Scotland, --broken off, I dare say, in the course of a great length of time, by the power of the restless water..."], "author": "Charles Dickens", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-06-20 00:00:00", "ISBN": "1594628181"},
{"url": "https://www.goodreads.com/book/show/3027439-the-haunted-man", "num_ratings": "832", "num_reviews": "114", "avg_ratings": 3.26, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Horror", "Short Stories"], "title": "The Haunted Man", "description": ["In this story, Dickens narrates the hair-raising experiences of a professor. As the protagonist dwells on his past sorrows and mistakes, a phantom visits him. It offers him a bizarre escape from painful recollections of yesteryear by offering to eradicate his memory. On seeing the professor turn into a man devoid of emotions, the reader realizes how empty one becomes witho", "In this story, Dickens narrates the hair-raising experiences of a professor. As the protagonist dwells on his past sorrows and mistakes, a phantom visits him. It offers him a bizarre escape from painful recollections of yesteryear by offering to eradicate his memory. On seeing the professor turn into a man devoid of emotions, the reader realizes how empty one becomes without a past."], "author": "Charles Dickens", "num_pages": "101", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2004-05-31 00:00:00", "ISBN": "1576467333"},
{"url": "https://www.goodreads.com/book/show/1931757.The_Uncommercial_Traveller", "num_ratings": "256", "num_reviews": "30", "avg_ratings": 3.5, "genres": ["Classics", "Fiction", "Travel"], "title": "The Uncommercial Traveller", "description": ["No landlord is my friend and brother, no chambermaid loves me, no waiter worships me, no boots admires and envies me. No round of beef or tongue or ham is expressly cooked for me, no pigeon-pie is especially made for me, no hotel-advertisement is personally addressed to me, no hotel-room tapestried with great-coats and railway wrappers is set apart for me, no house of publ", "No landlord is my friend and brother, no chambermaid loves me, no waiter worships me, no boots admires and envies me. No round of beef or tongue or ham is expressly cooked for me, no pigeon-pie is especially made for me, no hotel-advertisement is personally addressed to me, no hotel-room tapestried with great-coats and railway wrappers is set apart for me, no house of public entertainment in the United Kingdom greatly cares for my opinion of its brandy or sherry."], "author": "Charles Dickens", "num_pages": "328", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "1428053867"},
{"url": "https://www.goodreads.com/book/show/549938.The_Cricket_on_the_Hearth", "num_ratings": "4,388", "num_reviews": "536", "avg_ratings": 3.43, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Audiobook"], "title": "The Cricket on the Hearth", "description": ["Dickens gave his first formal expression to his Christmas thoughts in his series of small books, the first of which was the famous \"Christmas Carol.\" There followed four others: \"The Chimes,\" \"The Cricket on the Hearth,\" \"The Battle of Life,\" and \"The Haunted Man.\" The five are known today as the \"Christmas Books.\" Of them all the \"Carol\" is the best known and loved, and \"", "Dickens gave his first formal expression to his Christmas thoughts in his series of small books, the first of which was the famous \"Christmas Carol.\" There followed four others: \"The Chimes,\" \"The Cricket on the Hearth,\" \"The Battle of Life,\" and \"The Haunted Man.\" The five are known today as the \"Christmas Books.\" Of them all the \"Carol\" is the best known and loved, and \"The Cricket on the Hearth,\" although third in the series, is perhaps next in popularity, and is especially familiar to Americans through Joseph Jefferson's characterisation of Caleb Plummer.", "The title creature is a sort of barometer of life at the home of John Peerybingle and his much younger wife Dot. When things go well, the cricket on the hearth chirps; it is silent when there is sorrow. Tackleton, a jealous old man, poisons John's mind about Dot, but the cricket through its supernatural powers restores John's confidence and all ends happily."], "author": "Charles Dickens", "num_pages": "84", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-14 00:00:00", "ISBN": "0809500418"},
{"url": "https://www.goodreads.com/book/show/2452383.The_Chimes", "num_ratings": "5,262", "num_reviews": "784", "avg_ratings": 3.15, "genres": ["Classics", "Fiction", "Audiobook", "Holiday", "Christmas"], "title": "The Chimes", "description": ["\"The Chimes\" is Charles Dickens 1844 novella that concerns the disillusionment of Toby \"Trotty\" Veck, a poor working-class man. When Trotty has lost his faith in Humanity and believes that his poverty is the result of his unworthiness he is visited on New Year's Eve by spirits to help restore his faith and show him that nobody is born evil, but rather that crime and povert", "\"The Chimes\" is Charles Dickens 1844 novella that concerns the disillusionment of Toby \"Trotty\" Veck, a poor working-class man. When Trotty has lost his faith in Humanity and believes that his poverty is the result of his unworthiness he is visited on New Year's Eve by spirits to help restore his faith and show him that nobody is born evil, but rather that crime and poverty are things created by man."], "author": "Charles Dickens", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-01 00:00:00", "ISBN": "1434101851"},
{"url": "https://www.goodreads.com/book/show/169848.A_Christmas_Carol_The_Chimes_and_The_Cricket_on_the_Hearth", "num_ratings": "52,370", "num_reviews": "284", "avg_ratings": 4.11, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Fantasy"], "title": "A Christmas Carol, The Chimes and The Cricket on the Hearth", "description": [", by ", ", is part of the ", "series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of ", ", by ", ", is part of the ", "series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of ", ":", "All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. ", "pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.", " ", "Generations of readers have been enchanted by ", "’s ", "—the most cheerful ghost story ever written, and the unforgettable tale of Ebenezer Scrooge’s moral regeneration. Written in just a few weeks, ", " famously recounts the plight of Bob Cratchit, whose family finds joy even in poverty, and the transformation of his miserly boss Scrooge as he is visited by the ghosts of Christmas past, present, and future.", "From Scrooge’s “Bah!” and “Humbug!” to Tiny Tim’s “God bless us every one!” ", "shines with warmth, decency, kindness, humility, and the value of the holidays. But beneath its sentimental surface, ", " offers another of Dickens’s sharply critical portraits of a brutal society, and an inspiring celebration of the possibility of spiritual, psychological, and social change.", "This new volume collects Dickens’s three most renowned “Christmas Books,” including ", ", a New Year’s tale, and ", ", whose eponymous creature remains silent during sorrow and chirps amid happiness.", ", the daughter of a scholar and a sculptor, has a degree in English Literature from Occidental College. Her work has appeared in ", " and the recent book, ", ". She is currently working on a book on Victorian Christmas writings."], "author": "Charles Dickens", "num_pages": "304", "awards": [], "places": [], "character_names": ["Scrooge"], "language": "English", "publish_date": "2004-03-25 00:00:00", "ISBN": "1593080336"},
{"url": "https://www.goodreads.com/book/show/3170878-the-battle-of-life", "num_ratings": "659", "num_reviews": "84", "avg_ratings": 3.18, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Short Stories"], "title": "The Battle of Life", "description": ["The Battle of Life: A Love Story is a novella by Charles Dickens, 1st published in 1846. It's the 4th of his five \"Christmas Books\", coming after The Cricket on the Hearth, followed by The Haunted Man & the Ghost's Bargain.", "The setting is an English village that stands on the site of a historic battle. Some characters refer to the battle as a metaphor for the struggles", "The Battle of Life: A Love Story is a novella by Charles Dickens, 1st published in 1846. It's the 4th of his five \"Christmas Books\", coming after The Cricket on the Hearth, followed by The Haunted Man & the Ghost's Bargain.", "The setting is an English village that stands on the site of a historic battle. Some characters refer to the battle as a metaphor for the struggles of life, hence the title.", "Battle is the only one of the five Christmas Books that has no supernatural or explicitly religious elements. (One scene takes place at Christmas time, but it isn't the final scene.) The story bears some resemblance to The Cricket on the Hearth in two aspects: it has a non-urban setting & it's resolved with a romantic twist. It's even less of a social novel than is Cricket. As is typical with Dickens, the ending is a happy one.", "It's one of Dickens' lesser-known works & has never attained any high level of popularity, a trait it shares among the Christmas Books with The Haunted Man."], "author": "Charles Dickens", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-04-22 00:00:00", "ISBN": "1404361413"},
{"url": "https://www.goodreads.com/book/show/922865.The_Signalman_and_The_Ghost_at_the_Trial", "num_ratings": "65", "num_reviews": "8", "avg_ratings": 3.55, "genres": ["Childrens"], "title": "The Signalman and The Ghost at the Trial", "description": ["Stories in the Travelman Short Stories series take the reader to places of mystery, fantasy, horror, romance, and corners of the universe yet unexplored. In turn, readers take them on the bus or subway, slip them into briefcases and lunchboxes, and send them from Jersey to Juneau. ", "Each classic or original short story is printed on one sheet of paper and folded like a map.", "Stories in the Travelman Short Stories series take the reader to places of mystery, fantasy, horror, romance, and corners of the universe yet unexplored. In turn, readers take them on the bus or subway, slip them into briefcases and lunchboxes, and send them from Jersey to Juneau. ", "Each classic or original short story is printed on one sheet of paper and folded like a map. This makes it simple to read while commuting, convenient to carry when not, and easy to give or send to a friend. A paper envelope is provided for mailing or gift-giving, and both are packaged in a clear plastic envelope for display. The cost is not much more than a greeting card."], "author": "Charles Dickens", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-20 00:00:00", "ISBN": "1405072490"},
{"url": "https://www.goodreads.com/book/show/11202585-charles-dickens", "num_ratings": "4,167", "num_reviews": "415", "avg_ratings": 4.01, "genres": ["Biography", "Nonfiction", "History"], "title": "Charles Dickens", "description": ["When Charles Dickens died in 1870, ", " of London successfully campaigned for his burial in Westminster Abbey, the final resting place of England's kings and heroes. Thousands flocked to mourn the best recognized and loved man of nineteenth-cent", "When Charles Dickens died in 1870, ", " of London successfully campaigned for his burial in Westminster Abbey, the final resting place of England's kings and heroes. Thousands flocked to mourn the best recognized and loved man of nineteenth-century England. His books had made them laugh, shown them the squalor and greed of English life, and also the power of personal virtue and the strength of ordinary people. In his last years Dickens drew adoring crowds to his public appearances, had met presidents and princes, and had amassed a fortune.", "Like a hero from his novels, Dickens trod a hard path to greatness. Born into a modest middle-class family, his young life was overturned when his profligate father was sent to debtors' prison and Dickens was forced into harsh and humiliating factory work. Yet through these early setbacks he developed his remarkable eye for all that was absurd, tragic, and redemptive in London life. He set out to succeed, and with extraordinary speed and energy made himself into the greatest English novelist of the century.", "Years later Dickens's daughter wrote to the author George Bernard Shaw, \"If you could make the public understand that my father was not a joyous, jocose gentleman walking about the world with a plum pudding and a bowl of punch, you would greatly oblige me.\" Seen as the public champion of household harmony, Dickens tore his own life apart, betraying, deceiving, and breaking with friends and family while he pursued an obsessive love affair.", " gives full measure to Dickens's heroic stature-his huge virtues both as a writer and as a human being- while observing his failings in both respects with an unblinking eye. Renowned literary biographer Claire Tomalin crafts a story worthy of Dickens's own pen, a comedy that turns to tragedy as the very qualities that made him great-his indomitable energy, boldness, imagination, and showmanship-finally destroyed him. The man who emerges is one of extraordinary contradictions, whose vices and virtues were intertwined as surely as his life and his art."], "author": "Claire Tomalin", "num_pages": "527", "awards": ["Costa Book Award Nominee for Biography (2011)", "Galaxy National Book Award for The Telegraph Biography of the Year (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-27 00:00:00", "ISBN": "1594203091"},
{"url": "https://www.goodreads.com/book/show/5338.A_Christmas_Carol_and_Other_Christmas_Writings", "num_ratings": "32,932", "num_reviews": "665", "avg_ratings": 4.13, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Short Stories", "Literature"], "title": "A Christmas Carol and Other Christmas Writings", "description": ["Dickens' story of solitary miser Ebenezer Scrooge, who is taught the true meaning of Christmas by a series of ghostly visitors, has proved one of his most well-loved works. Ever since it was published in", "Dickens' story of solitary miser Ebenezer Scrooge, who is taught the true meaning of Christmas by a series of ghostly visitors, has proved one of his most well-loved works. Ever since it was published in 1843 it has had an enduring influence on the way we think about the traditions of Christmas. Dickens' other Christmas writings collected here include 'The Story of the Goblins who Stole a Sexton', the short story from The Pickwick Papers on which ", " was based; ", " a tale of a man tormented by painful memories; along with shorter pieces, some drawn from the 'Christmas Stories' that Dickens wrote annually for his weekly journals. In all of them Dickens celebrates the season as one of geniality, charity and remembrance.", "This new selection contains an introduction by distinguished Dickens scholar Michael Slater discussing how the author has shaped ideas about the Christmas spirit, an appendix on Dickens' use of ", " a further reading list and explanatory notes."], "author": "Charles Dickens", "num_pages": "288", "awards": [], "places": ["United Kingdom"], "character_names": ["Timothy Cratchit", "Bob Cratchit", "Grace Jeddler", "Marion Jeddler", "Jacob Marley", "Ebenezer Scrooge"], "language": "English", "publish_date": "2003-10-30 00:00:00", "ISBN": "0140439056"},
{"url": "https://www.goodreads.com/book/show/329957.The_Mystery_of_Edwin_Drood", "num_ratings": "9,356", "num_reviews": "676", "avg_ratings": 3.66, "genres": ["Classics", "Fiction", "Mystery"], "title": "The Mystery of Edwin Drood", "description": ["Charles Dickens's final, unfinished novel, and one that has puzzled readers and inspired writers since its publication, ", " is edited with an introduction by David Paroissien in Penguin Classics.", "Edwin Drood is contracted to marry orphan Rosa Bud when he comes of age, but when they find that duty has gradually replaced affection, they agree to break o", "Charles Dickens's final, unfinished novel, and one that has puzzled readers and inspired writers since its publication, ", " is edited with an introduction by David Paroissien in Penguin Classics.", "Edwin Drood is contracted to marry orphan Rosa Bud when he comes of age, but when they find that duty has gradually replaced affection, they agree to break off the engagement. Shortly afterwards, in the middle of a storm on Christmas Eve, Edwin disappears, leaving nothing behind but some personal belongings and the suspicion that his jealous uncle John Jasper, madly in love with Rosa, is the killer. And beyond this presumed crime there are further intrigues: the dark opium dens of the sleepy cathedral town of Cloisterham, and the sinister double life of Choirmaster Jasper, whose drug-fuelled fantasy life belies his respectable appearance. Dickens died before completing ", ", leaving its tantalising mystery unsolved and encouraging successive generations of readers to turn detective.", "This edition contains an introduction by David Paroissien, discussing the novel's ending, with a chronology, notes, original illustrations by Samuel Luke Fildes, appendices on opium use in the nineteenth century, the 'Sapsea Fragment' and Dickens's plans for the story's conclusion.", "Charles Dickens is one of the best-loved novelists in the English language, whose 200th anniversary was celebrated in 2012. His most famous books, including ", ", ", ", ", ", ", " and ", ", have been adapted for stage and screen and read by millions.", "If you enjoyed ", ", you might like Dickens's ", ", also available in Penguin Classics."], "author": "Charles Dickens", "num_pages": "432", "awards": ["Βραβείο Λογοτεχνικής Μετάφρασης ΕΚΕΜΕΛ for Αγγλόφωνη Λογοτεχνία (2009)"], "places": ["Rochester, England"], "character_names": ["Edwin Drood", "Rosa Bud", "Dick Datchery", "John Jasper", "Neville Landless", "Rev. Septimus Crisparkle", "Helena Landless", "Hiram Grewgious", "Miss Twinkleton", "Luke Honeythunder", "Mr. Tartar", "Thomas Sapsea"], "language": "English", "publish_date": "2002-08-12 00:00:00", "ISBN": "0140439269"},
{"url": "https://www.goodreads.com/book/show/1990.Martin_Chuzzlewit", "num_ratings": "13,351", "num_reviews": "488", "avg_ratings": 3.83, "genres": ["Classics", "Fiction", "Literature"], "title": "Martin Chuzzlewit", "description": ["While writing ", " - his sixth novel - Dickens declared it 'immeasurably the best of my stories.' He was already famous as the author of ", " and ", ". ", "Set partly in America, which Dickens had visited in 1842, the novel includes a searing satire on the United States. Martin Chuzzlewit is the story of two Chuzzlewits, Martin and Jonas, wh", "While writing ", " - his sixth novel - Dickens declared it 'immeasurably the best of my stories.' He was already famous as the author of ", " and ", ". ", "Set partly in America, which Dickens had visited in 1842, the novel includes a searing satire on the United States. Martin Chuzzlewit is the story of two Chuzzlewits, Martin and Jonas, who have inherited the characteristic Chuzzlewit selfishness. It contrasts their diverse fates of moral redemption and worldly success for one, with increasingly desperate crime for the other. This powerful black comedy involves hypocrisy, greed and blackmail, as well as the most famous of Dickens's grotesques, Mrs Gamp."], "author": "Charles Dickens", "num_pages": "830", "awards": [], "places": [], "character_names": ["Martin Chuzzlewit", "Mr. Pecksniff", "Mrs. Sarah Gamp"], "language": "English", "publish_date": "2000-08-01 00:00:00", "ISBN": "0140436146"},
{"url": "https://www.goodreads.com/book/show/11026.Barnaby_Rudge", "num_ratings": "8,076", "num_reviews": "418", "avg_ratings": 3.8, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "Barnaby Rudge", "description": ["Set against the backdrop of the Gordon Riots of 1780, Barnaby Rudge is a story of mystery and suspense which begins with an unsolved double murder and goes on to involve conspiracy, blackmail, abduction and retribution. Through the course of the novel fathers and sons become opposed, apprentices plot against their masters and Protestants clash with Catholics on the streets", "Set against the backdrop of the Gordon Riots of 1780, Barnaby Rudge is a story of mystery and suspense which begins with an unsolved double murder and goes on to involve conspiracy, blackmail, abduction and retribution. Through the course of the novel fathers and sons become opposed, apprentices plot against their masters and Protestants clash with Catholics on the streets. And, as London erupts into riot, Barnaby Rudge himself struggles to escape the curse of his own past. With its dramatic descriptions of public violence and private horror, its strange secrets and ghostly doublings, Barnaby Rudge is a powerful, disturbing blend of historical realism and Gothic melodrama."], "author": "Charles Dickens", "num_pages": "744", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-04-29 00:00:00", "ISBN": "0140437282"},
{"url": "https://www.goodreads.com/book/show/429024.The_Old_Curiosity_Shop", "num_ratings": "14,900", "num_reviews": "904", "avg_ratings": 3.76, "genres": ["Classics", "Fiction", "Literature"], "title": "The Old Curiosity Shop", "description": ["The archetypal Victorian melodrama, as heartfelt and moving today as when it was first published, Charles Dickens's ", " is edited with notes and an introduction by Norman Page in Penguin Classics.", "Little Nell Trent lives in the quiet gloom of the old curiosity shop with her ailing grandfather, for whom she cares with selfless devotion. But when they are u", "The archetypal Victorian melodrama, as heartfelt and moving today as when it was first published, Charles Dickens's ", " is edited with notes and an introduction by Norman Page in Penguin Classics.", "Little Nell Trent lives in the quiet gloom of the old curiosity shop with her ailing grandfather, for whom she cares with selfless devotion. But when they are unable to pay their debts to the stunted, lecherous and demonic money-lender Daniel Quilp, the shop is seized and they are forced to flee, thrown into a shadowy world in which there seems to be no safe haven. Dickens's portrayal of the innocent, tragic Nell made ", " an instant bestseller that captured the hearts of the nation, even as it was criticised for its sentimentality by figures such as Oscar Wilde. Yet alongside the story's pathos are some of Dickens's greatest comic and grotesque creations: the ne'er-do-well Dick Swiveller, the mannish lawyer Sally Brass, the half-starved 'Marchioness' and the lustful, loathsome Quilp himself.", "This edition, based on the original text of 1841, contains an introduction by Norman Page discussing the various contrasting themes of the novel and its roots in Dickens's own personal tragedy, with prefaces to the 1841 and 1848 editions, a chronology, notes and original illustrations produced for the serial version.", "Charles Dickens is one of the best-loved novelists in the English language, whose 200th anniversary was celebrated in 2012. His most famous books, including ", ", ", ", ", ", ", " and ", ", have been adapted for stage and screen and read by millions.", "If you enjoyed ", "you might like Dickens's ", ", also available in Penguin Classics."], "author": "Charles Dickens", "num_pages": "576", "awards": [], "places": [], "character_names": ["Barbara", "Nell Trent", "Nell's grandfather", "Christopher 'Kit' Nubbles", "Daniel Quilp", "Richard 'Dick' Swiveller", "The single gentleman", "Mrs. Betsy Quilp", "Mr. Sampson Brass", "Miss Sarah ('Sally') Brass", "Mrs. Jarley", "Frederick Trent", "Mr. Garland", "The Marchioness", "Isaac List", "Joe Jowl", "Mr. Chuckster", "Mr. Witherden", "Mr. Marton", "Thomas Codlin", "Mr. Harris", "The Bachelor"], "language": "English", "publish_date": "2001-01-25 00:00:00", "ISBN": "0140437428"},
{"url": "https://www.goodreads.com/book/show/50827.Dombey_and_Son", "num_ratings": "12,133", "num_reviews": "554", "avg_ratings": 3.91, "genres": ["Classics", "Fiction", "Literature", "19th Century", "Literature"], "title": "Dombey and Son", "description": [", Charles Dickens’s story of a powerful man whose callous neglect of his family triggers his professional and personal downfall, showcases the author’s gift for vivid characterization and unfailingly realistic description. As Jonathan Lethem contends in his Introduction, Dickens’s “genius . . . is at one with the genius of the form of the novel itself: Dicken", ", Charles Dickens’s story of a powerful man whose callous neglect of his family triggers his professional and personal downfall, showcases the author’s gift for vivid characterization and unfailingly realistic description. As Jonathan Lethem contends in his Introduction, Dickens’s “genius . . . is at one with the genius of the form of the novel itself: Dickens willed into existence the most capacious and elastic and versatile kind of novel that could be, one big enough for his vast sentimental yearnings and for every impulse and fear and hesitation in him that countervailed those yearnings too. Never parsimonious and frequently contradictory, he always gives us everything he can, everything he’s planned to give, and then more.” This Modern Library Paperback Classic was set from the 1867 “Charles Dickens” edition."], "author": "Charles Dickens", "num_pages": "880", "awards": ["Audie Award for Classic (2013)"], "places": [], "character_names": ["Mr. Dombey", "Paul Dombey", "Florence Dombey", "Miss Tox"], "language": "English", "publish_date": "2003-08-12 00:00:00", "ISBN": "0812967437"},
{"url": "https://www.goodreads.com/book/show/5344.Hard_Times", "num_ratings": "46,297", "num_reviews": "2,395", "avg_ratings": 3.51, "genres": ["Classics", "Fiction", "Literature", "Literature", "19th Century", "Novels", "Historical", "Victorian", "European Literature", "British Literature", "Historical", "Historical Fiction", "Classics", "Classic Literature", "Academic", "School"], "title": "Hard Times", "description": ["Longman's new Cultural Editions Series, ", ", by Charles Dickens, edited by Jeff Nunokawa, includes Books 1-3 of ", " and contextual materials on the age of Dickens."], "author": "Charles Dickens", "num_pages": "353", "awards": [], "places": ["Coketown"], "character_names": ["Thomas Gradgrind", "Mr. M'Choakumchild", "Stephen Blackpool", "Josiah Bounderby", "Sissy Jupe"], "language": "English", "publish_date": "2003-10-19 00:00:00", "ISBN": "0321107217"},
{"url": "https://www.goodreads.com/book/show/229432.The_Pickwick_Papers", "num_ratings": "21,524", "num_reviews": "1,318", "avg_ratings": 3.82, "genres": ["Classics", "Fiction", "Literature"], "title": "The Pickwick Papers", "description": ["Few first novels have created as much popular excitement as ", "–-a comic masterpiece that catapulted its 24-year-old author to immediate fame. Readers were captivated by the adventures of the poet Snodgrass, the lover Tupman, the sportsman Winkle &, above all, by that quintessentially English Quixote, Mr Pickwick, & his cockney Sancho Panza, Sam Wel", "Few first novels have created as much popular excitement as ", "–-a comic masterpiece that catapulted its 24-year-old author to immediate fame. Readers were captivated by the adventures of the poet Snodgrass, the lover Tupman, the sportsman Winkle &, above all, by that quintessentially English Quixote, Mr Pickwick, & his cockney Sancho Panza, Sam Weller. From the hallowed turf of Dingley Dell Cricket Club to the unholy fracas of the Eatanswill election, via the Fleet debtor’s prison, characters & incidents sprang to life from Dickens’s pen, to form an enduringly popular work of ebullient humour & literary invention."], "author": "Charles Dickens", "num_pages": "801", "awards": [], "places": [], "character_names": ["Samuel Pickwick", "Nathaniel Winkle", "Augustus Snodgrass", "Tracy Tupman", "Sam Weller", "Tony Weller", "Alfred Jingle", "Job Trotter", "Mr. Wardle", "Emily Wardle", "Benjamin Allen", "Arabella Allen", "Bob Sawyer", "Mr. Perker", "Mrs. Bardell", "Dr. Slammer", "Solomon Pell", "Rachael Wardle", "Mr. Dodson", "Mr. Fogg"], "language": "English", "publish_date": "2000-02-24 00:00:00", "ISBN": "0140436111"},
{"url": "https://www.goodreads.com/book/show/325085.Nicholas_Nickleby", "num_ratings": "35,880", "num_reviews": "1,239", "avg_ratings": 3.9, "genres": ["Classics", "Fiction", "Literature"], "title": "Nicholas Nickleby", "description": ["When Nicholas Nickleby is left penniless after his father's death, he appeals to his wealthy uncle to help him find work and to protect his mother and sister. But Ralph Nickleby proves both hard-hearted and unscrupulous, and Nicholas finds himself forced to make his own way in the world. His a", "When Nicholas Nickleby is left penniless after his father's death, he appeals to his wealthy uncle to help him find work and to protect his mother and sister. But Ralph Nickleby proves both hard-hearted and unscrupulous, and Nicholas finds himself forced to make his own way in the world. His adventures gave Dickens the opportunity to portray an extraordinary gallery of rogues and eccentrics: Wackford Squeers, the tyrannical headmaster of Dotheboys Hall, a school for unwanted boys; the slow-witted orphan Smike, rescued by Nicholas; and the gloriously theatrical Mr and Mrs Crummles and their daughter, the 'infant phenonenon'. Like many of Dickens's novels, Nicholas Nickleby is characterised by his outrage at cruelty and social injustice, but it is also a flamboyantly exuberant work, revealing his comic genius at its most unerring.", "Mark Ford's introduction compares Nicholas Nickleby to eighteenth-century picaresque novels, and examines Dickens's criticism of the 'Yorkshire Schools', his social satire and use of language. This edition includes the original illustrations by 'Phiz', a chronology and a list for further reading."], "author": "Charles Dickens", "num_pages": "817", "awards": ["Audie Award for Classic (2012)"], "places": ["England", "London, England", "Yorkshire, England"], "character_names": ["Nicholas Nickleby", "Smike", "Wackford Squeers", "Ralph Nickleby", "Newman Noggs", "Fanny Squeers", "Godfrey Nickleby"], "language": "English", "publish_date": "2003-08-12 00:00:00", "ISBN": "0140435123"},
{"url": "https://www.goodreads.com/book/show/31244.Our_Mutual_Friend", "num_ratings": "22,934", "num_reviews": "1,221", "avg_ratings": 4.06, "genres": ["Classics", "Fiction", "Literature"], "title": "Our Mutual Friend", "description": ["A satiric masterpiece about the allure and peril of money, ", " revolves around the inheritance of a dust-heap where the rich throw their trash. When the body of John Harmon, the dust-heap’s expected heir, is found in the Thames, fortunes change hands surprisingly, raising to new heights “Noddy” Boffin, a low-born but kindly clerk who becomes “the Golden Dustm", "A satiric masterpiece about the allure and peril of money, ", " revolves around the inheritance of a dust-heap where the rich throw their trash. When the body of John Harmon, the dust-heap’s expected heir, is found in the Thames, fortunes change hands surprisingly, raising to new heights “Noddy” Boffin, a low-born but kindly clerk who becomes “the Golden Dustman.” Charles Dickens’s last complete novel, ", " encompasses the great themes of his earlier works: the pretensions of the nouveaux riches, the ingenuousness of the aspiring poor, and the unfailing power of wealth to corrupt all who crave it. With its flavorful cast of characters and numerous subplots, ", " is one of Dickens’s most complex—and satisfying—novels."], "author": "Charles Dickens", "num_pages": "801", "awards": [], "places": [], "character_names": ["Jenny Wren", "Jesse Hexam", "Lizzie Hexam", "Charley Hexam", "Roger Riderhood", "Pleasant Riderhood", "John Harmon", "Bella Wilfer", "Hamilton Veneering", "Anastatia Veneering", "Melvin Twemlow", "Eugene Wrayburn", "Mortimer Lightwood", "Lady Tippins", "John Podsnap", "Mrs. Podsnap", "Georgiana Podsnap", "Nicodemus Boffin", "Henrietta Boffin", "Reginald Wilfer", "Mrs. Wilfer", "Lavinia Wilfer", "Alfred Lammle", "Sophronia Lammle", "Abbey Potterson", "Bob Gliddery", "Silas Wegg", "Mr. Venus", "George Sampson", "Bradley Headstone", "Emma Peecher", "Sloppy", "Betty Higden", "Mr. Fledgeby", "Mr. Riah"], "language": "English", "publish_date": "2002-09-10 00:00:00", "ISBN": "0375761144"},
{"url": "https://www.goodreads.com/book/show/31250.Little_Dorrit", "num_ratings": "39,798", "num_reviews": "1,328", "avg_ratings": 3.98, "genres": ["Classics", "Fiction", "Literature", "Literature", "19th Century", "Historical", "Victorian", "Historical", "Historical Fiction", "European Literature", "British Literature", "Classics", "Classic Literature", "Romance", "Novels"], "title": "Little Dorrit", "description": ["A novel of serendipity, of fortunes won and lost, and of the spectre of imprisonment that hangs over all aspects of Victorian society, Charles Dickens's ", " is edited with an introduction by Stephen Wall in Penguin Classics.", "When Arthur Clennam returns to England after many years abroad, he takes a kindly interest in Amy Dorrit, his mother's seamstress, and in the", "A novel of serendipity, of fortunes won and lost, and of the spectre of imprisonment that hangs over all aspects of Victorian society, Charles Dickens's ", " is edited with an introduction by Stephen Wall in Penguin Classics.", "When Arthur Clennam returns to England after many years abroad, he takes a kindly interest in Amy Dorrit, his mother's seamstress, and in the affairs of Amy's father, William Dorrit, a man of shabby grandeur, long imprisoned for debt in Marshalsea prison. As Arthur soon discovers, the dark shadow of the prison stretches far beyond its walls to affect the lives of many, from the kindly Mr Panks, the reluctant rent-collector of Bleeding Heart Yard, and the tipsily garrulous Flora Finching, to Merdle, an unscrupulous financier, and the bureaucratic Barnacles in the Circumlocution Office. A masterly evocation of the state and psychology of imprisonment, ", " is one of the supreme works of Dickens's maturity.", "Stephen Wall's introduction examines Dickens's transformation of childhood memories of his father's incarceration in the Marshalsea debtors' prison. This revised edition includes expanded notes, appendices and suggestion for further reading by Helen Small, a chronology of Dickens's life and works, and original illustrations.", "Charles Dickens is one of the best-loved novelists in the English language, whose 200th anniversary was celebrated in 2012. His most famous books, including ", ", ", ", ", ", ", " and ", ", have been adapted for stage and screen and read by millions.", "If you enjoyed ", ", you might like Dickens's ", ", also available in Penguin Classics."], "author": "Charles Dickens", "num_pages": "985", "awards": [], "places": ["London, England"], "character_names": ["Amy \"Little Dorrit\" Dorrit", "Arthur Clennam", "Rigaud \"Blandois\"", "William Dorrit", "Fanny Dorrit", "Mr. Pancks", "Mrs. Clennam"], "language": "English", "publish_date": "2003-09-25 00:00:00", "ISBN": "0141439963"},
{"url": "https://www.goodreads.com/book/show/5326.A_Christmas_Carol", "num_ratings": "496,419", "num_reviews": "13,539", "avg_ratings": 4.03, "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Fantasy", "Literature", "Historical", "Historical Fiction", "Holiday", "Literature", "19th Century", "Classics", "Classic Literature", "Academic", "School"], "title": "A Christmas Carol", "description": ["'If I had my way, every idiot who goes around with Merry Christmas on his lips, would be boiled with his own pudding, and buried with a stake of holly through his heart. Merry Christmas? Bah humbug!'", "Charles Dickens' ghostly tale of sour and stingy miser Ebenezer Scrooge has captivated readers, listeners and audiences for over 150 years. This Christmas, Audible Studios brin", "'If I had my way, every idiot who goes around with Merry Christmas on his lips, would be boiled with his own pudding, and buried with a stake of holly through his heart. Merry Christmas? Bah humbug!'", "Charles Dickens' ghostly tale of sour and stingy miser Ebenezer Scrooge has captivated readers, listeners and audiences for over 150 years. This Christmas, Audible Studios brings this story to life in an audio drama featuring an all-star cast.", "Starring: Sir Derek Jacobi as Dickens, Kenneth Cranham as Ebenezer Scrooge, Roger Allam as Jacob Marley, Brendan Coyle as The Ghost Of Christmas Past, Miriam Margolyes as The Ghost Of Christmas Present, Tim McInnerny as The Ghost Of Christmas Yet To Come, Jamie Glover as Bob Cratchit, Emily Bruni as Mrs. Cratchit, Jenna Coleman as Belle, Joshua James as Young Scrooge And Hugh Skinner as Fred", "Public Domain (P)2016 Audible, Ltd"], "author": "Charles Dickens", "num_pages": "104", "awards": ["Audie Award for Classic (2005)"], "places": ["London, England"], "character_names": ["Timothy Cratchit", "Bob Cratchit", "Jacob Marley", "Ebenezer Scrooge"], "language": "English", "publish_date": "1999-09-23 00:00:00", "ISBN": "1561797464"},
{"url": "https://www.goodreads.com/book/show/18254.Oliver_Twist", "num_ratings": "274,803", "num_reviews": "5,929", "avg_ratings": 3.85, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Oliver Twist", "description": ["Named a \"national institution\" by George Orwell, Dickens offers his most popular tale, of the orphan who is reared in a workhouse and runs away to London-a novel of social protest, a morality tale, and a detective story."], "author": "Charles Dickens", "num_pages": "608", "awards": ["CityRead London (2012)"], "places": ["London, England", "City of London, London, England"], "character_names": ["Oliver Twist", "Artful Dodger", "Rose Maylie"], "language": "English", "publish_date": "2003-08-12 00:00:00", "ISBN": "0141439742"},
{"url": "https://www.goodreads.com/book/show/31242.Bleak_House", "num_ratings": "83,477", "num_reviews": "3,453", "avg_ratings": 4.0, "genres": ["Classics", "Fiction", "Literature", "Literature", "19th Century"], "title": "Bleak House", "description": ["Bleak House is a novel by Charles Dickens, published in 20 monthly installments between March 1852 and September 1853. It is held to be one of Dickens's finest novels, containing one of the most vast, complex and engaging arrays of minor characters and sub-plots in his entire canon.", "At the novel's core is long-running litigation in England's Court of Chancery, Jarndyce v Ja", "Bleak House is a novel by Charles Dickens, published in 20 monthly installments between March 1852 and September 1853. It is held to be one of Dickens's finest novels, containing one of the most vast, complex and engaging arrays of minor characters and sub-plots in his entire canon.", "At the novel's core is long-running litigation in England's Court of Chancery, Jarndyce v Jarndyce, which has far-reaching consequences for all involved. The litigation, which already has taken many years and consumed between £60,000 and £70,000 in court costs, is emblematic of the failure of Chancery.", "Though Chancery lawyers and judges criticised Dickens's portrait of Chancery as exaggerated and unmerited, his novel helped to spur an ongoing movement that culminated in the enactment of legal reform in the 1870s."], "author": "Charles Dickens", "num_pages": "1017", "awards": [], "places": ["United Kingdom"], "character_names": ["Esther Summerson", "Lady Dedlock", "John Jarndyce", "Sir Leicester Dedlock"], "language": "English", "publish_date": "2006-01-06 00:00:00", "ISBN": "0143037617"},
{"url": "https://www.goodreads.com/book/show/58696.David_Copperfield", "num_ratings": "175,719", "num_reviews": "5,132", "avg_ratings": 3.97, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "David Copperfield", "description": [" is the story of a young man’s adventures on his journey from an unhappy and impoverished childhood to the discovery of his vocation as a successful novelist. Among the gloriously vivid cast of characters he encounters are his tyrannical stepfather, Mr. Murdstone; his formidable aunt, Betsey Trotwood; the eternally humble yet treacherous Uriah Heep; frivol", " is the story of a young man’s adventures on his journey from an unhappy and impoverished childhood to the discovery of his vocation as a successful novelist. Among the gloriously vivid cast of characters he encounters are his tyrannical stepfather, Mr. Murdstone; his formidable aunt, Betsey Trotwood; the eternally humble yet treacherous Uriah Heep; frivolous, enchanting Dora; and the magnificently impecunious Micawber, one of literature’s great comic creations.", "In ", "—the novel he described as his “favorite child”—Dickens drew revealingly on his own experiences to create one of his most exuberant and enduringly popular works, filled with tragedy and comedy in equal measure."], "author": "Charles Dickens", "num_pages": "882", "awards": [], "places": [], "character_names": ["Richard Babley", "Mr. Barkis", "Mr. Chillip", "David Copperfield", "Mr. Creakle", "The Rev. Horace Crewler", "Uriah Heep", "Mr. Joram", "Mr. Jorkens", "Littimer", "Jack Maldon", "Mr. Charles Mell", "Mr. Wilkins  Micawber", "Master Wilkins Micawber", "Mr. Mills", "Mr. Edward Murdstone", "Mr. Omer", "Daniel Peggotty", "Ham Peggotty", "Mr. Quinion", "Mr. Francis Spenlow", "James Steerforth", "Dr. Strong", "Mr. Tiffey", "Thomas Traddles", "Mr. Wickfield", "Mrs. Clara Copperfield", "Mrs. Creakle", "Miss Creakle", "Mrs. Crewler", "Mrs. Crupp", "Rosa Dartle", "Little Emily", "Martha Endell", "Mrs. Gummidge", "Mrs. Heep", "Mrs. Marckleham", "Mrs. Emma Micawber", "Miss Emma Micawber", "Miss Julia Mills", "Miss Mowcher", "Miss Jane Murdstone", "Minnie Omer", "Clara Peggotty", "Miss Clarissa Spenlow", "Miss Dora Spenlow", "Miss Lavina Spenlow", "Mrs. Steerforth", "Mrs. Annie Strong", "Miss Betsey Trotwood", "Agnes Wickfield", "Miss Lavinia", "Little Em'ly", "Mr. Spenlow", "Miss Dartle", "Doady", "Anne Strong", "Sophy Crewler"], "language": "English", "publish_date": "2004-08-12 00:00:00", "ISBN": "0140439447"},
{"url": "https://www.goodreads.com/book/show/1953.A_Tale_of_Two_Cities", "num_ratings": "718,722", "num_reviews": "14,386", "avg_ratings": 3.82, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction"], "title": "A Tale of Two Cities", "description": ["After eighteen years as a political prisoner in the Bastille, the ageing Doctor Manette is finally released and reunited with his daughter in England. There the lives of two very different men, Charles Darnay, an exiled French aristocrat, and Sydney Carton, a disreputable but", "After eighteen years as a political prisoner in the Bastille, the ageing Doctor Manette is finally released and reunited with his daughter in England. There the lives of two very different men, Charles Darnay, an exiled French aristocrat, and Sydney Carton, a disreputable but brilliant English lawyer, become enmeshed through their love for Lucie Manette. From the tranquil roads of London, they are drawn against their will to the vengeful, bloodstained streets of Paris at the height of the Reign of Terror, and they soon fall under the lethal shadow of La Guillotine.", "This edition uses the text as it appeared in its serial publication in 1859 to convey the full scope of Dickens's vision, and includes the original illustrations by H. K. Browne ('Phiz'). Richard Maxwell's introduction discusses the intricate interweaving of epic drama with personal tragedy.", "--back cover"], "author": "Charles Dickens", "num_pages": "489", "awards": [], "places": ["Paris", "London, England"], "character_names": ["Sydney Carton", "Charles Darnay", "Lucie Manette", "Madame Therese Defarge", "Dr. Alexandre Manette"], "language": "English", "publish_date": "2003-08-12 00:00:00", "ISBN": "0141439602"},
{"url": "https://www.goodreads.com/book/show/2623.Great_Expectations", "num_ratings": "555,400", "num_reviews": "13,369", "avg_ratings": 3.76, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Great Expectations", "description": ["In what may be Dickens's best novel, humble, orphaned Pip is apprenticed to the dirty work of the forge but dares to dream of becoming a gentleman — and one day, under sudden and enigmatic circumstances, he finds himself in possession of \"great expectations.\" In this gripping tale of crime and guilt, revenge and reward, the compelling characters include Magwitch, the fearf", "In what may be Dickens's best novel, humble, orphaned Pip is apprenticed to the dirty work of the forge but dares to dream of becoming a gentleman — and one day, under sudden and enigmatic circumstances, he finds himself in possession of \"great expectations.\" In this gripping tale of crime and guilt, revenge and reward, the compelling characters include Magwitch, the fearful and fearsome convict; Estella, whose beauty is excelled only by her haughtiness; and the embittered Miss Havisham, an eccentric jilted bride."], "author": "Charles Dickens", "num_pages": "505", "awards": ["Audie Award for Classic (2010)", "Премія імені Максима Рильського (1993)"], "places": [], "character_names": ["Miss Havisham", "Philip \"Pip\" Pirrip", "Joseph \"Joe\" Gargery", "Abel Magwitch", "Herbert Pocket", "John Wemmick", "Dolge Orlick", "Jaggers", "Estella", "Compeyson"], "language": "English", "publish_date": "1998-08-12 00:00:00", "ISBN": "0192833596"},
{"url": "https://www.goodreads.com/book/show/805425.Complete_Ghost_Stories", "num_ratings": "2,296", "num_reviews": "200", "avg_ratings": 3.66, "genres": ["Classics", "Short Stories", "Horror", "Fiction", "Fantasy"], "title": "Complete Ghost Stories", "description": ["Interest in supernatural phenomena was high during Charles Dickens' lifetime. He had always loved a good ghost story himself, particularly at Christmas time, and was open-minded, willing to accept, and indeed put to the test, the existence of spirits.", "His natural inclinations toward drama and the macabre made him a brilliant teller of ghost tales, and in the twenty stories", "Interest in supernatural phenomena was high during Charles Dickens' lifetime. He had always loved a good ghost story himself, particularly at Christmas time, and was open-minded, willing to accept, and indeed put to the test, the existence of spirits.", "His natural inclinations toward drama and the macabre made him a brilliant teller of ghost tales, and in the twenty stories presented here, which include his celebrated ", ", the full range of his gothic talents can be seen.", "Chilling as some of these stories are, Dickens has managed to inject characteristically grotesque comedy as he writes of revenge, insanity, pre-cognition and dream visions, he indulges also in some debunking of contemporary credulity."], "author": "Charles Dickens", "num_pages": "329", "awards": [], "places": ["Great Britain"], "character_names": [], "language": "English", "publish_date": "1997-04-01 00:00:00", "ISBN": "1853267341"},
{"url": "https://www.goodreads.com/book/show/492899.Five_Novels", "num_ratings": "3,716", "num_reviews": "30", "avg_ratings": 4.23, "genres": ["Classics", "Fiction", "Literature"], "title": "Five Novels: Oliver Twist, A Christmas Carol, David Copperfield, A Tale of Two Cities, Great Expectations", "description": ["Five Novels, Complete and Unabridged: Oliver Twist, A Christmas Carol, David Copperfield, A Tale of Two Cities, and Great Expectations."], "author": "Charles Dickens", "num_pages": "1483", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-12 00:00:00", "ISBN": "0760775001"},
{"url": "https://www.goodreads.com/book/show/5336.Four_Complete_Novels", "num_ratings": "3,237", "num_reviews": "47", "avg_ratings": 4.28, "genres": ["Classics", "Fiction", "Literature"], "title": "Four Complete Novels: Great Expectations/Hard Times/A Christmas Carol/A Tale of Two Cities", "description": ["Includes the major works by one of the greatest names in literature. Namely, ", " and ", ". This Library of Literary Classics edition is bound in padded leather with luxurious gold-stamping on the front and spine, satin ribbon marker and gilded edges. Other titles in this Library of Literary Classics series inclu", "Includes the major works by one of the greatest names in literature. Namely, ", " and ", ". This Library of Literary Classics edition is bound in padded leather with luxurious gold-stamping on the front and spine, satin ribbon marker and gilded edges. Other titles in this Library of Literary Classics series include: Charlotte & Emily Bronte: The Complete Novels; Edgar Allan Poe: Selected Works; Mark Twain: Selected Works; Jane Austen: The Complete Novels: Lewis Carroll: The Complete, Fully Illustrated Works; and William Shakespeare: The Complete Works."], "author": "Charles Dickens", "num_pages": "848", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-10-03 00:00:00", "ISBN": "0517053608"},
{"url": "https://www.goodreads.com/book/show/5341.The_Unabridged_Charles_Dickens", "num_ratings": "151", "num_reviews": "14", "avg_ratings": 4.4, "genres": ["Classics", "Fiction"], "title": "The Unabridged Charles Dickens", "description": ["This collection includes versions of Oliver Twist, A Tale of Two Cities, and Great Expectations."], "author": "Charles Dickens", "num_pages": "1248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-10-31 00:00:00", "ISBN": "0762406720"},
{"url": "https://www.goodreads.com/book/show/17163865-charles-dickens-ghost-stories", "num_ratings": "2,296", "num_reviews": "200", "avg_ratings": 3.66, "genres": ["Classics", "Short Stories", "Horror", "Fiction", "Fantasy"], "title": "Charles Dickens' Ghost Stories", "description": ["Sepanjang hidupnya, Charles Dickens menunjukkan minat yang tinggi pada fenomena-fenomena supranatural. Dia sendiri berpikiran terbuka dan menerima eksistensi dari fenomena-fenomena supranatural.", "Kesukaannya dengan drama dan cerita-cerita bertemakan hantu menjadikannya salah satu penulis hebat tentang kisah-kisah hantu. Dalam buku ini, ditampilkan beberapa karya terbaiknya,", "Sepanjang hidupnya, Charles Dickens menunjukkan minat yang tinggi pada fenomena-fenomena supranatural. Dia sendiri berpikiran terbuka dan menerima eksistensi dari fenomena-fenomena supranatural.", "Kesukaannya dengan drama dan cerita-cerita bertemakan hantu menjadikannya salah satu penulis hebat tentang kisah-kisah hantu. Dalam buku ini, ditampilkan beberapa karya terbaiknya, berkaitan dengan fenomena spiritual dan eksistensi mereka, makhluk yang konon hidup berdampingan dengan kita."], "author": "Charles Dickens", "num_pages": "256", "awards": [], "places": ["Great Britain"], "character_names": [], "language": "Indonesian", "publish_date": "2012-08-12 00:00:00", "ISBN": "9797943836"},
{"url": "https://www.goodreads.com/book/show/11083123-old-curiosity-shop-vol-1", "num_ratings": "31", "num_reviews": "3", "avg_ratings": 3.48, "genres": ["Fiction"], "title": "Old Curiosity Shop, Vol 1", "description": ["Book may have numerous typos, missing text, images, or index. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. You can also preview excerpts of the book there. Purchasers are also entitled to a free trial membership in the General Books Club where they can select from more than a million books without charg", "Book may have numerous typos, missing text, images, or index. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. You can also preview excerpts of the book there. Purchasers are also entitled to a free trial membership in the General Books Club where they can select from more than a million books without charge."], "author": "Charles Dickens", "num_pages": "148", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-12 00:00:00", "ISBN": "1154056279"}
]