[
{"url": "https://www.goodreads.com/book/show/358717.Conversations_with_John_Steinbeck", "num_ratings": "36", "num_reviews": "2", "avg_ratings": 4.22, "genres": ["Nonfiction"], "title": "Conversations with John Steinbeck", "description": ["Collections of interviews with notable modern writers"], "author": "Thomas C. Fensch", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-08-01 00:00:00", "ISBN": "0878053603"},
{"url": "https://www.goodreads.com/book/show/186371.The_Short_Reign_of_Pippin_IV", "num_ratings": "2,031", "num_reviews": "157", "avg_ratings": 3.52, "genres": ["Fiction", "Classics", "Humor", "Literature", "Literature", "American"], "title": "The Short Reign of Pippin IV", "description": ["Steinbeck's only work of political satire turns the French Revolution on its head, as amateur astronomer Pippin Heristal is drafted in to rule the unruly French. Enchanting comedy ensues as Steinbeck creates the most hilarious royal court ever around the brief, bold reign of the corduroy-clad Pippin, his social-climbing wife Maria, his star-struck daughter Clotilde and her", "Steinbeck's only work of political satire turns the French Revolution on its head, as amateur astronomer Pippin Heristal is drafted in to rule the unruly French. Enchanting comedy ensues as Steinbeck creates the most hilarious royal court ever around the brief, bold reign of the corduroy-clad Pippin, his social-climbing wife Maria, his star-struck daughter Clotilde and her Californian beau, Todd."], "author": "John Steinbeck", "num_pages": "192", "awards": [], "places": [], "character_names": ["Pippin Heristal"], "language": "English", "publish_date": "2001-01-18 00:00:00", "ISBN": "0141186054"},
{"url": "https://www.goodreads.com/book/show/28910.Journal_of_a_Novel", "num_ratings": "1,010", "num_reviews": "125", "avg_ratings": 4.11, "genres": ["Nonfiction", "Language", "Writing", "Biography", "Classics", "Autobiography", "Memoir"], "title": "Journal of a Novel: The East of Eden Letters", "description": ["Each working day from January 29 to November 1, 1951, John Steinbeck warmed up to the work of writing ", " and a letter to the late Pascal Covici, his friend and editor of the Viking Press. It was his way, he said, of \"getting my mental arm in shape to pitch a good game.\"", "Each working day from January 29 to November 1, 1951, John Steinbeck warmed up to the work of writing ", " and a letter to the late Pascal Covici, his friend and editor of the Viking Press. It was his way, he said, of \"getting my mental arm in shape to pitch a good game.\""], "author": "John Steinbeck", "num_pages": "182", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-12-01 00:00:00", "ISBN": "0140144188"},
{"url": "https://www.goodreads.com/book/show/78274.The_Harvest_Gypsies", "num_ratings": "620", "num_reviews": "74", "avg_ratings": 3.83, "genres": ["History", "Nonfiction", "Classics", "Writing", "Journalism", "Literature", "American", "Literature", "Social", "Business", "Writing", "Essays", "Literary Fiction"], "title": "The Harvest Gypsies: On the Road to The Grapes of Wrath", "description": ["With the inquisitiveness of an investigative reporter and the emotional power of a novelist in his prime, Steinbeck toured the squatters' camps and Hoovervilles of California. Here he found once strong, independent farmers so reduced in dignity, sick, sullen, and defeated that they had been cast down to a kind of subhumanity. He contrasts their misery with the hope offered", "With the inquisitiveness of an investigative reporter and the emotional power of a novelist in his prime, Steinbeck toured the squatters' camps and Hoovervilles of California. Here he found once strong, independent farmers so reduced in dignity, sick, sullen, and defeated that they had been cast down to a kind of subhumanity. He contrasts their misery with the hope offered by government resettlement camps, where self-help communities were restoring dignity and indeed saving lives. The Harvest Gypsies gives us an eyewitness account of the horrendous Dust Bowl migration and provides the factual foundation for Steinbeck's masterpiece, The Grapes of Wrath. Included are twenty-two photographs by Dorothea Lange and others, many of which accompanied Steinbeck's original articles."], "author": "John Steinbeck", "num_pages": "62", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "1890771619"},
{"url": "https://www.goodreads.com/book/show/4795.The_Steinbeck_Centennial_Collection", "num_ratings": "163", "num_reviews": "16", "avg_ratings": 4.45, "genres": ["Fiction", "Classics"], "title": "The Steinbeck Centennial Collection: The Grapes of Wrath/Of Mice and Men/East of Eden/The Pearl/Cannery Row/Travels With Charley in Search of America (Boxed)", "description": ["The Steinbeck Centennial Collection: The Grapes of Wrath, Of Mice and Men, East of Eden, The Pearl, Cannery Row, Travels With Charley In Search of America (Boxed Set) Description: No writer is more quintessentially American than John Steinbeck. Born in 1902 in Salinas, California, Steinbeck attended Stanford University before working at a series of mostly blue-collar jobs", "The Steinbeck Centennial Collection: The Grapes of Wrath, Of Mice and Men, East of Eden, The Pearl, Cannery Row, Travels With Charley In Search of America (Boxed Set) Description: No writer is more quintessentially American than John Steinbeck. Born in 1902 in Salinas, California, Steinbeck attended Stanford University before working at a series of mostly blue-collar jobs and embarking on his literary career. Profoundly committed to social progress, he used his writing to raise issues of labor exploitation and the plight of the common man, penning some of the greatest American novels of the twentieth century and winning such prestigious awards as the Pulitzer Prize and the National Book Award. He received the Nobel Prize in 1962, \"for his realistic and imaginative writings, combining as they do sympathetic humour and keen social perception.\" Today, more than thirty years after his death, he remains one of America's greatest writers and cultural figures. ", " The boxed set, containing deluxe trade paperback editions with french flaps, is being released in honor of the Steinbeck centennial being celebrated throughout 2002. Penguin Putnam Inc, in partnership with the Steinbeck Foundation and the Great Books Foundation is sponsoring numerous events throught the year."], "author": "John Steinbeck", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-02-05 00:00:00", "ISBN": "0147716756"},
{"url": "https://www.goodreads.com/book/show/141148.Working_Days", "num_ratings": "497", "num_reviews": "72", "avg_ratings": 4.0, "genres": ["Nonfiction", "Language", "Writing", "Biography", "Autobiography", "Memoir"], "title": "Working Days: The Journals of The Grapes of Wrath", "description": ["John Steinbeck wrote ", " during an astonishing burst of activity between June and October of 1938. Throughout the time he was creating his greatest work, Steinbeck faithfully kept a journal revealing his arduous journey toward its completion.The journal, like the novel it chronicles, tells a tale of dramatic proportions—of dogged determination and inspirati", "John Steinbeck wrote ", " during an astonishing burst of activity between June and October of 1938. Throughout the time he was creating his greatest work, Steinbeck faithfully kept a journal revealing his arduous journey toward its completion.The journal, like the novel it chronicles, tells a tale of dramatic proportions—of dogged determination and inspiration, yet also of paranoia, self-doubt, and obstacles. It records in intimate detail the conception and genesis of ", " and its huge though controversial success. It is a unique and penetrating portrait of an emblematic American writer creating an essential American masterpiece."], "author": "John Steinbeck", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1990-12-01 00:00:00", "ISBN": "0140144579"},
{"url": "https://www.goodreads.com/book/show/4797.Novels_1942_1952", "num_ratings": "417", "num_reviews": "17", "avg_ratings": 4.45, "genres": ["Fiction", "Classics", "Literature"], "title": "Novels 1942–1952: The Moon Is Down / Cannery Row / The Pearl / East of Eden", "description": ["The third volume in ", "’s authoritative edition of John Steinbeck’s writings shows him continuing to explore new subject matter and new approaches to storytelling. These four novels display the versatility and emotional directness that have made Steinbeck one of America’s most enduringly popular writers.", " (1942), set in an unnamed Scandina", "The third volume in ", "’s authoritative edition of John Steinbeck’s writings shows him continuing to explore new subject matter and new approaches to storytelling. These four novels display the versatility and emotional directness that have made Steinbeck one of America’s most enduringly popular writers.", " (1942), set in an unnamed Scandinavian country under German occupation, dramatizes the transformation of ordinary life under totalitarian rule and the underground struggle against the Nazi invaders. Told largely in dialogue, the book was conceived simultaneously as a novel and a play, and was successfully produced on Broadway. Although some American critics found its treatment of the German characters too sympathetic, ", " was widely read in occupied areas of Europe, where it was regarded as an inspiring contribution to the resistance.", "In ", " (1945) Steinbeck paid tribute to his closest friend, the marine biologist Ed Ricketts, in the central character of Doc, proprietor of the Western Biological Laboratory and spiritual and financial mainstay of a cast of philosophical drifters and hangers-on. The comic and bawdy evocation of Monterey’s sardine-canning district—\"a poem, a stink, a grating noise, a quality of light, a tone, a habit, a nostalgia, a dream\"—has made this one of the most popular of all of Steinbeck’s novels.", "Steinbeck’s long involvement with Mexican culture is distilled in ", " (1947). Expanding on an anecdote he heard in Baja California about a local boy who had found a pearl of unusual size, Steinbeck turned it into a parable of the corrupting influence of sudden wealth. The Pearl appears here with the original illustrations by José Clemente Orozco.", "Ambitious in scale and original in structure, ", " (1952) recounts the violent and emotionally turbulent history of a Salinas Valley family through several generations. Drawing on Biblical parallels, encompassing a period stretching from the Civil War to World War I, and incorporating, as counterpoint to the central story, some of the actual history of Steinbeck’s mother’s family, ", " is an epic that explores the writer’s deepest and most anguished concerns within a landscape that for him had mythic resonance. (", " was a recent selection of Oprah’s Book Club.)"], "author": "John Steinbeck", "num_pages": "983", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-02-18 00:00:00", "ISBN": "1931082073"},
{"url": "https://www.goodreads.com/book/show/16249513-steinbeck-in-vietnam", "num_ratings": "110", "num_reviews": "22", "avg_ratings": 3.84, "genres": ["Nonfiction", "War"], "title": "Steinbeck in Vietnam: Dispatches from the War", "description": ["Although his career continued for almost three decades after the 1939 publication of The Grapes of Wrath, John Steinbeck is still most closely associated with his Depression-era works of social struggle. But from Pearl Harbor on, he often wrote passionate accounts of America's wars based on his own firsthand experience. Vietnam was no exception.", "Thomas E. Barden's \"Steinbec", "Although his career continued for almost three decades after the 1939 publication of The Grapes of Wrath, John Steinbeck is still most closely associated with his Depression-era works of social struggle. But from Pearl Harbor on, he often wrote passionate accounts of America's wars based on his own firsthand experience. Vietnam was no exception.", "Thomas E. Barden's \"Steinbeck in Vietnam\" offers for the first time a complete collection of the dispatches Steinbeck wrote as a war correspondent for \"Newsday.\" Rejected by the military because of his reputation as a subversive, and reticent to document the war officially for the Johnson administration, Steinbeck saw in \"Newsday\" a unique opportunity to put his skills to use. Between December 1966 and May 1967, the sixty-four-year-old Steinbeck toured the major combat areas of South Vietnam and traveled to the north of Thailand and into Laos, documenting his experiences in a series of columns titled Letters to Alicia, in reference to \"Newsday\" publisher Harry F. Guggenheim's deceased wife. His columns were controversial, coming at a time when opposition to the conflict was growing and even ardent supporters were beginning to question its course. As he dared to go into the field, rode in helicopter gunships, and even fired artillery pieces, many detractors called him a warmonger and worse. Readers today might be surprised that the celebrated author would risk his literary reputation to document such a divisive war, particularly at the end of his career.", "Drawing on four primary-source archives--the Steinbeck collection at Princeton, the Papers of Harry F. Guggenheim at the Library of Congress, the Pierpont Morgan Library's Steinbeck holdings, and the archives of \"Newsday\"--Barden's collection brings together the last published writings of this American author of enduring national and international stature. In addition to offering a definitive edition of these essays, Barden includes extensive notes as well as an introduction that provides background on the essays themselves, the military situation, the social context of the 1960s, and Steinbeck's personal and political attitudes at the time."], "author": "John Steinbeck", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-25 00:00:00", "ISBN": "0813934036"},
{"url": "https://www.goodreads.com/book/show/4801.The_Grapes_of_Wrath_and_Other_Writings_1936_1941", "num_ratings": "834", "num_reviews": "29", "avg_ratings": 4.42, "genres": ["Literature", "Fiction", "Literary Fiction"], "title": "The Grapes of Wrath and Other Writings 1936–1941: The Long Valley / The Grapes of Wrath / The Log from the Sea of Cortez / The Harvest Gypsies", "description": ["The second volume in the ", "’s authoritative edition of John Steinbeck features his acknowledged masterpiece, ", ". Written in an incredibly compressed five-month period, the novel had an electrifying impact upon publication in 1939, unleashing a political storm with its vision of America’s dispossessed struggling for survival. It continues to", "The second volume in the ", "’s authoritative edition of John Steinbeck features his acknowledged masterpiece, ", ". Written in an incredibly compressed five-month period, the novel had an electrifying impact upon publication in 1939, unleashing a political storm with its vision of America’s dispossessed struggling for survival. It continues to exert a powerful influence on American culture, and has inspired artists as diverse as John Ford, Woody Guthrie, and Bruce Springsteen. Tracing the journey of the Joad family from the dust bowl of Oklahoma to the migrant camps of California, Steinbeck creates an American epic, spacious, impassioned, and pulsating with the rhythms of living speech. The novel won the Pulitzer Prize and has since sold millions of copies worldwide.", "This text of ", " has been newly edited based on Steinbeck’s manuscript, typescript, and proofs. Many errors have been corrected, and words omitted or misconstrued by his typist have been restored. In addition, ", ", his 1936 investigative report on migrant workers, which laid the groundwork for the novel, is included as an appendix.", " (1938) displays Steinbeck’s brilliance as a writer of short stories, including such classics as “The Chrysanthemums,” “The White Quail,” “Flight,” and “The Red Pony.” Set in the Salinas Valley landscape that was Steinbeck’s enduring inspiration, the stories explore moments of fear, tenderness, isolation, and violence with poetic intensity.", ", an account of the 1940 marine biological expedition in which Steinbeck participated with his close friend Ed Ricketts, is a unique blend of science, philosophy, and adventure, as well as one of Steinbeck’s most revealing expositions of his core beliefs. First published in 1941 as part of the collaborative volume ", ", Steinbeck’s narrative was reissued separately a decade later, augmented by the moving tribute “About Ed Ricketts.”", "This volume contains a newly researched chronology, notes, and an essay on textual selection. It is the second of four volumes in The Library of America edition of John Steinbeck’s writings."], "author": "John Steinbeck", "num_pages": "1088", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-09-01 00:00:00", "ISBN": "1883011159"},
{"url": "https://www.goodreads.com/book/show/6714402-bombs-away", "num_ratings": "274", "num_reviews": "47", "avg_ratings": 3.15, "genres": ["Nonfiction", "History", "Classics", "War", "World War II"], "title": "Bombs Away: The Story of a Bomber Team", "description": ["On the heels of the enormous success of his masterwork ", "and at the height of the American war effort John Steinbeck, one of the most prolific and influential literary figures of his generation, wrote ", ", a nonfiction acco", "On the heels of the enormous success of his masterwork ", "and at the height of the American war effort John Steinbeck, one of the most prolific and influential literary figures of his generation, wrote ", ", a nonfiction account of his experiences with U.S. Army Air Force bomber crews during World War II. Now, for the first time since its original publication in 1942, Penguin Classics presents this exclusive edition of Steinbeck's introduction to the then-nascent U.S. Army Air Force and its bomber crew--the essential core unit behind American air power that Steinbeck described as \"the greatest team in the world.\"", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."], "author": "John Steinbeck", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-07-08 00:00:00", "ISBN": "0143105914"},
{"url": "https://www.goodreads.com/book/show/526578.Of_Mice_and_Men", "num_ratings": "238", "num_reviews": "18", "avg_ratings": 4.13, "genres": ["Plays", "Classics", "Plays", "Theatre", "Drama", "Literature"], "title": "Of Mice and Men: The Play", "author": "John Steinbeck", "num_pages": "71", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1950-12-01 00:00:00", "ISBN": "0822208385"},
{"url": "https://www.goodreads.com/book/show/18483765-steinbeck", "num_ratings": "11", "num_reviews": "2", "avg_ratings": 4.64, "genres": [], "title": "Steinbeck: Citizen Spy", "description": ["This changes everything we thought we knew about John Steinbeck. ", "After languishing in the CIA’s archives for 60 years, a letter is uncovered in John Steinbeck’s own hand that shatters everything history tells us about the author’s life. Written in 1952, to CIA Director Walter Bedell Smith, Steinbeck makes an offer to become an asset for the Agency during a trip to Europe l", "This changes everything we thought we knew about John Steinbeck. ", "After languishing in the CIA’s archives for 60 years, a letter is uncovered in John Steinbeck’s own hand that shatters everything history tells us about the author’s life. Written in 1952, to CIA Director Walter Bedell Smith, Steinbeck makes an offer to become an asset for the Agency during a trip to Europe later that year. More shocking than Steinbeck’s letter is Smith’s reply accepting John’s proposal. ", "Discovered by author Brian Kannard, these letters create the tantalizing proposal that John Steinbeck was, in fact, a CIA spy. Utilizing information from Steinbeck’s FBI file, John’s own correspondence, and interviews with John’s son Thomas Steinbeck, playwright Edward Albee, a former CIA intelligence officer, and others, Steinbeck: Citizen Spy uncovers the secret life of American cultural icon and Nobel Prize–winner, John Steinbeck. ", "•Did Steinbeck actively gather information for the intelligence community during his 1947 and 1963 trips to the Soviet Union? ", "•Why was the controversial author of The Grapes of Wrath never called before the House Select Committee on Un-American Activities, despite alleged ties to Communist organizations? ", "•Did the CIA influence Steinbeck to produce Cold War propaganda as part of Operation MOCKINGBIRD? ", "•Why did the CIA admit to the Church Committee in 1975 that Steinbeck was a subject of their illegal mail-opening program known as HTLINGUAL? ", "These and a host of other resources leave little doubt that there are depths yet unplumbed in the life of one of America’s most treasured authors. Just how heavily was Steinbeck involved in CIA operations? What did he know? And how much did he sacrifice for his country? Steinbeck: Citizen Spy brings us one step closer to the truth. ", "This text includes a note in the introduction from Thomas Steinbeck."], "author": "Brian Kannard", "num_pages": "354", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-12 00:00:00", "ISBN": "0989029395"},
{"url": "https://www.goodreads.com/book/show/2332001.Up_Close", "num_ratings": "34", "num_reviews": "4", "avg_ratings": 3.62, "genres": ["Biography", "Nonfiction", "Language", "Writing"], "title": "Up Close: John Steinbeck (Up Close)", "description": ["John Steinbeck consistently appears on class reading lists across the U.S., and his work has influenced generations. Steinbeck lived and wrote during some of the most eventful and controversial eras of twentieth-century America, including the struggles of California’s migrant workers during the 1930s, which led to his masterpiece, ", ".", "John Steinbeck consistently appears on class reading lists across the U.S., and his work has influenced generations. Steinbeck lived and wrote during some of the most eventful and controversial eras of twentieth-century America, including the struggles of California’s migrant workers during the 1930s, which led to his masterpiece, ", "."], "author": "Milton Meltzer", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-10 00:00:00", "ISBN": "0670061395"},
{"url": "https://www.goodreads.com/book/show/202400.A_Russian_Journal", "num_ratings": "1,707", "num_reviews": "179", "avg_ratings": 4.05, "genres": ["Nonfiction", "Travel", "History", "Cultural", "Russia", "Classics", "Literature", "American"], "title": "A Russian Journal", "description": ["Just after the iron curtain fell on Eastern Europe John Steinbeck and acclaimed war photographer, Robert Capa ventured into the Soviet Union to report for the New York Herald Tribune. This rare opportunity took the famous travellers not only to Moscow and Stalingrad - now Volgograd - but through the countryside of the Ukraine and the Caucasus. A RUSSIAN JOURNAL is the dist", "Just after the iron curtain fell on Eastern Europe John Steinbeck and acclaimed war photographer, Robert Capa ventured into the Soviet Union to report for the New York Herald Tribune. This rare opportunity took the famous travellers not only to Moscow and Stalingrad - now Volgograd - but through the countryside of the Ukraine and the Caucasus. A RUSSIAN JOURNAL is the distillation of their journey and remains a remarkable memoir and unique historical document. Steinbeck and Capa recorded the grim realities of factory workers, government clerks, and peasants, as they emerged from the rubble of World War II. This is an intimate glimpse of two artists at the height of their powers, answering their need to document human struggle"], "author": "John Steinbeck", "num_pages": "240", "awards": [], "places": ["Russian Federation"], "character_names": [], "language": "English", "publish_date": "2001-05-03 00:00:00", "ISBN": "014118633X"},
{"url": "https://www.goodreads.com/book/show/4798.John_Steinbeck_Writer", "num_ratings": "191", "num_reviews": "10", "avg_ratings": 4.14, "genres": ["Biography", "Nonfiction", "Biography Memoir", "Literature", "American"], "title": "John Steinbeck, Writer", "description": ["Winner of the 1940 Pulitzer Prize for ", " (1939) and recipient of the Nobel Prize in 1962, John Steinbeck (1902-1968) was one of America's most important and influential writers. Jackson J. Benson's definitive biography explores every aspect of the author's life-his campaigns for the rights of the little people; his stand on the Vietnam War; his Hollywood f", "Winner of the 1940 Pulitzer Prize for ", " (1939) and recipient of the Nobel Prize in 1962, John Steinbeck (1902-1968) was one of America's most important and influential writers. Jackson J. Benson's definitive biography explores every aspect of the author's life-his campaigns for the rights of the little people; his stand on the Vietnam War; his Hollywood film scripts; and his ongoing difficulties with fame, the press, and lack of privacy-to reveal the private man behind the public persona.", "* Winner of the PEN-USA West award for non-fiction"], "author": "Jackson J. Benson", "num_pages": "1184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-12-01 00:00:00", "ISBN": "014014417X"},
{"url": "https://www.goodreads.com/book/show/4800.Once_There_Was_a_War", "num_ratings": "1,616", "num_reviews": "163", "avg_ratings": 3.88, "genres": ["History", "Nonfiction", "Classics", "War"], "title": "Once There Was a War", "description": ["Nobel laureate John Steinbeck's bracing from-the-frontlines account of World War II-now with a new cover and introduction** In 1943 John Steinbeck was on assignment for ", ", writing from Italy and North Africa, and from England in the midst of the London blitz. In his dispatches he focuses on the human-scale effect of the war, portraying everyone fr", "Nobel laureate John Steinbeck's bracing from-the-frontlines account of World War II-now with a new cover and introduction** In 1943 John Steinbeck was on assignment for ", ", writing from Italy and North Africa, and from England in the midst of the London blitz. In his dispatches he focuses on the human-scale effect of the war, portraying everyone from the guys in a bomber crew to Bob Hope on his USO tour and even fighting alongside soldiers behind enemy lines. Taken together, these writings create an indelible portrait of life in wartime."], "author": "John Steinbeck", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-05-03 00:00:00", "ISBN": "0141186321"},
{"url": "https://www.goodreads.com/book/show/425993.The_Portable_Steinbeck", "num_ratings": "103", "num_reviews": "9", "avg_ratings": 4.18, "genres": ["Fiction", "Classics", "Short Stories"], "title": "The Portable Steinbeck", "description": ["He wrote about poor people struggling to survive and about dispossessed people grappling for a piece of land they could call their own. He wrote about inarticulate men groping to express truths “locked in wordlessness.” He wrote about America—the land and the people—as though it were one living organism, and he did so more eloquently than anyone since Walt Whitman. In an e", "He wrote about poor people struggling to survive and about dispossessed people grappling for a piece of land they could call their own. He wrote about inarticulate men groping to express truths “locked in wordlessness.” He wrote about America—the land and the people—as though it were one living organism, and he did so more eloquently than anyone since Walt Whitman. In an extraordinarily prolific career that lasted from 1929 to the 1960s, John Steinbeck created stories and characters that, in the words of Pascal Covici, Jr., this volume’s editor, combine “the gusto of Homer … along with the thoughtfulness of Emerson.”", " is a grand sampling of this writer’s most important works. Here are the complete novels ", "and ", "together with self-contained excerpts from ", ",", ", ", "(celebrated as “America’s best strike novel”), ", ", his epic of the Okie migration of the Great Depression, ", ", ", ", ", "and other books; two previously uncollected short stories; and the 1962 Nobel Prize Acceptance Speech. The result is a collection that overflows with Steinbeck’s prodigal richness of language, humor that is by turns broad and deadpan sly, and empathy for even the most flawed and suffering of his characters."], "author": "John Steinbeck", "num_pages": "692", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1976-10-28 00:00:00", "ISBN": "0140150021"},
{"url": "https://www.goodreads.com/book/show/59515.Zapata", "num_ratings": "320", "num_reviews": "20", "avg_ratings": 3.62, "genres": ["Fiction", "Classics", "Drama", "Historical", "Historical Fiction"], "title": "Zapata", "description": ["A new volume which includes the original screenplay, with its copious director's notes, and the narrative - this has followed on from a previously undiscovered manuscript by Steinbeck being found in the UCLA Research Library - the narrative treatment of the story on which he based his screenplay."], "author": "John Steinbeck", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-07-05 00:00:00", "ISBN": "0141186283"},
{"url": "https://www.goodreads.com/book/show/202399.America_and_Americans_and_Selected_Nonfiction", "num_ratings": "669", "num_reviews": "64", "avg_ratings": 4.01, "genres": ["Nonfiction", "Writing", "Essays", "Classics", "History"], "title": "America and Americans and Selected Nonfiction", "description": ["More than four decades after his death, John Steinbeck remains one of the nation's most beloved authors. Yet few know of his career as a journalist who covered world events from the Great Depression to Vietnam. Now, this distinctive collection offers a portrait of the artist as citizen, deeply engaged in the world around him. In addition to the complete text of Steinbeck's", "More than four decades after his death, John Steinbeck remains one of the nation's most beloved authors. Yet few know of his career as a journalist who covered world events from the Great Depression to Vietnam. Now, this distinctive collection offers a portrait of the artist as citizen, deeply engaged in the world around him. In addition to the complete text of Steinbeck's last published book, ", ", this volume brings together for the first time more than fifty of Steinbeck's finest essays and journalistic pieces on Salinas, Sag Harbor, Arthur Miller, Woody Guthrie, the Vietnam War and more. This edition is edited by Steinbeck scholar Susan Shillinglaw and Steinbeck biographer Jackson J. Benson.", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."], "author": "John Steinbeck", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-04-29 00:00:00", "ISBN": "0142437417"},
{"url": "https://www.goodreads.com/book/show/170456.John_Steinbeck_s_Of_Mice_and_Men", "num_ratings": "29", "num_reviews": "1", "avg_ratings": 3.72, "genres": ["Criticism", "Literary Criticism"], "title": "John Steinbeck's Of Mice and Men (Bloom's Reviews)", "description": ["Includes a brief biography of John Steinbeck, thematic and structural analysis of the work, critical views, and an index of themes and ideas."], "author": "Harold Bloom", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1999-04-28 00:00:00", "ISBN": "0791041433"},
{"url": "https://www.goodreads.com/book/show/141150.John_Steinbeck_s_the_Grapes_of_Wrath", "num_ratings": "30", "num_reviews": "2", "avg_ratings": 4.1, "genres": ["Classics", "Criticism", "Literary Criticism"], "title": "John Steinbeck's the Grapes of Wrath", "description": ["This series offers a comprehensive look at some of the world's most important literary masterpieces. The Grapes of Wrath is John Steinbeck's compelling novel of social justice, chronicling the suffering of migrant workers in dust-bowl era United States. Ages 16+."], "author": "Harold Bloom", "num_pages": "100", "awards": [], "places": [], "character_names": ["Tom Joad", "Rose of Sharon Joad Rivers"], "language": "English", "publish_date": "2005-06-01 00:00:00", "ISBN": "0791082393"},
{"url": "https://www.goodreads.com/book/show/5307.Novels_and_Stories_1932_1937", "num_ratings": "334", "num_reviews": "28", "avg_ratings": 4.37, "genres": ["Fiction", "Classics", "Literature"], "title": "Novels and Stories 1932–1937: The Pastures of Heaven / To a God Unknown / Tortilla Flat / In Dubious Battle / Of Mice and Men", "description": ["John Steinbeck, from the very start of his career, evoked the landscape and people of central California with lyrical intensity and unflinching frankness. ", " presents for the first time in one volume Steinbeck’s early writings, which expressed his abiding concerns for community, social justice, and the elemental connection between nature and human socie", "John Steinbeck, from the very start of his career, evoked the landscape and people of central California with lyrical intensity and unflinching frankness. ", " presents for the first time in one volume Steinbeck’s early writings, which expressed his abiding concerns for community, social justice, and the elemental connection between nature and human society. In prose that blends the vernacular and the incantatory, the local and the mythic, these five works chart Steinbeck’s evolution into one of the greatest and most enduring popular of American novelists.", " (1932), a collection of interrelated stories, delineates the troubled inner lives and sometimes disastrous fates of families living in a seemingly tranquil California valley. The surface realism of Steinbeck’s first mature work is enriched by hints of uncanny forces at work beneath.", "“Deep down it’s mine, right to the center of the world,” says Salinas Valley farmer Joseph Wayne about his land in John Steinbeck’s ", " (1933). A sense of primeval magic dominates the novel as the farmer reverts to pagan nature worship and begins a tortuous journey toward catastrophe and ultimate understanding.", "Steinbeck’s sympathetic depiction of the raffish paisons of ", " (1935), a ramshackle district above Monterey, first won him popular attention. The Flat’s tenderhearted, resourceful, mildly corrupt, over-optimistic characters are a triumph of life-affirming humor.", "In ", " (1936) plunges into the political struggle of the 1930s and paints a vigorous fresco of a migrant fruit-pickers’ strike. Anticipating the collective portraiture of The Grapes of Wrath, Steinbeck poignantly traces the surges and shifts of group behavior.", "With ", " (1937), Steinbeck secured his status as one of the most influential American writers. Lennie and George, itinerant farmhands held together in the face of deprivation only by the frailest of dreams, have long since passed into American mythology. This novel, which Steinbeck called “such a simple little thing,” is now recognized as a masterpiece of concentrated emotional power."], "author": "John Steinbeck", "num_pages": "909", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-09-01 00:00:00", "ISBN": "1883011019"},
{"url": "https://www.goodreads.com/book/show/56072.Travels_with_Charley_and_Later_Novels_1947_1962", "num_ratings": "326", "num_reviews": "29", "avg_ratings": 4.21, "genres": ["Fiction", "Travel", "Literature", "Classics"], "title": "Travels with Charley and Later Novels 1947–1962:  The Wayward Bus / Burning Bright / Sweet Thursday / The Winter of Our Discontent / Travels with Charley in Search of America", "description": ["John Steinbeck was never content to repeat himself, and his restless search for new forms and fresh subject matter is fully evident in the books of his later years. This volume collects four novels that exhibit the full range of his gift, along with a travel book that has become one of his most enduringly popular works.", "In ", " (1947), Steinbeck leads a group of", "John Steinbeck was never content to repeat himself, and his restless search for new forms and fresh subject matter is fully evident in the books of his later years. This volume collects four novels that exhibit the full range of his gift, along with a travel book that has become one of his most enduringly popular works.", "In ", " (1947), Steinbeck leads a group of ill-matched passengers representing a spectrum of social types and classes, stranded by a washed-out bridge, on a circuitous journey that exposes cruelties, self-deceptions, and unsuspected moral strengths. The tone ranges from boisterous comedy to trenchant satirical observation of postwar America. ", " (1950), an allegory set against shifting backgrounds (circus, sea, farm) and revolving around the fear of sterility and the desire for self-perpetuation, marks Steinbeck’s involvement with the drama in its fusion of the forms of novel and play.", " (1954) marks Steinbeck’s return, in a mood of sometimes frothy comedy, to the characters and milieu of his earlier ", ". A love story set against the background of the local brothel, the Bear Flag, ", " is for all its intimations of melancholy one of the most lighthearted of Steinbeck’s books. It was subsequently adapted by Rodgers and Hammerstein into their musical ", ". Steinbeck’s final novel, ", " (1961) is set in an old Long Island whaling town modeled on Sag Harbor, where he had been spending time since 1953. The book breaks new ground in its depiction of the crass commercialism of contemporary America, and its impact on a protagonist with traditionalist values who is appalled but finally tempted by the encroaching sleaziness.", " (1962) was Steinbeck’s last published book. A record of his experiences and observations as he drove around America in a pickup truck, accompanied by his standard poodle Charley, it is filled with engaging, often humorous description and comes to a powerful climax in an encounter with racist demonstrators in New Orleans."], "author": "John Steinbeck", "num_pages": "1125", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-15 00:00:00", "ISBN": "1598530046"},
{"url": "https://www.goodreads.com/book/show/186367.Steinbeck", "num_ratings": "465", "num_reviews": "48", "avg_ratings": 4.31, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir"], "title": "Steinbeck: A Life in Letters", "description": ["For John Steinbeck, who hated the telephone, letter-writing was a preparation for work and a natural way for him to communicate his thoughts on people he liked and hated; on marriage, women, and children; on the condition of the world; and on his progress in learning his craft. Opening with letters written during Steinbeck's early years in California, and closing with a 19", "For John Steinbeck, who hated the telephone, letter-writing was a preparation for work and a natural way for him to communicate his thoughts on people he liked and hated; on marriage, women, and children; on the condition of the world; and on his progress in learning his craft. Opening with letters written during Steinbeck's early years in California, and closing with a 1968 note written in Sag Harbor, New York, ", " reveals the inner thoughts and rough character of this American author as nothing else has and as nothing else ever will."], "author": "John Steinbeck", "num_pages": "928", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-04-01 00:00:00", "ISBN": "0140042881"},
{"url": "https://www.goodreads.com/book/show/186364.Cup_of_Gold", "num_ratings": "2,325", "num_reviews": "215", "avg_ratings": 3.42, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Adventure", "Pirates", "Literature", "Adventure"], "title": "Cup of Gold: A Life of Sir Henry Morgan, Buccaneer, with Occasional Reference to History", "description": ["From the mid-1650s through the 1660s, Henry Morgan, a pirate and outlaw of legendary viciousness, ruled the Spanish Main. He ravaged the coasts of Cuba and America, striking terror wherever he went. Morgan was obsessive. He had two driving ambitions: to possess the beautiful woman called La Santa Roja and to conquer Panama, the “cup of gold.” Steinbeck’s first novel and so", "From the mid-1650s through the 1660s, Henry Morgan, a pirate and outlaw of legendary viciousness, ruled the Spanish Main. He ravaged the coasts of Cuba and America, striking terror wherever he went. Morgan was obsessive. He had two driving ambitions: to possess the beautiful woman called La Santa Roja and to conquer Panama, the “cup of gold.” Steinbeck’s first novel and sole work of historical fiction, Cup of Gold is a lush, lyrical swashbuckling pirate fantasy, and sure to add new dimensions to readers’ perceptions of this all-American writer. This edition features an introduction by Susan F. Beegel."], "author": "John Steinbeck", "num_pages": "187", "awards": [], "places": ["Caribbean", "Panama"], "character_names": [], "language": "English", "publish_date": "2008-08-12 00:00:00", "ISBN": "0141186127"},
{"url": "https://www.goodreads.com/book/show/4803.The_Log_from_the_Sea_of_Cortez", "num_ratings": "3,738", "num_reviews": "331", "avg_ratings": 3.83, "genres": ["Nonfiction", "Classics", "Travel", "Science", "Environment", "Nature"], "title": "The Log from the Sea of Cortez", "description": ["An alternate edition can be found ", ".", "In 1940 Steinbeck sailed in a sardine boat with his great friend the marine biologist, Ed Ricketts, to collect marine invertebrates from the beaches of the Gulf of California. The expedition was described by the two men in ", ", published in 1941. The day-to-day story of the trip is told here in the Log, which combines scienc", "An alternate edition can be found ", ".", "In 1940 Steinbeck sailed in a sardine boat with his great friend the marine biologist, Ed Ricketts, to collect marine invertebrates from the beaches of the Gulf of California. The expedition was described by the two men in ", ", published in 1941. The day-to-day story of the trip is told here in the Log, which combines science, philosophy and high-spirited adventure."], "author": "John Steinbeck", "num_pages": "288", "awards": [], "places": ["Mexico"], "character_names": [], "language": "English", "publish_date": "2001-01-18 00:00:00", "ISBN": "0141186070"},
{"url": "https://www.goodreads.com/book/show/287241.Burning_Bright", "num_ratings": "1,665", "num_reviews": "167", "avg_ratings": 3.44, "genres": ["Fiction", "Classics", "Plays", "Literature"], "title": "Burning Bright", "description": ["Written as a play in story form, this novel traces the story of a man ignorant of his own sterility, a wife who commits adultery to give her husband a child, the father of that child, and the outsider whose actions affect them all."], "author": "John Steinbeck", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-28 00:00:00", "ISBN": "014303944X"},
{"url": "https://www.goodreads.com/book/show/111300.To_a_God_Unknown", "num_ratings": "7,657", "num_reviews": "564", "avg_ratings": 3.93, "genres": ["Fiction", "Classics", "Literature", "Novels"], "title": "To a God Unknown", "description": ["While fulfilling his dead father's dream of creating a prosperous farm in California, Joseph Wayne comes to believe that a magnificent tree on the farm embodies his father's spirit. His brothers and their families share in Joseph's prosperity and the farm flourishes - until one brother, scared by Joseph's pagan belief, kills the tree and brings disease and famine on the fa", "While fulfilling his dead father's dream of creating a prosperous farm in California, Joseph Wayne comes to believe that a magnificent tree on the farm embodies his father's spirit. His brothers and their families share in Joseph's prosperity and the farm flourishes - until one brother, scared by Joseph's pagan belief, kills the tree and brings disease and famine on the farm. Set in familiar Steinbeck country, ", " is a mystical tale, exploring one man's attempt to control the forces of nature and to understand the ways of God."], "author": "John Steinbeck", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-11-30 00:00:00", "ISBN": "0141185503"},
{"url": "https://www.goodreads.com/book/show/186345.The_Long_Valley", "num_ratings": "3,736", "num_reviews": "252", "avg_ratings": 3.9, "genres": ["Fiction", "Short Stories", "Classics", "Literature"], "title": "The Long Valley", "description": ["This classic collection of short stories serves as the ideal introduction to Steinbeck's work. Set in the idyllic Salinas Valley in California, where simple people farm the land and struggle to find a place for themeselves in the world, these stories reflect many of the concerns key to Steinbeck as a writer; the tensions between town and city, labourers and owners, past an", "This classic collection of short stories serves as the ideal introduction to Steinbeck's work. Set in the idyllic Salinas Valley in California, where simple people farm the land and struggle to find a place for themeselves in the world, these stories reflect many of the concerns key to Steinbeck as a writer; the tensions between town and city, labourers and owners, past and present. Included here are the celebrated tales, THE MURDERER and THE CHRYSANTHEMUMS."], "author": "John Steinbeck", "num_pages": "233", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-11-30 00:00:00", "ISBN": "0141185511"},
{"url": "https://www.goodreads.com/book/show/93282.The_Acts_of_King_Arthur_and_His_Noble_Knights", "num_ratings": "4,953", "num_reviews": "329", "avg_ratings": 3.83, "genres": ["Fiction", "Fantasy", "Classics", "Mythology", "Arthurian", "Historical", "Historical Fiction", "Literature"], "title": "The Acts of King Arthur and His Noble Knights", "description": ["Steinbeck's first posthumously published work, The Acts of King Arthur and His Noble Knights is a reinterpretation of tales from Malory's Morte d'Arthur. In this highly successful attempt to render Malory into Modern English, Steinbeck recreated the rhythm and tone of the original Middle English."], "author": "John Steinbeck", "num_pages": "384", "awards": ["World Fantasy Award Nominee for Best Novel (1977)"], "places": [], "character_names": ["Merlin", "Sir Gawain", "Sir Mordred", "King Arthur"], "language": "English", "publish_date": "2001-05-03 00:00:00", "ISBN": "0141186305"},
{"url": "https://www.goodreads.com/book/show/186369.The_Pastures_of_Heaven", "num_ratings": "5,451", "num_reviews": "361", "avg_ratings": 4.04, "genres": ["Fiction", "Classics", "Short Stories", "Literature"], "title": "The Pastures of Heaven", "description": ["Each of these delightful interconnected tales is devoted to a family living in a fertile valley on the outskirts of Monterey, California, and the effects that one particular family has on them all. Steinbeck tackles two important literary traditions here; American naturalism, with its focus on the conflict between natural instincts and the demand to conform to society's no", "Each of these delightful interconnected tales is devoted to a family living in a fertile valley on the outskirts of Monterey, California, and the effects that one particular family has on them all. Steinbeck tackles two important literary traditions here; American naturalism, with its focus on the conflict between natural instincts and the demand to conform to society's norms, and the short story cycle. Set in the heart of 'Steinbeck land', the lush Californian valleys."], "author": "John Steinbeck", "num_pages": "207", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-03-01 00:00:00", "ISBN": "0141186097"},
{"url": "https://www.goodreads.com/book/show/78275.The_Wayward_Bus", "num_ratings": "7,390", "num_reviews": "469", "avg_ratings": 3.83, "genres": ["Fiction", "Classics", "Literature", "Novels"], "title": "The Wayward Bus", "description": ["In his first novel to follow the publication of his enormous success, ", "Steinbeck’s vision comes wonderfully to life in this imaginative and unsentimental chronicle of a bus traveling California’s back roads, transporting the lost and the lonely, the good and the greedy, the stupid and the scheming, the beautiful and the vicious away from their shattered", "In his first novel to follow the publication of his enormous success, ", "Steinbeck’s vision comes wonderfully to life in this imaginative and unsentimental chronicle of a bus traveling California’s back roads, transporting the lost and the lonely, the good and the greedy, the stupid and the scheming, the beautiful and the vicious away from their shattered dreams and, possibly, toward the promise of the future. This edition features an introduction by Gary Scharnhorst.", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."], "author": "John Steinbeck", "num_pages": "304", "awards": [], "places": ["Rebel Corners"], "character_names": ["Norma", "Juan Chicoy", "Alice Chicoy", "Pimples", "Elliott Pritchard", "Bernice Pritchard", "Mildred Pritchard", "Ernest Horton", "Camille Oaks"], "language": "English", "publish_date": "2006-03-28 00:00:00", "ISBN": "0142437875"},
{"url": "https://www.goodreads.com/book/show/56083.In_Dubious_Battle", "num_ratings": "9,882", "num_reviews": "614", "avg_ratings": 3.89, "genres": ["Fiction", "Classics", "Literature", "Historical", "Historical Fiction"], "title": "In Dubious Battle", "description": ["This 1936 novel—set in the California apple country—portrays a strike by migrant workers that metamorphoses from principled defiance into blind fanaticism.", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throu", "This 1936 novel—set in the California apple country—portrays a strike by migrant workers that metamorphoses from principled defiance into blind fanaticism.", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."], "author": "John Steinbeck", "num_pages": "304", "awards": ["California Book Award for General Literature (Silver) (1936)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-30 00:00:00", "ISBN": "0143039636"},
{"url": "https://www.goodreads.com/book/show/422447.The_Red_Pony", "num_ratings": "42,966", "num_reviews": "1,731", "avg_ratings": 3.43, "genres": ["Classics", "Fiction", "Literature", "Young Adult", "Animals"], "title": "The Red Pony", "description": ["Raised on a ranch in northern California, Jody is well-schooled in the hard work and demands of a rancher's life. He is used to the way of horses, too; but nothing has prepared him for the special connection he will forge with Gabilan, the hot-tempered pony his father gives him. With Billy Buck, the hired hand, Jody tends and trains his horse, restlessly anticipating the m", "Raised on a ranch in northern California, Jody is well-schooled in the hard work and demands of a rancher's life. He is used to the way of horses, too; but nothing has prepared him for the special connection he will forge with Gabilan, the hot-tempered pony his father gives him. With Billy Buck, the hired hand, Jody tends and trains his horse, restlessly anticipating the moment he will sit high upon Gabilan's saddle. But when Gabilan falls ill, Jody discovers there are still lessons he must learn about the ways of nature and, particularly, the ways of man."], "author": "John Steinbeck", "num_pages": "100", "awards": [], "places": [], "character_names": ["Jody Tiflin", "Billy Buck", "Carl Tiflin", "Gitano"], "language": "English", "publish_date": "1992-01-01 00:00:00", "ISBN": "0140177361"},
{"url": "https://www.goodreads.com/book/show/56077.Sweet_Thursday", "num_ratings": "10,819", "num_reviews": "691", "avg_ratings": 4.09, "genres": ["Fiction", "Classics", "Literature"], "title": "Sweet Thursday", "description": ["In Monterey, on the California coast, Sweet Thursday is what they call the day after Lousy Wednesday, which is one of those days that are just naturally bad. Returning to the scene of ", ", the weedy lots and junk heaps and flophouses of Monterey, John Steinbeck once more brings to life the denizens of a netherworld of laughter and tears from Fauna, new headmistress", "In Monterey, on the California coast, Sweet Thursday is what they call the day after Lousy Wednesday, which is one of those days that are just naturally bad. Returning to the scene of ", ", the weedy lots and junk heaps and flophouses of Monterey, John Steinbeck once more brings to life the denizens of a netherworld of laughter and tears from Fauna, new headmistress of the local brothel, to Hazel, a bum whose mother must have wanted a daughter."], "author": "John Steinbeck", "num_pages": "249", "awards": ["National Book Award Finalist for Fiction (1955)"], "places": ["United States of America", "Monterey Bay, California"], "character_names": [], "language": "English", "publish_date": "2008-07-29 00:00:00", "ISBN": "0143039474"},
{"url": "https://www.goodreads.com/book/show/4796.The_Winter_of_Our_Discontent", "num_ratings": "33,250", "num_reviews": "1,694", "avg_ratings": 3.99, "genres": ["Classics", "Fiction", "Literature", "Literature", "American"], "title": "The Winter of Our Discontent", "description": ["Ethan Allen Hawley, the protagonist of Steinbeck’s last novel, works as a clerk in a grocery store that his family once owned. With Ethan no longer a member of Long Island’s aristocratic class, his wife is restless, and his teenage children are hungry for the tantalizing material comforts he cannot provide. Then one day, in a moment of moral crisis, Ethan decides to take a", "Ethan Allen Hawley, the protagonist of Steinbeck’s last novel, works as a clerk in a grocery store that his family once owned. With Ethan no longer a member of Long Island’s aristocratic class, his wife is restless, and his teenage children are hungry for the tantalizing material comforts he cannot provide. Then one day, in a moment of moral crisis, Ethan decides to take a holiday from his own scrupulous standards.", "Set in Steinbeck’s contemporary 1960 America, the novel explores the tenuous line between private and public honesty that today ranks it alongside his most acclaimed works of penetrating insight into the American condition. This edition features an introduction and notes by Steinbeck scholar Susan Shillinglaw."], "author": "John Steinbeck", "num_pages": "336", "awards": [], "places": ["New Baytown", "New England"], "character_names": ["Danny Taylor", "Mr. Baker", "Ethan Allen Hawley", "Joey Morphy", "Margie Young-Hunt", "Alfio Maurello"], "language": "English", "publish_date": "2008-08-26 00:00:00", "ISBN": "0143039482"},
{"url": "https://www.goodreads.com/book/show/5306.Travels_with_Charley", "num_ratings": "57,483", "num_reviews": "4,209", "avg_ratings": 4.07, "genres": ["Nonfiction", "Travel", "Classics", "Autobiography", "Memoir", "Biography"], "title": "Travels with Charley: In Search of America", "description": ["To hear the speech of the real America, to smell the grass and the trees, to see the colors and the light—these were John Steinbeck's goals as he set out, at the age of fifty-eight, to rediscover the country he had been writing about for so many years.", "With Charley, his French poodl", "To hear the speech of the real America, to smell the grass and the trees, to see the colors and the light—these were John Steinbeck's goals as he set out, at the age of fifty-eight, to rediscover the country he had been writing about for so many years.", "With Charley, his French poodle, Steinbeck drives the interstates and the country roads, dines with truckers, encounters bears at Yellowstone and old friends in San Francisco. Along the way he reflects on the American character, racial hostility, the particular form of American loneliness he finds almost everywhere, and the unexpected kindness of strangers."], "author": "John Steinbeck", "num_pages": "214", "awards": [], "places": ["United States of America"], "character_names": ["John Steinbeck", "Charley (Travels with Charley)"], "language": "English", "publish_date": "2002-02-05 00:00:00", "ISBN": "0142000701"},
{"url": "https://www.goodreads.com/book/show/163977.Tortilla_Flat", "num_ratings": "37,508", "num_reviews": "1,975", "avg_ratings": 3.83, "genres": ["Fiction", "Classics", "Literature"], "title": "Tortilla Flat", "description": ["\"Steinbeck is an artist; and he tells the stories of these lovable thieves and adulterers with a gentle and poetic purity of heart and of prose.\" -- New York Herald Tribune", "Adopting the structure and themes of the Arthurian legend, Steinbeck created a \"Camelot\" on a shabby hillside above the town of Monterey,California and peopled it with a colorful band of knights. At the", "\"Steinbeck is an artist; and he tells the stories of these lovable thieves and adulterers with a gentle and poetic purity of heart and of prose.\" -- New York Herald Tribune", "Adopting the structure and themes of the Arthurian legend, Steinbeck created a \"Camelot\" on a shabby hillside above the town of Monterey,California and peopled it with a colorful band of knights. At the center of the tale is Danny, whose house, like Arthur's castle, becomes a gathering place for men looking for adventure, camaraderie, and a sense of belonging. These \"knights\" are ", ", men of mixed heritage, whose ancestors settled California hundreds of years before. Free of ties to jobs and other complications of the American way of life, they fiercely resist the corrupting tide of honest toil in the surrounding ocean of civil rectitude.", "As Steinbeck chronicles their deeds--their multiple loves, their wonderful brawls, their Rabelaisian wine-drinking--he spins a tale as compelling and ultimately as touched by sorrow as the famous legends of the Round Table, which inspired him."], "author": "John Steinbeck", "num_pages": "256", "awards": ["California Book Award for Fiction (Silver) (1935)"], "places": ["Monterey", "California"], "character_names": ["Danny", "Pablo Soler", "Pilon", "Jesus Maria Corcoran", "Pirate", "Torelli"], "language": "English", "publish_date": "2001-07-12 00:00:00", "ISBN": "0582461502"},
{"url": "https://www.goodreads.com/book/show/12722.The_Moon_Is_Down", "num_ratings": "16,602", "num_reviews": "1,197", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "War", "Literature"], "title": "The Moon Is Down", "description": ["Taken by surprise, a small coastal town is overrun by an invading army with little resistance. The town is important because it is a port that serves a large coal mine. Colonel Lanser, the head of the invading battalion, along with his staff establishes his HQ in the house of the democratically elected and popular Mayor Orden.", "As the reality of occupation sinks in and the w", "Taken by surprise, a small coastal town is overrun by an invading army with little resistance. The town is important because it is a port that serves a large coal mine. Colonel Lanser, the head of the invading battalion, along with his staff establishes his HQ in the house of the democratically elected and popular Mayor Orden.", "As the reality of occupation sinks in and the weather turns bleak, with the snows beginning earlier than usual, the \"simple, peaceful people\" of the town are angry and confused. Colonel Lanser, a veteran of many wars, tries to operate under a veil of civility and law, but in his heart he knows that \"there are no peaceful people\" amongst those whose freedom has been taken away by force. The veil is soon torn apart when Alexander Morden, an erstwhile alderman and \"a free man,\" is ordered to work in the mine. He strikes out at Captain Loft with a pick axe, but Captain Bentick steps into its path and dies of it. After a summary trial, Morden is executed by a firing squad. This incident catalyzes the people of the town and they settle into \"a slow, silent, waiting revenge.\" Sections of the railroad linking the port with the mine get damaged regularly, the machinery breaks down often, and the dynamo of the electricity generators gets short circuited. Whenever a soldier relaxes his guard, drinks or goes out with a woman, he is killed. Mayor Orden stands by his people, and tries to explain to Col. Lanser that his goal – \"to break man’s spirit permanently\" – is impossible.", "The cold weather and the constant fear weighs heavy on the occupying force, many of whom wish the war to end so that they can return home. They realize the futility of the war and that \"the flies have conquered the flypaper.\" Some members of the resistance escape to England and ask the English for explosives so that the townspeople can intensify their efforts. English planes parachute-drop small packages containing dynamite sticks and chocolates all around the town. In a state of panic, the army takes the Mayor and his friend Dr. Winter, the town doctor and historian, hostage and lets it be known that any action from resistance will lead to their execution. Mayor Orden knows that nothing can stop his people and that his death is imminent. He tells his wife that while he can be killed, the idea of Mayor (and freedom and democracy) is beyond the reach of any army. Before his execution, Mayor Orden reminds Dr. Winter of the dialogues of Socrates in the Apology, a part he played in the high school play, and tells him to make sure that the debt is repaid to the army, i.e., that the resistance is continued."], "author": "John Steinbeck", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-11-30 00:00:00", "ISBN": "0141185538"},
{"url": "https://www.goodreads.com/book/show/5308.The_Pearl", "num_ratings": "160,633", "num_reviews": "6,857", "avg_ratings": 3.43, "genres": ["Classics", "Fiction", "Literature", "Academic", "School"], "title": "The Pearl", "description": ["Like his father and grandfather before him, Kino is a poor diver, gathering pearls from the gulf beds that once brought great wealth to the kings of Spain and now provide Kino, Juana, and their infant son with meager subsistence. Then, on a day like any other, Kino emerges from the sea with a pearl as large as a sea gull’s egg, as “perfect as the moon.” With the pearl come", "Like his father and grandfather before him, Kino is a poor diver, gathering pearls from the gulf beds that once brought great wealth to the kings of Spain and now provide Kino, Juana, and their infant son with meager subsistence. Then, on a day like any other, Kino emerges from the sea with a pearl as large as a sea gull’s egg, as “perfect as the moon.” With the pearl comes hope, the promise of comfort and of security…", "A story of classic simplicity, based on a Mexican folk tale, ", " explores the secrets of man’s nature, greed, the darkest depths of evil, and the luminous possibilities of love."], "author": "John Steinbeck", "num_pages": "96", "awards": [], "places": ["Nayarit", "The Gulf", "La Paz", "Loreto", "Santa Rosalia"], "character_names": ["Kino", "Juana", "Coyotito", "Juan Tomas", "Apolonia"], "language": "English", "publish_date": "2002-01-08 00:00:00", "ISBN": "0142000698"},
{"url": "https://www.goodreads.com/book/show/4799.Cannery_Row", "num_ratings": "97,172", "num_reviews": "4,373", "avg_ratings": 4.03, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Cannery Row", "description": [" is a book without much of a plot. Rather, it is an attempt to capture the feeling and people of a place, the cannery district of Monterey, California, which is populated by a mix of those down on their luck and those who choose for other reasons not to live \"up the hill\" in the more respectable area of town. The flow of the main plot is frequently interrupted b", " is a book without much of a plot. Rather, it is an attempt to capture the feeling and people of a place, the cannery district of Monterey, California, which is populated by a mix of those down on their luck and those who choose for other reasons not to live \"up the hill\" in the more respectable area of town. The flow of the main plot is frequently interrupted by short vignettes that introduce us to various denizens of the Row, most of whom are not directly connected with the central story. These vignettes are often characterized by direct or indirect reference to extreme violence: suicides, corpses, and the cruelty of the natural world.", "The \"story\" of ", " follows the adventures of Mack and the boys, a group of unemployed yet resourceful men who inhabit a converted fish-meal shack on the edge of a vacant lot down on the Row.", "Sweet Thursday is the sequel to Cannery Row."], "author": "John Steinbeck", "num_pages": "181", "awards": [], "places": ["California", "Monterey"], "character_names": ["Eddie", "\"Doc\" Bradley Stanwick", "Dora", "Lee Chong", "Mack", "Hughie", "Gay", "Hazel", "Eddie, Doc, Dora, Lee Chong, Mack"], "language": "English", "publish_date": "2002-02-05 00:00:00", "ISBN": "014200068X"},
{"url": "https://www.goodreads.com/book/show/4395.The_Grapes_of_Wrath", "num_ratings": "608,764", "num_reviews": "14,197", "avg_ratings": 3.94, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "The Grapes of Wrath", "description": ["The Pulitzer Prize-winning epic of the Great Depression, a book that galvanized—and sometimes outraged—millions of readers.", "First published in 1939, Steinbeck’s Pulitzer Prize-winning epic of the Great Depression chronicles the Dust Bowl migration of the 1930s and tells the story of one Oklahoma farm family, the Joads—driven from their homestead and forced to travel west to", "The Pulitzer Prize-winning epic of the Great Depression, a book that galvanized—and sometimes outraged—millions of readers.", "First published in 1939, Steinbeck’s Pulitzer Prize-winning epic of the Great Depression chronicles the Dust Bowl migration of the 1930s and tells the story of one Oklahoma farm family, the Joads—driven from their homestead and forced to travel west to the promised land of California. Out of their trials and their repeated collisions against the hard realities of an America divided into Haves and Have-Nots evolves a drama that is intensely human yet majestic in its scale and moral vision, elemental yet plainspoken, tragic but ultimately stirring in its human dignity. A portrait of the conflict between the powerful and the powerless, of one man’s fierce reaction to injustice, and of one woman’s stoical strength, the novel captures the horrors of the Great Depression and probes into the very nature of equality and justice in America. At once a naturalistic epic, captivity narrative, road novel, and transcendental gospel, Steinbeck’s powerful landmark novel is perhaps the most American of American Classics."], "author": "John Steinbeck", "num_pages": "455", "awards": ["Pulitzer Prize for Novel (1940)", "National Book Award for Fiction (1939)", "California Book Award for General Literature (Silver) (1939)", "Audie Award for Classic (1999)"], "places": ["Oklahoma", "California"], "character_names": ["Tom Joad", "Rose of Sharon Joad Rivers", "Ma Joad", "Pa Joad", "Uncle John Joad", "Jim Casy", "Al Joad", "Ruthie Joad", "Winfield Joad", "Noah Joad", "Grampa Joad", "Granma Joad", "Connie Rivers"], "language": "English", "publish_date": "2002-01-08 00:00:00", "ISBN": "0142000663"},
{"url": "https://www.goodreads.com/book/show/890.Of_Mice_and_Men", "num_ratings": "1,643,767", "num_reviews": "27,536", "avg_ratings": 3.85, "genres": ["Classics", "Fiction", "Academic", "School", "Literature", "Historical", "Historical Fiction"], "title": "Of Mice and Men", "description": ["The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed", "The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed as Lennie, struggling against extreme cruelty, misunderstanding and feelings of jealousy, becomes a victim of his own strength. Tackling universal themes such as the friendship of a shared vision, and giving voice to America’s lonely and dispossessed, ", " has proved one of Steinbeck’s most popular works, achieving success as a novel, a Broadway play and three acclaimed films."], "author": "John Steinbeck", "num_pages": "112", "awards": ["New York Drama Critics' Circle Award for Best American Play (1938)"], "places": ["Salinas Valley, California", "California"], "character_names": ["George Milton", "Lennie Small", "Candy", "Curley", "Curley's Wife", "Slim", "Crooks", "Whit", "Carlson"], "language": "English", "publish_date": "2002-01-08 00:00:00", "ISBN": "0142000671"},
{"url": "https://www.goodreads.com/book/show/4406.East_of_Eden", "num_ratings": "363,659", "num_reviews": "15,921", "avg_ratings": 4.36, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "East of Eden", "description": ["In his journal, Nobel Prize winner John Steinbeck called East of Eden “the first book,” and indeed it has the primordial power and simplicity of myth. Set in the rich farmland of California’s Salinas Valley, this sprawling and often brutal novel follows the intertwined destinies of two families—the Trasks and the Hamiltons—whose generations helplessly reenact the fall of A", "In his journal, Nobel Prize winner John Steinbeck called East of Eden “the first book,” and indeed it has the primordial power and simplicity of myth. Set in the rich farmland of California’s Salinas Valley, this sprawling and often brutal novel follows the intertwined destinies of two families—the Trasks and the Hamiltons—whose generations helplessly reenact the fall of Adam and Eve and the poisonous rivalry of Cain and Abel.", "Adam Trask came to California from the East to farm and raise his family on the new rich land. But the birth of his twins, Cal and Aaron, brings his wife to the brink of madness, and Adam is left alone to raise his boys to manhood. One boy thrives nurtured by the love of all those around him; the other grows up in loneliness enveloped by a mysterious darkness.", "First published in 1952, East of Eden is the work in which Steinbeck created his most mesmerizing characters and explored his most enduring themes: the mystery of identity, the enecplicability of love, and the murderous consequences of love's absence. A masterpiece of Steinbeck's later years, East of Eden is a powerful and vastly ambitious novel that is at once a family saga and a modern retelling of the Book of Genesis.", "--jacket flap"], "author": "John Steinbeck", "num_pages": "601", "awards": ["Audie Award for Classic (2004)", "National Book Award Finalist for Fiction (1953)"], "places": ["California"], "character_names": ["Mr. Edwards", "Ethel", "Lee", "Faye", "Tom Hamilton", "Cyrus Trask", "Mrs. Trask", "Alice Trask", "Adam Trask", "Charles Trask", "Aron Trask", "Caleb Trask", "Samuel Hamilton", "Liza Hamilton", "George Hamilton", "Will Hamilton", "Joe Hamilton", "Lizzie Hamilton", "Una Hamilton", "Dessie Hamilton", "Olive Hamilton", "Mollie Hamilton", "Cathy Ames", "Abra Bacon", "Joe Valery"], "language": "English", "publish_date": "2002-08-12 00:00:00", "ISBN": "0142000655"}
]