[
{"url": "https://www.goodreads.com/book/show/7636909-32-candles", "num_ratings": "4,066", "num_reviews": "752", "avg_ratings": 4.15, "genres": ["Fiction", "Cultural", "African American", "Womens Fiction", "Chick Lit", "Romance", "Contemporary", "Humor"], "title": "32 Candles", "description": ["This debut novel of longing for family, love, and acceptance finds some interesting territory before settling too early into inevitability. Davidia Jones, a nerdy child of poverty, is abused by her alcoholic mother and despicable father and is the subject of merciless taunting at her high school. But it's the \"Molly Ringwald Ending\" that guides this fragile 15-year-old whe", "This debut novel of longing for family, love, and acceptance finds some interesting territory before settling too early into inevitability. Davidia Jones, a nerdy child of poverty, is abused by her alcoholic mother and despicable father and is the subject of merciless taunting at her high school. But it's the \"Molly Ringwald Ending\" that guides this fragile 15-year-old when she bolts town with a lesbian trucker named Mama Jane and lands a gig as a '40s-style chanteuse in L.A. With a little Hollywood stardust, she redefines herself and begins living the life she's dreamed of--until James, the rich golden boy she had a crush on back home, walks into her nightclub. Not knowing their connected past, James promptly goes gaga for the overhauled Davie, whose need for sweet revenge adds a welcome dark edge to an otherwise predictable trajectory toward self-empowerment. New Agey embellishments (an \"atonement list\") seem like a misstep for a spirited heroine stuck in a middling narrative."], "author": "Ernessa T. Carter", "num_pages": "335", "awards": [], "places": [], "character_names": ["Davidia Jones", "James Farrell", "Veronica Farrell", "Tamara Farrell"], "language": "English", "publish_date": "2010-06-22 00:00:00", "ISBN": "0061957844"},
{"url": "https://www.goodreads.com/book/show/10001341-the-disgruntled-wives-club", "num_ratings": "80", "num_reviews": "18", "avg_ratings": 4.16, "genres": ["Drama"], "title": "The Disgruntled Wives Club", "description": ["“I agreed to ‘for better or for worse,’ but I need more “better” and some of that cherishing we spoke of. Can I review my contract, please?”", "Dana Hall has been more than patient with Ric and his never-ending issues. She has supported his pipe dreams and bitten her tongue when he’s lost his jobs, but infidelity is inexcusable. When Ric adds the P.Y.T. from work, numerous tex", "“I agreed to ‘for better or for worse,’ but I need more “better” and some of that cherishing we spoke of. Can I review my contract, please?”", "Dana Hall has been more than patient with Ric and his never-ending issues. She has supported his pipe dreams and bitten her tongue when he’s lost his jobs, but infidelity is inexcusable. When Ric adds the P.Y.T. from work, numerous text messages, and risqué emails to the stewing pot, he finds he has created a recipe for disaster. It’s his secret ingredient, though, that sends Dana over the edge.", "“If love doesn’t hurt, why am I holding this ice on my jaw again? Did ‘until death do us part’ mean he’s going to kill me?”", "Willow Townsend is torn. On most days, Vaughn could tutor Prince Charming in the art of being a good man. Then, there are the other days…She understands that a woman should be submissive to her husband, but is pretty sure the Bible didn’t mean for it to be achieved through violence. After Vaughn throws his worst temper tantrum ever, will she leave her convoluted fairytale or wait around for the happy ending?", "“We said, ‘in sickness and in health,’ but… herpes? I was thinking cancer or kidney failure.”", "Crystal Moss is married to R&B superstar, Dante. Due to the nature of his profession, she has adopted the “If I don’t see it, it isn’t happening” rule when it comes to groupies and cheating and found a way to cope with her lonely nights. When Dante gets sloppy and breaks one of their rules, the tabloids have a field day and Crystal is faced with a tough decision: kill him in his sleep or while he’s awake?"], "author": "Portia A. Cosby", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-11-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/625895.The_Accidental_Diva", "num_ratings": "301", "num_reviews": "35", "avg_ratings": 3.6, "genres": ["Womens Fiction", "Chick Lit", "Fiction", "Romance", "Cultural", "African American", "Adult"], "title": "The Accidental Diva", "description": ["Being a diva isn't all it's cracked up to be. Just ask Billie Burke. Brainy, beautiful, and at the top of her game, she's the beauty editor at the world's leading fashion magazine, where paying tribute to the perfect pink lip gloss is serious business. Trouble is, all this corporate climbing and party-hopping has left her with migraine headaches-and a long, lonely bout of", "Being a diva isn't all it's cracked up to be. Just ask Billie Burke. Brainy, beautiful, and at the top of her game, she's the beauty editor at the world's leading fashion magazine, where paying tribute to the perfect pink lip gloss is serious business. Trouble is, all this corporate climbing and party-hopping has left her with migraine headaches-and a long, lonely bout of celibacy.", "Enter Jay Lane-a gorgeous performance artist who came up in a grisly 'hood in a part of Brooklyn completely foreign to Billie. In no time, this beauty expert's nights are bubbling over with hot passion-and she's caught in an affair that's as addictive and crazy as the city itself."], "author": "Tia Williams", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-05-03 00:00:00", "ISBN": "0451215079"},
{"url": "https://www.goodreads.com/book/show/110425.A_Love_Noire", "num_ratings": "318", "num_reviews": "43", "avg_ratings": 3.8, "genres": ["Cultural", "African American", "Romance", "Fiction"], "title": "A Love Noire", "description": ["When Noire, a hip, Afro-wearing Ph.D. student, walks into Brown Betty Books, her righteousness kicks in to overdrive amid the self-identified \"talented tenth\" who wear their double degrees and five-hundred-dollar shoes like badges of honor. And then Innocent, a well-heeled investment banker from Côte d'Ivoire, West Africa, walks in and turns her on her head. Innocent seems", "When Noire, a hip, Afro-wearing Ph.D. student, walks into Brown Betty Books, her righteousness kicks in to overdrive amid the self-identified \"talented tenth\" who wear their double degrees and five-hundred-dollar shoes like badges of honor. And then Innocent, a well-heeled investment banker from Côte d'Ivoire, West Africa, walks in and turns her on her head. Innocent seems interested in her -- but he's one of them.", "Before meeting him, Noire shunned the \"bourgie\" world of black-moneyed cosmopolitans like Innocent, opting instead for socially conscious (but economically challenged) artists and urban intellectuals. Their mutual attraction blossoms into lust -- and eventually love -- but it lives in the shifting sands of personal beliefs and professional ambitions that are often at odds.", "Set in New York City with jaunts to Africa, Europe, and the Caribbean, ", " is the story of an unlikely couple that transcends all they've known to learn the redemptive power of love."], "author": "Erica Simone Turnipseed", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-29 00:00:00", "ISBN": "0060536802"},
{"url": "https://www.goodreads.com/book/show/3032060-rhythms-of-grace", "num_ratings": "280", "num_reviews": "32", "avg_ratings": 3.88, "genres": ["Fiction", "Christian", "Christian Fiction", "Romance", "Contemporary", "Womens Fiction", "Chick Lit", "Cultural", "African American"], "title": "Rhythms of Grace", "description": ["Grace Okoye was a promising young dancer when her career was cut short by a brutal assault that left her scarred for life. Twenty years later, when her past gets in the way of her happiness, she heeds the invitation of her dance instructor and returns home to help hurting children and rediscover the rhythms of grace. What she doesn't expect is to meet a man who already see", "Grace Okoye was a promising young dancer when her career was cut short by a brutal assault that left her scarred for life. Twenty years later, when her past gets in the way of her happiness, she heeds the invitation of her dance instructor and returns home to help hurting children and rediscover the rhythms of grace. What she doesn't expect is to meet a man who already seems to know her beat. But for all they share in common, the biggest thing in Grace's life is noticeably absent in his--faith. She's finally found the love of her life, but can she choose between him and God?", "Real, raw emotion and the promise of redemption run through this soulful new book from Marilynn Griffith."], "author": "Marilynn Griffith", "num_pages": "427", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "0800732782"},
{"url": "https://www.goodreads.com/book/show/7104639-total-eclipse-of-the-heart", "num_ratings": "2,282", "num_reviews": "172", "avg_ratings": 4.21, "genres": ["Romance", "Cultural", "African American", "Fiction", "Adult Fiction", "Erotica"], "title": "Total Eclipse of the Heart", "description": ["The New York Times bestselling queen of erotica is back with a provocative and sensual new novel of love, heartbreak, and total liberation.", "The New York Times bestselling queen of erotica is back with a provocative and sensual new novel of love, heartbreak, and total liberation."], "author": "Zane", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-12-01 00:00:00", "ISBN": "0743499298"},
{"url": "https://www.goodreads.com/book/show/310459.Roll_of_Thunder_Hear_My_Cry", "num_ratings": "101,612", "num_reviews": "4,336", "avg_ratings": 3.8, "genres": ["Historical", "Historical Fiction", "Young Adult", "Classics", "Childrens", "Fiction", "Childrens", "Middle Grade", "Cultural", "African American", "Academic", "Read For School", "Historical", "Realistic Fiction"], "title": "Roll of Thunder, Hear My Cry", "description": ["Why is the land so important to Cassie's family? It takes the events of one turbulent year—the year of the night riders and the burnings, the year a white girl humiliates Cassie in public simply because she's black—to show Cassie that having a place of their own is the Logan family's lifeblood. It is the land that gives the Logans their courage and pride—no matter how othe", "Why is the land so important to Cassie's family? It takes the events of one turbulent year—the year of the night riders and the burnings, the year a white girl humiliates Cassie in public simply because she's black—to show Cassie that having a place of their own is the Logan family's lifeblood. It is the land that gives the Logans their courage and pride—no matter how others may degrade them, the Logans possess something no one can take away."], "author": "Mildred D. Taylor", "num_pages": "288", "awards": ["Newbery Medal (1977)", "Buxtehuder Bulle (1984)", "George C. Stone Center for Children's Books Recognition of Merit Award (1991)", "Jane Addams Children's Book Award Nominee (1977)", "Los Angeles Times Book Prize for Young Adult Fiction (2001)", "Dorothy Canfield Fisher Children's Book Award Nominee (1978)", "Coretta Scott King Award for Author Honor (1977)", "Pacific Northwest Library Association Young Reader's Choice Award (1979)", "Boston Globe-Horn Book Award Nominee for Fiction (1977)", "California Young Readers Medal Nominee for Middle School/Junior High (1980)", "National Book Award Finalist for Children's Literature (1977)"], "places": ["Mississippi"], "character_names": ["Cassie Logan", "Stacey Logan", "Christopher John", "Papa"], "language": "English", "publish_date": "1991-10-01 00:00:00", "ISBN": "014034893X"},
{"url": "https://www.goodreads.com/book/show/395539.Baby_Brother_s_Blues", "num_ratings": "1,272", "num_reviews": "55", "avg_ratings": 3.96, "genres": ["Fiction", "Cultural", "African American", "Contemporary"], "title": "Baby Brother's Blues", "description": ["When Regina Burns married Blue Hamilton, she knew he was no ordinary man. A charismatic R&B singer who gave up his career to assume responsibility for the safety of Atlanta’s West End community, Blue had created an African American urban oasis where crime and violence were virtually nonexistent. In the beginning, Regina enjoyed a circle of engaging friends and her own", "When Regina Burns married Blue Hamilton, she knew he was no ordinary man. A charismatic R&B singer who gave up his career to assume responsibility for the safety of Atlanta’s West End community, Blue had created an African American urban oasis where crime and violence were virtually nonexistent. In the beginning, Regina enjoyed a circle of engaging friends and her own work as a freelance communications consultant. Most of all, she relished the company of her husband, who never ceased to be a source of passion and delight. ", "Then everything changed. More and more frightened women were showing up in West End, seeking Blue’s protection from lovers who had suddenly become violent. When the worst offenders begin to disappear without a trace, the signs–all of them grim–seem to point toward Blue and his longtime associate, Joseph “General” Richardson. Now that Regina is pregnant, her fear for Blue’s safety has become an obsession that threatens the very heart of their relationship. ", "At the same time, Regina’s friend Aretha Hargrove is desperately trying to redefine her own marriage. Aretha’s husband, Kwame, is lobbying for them to leave West End and move to midtown. Aretha resists at first, but finally agrees in an effort to rekindle the flame that first brought them together. ", "Regina and Aretha have no way of knowing that what they regard as their private struggles will soon become very public. When Baby Brother, a charming con man, insinuates himself into the community, it becomes clear that there is more to his handsome façade than meets the eye. He carries the seeds of change that will affect both women in profound and startling ways.", "Returning to the vividly rendered Atlanta district of her last two novels, New York Times bestselling author Pearl Cleage brilliantly weaves the threads of her characters’ intersecting lives into a story of family, friendship and, of course, love. Baby Brother’s Blues is full of wit and warmth, illumination the core of every woman’s hopes and dreams."], "author": "Pearl Cleage", "num_pages": "368", "awards": [], "places": ["Atlanta, Georgia"], "character_names": [], "language": "English", "publish_date": "2007-02-27 00:00:00", "ISBN": "0345481119"},
{"url": "https://www.goodreads.com/book/show/303934.Dancing_on_the_Edge_of_the_Roof", "num_ratings": "276", "num_reviews": "51", "avg_ratings": 4.13, "genres": ["Fiction", "Romance", "Interracial Romance", "Cultural", "African American", "Contemporary"], "title": "Dancing on the Edge of the Roof", "description": ["At forty-one, Juanita Lewis is running away from home, courtesy of a one-way ticket to Montana, a place that seems about as far away from the violence and poverty of the Columbus, Ohio, projects as the moon. She wants adventure and excitement–if such things exist for a pre-menopausal African American woman with three grown, deadbeat children.", "Juanita’s new life in Paper Moo", "At forty-one, Juanita Lewis is running away from home, courtesy of a one-way ticket to Montana, a place that seems about as far away from the violence and poverty of the Columbus, Ohio, projects as the moon. She wants adventure and excitement–if such things exist for a pre-menopausal African American woman with three grown, deadbeat children.", "Juanita’s new life in Paper Moon, Montana, begins at a local diner where a culinary face-off with chef and owner Jess Gardiner finds Juanita in front of Jess’s stove serving up home cookin’ that lures the townsfolk like a magic spell. And suddenly Juanita, who was just passin’ through, now has a job by popular demand.", "Out here in this wide-open space, Juanita’s heart can no longer hide, especially when she sees herself through the eyes of the wonderful and eccentric people of this down-to-earth town. She’s happy in Paper Moon; she’s found a home, but can she stay? And then there’s Jess. She has always dreamed of romance, but she never planned on falling in love."], "author": "Sheila    Williams", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-25 00:00:00", "ISBN": "034544874X"},
{"url": "https://www.goodreads.com/book/show/574180.A_Woman_s_Worth", "num_ratings": "253", "num_reviews": "39", "avg_ratings": 4.45, "genres": ["Fiction"], "title": "A Woman's Worth", "description": ["Embracing the shattered pieces of the soul and championing the resilient nature of the heart, ", " takes readers on a journey of startling depth. From a speakeasy whorehouse in the bottoms of Alabama to a luxurious high-rise apartment in Kenya, acclaimed author Tracy Price-Thompson crosses boundaries of sexuality, gender, and culture to accentuate the core of bl", "Embracing the shattered pieces of the soul and championing the resilient nature of the heart, ", " takes readers on a journey of startling depth. From a speakeasy whorehouse in the bottoms of Alabama to a luxurious high-rise apartment in Kenya, acclaimed author Tracy Price-Thompson crosses boundaries of sexuality, gender, and culture to accentuate the core of black identity: the enormous strength of family.", "A Woman’s Worth", "Abeni Omorru is a stunning Kenyan woman who is haunted by piercing memories. Although her father’s wealth ensures her a life of prestige, childhood trauma has left her emotionally damaged and sexually promiscuous. While Abeni takes on many lovers, none come close to healing the wounds of her heart—and only a man who understands her worth can truly claim her soul. ", "Bishop Johnson is also haunted by his past. Raised by prostitutes in a rural Alabama town, he is a promising teenage boxer—until his dreams are shattered when his parents are murdered during a violent robbery and he takes revenge on the perpetrators. Bishop goes to jail, and when he is released he has a volatile temper and a mean left hook to back it up. ", "Trouble continues to find Bishop, and he is forced to leave Alabama and travel to Kenya with the Peace Corps. There he falls in love with Abeni, and they marry. When Bishop learns the secret of Abeni’s past, he is force to make a decision that may cost him more than one man should ever have to sacrifice."], "author": "Tracy Price-Thompson", "num_pages": "304", "awards": ["Hurston/Wright Legacy Award for Contemporary Fiction (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-25 00:00:00", "ISBN": "0375757783"},
{"url": "https://www.goodreads.com/book/show/8731302-sweet-little-lies", "num_ratings": "214", "num_reviews": "42", "avg_ratings": 4.23, "genres": ["Romance", "Cultural", "African American", "Womens Fiction", "Chick Lit", "Romance", "African American Romance"], "title": "Sweet Little Lies", "description": ["Just when writer Christina Brinsley thinks she's finally found the perfect man, she discovers he is married - on her wedding day. Witnessing Christina and her fiance arguing, Steven Williams comes to her defence. But it is not the last encounter they will have.\""], "author": "Michele Grant", "num_pages": "277", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-02-01 00:00:00", "ISBN": "0758242212"},
{"url": "https://www.goodreads.com/book/show/1144538.Third_Girl_from_the_Left", "num_ratings": "635", "num_reviews": "79", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Womens", "Lgbt", "Glbt", "Queer"], "title": "Third Girl from the Left", "description": ["With ", ", Southgate brings her acute vision and emotional scope to a larger canvas. This enormously entertaining yet serious novel tells a story of African-American women struggling against all odds to express what lies deepest in their hearts. Like Michael Chabon’s ", " or E. L. Doctorow’s ", ", it ranges free", "With ", ", Southgate brings her acute vision and emotional scope to a larger canvas. This enormously entertaining yet serious novel tells a story of African-American women struggling against all odds to express what lies deepest in their hearts. Like Michael Chabon’s ", " or E. L. Doctorow’s ", ", it ranges freely through time, fact, and fiction to weave an enthralling story about history and art and their place in the lives of three women. ", "“My mother believed in the power of movies and the people in them to change a life, to change her life.” So explains Tamara, daughter of Angela, granddaughter of Mildred — the three women whose lives are portrayed in stunning detail in this ambitious novel spanning three generations of one family. ", "Tulsa, Oklahoma, in 1970 is not a place a smart black girl wants to linger. For Angela, twenty years old and beautiful, the stifling conformity is unbearable. She heads to Los Angeles just as blaxploitation movies are pouring money into the studios and lands a few bit parts before an unplanned pregnancy derails her plans for stardom. ", "For Mildred, movies have always been a blessed diversion in a life marked by the legacy of the 1921 Tulsa race riots. But after Angela leaves Tulsa following a bitter fight, the distance between them grows into a breach that remains for years. ", "It falls to Tamara, a budding documentarian — raised in LA by Angela as though they have no family, no history — to help mother and grandmother confront all that has been silenced and left unsaid in their lives.", "A bold, beautifully written, and deeply involving novel, ", " deftly examines the pull of the movies, the power of desire, and the bonds of family in a quintessentially American story."], "author": "Martha Southgate", "num_pages": "288", "awards": ["Hurston/Wright Legacy Award Nominee for Fiction (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-07 00:00:00", "ISBN": "0618470239"},
{"url": "https://www.goodreads.com/book/show/771493.I_Wish_I_Had_a_Red_Dress", "num_ratings": "2,940", "num_reviews": "123", "avg_ratings": 4.09, "genres": ["Fiction", "Cultural", "African American", "Womens Fiction", "Chick Lit", "Contemporary"], "title": "I Wish I Had a Red Dress", "description": ["Cleage captures the mores, culture, and rhythm of black urban youth and the romantic tensions between mature black adults as she weaves contemporary issues into a love story.", "Joyce Mitchell was widowed far too young when her beloved husband, Mitch, died in a tragic accident five years ago. Since then she's kept her hands full and her mind and heart occupied by running The S", "Cleage captures the mores, culture, and rhythm of black urban youth and the romantic tensions between mature black adults as she weaves contemporary issues into a love story.", "Joyce Mitchell was widowed far too young when her beloved husband, Mitch, died in a tragic accident five years ago. Since then she's kept her hands full and her mind and heart occupied by running The Sewing Circus, an all-girl group she founded to provide badly needed services like day care and job counseling to young women, many of whom are single mothers. More important, The Circus is a place for lively, wide-ranging, heart-to-heart discussions that will help members grow into what Joyce likes to call \"twenty-first-century free women.\" ", "All in all, Joyce has a full and rich life. She has her work, her family, her friends, and her town. But there are some nights when she crawls into bed alone and has to admit that something is missing. What she doesn't have is that red dress she keeps dreaming about or a social life that would accommodate it even if she braved the mall and bought one. To further complicate matters, she may not have The Sewing Circus much longer, as the state legislature has decided not to fund the group's vital but hard to define work with young women who are too often regarded as problems rather than possibilities. ", "Feeling defeated and pessimistic, Joyce reluctantly agrees to keep a date for dinner at the home of her best friend, Sister -- a reverend like no other-and finds not only a perfect meal but a tall, dark stranger named Nate Anderson. Nate has just joined the administration at the high school and his unexpected presence in Idlewild touches a chord in Joyce that she thought her heart had forgotten how to play. Nate feels the same immediate connection, but both have enough experience with broken hearts to take it real slow. Besides, they've got too much work to do to concentrate on falling in love....", "But life moves at its own pace, and as Sister says, \"if you want to make God laugh, make plans.\" Particularly when it comes to matters of the heart. Joyce decides the trick is to stay focused and to remember that nothing is as sexy as the truth, the whole truth, and nothing but the truth, especially if you tell it while you're wearing a perfect red dress..."], "author": "Pearl Cleage", "num_pages": "323", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-09 00:00:00", "ISBN": "0380804883"},
{"url": "https://www.goodreads.com/book/show/20317831-bounce", "num_ratings": "187", "num_reviews": "45", "avg_ratings": 3.68, "genres": ["Romance", "Contemporary", "Romance", "Contemporary Romance"], "title": "Bounce", "description": ["Growing up as a young girl, Sabrina Jacobs could only dream her life would be this good. She has a successful career, a famous sexy husband, two children, a house in an affluent Westchester suburb and a shoe collection worthy of a magazine spread. Too bad it’s all a façade. ", "It has been almost a year since her husband admitted he had an affair with a younger and bouncier co", "Growing up as a young girl, Sabrina Jacobs could only dream her life would be this good. She has a successful career, a famous sexy husband, two children, a house in an affluent Westchester suburb and a shoe collection worthy of a magazine spread. Too bad it’s all a façade. ", "It has been almost a year since her husband admitted he had an affair with a younger and bouncier coworker. Follow Sabrina as she tries to rein in her out-of-control life by kicking her husband out on his rear, chucking her career and even firing her too-cute-for-the-job nanny. But how will she survive as a stay-at-home mom in the land of designer clothes, designer kids’ parties and designer babies? Hmm… maybe the hunky young French teacher, who has been flirting shamelessly with Sabrina, is just what she needs to take her mind off her problems. Well, not if her husband has something to say about it. Will Sabrina be able to forgive and still be true to herself?"], "author": "K.M. Jackson", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/70514.Redemption_Song", "num_ratings": "548", "num_reviews": "59", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Romance"], "title": "Redemption Song", "description": ["Owner of a small African-American bookshop, Miss Cozy has an unique gift: Customers who walk through her door rarely leave without a book that speaks directly to their life. But when Josephine--\"Fina\"--and Ross arrive in search of an obscure, unpublished manuscript written by a slave woman, Miss Cozy knows that all her visions have been leading her to this magical day. ", "Yet", "Owner of a small African-American bookshop, Miss Cozy has an unique gift: Customers who walk through her door rarely leave without a book that speaks directly to their life. But when Josephine--\"Fina\"--and Ross arrive in search of an obscure, unpublished manuscript written by a slave woman, Miss Cozy knows that all her visions have been leading her to this magical day. ", "Yet Miss Cozy has no intention of selling the manuscript--no matter the price. So she offers Fina and Ross an alternative. They can read it together at the store. It was not what they hoped for, but their interest in the extraordinary love story is about as strong as their uncanny attraction for one another . . . one they both sense runs much deeper than a kiss. In the course of a few days, Fina and Ross realize that this powerful book has special meaning for the two of them--and that the path to their shared future may be linked to something that happened more than a century ago. . . ."], "author": "Bertice Berry", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-01-02 00:00:00", "ISBN": "034543885X"},
{"url": "https://www.goodreads.com/book/show/16169867-buck", "num_ratings": "1,551", "num_reviews": "242", "avg_ratings": 4.2, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Cultural", "African American"], "title": "Buck: A Memoir", "description": ["  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But t", "  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But things fell apart, and a decade later MK was in America, a teenager lost in a fog of drugs, sex, and violence on the streets of North Philadelphia. Now he was alone—his mother in a mental hospital, his father gone, his older brother locked up in a prison on the other side of the country—and forced to find his own way to survive physically, mentally, and spiritually, by any means necessary.", " is a powerful memoir of how a precocious kid educated himself through the most unconventional teachers—outlaws and eccentrics, rappers and mystic strangers, ghetto philosophers and strippers, and, eventually, an alternative school that transformed his life with a single blank sheet of paper. It’s a one-of-a-kind story about finding your purpose in life, and an inspiring tribute to the power of education, art, and love to heal and redeem us."], "author": "M.K. Asante", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "0812993411"},
{"url": "https://www.goodreads.com/book/show/242130.The_Upper_Room", "num_ratings": "2,395", "num_reviews": "145", "avg_ratings": 4.24, "genres": ["Fiction", "Cultural", "African American", "Drama"], "title": "The Upper Room", "description": ["Maureen, a young black girl torn between her mother, the notorious Mama Ruby, whose healing powers and reputation cause people to fear her, and the harsh realities of life, comes of age, in a powerful, evocative tale set in a migrant labor camp in the bayous of the Florida Everglades. Reprint."], "author": "Mary Monroe", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-07-01 00:00:00", "ISBN": "0758208898"},
{"url": "https://www.goodreads.com/book/show/13311434-the-one", "num_ratings": "30", "num_reviews": "6", "avg_ratings": 3.9, "genres": [], "title": "The One", "description": ["Olena Day is on top of the world. She has her dream home a condominium at the Mansions on Peachtree in Buckhead, a career she loves, and two handsome men vying for her affection. But when the corporate sales professional goes from earning a high six-figure income to being offered a commission with a substantial pay cut, she quits her job. Now her spur-of-the-moment decisio", "Olena Day is on top of the world. She has her dream home a condominium at the Mansions on Peachtree in Buckhead, a career she loves, and two handsome men vying for her affection. But when the corporate sales professional goes from earning a high six-figure income to being offered a commission with a substantial pay cut, she quits her job. Now her spur-of-the-moment decision has her scrambling for a solution to her foreseeable money problems. She can allow the wealthy man in her life to support her, which goes against her fiercely independent nature and his mother's gold-digger radar. Or she can appear on the dating reality show The One, despite her distaste for reality TV and the fact that she's already in a committed relationship. Reality TV is her shot at fifteen minutes of fame, and the opportunity for her literary agent to land Olena the book deal she's been impatiently waiting on. Step behind the scenes of the highly competitive and unique world of reality dating shows."], "author": "Cheryl Robinson", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-02-14 00:00:00", "ISBN": "0984711007"},
{"url": "https://www.goodreads.com/book/show/594776.Fifth_Born", "num_ratings": "1,278", "num_reviews": "105", "avg_ratings": 4.23, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Sociology", "Abuse"], "title": "Fifth Born", "description": ["When Odessa Blackburn is three years old her beloved grandmother dies, and so begins her story, set in St. Louis, Missouri, and rural Mississippi. As the fifth born of eight children, Odessa loses her innocence at first when her drunken father sexually abuses her, and then again when she alone witnesses her father taking the life of his own brother. ", " is Zelda Loc", "When Odessa Blackburn is three years old her beloved grandmother dies, and so begins her story, set in St. Louis, Missouri, and rural Mississippi. As the fifth born of eight children, Odessa loses her innocence at first when her drunken father sexually abuses her, and then again when she alone witnesses her father taking the life of his own brother. ", " is Zelda Lockhart's debut novel, lyrically written and powerful in its exploration of how secrets can tear apart lives and families. It is a story of love, longing, and redemption, as Odessa walks away from those whom she believes to be her kin to discover the true meaning of family."], "author": "Zelda Lockhart", "num_pages": "224", "awards": ["Hurston/Wright Legacy Award Nominee for Debut Fiction (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-19 00:00:00", "ISBN": "0743412664"},
{"url": "https://www.goodreads.com/book/show/331260.The_Darkest_Child", "num_ratings": "6,658", "num_reviews": "754", "avg_ratings": 4.36, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Race", "Historical"], "title": "The Darkest Child", "description": ["Bakersfield, Georgia, 1958: Thirteen-year-old Tangy Mae Quinn is the sixth of ten fatherless siblings. She is the darkest-skinned among them and therefore the ugliest in her mother, Rozelle's, estimation, but she's also the brightest. Rozelle--beautiful, charismatic, and light-skinned--exercises a violent hold over her children. Fearing abandonment, she pulls them from sch", "Bakersfield, Georgia, 1958: Thirteen-year-old Tangy Mae Quinn is the sixth of ten fatherless siblings. She is the darkest-skinned among them and therefore the ugliest in her mother, Rozelle's, estimation, but she's also the brightest. Rozelle--beautiful, charismatic, and light-skinned--exercises a violent hold over her children. Fearing abandonment, she pulls them from school at the age of twelve and sends them to earn their keep for the household, whether in domestic service, in the fields, or at \"the farmhouse\" on the edge of town, where Rozelle beds local men for money.", "But Tangy Mae has been selected to be part of the first integrated class at a nearby white high school. She has a chance to change her life, but can she break from Rozelle's grasp without ruinous--even fatal--consequences?"], "author": "Delores Phillips", "num_pages": "400", "awards": ["Hurston/Wright Legacy Award Nominee for Debut Fiction (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "1569473781"},
{"url": "https://www.goodreads.com/book/show/84553.The_Man_in_My_Basement", "num_ratings": "3,727", "num_reviews": "449", "avg_ratings": 3.66, "genres": ["Fiction", "Mystery", "Cultural", "African American"], "title": "The Man in My Basement", "description": ["Walter Mosley pierces long-hidden veins of justice and morality with startling insight into the deepest mysteries of human nature."], "author": "Walter Mosley", "num_pages": "272", "awards": ["Hurston/Wright Legacy Award Nominee for Fiction (2005)"], "places": [], "character_names": ["Charles Blakey"], "language": "English", "publish_date": "2005-02-02 00:00:00", "ISBN": "031615931X"},
{"url": "https://www.goodreads.com/book/show/845403.Mufaro_s_Beautiful_Daughters", "num_ratings": "18,281", "num_reviews": "779", "avg_ratings": 4.33, "genres": ["Childrens", "Picture Books", "Childrens", "Cultural", "Africa"], "title": "Mufaro's Beautiful Daughters: An African Tale", "description": ["Inspired by a traditional African folktale, this is the story of Mufaro, who is proud of his two beautiful daughters. Nyasha is kind and considerate, but eve", "Inspired by a traditional African folktale, this is the story of Mufaro, who is proud of his two beautiful daughters. Nyasha is kind and considerate, but everyone—except Mufaro—knows that Manyara is selfish and bad-tempered.", "When the Great King decides to take a wife and invites the most worthy and beautiful daughters in the land to appear before him, Mufaro brings both of his daughters—but only one can be queen. Who will the king choose?", "Award-winning artist John Steptoe’s rich cultural imagery of Africa earned him the Coretta Scott King Award for ", ". The book also went on to win the Boston Globe-Horn Book Award. This stunning story is a timeless treasure that readers will enjoy for generations."], "author": "John Steptoe", "num_pages": "32", "awards": ["Caldecott Medal Nominee (1988)", "Coretta Scott King Award for Illustrator (1988)"], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "1987-03-31 00:00:00", "ISBN": "0688040454"},
{"url": "https://www.goodreads.com/book/show/503427.Satin_Doll", "num_ratings": "590", "num_reviews": "15", "avg_ratings": 4.15, "genres": ["Fiction", "Romance"], "title": "Satin Doll", "description": ["This Blackboard bestseller about making it on your own--despite the mistakes of your past--will appeal to fans of Terry McMillan and Lolita Files."], "author": "Karen E. Quinones Miller", "num_pages": "318", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-01 00:00:00", "ISBN": "074348245X"},
{"url": "https://www.goodreads.com/book/show/21964246-dirty-bonds", "num_ratings": "195", "num_reviews": "36", "avg_ratings": 4.41, "genres": [], "title": "Dirty Bonds", "description": ["Money aint the only thing that can get you out of Jail on Bail! ", "***“\"Look, I don’t need the money. I have plenty of money. But let me tell you how this works. You see this contract…let me tell you what it says. It says I’ll post your bail, and have my one hell of a lawyer or judge friend get you off, or pay somebody to get you off under one condition…that DICK belongs to m", "Money aint the only thing that can get you out of Jail on Bail! ", "***“\"Look, I don’t need the money. I have plenty of money. But let me tell you how this works. You see this contract…let me tell you what it says. It says I’ll post your bail, and have my one hell of a lawyer or judge friend get you off, or pay somebody to get you off under one condition…that DICK belongs to me; anytime, anywhere, until the contract is up. That means, your wife can’t know a thing about our little agreement and that also means that I want the works; I want to be fucked…not played with. Pleased not left unsatisfied; no in between, straight like that. So, where do we go from here is up to you. So, what’s it going to be?” I said in closing as I liked my lips. ", "Devon leaned back in his chair and eyed me as if he was trying to read my mind. My guess was that he was trying to figure out if I was serious or if it all was some sick, twisted joke. But I was dead ass serious. He eyed me up and down, just before biting his bottom lip. After a few more minutes, he cleared his throat and crossed his arms over his chest. ", "“Okay,” he said…I grinned.****"], "author": "B.M. Hardin", "num_pages": "75", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24709132-thicker-than-water", "num_ratings": "896", "num_reviews": "65", "avg_ratings": 4.56, "genres": ["Urban", "Romance"], "title": "Thicker Than Water", "description": ["\"Allen draws you into the story from the very first page.\" --APOOO Book Club ", "\"Allen draws you into the story from the very first page.\" --APOOO Book Club "], "author": "Takerra Allen", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/37100.Devil_in_a_Blue_Dress", "num_ratings": "15,768", "num_reviews": "1,049", "avg_ratings": 3.9, "genres": ["Mystery", "Fiction", "Mystery", "Noir", "Cultural", "African American", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Devil in a Blue Dress", "description": ["In Los Angeles of the late 1940s, Easy Rawlins, a black war veteran, has just been fired from his job at a defense plant. Easy is drinking in a friend's bar, wondering how he'll meet his mortgage, when a white man in a linen suit walks in, offering good money if Easy will simply locate Miss Daphne Monet, a blonde beauty known to frequent black jazz clubs."], "author": "Walter Mosley", "num_pages": "263", "awards": ["Shamus Award for Best First PI Novel (1991)", "CWA New Blood Dagger (1991)", "Edgar Award Nominee for Best First Novel (1991)"], "places": ["Los Angeles, California"], "character_names": ["Raymond \"Mouse\" Alexander", "Ezekiel \"Easy\" Rawlins"], "language": "English", "publish_date": "2002-09-17 00:00:00", "ISBN": "0743451791"},
{"url": "https://www.goodreads.com/book/show/495369.Sugar", "num_ratings": "4,709", "num_reviews": "377", "avg_ratings": 4.28, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American"], "title": "Sugar", "description": ["\"Strong and folksy storytelling...think ", "...", " speaks of what is real.\" --", "From an exciting new voice in African-American contemporary fiction comes a novel ", " praised for its \"unforgettable images, unique characters, and moving story that keeps the pages turning until the end.\" ", " calls ", " \"a literary explo", "\"Strong and folksy storytelling...think ", "...", " speaks of what is real.\" --", "From an exciting new voice in African-American contemporary fiction comes a novel ", " praised for its \"unforgettable images, unique characters, and moving story that keeps the pages turning until the end.\" ", " calls ", " \"a literary explosion...McFadden reveals amazing talent.\" The novel opens when a young prostitute comes to Bigelow, Arkansas, to start over, far from her haunting past. Sugar moves next door to Pearl, who is still grieving for the daughter who was murdered fifteen years before. Over sweet-potato pie, an unlikely friendship begins, transforming both women's lives--and the life of an entire town.", "Sugar brings a Southern African-American town vividly to life, with its flowering magnolia trees, lingering scents of jasmine and honeysuckle, and white picket fences that keep strangers out--but ignorance and superstition in. To read this novel is to take a journey through loss and suffering to a place of forgiveness, understanding, and grace.  McFadden is the author of the novels ", ", ", " and ", ". "], "author": "Bernice L. McFadden", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-01-02 00:00:00", "ISBN": "0452282209"},
{"url": "https://www.goodreads.com/book/show/22693173-for-your-love", "num_ratings": "633", "num_reviews": "102", "avg_ratings": 4.46, "genres": ["Fiction", "Romance", "Cultural", "African American", "Contemporary"], "title": "For Your Love", "description": ["NAACP nominee and bestselling author Beverly Jenkins returns to Henry Adams, Kansas—an unforgettable place that anyone would want to call home—with a story of family, friends, and the powerful forces from our past that can irrevocably shape our future.", "Mayor Trent July and his wife Lily are enjoying life as newlyweds and embracing the challenges and joys that come with bein", "NAACP nominee and bestselling author Beverly Jenkins returns to Henry Adams, Kansas—an unforgettable place that anyone would want to call home—with a story of family, friends, and the powerful forces from our past that can irrevocably shape our future.", "Mayor Trent July and his wife Lily are enjoying life as newlyweds and embracing the challenges and joys that come with being foster parents to two wonderful boys. But being a foster father has inevitably forced him to think about his own birth mother. Raised by his grandmother Tamar—and in many ways the good people of Henry Adams—Trent was blessed with a childhood full of love.", "But now he can’t help wondering what happened to the scared teenage girl who handed him over to Tamar. And questions that he’s never voiced are now begging to be answered: Who was she? Is she still alive? Why didn’t she want him?", "Trent has always believed no good comes from dwelling on the past, especially when you have a loving family, a strong community, and folks who depend on him. But when the past comes to Henry Adams and Trent has no choice but to face it—and the woman who left him behind. The truth will shake his very being and everything he thought he knew about life, love, and the bonds that hold families together…yet can also tear them apart."], "author": "Beverly Jenkins", "num_pages": "304", "awards": [], "places": ["Kansas"], "character_names": [], "language": null, "publish_date": "2015-04-28 00:00:00", "ISBN": "0062207997"},
{"url": "https://www.goodreads.com/book/show/12343998-mighty-be-our-powers", "num_ratings": "2,982", "num_reviews": "374", "avg_ratings": 4.12, "genres": ["Nonfiction", "Cultural", "Africa", "Autobiography", "Memoir", "History", "Feminism", "Biography", "Politics"], "title": "Mighty Be Our Powers: How Sisterhood, Prayer, and Sex Changed a Nation at War", "description": ["In a time of death and terror, Leymah Gbowee brought Liberia's women together--and together they led a nation to peace. As a young woman, Gbowee was broken by the Liberian civil war, a brutal conflict that tore apart her life and claimed the lives of countless relatives and friends. As a young mother trapped in a nightmare of domestic abuse, she found the courage to turn h", "In a time of death and terror, Leymah Gbowee brought Liberia's women together--and together they led a nation to peace. As a young woman, Gbowee was broken by the Liberian civil war, a brutal conflict that tore apart her life and claimed the lives of countless relatives and friends. As a young mother trapped in a nightmare of domestic abuse, she found the courage to turn her bitterness into action, propelled by her realization that it is women who suffer most during conflicts--and that the power of women working together can create an unstoppable force. In 2003, the passionate and charismatic Gbowee helped organize and then led the Liberian Mass Action for Peace, a coalition of Christian and Muslim women who sat in public protest, confronting Liberia's ruthless president and rebel warlords, and even held a sex strike. With an army of women, Gbowee helped lead her nation to peace.--From publisher description."], "author": "Leymah Gbowee", "num_pages": "256", "awards": ["Dayton Literary Peace Prize Nominee for Nonfiction (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-13 00:00:00", "ISBN": "0984295151"},
{"url": "https://www.goodreads.com/book/show/334370.Good_Hair", "num_ratings": "2,239", "num_reviews": "33", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "African American", "Romance", "Womens Fiction", "Chick Lit", "Novels"], "title": "Good Hair", "description": ["When a Newark girl meets an upper-crust Boston boy, sparks fly, backgrounds clash, and readers enter a rarely observed aspect of African-American life in this glamorous, romantic, funny, and poignant debut novel by the former arts and entertainment editor at Essence magazine."], "author": "Benilde Little", "num_pages": "249", "awards": [], "places": [], "character_names": ["Alice Andrews", "Jack Russworm"], "language": "English", "publish_date": "2001-08-07 00:00:00", "ISBN": "0743218612"},
{"url": "https://www.goodreads.com/book/show/2815759-fishing-day", "num_ratings": "66", "num_reviews": "21", "avg_ratings": 3.94, "genres": ["Childrens", "Picture Books", "Historical", "Historical Fiction", "Childrens"], "title": "Fishing Day", "description": ["Reenie and her mama love to go fishing down by the river. But the peace of their idyllic fishing spot is often marred by the appearance of Peter Troop and his daddy. Peter is up-jumpy and loud, scaring the fish away. And the Troops harbor some resentment toward them, too. Peter and his daddy are fishing for food; Reenie and Mama fish for fun. The Troops are white; Reenie a", "Reenie and her mama love to go fishing down by the river. But the peace of their idyllic fishing spot is often marred by the appearance of Peter Troop and his daddy. Peter is up-jumpy and loud, scaring the fish away. And the Troops harbor some resentment toward them, too. Peter and his daddy are fishing for food; Reenie and Mama fish for fun. The Troops are white; Reenie and Mama are black. And in the Jim Crow South, it is this last difference that is most significant. One day, when the Troops' fishing reel breaks, Reenie overcomes their mutual fear and mistrust to help Peter-an act that holds the promise of friendship and understanding. This is a moving story about two children crossing boundaries of race, class, and gender, and about small acts that make a big difference."], "author": "Andrea Davis Pinkney", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-10-13 00:00:00", "ISBN": "0786807660"},
{"url": "https://www.goodreads.com/book/show/28959988-the-seeing-place", "num_ratings": "21", "num_reviews": "13", "avg_ratings": 4.24, "genres": ["Romance", "Contemporary", "Adult"], "title": "The Seeing Place", "description": ["Hot-shot producer Thuli Poni is holding auditions for her latest play in Cape Town. Andile Sebe is an up-and-coming star, just waiting for his big break. Thuli casts Andile and challenges him to link his painful past with the role he is portraying, leading him to open up to her. The two fall for each other and a passionate romance ensues.", "But when auditions open for Sins of", "Hot-shot producer Thuli Poni is holding auditions for her latest play in Cape Town. Andile Sebe is an up-and-coming star, just waiting for his big break. Thuli casts Andile and challenges him to link his painful past with the role he is portraying, leading him to open up to her. The two fall for each other and a passionate romance ensues.", "But when auditions open for Sins of the Fathers, the most-watched TV show in South Africa, Thuli turns cold. Will she play a part in Andile’s rise to fame, or will she hinder it?", "This is a story about how love can triumph against the odds if we stay humble, take risks and are willing to learn. The Seeing Place offers a very different kind of romance – between a powerful woman and a man who wants something only she can offer."], "author": "Aziza Eden Walker", "num_pages": "169", "awards": [], "places": ["Cape Town"], "character_names": [], "language": "English", "publish_date": "2016-02-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10258175-president-pro-tem", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 3.83, "genres": [], "title": "President Pro Tem", "description": ["A month after an election that will turn the country over to a new president, Carla Hamilton, fashion model turn politician-and the first African American woman to serve as vice president of the United States-receives startling news: The sitting president has died so she will occupy the Oval Office for only six weeks. She soon discovers that in Washington, D.C. a great dea", "A month after an election that will turn the country over to a new president, Carla Hamilton, fashion model turn politician-and the first African American woman to serve as vice president of the United States-receives startling news: The sitting president has died so she will occupy the Oval Office for only six weeks. She soon discovers that in Washington, D.C. a great deal can happen in six weeks."], "author": "Kelvin L. Reed", "num_pages": "312", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-07-17 00:00:00", "ISBN": "1609102681"},
{"url": "https://www.goodreads.com/book/show/9981619-the-woman-he-loved-before", "num_ratings": "6,526", "num_reviews": "502", "avg_ratings": 4.04, "genres": ["Womens Fiction", "Chick Lit", "Romance", "Fiction", "Mystery", "Contemporary"], "title": "The Woman He Loved Before", "description": ["Libby has a nice life with a gorgeous husband and a big home by the sea. But over time she is becoming more unsure if Jack has ever loved her and if he is over the death of Eve, his first wife. Then fate intervenes in their relationship."], "author": "Dorothy Koomson", "num_pages": "465", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-16 00:00:00", "ISBN": "0751543500"},
{"url": "https://www.goodreads.com/book/show/346598.Resurrecting_Mingus", "num_ratings": "170", "num_reviews": "18", "avg_ratings": 3.79, "genres": ["Cultural", "African American", "Fiction", "Adult", "Contemporary"], "title": "Resurrecting Mingus", "description": [" is the story of a young woman lost -- striving to find her own identity while dealing with powerful and painful questions that force her to confront everything and everyone that matters to her. In this stunning debut novel, Jenoyne Adams, a PEN Center USA West Emerging Voices Fellow, displays a rare talent for a first-time author: the skill and courage", " is the story of a young woman lost -- striving to find her own identity while dealing with powerful and painful questions that force her to confront everything and everyone that matters to her. In this stunning debut novel, Jenoyne Adams, a PEN Center USA West Emerging Voices Fellow, displays a rare talent for a first-time author: the skill and courage to write about some of the most controversial issues today in an absorbing and compulsively readable manner. Mingus Browning is a successful, young, beautiful lawyer whose life is falling apart. After a thirty-five-year marriage, Mingus's African-American father has suddenly left her Irish mother for a black woman. A daddy's girl, Mingus is torn between the father she has always been closer to, the mother she may have to defend in divorce proceedings, and a sister hell-bent on winning their lifelong sibling rivalry. Mingus is caught in middle of the three, a woman alone, and, in turn, realizes that she has probably always felt more comfortable that way because she is part of no one group, let alone a united family. Juggling her parents' grief with her own proves to be too much for Mingus as she stumbles from one questionable relationship to another, further complicating her life.", "After years of isolating herself from those who have tried to care for her, Mingus finally meets someone who rips through her protective defenses and exposes her need to be loved. Eric Simms, a smooth-talking television producer, is through playing dating games and is looking for love for real this time. With Eric, Mingus finally learns to forget the fear of a broken heart and opens herself completely. That is, until word starts circulating that her new love has his secrets as well, and suddenly what was a perfect relationship begins to look like yet another minefield of hurt, as Mingus is forced to choose between her man, her sister, and the truth.", "After facing a long, sad string of heartaches and betrayals, Mingus finally reaches the point in her life where she realizes who she is, what she wants, and how she doesn't need another man to get it. Marked by raw images and poetic prose, Jenoyne Adams's affecting first novel candidly explores the bonds of family, faith, and finding someone to love when you can't even find someone to trust."], "author": "Jenoyne Adams", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-02-01 00:00:00", "ISBN": "0671787810"},
{"url": "https://www.goodreads.com/book/show/7273556-shifting-through-neutral", "num_ratings": "100", "num_reviews": "16", "avg_ratings": 3.83, "genres": ["Cultural", "African American", "Fiction"], "title": "Shifting through Neutral", "author": "Bridgett M. Davis", "num_pages": "305", "awards": ["Hurston/Wright Legacy Award Nominee for Contemporary Fiction (2005)"], "places": [], "character_names": [], "language": null, "publish_date": "2005-05-03 00:00:00", "ISBN": "0641772858"},
{"url": "https://www.goodreads.com/book/show/6969591-perfect-peace", "num_ratings": "5,218", "num_reviews": "749", "avg_ratings": 4.23, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Gender", "Book Club"], "title": "Perfect Peace", "description": ["     When the seventh child of the Peace family, named Perfect, turns eight, her mother Emma Jean tells her bewildered daughter, “You was born a boy. I ", "you a girl. But that ain’t what you", "     When the seventh child of the Peace family, named Perfect, turns eight, her mother Emma Jean tells her bewildered daughter, “You was born a boy. I ", "you a girl. But that ain’t what you was supposed to be. So, from now on, you gon’ be a boy. It’ll be a little strange at first, but you’ll get used to it, and this’ll be over after while.” ", "     From this point forward, his life becomes a bizarre kaleidoscope of events. Meanwhile, the Peace family is forced to question everything they thought they knew about gender, sexuality, unconditional love, and fulfillment."], "author": "Daniel Black", "num_pages": "341", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-16 00:00:00", "ISBN": "0312582676"},
{"url": "https://www.goodreads.com/book/show/18275967-shoot-the-lights-out", "num_ratings": "23", "num_reviews": "5", "avg_ratings": 4.74, "genres": ["Romance", "African American Romance"], "title": "Shoot the Lights Out", "description": ["When Jackie Donovan stumbles over Adaris Singleton at the Nashville airport while en route to her dad’s funeral, little does she know that the trip will lead to love, loss, and basketball. ", "Shoot the Lights out is the story of a newly retired WNBA basketball player who returns home to assume the coaching position vacated by a beloved coach who amassed 13 State Championships", "When Jackie Donovan stumbles over Adaris Singleton at the Nashville airport while en route to her dad’s funeral, little does she know that the trip will lead to love, loss, and basketball. ", "Shoot the Lights out is the story of a newly retired WNBA basketball player who returns home to assume the coaching position vacated by a beloved coach who amassed 13 State Championships and turned out more college-bound athletes than anyone else in Tennessee history…who just so happens to be her recently deceased father. As Jackie figures out how to coach 13 rambunctious high school boys, she falls head over heels in love with Adaris Singleton, the all-pro star of the Tennessee Trailblazers football team.", "Happily ever after is dribbled down the drain when Adaris finds out that Jackie is coaching his son. The pressure is on as Jackie and Adaris figure out how to navigate their relationship on and off the court. They are supported throughout by a cast of characters—a.k.a. their best friends Keeva, Chris, Max, Shelley, Amos and Serena and family matriarchs Ella and Aunt D —who dispense advice and wisdom about death, life, and, ultimately, the game of love. ", "So, the game is on—relax and enjoy it play by play in Shoot the Lights Out!"], "author": "Stephanie Sinkfield", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-30 00:00:00", "ISBN": "9780989693"},
{"url": "https://www.goodreads.com/book/show/13409624-love-in-a-carry-on-bag", "num_ratings": "297", "num_reviews": "79", "avg_ratings": 3.98, "genres": ["Womens Fiction", "Chick Lit", "Fiction", "Romance", "Romance", "African American Romance"], "title": "Love in a Carry-on Bag", "description": ["Erica Shaw spends her week babysitting the country's bestselling authors for one of the top publishing companies in New York City. But on Friday nights she escapes to D.C., where her sexy-lipped musician boyfriend, Warren Prince, works and performs. Their connection is fierce, and the couple promises to never miss a weekend together. But when real life walks in an overbear", "Erica Shaw spends her week babysitting the country's bestselling authors for one of the top publishing companies in New York City. But on Friday nights she escapes to D.C., where her sexy-lipped musician boyfriend, Warren Prince, works and performs. Their connection is fierce, and the couple promises to never miss a weekend together. But when real life walks in an overbearing father, an alcoholic mother, office politics, and a lucrative job contract the couple starts unraveling at the seam. Tempers flare, violence breaks, while new lovers eagerly wait in the wings to claim both of them.", "Drenched in the perils of passion and the sweet-sounds of jazz, Johnson dives deep into the world of ambition and the stumbling blocks of family. Clever, fast-paced and sexy, ", " is a modern day love story that marks the healing power of forgiveness and begs the question, how much baggage is really too heavy to carry.", "“Sadeqa Johnson is a captivating novelist, who extrapolates the forces that pressure passion and sex in modern times. In the tradition of Terri McMillian and Omar Tyree, the distinctive style she has cultivated will smolder and smoke long after the last page has been turned.” –", ", author of "], "author": "Sadeqa Johnson", "num_pages": "336", "awards": ["USA Best Book Award for Fiction: African American  (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-20 12:00:00", "ISBN": "0984728902"},
{"url": "https://www.goodreads.com/book/show/6659796-the-size-of-a-mustard-seed", "num_ratings": "55", "num_reviews": "11", "avg_ratings": 4.35, "genres": ["Fiction", "Religion", "Islam", "Literature", "Did Not Finish"], "title": "The Size of a Mustard Seed", "description": ["Sullivan ushers in a new era of fiction--urban Islamic fiction--with this tale about Jameelah, a 27-year-old Muslim woman born to what appears to be one of the inner-city's stronger blended American-Muslim families."], "author": "Umm Juwayriyah", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-01 00:00:00", "ISBN": "0976786141"},
{"url": "https://www.goodreads.com/book/show/240141.God_Don_t_Like_Ugly", "num_ratings": "7,598", "num_reviews": "344", "avg_ratings": 4.3, "genres": ["Fiction", "Cultural", "African American"], "title": "God Don't Like Ugly", "description": [" bestselling author Mary Monroe sweeps readers back to the streets, porches, and parlors of civil rights-era Ohio to bring to life the first steps of an enduring friendship between two girls from opposite sides of the track. . .", "Annette Goode is a shy, awkward, overweight child with a terrible secret. Frightened and ashamed, Annette withdraws into a world of b", " bestselling author Mary Monroe sweeps readers back to the streets, porches, and parlors of civil rights-era Ohio to bring to life the first steps of an enduring friendship between two girls from opposite sides of the track. . .", "Annette Goode is a shy, awkward, overweight child with a terrible secret. Frightened and ashamed, Annette withdraws into a world of books and food. But the summer Annette turns thirteen, something incredible happens: Rhoda Nelson chooses her as a friend. Dazzling, generous Rhoda, who is everything Annette is not--gorgeous, slim, and worldly--welcomes Annette into the heart of her eccentric family, which includes her handsome and dignified father;her lovely, fragile \"Muh'Dear;\" her brooding, dangerous brother Jock;and her colorful white relatives--half-crazy Uncle Johnny, sultry Aunt Lola, and scary, surly Granny Goose.", "With Rhoda's help, Annette survives adolescence and blossoms as a woman. But when her beautiful best friend makes a stunning confession about a horrific childhood crime, Annette's world will never be the same.", "\"A coming-of-age journey depicted with wit, poignancy and bite.\" --"], "author": "Mary Monroe", "num_pages": "432", "awards": [], "places": ["Miami, Florida", "Richland, Ohio"], "character_names": ["Annette Good", "Rhoda Nelson", "Pee Wee Davis", "Mr. Boatwright", "Scary Mary", "Muh'Dear", "Judge Lawson"], "language": "English", "publish_date": "2006-12-01 00:00:00", "ISBN": "0758220324"},
{"url": "https://www.goodreads.com/book/show/13499202-i-should-ve-told-her", "num_ratings": "83", "num_reviews": "24", "avg_ratings": 4.33, "genres": ["Fiction", "Romance", "African American Romance"], "title": "I Should've Told Her", "description": ["Your favorite girls are back with more drama, lies, and deception. Amanda and Stephanie attempt to work on fixing their tattered relationship while Tiffany and Amanda’s relationship continues to drift apart. Stephanie fights to hold on to her man while the others fight to win one back. But when secrets unfold, they soon find themselves fighting for their lives."], "author": "Veronica E. Kelly", "num_pages": "238", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-02-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17334042-madam-president", "num_ratings": "30", "num_reviews": "19", "avg_ratings": 4.57, "genres": ["Spy Thriller", "Espionage"], "title": "MADAM PRESIDENT", "description": ["MADAM PRESIDENT is part of Jerry Beller’s Political Thriller/Historical Fiction series, the American Myth Series.", "MADAM PRESIDENT follows President Kalinda Resbo, the first female and black president, as she runs for reelection while fulfilling the many duties that come with the most difficult job in the world. With the election as a backdrop, madam weaves through an Irania", "MADAM PRESIDENT is part of Jerry Beller’s Political Thriller/Historical Fiction series, the American Myth Series.", "MADAM PRESIDENT follows President Kalinda Resbo, the first female and black president, as she runs for reelection while fulfilling the many duties that come with the most difficult job in the world. With the election as a backdrop, madam weaves through an Iranian Crisis, an investigation into moles and corruption in the FBI, Congress and corporate America. Beller addresses many real events and people who are part of current events for the USA during 2012, while also creating many interesting fictional characters. President Resbo’s runs for reelection as an independent, running against congress and the two party system, advocating a different approach to politics, solutions that go outside those the democrats and republicans squabble over.", "MADAM PRESIDENT is the first of a series of American Myth novels that Beller will release over the next several years. He has worked on the series for over two decades, and the novels cover the history of the United States, blending fiction and non-fiction in the manner of a historical fiction purist.", "Jerry Beller will also be releasing HEY JOE in the spring. This is a story where an American moves to Jamaica in the greatest adventure of his life, which happens to lead to the most significant romance of his life. HEY JOE is the first of several books in the Jamaica Series."], "author": "Jerry Beller", "num_pages": "325", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/537892.Freshwater_Road", "num_ratings": "1,023", "num_reviews": "137", "avg_ratings": 3.7, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "African American", "Historical"], "title": "Freshwater Road", "description": ["When University of Michigan sophomore Celeste Tyree travels to Mississippi to volunteer her efforts in Freedom Summer, she's assigned to help register voters in the small town of Pineyville, a place best known for a notorious lynching that occurred only a few years earlier. As the long, hot summer unfolds, Celeste befriends several members of the community, but there are a", "When University of Michigan sophomore Celeste Tyree travels to Mississippi to volunteer her efforts in Freedom Summer, she's assigned to help register voters in the small town of Pineyville, a place best known for a notorious lynching that occurred only a few years earlier. As the long, hot summer unfolds, Celeste befriends several members of the community, but there are also those who are threatened by her and the change that her presence in the South represents. Finding inner strength as she helps lift the veil of oppression and learns valuable lessons about race, social change, and violence, Celeste prepares her adult students for their showdown with the county registrar. All the while, she struggles with loneliness, a worried father in Detroit, and her burgeoning feelings for Ed Jolivette, a young man also in Mississippi for the summer."], "author": "Denise Nicholas", "num_pages": "432", "awards": ["Hurston/Wright Legacy Award for Debut Fiction (2006)"], "places": ["Mississippi"], "character_names": [], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "1416524827"},
{"url": "https://www.goodreads.com/book/show/6780522-the-ice-cream-girls", "num_ratings": "8,556", "num_reviews": "736", "avg_ratings": 3.96, "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Mystery", "Contemporary", "Mystery", "Crime"], "title": "The Ice Cream Girls", "description": ["As teenagers Poppy Carlisle and Serena Gorringe were the only witnesses to a tragic event. Amid heated public debate, the two seemingly glamorous teens were dubbed ‘The Ice Cream Girls’ by the press and were dealt with by the courts.", "Years later, having led very different lives, Poppy is keen to set the record straight about what really happened, while married mother-of-two", "As teenagers Poppy Carlisle and Serena Gorringe were the only witnesses to a tragic event. Amid heated public debate, the two seemingly glamorous teens were dubbed ‘The Ice Cream Girls’ by the press and were dealt with by the courts.", "Years later, having led very different lives, Poppy is keen to set the record straight about what really happened, while married mother-of-two Serena wants no one in her present to find out about her past. But some secrets will not stay buried – and if theirs is revealed, everything will become a living hell all over again..."], "author": "Dorothy Koomson", "num_pages": "452", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "1847443648"},
{"url": "https://www.goodreads.com/book/show/22061448-better-than-okay", "num_ratings": "344", "num_reviews": "69", "avg_ratings": 4.3, "genres": ["Romance", "African American Romance", "Romance"], "title": "Better Than Okay", "description": ["“Sometimes it’s not whether or not you survive, but HOW you survive. I guess that might be the thing that makes you the person you are... How you survive.”", "When Miami music writer Destiny Michaels learned her childhood friend, the always cool and collected Brian Jace, was moving from their hometown of Phoenix to Miami, she wanted to do cartwheels across Ocean Drive. ", "Brian h", "“Sometimes it’s not whether or not you survive, but HOW you survive. I guess that might be the thing that makes you the person you are... How you survive.”", "When Miami music writer Destiny Michaels learned her childhood friend, the always cool and collected Brian Jace, was moving from their hometown of Phoenix to Miami, she wanted to do cartwheels across Ocean Drive. ", "Brian has always been able to counter Destiny’s annoying tendency to overthink things, and he’s the only person she knows with a love for music that’s as intense as hers. However, when he arrives, she quickly realizes there’s been a major shift in their formally platonic relationship. And no matter how scared she is about taking things to the next level, their feelings only intensify. ", "But just as she begins to believe that real love can exist outside of sappy romantic comedies, Destiny is forced to question everything she thinks she knows about life, including her new feelings for Brian. ", "She soon discovers that while we can’t control some things that happen to us, the power of unconditional love, once accepted, can make life better than okay."], "author": "Jacinta Howard", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1685473.If_The_Shoe_Fits", "num_ratings": "70", "num_reviews": "8", "avg_ratings": 4.16, "genres": ["Christian", "Womens Fiction", "Chick Lit", "Fiction"], "title": "If The Shoe Fits", "description": ["In all my thirty-five years, I, shoe designer Rochelle Gardner, have never had so many men interested in me! My teen son's dad is back in my life after suffering from amnesia (yes, ", "). The church deacon has had his eye on me for years (and never said a word). And the young waiter (from the restaurant I've visited for singles' events) is trying to steal my heart. I've", "In all my thirty-five years, I, shoe designer Rochelle Gardner, have never had so many men interested in me! My teen son's dad is back in my life after suffering from amnesia (yes, ", "). The church deacon has had his eye on me for years (and never said a word). And the young waiter (from the restaurant I've visited for singles' events) is trying to steal my heart. I've been struggling with my faith, trying to figure out which man God has chosen for me and wondering if I have the courage to step forward, on my not-so-pretty feet, to accept love. It's almost too much for the Sassy Sistahood to handle, but my girlfriends always have my back!"], "author": "Marilynn Griffith", "num_pages": "278", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-19 00:00:00", "ISBN": "0373785763"},
{"url": "https://www.goodreads.com/book/show/2213434.Going_Down_South", "num_ratings": "277", "num_reviews": "55", "avg_ratings": 3.91, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Contemporary", "Family"], "title": "Going Down South", "description": ["From the author of ", " comes a heartwarming tale of second chances and the unparalleled love between mothers and daughters.", "When fifteen-year-old Olivia Jean finds herself in the “family way,” her mother, Daisy, who has never been very maternal, springs into action. Daisy decides that Olivia Jean can’t stay in New York and whisks her away to her grandmother’s", "From the author of ", " comes a heartwarming tale of second chances and the unparalleled love between mothers and daughters.", "When fifteen-year-old Olivia Jean finds herself in the “family way,” her mother, Daisy, who has never been very maternal, springs into action. Daisy decides that Olivia Jean can’t stay in New York and whisks her away to her grandmother’s farm in Alabama to have the baby–even though Daisy and her mother, Birdie, have been estranged for years. When they arrive, Birdie lays down the law: Sure, her granddaughter can stay, but Daisy will have to stay as well. Though Daisy is furious, she has no choice. ", "Now, under one little roof in the 1960s Deep South, three generations of spirited, proud women are forced to live together. One by one, they begin to lose their inhibitions and share their secrets. And as long-guarded truths emerge, a baby is born–a child with the power to turn these virtual strangers into a real, honest-to-goodness family."], "author": "Bonnie Glover", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-29 00:00:00", "ISBN": "0345480910"},
{"url": "https://www.goodreads.com/book/show/759638.She_s_My_Baby", "num_ratings": "710", "num_reviews": "61", "avg_ratings": 4.43, "genres": ["Romance", "Romance", "African American Romance", "Contemporary"], "title": "She's My Baby", "description": ["\"No husband, no boyfriend, no pets and definitely \"no\" children...\" These were the \"rules\" that took magazine CEO Leila Owens to the top. Always in charge, in control, she was never rattled. Until she finds a baby in her kitchen on Christmas--and a sexy neighbor wearing next to nothing knocking at her front door....", "Garrick Grayson didn't know whom to comfort first, the how", "\"No husband, no boyfriend, no pets and definitely \"no\" children...\" These were the \"rules\" that took magazine CEO Leila Owens to the top. Always in charge, in control, she was never rattled. Until she finds a baby in her kitchen on Christmas--and a sexy neighbor wearing next to nothing knocking at her front door....", "Garrick Grayson didn't know whom to comfort first, the howling infant or the career diva without a clue.", "But with a little help, Leila's soon juggling bottles, naps and meetings, while Garrick is falling for adorable Emma--and gorgeous, feisty, maternally challenged Leila. Garrick had sworn off women married to their jobs; Leila had sworn off everything else. So why, when they were together, did things feel so...right?"], "author": "Adrianne Byrd", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-01 00:00:00", "ISBN": "1583147799"},
{"url": "https://www.goodreads.com/book/show/15795589-practice-what-you-preach", "num_ratings": "13", "num_reviews": "4", "avg_ratings": 3.92, "genres": [], "title": "Practice What You Preach", "author": "Vanessa Harris-Greenlee", "num_pages": "122", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18867782-private-sins", "num_ratings": "911", "num_reviews": "72", "avg_ratings": 4.16, "genres": ["Christian Fiction", "Christian", "Drama", "Business", "Amazon", "Relationships"], "title": "Private Sins", "description": ["Kelly was in deep trouble; her husband was a pastor and she his loyal first lady. Well she was…until she had an affair with Chris; the first elder of their church. And now she was pregnant with his child. Could she keep the secret from her husband and pretend that all was well? Or should she confess her private sin and let the chips fall where they may?"], "author": "Brenda Barrett", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/94567.Plenty_Good_Room", "num_ratings": "63", "num_reviews": "8", "avg_ratings": 3.81, "genres": ["Fiction", "Christian", "Christian Fiction"], "title": "Plenty Good Room", "description": ["When child care worker Tamara Britton is asked to temporarily take 14-year-old foster child Sienna Larson into her home, she agrees--but only because it's temporary. Soon, Tamara finds the outspoken, churchgoing teenager to be almost more than she can bear. Yet, despite herself, Tamara begins to open her heart as well as her home. Now, through the bond she forms with Sienn", "When child care worker Tamara Britton is asked to temporarily take 14-year-old foster child Sienna Larson into her home, she agrees--but only because it's temporary. Soon, Tamara finds the outspoken, churchgoing teenager to be almost more than she can bear. Yet, despite herself, Tamara begins to open her heart as well as her home. Now, through the bond she forms with Sienna, Tamara begins to awaken to newfound truths about herself, her family history, and God--and learns that no matter what the circumstances are, God is in control of not just some things, but of all things."], "author": "Cheri Paris Edwards", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-15 00:00:00", "ISBN": "0446576476"},
{"url": "https://www.goodreads.com/book/show/11337.The_Bluest_Eye", "num_ratings": "130,647", "num_reviews": "5,695", "avg_ratings": 4.0, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Cultural", "African American", "Literature"], "title": "The Bluest Eye", "description": [" is Toni Morrison's first novel, a book heralded for its richness of language and boldness of vision. Set in the author's girlhood hometown of Lorain, Ohio, it tells the story of black, eleven-year-old Pecola Breedlove. Pecola prays for her eyes to turn blue so that she will be as beautiful and beloved as all the blond, blue-eyed children in America. In the a", " is Toni Morrison's first novel, a book heralded for its richness of language and boldness of vision. Set in the author's girlhood hometown of Lorain, Ohio, it tells the story of black, eleven-year-old Pecola Breedlove. Pecola prays for her eyes to turn blue so that she will be as beautiful and beloved as all the blond, blue-eyed children in America. In the autumn of 1941, the year the marigolds in the Breedloves' garden do not bloom. Pecola's life does change- in painful, devastating ways.", "What its vivid evocation of the fear and loneliness at the heart of a child's yearning, and the tragedy of its fulfillment. ", " remains one of Tony Morrisons's most powerful, unforgettable novels- and a significant work of American fiction."], "author": "Toni Morrison", "num_pages": "216", "awards": ["National Book Critics Circle Award"], "places": ["United States of America", "Lorain, Ohio"], "character_names": ["Pauline Breedlove", "Cholly Breedlove", "Pecola Breedlove"], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0452287065"},
{"url": "https://www.goodreads.com/book/show/32725389-log", "num_ratings": "12", "num_reviews": "5", "avg_ratings": 4.58, "genres": ["Comics", "Superheroes", "Science Fiction"], "title": "LOG: The Legends of Genesis: Not Your Ordinary Heroes", "description": ["The Legends of Genesis (Asian, African, and World mythology) (fantasy, super power, anime, super hero, wuxia, martial arts, philosophy, historical, romance, action, adventure, sci-fi, prehistoric) ", "Imagine a world where people don't age past their prime. Where a person that would labeled as intellectually gifted on Earth is nothing more than average there. A place where the", "The Legends of Genesis (Asian, African, and World mythology) (fantasy, super power, anime, super hero, wuxia, martial arts, philosophy, historical, romance, action, adventure, sci-fi, prehistoric) ", "Imagine a world where people don't age past their prime. Where a person that would labeled as intellectually gifted on Earth is nothing more than average there. A place where the average person is even more powerful than your typical super hero. A place several times more vast and mysterious than earth . and home to over 50 non hybrid races. Just Imagine how far they would have advanced in the time that we have had. Then imagine how far they would have advanced given 10, 100, or even 1000 times longer than we had. Do you imagine large skyscrapers and flying cars as in your common sci fi flicks and novels. Well, they've advanced far past that even. What would their super heroes be like, and the villains that they have to combine forces to fight against. And how would the planet survive the battles between these people. Not to mention what would every day life be like? And with their powers would they feel as gods themselves and not have need to reverence them? ", "In fact the heroes held a contest and after beating many Shenxian, kami, Orishas, and Immortals they believed they were indeed powerful enough to at least compete with the gods. They challenged the supreme gods and the realm gods. After loosing horribly they incurred the supreme goddess' wrath as punishment. However she was not satisfied with just punishing them, as she wanted to destroy them completely. However the supreme god felt that their punishment was enough and that they should be forgiven. Unable to agree they decided to settle it the way gods do. They made bet which would decide whether they would perish or thrive. Six beings would be created, beings much more powerful than any that have ever been created. Two beings would be of light, two would be of darkness, and two neutral ones that would pick a side. The gods would set up challenges for them along the way to train them until the day of the final contest. When that day comes they would fight each other to the death and if light won they would be saved, however if dark won they would all die. Which one would prevail light or darkness? Sounds like your typical fantasy novel right? However what if when they are born they decide not to be pawns in the god's game? Can and will they defy their destiny even when all their moves are being controlled leading them to that end? And if they do defy the gods what will be the retribution for their actions,... and more importantly how will they respond to it? ", "This story follows the lives of the 6 beings. ", "The children of Darkness ", "Titan- (master of dimensions, souls, energy, and matter/anti matter) ", "Nina- (Master of psyche, various elements and forces, space, and the dead) ", "The children of Light ", "Emerald- (elemental master, spirit and sentient, energy, matter and fusion) ", "Sapphire (Master of copying and reversing, Time, and various elements) ", "The neutral children ", "Rage (master of reality, mystic, and various elements.) ", "Dragon (master of magic, various elements, and death) ", "This story has hundreds of characters all with their own goals and interest. Full of unexpected plot twists and turns that will keep you guessing at each turn of the page. Volume 1 deals with the introduction of the main characters but is by no means slow paced. It pulls you right into the ever evolving and expanding world. Filled with action, romance, comedy, and philosophy that will have you rethink everything. This is anything but ordinary, and one thing to keep in mind is that nothing is as it seems."], "author": "Mark McCants", "num_pages": "656", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11106479-single-girl-summer", "num_ratings": "208", "num_reviews": "43", "avg_ratings": 4.03, "genres": ["Cultural", "African American", "Womens Fiction", "Chick Lit", "Fiction", "Humor", "Funny"], "title": "Single Girl Summer", "description": ["Relationships aren't complicated... People are! Button Jackson knows two things for sure: all men cheat and all women are rivals. So it's no surprise that the impeccably dressed restaurateur hasn't had a serious boyfriend, close girlfriend, or any connection of substance in years. Meghan Cherry has the opposite problem. Reeling from a painful divorce, the techie with a des", "Relationships aren't complicated... People are! Button Jackson knows two things for sure: all men cheat and all women are rivals. So it's no surprise that the impeccably dressed restaurateur hasn't had a serious boyfriend, close girlfriend, or any connection of substance in years. Meghan Cherry has the opposite problem. Reeling from a painful divorce, the techie with a desire to unleash her artistic side, can't figure out why her relationships end with nothing when she gives so much. Attorney, Dawn Martin, is stuck somewhere in the middle. Waiting in purgatory for a marriage proposal that just won't come has molded her into a woman she swore she'd never be. Against the backdrop of hot days and cool nights in Chicago and armed with red cups of Single Girl Sangria, Meghan, Dawn, and Button, share stories, perspectives, and advice on everything from open relationships to open-toe shoes. They come together by chance, grow together as friends, and ultimately discover that for every girl, there's a season."], "author": "Deanna Kimberly Burrell", "num_pages": "211", "awards": [], "places": ["Chicago, Illinois"], "character_names": [], "language": "English", "publish_date": "2011-05-01 00:00:00", "ISBN": "1935766139"},
{"url": "https://www.goodreads.com/book/show/606095.Coffee_Will_Make_You_Black", "num_ratings": "4,397", "num_reviews": "183", "avg_ratings": 4.04, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Lgbt", "Glbt", "Queer", "Young Adult", "Historical"], "title": "Coffee Will Make You Black", "description": ["Set on Chicago's Southside in the mid-to-late 60s, ", " is the moving and entertaining tale of Jean \"Stevie\" Stevenson, a young black woman growing up through the Civil Rights and Black Power movements. The novel opens at a time when, for black families, seeing a black person on television was an event; when expressions like \"I don't want nothing blac", "Set on Chicago's Southside in the mid-to-late 60s, ", " is the moving and entertaining tale of Jean \"Stevie\" Stevenson, a young black woman growing up through the Civil Rights and Black Power movements. The novel opens at a time when, for black families, seeing a black person on television was an event; when expressions like \"I don't want nothing black but a Cadillac\" and \"Coffee will make you black\" were handed down from one generation to the next without comment. Stevie is a bookworm, yet she longs to fit in with the cool crowd. Fighting her mother every step of the way, she begins to experiment with talkin' trash, \"kicking butt,\" and boys. With the assassination of Dr. King she gains a new political awareness, which makes her decide to wear her hair in a 'fro instead of straightened, to refuse to use skin bleach, and to confront the prejudice she observes in blacks as well as whites. April Sinclair writes frankly about a young black woman's sexuality, and about the confusion Stevie faces when she realizes she's more attracted to the school nurse -- who is white -- than her teenage boyfriend. As readers follow Stevie's at times harrowing, at times hilarious story, they will learn what it was like to be black before black was beautiful."], "author": "April Sinclair", "num_pages": "256", "awards": [], "places": ["Chicago, Illinois"], "character_names": [], "language": "English", "publish_date": "2007-01-30 00:00:00", "ISBN": "0380724596"},
{"url": "https://www.goodreads.com/book/show/760264.Far_From_the_Tree", "num_ratings": "760", "num_reviews": "42", "avg_ratings": 3.99, "genres": ["Fiction", "Cultural", "African American"], "title": "Far From the Tree", "description": ["From the bestselling and award-winning authors of ", " comes a novel of sisterhood, family secrets, and the ties that bind. Two sisters--a doctor's wife and an actress--inherit a house in Prosper, North Carolina, and begin to dredge up a past of tangled relationships."], "author": "Virginia DeBerry", "num_pages": "338", "awards": [], "places": ["North Carolina"], "character_names": [], "language": "English", "publish_date": "2000-09-16 00:00:00", "ISBN": "0312202911"},
{"url": "https://www.goodreads.com/book/show/768207.The_Ex_Files", "num_ratings": "900", "num_reviews": "75", "avg_ratings": 4.31, "genres": ["Christian Fiction", "Fiction", "Christian"], "title": "The Ex Files: A Novel about Four Women and Faith", "description": ["\"There are four ways a woman can handle heartbreak. She can fall apart, seek revenge, turn cold, or move on. The Ex Files is the story of these four women: When Kendall Stewart finds her husband and her sister in bed together, she vows to never let anyone get that close again. But when she is faced with saving the life of the woman who destroyed hers, will she be able able", "\"There are four ways a woman can handle heartbreak. She can fall apart, seek revenge, turn cold, or move on. The Ex Files is the story of these four women: When Kendall Stewart finds her husband and her sister in bed together, she vows to never let anyone get that close again. But when she is faced with saving the life of the woman who destroyed hers, will she be able able to forgive? When an NBA superstar tells his mistress, Asia Ingrum, that he decided to honor his marriage vows, her shook quickly gives way to revenge... but her decision may come back to haunt their five-years-old daughter. Every night Vanessa Martin wonders why her husband committed suicide. Even worst, she contemplates joining him in eternity. Will Vanessa be able to gather the strenght to live again? Sheridan Hart is finally finding her way after a lie destoryed her seventeen-years of marriage. Her new love is ready ti get married, but will she commit to this younger man or is her ex-husband takong up too much space in her heart? When their pastor asks kendall, Asia, Vanessa anf Sheridan to meet weekly for prayer, they can't imagine they will have anything in common. But them a devastating tragedy stikes, and these strangers are forced to reexamine their choices. Will they finsd true friendship, or will prayer-and their union-failed them?"], "author": "Victoria Christopher Murray", "num_pages": "388", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-06-19 00:00:00", "ISBN": "1416535519"},
{"url": "https://www.goodreads.com/book/show/22571586-one-night", "num_ratings": "878", "num_reviews": "151", "avg_ratings": 3.85, "genres": ["Fiction", "Cultural", "African American", "Romance", "Adult Fiction", "Erotica"], "title": "One Night", "description": ["For one night, a couple checks in to an upscale hotel. The pair seem unlikely companions, from opposing strata of society, but their attraction is palpable to all who observe them—or overhear their cries of passion. In the course of tw", "For one night, a couple checks in to an upscale hotel. The pair seem unlikely companions, from opposing strata of society, but their attraction is palpable to all who observe them—or overhear their cries of passion. In the course of twelve hours, con games, erotic interludes, jealousy, violence, and murder swirl around them. Will they part ways in bliss, in sorrow, or in death?", "Filled with all the hallmarks of an Eric Jerome Dickey bestseller—erotic situations, edge-of-your-seat twists and turns, and fun, believable relationships—", " will delight Dickey’s existing fans and lure countless new ones."], "author": "Eric Jerome Dickey", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-04-21 00:00:00", "ISBN": "0525954856"},
{"url": "https://www.goodreads.com/book/show/12007373-songs-of-deliverance", "num_ratings": "54", "num_reviews": "2", "avg_ratings": 4.43, "genres": ["Contemporary", "Christian Fiction"], "title": "Songs of Deliverance", "description": ["Another powerful story from a popular author with a growing African American audience, this book will inspire readers with real, raw emotion, and the promise of redemption."], "author": "Marilynn Griffith", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-11-01 00:00:00", "ISBN": "1441212701"},
{"url": "https://www.goodreads.com/book/show/15955514-the-rose-petal-beach", "num_ratings": "6,527", "num_reviews": "562", "avg_ratings": 4.01, "genres": ["Womens Fiction", "Chick Lit", "Fiction", "Mystery", "Romance", "Mystery", "Crime"], "title": "The Rose Petal Beach", "description": ["Every love story has a dangerous twist. ", "Tamia Challey is horrified when her husband, Scott, is accused of something terrible – but when she discovers who his accuser is, everything goes into freefall. Backed into a corner and unsure what to think, Tamia is forced to choose who she instinctively believes. But this choice has dire consequences for all concerned, especially w", "Every love story has a dangerous twist. ", "Tamia Challey is horrified when her husband, Scott, is accused of something terrible – but when she discovers who his accuser is, everything goes into freefall. Backed into a corner and unsure what to think, Tamia is forced to choose who she instinctively believes. But this choice has dire consequences for all concerned, especially when matters take a tragic turn. ", "Then a stranger arrives in town to sprinkle rose petals in the sea in memory of her lost loved one. This stranger carries with her shocking truths that will change the lives of everyone she meets, and will once again force Tamia to make some devastating choices..."], "author": "Dorothy Koomson", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-30 00:00:00", "ISBN": "1780874979"},
{"url": "https://www.goodreads.com/book/show/20943184-misconceptions", "num_ratings": "202", "num_reviews": "43", "avg_ratings": 4.14, "genres": ["Romance", "Cultural", "African American", "Romance", "African American Romance", "Contemporary"], "title": "Misconceptions", "description": ["After finally ending her year-long fling with a man she only refers to as Bad Habit, the narcissistic, temperamental Alexandria Stone moves back home to New York to start her dream job. That is, until she discovers she’s pregnant, with quadruplets. When a business merger leaves her jobless and penniless, she has no other choice but to move to Atlanta with Bad Habit, a sedu", "After finally ending her year-long fling with a man she only refers to as Bad Habit, the narcissistic, temperamental Alexandria Stone moves back home to New York to start her dream job. That is, until she discovers she’s pregnant, with quadruplets. When a business merger leaves her jobless and penniless, she has no other choice but to move to Atlanta with Bad Habit, a seductive, callous man she despises due to their rocky past. Desperate to have a picture-perfect life, Alex is convinced she must make Bad Habit fall in love with her, no matter the cost. Misconceptions is a hilarious nine-month chronicle of Alexandria’s doomed quest for a perfect life."], "author": "Blu Daniels", "num_pages": "267", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3584902-talk-to-me", "num_ratings": "119", "num_reviews": "15", "avg_ratings": 4.39, "genres": ["Cultural", "African American"], "title": "Talk to Me", "description": ["Unable to hear after surviving a fireworks explosion, Noel Richardson, the CEO of a St. Louis non-profit organization, finds what he's looking for both in his spiritual life and love life when he joins God's Grace Church, where he meets beautiful interpreter Mackenzie Norton."], "author": "Pat Simmons", "num_pages": "288", "awards": [], "places": ["St. Louis, Missouri"], "character_names": [], "language": "English", "publish_date": "2008-11-01 00:00:00", "ISBN": "1601629729"},
{"url": "https://www.goodreads.com/book/show/28512489-the-perfect-find", "num_ratings": "587", "num_reviews": "141", "avg_ratings": 4.3, "genres": ["Fiction", "Romance", "Womens Fiction", "Chick Lit", "Contemporary", "Science", "Chemistry"], "title": "The Perfect Find", "description": ["Will a forty-year-old woman with everything on the line – her high-stakes career, ticking biological clock, bank account – risk it all for a lusty secret romance with the one person who could destroy her comeback?", "Jenna Jones, former It-girl fashion editor, is broke and desperate for a second chance. When she’s dumped by her longtime fiancé and fired from Darling magazine,", "Will a forty-year-old woman with everything on the line – her high-stakes career, ticking biological clock, bank account – risk it all for a lusty secret romance with the one person who could destroy her comeback?", "Jenna Jones, former It-girl fashion editor, is broke and desperate for a second chance. When she’s dumped by her longtime fiancé and fired from Darling magazine, she begs for a job at StyleZine.com from her old arch nemesis, Darcy Vale. But Jenna soon realizes she’s in over her head. She’s working with digital-savvy millennials half her age, has never even “Twittered,” and pretends to still be a Fashion Somebody while living a style lie (she sold her designer wardrobe to afford her sketched-out studio, and now quietly wears Walmart’s finest). Worse? The twenty-two-year-old videographer assigned to shoot her web series is driving her crazy. Wildly sexy with a smile Jenna feels in her thighs, Eric Combs is way off-limits – but almost too delicious to resist. ", "Written by the bestselling author of The Accidental Diva, The Perfect Find is a scandalously sexy, laugh-out-loud saga of star-crossed love and starting over."], "author": "Tia Williams", "num_pages": "363", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20416377-drinking-from-a-bitter-cup", "num_ratings": "339", "num_reviews": "67", "avg_ratings": 4.18, "genres": ["Fiction", "Drama", "Cultural", "African American", "Historical", "Historical Fiction"], "title": "Drinking from a Bitter Cup", "description": ["“1978. The year I turned ten and the year my mama killed herself. She was thirty-five, and dying is the last thing that should have been on her mind.”", "After the death of her mother, Sylvia Butler’s father, a man she knows only from an old photo, takes her from Louisville, Kentucky to Ozark, Alabama to live with his family. But his wife resents everything about this intruder", "“1978. The year I turned ten and the year my mama killed herself. She was thirty-five, and dying is the last thing that should have been on her mind.”", "After the death of her mother, Sylvia Butler’s father, a man she knows only from an old photo, takes her from Louisville, Kentucky to Ozark, Alabama to live with his family. But his wife resents everything about this intruder, from her out-of-wedlock conception to her dark skin and nappy hair.", "When the wife’s younger brother Charles returns from Vietnam, Sylvia thinks she has found a friend and confidante, only to be hurt again, but this time, in a manner she never could have imagined.", "Set under the backdrop of the Deep South in the 70s and 80s, this coming of age story of redemption and grace follows Sylvia in her journey from awkward girl to confident young woman, at last standing on her own."], "author": "Angela Jackson-Brown", "num_pages": "298", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/136946.Brothers_and_Sisters", "num_ratings": "4,014", "num_reviews": "66", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "African American"], "title": "Brothers and Sisters", "description": ["The phenomenal New York Times bestseller, now for the first time in trade paperback. Living and working in Los Angeles, a young African-American woman finds herself torn between loyalty to her race and her commitment to a cause."], "author": "Bebe Moore Campbell", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0425172678"},
{"url": "https://www.goodreads.com/book/show/24611515-naughtier-than-nice", "num_ratings": "475", "num_reviews": "75", "avg_ratings": 4.1, "genres": ["Fiction", "Cultural", "African American", "Romance"], "title": "Naughtier than Nice", "description": [" ", "Readers first met the McBroom sisters in Eric Jerome Dickey’s ", " bestseller ", ". In the highly anticipated sequel, ", ", we find out what happen", " ", "Readers first met the McBroom sisters in Eric Jerome Dickey’s ", " bestseller ", ". In the highly anticipated sequel, ", ", we find out what happens on the other side of the fairy tale.", " ", "The lives of Frankie, Tommie, and Olivia (Livvy) haven’t turned out quite as planned. Frankie has a pair of stalkers. The life that Tommie had dreamed of having with Blue has become anything but perfect, and Olivia, despite her efforts, hasn’t been able to get over the psychological barrier caused by her husband’s affair in ", ".  ", "Frankie’s life has taken on an element of danger, and she calls upon Driver, an ex-con who first appears in Dickey’s ", ", to bail her out of a potentially life-threatening situation, but that is a secret she has kept from her sisters.", "Tommie and Blue are now engaged, but due to something her more-mature love has done, the wedding is indefinitely on hold. As Blue and Tommie remain the perfect couple in public, Tommie has found herself physically attracted to a younger man. But that is a secret she has kept from her sisters.", "Livvy is trying to recapture the adventure she had during her revenge affair. She is seldom intimate with her husband, Tony, but when she has relations with him, it is by her rules and under certain conditions—it has to be a ménage à trois. But that is a secret she has kept from her sisters.", "Though the sisters are as close as any sisters could be, none wants the other two to know the dark secrets she is hiding. And during this season, all of the McBroom sisters are ", "."], "author": "Eric Jerome Dickey", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-10-27 00:00:00", "ISBN": "0525955208"},
{"url": "https://www.goodreads.com/book/show/1058863.In_Search_of_Satisfaction", "num_ratings": "2,949", "num_reviews": "91", "avg_ratings": 4.46, "genres": ["Cultural", "African American", "Fiction", "Short Stories", "Historical", "Historical Fiction"], "title": "In Search of Satisfaction", "description": ["The folk flavor of her storytelling has earned her  constant comparison to Langston Hughes and Zora  Neale Hurston, but through four collections of  short stories and two novels, J. California Cooper  has proven that hers is a wholly original talent  --one that embraces readers in an ever-widening  circle from one book to the next. With ", ", Cooper  ", "The folk flavor of her storytelling has earned her  constant comparison to Langston Hughes and Zora  Neale Hurston, but through four collections of  short stories and two novels, J. California Cooper  has proven that hers is a wholly original talent  --one that embraces readers in an ever-widening  circle from one book to the next. With ", ", Cooper  gracefully portrays men and women, some good and others  wickedly twisted, caught in their individual  thickets of want and need. On a once-grand plantation  in Yoville, \"a legal town-ship founded by the  very rich for their own personal use,\" a  freed slave named Josephus fathers two daughters,  Ruth and Yinyang, by two different women. His  desire, to give Yinyang and himself money and  opportunities, oozes through the family like an elixir,  melding with the equally strong yearnings of  Yoville's other residents, whose tastes don't  complement their neighbors'. What Josephus buries in his  life affects generations to come. J. California  Cooper's unfettered view of sin, forgiveness, and  redemption gives ", " a singular richness that belies its  universal themes."], "author": "J. California Cooper", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-09-01 00:00:00", "ISBN": "0385467869"},
{"url": "https://www.goodreads.com/book/show/892034.Sister_Sister", "num_ratings": "6,846", "num_reviews": "80", "avg_ratings": 4.17, "genres": ["Cultural", "African American", "Fiction", "Romance", "Adult"], "title": "Sister, Sister", "description": ["Sassy, comical, and true-to-life, ", " tells the tale of three young African-American women", "perky wife Valerie, scheming social worker Inda, and broken-hearted flight attendant Chiquita", "and how their lives are coming together, and apart, in Los Angeles. Fresh and in-your-face, this witty novel depicts a world where women sometimes have to alter their dreams, but", "Sassy, comical, and true-to-life, ", " tells the tale of three young African-American women", "perky wife Valerie, scheming social worker Inda, and broken-hearted flight attendant Chiquita", "and how their lives are coming together, and apart, in Los Angeles. Fresh and in-your-face, this witty novel depicts a world where women sometimes have to alter their dreams, but never have to stop embracing the future."], "author": "Eric Jerome Dickey", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-12-01 00:00:00", "ISBN": "0451188020"},
{"url": "https://www.goodreads.com/book/show/342833.Friday_Night_at_Honeybee_s", "num_ratings": "214", "num_reviews": "31", "avg_ratings": 4.26, "genres": ["Cultural", "African American", "Historical", "Historical Fiction", "Fiction"], "title": "Friday Night at Honeybee's", "description": ["Everyone who's anyone in the Harlem music scene has heard of Honeybee McColor and the famous Friday night gathers that fill her house to bursting. In the early 1960s, nowhere but \"The Big House\" attracts so many renowned jazz and blues musicians—and no one but Miss Honeybee attracts talented lost souls like Forestine Bent and Viola Bembrey.", "The two singers come from separat", "Everyone who's anyone in the Harlem music scene has heard of Honeybee McColor and the famous Friday night gathers that fill her house to bursting. In the early 1960s, nowhere but \"The Big House\" attracts so many renowned jazz and blues musicians—and no one but Miss Honeybee attracts talented lost souls like Forestine Bent and Viola Bembrey.", "The two singers come from separate worlds: one the Brooklyn projects, the other the Baptist, rural South. One has a God-given voice and the ambition to be a star, the other a more subtle gift and a handful of hazy fantasies. But both learn the destructive consequences of following their hearts. They find sanctuary together under Honeybee's tender guidance, struggling to find the balancing point where music doesn't overpower love. ", "Including a passel of characters both wildly raunchy and remarkably dignified, Andrea Smith has woven an unforgettable tale overflowing with energy, heart, and humanity."], "author": "Andrea    Smith", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-02-03 00:00:00", "ISBN": "0385336985"},
{"url": "https://www.goodreads.com/book/show/17572866-who-asked-you", "num_ratings": "4,707", "num_reviews": "768", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "African American", "Audiobook", "Family"], "title": "Who Asked You?", "description": ["Kaleidoscopic, fast-paced, and filled with McMillan’s inimitable humor, Who Asked You? opens as Trinetta leaves her two young sons with her mother, Betty Jean, and promptly disappears. BJ, a trademark McMillan heroine, already has her hands full dealing with her other adult children, two opinionated sisters, an ill husband, and her own postponed dreams—all while holding do", "Kaleidoscopic, fast-paced, and filled with McMillan’s inimitable humor, Who Asked You? opens as Trinetta leaves her two young sons with her mother, Betty Jean, and promptly disappears. BJ, a trademark McMillan heroine, already has her hands full dealing with her other adult children, two opinionated sisters, an ill husband, and her own postponed dreams—all while holding down a job delivering room service at a hotel. Her son Dexter is about to be paroled from prison; Quentin, the family success, can’t be bothered to lend a hand; and taking care of two lively grandsons is the last thing BJ thinks she needs. The drama unfolds through the perspectives of a rotating cast of characters, pitch-perfect, each playing a part, and full of surprises.", "Who Asked You? casts an intimate look at the burdens and blessings of family and speaks to trusting your own judgment even when others don’t agree. McMillan’s signature voice and unforgettable characters bring universal issues to brilliant, vivid life"], "author": "Terry McMillan", "num_pages": "383", "awards": [], "places": ["Los Angeles, California"], "character_names": [], "language": "English", "publish_date": "2013-09-17 00:00:00", "ISBN": "0670785695"},
{"url": "https://www.goodreads.com/book/show/12357700-the-taste-of-salt", "num_ratings": "1,788", "num_reviews": "289", "avg_ratings": 3.43, "genres": ["Fiction", "Cultural", "African American", "Contemporary", "Family"], "title": "The Taste of Salt", "author": "Martha Southgate", "num_pages": "303", "awards": ["Black Caucus of the American Library Association Literary Award Nominee for Fiction (Honor Book) (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/136913.Babylon_Sisters", "num_ratings": "2,039", "num_reviews": "98", "avg_ratings": 4.01, "genres": ["Cultural", "African American", "American", "African American Literature", "Womens Fiction", "Chick Lit", "Romance"], "title": "Babylon Sisters", "description": ["Catherine Sanderson seems to have it all: a fulfilling career helping immigrant women find jobs, a lovely home, and a beautiful, intelligent daughter on her way to Smith College. What Catherine doesn’t have: a father for her child– and she’s spent many years dodging her daughter’s questions about it. Now Phoebe is old enough to start poking around on her own. It doesn’t he", "Catherine Sanderson seems to have it all: a fulfilling career helping immigrant women find jobs, a lovely home, and a beautiful, intelligent daughter on her way to Smith College. What Catherine doesn’t have: a father for her child– and she’s spent many years dodging her daughter’s questions about it. Now Phoebe is old enough to start poking around on her own. It doesn’t help matters that the mystery man, B.J. Johnson–the only man Catherine has ever loved–doesn’t even know about Phoebe. He’s been living in Africa.", "Now B.J., a renowned newspaper correspondent, is back in town and needs Catherine’s help cracking a story about a female slavery ring operating right on the streets of Atlanta. Catherine is eager to help B.J., despite her heart’s uncertainty over meeting him again after so long, and confessing the truth to him–and their daughter. ", "Meanwhile, Catherine’s hands are more than full since she’s taken on a new client. Atlanta’s legendary Miss Mandeville–a housekeeper turned tycoon–is eager to have Catherine staff her housekeeping business. But why are the steely Miss Mandeville and her all-too-slick sidekick Sam so interested in Catherine’s connection to B.J.? What transpires is an explosive story that takes her world–not to mention the entire city of Atlanta–by storm.", "From the ", " bestselling author of ", " comes another fast-paced and emotionally resonant novel, by turns warm and funny, serious and raw. Pearl Cleage’s ability to create a gripping story centered on strong, spirited black women and the important issues they face remains unrivaled."], "author": "Pearl Cleage", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-28 00:00:00", "ISBN": "0345456106"},
{"url": "https://www.goodreads.com/book/show/14889822-the-perfect-marriage", "num_ratings": "1,643", "num_reviews": "230", "avg_ratings": 3.77, "genres": ["Fiction", "Cultural", "African American", "Audiobook"], "title": "The Perfect Marriage", "description": ["The ", " bestselling novel from the author of the Reverend Curtis Black series...", "ADDICTION. DECEPTION.", "PRETTY PICTURES HIDE UGLY SECRETS.", "Denise and Derrek Shaw are the perfect American couple. Happily married for fifteen years, they have a wonderful daughter, Mackenzie, successful careers, and a beautiful home in a posh Chicago suburb. They are attractive, respect", "The ", " bestselling novel from the author of the Reverend Curtis Black series...", "ADDICTION. DECEPTION.", "PRETTY PICTURES HIDE UGLY SECRETS.", "Denise and Derrek Shaw are the perfect American couple. Happily married for fifteen years, they have a wonderful daughter, Mackenzie, successful careers, and a beautiful home in a posh Chicago suburb. They are attractive, respected . . . and hiding a shocking secret: a dangerous addiction to drugs. ", "It started innocently enough. Denise occasionally used prescription drugs to help her deal with the long hours and demanding nature of her job. Derrek, also under pressure at work, began using cocaine socially with some of his colleagues. ", "They can quit whenever they want to. At least, that's what Denise would like to believe . . . ", "As her job becomes more stressful, Denise can no longer get through the day without a fix. Derrek realizes his harmless habit has become anything but, and desperately wants to get clean. However, his attempts are derailed when there is a sudden family tragedy. Once soul mates, now this husband and wife are quickly losing the immense love that had been the cornerstone of their marriage. With her parents spiraling out of control, Mackenzie makes an unexpected move to take matters into her own hands. Is her sacrifice too late-or is there still hope? Is there a final chance to save the Shaw family?"], "author": "Kimberla Lawson Roby", "num_pages": "179", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-08 00:00:00", "ISBN": "0446572500"},
{"url": "https://www.goodreads.com/book/show/765811.The_Women_of_Brewster_Place", "num_ratings": "16,195", "num_reviews": "543", "avg_ratings": 4.14, "genres": ["Fiction", "Short Stories", "Cultural", "African American", "Classics", "Historical", "Historical Fiction", "Contemporary", "Literature"], "title": "The Women of Brewster Place", "author": "Gloria Naylor", "num_pages": "192", "awards": ["National Book Award for First Novel (1983)"], "places": [], "character_names": [], "language": "English", "publish_date": "1983-06-30 00:00:00", "ISBN": "014006690X"},
{"url": "https://www.goodreads.com/book/show/17592275-the-awesome-girl-s-guide-to-dating-extraordinary-men", "num_ratings": "950", "num_reviews": "136", "avg_ratings": 3.95, "genres": ["Womens Fiction", "Chick Lit", "Fiction", "Cultural", "African American", "Romance"], "title": "The Awesome Girl's Guide to Dating Extraordinary Men", "description": ["Four women. Two years.", "A friendship to last a lifetime.", "The only things that Sharita, Thursday, Risa, and Tammy have in common are their disastrous love lives. But the year three of them turn 30 will be different, they swear!", "Sharita, a plump and conservative accountant wants to make partner at her firm and find the man of her dreams. Thursday, the daughter of a formerly char", "Four women. Two years.", "A friendship to last a lifetime.", "The only things that Sharita, Thursday, Risa, and Tammy have in common are their disastrous love lives. But the year three of them turn 30 will be different, they swear!", "Sharita, a plump and conservative accountant wants to make partner at her firm and find the man of her dreams. Thursday, the daughter of a formerly chart-topping political rapper, wants to stop being a serial one-month stander, and settle down into a stable life with a stable boyfriend. Risa, a skinny and audacious electronica punk rocker, wants to finally land an album deal, which she feels is the only way to win back the heart of her on-again-off-again closeted girlfriend. And after getting fired as the spokesmodel for her family’s hair company, sweet and gorgeous Tammy wants to prove that she has what it takes to make it on her own.", "None of these women get what they want, but over the course of two years, they get exactly what they need. And that proves to be the best thing after all."], "author": "Ernessa T. Carter", "num_pages": "442", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "1612182828"},
{"url": "https://www.goodreads.com/book/show/6549709-a-second-helping", "num_ratings": "1,172", "num_reviews": "101", "avg_ratings": 4.38, "genres": ["Fiction", "Romance", "Contemporary", "Cultural", "African American"], "title": "A Second Helping", "description": ["“A story done in a way that only Beverly Jenkins can do. Simply superb!”", "—", " bestselling author Brenda Jackson ", " ", "“[A] heartwarming story of love, community, and family….", " is a tasty reading confection that you’ll savor long after the story ends.”", "—Angela Benson, author of ", " ", "Beverly Jenkins, the bestselling author of ", "“A story done in a way that only Beverly Jenkins can do. Simply superb!”", "—", " bestselling author Brenda Jackson ", " ", "“[A] heartwarming story of love, community, and family….", " is a tasty reading confection that you’ll savor long after the story ends.”", "—Angela Benson, author of ", " ", "Beverly Jenkins, the bestselling author of ", ", returns readers to the enchanting Kansas town of Henry Adams for ", "of love, laughter, and mayhem. Filling her poignant and wonderful tale with a cast of endearingly eccentric characters—and setting it against the rich historical backdrop that has become her trademark—Jenkins (“A superstar” —", ") delights from page one. Kimberla Lawson Roby fans take note: ", "is supremely satisfying fare…and you’ll definitely be ready for thirds!"], "author": "Beverly Jenkins", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-05 00:00:00", "ISBN": "0061547816"},
{"url": "https://www.goodreads.com/book/show/205368.Your_Blues_Ain_t_Like_Mine", "num_ratings": "6,727", "num_reviews": "142", "avg_ratings": 4.2, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Race"], "title": "Your Blues Ain't Like Mine", "description": ["Now, in her first novel, repercussions are felt for decades in a dozen lives after a racist beating turns to cold-blooded murder in a small 1950s Mississippi town.", "Chicago-born Amrstrong Tood is fifteen, black, and unused to the ways of the segregated Deep South, when his mother sends him to spend the summer with relatives in rural Mississippi. For speaking a few innocuous", "Now, in her first novel, repercussions are felt for decades in a dozen lives after a racist beating turns to cold-blooded murder in a small 1950s Mississippi town.", "Chicago-born Amrstrong Tood is fifteen, black, and unused to the ways of the segregated Deep South, when his mother sends him to spend the summer with relatives in rural Mississippi. For speaking a few innocuous words in French to a white woman, Armstrong is killed. And the precariously balanced world and its determined people--white and black--are changed, then and forever, by the horror of poverty, the legacy of justice, and the singular gift of love's power to heal."], "author": "Bebe Moore Campbell", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-06-27 00:00:00", "ISBN": "0345401123"},
{"url": "https://www.goodreads.com/book/show/507388.Invisible_Life", "num_ratings": "5,446", "num_reviews": "182", "avg_ratings": 4.3, "genres": ["Fiction", "Cultural", "African American", "Lgbt", "Romance", "Glbt", "Queer", "Glbt", "Gay"], "title": "Invisible Life", "description": ["Invisible Life is the story of a young man's coming of age. Law school, girlfriends, and career choices were all part of Raymond Tyler's life, but there were other, more terrifying issues for him to confront. Being black was tough enough, but Raymond was becoming more and more conscious of sexual feelings that he knew weren't \"right.\" He was completely committed to Sela, h", "Invisible Life is the story of a young man's coming of age. Law school, girlfriends, and career choices were all part of Raymond Tyler's life, but there were other, more terrifying issues for him to confront. Being black was tough enough, but Raymond was becoming more and more conscious of sexual feelings that he knew weren't \"right.\" He was completely committed to Sela, his longtime girlfriend, but his attraction to Kelvin, whom he had met during his last year in law school, had become more than just a friendship. No matter how much he tried to suppress them, his feelings were deeply sexual.", "Fleeing to New York to escape both Sela and Kelvin, Raymond finds himself more confused than ever before. New relationships -- both male and female -- give him enormous pleasure but keep him from finding the inner peace and lasting love he so desperately desires. The horrible illness and death of a friend force Raymond, at last, to face the truth."], "author": "E. Lynn Harris", "num_pages": "304", "awards": [], "places": ["Alabama"], "character_names": [], "language": "English", "publish_date": "1994-02-15 00:00:00", "ISBN": "0385469683"},
{"url": "https://www.goodreads.com/book/show/727650.Better_Than_I_Know_Myself", "num_ratings": "1,464", "num_reviews": "105", "avg_ratings": 4.18, "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Cultural", "African American"], "title": "Better Than I Know Myself", "description": ["The beloved #1 ", " bestselling authors of ", " now deliver a novel in which you'll meet their most unforgettable characters yet. Carmen, Jewel, and Regina could not be more different. When they meet as freshmen at Columbia University, they're pretty confident that a friendship among them isn't in the cards. ", "Jewel is Hollywood royalty: as", "The beloved #1 ", " bestselling authors of ", " now deliver a novel in which you'll meet their most unforgettable characters yet. Carmen, Jewel, and Regina could not be more different. When they meet as freshmen at Columbia University, they're pretty confident that a friendship among them isn't in the cards. ", "Jewel is Hollywood royalty: as the teenage star of the TV show \"Daddy's Girl,\" her face is instantly recognizable all across America. Now, though, she wants two things-to get a serious education, and to leave her controlling stage mother behind. Regina is the definitive upper-middle-class African-American girl. Her picture-perfect parents are what she calls \"black Ward and June Cleavers\" and their goals for her are like a stranglehold. No one can see, though, how far Regina's rebellious side will take her (or how treacherous it will become). Carmen is just trying to get by. A child of the projects whose father is dead and whose mother has vanished, Carmen has been raised by her abusive brother. Columbia is the way for her to get a better life-if she can hold down two jobs and keep her GPA up. ", "When the three of them meet, their lives are at a crossroad. And as the years progress, from the 1980s to the present day, they are challenged by drug addiction, fame, secrets from the past, sickness, betrayal, and the darkest things women can face. One of them won't survive. But what will be the lasting legacy of their friendship? ", " is a novel of heartache, triumph, tears, and the unshakeable bonds among women."], "author": "Virginia DeBerry", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "0312273096"},
{"url": "https://www.goodreads.com/book/show/5167.Cane_River", "num_ratings": "42,524", "num_reviews": "1,934", "avg_ratings": 4.05, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "Cane River", "description": ["Beginning with her great-great-great-great grandmother, a slave owned by a Creole family, Lalita Tademy chronicles four generations of strong, determined black", "Beginning with her great-great-great-great grandmother, a slave owned by a Creole family, Lalita Tademy chronicles four generations of strong, determined black women as they battle injustice to unite their family and forge success on their own terms. They are women whose lives begin in slavery, who weather the Civil War, and who grapple with contradictions of emancipation, Jim Crow, and the pre-Civil Rights South. As she peels back layers of racial and cultural attitudes, Tademy paints a remarkable picture of rural Louisiana and the resilient spirit of one unforgettable family.", "There is Elisabeth, who bears both a proud legacy and the yoke of bondage... her youngest daughter, Suzette, who is the first to discover the promise-and heartbreak-of freedom... Suzette's strong-willed daughter Philomene, who uses a determination born of tragedy to reunite her family and gain unheard-of economic independence... and Emily, Philomene's spirited daughter, who fights to secure her children's just due and preserve their dignity and future.", "Meticulously researched and beautifully written, ", "presents a slice of American history never before seen in such piercing and personal detail."], "author": "Lalita Tademy", "num_pages": "522", "awards": [], "places": ["Louisiana"], "character_names": [], "language": "English", "publish_date": "2002-04-01 00:00:00", "ISBN": "0446678457"},
{"url": "https://www.goodreads.com/book/show/727215.Lil_Mama_s_Rules", "num_ratings": "1,963", "num_reviews": "30", "avg_ratings": 4.11, "genres": ["Fiction", "Cultural", "African American"], "title": "Lil Mama's Rules", "description": ["Madison Maguire is a modern-day heroine who appears to have it all. She's feisty, gorgeous, smart, and savvy -- a single woman playing the field and loving it. She sticks to the rules of dating she's learned through life's tough breaks as she fends off two-bit actors, old flames, and a determined secret admirer. The game changes, however, when Mr. Right appears on the scen", "Madison Maguire is a modern-day heroine who appears to have it all. She's feisty, gorgeous, smart, and savvy -- a single woman playing the field and loving it. She sticks to the rules of dating she's learned through life's tough breaks as she fends off two-bit actors, old flames, and a determined secret admirer. The game changes, however, when Mr. Right appears on the scene. But just as Madison is about to follow her heart, her life turns upside down, forcing her to learn a whole new set of rules about love, loss, and trust."], "author": "Sheneska Jackson", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-08-07 00:00:00", "ISBN": "0743218620"},
{"url": "https://www.goodreads.com/book/show/18046294-the-master-s-plan", "num_ratings": "284", "num_reviews": "60", "avg_ratings": 4.12, "genres": ["Christian Fiction", "Fiction", "Christian", "Inspirational", "Mystery", "Drama"], "title": "The Master's Plan", "description": ["The Master's Plan is a realistic but warm and inspirational story of a woman’s struggle to find her purpose in life. The story is written with a touch of humor and a solid backdrop of both public service and church 'politics'! Snappy dialogue, interesting yet realistic plot twists, and strong likable characters who have an opinion about everything make this a fun to read a", "The Master's Plan is a realistic but warm and inspirational story of a woman’s struggle to find her purpose in life. The story is written with a touch of humor and a solid backdrop of both public service and church 'politics'! Snappy dialogue, interesting yet realistic plot twists, and strong likable characters who have an opinion about everything make this a fun to read and thought-provoking novel.", "Selena Beatrice Jones, aka ‘SB’ to her friends, is married to Pastor Woodruff T. Jones, pastor of Mt. Sinai Missionary Baptist Church, Smoothville, Georgia and still sometimes struggles with her status as the good Pastor’s second wife and the daily challenges it brings…with his family and his church of 25 years.", "But after recently celebrating her 50th birthday, Selena thinks she's got it 'going on' and is excited about God's plans to use her to move Mt. Sinai into the 21st century via The Master's Plan. In her excitement to fulfill her purpose, Selena doesn't realize that when Commissioner Reginald Thompson II, aspiring political candidate, agrees to buy into her Master’s Plan, he does so because he has his own 'master plan'. One designed to get him into the State Legislature!", "Selena is on a mission to fulfill her God given purpose on earth, confident that her steps are ordered by the Lord! Reginald is just as confident that his master plan will get him into office and that Selena B. Jones is the lady who can help get him there.", "While the Commissioner’s staff struggle to convince him of the importance of adhering to the often painful and seemingly unnecessary bureaucratic details associated with federal funding of faith based programs, Selena attempts to garner the critically needed backing of church family, community and friends for the Plan. Suddenly her husband disappears! ", "The Plan takes on a life of its own and without the good Pastor’s approval. Selena's hands are full as she struggles to understand Woody's sudden and highly suspect disappearance while defending both his reputation and position as Pastor of Mt. Sinai to a disgruntled and sometimes hostile committee of church elders. ", "The Commissioner’s flagrant reliance on his charm, good looks and ‘massage the truth’ tactics to accomplish his mission causes his chief strategist, Shawn Mallory, to challenge the integrity of the plan. Deciding that his boss has finally crossed the line, Mallory jumps ship just as the master plan project is launched. ", "Unusual and atypical relationships form between government and church officials; old and new friends; and past and present family making this a ‘must read’ for everyone struggling to find purpose!"], "author": "Stephany Tullis", "num_pages": "284", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/188242.The_Wake_of_the_Wind", "num_ratings": "1,392", "num_reviews": "77", "avg_ratings": 4.45, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "American", "African American Literature"], "title": "The Wake of the Wind", "description": ["A dramatic and thought-provoking novel of one family's triumph in the face of the hardships and challenges of the post-Civil War South.", ", J. California Cooper's third novel, is her most penetrating look yet at the challenges that generations of African Americans have had to overcome in order to carve out a home for themselves and their families. Set in T", "A dramatic and thought-provoking novel of one family's triumph in the face of the hardships and challenges of the post-Civil War South.", ", J. California Cooper's third novel, is her most penetrating look yet at the challenges that generations of African Americans have had to overcome in order to carve out a home for themselves and their families. Set in Texas in the waning years of the Civil War, the novel tells the dramatic story of a remarkable heroine, Lifee, and her husband, Mor. When Emancipation finally comes to Texas, Mor, Lifee, and the extended family they create from other slaves who are also looking for a home and a future, set out in search of a piece of land they can call their own. In the face of constant threats, they manage not only to survive but to succeed--their crops grow, their children thrive, they educate themselves and others. Lifee and Mor pass their intelligence, determination, and talents along to their children, the next generation to surge forward. At once tragic and triumphant, this is an epic story that captures with extraordinary authenticity the most important struggle of the last hundred years."], "author": "J. California Cooper", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-12-28 00:00:00", "ISBN": "0385487053"},
{"url": "https://www.goodreads.com/book/show/9475835-mama-ruby", "num_ratings": "1,622", "num_reviews": "133", "avg_ratings": 4.25, "genres": ["Fiction", "Cultural", "African American"], "title": "Mama Ruby", "description": ["Growing up in Shreveport, Louisiana, Ruby Jean Upshaw is the kind of girl who knows what she wants and knows how to get it. By the time she’s fifteen, Ruby has a taste for fast men and cheap liquor, and not even her preacher daddy can set her straight. Only Othella Mae Cartier, daughter of the town tramp, understands what makes Ruby tick.", "When Ruby discovers she’s in the fa", "Growing up in Shreveport, Louisiana, Ruby Jean Upshaw is the kind of girl who knows what she wants and knows how to get it. By the time she’s fifteen, Ruby has a taste for fast men and cheap liquor, and not even her preacher daddy can set her straight. Only Othella Mae Cartier, daughter of the town tramp, understands what makes Ruby tick.", "When Ruby discovers she’s in the family way, she’s scared for the first time in her life. After hiding her growing belly, Ruby secretly gives birth to a baby girl at Othella’s house. Othella talks Ruby into giving the child away–and with the help of a shocking revelation, convinces Ruby to run off with her to New Orleans.", "But nothing can erase Ruby’s memories of her child–or quell her simmering rage at Othella for persuading her to let her precious baby go. Someday there will be a reckoning. And Othella will learn that no one knows how to exact revenge quite like Ruby Jean Upshaw."], "author": "Mary Monroe", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-06-01 00:00:00", "ISBN": "0758238614"},
{"url": "https://www.goodreads.com/book/show/3733459-bring-on-the-blessings", "num_ratings": "2,813", "num_reviews": "408", "avg_ratings": 4.03, "genres": ["Fiction", "Romance", "Christian Fiction", "Contemporary"], "title": "Bring on the Blessings", "description": ["On Bernadine Brown's fifty-second birthday she received an unexpected gift—she caught her husband, Leo, cheating with his secretary. She was hurt—angry, too—but she didn't cry woe is me. Nope, she hired herself a top-notch lawyer and ended up with a cool $275 million. Having been raised in the church, she knew that when much is given much is expected, so she asked God to s", "On Bernadine Brown's fifty-second birthday she received an unexpected gift—she caught her husband, Leo, cheating with his secretary. She was hurt—angry, too—but she didn't cry woe is me. Nope, she hired herself a top-notch lawyer and ended up with a cool $275 million. Having been raised in the church, she knew that when much is given much is expected, so she asked God to send her a purpose. "], "author": "Beverly Jenkins", "num_pages": "366", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-01-27 00:00:00", "ISBN": "0061688401"},
{"url": "https://www.goodreads.com/book/show/49497.The_Sisterhood_of_Blackberry_Corner", "num_ratings": "919", "num_reviews": "91", "avg_ratings": 4.18, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Womens Fiction", "Chick Lit", "Relationships"], "title": "The Sisterhood of Blackberry Corner", "description": ["Canaan Creek, South Carolina, in the 1950s is a tiny town where the close-knit African-American community is united by long-term friendships and church ties. Bonnie Wilder has lived here, on Blackberry Corner, all her life, and would be content but for her deep desire to have a child. She and her husband Naz cannot conceive, and he refuses to adopt. Even the support of her", "Canaan Creek, South Carolina, in the 1950s is a tiny town where the close-knit African-American community is united by long-term friendships and church ties. Bonnie Wilder has lived here, on Blackberry Corner, all her life, and would be content but for her deep desire to have a child. She and her husband Naz cannot conceive, and he refuses to adopt. Even the support of her outrageous best friend Thora--to whom Bonnie tells everything--can't help fill the emptiness inside her. ", "Then Naz finds a blanketed infant on the banks of Canaan Creek, and suddenly Bonnie's life is transformed. She has found her calling. Together with Thora and the rest of the hilarious, tough, and all-too-human women from her church group, Bonnie creates an underground railroad for unwanted babies. But one of these precious gifts will come back to haunt her: a deception begun in good faith comes full circle, ultimately forcing Bonnie to find the courage to confront a difficult truth at the center of her own life. ", "Filled with compassion, humor, and tenacity in the face of almost insurmountable odds, here is a rich, inspiring tale of friendship and family, sisterhood and mother love...and of finding grace where you least expect it."], "author": "Andrea    Smith", "num_pages": "312", "awards": [], "places": ["South Carolina"], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0385336233"},
{"url": "https://www.goodreads.com/book/show/1333733.Sunday_Brunch", "num_ratings": "305", "num_reviews": "31", "avg_ratings": 3.87, "genres": ["Christian Fiction", "Cultural", "African American", "Christian"], "title": "Sunday Brunch: A Novel", "description": ["Meet Capri, an attorney at a top Houston firm. She seems to have it all together all the time until a seductive client topples her self-control. Then there’s Jermane, a devout Catholic who met her husband in law school and has neve", "Meet Capri, an attorney at a top Houston firm. She seems to have it all together all the time until a seductive client topples her self-control. Then there’s Jermane, a devout Catholic who met her husband in law school and has never been with another man. But now her workaholic marriage is threatened by temptation.", "Angel, on the other hand, sees men merely as a means to sex. Her scorn for love of all kinds—godly or otherwise—is challenged by a serious health scare. Meanwhile, Jewel bases her dating choices on the size of a man’s bank account until she meets a new flame who causes her to reconsider her requirements. ", "Finally, there’s Lexi, the link between the ladies, who provides sage advice while praying for Mr. Right. But what happens when depression hits hard? ", "Through conversation and consolation, these dynamic characters provide one another with divine inspiration—encouraging readers to root for them along the way."], "author": "Norma L. Jarrett", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "0767915704"},
{"url": "https://www.goodreads.com/book/show/9749711-silver-sparrow", "num_ratings": "11,335", "num_reviews": "1,712", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Adult Fiction", "Adult"], "title": "Silver Sparrow", "description": ["With the opening line of ", ", \"My father, James Witherspoon, is a bigamist,\" author Tayari Jones unveils a breathtaking story about a man's deception, a family's complicity, and two teenage girls caught in the middle. ", "With the opening line of ", ", \"My father, James Witherspoon, is a bigamist,\" author Tayari Jones unveils a breathtaking story about a man's deception, a family's complicity, and two teenage girls caught in the middle. ", " "], "author": "Tayari Jones", "num_pages": "352", "awards": ["Black Caucus of the American Library Association Literary Award Nominee for Fiction (Honor Book) (2012)", "Hurston/Wright Legacy Award Nominee for Fiction (2012)"], "places": ["Atlanta, Georgia", "Georgia"], "character_names": ["Dana Lynn Yarboro", "James Witherspoon", "Chaurisse Witherspoon", "Gwen Yarboro", "Raleigh Witherspoon", "Laverne Witherspoon"], "language": "English", "publish_date": "2011-05-24 00:00:00", "ISBN": "1565129903"},
{"url": "https://www.goodreads.com/book/show/2767967-orange-mint-and-honey", "num_ratings": "1,321", "num_reviews": "179", "avg_ratings": 4.02, "genres": ["Fiction", "Cultural", "African American", "Womens Fiction", "Chick Lit", "Contemporary", "Adult"], "title": "Orange Mint and Honey", "description": ["Broke and burned-out from grad school, Shay Dixon does the unthinkable after receiving a “vision” from her de facto spiritual adviser, blues singer Nina Simone. She phones Nona, the mother she had all but written off, asking if she can come home for a while.", "When Shay was growing up, Nona was either drunk, hungover, or out with her latest low-life guy. So Shay barely recogn", "Broke and burned-out from grad school, Shay Dixon does the unthinkable after receiving a “vision” from her de facto spiritual adviser, blues singer Nina Simone. She phones Nona, the mother she had all but written off, asking if she can come home for a while.", "When Shay was growing up, Nona was either drunk, hungover, or out with her latest low-life guy. So Shay barely recognizes the new Nona, now sober and with a positive outlook on life, a love of gardening, and a toddler named Sunny. Though reconciliation seems a hard proposition for Shay, something unmistakable is taking root inside her, waiting to blossom like the morning glories opening up in Nona’s garden sanctuary.", "Soon Shay finds herself facing exciting possibilities and even her first real romantic relationship. But when an unexpected crisis hits, even the wise words and soulful melodies of Nina Simone may not be enough for solace. Shay begins to realize that, like orange mint and honey, sometimes life tastes better when bitter is followed by sweet."], "author": "Carleen Brice", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-02-12 00:00:00", "ISBN": "0345499069"},
{"url": "https://www.goodreads.com/book/show/5175.What_Looks_Like_Crazy_on_an_Ordinary_Day", "num_ratings": "19,230", "num_reviews": "654", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "African American", "Womens Fiction", "Chick Lit"], "title": "What Looks Like Crazy on an Ordinary Day", "description": ["Acclaimed Playwright, essayist and columnist Pearl Cleage breaks new ground in African American women's literature--with a debut novel that sings and crackles with life-affirming energy as it moves the reader to laughter and tears.", "As a girl growing up in Idlewild, Michigan, Ava Johnson had always heard that, if you were young, black, and had any sense at all, Atlanta was t", "Acclaimed Playwright, essayist and columnist Pearl Cleage breaks new ground in African American women's literature--with a debut novel that sings and crackles with life-affirming energy as it moves the reader to laughter and tears.", "As a girl growing up in Idlewild, Michigan, Ava Johnson had always heard that, if you were young, black, and had any sense at all, Atlanta was the place to be. So as soon as she was old enough and able enough, that was where she went--parlaying her smarts and her ambition into one of the hottest hair salons in town. In no time, she was moving with the brothers and sisters who had beautiful clothes, big cars, bigger dreams, and money in the bank.", "Now, after more than a decade of elegant pleasures and luxe living, Ava has come home, her fabulous career and power plans smashed to bits on one dark truth. Ava Johnson has tested positive for HIV. And she's back in little Idlewild to spend a quiet summer with her widowed sister, Joyce, before moving on to finish her life in San Francisco, the most HIV-friendly place she can imagine.", "But what she thinks is the end is only the beginning because there's too much going down in her hometown for Ava to ignore. There's the Sewing Circus--sister Joyce's determined effort to educate Idlewild's young black women about sex, drugs, pregnancy, whatever. . .despite the interference of the good Reverend Anderson and his most virtuous, \"Just say no\" wife. Plus Joyce needs a helping hand to make a loving home for Imani, an abandoned crack baby whom she's taken into her heart.", "And then there's Wild Eddie, whose legendary background in violence combined with his Eastern gentility has stirred Ava's interest. . .and something more."], "author": "Pearl Cleage", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-11-01 00:00:00", "ISBN": "038079487X"},
{"url": "https://www.goodreads.com/book/show/429931.Tumbling", "num_ratings": "2,899", "num_reviews": "105", "avg_ratings": 4.21, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American"], "title": "Tumbling", "description": ["Diane McKinney-Whetstone's lyrical first novel, ", ", vividly captures a tightly knit African-American neighborhood in South Philadelphia during the forties and fifties. Its central characters, Herbie and Noon, are a loving but unconventional couple whose marriage remains unconsummated for many years as Noon struggles to repossess her sexuality after a brutal attack in", "Diane McKinney-Whetstone's lyrical first novel, ", ", vividly captures a tightly knit African-American neighborhood in South Philadelphia during the forties and fifties. Its central characters, Herbie and Noon, are a loving but unconventional couple whose marriage remains unconsummated for many years as Noon struggles to repossess her sexuality after a brutal attack in her past. While she seeks salvation in the church, Herbie gains sexual gratification in the arms of a bewitching jazz singer named Ethel, a woman who profoundly affects both Noon's and Herbie's lives when she leaves with them, first, a baby girl and then later, a five-year-old named Liz. ", " When a road planned by the city council threatens to break up this South Philadelphia neighborhood, the community must band together. Unexpectedly, Noon rises up and takes the lead in the opposition, fighting for all she's worth to keep her family and community together. ", " is a beautifully rendered, poignant story about the ties that bind us and the secrets that keep us apart. With striking lyricism, Diane McKinney-Whetstone keenly guides us through the world of community, family, and the human heart."], "author": "Diane McKinney-Whetstone", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-04-09 00:00:00", "ISBN": "0684837242"},
{"url": "https://www.goodreads.com/book/show/1181582.Big_Girls_Don_t_Cry", "num_ratings": "4,283", "num_reviews": "40", "avg_ratings": 4.12, "genres": ["Fiction", "Cultural", "African American", "American", "African American Literature", "Cultural"], "title": "Big Girls Don't Cry", "description": ["Growing up in a loving and supportive middle-class family in Washington, DC, in the '60s, Naomi Jefferson worries about what to wear, her bra size and meeting boys, and she has dreams of one day opening her own clothing store. While she knows racism is a problem (occasional brushes with the uglier side of people don't let her forget it), Naomi is, at heart, just like any o", "Growing up in a loving and supportive middle-class family in Washington, DC, in the '60s, Naomi Jefferson worries about what to wear, her bra size and meeting boys, and she has dreams of one day opening her own clothing store. While she knows racism is a problem (occasional brushes with the uglier side of people don't let her forget it), Naomi is, at heart, just like any other teenage girl. ", "All of that changes when Joshua, Naomi's older brother, is killed in an accident on his way to a civil rights demonstration in Chicago. Racism becomes a personal issue, and Naomi decides that she needs to help bring about changes in the system. At college in Atlanta, she becomes immersed in politics, organizing protests and butting heads with school administrations as well as with her boyfriend, who isn't too friendly to the cause. Disillusioned by authority figures and betrayed by the man she loves, Naomi returns home, confused about the world and her place in it."], "author": "Connie Briscoe", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-04-04 00:00:00", "ISBN": "0060172770"},
{"url": "https://www.goodreads.com/book/show/290039.Flyy_Girl", "num_ratings": "11,606", "num_reviews": "397", "avg_ratings": 4.23, "genres": ["Fiction", "Cultural", "African American", "Urban", "Young Adult"], "title": "Flyy Girl", "description": [" ", " Tracy Ellison, a young knockout with tall hair and attitude, is living life as fast as she can. Motivated by the material world, she and her friends love and leave the young men who will do anything to get next to them. It's only when the world of gratuitous sex threatens heartbreak t", " ", " Tracy Ellison, a young knockout with tall hair and attitude, is living life as fast as she can. Motivated by the material world, she and her friends love and leave the young men who will do anything to get next to them. It's only when the world of gratuitous sex threatens heartbreak that Tracy begins to examine her life, her goals, and her sexuality."], "author": "Omar Tyree", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-08-07 00:00:00", "ISBN": "0743218574"},
{"url": "https://www.goodreads.com/book/show/37435.The_Secret_Life_of_Bees", "num_ratings": "994,566", "num_reviews": "27,841", "avg_ratings": 4.03, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Adult Fiction"], "title": "The Secret Life of Bees", "description": ["Set in South Carolina in 1964, ", " tells the story of Lily Owens, whose life has been shaped around the blurred memory of the afternoon her mother was killed. When Lily's fierce-hearted black \"stand-in mother,\" Rosaleen, insults three of the deepest racists in town, Lily decides to spring them both free. They escape to Tiburon, South Carolina--a town th", "Set in South Carolina in 1964, ", " tells the story of Lily Owens, whose life has been shaped around the blurred memory of the afternoon her mother was killed. When Lily's fierce-hearted black \"stand-in mother,\" Rosaleen, insults three of the deepest racists in town, Lily decides to spring them both free. They escape to Tiburon, South Carolina--a town that holds the secret to her mother's past. Taken in by an eccentric trio of black beekeeping sisters, Lily is introduced to their mesmerizing world of bees and honey, and the Black Madonna. This is a remarkable novel about divine female power, a story women will share and pass on to their daughters for years to come."], "author": "Sue Monk Kidd", "num_pages": "336", "awards": ["Orange Prize Nominee for Fiction Longlist (2002)", "Book Sense Book of the Year Award for Paperback (2004)", "Lincoln Award Nominee (2005)", "Missouri Gateway Readers Award Nominee (2005)"], "places": ["United States of America", "South Carolina", "Tiburon, South Carolina"], "character_names": ["Lily Owens", "Rosaleen", "August Boatwright", "June Boatwright", "May Boatwright", "T. Ray Owens"], "language": "English", "publish_date": "2003-01-28 00:00:00", "ISBN": "0142001740"},
{"url": "https://www.goodreads.com/book/show/1334553.Tryin_to_Sleep_in_the_Bed_You_Made", "num_ratings": "4,516", "num_reviews": "87", "avg_ratings": 4.2, "genres": ["Cultural", "African American", "Fiction", "Romance", "Womens Fiction", "Chick Lit"], "title": "Tryin' to Sleep in the Bed You Made", "description": ["From the time they were young, Gayle and Patricia were raised like sisters, as close as two friends could be. But they each had dreams that would take them far away - and far away from each other. Gayle was the beauty who believed that a man could make her world complete. Patricia was the intellectual who thought that rising to the top of her career would make her happy. A", "From the time they were young, Gayle and Patricia were raised like sisters, as close as two friends could be. But they each had dreams that would take them far away - and far away from each other. Gayle was the beauty who believed that a man could make her world complete. Patricia was the intellectual who thought that rising to the top of her career would make her happy. And then there is Marcus Carter, who has been linked to both Pat and Gayle since the tragedy that occurred when they were all children. Can either one save him from himself? Can friends survive a love that comes between them? Each of them gets what she wants, but no one counts on the price they have to pay. When they realize that dreams can be hollow and love has its cost, they learn the most important lessons of all: to never give up on the people who love you, and that it isn't just blood that makes two people sisters."], "author": "Virginia DeBerry", "num_pages": "483", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-10-01 00:00:00", "ISBN": "0312963130"},
{"url": "https://www.goodreads.com/book/show/106393.The_Coldest_Winter_Ever", "num_ratings": "27,371", "num_reviews": "2,052", "avg_ratings": 4.48, "genres": ["Fiction", "Cultural", "African American", "Urban"], "title": "The Coldest Winter Ever", "description": ["The stunning national bestseller now features an illuminating discussion with Sister Souljah -- her secret thoughts on creating the story that has sold more than one million copies worldwide and introduced readers everywhere to the real ghetto experience. Here are answers to the questions fans", "The stunning national bestseller now features an illuminating discussion with Sister Souljah -- her secret thoughts on creating the story that has sold more than one million copies worldwide and introduced readers everywhere to the real ghetto experience. Here are answers to the questions fans everywhere have been asking; the meanings and inspirations behind such memorable characters as Winter, Midnight, and Santiaga; and insights into why and how Souljah conceived of one of the most powerful novels of our time."], "author": "Sister Souljah", "num_pages": "544", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "1416521690"}
]