[
{"url": "https://www.goodreads.com/book/show/2184798.Blood_River", "num_ratings": "6,232", "num_reviews": "560", "avg_ratings": 4.05, "genres": ["Cultural", "Africa", "Travel", "Nonfiction", "History", "Adventure", "Autobiography", "Memoir"], "title": "Blood River: A Journey to Africa's Broken Heart", "description": ["A compulsively readable account of a journey to the Congo — a country virtually inaccessible to the outside world — vividly told by a daring and adventurous journalist.", "Ever since Stanley first charted its mighty river in the 1870s, the Congo has epitomized the dark and turbulent history of a failed continent. However, its troubles only served to increase the interest of Da", "A compulsively readable account of a journey to the Congo — a country virtually inaccessible to the outside world — vividly told by a daring and adventurous journalist.", "Ever since Stanley first charted its mighty river in the 1870s, the Congo has epitomized the dark and turbulent history of a failed continent. However, its troubles only served to increase the interest of Daily Telegraph correspondent Tim Butcher, who was sent to cover Africa in 2000. Before long he became obsessed with the idea of recreating Stanley’s original expedition — but travelling alone.", "Despite warnings Butcher spent years poring over colonial-era maps and wooing rebel leaders before making his will and venturing to the Congo’s eastern border. He passed through once thriving cities of this country and saw the marks left behind by years of abuse and misrule. Almost, 2,500 harrowing miles later, he reached the Atlantic Ocean, a thinner and a wiser man.", "Butcher’s journey was a remarkable feat. But the story of the Congo, vividly told in Blood River, is more remarkable still."], "author": "Tim Butcher", "num_pages": "363", "awards": ["Ryszard Kapuściński Prize Nominee (2009)", "Samuel Johnson Prize for Non-Fiction Nominee (2008)", "Stanford Dolman Travel Book of the Year Nominee (2008)"], "places": ["Congo, Democratic Republic of the "], "character_names": ["Henry Morton Stanley"], "language": "English", "publish_date": "2008-01-03 00:00:00", "ISBN": "0099494280"},
{"url": "https://www.goodreads.com/book/show/141456.The_Bone_Woman", "num_ratings": "2,043", "num_reviews": "158", "avg_ratings": 3.98, "genres": ["Nonfiction", "Anthropology", "History", "Cultural", "Africa", "Science", "War"], "title": "The Bone Woman: A Forensic Anthropologist's Search for Truth in the Mass Graves of Rwanda, Bosnia, Croatia, and Kosovo", "description": ["In 1994, Rwanda was the scene of the first acts since World War II to be legally defined as genocide. Two years later, Clea Koff, a twenty-three-year-old forensic anthropologist, left the safe confines of a lab in Berkeley, California, to serve as one of sixteen scientists chosen by the United Nations to unearth the physical evidence of the Rwandan genocide. Over the next", "In 1994, Rwanda was the scene of the first acts since World War II to be legally defined as genocide. Two years later, Clea Koff, a twenty-three-year-old forensic anthropologist, left the safe confines of a lab in Berkeley, California, to serve as one of sixteen scientists chosen by the United Nations to unearth the physical evidence of the Rwandan genocide. Over the next four years, Koff’s grueling investigations took her across geography synonymous with some of the worst crimes of the twentieth century. ", " is Koff’s unflinching, riveting account of her seven UN missions to Bosnia, Croatia, Kosovo, and Rwanda, as she shares what she saw, how it affected her, who was prosecuted based on evidence she found, and what she learned about the world. Yet even as she recounts the hellish nature of her work and the heartbreak of the survivors, she imbues her story with purpose, humanity, and a sense of justice. A tale of science in service of human rights, ", " is, even more profoundly, a story of hope and enduring moral principles."], "author": "Clea Koff", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-02-08 00:00:00", "ISBN": "0812968859"},
{"url": "https://www.goodreads.com/book/show/99826.Pity_the_Nation", "num_ratings": "1,600", "num_reviews": "134", "avg_ratings": 4.37, "genres": ["History", "Nonfiction", "Politics", "Cultural", "Lebanon", "War"], "title": "Pity the Nation: The Abduction of Lebanon", "description": ["With the Israeli-Palestinian crisis reaching wartime levels, where is the latest confrontation between these two old foes leading? Robert Fisk's explosive Pity the Nation recounts Sharon and Arafat's first deadly encounter in Lebanon in the early 1980s and explains why the Israel–Palestine relationship seems so intractable. A remarkable combination of war reporting and ana", "With the Israeli-Palestinian crisis reaching wartime levels, where is the latest confrontation between these two old foes leading? Robert Fisk's explosive Pity the Nation recounts Sharon and Arafat's first deadly encounter in Lebanon in the early 1980s and explains why the Israel–Palestine relationship seems so intractable. A remarkable combination of war reporting and analysis by an author who has witnessed the carnage of Beirut for twenty-five years, Fisk, the first journalist to whom bin Laden announced his jihad against the U.S., is one of the world's most fearless and honored foreign correspondents. He spares no one in this saga of the civil war and subsequent Israeli invasion: the PLO, whose thuggish behavior alienated most Lebanese; the various Lebanese factions, whose appalling brutality spared no one; the Syrians, who supported first the Christians and then the Muslims in their attempt to control Lebanon; and the Israelis, who tried to install their own puppets and, with their 1982 invasion, committed massive war crimes of their own. It includes a moving finale that recounts the travails of Fisk's friend Terry Anderson who was kidnapped by Hezbollah and spent 2,454 days in captivity. Fully updated to include the Israeli withdrawl from south Lebanon and Ariel Sharon's electoral victory over Ehud Barak, this edition has sixty pages of new material and a new preface. \"Robert Fisk's enormous book about Lebanon's desperate travails is one of the most distinguished in recent times.\"—Edward Said"], "author": "Robert Fisk", "num_pages": "752", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-24 00:00:00", "ISBN": "1560254424"},
{"url": "https://www.goodreads.com/book/show/19000.The_Constant_Gardener", "num_ratings": "18,114", "num_reviews": "1,137", "avg_ratings": 3.78, "genres": ["Fiction", "Thriller", "Mystery", "Cultural", "Africa", "Spy Thriller", "Espionage"], "title": "The Constant Gardener", "description": [" ", " is a magnificent exploration of the new world order by one of the most compelling and elegant storytellers of our time. The novel opens in northern Kenya with the gruesome murder of Tessa Quayle--young, beautiful, and dearly beloved to husband Justi", " ", " is a magnificent exploration of the new world order by one of the most compelling and elegant storytellers of our time. The novel opens in northern Kenya with the gruesome murder of Tessa Quayle--young, beautiful, and dearly beloved to husband Justin. When Justin sets out on a personal odyssey to uncover the mystery of her death, what he finds could make him not only a suspect among his own colleagues, but a target for Tessa's killers as well. ", " A master chronicler of the betrayals of ordinary people caught in political conflict, John le Carre portrays the dark side of unbridled capitalism as only he can. In ", " he tells a compelling, complex story of a man elevated through tragedy as Justin Quayle--amateur gardener, aging widower, and ineffectual bureaucrat--discovers his own natural resources and the extraordinary courage of the woman he barely had time to love."], "author": "John le Carré", "num_pages": "496", "awards": [], "places": ["Nairobi", "London, England"], "character_names": ["Tessa Quayle", "Justin Quayle", "Sandy Woodrow", "Arnold Bluhm"], "language": "English", "publish_date": "2005-08-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/256311.Darfur", "num_ratings": "223", "num_reviews": "15", "avg_ratings": 3.69, "genres": ["Cultural", "Africa", "History", "Nonfiction", "Northern Africa", "Sudan", "Politics", "Political Science"], "title": "Darfur: The Ambiguous Genocide", "description": ["In mid-2004, the Darfur crisis in western Sudan erupted onto the world stage, with the unfolding genocide portrayed by the world's media as an Arab/African clash. Gerard Prunier sets out the ethnopolitical make-up of the Sudan and explains why this rebellion is regarded as a key threat to Arab power in the country."], "author": "Gérard Prunier", "num_pages": "236", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-01 00:00:00", "ISBN": "0801446023"},
{"url": "https://www.goodreads.com/book/show/1147124.Blood_Diamonds", "num_ratings": "1,159", "num_reviews": "154", "avg_ratings": 3.9, "genres": ["Nonfiction", "Cultural", "Africa", "History", "Politics", "Audiobook", "Western Africa", "Sierra Leone"], "title": "Blood Diamonds: Tracing the Path of the World's Most Precious Stones", "description": ["The true story of the events that inspired the feature film Blood Diamond First discovered in 1930, the diamonds of Sierra Leone have funded one of the most savage rebel campaigns in modern history. These \"blood diamonds\" are smuggled out of West Africa and sold to legitimate diamond merchants in London, Antwerp, and New York, often with the complicity of the international", "The true story of the events that inspired the feature film Blood Diamond First discovered in 1930, the diamonds of Sierra Leone have funded one of the most savage rebel campaigns in modern history. These \"blood diamonds\" are smuggled out of West Africa and sold to legitimate diamond merchants in London, Antwerp, and New York, often with the complicity of the international diamond industry. Eventually, these very diamonds find their way into the rings and necklaces of brides the world over. Blood Diamonds is the gripping story of how diamond smuggling works, how the rebel war has effectively destroyed Sierra Leone and its people, and how the policies of the diamond industry--institutionalized in the 1880s by the De Beers cartel--have allowed it to happen. Award-winning journalist Greg Campbell traces the deadly trail of these diamonds, many of which are brought to the world market by fanatical enemies. The repercussions of diamond smuggling are felt far beyond the poor and war-ridden country of Sierra Leone, and the consequences of overlooking this African tragedy are both shockingly deadly and unquestionably global."], "author": "Greg Campbell", "awards": ["Colorado Book Award for General Nonfiction (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-01 00:00:00", "ISBN": "0786158395"},
{"url": "https://www.goodreads.com/book/show/17262365-chasing-chaos", "num_ratings": "1,448", "num_reviews": "161", "avg_ratings": 4.07, "genres": ["Nonfiction", "Autobiography", "Memoir", "Travel", "Cultural", "Africa"], "title": "Chasing Chaos: My Decade In and Out of Humanitarian Aid", "description": ["Jessica Alexander arrived in Rwanda in the aftermath of the genocide as an idealist intern, excited to be a part of the international humanitarian aid community. But the world that she encountered in the field was dramatically dif", "Jessica Alexander arrived in Rwanda in the aftermath of the genocide as an idealist intern, excited to be a part of the international humanitarian aid community. But the world that she encountered in the field was dramatically different than anything she could have imagined. In this honest and irreverent memoir, she introduces readers to the reality of the life of an aid worker. We watch as she helps to resettle refugees in Rwanda, manages a 24,000-person camp in Darfur, and helps a former child soldier in Sierra Leone get rid of a tattoo that was carved into his skin by a rebel group. But we also see the alcoholic parties and fleeting romances, the burnouts and cyncism, the plans and priorities that constantly shift and change. Tracing her personal journey from idealistic and naïve newcomer to hardened cynic to hopeful but critical realist, Alexander transports readers to some of the most troubled locations and shows us not only the impossible challenges, but also the moments of hope and recovery."], "author": "Jessica  Alexander", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-15 00:00:00", "ISBN": "0770436919"},
{"url": "https://www.goodreads.com/book/show/16140476-universoul-reflections", "num_ratings": "5", "num_reviews": "4", "avg_ratings": 4.8, "genres": [], "title": "UniverSoul Reflections", "description": ["'UniverSoul Reflections' is a collection of 5 previously published works: 'A Nonentity With Identity', 'Epistles of Poetic Purity', 'Missives From Within', 'Silent Voice' and 'Verses For The Next Generation' and also includes 6 previously unpublished poems. Peter Mutanda is an artist and cultural activist whose works are inspired by his day to day life experiences, from hi", "'UniverSoul Reflections' is a collection of 5 previously published works: 'A Nonentity With Identity', 'Epistles of Poetic Purity', 'Missives From Within', 'Silent Voice' and 'Verses For The Next Generation' and also includes 6 previously unpublished poems. Peter Mutanda is an artist and cultural activist whose works are inspired by his day to day life experiences, from his humble beginnings in Zimbabwe to living in the USA and Europe. His poetry raises awareness of maladies ravaging the lives of the poor and the corruption committed by elitist members of the ‘big society’. He also questions racial bigotry and explores the current global political and social turbulence."], "author": "Peter Mutanda", "num_pages": "133", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-27 00:00:00", "ISBN": "1480000264"},
{"url": "https://www.goodreads.com/book/show/264587.The_Beautyful_Ones_Are_Not_Yet_Born", "num_ratings": "2,122", "num_reviews": "150", "avg_ratings": 3.91, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Ghana", "Literature", "African Literature", "Historical", "Historical Fiction"], "title": "The Beautyful Ones Are Not Yet Born", "description": ["A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after i", "A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after independence in the 1960s. It is often claimed to rank with \"Things Fall Apart\" as one of the high points of post-colonial African Literature. ", "A quote from Chapter 6: ", "\"And where is my solid ground these days? Let us say just that the cycle from birth to decay has been short. Short, brief. But otherwise not at all unusual. And even in the decline into the end there are things that remind the longing mind of old beginnings and hold out the promise of new ones, things even like your despair itself. I have heard this pain before, only then it was multiplied many, many times, but that may only be because at that time I was not so alone, so far apart. Maybe there are other lonely voices despairing now. I will not be entranced by the voice, even if it should swell as it did in the days of hope. I will not be entranced, since I have seen the destruction of the promises it made. But I shall not resist it either. I will be like a cork. It is so surprising, is it not, how even the worst happenings of the past acquire a sweetness in the memory. Old harsh distresses are now merely pictures and tastes which hurt no more, like itching scars which can only give pleasure now. Strange, because when I can think soberly about it all, with out pushing any later joys into the deepr past, I can remember that things were terrible then. When the war was over the soldiers came back to homes broken in their absence and they themselves brought murder in their hearts and gave it to those nearest them. I saw it, not very clearly, because I had no way of understanding it, but it frightened me. We had gone on marches of victory and I do not think there was anyone mean enough in spirit to ask whether we knew what we were celebrating. Whose victory? Ours? It did not matter. We marched, and only a dishonest fool will look back on his boyhood and say he knew even then that there was no meaning in any of it. It is so funny now, to remember that we all thought we were welcoming victory. Or perhaps there is nothing funny here at all, and it is only that victory itself happens to be the identical twin of defeat. \""], "author": "Ayi Kwei Armah", "num_pages": "191", "awards": [], "places": ["Ghana"], "character_names": [], "language": "English", "publish_date": "1989-10-23 00:00:00", "ISBN": "0435905406"},
{"url": "https://www.goodreads.com/book/show/233292.I_Rigoberta_Mench_", "num_ratings": "3,842", "num_reviews": "362", "avg_ratings": 3.72, "genres": ["Nonfiction", "Autobiography", "Memoir", "History", "Biography"], "title": "I, Rigoberta Menchú: An Indian Woman in Guatemala", "description": ["This book recounts the remarkable life of Rigoberta Menchú , a young Guatemalan peasant woman. Her story reflects the experiences common to many Indian communities in Latin America today. Rigoberta suffered gross injustice and hardship in her early life: her brother, father and mother were murdered by the Guatemalan military. She learned Spanish and turned to catechist wor", "This book recounts the remarkable life of Rigoberta Menchú , a young Guatemalan peasant woman. Her story reflects the experiences common to many Indian communities in Latin America today. Rigoberta suffered gross injustice and hardship in her early life: her brother, father and mother were murdered by the Guatemalan military. She learned Spanish and turned to catechist work as an expression of political revolt as well as religious commitment."], "author": "Rigoberta Menchú", "num_pages": "252", "awards": [], "places": ["Guatemala"], "character_names": [], "language": "English", "publish_date": "1985-07-17 00:00:00", "ISBN": "0860917886"},
{"url": "https://www.goodreads.com/book/show/69951.The_Aquariums_of_Pyongyang", "num_ratings": "7,361", "num_reviews": "546", "avg_ratings": 4.06, "genres": ["Nonfiction", "History", "Autobiography", "Memoir", "Biography", "Cultural", "Asia"], "title": "The Aquariums of Pyongyang: Ten Years in the North Korean Gulag", "description": [" Amid escalating nuclear tensions, Kim Jong-un and North Korea's other leaders have kept a tight grasp on their one-party state, quashing any nascent opposition movements and sending all suspected dissidents to its brutal concentration camps for \"re-education.\"", " Kang Chol-Hwan is the first survivor of one of these camps to esca", " Amid escalating nuclear tensions, Kim Jong-un and North Korea's other leaders have kept a tight grasp on their one-party state, quashing any nascent opposition movements and sending all suspected dissidents to its brutal concentration camps for \"re-education.\"", " Kang Chol-Hwan is the first survivor of one of these camps to escape and tell his story to the world, documenting the extreme conditions in these gulags and providing a personal insight into life in North Korea. Sent to the notorious labor camp Yodok when he was nine years old, Kang for ten years observed frequent public executions and endured forced labor and near-starvation rations. In 1992, he escaped to South Korea, where he found God and now advocates for human rights in North Korea.", " This record of one man's suffering gives eyewitness proof to the abuses perpetrated by the North Korean regime."], "author": "Kang Chol-Hwan", "num_pages": "272", "awards": [], "places": ["Korea, Democratic People's Republic of", "North Korea"], "character_names": [], "language": "English", "publish_date": "2005-08-24 00:00:00", "ISBN": "0465011047"},
{"url": "https://www.goodreads.com/book/show/3559.From_Beirut_to_Jerusalem", "num_ratings": "9,169", "num_reviews": "733", "avg_ratings": 4.11, "genres": ["History", "Nonfiction", "Politics", "Cultural", "Israel"], "title": "From Beirut to Jerusalem", "description": ["This is a book that must be read by all who are concerned about the present and future of a part of our world to which Western civilization has always been and will continue to be, vitally connected..."], "author": "Thomas L. Friedman", "num_pages": "608", "awards": ["National Book Award for Nonfiction (1989)", "ASJA Outstanding Book Award (1990)", "Helen Bernstein Book Award for Excellence in Journalism (1990)", "Cornelius Ryan Award (1989)"], "places": [], "character_names": [], "language": "English", "publish_date": "1990-07-15 00:00:00", "ISBN": "0385413726"},
{"url": "https://www.goodreads.com/book/show/6194.Waiting_for_the_Barbarians", "num_ratings": "20,672", "num_reviews": "1,445", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Literature", "Southern Africa", "South Africa"], "title": "Waiting for the Barbarians", "description": ["For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that bran", "For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that brands him an enemy of the state.J. M. Coetzee's prize-winning novel is a startling allegory of the war between opressor and opressed. The Magistrate is not simply a man living through a crisis of conscience in an obscure place in remote times; his situation is that of all men living in unbearable complicity with regimes that ignore justice and decency."], "author": "J.M. Coetzee", "num_pages": "152", "awards": ["James Tait Black Memorial Prize for Fiction (1980)", "Philip K. Dick Award Nominee (1982)", "CNA Literary Award", "Geoffrey Faber Memorial Prize (1981)"], "places": [], "character_names": ["The Magistrate"], "language": "English", "publish_date": "1999-10-01 00:00:00", "ISBN": "0140283358"},
{"url": "https://www.goodreads.com/book/show/2753515-a-crime-so-monstrous", "num_ratings": "988", "num_reviews": "129", "avg_ratings": 3.98, "genres": ["Nonfiction", "Politics", "Mystery", "Crime", "History"], "title": "A Crime So Monstrous: Face-to-Face with Modern-Day Slavery", "description": ["To be a moral witness is perhaps the highest calling of journalism, and in this unforgettable, highly readable account of contemporary slavery, author Benjamin Skinner travels around the globe to personally tell stories that need to be told -- and heard.", "To be a moral witness is perhaps the highest calling of journalism, and in this unforgettable, highly readable account of contemporary slavery, author Benjamin Skinner travels around the globe to personally tell stories that need to be told -- and heard."], "author": "E. Benjamin Skinner", "num_pages": "328", "awards": ["Dayton Literary Peace Prize for Nonfiction (2009)", "Ryszard Kapuściński Prize Nominee (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-11 00:00:00", "ISBN": "0743290070"},
{"url": "https://www.goodreads.com/book/show/368731.A_Problem_from_Hell", "num_ratings": "7,962", "num_reviews": "466", "avg_ratings": 4.22, "genres": ["Nonfiction", "History", "Politics", "War"], "title": "A Problem from Hell", "description": ["From the Armenian Genocide to the ethnic cleansings of Kosovo and Darfur, modern history is haunted by acts of brutal violence. Yet American leaders who vow “never again” repeatedly fail to stop genocide. Winner of the Pulitzer Prize and the National Book Critics Circle Award, “A Problem from Hell” draws upon exclusive interviews with Washington’s top policymakers, thousan", "From the Armenian Genocide to the ethnic cleansings of Kosovo and Darfur, modern history is haunted by acts of brutal violence. Yet American leaders who vow “never again” repeatedly fail to stop genocide. Winner of the Pulitzer Prize and the National Book Critics Circle Award, “A Problem from Hell” draws upon exclusive interviews with Washington’s top policymakers, thousands of once-classified documents, and accounts of reporting from the killing fields to show how decent Americans inside and outside government looked away from mass murder. Combining spellbinding history and seasoned political analysis, “A Problem from Hell” allows readers to hear directly from American decision-makers and dissenters, as well as from victims of genocide, and reveals just what was known and what might have been done while millions perished.", "A character-driven study of some of the darkest moments in our national history, when America failed to prevent or stop 20th-century campaigns to exterminate Armenians, Jews, Cambodians, Iraqi Kurds, Bosnians, and Rwandans."], "author": "Samantha Power", "num_pages": "620", "awards": ["Pulitzer Prize for General Nonfiction (2003)", "Anisfield-Wolf Book Award (2003)", "J. Anthony Lukas Book Prize (2003)", "Arthur Ross Book Award for Gold Medal (2003)", "National Book Critics Circle Award for General Nonfiction (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-05-06 00:00:00", "ISBN": "0060541644"},
{"url": "https://www.goodreads.com/book/show/18832.Koba_the_Dread", "num_ratings": "1,329", "num_reviews": "130", "avg_ratings": 3.84, "genres": ["History", "Nonfiction", "Biography", "Cultural", "Russia", "Politics", "History", "Russian History"], "title": "Koba the Dread: Laughter and the Twenty Million", "description": ["A brilliant weave of personal involvement, vivid biography and political insight, ", " is the successor to Martin Amis’s award-winning memoir, ", ".", " captures the appeal of one of the most powerful belief systems of the 20th century — one that spread through the world, both captivating it and staining it red. It addresses itself to the central", "A brilliant weave of personal involvement, vivid biography and political insight, ", " is the successor to Martin Amis’s award-winning memoir, ", ".", " captures the appeal of one of the most powerful belief systems of the 20th century — one that spread through the world, both captivating it and staining it red. It addresses itself to the central lacuna of 20th-century thought: the indulgence of Communism by the intellectuals of the West. In between the personal beginnings and the personal ending, Amis gives us perhaps the best one-hundred pages ever written about Stalin: Koba the Dread, Iosif the Terrible.", "The author’s father, Kingsley Amis, though later reactionary in tendency, was a “Comintern dogsbody” (as he would come to put it) from 1941 to 1956. His second-closest, and then his closest friend (after the death of the poet Philip Larkin), was Robert Conquest, our leading Sovietologist whose book of 1968, ", ", was second only to Solzhenitsyn’s ", " in undermining the USSR. The present memoir explores these connections.", "Stalin said that the death of one person was tragic, the death of a million a mere “statistic.” ", ", during whose course the author absorbs a particular, a familial death, is a rebuttal of Stalin’s aphorism."], "author": "Martin Amis", "num_pages": "306", "awards": [], "places": ["Russian Federation", "Oxford, England", "Grosvenor Square, London, England"], "character_names": ["Iosif Vassarionavich Dzhugashvili (aka Stalin)", "Christopher Hitchens", "James Fenton"], "language": "English", "publish_date": "2003-09-09 00:00:00", "ISBN": "1400032202"},
{"url": "https://www.goodreads.com/book/show/16049111-braco", "num_ratings": "37", "num_reviews": "8", "avg_ratings": 4.32, "genres": ["War"], "title": "Braco", "description": ["WINNER OF THE 2011 Fresh Fish Award for Emerging Writers, Lesleyanne Ryan''s debut novel, Braco, takes place over the five days fol¬lowing the fall of Srebrenica in 1995. The narrative follows the perspectives of Bosnian civilians, UN Peacekeepers, Serbian and Bosnian soldiers, as well as a Canadian photojournalist. A retired veteran and former Bosnian Peacekeeper, Ryan vi", "WINNER OF THE 2011 Fresh Fish Award for Emerging Writers, Lesleyanne Ryan''s debut novel, Braco, takes place over the five days fol¬lowing the fall of Srebrenica in 1995. The narrative follows the perspectives of Bosnian civilians, UN Peacekeepers, Serbian and Bosnian soldiers, as well as a Canadian photojournalist. A retired veteran and former Bosnian Peacekeeper, Ryan vividly captures the visceral tension and horror of Bosnian refugees fleeing Srebrenica, the ensuing massacre of Bosnian men, and the inability of the Dutch peacekeepers to protect them. The award judges acclaimed the debut novel as a \"compelling, captivating, and fast-paced novel, from its vivid and intriguing prologue set in Srebrenica to an ending that fits, if not satisfies.\""], "author": "Lesleyanne Ryan", "num_pages": "355", "awards": ["Margaret and John Savage First Book Award Nominee (2013)", "Fresh Fish Award for Emerging Writers (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-17 00:00:00", "ISBN": "155081334X"},
{"url": "https://www.goodreads.com/book/show/481005.Notes_from_the_Hyena_s_Belly", "num_ratings": "609", "num_reviews": "72", "avg_ratings": 3.86, "genres": ["Cultural", "Africa", "Eastern Africa", "Ethiopia", "Nonfiction", "Biography Memoir", "Autobiography", "Memoir", "Biography", "History"], "title": "Notes from the Hyena's Belly: An Ethiopian Boyhood", "description": ["Part autobiography and part social history, ", " offers an unforgettable portrait of Ethiopia, and of Africa, during the 1970s and '80s, an era of civil war, widespread famine, and mass execution. \"We children lived like the donkey,\" Mezlekia remembers, \"careful not to wander o", "Part autobiography and part social history, ", " offers an unforgettable portrait of Ethiopia, and of Africa, during the 1970s and '80s, an era of civil war, widespread famine, and mass execution. \"We children lived like the donkey,\" Mezlekia remembers, \"careful not to wander off the beaten trail and end up in the hyena's belly.\" His memoir sheds light not only on the violence and disorder that beset his native country, but on the rich spiritual and cultural life of Ethiopia itself. Throughout, he portrays the careful divisions in dress, language, and culture between the Muslims and Christians of the Ethiopian landscape. Mezlekia also explores the struggle between western European interests and communist influences that caused the collapse of Ethiopia's social and political structure—and that forced him, at age 18, to join a guerrilla army. Through droughts, floods, imprisonment, and killing sprees at the hands of military juntas, Mezlekia survived, eventually emigrating to Canada. In ", " he bears witness to a time and place that few Westerners have understood."], "author": "Nega Mezlekia", "num_pages": "368", "awards": [], "places": ["Ethiopia", "East Africa"], "character_names": [], "language": "English", "publish_date": "2002-01-05 00:00:00", "ISBN": "0312289146"},
{"url": "https://www.goodreads.com/book/show/187257.East_Timor", "num_ratings": "44", "num_reviews": "2", "avg_ratings": 3.66, "genres": ["Nonfiction", "History"], "title": "East Timor: Genocide in Paradise (Real Story Series)", "description": ["This comprehensive account of the invasion of East Timor and US support of the genocide that followed, tells the story of East Timor's historic struggle against impossible odds and explains why you so seldom hear about it in Western media."], "author": "Matthew Jardine", "num_pages": "95", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-01 00:00:00", "ISBN": "1878825224"},
{"url": "https://www.goodreads.com/book/show/747044.The_Weary_Generations", "num_ratings": "66", "num_reviews": "7", "avg_ratings": 3.61, "genres": ["Fiction"], "title": "The Weary Generations", "description": ["Abdullah Hussein’s ambitious saga of social struggle The Weary Generations has been a bestseller in Urdu. A vivid depiction of the widespread disillusionment and seismic upheavals of the Partition era that lead to the creation of Pakistan and Bangladesh, there has never been a more opportune time to discover one of the most important writings about the post-colonial trauma", "Abdullah Hussein’s ambitious saga of social struggle The Weary Generations has been a bestseller in Urdu. A vivid depiction of the widespread disillusionment and seismic upheavals of the Partition era that lead to the creation of Pakistan and Bangladesh, there has never been a more opportune time to discover one of the most important writings about the post-colonial trauma in the region. Peter Owen editor and rights manager Simon Smith describes the book as ‘One of the best books, if not the best, we have ever published’.", "Beginning with the struggle of the people of India against the British Raj, this story of love and marriage between two people of totally different social backgrounds which crumbles almost as soon as as it takes place mirrors the uneasy ‘marriage’ between the British and their Indian Empire – both unions ultimately ending in a parting of the ways. Naim, son of a peasant, marries Azra, the daughter of a rich landowner. Fighting for the British during the First World War he loses an arm. Invalided home, he becomes angered at the subjugation of his countrymen under the Raj and aligns himself with the opposition. His ideals are swept away after Independence in 1947 when he realises that, as Muslims, his family is no longer safe in their Indian home and that they must migrate to the newly created Pakistan."], "author": "Abdullah Hussein", "num_pages": "334", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-06-11 00:00:00", "ISBN": "0720611873"},
{"url": "https://www.goodreads.com/book/show/8745.Desert_Flower", "num_ratings": "14,623", "num_reviews": "911", "avg_ratings": 4.11, "genres": ["Nonfiction", "Biography", "Cultural", "Africa", "Autobiography", "Memoir", "Biography", "Autobiography", "Feminism", "Eastern Africa", "Somalia", "Biography Memoir", "Womens", "Contemporary"], "title": "Desert Flower", "description": ["Waris Dirie ran away from her oppressive life in the African desert when she was barely in her teens, illiterate and impoverished, with nothing to her name but a tattered shawl. She traveled alone across the dangerous Somali desert to Mogadishu—the first leg of a remarkable journey that would take her to London, where she worked as a house servant; then to nearly every cor", "Waris Dirie ran away from her oppressive life in the African desert when she was barely in her teens, illiterate and impoverished, with nothing to her name but a tattered shawl. She traveled alone across the dangerous Somali desert to Mogadishu—the first leg of a remarkable journey that would take her to London, where she worked as a house servant; then to nearly every corner of the globe as an internationally renowned fashion model; and ultimately to New York City, where she became a human rights ambassador for the U.N. ", " is her extraordinary story."], "author": "Waris Dirie", "num_pages": "240", "awards": ["Corine Internationaler Buchpreis for Sachbuch (2002)"], "places": ["Mogadishu"], "character_names": [], "language": "English", "publish_date": "2011-03-15 00:00:00", "ISBN": "0688172377"},
{"url": "https://www.goodreads.com/book/show/8653486-iran", "num_ratings": "21", "num_reviews": "4", "avg_ratings": 3.95, "genres": [], "title": "Iran: My Grandfather", "author": "Ali Alizadeh", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-05-01 00:00:00", "ISBN": "098057174X"},
{"url": "https://www.goodreads.com/book/show/6818019-i-am-nujood-age-10-and-divorced", "num_ratings": "16,401", "num_reviews": "2,415", "avg_ratings": 3.8, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Feminism"], "title": "I Am Nujood, Age 10 and Divorced", "description": [" ", "Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's han", " ", "Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's hands and of her daring escape. With the help of local advocates and the press, Nujood obtained her freedom—an extraordinary achievement in Yemen, where almost half of all girls are married under the legal age. Nujood's courageous defiance of both Yemeni customs and her own family has inspired other young girls in the Middle East to challenge their marriages. Hers is an unforgettable story of tragedy, triumph, and courage."], "author": "Nujood Ali", "num_pages": "188", "awards": [], "places": ["Yemen"], "character_names": [], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "0307589676"},
{"url": "https://www.goodreads.com/book/show/6421997-little-daughter", "num_ratings": "476", "num_reviews": "64", "avg_ratings": 3.97, "genres": ["Nonfiction", "Cultural", "Asia", "Biography", "Autobiography", "Memoir"], "title": "Little Daughter: A Memoir of Survival in Burma and the West", "description": ["Zoya Phan was born in the remote jungles of Burma to the Karen tribe, which for decades has been resisting Burma’s brutal military junta. At age 13, her peaceful childhood was shattered when the Burmese army attacked. So began two terrible years of running, as Zoya was forced to join thousands of refugees hiding in the jungle. Her family scattered, her brothers went deeper", "Zoya Phan was born in the remote jungles of Burma to the Karen tribe, which for decades has been resisting Burma’s brutal military junta. At age 13, her peaceful childhood was shattered when the Burmese army attacked. So began two terrible years of running, as Zoya was forced to join thousands of refugees hiding in the jungle. Her family scattered, her brothers went deeper into the war, and Zoya, close to death, found shelter at a Thai refugee camp, where she stayed until 2005 when she fled to the U.K. and claimed asylum. There, in a twist of fate, she became the public face of the Burmese people’s fight for freedom. This is her inspirational story."], "author": "Zoya Phan", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-02 00:00:00", "ISBN": "067006968X"},
{"url": "https://www.goodreads.com/book/show/2634030-the-road-of-lost-innocence", "num_ratings": "7,264", "num_reviews": "944", "avg_ratings": 4.21, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Cultural", "Asia", "History", "Biography Memoir", "Social Movements", "Social Justice", "Biography", "Autobiography", "Inspirational", "Womens"], "title": "The Road of Lost Innocence: The True Story of a Cambodian Heroine", "description": ["Born in a village deep in the Cambodian forest, Somaly Mam was sold into sexual slavery by her grandfather when she was twelve years old. For the next decade she was shuttled through the brothels that make up the sprawling sex trade of Southeast Asia. Trapped in this dangerous and desperate world, she suffered the brutality and horrors of human trafficking—rape, torture, d", "Born in a village deep in the Cambodian forest, Somaly Mam was sold into sexual slavery by her grandfather when she was twelve years old. For the next decade she was shuttled through the brothels that make up the sprawling sex trade of Southeast Asia. Trapped in this dangerous and desperate world, she suffered the brutality and horrors of human trafficking—rape, torture, deprivation—until she managed to escape with the help of a French aid worker. Emboldened by her newfound freedom, education, and security, Somaly blossomed but remained haunted by the girls in the brothels she left behind.", "Written in exquisite, spare, unflinching prose, ", " recounts the experiences of her early life and tells the story of her awakening as an activist and her harrowing and brave fight against the powerful and corrupt forces that steal the lives of these girls. She has orchestrated raids on brothels and rescued sex workers, some as young as five and six; she has built shelters, started schools, and founded an organization that has so far saved more than four thousand women and children in Cambodia, Thailand, Vietnam, and Laos. Her memoir will leave you awestruck by her tenacity and courage and will renew your faith in the power of an individual to bring about change."], "author": "Somaly Mam", "num_pages": "192", "awards": [], "places": ["Phnom Penh"], "character_names": [], "language": "English", "publish_date": "2008-09-09 00:00:00", "ISBN": "0385526210"},
{"url": "https://www.goodreads.com/book/show/997159.Genocide_in_Nigeria", "num_ratings": "20", "num_reviews": "1", "avg_ratings": 3.5, "genres": ["Nonfiction"], "title": "Genocide in Nigeria", "description": ["This collection of newspaper columns and articles mostly written in the 1970s and 1980s perhaps provides the best overview of Saro-Wiwa's political and environmental concerns. The articles document his concerns about the fate of the Ogoni people and their mistreatment by multinational oil companies and collaborating Nigerian government. Saro-Wiwa argues that the Ogoni are", "This collection of newspaper columns and articles mostly written in the 1970s and 1980s perhaps provides the best overview of Saro-Wiwa's political and environmental concerns. The articles document his concerns about the fate of the Ogoni people and their mistreatment by multinational oil companies and collaborating Nigerian government. Saro-Wiwa argues that the Ogoni are a minority in Nigeria, exploited by the ruling ethnic majority, and that the Federal Government of Nigeria was threatening the Ogoni with genocide. At the time, this was a key publication in bringing the Ogoni tragedy to the attention of the international community. Nowadays, it is of continual relevance to present day concerns about the actions of the oil companies, indigenous and environmental rights in the Delta region."], "author": "Ken Saro-Wiwa", "num_pages": "104", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2000-09-05 00:00:00", "ISBN": "1870716221"},
{"url": "https://www.goodreads.com/book/show/567720.Freedom_in_Exile", "num_ratings": "3,837", "num_reviews": "208", "avg_ratings": 4.24, "genres": ["Biography", "Nonfiction", "Religion", "Buddhism", "History", "Religion", "Biography", "Autobiography"], "title": "Freedom in Exile: The Autobiography of the Dalai Lama", "description": ["In this astonishingly frank autobiography, the Dalai Lama reveals the remarkable inner strength that allowed him to master both the mysteries of Tibetan Buddhism and the brutal realities of Chinese Communism."], "author": "Dalai Lama XIV", "num_pages": "320", "awards": [], "places": ["Tibet"], "character_names": [], "language": "English", "publish_date": "1991-08-01 00:00:00", "ISBN": "0060987014"},
{"url": "https://www.goodreads.com/book/show/400340.Frontiers", "num_ratings": "78", "num_reviews": "8", "avg_ratings": 4.23, "genres": ["History", "Cultural", "Africa", "Southern Africa", "South Africa", "Nonfiction", "History", "World History", "Short Stories"], "title": "Frontiers: The Epic of South Africa's Creation and the Tragedy of the Xhosa People", "description": ["The story of the nine 'Kaffir' wars, fought in the 18th and 19th centuries between the whites and the Xhosa nation, form the heart of this astonishing book. In a comparatively small area of land, eastwards from the Cape, on territory demarcated by the Great Fish and the Great Kai Rivers. It was here that the crucial frontier was variously to be found - the volatile border", "The story of the nine 'Kaffir' wars, fought in the 18th and 19th centuries between the whites and the Xhosa nation, form the heart of this astonishing book. In a comparatively small area of land, eastwards from the Cape, on territory demarcated by the Great Fish and the Great Kai Rivers. It was here that the crucial frontier was variously to be found - the volatile border where colonial expansion met local intransigence and brutal warfare proved the only solution to the impasse. ", "Noel Mostert vivdly recounts this momentous story and its appalling aftermath - the self-immolation of the Xhosa. His starting point is the arrival of the first visitors to the Cape, the Portugeuse, in 1492. In an epilogue he observes that the end of the wars did not mean the end of the agony, but rather a legacy of pain and anger that to this day shapes South African society."], "author": "Noel Mostert", "num_pages": "1355", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-06-23 00:00:00", "ISBN": "0679401369"},
{"url": "https://www.goodreads.com/book/show/4372.When_Broken_Glass_Floats", "num_ratings": "3,494", "num_reviews": "325", "avg_ratings": 4.12, "genres": ["Nonfiction", "Autobiography", "Memoir", "History", "Cultural", "Asia", "Biography", "War"], "title": "When Broken Glass Floats: Growing Up Under the Khmer Rouge", "description": ["In a mesmerizing story, Chanrithy Him vividly recounts her trek through the hell of the \"killing fields.\" She gives us a child's-eye view of a Cambodia where rudimentary labor camps for both adults and children are the norm and modern technology no longer exists. Death becomes a companion in the camps, along with illness. Yet through the terror, the members of Chanrithy's", "In a mesmerizing story, Chanrithy Him vividly recounts her trek through the hell of the \"killing fields.\" She gives us a child's-eye view of a Cambodia where rudimentary labor camps for both adults and children are the norm and modern technology no longer exists. Death becomes a companion in the camps, along with illness. Yet through the terror, the members of Chanrithy's family remain loyal to one another, and she and her siblings who survive will find redeemed lives in America.", "A Finalist for the Kiriyama Pacific Rim Book Prize."], "author": "Chanrithy Him", "num_pages": "336", "awards": ["Oregon Book Award for Nonfiction (2001)", "Kiriyama Prize Nominee for Nonfiction (2000)"], "places": ["Cambodia"], "character_names": [], "language": "English", "publish_date": "2001-04-17 00:00:00", "ISBN": "0393322106"},
{"url": "https://www.goodreads.com/book/show/342827.Conquest", "num_ratings": "604", "num_reviews": "61", "avg_ratings": 4.28, "genres": ["History", "Nonfiction", "History", "World History"], "title": "Conquest: Montezuma, Cortes and the Fall of Old Mexico", "description": ["Drawing on newly discovered sources and writing with brilliance, drama, and profound historical insight, Hugh Thomas presents an engrossing narrative of one of the most significant events of Western history.", "Ringing with the fury of two great empires locked in an epic battle, ", " captures in extraordinary detail the Mexican and Spanish civilizations and offers unpreced", "Drawing on newly discovered sources and writing with brilliance, drama, and profound historical insight, Hugh Thomas presents an engrossing narrative of one of the most significant events of Western history.", "Ringing with the fury of two great empires locked in an epic battle, ", " captures in extraordinary detail the Mexican and Spanish civilizations and offers unprecedented in-depth portraits of the legendary opponents, Montezuma and Cortés. Conquest is an essential work of history from one of our most gifted historians."], "author": "Hugh Thomas", "num_pages": "832", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-04-07 00:00:00", "ISBN": "0671511041"},
{"url": "https://www.goodreads.com/book/show/383683.Silent_Terror", "num_ratings": "20", "num_reviews": "6", "avg_ratings": 4.0, "genres": ["Cultural", "Africa", "Nonfiction", "Western Africa", "Mauritania", "History"], "title": "Silent Terror: A Journey into Contemporary African Slavery", "author": "Samuel Cotton", "num_pages": "170", "awards": [], "places": ["Mauritania"], "character_names": [], "language": "English", "publish_date": "1998-11-01 00:00:00", "ISBN": "0863162592"},
{"url": "https://www.goodreads.com/book/show/1532393.Sarajevo", "num_ratings": "105", "num_reviews": "7", "avg_ratings": 3.73, "genres": ["History", "Nonfiction", "War"], "title": "Sarajevo: A War Journal", "description": ["Originally written as columns from Oslobodenje, Sarajevo's only newspaper to operate throughout the siege, this collection vividly describes a life in which unspeakable horrors are daily occurrences. While witnessing the gradual destruction of his city, Dizdarevic emphasizes the heroism of Sarajevo's citizens as they try to survive. Recipient of the International Prize fro", "Originally written as columns from Oslobodenje, Sarajevo's only newspaper to operate throughout the siege, this collection vividly describes a life in which unspeakable horrors are daily occurrences. While witnessing the gradual destruction of his city, Dizdarevic emphasizes the heroism of Sarajevo's citizens as they try to survive. Recipient of the International Prize from Reporters Without Borders."], "author": "Zlatko Dizdarević", "num_pages": "193", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-11-01 00:00:00", "ISBN": "0880641495"},
{"url": "https://www.goodreads.com/book/show/2722.Cities_of_Salt", "num_ratings": "3,045", "num_reviews": "469", "avg_ratings": 4.06, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels"], "title": "Cities of Salt", "description": ["Set in an unnamed Persian Gulf kingdom in the 1930s, this remarkable novel tells the story of the disruption and diaspora of a poor oasis community following the discovery of oil there. The meeting of Arabs and the Americans who, in essence, colonized the remote region is a cultural confrontation in which religion, history, superstition, and mutual incomprehension all play", "Set in an unnamed Persian Gulf kingdom in the 1930s, this remarkable novel tells the story of the disruption and diaspora of a poor oasis community following the discovery of oil there. The meeting of Arabs and the Americans who, in essence, colonized the remote region is a cultural confrontation in which religion, history, superstition, and mutual incomprehension all play a part.", "Powerful political fiction that it is, ", " has been banned in several Arab countries, including Saudi Arabia. The novel, the first volume in a trilogy, has been translated from the Arabic to English by Peter Theroux."], "author": "Abdul Rahman Munif", "num_pages": "627", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-07-17 00:00:00", "ISBN": "039475526X"},
{"url": "https://www.goodreads.com/book/show/452206.Stay_Alive_My_Son", "num_ratings": "763", "num_reviews": "78", "avg_ratings": 4.28, "genres": ["Nonfiction", "History", "Cultural", "Asia", "Autobiography", "Memoir", "Biography"], "title": "Stay Alive, My Son", "description": ["On April 17, 1975, the Khmer Rouge entered Phnom Penh to open a new and appalling chapter in the story of the twentieth century. On that day, Pin Yathay was a qualified engineer in the Ministry of Public Works. Successful and highly educated, he had been critical of the corrupt Lon Nol regime and hoped that the Khmer Rouge would be the patriotic saviors of Cambodia.", "In ", "On April 17, 1975, the Khmer Rouge entered Phnom Penh to open a new and appalling chapter in the story of the twentieth century. On that day, Pin Yathay was a qualified engineer in the Ministry of Public Works. Successful and highly educated, he had been critical of the corrupt Lon Nol regime and hoped that the Khmer Rouge would be the patriotic saviors of Cambodia.", "In ", ", Pin Yathay provides an unforgettable testament of the horror that ensued and a gripping account of personal courage, sacrifice and survival. Documenting the 27 months from the arrival of the Khmer Rouge in Phnom Penh to his escape into Thailand, Pin Yathay is a powerful and haunting memoir of Cambodia's killing fields.", "With seventeen members of his family, Pin Yathay were evacuated by the Khmer Rouge from Phnom Penh, taking with them whatever they might need for the three days before they would be allowed to return to their home. Instead, they were moved on from camp to camp, their possessions confiscated or abandoned. As days became weeks and weeks became months, they became the \"New People,\" displaced urban dwellers compelled to live and work as peasants, their days were filled with forced manual labor and their survival dependent on ever more meager communal rations. The body count mounted, first as malnutrition bred rampant disease and then as the Khmer Rouge singled out the dissidents for sudden death in the darkness.", "Eventually, Pin Yathay's family was reduced to just himself, his wife, and their one remaining son, Nawath. Wracked with pain and disease, robbed of all they had owned, living on the very edge of dying, they faced a future of escalating horror. With Nawath too ill to travel, Pin Yathay and his wife, Any, had to make the heart-breaking decision whether to leave him to the care of a Cambodian hospital in order to make a desperate break for freedom. \"Stay alive, my son,\" he tells Nawath before embarking on a nightmarish escape to the Thai border.", "First published in 1987, the Cornell edition of ", " includes an updated preface and epilogue by Pin Yathay and a new foreword by David Chandler, a world-renowned historian of Cambodia, who attests to the continuing value and urgency of Pin Yathay's message."], "author": "Pin Yathay", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-11-30 00:00:00", "ISBN": "0801486998"},
{"url": "https://www.goodreads.com/book/show/6419887-the-boy-who-harnessed-the-wind", "num_ratings": "16,650", "num_reviews": "2,762", "avg_ratings": 4.09, "genres": ["Nonfiction", "Cultural", "Africa", "Autobiography", "Memoir", "Biography", "Science"], "title": "The Boy Who Harnessed the Wind: Creating Currents of Electricity and Hope", "description": ["William Kamkwamba was born in Malawi, a country where magic ruled and modern science was mystery. It was also a land withered by drought and hunger, and a place where hope and opportunity were hard to find. But William had read about windmills in a book called Using Energy, and he dreamed of building one that would bring electricity and water to his village and change his", "William Kamkwamba was born in Malawi, a country where magic ruled and modern science was mystery. It was also a land withered by drought and hunger, and a place where hope and opportunity were hard to find. But William had read about windmills in a book called Using Energy, and he dreamed of building one that would bring electricity and water to his village and change his life and the lives of those around him. His neighbors may have mocked him and called him misala—crazy—but William was determined to show them what a little grit and ingenuity could do.", "Enchanted by the workings of electricity as a boy, William had a goal to study science in Malawi's top boarding schools. But in 2002, his country was stricken with a famine that left his family's farm devastated and his parents destitute. Unable to pay the eighty-dollar-a-year tuition for his education, William was forced to drop out and help his family forage for food as thousands across the country starved and died.", "Yet William refused to let go of his dreams. With nothing more than a fistful of cornmeal in his stomach, a small pile of once-forgotten science textbooks, and an armory of curiosity and determination, he embarked on a daring plan to bring his family a set of luxuries that only two percent of Malawians could afford and what the West considers a necessity—electricity and running water. Using scrap metal, tractor parts, and bicycle halves, William forged a crude yet operable windmill, an unlikely contraption and small miracle that eventually powered four lights, complete with homemade switches and a circuit breaker made from nails and wire. A second machine turned a water pump that could battle the drought and famine that loomed with every season.", "Soon, news of William's ", "—his \"electric wind\"—spread beyond the borders of his home, and the boy who was once called crazy became an inspiration to those around the world.", "Here is the remarkable story about human inventiveness and its power to overcome crippling adversity. ", " will inspire anyone who doubts the power of one individual's ability to change his community and better the lives of those around him."], "author": "William Kamkwamba", "num_pages": "270", "awards": ["ALA Alex Award (2010)", "Corine Internationaler Buchpreis for FOCUS Zukunftspreis (2010)"], "places": ["Malawi"], "character_names": [], "language": "English", "publish_date": "2009-09-29 00:00:00", "ISBN": "0061730327"},
{"url": "https://www.goodreads.com/book/show/2517439.The_Forever_War", "num_ratings": "8,410", "num_reviews": "839", "avg_ratings": 4.11, "genres": ["Nonfiction", "History", "War", "Politics", "War", "Military Fiction"], "title": "The Forever War", "description": ["The Forever War"], "author": "Dexter Filkins", "num_pages": "342", "awards": ["Colby Award (2009)", "Julia Ward Howe Prize (2009)", "Arthur Ross Book Award Nominee (2009)", "National Book Critics Circle Award for General Nonfiction (2008)", "Cornelius Ryan Award (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-16 00:00:00", "ISBN": "0307266397"},
{"url": "https://www.goodreads.com/book/show/22397.When_Invisible_Children_Sing", "num_ratings": "242", "num_reviews": "47", "avg_ratings": 4.21, "genres": ["Nonfiction", "Medical", "Religion", "Christianity", "Cultural", "Bolivia", "Biography", "Christian"], "title": "When Invisible Children Sing", "description": ["Expecting to treat some mildly ill children from the streets of Bolivia on a quick “service trip,” an idealistic young medical student gets more than he bargained for when he takes a year off from Harvard Medical School to work at an orphanage in La Paz. As he comes to know the children, and sees how they live, Chi Huang is drawn deeper and deeper into their complex and de", "Expecting to treat some mildly ill children from the streets of Bolivia on a quick “service trip,” an idealistic young medical student gets more than he bargained for when he takes a year off from Harvard Medical School to work at an orphanage in La Paz. As he comes to know the children, and sees how they live, Chi Huang is drawn deeper and deeper into their complex and desperate lives. The doctor soon realizes that to truly help these children, he will have to follow the example of Jesus: live among them, love them in spite of their brokenness, and cling to his faith in God's goodness, even when it appears it is nowhere to be found. A true story that will inspire and challenge readers to greater faith and action. The book includes a Foreword by Harvard professor and world-renowned expert on the moral and spiritual development of children, Dr. Robert Coles."], "author": "Chi Cheng Huang", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-20 00:00:00", "ISBN": "1414306164"},
{"url": "https://www.goodreads.com/book/show/1768603.The_White_Tiger", "num_ratings": "135,359", "num_reviews": "8,852", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "India", "Contemporary", "Asian Literature", "Indian Literature"], "title": "The White Tiger", "description": ["Introducing a major literary talent, The White Tiger offers a story of coruscating wit, blistering suspense, and questionable morality, told by the most volatile, captivating, and utterly inimitable narrator that this millennium has yet seen. ", "Balram Halwai is a complicated man. Servant. Philosopher. Entrepreneur. Murderer. Over the course of seven nights, by the scattered", "Introducing a major literary talent, The White Tiger offers a story of coruscating wit, blistering suspense, and questionable morality, told by the most volatile, captivating, and utterly inimitable narrator that this millennium has yet seen. ", "Balram Halwai is a complicated man. Servant. Philosopher. Entrepreneur. Murderer. Over the course of seven nights, by the scattered light of a preposterous chandelier, Balram tells us the terrible and transfixing story of how he came to be a success in life—having nothing but his own wits to help him along. ", "Born in the dark heart of India, Balram gets a break when he is hired as a driver for his village's wealthiest man, two house Pomeranians (Puddles and Cuddles), and the rich man's (very unlucky) son. From behind the wheel of their Honda City car, Balram's new world is a revelation. While his peers flip through the pages of Murder Weekly (\"Love -- Rape -- Revenge!\"), barter for girls, drink liquor (Thunderbolt), and perpetuate the Great Rooster Coop of Indian society, Balram watches his employers bribe foreign ministers for tax breaks, barter for girls, drink liquor (single-malt whiskey), and play their own role in the Rooster Coop. Balram learns how to siphon gas, deal with corrupt mechanics, and refill and resell Johnnie Walker Black Label bottles (all but one). He also finds a way out of the Coop that no one else inside it can perceive. ", "Balram's eyes penetrate India as few outsiders can: the cockroaches and the call centers; the prostitutes and the worshippers; the ancient and Internet cultures; the water buffalo and, trapped in so many kinds of cages that escape is (almost) impossible, the white tiger. And with a charisma as undeniable as it is unexpected, Balram teaches us that religion doesn't create virtue, and money doesn't solve every problem -- but decency can still be found in a corrupt world, and you can get what you want out of life if you eavesdrop on the right conversations. ", "The White Tiger recalls The Death of Vishnu and Bangkok 8 in ambition, scope, and narrative genius, with a mischief and personality all its own. Amoral, irreverent, deeply endearing, and utterly contemporary, this novel is an international publishing sensation —and a startling, provocative debut."], "author": "Aravind Adiga", "num_pages": "320", "awards": ["Man Booker Prize (2008)", "John Llewellyn Rhys Prize Nominee (2008)", "PEN/Robert W. Bingham Prize Nominee (2009)", "Galaxy British Book Awards for Author of the Year (0)", "Shakti Bhatt First Book Prize Nominee (2008)"], "places": ["Laxmangarh", "Bihar", "New Delhi"], "character_names": ["Balram Halwai", "Ashok", "Kishan", "Kusum", "Stork"], "language": "English", "publish_date": "2008-08-16 00:00:00", "ISBN": "1416562591"},
{"url": "https://www.goodreads.com/book/show/3164716-afrikanische-totenklage-der-ausverkauf-des-schwarzen-kontinents", "num_ratings": "38", "num_reviews": "0", "avg_ratings": 3.82, "genres": ["Nonfiction", "Cultural", "Africa"], "title": "Afrikanische Totenklage. Der Ausverkauf des Schwarzen Kontinents.", "author": "Peter Scholl-Latour", "num_pages": "472", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2001-09-01 00:00:00", "ISBN": "3570005445"},
{"url": "https://www.goodreads.com/book/show/2278592.Mord_Am_Grossen_Fluss_Ein_Vierteljahrhundert_Afrikanischer_Unabhaengigkeit", "num_ratings": "10", "num_reviews": "0", "avg_ratings": 3.4, "genres": [], "title": "Mord Am Grossen Fluss. Ein Vierteljahrhundert Afrikanischer Unabhaengigkeit", "author": "Peter Scholl-Latour", "num_pages": "544", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2002-08-16 00:00:00", "ISBN": "3421063079"},
{"url": "https://www.goodreads.com/book/show/71240.The_Redundancy_of_Courage", "num_ratings": "188", "num_reviews": "15", "avg_ratings": 4.13, "genres": ["Fiction", "Cultural", "Asia"], "title": "The Redundancy of Courage", "description": ["An Indonesian island is hastily given independence, and a Chinese-educated homosexual who was born on the island returns from his Canadian university to find his life radically altered. The story, shortlisted for the 1991 Booker Prize, represents an account of a post-colonial disaster."], "author": "Timothy Mo", "num_pages": "446", "awards": ["Man Booker Prize Nominee (1991)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-07 00:00:00", "ISBN": "0952419343"},
{"url": "https://www.goodreads.com/book/show/134004.Notes_from_My_Travels", "num_ratings": "1,384", "num_reviews": "143", "avg_ratings": 3.96, "genres": ["Nonfiction", "Travel", "Autobiography", "Memoir", "Biography", "Cultural", "Africa"], "title": "Notes from My Travels: Visits with Refugees in Africa, Cambodia, Pakistan and Ecuador", "description": ["From the ever-intriguing and appealing actress Angelina Jolie comes the personal journals she compiled while performing humanitarian relief efforts in such countries as Sierra Leone and Tanzania, Pakistan and Cambodia.", "Three years ago, award-winning actress Angelina Jolie took on a radically different role as a Goodwill Ambassador for the UN High Commissioner for Refugees (", "From the ever-intriguing and appealing actress Angelina Jolie comes the personal journals she compiled while performing humanitarian relief efforts in such countries as Sierra Leone and Tanzania, Pakistan and Cambodia.", "Three years ago, award-winning actress Angelina Jolie took on a radically different role as a Goodwill Ambassador for the UN High Commissioner for Refugees (UNHCR). Here are her memoirs from her journeys to Sierra Leone, Tanzania, Pakistan, Cambodia, and Ecuador, where she lived and worked and gave her heart to those who suffer the world's most shattering violence and victimization. Here are her revelations of joy and warmth amid utter destitution...compelling snapshots of courageous and inspiring people for whom survival is their daily work, and candid notes from a unique pilgrimage that completely changed the actress's world view — and the world within herself."], "author": "Angelina Jolie", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-10-01 00:00:00", "ISBN": "0743470230"},
{"url": "https://www.goodreads.com/book/show/121120.Petals_of_Blood", "num_ratings": "1,401", "num_reviews": "119", "avg_ratings": 3.87, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Kenya"], "title": "Petals of Blood", "description": ["The puzzling murder of three African directors of a foreign-owned brewery sets the scene for this fervent, hard-hitting novel about disillusionment in independent Kenya. A deceptively simple tale, ", " is on the surface a suspenseful investigation of a spectacular triple murder in upcountry Kenya. Yet as the intertwined stories of the four suspects unfold, a dev", "The puzzling murder of three African directors of a foreign-owned brewery sets the scene for this fervent, hard-hitting novel about disillusionment in independent Kenya. A deceptively simple tale, ", " is on the surface a suspenseful investigation of a spectacular triple murder in upcountry Kenya. Yet as the intertwined stories of the four suspects unfold, a devastating picture emerges of a modern third-world nation whose frustrated people feel their leaders have failed them time after time. First published in 1977, this novel was so explosive that its author was imprisoned without charges by the Kenyan government. His incarceration was so shocking that newspapers around the world called attention to the case, and protests were raised by human-rights groups, scholars, and writers, including James Baldwin, Toni Morrison, Donald Barthelme, Harold Pinter, and Margaret Drabble.First time in Penguin Classics"], "author": "Ngũgĩ wa Thiong'o", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-02-22 00:00:00", "ISBN": "0143039172"},
{"url": "https://www.goodreads.com/book/show/27323.Hiroshima", "num_ratings": "49,130", "num_reviews": "2,362", "avg_ratings": 3.95, "genres": ["History", "Nonfiction", "Classics", "War", "Cultural", "Japan", "War", "World War II"], "title": "Hiroshima", "description": ["On August 6, 1945, Hiroshima was destroyed by the first atom bomb ever dropped on a city. This book, John Hersey's journalistic masterpiece, tells what happened on that day. Told through the memories of survivors, this timeless, powerful and compassionate document has become a classic \"that stirs the conscience of humanity\" (", ").", "Almost four decades after th", "On August 6, 1945, Hiroshima was destroyed by the first atom bomb ever dropped on a city. This book, John Hersey's journalistic masterpiece, tells what happened on that day. Told through the memories of survivors, this timeless, powerful and compassionate document has become a classic \"that stirs the conscience of humanity\" (", ").", "Almost four decades after the original publication of this celebrated book, John Hersey went back to Hiroshima in search of the people whose stories he had told.  His account of what he discovered about them is now the eloquent and moving final chapter of ", "."], "author": "John Hersey", "num_pages": "152", "awards": [], "places": ["Hiroshima"], "character_names": [], "language": "English", "publish_date": "1989-03-04 00:00:00", "ISBN": "0679721037"},
{"url": "https://www.goodreads.com/book/show/8101105-the-crisis-caravan", "num_ratings": "541", "num_reviews": "62", "avg_ratings": 3.96, "genres": ["Nonfiction", "Politics", "Cultural", "Africa", "International Rel...", "International Development", "Economics"], "title": "The Crisis Caravan: What's Wrong with Humanitarian Aid?", "author": "Linda Polman", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-14 00:00:00", "ISBN": "0805092900"},
{"url": "https://www.goodreads.com/book/show/20695979-meltdown-in-tibet", "num_ratings": "42", "num_reviews": "10", "avg_ratings": 3.9, "genres": ["Nonfiction", "Cultural", "China", "Environment", "Cultural", "Asia", "Biology", "Ecology"], "title": "Meltdown in Tibet: China's Reckless Destruction of Ecosystems from the Highlands of Tibet to the Deltas of Asia", "description": ["Tibetans have experienced waves of genocide since the 1950s. Now they are facing ecocide. The Himalayan snowcaps are in meltdown mode, due to climate change—accelerated by a rain of black soot from massive burning of coal and other fuels in both China and India. The mighty rivers of Tibet are being dammed by Chinese engineering consortiums to feed the mainland's thirst for", "Tibetans have experienced waves of genocide since the 1950s. Now they are facing ecocide. The Himalayan snowcaps are in meltdown mode, due to climate change—accelerated by a rain of black soot from massive burning of coal and other fuels in both China and India. The mighty rivers of Tibet are being dammed by Chinese engineering consortiums to feed the mainland's thirst for power, and the land is being relentlessly mined in search of minerals to feed China's industrial complex. On the drawing board are plans for a massive engineering project to divert water from Eastern Tibet to water-starved Northern China. Ruthless Chinese repression leaves Tibetans powerless to stop the reckless destruction of their sacred land, but they are not the only victims of this campaign: the nations downstream from Tibet rely heavily on rivers sourced in Tibet for water supply, and for rich silt used in agriculture. This destruction of the region's environment has been happening with little scrutiny until now. In ", " Michael Buckley turns the spotlight on the darkest side of China's emergence as a global super power."], "author": "Michael  Buckley", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-11 00:00:00", "ISBN": "1137279540"},
{"url": "https://www.goodreads.com/book/show/20543847-the-concrete-killing-fields", "num_ratings": "22", "num_reviews": "8", "avg_ratings": 3.95, "genres": ["Sociology", "Politics", "Social Issues", "Poverty", "Feminism"], "title": "The Concrete Killing Fields: One Woman's Battle to Break the Cycle of Homelessness", "description": ["Gripping and gnawing; fascinating and funny; mesmerizing yet motivating! ", "Have you ever wondered ... Why we still have so many homeless people on the streets? Why so many people with mental illness, homeless or not, are in jails or prisons? Why so many people are such strong supporters of President Bill Clinton, and/or Hillary?", "You need to wonder no longer. Pat Morgan has th", "Gripping and gnawing; fascinating and funny; mesmerizing yet motivating! ", "Have you ever wondered ... Why we still have so many homeless people on the streets? Why so many people with mental illness, homeless or not, are in jails or prisons? Why so many people are such strong supporters of President Bill Clinton, and/or Hillary?", "You need to wonder no longer. Pat Morgan has the answers. With her gift of story-telling, deep sense of compassion, and rich Southern sense of humor, Pat Morgan takes you on a ride ... a kaleidoscope of adventures that few ever experience.", "From the cotton fields of Arkansas to the concrete killing fields of Tennessee to the Presidents box at the Kennedy Center you will open your eyes, your heart and discover that it is never too late to live out your dreams.", "To read Pat Morgan's The Concrete Killing Fields is to travel with those our nation has left behind. In bravely revealing her own journey alongside our nation's homeless men, women and children, Pat helps us understand both how we can help them and how we can learn from them. Her own assessment of that journey provides a job description for all those who sincerely want to make a difference in the lives of our country's homeless population. Thanks, Pat, for the gift of this book and for your incredible honesty.", "Fred Karnas, Social Investment Officer, Kresge Foundation, former Executive Director of the National Coalition for the Homeless, former Interim Director of the U.S. Interagency Council on Homelessness, and former Deputy Assistant Secretary for Special Needs Programs, U.S. Department of Housing and Urban Development", "Pat Morgan found her calling in the basement of Calvary Episcopal Church in Memphis Tennessee where she discovered the invisible people the homeless. She hadn t set out to become an expert on homeless people; she hadnt planned on working in Washington DC; and she hadnt planned on finding the missing healing ingredient that she needed.", "As a political insider, part policy maker and confessed political activist and junkie, Pat Morgan was the fly on the wall with a ringside seat. Failing at picking cotton as a young girl, she discovered that what she was good at picking was smart people and mentors to guide her.", "I'd wept when nobody could see me and laughed when everybody could. I'd mourned more than I ever expected to mourn and I'd danced every chance I got. I' d like to think I hadn't cast away stones, but the truth is that I' d cast a lot of stones and gathered up a few more to cast at the barriers to accessing the system. Pat Morgan, from The Concrete Killing Fields", "Get ready for an intense glimpse into a lifetime of stories-stories of people you have heard of and stories from those who are invisible all waiting to be told.", "Readers, be warned! Pat s must tell testament is compelling and contagious, relentless and raw, inspired and inspiring! Read and digest The Concrete Killing Fields. You will not remain the same.", "The Reverend Dr. Douglass M. Bailey, former rector of Calvary Episcopal Church (Memphis), President and founder, Center for Urban Ministry, Inc., Winston-Salem, North Carolina"], "author": "Pat  Morgan", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-20 00:00:00", "ISBN": "1885331533"},
{"url": "https://www.goodreads.com/book/show/25180536-complicity", "num_ratings": "13", "num_reviews": "1", "avg_ratings": 4.08, "genres": ["Politics", "Literature", "Banned Books"], "title": "Complicity", "description": ["CAN YOU FIND THE CODE, AND IF SO, HOW WILL YOU USE IT? ", "Call them what you will: ", "THE ILLUMINATI, NEW WORLD ORDER, NWO, BILDERBERG’S, ELDERS OF ZION, SECRET ORDER OF JESUITS, GLOBAL ELITE, WORLD BANKERS, THE 300 CLUB, ONE OF THE 13 BLOODLINES... ", "We have, since the beginning of time, been manipulated by a merciless, powerful few who conspire to suppress humanity. The means of", "CAN YOU FIND THE CODE, AND IF SO, HOW WILL YOU USE IT? ", "Call them what you will: ", "THE ILLUMINATI, NEW WORLD ORDER, NWO, BILDERBERG’S, ELDERS OF ZION, SECRET ORDER OF JESUITS, GLOBAL ELITE, WORLD BANKERS, THE 300 CLUB, ONE OF THE 13 BLOODLINES... ", "We have, since the beginning of time, been manipulated by a merciless, powerful few who conspire to suppress humanity. The means of defeating the oppressor is at last at hand, provided via a code found in each of five books: ", "Book 1: COMPLICITY ", "Book II: CONCURRENCE ", "Book III: CONCORDAT ", "Book IV: CABAL ", "Book V: COLONY ", "CAN YOU FIND THE CODE, AND IF SO, HOW WILL YOU USE IT? ", "Book 1: COMPLICITY ", "Journalist Duke Johnson is plagued by a mistake he made at the onset of his career. ", "While covering the wars in Yugoslavia he lied about the perpetrators of a heinous event, making a name for himself as well as creating international backlash against the supposed wrongdoers. ", "No one will listen to the truth as his lie backfires. His lie has been manipulated and is being used by NATO as justification for bombing the country, placing thousands of innocent people and the woman he loves and left behind, in danger. ", "Now, he is about the receive the Pulitzer for this lie. ", "Terrified and desperate, Johnson must turn the tables on the real criminals and expose the truth despite the risk to himself. The stakes are immense: will Johnson’s sacrifice be enough to save a country and the woman he loves? "], "author": "Adam Serafan", "num_pages": "481", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4831.Shame", "num_ratings": "9,407", "num_reviews": "470", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "India", "Magical Realism", "Literature"], "title": "Shame", "description": ["The novel that set the stage for his modern classic, ", ", ", " is Salman Rushdie’s phantasmagoric epic of an unnamed country that is “not quite Pakistan.” In this dazzling tale of an ongoing duel between the families of two men–one a celebrated wager of war, the other a debauched lover of pleasure–Rushdie brilliantly portrays a world caught between honor an", "The novel that set the stage for his modern classic, ", ", ", " is Salman Rushdie’s phantasmagoric epic of an unnamed country that is “not quite Pakistan.” In this dazzling tale of an ongoing duel between the families of two men–one a celebrated wager of war, the other a debauched lover of pleasure–Rushdie brilliantly portrays a world caught between honor and humiliation–“shamelessness, shame: the roots of violence.” ", " is an astonishing story that grows more timely by the day."], "author": "Salman Rushdie", "num_pages": "287", "awards": ["Man Booker Prize Nominee (1983)", "Prix du Meilleur Livre Étranger for Roman (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "1995-05-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/526927.Burger_s_Daughter", "num_ratings": "1,560", "num_reviews": "140", "avg_ratings": 3.55, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa"], "title": "Burger's Daughter", "description": ["As a depiction of South Africa, this novel is more revealing than a thousand news dispatches as it tells the story of a young woman cast in the role of a young revolutionary, trying to uphold a heritage handed on by martyred parents while carving out a sense of self."], "author": "Nadine Gordimer", "num_pages": "361", "awards": [], "places": ["South Africa", "France"], "character_names": [], "language": "English", "publish_date": "1980-11-20 00:00:00", "ISBN": "0140055932"},
{"url": "https://www.goodreads.com/book/show/261976.Children_of_Cambodia_s_Killing_Fields", "num_ratings": "331", "num_reviews": "26", "avg_ratings": 3.87, "genres": ["Nonfiction", "History", "Autobiography", "Memoir", "Biography", "War"], "title": "Children of Cambodia's Killing Fields: Memoirs by Survivors", "description": ["This extraordinary book contains eyewitness accounts of life in Cambodia during Pol Pot's genocidal Khmer Rouge regime from 1975 to 1979, accounts written by survivors who were children at the time. The book has been put together by Dith Pran, whose own experiences in Cambodia were so graphically portrayed in the film ", ".", "The testimonies related here bear po", "This extraordinary book contains eyewitness accounts of life in Cambodia during Pol Pot's genocidal Khmer Rouge regime from 1975 to 1979, accounts written by survivors who were children at the time. The book has been put together by Dith Pran, whose own experiences in Cambodia were so graphically portrayed in the film ", ".", "The testimonies related here bear poignant witness to the slaughter the Khmer Rouge inflicted on the Cambodian people. The contributors—most of them now in the United States and pictured in photographs that accompany their stories—report on life in Democratic Kampuchea as seen through children's eyes. They speak of their bewilderment and pain as Khmer Rouge cadres tore their families apart, subjected them to harsh brainwashing, drove them from their homes to work in forced-labor camps, and executed captives in front of them. Their stories tell of suffering and the loss of innocence, the struggle to survive against all odds, and the ultimate triumph of the human spirit."], "author": "Dith Pran", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-04-10 00:00:00", "ISBN": "0300078730"},
{"url": "https://www.goodreads.com/book/show/7024567-cry-the-beloved-country", "num_ratings": "57,772", "num_reviews": "3,472", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Southern Africa", "South Africa"], "title": "Cry, the Beloved Country", "description": ["Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.", "Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.", "The eminent literary critic Lewis Gannett wrote, “We have had many novels from statesmen and reformers, almost all bad; many novels from poets, almost all thin. In Alan Paton’s ", " the statesman, the poet and the novelist meet in a unique harmony.” ", " is the deeply moving story of the Zulu pastor Stephen Kumalo and his son, Absalom, set against the background of a land and a people riven by racial injustice. Remarkable for its lyricism, unforgettable for character and incident, ", " is a classic work of love and hope, courage and endurance, born of the dignity of man."], "author": "Alan Paton", "num_pages": "283", "awards": ["Anisfield-Wolf Book Award for Fiction (1949)"], "places": ["South Africa"], "character_names": ["Stephen Kumalo", "Absalom Kumalo", "Msimangu", "James Jarvis"], "language": "English", "publish_date": "1948-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/456710.A_Bend_in_the_River", "num_ratings": "13,433", "num_reviews": "750", "avg_ratings": 3.77, "genres": ["Cultural", "Africa", "Classics", "Literature"], "title": "A Bend in the River", "description": ["In the \"brilliant novel\" (", ") V.S. Naipaul takes us deeply into the life of one man—an Indian who, uprooted by the bloody tides of Third World history, has come to live in an isolated town at the bend of a great river in a newly independent African nation. Naipaul gives us the most convincing and disturbing vis", "In the \"brilliant novel\" (", ") V.S. Naipaul takes us deeply into the life of one man—an Indian who, uprooted by the bloody tides of Third World history, has come to live in an isolated town at the bend of a great river in a newly independent African nation. Naipaul gives us the most convincing and disturbing vision yet of what happens in a place caught between the dangerously alluring modern world and its own tenacious past and traditions."], "author": "V.S. Naipaul", "num_pages": "278", "awards": ["Man Booker Prize Nominee (1979)"], "places": ["Africa"], "character_names": ["Salim", "Metty", "Zabeth", "Ferdinand (A Bend in the River)", "Nazruddin", "Mahesh", "Shoba", "Father Huismans", "Indar", "Raymond (A Bend in the River)", "Yvette (A Bend in the River)"], "language": "English", "publish_date": "1989-10-20 00:00:00", "ISBN": "0679722025"},
{"url": "https://www.goodreads.com/book/show/6192.Disgrace", "num_ratings": "69,576", "num_reviews": "5,066", "avg_ratings": 3.84, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Novels", "Literature"], "title": "Disgrace", "description": ["Set in post-apartheid South Africa, J. M. Coetzee’s searing novel tells the story of David Lurie, a twice divorced, 52-year-old professor of communications and Romantic Poetry at Cape Technical University. Lurie believes he has created a comfortable, if somewhat passionless, life for himself. He lives within his financial and emotional means. Though his position at the uni", "Set in post-apartheid South Africa, J. M. Coetzee’s searing novel tells the story of David Lurie, a twice divorced, 52-year-old professor of communications and Romantic Poetry at Cape Technical University. Lurie believes he has created a comfortable, if somewhat passionless, life for himself. He lives within his financial and emotional means. Though his position at the university has been reduced, he teaches his classes dutifully; and while age has diminished his attractiveness, weekly visits to a prostitute satisfy his sexual needs. He considers himself happy. But when Lurie seduces one of his students, he sets in motion a chain of events that will shatter his complacency and leave him utterly disgraced."], "author": "J.M. Coetzee", "num_pages": "220", "awards": ["Man Booker Prize (1999)", "National Book Critics Circle Award Nominee for Fiction (1999)", "Commonwealth Writers' Prize for Best Book Overall (2000)", "The Best of the Booker Nominee (2008)"], "places": ["South Africa", "Cape Town"], "character_names": ["David Lurie", "Lucy Lurie", "Petrus", "Bev Shaw", "Melanie Isaacs"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0143036378"},
{"url": "https://www.goodreads.com/book/show/35847912-colombiano", "num_ratings": "436", "num_reviews": "52", "avg_ratings": 4.36, "genres": ["Fiction", "Mystery", "Crime", "Adult Fiction", "Thriller", "Mystery"], "title": "Colombiano", "description": ["In Colombia you have to pick a side. Or one will be picked for you . . .", "All Pedro Gutiérrez cares about is fishing, playing pool and his girlfriend Camila’s promise to sleep with him on his sixteenth birthday. But his life is ripped apart when Guerrilla soldiers callously execute his father in front of him, and he and his mother are banished from their farm.", "Swearing vengea", "In Colombia you have to pick a side. Or one will be picked for you . . .", "All Pedro Gutiérrez cares about is fishing, playing pool and his girlfriend Camila’s promise to sleep with him on his sixteenth birthday. But his life is ripped apart when Guerrilla soldiers callously execute his father in front of him, and he and his mother are banished from their farm.", "Swearing vengeance against the five men responsible, Pedro, with his best friend Palillo, joins an illegal Paramilitary group, where he is trained to fight, kill and crush any sign of weakness.", "But as he descends into a world of unspeakable violence, Pedro must decide how far he is willing to go. Can he stop himself before he becomes just as ruthless as those he is hunting? Or will his dark obsession cost him all he loves?", "Colombiano is an epic tale of rural villages held to ransom, of jungle drug labs, cocaine supermarkets, witch doctors and buried millions, of innocent teenage love, barbaric torture and meticulously planned revenge.", "Superbly told and by turns gripping, poignant and darkly comic, Colombiano is the remarkable story of a boy whose moral descent becomes a metaphor for the corruption of an entire nation. Both blockbuster thriller and electrifying coming-of-age story, Rusty Young’s powerful novel is also a meditation on the redeeming power of love."], "author": "Rusty Young", "num_pages": "689", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-01 00:00:00", "ISBN": "0143781537"},
{"url": "https://www.goodreads.com/book/show/229173.Underground", "num_ratings": "11,910", "num_reviews": "906", "avg_ratings": 3.89, "genres": ["Nonfiction", "Cultural", "Japan", "History", "Asian Literature", "Japanese Literature"], "title": "Underground: The Tokyo Gas Attack and the Japanese Psyche", "description": ["It was a clear spring day, Monday, March 20, 1995, when five members of the religious cult Aum Shinrikyo conducted chemical warfare on the Tokyo subway system using sarin, a poison gas twenty-six times as deadly as cyanide. The unthinkable had happened, a major urban transit system had become the target of a terrorist attack.", "  ", " In an attempt to discover why, Haruki Murakam", "It was a clear spring day, Monday, March 20, 1995, when five members of the religious cult Aum Shinrikyo conducted chemical warfare on the Tokyo subway system using sarin, a poison gas twenty-six times as deadly as cyanide. The unthinkable had happened, a major urban transit system had become the target of a terrorist attack.", "  ", " In an attempt to discover why, Haruki Murakami, internationally acclaimed author of ", "and arguably Japan’s most important contemporary novelist, talked to the people who lived through the catastrophe—from a Subway Authority employee with survivor guilt, to a fashion salesman with more venom for the media than for the perpetrators, to a young cult member who vehemently condemns the attack though he has not quit Aum. Through these and many other voices, Murakami exposes intriguing aspects of the Japanese psyche. And as he discerns the fundamental issues leading to the attack, we achieve a clear vision of an event that could occur anytime, anywhere. Hauntingly compelling and inescapably important, ", " is a powerful work of journalistic literature from one of the world’s most perceptive writers."], "author": "Haruki Murakami", "num_pages": "366", "awards": [], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "2001-04-10 00:00:00", "ISBN": "0375725806"},
{"url": "https://www.goodreads.com/book/show/17880580-africa-has-a-future", "num_ratings": "9", "num_reviews": "3", "avg_ratings": 4.33, "genres": ["Cultural", "Africa", "Nonfiction", "Africa", "Southern Africa", "History"], "title": "Africa Has a Future", "description": ["Africa Has a Future. Many challenges lie ahead but there is a way forward. This book explores the problems and possible solutions facing Africa today.", "Development activists, intellectuals, economists and academics have expressed their different views and theories about how development should be carried out in Africa and around the world. However; there is no ‘one size fits", "Africa Has a Future. Many challenges lie ahead but there is a way forward. This book explores the problems and possible solutions facing Africa today.", "Development activists, intellectuals, economists and academics have expressed their different views and theories about how development should be carried out in Africa and around the world. However; there is no ‘one size fits all’ solution for this cause. There have been many diagnoses, but as yet no effective remedy for the maladies faced by Africans.", "As an African, I have experienced many of Africa's problems first hand, then studied and researched them academically. Africa Has a Future is my prescription for Africa, based on my own perceptions as an African.", "Africa Has a Future has been written both for academics and the ordinary African. It lays out my thoughts clearly in a way that is easy to understand. It is my dream for every African to understand the problems Africa faces and the repercussions of current strategies."], "author": "Peter Mutanda", "num_pages": "99", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-25 00:00:00", "ISBN": "1484044401"},
{"url": "https://www.goodreads.com/book/show/1244455.What_is_the_What", "num_ratings": "68,038", "num_reviews": "6,934", "avg_ratings": 4.16, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction"], "title": "What is the What", "description": ["Valentino Achak Deng is just a boy when conflict separates him from his family and forces him to leave his small Sudanese village, joining thousands of other orphans on their long, long walk to Ethiopia, where they find safety - for a time. Along the way Valentino encounters", "Valentino Achak Deng is just a boy when conflict separates him from his family and forces him to leave his small Sudanese village, joining thousands of other orphans on their long, long walk to Ethiopia, where they find safety - for a time. Along the way Valentino encounters enemy soldiers, liberation rebels and deadly militias, hyenas and lions, disease and starvation. But there are experiences ahead that will test his spirit in even greater ways than these . . .", "Truly epic in scope, and told with expansive humanity, deep compassion and unexpected humour, ", " is an eye-opening account of life amid the madness of war and an unforgettable tale of tragedy and triumph.", "'If there was ever any doubt that Dave Eggers is one of our most important storytellers, ", " should put it to rest... [A] strange, beautiful and unforgettable work' ", "'A remarkable book: harrowing, witty, wretched, delightful; and always compelling, always surprising' ", "All of the author's proceeds from this book will go to the Valentino Achak Deng Foundation. Read more at: ", "."], "author": "Dave Eggers", "num_pages": "538", "awards": ["Independent Publisher Book Award (IPPY) for Literary Fiction (2007)", "Prix Médicis Etranger (2009)", "National Book Critics Circle Award Nominee for Fiction (2006)"], "places": ["Sudan", "Ethiopia", "Kakuma", "Marial Bai"], "character_names": [], "language": "English", "publish_date": "2008-07-03 00:00:00", "ISBN": "0141015748"},
{"url": "https://www.goodreads.com/book/show/28510777-forty-autumns", "num_ratings": "2,615", "num_reviews": "448", "avg_ratings": 4.36, "genres": ["Nonfiction", "History", "Autobiography", "Memoir", "Cultural", "Germany", "Biography"], "title": "Forty Autumns: A Family's Story of Courage and Survival on Both Sides of the Berlin Wall", "description": ["In this illuminating and deeply moving memoir, a former American military intelligence officer goes beyond traditional Cold War espionage tales to tell the true story of her family—of five women separated by the Iron Curtain for more than forty years, and their miraculous reunion after the fall of the Berlin Wall.", " ", " makes visceral the pain and longing of one fam", "In this illuminating and deeply moving memoir, a former American military intelligence officer goes beyond traditional Cold War espionage tales to tell the true story of her family—of five women separated by the Iron Curtain for more than forty years, and their miraculous reunion after the fall of the Berlin Wall.", " ", " makes visceral the pain and longing of one family forced to live apart in a world divided by two. At twenty, Hanna escaped from East to West Germany. But the price of freedom—leaving behind her parents, eight siblings, and family home—was heartbreaking. Uprooted, Hanna eventually moved to America, where she settled down with her husband and had children of her own.", "Growing up near Washington, D.C., Hanna’s daughter, Nina Willner became the first female Army Intelligence Officer to lead sensitive intelligence operations in East Berlin at the height of the Cold War. Though only a few miles separated American Nina and her German relatives—grandmother Oma, Aunt Heidi, and cousin, Cordula, a member of the East German Olympic training team—a bitter political war kept them apart.", "In ", ", Nina recounts her family’s story—five ordinary lives buffeted by circumstances beyond their control. She takes us deep into the tumultuous and terrifying world of East Germany under Communist rule, revealing both the cruel reality her relatives endured and her own experiences as an intelligence officer, running secret operations behind the Berlin Wall that put her life at risk.", "A personal look at a tenuous era that divided a city and a nation, and continues to haunt us, ", " is an intimate and beautifully written story of courage, resilience, and love—of five women whose spirits could not be broken, and who fought to preserve what matters most: family.", " is illustrated with dozens of black-and-white and color photographs."], "author": "Nina Willner", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-04 00:00:00", "ISBN": "0062410334"},
{"url": "https://www.goodreads.com/book/show/15890525-survivor-love-thy-enemy", "num_ratings": "11", "num_reviews": "8", "avg_ratings": 4.64, "genres": ["History", "North American Hi...", "American History"], "title": "Survivor Love Thy Enemy", "description": ["From an inspired Catholic family base, this youth's naivete and immature nature was hell bent on living the wild life of booze and party times when a special female, who he wanted more than his innocents could bear, changed his outlook forever. Then reality came to visit his dreams, turning them into nightmares of war. The Vietnam conflict would eat him up, grow him up and", "From an inspired Catholic family base, this youth's naivete and immature nature was hell bent on living the wild life of booze and party times when a special female, who he wanted more than his innocents could bear, changed his outlook forever. Then reality came to visit his dreams, turning them into nightmares of war. The Vietnam conflict would eat him up, grow him up and create a new perspective of life that only the enemy could teach. The language is harsh, the writing brutally honest and the message clear, it relates with great candor the unvarnished realities of dealing with day to day combat in and around the Mekong Delta during the TET Offensive. You will be shocked, fascinated, outraged and frustrated when you read about the US fight for Democracy and Peace in Vietnam and the enemy's pragmatic dedication to the annihilation of the South Vietnamese and all Western ideals. This story is about an Army warrior who made the journey to combat and the unbelievable events that made up his combat tours....peppered by Vietnamese insight, perspective and romantic ardor. This is my story and it is historically accurate. Survivor, Love thy Enemy is a definite \"must read\" for military and civilians alike, once picked up, not put down until the last page read."], "author": "James Dennison", "num_pages": "268", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-21 00:00:00", "ISBN": "1477478159"},
{"url": "https://www.goodreads.com/book/show/18125285-the-sabi", "num_ratings": "46", "num_reviews": "20", "avg_ratings": 4.11, "genres": ["Cultural", "Africa", "Literature", "African Literature", "Biography Memoir", "Biography", "Autobiography", "Memoir"], "title": "The Sabi", "description": ["She does not know how, but has a sabi from her earliest memory that she was different. What she does know is that 'difference' had currency in the past, and it certainly still has currency today. The Sabi will have an effect on you - have no doubt about that. In her debut novel, Diane Brown takes a scenic and open-eyed walk down memory lane to the 1960's when apartheid was", "She does not know how, but has a sabi from her earliest memory that she was different. What she does know is that 'difference' had currency in the past, and it certainly still has currency today. The Sabi will have an effect on you - have no doubt about that. In her debut novel, Diane Brown takes a scenic and open-eyed walk down memory lane to the 1960's when apartheid was in full swing to the early 1990's when South Africa was beginning to sense freedom. She ventures further back in time to help solve the puzzle of the current time, how did South Africa become so angry and so violent? Writing from the heart to relate the events of her childhood and adolescence, the author takes you on a journey that will make you cry and laugh along with her as she tried to make sense of her life, the people around her and the system into which she was born. She is no doubt left extremely vulnerable and exposed in relating this account of her life. This honesty is anchored in an easy writing style which is deeply reflective, with an acute sense of contextual reasoning. She reflects on the news of the day in a 'free' country, tainted with the heavy stench of death, violence and abuse and notes that all too familiar script. She finally realises... Her story must be told.", "Themes covered in this book: Race, Colorism, Violence, South Africa, Apartheid, Acceptance, Prejudice, Coming-of-age, Love, Liberation"], "author": "Diane  Brown", "num_pages": "254", "awards": [], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "2013-07-01 00:00:00", "ISBN": "1909740845"},
{"url": "https://www.goodreads.com/book/show/415450.Even_After_All_This_Time", "num_ratings": "475", "num_reviews": "60", "avg_ratings": 4.04, "genres": ["Cultural", "Iran", "Nonfiction", "Autobiography", "Memoir", "Biography", "History"], "title": "Even After All This Time: A Story of Love, Revolution, and Leaving Iran", "description": ["At the age of ten, a young Iranian girl witnesses the horror of her father's execution and escapes the revolution with her sister.", "Growing up in Tehran in the 1970s, Afschineh Latifi and her sister and two brothers enjoyed a life of luxury and privilege. Their father, a self–made man, had worked his way up from nothing to become a colonel in the Shah's army, and their mothe", "At the age of ten, a young Iranian girl witnesses the horror of her father's execution and escapes the revolution with her sister.", "Growing up in Tehran in the 1970s, Afschineh Latifi and her sister and two brothers enjoyed a life of luxury and privilege. Their father, a self–made man, had worked his way up from nothing to become a colonel in the Shah's army, and their mother, a woman of equally modest roots, had made a career for herself as a respected schoolteacher. But in February, 1979, Colonel Latifi was arrested by members of the newly installed Khomeini regime, and publicly pilloried as an \"Enemy of God.\" Some months later, after having been shunted from one prison cell to another, and without benefit of a legitimate trial, Colonel Latifi was summarily executed.", "Fearing for the safety of her children, Mrs. Latifi made a wrenching decision: to send her daughters, ages ten and eleven, to the west, splitting up the family until they could safely reunite. Out on their own, Afschineh and her sister, Afsaneh, were forced to become strong young women before they'd even had a childhood.", "Even After All This Time is a story of hope and heartache, a story of a family torn apart for six harrowing years, and finally coming together to rebuild in America. In the richly evocative tradition of the bestselling Reading Lolita in Tehran, this is a story of a family that had the courage to dream impossible dreams and to make them come true against impossible odds."], "author": "Afschineh Latifi", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-03-28 00:00:00", "ISBN": "0060745347"},
{"url": "https://www.goodreads.com/book/show/1080838.The_Looting_of_the_Iraq_Museum_Baghdad", "num_ratings": "25", "num_reviews": "3", "avg_ratings": 4.12, "genres": ["Nonfiction", "Art"], "title": "The Looting of the Iraq Museum, Baghdad: The Lost Legacy of Ancient Mesopotamia", "description": ["In April of 2003, the world reacted in shock at the news of the looting of the Iraq Museum in Baghdad. Priceless antiquities, spanning ten thousand years of human history, were smashed into pieces or stolen, and one of the most important storehouses of ancient culture was forever compromised. This exquisitely illustrated volume is a reconstruction in book form of one of th", "In April of 2003, the world reacted in shock at the news of the looting of the Iraq Museum in Baghdad. Priceless antiquities, spanning ten thousand years of human history, were smashed into pieces or stolen, and one of the most important storehouses of ancient culture was forever compromised. This exquisitely illustrated volume is a reconstruction in book form of one of the world's great museums, and it stands as the definitive single-volume history of the art and archaeology of ancient Mesopotamia, the cradle of civilization. ", "The contributors to this book consist of a cadre of international archaeologists whose excavations helped piece together the rich tapestry of Mesopotamian life from earliest prehistory to the advent of Islam. A portion of the book's royalties will aid in the reconstruction of the museum and in the preservation of Mesopotamia's cultural treasures. Told through the art and artifacts that were lost recently in Iraq, this fascinating history of the civilizations of the Near East is sure to be a timeless and enduring book."], "author": "Milbry Polk", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-05-01 00:00:00", "ISBN": "0810958724"},
{"url": "https://www.goodreads.com/book/show/2475251.The_Cellist_of_Sarajevo", "num_ratings": "26,524", "num_reviews": "3,419", "avg_ratings": 4.02, "genres": ["Fiction", "Historical", "Historical Fiction", "War", "Cultural", "Canada", "Historical", "Music"], "title": "The Cellist of Sarajevo", "description": ["This brilliant novel with universal resonance, set during the 1990s Siege of Sarajevo, tells the story of three people trying to survive in a city rife with the extreme fear of desperate times, and of the sorrowing cellist who plays undaunted in their midst.", "One day a shell lands in a bread line and kills twenty-two people as the cellist watches from a window in his flat. H", "This brilliant novel with universal resonance, set during the 1990s Siege of Sarajevo, tells the story of three people trying to survive in a city rife with the extreme fear of desperate times, and of the sorrowing cellist who plays undaunted in their midst.", "One day a shell lands in a bread line and kills twenty-two people as the cellist watches from a window in his flat. He vows to sit in the hollow where the mortar fell and play Albinoni’s Adagio once a day for each of the twenty-two victims. The Adagio had been re-created from a fragment after the only extant score was firebombed in the Dresden Music Library, but the fact that it had been rebuilt by a different composer into something new and worthwhile gives the cellist hope. ", "Meanwhile, Kenan steels himself for his weekly walk through the dangerous streets to collect water for his family on the other side of town, and Dragan, a man Kenan doesn’t know, tries to make his way towards the source of the free meal he knows is waiting. Both men are almost paralyzed with fear, uncertain when the next shot will land on the bridges or streets they must cross, unwilling to talk to their old friends of what life was once like before divisions were unleashed on their city. Then there is “Arrow,” the pseudonymous name of a gifted female sniper, who is asked to protect the cellist from a hidden shooter who is out to kill him as he plays his memorial to the victims. ", "In this beautiful and unforgettable novel, Steven Galloway has taken an extraordinary, imaginative leap to create a story that speaks powerfully to the dignity and generosity of the human spirit under extraordinary duress."], "author": "Steven Galloway", "num_pages": "235", "awards": ["Borders Original Voices Award for Fiction (2008)", "Scotiabank Giller Prize Nominee (2008)", "Ethel Wilson Fiction Prize Nominee (2009)", "Sakura Medal Nominee for High School Book (2010)", "OLA Evergreen Award (2009)"], "places": ["Sarajevo"], "character_names": ["The cellist", "Arrow", "Kenan", "Dragan", "ویلون سل نواز", "تیر", "کنان", "دراگان"], "language": "English", "publish_date": "2008-05-15 00:00:00", "ISBN": "1594489866"},
{"url": "https://www.goodreads.com/book/show/420031.Heart_of_Darkness", "num_ratings": "342,801", "num_reviews": "11,081", "avg_ratings": 3.42, "genres": ["Classics", "Fiction", "Literature", "Cultural", "Africa", "Academic", "School"], "title": "Heart of Darkness", "description": ["Dark allegory describes the narrator's journey up the Congo River and his meeting with, and fascination by, Mr. Kurtz, a mysterious personage who dominates the unruly inhabitants of the region. Masterly blend of adventure, character development, psychological penetration. Considered by many Conrad's finest, most enigmatic story."], "author": "Joseph Conrad", "num_pages": "192", "awards": [], "places": ["Africa", "Belgian Congo", "Brussels", "Congo Free State"], "character_names": ["Charles Marlow", "Kurtz"], "language": "English", "publish_date": "2007-08-02 00:00:00", "ISBN": "0141441674"},
{"url": "https://www.goodreads.com/book/show/104039.From_the_Holy_Mountain", "num_ratings": "2,665", "num_reviews": "211", "avg_ratings": 4.29, "genres": ["Travel", "History", "Nonfiction", "Religion", "Religion", "Christianity"], "title": "From the Holy Mountain: A Journey Among the Christians of the Middle East", "description": ["In 587 a.d., two monks set off on an extraordinary journey that would take them in an arc across the entire Byzantine world, from the shores of the Bosphorus to the sand dunes of Egypt. On the way John Moschos and his pupil Sophronius the Sophist stayed in caves, monasteries, and remote hermitages, collecting the wisdom of the stylites and the desert fathers before their f", "In 587 a.d., two monks set off on an extraordinary journey that would take them in an arc across the entire Byzantine world, from the shores of the Bosphorus to the sand dunes of Egypt. On the way John Moschos and his pupil Sophronius the Sophist stayed in caves, monasteries, and remote hermitages, collecting the wisdom of the stylites and the desert fathers before their fragile world finally shattered under the great eruption of Islam. More than a thousand years later, using Moschos's writings as his guide, William Dalrymple sets off to retrace their footsteps and composes \"an evensong for a dying civilization\" --", " starred review"], "author": "William Dalrymple", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-03-15 00:00:00", "ISBN": "0805061770"},
{"url": "https://www.goodreads.com/book/show/111050.July_s_People", "num_ratings": "5,468", "num_reviews": "433", "avg_ratings": 3.54, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Historical", "Historical Fiction", "Novels"], "title": "July's People", "description": ["For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable lo", "For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable look into the terrifying, tacit understandings and misunderstandings between blacks and whites."], "author": "Nadine Gordimer", "num_pages": "160", "awards": ["Premio Grinzane Cavour Nominee for Narrativa Straniera (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "1982-07-29 00:00:00", "ISBN": "0140061401"},
{"url": "https://www.goodreads.com/book/show/50910.The_Fracture_Zone", "num_ratings": "305", "num_reviews": "44", "avg_ratings": 3.54, "genres": ["Nonfiction", "History", "Travel", "War", "Politics"], "title": "The Fracture Zone: My Return to the Balkans", "description": ["The vast and mountainous area that makes up the Balkans is rife with discord, both cultural and topographical. And, as Simon Winchester superbly demonstrates in this intimate portrait of the region, much of", "The vast and mountainous area that makes up the Balkans is rife with discord, both cultural and topographical. And, as Simon Winchester superbly demonstrates in this intimate portrait of the region, much of the political strife of the past century can be traced to its inherent contrasts. With the aid of a guide and linguist, Winchester traveled deep into the region's most troublesome areas--including Slovenia, Croatia, Bosnia, Montenegro, Albania, Kosovo, and Turkey--just as the war was tearing these countries apart. The result is a book not just about war but also about how war affects the living. Both timeless and current, ", " goes behind the headlines to offer a true picture of a region that has always been on the brink. Winchester's remarkable journey puts all the elements together--the faults, the fractures, and the chaos--to make sense out of a seemingly senseless place."], "author": "Simon Winchester", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-10-17 00:00:00", "ISBN": "0060954949"},
{"url": "https://www.goodreads.com/book/show/124334.You_Must_Set_Forth_at_Dawn", "num_ratings": "357", "num_reviews": "43", "avg_ratings": 3.96, "genres": ["Cultural", "Africa", "Nonfiction", "Western Africa", "Nigeria", "Autobiography", "Memoir", "Literature", "African Literature", "Biography"], "title": "You Must Set Forth at Dawn", "description": ["The first African to receive the Nobel Prize in Literature, as well as a political activist of prodigious energies, Wole Soyinka now follows his modern classic Ake: The Years of Childhood with an equally important chronicle of his turbulent life as an adult in (and in exile from) his beloved, beleaguered homeland.", "In the tough, humane, and lyrical language that has typified", "The first African to receive the Nobel Prize in Literature, as well as a political activist of prodigious energies, Wole Soyinka now follows his modern classic Ake: The Years of Childhood with an equally important chronicle of his turbulent life as an adult in (and in exile from) his beloved, beleaguered homeland.", "In the tough, humane, and lyrical language that has typified his plays and novels, Soyinka captures the indomitable spirit of Nigeria itself by bringing to life the friends and family who bolstered and inspired him, and by describing the pioneering theater works that defied censure and tradition. Soyinka not only recounts his exile and the terrible reign of General Sani Abacha, but shares vivid memories and playful anecdotes–including his improbable friendship with a prominent Nigerian businessman and the time he smuggled a frozen wildcat into America so that his students could experience a proper Nigerian barbecue.", "More than a major figure in the world of literature, Wole Soyinka is a courageous voice for human rights, democracy, and freedom. You Must Set Forth at Dawn is an intimate chronicle of his thrilling public life, a meditation on justice and tyranny, and a mesmerizing testament to a ravaged yet hopeful land."], "author": "Wole Soyinka", "num_pages": "528", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-13 00:00:00", "ISBN": "0375755144"},
{"url": "https://www.goodreads.com/book/show/3343049-africa-s-world-war", "num_ratings": "515", "num_reviews": "41", "avg_ratings": 4.06, "genres": ["Cultural", "Africa", "History", "Nonfiction", "War", "Eastern Africa", "Rwanda", "Politics"], "title": "Africa's World War: Congo, the Rwandan Genocide, and the Making of a Continental Catastrophe", "description": ["The Rwandan genocide sparked a horrific bloodbath that swept across sub-Saharan Africa, ultimately leading to the deaths of some four million people. In this extraordinary history of the recent wars in Central Africa, Gerard Prunier offers a gripping account of how one grisly episode laid the groundwork for a sweeping and disastrous upheaval. ", " Prunier vividly describes the", "The Rwandan genocide sparked a horrific bloodbath that swept across sub-Saharan Africa, ultimately leading to the deaths of some four million people. In this extraordinary history of the recent wars in Central Africa, Gerard Prunier offers a gripping account of how one grisly episode laid the groundwork for a sweeping and disastrous upheaval. ", " Prunier vividly describes the grisly aftermath of the Rwandan genocide, when some two million refugees--a third of Rwanda's population--fled to exile in Zaire in 1996. The new Rwandan regime then crossed into Zaire and attacked the refugees, slaughtering upwards of 400,000 people. The Rwandan forces then turned on Zaire's despotic President Mobutu and, with the help of a number of allied African countries, overthrew him. But as Prunier shows, the collapse of the Mobutu regime and the ascension of the corrupt and erratic Laurent-Desire Kabila created a power vacuum that drew Rwanda, Uganda, Angola, Zimbabwe, Sudan, and other African nations into an extended and chaotic war. The heart of the book documents how the whole core of the African continent became engulfed in an intractible and bloody conflict after 1998, a devastating war that only wound down following the assassination of Kabila in 2001. Prunier not only captures all this in his riveting narrative, but he also indicts the international community for its utter lack of interest in what was then the largest conflict in the world. ", "Praise for the hardcover: ", "\"The most ambitious of several remarkable new books that reexamine the extraordinary tragedy of Congo and Central Africa since the Rwandan genocide of 1994.\"", "--New York Review of Books ", "\"One of the first books to lay bare the complex dynamic between Rwanda and Congo that has been driving this disaster.\"", "--Jeffrey Gettleman, New York Times Book Review ", "\"Lucid, meticulously researched and incisive, Prunier's will likely become the standard account of this under-reported tragedy.\"", "--Publishers Weekly", "\""], "author": "Gérard Prunier", "num_pages": "529", "awards": ["Arthur Ross Book Award for Honorable Mention (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-12-01 00:00:00", "ISBN": "0195374207"},
{"url": "https://www.goodreads.com/book/show/16213.The_Hot_Zone", "num_ratings": "82,777", "num_reviews": "4,188", "avg_ratings": 4.11, "genres": ["Nonfiction", "Science", "History", "Medical", "Health", "Medicine"], "title": "The Hot Zone: The Terrifying True Story of the Origins of the Ebola Virus", "description": [" A highly infectious, deadly virus from the central African rain forest suddenly appears in the suburbs of Washington, D.C. There is no cure. In a few days 90 percent of its victims are dead. A secret military SWAT team of soldiers and scientists is mobilized to stop the outbreak of this exotic \"hot", " A highly infectious, deadly virus from the central African rain forest suddenly appears in the suburbs of Washington, D.C. There is no cure. In a few days 90 percent of its victims are dead. A secret military SWAT team of soldiers and scientists is mobilized to stop the outbreak of this exotic \"hot\" virus. ", " tells this dramatic story, giving a hair-raising account of the appearance of rare and lethal viruses and their \"crashes\" into the human race. Shocking, frightening, and impossible to ignore, ", " proves that truth really is scarier than fiction."], "author": "Richard Preston", "num_pages": "352", "awards": ["Evergreen Teen Book Award (1998)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1999-06-15 00:00:00", "ISBN": "0385495226"},
{"url": "https://www.goodreads.com/book/show/824339.Snow", "num_ratings": "33,050", "num_reviews": "3,183", "avg_ratings": 3.56, "genres": ["Fiction", "Literature", "Novels", "Contemporary"], "title": "Snow", "description": ["The year is 1992. Ka, a poet and political exile, returns to Turkey as a journalist, assigned to investigate troubling reports of suicide in the small and mysterious city of Kars on the Turkish border.", "The snow is falling fast as he arrives, and soon all roads are closed. There's a 'suicide epidemic' amongst young religious women forbidden to wear their headscarves. Islamis", "The year is 1992. Ka, a poet and political exile, returns to Turkey as a journalist, assigned to investigate troubling reports of suicide in the small and mysterious city of Kars on the Turkish border.", "The snow is falling fast as he arrives, and soon all roads are closed. There's a 'suicide epidemic' amongst young religious women forbidden to wear their headscarves. Islamists are poised to win the local elections and Ka is falling in love with the beautiful and radiant Ipek, now recently divorced.", "Amid blanketing snowfall and universal suspicion, he finds himself pursued by terrorism in a city wasting away under the shadow of Europe. In the midst of growing religious and political violence, the stage is set for a terrible and desperate act . . .", "Touching, slyly comic, and humming with cerebral suspense, ", " evokes the spiritual fragility of the non-Western world, its ambivalence about the godless West, and its fury."], "author": "Orhan Pamuk", "num_pages": "436", "awards": ["Independent Foreign Fiction Prize Nominee for Shortlist (2005)", "Prix Médicis Etranger (2005)", "Prix Méditerranée Étranger (2006)", "Ein Buch für die Stadt (2006)"], "places": ["Kars"], "character_names": [], "language": "English", "publish_date": "2005-04-07 00:00:00", "ISBN": "0571218318"},
{"url": "https://www.goodreads.com/book/show/256314.Not_On_Our_Watch", "num_ratings": "1,261", "num_reviews": "153", "avg_ratings": 3.93, "genres": ["Nonfiction", "Cultural", "Africa", "Politics", "History"], "title": "Not On Our Watch: The Mission to End Genocide in Darfur and Beyond", "description": ["In this powerful call to action, Oscar-nominated film star Don Cheadle and human rights advocate John Prendergast shine an unsparing spotlight on the genocide in Darfur -- a targeted ethnic extermination chillingly described as \"Rwanda in slow motion.\" The authors explore the roots of the current crisis, recount the stories of their separate and combined involvements, and", "In this powerful call to action, Oscar-nominated film star Don Cheadle and human rights advocate John Prendergast shine an unsparing spotlight on the genocide in Darfur -- a targeted ethnic extermination chillingly described as \"Rwanda in slow motion.\" The authors explore the roots of the current crisis, recount the stories of their separate and combined involvements, and suggest practical strategies every American can implement to end the death and destruction in Darfur and prevent the next attempted genocide. Transcending the bounds of memoir or history, ", " is nothing short of a field guide to citizen activism. Its practical strategies for effecting grassroots change could easily be adopted to serve other worthy causes. ", "[An introduction by U.S. Senators Barack Obama and Sam Brownback offers a political perspective.]"], "author": "Don Cheadle", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "1401303358"},
{"url": "https://www.goodreads.com/book/show/5942.Anil_s_Ghost", "num_ratings": "13,591", "num_reviews": "1,118", "avg_ratings": 3.55, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction", "Literature"], "title": "Anil's Ghost", "description": ["An alternate cover edition of this ISBN can be found ", ".", "With his first novel since the internationally acclaimed ", ", Booker Prize-winning author Michael Ondaatje gives us a work displaying all the richness of imagery and language and the piercing emotional truth that we have come to know as the hallmarks of his writing.", " transports us to Sri L", "An alternate cover edition of this ISBN can be found ", ".", "With his first novel since the internationally acclaimed ", ", Booker Prize-winning author Michael Ondaatje gives us a work displaying all the richness of imagery and language and the piercing emotional truth that we have come to know as the hallmarks of his writing.", " transports us to Sri Lanka, a country steeped in centuries of tradition, now forced into the late twentieth century by the ravages of civil war. Into this maelstrom steps Anil Tissera, a young woman born in Sri Lanka, educated in England and America, who returns to her homeland as a forensic anthropologist sent by an international human rights group to discover the source of the organized campaigns of murder engulfing the island. What follows is a story about love, about family, about identity, about the unknown enemy, about the quest to unlock the hidden past–a story propelled by a riveting mystery. Unfolding against the deeply evocative background of Sri Lanka’s landscape and ancient civilization, ", " is a literary spellbinder–Michael Ondaatje’s most powerful novel yet."], "author": "Michael Ondaatje", "num_pages": "311", "awards": ["Scotiabank Giller Prize (2000)", "Irish Times International Fiction Prize (2001)", "Prix Médicis Etranger (2000)", "Kiriyama Prize for Fiction (2000)"], "places": ["Sri Lanka"], "character_names": [], "language": "English", "publish_date": "2001-04-24 00:00:00", "ISBN": "0375724370"},
{"url": "https://www.goodreads.com/book/show/445233.The_Fate_of_Africa", "num_ratings": "5,123", "num_reviews": "408", "avg_ratings": 4.16, "genres": ["History", "Cultural", "Africa", "Nonfiction", "Politics"], "title": "The Fate of Africa: From the Hopes of Freedom to the Heart of Despair", "description": ["An epic biography of postcolonial Africa illuminates its current devastating problems. What happened to this vast continent, so rich in resources and history, to bring it so close to destitution and despair in the span of two generations?"], "author": "Martin Meredith", "num_pages": "752", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-07-05 00:00:00", "ISBN": "1586482467"},
{"url": "https://www.goodreads.com/book/show/79787.The_Case_of_Comrade_Tulayev", "num_ratings": "819", "num_reviews": "95", "avg_ratings": 4.08, "genres": ["Fiction", "Cultural", "Russia", "Literature", "Russian Literature"], "title": "The Case of Comrade Tulayev", "description": ["One cold Moscow night, Comrade Tulayev, a high government official, is shot dead on the street, and the search for the killer begins. In this panoramic vision of the Soviet Great Terror, the investigation leads all over the world, netting a whole series of suspects whose only connection is their innocence—at least of the crime of which they stand accused. But ", "One cold Moscow night, Comrade Tulayev, a high government official, is shot dead on the street, and the search for the killer begins. In this panoramic vision of the Soviet Great Terror, the investigation leads all over the world, netting a whole series of suspects whose only connection is their innocence—at least of the crime of which they stand accused. But ", ", unquestionably the finest work of fiction ever written about the Stalinist purges, is not just a story of a totalitarian state. Marked by the deep humanity and generous spirit of its author, the legendary anarchist and exile Victor Serge, it is also a classic twentieth-century tale of risk, adventure, and unexpected nobility to set beside Ernest Hemingway's", " and André Malraux's ", "."], "author": "Victor Serge", "num_pages": "400", "awards": ["Βραβείο Λογοτεχνικής Μετάφρασης ΕΚΕΜΕΛ for Γαλλόφωνη Λογοτεχνία (2008)"], "places": ["Moscow, Russia"], "character_names": [], "language": "English", "publish_date": "2004-06-30 00:00:00", "ISBN": "1590170644"},
{"url": "https://www.goodreads.com/book/show/128029.A_Thousand_Splendid_Suns", "num_ratings": "949,941", "num_reviews": "46,560", "avg_ratings": 4.35, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "A Thousand Splendid Suns", "description": [" is a breathtaking story set against the volatile events of Afghanistan's last thirty years—from the Soviet invasion to the reign of the Taliban to post-Taliban rebuilding—that puts the violence, fear, hope, and faith of this country in intimate, human terms. It is a tale of two generations of characters brought jarringly together by the tragic swee", " is a breathtaking story set against the volatile events of Afghanistan's last thirty years—from the Soviet invasion to the reign of the Taliban to post-Taliban rebuilding—that puts the violence, fear, hope, and faith of this country in intimate, human terms. It is a tale of two generations of characters brought jarringly together by the tragic sweep of war, where personal lives—the struggle to survive, raise a family, find happiness—are inextricable from the history playing out around them.", "Propelled by the same storytelling instinct that made ", " a beloved classic, ", " is at once a remarkable chronicle of three decades of Afghan history and a deeply moving account of family and friendship. It is a striking, heart-wrenching novel of an unforgiving time, an unlikely friendship, and an indestructible love—a stunning accomplishment."], "author": "Khaled Hosseini", "num_pages": "372", "awards": ["British Book Award for Best Read of the Year (2008)", "Book Sense Book of the Year Award for Adult Fiction (2008)", "California Book Award for Fiction (Silver) (2007)", "Exclusive Books Boeke Prize Nominee (2007)", "Lincoln Award Nominee (2011)"], "places": ["Afghanistan", "Kabul", "Herat"], "character_names": ["Laila", "Mariam", "Rasheed", "Tariq"], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "1594489505"},
{"url": "https://www.goodreads.com/book/show/235773.Waiting", "num_ratings": "17,209", "num_reviews": "1,591", "avg_ratings": 3.5, "genres": ["Fiction", "Cultural", "China", "Historical", "Historical Fiction", "Cultural", "Asia"], "title": "Waiting", "description": ["In ", " PEN/Hemingway Award-winning author Ha Jin draws on his intimate knowledge of contemporary China to create a novel of unexpected richness and feeling. This is the story of Lin Kong, a man living in two worlds, struggling with the conflicting claims of two utterly different women as he moves through the political minefields of a society designed to regulate his e", "In ", " PEN/Hemingway Award-winning author Ha Jin draws on his intimate knowledge of contemporary China to create a novel of unexpected richness and feeling. This is the story of Lin Kong, a man living in two worlds, struggling with the conflicting claims of two utterly different women as he moves through the political minefields of a society designed to regulate his every move and stifle the promptings of his innermost heart.", "For more than seventeen years, this devoted and ambitious doctor has been in love with an educated, clever, modern woman, Manna Wu. But back in the traditional world of his home village lives the wife his family chose for him when he was young--a humble and touchingly loyal woman, whom he visits in order to ask, again and again, for a divorce. In a culture in which the ancient ties of tradition and family still hold sway and where adultery discovered by the Party can ruin lives forever, Lin's passionate love is stretched ever more taut by the passing years. Every summer, his compliant wife agrees to a divorce but then backs out. This time, Lin promises, will be different.", "Tracing these lives through their summer of decision and beyond, Ha Jin vividly conjures the texture of daily life in a place where the demands of human longing must contend with the weight of centuries of custom. Waiting charms and startles us with its depiction of a China that remains hidden to Western eyes even as it moves us with its piercing vision of the universal", "complications of love."], "author": "Ha Jin", "num_pages": "310", "awards": ["Pulitzer Prize Nominee for Fiction (2000)", "National Book Award for Fiction (1999)", "PEN/Faulkner Award for Fiction (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-19 00:00:00", "ISBN": "0375706410"},
{"url": "https://www.goodreads.com/book/show/2296567.Say_You_re_One_of_Them", "num_ratings": "13,296", "num_reviews": "2,280", "avg_ratings": 3.5, "genres": ["Fiction", "Cultural", "Africa", "Short Stories", "Historical", "Historical Fiction", "Abandoned", "War", "Western Africa", "Nigeria", "Adult", "Literature", "African Literature", "Eastern Africa", "Rwanda"], "title": "Say You're One of Them", "description": ["Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds,", "Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds, his dream can't be granted. Food comes first. His family lives in a street shanty in Nairobi, Kenya, but their way of both loving and taking advantage of each other strikes a universal chord. ", "In the second of his stories published in a New Yorker special fiction issue, Akpan takes us far beyond what we thought we knew about the tribal conflict in Rwanda. The story is told by a young girl, who, with her little brother, witnesses the worst possible scenario between parents. They are asked to do the previously unimaginable in order to protect their children. This singular collection will also take the reader inside Nigeria, Benin, and Ethiopia, revealing in beautiful prose the harsh consequences for children of life in Africa. ", "Akpan's voice is a literary miracle, rendering lives of almost unimaginable deprivation and terror into stories that are nothing short of transcendent."], "author": "Uwem Akpan", "num_pages": "358", "awards": ["Guardian First Book Award Nominee for Longlist (2008)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2009)", "PEN Open Book Award (2009)", "Paris Book Festival for Compilation/Anthology (2010)", "Hurston/Wright Legacy Award for Fiction (2009)", "Commonwealth Writers' Prize for Best First Book in Africa (2009)"], "places": ["Benin", "Kenya", "Ethiopia", "Rwanda", "Nigeria", "Africa"], "character_names": [], "language": "English", "publish_date": "2009-09-18 00:00:00", "ISBN": "0316113786"},
{"url": "https://www.goodreads.com/book/show/10046142-dancing-in-the-glory-of-monsters", "num_ratings": "3,055", "num_reviews": "237", "avg_ratings": 4.15, "genres": ["History", "Cultural", "Africa", "Nonfiction"], "title": "Dancing in the Glory of Monsters: The Collapse of the Congo and the Great War of Africa", "description": ["At the heart of Africa is Congo, a country the size of Western Europe, bordering nine other nations, that since 1996 has been wracked by a brutal and unstaunchable war in which millions have died. And yet, despite its epic proportions, it has received little sustained media attention. In this deeply reported book, Jason Stearns vividly tells the story of this misunderstood", "At the heart of Africa is Congo, a country the size of Western Europe, bordering nine other nations, that since 1996 has been wracked by a brutal and unstaunchable war in which millions have died. And yet, despite its epic proportions, it has received little sustained media attention. In this deeply reported book, Jason Stearns vividly tells the story of this misunderstood conflict through the experiences of those who engineered and perpetrated it. He depicts village pastors who survived massacres, the child soldier assassin of President Kabila, a female Hutu activist who relives the hunting and methodical extermination of fellow refugees, and key architects of the war that became as great a disaster as--and was a direct consequence of--the genocide in neighboring Rwanda. Through their stories, he tries to understand why such mass violence made sense, and why stability has been so elusive.", "Through their voices, and an astonishing wealth of knowledge and research, Stearns chronicles the political, social, and moral decay of the Congolese State."], "author": "Jason  Stearns", "num_pages": "400", "awards": ["Arthur Ross Book Award for Silver Medal (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-29 00:00:00", "ISBN": "1586489291"},
{"url": "https://www.goodreads.com/book/show/87923.The_Balkans", "num_ratings": "1,130", "num_reviews": "84", "avg_ratings": 4.0, "genres": ["History", "Nonfiction", "History", "European History", "Politics"], "title": "The Balkans: Nationalism, War and the Great Powers 1804-1999", "description": ["This unique and lively history of Balkan geopolitics since the early nineteenth century gives readers the essential historical background to recent events in this war-torn area. No other book covers the entire region, or offers such profound insights into the roots of Balkan violence, or explains so vividly the origins of modern Serbia, Croatia, Bosnia, Greece, Bulgaria, R", "This unique and lively history of Balkan geopolitics since the early nineteenth century gives readers the essential historical background to recent events in this war-torn area. No other book covers the entire region, or offers such profound insights into the roots of Balkan violence, or explains so vividly the origins of modern Serbia, Croatia, Bosnia, Greece, Bulgaria, Romania, and Albania. Misha Glenny presents a lucid and fair-minded account of each national group in the Balkans and its struggle for statehood. The narrative is studded with sharply observed portraits of kings, guerrillas, bandits, generals, and politicians. Glenny also explores the often-catastrophic relationship between the Balkans and the Great Powers, raising some disturbing questions about Western intervention."], "author": "Misha Glenny", "num_pages": "752", "awards": [], "places": ["Balkans"], "character_names": [], "language": "English", "publish_date": "2001-09-01 00:00:00", "ISBN": "0140233776"},
{"url": "https://www.goodreads.com/book/show/9345.Palestine", "num_ratings": "3,149", "num_reviews": "406", "avg_ratings": 3.8, "genres": ["Nonfiction", "Politics", "History"], "title": "Palestine: Peace Not Apartheid", "description": ["First edition. Signed and inscribed by Jehan Sahan and Hanan Ashrawi at the Baker Institute, Houston, Texas. F"], "author": "Jimmy Carter", "num_pages": "288", "awards": ["J. Gordon Coogler Award for the worst book of the year (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-30 00:00:00", "ISBN": "0743285026"},
{"url": "https://www.goodreads.com/book/show/95784.The_Rape_of_Nanking", "num_ratings": "19,732", "num_reviews": "1,534", "avg_ratings": 4.1, "genres": ["History", "Nonfiction", "Cultural", "China", "War", "Cultural", "Japan", "War", "World War II", "Cultural", "Asia"], "title": "The Rape of Nanking", "description": ["In December 1937, the Japanese army invaded the ancient city of Nanking, systematically raping, torturing, and murdering more than 300,000 Chinese civilians. ", "This book tells the story from three perspectives: of the Japanese soldiers who performed it, of the Chinese civilians who endured it, and of a group of Europeans and Americans who refused to abandon the city and were", "In December 1937, the Japanese army invaded the ancient city of Nanking, systematically raping, torturing, and murdering more than 300,000 Chinese civilians. ", "This book tells the story from three perspectives: of the Japanese soldiers who performed it, of the Chinese civilians who endured it, and of a group of Europeans and Americans who refused to abandon the city and were able to create a safety zone that saved many."], "author": "Iris Chang", "num_pages": "290", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-11-01 00:00:00", "ISBN": "0140277447"},
{"url": "https://www.goodreads.com/book/show/4373.First_They_Killed_My_Father", "num_ratings": "24,181", "num_reviews": "2,288", "avg_ratings": 4.32, "genres": ["Nonfiction", "History", "Autobiography", "Memoir", "Biography", "Cultural", "Asia"], "title": "First They Killed My Father: A Daughter of Cambodia Remembers", "description": ["One of seven children of a high-ranking government official, Loung Ung lived a privileged life in the Cambodian capital of Phnom Penh until the a", "One of seven children of a high-ranking government official, Loung Ung lived a privileged life in the Cambodian capital of Phnom Penh until the age of five. Then, in April 1975, Pol Pot's Khmer Rouge army stormed into the city, forcing Ung's family to flee and, eventually, to disperse. Loung was trained as a child soldier in a work camp for orphans, her siblings were sent to labor camps, and those who survived the horrors would not be reunited until the Khmer Rouge was destroyed.", "Harrowing yet hopeful, Loung's powerful story is an unforgettable account of a family shaken and shattered, yet miraculously sustained by courage and love in the face of unspeakable brutality."], "author": "Loung Ung", "num_pages": "238", "awards": [], "places": ["Cambodia"], "character_names": [], "language": "English", "publish_date": "2006-04-04 00:00:00", "ISBN": "0060856262"},
{"url": "https://www.goodreads.com/book/show/215758.Shake_Hands_with_the_Devil", "num_ratings": "9,370", "num_reviews": "575", "avg_ratings": 4.23, "genres": ["Nonfiction", "History", "Cultural", "Africa", "Politics", "War", "Biography", "Eastern Africa", "Rwanda"], "title": "Shake Hands with the Devil: The Failure of Humanity in Rwanda", "description": ["On the 10th anniversary of when UN peacekeepers landed in Rwanda, Random House Canada proudly publishes the unforgettable 1st-hand account of the genocide by the leader of the mission. Digging deep into shattering memories, Dallaire has written a powerful story of betrayal, naïveté, racism & international politics. His message is simple, undeniable: Never again. ", "When L", "On the 10th anniversary of when UN peacekeepers landed in Rwanda, Random House Canada proudly publishes the unforgettable 1st-hand account of the genocide by the leader of the mission. Digging deep into shattering memories, Dallaire has written a powerful story of betrayal, naïveté, racism & international politics. His message is simple, undeniable: Never again. ", "When Lt-Gen. Roméo Dallaire was called to serve as force commander of the UN intervention in Rwanda in '93, he thought he was heading off on a straightforward peacekeeping mission. Thirteen months later he flew home from Africa, broken, disillusioned & suicidal, having witnessed the slaughter of 800,000 Rwandans in 100 days. ", "In Shake Hands with the Devil, he takes readers with him on a return voyage into hell, vividly recreating the events the international community turned its back on. This book is an unsparing eyewitness account of the failure by humanity to stop the genocide, despite timely warnings. Woven thru the story of this disastrous mission is his own journey from confident Cold Warrior, to devastated UN commander, to retired general engaged in a painful struggle to find a measure of peace, hope & reconciliation. ", "This book is a personal account of his conversion from a man certain of his worth & secure in his assumptions to one conscious of his own weaknesses & failures & critical of the institutions he'd relied on. It might not sit easily with standard ideas of military leadership, but understanding what happened to him & his mission to Rwanda is crucial to understanding the moral minefields peacekeepers are forced to negotiate when we ask them to step into dirty wars."], "author": "Roméo Dallaire", "num_pages": "562", "awards": ["Shaughnessy Cohen Prize for Political Writing (2003)", "Canadian Booksellers Association Libris Award for Non‐Fiction Book (2004)"], "places": ["Rwanda"], "character_names": [], "language": "English", "publish_date": "2004-12-21 00:00:00", "ISBN": "0786715103"},
{"url": "https://www.goodreads.com/book/show/18300212-the-trigger", "num_ratings": "902", "num_reviews": "194", "avg_ratings": 4.11, "genres": ["History", "Nonfiction", "War", "World War I", "Travel", "Biography", "War"], "title": "The Trigger: Hunting the Assassin Who Brought the World to War", "description": ["On a summer morning in Sarajevo a hundred years ago, a teenage assassin named Gavrilo Princip fired not just the opening shots of the First World War but the starting gun for modern history, when he killed Archduke Franz Ferdinand. Yet the events Princip triggered were so monumental that his own story has been largely overlooked, his role garbled and motivations misreprese", "On a summer morning in Sarajevo a hundred years ago, a teenage assassin named Gavrilo Princip fired not just the opening shots of the First World War but the starting gun for modern history, when he killed Archduke Franz Ferdinand. Yet the events Princip triggered were so monumental that his own story has been largely overlooked, his role garbled and motivations misrepresented.", " puts this right, filling out as never before a figure who changed our world and whose legacy still has an impact on all of us today. Born a penniless backwoodsman, Princip’s life changed when he trekked through Bosnia and Serbia to attend school. As he ventured across fault lines of faith, nationalism and empire, so tightly clustered in the Balkans, radicalisation slowly transformed him from a frail farm boy into history’s most influential assassin.", "By retracing Princip’s journey from his highland birthplace, through the mythical valleys of Bosnia to the fortress city of Belgrade and ultimately Sarajevo, Tim Butcher illuminates our understanding both of Princip and the places that shaped him. Tim uncovers details about Princip that have eluded historians for a century and draws on his own experience, as a war reporter in the Balkans in the 1990s, to face down ghosts of conflicts past and present.", " is a rich and timely work that brings to life both the moment the world first went to war and an extraordinary region with a potent hold over history."], "author": "Tim Butcher", "num_pages": "352", "awards": [], "places": [], "character_names": ["Gavrilo Princip"], "language": "English", "publish_date": "2014-05-01 00:00:00", "ISBN": "070118793X"},
{"url": "https://www.goodreads.com/book/show/7603.Reading_Lolita_in_Tehran", "num_ratings": "104,230", "num_reviews": "6,981", "avg_ratings": 3.59, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Reading Lolita in Tehran: A Memoir in Books", "author": "Azar Nafisi", "num_pages": "356", "awards": ["Book Sense Book of the Year Award for Adult Nonfiction (2004)", "Prix du Meilleur Livre Étranger for Essai (2004)"], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Azar Nafisi"], "language": "English", "publish_date": "2003-12-30 00:00:00", "ISBN": "081297106X"},
{"url": "https://www.goodreads.com/book/show/27586.In_the_Footsteps_of_Mr_Kurtz", "num_ratings": "2,392", "num_reviews": "132", "avg_ratings": 3.98, "genres": ["Cultural", "Africa", "History", "Nonfiction", "Politics", "Biography"], "title": "In the Footsteps of Mr. Kurtz: Living on the Brink of Disaster in Mobutu's Congo", "description": ["He was known as \"the Leopard,\" and for the thirty-two years of his reign Mobutu Sese Seko, president of Zaire, showed all the cunning of his namesake, seducing Western powers, buying up the opposition, and dominating his people with a devastating combination of brutality and charm. While the population was pauperized, he plundered the country's copper and diamond resources", "He was known as \"the Leopard,\" and for the thirty-two years of his reign Mobutu Sese Seko, president of Zaire, showed all the cunning of his namesake, seducing Western powers, buying up the opposition, and dominating his people with a devastating combination of brutality and charm. While the population was pauperized, he plundered the country's copper and diamond resources, downing pink champagne in his jungle palace like some modern-day reincarnation of Joseph Conrad's crazed station manager.", "Michela Wrong, a correspondent who witnessed firsthand Mobutu's last days, traces the rise and fall of the idealistic young journalist who became the stereotype of an African despot. Engrossing, highly readable, and as funny as it is tragic, her book assesses how Belgium's King Leopold, the CIA, and the World Bank all helped to bring about the disaster that is now the Democratic Republic of Congo. If, in this poignant account, the villains are the \"Big Vegetables\" (", ") — the fat cats who benefited from Mobutu's largesse — the heroes are the ordinary citizens trapped in a parody of a state. Living in the shadow of a disintegrating nuclear reactor, where banknotes are not worth the paper they are printed on, they have turned survival into an art form. For all its valuable insights into Africa's colonial heritage and the damage done by Western intervention, ", " is ultimately a celebration of the irrepressible human spirit."], "author": "Michela Wrong", "num_pages": "338", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-05-28 00:00:00", "ISBN": "0060934433"},
{"url": "https://www.goodreads.com/book/show/13604229-escape-from-camp-14", "num_ratings": "47,756", "num_reviews": "4,731", "avg_ratings": 4.0, "genres": ["Nonfiction", "Biography", "History", "Autobiography", "Memoir"], "title": "Escape from Camp 14: One Man's Remarkable Odyssey from North Korea to Freedom in the West", "description": ["North Korea is isolated and hungry, bankrupt and belligerent. It is also armed with nuclear weapons. Between 150,000 and 200,000 people are being held in its political prison camps, which have existed twice as long as Stalin's Sovie", "North Korea is isolated and hungry, bankrupt and belligerent. It is also armed with nuclear weapons. Between 150,000 and 200,000 people are being held in its political prison camps, which have existed twice as long as Stalin's Soviet gulags and twelve times as long as the Nazi concentration camps. Very few born and raised in these camps have escaped. But Shin Donghyuk did.", "In ", ", acclaimed journalist Blaine Harden tells the story of Shin Dong-hyuk and through the lens of Shin's life unlocks the secrets of the world's most repressive totalitarian state. Shin knew nothing of civilized existence-he saw his mother as a competitor for food, guards raised him to be a snitch, and he witnessed the execution of his own family. Through Harden's harrowing narrative of Shin's life and remarkable escape, he offers an unequaled inside account of one of the world's darkest nations and a riveting tale of endurance, courage, and survival."], "author": "Blaine Harden", "num_pages": "242", "awards": ["Dayton Literary Peace Prize Nominee for Nonfiction (2013)", "Lincoln Award Nominee (2015)", "Green Mountain Book Award Nominee (2015)"], "places": ["North Korea"], "character_names": ["George W. Bush", "Kim Jong-il", "Kim Il-sung", "Shin Donghyuk", "Kim Jong-un", "Lee Myung-bak", "Kim Dae-jung"], "language": "English", "publish_date": "2012-08-16 00:00:00", "ISBN": "0230754686"},
{"url": "https://www.goodreads.com/book/show/8013701-they-fight-like-soldiers-they-die-like-children", "num_ratings": "984", "num_reviews": "77", "avg_ratings": 4.02, "genres": ["Nonfiction", "Cultural", "Africa", "War", "History", "Politics", "War", "Military Fiction"], "title": "They Fight Like Soldiers, They Die Like Children: The Global Quest to Eradicate the Use of Child Soldiers", "description": ["\"The ultimate focus of the rest of my life is to eradicate the use of child soldiers and to eliminate even the thought of the use of children as instruments of war.\" —Roméo Dallaire", "In conflicts around the world, there is an increasingly popular weapon system that requires negligible technology, is simple to sustain, has unlimited versatility and incredible capacity for bot", "\"The ultimate focus of the rest of my life is to eradicate the use of child soldiers and to eliminate even the thought of the use of children as instruments of war.\" —Roméo Dallaire", "In conflicts around the world, there is an increasingly popular weapon system that requires negligible technology, is simple to sustain, has unlimited versatility and incredible capacity for both loyalty and barbarism. In fact, there is no more complete end-to-end weapon system in the inventory of war-machines. What are these cheap, renewable, plentiful, sophisticated and expendable weapons? Children.", "Roméo Dallaire was first confronted with child soldiers in unnamed villages on the tops of the thousand hills of Rwanda during the genocide of 1994. The dilemma of the adult soldier who faced them is beautifully expressed in his book's title: when children are shooting at you, they are soldiers, but as soon as they are wounded or killed they are children once again.", "Believing that not one of us should tolerate a child being used in this fashion, Dallaire has made it his mission to end the use of child soldiers. In this book, he provides an intellectually daring and enlightening introduction to the child soldier phenomenon, as well as inspiring and concrete solutions to eradicate it."], "author": "Roméo Dallaire", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-26 00:00:00", "ISBN": "0307355772"},
{"url": "https://www.goodreads.com/book/show/6178648-nothing-to-envy", "num_ratings": "52,044", "num_reviews": "6,330", "avg_ratings": 4.43, "genres": ["Nonfiction", "History", "Politics", "Cultural", "Asia"], "title": "Nothing to Envy: Ordinary Lives in North Korea", "description": ["follows the lives of six North Koreans over fifteen years—a chaotic period that saw the death of Kim Il-sung, the unchallenged rise to power of his son Kim Jong-il, and the devastation of a far-ranging famine that killed one-fifth of the population. ", "Taking us into a landscape most of us have never before seen, award-winning journalist Barbara Demick brings", "follows the lives of six North Koreans over fifteen years—a chaotic period that saw the death of Kim Il-sung, the unchallenged rise to power of his son Kim Jong-il, and the devastation of a far-ranging famine that killed one-fifth of the population. ", "Taking us into a landscape most of us have never before seen, award-winning journalist Barbara Demick brings to life what it means to be living under the most repressive totalitarian regime today—an Orwellian world that is by choice not connected to the Internet, in which radio and television dials are welded to the one government station, and where displays of affection are punished; a police state where informants are rewarded and where an offhand remark can send a person to the gulag for life. ", "Demick takes us deep inside the country, beyond the reach of government censors. Through meticulous and sensitive reporting, we see her six subjects—average North Korean citizens—fall in love, raise families, nurture ambitions, and struggle for survival. One by one, we experience the moments when they realize that their government has betrayed them.  ", "is a groundbreaking addition to the literature of totalitarianism and an eye-opening look at a closed world that is of increasing global importance."], "author": "Barbara Demick", "num_pages": "316", "awards": ["National Book Critics Circle Award Nominee for General Nonfiction (2010)", "Ryszard Kapuściński Prize Nominee (2011)", "Samuel Johnson Prize for Non-Fiction (2010)", "National Book Award Finalist for Nonfiction (2010)"], "places": ["Korea, Democratic People's Republic of", "North Korea"], "character_names": [], "language": "English", "publish_date": "2009-12-29 00:00:00", "ISBN": "0385523904"},
{"url": "https://www.goodreads.com/book/show/347610.King_Leopold_s_Ghost", "num_ratings": "30,736", "num_reviews": "2,029", "avg_ratings": 4.15, "genres": ["History", "Nonfiction", "Cultural", "Africa", "Biography", "Politics"], "title": "King Leopold's Ghost", "description": ["In the 1880s, as the European powers were carving up Africa, King Leopold II of Belgium seized for himself the vast and mostly unexplored territory surrounding the Congo River. Carrying out a genocidal plundering of the Congo, he looted its rubber, brutalized its people, and ultimately slashed its population by ten million--all the while shrewdly cultivating his reputation", "In the 1880s, as the European powers were carving up Africa, King Leopold II of Belgium seized for himself the vast and mostly unexplored territory surrounding the Congo River. Carrying out a genocidal plundering of the Congo, he looted its rubber, brutalized its people, and ultimately slashed its population by ten million--all the while shrewdly cultivating his reputation as a great humanitarian. Heroic efforts to expose these crimes eventually led to the first great human rights movement of the twentieth century, in which everyone from Mark Twain to the Archbishop of Canterbury participated. ", " is the haunting account of a megalomaniac of monstrous proportions, a man as cunning, charming, and cruel as any of the great Shakespearean villains. It is also the deeply moving portrait of those who fought Leopold: a brave handful of missionaries, travelers, and young idealists who went to Africa for work or adventure and unexpectedly found themselves witnesses to a holocaust. Adam Hochschild brings this largely untold story alive with the wit and skill of a Barbara Tuchman. Like her, he knows that history often provides a far richer cast of characters than any novelist could invent. Chief among them is Edmund Morel, a young British shipping agent who went on to lead the international crusade against Leopold. Another hero of this tale, the Irish patriot Roger Casement, ended his life on a London gallows. Two courageous black Americans, George Washington Williams and William Sheppard, risked much to bring evidence of the Congo atrocities to the outside world. Sailing into the middle of the story was a young Congo River steamboat officer named Joseph Conrad. And looming above them all, the duplicitous billionaire King Leopold II. With great power and compassion, ", " will brand the tragedy of the Congo--too long forgotten--onto the conscience of the West"], "author": "Adam Hochschild", "num_pages": "306", "awards": ["Mark Lynton History Prize (1999)", "California Book Award for Nonfiction (Gold) (1998)", "Lionel Gelber Prize (1999)", "National Book Critics Circle Award Nominee for General Nonfiction (1998)", "Duff Cooper Prize (1999)"], "places": ["Congo, Democratic Republic of the ", "Congo Free State"], "character_names": ["Leopold II of Belgium"], "language": "English", "publish_date": "1999-09-03 00:00:00", "ISBN": "0618001905"},
{"url": "https://www.goodreads.com/book/show/43015.A_Long_Way_Gone", "num_ratings": "139,576", "num_reviews": "9,677", "avg_ratings": 4.15, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Africa", "Biography", "War"], "title": "A Long Way Gone: Memoirs of a Boy Soldier", "description": ["The devastating story of war through the eyes of a child soldier. Beah tells how, at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and became a soldier.", "My new friends have begun to suspect I haven’t told them the full story of my life.", "“Why did you leave Sierra Le", "The devastating story of war through the eyes of a child soldier. Beah tells how, at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and became a soldier.", "My new friends have begun to suspect I haven’t told them the full story of my life.", "“Why did you leave Sierra Leone?”", "“Because there is a war.”", "“You mean, you saw people running around with guns and shooting each other?”", "“Yes, all the time.”", "“Cool.”", "I smile a little.", "“You should tell us about it sometime.”", "“Yes, sometime.” ", "This is how wars are fought now: by children, hopped-up on drugs and wielding AK-47s. Children have become soldiers of choice. In the more than fifty conflicts going on worldwide, it is estimated that there are some 300,000 child soldiers. Ishmael Beah used to be one of them. ", "What is war like through the eyes of a child soldier? How does one become a killer? How does one stop? Child soldiers have been profiled by journalists, and novelists have struggled to imagine their lives. But until now, there has not been a first-person account from someone who came through this hell and survived.", "In A Long Way Gone, Beah, now twenty-five years old, tells a riveting story: how at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and Beah, at heart a gentle boy, found that he was capable of truly terrible acts. ", "This is a rare and mesmerizing account, told with real literary force and heartbreaking honesty."], "author": "Ishmael Beah", "num_pages": "229", "awards": ["Christopher Award (2008)", "ALA Alex Award (2008)", "Lincoln Award Nominee (2010)", "NAIBA Book of the Year for Nonfiction (2007)", "Bill Duthie Booksellers’ Choice Award Nominee (2008)"], "places": ["Sierra Leone", "New York City, New York"], "character_names": ["Ishmael Beah", "Musa", "Esther", "\"Junior\" Beah", "Talloi", "Kanei", "Alhaji", "Jumah", "Moriba", "Saidu", "Khalilou"], "language": "English", "publish_date": "2007-02-13 00:00:00", "ISBN": "0374105235"},
{"url": "https://www.goodreads.com/book/show/1848.Wild_Swans", "num_ratings": "74,420", "num_reviews": "4,810", "avg_ratings": 4.24, "genres": ["Nonfiction", "Cultural", "China", "History", "Biography", "Autobiography", "Memoir", "Cultural", "Asia"], "title": "Wild Swans: Three Daughters of China", "description": ["The story of three generations in twentieth-century China that blends the intimacy of memoir and the panoramic sweep of eyewitness history—a bestselling classic in thirty languages with more than ten million copies sold around the world, now with a new introduction from the author.", "An engrossing record of Mao’s impact on China, an unusual window on the female experience in", "The story of three generations in twentieth-century China that blends the intimacy of memoir and the panoramic sweep of eyewitness history—a bestselling classic in thirty languages with more than ten million copies sold around the world, now with a new introduction from the author.", "An engrossing record of Mao’s impact on China, an unusual window on the female experience in the modern world, and an inspiring tale of courage and love, Jung Chang describes the extraordinary lives and experiences of her family members: her grandmother, a warlord’s concubine; her mother’s struggles as a young idealistic Communist; and her parents’ experience as members of the Communist elite and their ordeal during the Cultural Revolution. Chang was a Red Guard briefly at the age of fourteen, then worked as a peasant, a “barefoot doctor,” a steelworker, and an electrician. As the story of each generation unfolds, Chang captures in gripping, moving—and ultimately uplifting—detail the cycles of violent drama visited on her own family and millions of others caught in the whirlwind of history."], "author": "Jung Chang", "num_pages": "562", "awards": ["NCR Book Award (1992)", "British Book Award (1993)"], "places": ["China"], "character_names": [], "language": "English", "publish_date": "2003-08-12 00:00:00", "ISBN": "0743246985"},
{"url": "https://www.goodreads.com/book/show/11472.We_Wish_to_Inform_You_That_Tomorrow_We_Will_Be_Killed_with_Our_Families", "num_ratings": "23,063", "num_reviews": "1,437", "avg_ratings": 4.26, "genres": ["Nonfiction", "History", "Cultural", "Africa", "War", "Eastern Africa", "Rwanda", "Politics"], "title": "We Wish to Inform You That Tomorrow We Will Be Killed with Our Families", "description": ["In April of 1994, the government of Rwanda called on everyone in the Hutu majority to kill everyone in the Tutsi minority. Over the next three months, 800,000 Tutsis were murdered in the most unambiguous case of genocide since Hitler's war against the Jews. Philip Gourevitch's haunting work is an anatomy of the killings in Rwanda, a vivid history of the genocide's backgrou", "In April of 1994, the government of Rwanda called on everyone in the Hutu majority to kill everyone in the Tutsi minority. Over the next three months, 800,000 Tutsis were murdered in the most unambiguous case of genocide since Hitler's war against the Jews. Philip Gourevitch's haunting work is an anatomy of the killings in Rwanda, a vivid history of the genocide's background, and an unforgettable account of what it means to survive in its aftermath."], "author": "Philip Gourevitch", "num_pages": "356", "awards": ["Guardian First Book Award (1999)", "Helen Bernstein Book Award for Excellence in Journalism (1999)", "Los Angeles Times Book Prize for Current Interest (1998)", "PEN/Martha Albrand Award for First Nonfiction Writers (1999)", "National Book Critics Circle Award for General Nonfiction (1998)", "Cornelius Ryan Award (1998)"], "places": ["Rwanda"], "character_names": [], "language": "English", "publish_date": "1999-09-04 00:00:00", "ISBN": "0312243359"},
{"url": "https://www.goodreads.com/book/show/76401.Bury_My_Heart_at_Wounded_Knee", "num_ratings": "47,837", "num_reviews": "2,653", "avg_ratings": 4.22, "genres": ["History", "Nonfiction", "North American Hi...", "American History", "Classics", "Historical"], "title": "Bury My Heart at Wounded Knee: An Indian History of the American West", "description": ["Now a special 30th-anniversary edition in both hardcover and paperback, the classic bestselling history ", " called \"Original, remarkable, and finally heartbreaking...Impossible to put down.\"", " is Dee Brown's eloquent, fully documented account of the systematic destruction of the American Indian during the second half of the ninetee", "Now a special 30th-anniversary edition in both hardcover and paperback, the classic bestselling history ", " called \"Original, remarkable, and finally heartbreaking...Impossible to put down.\"", " is Dee Brown's eloquent, fully documented account of the systematic destruction of the American Indian during the second half of the nineteenth century. A national bestseller in hardcover for more than a year after its initial publication, it has sold almost four million copies and has been translated into seventeen languages. For this elegant thirtieth-anniversary edition—published in both hardcover and paperback—Brown has contributed an incisive new preface.", "Using council records, autobiographies, and firsthand descriptions, Brown allows the great chiefs and warriors of the Dakota, Ute, Sioux, Cheyenne, and other tribes to tell us in their own words of the battles, massacres, and broken treaties that finally left them demoralized and defeated. A unique and disturbing narrative told with force and clarity, ", " changed forever our vision of how the West was really won."], "author": "Dee Brown", "num_pages": "509", "awards": [], "places": [], "character_names": ["Sitting Bull", "Red Cloud", "Ely Parker", "Cochise", "Quanah Parker", "Kicking Bird", "Ten Bears", "Crazy Horse", "Chief Joseph", "Geronimo", "Manuelito", "Little Crow"], "language": "English", "publish_date": "2001-01-23 00:00:00", "ISBN": "0805066691"},
{"url": "https://www.goodreads.com/book/show/77203.The_Kite_Runner", "num_ratings": "2,054,984", "num_reviews": "63,991", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "The Kite Runner", "description": ["Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amid", "Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amidst the increasing ethnic, religious, and political tensions of the dying years of the Afghan monarchy, wrenching them far apart. But so strong is the bond between the two boys that Amir journeys back to a distant world, to try to right past wrongs against the only true friend he ever had.", "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, ", " is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.", "A sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, ", " is an unusual and powerful novel that has become a beloved, one-of-a-kind classic."], "author": "Khaled Hosseini", "num_pages": "371", "awards": ["Borders Original Voices Award for Fiction (2003)", "Humo's Gouden Bladwijzer (2008)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Puddly Award for Fiction (2006)", "Lincoln Award Nominee (2006)", "Prix des libraires du Québec for Lauréats hors Québec (2006)"], "places": ["Kabul", "Fremont, California", "Afghanistan", "Peshawar"], "character_names": ["Amir", "Hassan", "Assef", "Bába", "Sohrab", "Soraya", "Rahim Khan"], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "1594480001"}
]