[
{"url": "https://www.goodreads.com/book/show/11486.The_Color_Purple", "num_ratings": "435,722", "num_reviews": "11,087", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "295", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "0671727796"},
{"url": "https://www.goodreads.com/book/show/2860399-the-mis-education-of-the-negro", "num_ratings": "6,716", "num_reviews": "273", "avg_ratings": 4.46, "genres": ["Nonfiction", "History", "Education", "Race", "Cultural", "African American", "Classics", "Politics", "Social Movements", "Social Justice", "North American Hi...", "American History", "Teaching"], "title": "The Mis-Education of the Negro", "description": ["The Mis-Education of the Negro is one of the most important books on education ever written. Carter G. Woodson shows us the weakness of Euro-centric based curriculums that fail to include African American history and culture. This system mis-educates the African American student, failing to prepare them for success and to give them an adequate sense of who they are within", "The Mis-Education of the Negro is one of the most important books on education ever written. Carter G. Woodson shows us the weakness of Euro-centric based curriculums that fail to include African American history and culture. This system mis-educates the African American student, failing to prepare them for success and to give them an adequate sense of who they are within the system that they must live. Woodson provides many strong solutions to the problems he identifies. A must-read for anyone working in the education field."], "author": "Carter G. Woodson", "num_pages": "108", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-21 00:00:00", "ISBN": "1604592265"},
{"url": "https://www.goodreads.com/book/show/42603.Black_Like_Me", "num_ratings": "53,204", "num_reviews": "2,273", "avg_ratings": 4.13, "genres": ["Nonfiction", "History", "Autobiography", "Memoir", "Classics", "Biography", "Race"], "title": "Black Like Me", "description": ["In the Deep South of the 1950s, journalist ", " decided to cross the color line. Using medication that darkened his skin to deep brown, he exchanged his privileged life as a Southern white man for the disenfranchised world of an unemployed black man. His audacious, still chillingly relevant eyewitness history is a work about race and humanity-that in this ne", "In the Deep South of the 1950s, journalist ", " decided to cross the color line. Using medication that darkened his skin to deep brown, he exchanged his privileged life as a Southern white man for the disenfranchised world of an unemployed black man. His audacious, still chillingly relevant eyewitness history is a work about race and humanity-that in this new millennium still has something important to say to every American."], "author": "John Howard Griffin", "num_pages": "208", "awards": ["Anisfield-Wolf Book Award (1962)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2003-05-06 00:00:00", "ISBN": "0451208641"},
{"url": "https://www.goodreads.com/book/show/349929.Passing", "num_ratings": "14,741", "num_reviews": "1,095", "avg_ratings": 3.82, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Academic", "School"], "title": "Passing", "description": ["First published to critical acclaim in 1929, ", " firmly established Nella Larsen's prominence among women writers of the Harlem Renaissance. The Modern Library is proud to present Passing — an electrifying story of two women who cross the color line in 1920s New York—together with a new Introduction by the Obie Award- winning", "First published to critical acclaim in 1929, ", " firmly established Nella Larsen's prominence among women writers of the Harlem Renaissance. The Modern Library is proud to present Passing — an electrifying story of two women who cross the color line in 1920s New York—together with a new Introduction by the Obie Award- winning playwright and novelist Ntozake Shange.", "Irene Redfield, the novel's protagonist, is a woman with an enviable life. She and her husband, Brian, a prominent physician, share a comfortable Harlem town house with their sons. Her work arranging charity balls that gather Harlem's elite creates a sense of purpose and respectability for Irene. But her hold on this world begins to slip the day she encounters Clare Kendry, a childhood friend with whom she had lost touch. Clare—light-skinned, beautiful, and charming—tells Irene how, after her father's death, she left behind the black neighborhood of her adolescence and began passing for white, hiding her true identity from everyone, including her racist husband. As Clare begins inserting herself into Irene's life, Irene is thrown into a panic, terrified of the consequences of Clare's dangerous behavior. And when Clare witnesses the vibrancy and energy of the community she left behind, her burning desire to come back threatens to shatter her careful deception.", "Brilliantly plotted and elegantly written, Passing offers a gripping psychological portrait of emotional extremity."], "author": "Nella Larsen", "num_pages": "122", "awards": [], "places": ["Chicago, Illinois", "New York City, New York", "Harlem, New York City, New York"], "character_names": ["Irene Redfield", "Clare Kendry", "Brian Redfield"], "language": "English", "publish_date": "2003-04-24 00:00:00", "ISBN": "0142437271"},
{"url": "https://www.goodreads.com/book/show/46787.Uncle_Tom_s_Cabin", "num_ratings": "170,247", "num_reviews": "6,391", "avg_ratings": 3.84, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature", "Historical", "Literature", "American", "Novels", "Classics", "Classic Literature", "Literature", "19th Century", "Cultural", "African American"], "title": "Uncle Tom's Cabin", "description": ["The narrative drive of Stowe's classic novel is often overlooked in the heat of the controversies surrounding its anti-slavery sentiments. In fact, it is a compelling adventure story with richly drawn characters and has earned a place in both literary and American history. Stowe's puritanical religious beliefs show up in the novel's final, overarching theme—the exploration", "The narrative drive of Stowe's classic novel is often overlooked in the heat of the controversies surrounding its anti-slavery sentiments. In fact, it is a compelling adventure story with richly drawn characters and has earned a place in both literary and American history. Stowe's puritanical religious beliefs show up in the novel's final, overarching theme—the exploration of the nature of Christianity and how Christian theology is fundamentally incompatible with slavery."], "author": "Harriet Beecher Stowe", "num_pages": "438", "awards": [], "places": ["Kentucky"], "character_names": ["Eva Hayes", "Uncle Tom", "Eliza", "Simon Legree", "Topsy"], "language": "English", "publish_date": "1999-08-05 00:00:00", "ISBN": "1840224029"},
{"url": "https://www.goodreads.com/book/show/23316548-the-book-of-negroes", "num_ratings": "61,417", "num_reviews": "5,638", "avg_ratings": 4.45, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Canada", "Historical", "Cultural", "Africa"], "title": "The Book of Negroes", "description": ["Based on a true story, \"The Book of Negroes\" tells the story of Aminata, a young girl abducted from her village in Mali aged 11 in 1755, and who, after a deathly journey on a slave ship where she witnesses the brutal repression of a slave revolt, is sold to a plantation owner in South Carolina, who rapes her. She is brought to New York, where she escapes her owner, and fin", "Based on a true story, \"The Book of Negroes\" tells the story of Aminata, a young girl abducted from her village in Mali aged 11 in 1755, and who, after a deathly journey on a slave ship where she witnesses the brutal repression of a slave revolt, is sold to a plantation owner in South Carolina, who rapes her. She is brought to New York, where she escapes her owner, and finds herself helping the British by recording all the freed slaves on the British side in the Revolutionary War in The Book of Negroes (a real historical document that can be found today at the National Archives at Kew).Aminata is sent to Nova Scotia to start a new life, but finds more hostility, oppression and tragedy. Separated from her one true love, and suffering the unimaginable loss of both her children who are taken away from her, she eventually joins a group of freed slaves on a harrowing odyssey back to Africa, and ends up in London as a living icon for Wilberforce and the other Abolitionists. \"The Book of Negroes\" is a pageturning narrative that manages to use Aminata's heart-rending personal story to bring to life a harrowing chapter in our history."], "author": "Lawrence Hill", "num_pages": "470", "awards": ["Scotiabank Giller Prize Nominee (2007)", "Gustavus Myers Outstanding Book Award (2009)", "Hurston/Wright Legacy Award Nominee for Fiction (2008)", "Commonwealth Writers' Prize for Best Book Overall (2008)", "CBC Canada Reads (2009)", "Rogers Writers' Trust Fiction Prize (2007)", "OLA Evergreen Award (2008)"], "places": ["United States of America", "London, England", "Canada", "Nova Scotia", "Sierra Leone"], "character_names": ["Aminata Diallo"], "language": "English", "publish_date": "2015-01-12 00:00:00", "ISBN": "0393351394"},
{"url": "https://www.goodreads.com/book/show/88061.Dreams_from_My_Father", "num_ratings": "153,075", "num_reviews": "6,290", "avg_ratings": 3.83, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Politics", "Biography", "Autobiography", "History", "Biography Memoir", "Cultural", "African American", "Race", "Audiobook"], "title": "Dreams from My Father: A Story of Race and Inheritance", "description": ["Nine years before the Senate campaign that made him one of the most influential and compelling voices in American politics, Barack Obama published this lyrical, unsentimental, and powerfully affecting memoir, which became a #1 New York Times bestseller when it was reissued in 2004. Dreams from My Father tells the story of Obama’s struggle to understand the forces that shap", "Nine years before the Senate campaign that made him one of the most influential and compelling voices in American politics, Barack Obama published this lyrical, unsentimental, and powerfully affecting memoir, which became a #1 New York Times bestseller when it was reissued in 2004. Dreams from My Father tells the story of Obama’s struggle to understand the forces that shaped him as the son of a black African father and white American mother—a struggle that takes him from the American heartland to the ancestral home of his great-aunt in the tiny African village of Alego. ", "Obama opens his story in New York, where he hears that his father—a figure he knows more as a myth than as a man—has died in a car accident. The news triggers a chain of memories as Barack retraces his family’s unusual history: the migration of his mother’s family from small-town Kansas to the Hawaiian islands; the love that develops between his mother and a promising young Kenyan student, a love nurtured by youthful innocence and the integrationist spirit of the early sixties; his father’s departure from Hawaii when Barack was two, as the realities of race and power reassert themselves; and Barack’s own awakening to the fears and doubts that exist not just between the larger black and white worlds but within himself.", "Propelled by a desire to understand both the forces that shaped him and his father’s legacy, Barack moves to Chicago to work as a community organizer. There, against the backdrop of tumultuous political and racial conflict, he works to turn back the mounting despair of the inner city. His story becomes one with those of the people he works with as he learns about the value of community, the necessity of healing old wounds, and the possibility of faith in the midst of adversity.", "Barack’s journey comes full circle in Kenya, where he finally meets the African side of his family and confronts the bitter truth of his father’s life. Traveling through a country racked by brutal poverty and tribal conflict, but whose people are sustained by a spirit of endurance and hope, Barack discovers that he is inescapably bound to brothers and sisters living an ocean away—and that by embracing their common struggles he can finally reconcile his divided inheritance.", "A searching meditation on the meaning of identity in America, Dreams from My Father might be the most revealing portrait we have of a major American leader—a man who is playing, and will play, an increasingly prominent role in healing a fractious and fragmented nation."], "author": "Barack Obama", "num_pages": "453", "awards": ["British Book Award for The Best Biography (2009)", "Grammy Award for Best Spoken Word Album (2006)"], "places": [], "character_names": ["Barack Obama"], "language": "English", "publish_date": "2004-08-16 00:00:00", "ISBN": "1921351438"},
{"url": "https://www.goodreads.com/book/show/5198.Paradise", "num_ratings": "20,124", "num_reviews": "844", "avg_ratings": 3.78, "genres": ["Fiction", "Cultural", "African American", "Classics", "Literature"], "title": "Paradise", "description": ["\"They shoot the white girl first. With the rest they can take their time.\" So begins this visionary work from a storyteller. Toni Morrison's first novel since she was awarded the Nobel Prize for Literature, Paradise opens with a horrifying scene of mass violence and chronicles its genesis in an all-black small town in rural Oklahoma. Founded by the descendants of freed sla", "\"They shoot the white girl first. With the rest they can take their time.\" So begins this visionary work from a storyteller. Toni Morrison's first novel since she was awarded the Nobel Prize for Literature, Paradise opens with a horrifying scene of mass violence and chronicles its genesis in an all-black small town in rural Oklahoma. Founded by the descendants of freed slaves and survivors in exodus from a hostile world, the patriarchal community of Ruby is built on righteousness, rigidly enforced moral law, and fear. But seventeen miles away, another group of exiles has gathered in a promised land of their own. And it is upon these women in flight from death and despair that nine male citizens of Ruby will lay their pain, their terror, and their murderous rage.", "In prose that soars with the rhythms, grandeur, and tragic arc of an epic poem, Toni Morrison challenges our most fiercely held beliefs as she weaves folklore and history, memory and myth into an unforgettable meditation of race, religion, gender, and a far-off past that is ever present."], "author": "Toni Morrison", "num_pages": "318", "awards": ["Orange Prize Nominee for Fiction Shortlist (1999)", "Ohioana Book Award for Fiction (1999)", "International DUBLIN Literary Award Nominee (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "0452280397"},
{"url": "https://www.goodreads.com/book/show/5167.Cane_River", "num_ratings": "42,524", "num_reviews": "1,934", "avg_ratings": 4.05, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "Cane River", "description": ["Beginning with her great-great-great-great grandmother, a slave owned by a Creole family, Lalita Tademy chronicles four generations of strong, determined black", "Beginning with her great-great-great-great grandmother, a slave owned by a Creole family, Lalita Tademy chronicles four generations of strong, determined black women as they battle injustice to unite their family and forge success on their own terms. They are women whose lives begin in slavery, who weather the Civil War, and who grapple with contradictions of emancipation, Jim Crow, and the pre-Civil Rights South. As she peels back layers of racial and cultural attitudes, Tademy paints a remarkable picture of rural Louisiana and the resilient spirit of one unforgettable family.", "There is Elisabeth, who bears both a proud legacy and the yoke of bondage... her youngest daughter, Suzette, who is the first to discover the promise-and heartbreak-of freedom... Suzette's strong-willed daughter Philomene, who uses a determination born of tragedy to reunite her family and gain unheard-of economic independence... and Emily, Philomene's spirited daughter, who fights to secure her children's just due and preserve their dignity and future.", "Meticulously researched and beautifully written, ", "presents a slice of American history never before seen in such piercing and personal detail."], "author": "Lalita Tademy", "num_pages": "522", "awards": [], "places": ["Louisiana"], "character_names": [], "language": "English", "publish_date": "2002-04-01 00:00:00", "ISBN": "0446678457"},
{"url": "https://www.goodreads.com/book/show/152519.Incidents_in_the_Life_of_a_Slave_Girl", "num_ratings": "35,591", "num_reviews": "1,913", "avg_ratings": 4.09, "genres": ["Nonfiction", "History", "Classics", "Biography", "Autobiography", "Memoir", "Cultural", "African American"], "title": "Incidents in the Life of a Slave Girl", "description": ["The true story of an individual's struggle for self-identity, self-preservation, and freedom, ", " remains among the few extant slave narratives written by a woman. This autobiographical account chronicles the remarkable odyssey of Harriet Jacobs (1813–1897) whose dauntless spirit and faith carried her from a life of servitude and degradati", "The true story of an individual's struggle for self-identity, self-preservation, and freedom, ", " remains among the few extant slave narratives written by a woman. This autobiographical account chronicles the remarkable odyssey of Harriet Jacobs (1813–1897) whose dauntless spirit and faith carried her from a life of servitude and degradation in North Carolina to liberty and reunion with her children in the North.", "Written and published in 1861 after Jacobs' harrowing escape from a vile and predatory master, the memoir delivers a powerful and unflinching portrayal of the abuses and hypocrisy of the master-slave relationship. Jacobs writes frankly of the horrors she suffered as a slave, her eventual escape after several unsuccessful attempts, and her seven years in self-imposed exile, hiding in a coffin-like \"garret\" attached to her grandmother's porch.", "A rare firsthand account of a courageous woman's determination and endurance, this inspirational story also represents a valuable historical record of the continuing battle for freedom and the preservation of family."], "author": "Harriet Ann Jacobs", "num_pages": "176", "awards": [], "places": ["North Carolina"], "character_names": ["Harriet Ann Jacobs"], "language": "English", "publish_date": "2001-11-09 00:00:00", "ISBN": "0486419312"},
{"url": "https://www.goodreads.com/book/show/67.The_Known_World", "num_ratings": "31,389", "num_reviews": "2,960", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "African American"], "title": "The Known World", "description": ["One of the most acclaimed novels in recent memory, ", " is a daring and ambitious work by Pulitzer Prize winner Edward P. Jones.", " tells the story of Henry Townsend, a black farmer and former slave who falls under the tutelage of William Robbins, the most powerful man in Manchester County, Virginia. Making certain he never circumvents the law, Towns", "One of the most acclaimed novels in recent memory, ", " is a daring and ambitious work by Pulitzer Prize winner Edward P. Jones.", " tells the story of Henry Townsend, a black farmer and former slave who falls under the tutelage of William Robbins, the most powerful man in Manchester County, Virginia. Making certain he never circumvents the law, Townsend runs his affairs with unusual discipline. But when death takes him unexpectedly, his widow, Caldonia, can't uphold the estate's order, and chaos ensues. Jones has woven a footnote of history into an epic that takes an unflinching look at slavery in all its moral complexities."], "author": "Edward P. Jones", "num_pages": "432", "awards": ["Pulitzer Prize for Fiction (2004)", "Anisfield-Wolf Book Award (2004)", "National Book Critics Circle Award for Fiction (2003)", "Hurston/Wright Legacy Award Nominee for Debut Fiction (2004)", "National Book Award Finalist for Fiction (2003)", "International DUBLIN Literary Award (2005)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2006-08-29 00:00:00", "ISBN": "0061159174"},
{"url": "https://www.goodreads.com/book/show/52397.Parable_of_the_Sower", "num_ratings": "35,611", "num_reviews": "3,530", "avg_ratings": 4.15, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Apocalyptic", "Post Apocalyptic"], "title": "Parable of the Sower", "description": ["In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a cul", "In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a culture that has been destroyed by drugs, disease, war, and chronic water shortages. While her father tries to lead people on the righteous path, Lauren struggles with hyperempathy, a condition that makes her extraordinarily sensitive to the pain of others.", "When fire destroys their compound, Lauren’s family is killed and she is forced out into a world that is fraught with danger. With a handful of other refugees, Lauren must make her way north to safety, along the way conceiving a revolutionary idea that may mean salvation for all mankind."], "author": "Octavia E. Butler", "num_pages": "345", "awards": [], "places": ["California"], "character_names": ["Lauren Olamina"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0446675504"},
{"url": "https://www.goodreads.com/book/show/827685.Up_from_Slavery", "num_ratings": "20,042", "num_reviews": "999", "avg_ratings": 4.09, "genres": ["History", "Nonfiction", "Biography", "Classics", "Biography", "Autobiography", "Cultural", "African American", "Autobiography", "Memoir"], "title": "Up from Slavery", "description": ["Booker T. Washington, the most recognized national leader, orator and educator, emerged from slavery in the deep south, to work for the betterment of African Americans in the post Reconstruction period. ", "\"Up From Slavery\" is an autobiography of Booker T. Washington's life and work, which has been the source of inspiration for all Americans. Washington reveals his inner most", "Booker T. Washington, the most recognized national leader, orator and educator, emerged from slavery in the deep south, to work for the betterment of African Americans in the post Reconstruction period. ", "\"Up From Slavery\" is an autobiography of Booker T. Washington's life and work, which has been the source of inspiration for all Americans. Washington reveals his inner most thoughts as he transitions from ex-slave to teacher and founder of one of the most important schools for African Americans in the south, The Tuskegee Industrial Institute."], "author": "Booker T. Washington", "num_pages": "256", "awards": [], "places": ["United States of America"], "character_names": ["Booker T. Washington"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0451527542"},
{"url": "https://www.goodreads.com/book/show/100322.Assata", "num_ratings": "12,919", "num_reviews": "726", "avg_ratings": 4.49, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Feminism", "History", "Race"], "title": "Assata: An Autobiography", "description": ["On May 2, 1973, Black Panther Assata Shakur (aka JoAnne Chesimard) lay in a hospital, close to death, handcuffed to her bed, while local, state, and federal police attempted to question her about the shootout on the New Jersey Turnpike that had claimed the life of a white state trooper. Long a target of J. Edgar Hoover's campaign to defame, infiltrate, and criminalize Blac", "On May 2, 1973, Black Panther Assata Shakur (aka JoAnne Chesimard) lay in a hospital, close to death, handcuffed to her bed, while local, state, and federal police attempted to question her about the shootout on the New Jersey Turnpike that had claimed the life of a white state trooper. Long a target of J. Edgar Hoover's campaign to defame, infiltrate, and criminalize Black nationalist organizations and their leaders, Shakur was incarcerated for four years prior to her conviction on flimsy evidence in 1977 as an accomplice to murder.", "This intensely personal and political autobiography belies the fearsome image of JoAnne Chesimard long projected by the media and the state. With wit and candor, Assata Shakur recounts the experiences that led her to a life of activism and portrays the strengths, weaknesses, and eventual demise of Black and White revolutionary groups at the hand of government officials. The result is a signal contribution to the literature about growing up Black in America that has already taken its place alongside ", " and the works of Maya Angelou.", "Two years after her conviction, Assata Shakur escaped from prison. She was given political asylum by Cuba, where she now resides."], "author": "Assata Shakur", "num_pages": "274", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-11-01 00:00:00", "ISBN": "1556520743"},
{"url": "https://www.goodreads.com/book/show/17143.Go_Tell_It_on_the_Mountain", "num_ratings": "34,835", "num_reviews": "1,784", "avg_ratings": 4.01, "genres": ["Fiction", "Cultural", "African American", "Classics", "Religion", "Novels"], "title": "Go Tell It on the Mountain", "description": [", first published in 1953, is Baldwin's first major work, a semi-autobiographical novel that has established itself as an American classic. With lyrical precision, psychological directness, resonating symbolic power, and a rage that is at once unrelenting and compassionate, Baldwin chronicles a fourteen-year-old boy's discovery of the terms of his", ", first published in 1953, is Baldwin's first major work, a semi-autobiographical novel that has established itself as an American classic. With lyrical precision, psychological directness, resonating symbolic power, and a rage that is at once unrelenting and compassionate, Baldwin chronicles a fourteen-year-old boy's discovery of the terms of his identity as the stepson of the minister of a storefront Pentecostal church in Harlem one Saturday in March of 1935. Baldwin's rendering of his protagonist's spiritual, sexual, and moral struggle of self-invention opened new possibilities in the American language and in the way Americans understand themselves."], "author": "James Baldwin", "num_pages": "256", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2001-08-16 00:00:00", "ISBN": "0141185910"},
{"url": "https://www.goodreads.com/book/show/16169867-buck", "num_ratings": "1,551", "num_reviews": "242", "avg_ratings": 4.2, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Cultural", "African American"], "title": "Buck: A Memoir", "description": ["  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But t", "  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But things fell apart, and a decade later MK was in America, a teenager lost in a fog of drugs, sex, and violence on the streets of North Philadelphia. Now he was alone—his mother in a mental hospital, his father gone, his older brother locked up in a prison on the other side of the country—and forced to find his own way to survive physically, mentally, and spiritually, by any means necessary.", " is a powerful memoir of how a precocious kid educated himself through the most unconventional teachers—outlaws and eccentrics, rappers and mystic strangers, ghetto philosophers and strippers, and, eventually, an alternative school that transformed his life with a single blank sheet of paper. It’s a one-of-a-kind story about finding your purpose in life, and an inspiring tribute to the power of education, art, and love to heal and redeem us."], "author": "M.K. Asante", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "0812993411"},
{"url": "https://www.goodreads.com/book/show/9313297-the-coldest-winter-ever", "num_ratings": "27,371", "num_reviews": "2,052", "avg_ratings": 4.48, "genres": ["Fiction", "Cultural", "African American", "Urban"], "title": "The Coldest Winter Ever", "description": ["In a stunning first novel, renowned hip-hop artist, writer, and activist Sister Souljah brings the streets of New York to life with a powerful and utterly unforgettable tale. ", "Ghetto-born, Winter is the young, wealthy daughter of a prominent Brooklyn drug-dealing family. Quick-witted, sexy, businessminded, and fashionable, Winter knows no restrictions. No one can control he", "In a stunning first novel, renowned hip-hop artist, writer, and activist Sister Souljah brings the streets of New York to life with a powerful and utterly unforgettable tale. ", "Ghetto-born, Winter is the young, wealthy daughter of a prominent Brooklyn drug-dealing family. Quick-witted, sexy, businessminded, and fashionable, Winter knows no restrictions. No one can control her. She's nobody's victim. And her Pops lets her know she deserves the best.", "Winter knows the Brooklyn streets like she knows the curves of her own body. She maneuvers skillfully, applying all she has learned to come out on top, no matter how dramatically the scenes change. But a cold Winter wind is about to blow her life in a direction she could never have expected. ", "Unwilling to give up her ghetto celebrity status, her friends and her lovers, Winter sets off on a series of wild adventures to reclaim her role as princess of the alleyways. But when her schemes begin to unravel, Winter is on her own, figuring out a whole new way to survive. ", "The Coldest Winter Ever marks the debut of a gifted storyteller. Sister Souljah explores a young urban woman's innermost state of mind in a voice as bold as it is bracingly honest. Provocative and thoroughly entertaining, this is a daring novel of passion, loss, courage - and of the sometimes terrible tolls exacted from us just to stay alive. You will never forget this Winter's tale."], "author": "Sister Souljah", "num_pages": "365", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/60925.Fledgling", "num_ratings": "15,020", "num_reviews": "2,109", "avg_ratings": 3.89, "genres": ["Fantasy", "Fiction", "Paranormal", "Vampires", "Science Fiction", "Horror", "Fantasy", "Paranormal", "Science Fiction Fantasy", "Speculative Fiction", "Fantasy", "Supernatural", "Fantasy", "Urban Fantasy"], "title": "Fledgling", "description": [", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wa", ", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wants - to destroy her and those she cares for and how she can save herself. ", " is a captivating novel that tests the limits of \"otherness\" and questions what it means to be truly human."], "author": "Octavia E. Butler", "num_pages": "320", "awards": ["Endeavour Award Nominee (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-02 00:00:00", "ISBN": "0446696161"},
{"url": "https://www.goodreads.com/book/show/29826.Child_of_God", "num_ratings": "1,394", "num_reviews": "112", "avg_ratings": 4.29, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Cultural"], "title": "Child of God", "description": ["In this searing novel, bestselling author Lolita Files tells the tale of a Southern family torn apart by the secrets it struggles to keep.", "Everybody knows everybody else's business in Downtown, Tennessee. Neighbors while away afternoons at the local bar, swapping rumors about voodoo, incest, and illegitimate children. Usually they're gossiping about the Botens. ", "In this epic", "In this searing novel, bestselling author Lolita Files tells the tale of a Southern family torn apart by the secrets it struggles to keep.", "Everybody knows everybody else's business in Downtown, Tennessee. Neighbors while away afternoons at the local bar, swapping rumors about voodoo, incest, and illegitimate children. Usually they're gossiping about the Botens. ", "In this epic saga, Lolita Files unveils the hidden lives of three generations of the Boten clan, a family as cursed by fate as they are blessed with hope. There's Grandma Amalie, who's willing to sacrifice everything for her son; there's Grace, who manages to conceal the identity of her child's father for more than twenty years; there's Aunt Sukie, whose strange power over her husband, Walter, is matched only by the strength of her dark magic; and, finally, there's Lay, whose secret betrayals will set the Boten clan in motion, sending its members on a quest for self-discovery that will lead them from one end of the world to the other.", "From the drug-infested world of inner-city Detroit to the jungles of Vietnam, Lolita Files deftly captures one family's struggle to drag demons out into the light in this compelling story of the bonds of blood, forbidden love, sacrifice and redemption."], "author": "Lolita Files", "num_pages": "369", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-07-01 00:00:00", "ISBN": "0743278798"},
{"url": "https://www.goodreads.com/book/show/89137.Family", "num_ratings": "2,007", "num_reviews": "144", "avg_ratings": 4.4, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Family"], "title": "Family", "description": ["In this wise, beguiling, beautiful novel set in the era of the Civil War, an award-winning playwright and author paints a haunting portrait of a woman named Always, born a slave, and four generations of her African-American family."], "author": "J. California Cooper", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-12-01 00:00:00", "ISBN": "0385411723"},
{"url": "https://www.goodreads.com/book/show/64383.Gone_Fishin_", "num_ratings": "2,144", "num_reviews": "115", "avg_ratings": 3.9, "genres": ["Mystery", "Fiction", "Cultural", "African American", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Gone Fishin'", "description": ["In the beginning...there was Ezekiel \"Easy\" Rawlins and Raymond \"Mouse\" Alexander -- two young men setting out in life, hitting the road in a \"borrowed\" '36 Ford headed for Pariah, Texas. The volatile Mouse wants to retrieve money from his stepfather so he can marry his EttaMae. But on their steamy bayou excursion, Mouse will choose murder as a way out, while Easy's past l", "In the beginning...there was Ezekiel \"Easy\" Rawlins and Raymond \"Mouse\" Alexander -- two young men setting out in life, hitting the road in a \"borrowed\" '36 Ford headed for Pariah, Texas. The volatile Mouse wants to retrieve money from his stepfather so he can marry his EttaMae. But on their steamy bayou excursion, Mouse will choose murder as a way out, while Easy's past liaison with EttaMae floats precariously in his memory. Easy and Mouse are coming of age -- and everything they ever knew about friendship and about themselves is coming apart at the seams...."], "author": "Walter Mosley", "num_pages": "208", "awards": [], "places": [], "character_names": ["Raymond \"Mouse\" Alexander", "Ezekiel \"Easy\" Rawlins", "EttaMae Harris"], "language": "English", "publish_date": "2002-09-17 00:00:00", "ISBN": "0743451759"},
{"url": "https://www.goodreads.com/book/show/84555.Black_Betty", "num_ratings": "3,834", "num_reviews": "152", "avg_ratings": 4.06, "genres": ["Fiction", "Mystery", "Crime", "Mystery", "Cultural", "African American", "Thriller", "Mystery Thriller"], "title": "Black Betty", "description": [" For most black Americans, these were times of hope. For former P.I. Easy Rawlins, Los Angeles's mean streets were never meaner...or more deadly. Ordinarily, Easy would have thrown the two bills in the sleazy shamus' face -- the white man who wanted him to find the notorious Black Betty, an ebony siren whose talent for all things rich and male took her from Houston's", " For most black Americans, these were times of hope. For former P.I. Easy Rawlins, Los Angeles's mean streets were never meaner...or more deadly. Ordinarily, Easy would have thrown the two bills in the sleazy shamus' face -- the white man who wanted him to find the notorious Black Betty, an ebony siren whose talent for all things rich and male took her from Houston's Fifth Ward to Beverly Hills. There was too much Easy wasn't being told, but he couldn't resist the prospect of seeing Betty again, even if it killed him...."], "author": "Walter Mosley", "num_pages": "368", "awards": ["Anthony Award Nominee for Best Novel (1995)"], "places": [], "character_names": ["Ezekiel \"Easy\" Rawlins"], "language": "English", "publish_date": "2002-11-01 00:00:00", "ISBN": "0743451783"},
{"url": "https://www.goodreads.com/book/show/75162.Soul_on_Ice", "num_ratings": "11,261", "num_reviews": "286", "avg_ratings": 3.96, "genres": ["Nonfiction", "Biography", "History", "Autobiography", "Memoir", "Cultural", "African American", "Politics", "Biography", "Autobiography"], "title": "Soul on Ice", "description": ["The now-classic memoir that shocked, outraged, and ultimately changed the way America looked at the civil rights movement and the black experience.", "By turns shocking and lyrical, unblinking and raw, the searingly honest memoirs of Eldridge Cleaver are a testament to his unique place in American history. Cleaver writes in ", ", \"I'm perfectly aware that I'm in prison,", "The now-classic memoir that shocked, outraged, and ultimately changed the way America looked at the civil rights movement and the black experience.", "By turns shocking and lyrical, unblinking and raw, the searingly honest memoirs of Eldridge Cleaver are a testament to his unique place in American history. Cleaver writes in ", ", \"I'm perfectly aware that I'm in prison, that I'm a Negro, that I've been a rapist, and that I have a Higher Uneducation.\" What Cleaver shows us, on the pages of this now classic autobiography, is how much he was a man."], "author": "Eldridge Cleaver", "num_pages": "242", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1999-01-12 00:00:00", "ISBN": "038533379X"},
{"url": "https://www.goodreads.com/book/show/3002300-chains", "num_ratings": "39,414", "num_reviews": "4,691", "avg_ratings": 4.09, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Childrens", "Middle Grade"], "title": "Chains", "description": ["As the Revolutionary War begins, thirteen-year-old Isabel wages her own fight...for freedom. Promised freedom upon the death of their owner, she and her sister, Ruth, in a cruel twist of fate become the property of a malicious New York City couple, the Locktons, who have no sympathy for the American Revolution and even less for Ruth and Isabel. When Isabel meets Curzon, a", "As the Revolutionary War begins, thirteen-year-old Isabel wages her own fight...for freedom. Promised freedom upon the death of their owner, she and her sister, Ruth, in a cruel twist of fate become the property of a malicious New York City couple, the Locktons, who have no sympathy for the American Revolution and even less for Ruth and Isabel. When Isabel meets Curzon, a slave with ties to the Patriots, he encourages her to spy on her owners, who know details of British plans for invasion. She is reluctant at first, but when the unthinkable happens to Ruth, Isabel realizes her loyalty is available to the bidder who can provide her with freedom. ", "  Format: Hardcover \n   Publication Date: 10/21/2008 \n   Pages: 320 \n   Reading Level: Age 10 and Up \n "], "author": "Laurie Halse Anderson", "num_pages": "316", "awards": ["Scott O'Dell Award (2009)", "South Carolina Book Award Nominee for Junior Book Award (2011)", "Missouri Truman Readers Award Nominee (2011)", "Cybils Award for Middle Grade Fiction (2009)", "National Book Award Finalist for Young People's Literature (2008)", "Carnegie Medal Nominee (2010)", "Rebecca Caudill Young Readers' Book Award Nominee (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-10-21 00:00:00", "ISBN": "1416905855"},
{"url": "https://www.goodreads.com/book/show/84549.A_Little_Yellow_Dog", "num_ratings": "3,165", "num_reviews": "126", "avg_ratings": 4.04, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Cultural", "African American", "Thriller", "Mystery Thriller", "Mystery", "Detective"], "title": "A Little Yellow Dog", "description": ["November 1963: Easy's settled into a steady gig as a school custodian. It's a quiet, simple existence -- but a few moments of ecstasy with a sexy teacher will change all that. When the lady vanishes, Easy's stuck with a couple of corpses, the cops on his back, and a little yellow dog who's nobody's best friend. With his not-so-simple past snapping at his heels, and with en", "November 1963: Easy's settled into a steady gig as a school custodian. It's a quiet, simple existence -- but a few moments of ecstasy with a sexy teacher will change all that. When the lady vanishes, Easy's stuck with a couple of corpses, the cops on his back, and a little yellow dog who's nobody's best friend. With his not-so-simple past snapping at his heels, and with enemies old and new looking to get even, Easy must kiss his careful little life good-bye -- and step closer to the edge...."], "author": "Walter Mosley", "num_pages": "384", "awards": [], "places": [], "character_names": ["Raymond \"Mouse\" Alexander", "Ezekiel \"Easy\" Rawlins"], "language": "English", "publish_date": "2002-11-01 00:00:00", "ISBN": "0743451805"},
{"url": "https://www.goodreads.com/book/show/6792458-the-new-jim-crow", "num_ratings": "35,239", "num_reviews": "4,276", "avg_ratings": 4.51, "genres": ["Nonfiction", "Politics", "History", "Race", "Social Movements", "Social Justice", "Sociology"], "title": "The New Jim Crow: Mass Incarceration in the Age of Colorblindness", "description": ["\"Jarvious Cotton's great-great-grandfather could not vote as a slave. His great-grandfather was beaten to death by the Klu Klux Klan for attempting to vote. His grandfather was prevented from voting by Klan intimidation; his father was barred by poll taxes and literacy tests. Today, Cotton cannot vote because he, like many black men in the United States, has been labeled a", "\"Jarvious Cotton's great-great-grandfather could not vote as a slave. His great-grandfather was beaten to death by the Klu Klux Klan for attempting to vote. His grandfather was prevented from voting by Klan intimidation; his father was barred by poll taxes and literacy tests. Today, Cotton cannot vote because he, like many black men in the United States, has been labeled a felon and is currently on parole.\"", "As the United States celebrates the nation's \"triumph over race\" with the election of Barack Obama, the majority of young black men in major American cities are locked behind bars or have been labeled felons for life. Although Jim Crow laws have been wiped off the books, an astounding percentage of the African American community remains trapped in a subordinate status--much like their grandparents before them.", "In this incisive critique, former litigator-turned-legal-scholar Michelle Alexander provocatively argues that we have not ended racial caste in America: we have simply redesigned it. Alexander shows that, by targeting black men and decimating communities of color, the U.S. criminal justice system functions as a contemporary system of racial control, even as it formally adheres to the principle of color blindness. The New Jim Crow challenges the civil rights community--and all of us--to place mass incarceration at the forefront of a new movement for racial justice in America."], "author": "Michelle Alexander", "num_pages": "290", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-05 00:00:00", "ISBN": "1595581030"},
{"url": "https://www.goodreads.com/book/show/6837103-the-kitchen-house", "num_ratings": "198,615", "num_reviews": "16,831", "avg_ratings": 4.18, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Book Club"], "title": "The Kitchen House", "description": ["When a white servant girl violates the order of plantation society, she unleashes a tragedy that exposes the worst and best in the people she has come to call her family. Orphaned while onboard ship from Ireland, seven-year-old Lavinia arrives on the steps of a tobacco plantation where she is to live and work with the slaves of the kitchen house. Under the care of Belle, t", "When a white servant girl violates the order of plantation society, she unleashes a tragedy that exposes the worst and best in the people she has come to call her family. Orphaned while onboard ship from Ireland, seven-year-old Lavinia arrives on the steps of a tobacco plantation where she is to live and work with the slaves of the kitchen house. Under the care of Belle, the master's illegitimate daughter, Lavinia becomes deeply bonded to her adopted family, though she is set apart from them by her white skin. ", "Eventually, Lavinia is accepted into the world of the big house, where the master is absent and the mistress battles opium addiction. Lavinia finds herself perilously straddling two very different worlds. When she is forced to make a choice, loyalties are brought into question, dangerous truths are laid bare, and lives are put at risk."], "author": "Kathleen Grissom", "num_pages": "369", "awards": ["Goodreads Choice Award Nominee for Historical Fiction, Debut Author (2010)"], "places": ["Virginia"], "character_names": ["Ben", "Marshall", "Belle", "Captain Pyke", "Miss Martha", "Lavinia McCarten", "Mama Mae", "Papa George", "Uncle Jacob", "Sukey", "Campbell", "Fanny", "Beattie", "Dory", "Overseer Rankin", "Sally Pyke"], "language": "English", "publish_date": "2010-02-02 00:00:00", "ISBN": "1439153663"},
{"url": "https://www.goodreads.com/book/show/44826.The_Price_of_the_Ticket", "num_ratings": "388", "num_reviews": "28", "avg_ratings": 4.7, "genres": ["Writing", "Essays", "Nonfiction", "Cultural", "African American", "Race", "History"], "title": "The Price of the Ticket: Collected Nonfiction, 1948-1985", "description": ["The works of James Baldwin constitute one of the major contributions to American literature in the twentieth century, and nowhere is this more evident than in ", ", a compendium of nearly fifty years of Baldwin's powerful nonfiction writing. ", "With truth and insight, these personal, prophetic works speak to the heart of the experience of race and identity", "The works of James Baldwin constitute one of the major contributions to American literature in the twentieth century, and nowhere is this more evident than in ", ", a compendium of nearly fifty years of Baldwin's powerful nonfiction writing. ", "With truth and insight, these personal, prophetic works speak to the heart of the experience of race and identity in the United States. Here are the full texts of ", "and ", "along with dozens of other pieces, ranging from a 1948 review of ", " to a magnificent introduction to this book that, as so many of Mr. Baldwin's works do, combines his intensely private experience with the deepest examination of social interaction between the races. ", "In a way, ", "is an intellectual history of the twentieth-century American experience; in another, it is autobiography of the highest order."], "author": "James Baldwin", "num_pages": "712", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-09-15 00:00:00", "ISBN": "0312643063"},
{"url": "https://www.goodreads.com/book/show/539282.Fences", "num_ratings": "14,520", "num_reviews": "996", "avg_ratings": 3.85, "genres": ["Plays", "Drama", "Classics", "Academic", "School", "Fiction", "Academic", "Read For School"], "title": "Fences", "description": ["Soon to be a Major Motion Picture directed by Denzel Washington, and starring Denzel Washington and Viola Davis", "Winner of the Pulitzer Prize for Drama and the Tony Award for Best Play ", "From August Wilson, author of ", " and the 1984-85 Broadway season's best play, ", ", is another powerful, stunning dramatic work that has won him numerous crit", "Soon to be a Major Motion Picture directed by Denzel Washington, and starring Denzel Washington and Viola Davis", "Winner of the Pulitzer Prize for Drama and the Tony Award for Best Play ", "From August Wilson, author of ", " and the 1984-85 Broadway season's best play, ", ", is another powerful, stunning dramatic work that has won him numerous critical acclaim including the 1987 Tony Award for Best Play and the Pulitzer Prize. The protagonist of ", " (part of Wilson's ten-part Pittsburgh Cycle plays), Troy Maxson, is a strong man, a hard man. He has had to be to survive. Troy Maxson has gone through life in an America where to be proud and black is to face pressures that could crush a man, body and soul. But the 1950s are yielding to the new spirit of liberation in the 1960s, a spirit that is changing the world Troy Maxson has learned to deal with the only way he can, a spirit that is making him a stranger, angry and afraid, in a world he never knew and to a wife and son he understands less and less."], "author": "August Wilson", "num_pages": "101", "awards": ["Pulitzer Prize for Drama (1987)", "New York Drama Critics' Circle Award for Best Play (1987)"], "places": [], "character_names": [], "language": "English", "publish_date": "1986-06-01 00:00:00", "ISBN": "0452264014"},
{"url": "https://www.goodreads.com/book/show/114192.Medical_Apartheid", "num_ratings": "2,773", "num_reviews": "245", "avg_ratings": 4.24, "genres": ["History", "Nonfiction", "Science", "Race", "Health", "Medicine", "Medical", "Social Movements", "Social Justice"], "title": "Medical Apartheid: The Dark History of Medical Experimentation on Black Americans from Colonial Times to the Present", "description": ["From the era of slavery to the present day, the first full history of black America’s shocking mistreatment as unwilling and unwitting experimental subjects at the hands of the medical establishment.", " is the first and only comprehensive history of medical experimentation on African Americans. Starting with the earliest encounters between black Americans an", "From the era of slavery to the present day, the first full history of black America’s shocking mistreatment as unwilling and unwitting experimental subjects at the hands of the medical establishment.", " is the first and only comprehensive history of medical experimentation on African Americans. Starting with the earliest encounters between black Americans and Western medical researchers and the racist pseudoscience that resulted, it details the ways both slaves and freedmen were used in hospitals for experiments conducted without their knowledge—a tradition that continues today within some black populations. It reveals how blacks have historically been prey to grave-robbing as well as unauthorized autopsies and dissections. Moving into the twentieth century, it shows how the pseudoscience of eugenics and social Darwinism was used to justify experimental exploitation and shoddy medical treatment of blacks, and the view that they were biologically inferior, oversexed, and unfit for adult responsibilities. Shocking new details about the government’s notorious Tuskegee experiment are revealed, as are similar, less-well-known medical atrocities conducted by the government, the armed forces, prisons, and private institutions.", "The product of years of prodigious research into medical journals and experimental reports long undisturbed, ", " reveals the hidden underbelly of scientific research and makes possible, for the first time, an understanding of the roots of the African American health deficit. At last, it provides the fullest possible context for comprehending the behavioral fallout that has caused black Americans to view researchers—and indeed the whole medical establishment—with such deep distrust. No one concerned with issues of public health and racial justice can afford not to read ", ", a masterful book that will stir up both controversy and long-needed debate."], "author": "Harriet A. Washington", "num_pages": "501", "awards": ["Gustavus Myers Outstanding Book Award (2008)", "National Book Critics Circle Award for General Nonfiction (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-09 00:00:00", "ISBN": "0385509936"},
{"url": "https://www.goodreads.com/book/show/355862.Erasure", "num_ratings": "2,749", "num_reviews": "291", "avg_ratings": 4.16, "genres": ["Fiction", "Cultural", "African American", "Race", "Humor", "Novels", "Literature"], "title": "Erasure", "description": ["\"Thelonious (Monk) Ellison has never allowed race to define his identity. But as both a writer and an African American, he is offended and angered by the success of We's Lives in Da Ghetto, the exploitative debut novel of a young, middle-class black woman who once visited \"some relatives in Harlem for a couple of days.\" Hailed as an authentic representation of the African", "\"Thelonious (Monk) Ellison has never allowed race to define his identity. But as both a writer and an African American, he is offended and angered by the success of We's Lives in Da Ghetto, the exploitative debut novel of a young, middle-class black woman who once visited \"some relatives in Harlem for a couple of days.\" Hailed as an authentic representation of the African American experience, the book is a national bestseller and its author feted on the Kenya Dunston television show. The book's success rankles all the more as Monk's own most recent novel has just notched its seventh rejection.\" \"Even as his career as a writer appears to have stalled, Monk finds himself coping with changes in his personal life. In need of distraction from old memories, new responsibilities, and his professional stagnation, Monk composes, in a heat of inspiration and energy, a fierce parody of the sort of exploitative, ghetto wanna-be lit represented by We's Lives in Da Ghetto.\" But when his agent sends this literary indictment (included here in its entirety) out to publishers, it is greeted as an authentic new voice of black America. Monk - or his pseudonymous alter ego, Stagg R. Leigh - is offered money, fame, success beyond anything he has known. And as demand begins to build for meetings with and appearances by Leigh, Monk is faced with a whole new set of problems."], "author": "Percival Everett", "num_pages": "280", "awards": ["Hurston/Wright Legacy Award for Fiction (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-02 00:00:00", "ISBN": "0786888156"},
{"url": "https://www.goodreads.com/book/show/19205885-americanah", "num_ratings": "169,678", "num_reviews": "16,440", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Feminism", "Literary Fiction"], "title": "Americanah", "description": ["A searing new novel, at once sweeping and intimate, by the award-winning author of ", ": a story of love and race centered around a man and woman from Nigeria who seemed destined to be together--until the choices they are forced to make tear them apart. ", "Ifemelu--beautiful, self-assured--left Nigeria 15 years ago, and now studies in Princeton as a Graduate F", "A searing new novel, at once sweeping and intimate, by the award-winning author of ", ": a story of love and race centered around a man and woman from Nigeria who seemed destined to be together--until the choices they are forced to make tear them apart. ", "Ifemelu--beautiful, self-assured--left Nigeria 15 years ago, and now studies in Princeton as a Graduate Fellow. She seems to have fulfilled every immigrant's dream: Ivy League education; success as a writer of a wildly popular political blog; money for the things she needs. But what came before is more like a nightmare: wrenching departure from family; humiliating jobs under a false name. She feels for the first time the weight of something she didn't think about back home: race.", "Obinze--handsome and kind-hearted--was Ifemelu's teenage love; he'd hoped to join her in America, but post 9/11 America wouldn't let him in. Obinze's journey leads him to back alleys of illegal employment in London; to a fake marriage for the sake of a work card, and finally, to a set of handcuffs as he is exposed and deported. ", "Years later, when they reunite in Nigeria, neither is the same person who left home. Obinze is the kind of successful \"Big Man\" he'd scorned in his youth, and Ifemelu has become an \"Americanah\"--a different version of her former self, one with a new accent and attitude. As they revisit their shared passion--for their homeland and for each other--they must face the largest challenges of their lives. ", "Spanning three continents, entering the lives of a richly drawn cast of characters across numerous divides, ", " is a riveting story of love and expectation set in today's globalized world."], "author": "Chimamanda Ngozi Adichie", "num_pages": "496", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/122212.Waiting_to_Exhale", "num_ratings": "12,950", "num_reviews": "431", "avg_ratings": 3.95, "genres": ["Fiction", "Cultural", "African American", "Womens Fiction", "Chick Lit", "Romance"], "title": "Waiting to Exhale", "description": ["The story of friendship between four African American women who lean on each other while \"waiting to exhale\": waiting for that man who will take their breath away."], "author": "Terry McMillan", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-03 00:00:00", "ISBN": "0451217454"},
{"url": "https://www.goodreads.com/book/show/166892.To_Be_Young_Gifted_and_Black", "num_ratings": "2,190", "num_reviews": "64", "avg_ratings": 4.4, "genres": ["Biography", "Nonfiction", "Autobiography", "Memoir", "Cultural", "African American", "Biography", "Autobiography"], "title": "To Be Young, Gifted and Black", "description": ["In her first play, the now-classic A Raisin in the Sun, Hansberry introduced the lives of ordinary African Americans into our national theatrical repertory. Now, Hansberry tells her own life story in an autobiography that rings with the voice of its creator. \"Brilliantly alive.\"--The New York Times."], "author": "Lorraine Hansberry", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-01-03 00:00:00", "ISBN": "0679764151"},
{"url": "https://www.goodreads.com/book/show/9742.The_Audacity_of_Hope", "num_ratings": "120,985", "num_reviews": "4,717", "avg_ratings": 3.71, "genres": ["Nonfiction", "Politics", "Biography", "Autobiography", "Memoir", "Biography", "Autobiography"], "title": "The Audacity of Hope: Thoughts on Reclaiming the American Dream", "description": [" is Barack Obama's call for a new kind of politics—a politics that builds upon those shared understandings that pull us together as Americans. Lucid in his vision of America's place in the world, refreshingly candid about his family life and his time in the Senate, Obama here sets out his political convictions and inspires us to trust in the dogged opti", " is Barack Obama's call for a new kind of politics—a politics that builds upon those shared understandings that pull us together as Americans. Lucid in his vision of America's place in the world, refreshingly candid about his family life and his time in the Senate, Obama here sets out his political convictions and inspires us to trust in the dogged optimism that has long defined us and that is our best hope going forward."], "author": "Barack Obama", "num_pages": "375", "awards": ["Grammy Award for Best Spoken Word Album (2008)"], "places": [], "character_names": ["Barack Obama"], "language": "English", "publish_date": "2006-10-17 00:00:00", "ISBN": "0307237699"},
{"url": "https://www.goodreads.com/book/show/7082121-a-mercy", "num_ratings": "17,359", "num_reviews": "2,414", "avg_ratings": 3.67, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Historical"], "title": "A Mercy", "description": ["A powerful tragedy distilled into a jewel of a masterpiece by the Nobel Prize--winning author of \"Beloved\" and, almost like a prelude to that story, set two centuries earlier.", "In the 1680s the slave trade was still in its infancy. In the Americas, virulent religious and class divisions, prejudice and oppression were rife, providing the fertile soil in which slavery and race", "A powerful tragedy distilled into a jewel of a masterpiece by the Nobel Prize--winning author of \"Beloved\" and, almost like a prelude to that story, set two centuries earlier.", "In the 1680s the slave trade was still in its infancy. In the Americas, virulent religious and class divisions, prejudice and oppression were rife, providing the fertile soil in which slavery and race hatred were planted and took root.", "Jacob is an Anglo-Dutch trader and adventurer, with a small holding in the harsh north. Despite his distaste for dealing in \"flesh,\" he takes a small slave girl in part payment for a bad debt from a plantation owner in Catholic Maryland. This is Florens, \"with the hands of a slave and the feet of a Portuguese lady.\" Florens looks for love, first from Lina, an older servant woman at her new master's house, but later from a handsome blacksmith, an African, never enslaved.", "There are other voices: Lina, whose tribe was decimated by smallpox; their mistress, Rebekka, herself a victim of religious intolerance back in England; Sorrow, a strange girl who's spent her early years at sea; and finally the devastating voice of Florens' mother. These are all men and women inventing themselves in the wilderness. ", "A Mercy reveals what lies beneath the surface of slavery. But at its heart it is the ambivalent, disturbing story of a mother who casts off her daughter in order to save her, and of a daughter who may never exorcise that abandonment.", "Acts of mercy may have unforeseen consequences."], "author": "Toni Morrison", "num_pages": "0", "awards": ["Orange Prize Nominee for Fiction Longlist (2009)", "James Tait Black Memorial Prize Nominee for Fiction (2008)", "The Rooster - The Morning News Tournament of Books (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-11-11 00:00:00", "ISBN": "1415956812"},
{"url": "https://www.goodreads.com/book/show/84031.I_Love_Myself_When_I_Am_Laughing_And_Then_Again", "num_ratings": "2,220", "num_reviews": "52", "avg_ratings": 4.42, "genres": ["Fiction", "Cultural", "African American", "Short Stories", "Feminism", "Writing", "Essays"], "title": "I Love Myself When I Am Laughing... And Then Again: A Zora Neale Hurston Reader", "description": ["The most prolific African-American woman author from 1920 to 1950, Hurston was praised for her writing and condemned for her independence, arrogance, and audaciousness. This unique anthology, with fourteen superb examples of her fiction, journalism, folklore, and autobiography, rightfully establishes her as the intellectual and spiritual leader of the next generation of bl", "The most prolific African-American woman author from 1920 to 1950, Hurston was praised for her writing and condemned for her independence, arrogance, and audaciousness. This unique anthology, with fourteen superb examples of her fiction, journalism, folklore, and autobiography, rightfully establishes her as the intellectual and spiritual leader of the next generation of black writers. The original commentary by Alice Walker and Mary Helen Washington, two African-American writers in the forefront of the Hurston revival, provide illuminating insights into Hurston—the writer, and the person—as well as into American social and cultural history."], "author": "Zora Neale Hurston", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-01-01 00:00:00", "ISBN": "0912670665"},
{"url": "https://www.goodreads.com/book/show/769534.The_Best_of_Simple", "num_ratings": "1,119", "num_reviews": "59", "avg_ratings": 4.39, "genres": ["Short Stories", "Fiction", "Classics", "Cultural", "African American", "Poetry", "Humor"], "title": "The Best of Simple", "description": ["Langston Hughes's stories about Jesse B. Semple--first composed for a weekly column in the Chicago ", " and then collected in ", ", ", ", and ", "--have been read and loved by hundreds of thousands of readers. In ", ", the author picked his favorites from these earlier volumes, stories that not only have p", "Langston Hughes's stories about Jesse B. Semple--first composed for a weekly column in the Chicago ", " and then collected in ", ", ", ", and ", "--have been read and loved by hundreds of thousands of readers. In ", ", the author picked his favorites from these earlier volumes, stories that not only have proved popular but are now part of a great and growing literary tradition.", "Simple might be considered an Everyman for black Americans. Hughes himself wrote: \"...these tales are about a great many people--although they are stories about no specific persons as such. But it is impossible to live in Harlem and not know at least a hundred Simples, fifty Joyces, twenty-five Zaritas, and several Cousin Minnies--or reasonable facsimiles thereof.\"", "As Arnold Rampersad has written, Simple is \"one of the most memorable and winning characters in the annals of American literature, justly regarded as one of Hughes's most inspired creations.\"", "Langston Hughes was born in Joplin, Missouri, went to Cleveland, Ohio, lived for a number of years in Chicago, and long resided in New York City's Harlem. He graduated form Lincoln University in 1929 and was awarded an honorary Litt. D. in 1943. He was perhaps best known as a poet and the creator of Simple, but he also wrote novels, biography, history, plays (several of them Broadway hits), and children's books, and he edited several anthologies. Mr. Hughes died in 1967."], "author": "Langston Hughes", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-09-28 00:00:00", "ISBN": "0374521336"},
{"url": "https://www.goodreads.com/book/show/42547.The_Autobiography_of_Martin_Luther_King_Jr_", "num_ratings": "12,691", "num_reviews": "495", "avg_ratings": 4.33, "genres": ["Biography", "Nonfiction", "History", "Biography", "Autobiography", "Politics"], "title": "The Autobiography of Martin Luther King, Jr.", "description": ["Using Stanford University's voluminous collection of archival material, including previously unpublished writings, interviews, recordings, and correspondence, King scholar Clayborne Carson has constructed a remarkable first-person account of Dr. King's extraordinary life. Beginning with his boyhood, the book portrays King's education as a minister, his ascendancy as a lead", "Using Stanford University's voluminous collection of archival material, including previously unpublished writings, interviews, recordings, and correspondence, King scholar Clayborne Carson has constructed a remarkable first-person account of Dr. King's extraordinary life. Beginning with his boyhood, the book portrays King's education as a minister, his ascendancy as a leader of the Montgomery bus boycott, his pivotal role in the civil rights demonstrations in Washington, D.C., and his complex relationship with the Kennedy brothers, LBJ, Malcolm X, and numerous other leading figures of the day."], "author": "Martin Luther King Jr.", "num_pages": "400", "awards": ["Grammy Award for Best Spoken Word Album (2000)"], "places": [], "character_names": ["Martin Luther King Jr."], "language": "English", "publish_date": "2001-01-01 00:00:00", "ISBN": "0446676500"},
{"url": "https://www.goodreads.com/book/show/60926.Lilith_s_Brood", "num_ratings": "11,394", "num_reviews": "844", "avg_ratings": 4.32, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Lilith's Brood", "description": ["Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny", "Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny, unimaginably alien creatures: their own children. This is their story..."], "author": "Octavia E. Butler", "num_pages": "746", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-01 00:00:00", "ISBN": "0446676101"},
{"url": "https://www.goodreads.com/book/show/495369.Sugar", "num_ratings": "4,709", "num_reviews": "377", "avg_ratings": 4.28, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American"], "title": "Sugar", "description": ["\"Strong and folksy storytelling...think ", "...", " speaks of what is real.\" --", "From an exciting new voice in African-American contemporary fiction comes a novel ", " praised for its \"unforgettable images, unique characters, and moving story that keeps the pages turning until the end.\" ", " calls ", " \"a literary explo", "\"Strong and folksy storytelling...think ", "...", " speaks of what is real.\" --", "From an exciting new voice in African-American contemporary fiction comes a novel ", " praised for its \"unforgettable images, unique characters, and moving story that keeps the pages turning until the end.\" ", " calls ", " \"a literary explosion...McFadden reveals amazing talent.\" The novel opens when a young prostitute comes to Bigelow, Arkansas, to start over, far from her haunting past. Sugar moves next door to Pearl, who is still grieving for the daughter who was murdered fifteen years before. Over sweet-potato pie, an unlikely friendship begins, transforming both women's lives--and the life of an entire town.", "Sugar brings a Southern African-American town vividly to life, with its flowering magnolia trees, lingering scents of jasmine and honeysuckle, and white picket fences that keep strangers out--but ignorance and superstition in. To read this novel is to take a journey through loss and suffering to a place of forgiveness, understanding, and grace.  McFadden is the author of the novels ", ", ", " and ", ". "], "author": "Bernice L. McFadden", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-01-02 00:00:00", "ISBN": "0452282209"},
{"url": "https://www.goodreads.com/book/show/53360.A_Testament_of_Hope", "num_ratings": "1,851", "num_reviews": "86", "avg_ratings": 4.53, "genres": ["Nonfiction", "History", "Politics", "Philosophy", "Writing", "Essays", "Social Movements", "Social Justice"], "title": "A Testament of Hope: The Essential Writings and Speeches", "author": "Martin Luther King Jr.", "num_pages": "702", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-04-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/765172.Cane", "num_ratings": "6,963", "num_reviews": "365", "avg_ratings": 3.89, "genres": ["Fiction", "Poetry", "Classics", "Short Stories", "Cultural", "African American"], "title": "Cane", "description": ["A literary masterpiece of the Harlem Renaissance, ", " is a powerful work of innovative fiction evoking black life in the South. The sketches, poems, and stories of black rural and urban life that make up ", " are rich in imagery. Visions of smoke, sugarcane, dusk, and flame permeate the Southern landscape: the Northern world is pictured as a harsher reality of asphalt str", "A literary masterpiece of the Harlem Renaissance, ", " is a powerful work of innovative fiction evoking black life in the South. The sketches, poems, and stories of black rural and urban life that make up ", " are rich in imagery. Visions of smoke, sugarcane, dusk, and flame permeate the Southern landscape: the Northern world is pictured as a harsher reality of asphalt streets. Impressionistic, sometimes surrealistic, the pieces are redolent of nature and Africa, with sensuous appeals to eye and ear."], "author": "Jean Toomer", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-17 00:00:00", "ISBN": "0871401517"},
{"url": "https://www.goodreads.com/book/show/289114.Manchild_in_the_Promised_Land", "num_ratings": "6,984", "num_reviews": "302", "avg_ratings": 4.34, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Cultural", "African American", "Biography", "Autobiography"], "title": "Manchild in the Promised Land", "description": ["Manchild in the Promised Land is indeed one of the most remarkable autobiographies of our time. This thinly fictionalized account of Claude Brown's childhood as a hardened, streetwise criminal trying to survive the toughest streets of Harlem has been heralded as the definitive account of everyday life for the first generation of African Americans raised in the Northern ghe", "Manchild in the Promised Land is indeed one of the most remarkable autobiographies of our time. This thinly fictionalized account of Claude Brown's childhood as a hardened, streetwise criminal trying to survive the toughest streets of Harlem has been heralded as the definitive account of everyday life for the first generation of African Americans raised in the Northern ghettos of the 1940s and 1950s. When the book was first published in 1965, it was praised for its realistic portrayal of Harlem -- the children, young people, hardworking parents; the hustlers, drug dealers, prostitutes, and numbers runners; the police; the violence, sex, and humor. The book continues to resonate generations later, not only because of its fierce and dignified anger, not only because the struggles of urban youth are as deeply felt today as they were in Brown's time, but also because the book is affirmative and inspiring. Here is the story about the one who \"made it,\" the boy who kept landing on his feet and became a man."], "author": "Claude Brown", "num_pages": "416", "awards": [], "places": ["New York (the state)"], "character_names": ["Danny", "Claude", "Butch"], "language": "English", "publish_date": "1999-06-03 00:00:00", "ISBN": "0684864185"},
{"url": "https://www.goodreads.com/book/show/60935.Possessing_the_Secret_of_Joy", "num_ratings": "13,257", "num_reviews": "518", "avg_ratings": 4.07, "genres": ["Fiction", "Feminism", "Cultural", "African American", "Cultural", "Africa"], "title": "Possessing the Secret of Joy", "description": [" is the story of Tashi, a tribal African woman who lives much of her adult life in North America. As a young woman, a misguided loyalty to the customs of her people led her to voluntarily submit to the tsunga's knife and be genitally mutilated (pharoanoically circumcised). Severely traumatized by this experience, she spends the rest of her life", " is the story of Tashi, a tribal African woman who lives much of her adult life in North America. As a young woman, a misguided loyalty to the customs of her people led her to voluntarily submit to the tsunga's knife and be genitally mutilated (pharoanoically circumcised). Severely traumatized by this experience, she spends the rest of her life battling madness, trying desperately through psychotherapy - she is treated by disciples of both Freud and C.G. Jung, and even by Jung himself - to regain the ability to recognize her own reality and to feel. It is only with the help of the most unlikely ally she can imagine that she begins to study the mythological \"reasons\" invented by her ancient ancestors for what was done to her and to millions of other women and girls over thousands of years. As her understanding grows, so does her capacity to encounter her overwhelming grief. Underneath this grief is her glowing anger. Anger propels her to act. Action brings both feeling - life, the ability to exist with awareness in the moment - and death, of which she finds she has completely lost her fear.", "While not a sequel to ", " or ", ", ", " follows the life of a barely-glimpsed character from those books. Combining fact and fiction, communing with the spirits of the living and the dead, Alice Walker in this novel strikes with graceful power at the heart of one of the most controversial issues of our time."], "author": "Alice Walker", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-12-02 00:00:00", "ISBN": "0671789457"},
{"url": "https://www.goodreads.com/book/show/38458.Nobody_Knows_My_Name", "num_ratings": "1,987", "num_reviews": "135", "avg_ratings": 4.33, "genres": ["Writing", "Essays", "Nonfiction", "Race", "Cultural", "African American", "Classics"], "title": "Nobody Knows My Name", "description": ["Told with Baldwin's characteristically unflinching honesty, this collection of illuminating, deeply felt essays examines topics ranging from race relations in the United States to the role of the writer in society, and offers personal accounts of Richard Wright, Norman Mailer and other writers."], "author": "James Baldwin", "num_pages": "242", "awards": ["National Book Award Finalist for Nonfiction (1962)"], "places": [], "character_names": [], "language": "English", "publish_date": "1992-12-01 00:00:00", "ISBN": "0679744738"},
{"url": "https://www.goodreads.com/book/show/331260.The_Darkest_Child", "num_ratings": "6,658", "num_reviews": "754", "avg_ratings": 4.36, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Race", "Historical"], "title": "The Darkest Child", "description": ["Bakersfield, Georgia, 1958: Thirteen-year-old Tangy Mae Quinn is the sixth of ten fatherless siblings. She is the darkest-skinned among them and therefore the ugliest in her mother, Rozelle's, estimation, but she's also the brightest. Rozelle--beautiful, charismatic, and light-skinned--exercises a violent hold over her children. Fearing abandonment, she pulls them from sch", "Bakersfield, Georgia, 1958: Thirteen-year-old Tangy Mae Quinn is the sixth of ten fatherless siblings. She is the darkest-skinned among them and therefore the ugliest in her mother, Rozelle's, estimation, but she's also the brightest. Rozelle--beautiful, charismatic, and light-skinned--exercises a violent hold over her children. Fearing abandonment, she pulls them from school at the age of twelve and sends them to earn their keep for the household, whether in domestic service, in the fields, or at \"the farmhouse\" on the edge of town, where Rozelle beds local men for money.", "But Tangy Mae has been selected to be part of the first integrated class at a nearby white high school. She has a chance to change her life, but can she break from Rozelle's grasp without ruinous--even fatal--consequences?"], "author": "Delores Phillips", "num_pages": "400", "awards": ["Hurston/Wright Legacy Award Nominee for Debut Fiction (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "1569473781"},
{"url": "https://www.goodreads.com/book/show/429931.Tumbling", "num_ratings": "2,899", "num_reviews": "105", "avg_ratings": 4.21, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American"], "title": "Tumbling", "description": ["Diane McKinney-Whetstone's lyrical first novel, ", ", vividly captures a tightly knit African-American neighborhood in South Philadelphia during the forties and fifties. Its central characters, Herbie and Noon, are a loving but unconventional couple whose marriage remains unconsummated for many years as Noon struggles to repossess her sexuality after a brutal attack in", "Diane McKinney-Whetstone's lyrical first novel, ", ", vividly captures a tightly knit African-American neighborhood in South Philadelphia during the forties and fifties. Its central characters, Herbie and Noon, are a loving but unconventional couple whose marriage remains unconsummated for many years as Noon struggles to repossess her sexuality after a brutal attack in her past. While she seeks salvation in the church, Herbie gains sexual gratification in the arms of a bewitching jazz singer named Ethel, a woman who profoundly affects both Noon's and Herbie's lives when she leaves with them, first, a baby girl and then later, a five-year-old named Liz. ", " When a road planned by the city council threatens to break up this South Philadelphia neighborhood, the community must band together. Unexpectedly, Noon rises up and takes the lead in the opposition, fighting for all she's worth to keep her family and community together. ", " is a beautifully rendered, poignant story about the ties that bind us and the secrets that keep us apart. With striking lyricism, Diane McKinney-Whetstone keenly guides us through the world of community, family, and the human heart."], "author": "Diane McKinney-Whetstone", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-04-09 00:00:00", "ISBN": "0684837242"},
{"url": "https://www.goodreads.com/book/show/6493208-the-immortal-life-of-henrietta-lacks", "num_ratings": "466,715", "num_reviews": "30,671", "avg_ratings": 4.05, "genres": ["Nonfiction", "Science", "Biography", "History", "Health", "Medicine"], "title": "The Immortal Life of Henrietta Lacks", "description": ["Her name was Henrietta Lacks, but scientists know her as HeLa. She was a poor Southern tobacco farmer who worked the same land as her slave ancestors, yet her cells—taken witho", "Her name was Henrietta Lacks, but scientists know her as HeLa. She was a poor Southern tobacco farmer who worked the same land as her slave ancestors, yet her cells—taken without her knowledge—became one of the most important tools in medicine. The first “immortal” human cells grown in culture, they are still alive today, though she has been dead for more than sixty years. If you could pile all HeLa cells ever grown onto a scale, they’d weigh more than 50 million metric tons—as much as a hundred Empire State Buildings. HeLa cells were vital for developing the polio vaccine; uncovered secrets of cancer, viruses, and the atom bomb’s effects; helped lead to important advances like in vitro fertilization, cloning, and gene mapping; and have been bought and sold by the billions."], "author": "Rebecca Skloot", "num_pages": "370", "awards": ["Ambassador Book Award for American Studies (2011)", "Audie Award for Nonfiction (2011)", "Chicago Tribune Heartland Prize for Nonfiction (2010)", "Wellcome Book Prize (2010)", "Puddly Award for Nonfiction (2011)", "Goodreads Choice Award for  Nonfiction and Debut Author, Nominee for Favorite Book, Favorite Heroine (2010)"], "places": ["Baltimore, Maryland", "Clover, Virginia"], "character_names": ["Henrietta Lacks"], "language": "English", "publish_date": "2010-02-02 00:00:00", "ISBN": "1400052173"},
{"url": "https://www.goodreads.com/book/show/764646.Parable_of_the_Talents", "num_ratings": "15,237", "num_reviews": "1,206", "avg_ratings": 4.23, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Fantasy"], "title": "Parable of the Talents", "description": ["A powerfully wrought novel describing an America permeated with violence, religious persecution, and the will to overcome such adversity, Octavia E. Butler's ", " explores the large and small social ramifications of a group of survivors banding together in faith to prevail against anarchy. Butler gives us a well-proportioned fusion of near-future struggle", "A powerfully wrought novel describing an America permeated with violence, religious persecution, and the will to overcome such adversity, Octavia E. Butler's ", " explores the large and small social ramifications of a group of survivors banding together in faith to prevail against anarchy. Butler gives us a well-proportioned fusion of near-future struggle and subtle science fiction, all layered upon an engaging groundwork of human courage, spiritual doctrine, enslavement, and savagery in an anarchistic America."], "author": "Octavia E. Butler", "num_pages": "424", "awards": ["Nebula Award for Best Novel (1999)", "James Tiptree Jr. Award Honor List (1998)"], "places": ["United States of America"], "character_names": ["Lauren Olamina"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0446675784"},
{"url": "https://www.goodreads.com/book/show/18478222-twelve-years-a-slave", "num_ratings": "73,924", "num_reviews": "5,379", "avg_ratings": 4.17, "genres": ["Nonfiction", "History", "Biography", "Classics", "Autobiography", "Memoir"], "title": "Twelve Years a Slave", "description": ["Twelve Years a Slave, sub-title: Narrative of Solomon Northup, citizen of New-York, kidnapped in Washington city in 1841, and rescued in 1853, from a cotton plantation near the Red River in Louisiana, is a memoir by Solomon Northup as told to and edited by David Wilson. It is a slave narrative of a black man who was born free in New York state but kidnapped in Washington,", "Twelve Years a Slave, sub-title: Narrative of Solomon Northup, citizen of New-York, kidnapped in Washington city in 1841, and rescued in 1853, from a cotton plantation near the Red River in Louisiana, is a memoir by Solomon Northup as told to and edited by David Wilson. It is a slave narrative of a black man who was born free in New York state but kidnapped in Washington, D.C., sold into slavery, and kept in bondage for 12 years in Louisiana. He provided details of slave markets in Washington, D.C. and New Orleans, as well as describing at length cotton and sugar cultivation on major plantations in Louisiana."], "author": "Solomon Northup", "num_pages": "363", "awards": [], "places": ["Louisiana"], "character_names": ["Solomon Northup"], "language": "English", "publish_date": "2013-08-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/125441.An_Autobiography", "num_ratings": "4,838", "num_reviews": "152", "avg_ratings": 4.36, "genres": ["Nonfiction", "Biography", "Feminism", "Autobiography", "Memoir", "Politics", "Race"], "title": "An Autobiography", "description": ["Her own powerful story to 1972, told with warmth, brilliance, humor & conviction. The author, a political activist, reflects upon the people & incidents that have influenced her life & commitment to global liberation of the oppressed."], "author": "Angela Y. Davis", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-03-01 00:00:00", "ISBN": "0717806677"},
{"url": "https://www.goodreads.com/book/show/203899.Letter_from_the_Birmingham_Jail", "num_ratings": "3,337", "num_reviews": "268", "avg_ratings": 4.66, "genres": ["Nonfiction", "History", "Politics", "Classics", "Writing", "Essays", "Philosophy"], "title": "Letter from the Birmingham Jail", "description": ["Martin Luther King, Jr. rarely had time to answer his critics. But on April 16, 1963, he was confined to the Birmingham jail, serving a sentence for participating in civil rights demonstrations. \"Alone for days in the dull monotony of a narrow jail cell,\" King pondered a letter that fellow clergymen had published urging him to drop his campaign of nonviolent resistance and", "Martin Luther King, Jr. rarely had time to answer his critics. But on April 16, 1963, he was confined to the Birmingham jail, serving a sentence for participating in civil rights demonstrations. \"Alone for days in the dull monotony of a narrow jail cell,\" King pondered a letter that fellow clergymen had published urging him to drop his campaign of nonviolent resistance and to leave the battle for racial equality to the courts. In response, King drafted his most extensive and forceful written statement against social injustice - a remarkable essay that focused the world's attention on Birmingham and spurred the famous March on Washington. Bristling with the energy and resonance of his great speeches, Letter from the Birmingham Jail is both a compelling defense of nonviolent demonstration and a rallying cry for an end to social discrimination that is just as powerful today as it was more than twenty years ago."], "author": "Martin Luther King Jr.", "num_pages": "35", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-08-01 00:00:00", "ISBN": "0062509551"},
{"url": "https://www.goodreads.com/book/show/58399.Dust_Tracks_on_a_Road", "num_ratings": "4,946", "num_reviews": "247", "avg_ratings": 4.11, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Cultural", "African American", "Classics", "Biography", "Autobiography"], "title": "Dust Tracks on a Road", "description": ["First published in 1942 at the height of her popularity, ", " is Zora Neale Hurston's candid, funny, bold and poignant autobiography, an imaginative and exuberant account of her rise from childhood poverty in the rural South to", "First published in 1942 at the height of her popularity, ", " is Zora Neale Hurston's candid, funny, bold and poignant autobiography, an imaginative and exuberant account of her rise from childhood poverty in the rural South to a prominent place among the leading artists and intellectuals of the Harlem Renaissance. As compelling as her acclaimed fiction, Hurston's very personal literary self-portrait offers a revealing, often audacious glimpse into the life–public and private–of an extraordinary artist, anthropologist, chronicler, and champion of the black experience in America. Full of the wit and wisdom of a proud, spirited woman who started off low and climbed hight, ", " is a rare treasure from one of literature's most cherished voices."], "author": "Zora Neale Hurston", "num_pages": "324", "awards": ["Anisfield-Wolf Book Award for Nonfiction (1943)"], "places": [], "character_names": [], "language": null, "publish_date": "2006-01-03 00:00:00", "ISBN": "0060854081"},
{"url": "https://www.goodreads.com/book/show/186926.The_Street", "num_ratings": "4,544", "num_reviews": "418", "avg_ratings": 4.16, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Race", "Novels"], "title": "The Street", "description": [" tells the poignant, often heartbreaking story of Lutie Johnson, a young black woman, and her spirited struggle to raise her son amid the violence, poverty, and racial dissonance of Harlem in the late 1940s. Originally published in 1946 and hailed by critics as a masterwork, ", " was Ann Petry's first novel, a beloved bestseller with more than a million cop", " tells the poignant, often heartbreaking story of Lutie Johnson, a young black woman, and her spirited struggle to raise her son amid the violence, poverty, and racial dissonance of Harlem in the late 1940s. Originally published in 1946 and hailed by critics as a masterwork, ", " was Ann Petry's first novel, a beloved bestseller with more than a million copies in print. Its haunting tale still resonates today."], "author": "Ann Petry", "num_pages": "448", "awards": ["Houghton Mifflin Literary Fellowship Award"], "places": [], "character_names": ["Jim Upton", "Lutie (main)", "Bub", "Pop", "Supe"], "language": "English", "publish_date": "1998-03-15 00:00:00", "ISBN": "0395901499"},
{"url": "https://www.goodreads.com/book/show/38474.Another_Country", "num_ratings": "10,766", "num_reviews": "937", "avg_ratings": 4.3, "genres": ["Fiction", "Classics", "Lgbt", "Cultural", "African American", "Glbt", "Queer"], "title": "Another Country", "description": ["Nominated as one of America’s best-loved novels by PBS’s The Great American Read", "Set in Greenwich Village, Harlem, and France, among other locales, Another Country is a novel of passions--sexual, racial, political, artistic--that is stunning for its emotional intensity and haunting sensuality, depicting men and women, blacks and whites, stripped of their masks of gender and", "Nominated as one of America’s best-loved novels by PBS’s The Great American Read", "Set in Greenwich Village, Harlem, and France, among other locales, Another Country is a novel of passions--sexual, racial, political, artistic--that is stunning for its emotional intensity and haunting sensuality, depicting men and women, blacks and whites, stripped of their masks of gender and race by love and hatred at the most elemental and sublime. In a small set of friends, Baldwin imbues the best and worst intentions of liberal America in the early 1970s."], "author": "James Baldwin", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-09-11 00:00:00", "ISBN": "0141186372"},
{"url": "https://www.goodreads.com/book/show/240009.The_Interesting_Narrative_of_the_Life_of_Olaudah_Equiano", "num_ratings": "9,065", "num_reviews": "341", "avg_ratings": 3.72, "genres": ["History", "Nonfiction", "Classics", "Biography", "Autobiography", "Memoir"], "title": "The Interesting Narrative of the Life of Olaudah Equiano: Written by Himself", "description": ["Widely admired for its vivid accounts of the slave trade, Olaudah Equiano's autobiography -- the first slave narrative to attract a significant readership -- reveals many aspects of the eighteenth-century Western world through the experiences of one individual. The second edition reproduces the original London printing, supervised by Equiano in 1789. Robert J. Allison's in", "Widely admired for its vivid accounts of the slave trade, Olaudah Equiano's autobiography -- the first slave narrative to attract a significant readership -- reveals many aspects of the eighteenth-century Western world through the experiences of one individual. The second edition reproduces the original London printing, supervised by Equiano in 1789. Robert J. Allison's introduction, which places Equiano's narrative in the context of the Atlantic slave trade, has been revised and updated to reflect the heated controversy surrounding Equiano's birthplace, as well as the latest scholarship on Atlantic history and the history of slavery. Improved pedagogical features include contemporary illustrations with expanded captions and a map showing Equiano's travels in greater detail. Helpful footnotes provide guidance throughout the eighteenth-century text, and a chronology and an up-to-date bibliography aid students in their study of this thought-provoking narrative."], "author": "Olaudah Equiano", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-07 00:00:00", "ISBN": "0312442033"},
{"url": "https://www.goodreads.com/book/show/25489625-between-the-world-and-me", "num_ratings": "135,311", "num_reviews": "15,923", "avg_ratings": 4.4, "genres": ["Nonfiction", "Autobiography", "Memoir", "Race", "Social Movements", "Social Justice"], "title": "Between the World and Me", "description": ["In a profound work that pivots from the biggest questions about American history and ideals to the most intimate concerns of a father for his son, Ta-Nehisi Coates offers a powerful new framework for understanding our nation’s history and current crisis. Americans have built an empire on the idea of “race,” a falsehood that damages us all but falls most heavily on the bodi", "In a profound work that pivots from the biggest questions about American history and ideals to the most intimate concerns of a father for his son, Ta-Nehisi Coates offers a powerful new framework for understanding our nation’s history and current crisis. Americans have built an empire on the idea of “race,” a falsehood that damages us all but falls most heavily on the bodies of black women and men—bodies exploited through slavery and segregation, and, today, threatened, locked up, and murdered out of all proportion. What is it like to inhabit a black body and find a way to live within it? And how can we all honestly reckon with this fraught history and free ourselves from its burden?", "Between the World and Me is Ta-Nehisi Coates’s attempt to answer these questions in a letter to his adolescent son. Coates shares with his son—and readers—the story of his awakening to the truth about his place in the world through a series of revelatory experiences, from Howard University to Civil War battlefields, from the South Side of Chicago to Paris, from his childhood home to the living rooms of mothers whose children’s lives were taken as American plunder. Beautifully woven from personal narrative, reimagined history, and fresh, emotionally charged reportage, Between the World and Me clearly illuminates the past, bracingly confronts our present, and offers a transcendent vision for a way forward.", "Source: penguinrandomhouse.com"], "author": "Ta-Nehisi Coates", "num_pages": "152", "awards": ["Pulitzer Prize Nominee for General Nonfiction (2016)", "National Book Award for Nonfiction (2015)", "ALA Alex Award (2016)", "PEN/Diamonstein-Spielvogel Award for the Art of the Essay  (2016)", "National Book Critics Circle Award Nominee for Criticism (2015)", "NAIBA Book of the Year for Nonfiction (2016)", "Kirkus Prize for Nonfiction (2015)", "Goodreads Choice Award Nominee for Nonfiction (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-14 00:00:00", "ISBN": "0812993543"},
{"url": "https://www.goodreads.com/book/show/33363.Mama_Day", "num_ratings": "8,527", "num_reviews": "522", "avg_ratings": 4.17, "genres": ["Fiction", "Magical Realism", "Cultural", "African American", "Fantasy", "Classics"], "title": "Mama Day", "description": ["A fascinating novel that reworks elements of Shakespeare's ", ". On the island of Willow Springs, off the Georgia coast, the powers of healer Mama Day are tested by her great niece, Cocoa, a stubbornly emancipated woman endangered by the island's darker forces."], "author": "Gloria Naylor", "num_pages": "336", "awards": ["Lillian Smith Book Award (1989)"], "places": [], "character_names": ["Miranda", "George Andrews", "Ophelia"], "language": "English", "publish_date": "1989-04-23 00:00:00", "ISBN": "0679721819"},
{"url": "https://www.goodreads.com/book/show/65335.Selected_Poems", "num_ratings": "6,008", "num_reviews": "208", "avg_ratings": 4.29, "genres": ["Poetry", "Classics", "Cultural", "African American", "Literature"], "title": "Selected Poems", "description": ["With the publication of his first book of poems, ", ", in 1926, Langston Hughes electrified readers and launched a renaissance in black writing in America.  The poems Hughes wrote celebrated the experience of invisible men and women: of slaves who \"rushed the boots of Washington\"; of musicians on Lenox Avenue; of the poor and the lovesick; of losers in \"the raff", "With the publication of his first book of poems, ", ", in 1926, Langston Hughes electrified readers and launched a renaissance in black writing in America.  The poems Hughes wrote celebrated the experience of invisible men and women: of slaves who \"rushed the boots of Washington\"; of musicians on Lenox Avenue; of the poor and the lovesick; of losers in \"the raffle of night.\"  They conveyed that experience in a voice that blended the spoken with the sung, that turned poetic lines into the phrases of jazz and blues, and that ripped through the curtain separating high from popular culture.  They spanned the range from the lyric to the polemic, ringing out \"wonder and pain and terror-- and the marrow of the bone of life.\"", "The poems in this collection were chosen by Hughes himself shortly before his death in 1967 and represent work from his entire career, including \"The Negro Speaks of Rivers,\" \"The Weary Blues,\" \"Still Here,\" \"Song for a Dark Girl,\" \"Montage of a Dream Deferred,\" and \"Refugee in America.\"  It gives us a poet of extraordinary range, directness, and stylistic virtuosity."], "author": "Langston Hughes", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-09-12 00:00:00", "ISBN": "067972818X"},
{"url": "https://www.goodreads.com/book/show/250792.Ain_t_I_a_Woman", "num_ratings": "6,004", "num_reviews": "218", "avg_ratings": 4.37, "genres": ["Feminism", "Nonfiction", "Race", "History", "Social Movements", "Social Justice", "Womens"], "title": "Ain't I a Woman: Black Women and Feminism", "description": ["A groundbreaking work of feminist history and theory analyzing the complex relations between various forms of oppression. ", " examines the impact of sexism on black women during slavery, the historic devaluation of black womanhood, black male sexism, racism within the recent women's movement, and black women's involvement with feminism."], "author": "bell hooks", "num_pages": "205", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-07-01 00:00:00", "ISBN": "089608129X"},
{"url": "https://www.goodreads.com/book/show/8171378-the-warmth-of-other-suns", "num_ratings": "40,376", "num_reviews": "5,248", "avg_ratings": 4.33, "genres": ["History", "Nonfiction", "Race", "Cultural", "African American", "North American Hi...", "American History"], "title": "The Warmth of Other Suns: The Epic Story of America's Great Migration", "description": ["In this epic, beautifully written masterwork, Pulitzer Prize–winning author Isabel Wilkerson chronicles one of the great untold stories of American history: the decades-long migration of black citizens who fled the South for northern and western cities, in search of a better life. ", "From 1915 to 1970, this exodus of almost six million people changed the face of America. Wilk", "In this epic, beautifully written masterwork, Pulitzer Prize–winning author Isabel Wilkerson chronicles one of the great untold stories of American history: the decades-long migration of black citizens who fled the South for northern and western cities, in search of a better life. ", "From 1915 to 1970, this exodus of almost six million people changed the face of America. Wilkerson compares this epic migration to the migrations of other peoples in history. She interviewed more than a thousand people, and gained access to new data and official records, to write this definitive and vividly dramatic account of how these American journeys unfolded, altering our cities, our country, and ourselves.", "With stunning historical detail, Wilkerson tells this story through the lives of three unique individuals: Ida Mae Gladney, who in 1937 left sharecropping and prejudice in Mississippi for Chicago, where she achieved quiet blue-collar success and, in old age, voted for Barack Obama when he ran for an Illinois Senate seat; sharp and quick-tempered George Starling, who in 1945 fled Florida for Harlem, where he endangered his job fighting for civil rights, saw his family fall, and finally found peace in God; and Robert Foster, who left Louisiana in 1953 to pursue a medical career, the personal physician to Ray Charles as part of a glitteringly successful medical career, which allowed him to purchase a grand home where he often threw exuberant parties.", "Wilkerson brilliantly captures their first treacherous and exhausting cross-country trips by car and train and their new lives in colonies that grew into ghettos, as well as how they changed these cities with southern food, faith, and culture and improved them with discipline, drive, and hard work. Both a riveting microcosm and a major assessment, ", " is a bold, remarkable, and riveting work, a superb account of an “unrecognized immigration” within our own land. Through the breadth of its narrative, the beauty of the writing, the depth of its research, and the fullness of the people and lives portrayed herein, this book is destined to become a classic."], "author": "Isabel Wilkerson", "num_pages": "622", "awards": ["Mark Lynton History Prize (2011)", "Anisfield-Wolf Book Award for Non-Fiction (2011)", "PEN/John Kenneth Galbraith Award for Nonfiction Nominee (2011)", "Chicago Tribune Heartland Prize for Nonfiction (2011)", "Dayton Literary Peace Prize for Nonfiction (Runner-up) (2011)", "National Book Critics Circle Award for General Nonfiction (2010)", "Hurston/Wright Legacy Award for Nonfiction (2011)", "Goodreads Choice Award Nominee for History and Biography (2010)"], "places": ["Lake County, Florida"], "character_names": [], "language": "English", "publish_date": "2010-09-07 00:00:00", "ISBN": "0679444327"},
{"url": "https://www.goodreads.com/book/show/52318.Wild_Seed", "num_ratings": "13,004", "num_reviews": "1,220", "avg_ratings": 4.21, "genres": ["Science Fiction", "Fantasy", "Fiction", "Speculative Fiction"], "title": "Wild Seed", "description": ["Doro is an entity who changes bodies like clothes, killing his hosts by reflex or design. He fears no one until he meets Anyanwu. Anyanwu is a shapeshifter who can absorb bullets and heal with a kiss and savage anyone who threatens her. She fears no one until she meets Doro. Together they weave a pattern of destiny (from Africa to the New World) unimaginable to mortals."], "author": "Octavia E. Butler", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-04-01 00:00:00", "ISBN": "0446676977"},
{"url": "https://www.goodreads.com/book/show/58098.for_colored_girls_who_have_considered_suicide_when_the_rainbow_is_enuf", "num_ratings": "27,184", "num_reviews": "647", "avg_ratings": 4.28, "genres": ["Poetry", "Plays", "Fiction", "Feminism", "Cultural", "African American", "Drama", "Race"], "title": "for colored girls who have considered suicide/when the rainbow is enuf", "description": ["From its inception in California in 1974 to its highly acclaimed critical success at Joseph Papp's Public Theater and on Broadway, the Obie Award-winning ", " has excited, inspired, and transformed audiences all over the country. Passionate and fearless, Shange's words reveal what it is to be of color and fe", "From its inception in California in 1974 to its highly acclaimed critical success at Joseph Papp's Public Theater and on Broadway, the Obie Award-winning ", " has excited, inspired, and transformed audiences all over the country. Passionate and fearless, Shange's words reveal what it is to be of color and female in the twentieth century. First published in 1975 when it was praised by ", " for \"encompassing...every feeling and experience a woman has ever had,\" ", " will be read and performed for generations to come. Here is the complete text, with stage directions, of a groundbreaking dramatic prose poem written in vivid and powerful language that resonates with unusual beauty in its fierce message to the world."], "author": "Ntozake Shange", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-09-01 00:00:00", "ISBN": "0684843269"},
{"url": "https://www.goodreads.com/book/show/410810.Notes_of_a_Native_Son", "num_ratings": "10,330", "num_reviews": "481", "avg_ratings": 4.36, "genres": ["Nonfiction", "Writing", "Essays", "Classics", "Autobiography", "Memoir", "Race", "History"], "title": "Notes of a Native Son", "description": ["Since its original publication in 1955, this first nonfiction collection of essays by James Baldwin remains an American classic. His impassioned essays on life in Harlem, the protest novel, movies, and African Americans abroad are as powerful today as when they were first written.", "--back cover"], "author": "James Baldwin", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-08-16 00:00:00", "ISBN": "0807064319"},
{"url": "https://www.goodreads.com/book/show/29209.The_Color_of_Water", "num_ratings": "90,122", "num_reviews": "4,539", "avg_ratings": 4.07, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Cultural", "African American"], "title": "The Color of Water: A Black Man's Tribute to His White Mother", "description": ["Touches readers of all colors as a vivid portrait of growing up, a haunting meditation on race and identity, and a lyrical valentine to a mother from her son.", "Who is Ruth McBride Jordan? A self-declared \"light-skinned\" woman evasive about her ethnicity, yet steadfast in her love for her twelve black children. James McBride, journalist, musician and son, explores his mother'", "Touches readers of all colors as a vivid portrait of growing up, a haunting meditation on race and identity, and a lyrical valentine to a mother from her son.", "Who is Ruth McBride Jordan? A self-declared \"light-skinned\" woman evasive about her ethnicity, yet steadfast in her love for her twelve black children. James McBride, journalist, musician and son, explores his mother's past, as well as his own upbringing and heritage, in a poignant and powerful debut, The Color Of Water: A Black Man's Tribute to His White Mother. ", "The son of a black minister and a woman who would not admit she was white, James McBride grew up in \"orchestrated chaos\" with his eleven siblings in the poor, all-black projects of Red Hook, Brooklyn. \"Mommy,\" a fiercely protective woman with \"dark eyes full of pep and fire,\" herded her brood to Manhattan's free cultural events, sent them off on buses to the best (and mainly Jewish) schools, demanded good grades and commanded respect. As a young man, McBride saw his mother as a source of embarrassment, worry, and confusion--and reached thirty before he began to discover the truth about her early life and long-buried pain. ", "In The Color of Water, McBride retraces his mother's footsteps and, through her searing and spirited voice, recreates her remarkable story. The daughter of a failed itinerant Orthodox rabbi, she was born Rachel Shilsky (actually Ruchel Dwara Zylska) in Poland on April 1, 1921. Fleeing pogroms, her family emigrated to America and ultimately settled in Suffolk, Virginia, a small town where anti-Semitism and racial tensions ran high. With candor and immediacy, Ruth describes her parents' loveless marriage; her fragile, handicapped mother; her cruel, sexually-abusive father; and the rest of the family and life she abandoned. ", "At seventeen, after fleeing Virginia and settling in New York City, Ruth married a black minister and founded the all-black New Brown Memorial Baptist Church in her Red Hook living room. \"God is the color of water,\" Ruth McBride taught her children, firmly convinced that life's blessings and life's values transcend race. Twice widowed, and continually confronting overwhelming adversity and racism, Ruth's determination, drive and discipline saw her dozen children through college--and most through graduate school. At age 65, she herself received a degree in social work from Temple University. ", "Interspersed throughout his mother's compelling narrative, McBride shares candid recollections of his own experiences as a mixed-race child of poverty, his flirtations with drugs and violence, and his eventual self-realization and professional success. The Color of Water touches readers of all colors as a vivid portrait of growing up, a haunting meditation on race and identity, and a lyrical valentine to a mother from her son."], "author": "James McBride", "num_pages": "291", "awards": ["Anisfield-Wolf Book Award (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-01-14 00:00:00", "ISBN": "1573225789"},
{"url": "https://www.goodreads.com/book/show/133914.The_Ways_of_White_Folks", "num_ratings": "3,409", "num_reviews": "192", "avg_ratings": 4.41, "genres": ["Short Stories", "Fiction", "Classics", "Cultural", "African American", "Race", "Poetry"], "title": "The Ways of White Folks", "description": ["In these acrid and poignant stories, Hughes depicted black people colliding--sometimes humorously, more often tragically--with whites in the 1920s and '30s."], "author": "Langston Hughes", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-09-12 00:00:00", "ISBN": "0679728171"},
{"url": "https://www.goodreads.com/book/show/764061.The_Autobiography_of_Miss_Jane_Pittman", "num_ratings": "10,906", "num_reviews": "317", "avg_ratings": 4.18, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Cultural", "African American", "Historical"], "title": "The Autobiography of Miss Jane Pittman", "author": "Ernest J. Gaines", "num_pages": "272", "awards": ["California Book Award for Fiction (Silver) (1971)"], "places": [], "character_names": [], "language": "English", "publish_date": "1982-07-01 00:00:00", "ISBN": "0553263579"},
{"url": "https://www.goodreads.com/book/show/571420.Jubilee", "num_ratings": "3,685", "num_reviews": "357", "avg_ratings": 4.26, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Cultural", "African American", "Military History", "Civil War", "Historical"], "title": "Jubilee", "description": ["A 50th anniversary edition of Margaret Walker's best-selling classic with a foreword by Nikki Giovanni ", " tells the true story of Vyry, the child of a white plantation owner and one of his black slaves. Vyry bears witness to the South’s antebellum opulence and to its brutality, its wartime ruin, and the promises of Reconstruction. Weaving her own family’s oral history", "A 50th anniversary edition of Margaret Walker's best-selling classic with a foreword by Nikki Giovanni ", " tells the true story of Vyry, the child of a white plantation owner and one of his black slaves. Vyry bears witness to the South’s antebellum opulence and to its brutality, its wartime ruin, and the promises of Reconstruction. Weaving her own family’s oral history with thirty years of research, Margaret Walker’s novel brings the everyday experiences of slaves to light. ", " churns with the hunger, the hymns, the struggles, and the very breath of American history."], "author": "Margaret Walker", "num_pages": "497", "awards": ["Houghton Mifflin Literary Fellowship Award"], "places": ["Alabama", "Georgia"], "character_names": [], "language": "English", "publish_date": "1999-01-21 00:00:00", "ISBN": "0395924952"},
{"url": "https://www.goodreads.com/book/show/37398.Jazz", "num_ratings": "18,494", "num_reviews": "969", "avg_ratings": 3.79, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Cultural", "African American", "Literature"], "title": "Jazz", "description": ["In the winter of 1926, when everybody everywhere sees nothing but good things ahead, Joe Trace, middle-aged door-to-door salesman of Cleopatra beauty products, shoots his teenage lover to death. At the funeral, Joe’s wife, Violet, attacks the girl’s corpse. This passionate, profound story of love and obsession brings us back and forth in time, as a narrative is assembled f", "In the winter of 1926, when everybody everywhere sees nothing but good things ahead, Joe Trace, middle-aged door-to-door salesman of Cleopatra beauty products, shoots his teenage lover to death. At the funeral, Joe’s wife, Violet, attacks the girl’s corpse. This passionate, profound story of love and obsession brings us back and forth in time, as a narrative is assembled from the emotions, hopes, fears, and deep realities of black urban life."], "author": "Toni Morrison", "num_pages": "229", "awards": [], "places": ["Harlem, New York City, New York"], "character_names": [], "language": "English", "publish_date": "1993-04-01 00:00:00", "ISBN": "0452269652"},
{"url": "https://www.goodreads.com/book/show/205368.Your_Blues_Ain_t_Like_Mine", "num_ratings": "6,727", "num_reviews": "142", "avg_ratings": 4.2, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Race"], "title": "Your Blues Ain't Like Mine", "description": ["Now, in her first novel, repercussions are felt for decades in a dozen lives after a racist beating turns to cold-blooded murder in a small 1950s Mississippi town.", "Chicago-born Amrstrong Tood is fifteen, black, and unused to the ways of the segregated Deep South, when his mother sends him to spend the summer with relatives in rural Mississippi. For speaking a few innocuous", "Now, in her first novel, repercussions are felt for decades in a dozen lives after a racist beating turns to cold-blooded murder in a small 1950s Mississippi town.", "Chicago-born Amrstrong Tood is fifteen, black, and unused to the ways of the segregated Deep South, when his mother sends him to spend the summer with relatives in rural Mississippi. For speaking a few innocuous words in French to a white woman, Armstrong is killed. And the precariously balanced world and its determined people--white and black--are changed, then and forever, by the horror of poverty, the legacy of justice, and the singular gift of love's power to heal."], "author": "Bebe Moore Campbell", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-06-27 00:00:00", "ISBN": "0345401123"},
{"url": "https://www.goodreads.com/book/show/395220.Zami", "num_ratings": "10,752", "num_reviews": "464", "avg_ratings": 4.23, "genres": ["Feminism", "Autobiography", "Memoir", "Nonfiction", "Glbt", "Queer", "Lgbt"], "title": "Zami: A New Spelling of My Name", "description": ["ZAMI is a fast-moving chronicle. From the author's vivid childhood memories in Harlem to her coming of age in the late 1950s, the nature of Audre Lorde's work is cyclical. It especially relates the linkage of women who have shaped her . . . Lorde brings into play her craft of lush description and characterization. It keeps unfolding page after page.", "--"], "author": "Audre Lorde", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1982-01-01 00:00:00", "ISBN": "0895941228"},
{"url": "https://www.goodreads.com/book/show/32951.Sister_Outsider", "num_ratings": "11,041", "num_reviews": "528", "avg_ratings": 4.48, "genres": ["Feminism", "Nonfiction", "Writing", "Essays", "Race", "Glbt", "Queer"], "title": "Sister Outsider: Essays and Speeches", "description": ["A collection of fifteen essays written between 1976 and 1984 gives clear voice to Audre Lorde's literary and philosophical personae. These essays explore and illuminate the roots of Lorde's intellectual development and her deep-seated and longstanding concerns about ways of increasing empowerment among minority women writers and the absolute necessity to explicate the conc", "A collection of fifteen essays written between 1976 and 1984 gives clear voice to Audre Lorde's literary and philosophical personae. These essays explore and illuminate the roots of Lorde's intellectual development and her deep-seated and longstanding concerns about ways of increasing empowerment among minority women writers and the absolute necessity to explicate the concept of difference—difference according to sex, race, and economic status. The title Sister Outsider finds its source in her poetry collection The Black Unicorn (1978). These poems and the essays in Sister Outsider stress Lorde's oft-stated theme of continuity, particularly of the geographical and intellectual link between Dahomey, Africa, and her emerging self."], "author": "Audre Lorde", "num_pages": "190", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-06-01 00:00:00", "ISBN": "0895941414"},
{"url": "https://www.goodreads.com/book/show/60937.The_Temple_of_My_Familiar", "num_ratings": "12,638", "num_reviews": "431", "avg_ratings": 4.05, "genres": ["Fiction", "Cultural", "African American", "Feminism", "Magical Realism"], "title": "The Temple of My Familiar", "description": ["A visionary cast of characters weave together their past and present in a brilliantly intricate tapestry of tales.", "It is the story of the dispossessed and displaced, of peoples whose history is ancient and whose future is yet to come. Here we meet Lissie, a woman of many pasts; Arveyda the great guitarist and his Latin American wife who has had to flee her homeland; Suwelo,", "A visionary cast of characters weave together their past and present in a brilliantly intricate tapestry of tales.", "It is the story of the dispossessed and displaced, of peoples whose history is ancient and whose future is yet to come. Here we meet Lissie, a woman of many pasts; Arveyda the great guitarist and his Latin American wife who has had to flee her homeland; Suwelo, the history teacher, and his former wife Fanny who has fallen in love with spirits. Hovering tantalisingly above their stories are Miss Celie and Shug, the beloved characters from THE COLOUR PURPLE."], "author": "Alice Walker", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-09-16 00:00:00", "ISBN": "0753819481"},
{"url": "https://www.goodreads.com/book/show/38462.Giovanni_s_Room", "num_ratings": "36,903", "num_reviews": "2,928", "avg_ratings": 4.22, "genres": ["Fiction", "Classics", "Lgbt", "Glbt", "Queer", "Novels", "Glbt", "Gay"], "title": "Giovanni's Room", "description": ["An alternate cover for this ISBN can be found ", ".", "Baldwin's haunting and controversial second novel is his most sustained treatment of sexuality, and a classic of gay literature. In a 1950s Paris swarming with expatriates and characterized by dangerous liaisons and hidden violence, an American finds himself unable to repress his impulses, despite his determination to live", "An alternate cover for this ISBN can be found ", ".", "Baldwin's haunting and controversial second novel is his most sustained treatment of sexuality, and a classic of gay literature. In a 1950s Paris swarming with expatriates and characterized by dangerous liaisons and hidden violence, an American finds himself unable to repress his impulses, despite his determination to live the conventional life he envisions for himself. After meeting and proposing to a young woman, he falls into a lengthy affair with an Italian bartender and is confounded and tortured by his sexual identity as he oscillates between the two. ", "Examining the mystery of love and passion in an intensely imagined narrative, Baldwin creates a moving and complex story of death and desire that is revelatory in its insight."], "author": "James Baldwin", "num_pages": "159", "awards": [], "places": ["Paris"], "character_names": [], "language": "English", "publish_date": "2000-06-16 00:00:00", "ISBN": "0141186356"},
{"url": "https://www.goodreads.com/book/show/37100.Devil_in_a_Blue_Dress", "num_ratings": "15,768", "num_reviews": "1,049", "avg_ratings": 3.9, "genres": ["Mystery", "Fiction", "Mystery", "Noir", "Cultural", "African American", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Devil in a Blue Dress", "description": ["In Los Angeles of the late 1940s, Easy Rawlins, a black war veteran, has just been fired from his job at a defense plant. Easy is drinking in a friend's bar, wondering how he'll meet his mortgage, when a white man in a linen suit walks in, offering good money if Easy will simply locate Miss Daphne Monet, a blonde beauty known to frequent black jazz clubs."], "author": "Walter Mosley", "num_pages": "263", "awards": ["Shamus Award for Best First PI Novel (1991)", "CWA New Blood Dagger (1991)", "Edgar Award Nominee for Best First Novel (1991)"], "places": ["Los Angeles, California"], "character_names": ["Raymond \"Mouse\" Alexander", "Ezekiel \"Easy\" Rawlins"], "language": "English", "publish_date": "2002-09-17 00:00:00", "ISBN": "0743451791"},
{"url": "https://www.goodreads.com/book/show/464260.The_Fire_Next_Time", "num_ratings": "28,258", "num_reviews": "2,196", "avg_ratings": 4.49, "genres": ["Nonfiction", "Writing", "Essays", "Race", "Classics", "History", "Politics"], "title": "The Fire Next Time", "description": ["A national bestseller when it first appeared in 1963, ", " galvanized the nation and gave passionate voice to the emerging civil rights movement. At once a powerful evocation of James Baldwin's early life in Harlem and a disturbing examination of the consequences of racial injustice, the book is an intensely personal and provocative document. It consists of t", "A national bestseller when it first appeared in 1963, ", " galvanized the nation and gave passionate voice to the emerging civil rights movement. At once a powerful evocation of James Baldwin's early life in Harlem and a disturbing examination of the consequences of racial injustice, the book is an intensely personal and provocative document. It consists of two \"letters,\" written on the occasion of the centennial of the Emancipation Proclamation, that exhort Americans, both black and white, to attack the terrible legacy of racism. Described by The New York Times Book Review as \"sermon, ultimatum, confession, deposition, testament, and chronicle...all presented in searing, brilliant prose,\" ", " stands as a classic of our literature."], "author": "James Baldwin", "num_pages": "106", "awards": ["National Book Award Finalist for History and Biography (1964)"], "places": [], "character_names": [], "language": "English", "publish_date": "1992-12-01 00:00:00", "ISBN": "067974472X"},
{"url": "https://www.goodreads.com/book/show/310459.Roll_of_Thunder_Hear_My_Cry", "num_ratings": "101,612", "num_reviews": "4,336", "avg_ratings": 3.8, "genres": ["Historical", "Historical Fiction", "Young Adult", "Classics", "Childrens", "Fiction", "Childrens", "Middle Grade", "Cultural", "African American", "Academic", "Read For School", "Historical", "Realistic Fiction"], "title": "Roll of Thunder, Hear My Cry", "description": ["Why is the land so important to Cassie's family? It takes the events of one turbulent year—the year of the night riders and the burnings, the year a white girl humiliates Cassie in public simply because she's black—to show Cassie that having a place of their own is the Logan family's lifeblood. It is the land that gives the Logans their courage and pride—no matter how othe", "Why is the land so important to Cassie's family? It takes the events of one turbulent year—the year of the night riders and the burnings, the year a white girl humiliates Cassie in public simply because she's black—to show Cassie that having a place of their own is the Logan family's lifeblood. It is the land that gives the Logans their courage and pride—no matter how others may degrade them, the Logans possess something no one can take away."], "author": "Mildred D. Taylor", "num_pages": "288", "awards": ["Newbery Medal (1977)", "Buxtehuder Bulle (1984)", "George C. Stone Center for Children's Books Recognition of Merit Award (1991)", "Jane Addams Children's Book Award Nominee (1977)", "Los Angeles Times Book Prize for Young Adult Fiction (2001)", "Dorothy Canfield Fisher Children's Book Award Nominee (1978)", "Coretta Scott King Award for Author Honor (1977)", "Pacific Northwest Library Association Young Reader's Choice Award (1979)", "Boston Globe-Horn Book Award Nominee for Fiction (1977)", "California Young Readers Medal Nominee for Middle School/Junior High (1980)", "National Book Award Finalist for Children's Literature (1977)"], "places": ["Mississippi"], "character_names": ["Cassie Logan", "Stacey Logan", "Christopher John", "Papa"], "language": "English", "publish_date": "1991-10-01 00:00:00", "ISBN": "014034893X"},
{"url": "https://www.goodreads.com/book/show/37435.The_Secret_Life_of_Bees", "num_ratings": "994,566", "num_reviews": "27,841", "avg_ratings": 4.03, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Adult Fiction"], "title": "The Secret Life of Bees", "description": ["Set in South Carolina in 1964, ", " tells the story of Lily Owens, whose life has been shaped around the blurred memory of the afternoon her mother was killed. When Lily's fierce-hearted black \"stand-in mother,\" Rosaleen, insults three of the deepest racists in town, Lily decides to spring them both free. They escape to Tiburon, South Carolina--a town th", "Set in South Carolina in 1964, ", " tells the story of Lily Owens, whose life has been shaped around the blurred memory of the afternoon her mother was killed. When Lily's fierce-hearted black \"stand-in mother,\" Rosaleen, insults three of the deepest racists in town, Lily decides to spring them both free. They escape to Tiburon, South Carolina--a town that holds the secret to her mother's past. Taken in by an eccentric trio of black beekeeping sisters, Lily is introduced to their mesmerizing world of bees and honey, and the Black Madonna. This is a remarkable novel about divine female power, a story women will share and pass on to their daughters for years to come."], "author": "Sue Monk Kidd", "num_pages": "336", "awards": ["Orange Prize Nominee for Fiction Longlist (2002)", "Book Sense Book of the Year Award for Paperback (2004)", "Lincoln Award Nominee (2005)", "Missouri Gateway Readers Award Nominee (2005)"], "places": ["United States of America", "South Carolina", "Tiburon, South Carolina"], "character_names": ["Lily Owens", "Rosaleen", "August Boatwright", "June Boatwright", "May Boatwright", "T. Ray Owens"], "language": "English", "publish_date": "2003-01-28 00:00:00", "ISBN": "0142001740"},
{"url": "https://www.goodreads.com/book/show/133906.The_Collected_Poems", "num_ratings": "14,881", "num_reviews": "202", "avg_ratings": 4.33, "genres": ["Poetry", "Classics", "Cultural", "African American", "Fiction", "Literature"], "title": "The Collected Poems", "description": ["\"The ultimate book for both the dabbler and serious scholar--. [Hughes] is sumptuous and sharp, playful and sparse, grounded in an earthy music--. This book is a glorious revelation.\"--Boston Globe", "Spanning five decades and comprising 868 poems (nearly 300 of which have never before appeared in book form), this magnificent volume is the definitive sampling of a writer who h", "\"The ultimate book for both the dabbler and serious scholar--. [Hughes] is sumptuous and sharp, playful and sparse, grounded in an earthy music--. This book is a glorious revelation.\"--Boston Globe", "Spanning five decades and comprising 868 poems (nearly 300 of which have never before appeared in book form), this magnificent volume is the definitive sampling of a writer who has been called the poet laureate of African America--and perhaps our greatest popular poet since Walt Whitman.  Here, for the first time, are all the poems that Langston Hughes published during his lifetime, arranged in the general order in which he wrote them and annotated by Arnold Rampersad and David Roessel.", "Alongside such famous works as \"The Negro Speaks of Rivers\" and Montage of a Dream Deferred, ", " includes the author's lesser-known verse for children; topical poems distributed through the Associated Negro Press; and poems such as \"Goodbye Christ\" that were once suppressed.  Lyrical and pungent, passionate and polemical, the result is a treasure of a book, the essential collection of a poet whose words have entered our common language."], "author": "Langston Hughes", "num_pages": "736", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-10-31 00:00:00", "ISBN": "0679764089"},
{"url": "https://www.goodreads.com/book/show/71332.Push", "num_ratings": "43,905", "num_reviews": "5,785", "avg_ratings": 3.83, "genres": ["Fiction", "Young Adult", "Cultural", "African American", "Contemporary", "Sociology", "Abuse"], "title": "Push", "description": ["Precious Jones, an illiterate sixteen-year-old, has up until now been invisible: invisible to the father who rapes her and the mother who batters her and to the authorities who dismiss her as just one more of Harlem's casualties. But when Precious, pregnant with a second child by her father, meets a determined and highly radical teacher, we follow her on a journey of educa", "Precious Jones, an illiterate sixteen-year-old, has up until now been invisible: invisible to the father who rapes her and the mother who batters her and to the authorities who dismiss her as just one more of Harlem's casualties. But when Precious, pregnant with a second child by her father, meets a determined and highly radical teacher, we follow her on a journey of education and enlightenment as Precious learns not only how to write about her life, but how to make it her own for the first time."], "author": "Sapphire", "num_pages": "177", "awards": [], "places": ["Harlem, New York City, New York", "New York (the state)"], "character_names": ["Claireece Precious Jones", "Blue Rain"], "language": "English", "publish_date": "1997-04-29 00:00:00", "ISBN": "0679766758"},
{"url": "https://www.goodreads.com/book/show/5197.A_Lesson_Before_Dying", "num_ratings": "44,951", "num_reviews": "2,791", "avg_ratings": 3.93, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Cultural", "African American"], "title": "A Lesson Before Dying", "description": ["A Lesson Before Dying is set in a small Cajun community in the late 1940s. Jefferson, a young black man, is an unwitting party to a liquor store shoot out in which three men are killed; the only survivor, he is convicted of murder and sentenced to death. Grant Wiggins, who left his hometown for the university, has returned to the plantation school to teach. As he struggles", "A Lesson Before Dying is set in a small Cajun community in the late 1940s. Jefferson, a young black man, is an unwitting party to a liquor store shoot out in which three men are killed; the only survivor, he is convicted of murder and sentenced to death. Grant Wiggins, who left his hometown for the university, has returned to the plantation school to teach. As he struggles with his decision whether to stay or escape to another state, his aunt and Jefferson's godmother persuade him to visit Jefferson in his cell and impart his learning and his pride to Jefferson before his death. In the end, the two men forge a bond as they both come to understand the simple heroism of resisting and defying the expected. Ernest J. Gaines brings to this novel the same rich sense of place, the same deep understanding of the human psyche, and the same compassion for a people and their struggle that have informed his previous, highly praised works of fiction."], "author": "Ernest J. Gaines", "num_pages": "256", "awards": ["National Book Critics Circle Award for Fiction (1993)"], "places": ["Louisiana"], "character_names": [], "language": "English", "publish_date": "1997-09-28 00:00:00", "ISBN": "0375702709"},
{"url": "https://www.goodreads.com/book/show/11346.Sula", "num_ratings": "46,755", "num_reviews": "2,601", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Literature"], "title": "Sula", "description": ["This rich and moving novel traces the lives of two black heroines from their close-knit childhood in a small Ohio town, through their sharply divergent paths of womanhood, to their ultimate confrontation and reconciliation.", "Nel Wright has chosen to stay in the place where she was born, to marry, raise a family, and become a pillar of the black community. Sula Peace has reje", "This rich and moving novel traces the lives of two black heroines from their close-knit childhood in a small Ohio town, through their sharply divergent paths of womanhood, to their ultimate confrontation and reconciliation.", "Nel Wright has chosen to stay in the place where she was born, to marry, raise a family, and become a pillar of the black community. Sula Peace has rejected the life Nel has embraced, escaping to college, and submerging herself in city life. When she returns to her roots, it is as a rebel and a wanton seductress. Eventually, both women must face the consequences of their choices. Together, they create an unforgettable portrait of what it means and costs to be a black woman in America."], "author": "Toni Morrison", "num_pages": "192", "awards": ["Audie Award for Narration by the Author or Authors (1998)", "National Book Award Finalist for Fiction (1975)"], "places": [], "character_names": ["Nel Wright Greene", "Sula Peace", "Helene Wright", "Eva Peace", "Hannah Peace"], "language": "English", "publish_date": "2002-04-05 00:00:00", "ISBN": "0452283868"},
{"url": "https://www.goodreads.com/book/show/546018.Roots", "num_ratings": "130,415", "num_reviews": "2,870", "avg_ratings": 4.42, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Historical"], "title": "Roots: The Saga of an American Family", "description": ["When he was a boy in Henning, Tennessee, Alex Haley's grandmother used to tell him stories about their family—stories that went back to ", " grandparents, and ", " grandparents, down through the generations all the way to a man she called \"the African.\" She said he had lived across the ocean near what he called the \"", "\" and had been out in the forest one day cho", "When he was a boy in Henning, Tennessee, Alex Haley's grandmother used to tell him stories about their family—stories that went back to ", " grandparents, and ", " grandparents, down through the generations all the way to a man she called \"the African.\" She said he had lived across the ocean near what he called the \"", "\" and had been out in the forest one day chopping wood to make a drum when he was set upon by four men, beaten, chained and dragged aboard a slave ship bound for Colonial America.", "Still vividly remembering the stories after he grew up and became a writer, Haley began to search for documentation that might authenticate the narrative. It took ten years and a half a million miles of travel across three continents to find it, but finally, in an astonishing feat of genealogical detective work, he discovered not only the name of \"the African\"--Kunta Kinte—but the precise location of Juffure, the very village in The Gambia, West Africa, from which he was abducted in 1767 at the age of sixteen and taken on the ", " to Maryland and sold to a Virginia planter.", "Haley has talked in Juffure with his own African sixth cousins. On September 29, 1967, he stood on the dock in Annapolis where his great-great-great-great-grandfather was taken ashore on September 29, 1767. Now he has written the monumental two-century drama of Kunta Kinte and the six generations who came after him—slaves and freedmen, farmers and blacksmiths, lumber mill workers and Pullman porters, lawyers and architects—and one author.", "But Haley has done more than recapture the history of his own family. As the first black American writer to trace his origins back to their roots, he has told the story of 25,000,000 Americans of African descent. He has rediscovered for an entire people a rich cultural heritage that slavery took away from them, along with their names and their identities. But ", " speaks, finally, not just to blacks, or to whites, but to all people and all races everywhere, for the story it tells is one of the most eloquent testimonials ever written to the indomitability of the human spirit."], "author": "Alex Haley", "num_pages": "729", "awards": ["ASJA Outstanding Book Award (1978)", "Audie Award for Nonfiction (2008)", "Premio Bancarella (1978)", "National Book Critics Circle Award Nominee for General Nonfiction (1976)", "Lillian Smith Book Award (1977)"], "places": ["United States of America", "Gambia"], "character_names": ["George Lincoln Rockwell", "Alex Haley", "Kunta Kinte"], "language": "English", "publish_date": "1977-11-01 00:00:00", "ISBN": "0440174643"},
{"url": "https://www.goodreads.com/book/show/765811.The_Women_of_Brewster_Place", "num_ratings": "16,195", "num_reviews": "543", "avg_ratings": 4.14, "genres": ["Fiction", "Short Stories", "Cultural", "African American", "Classics", "Historical", "Historical Fiction", "Contemporary", "Literature"], "title": "The Women of Brewster Place", "author": "Gloria Naylor", "num_pages": "192", "awards": ["National Book Award for First Novel (1983)"], "places": [], "character_names": [], "language": "English", "publish_date": "1983-06-30 00:00:00", "ISBN": "014006690X"},
{"url": "https://www.goodreads.com/book/show/4667024-the-help", "num_ratings": "1,769,459", "num_reviews": "80,387", "avg_ratings": 4.46, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Adult"], "title": "The Help", "description": ["Be prepared to meet three unforgettable women:", "Twenty-two-year-old Skeeter has just returned home after graduating from Ole Miss. She may have a degree, but it is 1962, Mississippi, and her mother will not be happy till Skeeter has a ring on her finger. Skeeter would normally find solace with her beloved maid Constantine, the woman who raised her, but Constantine has disapp", "Be prepared to meet three unforgettable women:", "Twenty-two-year-old Skeeter has just returned home after graduating from Ole Miss. She may have a degree, but it is 1962, Mississippi, and her mother will not be happy till Skeeter has a ring on her finger. Skeeter would normally find solace with her beloved maid Constantine, the woman who raised her, but Constantine has disappeared and no one will tell Skeeter where she has gone.", "Aibileen is a black maid, a wise, regal woman raising her seventeenth white child. Something has shifted inside her after the loss of her own son, who died while his bosses looked the other way. She is devoted to the little girl she looks after, though she knows both their hearts may be broken.", "Minny, Aibileen’s best friend, is short, fat, and perhaps the sassiest woman in Mississippi. She can cook like nobody’s business, but she can’t mind her tongue, so she’s lost yet another job. Minny finally finds a position working for someone too new to town to know her reputation. But her new boss has secrets of her own.", "Seemingly as different from one another as can be, these women will nonetheless come together for a clandestine project that will put them all at risk. And why? Because they are suffocating within the lines that define their town and their times. And sometimes lines are made to be crossed.", "In pitch-perfect voices, Kathryn Stockett creates three extraordinary women whose determination to start a movement of their own forever changes a town, and the way women — mothers, daughters, caregivers, friends — view one another. A deeply moving novel filled with poignancy, humor, and hope, The Help is a timeless and universal story about the lines we abide by, and the ones we don't."], "author": "Kathryn Stockett", "num_pages": "465", "awards": ["Orange Prize Nominee for Fiction Longlist (2010)", "Audie Award for Fiction (2010)", "Exclusive Books Boeke Prize (2009)", "SIBA Book Award for Fiction (2010)", "Indies Choice Book Award for Adult Debut (2010)", "Puddly Award for Fiction (2011)", "Lincoln Award Nominee (2013)", "Grand Prix des lectrices de Elle for roman (2011)", "Goodreads Choice Award for Fiction (2009)", "Townsend Prize for Fiction (2010)"], "places": ["Jackson, Mississippi"], "character_names": ["Constantine Bates", "Eugenia “Skeeter” Phelan", "Aibileen Clark", "Minny Jackson", "Hilly Holbrook", "Elizabeth Leefolt", "Celia Foote", "Stuart Whitworth", "Mae Mobley Leefolt", "Leroy Jackson", "Elaine Stein", "Yule May Crookle", "Johnny Foote", "William Holbrook", "Senator “Stoolie” Whitworth", "Pascagoula", "Treelore Clark"], "language": "English", "publish_date": "2009-02-10 00:00:00", "ISBN": "0399155341"},
{"url": "https://www.goodreads.com/book/show/318742.The_Souls_of_Black_Folk", "num_ratings": "27,100", "num_reviews": "1,029", "avg_ratings": 4.26, "genres": ["Nonfiction", "History", "Classics", "Race", "Cultural", "African American", "Writing", "Essays", "Philosophy"], "title": "The Souls of Black Folk", "description": ["William Edward Burghardt Du Bois (1868-1963) is the greatest of African American intellectuals--a sociologist, historian, novelist, and activist whose astounding career spanned the nation's history from Reconstruction to the civil rights movement. Born in Massachusetts and educated at Fisk, Harvard, and the University of Berlin, Du Bois penned his epochal masterpiece, ", "William Edward Burghardt Du Bois (1868-1963) is the greatest of African American intellectuals--a sociologist, historian, novelist, and activist whose astounding career spanned the nation's history from Reconstruction to the civil rights movement. Born in Massachusetts and educated at Fisk, Harvard, and the University of Berlin, Du Bois penned his epochal masterpiece, ", ", in 1903. It remains his most studied and popular work; its insights into life at the turn of the 20th century still ring true."], "author": "W.E.B. Du Bois", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-09-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/228630.Black_Boy", "num_ratings": "42,827", "num_reviews": "1,620", "avg_ratings": 4.04, "genres": ["Classics", "Nonfiction", "Autobiography", "Memoir", "Cultural", "African American", "Biography"], "title": "Black Boy", "description": [" is a classic of American autobiography, a subtly crafted narrative of Richard Wright's journey from innocence to experience in the Jim Crow South. An enduring story of one young man's coming of age during a particular time and place, ", " remains a seminal text in our history about what it means to be a man, black, and Southern in America."], "author": "Richard Wright", "num_pages": "419", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-09-16 00:00:00", "ISBN": "0060929782"},
{"url": "https://www.goodreads.com/book/show/11334.Song_of_Solomon", "num_ratings": "70,187", "num_reviews": "2,642", "avg_ratings": 4.03, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Literature"], "title": "Song of Solomon", "description": ["Milkman Dead was born shortly after a neighborhood eccentric hurled himself off a rooftop in a vain attempt at flight. For the rest of his life he, too, will be trying to fly. With this brilliantly imagined novel, Toni Morrison transfigures the coming-of-age story as audaciously as Saul Bellow or Gabriel García Márquez. As she follows Milkman from his rustbelt city to the", "Milkman Dead was born shortly after a neighborhood eccentric hurled himself off a rooftop in a vain attempt at flight. For the rest of his life he, too, will be trying to fly. With this brilliantly imagined novel, Toni Morrison transfigures the coming-of-age story as audaciously as Saul Bellow or Gabriel García Márquez. As she follows Milkman from his rustbelt city to the place of his family’s origins, Morrison introduces an entire cast of strivers and seeresses, liars and assassins, the inhabitants of a fully realized black world."], "author": "Toni Morrison", "num_pages": "337", "awards": ["Janet Heidinger Kafka Prize (1977)", "National Book Critics Circle Award for Fiction (1977)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "140003342X"},
{"url": "https://www.goodreads.com/book/show/5517.A_Raisin_in_the_Sun", "num_ratings": "55,619", "num_reviews": "2,380", "avg_ratings": 3.74, "genres": ["Plays", "Classics", "Fiction", "Drama", "Academic", "School"], "title": "A Raisin in the Sun", "description": ["\"Never before, in the entire history of the American theater, has so much of the truth of black people's lives been seen on the stage,\" observed James Baldwin shortly before ", " opened on Broadway in 1959.", "Indeed Lorraine Hansberry's award-winning drama about the hopes and aspirations of a struggling, working-class family living on the South Side of Chicago", "\"Never before, in the entire history of the American theater, has so much of the truth of black people's lives been seen on the stage,\" observed James Baldwin shortly before ", " opened on Broadway in 1959.", "Indeed Lorraine Hansberry's award-winning drama about the hopes and aspirations of a struggling, working-class family living on the South Side of Chicago connected profoundly with the psyche of black America--and changed American theater forever.  The play's title comes from a line in Langston Hughes's poem \"Harlem,\" which warns that a dream deferred might \"dry up/like a raisin in the sun.\"", "\"The events of every passing year add resonance to ", ",\" said ", ".  \"It is as if history is conspiring to make the play a classic.\"  This Modern Library edition presents the fully restored, uncut version of Hansberry's landmark work with an introduction by Robert Nemiroff."], "author": "Lorraine Hansberry", "num_pages": "160", "awards": ["New York Drama Critics' Circle Award for Best American Play (1959)", "Audie Award for Multi-Voiced Performance (2012)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2002-05-07 00:00:00", "ISBN": "0375508333"},
{"url": "https://www.goodreads.com/book/show/36529.Narrative_of_the_Life_of_Frederick_Douglass", "num_ratings": "75,676", "num_reviews": "3,218", "avg_ratings": 3.98, "genres": ["Nonfiction", "History", "Classics", "Biography", "Autobiography", "Memoir", "Academic", "School"], "title": "Narrative of the Life of Frederick Douglass", "description": ["Published in the bicentenary year of Frederick Douglass’s birth and in a Black Lives Matter era, this edition of Narrative of the Life of Frederick Douglass presents new research into his life as an activist and an author. A revolutionary reformer who traveled in Scotland, Ireland, England, and Wales as well as the US, Douglass published many foreign-language editions of h", "Published in the bicentenary year of Frederick Douglass’s birth and in a Black Lives Matter era, this edition of Narrative of the Life of Frederick Douglass presents new research into his life as an activist and an author. A revolutionary reformer who traveled in Scotland, Ireland, England, and Wales as well as the US, Douglass published many foreign-language editions of his Narrative. While there have been many Douglasses over the decades and even centuries, the Frederick Douglass we need now is no iconic, mythic, or legendary self-made man but a fallible, mortal, and human individual: a husband, father, brother, and son. His rallying cry inspires today’s activism: “Agitate! Agitate! Agitate!”", "Recognizing that Douglass was bought and sold on the northern abolitionist podium no less than on the southern auction block, this edition introduces readers to Douglass’s multiple declarations of independence. The Narrative appears alongside his private correspondence as well as the early speeches and writings in which he did justice to the “grim horrors of slavery.” This volume also traces Douglass’s activism and authorship in the context of the reformist work of his wife, Anna Murray, and of his daughters and sons."], "author": "Frederick Douglass", "num_pages": "158", "awards": [], "places": ["United States of America", "Maryland"], "character_names": ["Frederick Douglass"], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "1580495761"},
{"url": "https://www.goodreads.com/book/show/60931.Kindred", "num_ratings": "60,626", "num_reviews": "7,284", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Science Fiction", "Fantasy", "Science Fiction", "Time Travel"], "title": "Kindred", "description": ["The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into ante", "The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into antebellum Maryland. After saving a drowning white boy there, she finds herself staring into the barrel of a shotgun and is transported back to the present just in time to save her life. During numerous such time-defying episodes with the same young man, she realizes the challenge she’s been given: to protect this young slaveholder until he can father her own great-grandmother."], "author": "Octavia E. Butler", "num_pages": "287", "awards": [], "places": ["Maryland", "Altadena, California"], "character_names": ["Dana Franklin", "Kevin Franklin", "Rufus Weylin", "Tom Weylin", "Margaret Weylin", "Alice Greenwood"], "language": "English", "publish_date": "2004-02-01 00:00:00", "ISBN": "0807083690"},
{"url": "https://www.goodreads.com/book/show/15622.Native_Son", "num_ratings": "74,472", "num_reviews": "3,161", "avg_ratings": 3.97, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Literature", "Novels", "Race", "Academic", "School", "Literature", "American", "Literature", "Banned Books"], "title": "Native Son", "description": ["Right from the start, Bigger Thomas had been headed for jail. It could have been for assault or petty larceny; by chance, it was for murder and rape. ", " tells the story of this young black man caught in a downward spiral after he kills a young white woman in a brief moment of panic.", "Set in Chicago in the 1930s, Wright's powerful novel is an unsparing reflection on t", "Right from the start, Bigger Thomas had been headed for jail. It could have been for assault or petty larceny; by chance, it was for murder and rape. ", " tells the story of this young black man caught in a downward spiral after he kills a young white woman in a brief moment of panic.", "Set in Chicago in the 1930s, Wright's powerful novel is an unsparing reflection on the poverty and feelings of hopelessness experienced by people in inner cities across the country and of what it means to be black in America."], "author": "Richard Wright", "num_pages": "504", "awards": ["New York Drama Critics' Circle Award Nominee for Best American Play"], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Bigger Thomas", "Mary Dalton", "Mrs. Dalton", "Henry Dalton", "Jan Erlone", "Boris Max", "Mrs. Thomas", "Buddy Thomas", "Vera Thomas"], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "006083756X"},
{"url": "https://www.goodreads.com/book/show/11337.The_Bluest_Eye", "num_ratings": "130,647", "num_reviews": "5,695", "avg_ratings": 4.0, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Cultural", "African American", "Literature"], "title": "The Bluest Eye", "description": [" is Toni Morrison's first novel, a book heralded for its richness of language and boldness of vision. Set in the author's girlhood hometown of Lorain, Ohio, it tells the story of black, eleven-year-old Pecola Breedlove. Pecola prays for her eyes to turn blue so that she will be as beautiful and beloved as all the blond, blue-eyed children in America. In the a", " is Toni Morrison's first novel, a book heralded for its richness of language and boldness of vision. Set in the author's girlhood hometown of Lorain, Ohio, it tells the story of black, eleven-year-old Pecola Breedlove. Pecola prays for her eyes to turn blue so that she will be as beautiful and beloved as all the blond, blue-eyed children in America. In the autumn of 1941, the year the marigolds in the Breedloves' garden do not bloom. Pecola's life does change- in painful, devastating ways.", "What its vivid evocation of the fear and loneliness at the heart of a child's yearning, and the tragedy of its fulfillment. ", " remains one of Tony Morrisons's most powerful, unforgettable novels- and a significant work of American fiction."], "author": "Toni Morrison", "num_pages": "216", "awards": ["National Book Critics Circle Award"], "places": ["United States of America", "Lorain, Ohio"], "character_names": ["Pauline Breedlove", "Cholly Breedlove", "Pecola Breedlove"], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0452287065"},
{"url": "https://www.goodreads.com/book/show/13214.I_Know_Why_the_Caged_Bird_Sings", "num_ratings": "322,484", "num_reviews": "7,781", "avg_ratings": 4.21, "genres": ["Nonfiction", "Classics", "Autobiography", "Memoir", "Biography", "Biography", "Autobiography"], "title": "I Know Why the Caged Bird Sings", "description": ["Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Yea", "Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Years later, in San Francisco, Maya learns that love for herself, the kindness of others, her own strong spirit, and the ideas of great authors (\"I met and fell in love with William Shakespeare\") will allow her to be free instead of imprisoned.", "Poetic and powerful, ", " will touch hearts and change minds for as long as people read."], "author": "Maya Angelou", "num_pages": "246", "awards": ["Coretta Scott King Award for Author Honor (1971)"], "places": ["Arkansas", "Louisiana", "California", "Missouri"], "character_names": ["Marguerite Johnson 'Maya'", "Bailey Johnson Jr.", "Annie Henderson 'Momma'", "Uncle Willie", "Bailey Johnson", "Vivian Baxter"], "language": "English", "publish_date": "1993-11-16 00:00:00", "ISBN": "0553279378"},
{"url": "https://www.goodreads.com/book/show/16981.Invisible_Man", "num_ratings": "137,619", "num_reviews": "4,709", "avg_ratings": 3.85, "genres": ["Classics", "Fiction", "Literature", "Cultural", "African American"], "title": "Invisible Man", "description": ["First published in 1952 and immediately hailed as a masterpiece, ", " is one of those rare novels that have changed the shape of American literature. For not only does Ralph Ellison's nightmare journey across the racial divide tell unparalleled truths about the nature of bigotry and its effects on the minds of both victims and perpetrators, it gives us an entirely", "First published in 1952 and immediately hailed as a masterpiece, ", " is one of those rare novels that have changed the shape of American literature. For not only does Ralph Ellison's nightmare journey across the racial divide tell unparalleled truths about the nature of bigotry and its effects on the minds of both victims and perpetrators, it gives us an entirely new model of what a novel can be.", "As he journeys from the Deep South to the streets and basements of Harlem, from a horrifying \"battle royal\" where black men are reduced to fighting animals, to a Communist rally where they are elevated to the status of trophies, Ralph Ellison's nameless protagonist ushers readers into a parallel universe that throws our own into harsh and even hilarious relief. Suspenseful and sardonic, narrated in a voice that takes in the symphonic range of the American language, black and white, ", " is one of the most audacious and dazzling novels of our century."], "author": "Ralph Ellison", "num_pages": "581", "awards": ["National Book Award for Fiction (1953)"], "places": ["New York City, New York", "Harlem, New York City, New York", "Alabama"], "character_names": ["Mr. Norton", "Jim Trueblood", "Dr. Hebert Bledsoe", "Mary Rambo", "Lucius Brockway", "Brother Jack", "Tod Clifton", "Ras the Exhorter", "Sybil (Invisible Man)", "Unnamed Narrator"], "language": "English", "publish_date": "1995-02-01 00:00:00", "ISBN": "0679732764"},
{"url": "https://www.goodreads.com/book/show/6149.Beloved", "num_ratings": "265,879", "num_reviews": "8,680", "avg_ratings": 3.79, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Literature", "Magical Realism"], "title": "Beloved", "description": ["Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by", "Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by the ghost of her baby, who died nameless and whose tombstone is engraved with a single word: Beloved. ", "Filled with bitter poetry and suspense as taut as a rope, ", " is a towering achievement by Nobel Prize laureate Toni Morrison."], "author": "Toni Morrison", "num_pages": "324", "awards": ["Pulitzer Prize for Fiction (1988)", "American Book Award (1988)", "Anisfield-Wolf Book Award (1988)", "National Book Critics Circle Award Nominee for Fiction (1987)", "Frederic G. Melcher Book Award (1988)", "National Book Award Finalist for Fiction (1987)"], "places": ["Delaware", "Ohio", "Kentucky"], "character_names": ["Baby Suggs", "Sethe", "Beloved", "Paul D Garner", "Denver"], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "1400033411"},
{"url": "https://www.goodreads.com/book/show/37415.Their_Eyes_Were_Watching_God", "num_ratings": "216,774", "num_reviews": "10,236", "avg_ratings": 3.88, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Academic", "School", "Cultural", "African American"], "title": "Their Eyes Were Watching God", "description": ["Fair and long-legged, independent and articulate, Janie Crawford sets out to be her own person -- no mean feat for a black woman in the '30s. Janie's quest for identity takes her through three marriages and into a journey back to her roots."], "author": "Zora Neale Hurston", "num_pages": "219", "awards": ["Audie Award for Solo Narration - Female (2001)"], "places": ["Florida", "Everglades, Florida"], "character_names": ["Eleanor", "Sam Watson", "Shelby", "Janie Starks", "Pheoby Watson", "Nanny", "Leafy", "Johnny Taylor", "Logan Killicks", "Jody Starks", "Tea Cake", "Pearl Stone", "Mrs. Sumpkins", "Lulu Moss", "Mis' Washburn", "Mr. Washburn", "Miss Nellie", "Mayrella"], "language": "English", "publish_date": "2006-05-30 00:00:00", "ISBN": "0061120065"}
]