[
{"url": "https://www.goodreads.com/book/show/27830154-the-star-host", "num_ratings": "434", "num_reviews": "86", "avg_ratings": 3.95, "genres": ["Lgbt", "Science Fiction", "Young Adult", "Fantasy", "Romance", "M M Romance"], "title": "The Star Host", "description": ["Ren grew up listening to his mother tell stories about the Star Hosts – a mythical group of people possessed by the power of the stars. The stories were the most exciting part of Ren’s life, and he often dreamed about leaving his backwater planet and finding his place among the neighboring drifts. When Ren is captured by soldiers and taken from his home, his dream slips fu", "Ren grew up listening to his mother tell stories about the Star Hosts – a mythical group of people possessed by the power of the stars. The stories were the most exciting part of Ren’s life, and he often dreamed about leaving his backwater planet and finding his place among the neighboring drifts. When Ren is captured by soldiers and taken from his home, his dream slips further out of his grasp. Now a slave of a despotic Baron, Ren must remain inconspicuous while plotting his escape. It’s a challenge since the general of the Baron’s army is convinced Ren is something out of one of his mother’s stories.", "Ren finds companionship in the occupant of the cell next to his, a drifter named Asher. A member of the Phoenix Corps, Asher is mysterious, charming, and exactly the person Ren needs to anchor him as his sudden technopathic ability threatens to consume him. Ren doesn’t mean to become attached, but after a daring escape, a trek across the planet, and an eventful ride on a merchant ship, Asher is the only thing that reminds Ren of home. Together, they must warn the drifts of the Baron’s plans, master Ren’s growing power, and try to save their friends while navigating the growing attraction between them."], "author": "F.T. Lukens", "num_pages": "258", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-03 00:00:00", "ISBN": "1941530729"},
{"url": "https://www.goodreads.com/book/show/12000020-aristotle-and-dante-discover-the-secrets-of-the-universe", "num_ratings": "159,127", "num_reviews": "23,968", "avg_ratings": 4.35, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "Aristotle and Dante Discover the Secrets of the Universe", "description": ["Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this fr", "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be."], "author": "Benjamin Alire Sáenz", "num_pages": "359", "awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2013)", "Michael L. Printz Award Nominee (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2015)", "Lambda Literary Award for LGBT Children's/Young Adult (2013)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2015)", "Amelia Elizabeth Walden Award Nominee (2013)", "Lincoln Award Nominee (2016)", "Pura Belpré Award for Narrative (2013)", "Les Incorruptibles (2017)"], "places": ["El Paso, Texas", "Texas"], "character_names": ["Aristotle \"Ari\" Mendoza", "Dante Quintana"], "language": "English", "publish_date": "2012-02-21 00:00:00", "ISBN": "1442408928"},
{"url": "https://www.goodreads.com/book/show/522782.Parrotfish", "num_ratings": "5,341", "num_reviews": "479", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Glbt", "Queer", "Fiction"], "title": "Parrotfish", "description": ["\"Last week I cut my hair, bought some boys' clothes and shoes, wrapped a large ACE bandage around my chest to flatten my fortunately-not-large breasts, and began looking for a new name.\" ", "\"Last week I cut my hair, bought some boys' clothes and shoes, wrapped a large ACE bandage around my chest to flatten my fortunately-not-large breasts, and began looking for a new name.\" "], "author": "Ellen Wittlinger", "num_pages": "294", "awards": [], "places": ["Massachusetts"], "character_names": [], "language": "English", "publish_date": "2007-07-10 00:00:00", "ISBN": "1416916229"},
{"url": "https://www.goodreads.com/book/show/11672159-the-dark-wife", "num_ratings": "5,048", "num_reviews": "544", "avg_ratings": 3.88, "genres": ["Fantasy", "Lgbt", "Fantasy", "Mythology", "Romance", "Young Adult", "Glbt", "Lesbian"], "title": "The Dark Wife", "description": ["Three thousand years ago, a god told a lie. Now, only a goddess can tell the truth. Persephone has everything a daughter of Zeus could want--except for freedom. She lives on the green earth with her mother, Demeter, growing up beneath the ever-watchful eyes of the gods and goddesses on Mount Olympus. But when Persephone meets the enigmatic Hades, she experiences something", "Three thousand years ago, a god told a lie. Now, only a goddess can tell the truth. Persephone has everything a daughter of Zeus could want--except for freedom. She lives on the green earth with her mother, Demeter, growing up beneath the ever-watchful eyes of the gods and goddesses on Mount Olympus. But when Persephone meets the enigmatic Hades, she experiences something new: choice. Zeus calls Hades \"lord\" of the dead as a joke. In truth, Hades is the goddess of the underworld, and no friend of Zeus. She offers Persephone sanctuary in her land of the dead, so the young goddess may escape her Olympian destiny. But Persephone finds more than freedom in the underworld. She finds love, and herself."], "author": "Sarah Diemer", "num_pages": "264", "awards": ["Golden Crown Literary Award for Speculative Fiction (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-05-12 00:00:00", "ISBN": "1461179939"},
{"url": "https://www.goodreads.com/book/show/35140574-the-diminished", "num_ratings": "292", "num_reviews": "108", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Young Adult", "Young Adult Fantasy"], "title": "The Diminished", "description": ["In the Alskad Empire, nearly all are born with a twin, two halves to form one whole…yet some face the world alone. ", "The singleborn ", "A rare few are singleborn in each generation, and therefore given the right to rule by the gods and goddesses. Bo Trousillion is one of these few, born into the royal line and destined to rule. Though he has been chosen to succeed his great-aunt", "In the Alskad Empire, nearly all are born with a twin, two halves to form one whole…yet some face the world alone. ", "The singleborn ", "A rare few are singleborn in each generation, and therefore given the right to rule by the gods and goddesses. Bo Trousillion is one of these few, born into the royal line and destined to rule. Though he has been chosen to succeed his great-aunt, Queen Runa, as the leader of the Alskad Empire, Bo has never felt equal to the grand future before him. ", "The diminished ", "When one twin dies, the other usually follows, unable to face the world without their other half. Those who survive are considered diminished, doomed to succumb to the violent grief that inevitably destroys everyone whose twin has died. Such is the fate of Vi Abernathy, whose twin sister died in infancy. Raised by the anchorites of the temple after her family cast her off, Vi has spent her whole life scheming for a way to escape and live out what's left of her life in peace. ", "As their sixteenth birthdays approach, Bo and Vi face very different futures—one a life of luxury as the heir to the throne, the other years of backbreaking work as a temple servant. But a long-held secret and the fate of the empire are destined to bring them together in a way they never could have imagined."], "author": "Kaitlyn Sage Patterson", "num_pages": "454", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-04-10 00:00:00", "ISBN": "1335016414"},
{"url": "https://www.goodreads.com/book/show/26156987-if-i-was-your-girl", "num_ratings": "19,498", "num_reviews": "3,466", "avg_ratings": 4.01, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance", "Fiction"], "title": "If I Was Your Girl", "description": ["A new kind of big-hearted novel about being seen for who you really are.", "Amanda Hardy is the new girl in school. Like anyone else, all she wants is to make friends and fit in. But Amanda is keeping a secret, and she's determined not to get too close to anyone. ", "But when she meets sweet, easygoing Grant, Amanda can't help but start to let him into her life. As they spend more", "A new kind of big-hearted novel about being seen for who you really are.", "Amanda Hardy is the new girl in school. Like anyone else, all she wants is to make friends and fit in. But Amanda is keeping a secret, and she's determined not to get too close to anyone. ", "But when she meets sweet, easygoing Grant, Amanda can't help but start to let him into her life. As they spend more time together, she realizes just how much she is losing by guarding her heart. She finds herself yearning to share with Grant everything about herself, including her past. But Amanda's terrified that once she tells him the truth, he won't be able to see past it. ", "Because the secret that Amanda's been keeping? It's that at her old school, she used to be Andrew. Will the truth cost Amanda her new life, and her new love? ", "Meredith Russo's If I Was Your Girl is a universal story about feeling different and a love story that everyone will root for."], "author": "Meredith Russo", "num_pages": "280", "awards": ["Stonewall Book Award for Young Adult Literature (2017)", "Milwaukee County Teen Book Award Nominee (2017)", "Goodreads Choice Award Nominee for Young Adult Fiction (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-03 00:00:00", "ISBN": "1250078407"},
{"url": "https://www.goodreads.com/book/show/8849382-gone-gone-gone", "num_ratings": "2,712", "num_reviews": "360", "avg_ratings": 3.81, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance", "Realistic Fiction"], "title": "Gone, Gone, Gone", "description": ["It's a year after 9/11. Sniper shootings throughout the D.C. area have everyone on edge and trying to make sense of these random acts of violence. Meanwhile, Craig and Lio are just trying to make sense of their lives.", "It's a year after 9/11. Sniper shootings throughout the D.C. area have everyone on edge and trying to make sense of these random acts of violence. Meanwhile, Craig and Lio are just trying to make sense of their lives. ", "Craig’s crushing on quiet, distant Lio, and preoccupied with what it meant when Lio kissed him...and if he’ll do it again...and if kissing Lio will help him finally get over his ex-boyfriend, Cody.", "Lio feels most alive when he's with Craig. He forgets about his broken family, his dead brother, and the messed up world. But being with Craig means being vulnerable...and Lio will have to decide whether love is worth the risk.", "This intense, romantic novel from the author of ", " and ", " is a poignant look at what it is to feel needed, connected, and alive."], "author": "Hannah Moskowitz", "num_pages": "251", "awards": [], "places": [], "character_names": ["Craig Privett"], "language": "English", "publish_date": "2012-04-17 00:00:00", "ISBN": "1442453125"},
{"url": "https://www.goodreads.com/book/show/12883644-silhouette-of-a-sparrow", "num_ratings": "1,536", "num_reviews": "211", "avg_ratings": 3.74, "genres": ["Historical", "Historical Fiction", "Lgbt", "Young Adult", "Fiction", "Historical", "Glbt", "Queer", "Glbt", "Lesbian"], "title": "Silhouette of a Sparrow", "description": ["In the summer of 1926, sixteen-year-old Garnet Richardson is sent to a lake resort to escape the polio epidemic in the city. She dreams of indulging her passion for ornithology and visiting the famous new amusement park--a summer of fun before she returns for her final year of high school, after which she’s expected to marry a nice boy and settle into middle-class homemaki", "In the summer of 1926, sixteen-year-old Garnet Richardson is sent to a lake resort to escape the polio epidemic in the city. She dreams of indulging her passion for ornithology and visiting the famous new amusement park--a summer of fun before she returns for her final year of high school, after which she’s expected to marry a nice boy and settle into middle-class homemaking. But in the country, Garnet finds herself under the supervision of equally oppressive guardians--her father’s wealthy cousin and the matron’s stuck-up daughter. Only a liberating job in a hat shop, an intense, secret relationship with a daring and beautiful flapper, and a deep faith in her own fierce heart can save her from the suffocating boredom of traditional femininity.", " is a coming-of-age story about a search for wildness in a confining time, and a simultaneous quest for security in an era full of unrest. It is the tale of a young woman’s discovery of the science of risk and the art of rebellion, and of course, the power of unexpected love."], "author": "Molly Beth Griffin", "num_pages": "224", "awards": [], "places": ["Excelsior, Minnesota", "Minnesota"], "character_names": ["Isabella", "Garnet Richardson"], "language": "English", "publish_date": "2012-09-11 00:00:00", "ISBN": "1571317015"},
{"url": "https://www.goodreads.com/book/show/31944915-on-a-larp", "num_ratings": "53", "num_reviews": "28", "avg_ratings": 4.19, "genres": ["Young Adult", "Mystery", "Lgbt", "Glbt", "Queer", "Contemporary"], "title": "On a LARP", "description": ["And I promise you, if I somehow manage to survive this act o", "And I promise you, if I somehow manage to survive this act of immature-brain-encased-in-unbelievable-stupidity, I will gladly tell you exactly how I got here.", "Which, for the record, is chasing a dark-web killer through the middle of a live action role-playing game, better known as a LARP.", " introduces readers to self-described lesbionic brainiac geek and teen coder, Sid Rubin, a smartass—and super-smart—high school kid with a strong conscience and a knack for solving problems. This high concept, frenetic ride dives into the fascinating world of interactive role-playing when Sid recognizes the photo of a murder victim during an AP field trip to a police station. What starts out as an Aha! moment soon finds Sid and her unlikely posse of friends chasing a dark web killer through the middle of a live action role playing game. Sid and the gang work to unravel a deeply encrypted mystery while simultaneously enduring pop quizzes, endless Ted Talks, teenage heartbreak, suspicious parents, cosplay, and the irresistible lure of the NYC Public Library.", " is the author of the award-winning novel ", ". She has produced TV series such as ", ", and ", ", and was also the executive in charge of production for the series ", " and ", "."], "author": "Stefani Deoul", "num_pages": "200", "awards": ["Independent Publisher Book Award (IPPY) for Multicultural Fiction - Juv-Young Adult (Bronze) (2018)", "DPA Professional Communications Contest for Young Adult Books - Fiction (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-05-16 00:00:00", "ISBN": "1612940951"},
{"url": "https://www.goodreads.com/book/show/27158835-you-know-me-well", "num_ratings": "9,821", "num_reviews": "1,957", "avg_ratings": 3.79, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "You Know Me Well", "description": ["Mark and Kate have sat next to each other for an entire year, but have never spoken. For whatever reason, their paths outside of class have never crossed.", "That is, until Kate spots Mark miles away from home, out in the city for a wild, unexpected night. K", "Mark and Kate have sat next to each other for an entire year, but have never spoken. For whatever reason, their paths outside of class have never crossed.", "That is, until Kate spots Mark miles away from home, out in the city for a wild, unexpected night. Kate is lost, having just run away from a chance to finally meet the girl she has been in love with from afar. Mark, meanwhile, is in love with his best friend Ryan, who may or may not feel the same way.", "When Kate and Mark meet up, little do they know how important they will become to each other—and how, in a very short time, they will know each other better than any of the people who are supposed to know them more.", "Told in alternating points of view by Nina LaCour and David Levithan, ", " is a story about navigating the joys and heartaches of first love, one truth at a time."], "author": "Nina LaCour", "num_pages": "248", "awards": [], "places": ["San Francisco, California"], "character_names": [], "language": "English", "publish_date": "2016-06-07 00:00:00", "ISBN": "1250098645"},
{"url": "https://www.goodreads.com/book/show/16059426-love-in-the-time-of-global-warming", "num_ratings": "3,013", "num_reviews": "664", "avg_ratings": 3.38, "genres": ["Young Adult", "Fantasy", "Lgbt", "Science Fiction", "Dystopia", "Fiction"], "title": "Love in the Time of Global Warming", "description": ["Her life by the sea in ruins, Pen has lost everything in the Earth Shaker that all but destroyed the city of Los Angeles. She sets out into the wasteland to search for her family, her journey guided by a tattered copy of Homer’s Odyssey. Soon she begins to realize her own abilities and strength as she faces false promises of safety, the cloned giants who feast on humans, a", "Her life by the sea in ruins, Pen has lost everything in the Earth Shaker that all but destroyed the city of Los Angeles. She sets out into the wasteland to search for her family, her journey guided by a tattered copy of Homer’s Odyssey. Soon she begins to realize her own abilities and strength as she faces false promises of safety, the cloned giants who feast on humans, and a madman who wishes her dead. On her voyage, Pen learns to tell stories that reflect her strange visions, while she and her fellow survivors navigate the dangers that lie in wait. In her signature style, Francesca Lia Block has created a world that is beautiful in its destruction and as frightening as it is lovely. At the helm is Pen, a strong heroine who holds hope and love in her hands and refuses to be defeated."], "author": "Francesca Lia Block", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-27 00:00:00", "ISBN": "0805096272"},
{"url": "https://www.goodreads.com/book/show/13221769-beautiful-music-for-ugly-children", "num_ratings": "5,886", "num_reviews": "698", "avg_ratings": 3.92, "genres": ["Lgbt", "Young Adult", "Contemporary", "Fiction", "Glbt", "Queer"], "title": "Beautiful Music for Ugly Children", "description": ["\"This is Beautiful Music for Ugly Children, on community radio 90.3, KZUK. I'm Gabe. Welcome to my show.\"", "My birth name is Elizabeth, but I'm a guy. Gabe. My parents think I've gone crazy and the rest of the world is happy to agree with them, but I know I'm right. I've been a boy my whole life.", "When you think about it, I'm like a record. Elizabeth is my A side, the song ever", "\"This is Beautiful Music for Ugly Children, on community radio 90.3, KZUK. I'm Gabe. Welcome to my show.\"", "My birth name is Elizabeth, but I'm a guy. Gabe. My parents think I've gone crazy and the rest of the world is happy to agree with them, but I know I'm right. I've been a boy my whole life.", "When you think about it, I'm like a record. Elizabeth is my A side, the song everybody knows, and Gabe is my B side--not heard as often, but just as good.", "It's time to let my B side play."], "author": "Kirstin Cronn-Mills", "num_pages": "262", "awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2014)", "Green Mountain Book Award Nominee (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-08 00:00:00", "ISBN": "0738732516"},
{"url": "https://www.goodreads.com/book/show/11250317-the-song-of-achilles", "num_ratings": "86,060", "num_reviews": "11,914", "avg_ratings": 4.3, "genres": ["Historical", "Historical Fiction", "Fantasy", "Fantasy", "Mythology", "Lgbt", "Fiction", "Romance", "Historical"], "title": "The Song of Achilles", "description": ["Greece in the age of heroes. Patroclus, an awkward young prince, has been exiled to the court of King Peleus and his perfect son Achilles. By all rights their paths should never cross, but Achilles takes the shamed prince as his friend, and as they grow into young men skilled in the arts of war and medicine their bond blossoms into something deeper - despite the displeasur", "Greece in the age of heroes. Patroclus, an awkward young prince, has been exiled to the court of King Peleus and his perfect son Achilles. By all rights their paths should never cross, but Achilles takes the shamed prince as his friend, and as they grow into young men skilled in the arts of war and medicine their bond blossoms into something deeper - despite the displeasure of Achilles' mother Thetis, a cruel sea goddess. But then word comes that Helen of Sparta has been kidnapped. Torn between love and fear for his friend, Patroclus journeys with Achilles to Troy, little knowing that the years that follow will test everything they hold dear.", "Profoundly moving and breathtakingly original, this rendering of the epic Trojan War is a dazzling feat of the imagination, a devastating love story, and an almighty battle between gods and kings, peace and glory, immortal fame and the human heart."], "author": "Madeline Miller", "num_pages": "352", "awards": ["Orange Prize for Fiction (2012)", "Gaylactic Spectrum Award for Best Novel (2013)", "Chautauqua Prize Nominee (2013)"], "places": ["Troy", "Pthia"], "character_names": ["Achilles (Greek hero)", "Peleus", "Patroclus", "Thetis (mythology)"], "language": "English", "publish_date": "2011-09-20 00:00:00", "ISBN": "1408816032"},
{"url": "https://www.goodreads.com/book/show/23437156-six-of-crows", "num_ratings": "158,137", "num_reviews": "23,829", "avg_ratings": 4.46, "genres": ["Fantasy", "Young Adult"], "title": "Six of Crows", "description": ["Ketterdam: a bustling hub of international trade where anything can be had for the right price–and no one knows that better than criminal prodigy Kaz Brekker. Kaz is offered a chance at a deadly heist that could make him rich beyond his wildest dreams. But he can’t pull it off alone…", "Ketterdam: a bustling hub of international trade where anything can be had for the right price–and no one knows that better than criminal prodigy Kaz Brekker. Kaz is offered a chance at a deadly heist that could make him rich beyond his wildest dreams. But he can’t pull it off alone…", "Six dangerous outcasts. One impossible heist. Kaz’s crew is the only thing that might stand between the world and destruction—if they don’t kill each other first."], "author": "Leigh Bardugo", "num_pages": "466", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Milwaukee County Teen Book Award Nominee (2017)", "Lincoln Award (2018)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)", "Missouri Gateway Readers Award Nominee (2017)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2016)"], "places": ["Ketterdam"], "character_names": ["Inej Ghafa", "Kaz Brekker", "Jesper Fahey", "Wylan Van Eck", "Matthias Helvar", "Nina Zenik"], "language": "English", "publish_date": "2015-09-29 00:00:00", "ISBN": "1627792120"},
{"url": "https://www.goodreads.com/book/show/27220352-jerkbait", "num_ratings": "928", "num_reviews": "234", "avg_ratings": 3.59, "genres": ["Lgbt", "Young Adult", "Contemporary", "Sports and Games", "Sports"], "title": "Jerkbait", "description": ["Even though they're identical, Tristan isn't close to his twin Robbie at all—until Robbie tries to kill himself. ", "Forced to share a room to prevent Robbie from hurting himself, the brothers begin to feel the weight of each other's lives on the ice, and off. Tristan starts seeing his twin not as a hockey star whose shadow Tristan can't escape, but a struggling gay teen terri", "Even though they're identical, Tristan isn't close to his twin Robbie at all—until Robbie tries to kill himself. ", "Forced to share a room to prevent Robbie from hurting himself, the brothers begin to feel the weight of each other's lives on the ice, and off. Tristan starts seeing his twin not as a hockey star whose shadow Tristan can't escape, but a struggling gay teen terrified about coming out in the professional sports world. Robbie's future in the NHL is plagued by anxiety and the mounting pressure from their dad, coach, and scouts, while Tristan desperately fights to create his own future, not as a hockey player but a musical theatre performer. ", "As their season progresses and friends turn out to be enemies, Robbie finds solace in an online stranger known only as “Jimmy2416.” Between keeping Robbie's secret and saving him from taking his life, Tristan is given the final call: sacrifice his dream for a brother he barely knows, or pursue his own path. How far is Robbie willing to go—and more importantly, how far is Tristan willing to go to help him?"], "author": "Mia Siegert", "num_pages": "350", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-03 00:00:00", "ISBN": "1631630660"},
{"url": "https://www.goodreads.com/book/show/18367581-afterworlds", "num_ratings": "17,302", "num_reviews": "2,891", "avg_ratings": 3.73, "genres": ["Young Adult", "Fantasy", "Fantasy", "Paranormal", "Contemporary"], "title": "Afterworlds", "description": ["BELIEVING IS DANGEROUS...", "Darcy Patel is afraid to believe all the hype. But it's really happening - her teen novel is getting published. Instead of heading to college, she's living in New York City, where she's welcomed into the dazzling world of YA publishing. That means book tours, parties with her favorite authors, and finding a place to live that won't leave her pennil", "BELIEVING IS DANGEROUS...", "Darcy Patel is afraid to believe all the hype. But it's really happening - her teen novel is getting published. Instead of heading to college, she's living in New York City, where she's welcomed into the dazzling world of YA publishing. That means book tours, parties with her favorite authors, and finding a place to live that won't leave her penniless. It means sleepless nights rewriting her first draft and struggling to find the perfect ending... all while dealing with the intoxicating, terrifying experience of falling in love - with another writer.", "Told in alternating chapters is Darcy's novel, the thrilling story of Lizzie, who wills her way into the afterworld to survive a deadly terrorist attack. With survival comes the responsibility to guide the restless spirits that walk our world, including one ghost with whom she shares a surprising personal connection. But Lizzie's not alone in her new calling - she has counsel from a fellow spirit guide, a very desirable one, who is torn between wanting Lizzie and warning her that...", "BELIEVING IS DANGEROUS.", "In a brilliant high-wire act of weaving two epic narratives - and two unforgettable heroines - into one novel, Scott Westerfeld's latest work is a triumph of storytelling."], "author": "Scott Westerfeld", "num_pages": "599", "awards": ["Aurealis Award Nominee for Best Fantasy Novel & for Best Young Adult (Shortlist) (2014)", "The Inky Awards Nominee for Silver Inky (2015)"], "places": [], "character_names": ["Darcy Patel"], "language": "English", "publish_date": "2014-09-23 00:00:00", "ISBN": "1481422340"},
{"url": "https://www.goodreads.com/book/show/32469736-the-disasters", "num_ratings": "58", "num_reviews": "33", "avg_ratings": 4.26, "genres": ["Young Adult", "Science Fiction"], "title": "The Disasters", "description": ["Hotshot pilot Nax Hall has a history of making poor life choices. So it’s not exactly a surprise when he’s kicked out of the elite Ellis Station Academy in less than twenty-four hours.", "But Nax’s one-way trip back to Earth is cut short when a terrorist group attacks the Academy. Nax and three other washouts escape—barely—but they’re also the sole witnesses to the biggest cri", "Hotshot pilot Nax Hall has a history of making poor life choices. So it’s not exactly a surprise when he’s kicked out of the elite Ellis Station Academy in less than twenty-four hours.", "But Nax’s one-way trip back to Earth is cut short when a terrorist group attacks the Academy. Nax and three other washouts escape—barely—but they’re also the sole witnesses to the biggest crime in the history of space colonization. And the perfect scapegoats.", "On the run and framed for atrocities they didn’t commit, Nax and his fellow failures execute a dangerous heist to spread the truth about what happened at the Academy.", "They may not be “Academy material,” and they may not get along, but they’re the only ones left to step up and fight."], "author": "M.K. England", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0062657674"},
{"url": "https://www.goodreads.com/book/show/13149420-quicksilver", "num_ratings": "2,024", "num_reviews": "346", "avg_ratings": 3.93, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Paranormal", "Fantasy", "Science Fiction", "Aliens"], "title": "Quicksilver", "description": ["Back in her hometown, Tori Beaugrand had everything a teenaged girl could want—popularity, money, beauty. But she also had a secret. A secret that could change her life in an instant, or destroy it.", "Now she’s left everything from her old life behind, including her real name and Alison, the one friend who truly understood her. She can’t escape who and what she is. But if she", "Back in her hometown, Tori Beaugrand had everything a teenaged girl could want—popularity, money, beauty. But she also had a secret. A secret that could change her life in an instant, or destroy it.", "Now she’s left everything from her old life behind, including her real name and Alison, the one friend who truly understood her. She can’t escape who and what she is. But if she wants to have anything like a normal life, she has to blend in and hide her unusual... talents.", "Plans change when the enigmatic Sebastian Faraday reappears and gives Tori some bad news: she hasn’t escaped her past. In fact, she’s attracted new interest in the form of an obsessed ex-cop turned investigator for a genetics lab.", "She has one last shot at getting her enemies off her trail and winning the security and independence she’s always longed for. But saving herself will take every ounce of Tori’s incredible electronics and engineering skills—and even then, she may need to sacrifice more than she could possibly imagine if she wants to be free."], "author": "R.J. Anderson", "num_pages": "375", "awards": [], "places": ["Kitchener, Ontario"], "character_names": [], "language": "English", "publish_date": "2013-05-02 00:00:00", "ISBN": "1408316285"},
{"url": "https://www.goodreads.com/book/show/18090059-great", "num_ratings": "2,343", "num_reviews": "359", "avg_ratings": 3.56, "genres": ["Young Adult", "Contemporary", "Retellings", "Lgbt", "Fiction"], "title": "Great", "description": ["Everyone loves a good scandal.", "Naomi Rye usually dreads spending the summer with her socialite mother in East Hampton. This year is no different. She sticks out like a s", "Everyone loves a good scandal.", "Naomi Rye usually dreads spending the summer with her socialite mother in East Hampton. This year is no different. She sticks out like a sore thumb among the teenagers who have been summering (a verb only the very rich use) together for years. But Naomi finds herself captivated by her mysterious next-door neighbor, Jacinta. Jacinta has her own reason for drawing close to Naomi-to meet the beautiful and untouchable Delilah Fairweather. But Jacinta's carefully constructed world is hiding something huge, a secret that could undo everything. And Naomi must decide how far she is willing to be pulled into this web of lies and deception before she is unable to escape.", "Based on a beloved classic and steeped in Sara Benincasa's darkly comic voice, Great has all the drama, glitz, and romance with a terrific modern (and scandalous) twist to enthrall readers."], "author": "Sara Benincasa", "num_pages": "263", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-08 00:00:00", "ISBN": "0062222694"},
{"url": "https://www.goodreads.com/book/show/18374991-letters-to-a-shooting-star", "num_ratings": "15", "num_reviews": "8", "avg_ratings": 3.87, "genres": ["Lgbt", "Young Adult", "Teen", "Glbt", "Gay"], "title": "Letters to a Shooting Star", "description": ["Letters to a Shooting Star is an earlier version of Keith Hale's novel What Daniel Did With His Life."], "author": "Keith Hale", "num_pages": "186", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-25 00:00:00", "ISBN": "0615874118"},
{"url": "https://www.goodreads.com/book/show/15739649-made-of-stars", "num_ratings": "878", "num_reviews": "226", "avg_ratings": 3.93, "genres": ["Young Adult", "Contemporary", "Lgbt", "Romance", "Mystery"], "title": "Made of Stars", "description": ["When eighteen-year-old Hunter Jackson and his half sister, Ashlin, return to their dad’s for the first winter in years, they expect everything to be just like the warmer months they’d spent there as kids. And it is—at first. But Chance, the charismatic and adventurous boy who made their summers epic, is harboring deep secrets. Secrets that are quickly spiraling into someth", "When eighteen-year-old Hunter Jackson and his half sister, Ashlin, return to their dad’s for the first winter in years, they expect everything to be just like the warmer months they’d spent there as kids. And it is—at first. But Chance, the charismatic and adventurous boy who made their summers epic, is harboring deep secrets. Secrets that are quickly spiraling into something else entirely.", "The reason they've never met Chance’s parents or seen his home is becoming clearer. And what the siblings used to think of as Chance's quirks—the outrageous stories, his clinginess, his dangerous impulsiveness—are now warning signs that something is seriously off. ", "Then Chance's mom turns up with a bullet to the head, and all eyes shift to Chance and his dad. Hunter and Ashlin know Chance is innocent...they just have to prove it. But how can they protect the boy they both love when they can’t trust a word Chance says?"], "author": "Kelley York", "num_pages": "320", "awards": [], "places": ["Maine"], "character_names": [], "language": "English", "publish_date": "2013-10-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22091645-every-inferno", "num_ratings": "95", "num_reviews": "33", "avg_ratings": 4.04, "genres": ["Young Adult", "Romance", "M M Romance", "Contemporary", "Romance", "Lgbt", "Mystery", "Glbt", "Gay"], "title": "Every Inferno", "description": ["Depressed. Defiant. Possible alcoholic. These are just a few of the terms used to describe fifteen-year-old Jacob Jasper Jones. Lately, though, JJ has a new one to add to the list: detective. He’s been having strange dreams about the fire that killed his parents ten years ago, and he thinks he finally has the clue to catching the arsonist who destroyed his family. ", "A murder", "Depressed. Defiant. Possible alcoholic. These are just a few of the terms used to describe fifteen-year-old Jacob Jasper Jones. Lately, though, JJ has a new one to add to the list: detective. He’s been having strange dreams about the fire that killed his parents ten years ago, and he thinks he finally has the clue to catching the arsonist who destroyed his family. ", "A murder investigation isn’t the only thing the dreams trigger for JJ. They also lead to secret meetings with his estranged sister, an unlikely connection with a doctor who lost his daughter in the fire, and a confusing friendship with McKinley, a classmate of JJ’s who seems determined to help him solve the mystery. ", "All JJ wants is to shake the problems that have followed him since that fire, and he’s convinced he must catch the arsonist to do it. But as JJ struggles to find the culprit, he sees there’s more than one mystery in his life he needs to solve."], "author": "Johanna Parkhurst", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-24 00:00:00", "ISBN": "1627987983"},
{"url": "https://www.goodreads.com/book/show/25449303-a-harvest-of-ripe-figs", "num_ratings": "168", "num_reviews": "42", "avg_ratings": 4.29, "genres": ["Fantasy", "Glbt", "Lesbian", "Lgbt", "Glbt", "Queer", "Lgbt", "Transgender", "Fiction", "Young Adult"], "title": "A Harvest of Ripe Figs", "description": ["Esther of the Singing Hands is Perach's Sweetheart, a young and beautiful musician with a Girl Next Door image. When her violin is stolen after a concert in the capital city, she doesn't expect the queen herself to show up, intent upon solving the mystery. But Queen Shulamit -- lesbian, intellectual, and mother of the six-month-old crown princess -- loves to play detective", "Esther of the Singing Hands is Perach's Sweetheart, a young and beautiful musician with a Girl Next Door image. When her violin is stolen after a concert in the capital city, she doesn't expect the queen herself to show up, intent upon solving the mystery. But Queen Shulamit -- lesbian, intellectual, and mother of the six-month-old crown princess -- loves to play detective. With the help of her legendary bodyguard Rivka and her dragon, and with the support of her partner Aviva the Chef, Shulamit turns her mind toward the solution -- which she quickly begins to suspect involves the use of illegal magic that could threaten the safety of her citizens."], "author": "Shira Glassman", "num_pages": "228", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-21 00:00:00", "ISBN": "161040873X"},
{"url": "https://www.goodreads.com/book/show/17907357-that-witch", "num_ratings": "147", "num_reviews": "20", "avg_ratings": 3.66, "genres": ["Young Adult", "Glbt", "Lesbian", "Lgbt", "Romance", "Fantasy", "New Adult", "Paranormal", "Witches", "Young Adult", "Teen"], "title": "That Witch!", "description": ["Cassidy Ryan and Brynn Michaels attend the same high school, but they live in different worlds. Cassidy’s a popular cheerleader, and Brynn’s the social leper. One is all sunshine and rainbows, while the other could’ve been carved from an Edgar Allan Poe book.", "Both girls have their problems, though. Cassidy is coming into her birthright—a long line of ancient magic Cassidy i", "Cassidy Ryan and Brynn Michaels attend the same high school, but they live in different worlds. Cassidy’s a popular cheerleader, and Brynn’s the social leper. One is all sunshine and rainbows, while the other could’ve been carved from an Edgar Allan Poe book.", "Both girls have their problems, though. Cassidy is coming into her birthright—a long line of ancient magic Cassidy isn’t ready to have. Brynn is coming into her sexuality—something that will definitely cause problems with her very conservative family.", "When a teacher assigns Cassidy and Brynn to work together on a project, the girls find themselves in a heap of trouble, because what they feel for each other can’t be denied. If they have any hope of changing ignorant and frightened minds, they’ll have to listen to their own hearts first."], "author": "Zoe Lynne", "num_pages": "204", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-16 00:00:00", "ISBN": "1623806933"},
{"url": "https://www.goodreads.com/book/show/25414982-out-of-order", "num_ratings": "74", "num_reviews": "34", "avg_ratings": 3.84, "genres": ["Young Adult", "Contemporary", "Lgbt", "Romance", "Glbt", "Queer"], "title": "Out of Order", "description": ["Corinna “Corey” Nguyen’s life seems perfectly average for a closeted bisexual whiz kid with her eyes on college and a budding romance with her friend Kate. Sixteen and navigating senior year with her tight-knit group of best friends through crushes, breakups, and pregnancy scares, Corey mistakenly believes that running for valedictorian and choosing the right college are t", "Corinna “Corey” Nguyen’s life seems perfectly average for a closeted bisexual whiz kid with her eyes on college and a budding romance with her friend Kate. Sixteen and navigating senior year with her tight-knit group of best friends through crushes, breakups, and pregnancy scares, Corey mistakenly believes that running for valedictorian and choosing the right college are the worst of her worries. That is, until prom night, when she’s left alone and in shock, hiding inside a diner restroom, the only witness to a multiple homicide.", "With graduation looming, the pressure is on for Corey to identify the killer and ensure that the crime that has changed her life forever will not go unpunished."], "author": "Casey Lawrence", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-21 00:00:00", "ISBN": "1634760123"},
{"url": "https://www.goodreads.com/book/show/21873143-born-to-run", "num_ratings": "89", "num_reviews": "21", "avg_ratings": 4.07, "genres": ["Animals", "Horses", "Fiction", "Young Adult", "Lgbt"], "title": "Born to Run", "description": ["Experience the glamorous, fast paced world of horse racing in the young adult series North Oak.", "Running away from the scene of a murder is not how Alexandra pictured spending her thirteenth birthday. ", "Then again, she wasn't expecting to be swept into a world of high stakes racing and multi-million dollar horse flesh a few days later either.", "Alexandra Anderson is on the run fr", "Experience the glamorous, fast paced world of horse racing in the young adult series North Oak.", "Running away from the scene of a murder is not how Alexandra pictured spending her thirteenth birthday. ", "Then again, she wasn't expecting to be swept into a world of high stakes racing and multi-million dollar horse flesh a few days later either.", "Alexandra Anderson is on the run from the law. When the thirteen year old orphan can run no further, she collapses at the gates of the prestigious racing and breeding farm, North Oak. Horse racing strikes a deep chord in her. She hears a higher calling in the jingle jangle of bit and stirrup and in the thunder of hooves in the turn for home. It tells her she has a place in the world. But when the racing headlines find her on the front of every sports page, she realizes North Oak is no longer a safe haven... or is it?"], "author": "Ann  Hunter", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18072458-the-old-arbutus-tree", "num_ratings": "13", "num_reviews": "5", "avg_ratings": 4.46, "genres": ["Lgbt", "Glbt", "Queer", "Glbt", "Gay"], "title": "The Old Arbutus Tree", "description": ["Stuck in a small town in Alberta, Rose misses her father and watches in horror as a local widower wins over both her mother and sister. She finds solace in a fellow nerd, Jason, but when her sister, Sara, is violently assaulted Rose must decide whether to stick to the town's story or find the strength to help a friend.", "Exploring the vulnerability of difference in a closed c", "Stuck in a small town in Alberta, Rose misses her father and watches in horror as a local widower wins over both her mother and sister. She finds solace in a fellow nerd, Jason, but when her sister, Sara, is violently assaulted Rose must decide whether to stick to the town's story or find the strength to help a friend.", "Exploring the vulnerability of difference in a closed community, The Old Arbutus Tree is a story of discovery, empathy and learning how and who to trust. It lays bare the common confusion of adolescent sexual identity and the devastating effects of a small town's prejudice. When power, privilege and access conspire against justice, Rose and Jason are forced to see how desire is policed by our peers, our town, and the wider judicial and medical establishments. Can they help each other recognise real love, in whatever form it comes, and give themselves permission to accept it?", "Detailing the events leading up to an unknown gunman opening fire in the town of Pitcher Creek, The Old Arbutus Tree forces us to consider how violence begets violence and how we can break free of this cycle. Is sexual difference really something to fear? How did government-sanctioned institutions in 1980s Canada fail young men as they discovered love for the first time, with each other? Does tragedy need to hit a whole community, not just a single family, before someone speaks up for those without a voice?"], "author": "Leigh  Matthews", "num_pages": "188", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-01 00:00:00", "ISBN": "0992022401"},
{"url": "https://www.goodreads.com/book/show/23574690-cody", "num_ratings": "299", "num_reviews": "37", "avg_ratings": 3.89, "genres": ["Lgbt", "Glbt", "Gay", "Young Adult", "Fiction", "Romance", "Romance", "M M Romance"], "title": "Cody: Clicking Beat on the Brink of Nada", "description": ["By turns funny, romantic, erotic, and sad, this evocative novel brilliantly recreates the landscape of late adolescence, when friendships seem eternal and loves reincarnate. Set in Arkansas but first published in Amsterdam under the title Clicking Beat on the Brink of Nada, Cody quickly won praise from reviewers and readers across Europe and North America and caught the at", "By turns funny, romantic, erotic, and sad, this evocative novel brilliantly recreates the landscape of late adolescence, when friendships seem eternal and loves reincarnate. Set in Arkansas but first published in Amsterdam under the title Clicking Beat on the Brink of Nada, Cody quickly won praise from reviewers and readers across Europe and North America and caught the attention of William S. Burroughs and other writers who befriended the young author (Hale began writing the novel when he was sixteen). The first edition of the book was immediately banned in the United Kingdom during Margaret Thatcher's Operation Tiger. Today, Clicking Beat remains current and continues to be unique in both coming of age literature and the gay literary canon."], "author": "Keith Hale", "num_pages": "262", "awards": [], "places": ["Little Rock, Arkansas", "Arkansas"], "character_names": ["Steven Trottingham \"Trotsky\" Taylor", "Washington Damon Cody"], "language": "English", "publish_date": "2014-05-22 00:00:00", "ISBN": "069222453X"},
{"url": "https://www.goodreads.com/book/show/16085457-shadow-scale", "num_ratings": "13,859", "num_reviews": "2,303", "avg_ratings": 3.73, "genres": ["Fantasy", "Young Adult", "Fantasy", "Dragons", "Fiction", "Fantasy", "High Fantasy"], "title": "Shadow Scale", "description": ["The kingdom of Goredd: a world where humans and dragons share life with an uneasy balance, and those few who are both human and dragon must hide the truth. Seraphina is on", "The kingdom of Goredd: a world where humans and dragons share life with an uneasy balance, and those few who are both human and dragon must hide the truth. Seraphina is one of these, part girl, part dragon, who is reluctantly drawn into the politics of her world. When war breaks out between the dragons and humans, she must travel the lands to find those like herself—for she has an inexplicable connection to all of them, and together they will be able to fight the dragons in powerful, magical ways. ", "As Seraphina gathers this motley crew, she is pursued by humans who want to stop her. But the most terrifying is another half dragon, who can creep into people’s minds and take them over. Until now, Seraphina has kept her mind safe from intruders, but that also means she’s held back her own gift. It is time to make a choice: Cling to the safety of her old life, or embrace a powerful new destiny?"], "author": "Rachel Hartman", "num_pages": "602", "awards": ["Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-10 00:00:00", "ISBN": "0375866574"},
{"url": "https://www.goodreads.com/book/show/28245707-queens-of-geek", "num_ratings": "4,967", "num_reviews": "1,602", "avg_ratings": 3.94, "genres": ["Contemporary", "Young Adult", "Lgbt", "Romance"], "title": "Queens of Geek", "description": ["Charlie likes to stand out. She’s a vlogger and actress promoting her first movie at SupaCon, and this is her chance to show fans she’s over her public breakup with co-star Reese Ryan. When internet-famous c", "Charlie likes to stand out. She’s a vlogger and actress promoting her first movie at SupaCon, and this is her chance to show fans she’s over her public breakup with co-star Reese Ryan. When internet-famous cool-girl actress Alyssa Huntington arrives as a surprise guest, it seems Charlie’s long-time crush on her isn’t as one-sided as she thought.", "Taylor likes to blend in. Her brain is wired differently, making her fear change. And there’s one thing in her life she knows will never change: her friendship with her best guy friend Jamie—no matter how much she may secretly want it to. But when she hears about a fan contest for her favorite fandom, she starts to rethink her rules on playing it safe.", "k by Jen Wilde, chosen by readers like you for Macmillan's young adult imprint Swoon Reads, is an empowering novel for anyone who has ever felt that fandom is family."], "author": "Jen  Wilde", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-03-14 00:00:00", "ISBN": "1250111390"},
{"url": "https://www.goodreads.com/book/show/28220826-when-the-moon-was-ours", "num_ratings": "4,306", "num_reviews": "1,215", "avg_ratings": 3.96, "genres": ["Young Adult", "Fantasy", "Magical Realism", "Lgbt"], "title": "When the Moon Was Ours", "description": ["To everyone who knows them, best friends Miel and Sam are as strange as they are inseparable. Roses grow out of Miel’s wrist, and rumors say that she spilled out of a water tower when she was five. Sam is known for the moons he paints and hangs in the trees, and for how little anyone knows about his life before he and his mother moved to town. But as odd as everyone consid", "To everyone who knows them, best friends Miel and Sam are as strange as they are inseparable. Roses grow out of Miel’s wrist, and rumors say that she spilled out of a water tower when she was five. Sam is known for the moons he paints and hangs in the trees, and for how little anyone knows about his life before he and his mother moved to town. But as odd as everyone considers Miel and Sam, even they stay away from the Bonner girls, four beautiful sisters rumored to be witches. Now they want the roses that grow from Miel’s skin, convinced that their scent can make anyone fall in love. And they’re willing to use every secret Miel has fought to protect to make sure she gives them up."], "author": "Anna-Marie McLemore", "num_pages": "288", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2017)", "James Tiptree Jr. Award (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-04 00:00:00", "ISBN": "125005866X"},
{"url": "https://www.goodreads.com/book/show/17900792-not-otherwise-specified", "num_ratings": "1,483", "num_reviews": "328", "avg_ratings": 3.79, "genres": ["Young Adult", "Lgbt", "Contemporary", "Glbt", "Queer", "Fiction", "Health", "Mental Health"], "title": "Not Otherwise Specified", "description": ["Etta is tired of dealing with all of the labels and categories that seem so important to everyone else in her small Nebraska hometown.", "Everywhere she turns, someone feels she's too fringe for the fringe. Not gay enough for the Dykes, her ex-clique, thanks to a recent relationship with a boy; not tiny and white enough for ballet, her first passion; and not sick enough to loo", "Etta is tired of dealing with all of the labels and categories that seem so important to everyone else in her small Nebraska hometown.", "Everywhere she turns, someone feels she's too fringe for the fringe. Not gay enough for the Dykes, her ex-clique, thanks to a recent relationship with a boy; not tiny and white enough for ballet, her first passion; and not sick enough to look anorexic (partially thanks to recovery). Etta doesn’t fit anywhere— until she meets Bianca, the straight, white, Christian, and seriously sick girl in Etta’s therapy group. Both girls are auditioning for Brentwood, a prestigious New York theater academy that is so not Nebraska. Bianca seems like Etta’s salvation, but how can Etta be saved by a girl who needs saving herself? ", "The latest powerful, original novel from Hannah Moskowitz is the story about living in and outside communities and stereotypes, and defining your own identity."], "author": "Hannah Moskowitz", "num_pages": "304", "awards": ["Bisexual Book Award for Teen/YA Fiction (2015)"], "places": ["Nebraska"], "character_names": [], "language": "English", "publish_date": "2015-03-03 00:00:00", "ISBN": "1481405985"},
{"url": "https://www.goodreads.com/book/show/6725896-a-love-story-starring-my-dead-best-friend", "num_ratings": "2,140", "num_reviews": "265", "avg_ratings": 3.68, "genres": ["Lgbt", "Young Adult", "Romance", "Fiction", "Contemporary", "Glbt", "Queer"], "title": "A Love Story Starring My Dead Best Friend", "description": ["For months, Cass Meyer has heard her best friend Julia, a wannabe Broadway composer, whispering about a top-secret project. Then Julia is killed in a sudden car accident, and while Cass is still reeling from her death, Julia’s boyfriend and her other drama friends make it their mission to bring to fruition the nearly-completed secret project: a musical about an orphaned ni", "For months, Cass Meyer has heard her best friend Julia, a wannabe Broadway composer, whispering about a top-secret project. Then Julia is killed in a sudden car accident, and while Cass is still reeling from her death, Julia’s boyfriend and her other drama friends make it their mission to bring to fruition the nearly-completed secret project: a musical about an orphaned ninja princess entitled ", ".", "Cass isn’t one of the drama people. She doesn’t feel at home with Julia’s drama friends, and she doesn’t see a place for her in the play. Things only get worse when she finds out that Heather Galloway, the girl who made her miserable all through middle school, has been cast as the ninja princess.", "Cass can’t take a summer of swallowing her pride and painting sets, so she decides to follow her original plan for a cross-country road trip with Julia. Even if she has a touring bicycle instead of a driver’s license, and even if Julia’s ashes are coming along in Tupperware.", " is a story about friendship. About love. About traveling a thousand miles just to find yourself. About making peace with the past, and making sense of it. And it’s a story about the bloodiest high school musical one quiet suburb has ever seen."], "author": "Emily Horner", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-06-10 00:00:00", "ISBN": "0803734204"},
{"url": "https://www.goodreads.com/book/show/29502206-pantomime", "num_ratings": "2,602", "num_reviews": "567", "avg_ratings": 3.91, "genres": ["Fantasy", "Young Adult", "Lgbt", "Glbt", "Queer", "Fiction"], "title": "Pantomime", "description": ["Gene's life resembles a debutante's dream. Yet she hides a secret that would see her shunned by the nobility. Gene is both male and female. Then she displays unwanted magical abilities - last seen in mysterious beings from an almost-forgotten age. Matters escalate further when her parents plan a devastating be", "Gene's life resembles a debutante's dream. Yet she hides a secret that would see her shunned by the nobility. Gene is both male and female. Then she displays unwanted magical abilities - last seen in mysterious beings from an almost-forgotten age. Matters escalate further when her parents plan a devastating betrayal, so she flees home, dressed as a boy.", " The city beyond contains glowing glass relics from a lost civilization. They call to her, but she wants freedom not mysteries. So, reinvented as 'Micah Grey', Gene joins the circus. As an aerialist, she discovers the joy of flight - but the circus has a dark side. She's also plagued by visions foretelling danger. A storm is howling in from the past, but will she heed its roar?"], "author": "Laura Lam", "num_pages": "386", "awards": ["North East Teenage Book Award Nominee (2013)", "Catalyst Book Award Nominee (2014)", "Cybils Award Nominee (2014)", "Bisexual Book Award for Speculative Fiction (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-11-17 00:00:00", "ISBN": "1509807772"},
{"url": "https://www.goodreads.com/book/show/17227209-guardian", "num_ratings": "2,710", "num_reviews": "403", "avg_ratings": 3.97, "genres": ["Young Adult", "Lgbt", "Science Fiction", "Dystopia", "Science Fiction"], "title": "Guardian", "description": ["The pulse-pounding sequel to Proxy! Inspired by The Whipping Boy and Feed, this adrenaline-fueled thriller will appeal to fans of The Hunger Games and Divergent.", "In the new world led by the Rebooters, former Proxy Syd is the figurehead of the Revolution, beloved by some and hated by others. Liam, a seventeen-year-old Rebooter, is Syd’s bodyguard and must protect him with hi", "The pulse-pounding sequel to Proxy! Inspired by The Whipping Boy and Feed, this adrenaline-fueled thriller will appeal to fans of The Hunger Games and Divergent.", "In the new world led by the Rebooters, former Proxy Syd is the figurehead of the Revolution, beloved by some and hated by others. Liam, a seventeen-year-old Rebooter, is Syd’s bodyguard and must protect him with his life. But armed Machinists aren’t the only danger.", "People are falling ill—their veins show through their skin, they find it hard to speak, and sores erupt all over their bodies. Guardians, the violent enforcers of the old system, are hit first, and the government does nothing to help. The old elites fall next, and in the face of an indifferent government, Syd decides it’s up to him to find a cure . . . and what he discovers leaves him stunned.", "This heart-stopping thriller is packed with action, adventure, and heroics. Guardian will leave you breathless until the final page.", "A fast-paced, thrill-ride of novel full of non-stop action, heart-hammering suspense and true friendship—just as moving as it is exhilarating. Fans of Anthony Horowitz's Alex Rider series, James Dashner's Maze Runner, Patrick Ness's Chaos Walking series, and Marie Lu's Legend trilogy will be swept away by this story."], "author": "Alex London", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18079804-half-bad", "num_ratings": "36,915", "num_reviews": "6,001", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Magic"], "title": "Half Bad", "description": ["Sixteen-year-old Nathan lives in a cage: beaten, shackled, trained to kill. In a modern-day England where two warring factions of witches live amongst humans, Nathan is an abomination, the illegitimate son of the world's most terrifying and violent witch, Marcus. Nathan's only hope for survival is to escape his captors, track down Marcus", "Sixteen-year-old Nathan lives in a cage: beaten, shackled, trained to kill. In a modern-day England where two warring factions of witches live amongst humans, Nathan is an abomination, the illegitimate son of the world's most terrifying and violent witch, Marcus. Nathan's only hope for survival is to escape his captors, track down Marcus, and receive the three gifts that will bring him into his own magical powers—before it's too late. But how can Nathan find his father when there is no one safe to trust, not even family, not even the girl he loves?", " is an international sensation and the start of a brilliant trilogy: a gripping tale of alienation and the indomitable will to survive."], "author": "Sally Green", "num_pages": "394", "awards": ["The Inky Awards Nominee for Silver Inky (2015)", "Goodreads Choice Award Nominee for Debut Goodreads Author (2014)", "YA Book Prize Nominee (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-04 00:00:00", "ISBN": "0670016780"},
{"url": "https://www.goodreads.com/book/show/20814989-half-wild", "num_ratings": "14,765", "num_reviews": "2,401", "avg_ratings": 4.02, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal", "Lgbt"], "title": "Half Wild", "description": ["In a modern-day England where two warring factions of witches live amongst humans, seventeen-year-old Nathan is an abomination, the illegitimate son of the world's most powerful and violent witch. Nathan is hunted from all sides: nowhere is safe and no one can be trusted. Now, Nat", "In a modern-day England where two warring factions of witches live amongst humans, seventeen-year-old Nathan is an abomination, the illegitimate son of the world's most powerful and violent witch. Nathan is hunted from all sides: nowhere is safe and no one can be trusted. Now, Nathan has come into his own unique magical Gift, and he's on the run--but the Hunters are close behind, and they will stop at nothing until they have captured Nathan and destroyed his father."], "author": "Sally Green", "num_pages": "412", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-24 00:00:00", "ISBN": "0670017132"},
{"url": "https://www.goodreads.com/book/show/28919058-autoboyography", "num_ratings": "9,080", "num_reviews": "2,192", "avg_ratings": 4.38, "genres": ["Young Adult", "Contemporary", "Lgbt", "Romance"], "title": "Autoboyography", "description": ["Three years ago, Tanner Scott’s family relocated from California to Utah, a move that nudged the bisexual teen temporarily back into the closet. Now, with one semester of high school to go, and no obstacles between him and out-of-state college freedom, Tanner plans to coast through his remaining classes and clear out of Utah.", "But when his best friend Autumn dares him to tak", "Three years ago, Tanner Scott’s family relocated from California to Utah, a move that nudged the bisexual teen temporarily back into the closet. Now, with one semester of high school to go, and no obstacles between him and out-of-state college freedom, Tanner plans to coast through his remaining classes and clear out of Utah.", "But when his best friend Autumn dares him to take Provo High’s prestigious Seminar—where honor roll students diligently toil to draft a book in a semester—Tanner can’t resist going against his better judgment and having a go, if only to prove to Autumn how silly the whole thing is. Writing a book in four months sounds simple. Four months is an eternity.", "It turns out, Tanner is only partly right: four months is a long time. After all, it takes only one second for him to notice Sebastian Brother, the Mormon prodigy who sold his own Seminar novel the year before and who now mentors the class. And it takes less than a month for Tanner to fall completely in love with him."], "author": "Christina Lauren", "num_pages": "407", "awards": ["Lambda Literary Award Nominee for LGBTQ Children’s/Young Adult (2018)", "Goodreads Choice Award Nominee for Young Adult Fiction (2017)"], "places": ["Utah"], "character_names": [], "language": "English", "publish_date": "2017-09-12 00:00:00", "ISBN": "1481481681"},
{"url": "https://www.goodreads.com/book/show/17727299-twixt", "num_ratings": "420", "num_reviews": "56", "avg_ratings": 3.96, "genres": ["Fantasy", "Lgbt", "Young Adult", "Glbt", "Lesbian", "Glbt", "Queer"], "title": "Twixt", "description": ["You wake upon the cold ground. As you struggle to rise, as your breath exhales like a ghost, you know only two things: You can’t remember who you are. And you’re being hunted.", "No one sleeps in Abeo City. The lost souls gather indoors at night as Snatchers tear through the sky on black-feathered wings, stalking them. But inside the rotting walls of the Safe Houses comes a qu", "You wake upon the cold ground. As you struggle to rise, as your breath exhales like a ghost, you know only two things: You can’t remember who you are. And you’re being hunted.", "No one sleeps in Abeo City. The lost souls gather indoors at night as Snatchers tear through the sky on black-feathered wings, stalking them. But inside the rotting walls of the Safe Houses comes a quieter, creeping danger. The people of Abeo City have forgotten their pasts, and they can trade locks of their hair to sinister women known only as the Sixers for an addictive drug. Nox will give you back a single memory--for a price.", "Like the other lost souls, Lottie wakens in this harsh landscape and runs in terror from the Snatchers. But she soon comes to realize that she is not at all like the people of Abeo City. When she takes Nox, her memories remain a mystery, and the monsters who fill the sky at night refuse to snatch her. Trying to understand who she is, and how she ended up in such a hopeless place, Lottie bands together with other outcasts, including a brave and lovely girl named Charlie. In the darkness, and despite the threat of a monstrous end, love begins to grow. But as Lottie and Charlie plot their escape from Abeo City, Lottie’s dark secrets begin to surface, along with the disturbing truth about Twixt: a truth that could cost her everything."], "author": "Sarah Diemer", "num_pages": "238", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-16 00:00:00", "ISBN": "1484085973"},
{"url": "https://www.goodreads.com/book/show/7531478-scars", "num_ratings": "13,568", "num_reviews": "1,055", "avg_ratings": 4.17, "genres": ["Young Adult", "Mental Health", "Mental Illness", "Health", "Mental Health", "Sociology", "Abuse", "Contemporary", "Realistic Fiction"], "title": "Scars", "description": ["Kendra, fifteen, hasn't felt safe since she began to recall devastating memories of childhood sexual abuse, especially because she still can't remember the most important detail-- her abuser's identity. Frightened, Kendra believes someone is always watching and following her, leaving menacing messages only she understands. If she lets her guard down even for a minute, it c", "Kendra, fifteen, hasn't felt safe since she began to recall devastating memories of childhood sexual abuse, especially because she still can't remember the most important detail-- her abuser's identity. Frightened, Kendra believes someone is always watching and following her, leaving menacing messages only she understands. If she lets her guard down even for a minute, it could cost Kendra her life. To relieve the pressure, Kendra cuts; aside from her brilliantly expressive artwork, it's her only way of coping. Since her own mother is too self-absorbed to hear her cries for help, Kendra finds support in others instead: from her therapist and her art teacher, from Sandy, the close family friend who encourages her artwork, and from Meghan, the classmate who's becoming a friend and maybe more. But the truth about Kendra's abuse is just waiting to explode, with startling unforeseen consequences. ", " is the unforgettable story of one girl's frightening path to the truth.", "Watch the book trailer here: "], "author": "Cheryl Rainfield", "num_pages": "248", "awards": ["Governor General's Literary Awards / Prix littéraires du Gouverneur général Nominee for Children's Literature - Text (2010)", "SCBWI Crystal Kite Member Choice Award Nominee (2000)"], "places": [], "character_names": ["Meghan", "Kendra"], "language": "English", "publish_date": "2010-03-24 00:00:00", "ISBN": "193481332X"},
{"url": "https://www.goodreads.com/book/show/26198173-the-blood-between-us", "num_ratings": "455", "num_reviews": "113", "avg_ratings": 3.2, "genres": ["Young Adult", "Mystery", "Contemporary", "Lgbt", "Fiction"], "title": "The Blood Between Us", "description": ["Growing up, Adrien and his sister, Grace, competed viciously for everything. It wasn’t easy being the adopted sibling, but Adrien tried to get along; it was Grace who didn’t want anything to do with him. When their scientist parents died in a terrible lab fire, there was nothing left to hold them together.", "Now, after years apart, Adrien and Grace are forced to reunite at th", "Growing up, Adrien and his sister, Grace, competed viciously for everything. It wasn’t easy being the adopted sibling, but Adrien tried to get along; it was Grace who didn’t want anything to do with him. When their scientist parents died in a terrible lab fire, there was nothing left to hold them together.", "Now, after years apart, Adrien and Grace are forced to reunite at the elite boarding school where their parents were teachers. Being back around everyone he used to know makes Adrien question the person he’s become, while being back around Grace makes him feel like someone he doesn’t want to be.", "For as much as Adrien wants to move on, someone seems determined to reopen old wounds. And when Adrien starts to suspect that Grace knows more about their parents’ deaths than she let on, he realizes there are some wounds no amount of time can heal. If Adrien isn’t careful, they may even kill him."], "author": "Zac Brewer", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-05-03 00:00:00", "ISBN": "0062307932"},
{"url": "https://www.goodreads.com/book/show/10194183-starting-from-here", "num_ratings": "1,321", "num_reviews": "131", "avg_ratings": 3.86, "genres": ["Lgbt", "Young Adult", "Contemporary", "Glbt", "Queer", "Romance"], "title": "Starting from Here", "description": ["Sixteen-year-old Colby Bingham's heart has been broken too many times. Her mother has been dead for almost two years, her truck driver father is always away, her almost girlfriend just dumped her for a guy, and now she's failing chemistry.", "When a stray dog lands literally at her feet, bleeding and broken on a busy road, it seems like the Universe has it in for Colby. But th", "Sixteen-year-old Colby Bingham's heart has been broken too many times. Her mother has been dead for almost two years, her truck driver father is always away, her almost girlfriend just dumped her for a guy, and now she's failing chemistry.", "When a stray dog lands literally at her feet, bleeding and broken on a busy road, it seems like the Universe has it in for Colby. But the incident also knocks a chink in the walls she's built around her heart. Against her better judgment, she decides to care for the dog. But new connections mean new opportunities for heartbreak.", "Terrified of another loss, Colby bolts at the first sign of trouble, managing to alienate her best friend, her father, the cute girl pursing her, and even her dog's vet, who's taken Colby under her wing. Colby can't start over, but can she learn how to move on?"], "author": "Lisa Jenn Bigelow", "num_pages": "288", "awards": [], "places": ["Kalamazoo, Michigan", "Michigan"], "character_names": [], "language": "English", "publish_date": "2012-09-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/29904219-not-your-sidekick", "num_ratings": "3,134", "num_reviews": "710", "avg_ratings": 3.93, "genres": ["Young Adult", "Lgbt", "Fantasy", "Science Fiction"], "title": "Not Your Sidekick", "description": ["Welcome to Andover… where superpowers are common, but internships are complicated. Just ask high school nobody, Jessica Tran. Despite her heroic lineage, Jess is resigned to a life without superpowers and is merely looking to beef-up her college applications when she stumbles upon the perfect (paid!) internship—only it turns out to be for the town’s most heinous supervilla", "Welcome to Andover… where superpowers are common, but internships are complicated. Just ask high school nobody, Jessica Tran. Despite her heroic lineage, Jess is resigned to a life without superpowers and is merely looking to beef-up her college applications when she stumbles upon the perfect (paid!) internship—only it turns out to be for the town’s most heinous supervillain. On the upside, she gets to work with her longtime secret crush, Abby, who Jess thinks may have a secret of her own. Then there’s the budding attraction to her fellow intern, the mysterious “M,” who never seems to be in the same place as Abby. But what starts as a fun way to spite her superhero parents takes a sudden and dangerous turn when she uncovers a plot larger than heroes and villains altogether."], "author": "C.B. Lee", "num_pages": "283", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-08 00:00:00", "ISBN": "1945053038"},
{"url": "https://www.goodreads.com/book/show/33080942-warrior", "num_ratings": "30", "num_reviews": "9", "avg_ratings": 4.23, "genres": ["Lgbt", "Fantasy", "Short Stories", "Anthologies", "Young Adult"], "title": "WARRIOR: a collection of short stories", "description": ["A werewolf fighting for her humanity.", "A gladiator fighting for love.", "A blind mage, a human sacrifice and a big, buff fairy, all fighting off demons to save the world.", "Twelve writers. Twelve worlds. Twelve warriors.", "WARRIOR is an anthology of twelve exciting science-fiction and fantasy short stories, bursting with unstoppable characters that happen to identify within the LGBTQI", "A werewolf fighting for her humanity.", "A gladiator fighting for love.", "A blind mage, a human sacrifice and a big, buff fairy, all fighting off demons to save the world.", "Twelve writers. Twelve worlds. Twelve warriors.", "WARRIOR is an anthology of twelve exciting science-fiction and fantasy short stories, bursting with unstoppable characters that happen to identify within the LGBTQIA spectrum."], "author": "Antonica Jones", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-04-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25450286-ariah", "num_ratings": "227", "num_reviews": "69", "avg_ratings": 3.82, "genres": ["Fantasy", "Lgbt", "Romance", "Glbt", "Queer", "Fiction"], "title": "Ariah", "description": ["Ariah's magical training has been interrupted. Forced to rely on a mentor, Dirva, who is not who he claims to be, and a teacher who is foreign and powerful, Ariah is drawn into a culture wholly different from the elven one that raised him.", "As his friendship with Dirva's brother blossoms into a surprising romance, and he slowly learns how to control the dangerous magic in hi", "Ariah's magical training has been interrupted. Forced to rely on a mentor, Dirva, who is not who he claims to be, and a teacher who is foreign and powerful, Ariah is drawn into a culture wholly different from the elven one that raised him.", "As his friendship with Dirva's brother blossoms into a surprising romance, and he slowly learns how to control the dangerous magic in his blood, life finally appears to be coming together for Ariah—but love and security are cut short by a tyrannical military empire bent on expanding its borders.", "War, betrayal, passion, and confusion follow Ariah as his perilous journey leads him beyond the walls of the Empire, and into unfamiliar territory within himself. Along the way, he’ll discover just how much he’s willing to give up to find his place in the world, and he’ll learn what it means to sacrifice himself for freedom—and for love."], "author": "B.R. Sanders", "num_pages": "334", "awards": ["James Tiptree Jr. Award Nominee for (Longlist) (2015)", "Bisexual Book Award for Speculative Fcition (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/31180248-leah-on-the-offbeat", "num_ratings": "21,218", "num_reviews": "4,869", "avg_ratings": 4.07, "genres": ["Young Adult", "Contemporary", "Lgbt"], "title": "Leah on the Offbeat", "description": ["Leah Burke—girl-band drummer, master of deadpan, and Simon Spier’s best friend from the award-winning ", "—takes center stage in this novel of first love and senior-year angst.", "When it comes to drumming, Leah Burke is usually on beat—but real life isn’t always so rhythmic. An anomaly in her friend group, she’s the only child of a young, single m", "Leah Burke—girl-band drummer, master of deadpan, and Simon Spier’s best friend from the award-winning ", "—takes center stage in this novel of first love and senior-year angst.", "When it comes to drumming, Leah Burke is usually on beat—but real life isn’t always so rhythmic. An anomaly in her friend group, she’s the only child of a young, single mom, and her life is decidedly less privileged. She loves to draw but is too self-conscious to show it. And even though her mom knows she’s bisexual, she hasn’t mustered the courage to tell her friends—not even her openly gay BFF, Simon.", "So Leah really doesn’t know what to do when her rock-solid friend group starts to fracture in unexpected ways. With prom and college on the horizon, tensions are running high. It’s hard for Leah to strike the right note while the people she loves are fighting—especially when she realizes she might love one of them more than she ever intended."], "author": "Becky Albertalli", "num_pages": "343", "awards": [], "places": ["Atlanta, Georgia"], "character_names": [], "language": "English", "publish_date": "2018-04-24 00:00:00", "ISBN": "0062643800"},
{"url": "https://www.goodreads.com/book/show/26029184-my-year-zero", "num_ratings": "117", "num_reviews": "31", "avg_ratings": 4.01, "genres": ["Lgbt", "Young Adult", "Glbt", "Queer", "Contemporary", "Mental Health", "Mental Illness", "Literature", "Jewish", "Fiction"], "title": "My Year Zero", "description": ["Lauren thinks she has a pretty good life—so why is it that she feels crazy most of the time? She figures it’s nothing she can’t fix by getting her first girlfriend and doing better at school. But how is she ever going to find a girlfriend in Duluth, Minnesota?", "When she meets a group of kids who are telling a science fiction story online and gets invited down to the Twin Cit", "Lauren thinks she has a pretty good life—so why is it that she feels crazy most of the time? She figures it’s nothing she can’t fix by getting her first girlfriend and doing better at school. But how is she ever going to find a girlfriend in Duluth, Minnesota?", "When she meets a group of kids who are telling a science fiction story online and gets invited down to the Twin Cities, she gets more attention than she ever expected, from two very different girls: charming Sierra and troublesome Blake.", "Blake helps Lauren understand that she’s not the crazy one in her life. But Blake's attention—and insights into life and living with bipolar disorder—threaten to destroy everything Lauren has created for herself, including her relationship with Sierra."], "author": "Rachel Gold", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-03-29 00:00:00", "ISBN": "1594934827"},
{"url": "https://www.goodreads.com/book/show/28759.Magic_s_Pawn", "num_ratings": "21,850", "num_reviews": "700", "avg_ratings": 4.21, "genres": ["Fantasy", "Fiction", "Lgbt", "Romance", "M M Romance"], "title": "Magic's Pawn", "description": ["Mage-Craft—", "Though Vanyel has been born with near-legendary abilities to work both Herald and Mage magic, he wants no part of such things. Nor does he seek a warrior's path, wishing instead to become a Bard. Yet such talent as his if left untrained may prove a menace not only to Vanyel but to others as well. So he is sent to be fostered with his aunt, Savil, one of the fame", "Mage-Craft—", "Though Vanyel has been born with near-legendary abilities to work both Herald and Mage magic, he wants no part of such things. Nor does he seek a warrior's path, wishing instead to become a Bard. Yet such talent as his if left untrained may prove a menace not only to Vanyel but to others as well. So he is sent to be fostered with his aunt, Savil, one of the famed Herald-Mages of Valdemar.", "But, strong-willed and self-centered, Vanyel is a challenge which even Savil can not master alone. For soon he will become the focus of frightening forces, lending his raw magic to a spell that unleashes terrifying wyr-hunters on the land. And by the time Savil seeks the assistance of a Shin'a'in Adept, Vanyel's wild talent may have already grown beyond anyone's ability to contain, placing Vanyel, Savil, and Valdemar itself in desperate peril..."], "author": "Mercedes Lackey", "num_pages": "349", "awards": ["Lambda Literary Award Nominee for Gay Men's Science Fiction/Fantasy (1990)"], "places": ["Valdemar"], "character_names": ["Vanyel Ashkevron", "Yfandes", "Savil Ashkevron", "Tylendel Frelennye", "Starwind k'Treva", "Moondance k'Treva"], "language": "English", "publish_date": "1989-06-06 00:00:00", "ISBN": "0886773520"},
{"url": "https://www.goodreads.com/book/show/20521670-a-hero-at-the-end-of-the-world", "num_ratings": "1,070", "num_reviews": "231", "avg_ratings": 3.44, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fiction", "Glbt", "Queer", "Fantasy", "Urban Fantasy"], "title": "A Hero at the End of the World", "description": ["Sixteen year-old Ewan Mao knows one thing for certain: according to prophecy, it's his destiny to kill the evil tyrant whose dark reign has terrorized Britain. Although he's just a normal boy, deep down Ewan is confident that he has exactly what it takes to be a hero. But when Ewan's big moment comes, he freezes. His best friend, the clever and talented Oliver Abrams, defe", "Sixteen year-old Ewan Mao knows one thing for certain: according to prophecy, it's his destiny to kill the evil tyrant whose dark reign has terrorized Britain. Although he's just a normal boy, deep down Ewan is confident that he has exactly what it takes to be a hero. But when Ewan's big moment comes, he freezes. His best friend, the clever and talented Oliver Abrams, defeats the villain for him, and Ewan's bright future crumbles before his eyes.", "Five years later, Oliver has a job as an Unusual in the government's Serious Magical Crimes Agency, the life he and Ewan always dreamed of. But a routine investigation leads him and his partner, Sophie Stuart, to uncover a dangerous and powerful cult... one that seems to have drawn his former best friend into a plot to end the world.", "A deftly plotted, hysterically funny take on Chosen One narratives, A Hero at the End of the World expertly walks the fine line between satire and sincerity. Its sensitive depiction of a broken friendship and wry take-down of unfairly great expectations will appeal to all readers of modern fantasy."], "author": "Erin Claiborne", "num_pages": "308", "awards": [], "places": [], "character_names": ["Ewan Mao", "Oliver Abrams"], "language": "English", "publish_date": "2014-11-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23854755-been-here-all-along", "num_ratings": "3,456", "num_reviews": "711", "avg_ratings": 3.5, "genres": ["Lgbt", "Young Adult", "Contemporary", "Romance"], "title": "Been Here All Along", "description": ["Gideon ", " has a plan. His plans include running for class president, becoming head of the yearbook committee and having his choice of colleges. They do ", "include falling head over heels for his best friend and next-door neighbour, Kyle. It's a distraction. It's pointless, as Kyle is already dating the gorgeous and popular head cheerleader, Ruby. And Gideon doesn't kn", "Gideon ", " has a plan. His plans include running for class president, becoming head of the yearbook committee and having his choice of colleges. They do ", "include falling head over heels for his best friend and next-door neighbour, Kyle. It's a distraction. It's pointless, as Kyle is already dating the gorgeous and popular head cheerleader, Ruby. And Gideon doesn't know what to do . . .", "Kyle ", " feels like he has a handle on life. He has a wonderful girlfriend, a best friend willing to debate the finer points of ", ", and social acceptance as captain of the basketball team. Then, both Ruby and Gideon start acting ", " weird, just as his spot on the team is threatened, and Kyle can't quite figure out what he did wrong . . ."], "author": "Sandy   Hall", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-08-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25322449-radio-silence", "num_ratings": "5,931", "num_reviews": "1,579", "avg_ratings": 4.3, "genres": ["Contemporary", "Young Adult", "Lgbt"], "title": "Radio Silence", "description": ["This a previously-published edition of ISBN 9780007559244 ", "What if everything you set yourself up to be was wrong?", "Frances has always been a study machine with one goal, elite university. Nothing will stand in her way; not friends, not a guilty secret – not even the person she is on the inside.", "But when Frances meets Aled, the shy genius behind her favourite podcast, she disc", "This a previously-published edition of ISBN 9780007559244 ", "What if everything you set yourself up to be was wrong?", "Frances has always been a study machine with one goal, elite university. Nothing will stand in her way; not friends, not a guilty secret – not even the person she is on the inside.", "But when Frances meets Aled, the shy genius behind her favourite podcast, she discovers a new freedom. He unlocks the door to Real Frances and for the first time she experiences true friendship, unafraid to be herself. Then the podcast goes viral and the fragile trust between them is broken.", "Caught between who she was and who she longs to be, Frances’ dreams come crashing down. Suffocating with guilt, she knows that she has to confront her past…", "She has to confess why Carys disappeared…", "Meanwhile at uni, Aled is alone, fighting even darker secrets.", "It’s only by facing up to your fears that you can overcome them. And it’s only by being your true self that you can find happiness.", "Frances is going to need every bit of courage she has."], "author": "Alice Oseman", "num_pages": "403", "awards": ["The Inky Awards for Silver Inky (2017)"], "places": ["Kent, England"], "character_names": [], "language": "English", "publish_date": "2016-02-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20500616-the-five-stages-of-andrew-brawley", "num_ratings": "4,878", "num_reviews": "732", "avg_ratings": 4.02, "genres": ["Lgbt", "Young Adult", "Contemporary", "Romance"], "title": "The Five Stages of Andrew Brawley", "description": ["Andrew Brawley was supposed to die that night. His parents did, and so did his sister, but he survived.", "Now he lives in the hospital. He serves food in the cafeteria, he hangs out with the nurses, and he sleeps in a forgotten supply closet. Drew blends in to near invisibility, hiding from his past, his guilt, and those who are trying to find him.", "Then one night Rusty is whee", "Andrew Brawley was supposed to die that night. His parents did, and so did his sister, but he survived.", "Now he lives in the hospital. He serves food in the cafeteria, he hangs out with the nurses, and he sleeps in a forgotten supply closet. Drew blends in to near invisibility, hiding from his past, his guilt, and those who are trying to find him.", "Then one night Rusty is wheeled into the ER, burned on half his body by hateful classmates. His agony calls out to Drew like a beacon, pulling them both together through all their pain and grief. In Rusty, Drew sees hope, happiness, and a future for both of them. A future outside the hospital, and away from their pasts.", "But Drew knows that life is never that simple. Death roams the hospital, searching for Drew, and now Rusty. Drew lost his family, but he refuses to lose Rusty, too, so he’s determined to make things right. He’s determined to bargain, and to settle his debts once and for all.", "But Death is not easily placated, and Drew’s life will have to get worse before there is any chance for things to get better."], "author": "Shaun David Hutchinson", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-20 00:00:00", "ISBN": "1481403109"},
{"url": "https://www.goodreads.com/book/show/23453083-trust-me-i-m-trouble", "num_ratings": "645", "num_reviews": "103", "avg_ratings": 3.89, "genres": ["Young Adult", "Mystery", "Contemporary", "Thriller", "Lgbt"], "title": "Trust Me, I'm Trouble", "description": ["Staying out of trouble isn’t possible for Julep Dupree. She has managed not to get kicked out of her private school, even though everyone knows she’s responsible for taking down a human-trafficking mob boss—and getting St. Agatha’s golden-boy Tyler killed in the process. Running cons holds her guilty conscience at bay, but unfortunately, someone wants Julep to pay for her", "Staying out of trouble isn’t possible for Julep Dupree. She has managed not to get kicked out of her private school, even though everyone knows she’s responsible for taking down a human-trafficking mob boss—and getting St. Agatha’s golden-boy Tyler killed in the process. Running cons holds her guilty conscience at bay, but unfortunately, someone wants Julep to pay for her mistakes…with her life.", "Against her better judgment, Julep takes a shady case that requires her to infiltrate a secretive organization, one that may be connected to her long-gone mother and the enigmatic figure called the blue fairy. Her best friend, Sam, isn’t around to stop her, and Dani, her one true confidante, happens to be a nineteen-year-old mob enforcer whose moral compass is as questionable as Julep’s. But there’s not much time to worry about right and wrong—or to save your falling heart—when there’s a contract on your head.", "Murders, heists, secrets and lies, hit men and hidden identities…If Julep doesn’t watch her back, it’s her funeral. No lie."], "author": "Mary Elizabeth Summer", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-13 00:00:00", "ISBN": "0385744145"},
{"url": "https://www.goodreads.com/book/show/15843071-coda", "num_ratings": "1,155", "num_reviews": "195", "avg_ratings": 3.67, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Lgbt"], "title": "Coda", "description": ["Ever since he was a young boy, music has coursed through the veins of eighteen-year-old Anthem—the Corp has certainly seen to that. By encoding music with addictive and mind-altering elements, the Corp holds control over all citizens, particularly conduits like Anthem, whose life energy feeds the main power in the Grid.", "Anthem finds hope and comfort in the twin siblings he", "Ever since he was a young boy, music has coursed through the veins of eighteen-year-old Anthem—the Corp has certainly seen to that. By encoding music with addictive and mind-altering elements, the Corp holds control over all citizens, particularly conduits like Anthem, whose life energy feeds the main power in the Grid.", "Anthem finds hope and comfort in the twin siblings he cares for, even as he watches the life drain slowly and painfully from his father. Escape is found in his underground rock band, where music sounds free, clear, and unencoded deep in an abandoned basement. But when a band member dies suspiciously from a tracking overdose, Anthem knows that his time has suddenly become limited. Revolution all but sings in the air, and Anthem cannot help but answer the call with the chords of choice and free will. But will the girl he loves help or hinder him?"], "author": "Emma Trevayne", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-07 00:00:00", "ISBN": "0762447281"},
{"url": "https://www.goodreads.com/book/show/22299763-crooked-kingdom", "num_ratings": "90,946", "num_reviews": "14,818", "avg_ratings": 4.62, "genres": ["Fantasy", "Young Adult"], "title": "Crooked Kingdom", "description": ["Kaz Brekker and his crew have just pulled off a heist so daring even they didn't think they'd survive. But instead of divvying up a fat reward, they're right back to fighting for their lives. Double-crossed and badly weakened, the crew is low on resources, allies, and hope. As powerful forces from around the world descend on Ke", "Kaz Brekker and his crew have just pulled off a heist so daring even they didn't think they'd survive. But instead of divvying up a fat reward, they're right back to fighting for their lives. Double-crossed and badly weakened, the crew is low on resources, allies, and hope. As powerful forces from around the world descend on Ketterdam to root out the secrets of the dangerous drug known as ", ", old rivals and new enemies emerge to challenge Kaz's cunning and test the team's fragile loyalties. A war will be waged on the city's dark and twisting streets―a battle for revenge and redemption that will decide the fate of the Grisha world."], "author": "Leigh Bardugo", "num_pages": "536", "awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2016)"], "places": ["Ketterdam"], "character_names": ["Genya Safin", "Inej Ghafa", "Kaz Brekker", "Jesper Fahey", "Wylan Van Eck", "Matthias Helvar", "Nina Zenik", "Zoya Nazyalensky", "Nikolai Lantsov"], "language": "English", "publish_date": "2016-09-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25831596-bleeding-earth", "num_ratings": "416", "num_reviews": "110", "avg_ratings": 3.54, "genres": ["Horror", "Lgbt", "Young Adult", "Fantasy", "Science Fiction", "Glbt", "Lesbian"], "title": "Bleeding Earth", "description": ["Lea was in a cemetery when the earth started bleeding. Within twenty-four hours, the blood made international news. All over the world, blood appeared out of the ground, even through concrete, even in water. Then the earth started growing hair and bones.", "Lea wants to ignore the blood. She wants to spend time w", "Lea was in a cemetery when the earth started bleeding. Within twenty-four hours, the blood made international news. All over the world, blood appeared out of the ground, even through concrete, even in water. Then the earth started growing hair and bones.", "Lea wants to ignore the blood. She wants to spend time with her new girlfriend, Aracely, in public, if only Aracely wasn't so afraid of her father. Lea wants to be a regular teen again, but the blood has made her a prisoner in her own home. Fear for her social life turns into fear for her sanity, and Lea must save herself and Aracely whatever way she can."], "author": "Kaitlin Ward", "num_pages": "247", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-02-09 00:00:00", "ISBN": "0986448486"},
{"url": "https://www.goodreads.com/book/show/6380296-liar", "num_ratings": "8,211", "num_reviews": "1,603", "avg_ratings": 3.3, "genres": ["Young Adult", "Fantasy", "Fiction", "Mystery", "Fantasy", "Paranormal", "Young Adult", "Teen"], "title": "Liar", "author": "Justine Larbalestier", "num_pages": "376", "awards": ["Ditmar Award Nominee for Best Novel (2010)", "Western Australian Premier's Book Award for Young Adult (2009)", "Children's Book Council of Australia Award Nominee for Older Readers Book of the Year (2010)", "Queensland Premier's Literary Awards Nominee for Young Adult Book Award (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Davitt Award for Best Young Adult Novel (2010)", "The Inky Awards Shortlist for Gold Inky (2010)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "1599903059"},
{"url": "https://www.goodreads.com/book/show/22554204-lumberjanes-vol-1", "num_ratings": "42,458", "num_reviews": "3,960", "avg_ratings": 3.91, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Fantasy", "Young Adult", "Fiction"], "title": "Lumberjanes, Vol. 1: Beware the Kitten Holy", "description": ["At Miss Qiunzilla Thiskwin Penniquiqul Thistle Crumpet's camp for hard-core lady-types, things are not what they seem. Three-eyed foxes. Secret caves. Anagrams. Luckily, Jo, April, Mal, Molly, and Ripley are five rad, butt-kicking best pals determined to have an awesome summer together... And they're not gonna let a magical quest or an array of supern", "At Miss Qiunzilla Thiskwin Penniquiqul Thistle Crumpet's camp for hard-core lady-types, things are not what they seem. Three-eyed foxes. Secret caves. Anagrams. Luckily, Jo, April, Mal, Molly, and Ripley are five rad, butt-kicking best pals determined to have an awesome summer together... And they're not gonna let a magical quest or an array of supernatural critters get in their way! The mystery keeps getting bigger, and it all begins here. ", "Collects Lumberjanes No. 1-4."], "author": "Noelle Stevenson", "num_pages": "128", "awards": ["Will Eisner Comic Industry Awards for Best New Series & Best Publication for Teens (ages 13-17) (2015)", "Goodreads Choice Award Nominee for Graphic Novels & Comics (2015)"], "places": [], "character_names": ["Jen", "Rosie", "Jo", "April", "Mal", "Molly", "Ripley"], "language": "English", "publish_date": "2015-04-07 00:00:00", "ISBN": "1608866874"},
{"url": "https://www.goodreads.com/book/show/33385229-they-both-die-at-the-end", "num_ratings": "30,299", "num_reviews": "6,842", "avg_ratings": 4.15, "genres": ["Young Adult", "Contemporary", "Lgbt", "Fiction"], "title": "They Both Die at the End", "description": ["On September 5, a little after midnight, Death-Cast calls Mateo Torrez and Rufus Emeterio to give them some bad news: They’re going to die today.", "Mateo and Rufus are total str", "On September 5, a little after midnight, Death-Cast calls Mateo Torrez and Rufus Emeterio to give them some bad news: They’re going to die today.", "Mateo and Rufus are total strangers, but, for different reasons, they’re both looking to make a new friend on their End Day. The good news: There’s an app for that. It’s called the Last Friend, and through it, Rufus and Mateo are about to meet up for one last great adventure—to live a lifetime in a single day."], "author": "Adam Silvera", "num_pages": "368", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2017)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2017-09-05 00:00:00", "ISBN": "0062457799"},
{"url": "https://www.goodreads.com/book/show/15798674-fat-angie", "num_ratings": "3,818", "num_reviews": "476", "avg_ratings": 3.65, "genres": ["Young Adult", "Lgbt", "Fiction", "Realistic Fiction", "Contemporary", "Young Adult", "Teen"], "title": "Fat Angie", "description": ["Angie is broken — by her can’t-be-bothered mother, by her high-school tormenters, and by being the only one who thinks her varsity-athlete-turned-war-hero sister is still alive. Hiding und", "Angie is broken — by her can’t-be-bothered mother, by her high-school tormenters, and by being the only one who thinks her varsity-athlete-turned-war-hero sister is still alive. Hiding under a mountain of junk food hasn’t kept the pain (or the shouts of \"crazy mad cow!\") away. Having failed to kill herself — in front of a gym full of kids — she’s back at high school just trying to make it through each day. That is, until the arrival of KC Romance, the kind of girl who doesn’t exist in Dryfalls, Ohio. A girl who is one hundred and ninety-nine percent wow! A girl who never sees her as Fat Angie, and who knows too well that the package doesn’t always match what’s inside. With an offbeat sensibility, mean girls to rival a horror classic, and characters both outrageous and touching, this darkly comic anti-romantic romance will appeal to anyone who likes entertaining and meaningful fiction.", "It has been awarded the Stonewall Book Award-Mike Morgan and Larry Romans Children's & Young Adult Literature Award for 2014."], "author": "E.E. Charlton-Trujillo", "num_pages": "264", "awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2014)", "Lambda Literary Award Nominee for Lesbian General Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-12 00:00:00", "ISBN": "0763661198"},
{"url": "https://www.goodreads.com/book/show/831874.The_Left_Hand_of_Darkness", "num_ratings": "87,145", "num_reviews": "6,260", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Fantasy", "Classics"], "title": "The Left Hand of Darkness", "description": ["Genly Ai is an emissary from the human galaxy to Winter, a lost, stray world. His mission is to bring the planet back into the fold of an evolving galactic civilization, but to do so he must bridge the gulf between his own culture and prejudices and those that he encounters. On a planet where people are of no gender--or both--this is a broad gulf indeed. The inventiveness", "Genly Ai is an emissary from the human galaxy to Winter, a lost, stray world. His mission is to bring the planet back into the fold of an evolving galactic civilization, but to do so he must bridge the gulf between his own culture and prejudices and those that he encounters. On a planet where people are of no gender--or both--this is a broad gulf indeed. The inventiveness and delicacy with which Le Guin portrays her alien world are not only unusual and inspiring, they are fundamental to almost all decent science fiction that has been written since. In fact, reading Le Guin again may cause the eye to narrow somewhat disapprovingly at the younger generation: what new ground are they breaking that is not already explored here with greater skill and acumen? It cannot be said, however, that this is a rollicking good story. Le Guin takes a lot of time to explore her characters, the world of her creation, and the philosophical themes that arise."], "author": "Ursula K. Le Guin", "num_pages": "248", "awards": ["Hugo Award for Best Novel (1970)", "Nebula Award for Best Novel (1969)", "James Tiptree Jr. Award for Retrospective"], "places": [], "character_names": ["Genly Ai", "Therem Harth rem ir Estraven", "Argaven XV"], "language": "English", "publish_date": "1992-08-16 00:00:00", "ISBN": "1857230744"},
{"url": "https://www.goodreads.com/book/show/29105720-colorblind", "num_ratings": "1,177", "num_reviews": "135", "avg_ratings": 4.13, "genres": ["Lgbt", "Young Adult", "Romance", "Contemporary"], "title": "Colorblind", "description": ["Harper has a secret... and it’s not that she likes girls. She has a rare and special gift: she can see how old other people will be when they pass away. Nothing she does changes this number, and that becomes especially clear when her mother dies in a car crash. With only one other person in the world who knows about and shares her gift, Harper is determined to keep her dis", "Harper has a secret... and it’s not that she likes girls. She has a rare and special gift: she can see how old other people will be when they pass away. Nothing she does changes this number, and that becomes especially clear when her mother dies in a car crash. With only one other person in the world who knows about and shares her gift, Harper is determined to keep her distance from everyone. Then she falls for Chloe… whose number is 16.", "That means that Chloe doesn’t have twelve months to live. She doesn’t even have six.", "She is going to be dead by the end of the summer, unless Harper can find a way to stop it."], "author": "Siera Maley", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24694256-weird-girl-and-what-s-his-name", "num_ratings": "689", "num_reviews": "169", "avg_ratings": 3.61, "genres": ["Young Adult", "Contemporary", "Lgbt", "Fiction", "Realistic Fiction"], "title": "Weird Girl and What's His Name", "description": ["In the tiny podunk town of Hawthorne, North Carolina, seventeen-year-old geeks Lula and Rory share everything—sci-fi and fantasy fandom, Friday night binge-watching of old X-Files episodes, and that feeling that they don’t quite fit in. Lula knows she and Rory have no secrets from each other; after all, he came out to her years ago, and she’s shared with him her “sacred te", "In the tiny podunk town of Hawthorne, North Carolina, seventeen-year-old geeks Lula and Rory share everything—sci-fi and fantasy fandom, Friday night binge-watching of old X-Files episodes, and that feeling that they don’t quite fit in. Lula knows she and Rory have no secrets from each other; after all, he came out to her years ago, and she’s shared with him her “sacred texts”—the acting books her mother left behind after she walked out of Lula’s life. But then Lula discovers that Rory—her Rory, who maybe she’s secretly had feelings for—has not only tried out for the Hawthorne football team without telling her, but has also been having an affair with his middle-aged divorcee boss. With their friendship disrupted, Lula begins to question her identity and her own sexual orientation, and she runs away in the middle of the night on a journey to find her mother, who she hopes will have all the answers. Meagan Brother’s piercing prose in this fresh LGBT YA novel speaks to anyone who has ever felt unwanted and alone, and who struggles to find their place in an isolating world."], "author": "Meagan Brothers", "num_pages": "336", "awards": ["Foreword INDIES Book of the Year Award for Young Adult Fiction (Children's) (Gold) (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-13 00:00:00", "ISBN": "1941110274"},
{"url": "https://www.goodreads.com/book/show/13453104-the-summer-prince", "num_ratings": "4,257", "num_reviews": "840", "avg_ratings": 3.58, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fantasy", "Romance"], "title": "The Summer Prince", "description": ["The lush city of Palmares Tres shimmers with tech and tradition, with screaming gossip casters and practiced politicians. In the midst of this vibrant metropolis, June Costa creates art that's sure to make her legendary. But her dreams of fame become something more when she meets Enki, the bold new Summer King. The whole city falls in love with him including June's best fr", "The lush city of Palmares Tres shimmers with tech and tradition, with screaming gossip casters and practiced politicians. In the midst of this vibrant metropolis, June Costa creates art that's sure to make her legendary. But her dreams of fame become something more when she meets Enki, the bold new Summer King. The whole city falls in love with him including June's best friend, Gil. But June sees more to Enki than amber eyes and a lethal samba. She sees a fellow artist.", "Together, June and Enki will stage explosive, dramatic projects that Palmares Tres will never forget. They will add fuel to a growing rebellion against the governments strict limits on new tech. And June will fall deeply, unfortunately in love with Enki. Because like all Summer Kings before him, Enki is destined to die."], "author": "Alaya Dawn Johnson", "num_pages": "289", "awards": ["National Book Award Nominee for Young People’s Literature (2013)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2013)", "Cybils Award for Young Adult Speculative Fiction (2013)", "James Tiptree Jr. Award Honor List (2013)"], "places": ["Palmares Três", "Brazil"], "character_names": ["June Costa"], "language": "English", "publish_date": "2013-03-01 00:00:00", "ISBN": "0545417791"},
{"url": "https://www.goodreads.com/book/show/18465591-one-man-guy", "num_ratings": "9,696", "num_reviews": "935", "avg_ratings": 3.89, "genres": ["Lgbt", "Young Adult", "Romance", "Contemporary"], "title": "One Man Guy", "description": ["Alek Khederian should have guessed something was wrong when his parents took him to a restaurant. Everyone knows that Armenians never eat out. Between bouts of interrogating the waitress and criticizing the menu, Alek’s parents announce that he’ll be attending summer school in order to bring up", "Alek Khederian should have guessed something was wrong when his parents took him to a restaurant. Everyone knows that Armenians never eat out. Between bouts of interrogating the waitress and criticizing the menu, Alek’s parents announce that he’ll be attending summer school in order to bring up his grades. Alek is sure this experience will be the perfect hellish end to his hellish freshman year of high school. He never could’ve predicted that he’d meet someone like Ethan.", "Ethan is everything Alek wishes he were: confident, free-spirited, and irreverent. He can’t believe a guy this cool wants to be his friend. And before long, it seems like Ethan wants to be more than friends. Alek has never thought about having a boyfriend—he’s barely ever had a girlfriend—but maybe it’s time to think again."], "author": "Michael Barakiva", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-27 00:00:00", "ISBN": "0374356459"},
{"url": "https://www.goodreads.com/book/show/47944.Empress_of_the_World", "num_ratings": "12,018", "num_reviews": "452", "avg_ratings": 3.73, "genres": ["Young Adult", "Lgbt", "Romance", "Fiction", "Glbt", "Queer"], "title": "Empress of the World", "description": ["Nicola Lancaster is spending her summer at the Siegel Institute - a hothouse of smart, articulate, intense teenagers living like college students for eight weeks. Nic's had theatre friends and ochestra friends, but never just friend friends. And she's certainly never had a relationship.", "But on the very first day, she falls in with Katrina the Manic Computer Chick, Isaac the", "Nicola Lancaster is spending her summer at the Siegel Institute - a hothouse of smart, articulate, intense teenagers living like college students for eight weeks. Nic's had theatre friends and ochestra friends, but never just friend friends. And she's certainly never had a relationship.", "But on the very first day, she falls in with Katrina the Manic Computer Chick, Isaac the Nice-Guy-Despite-Himself, Kevin the Inarticulate Composer... and Battle.", "Battle Hall Davies is a beautiful blond dancer from North Carolina. She's everything Nic isn't. Soon the two are friends - and then, startlingly, more than friends. What do you do when you think you're attracted to guys, and then you meet a girl who steals your heart?"], "author": "Sara Ryan", "num_pages": "215", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-05-26 00:00:00", "ISBN": "0142500593"},
{"url": "https://www.goodreads.com/book/show/18607160-lies-my-girlfriend-told-me", "num_ratings": "3,985", "num_reviews": "475", "avg_ratings": 3.7, "genres": ["Lgbt", "Young Adult", "Contemporary", "Romance", "Fiction", "Glbt", "Lesbian"], "title": "Lies My Girlfriend Told Me", "description": ["When Alix's charismatic girlfriend, Swanee, dies from sudden cardiac arrest, Alix is overcome with despair. As she searches Swanee's room for mementos of their relationship, she finds Swanee's cell phone, pinging with dozens of texts sent from a mysterious contact, L.T. The most recent text reads: \"Please tell me what I did. Please, Swan. Te amo. I love you.\"", "Shocked and be", "When Alix's charismatic girlfriend, Swanee, dies from sudden cardiac arrest, Alix is overcome with despair. As she searches Swanee's room for mementos of their relationship, she finds Swanee's cell phone, pinging with dozens of texts sent from a mysterious contact, L.T. The most recent text reads: \"Please tell me what I did. Please, Swan. Te amo. I love you.\"", "Shocked and betrayed, Alix learns that Swanee has been leading a double life--secretly dating a girl named Liana the entire time she's been with Alix. Alix texts Liana from Swanee's phone, pretending to be Swanee in order to gather information before finally meeting face-to-face to break the news.", "Brought together by Swanee's lies, Alix and Liana become closer than they'd thought possible. But Alix is still hiding the truth from Liana. Alix knows what it feels like to be lied to--but will coming clean to Liana mean losing her, too?"], "author": "Julie Anne Peters", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-06-10 00:00:00", "ISBN": "0316234974"},
{"url": "https://www.goodreads.com/book/show/25224652-taking-flight", "num_ratings": "1,358", "num_reviews": "98", "avg_ratings": 4.14, "genres": ["Lgbt", "Young Adult", "Romance", "Glbt", "Lesbian", "Contemporary"], "title": "Taking Flight", "description": ["Seventeen-year-old Lauren Lennox is a city girl at heart. Being born and raised in Los Angeles, California by her movie star mom and ex-child-star father sounds like an ideal childhood, but with a mother who’s always busy and a father who suffers from alcoholism, Lauren’s already parentless childhood and her resulting rebellious streak are made worse when her mother passes", "Seventeen-year-old Lauren Lennox is a city girl at heart. Being born and raised in Los Angeles, California by her movie star mom and ex-child-star father sounds like an ideal childhood, but with a mother who’s always busy and a father who suffers from alcoholism, Lauren’s already parentless childhood and her resulting rebellious streak are made worse when her mother passes away and she’s left alone with her father, who doesn’t care how little school she attends, how much alcohol she drinks, or how many girls she sleeps with.", "When she puts too many toes out of line and a judge deems her father unfit to be her guardian, she’s shipped across the country to the rural mountains of northern Georgia, where a personal friend of the judge lives with his wife and two kids on a farm. David Marshall is a professional counselor known for “reforming unruly youth”, and as part of David’s program, Lauren will be required to work with farm animals, go to church once a week, attend counseling sessions with David, and go to a new school, all for seven months until her graduation. So naturally, her plan is simple: to have her best friend come pick her up two months early on the day she turns eighteen, and to be as difficult as possible in the meantime.", "Her plan doesn’t account for David Marshall’s daughter."], "author": "Siera Maley", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-03-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/32941853-miles-away-from-you", "num_ratings": "196", "num_reviews": "69", "avg_ratings": 3.2, "genres": ["Young Adult", "Contemporary", "Lgbt"], "title": "Miles Away from You", "description": ["It's been three years since Miles fell for Vivian, a talented and dazzling transgender girl. Eighteen months since a suicide attempt left Vivian on life support. Now Miles isn't sure who he is without her, but knows it’s time to figure out how to say goodbye.", "He books a solo trip to Iceland but then has a hard time leaving the refuge of his hotel room. After a little push f", "It's been three years since Miles fell for Vivian, a talented and dazzling transgender girl. Eighteen months since a suicide attempt left Vivian on life support. Now Miles isn't sure who he is without her, but knows it’s time to figure out how to say goodbye.", "He books a solo trip to Iceland but then has a hard time leaving the refuge of his hotel room. After a little push from Oskar, a local who is equal parts endearing and aloof, Miles decides to honor Vivian's life by photographing her treasured Doc Martens standing empty against the surreal landscapes. With each step he takes, Miles finds his heart healing--even as he must accept that Vivian, still in a coma, will never recover.", "Told through a series of instant messages to Vivian, this quirky and completely fresh novel explores love, loss, and the drastic distances we sometimes have to travel in order to move on."], "author": "A.B. Rutledge", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-03-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4422777-wildthorn", "num_ratings": "4,026", "num_reviews": "522", "avg_ratings": 3.65, "genres": ["Historical", "Historical Fiction", "Young Adult", "Lgbt", "Historical", "Romance", "Fiction"], "title": "Wildthorn", "description": ["Seventeen-year-old Louisa Cosgrove longs to break free from her respectable life as a Victorian doctor's daughter. But her dreams become a nightmare when Louisa is sent to Wildthorn Hall: labeled a lunatic, deprived of her liberty and even her real name. As she unravels the betrayals that led to her incarceration, she realizes there are many kinds of prison. She must be ho", "Seventeen-year-old Louisa Cosgrove longs to break free from her respectable life as a Victorian doctor's daughter. But her dreams become a nightmare when Louisa is sent to Wildthorn Hall: labeled a lunatic, deprived of her liberty and even her real name. As she unravels the betrayals that led to her incarceration, she realizes there are many kinds of prison. She must be honest with herself - and others - in order to be set free. And love may be the key..."], "author": "Jane Eagland", "num_pages": "359", "awards": ["Lambda Literary Award for LGBT Children's/Young Adult (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "0330458167"},
{"url": "https://www.goodreads.com/book/show/22896551-none-of-the-above", "num_ratings": "10,075", "num_reviews": "1,638", "avg_ratings": 3.88, "genres": ["Young Adult", "Lgbt", "Contemporary", "Glbt", "Queer", "Fiction"], "title": "None of the Above", "description": ["A groundbreaking story about a teenage girl who discovers she was born intersex... and what happens when her secret is revealed to the entire school. Incredibly compelling and sensitively told, None of the Above is a thought-provoking novel that explores what it means to be a boy, a girl, or something in between.", "What if everything you knew about yourself changed in an inst", "A groundbreaking story about a teenage girl who discovers she was born intersex... and what happens when her secret is revealed to the entire school. Incredibly compelling and sensitively told, None of the Above is a thought-provoking novel that explores what it means to be a boy, a girl, or something in between.", "What if everything you knew about yourself changed in an instant?", "When Kristin Lattimer is voted homecoming queen, it seems like another piece of her ideal life has fallen into place. She's a champion hurdler with a full scholarship to college and she's madly in love with her boyfriend. In fact, she's decided that she's ready to take things to the next level with him.", "But Kristin's first time isn't the perfect moment she's planned—something is very wrong. A visit to the doctor reveals the truth: Kristin is intersex, which means that though she outwardly looks like a girl, she has male chromosomes, not to mention boy \"parts.\"", "Dealing with her body is difficult enough, but when her diagnosis is leaked to the whole school, Kristin's entire identity is thrown into question. As her world unravels, can she come to terms with her new self?"], "author": "I.W. Gregorio", "num_pages": "352", "awards": [], "places": ["New York (the state)"], "character_names": ["Kristin Louise Lattimer", "Samuel Wilmington", "Faith Wu", "Vanessa Richardson", "Darren Kowalski", "Jessica Riley"], "language": "English", "publish_date": "2015-04-07 00:00:00", "ISBN": "0062335316"},
{"url": "https://www.goodreads.com/book/show/15986094-inheritance", "num_ratings": "2,084", "num_reviews": "266", "avg_ratings": 3.77, "genres": ["Young Adult", "Science Fiction", "Lgbt", "Glbt", "Queer", "Science Fiction", "Aliens"], "title": "Inheritance", "description": ["Reese and David are different now. Surrounded by a web of conspiracies, Reece feels that she must choose between two worlds.", "Her choices: David - or Amber? This world - or another? Should they tell the truth, and risk everything?"], "author": "Malinda Lo", "num_pages": "470", "awards": ["Bisexual Book Award for Teen/Young Adult Fiction (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "0316198005"},
{"url": "https://www.goodreads.com/book/show/6017769-the-vast-fields-of-ordinary", "num_ratings": "9,874", "num_reviews": "609", "avg_ratings": 3.93, "genres": ["Young Adult", "Lgbt", "Contemporary", "Fiction"], "title": "The Vast Fields of Ordinary", "description": ["It's Dade's last summer at home. He has a crappy job at Food World, a \"boyfriend\" who won't publicly acknowledge his existence (maybe because Pablo also has a girlfriend), and parents on the verge of a divorce. College is Dade's shining beacon of possibility, a horizon to keep him from floating away.", " Then he meets the mysterious Alex Kincaid. Falling in ", " love finally l", "It's Dade's last summer at home. He has a crappy job at Food World, a \"boyfriend\" who won't publicly acknowledge his existence (maybe because Pablo also has a girlfriend), and parents on the verge of a divorce. College is Dade's shining beacon of possibility, a horizon to keep him from floating away.", " Then he meets the mysterious Alex Kincaid. Falling in ", " love finally lets Dade come out of the closet - and, ironically, ignites a ruthless passion in Pablo. But just when true happiness has set in, tragedy shatters the dreamy curtain of summer, and Dade will use every ounce of strength he's gained to break from his past and start fresh with the future."], "author": "Nick Burd", "num_pages": "309", "awards": ["Stonewall Book Award for Children's and Young Adult Literature (2010)"], "places": ["Iowa"], "character_names": [], "language": "English", "publish_date": "2009-05-14 00:00:00", "ISBN": "0803733402"},
{"url": "https://www.goodreads.com/book/show/2418888.Skim", "num_ratings": "10,273", "num_reviews": "1,070", "avg_ratings": 3.79, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Lgbt", "Fiction"], "title": "Skim", "description": ["Heartbreakingly funny, moving and vibrantly drawn, ", " is an extraordinary book--a smart and sensitive graphic novel of the highest literary and artistic quality, by and about young women.", "\"Skim\" is Kimberly Keiko Cameron, a not-slim, would-be Wiccan goth who goes to a private girls' school. When Skim's classmate Katie Matthews is dumped by her boyfriend, who then kills hi", "Heartbreakingly funny, moving and vibrantly drawn, ", " is an extraordinary book--a smart and sensitive graphic novel of the highest literary and artistic quality, by and about young women.", "\"Skim\" is Kimberly Keiko Cameron, a not-slim, would-be Wiccan goth who goes to a private girls' school. When Skim's classmate Katie Matthews is dumped by her boyfriend, who then kills himself, the entire school goes into mourning overdrive. As concerned guidance counselors provide lectures on the \"cycle of grief,\" and the popular clique starts a new club (Girls Celebrate Life!) to bolster school spirit, Skim sinks into an ever-deepening depression. ", "And falling in love only makes things worse...", "Suicide, depression, love, being gay or not, crushes, cliques, and finding a way to be your own fully human self--are all explored in this brilliant collaboration by cousins Mariko and Jillian Tamaki. An edgy, keenly observed and poignant glimpse into the heartache of being young."], "author": "Mariko Tamaki", "num_pages": "143", "awards": ["Ignatz Award for Outstanding Graphic Novel (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "Doug Wright Award for Best Book (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["Toronto, Ontario"], "character_names": ["Kimberly Keiko Cameron, aka \"Skim\"", "Lisa Soor", "Ms. Archer"], "language": "English", "publish_date": "2008-01-01 00:00:00", "ISBN": "0888997531"},
{"url": "https://www.goodreads.com/book/show/16081758-otherbound", "num_ratings": "2,159", "num_reviews": "452", "avg_ratings": 3.74, "genres": ["Fantasy", "Young Adult", "Lgbt", "Science Fiction"], "title": "Otherbound", "description": ["Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Eve", "Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Every time he blinks, he's yanked from his Arizona town into Amara's mind, a world away, which makes even simple things like hobbies and homework impossible. He's spent years as a powerless observer of Amara's life. Amara has no idea . . . until he learns to control her, and they communicate for the first time. Amara is terrified. Then, she's furious.", "All Amara and Nolan want is to be free of each other. But Nolan's breakthrough has dangerous consequences. Now, they'll have to work together to survive--and discover the truth about their connection."], "author": "Corinne Duyvis", "num_pages": "387", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2014)", "Bisexual Book Award for Speculative Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-17 00:00:00", "ISBN": "1419709283"},
{"url": "https://www.goodreads.com/book/show/9415946-huntress", "num_ratings": "9,287", "num_reviews": "982", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Young Adult", "Young Adult Fantasy", "Adventure", "Fantasy", "Magic"], "title": "Huntress", "description": ["Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, th", "Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, the city of the Fairy Queen. Taisin is a sage, thrumming with magic, and Kaede is of the earth, without a speck of the otherworldly. And yet the two girls' destinies are drawn together during the mission. As members of their party succumb to unearthly attacks and fairy tricks, the two come to rely on each other and even begin to fall in love. But the Kingdom needs only one huntress to save it, and what it takes could tear Kaede and Taisin apart forever.", "The exciting adventure prequel to Malinda Lo's highly acclaimed novel ", "is overflowing with lush Chinese influences and details inspired by the ", ", and is filled with action and romance."], "author": "Malinda Lo", "num_pages": "371", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2012)", "James Tiptree Jr. Award Nominee for Longlist (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "031604007X"},
{"url": "https://www.goodreads.com/book/show/6137154-fire", "num_ratings": "143,850", "num_reviews": "9,570", "avg_ratings": 4.12, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction"], "title": "Fire", "description": ["It is not a peaceful time in the Dells. The young King Nash clings to his throne while rebel lords in the north and south build armies to unseat him. The mountains and forests are filled with spies and thieves and lawless men.", "This is where Fire lives. With a wild, irresistible appearance and hair the color of flame, Fire is the last remaining human monster. Equally hated a", "It is not a peaceful time in the Dells. The young King Nash clings to his throne while rebel lords in the north and south build armies to unseat him. The mountains and forests are filled with spies and thieves and lawless men.", "This is where Fire lives. With a wild, irresistible appearance and hair the color of flame, Fire is the last remaining human monster. Equally hated and adored, she had the unique ability to control minds, but she guards her power, unwilling to steal the secrets of innocent people. Especially when she has so many of her own.", "Then Prince Brigan comes to bring her to King City, The royal family needs her help to uncover the plot against the king. Far away from home, Fire begins to realize there's more to her power than she ever dreamed. Her power could save the kingdom.", "If only she weren't afraid of becoming the monster her father was."], "author": "Kristin Cashore", "num_pages": "480", "awards": ["Milwaukee County Teen Book Award Nominee (2011)", "Amelia Elizabeth Walden Award (2010)", "Cybils Award for Young Adult Fantasy & Science Fiction (2009)"], "places": [], "character_names": ["Brocker (Graceling Realm)", "Roen (Graceling Realm)", "Nash (Graceling Realm)", "Brigan (Graceling Realm)", "Leck (Graceling Realm)", "Garan (Graceling Realm)", "Archer (Graceling Realm)", "Fire (Graceling Realm)"], "language": "English", "publish_date": "2009-10-05 00:00:00", "ISBN": "0803734611"},
{"url": "https://www.goodreads.com/book/show/12024430-teeth", "num_ratings": "3,022", "num_reviews": "664", "avg_ratings": 3.81, "genres": ["Young Adult", "Fantasy", "Lgbt", "Fantasy", "Paranormal", "Contemporary", "Mythology", "Mermaids"], "title": "Teeth", "description": ["Be careful what you believe in.", "Rudy’s life is flipped upside-down when his family moves to a remote island in a last attempt to save his sick younger brother. With nothing to do but worry, Rudy sinks deeper and deeper into loneliness and lies awake at night listening to the screams of the oc", "Be careful what you believe in.", "Rudy’s life is flipped upside-down when his family moves to a remote island in a last attempt to save his sick younger brother. With nothing to do but worry, Rudy sinks deeper and deeper into loneliness and lies awake at night listening to the screams of the ocean beneath his family’s rickety house.", "Then he meets Diana, who makes him wonder what he even knows about love, and Teeth, who makes him question what he knows about anything. Rudy can’t remember the last time he felt so connected to someone, but being friends with Teeth is more than a little bit complicated. He soon learns that Teeth has terrible secrets. Violent secrets. Secrets that will force Rudy to choose between his own happiness and his brother’s life."], "author": "Hannah Moskowitz", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-01 00:00:00", "ISBN": "1442465328"},
{"url": "https://www.goodreads.com/book/show/35356380-people-like-us", "num_ratings": "2,947", "num_reviews": "726", "avg_ratings": 3.54, "genres": ["Young Adult", "Mystery", "Contemporary", "Lgbt", "Thriller"], "title": "People Like Us", "description": ["Kay Donovan may have skeletons in her closet, but the past is past, and she's reinvented herself entirely. Now she's a star soccer player whose group of gorgeous friends run their private school with effortless popularity and acerbic wit. But when a girl's body is found in the lake, Kay's carefully constructed life begins to topple. ", "The dead girl has left Kay a computer-co", "Kay Donovan may have skeletons in her closet, but the past is past, and she's reinvented herself entirely. Now she's a star soccer player whose group of gorgeous friends run their private school with effortless popularity and acerbic wit. But when a girl's body is found in the lake, Kay's carefully constructed life begins to topple. ", "The dead girl has left Kay a computer-coded scavenger hunt, which, as it unravels, begins to implicate suspect after suspect, until Kay herself is in the crosshairs of a murder investigation. But if Kay's finally backed into a corner, she'll do what it takes to survive. Because at Bates Academy, the truth is something you make...not something that happened."], "author": "Dana  Mele", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-02-27 00:00:00", "ISBN": "1524741701"},
{"url": "https://www.goodreads.com/book/show/20958632-the-darkest-part-of-the-forest", "num_ratings": "33,017", "num_reviews": "5,374", "avg_ratings": 3.91, "genres": ["Fantasy", "Young Adult"], "title": "The Darkest Part of the Forest", "description": ["Children can have a cruel, absolute sense of justice. Children can kill a monster and feel quite proud of themselves. A girl can look at her brother and believe they’re destined to be a knight and a bard who battle evil. She can believe she’s found the thing she’s been made for.", "Hazel lives with her brother, Ben, in the strange town of Fairfold where humans and fae exist si", "Children can have a cruel, absolute sense of justice. Children can kill a monster and feel quite proud of themselves. A girl can look at her brother and believe they’re destined to be a knight and a bard who battle evil. She can believe she’s found the thing she’s been made for.", "Hazel lives with her brother, Ben, in the strange town of Fairfold where humans and fae exist side by side. The faeries’ seemingly harmless magic attracts tourists, but Hazel knows how dangerous they can be, and she knows how to stop them. Or she did, once.", "At the center of it all, there is a glass coffin in the woods. It rests right on the ground and in it sleeps a boy with horns on his head and ears as pointed as knives. Hazel and Ben were both in love with him as children. The boy has slept there for generations, never waking.", "Until one day, he does…", "As the world turns upside down, Hazel tries to remember her years pretending to be a knight. But swept up in new love, shifting loyalties, and the fresh sting of betrayal, will it be enough?"], "author": "Holly Black", "num_pages": "336", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2016)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-13 00:00:00", "ISBN": "0316213071"},
{"url": "https://www.goodreads.com/book/show/10744752-adaptation", "num_ratings": "6,346", "num_reviews": "920", "avg_ratings": 3.62, "genres": ["Young Adult", "Science Fiction", "Lgbt", "Fiction", "Glbt", "Queer"], "title": "Adaptation", "description": ["Reese can’t remember anything from the time between the accident and the day she woke up almost a month later. She only knows one thing: She’s different now.", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of tra", "Reese can’t remember anything from the time between the accident and the day she woke up almost a month later. She only knows one thing: She’s different now.", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of travelers are stranded.", "Reese and her debate team partner and longtime crush David are in Arizona when it happens. Everyone knows the world will never be the same. On their drive home to San Francisco, along a stretch of empty highway at night in the middle of Nevada, a bird flies into their headlights. The car flips over. When they wake up in a military hospital, the doctor won’t tell them what happened, where they are—or how they’ve been miraculously healed.", "Things become even stranger when Reese returns home. San Francisco feels like a different place with police enforcing curfew, hazmat teams collecting dead birds, and a strange presence that seems to be following her. When Reese unexpectedly collides with the beautiful Amber Gray, her search for the truth is forced in an entirely new direction—and threatens to expose a vast global conspiracy that the government has worked for decades to keep secret."], "author": "Malinda Lo", "num_pages": "386", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-18 00:00:00", "ISBN": "0316197963"},
{"url": "https://www.goodreads.com/book/show/9464733-beauty-queens", "num_ratings": "44,987", "num_reviews": "7,071", "avg_ratings": 3.61, "genres": ["Young Adult", "Humor", "Contemporary", "Fiction", "Lgbt"], "title": "Beauty Queens", "description": ["When a plane crash strands thirteen teen beauty contestants on a mysterious island, they struggle to survive, to get along with one another, to combat the island's other diabolical occupants, and to learn their dance numbers in case they are rescued in time for the competition."], "author": "Libba Bray", "num_pages": "396", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Young Adult Novel (2011)", "Audie Award for Narration by the Author or Authors (2012)", "Los Angeles Times Book Prize Nominee for Young Adult Literature (2011)", "Milwaukee County Teen Book Award Nominee (2012)", "James Tiptree Jr. Award Honor List (2011)"], "places": ["an island in the middle of nowhere"], "character_names": ["Taylor (Miss Texas)", "Adina (Miss New Hampshire)"], "language": "English", "publish_date": "2011-05-24 00:00:00", "ISBN": "0439895979"},
{"url": "https://www.goodreads.com/book/show/16303287-the-bane-chronicles", "num_ratings": "50,420", "num_reviews": "4,846", "avg_ratings": 4.19, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal"], "title": "The Bane Chronicles", "description": ["Fans of The Mortal Instruments and The Infernal Devices can get to know warlock Magnus Bane like never before in this collection of New York Times bestselling tales, in print for the first time with an exclusive new story and illustrated material.", "This collection of eleven short stories illuminates the life of the enigmatic Magnus Bane, whose alluring personality, flamboyan", "Fans of The Mortal Instruments and The Infernal Devices can get to know warlock Magnus Bane like never before in this collection of New York Times bestselling tales, in print for the first time with an exclusive new story and illustrated material.", "This collection of eleven short stories illuminates the life of the enigmatic Magnus Bane, whose alluring personality, flamboyant style, and sharp wit populate the pages of the #1 New York Times bestselling series, The Mortal Instruments and The Infernal Devices.", "Originally released one-by-one as e-only short stories by Cassandra Clare, Maureen Johnson, and Sarah Rees Brennan, this compilation presents all ten together in print for the first time and includes a never-before-seen eleventh tale, as well as new illustrated material."], "author": "Cassandra Clare", "num_pages": "507", "awards": [], "places": [], "character_names": ["Alec Lightwood", "Valentine Morgenstern", "Theresa Gray", "Magnus Bane", "William Herondale", "James Carstairs", "Jocelyn Fray", "Luke Garroway", "Camille Belcourt", "Ragnor Fell", "Catarina Loss", "Edmund Herondale", "Raphael Santiago", "James Herondale", "Tatiana Blackthorn"], "language": "English", "publish_date": "2014-11-11 00:00:00", "ISBN": "1442495995"},
{"url": "https://www.goodreads.com/book/show/17347389-the-dream-thieves", "num_ratings": "104,552", "num_reviews": "12,750", "avg_ratings": 4.27, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal"], "title": "The Dream Thieves", "description": ["The second installment in the all-new series from the masterful, #1 NEW YORK TIMES bestselling author Maggie Stiefvater!", "Now that the ley lines around Cabeswater have been woken, nothing for Ronan, Gansey, Blue, and Adam will be the same. Ronan, for one, is falling more and more deeply into his dreams, and his dreams are intruding more and more into waking life. Meanwhile,", "The second installment in the all-new series from the masterful, #1 NEW YORK TIMES bestselling author Maggie Stiefvater!", "Now that the ley lines around Cabeswater have been woken, nothing for Ronan, Gansey, Blue, and Adam will be the same. Ronan, for one, is falling more and more deeply into his dreams, and his dreams are intruding more and more into waking life. Meanwhile, some very sinister people are looking for some of the same pieces of the Cabeswater puzzle that Gansey is after…"], "author": "Maggie Stiefvater", "num_pages": "439", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2017)", "Milwaukee County Teen Book Award Nominee (2015)"], "places": ["Henrietta, Virginia"], "character_names": ["Blue Sargent", "Richard \"Dick\" Campbell Gansey III", "Adam Parrish", "Ronan Lynch", "Noah (The Raven Cycle)"], "language": "English", "publish_date": "2013-09-17 00:00:00", "ISBN": "0545424941"},
{"url": "https://www.goodreads.com/book/show/16100972-openly-straight", "num_ratings": "20,752", "num_reviews": "2,117", "avg_ratings": 3.92, "genres": ["Lgbt", "Young Adult", "Contemporary", "Romance"], "title": "Openly Straight", "description": ["The award-winning novel about being out, being proud, and being ready for something else . . . now in paperback.", "Rafe is a normal teenager from Boulder, Colorado. He plays soccer. He's won skiing prizes. He likes to write.", "And, oh yeah, he's gay. He's been out since 8th grade, and he isn't teased, and he goes to other high schools and talks about tolerance and stuff. And whi", "The award-winning novel about being out, being proud, and being ready for something else . . . now in paperback.", "Rafe is a normal teenager from Boulder, Colorado. He plays soccer. He's won skiing prizes. He likes to write.", "And, oh yeah, he's gay. He's been out since 8th grade, and he isn't teased, and he goes to other high schools and talks about tolerance and stuff. And while that's important, all Rafe really wants is to just be a regular guy. Not that GAY guy. To have it be a part of who he is, but not the headline, every single time.", "So when he transfers to an all-boys' boarding school in New England, he decides to keep his sexuality a secret -- not so much going back in the closet as starting over with a clean slate. But then he sees a classmate break down. He meets a teacher who challenges him to write his story. And most of all, he falls in love with Ben . . . who doesn't even know that love is possible.", " This witty, smart, coming-out-again story will appeal to gay and straight kids alike as they watch Rafe navigate feeling different, fitting in, and what it means to be himself."], "author": "Bill Konigsberg", "num_pages": "320", "awards": ["Georgia Peach Book Award Nominee (2013)", "Sid Fleischman Humor Award (2014)", "Lambda Literary Award Nominee for LGBT Children’s/Young Adult (2014)", "Amelia Elizabeth Walden Award Nominee (2014)"], "places": ["Boulder, Colorado", "Natick, Massachusetts", "Boston, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2013-05-28 00:00:00", "ISBN": "0545509890"},
{"url": "https://www.goodreads.com/book/show/13262783-every-day", "num_ratings": "163,664", "num_reviews": "18,508", "avg_ratings": 3.97, "genres": ["Young Adult", "Romance", "Fantasy", "Contemporary", "Fiction"], "title": "Every Day", "description": ["It’s all fine until the morning that A wakes up in the body of Justin and meet", "It’s all fine until the morning that A wakes up in the body of Justin and meets Justin’s girlfriend, Rhiannon. From that moment, the rules by which A has been living no longer apply. Because finally A has found someone A wants to be with—day in, day out, day after day."], "author": "David Levithan", "num_pages": "322", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2014)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2015)", "The Inky Awards Nominee for Silver Inky (2013)", "Lincoln Award Nominee (2014)", "Andre Norton Award Nominee (2012)", "NAIBA Book of the Year for Young Adult (2013)", "Cybils Award Nominee for Fantasy & Science Fiction (Young Adult) (2012)", "Green Mountain Book Award Nominee (2015)", "Missouri Gateway Readers Award Nominee (2015)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2012)"], "places": ["Maryland"], "character_names": ["Rhiannon", "A"], "language": "English", "publish_date": "2012-08-28 00:00:00", "ISBN": "0307931889"},
{"url": "https://www.goodreads.com/book/show/17237214-two-boys-kissing", "num_ratings": "32,874", "num_reviews": "3,645", "avg_ratings": 4.09, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance", "Fiction"], "title": "Two Boys Kissing", "description": ["  bestselling author David Levithan tells the based-on-true-events story of Harry and Craig, two 17-year-olds who are about to take part in a 32-hour marathon of kissing to set a new Guinness World Record—all of which is narrated by a Greek Chorus of the generation of gay men lost to AIDS. ", "While the two increasingly dehydrated and sleep-deprived boys are lock", "  bestselling author David Levithan tells the based-on-true-events story of Harry and Craig, two 17-year-olds who are about to take part in a 32-hour marathon of kissing to set a new Guinness World Record—all of which is narrated by a Greek Chorus of the generation of gay men lost to AIDS. ", "While the two increasingly dehydrated and sleep-deprived boys are locking lips, they become a focal point in the lives of other teen boys dealing with languishing long-term relationships, coming out, navigating gender identity, and falling deeper into the digital rabbit hole of gay hookup sites—all while the kissing former couple tries to figure out their own feelings for each other."], "author": "David Levithan", "num_pages": "196", "awards": ["National Book Award Nominee for Young People’s Literature (2013)", "Stonewall Book Award Nominee for Children's & Young Adult Literature (2014)", "Milwaukee County Teen Book Award Nominee (2014)", "Lambda Literary Award Nominee for LGBT Children's/Young Adult (2014)", "The Inky Awards Nominee for Silver Inky (2014)", "NAIBA Book of the Year for Young Adult (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-27 00:00:00", "ISBN": "0307931900"},
{"url": "https://www.goodreads.com/book/show/18079719-grasshopper-jungle", "num_ratings": "15,092", "num_reviews": "3,084", "avg_ratings": 3.65, "genres": ["Young Adult", "Lgbt", "Science Fiction"], "title": "Grasshopper Jungle", "description": ["Sixteen-year-old Austin Szerba interweaves the story of his Polish legacy with the story of how he and his best friend , Robby, brought about the end of humanity and the rise of an army of unstoppable, six-foot tall praying mantises in small-town Iowa.", "To make matters worse, Austin's hormones are totally oblivious; they don't care that the world is in utter chaos: Austin is", "Sixteen-year-old Austin Szerba interweaves the story of his Polish legacy with the story of how he and his best friend , Robby, brought about the end of humanity and the rise of an army of unstoppable, six-foot tall praying mantises in small-town Iowa.", "To make matters worse, Austin's hormones are totally oblivious; they don't care that the world is in utter chaos: Austin is in love with his girlfriend, Shann, but remains confused about his sexual orientation. He's stewing in a self-professed constant state of maximum horniness, directed at both Robby and Shann. Ultimately, it's up to Austin to save the world and propagate the species in this sci-fright journey of survival, sex, and the complex realities of the human condition."], "author": "Andrew  Smith", "num_pages": "388", "awards": ["Michael L. Printz Award Nominee (2015)", "Milwaukee County Teen Book Award Nominee (2015)", "Boston Globe-Horn Book Award for Fiction (2014)", "The Inky Awards Nominee for Silver Inky (2015)", "The Kitschies for Red Tentacle (Novel) (2014)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera independiente (2014)"], "places": ["Ealing, Iowa"], "character_names": [], "language": "English", "publish_date": "2014-02-11 00:00:00", "ISBN": "0525426035"},
{"url": "https://www.goodreads.com/book/show/18187013-the-raven-king", "num_ratings": "13,029", "num_reviews": "1,498", "avg_ratings": 4.47, "genres": ["Lgbt", "Contemporary", "Young Adult", "Sports and Games", "Sports"], "title": "The Raven King", "description": ["Book 2 of All for the Game; The Raven King follows The Foxhole Court", "The Foxes are a fractured mess, but their latest disaster might be the miracle they've always needed to come together as a team. The one person standing in their way is Andrew, and the only one who can break through his personal barriers is Neil.", "Except Andrew doesn't give up anything for free and Neil is t", "Book 2 of All for the Game; The Raven King follows The Foxhole Court", "The Foxes are a fractured mess, but their latest disaster might be the miracle they've always needed to come together as a team. The one person standing in their way is Andrew, and the only one who can break through his personal barriers is Neil.", "Except Andrew doesn't give up anything for free and Neil is terrible at trusting anyone but himself. The two don't have much time to come to terms with their situation before outside forces start tearing them apart. Riko is intent on destroying Neil's fragile new life, and the Foxes have just become collateral damage.", "Neil's days are numbered, but he's learning the hard way to go down fighting for what he believes in, and Neil believes in Andrew even if Andrew won't believe in himself."], "author": "Nora Sakavic", "num_pages": "423", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20579291-lies-we-tell-ourselves", "num_ratings": "9,232", "num_reviews": "1,498", "avg_ratings": 4.11, "genres": ["Historical", "Historical Fiction", "Young Adult", "Lgbt", "Historical", "Fiction"], "title": "Lies We Tell Ourselves", "description": ["In 1959 Virginia, the lives of two girls on opposite sides of the battle for civil rights will be changed forever.", "Sarah Dunbar is one of the first black students to attend the previously all-white Jefferson High School. An honors student at her old school, she is put into remedial classes, spit on and tormented daily.", "Linda Hairston is the daughter of one of the town's most", "In 1959 Virginia, the lives of two girls on opposite sides of the battle for civil rights will be changed forever.", "Sarah Dunbar is one of the first black students to attend the previously all-white Jefferson High School. An honors student at her old school, she is put into remedial classes, spit on and tormented daily.", "Linda Hairston is the daughter of one of the town's most vocal opponents of school integration. She has been taught all her life that the races should be kept separate but equal.", "Forced to work together on a school project, Sarah and Linda must confront harsh truths about race, power and how they really feel about one another.", "Boldly realistic and emotionally compelling, Lies We Tell Ourselves is a brave and stunning novel about finding truth amid the lies, and finding your voice even when others are determined to silence it."], "author": "Robin Talley", "num_pages": "368", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Lambda Literary Award Nominee (2015)", "Goodreads Choice Award Nominee for Young Adult Fiction (2014)", "Carnegie Medal Nominee (2016)"], "places": ["Virginia"], "character_names": [], "language": "English", "publish_date": "2014-09-30 00:00:00", "ISBN": "0373211333"},
{"url": "https://www.goodreads.com/book/show/20517739-far-from-you", "num_ratings": "9,773", "num_reviews": "1,204", "avg_ratings": 4.03, "genres": ["Young Adult", "Mystery", "Lgbt", "Contemporary"], "title": "Far From You", "description": ["That's how long recovering addict Sophie's been drug-free. Four months ago her best friend, Mina, died in what everyone believes was a drug deal gone wrong - a deal they think Sophie set up. Only Sophie knows the truth. She and Mina shared a secret, but there was no drug deal. Mina was deliberately murdered.", "Forced into rehab for an addictio", "That's how long recovering addict Sophie's been drug-free. Four months ago her best friend, Mina, died in what everyone believes was a drug deal gone wrong - a deal they think Sophie set up. Only Sophie knows the truth. She and Mina shared a secret, but there was no drug deal. Mina was deliberately murdered.", "Forced into rehab for an addiction she'd already beaten, Sophie's finally out and on the trail of the killer—but can she track them down before they come for her?"], "author": "Tess Sharpe", "num_pages": "341", "awards": [], "places": ["Northern California"], "character_names": ["Sophie Winters", "Mina Bishop", "Trev Bishop"], "language": "English", "publish_date": "2014-03-27 00:00:00", "ISBN": "1780621655"},
{"url": "https://www.goodreads.com/book/show/6567017-will-grayson-will-grayson", "num_ratings": "287,794", "num_reviews": "16,861", "avg_ratings": 3.82, "genres": ["Young Adult", "Contemporary", "Lgbt", "Fiction"], "title": "Will Grayson, Will Grayson", "description": ["Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.", "It's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the sa", "Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.", "It's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the same surprising crossroads, the Will Graysons find their lives overlapping and hurtling in new and unexpected directions. With a push from friends new and old - including the massive, and massively fabulous, Tiny Cooper, offensive lineman and musical theater auteur extraordinaire - Will and Will begin building toward respective romantic turns-of-heart and the epic production of history's most awesome high school musical."], "author": "John Green", "num_pages": "310", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2011)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Novel (2010)", "Odyssey Award Nominee (2011)", "Milwaukee County Teen Book Award (2011)", "Children's Choice Book Award for Teen Choice Book of the Year (2011)", "The Inky Awards Nominee for Silver Inky (2010)", "Lincoln Award Nominee (2013)", "Goodreads Choice Award Nominee for Young Adult Fiction (2010)", "The Inky Awards Shortlist for Silver Inky (2010)"], "places": ["Illinois"], "character_names": ["Will Grayson", "Tiny Cooper", "Jane Turner", "Maura"], "language": "English", "publish_date": "2010-04-06 00:00:00", "ISBN": "0525421580"},
{"url": "https://www.goodreads.com/book/show/6472451-ash", "num_ratings": "27,424", "num_reviews": "3,025", "avg_ratings": 3.62, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Fiction"], "title": "Ash", "description": ["In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she bel", "In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she believes that her wish may be granted.", "The day that Ash meets Kaisa, the King's Huntress, her heart begins to change. Instead of chasing fairies, Ash learns to hunt with Kaisa. Though their friendship is as delicate as a new bloom, it reawakens Ash's capacity for love-and her desire to live. But Sidhean has already claimed Ash for his own, and she must make a choice between fairy tale dreams and true love.", "Entrancing, empowering, and romantic, ", " is about the connection between life and love, and solitude and death, where transformation can come from even the deepest grief."], "author": "Malinda Lo", "num_pages": "264", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2010)", "Gaylactic Spectrum Award Nominee for Best Novel (2010)", "William C. Morris YA Debut Award Nominee (2010)", "James Tiptree Jr. Award Nominee for Longlist (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Andre Norton Award Nominee (2009)"], "places": [], "character_names": ["Aisling", "Kaisa", "Sidhean"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0316040096"},
{"url": "https://www.goodreads.com/book/show/16101023-proxy", "num_ratings": "9,086", "num_reviews": "1,440", "avg_ratings": 3.9, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Lgbt", "Science Fiction"], "title": "Proxy", "description": ["Knox was born into one of the City’s wealthiest families. A Patron, he has everything a boy could possibly want—the latest tech, the coolest clothes, and a Proxy to take all his punishments. When Knox breaks a vase, Syd is beaten. When Knox plays a practical joke, Syd is forced to haul rocks. And when Knox crashes a car, killing one of his friends, Syd is branded and sente", "Knox was born into one of the City’s wealthiest families. A Patron, he has everything a boy could possibly want—the latest tech, the coolest clothes, and a Proxy to take all his punishments. When Knox breaks a vase, Syd is beaten. When Knox plays a practical joke, Syd is forced to haul rocks. And when Knox crashes a car, killing one of his friends, Syd is branded and sentenced to death.", "Syd is a Proxy. His life is not his own.", "Then again, neither is Knox’s. Knox and Syd have more in common than either would guess. So when Knox and Syd realize that the only way to beat the system is to save each other, they flee. Yet Knox’s father is no ordinary Patron, and Syd is no ordinary Proxy. The ensuing cross-country chase will uncover a secret society of rebels, test both boys’ resolve, and shine a blinding light onto a world of those who owe and those who pay. Some debts, it turns out, cannot be repaid."], "author": "Alex London", "num_pages": "384", "awards": ["Missouri Gateway Readers Award Nominee (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-18 00:00:00", "ISBN": "0399257764"},
{"url": "https://www.goodreads.com/book/show/20820994-i-ll-give-you-the-sun", "num_ratings": "196,152", "num_reviews": "19,524", "avg_ratings": 4.13, "genres": ["Young Adult", "Contemporary", "Lgbt", "Romance", "Fiction"], "title": "I'll Give You the Sun", "description": ["At first, Jude and her twin brother Noah, are inseparable. Noah draws constantly and is falling in love with the charismatic boy next door, while daredevil Jude wears red-red lipstick, cliff-dives, and does all the talking for both of them.", "At first, Jude and her twin brother Noah, are inseparable. Noah draws constantly and is falling in love with the charismatic boy next door, while daredevil Jude wears red-red lipstick, cliff-dives, and does all the talking for both of them. ", "Years later, they are barely speaking. Something has happened to change the twins in different yet equally devastating ways . . . but then Jude meets an intriguing, irresistible boy and a mysterious new mentor. ", "The early years are Noah’s to tell; the later years are Jude’s. But they each have only half the story, and if they can only find their way back to one another, they’ll have a chance to remake their world. ", "This radiant, award-winning novel from the acclaimed author of The Sky Is Everywhere will leave you breathless and teary and laughing—often all at once. "], "author": "Jandy Nelson", "num_pages": "371", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2015)", "Georgia Peach Book Award Nominee for Honor book (2015)", "Josette Frank Award for Younger Readers (2015)", "Michael L. Printz Award (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Milwaukee County Teen Book Award Nominee (2016)", "The Inky Awards for Silver Inky (2016)", "Lincoln Award Nominee (2016)", "Goodreads Choice Award Nominee for Young Adult Fiction (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2015)"], "places": ["California"], "character_names": ["Jude Sweetwine", "Noah Sweetwine", "Dianna Sweetwine", "Benjamin Sweetwine", "Grandma Sweetwine", "Guillermo Garcia", "Brian Connelly", "Oscar Ralph"], "language": "English", "publish_date": "2014-09-16 00:00:00", "ISBN": "0803734964"},
{"url": "https://www.goodreads.com/book/show/11595276-the-miseducation-of-cameron-post", "num_ratings": "22,718", "num_reviews": "2,642", "avg_ratings": 3.99, "genres": ["Young Adult", "Lgbt", "Fiction", "Contemporary", "Glbt", "Queer"], "title": "The Miseducation of Cameron Post", "description": ["When Cameron Post’s parents die suddenly in a car crash, her shocking first thought is relief. Relief they’ll never know that, hours earlier, she had been kissing a girl.", "But that relief doesn’t last, and Cam is soon forced to move in with her conservative aunt Ruth and her well-intentioned but hopelessly old-fashioned grandmother. She knows that from this point on, her lif", "When Cameron Post’s parents die suddenly in a car crash, her shocking first thought is relief. Relief they’ll never know that, hours earlier, she had been kissing a girl.", "But that relief doesn’t last, and Cam is soon forced to move in with her conservative aunt Ruth and her well-intentioned but hopelessly old-fashioned grandmother. She knows that from this point on, her life will forever be different. Survival in Miles City, Montana, means blending in and leaving well enough alone (as her grandmother might say), and Cam becomes an expert at both.", "Then Coley Taylor moves to town. Beautiful, pickup-driving Coley is a perfect cowgirl with the perfect boyfriend to match. She and Cam forge an unexpected and intense friendship — one that seems to leave room for something more to emerge. But just as that starts to seem like a real possibility, ultrareligious Aunt Ruth takes drastic action to ‘fix’ her niece, bringing Cam face-to-face with the cost of denying her true self — even if she’s not exactly sure who that is.", " is a stunning and unforgettable literary debut about discovering who you are and finding the courage to live life according to your own rules."], "author": "Emily M. Danforth", "num_pages": "470", "awards": ["William C. Morris YA Debut Award Nominee (2013)", "Montana Book Award (2012)", "Goodreads Choice Award Nominee for Best Young Adult Fiction (2012)"], "places": ["Miles City, Montana"], "character_names": ["Cameron Post", "Coley Taylor"], "language": "English", "publish_date": "2012-02-07 00:00:00", "ISBN": "0062020560"},
{"url": "https://www.goodreads.com/book/show/18667779-everything-leads-to-you", "num_ratings": "23,150", "num_reviews": "2,559", "avg_ratings": 3.88, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "Everything Leads to You", "description": ["  ", " A wunderkind young set designer, Emi has already started to find her way in the competitive Hollywood film world.", "  ", " Emi is a film buff and a true romantic, but her real-life relationships are a mess. She has desperately gone back to the s", "  ", " A wunderkind young set designer, Emi has already started to find her way in the competitive Hollywood film world.", "  ", " Emi is a film buff and a true romantic, but her real-life relationships are a mess. She has desperately gone back to the same girl too many times to mention. But then a mysterious letter from a silver screen legend leads Emi to Ava. Ava is unlike anyone Emi has ever met. She has a tumultuous, not-so-glamorous past, and lives an unconventional life. She’s enigmatic…. She’s beautiful. And she is about to expand Emi’s understanding of family, acceptance, and true romance.", "  "], "author": "Nina LaCour", "num_pages": "307", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2014)"], "places": ["Venice, California"], "character_names": ["Emi Price", "Charlotte Young", "Ava Wilder"], "language": "English", "publish_date": "2014-05-15 00:00:00", "ISBN": "0525425888"},
{"url": "https://www.goodreads.com/book/show/21969786-more-than-this", "num_ratings": "37,418", "num_reviews": "5,993", "avg_ratings": 4.02, "genres": ["Young Adult", "Science Fiction", "Lgbt", "Science Fiction", "Dystopia"], "title": "More Than This", "description": ["A boy drowns, desperate and alone in his final moments. He dies. Then he wakes, naked and bruised and thirsty, but alive. How can this be? And what is this strange deserted place?", "As he struggles to understand what is happening, the boy dares to hope. Might this not be the end? Might there be more to this life, or perhaps this afterlife?", "From multi-award-winning Patrick Ness", "A boy drowns, desperate and alone in his final moments. He dies. Then he wakes, naked and bruised and thirsty, but alive. How can this be? And what is this strange deserted place?", "As he struggles to understand what is happening, the boy dares to hope. Might this not be the end? Might there be more to this life, or perhaps this afterlife?", "From multi-award-winning Patrick Ness comes one of the most provocative and moving novels of our time."], "author": "Patrick Ness", "num_pages": "480", "awards": ["Milwaukee County Teen Book Award Nominee (2015)", "The Kitschies Nominee for Red Tentacle (Novel) (2013)", "Carnegie Medal Nominee (2015)"], "places": [], "character_names": ["Seth Wearing"], "language": "English", "publish_date": "2014-05-01 00:00:00", "ISBN": "1406350486"},
{"url": "https://www.goodreads.com/book/show/19547856-simon-vs-the-homo-sapiens-agenda", "num_ratings": "158,196", "num_reviews": "24,566", "avg_ratings": 4.34, "genres": ["Young Adult", "Contemporary", "Lgbt", "Romance"], "title": "Simon vs. the Homo Sapiens Agenda", "description": ["Sixteen-year-old and not-so-openly gay Simon Spier prefers to save his drama for the school musical. But when an email falls into the wrong hands, his secret is at risk of being thrust into the spotlight. Now Simon is actually being blackmailed: if he doesn’t play wingman for class clown Martin, his sexual identity will become everyone’s business. Worse, the privacy of Blu", "Sixteen-year-old and not-so-openly gay Simon Spier prefers to save his drama for the school musical. But when an email falls into the wrong hands, his secret is at risk of being thrust into the spotlight. Now Simon is actually being blackmailed: if he doesn’t play wingman for class clown Martin, his sexual identity will become everyone’s business. Worse, the privacy of Blue, the pen name of the boy he’s been emailing, will be compromised.", "With some messy dynamics emerging in his once tight-knit group of friends, and his email correspondence with Blue growing more flirtatious every day, Simon’s junior year has suddenly gotten all kinds of complicated. Now, change-averse Simon has to find a way to step out of his comfort zone before he’s pushed out—without alienating his friends, compromising himself, or fumbling a shot at happiness with the most confusing, adorable guy he’s never met."], "author": "Becky Albertalli", "num_pages": "303", "awards": ["National Book Award Nominee for Young People's Literature (2015)", "William C. Morris YA Debut Award (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Milwaukee County Teen Book Award (2016)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2017)", "Lincoln Award Nominee (2017)", "Goodreads Choice Award Nominee for Debut Goodreads Author, and for Young Adult Fiction (2015)"], "places": ["Atlanta, Georgia"], "character_names": ["Simon Spier", "Martin Addison", "Abby Suso", "Nick Eisner", "Leah Burke"], "language": "English", "publish_date": "2015-04-07 00:00:00", "ISBN": "0062348671"},
{"url": "https://www.goodreads.com/book/show/23734628-carry-on", "num_ratings": "117,626", "num_reviews": "18,265", "avg_ratings": 4.21, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance"], "title": "Carry On", "description": ["Simon Snow is the worst chosen one who’s ever been chosen.", "That’s what his roommate, Baz, says. And Baz might be evil and a vampire and a complete git, but he’s probably right.", "Half the time, Simon can’t even make his wand work, and the other half, he sets something on fire. His mentor’s avoiding him, his girlfriend broke up with him, and there’s a magic-eating monster runni", "Simon Snow is the worst chosen one who’s ever been chosen.", "That’s what his roommate, Baz, says. And Baz might be evil and a vampire and a complete git, but he’s probably right.", "Half the time, Simon can’t even make his wand work, and the other half, he sets something on fire. His mentor’s avoiding him, his girlfriend broke up with him, and there’s a magic-eating monster running around wearing Simon’s face. Baz would be having a field day with all this, if he were here—it’s their last year at the Watford School of Magicks, and Simon’s infuriating nemesis didn’t even bother to show up.", " is a ghost story, a love story, a mystery and a melodrama. It has just as much kissing and talking as you’d expect from a Rainbow Rowell story—but far, far more monsters."], "author": "Rainbow Rowell", "num_pages": "522", "awards": ["Milwaukee County Teen Book Award Nominee (2017)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2016)"], "places": [], "character_names": ["Simon Snow", "Tyrannus Basilton \"Baz\" Grimm-Pitch", "Penelope Bunce", "Agatha Wellbelove"], "language": "English", "publish_date": "2015-10-06 00:00:00", "ISBN": "1250049555"}
]