[
{"url": "https://www.goodreads.com/book/show/24687.Don_t_Let_s_Go_to_the_Dogs_Tonight", "num_ratings": "44,010", "num_reviews": "3,108", "avg_ratings": 3.96, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Africa", "Biography"], "title": "Don't Let's Go to the Dogs Tonight: An African Childhood", "description": ["In ", ", Alexandra Fuller remembers her African childhood with candor and sensitivity. Though it is a diary of an unruly life in an often inhospitable place, it is suffused with Fuller’s endearing ability to find laughter, even when there is little to celebrate. Fuller’s debut is unsentimental and unflinching but always captivating. In wry and", "In ", ", Alexandra Fuller remembers her African childhood with candor and sensitivity. Though it is a diary of an unruly life in an often inhospitable place, it is suffused with Fuller’s endearing ability to find laughter, even when there is little to celebrate. Fuller’s debut is unsentimental and unflinching but always captivating. In wry and sometimes hilarious prose, she stares down disaster and looks back with rage and love at the life of an extraordinary family in an extraordinary time."], "author": "Alexandra Fuller", "num_pages": "315", "awards": ["Guardian First Book Award Nominee (2002)", "Book Sense Book of the Year Award for Adult Nonfiction (2003)", "Winifred Holtby Memorial Prize (2002)"], "places": ["Zimbabwe", "Malawi", "Zambia"], "character_names": [], "language": "English", "publish_date": "2003-03-11 00:00:00", "ISBN": "0375758992"},
{"url": "https://www.goodreads.com/book/show/2673374-walking-still", "num_ratings": "25", "num_reviews": "4", "avg_ratings": 3.92, "genres": ["Literature", "Fiction", "Short Stories", "Short Story Collection"], "title": "Walking Still", "description": ["Winner of the 1998 Commonwealth Writers Prize. Charles Mungoshi is one of Africa's foremost creative writers - both for adults and children - and a past winner of The Noma Award for Publishing in Africa. This new collection of short stories covers a range of characters and settings which portray people whose lives have been challenged by war and its aftermath, by changing", "Winner of the 1998 Commonwealth Writers Prize. Charles Mungoshi is one of Africa's foremost creative writers - both for adults and children - and a past winner of The Noma Award for Publishing in Africa. This new collection of short stories covers a range of characters and settings which portray people whose lives have been challenged by war and its aftermath, by changing cultural values, and by family commitments in a world that has lost its certitude. Relationships and locations are concrete, visual, cinematic. The stories question notions of value and responsibility."], "author": "Charles Mungoshi", "num_pages": "167", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1998)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-12-29 00:00:00", "ISBN": "0908311990"},
{"url": "https://www.goodreads.com/book/show/23814.King_Solomon_s_Mines", "num_ratings": "38,738", "num_reviews": "1,604", "avg_ratings": 3.8, "genres": ["Classics", "Fiction", "Adventure", "Fantasy", "Cultural", "Africa", "Historical", "Historical Fiction"], "title": "King Solomon's Mines", "description": ["King Solomon's Mines tells of a search of an unexplored region of Africa by a group of adventurers led by Allan Quatermain for the missing brother of one of the party. It is the first English adventure novel set in Africa, and is considered to be the genesis of the Lost World literary genre.", "Excerpt:", "Then there remains the most interesting subject - that, as it is, has only", "King Solomon's Mines tells of a search of an unexplored region of Africa by a group of adventurers led by Allan Quatermain for the missing brother of one of the party. It is the first English adventure novel set in Africa, and is considered to be the genesis of the Lost World literary genre.", "Excerpt:", "Then there remains the most interesting subject - that, as it is, has only been touched on incidentally - of the magnificent system of military organisation in force in that country, which, in my opinion, is much superior to that inaugurated by Chaka in Zululand, inasmuch as it permits of even more rapid mobilisation, and does not necessitate the employment of the pernicious system of forced celibacy. Lastly, I have scarcely spoken of the domestic and family customs of the Kukuanas, many of which are exceedingly quaint, or of their proficiency in the art of smelting and welding metals. This science they carry to considerable perfection, of which a good example is to be seen in their \"tollas,\" or heavy throwing knives, the backs of these weapons being made of hammered iron, and the edges of beautiful steel welded with great skill on to the iron frames. The fact of the matter is, I thought, with Sir Henry Curtis and Captain Good, that the best plan would be to tell my story in a plain, straightforward manner, and to leave these matters to be dealt with subsequently in whatever way ultimately may appear to be desirable. In the meanwhile I shall, of course, be delighted to give all information in my power to anybody interested in such things. ", "And now it only remains for me to offer apologies for my blunt way of writing.."], "author": "H. Rider Haggard", "num_pages": "264", "awards": [], "places": ["Zimbabwe"], "character_names": ["Allan Quatermain", "Sir Henry Curtis", "Good", "Umbopa/Ignosi"], "language": "English", "publish_date": "2002-12-10 00:00:00", "ISBN": "0812966295"},
{"url": "https://www.goodreads.com/book/show/658381.Casting_with_a_Fragile_Thread", "num_ratings": "441", "num_reviews": "68", "avg_ratings": 3.66, "genres": ["Cultural", "Africa", "Autobiography", "Memoir", "Nonfiction", "Eastern Africa", "Zimbabwe", "Biography", "Adult"], "title": "Casting with a Fragile Thread: A Story of Sisters and Africa", "author": "Wendy Kann", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-02 00:00:00", "ISBN": "0805079564"},
{"url": "https://www.goodreads.com/book/show/12581611-the-collapse-of-rhodesia", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 3.0, "genres": [], "title": "The Collapse of Rhodesia: Population Demographics and the Politics of Race", "description": ["In the years leading up to Rhodesia’s Unilateral Declaration of Independence in 1965, its small and transient white population was balanced precariously atop a large and fast-growing African population. This unstable political demography was set against the backdrop of continent-wide decolonisation and a parallel rise in African nationalism within Rhodesia. ", "In the years leading up to Rhodesia’s Unilateral Declaration of Independence in 1965, its small and transient white population was balanced precariously atop a large and fast-growing African population. This unstable political demography was set against the backdrop of continent-wide decolonisation and a parallel rise in African nationalism within Rhodesia. ", " provides a controversial re-examination of the final decades of white minority rule. Josiah Brownell argues that racial population demographics and the pressures they produced were a pervasive, but hidden, force behind many of Rhodesia’s most dramatic political events, including UDI. He concludes that the UDI rebellion eventually failed because the state was unable to successfully redress white Rhodesia’s fundamental demographic weaknesses. By addressing this vital demographic component of the multifaceted conflict, this book is an important contribution to the historiography of the last years of white rule in Rhodesia."], "author": "Josiah Brownell", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-12-15 00:00:00", "ISBN": "1848854757"},
{"url": "https://www.goodreads.com/book/show/6066132-harare-north", "num_ratings": "238", "num_reviews": "26", "avg_ratings": 3.46, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Literature", "African Literature"], "title": "Harare North", "description": ["Caine Prize winner Brian Chikwava tackles the realities of life in London for Africa’s dispossessed in this fearlessly political and very funny story of an illegal Zimbabwean immigrant seeking a better life in England — with a past he is determined to hide."], "author": "Brian Chikwava", "num_pages": "240", "awards": [], "places": ["London, England"], "character_names": [], "language": "English", "publish_date": "2009-05-19 00:00:00", "ISBN": "0224086111"},
{"url": "https://www.goodreads.com/book/show/1418467.Bones", "num_ratings": "89", "num_reviews": "7", "avg_ratings": 3.71, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Literature", "African Literature", "Literature"], "title": "Bones (African Writers)", "description": ["Bones is a poetic novel about the guerilla fight for freedom in Zimbabwe, but unlike a conventional novel, all the action is interior monologues -- some by specific characters, others by representatives of certain types produced by colonial history, or by spirits. The story involves a mother's love, and a lover's yearning, for a young man who has joined the freedom fighter", "Bones is a poetic novel about the guerilla fight for freedom in Zimbabwe, but unlike a conventional novel, all the action is interior monologues -- some by specific characters, others by representatives of certain types produced by colonial history, or by spirits. The story involves a mother's love, and a lover's yearning, for a young man who has joined the freedom fighters. Hove captures the ambivalence and conflicts of loyalties in the attitude of the peasants towards the guerillas, and underscores the state's indifference to the lives of ordinary people."], "author": "Chenjerai Hove", "num_pages": "113", "awards": ["Noma Award for Publishing in Africa (1989)"], "places": [], "character_names": [], "language": "English", "publish_date": "1990-07-16 00:00:00", "ISBN": "0435905767"},
{"url": "https://www.goodreads.com/book/show/863234.The_House_of_Hunger", "num_ratings": "455", "num_reviews": "41", "avg_ratings": 3.96, "genres": ["Cultural", "Africa", "Fiction", "Short Stories", "Literature", "African Literature", "Eastern Africa", "Zimbabwe"], "title": "The House of Hunger", "description": ["Winner of the Guardian fiction prize, this novella and nine short stories describe life in a Zimbabwean township. They are about the brutalization of the individual's mental processes, until madness, violence and despair become the normal state of affairs for families in black urban areas."], "author": "Dambudzo Marechera", "num_pages": "160", "awards": ["Guardian Fiction Award (1979)"], "places": [], "character_names": [], "language": "English", "publish_date": "1993-12-07 00:00:00", "ISBN": "043590986X"},
{"url": "https://www.goodreads.com/book/show/420464.Butterfly_Burning", "num_ratings": "372", "num_reviews": "39", "avg_ratings": 3.69, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Literature", "African Literature", "Feminism", "Womens"], "title": "Butterfly Burning", "description": [" brings the brilliantly poetic voice of Zimbabwean writer Yvonne Vera to American readers for the first time. Set in Makokoba, a black township, in the late 1940s, the novel is an intensely bittersweet love story. When Fumbatha, a construction worker, meets the much younger Phephelaphi, he\"wants her like the land beneath his feet from which birth had sever", " brings the brilliantly poetic voice of Zimbabwean writer Yvonne Vera to American readers for the first time. Set in Makokoba, a black township, in the late 1940s, the novel is an intensely bittersweet love story. When Fumbatha, a construction worker, meets the much younger Phephelaphi, he\"wants her like the land beneath his feet from which birth had severed him.\" He in turn fills her \"with hope larger than memory.\" But Phephelaphi is not satisfied with their \"one-room\" love alone. The qualities that drew Fumbatha to her, her sense of independence and freedom, end up separating them. And the closely woven fabric of township life, where everyone knows everyone else, has a mesh too tight and too intricate to allow her to escape her circumstances on her own.", "Vera exploits language to peel away the skin of public and private lives. In ", " she captures the ebullience and the bitterness of township life, as well as the strength and courage of her unforgettable heroine."], "author": "Yvonne Vera", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-12 00:00:00", "ISBN": "0374291861"},
{"url": "https://www.goodreads.com/book/show/1418548.Voices_from_the_Rocks", "num_ratings": "8", "num_reviews": "0", "avg_ratings": 4.0, "genres": ["Eastern Africa", "Zimbabwe", "Cultural", "Africa", "History"], "title": "Voices from the Rocks: Nature, Culture, and History in the Matopos Hills of Zimbabwe", "description": ["\"Terence Ranger's Revolt in Southern Rhodesia 1896-97 opened out decades of important debate about religion and violence in the early colonial encounter. This book is its challenging, much awaited sequel at the very cutting edge of postcolonial studies.\" --Richard Werbner, Professor of Social Anthropology, University of Manchester", "Occupied by humanity for some 40,000 years,", "\"Terence Ranger's Revolt in Southern Rhodesia 1896-97 opened out decades of important debate about religion and violence in the early colonial encounter. This book is its challenging, much awaited sequel at the very cutting edge of postcolonial studies.\" --Richard Werbner, Professor of Social Anthropology, University of Manchester", "Occupied by humanity for some 40,000 years, the Matopos Hills in Zimbabwe have become the scene of symbolic, ideological, and armed conflict over the last hundred years. Voices from the Rocks is about landscape, religion, conservation, political symbolism, and war in the Matopos Hills--not simply the geography of the National Park there, which is seen by most visitors as a \"wild place.\" Terence Ranger reinstates culture and history into nature."], "author": "Terence O. Ranger", "num_pages": "316", "awards": ["Trevor Reese Memorial Prize (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "025321288X"},
{"url": "https://www.goodreads.com/book/show/755866.Where_We_Have_Hope", "num_ratings": "283", "num_reviews": "33", "avg_ratings": 3.94, "genres": ["Cultural", "Africa", "Nonfiction", "Eastern Africa", "Zimbabwe", "Autobiography", "Memoir", "History"], "title": "Where We Have Hope: A Memoir of Zimbabwe", "description": [" is the gripping memoir of a young American journalist. In 1980, Andrew Meldrum arrived in a Zimbabwe flush with new independence, and he fell in love with the country and its optimism. But over the twenty years he lived there, Meldrum watched as President Robert Mugabe consolidated power and the government evolved into despotism. In May 2003, Meldrum, th", " is the gripping memoir of a young American journalist. In 1980, Andrew Meldrum arrived in a Zimbabwe flush with new independence, and he fell in love with the country and its optimism. But over the twenty years he lived there, Meldrum watched as President Robert Mugabe consolidated power and the government evolved into despotism. In May 2003, Meldrum, the last foreign journalist still working in the dangerous and chaotic nation, was illegally forced to leave his adopted home. His unflinching work describes the terror and intimidation Mugabe’s government exercised on both the press and citizens, and the resiliency of Zimbabweans determined to overturn Mugabe and demand the free society they were promised."], "author": "Andrew Meldrum", "num_pages": "304", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2006-09-18 00:00:00", "ISBN": "0802142516"},
{"url": "https://www.goodreads.com/book/show/945877.The_Dust_Diaries", "num_ratings": "101", "num_reviews": "11", "avg_ratings": 3.8, "genres": ["Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Nonfiction", "Biography"], "title": "The Dust Diaries", "description": ["When Owen Sheers discovers a book in his father's study he stumbles upon the life of an obscure relative: Arthur Cripps, lyric poet and maverick missionary to Rhodesia. Compelled by the description of Cripps' extraordinary life in Africa, Sheers embarks on a journey through contemporary Zimbabwe in an attempt to better understand his ancestor's devotion to the country and", "When Owen Sheers discovers a book in his father's study he stumbles upon the life of an obscure relative: Arthur Cripps, lyric poet and maverick missionary to Rhodesia. Compelled by the description of Cripps' extraordinary life in Africa, Sheers embarks on a journey through contemporary Zimbabwe in an attempt to better understand his ancestor's devotion to the country and its people and the dramatic, often bloody, differences that echo across the years."], "author": "Owen Sheers", "num_pages": "336", "awards": ["Wales Book of the Year (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-03 00:00:00", "ISBN": "0571210260"},
{"url": "https://www.goodreads.com/book/show/133775.A_Girl_Named_Disaster", "num_ratings": "4,106", "num_reviews": "476", "avg_ratings": 3.81, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Adventure", "Adventure", "Survival"], "title": "A Girl Named Disaster", "description": ["Nhamo is a virtual slave in her African village in 1981. Before her twelfth birthday, Nhamo runs away to escape marriage to a cruel husband, and spends a year going from Zimbabwe to Mozambique. Alone on the river in a stolen boat, swept into the uncharted heart of a great lake, she battles drowning, starvation, wild animals.", "Orchard collectible editions have new designs, au", "Nhamo is a virtual slave in her African village in 1981. Before her twelfth birthday, Nhamo runs away to escape marriage to a cruel husband, and spends a year going from Zimbabwe to Mozambique. Alone on the river in a stolen boat, swept into the uncharted heart of a great lake, she battles drowning, starvation, wild animals.", "Orchard collectible editions have new designs, author prefaces and discussion guides."], "author": "Nancy Farmer", "num_pages": "320", "awards": ["Newbery Medal Nominee (1997)", "California Book Award for Juvenile (Silver) (1996)", "National Book Award Finalist for Young People's Literature (1996)"], "places": ["Zimbabwe", "Mozambique"], "character_names": [], "language": "English", "publish_date": "2003-10-01 00:00:00", "ISBN": "0439471443"},
{"url": "https://www.goodreads.com/book/show/8603911-the-cry-of-the-go-away-bird", "num_ratings": "222", "num_reviews": "33", "avg_ratings": 3.8, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Contemporary"], "title": "The Cry of the Go-Away Bird", "description": ["Elise loves the farm that is her home; she loves playing with beetles and chameleons in the garden, buying sweets from the village shop and listening to the stories of spirits and charms told by her nanny, Beauty. As a young white girl in 1990s Zimbabwe, her life is idyllic. Her clothes are always clean and ironed, there is always tea in the silver teapot, gin and tonics a", "Elise loves the farm that is her home; she loves playing with beetles and chameleons in the garden, buying sweets from the village shop and listening to the stories of spirits and charms told by her nanny, Beauty. As a young white girl in 1990s Zimbabwe, her life is idyllic. Her clothes are always clean and ironed, there is always tea in the silver teapot, gin and tonics are served on the veranda, and, in theory at least, black and white live in harmony.", "However this dream-world of her childhood cannot last. As Elise gets older, her eyes are opened to the complexities of adult existence, both through the changes wrought in her family by the arrival of her step-father Steve, and through her growing understanding of the tensions in Zimbabwean society. As Mugabe's presidency turns sour, the privileged world of the white farmers begins to crumble into anarchy.", " follows Elise as she attempts to make sense of her place in the world while her family struggle to stay afloat in the collapsing economy and escalating horror that surrounds them. As the violence intensifies and the farm invasions begin, Elise and her family are forced to confront difficult choices and the ancient unforgiving ghosts of the past."], "author": "Andrea Eames", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-02-10 00:00:00", "ISBN": "1846553733"},
{"url": "https://www.goodreads.com/book/show/6517542-out-of-shadows", "num_ratings": "838", "num_reviews": "140", "avg_ratings": 3.77, "genres": ["Historical", "Historical Fiction", "Young Adult", "Cultural", "Africa", "Fiction", "War", "Historical"], "title": "Out of Shadows", "description": ["Set in Zimbabwe in the 1980s, just after the war for independence, a young English boy, Jacklin, is torn between his black friends at school and his sympathy for the colonial whites after witnessing the compulsory land seizures by Robert Mugabe's government.", "But with an imminent visit by Robert Mugabe to the school, Jacklin realizes that Ivan, his white supremacist schoolma", "Set in Zimbabwe in the 1980s, just after the war for independence, a young English boy, Jacklin, is torn between his black friends at school and his sympathy for the colonial whites after witnessing the compulsory land seizures by Robert Mugabe's government.", "But with an imminent visit by Robert Mugabe to the school, Jacklin realizes that Ivan, his white supremacist schoolmate, plans to assassinate the black leader. The novel leaves us with the moral dilemma — in hindsight, should Jacklin have killed Ivan or let Ivan kill Robert Mugabe?", "A compelling, thought-provoking novel about race, bullying and the need to belong, set in Africa."], "author": "Jason   Wallace", "num_pages": "278", "awards": ["Costa Book Award for Children's Book (2010)", "Carnegie Medal Nominee (2011)"], "places": ["Zimbabwe"], "character_names": ["Robert Mugabe", "Robert Jacklin", "Ivan Hascott"], "language": "English", "publish_date": "2010-01-28 00:00:00", "ISBN": "1849390487"},
{"url": "https://www.goodreads.com/book/show/10374279-the-hairdresser-of-harare", "num_ratings": "1,318", "num_reviews": "227", "avg_ratings": 3.59, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "The Hairdresser of Harare", "description": ["Like very good dark chocolate this is a delicious novel, with a bitter-sweet flavour. Vimbai is a hairdresser, the best in Mrs Khumalo's salon, and she knows she is the queen on whom they all depend. Her situation is reversed when the good-looking, smooth-talking Dumisani joins them. However, his charm and desire to please slowly erode Vimbai's rancour and when he needs so", "Like very good dark chocolate this is a delicious novel, with a bitter-sweet flavour. Vimbai is a hairdresser, the best in Mrs Khumalo's salon, and she knows she is the queen on whom they all depend. Her situation is reversed when the good-looking, smooth-talking Dumisani joins them. However, his charm and desire to please slowly erode Vimbai's rancour and when he needs somewhere to live, Vimbai becomes his landlady. So, when Dumisani needs someone to accompany him to his brother's wedding to help smooth over a family upset, Vimbai obliges. Startled to find that this smart hairdresser is the scion of one of the wealthiest families in Harare, she is equally surprised by the warmth of their welcome; and it is their subsequent generosity which appears to foster the relationship between the two young people. The ambiguity of this deepening friendship - used or embraced by Dumisani and Vimbai with different futures in mind - collapses in unexpected brutality when secrets and jealousies are exposed. Written with delightful humour and a penetrating eye, The Hairdresser of Harare is a novel that you will find hard to put down."], "author": "Tendai Huchu", "num_pages": "190", "awards": [], "places": ["Harare"], "character_names": [], "language": "English", "publish_date": "2010-10-01 00:00:00", "ISBN": "1779221096"},
{"url": "https://www.goodreads.com/book/show/8093860-the-elephants-and-i", "num_ratings": "19", "num_reviews": "4", "avg_ratings": 3.74, "genres": ["Wildlife", "Cultural", "Africa", "Nonfiction", "Eastern Africa", "Zimbabwe"], "title": "The Elephants and I: Pursuing a Dream In Troubled Zimbabwe", "description": ["A true story filled with both joy and foreboding, this portrait of Zimbabwe and its wildlife comes from an Australian woman who went as a tourist to Africa and then decided to leave her old life and live permanently in tumultuous Zimbabwe to work with elephants on land bordering Hwange National Park. Not a scientist, she wanted to observe elephant interaction informally, a", "A true story filled with both joy and foreboding, this portrait of Zimbabwe and its wildlife comes from an Australian woman who went as a tourist to Africa and then decided to leave her old life and live permanently in tumultuous Zimbabwe to work with elephants on land bordering Hwange National Park. Not a scientist, she wanted to observe elephant interaction informally, and this moving memoir describes how, in time, she and the elephants developed affectionate relationships with each other. As the beauty and wonder of the park became increasingly threatened by illegal snaring of wildlife and land invaders claimed the territory where her elephant herd roamed, she went into battle for the animals—and this compelling account reveals how she put her own survival at risk."], "author": "Sharon Pincott", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-04-01 00:00:00", "ISBN": "1770096493"},
{"url": "https://www.goodreads.com/book/show/4298083-women-writing-zimbabwe", "num_ratings": "4", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "Women Writing Zimbabwe", "description": ["The fifteen stories in Women Writing Zimbabwe offer a kaleidoscope of fresh, moving, and comic perspectives on the way in which events of the last decade have impacted on individuals, women in particular. Several stories (Tagwira, Ndlovu and Charsley) look at the impact that AIDS has on women who become the care-givers, often without emotional or physical support. It is of", "The fifteen stories in Women Writing Zimbabwe offer a kaleidoscope of fresh, moving, and comic perspectives on the way in which events of the last decade have impacted on individuals, women in particular. Several stories (Tagwira, Ndlovu and Charsley) look at the impact that AIDS has on women who become the care-givers, often without emotional or physical support. It is often assumed that women will provide support and naturally make the necessary sacrifices. Brickhill and Munsengezi focus on the hidden costs and unexpected rewards of this nurturing role. Many families have been separated over the last decade. Ndlovu, Mutangadura, Katedza, Mhute and Rheam all explore exile's long, often painful, reach and the consequences of deciding to remain at home. In lighter vein, but with equal sharpness of perception, Gappah, Manyika, Sandi, and Holmes poke gentle fun at the demands of new-found wealth, status and manners. Finally, Musariri reminds us that the hidden costs of undisclosed trauma can continue to affect our lives for years afterwards. All of the writers share a sensitivity of perception and acuity of vision. Reading their stories will enlarge and stimulate our own understanding."], "author": "Irene Staunton", "num_pages": "134", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-01 00:00:00", "ISBN": "1779220731"},
{"url": "https://www.goodreads.com/book/show/1411135.Through_The_Darkness", "num_ratings": "21", "num_reviews": "3", "avg_ratings": 3.81, "genres": ["Cultural", "Africa", "Autobiography", "Memoir", "Nonfiction", "Eastern Africa", "Zimbabwe", "War"], "title": "Through The Darkness: A Life In Zimbabwe", "description": ["For more than three decades, Judith Todd has been at loggerheads with successive governments of Zimbabwe. After being jailed and then exiled by Ian Smith's regime, she returned to her country in 1980 and soon realised that, far from being the solution to Zimbabwe's ills, Robert Mugabe and Zanu (PF) were increasingly becoming the problem. As the country slid into social and", "For more than three decades, Judith Todd has been at loggerheads with successive governments of Zimbabwe. After being jailed and then exiled by Ian Smith's regime, she returned to her country in 1980 and soon realised that, far from being the solution to Zimbabwe's ills, Robert Mugabe and Zanu (PF) were increasingly becoming the problem. As the country slid into social and economic decline, Todd's position as director of a local development agency gave her a unique vantage point from which to observe the increasing arrogance and cruelty of Zimbabwe's leaders and the suffering and struggles of ordinary citizens. Peopled with household names from diplomats and politicians to international correspondents and liberation leaders, Through the Darkness takes readers from the family ranch outside Bulawayo to Buckingham Palace, from the bowels of Zimbabwe's prisons to the inner sanctums of Mugabe's cabinet. It is also the story of the country's silenced people - their courage, their irrepressible humour, their hopes and their feelings of betrayal. Drawing from journals, letters and documents, this is a fascinating personal account of life in Zimbabwe."], "author": "Judith Garfield Todd", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "177022002X"},
{"url": "https://www.goodreads.com/book/show/6163293-standplaats-harare", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 2.67, "genres": [], "title": "Standplaats Harare", "description": ["Trouw-journalist Sybilla Claus schrijft over de hachelijke situatie waarin het Zimbabwe van dictator Robert Mugabe zich bevindt. Haar observaties tekenen een land dat verscheurd wordt door economische rampspoed en politieke ellende, maar waarvan de veerkrachtige bewoners vriendelijkheid en warmte uitstralen. Het verslag is heet van de naald vanuit een land, waar de situati", "Trouw-journalist Sybilla Claus schrijft over de hachelijke situatie waarin het Zimbabwe van dictator Robert Mugabe zich bevindt. Haar observaties tekenen een land dat verscheurd wordt door economische rampspoed en politieke ellende, maar waarvan de veerkrachtige bewoners vriendelijkheid en warmte uitstralen. Het verslag is heet van de naald vanuit een land, waar de situatie per dag verslechtert. Met een voorwoord van Jacques Wallage, burgemeester van Groningen. In februari 2009 bezoekt een groep burgemeesters uit Zimbabwe Nederland, op initiatief van auteur Sybilla Claus georganiseerd door de VNG."], "author": "Sybilla Claus", "num_pages": "256", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "Dutch", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3256735-all-over-again", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "All Over Again:  Human Rights Abuses and Flawed Electoral Conditions in Zimbabwe's Coming General Elections", "description": ["In this 59-page report, Human Rights Watch documents how the government and the ruling party ZANU-PF, in the run up to the 2008 elections, have engaged in widespread intimidation of the opposition; have restricted freedom of association and assembly; and have manipulated food and farming equipment distribution to gain political advantage. Human Rights Watch also documented", "In this 59-page report, Human Rights Watch documents how the government and the ruling party ZANU-PF, in the run up to the 2008 elections, have engaged in widespread intimidation of the opposition; have restricted freedom of association and assembly; and have manipulated food and farming equipment distribution to gain political advantage. Human Rights Watch also documented biased media coverage in addition to numerous incidents of police and state-security violence against human rights activists and perceived opposition supporters throughout Zimbabwe. The report is based on research conducted over seven weeks across the country and in the capital, Harare. "], "author": "Human Rights Watch", "num_pages": "59", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2082114.Unfeeling", "num_ratings": "194", "num_reviews": "26", "avg_ratings": 3.23, "genres": ["Fiction", "Cultural", "Africa"], "title": "Unfeeling", "description": ["At 16, Davey's stuck between becoming the man his father wants him to be, and leaving behind the child he was. Before Davey gets a chance to grow up, however, his placid life is destroyed when his parents are murdered and his family farm “reclaimed.” Neighboring farmers try to care for Davey by engaging him in their community of clubs, church, and boarding school, but one", "At 16, Davey's stuck between becoming the man his father wants him to be, and leaving behind the child he was. Before Davey gets a chance to grow up, however, his placid life is destroyed when his parents are murdered and his family farm “reclaimed.” Neighboring farmers try to care for Davey by engaging him in their community of clubs, church, and boarding school, but one night Davey escapes, embarking on a harrowing trek away from civilization and toward revenge and redemption. Ian Holding’s tense, sparse prose, vivid sense of place, and searing portrait of a boy in a situation almost beyond imagining make this an unforgettable debut."], "author": "Ian Holding", "num_pages": "256", "awards": ["Dylan Thomas Prize Nominee (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-28 00:00:00", "ISBN": "1552639177"},
{"url": "https://www.goodreads.com/book/show/2475208.The_Uncertainty_of_Hope", "num_ratings": "25", "num_reviews": "4", "avg_ratings": 4.04, "genres": ["Cultural", "Africa"], "title": "The Uncertainty of Hope", "description": ["The Uncertainty of Hope by Valerie Tagwira, a novel which Charles Mungoshi calls 'an astonishing debut'. Through the various and complex lives of Onai Moyo - a market woman and responsible mother of three children, and her best friend Katy Nguni - a vendor and black-market currency dealer - we are given an insight into the challenges that face those who only survive by the", "The Uncertainty of Hope by Valerie Tagwira, a novel which Charles Mungoshi calls 'an astonishing debut'. Through the various and complex lives of Onai Moyo - a market woman and responsible mother of three children, and her best friend Katy Nguni - a vendor and black-market currency dealer - we are given an insight into the challenges that face those who only survive by their wits, their labour and their mutual support. In doing so Tagwira aptly captures how precarious the future is for the inhabitants of Mbare, Zimbabwe in 2005. The story of these two close friends is situated in a high-density suburb. However, the author also introduces a much wider cross-section of Zimbabwean society: Tom Sibanda, a young business man and farmer, his girlfriend, Faith, a law student, Tom's sister Emily, a health professional, and Mawaya, the ostensible beggar. With depth and sensitivity, Tagwira pulls these many threads into a densely woven novel that provides us with of some of the many faces of contemporary Zimbabwe."], "author": "Valerie Tagwira", "num_pages": "376", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-28 00:00:00", "ISBN": "1779220634"},
{"url": "https://www.goodreads.com/book/show/12160915-those-who-love-night", "num_ratings": "56", "num_reviews": "14", "avg_ratings": 3.54, "genres": ["Cultural", "Africa", "Southern Africa", "South Africa"], "title": "Those Who Love Night", "description": ["When Abigail Bukula, a young lawyer in the South African Justice Department, learns that the secret son of her aunt, who died in a massacre years ago, has been arrested by the Zimbabwean government, she races to his aid. She’s as determined as ever but perhaps a bit naive as well. Accused of being a part of the so-called Harare Seven, her cousin is being held as a politica", "When Abigail Bukula, a young lawyer in the South African Justice Department, learns that the secret son of her aunt, who died in a massacre years ago, has been arrested by the Zimbabwean government, she races to his aid. She’s as determined as ever but perhaps a bit naive as well. Accused of being a part of the so-called Harare Seven, her cousin is being held as a political prisoner in the country’s most brutal prison.", "With only an eager young lawyer as an ally and a director of the country’s intelligence agency either helping her or setting her up, Bukula will not leave without winning her cousin’s freedom and learning what really happened to her aunt so many years ago. By cunning, by bribery, by sheer audacity—and with the help of her friend prison psychologist Yudel Gordon—Abigail is determined to prevail in Those Who Love Night, Wessel Ebersohn’s explosive follow-up to his critically acclaimed series debut."], "author": "Wessel Ebersohn", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-31 00:00:00", "ISBN": "0312655967"},
{"url": "https://www.goodreads.com/book/show/11087881-far-from-home", "num_ratings": "134", "num_reviews": "31", "avg_ratings": 4.16, "genres": ["Young Adult", "Historical", "Historical Fiction", "Cultural", "Africa", "Cultural", "Fiction", "Eastern Africa", "Zimbabwe"], "title": "Far From Home", "description": ["Will I ever see my home again? I do not know.", "Will I ever see my father again? I do not know.", "Will life ever be the same again? I do not know.", " Katie and Tariro are worlds apart but their lives are linked by a terrible secret, gradually revealed in this compelling and dramatic story of two girls grappling with the complexities of adolescence, family and a painful colonial leg", "Will I ever see my home again? I do not know.", "Will I ever see my father again? I do not know.", "Will life ever be the same again? I do not know.", " Katie and Tariro are worlds apart but their lives are linked by a terrible secret, gradually revealed in this compelling and dramatic story of two girls grappling with the complexities of adolescence, family and a painful colonial legacy.", "14-year-old Tariro loves her ancestral home, the baobab tree she was born beneath, her loving family - and brave, handsome Nhamo. She couldn't be happier. But then the white settlers arrive, and everything changes - suddenly, violently, and tragically.", "Thirty-five years later, 14-year-old Katie loves her doting father, her exclusive boarding school, and her farm with its baobab tree in rural Zimbabwe. Life is great. Until disaster strikes, and the family are forced to leave everything and escape to cold, rainy London.", "Atmospheric, gripping and epic in scope, ", " brings the turbulent history of Zimbabwe to vivid, tangible life."], "author": "Na'ima B. Robert", "num_pages": "352", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2012-05-22 00:00:00", "ISBN": "1847800068"},
{"url": "https://www.goodreads.com/book/show/8845261-meander", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Meander", "description": ["Meander is a novel, a love story between Maudie, the daughter of the president of the African nation of Zimbabwe and his late wife, and Oscar, son of a white American Episcopal priest and his successful realtor wife. Oscar and Maudie meet as MBA students at The Wharton School of Business at the U. Of Pennsylvania.", "Maudie is being groomed to succeed her father as president a", "Meander is a novel, a love story between Maudie, the daughter of the president of the African nation of Zimbabwe and his late wife, and Oscar, son of a white American Episcopal priest and his successful realtor wife. Oscar and Maudie meet as MBA students at The Wharton School of Business at the U. Of Pennsylvania.", "Maudie is being groomed to succeed her father as president and Oscar is torn between his wish to save the world and his overwhelming wish to marry Maudie, a wish frustrated by the demands of her life.", "The novel places their love affair in the historical circumstance of Zimbabwe plummeting into poverty and chaos. The fast-changing realities of gender, race and international politics make this love affair a litmus test for a world that is emerging but not yet fully shaped.", "You will come to love these young people nearly as deeply as they love each other, and find yourself torn by the forces beyond their control that make their love equal parts healing and wounding."], "author": "Blayney Colmore", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2010-06-18 00:00:00", "ISBN": "1453523693"},
{"url": "https://www.goodreads.com/book/show/252599.Where_Are_You_Going_Manyoni_", "num_ratings": "71", "num_reviews": "21", "avg_ratings": 4.28, "genres": ["Childrens", "Picture Books", "Cultural", "Africa", "Science", "Geography", "Childrens"], "title": "Where Are You Going, Manyoni?", "description": ["\"Manyoni is on her way to school; she gets up at dawn to walk two hours across the plain, along the Limpopo riverbed....As seen in Stock's beautifully rendered impressionistic watercolors...wild animals and birds are on almost every spread--more than 30 in all....A lovely book that draws the reader right in.\"--Kirkus Reviews. Pronouncing glossary."], "author": "Catherine Stock", "num_pages": "48", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "1993-08-16 00:00:00", "ISBN": "0688103529"},
{"url": "https://www.goodreads.com/book/show/371454.Talk_of_the_Devil", "num_ratings": "308", "num_reviews": "51", "avg_ratings": 3.57, "genres": ["Nonfiction", "History", "Politics", "Biography", "Cultural", "Africa"], "title": "Talk of the Devil: Encounters with Seven Dictators", "description": ["Inspired by newspaper clippings he had kept about two former African dictators accused of cannibalism, journalist Riccardo Orizio set out to track down tyrants around the world who had fallen from power--to see if they had gained any perspective on their actions, or if their lives and thoughts could shed any light on our own. The seven encounters chronicled in ", "Inspired by newspaper clippings he had kept about two former African dictators accused of cannibalism, journalist Riccardo Orizio set out to track down tyrants around the world who had fallen from power--to see if they had gained any perspective on their actions, or if their lives and thoughts could shed any light on our own. The seven encounters chronicled in ", "reveal Orizio's gift as an observer and his skill at getting people to reveal themselves. They are also, each of them, memorable stories in their own right.", "Thanks to his conversion to Islam, the unrepentant Idi Amin lives in exile in Saudi Arabia and laughs off his murderous past while still attempting to meddle in Uganda. Jean-Bedel Bokassa, the bloody former emperor of Central Africa, boasts astonishingly that Pope Paul VI had nominated him as the thirteenth apostle of the Catholic Church. Nexhmije Hoxha defends her husband's brutal Stalinist regime from her Albanian prison cell and proudly explains how it worked. Paris-based Jean-Claude \"Baby Doc\" Duvalier--in his first interview since fleeing Haiti in 1986--speaks about voodoo and the women of his life, and laments the loss of his fortune. Colonel Mengistu Haile-Mariam of Ethiopia, Mira Markovic (Slobodan Milosevic's wife), and General Wojciech Jaruzelski, the former Polish head of state, all claim, in one way or another, that history will do them justice.", "By turns chilling and comical, rational and absurd, ", " brings back into focus forgotten history and people we have viewed as evil incarnate. Stripped of their power and titles, they are oddly human, and in Orizio's hands, their stories, and his own, are compulsively readable."], "author": "Riccardo Orizio", "num_pages": "224", "awards": [], "places": [], "character_names": ["Idi Amin", "Enver Hoxha", "Slobodan Milošević", "Elizabeth Bagaya", "Jean-Bédel Bokassa", "Valentine Strasser", "Wojciech Jaruzelski", "Nexhmije Hoxha", "Mirjana Marković", "Mengistu Haile Mariam", "Jean-Claude Duvalier", "François Duvalier", "Michèle Bennett", "Simone Duvalier", "Simo Zaric", "Marko Milošević"], "language": "English", "publish_date": "2004-03-01 00:00:00", "ISBN": "0802714161"},
{"url": "https://www.goodreads.com/book/show/4222539-inequalities-in-zimbabwe", "num_ratings": "11", "num_reviews": "1", "avg_ratings": 4.0, "genres": ["History", "Nonfiction"], "title": "Inequalities in Zimbabwe", "description": ["The present report attempts to anatomize the social and ecomonic predicament of Africans in Zimbabwe, in the context of an exceptionally (and unnecessarily) painful and prolonged transition from Rhodesia to Zimbabwe."], "author": "Christopher Hitchens", "awards": [], "places": [], "character_names": ["Ian Smith", "Joshua Nkomo", "Henry Kissinger", "Robert Mugabe", "Margaret Thatcher", "Christopher Hitchens", "Cecil Rhodes", "Abel Muzorewa", "James Chikerema", "Byron Hove"], "language": "English", "publish_date": "1981-08-16 00:00:00", "ISBN": "0903114909"},
{"url": "https://www.goodreads.com/book/show/2216900.The_Night_Of_Knives", "num_ratings": "242", "num_reviews": "26", "avg_ratings": 3.69, "genres": ["Thriller", "Mystery", "Adventure", "Fiction", "Cultural", "Africa"], "title": "The Night Of Knives", "description": ["Veronica Kelly came to Africa to start her life over. Still reeling from her divorce, she is grateful when a handsome stranger invites her to join a tour to visit gorillas in Uganda's wild Impenetrable Forest. A trip that goes desperately wrong when their group is captured by brutal gunmen.", "Then one tourist is executed.", "And then another.", "This is no random kidnapping: their ab", "Veronica Kelly came to Africa to start her life over. Still reeling from her divorce, she is grateful when a handsome stranger invites her to join a tour to visit gorillas in Uganda's wild Impenetrable Forest. A trip that goes desperately wrong when their group is captured by brutal gunmen.", "Then one tourist is executed.", "And then another.", "This is no random kidnapping: their abduction is only the first move in a deadly strategic game. A game in which Veronica's ex-husband is somehow involved. Now she must embark on a wild journey across Africa, to unveil a malignant conspiracy before it consumes entire nations - and thousands of lives..."], "author": "Jon Evans", "num_pages": "669", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-16 00:00:00", "ISBN": "0340896086"},
{"url": "https://www.goodreads.com/book/show/7442424-the-lion-killer", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "The Lion Killer", "description": ["Lucas Mellor is a Texan and a big game hunter who was recruited by Danie Schwardt, an Afrikaner and safari outfitter, to serve as a hit man for the South African white-supremacist secret society, The Vengeurs (The Avengers). Lucas completes his assignment for The Vengeurs, assassinating an English attorney and black-rights advocate in one of South Africaas largest cosmopol", "Lucas Mellor is a Texan and a big game hunter who was recruited by Danie Schwardt, an Afrikaner and safari outfitter, to serve as a hit man for the South African white-supremacist secret society, The Vengeurs (The Avengers). Lucas completes his assignment for The Vengeurs, assassinating an English attorney and black-rights advocate in one of South Africaas largest cosmopolitan cities. The hunter, Lucas, stalks his victim in the urban environment much as he stalks animal prey in the wild, but the killing doesnat stop there. An opportunity occurs for Lucas to rekindle his past love affair with Elena, who is on a final safari in support of her dying brother, Raphael. Elena tries to enlist Lucas in the mercy-killing of her brother, but Lucas refuses. Raphael does die in what is assumed to be a tragic accident. A subsequent turn of events causes Lucas to turn his assassination weapon on his former friend and hunting companion."], "author": "Jim Woods", "num_pages": "238", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-05-16 00:00:00", "ISBN": "1413763464"},
{"url": "https://www.goodreads.com/book/show/9989602-the-summoner", "num_ratings": "1,571", "num_reviews": "177", "avg_ratings": 3.81, "genres": ["Mystery", "Thriller", "Fiction", "Horror", "Thriller", "Mystery Thriller"], "title": "The Summoner", "description": ["A United States diplomat disappears in front of hundreds of onlookers while attending a religious ceremony in the bushveld of Zimbabwe. Dominic Grey, Diplomatic Security special agent, product of a violent childhood and a worn passport, is assigned to investigate. Aiding the investigation is Professor Viktor Radek, religious phenomenologist and expert on cults, and Nya Mas", "A United States diplomat disappears in front of hundreds of onlookers while attending a religious ceremony in the bushveld of Zimbabwe. Dominic Grey, Diplomatic Security special agent, product of a violent childhood and a worn passport, is assigned to investigate. Aiding the investigation is Professor Viktor Radek, religious phenomenologist and expert on cults, and Nya Mashumba, the local government liaison. ", "What Grey uncovers is a terrifying cult older than Western civilization, the harsh underbelly of a country in despair, a priest seemingly able to perform impossibilities, and the identity of the newest target. ", "Himself . . . ", "“The Summoner is one of those books that make you want to turn on all the lights in your house and lock the doors . . . The settings are authentic and you can feel and smell the countryside . . . This is a wonderful read for those who enjoy both suspense and action stories.” — Seattle Post-Intelligencer"], "author": "Layton Green", "num_pages": "332", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-12-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12150429-jambanja", "num_ratings": "1", "num_reviews": "1", "avg_ratings": 4.0, "genres": [], "title": "Jambanja", "author": "Eric Harrison", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/705658.Grasping_the_Nettle", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Grasping the Nettle", "description": ["GOOD INTENTIONS PAVED THE WAY TO HELL... ", "And despite his best intentions to stay faithful to Eve in their turbulent marriage, charismatic pilot James Hacking is constantly drawn to beautiful women and they to him. Outwardly easy-going, his philandering nature usually gives in to temptation. A veteran bush-fighter of several bloody African conflicts, James served in the Rho", "GOOD INTENTIONS PAVED THE WAY TO HELL... ", "And despite his best intentions to stay faithful to Eve in their turbulent marriage, charismatic pilot James Hacking is constantly drawn to beautiful women and they to him. Outwardly easy-going, his philandering nature usually gives in to temptation. A veteran bush-fighter of several bloody African conflicts, James served in the Rhodesian war which saw the former British colony become Zimbabwe. ", " He is reluctantly drawn back into the muddy waters of African politics when Zimbabwean President Robert Mugabe is deposed by James's hated adversary from the bitter Rhodesian battle-zones, General Spencer Katsiru. Under the new dictator savage repression worsens, and the policy of 'Land Reform, ' the seizing of productive white-owned farms, turns the former 'bread-basket' of Africa into a crippled economic basket-case. ", " Millions face starvation as James tries to avoid getting too involved, and his flying skills take him from the southern tip of Africa to the north, flying in Libya as one of Colonel Gadaffi's 'Technical Mercenaries.' A guilty conscience about Zimbabwe's predicament and strong personal friendships finally lure him back, and as the country faces the threat of all-out civil war James is forced to make a dreadful choice."], "author": "Gordon Thomas Orr", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-03-01 00:00:00", "ISBN": "1412020778"},
{"url": "https://www.goodreads.com/book/show/52063.The_Man_Who_Turned_Into_a_Rastafarian_Short_Stories", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 2.0, "genres": [], "title": "The Man Who Turned Into a Rastafarian - Short Stories", "description": ["These short stories provide a glimpse into the lives of Zimbabwe's Rastafarians."], "author": "Masimba Musodza", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-01 00:00:00", "ISBN": "1846855373"},
{"url": "https://www.goodreads.com/book/show/6086663-case-closed-a-detective-story-set", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 4.0, "genres": [], "title": "Case Closed. a Detective Story Set", "description": ["Case Closed new work in the genre of detective fiction, and the first in a planned series. The story is set in Zimbabwe, and features Chief Inspector Caleb Dube and his assistant, Sergeant Musindo. The drama unfolds as the assiduous Dube is driving home to Gweru one Sunday evening and discovers the body of a well-dressed man in a storm drain at the turn-off to St Francis M", "Case Closed new work in the genre of detective fiction, and the first in a planned series. The story is set in Zimbabwe, and features Chief Inspector Caleb Dube and his assistant, Sergeant Musindo. The drama unfolds as the assiduous Dube is driving home to Gweru one Sunday evening and discovers the body of a well-dressed man in a storm drain at the turn-off to St Francis Mission. Who is the victim and why was he killed? The investigation that follows, uncovers a world of greed and exploitation."], "author": "Pauline Henson", "num_pages": "156", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-01-01 00:00:00", "ISBN": "0869227734"},
{"url": "https://www.goodreads.com/book/show/12727683-ndlovu---the-white-elephant", "num_ratings": "4", "num_reviews": "2", "avg_ratings": 4.0, "genres": ["Cultural", "Africa"], "title": "Ndlovu - The White Elephant", "description": ["Ndlovu - The White Elephant is a pacy story set in Zimbabwe during the turbulent years that followed Rhodesia's Unilateral Declaration of Independence. The story highlights the dangers of police work in the explosive climate of a troubled country during years of the terror war and is woven around human suffering, painful endurance, and horrors that confronted the peoples b", "Ndlovu - The White Elephant is a pacy story set in Zimbabwe during the turbulent years that followed Rhodesia's Unilateral Declaration of Independence. The story highlights the dangers of police work in the explosive climate of a troubled country during years of the terror war and is woven around human suffering, painful endurance, and horrors that confronted the peoples both black and white. The narrative is loosely based upon the author's own experiences in the police force of what was then Rhodesia. Thus the action of his story is set against an authentic background which the author experienced and the impeccable writing style gives a palpable vividness to the events. A retired ex-police constable, commits murder, he flees the country but has now returned as a leader of a 'terrorist gang', he is on a diabolical mission, he is wily and ruthless but he has one fear-a reoccurring dream in which he is crushed and gored by an elephant. Tony is a police officer determined to track down a cunning and callous murderer ... will he succeed and live up to his name ... NDLOVU-The White Elephant? The author has succeeded in producing a narrative with great feeling, what sets this work apart from any other similar books is the remarkable attention to detail. Not only is there the skill with words that paint a picture, but there is also an incisive insight into the characters-brought to life with vivid description and credible dialogue. From the way the author creates scenes and characters, captures the atmosphere of the moments and the emotions of the protagonists -there can be no doubt of the author's real involvement in the events recorded."], "author": "Peter Good", "num_pages": "174", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-05 00:00:00", "ISBN": "1907728228"},
{"url": "https://www.goodreads.com/book/show/2319981.The_Last_Leopard", "num_ratings": "1,186", "num_reviews": "73", "avg_ratings": 4.2, "genres": ["Animals", "Fantasy", "Childrens", "Adventure", "Mystery"], "title": "The Last Leopard", "description": ["Martine is looking forward to the holidays and riding Jemmy, her white giraffe, until an accident sends her and Ben on a journey to the Matobo Hills wilderness in Zimbabwe. It is a lawless land, where nothing is as it seems. When they uncover a plot in which the fate of a magnificent leopard and the lost treasure of an African King are mysteriously linked, their friendship", "Martine is looking forward to the holidays and riding Jemmy, her white giraffe, until an accident sends her and Ben on a journey to the Matobo Hills wilderness in Zimbabwe. It is a lawless land, where nothing is as it seems. When they uncover a plot in which the fate of a magnificent leopard and the lost treasure of an African King are mysteriously linked, their friendship faces its greatest test. Far from home and the help of Grace and Tendai, and with Gwyn Thomas languishing, under false accusations, in jail, Martine and Ben must use every survival skill they possess. They'll come face to face with Griffin, Mercy, Mr Ratcliffe (known as Rat), Magnus the hornbill, and a witch doctor, not to mention Khan, the last leopard. They must decide who their friends are, and who are enemies, as they race against time to save the world's rarest leopard and each other. This third African adventure is written with all the zest and skill that have endeared so many readers to THE WHITE GIRAFFE and DOLPHIN SONG."], "author": "Lauren St. John", "num_pages": "208", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "1842556673"},
{"url": "https://www.goodreads.com/book/show/76040.The_Girl_Who_Married_a_Lion", "num_ratings": "1,624", "num_reviews": "174", "avg_ratings": 3.42, "genres": ["Cultural", "Africa", "Fiction", "Short Stories", "Fantasy", "Folklore", "Southern Africa", "Botswana"], "title": "The Girl Who Married a Lion: And Other Tales from Africa", "description": ["Alexander McCall Smith was born in what is now Zimbabwe and grew up hearing stories that so enchanted him, he passed them along to his own children. He now shares them in this jewel of a book."], "author": "Alexander McCall Smith", "num_pages": "208", "awards": [], "places": ["Zimbabwe", "Botswana"], "character_names": [], "language": "English", "publish_date": "2004-12-07 00:00:00", "ISBN": "0375423125"},
{"url": "https://www.goodreads.com/book/show/13338941-lettah-s-gift", "num_ratings": "19", "num_reviews": "2", "avg_ratings": 3.74, "genres": ["War"], "title": "Lettah's Gift", "description": ["Step into the heart of modern-day Africa in this compelling story of hope and redemption. ", "Failed writer Frank Cole can barely remember Lettah. When his family left Zimbabwe, their beloved servant was gradually forgotten. Now, forty years on, Frank has been set a mysterious task in his mother's will: he must find Lettah and deliver her bequest.", "What Frank finds is not the co", "Step into the heart of modern-day Africa in this compelling story of hope and redemption. ", "Failed writer Frank Cole can barely remember Lettah. When his family left Zimbabwe, their beloved servant was gradually forgotten. Now, forty years on, Frank has been set a mysterious task in his mother's will: he must find Lettah and deliver her bequest.", "What Frank finds is not the country of his childhood, but a place where memories of civil war and colonial injustice fester beneath the surface, where brutality stands for the law, where fear and farce preside.", "But in chaotic Bulawayo, Frank discovers life and humour among unlikely companions - friends from his youth and new acquaintances, old Rhodesians and young liberals, all those who stayed behind.", "As he pieces together Lettah's fate, Frank begins to see the new Zimbabwe - and himself - in the delicate chemistry between meaning and hope."], "author": "Graham Lang", "num_pages": "305", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-16 00:00:00", "ISBN": "0702238996"},
{"url": "https://www.goodreads.com/book/show/9415942-now-is-the-time-for-running", "num_ratings": "1,166", "num_reviews": "238", "avg_ratings": 4.03, "genres": ["Young Adult", "Sports and Games", "Sports", "Realistic Fiction", "Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Cultural", "Soccer"], "title": "Now Is the Time for Running", "description": ["Just down the road from their families, Deo and his friends play soccer in the dusty fields of Zimbabwe, cheered on by Deo's older brother, Innocent. It is a day like any other . . . until the soldiers arrive and Deo and Innocent are forced to run for their lives, fleeing the wreckage of their village for the distant promise of safe haven. Along the way, they face the prej", "Just down the road from their families, Deo and his friends play soccer in the dusty fields of Zimbabwe, cheered on by Deo's older brother, Innocent. It is a day like any other . . . until the soldiers arrive and Deo and Innocent are forced to run for their lives, fleeing the wreckage of their village for the distant promise of safe haven. Along the way, they face the prejudice and poverty that await refugees everywhere, and must rely on the kindness of people they meet to make it through. But when tragedy strikes, Deo's love of soccer is all he has left. Can he use that gift to find hope once more?", "Relevant, timely, and accessibly written, ", " is a staggering story of survival that follows Deo and his mentally handicapped older brother on a transformative journey that will stick with readers long after the last page."], "author": "Michael  Williams", "num_pages": "240", "awards": [], "places": ["Zimbabwe", "South Africa"], "character_names": [], "language": "English", "publish_date": "2011-07-05 00:00:00", "ISBN": "0316077909"},
{"url": "https://www.goodreads.com/book/show/1723486.Storms_Over_Africa", "num_ratings": "145", "num_reviews": "9", "avg_ratings": 4.01, "genres": ["Cultural", "Africa", "Fiction", "Adventure"], "title": "Storms Over Africa", "description": ["Desperate poachers are stalking the dwindling populations of Zimbabwe's great game parks. Ancient rivalries have ignited modern political ambitions and nothing is certain for those of the old Africa.", "But for Richard Dunn the stakes are even higher. Into his world comes the beautiful and compelling Steve Hayes, a woman struggling to guard her own dreadful secret. Richard has", "Desperate poachers are stalking the dwindling populations of Zimbabwe's great game parks. Ancient rivalries have ignited modern political ambitions and nothing is certain for those of the old Africa.", "But for Richard Dunn the stakes are even higher. Into his world comes the beautiful and compelling Steve Hayes, a woman struggling to guard her own dreadful secret. Richard has no choice: face the consequences of the past and fight for the future. To lose now is to lose everything."], "author": "Beverley Harper", "num_pages": "680", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-04-30 00:00:00", "ISBN": "0330355783"},
{"url": "https://www.goodreads.com/book/show/445212.The_Setting_Sun_and_the_Rolling_World", "num_ratings": "17", "num_reviews": "3", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "Africa", "Literature", "Short Stories"], "title": "The Setting Sun and the Rolling World", "description": ["Moving and provocative short stories that explore the strained relations between parent and child, husband an wife, brothers, and friends, as traditional values of rural Africa clash with ambitions of urban life."], "author": "Charles Mungoshi", "num_pages": "212", "awards": ["Commonwealth Writers' Prize Nominee for Best Book in Africa (1988)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-07-20 00:00:00", "ISBN": "0807083216"},
{"url": "https://www.goodreads.com/book/show/1110864.Nehanda", "num_ratings": "56", "num_reviews": "3", "avg_ratings": 3.5, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Eastern Africa", "Zimbabwe", "Womens"], "title": "Nehanda", "description": ["In the late nineteenth century white settlers and administrators arrive to occupy the African country of Zimbabwe (Rhodesia). Nehanda, a village girl, is recognized through omens and portents as a saviour. The resulting uprising by the Africans is brutally crushed but looks forward to the war of independence that succeeded a century later. Told in lucid, poetic prose, this", "In the late nineteenth century white settlers and administrators arrive to occupy the African country of Zimbabwe (Rhodesia). Nehanda, a village girl, is recognized through omens and portents as a saviour. The resulting uprising by the Africans is brutally crushed but looks forward to the war of independence that succeeded a century later. Told in lucid, poetic prose, this is a gripping story about the first meeting of a people with their colonizer."], "author": "Yvonne Vera", "num_pages": "104", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-01-01 00:00:00", "ISBN": "0920661416"},
{"url": "https://www.goodreads.com/book/show/3204679-rooms-in-the-house-of-stone", "num_ratings": "7", "num_reviews": "2", "avg_ratings": 4.14, "genres": ["Eastern Africa", "Zimbabwe"], "title": "Rooms in the House of Stone: The \"Thistle\" Series of Essays", "description": ["The prize-winning author of The Broken Cord and A Yellow Raft in Blue Water draws upon this powerful, poignant, and very personal examination of his reaction to the country's overwhelming poverty."], "author": "Michael Dorris", "num_pages": "66", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-06-01 00:00:00", "ISBN": "0915943700"},
{"url": "https://www.goodreads.com/book/show/750825.Of_Spirits_and_Madness", "num_ratings": "75", "num_reviews": "14", "avg_ratings": 3.71, "genres": ["Psychology", "Cultural", "Africa", "Nonfiction", "Health", "Mental Health", "Autobiography", "Memoir", "Medical"], "title": "Of Spirits and Madness: An American Psychiatrist in Africa", "description": ["--Journal of the American Medical Association. ", "An unforgettable tale of medicine at the crossroads of two cultures. After four year", "--Journal of the American Medical Association. ", "An unforgettable tale of medicine at the crossroads of two cultures. After four years of psychiatric residency and two years of practice as an attending psychiatrist in San Francisco­­ which included stints in an emergency room and the city jail­­. Paul Linde thought he'd seen it all. When his pediatrician wife decided that she wanted to work as a doctor in Africa, he went along for the ride, greeting the prospect with a blase \"same job, different continent,\" attitude. What he found, instead, would challenge much of what he thought he knew about mental illness and transform him as a physician and as a human being.", " is Dr. Linde's account of his year spent practicing psychiatry in Zimbabwe's Harare Central Hospital. In a compelling narrative brimming with compassion, insight, and no small measure of good humor, he tells of his shock at the magnitude of human suffering that greeted him on his arrival in Africa and his initial bafflement with its people's superstitions and differing worldview. He introduces us to his patients, vividly relating how his experiences with them awakened him to the ways in which mental illness cuts across cultures, ultimately filling him with a deep admiration for the incredible patience and spiritual dignity with which they endured their poverty and illnesses."], "author": "Paul R. Linde", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-09-01 00:00:00", "ISBN": "0071407995"},
{"url": "https://www.goodreads.com/book/show/420461.Without_a_Name_and_Under_the_Tongue", "num_ratings": "83", "num_reviews": "9", "avg_ratings": 3.78, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Literature", "African Literature"], "title": "Without a Name and Under the Tongue", "description": ["Yvonne Vera's novels chronicle the lives of Zimbabwean women with extraordinary power and beauty. ", "and ", ", her two earliest novels, are set in the seventies during the guerrilla war against the white government.", "In ", " (1994), Mazvita, a young woman from the country, travels to Harare to escape the war and begin a new life. But her dre", "Yvonne Vera's novels chronicle the lives of Zimbabwean women with extraordinary power and beauty. ", "and ", ", her two earliest novels, are set in the seventies during the guerrilla war against the white government.", "In ", " (1994), Mazvita, a young woman from the country, travels to Harare to escape the war and begin a new life. But her dreams of independence are short-lived. She begins a relationship of convenience and becomes pregnant.", "In ", " (1996), the adolescent Zhizha has lost the will to speak. In lyrical fragments, Vera relates the story of Zhizha's parents, and the horrifying events that led to her mother's imprisonment and her father's death. With this novel Vera became the first Zimbabwean writer ever to deal frankly with incest. With these surprising, at times shocking novels Vera shows herself to be a writer of great potential."], "author": "Yvonne Vera", "num_pages": "224", "awards": ["Hurston/Wright Legacy Award Nominee for Fiction (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-02-13 00:00:00", "ISBN": "0374528160"},
{"url": "https://www.goodreads.com/book/show/17560569-the-zebra-crossings", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 1.0, "genres": [], "title": "The Zebra Crossings", "description": ["In the 1970s, somewhere in the rural area of Eastern Zimbabwe(Rhodesia),a young man and woman fall in love. An unremarkable occurrence one might think - except that Rob Du Toit is of white affluent stock, and Rudo derives from a struggling black family. They are living in a country in transition, but that fact does little to help their cause."], "author": "Tsitsi Tsopotsa", "num_pages": "440", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-02 00:00:00", "ISBN": "9781291242"},
{"url": "https://www.goodreads.com/book/show/420466.The_Stone_Virgins", "num_ratings": "200", "num_reviews": "25", "avg_ratings": 3.63, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Literature", "Historical", "Historical Fiction", "Literature", "African Literature"], "title": "The Stone Virgins", "description": ["In 1980, after decades of guerilla war against colonial rule, Rhodesia earned its hard-fought-for independence from Britain. Less than two years thereafter when Mugabe rose to power in the new Zimb", "In 1980, after decades of guerilla war against colonial rule, Rhodesia earned its hard-fought-for independence from Britain. Less than two years thereafter when Mugabe rose to power in the new Zimbabwe, it signaled the begining of brutal civil unrest that would last nearly a half decade more.", "With ", " Yvonne Vera examines the dissident movement from the perspective of two sisters living in a small township outside of Bulawayo. In a portrait painted in successive impressions of life before and after the liberation, Vera explores the quest for dignity and a centered existence against a backdrop of unimaginable violence; the twin instincts of survival and love; the rival pulls of township and city life; and mankind's capacity for terror, beauty, and sacrifice. One sister will find a reason for hope. One will not make it through alive.", "Weaving historical fact within a story of grand passions and striking endurance, Vera has gifted us with a powerful and provocative testament to the resilience of the Zimbabwean people."], "author": "Yvonne Vera", "num_pages": "192", "awards": ["Macmillan Prize for African Adult Fiction (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-02-14 00:00:00", "ISBN": "0374528942"},
{"url": "https://www.goodreads.com/book/show/25505321-veld-girl---cynthia-stockley", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Veld Girl - Cynthia Stockley: A Recreated Life", "description": ["This is a biography of a woman who, for all her romances, tribulation, and despair, was determined to shape an identity for herself in a fast changing world. Cynthia Stockley, who became one of the most widely read writers of the early twentieth century, was born in South Africa in 1873. Her romantic novels and short stories sold in their tens of thousands from London to N", "This is a biography of a woman who, for all her romances, tribulation, and despair, was determined to shape an identity for herself in a fast changing world. Cynthia Stockley, who became one of the most widely read writers of the early twentieth century, was born in South Africa in 1873. Her romantic novels and short stories sold in their tens of thousands from London to New York, Los Angeles to Sydney and Perth, to Canada, New Zealand, India, and South Africa. Her most acclaimed novel Poppy went through thirty editions and sold over a million copies. The nine silent films based on her books were shown in cities and towns all over the world. ", "Every phase of her life had its dramas - the Shona Rising in Rhodesia in the 1890s, the stage in London, married life in New York, life as a writer on the Left Bank in Paris in the first World War, time on the veld as a farmer's wife in Rhodesia."], "author": "Tim  McLoughlin", "num_pages": "502", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-16 00:00:00", "ISBN": "9176370127"},
{"url": "https://www.goodreads.com/book/show/25146482-karima", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Karima: A Story from the Guerilla War in Rhodesia", "description": ["First printed and published by Mambo Press Gweru, Zimbabwe, 1985 [ISBN 0 86922 319 4]", "The book is dedicated to colleagues in the Justice and Peace Commission, 1972-1976.", "Although the novel is based on an incident at Karima village in the north-east of the country on June 12, 1975 during the war in Zimbabwe, the characters are entirely fictional."], "author": "Tim  McLoughlin", "num_pages": "211", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25784556-the-second-coming-of-dambudzo-marechera", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 4.67, "genres": [], "title": "THE SECOND COMING OF DAMBUDZO MARECHERA", "author": "Tendai Huchu", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/17822724-the-hangman-s-replacement", "num_ratings": "189", "num_reviews": "137", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Africa", "Science Fiction"], "title": "The Hangman's Replacement: Sprout of Disruption", "description": ["SYNOPSIS", "Zimbabwe’s last hangman retired in 2004. As the nation drifted towards abolition, no determined effort was launched to find a replacement. However, the discovery of carnivorous flame lilies at the Great Zimbabwe monument triggered a spirited search for a new executioner. Those who know why this discovery energized the recruitment effort refused to talk.", "The frantic", "SYNOPSIS", "Zimbabwe’s last hangman retired in 2004. As the nation drifted towards abolition, no determined effort was launched to find a replacement. However, the discovery of carnivorous flame lilies at the Great Zimbabwe monument triggered a spirited search for a new executioner. Those who know why this discovery energized the recruitment effort refused to talk.", "The frantic attempts to find a new hangman were impeded by the lack of suitable candidates. Well-placed sources confirmed that the fear of ‘ngozi’ was a deterrent. According to this traditional belief, the spirit of a murdered person torments the killer and his family for generations. However, this is only half the story. Several promising applicants did come forward. None met the minimum requirements for the job. The selection criteria were designed to exclude the mentally ill, the vindictive, and the sadistic. However, they did not rule out the desperate.", "The Sprout of Disruption (Book 1) is told through the shifting perspectives of characters whose lives have been set alight by the plant which sparked the recruitment effort. The parallel threads of the story converge around the aspiring hangman who was obsessed with securing the job, the sympathizers who fought to protect him from his prize, and the anxious men who believed that emptying death row would end their horror before the carnivorous plants constricted around their necks.", "KIRKUS REVIEW EXTRACT", "\"At nearly 500 pages, this intricately woven novel is a disconcerting parable exploded to epic proportions. The author renders its many characters, from the mad genius responsible for the impending botanical apocalypse, to the prostitute/undercover operative who falls in love with Abel, to the seemingly simple Abel himself, with frightening subtlety and detail.... A thought-provoking, singularly strange and absorbing novel.\"", "Link to full review: ", " ", "INDIEREADER REVIEW EXTRACTS", "“This is a work of completely bizarre genius. The author has an almost Wodehousian gift with words, decorating his pages with phrases that can make the reader laugh out loud, question long-held assumptions about reality, or send a chill up the spine with just a few deft descriptive touches. Some of the characters, and the situations they find themselves in, can be completely off-the-wall, but the author’s writing ability carefully makes them almost plausible, even natural.\"", "“This is a delightful book for those who enjoy having their perspectives stretched, who take delight in the weird and idiosyncratic, and who love watching a master author do breathtaking juggling acts with the English language.\"", "Link to full review: ", "SELF-PUBLISHING REVIEW EXTRACTS", "“Yet more than once as I laughed my way through this novel, I was reminded of a quotation by Nikolai Gogol that I came across recently: “The longer and more carefully we look at a funny story, the sadder it becomes.” The humor in The Hangman’s Replacement makes us laugh perhaps to keep us from crying. Again like Saramago, Chiveneko uses bizarre situations and sometimes subtle humor to deliver very deep and often disturbing social and political commentary. I think I would have appreciated the book more if I knew more about Zimbabwe’s history, but even lacking specific knowledge that might have turned story into allegory, I couldn’t help but feel the occasional chill as tragically universal themes emerged.”", "“Chiveneko is a talented writer. Beautiful metaphors and delightful descriptions, while sometimes a little overdone, are some of the best parts of the book.”", "“The Hangman’s Replacement is a long, complex, and challenging novel. But it rewards the reader’s efforts with delightful characters and plenty of laughter, even in the midst of some very disturbing themes.”", "Link to full review: "], "author": "Taona Dumisani Chiveneko", "num_pages": "492", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-02-22 00:00:00", "ISBN": "0991852443"},
{"url": "https://www.goodreads.com/book/show/30343630-the-book-of-memory", "num_ratings": "2,095", "num_reviews": "350", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Eastern Africa", "Zimbabwe", "Literature", "African Literature"], "title": "The Book of Memory", "description": ["The story you have asked me to tell begins not with the ignominious ugliness of Lloyd's death but on a long-ago day in April when the sun seared my blistered face and I was nine years old and my father and mother sold me to a strange man. I say my father and my mother, but really it was just my mother. Memory, the narrator of ", ", is an albino woman languish", "The story you have asked me to tell begins not with the ignominious ugliness of Lloyd's death but on a long-ago day in April when the sun seared my blistered face and I was nine years old and my father and mother sold me to a strange man. I say my father and my mother, but really it was just my mother. Memory, the narrator of ", ", is an albino woman languishing in Chikurubi Maximum Security Prison in Harare, Zimbabwe, where she has been convicted of murder. As part of her appeal her lawyer insists that she write down what happened as she remembers it. The death penalty is a mandatory sentence for murder, and Memory is, both literally and metaphorically, writing for her life. As her story unfolds, Memory reveals that she has been tried and convicted for the murder of Lloyd Hendricks, her adopted father. But who was Lloyd Hendricks? Why does Memory feel no remorse for his death? And did everything happen exactly as she remembers? Moving between the townships of the poor and the suburbs of the rich, and between the past and the present, Memory weaves a compelling tale of love, obsession, the relentlessness of fate and the treachery of memory."], "author": "Petina Gappah", "num_pages": "274", "awards": ["McKitterick Prize (2016)", "PEN Open Book Award Nominee for Shortlist (2017)", "Women's Prize for Fiction Nominee for Longlist (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-16 00:00:00", "ISBN": "0571249914"},
{"url": "https://www.goodreads.com/book/show/7718641-becoming-zimbabwe-a-history-from-the-pre-colonial-period-to-2008", "num_ratings": "20", "num_reviews": "3", "avg_ratings": 3.7, "genres": ["History", "Cultural", "Africa", "Science Fiction", "Alternate History"], "title": "Becoming Zimbabwe. A History From The Pre Colonial Period To 2008", "description": ["Becoming Zimbabwe is the first comprehensive history of Zimbabwe, spanning the years from 850 to 2008. In 1997, the then Secretary General of the Zimbabwe Congress of Trade Unions, Morgan Tsvangirai, expressed the need for a 'more open and critical process of writing history in Zimbabwe. ...The history of a nation-in-the-making should not be reduced to a selective heroic t", "Becoming Zimbabwe is the first comprehensive history of Zimbabwe, spanning the years from 850 to 2008. In 1997, the then Secretary General of the Zimbabwe Congress of Trade Unions, Morgan Tsvangirai, expressed the need for a 'more open and critical process of writing history in Zimbabwe. ...The history of a nation-in-the-making should not be reduced to a selective heroic tradition, but should be a tolerant and continuing process of questioning and re-examination.' Becoming Zimbabwe tracks the idea of national belonging and citizenship and explores the nature of state rule, the changing contours of the political economy, and the regional and international dimensions of the country's history. In their Introduction, Brian Raftopoulos and Alois Mlambo enlarge on these themes, and Gerald Mazarire's opening chapter sets the pre-colonial background. Sabelo Ndlovu tracks the history up to WW11, and Alois Mlambo reviews developments in the settler economy and the emergence of nationalism leading to UDI in 1965. The politics and economics of the UDI period, and the subsequent war of liberation, are covered by Joesph Mtisi, Munyaradzi Nyakudya and Teresa Barnes. After independence in 1980, Zimbabwe enjoyed a period of buoyancy and hope. James Muzondidya's chapter details the transition 'from buoyancy to crisis', and Brian Raftopoulos concludes the book with an analysis of the decade-long crisis and the global political agreement which followed."], "author": "Brian Raftopoulos", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-01 00:00:00", "ISBN": "1779220839"},
{"url": "https://www.goodreads.com/book/show/26098642-cecil-the-lion-s-testament", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 4.67, "genres": [], "title": "Cecil The Lion's Testament", "description": ["IT all began with a vision. It was in the last months of 2003 in the midst of Hwange National Park when Kat the Lioness got a vision at midnight. A huge light dazzled her eyes and in the light appeared an angel in the form of a lion that said:", "\"Blessed are you Kat, for God has chosen you to be great among lionesses. All generations of lions will consider you blessed.\"", "Kat wa", "IT all began with a vision. It was in the last months of 2003 in the midst of Hwange National Park when Kat the Lioness got a vision at midnight. A huge light dazzled her eyes and in the light appeared an angel in the form of a lion that said:", "\"Blessed are you Kat, for God has chosen you to be great among lionesses. All generations of lions will consider you blessed.\"", "Kat was terrified and cleaned her eyes with the back of her hand. She thought she was dreaming but checked herself and found she was awake, she even saw her sisters and her husband Muzi at her side asleep and snoring. She looked again in front of her and found the lion-shaped angel still standing there. Radiant in his glory."], "author": "Bangambiki Habyarimana", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-08-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2043524.Breaking_News", "num_ratings": "169", "num_reviews": "24", "avg_ratings": 3.93, "genres": ["Nonfiction", "Writing", "Journalism", "War", "Military Fiction", "Autobiography", "Memoir", "Politics", "History", "War"], "title": "Breaking News: A Stunning and Memorable Account of Reporting from Some of the Most Dangerous Places in the World", "description": ["Martin Fletcher doesn't claim to be a hero. Yet he didn't flinch, either. During three decades covering wars, revolutions, and natural disasters, Fletcher worked his way from news agency cameraman to top network correspondent, facing down his own fears while facing up to mass killers, warlords, and murderers. With humor and elegance, Fletcher describes his growth from clue", "Martin Fletcher doesn't claim to be a hero. Yet he didn't flinch, either. During three decades covering wars, revolutions, and natural disasters, Fletcher worked his way from news agency cameraman to top network correspondent, facing down his own fears while facing up to mass killers, warlords, and murderers. With humor and elegance, Fletcher describes his growth from clueless adventurer to grizzled veteran of the world's battlefields. His working philosophy of \"Get in, get close, get out, get a drink,\" put him repeatedly in harm's way, but he never lost sight of why he did it. In a world obsessed with celebrities, leaders, and wealth, Fletcher took a different route: he focused on those left behind, those paying the price. He answers the question: Why should we care?", " These extraordinary, real-life adventure stories each examine different dilemmas facing a foreign correspondent. Can you eat the food of a warlord, who stole it from the starving? Do you listen politely to a terrorist threatening to blow up your children? Do you ask the tough questions of a Khmer Rouge killer, knowing he is your only ticket out of the Cambodian jungle? And above all, how do you stay sane faced with so much pain?"], "author": "Martin Fletcher", "num_pages": "254", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-04 00:00:00", "ISBN": "0312371187"},
{"url": "https://www.goodreads.com/book/show/27997972-son-of-a-king", "num_ratings": "4", "num_reviews": "0", "avg_ratings": 4.75, "genres": [], "title": "Son Of A King", "description": ["They were born as twins but only one could be the King...", " King Uripo has no male children and he is desperate for a male heir. Fate takes a nasty turn when instead of the hoped for heir two male children are born. According to custom only one of the twins can be allowed to live. Can a curse be turned into a blessing? Determined to see both boys live the King defies ancient", "They were born as twins but only one could be the King...", " King Uripo has no male children and he is desperate for a male heir. Fate takes a nasty turn when instead of the hoped for heir two male children are born. According to custom only one of the twins can be allowed to live. Can a curse be turned into a blessing? Determined to see both boys live the King defies ancient tradition and sends one of the babies away to a neighbouring kingdom in secret. ", "One boy raised to rule and, the other destined to fight for every scrap he gets in a foreign land. At the back of the King’s mind is always the shadow of the curse he has brought upon himself."], "author": "Grace Ashley", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-06-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25741134-tokoloshe", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 4.67, "genres": [], "title": "Tokoloshe", "description": ["A tale of temptation and deadly myth.", "James and Ayana return to help American Doug Rutherford in the search for his missing father while also attempting to unravel the mystery of Nyami Nyami, the Zambezi River Goddess.", "But little do they know that stalking their adventure is an ancient and deadly malice... the Tokoloshe."], "author": "Andy  Lang", "num_pages": "552", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-17 00:00:00", "ISBN": "1514372134"},
{"url": "https://www.goodreads.com/book/show/4038984-this-was-the-old-chief-s-country", "num_ratings": "78", "num_reviews": "4", "avg_ratings": 4.08, "genres": ["Short Stories", "Cultural", "Africa", "Fiction"], "title": "This Was the Old Chief's Country", "description": ["All Doris Lessing's short novels and stories are now collected into two volumes, This Was The Old Chef's Country and The Sun Between Their Feet. This volume contains all the stories from the original book entitled This Was The Old Chief's Country and three of the short novels from Five, the book which won the Somerset Maugham Award in 1954.", "'I believe,' writes Doris Lessing", "All Doris Lessing's short novels and stories are now collected into two volumes, This Was The Old Chef's Country and The Sun Between Their Feet. This volume contains all the stories from the original book entitled This Was The Old Chief's Country and three of the short novels from Five, the book which won the Somerset Maugham Award in 1954.", "'I believe,' writes Doris Lessing, \"that the chief gift from Africa to writers, white and black, is the continent itself, its presence which for some people is like a old fever, latent always in their blood; or it like an old wounded throbbing in the bones as the air changes. That is not a place to visit unless one chooses to be an exile ever afterwards from an inexplicable majestic silence lying just over the border of memory or of thought. Africa gives you the knowledge that man is a small creature, among other creatures, in a large landscape.'", "In this Edition:", "The Old Chief Mshlanga", "A Sunrise on the Veld", "No Witchcraft for Sale", "The Second Hut", "The Nuisance", "The De Wets Come to Kloof Grange", "Little Tembi", "Old John's Place", "'Leopard' George", "Winter in July", "A Home for the Highland Cattle", "Eldorado", "The Antheap", "Includes the Preface for the 1964 Collection and a new Preface for the 1973 Collection. All of these stories appeared in African Stories, 1963."], "author": "Doris Lessing", "num_pages": "418", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0586091130"},
{"url": "https://www.goodreads.com/book/show/20549051-the-generation-that-never-laughed", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.5, "genres": [], "title": "The Generation That Never Laughed", "description": ["Trapped in the quagmire of Robert Mugabe's Zimbabwe and his future fundamentally altered by the actions of the powers that be, Chenge can either run away and spend the rest of his life running, or he can turn around and face the consequences. His mind races and the breathing intensify. His father's fate is squarely on his shoulders. Not only that. What would happen to his", "Trapped in the quagmire of Robert Mugabe's Zimbabwe and his future fundamentally altered by the actions of the powers that be, Chenge can either run away and spend the rest of his life running, or he can turn around and face the consequences. His mind races and the breathing intensify. His father's fate is squarely on his shoulders. Not only that. What would happen to his family? What would become of his brother Tobias and his sister Chido? He has to do it. There is no option. He curses. He picks up his self and with tears bathing his face, starts on the journey to Msasa, with resolve. Whatever happens doesn't matter anymore, he thinks. After all, is there anything to live for in this battered country ...? Bruno Chapwati tells the story of a generation of young people who find themselves caught up in the politics of their time, by default and by extension. Having grown up in Zimbabwe and having experienced some of these events first hand, he weaves them into a beautiful tale of struggle, love, fate and revenge."], "author": "Bruno Chapwati", "num_pages": "238", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00", "ISBN": "149476931X"},
{"url": "https://www.goodreads.com/book/show/11375688-rumours-of-ophir", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 4.0, "genres": [], "title": "Rumours of Ophir", "author": "Paul  Freeman", "num_pages": "218", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2000-08-16 00:00:00", "ISBN": "1779003145"},
{"url": "https://www.goodreads.com/book/show/7089830-long-time-coming", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.5, "genres": [], "title": "Long Time Coming: Short Writings from Zimbabwe", "description": ["Long Time Coming brings together short stories and poems from thirty-three writers that provide snapshots of this turbulent period in Zimbabwe's history. Snapshots of living in a country where basic services have crumbled: where shops have no food, taps no water, banks no money, hospitals no drugs, bars no beer. Snapshots of characters surviving against seemingly insurmoun", "Long Time Coming brings together short stories and poems from thirty-three writers that provide snapshots of this turbulent period in Zimbabwe's history. Snapshots of living in a country where basic services have crumbled: where shops have no food, taps no water, banks no money, hospitals no drugs, bars no beer. Snapshots of characters surviving against seemingly insurmountable odds. Horrific snapshots of the abuse of power, of violence and oppression, of the destruction of dreams. But this is Zimbabwe and there are lighter moments and moments of hope: in some of life's simple pleasures, in the coming of the rains, in the wink and the smile of a stranger, in a challenge to patriarchy, in the inner strength of the people, in fighting back. The writers are Raisedon Baya, Wim Boswinkel, Diana Charsley, Brian Chikwava, Julius Chingono, Mathew Chokuwenga, Bhekilizwe Dube, John Eppel, Peter Finch, Petina Gappah, David Goodwin, Anne Simone Hutton, Monireh Jassat, Ignatius Mabasa, Fungai Rufaro Machirori, Judy Maposa, Deon Marcus, Christopher Mlalazi, Gothataone Moeng, Wame Molefhe, Linda Msebele, Mzana Mthimkhulu, Peter Ncube, Thabisani Ndlovu, Pathisa Nyathi, Andrew Pocock, John S. Read, Bryony Rheam, Lloyd Robson, Ian Rowlands, Owen Sheers, Chaltone Tshabangu and Sandisile Tshuma."], "author": "Jane Morris", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-10-01 00:00:00", "ISBN": "0797436448"},
{"url": "https://www.goodreads.com/book/show/95242.Elephant_Song", "num_ratings": "4,222", "num_reviews": "136", "avg_ratings": 3.95, "genres": ["Fiction", "Adventure", "Historical", "Historical Fiction", "Cultural", "Africa", "Thriller"], "title": "Elephant Song", "description": ["From under the shadow of the Mountains of the Moon and the deep, brooding Forests of the Tall Trees, to the hidden opulence of Taiwan and the panelled boardrooms of power in the heart of London, a tough, determined man and a dedicated woman begin their fight against the forces of greed, evil and corruption...", "In Zi", "From under the shadow of the Mountains of the Moon and the deep, brooding Forests of the Tall Trees, to the hidden opulence of Taiwan and the panelled boardrooms of power in the heart of London, a tough, determined man and a dedicated woman begin their fight against the forces of greed, evil and corruption...", "In Zimbabwe, Dr Daniel Armstrong, world-famous TV naturalist, films the slaughter of a herd of elephant: closing in as their blood stains the soil and their death song echoes around the stillness of the valley, his professionalism is tinged with a deep sadness.", "In London, anthropologist Kelly Kinnear is forced into violent confrontation with the shareholders of the most powerful conglomerate in the City of London, warning them of the destruction of an African country and of a people – the Bambuti – she has come to love as her own.", "Combining breathtaking realism with thrilling suspense, Elephant Song is a gripping adventure from the world's master storyteller – a journey deep into the heart of a wild, magnificent continent, threatened for ever by the destructive hand of man.", " * ' With Wilbur Smith the action is never further than the turn of a page.'", " – The Independent", " * 'Sex, money, ambition fear and blood ... an emotional stampede.'", " – The Daily Mail"], "author": "Wilbur Smith", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-05-31 00:00:00", "ISBN": "0449221032"},
{"url": "https://www.goodreads.com/book/show/12679546-catastrophe", "num_ratings": "15", "num_reviews": "0", "avg_ratings": 3.73, "genres": ["Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Nonfiction", "History"], "title": "Catastrophe: What Went Wrong in Zimbabwe?", "description": ["No one in 1980 could have guessed that Zimbabwe would become a failed state on such a monumental and tragic scale. In this incisive and revealing book, Richard Bourne shows how a country which had every prospect of success when it achieved a delayed independence in 1980 became a brutal police state with hyperinflation, collapsing life expectancy and abandonment by a third", "No one in 1980 could have guessed that Zimbabwe would become a failed state on such a monumental and tragic scale. In this incisive and revealing book, Richard Bourne shows how a country which had every prospect of success when it achieved a delayed independence in 1980 became a brutal police state with hyperinflation, collapsing life expectancy and abandonment by a third of its citizens less than thirty years later.", "Beginning with the British conquest of Zimbabwe and covering events up to the present precarious political situation, Catastrophe is the most comprehensive, up-to-date and readable account of the ongoing crisis. Bourne shows that Zimbabwe's tragedy is not just about Mugabe's 'evil' but about history, Africa today and the world's attitudes towards them."], "author": "Richard Bourne", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-11 00:00:00", "ISBN": "1848135203"},
{"url": "https://www.goodreads.com/book/show/6693432-we-are-all-zimbabweans-now", "num_ratings": "41", "num_reviews": "3", "avg_ratings": 3.34, "genres": ["Eastern Africa", "Zimbabwe", "Fiction", "Historical", "Historical Fiction", "Cultural", "Canada", "Cultural", "Africa", "Abandoned"], "title": "We Are All Zimbabweans Now", "description": ["In 1982 a young American historian arrives in Zimbabwe filled with idealism and enthusiasm for the benevolent new Prime Minister Robert Mugabe and the postcolonial new beginning for that country. His historic research leads him to an apparent murder case, unresolved since the days of the bush war. As he draws - or is lead - or yet mislead - closer to an answer, he becomes", "In 1982 a young American historian arrives in Zimbabwe filled with idealism and enthusiasm for the benevolent new Prime Minister Robert Mugabe and the postcolonial new beginning for that country. His historic research leads him to an apparent murder case, unresolved since the days of the bush war. As he draws - or is lead - or yet mislead - closer to an answer, he becomes involved with a local woman through whom he soon finds himself in the inner circle of the new ruling class.", "Once the euphoria starts dissipating he encounters increasingly menacing instances of corruption and repression, including threats to himself to abandon his investigation. With every new revelation a new layer of decay is exposed and with that, his idealism retreats. In the process, the meaning of the novel's title, taken from Mugabe's conciliatory rhetoric at the beginning, gradually comes to mean: we are all trapped and compromised into the moral tangle and the destruction into which all the promise has degenerated.", "An extremely accomplished and compelling novel that deftly employs the instruments of a detective thriller."], "author": "James Kilgore", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-24 00:00:00", "ISBN": "1415200718"},
{"url": "https://www.goodreads.com/book/show/633270.The_Ear_the_Eye_and_the_Arm", "num_ratings": "14,358", "num_reviews": "809", "avg_ratings": 3.86, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Fiction", "Adventure"], "title": "The Ear, the Eye, and the Arm", "description": ["General Matsika's children steal out of the house on a forbidden adventure--and disappear. In Zimbabwe, in the year 2194, the children's parents call in Africa's most unusual detectives--the Ear, the Eye and the Arm--who have powers far beyond those of other human beings. The children must avoid the evils of the past, the technology of the future, and a motley assortment o", "General Matsika's children steal out of the house on a forbidden adventure--and disappear. In Zimbabwe, in the year 2194, the children's parents call in Africa's most unusual detectives--the Ear, the Eye and the Arm--who have powers far beyond those of other human beings. The children must avoid the evils of the past, the technology of the future, and a motley assortment of criminals in order to return home safely. 1995 Newbery Honor Book; ALA Notable Book; ALA Best Book for Young Adults."], "author": "Nancy Farmer", "num_pages": "311", "awards": ["Newbery Medal Nominee (1995)", "Golden Duck Award for Hal Clement Award for Young Adult (1995)", "Dorothy Canfield Fisher Children's Book Award Nominee (1996)"], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "0140376410"},
{"url": "https://www.goodreads.com/book/show/12708155-african-dawn", "num_ratings": "413", "num_reviews": "36", "avg_ratings": 4.13, "genres": ["Cultural", "Africa", "Fiction", "Action", "Mystery", "Crime"], "title": "African Dawn", "description": ["\"", "It's darkest before the dawn.", "Three families - the Bryants, the Quilter-Phippses and the Ngwenyas - share a history as complex and bloody as Zimbabwe itself.", "Dedicated conservationists Paul and Philippa Bryant are struggling to save their f", "\"", "It's darkest before the dawn.", "Three families - the Bryants, the Quilter-Phippses and the Ngwenyas - share a history as complex and bloody as Zimbabwe itself.", "Dedicated conservationists Paul and Philippa Bryant are struggling to save their farm and small herd of endangered black rhinos from seizure by corrupt government minister Emmerson Ngwenya. Twin brothers, ex-soldier Braedan and environmentalist Tate Quilter-Phipps join the fight.", "But when the brothers fall in love with the same woman, Natalie Bryant, their rivalry threatens to put the lives of all involved at risk. And with Emmerson vowing to stop at nothing until he gets what he wants, a bloody showdown seems inevitable.", "In the broken country that is Zimbabwe, only the strongest can survive.\""], "author": "Tony Park", "num_pages": "511", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/349680.Harvest_of_Thorns", "num_ratings": "170", "num_reviews": "11", "avg_ratings": 4.08, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Novels", "Literature", "African Literature", "Contemporary"], "title": "Harvest of Thorns", "description": ["Pictures the transition between the old white-dominated Southern Rhodesia, through the Bush War, to the new black regime of Zimbabwe."], "author": "Shimmer Chinodya", "num_pages": "248", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1990)"], "places": [], "character_names": [], "language": "English", "publish_date": "1991-01-11 00:00:00", "ISBN": "0435905821"},
{"url": "https://www.goodreads.com/book/show/1079025.The_Book_of_Not", "num_ratings": "298", "num_reviews": "36", "avg_ratings": 3.51, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Literature", "African Literature", "Eastern Africa", "Zimbabwe"], "title": "The Book of Not", "description": ["A sequel to Nervous Conditions, this is a powerful and engaging story about one young woman's quest to redefine the personal and political forces that threaten to engulf her. As its title suggests, this is also a book about denial and unfulfilled expectations and about the theft of the self that remains one of colonialism's most pernicious legacies. The novel disrupts any", "A sequel to Nervous Conditions, this is a powerful and engaging story about one young woman's quest to redefine the personal and political forces that threaten to engulf her. As its title suggests, this is also a book about denial and unfulfilled expectations and about the theft of the self that remains one of colonialism's most pernicious legacies. The novel disrupts any comfortable sense of closure to the dilemmas of colonial modernity explored in Nervous Conditions and as such is a fitting sequel."], "author": "Tsitsi Dangarembga", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-19 00:00:00", "ISBN": "0954702379"},
{"url": "https://www.goodreads.com/book/show/185537.Our_Votes_Our_Guns", "num_ratings": "85", "num_reviews": "6", "avg_ratings": 3.81, "genres": ["Cultural", "Africa", "Nonfiction", "History", "Eastern Africa", "Zimbabwe", "Politics", "Abandoned"], "title": "Our Votes, Our Guns: Robert Mugabe And The Tragedy Of Zimbabwe", "description": ["Robert Mugabe came to power in 1980 after a long civil war in Rhodesia. The white minority government had become an international outcast in refusing to give in to the inevitability of black majority rule. Finally the defiant white prime minister Ian Smith was forced to step down and Mugabe was elected president of a country now called Zimbabwe. Initially hopes were high t", "Robert Mugabe came to power in 1980 after a long civil war in Rhodesia. The white minority government had become an international outcast in refusing to give in to the inevitability of black majority rule. Finally the defiant white prime minister Ian Smith was forced to step down and Mugabe was elected president of a country now called Zimbabwe. Initially hopes were high that he had the intelligence, political savvy and idealistic vision to help repair the damage done by colonialism and the bitter civil war, and to lead his country's economic and social development. He was admired throughout the world as one of the leaders of the emerging nations and as a model for a good transition from colonial leadership. But month by month, year by year, Mugabe became increasingly autocratic; his methods increasingly violent. In recent years he has unleashed a reign of terror and corruption in his country. Like the Congo, Angola, Rwanda, Sierra Leone and Liberia, Zimbabwe has been on a steady slide to disaster. What happened in Zimbabwe? Now for the first time the whole story is told in detail by an expert. It is a riveting and tragic political story, a morality tale, and an essential text for understanding today's Africa."], "author": "Martin Meredith", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-05-28 00:00:00", "ISBN": "158648186X"},
{"url": "https://www.goodreads.com/book/show/666276.Zenzele", "num_ratings": "996", "num_reviews": "116", "avg_ratings": 4.1, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Literature", "Historical", "Historical Fiction"], "title": "Zenzele: A Letter for My Daughter", "description": ["Written as a letter from a Zimbabwean mother to her daughter, a student at Harvard, J. Nozipo Maraire evokes the moving story of a mother reaching out to her daughter to share the lessons life has taught her and bring the two closer than ever before. Interweaving history and memories, disappointments and dreams, ", " tells the tales of Zimbabwe's struggle for independen", "Written as a letter from a Zimbabwean mother to her daughter, a student at Harvard, J. Nozipo Maraire evokes the moving story of a mother reaching out to her daughter to share the lessons life has taught her and bring the two closer than ever before. Interweaving history and memories, disappointments and dreams, ", " tells the tales of Zimbabwe's struggle for independence and the men and women who shaped it: Zenzele's father, an outspoken activist lawyer; her aunt, a schoolteacher by day and secret guerrilla fighter by night; and her cousin, a maid and a spy.", "Rich with insight, history, and philosophy, ", " is a powerful and compelling story that is both revolutionary and revelatory--the story of one life that poignantly speaks of all lives."], "author": "J. Nozipo Maraire", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-04-07 00:00:00", "ISBN": "0385318227"},
{"url": "https://www.goodreads.com/book/show/658415.House_of_Stone", "num_ratings": "439", "num_reviews": "46", "avg_ratings": 4.02, "genres": ["Cultural", "Africa", "Nonfiction", "Eastern Africa", "Zimbabwe", "Autobiography", "Memoir", "Biography", "War", "Travel"], "title": "House of Stone: The True Story of a Family Divided in War-Torn Zimbabwe", "description": ["Blue mountains, golden fields, gin and tonics on the terrace--once it had seemed the most idyllic place on earth. But by August 2002, Marondera, in eastern Zimbabwe, had been turned into a bloody battleground, the center of a violent campaign. One bright morning, Nigel Hough, one of the few remaining white farmers, received the news he had been dreading. A crowd of war vet", "Blue mountains, golden fields, gin and tonics on the terrace--once it had seemed the most idyllic place on earth. But by August 2002, Marondera, in eastern Zimbabwe, had been turned into a bloody battleground, the center of a violent campaign. One bright morning, Nigel Hough, one of the few remaining white farmers, received the news he had been dreading. A crowd of war veterans was at his gates, demanding he hand over his homestead. The mob started a fire and dragged him to an outhouse. To his shock, the leader of the invaders was his family’s much-loved nanny Aqui. “Get out or we’ll kill you,” she said. “There is no place for whites in this country.”", "            Christina Lamb uncovered the astonishing saga she tells in ", "while traveling back and forth to report clandestinely on Zimbabwe. Her powerful narrative traces the history of the brutal civil war, independence, and the Mugabe years, all through the lives of two people on opposing sides. Although born within a few miles of each other, their experience growing up could not have been more different. While Nigel played cricket and piloted his own plane, Aqui grew up in a mud hut, sleeping on the floor with her brothers and sisters. “They had cars and went shopping in South Africa. We didn’t have food and had to walk an hour each way to fetch water,” she remembers.", "            ", " (“dzimba dza mabwe” or “Zimbabwe” in Shona) is based on a remarkable series of interviews with this white farmer and black nanny, set against the backdrop of the last British colony to become independent, and the descent into madness of Robert Mugabe, one of Africa’s most respected nationalist leaders."], "author": "Christina Lamb", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1556527357"},
{"url": "https://www.goodreads.com/book/show/836630.African_Laughter", "num_ratings": "334", "num_reviews": "38", "avg_ratings": 3.75, "genres": ["Cultural", "Africa", "Nonfiction", "Eastern Africa", "Zimbabwe", "Autobiography", "Memoir", "Travel", "History", "Biography"], "title": "African Laughter: Four Visits to Zimbabwe", "description": ["In this portrait of Doris Lessing's homeland, the author recounts the visits she made to Zimbabwe in 1982, 1988, 1989 and 1992, after being banned from the old Southern Rhodesia for 25 years for her political views and opposition to the minority white Government. The visits constitute a journey to the heart of a country whose history, landscape, people and spirit are evoke", "In this portrait of Doris Lessing's homeland, the author recounts the visits she made to Zimbabwe in 1982, 1988, 1989 and 1992, after being banned from the old Southern Rhodesia for 25 years for her political views and opposition to the minority white Government. The visits constitute a journey to the heart of a country whose history, landscape, people and spirit are evoked by the author in a narrative of detail. She embraces every facet of life in Zimbabwe from the lost animals in the bush to political corruption, from AIDS to a successful communal enterprise created by rural blacks, and notes the kind of changes that can only be appreciated by one who has lived there before."], "author": "Doris Lessing", "num_pages": "442", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "1993-11-01 00:00:00", "ISBN": "0006546900"},
{"url": "https://www.goodreads.com/book/show/37620.The_Leopard_Hunts_in_Darkness", "num_ratings": "3,297", "num_reviews": "65", "avg_ratings": 4.03, "genres": ["Fiction", "Historical", "Historical Fiction", "Adventure", "Cultural", "Africa", "Thriller"], "title": "The Leopard Hunts in Darkness", "description": [" by Wilbur Smith: In Manhattan, Craig Mellow is the toast of the literary world, a young writer whose bestselling novels and larger-than-life adventures are fueled by natural-born charisma. But Craig lost a limb and a legacy in Africa. And his heart still clings to the land.", "A representative of the World Bank recruits Craig to return to his war-", " by Wilbur Smith: In Manhattan, Craig Mellow is the toast of the literary world, a young writer whose bestselling novels and larger-than-life adventures are fueled by natural-born charisma. But Craig lost a limb and a legacy in Africa. And his heart still clings to the land.", "A representative of the World Bank recruits Craig to return to his war-torn homeland--to use his knowledge of Zimbabwe's people, languages, and wildlife to stabilize its future. But once he sets foot on the continent, Craig cannot resist what runs in his blood…", "Soon, this scion of a legendary family is caught in a new era of massive ivory poaching, of tribal warfare waged with modern killing tools, and international politics hardwired directly to Washington and Moscow. With a woman by his side and a traitor behind his back, Craig is about to learn a lesson of a brutal new age--if he can survive Africa one more time."], "author": "Wilbur Smith", "num_pages": "576", "awards": [], "places": [], "character_names": ["Craig Mellow"], "language": null, "publish_date": "2006-11-28 00:00:00", "ISBN": "0312940777"},
{"url": "https://www.goodreads.com/book/show/3146159-the-voluptuous-delights-of-peanut-butter-and-jam", "num_ratings": "364", "num_reviews": "54", "avg_ratings": 3.5, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Historical", "Historical Fiction", "Book Club"], "title": "The Voluptuous Delights of Peanut Butter and Jam", "description": ["Rhodesia - a place of great beauty, but also of terrible, man-made, tragedy. The Voluptuous Delights of Peanut Butter and Jam is, above all else, a magical evocation of childhood; at times laugh-out-loud funny, at others heartbreakingly sad. It tells the story of two young sisters, Nyree and Cia O'Callohan, who live on a remote farm in the East of what was Rhodesia in the", "Rhodesia - a place of great beauty, but also of terrible, man-made, tragedy. The Voluptuous Delights of Peanut Butter and Jam is, above all else, a magical evocation of childhood; at times laugh-out-loud funny, at others heartbreakingly sad. It tells the story of two young sisters, Nyree and Cia O'Callohan, who live on a remote farm in the East of what was Rhodesia in the late 1970s. Beneath the dripping vines of the Vumba rainforest, and under the tutelage of their heretical grandfather, Oupa, theirs is a seductive world laced with African paganism, bastardised Catholicism and the lore of the Brothers Grimm - until their idyll is shattered forever by their orphaned cousin, Ronin. His arrival at the farm sets in motion a chain of events that result in tragedy and the loss of innocence."], "author": "Lauren Liebenberg", "num_pages": "256", "awards": ["Orange Prize Nominee for New Writers (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-06 00:00:00", "ISBN": "1844084973"},
{"url": "https://www.goodreads.com/book/show/16952.Men_of_Men", "num_ratings": "2,657", "num_reviews": "60", "avg_ratings": 4.02, "genres": ["Fiction", "Historical", "Historical Fiction", "Adventure", "Cultural", "Africa", "Historical"], "title": "Men of Men", "description": [" by Wilbur Smith", "It was called The Devils's Own: a steep scar in the African earth, around which men toiled with picks, shovels, and dreams of the milky treasures that would become prized, polished diamonds. In this demonic race, native tribesmen became miners. Sometimes they became thieves. And then they became rebels.", "Zouga Ballantyne, an African-born Englishman,", " by Wilbur Smith", "It was called The Devils's Own: a steep scar in the African earth, around which men toiled with picks, shovels, and dreams of the milky treasures that would become prized, polished diamonds. In this demonic race, native tribesmen became miners. Sometimes they became thieves. And then they became rebels.", "Zouga Ballantyne, an African-born Englishman, sees the Devil's Own mine as his ticket to the North: a realm of waterfalls and fertile plains, teeming wildlife, and seeded fields of gold. But what happens in the diamond mines of the fledgling Boer Free State sets the course for Ballantyne and a cast of comrades, enemies, and lovers--and for the continent itself.", "From the visions of imperialists to the fury between a father and a son, from the lengths a man will go for a woman and a woman for her convictions, a tragic clash of generations and civilizations was shaking 19th-century Africa, where some warriors fought for their gods--and others for the men who came before them..."], "author": "Wilbur Smith", "num_pages": "720", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-31 00:00:00", "ISBN": "0312940726"},
{"url": "https://www.goodreads.com/book/show/3184127-bitter-harvest", "num_ratings": "128", "num_reviews": "17", "avg_ratings": 3.95, "genres": ["Cultural", "Africa", "History", "Biography", "Eastern Africa", "Zimbabwe", "Politics", "Nonfiction", "War"], "title": "Bitter Harvest: The Great Betrayal", "description": ["For more than a decade, Ian Smith served as Rhodesia's Prime Minister during the era of white minority rule. Following his death in 2007, he is still a man with the ability to excite powerful emotions. To some he is a leader whose formidable integrity led him into head-to-head confrontation with the Labor government of Britain in the 1960s. To others he is a demon best kno", "For more than a decade, Ian Smith served as Rhodesia's Prime Minister during the era of white minority rule. Following his death in 2007, he is still a man with the ability to excite powerful emotions. To some he is a leader whose formidable integrity led him into head-to-head confrontation with the Labor government of Britain in the 1960s. To others he is a demon best known for stating \"I don't believe in black majority rule ever, not in a thousand years,\" for staunchly opposing Britain's insistence that majority rule be implemented before the nation's independence, and for imprisoning the leadership of the newly emerged black nationalist movement. In this revealing autobiography, Smith tells his own side of the story and reveals how he sought to keep Rhodesia on a path to full democracy during the West's decolonization of Africa. He tells the remarkable story behind the signing of the country's Unilateral Declaration of Independence and addresses the excesses of power that the current president, Robert Mugabe, has used to create the virtual dictatorship which exists in Zimbabwe today. This is a revealing and prescient historical document from a controversial figure charting the rise and fall of a once-great nation."], "author": "Ian Douglas Smith", "num_pages": "288", "awards": [], "places": ["Rhodesia", "London, England"], "character_names": ["Ian Smith", "Ndabaningi Sithole", "Joshua Nkomo", "António de Oliveira Salazar", "Harold Wilson", "John Vorster", "Kenneth Kaunda", "Henry Kissinger", "Pik Botha", "P.W Botha", "Julius Nyerere", "Robert Mugabe", "Margaret Thatcher"], "language": "English", "publish_date": "2008-05-01 00:00:00", "ISBN": "1857826043"},
{"url": "https://www.goodreads.com/book/show/1709600.Mugabe", "num_ratings": "270", "num_reviews": "23", "avg_ratings": 3.7, "genres": ["Cultural", "Africa", "Nonfiction", "Eastern Africa", "Zimbabwe", "Biography", "History", "Politics", "Cultural", "International"], "title": "Mugabe: Power, Plunder, and the Struggle for Zimbabwe's Future", "description": ["Robert Mugabe came to power in Zimbabwe in 1980 after a long civil war in Rhodesia. The white minority government had become an international outcast in refusing to give in to the inevitability of black majority rule. Finally the defiant white prime minister Ian Smith was forced to step down and Mugabe was elected president. Initially he promised reconciliation between whi", "Robert Mugabe came to power in Zimbabwe in 1980 after a long civil war in Rhodesia. The white minority government had become an international outcast in refusing to give in to the inevitability of black majority rule. Finally the defiant white prime minister Ian Smith was forced to step down and Mugabe was elected president. Initially he promised reconciliation between white and blacks, encouraged Zimbabwe's economic and social development, and was admired throughout the world as one of the leaders of the emerging nations and as a model for a transition from colonial leadership. But as Martin Meredith shows in this history of Mugabe's rule, Mugabe from the beginning was sacrificing his purported ideals—and Zimbabwe's potential—to the goal of extending and cementing his autocratic leadership. Over time, Mugabe has become ever more dictatorial, and seemingly less and less interested in the welfare of his people, treating Zimbabwe's wealth and resources as spoils of war for his inner circle. In recent years he has unleashed a reign of terror and corruption in his country. Like the Congo, Angola, Rwanda, Sierra Leone and Liberia, Zimbabwe has been on a steady slide to disaster. Now for the first time the whole story is told in detail by an expert. It is a riveting and tragic political story, a morality tale, and an essential text for understanding today's Africa."], "author": "Martin Meredith", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-25 00:00:00", "ISBN": "158648558X"},
{"url": "https://www.goodreads.com/book/show/6518071-the-boy-next-door", "num_ratings": "696", "num_reviews": "108", "avg_ratings": 3.7, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Historical", "Historical Fiction", "Literature", "African Literature"], "title": "The Boy Next Door", "description": ["Di Spiers, Editor of Readings at BBC Radio 4,", "Orange Award for New Writers Chair of Judges", "Synopsis:", "In Bulawayo, Zimbabwe, there is a tragedy in the house next door to Lindiwe Bishop; her neighbor has been burned alive. The victim's stepson, Ian McKenzie, is the prime suspect but is soon released. Lindiwe can't hide her fascination with this young, boisterous and mysterious white man, and they soon forge an unlikely closeness even as the country starts to deteriorate. Years after circumstances split them apart, Ian returns to a much-changed Zimbabwe to see Lindiwe, now a sophisticated, impassioned young woman, and discovers a devastating secret that will alter both of their futures, and draw them closer together even as the world seems bent on keeping them apart. The Boy Next Door is a moving and powerful debut about two people finding themselves and each other in a time of national upheaval."], "author": "Irene Sabatini", "num_pages": "416", "awards": ["Orange Prize Nominee for New Writers (2010)"], "places": ["Bulawayo"], "character_names": [], "language": "English", "publish_date": "2009-09-08 00:00:00", "ISBN": "031604993X"},
{"url": "https://www.goodreads.com/book/show/39304599-like-sodium-in-water", "num_ratings": "23", "num_reviews": "2", "avg_ratings": 4.17, "genres": [], "title": "Like Sodium in Water: A memoir of home and heartache", "author": "Hayden Eastwood", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-03-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18334687-my-brother-but-one", "num_ratings": "298", "num_reviews": "37", "avg_ratings": 4.06, "genres": ["Cultural", "Africa", "Fiction"], "title": "My Brother-But-One", "description": ["Scott Decker and Zol Ndhlovu are partners in a private game ranch in Zimbabwe. They have a friendship borne from Africa — a brotherhood that endures the generation gap — and crosses the colour barrier.", " ", "Australian Ashley Twine is a thirty-something dynamic achiever and a confident businesswoman. When a gender mix-up secures her a position on a volunteer program in the Hwang", "Scott Decker and Zol Ndhlovu are partners in a private game ranch in Zimbabwe. They have a friendship borne from Africa — a brotherhood that endures the generation gap — and crosses the colour barrier.", " ", "Australian Ashley Twine is a thirty-something dynamic achiever and a confident businesswoman. When a gender mix-up secures her a position on a volunteer program in the Hwange National Park, Ashley gets a chance to take stock of her life and reassess her situation. But the chauvinistic Scott — who runs the operation — is adamant she isn’t cut out for the job.", " ", "After Ashley witnesses firsthand the devastation left behind by poachers, Scott finds himself torn between wanting to protect Ashley or force her to leave Africa for her own safety…and his sanity. However, nothing can prepare her for being ambushed and held captive by the psychopathic Rodney — an old enemy of Zol’s — from a war fought years ago. But now that their world has been threatened, circumstances take hold of their lives and begin to shape and change them forever.", " ", "Set against a magnificent backdrop of Africa across the decades, T.M. Clark explores and challenges the traditions between the white and black families of rural Africa."], "author": "T.M. Clark", "num_pages": "395", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": null, "publish_date": "2013-12-01 00:00:00", "ISBN": "174356466X"},
{"url": "https://www.goodreads.com/book/show/28239.Dark_Star_Safari", "num_ratings": "11,131", "num_reviews": "784", "avg_ratings": 3.95, "genres": ["Travel", "Cultural", "Africa", "Nonfiction", "Autobiography", "Memoir", "Adventure"], "title": "Dark Star Safari: Overland from Cairo to Cape Town", "description": ["In ", " the wittily observant and endearingly irascible Paul Theroux takes readers the length of Africa by rattletrap bus, dugout canoe, cattle truck, armed convoy, ferry, and train. In the course of his epic and enlightening journey, he endures danger, delay, and dismaying circumstances.", "Gauging the state of affairs, he talks to Africans, aid workers, missionar", "In ", " the wittily observant and endearingly irascible Paul Theroux takes readers the length of Africa by rattletrap bus, dugout canoe, cattle truck, armed convoy, ferry, and train. In the course of his epic and enlightening journey, he endures danger, delay, and dismaying circumstances.", "Gauging the state of affairs, he talks to Africans, aid workers, missionaries, and tourists. What results is an insightful mediation on the history, politics, and beauty of Africa and its people.", "In a new postscript, Theroux recounts the dramatic events of a return to Africa to visit Zimbabwe."], "author": "Paul Theroux", "num_pages": "485", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-05 00:00:00", "ISBN": "0618446877"},
{"url": "https://www.goodreads.com/book/show/17446993-fortunate", "num_ratings": "31", "num_reviews": "14", "avg_ratings": 3.84, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe"], "title": "Fortunate", "description": ["Another good read from multi-award-winning author Andrew JH Sharp.", "The Oxygen of Escape", "Beth Jenkins - semi-bereaved wife, rootless doctor - runs away from home at the age of twenty-eight and a half and becomes a heroine of a revolution.", "Locked into a lonely future by a cruel twist of fate, Beth reaches breaking point, abandons her husband, and flees to faraway Zimbabwe. Her", "Another good read from multi-award-winning author Andrew JH Sharp.", "The Oxygen of Escape", "Beth Jenkins - semi-bereaved wife, rootless doctor - runs away from home at the age of twenty-eight and a half and becomes a heroine of a revolution.", "Locked into a lonely future by a cruel twist of fate, Beth reaches breaking point, abandons her husband, and flees to faraway Zimbabwe. Her attempts to create a new life falter when she finds herself at the center of a deadly struggle for the ownership of a farm. From a guest of honor at the President’s table to a disastrous decision that betrays a good man, her new start threatens to end in catastrophe.", "But the land and its painted rocks hold clues to a path to atonement and re-found love if she has the courage to search."], "author": "Andrew J.H. Sharp", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-01 00:00:00", "ISBN": "1783060018"},
{"url": "https://www.goodreads.com/book/show/8728554-the-fear", "num_ratings": "1,508", "num_reviews": "194", "avg_ratings": 4.06, "genres": ["Cultural", "Africa", "Nonfiction", "History", "Eastern Africa", "Zimbabwe", "Politics", "Autobiography", "Memoir", "Biography"], "title": "The Fear: Robert Mugabe and the Martyrdom of Zimbabwe", "description": ["Journalist Peter Godwin has covered wars. As a soldier, he's fought them. But nothing prepared him for the surreal mix of desperation and hope he encountered when he returned to Zimbabwe, his broken homeland. ", "Godwin arrived as Robert Mugabe, the country's dictator for 30 years, has finally lost an election. Mugabe's tenure has left Zimbabwe with the world's highest rate of", "Journalist Peter Godwin has covered wars. As a soldier, he's fought them. But nothing prepared him for the surreal mix of desperation and hope he encountered when he returned to Zimbabwe, his broken homeland. ", "Godwin arrived as Robert Mugabe, the country's dictator for 30 years, has finally lost an election. Mugabe's tenure has left Zimbabwe with the world's highest rate of inflation and the shortest life span. Instead of conceding power, Mugabe launched a brutal campaign of terror against his own citizens. With foreign correspondents banned, and he himself there illegally, Godwin was one of the few observers to bear witness to this period the locals call The Fear. He saw torture bases and the burning villages but was most awed as an observer of not only simple acts of kindness but also churchmen and diplomats putting their own lives on the line to try to stop the carnage.", "THE FEAR is a book about the astonishing courage and resilience of a people, armed with nothing but a desire to be free, who challenged a violent dictatorship. It is also the deeply personal and ultimately uplifting story of a man trying to make sense of the country he can't recognize as home."], "author": "Peter Godwin", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-23 00:00:00", "ISBN": "031605173X"},
{"url": "https://www.goodreads.com/book/show/15852479-we-need-new-names", "num_ratings": "14,827", "num_reviews": "2,013", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "We Need New Names", "description": ["An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by", "An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by paramilitary policemen, before the school closed, before the fathers left for dangerous jobs abroad.", "But Darling has a chance to escape: she has an aunt in America. She travels to this new land in search of America's famous abundance only to find that her options as an immigrant are perilously few. NoViolet Bulawayo's debut calls to mind the great storytellers of displacement and arrival who have come before her--from Junot Diaz to Zadie Smith to J.M. Coetzee--while she tells a vivid, raw story all her own."], "author": "NoViolet Bulawayo", "num_pages": "298", "awards": ["Man Booker Prize Nominee (2013)", "Guardian First Book Award Nominee (2013)", "PEN/Hemingway Foundation Award (2014)", "Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee (2015)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)", "Betty Trask Award (2014)"], "places": ["Tsholotsho", "Detroit, Michigan", "bulawayo"], "character_names": [], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "0316230812"},
{"url": "https://www.goodreads.com/book/show/525557.Scribbling_the_Cat", "num_ratings": "4,241", "num_reviews": "391", "avg_ratings": 3.77, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Cultural", "Africa", "Travel", "Eastern Africa", "Zimbabwe", "History", "Biography Memoir", "Eastern Africa", "Zambia", "Eastern Africa", "Mozambique"], "title": "Scribbling the Cat: Travels with an African Soldier", "description": ["Book by Fuller, Alexandra"], "author": "Alexandra Fuller", "num_pages": "256", "awards": [], "places": ["Zambia"], "character_names": [], "language": "English", "publish_date": "2004-05-03 00:00:00", "ISBN": "1594200165"},
{"url": "https://www.goodreads.com/book/show/10338691-cocktail-hour-under-the-tree-of-forgetfulness", "num_ratings": "9,986", "num_reviews": "1,332", "avg_ratings": 3.86, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Cultural", "Africa"], "title": "Cocktail Hour Under the Tree of Forgetfulness", "description": ["In this sequel to ", ", Alexandra Fuller returns to Africa and the story of her unforgettable family. ", "In ", ", Alexandra Fuller braids a multilayered narrative around the perfectly lit, Happy Valley-era Africa of her mother's childhood; the boiled cabbage grimness of her father's English childhood; and", "In this sequel to ", ", Alexandra Fuller returns to Africa and the story of her unforgettable family. ", "In ", ", Alexandra Fuller braids a multilayered narrative around the perfectly lit, Happy Valley-era Africa of her mother's childhood; the boiled cabbage grimness of her father's English childhood; and the darker, civil war-torn Africa of her own childhood. At its heart, this is the story of Fuller's mother, Nicola. Born on the Scottish Isle of Skye and raised in Kenya, Nicola holds dear the kinds of values most likely to get you hurt or killed in Africa: loyalty to blood, passion for land, and a holy belief in the restorative power of all animals. Fuller interviewed her mother at length and has captured her inimitable voice with remarkable precision. ", " is as funny, terrifying, exotic, and unselfconscious as Nicola herself. ", "We see Nicola and Tim Fuller in their lavender-colored honeymoon period, when East Africa lies before them with all the promise of its liquid equatorial light, even as the British Empire in which they both believe wanes. But in short order, an accumulation of mishaps and tragedies bump up against history until the couple finds themselves in a world they hardly recognize. We follow the Fullers as they hopscotch the continent, running from war and unspeakable heartbreak, from Kenya to Rhodesia to Zambia, even returning to England briefly. But just when it seems that Nicola has been broken entirely by Africa, it is the African earth itself that revives her. ", "A story of survival and madness, love and war, loyalty and forgiveness, ", " is an intimate exploration of the author's family. In the end, we find Nicola and Tim at a coffee table under their Tree of Forgetfulness on the banana and fish farm where they plan to spend their final days. In local custom, the Tree of Forgetfulness is where villagers meet to resolve disputes and it is here that the Fullers at last find an African kind of peace. Following the ghosts and dreams of memory, ", " is Alexandra Fuller at her very best."], "author": "Alexandra Fuller", "num_pages": "256", "awards": [], "places": ["East Africa"], "character_names": [], "language": "English", "publish_date": "2011-08-23 00:00:00", "ISBN": "1594202990"},
{"url": "https://www.goodreads.com/book/show/102450.Rainbow_s_End", "num_ratings": "952", "num_reviews": "114", "avg_ratings": 3.88, "genres": ["Cultural", "Africa", "Autobiography", "Memoir", "Nonfiction", "Eastern Africa", "Zimbabwe", "Biography", "Biography Memoir"], "title": "Rainbow's End: A Memoir of Childhood, War and an African Farm", "description": ["This is a story about a paradise lost. . . . About an African dream that began with a murder . . .In 1978, in the final, bloodiest phase of the Rhodesian civil war, eleven-year-old Lauren St John moves with her family to Rainbow's End, a wild, beautiful farm and game reserve set on the banks of a slowflowing river. The house has been the scene of a horrific attack by guerr", "This is a story about a paradise lost. . . . About an African dream that began with a murder . . .In 1978, in the final, bloodiest phase of the Rhodesian civil war, eleven-year-old Lauren St John moves with her family to Rainbow's End, a wild, beautiful farm and game reserve set on the banks of a slowflowing river. The house has been the scene of a horrific attack by guerrillas, and when Lauren's family settles there, a chain of events is set in motion that will change her life irrevocably.", "\"Rainbow's End\" captures the overwhelming beauty and extraordinary danger of life in the African bush. Lauren's childhood reads like a girl's own adventure story. At the height of the war, Lauren rides through the wilderness on her horse, Morning Star, encountering lions, crocodiles, snakes, vicious ostriches, and mad cows. Many of the animals are pets, including Miss Piggy and Bacon and an elegant giraffe named Jenny. The constant threat of ruthless guerrillas prowling the land underscores everything, making each day more dangerous, vivid, and prized than the last.", "After Independence, Lauren comes to the bitter realization that she'd been on the wrong side of the civil war. While she and her family believed that they were fighting for democracy over Communism, others saw the war as black against white. And when Robert Mugabe comes into power, he oversees the torture and persecution of thousands of members of an opposing tribe and goes on to become one of Africa's legendary dictators. The ending of this beautiful memoir is a fist to the stomach as Lauren realizes that she can be British or American, but she cannot be African. She can love it -- be willing to die for it -- but she cannot claimAfrica because she is white."], "author": "Lauren St. John", "num_pages": "269", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0743286790"},
{"url": "https://www.goodreads.com/book/show/94554.Love_in_the_Driest_Season", "num_ratings": "2,308", "num_reviews": "273", "avg_ratings": 4.06, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Africa", "Parenting", "Adoption", "Eastern Africa", "Zimbabwe", "Biography"], "title": "Love in the Driest Season: A Family Memoir", "description": ["Against a background of war, terrorism, disease and unbearable uncertainty about the future, this story of how a foreign correspondent and his wife fought to adopt a Zimbabwean baby emerges as an inspiring testament to the miracles that love and dogged determination can sometimes achieve. Don't miss this gripping memoir.", "Foreign correspondent Neely Tucker and his wife, Vita", "Against a background of war, terrorism, disease and unbearable uncertainty about the future, this story of how a foreign correspondent and his wife fought to adopt a Zimbabwean baby emerges as an inspiring testament to the miracles that love and dogged determination can sometimes achieve. Don't miss this gripping memoir.", "Foreign correspondent Neely Tucker and his wife, Vita, arrived in Zimbabwe in 1997. After witnessing firsthand the devastating consequences of AIDS on the population, especially the children, the couple started volunteering at an orphanage that was desperately underfunded and short-staffed. One afternoon, a critically ill infant was brought to the orphanage from a village outside the city. She’d been left to die in a field on the day she was born, abandoned in the tall brown grass that covers the highlands of Zimbabwe in the dry season. After a near-death hospital stay, and under strict doctor’s orders, the ailing child was entrusted to the care of Tucker and Vita. Within weeks Chipo, the girl-child whose name means gift, would come to mean everything to them.", "Still an active correspondent, Tucker crisscrossed the continent, filing stories about the uprisings in the Congo, the civil war in Sierra Leone, and the postgenocidal conflict in Rwanda. He witnessed heartbreaking scenes of devastation and violence, steeling him further to take a personal role in helping anywhere he could. At home in Harare, Vita was nursing Chipo back to health. Soon she and Tucker decided to alter their lives forever—they would adopt Chipo. That decision challenged an unspoken social norm—that foreigners should never adopt Zimbabwean children.", "Raised in rural Mississippi in the sixties and seventies, Tucker was familiar with the mores associated with and dictated by race. His wife, a savvy black woman whose father escaped the Jim Crow South for a new life in the industrial North, would not be deterred in her resolve to welcome Chipo into their loving family.", "As if their situation wasn’t tenuous enough, Zimbabwe President Robert Mugabe was stirring up national fervor against foreigners, especially journalists, abroad and at home. At its peak, his antagonizing branded all foreign journalists personae non grata. For Tucker, the only full-time American correspondent in Zimbabwe, the declaration was a direct threat to his life and his wife’s safety, and an ultimatum to their decision to adopt the child who had already become their only daughter.", "Against a background of war, terrorism, disease, and unbearable uncertainty about the future, Chipo’s story emerges as an inspiring testament to the miracles that love—and dogged determination—can sometimes achieve. Gripping, heartbreaking, and triumphant, this family memoir will resonate throughout the ages."], "author": "Neely Tucker", "num_pages": "288", "awards": [], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2005-04-05 00:00:00", "ISBN": "1400081602"},
{"url": "https://www.goodreads.com/book/show/6130966-an-elegy-for-easterly", "num_ratings": "619", "num_reviews": "115", "avg_ratings": 3.78, "genres": ["Short Stories", "Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Literature", "African Literature"], "title": "An Elegy for Easterly: Stories", "description": ["A woman in a township in Zimbabwe is surrounded by throngs of dusty children but longs for a baby of her own; an old man finds that his new job making coffins at No Matter Funeral Parlor brings unexpected riches; a politician’s widow stands quietly by at her husband’s funeral, watching his colleagues bury an empty casket. Petina Gappah’s characters may have ordinary hopes", "A woman in a township in Zimbabwe is surrounded by throngs of dusty children but longs for a baby of her own; an old man finds that his new job making coffins at No Matter Funeral Parlor brings unexpected riches; a politician’s widow stands quietly by at her husband’s funeral, watching his colleagues bury an empty casket. Petina Gappah’s characters may have ordinary hopes and dreams, but they are living in a world where a loaf of bread costs half a million dollars, where wives can’t trust even their husbands for fear of AIDS, and where people know exactly what will be printed in the one and only daily newspaper because the news is always, always good.", "In her spirited debut collection, the Zimbabwean writer Petina Gappah brings us the resilience and inventiveness of the people who struggle to live under Robert Mugabe’s regime. She takes us across the city of Harare, from the townships beset by power cuts to the manicured lawns of privilege and corruption, where wealthy husbands keep their first wives in the “big houses” while their unofficial second wives wait in the “small houses,” hoping for a promotion.", "Despite their circumstances, the characters in ", "are more than victims—they are all too human, with as much capacity to inflict pain as to endure it. They struggle with the larger issues common to all people everywhere: failed promises, unfulfilled dreams, and the yearning for something to anchor them to life."], "author": "Petina Gappah", "num_pages": "224", "awards": ["Guardian First Book Award (2009)", "Orwell Prize Nominee (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-26 00:00:00", "ISBN": "0865479062"},
{"url": "https://www.goodreads.com/book/show/741417.The_Grass_Is_Singing", "num_ratings": "8,757", "num_reviews": "797", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Classics", "Historical", "Historical Fiction", "Southern Africa", "South Africa"], "title": "The Grass Is Singing", "description": ["Set in South Africa under white rule, Doris Lessing's first novel is both a riveting chronicle of human disintegration and a beautifully understated social critique. Mary Turner is a self-confident, independent young woman who becomes the depressed, frustrated wife of an ineffectual, unsuccessful farmer. Little by little the ennui of years on the farm work their slow poiso", "Set in South Africa under white rule, Doris Lessing's first novel is both a riveting chronicle of human disintegration and a beautifully understated social critique. Mary Turner is a self-confident, independent young woman who becomes the depressed, frustrated wife of an ineffectual, unsuccessful farmer. Little by little the ennui of years on the farm work their slow poison, and Mary's despair progresses until the fateful arrival of an enigmatic and virile black servant, Moses. Locked in anguish, Mary and Moses--master and slave--are trapped in a web of mounting attraction and repulsion. Their psychic tension explodes in an electrifying scene that ends this disturbing tale of racial strife in colonial South Africa.", " blends Lessing's imaginative vision with her own vividly remembered early childhood to recreate the quiet horror of a woman's struggle against a ruthless fate."], "author": "Doris Lessing", "num_pages": "243", "awards": [], "places": [], "character_names": ["Mary Turner", "Dick Turner", "Moses"], "language": "English", "publish_date": "1999-12-22 00:00:00", "ISBN": "0060953462"},
{"url": "https://www.goodreads.com/book/show/6449208-the-last-resort", "num_ratings": "2,500", "num_reviews": "241", "avg_ratings": 4.13, "genres": ["Cultural", "Africa", "Nonfiction", "Autobiography", "Memoir", "Eastern Africa", "Zimbabwe", "Biography", "Travel"], "title": "The Last Resort: A Memoir of Zimbabwe", "description": ["Thrilling, heartbreaking, and, at times, absurdly funny, ", " is a remarkable true story about one family in a country under siege and a testament to the love, perseverance, and resilience of the human spirit. ", "Born and raised in Zimbabwe, Douglas Rogers is the son of white farmers living through that country’s long and tense transition from postcolonial rule. He", "Thrilling, heartbreaking, and, at times, absurdly funny, ", " is a remarkable true story about one family in a country under siege and a testament to the love, perseverance, and resilience of the human spirit. ", "Born and raised in Zimbabwe, Douglas Rogers is the son of white farmers living through that country’s long and tense transition from postcolonial rule. He escaped the dull future mapped out for him by his parents for one of adventure and excitement in Europe and the United States. But when Zimbabwe’s president Robert Mugabe launched his violent program to reclaim white-owned land and Rogers’s parents were caught in the cross fire, everything changed. Lyn and Ros, the owners of Drifters–a famous game farm and backpacker lodge in the eastern mountains that was one of the most popular budget resorts in the country–found their home and resort under siege, their friends and neighbors expelled, and their lives in danger. But instead of leaving, as their son pleads with them to do, they haul out a shotgun and decide to stay. ", "On returning to the country of his birth, Rogers finds his once orderly and progressive home transformed into something resembling a Marx Brothers romp crossed with ", ": pot has supplanted maize in the fields; hookers have replaced college kids as guests; and soldiers, spies, and teenage diamond dealers guzzle beer at the bar. ", "And yet, in spite of it all, Rogers’s parents–with the help of friends, farmworkers, lodge guests, and residents–among them black political dissidents and white refugee farmers–continue to hold on. But can they survive to the end? ", "In the midst of a nation stuck between its stubborn past and an impatient future, Rogers soon begins to see his parents in a new light: unbowed, with passions and purpose renewed, even heroic. And, in the process, he learns that the \"big story\" he had relentlessly pursued his entire adult life as a roving journalist and travel writer was actually happening in his own backyard."], "author": "Douglas Rogers", "num_pages": "320", "awards": ["Stanford Dolman Travel Book of the Year Nominee (2011)"], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2009-09-22 00:00:00", "ISBN": "0307407977"},
{"url": "https://www.goodreads.com/book/show/195788.Mukiwa", "num_ratings": "3,444", "num_reviews": "216", "avg_ratings": 4.22, "genres": ["Cultural", "Africa", "Autobiography", "Memoir", "Nonfiction", "Eastern Africa", "Zimbabwe", "Biography"], "title": "Mukiwa: A White Boy in Africa", "description": [" is the story of Peter Godwin's experiences growing up in Rhodesia. He recounts the story of that country's violent transformation into Zimbabwe, as well as his own personal metamorphoses from privileged boy to reluctant soldier to investigative journalist.", " is the story of Peter Godwin's experiences growing up in Rhodesia. He recounts the story of that country's violent transformation into Zimbabwe, as well as his own personal metamorphoses from privileged boy to reluctant soldier to investigative journalist."], "author": "Peter Godwin", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-30 00:00:00", "ISBN": "0802141927"},
{"url": "https://www.goodreads.com/book/show/144214.When_a_Crocodile_Eats_the_Sun", "num_ratings": "7,138", "num_reviews": "769", "avg_ratings": 4.14, "genres": ["Cultural", "Africa", "Nonfiction", "Autobiography", "Memoir", "History", "Biography", "Eastern Africa", "Zimbabwe"], "title": "When a Crocodile Eats the Sun: A Memoir of Africa", "description": ["After his father's heart attack in 1984, Peter Godwin began a series of pilgrimages back to Zimbabwe, the land of his birth, from Manhattan, where he now lives. On these frequent visits to check on his elderly parents, he bore witness to Zimbabwe's dramatic spiral downwards into the", "jaws of violent chaos, presided over by an increasingly enraged dictator. And yet long after", "After his father's heart attack in 1984, Peter Godwin began a series of pilgrimages back to Zimbabwe, the land of his birth, from Manhattan, where he now lives. On these frequent visits to check on his elderly parents, he bore witness to Zimbabwe's dramatic spiral downwards into the", "jaws of violent chaos, presided over by an increasingly enraged dictator. And yet long after their comfortable lifestyle had been shattered and millions were fleeing, his parents refuse to leave, steadfast in their allegiance to the failed state that has been their adopted home for 50 years.", "Then Godwin discovered a shocking family secret that helped explain their loyalty. Africa was his father's sanctuary from another identity, another world.", "WHEN A CROCODILE EATS THE SUN is a stirring memoir of the disintegration of a family set against the collapse of a country. But it is also a vivid portrait of the profound strength of the human spirit and the enduring power of love."], "author": "Peter Godwin", "num_pages": "344", "awards": ["Borders Original Voices Award for Nonfiction (2007)", "Orwell Prize (1997)"], "places": ["Zimbabwe", "Rhodesia"], "character_names": ["Ian Smith", "Robert Mugabe", "Peter Godwin"], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0316158941"},
{"url": "https://www.goodreads.com/book/show/158674.Nervous_Conditions", "num_ratings": "9,179", "num_reviews": "651", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Eastern Africa", "Zimbabwe", "Feminism"], "title": "Nervous Conditions", "description": ["A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousn", "A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousness' of the 'postcolonial' conditions that bedevil us still. In Tambu and the women of her family, we African women see ourselves, whether at home or displaced, doing daily battle with our changing world with a mixture of tenacity, bewilderment and grace."], "author": "Tsitsi Dangarembga", "num_pages": "204", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1989)"], "places": ["Rhodesia", "Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2004-11-29 00:00:00", "ISBN": "1580051340"}
]