[
{"url": "https://www.goodreads.com/book/show/6963436-the-storyteller-or-the-hakawati", "num_ratings": "3,233", "num_reviews": "486", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Lebanon", "Magical Realism", "Fantasy"], "title": "The Storyteller, Or, the Hakawati", "description": ["Osama al-Kharrat left Lebanon at 16 to escape the civil war. He returns after some years, much changed, to find his father bedridden and his family, friends and enemies gathered close, gossiping, making peace, and above all, telling stories."], "author": "Rabih Alameddine", "num_pages": "513", "awards": [], "places": [], "character_names": ["Baibars"], "language": "English", "publish_date": "2010-02-01 00:00:00", "ISBN": "0330454471"},
{"url": "https://www.goodreads.com/book/show/2547.The_Prophet", "num_ratings": "180,594", "num_reviews": "7,125", "avg_ratings": 4.23, "genres": ["Poetry", "Philosophy", "Classics", "Fiction", "Spirituality", "Religion"], "title": "The Prophet", "description": ["Kahlil Gibran’s masterpiece, ", "is one of the most beloved classics of our time. Published in 1923, it has been translated into more than twenty languages, and the American editions alone have sold more than nine million copies.", "is a collection of poetic essays that are philosophical, spiritual, and, above all, inspirational. Gibran’s musings are divid", "Kahlil Gibran’s masterpiece, ", "is one of the most beloved classics of our time. Published in 1923, it has been translated into more than twenty languages, and the American editions alone have sold more than nine million copies.", "is a collection of poetic essays that are philosophical, spiritual, and, above all, inspirational. Gibran’s musings are divided into twenty-eight chapters covering such sprawling topics as love, marriage, children, giving, eating and drinking, work, joy and sorrow, housing, clothes, buying and selling, crime and punishment, laws, freedom, reason and passion, pain, self-knowledge, teaching, friendship, talking, time, good and evil, prayer, pleasure, beauty, religion, and death."], "author": "Kahlil Gibran", "num_pages": "127", "awards": [], "places": ["Orphalese"], "character_names": ["Al Mustafa", "Al Mitra"], "language": "English", "publish_date": "2010-01-01 00:00:00", "ISBN": "000100039X"},
{"url": "https://www.goodreads.com/book/show/22929656-lifted-by-the-great-nothing", "num_ratings": "323", "num_reviews": "49", "avg_ratings": 3.67, "genres": ["Fiction", "Young Adult", "Coming Of Age", "Novels", "Book Club"], "title": "Lifted by the Great Nothing", "description": ["Max doesn’t remember his mother, who was murdered by burglars before they emigrated from Beirut to New Jersey. He lives with his father, Rasheed, who is enamored of his concept of Americ", "Max doesn’t remember his mother, who was murdered by burglars before they emigrated from Beirut to New Jersey. He lives with his father, Rasheed, who is enamored of his concept of American culture—baseball and barbeques—and tries to shed his Lebanese heritage completely. “When we are in America,” Reed (for he goes by Reed in America, not Rasheed) tells Max, “we are Americans.”", "Rasheed has a singular purpose in life: to provide Max with a joyful childhood. He showers his son with gifts out of a belief that he deserves all and is capable of anything. Max wants nothing more than to convince his father that he is a successful single parent. The only thing that can disrupt their peaceful universe is the truth—which it does, with force.", "When Max turns seventeen, he learns from Rasheed’s ex-girlfriend that his father has been lying to him. Max’s understanding of the world is so rocked that he is subsequently launched on an uncertain mission to Beirut and then Paris.", "Lifted by the Great Nothing is a startlingly graceful, and often hilarious, coming-of-age story about the lengths we go to preserve the untruths we live by. With its poignant relationships, unsettling misadventures, and surprising love stories, it is a touching and devastating portrait of a young man coming to terms with his country’s—and his own—violent past."], "author": "Karim Dimechkie", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-05-19 00:00:00", "ISBN": "1632860589"},
{"url": "https://www.goodreads.com/book/show/6490377-love-is-like-water-and-other-stories", "num_ratings": "12", "num_reviews": "1", "avg_ratings": 3.67, "genres": ["Northern Africa", "Egypt", "Short Stories", "Fiction"], "title": "Love Is Like Water and Other Stories", "description": ["Like the author of this remarkable collection of thirteen linked stories, the protagonist, Nadia, was born and raised in Egypt, educated in England, and immigrated to the United States. Samia Serageldin draws her characters out with subtlety and control, moving from the narrator’s grand-mother’s garden house in Cairo to the suburbs of North Carolina, yielding powerful port", "Like the author of this remarkable collection of thirteen linked stories, the protagonist, Nadia, was born and raised in Egypt, educated in England, and immigrated to the United States. Samia Serageldin draws her characters out with subtlety and control, moving from the narrator’s grand-mother’s garden house in Cairo to the suburbs of North Carolina, yielding powerful portraits of cultural dislocation, faith, and multigenerational conflicts.", "As the narratives shift in time and place, they unfold through memory. In \"The Zawiya,\" Nadia reflects on the change in women’s space from the coiffeur’s salon to a religious pulpit as she revisits a childhood ritual. In the title story, Nadia offers a vivid sketch of her grandmother Nanou, \"a force of nature\" who, as an early widow, single-handedly raised six children and ran the household. At a time when few women experienced such independence, Nanou had a potent influence on the young narrator. Told with compassion and clarity, Serageldin’s stories reveal one woman’s exploration of identity, finding it in both the sweeping backdrop of Egyptian history and the quotidian exchanges with friends and family."], "author": "Samia Serageldin", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-15 00:00:00", "ISBN": "0815609213"},
{"url": "https://www.goodreads.com/book/show/20642456-sitt-marie-rose", "num_ratings": "378", "num_reviews": "39", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "Lebanon", "War", "Academic", "School", "Literary Fiction", "Poetry"], "title": "Sitt Marie Rose", "description": ["Fiction. Translated from the French by Georgina Kleege, SITT MARIE ROSE is an extraordinary novel on the Civil War in Lebanon. A small press bestseller, now in its ninth edition, it is the story of a woman abducted by militiamen during the civil war in Lebanon. Already a classic of war literature, it won the France-Pays Arabes award in Paris and has been translated into te", "Fiction. Translated from the French by Georgina Kleege, SITT MARIE ROSE is an extraordinary novel on the Civil War in Lebanon. A small press bestseller, now in its ninth edition, it is the story of a woman abducted by militiamen during the civil war in Lebanon. Already a classic of war literature, it won the France-Pays Arabes award in Paris and has been translated into ten languages. It has been taught as part of Comparative Literature, World Literature, Women's Studies and Middle East Studies curricula at more than thirty universities and colleges in the U.S."], "author": "Etel Adnan", "num_pages": "106", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/970884.Bilal_s_Bread", "num_ratings": "66", "num_reviews": "11", "avg_ratings": 3.8, "genres": ["Glbt", "Queer", "Fiction", "Lgbt", "Glbt", "Gay", "Young Adult"], "title": "Bilal's Bread", "description": ["After fleeing Iraq, the Kurdish Abu family have settled in the United States. Salim, the eldest brother, has been deeply damaged by the torture he suffered at the hands of the Iraqi police, and his psychotic rages are becoming increasingly violent. At only 16, the youngest son, Bilal, holds the family secrets close, revealing nothing. But his conflict is deepened by his ow", "After fleeing Iraq, the Kurdish Abu family have settled in the United States. Salim, the eldest brother, has been deeply damaged by the torture he suffered at the hands of the Iraqi police, and his psychotic rages are becoming increasingly violent. At only 16, the youngest son, Bilal, holds the family secrets close, revealing nothing. But his conflict is deepened by his own sexual awakening, and he begins to direct his rage and frustration on his own body through cutting. A powerful story of a clash of cultures and the power of the individual voice.", " is a novelist living in Bangkok, Thailand, where he is an editor and writer for ", "."], "author": "Sulayman X", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-01 00:00:00", "ISBN": "1555838618"},
{"url": "https://www.goodreads.com/book/show/12858862-the-book-of-khalid", "num_ratings": "79", "num_reviews": "13", "avg_ratings": 3.78, "genres": ["Fiction", "Novels", "Literature"], "title": "The Book of Khalid", "description": ["Told with great good humor and worldly compassion, and with illustrations by Kahlil Gibran, ", " recounts the adventures of two young men, Khalid and Shakib,", "Told with great good humor and worldly compassion, and with illustrations by Kahlil Gibran, ", " recounts the adventures of two young men, Khalid and Shakib, who leave Lebanon for the United States to seek their fortune in turn-of-thecentury New York. Together, they face all the difficulties of poor immigrants—the passage by ship, admittance through Ellis Island and the rough immigrant life. Khalid, always the dreamer, tries to participate in the political and cultural life of the teeming city—to often humiliating and comic result.", "Tiring of their sojourn, he convinces Shakib they should return to Lebanon. But their heads are now full of New World ideas. And Khalid, trying to improve his brethren, turns his understanding of Western thought into a call for political progress, and religious unity and tolerance in the Arab world. A call that has him, accidentally, almost founding a new religion—and almost becoming its first martyr, when his ideas incite the faithful to riot.", "Playing with classical Arabic literary forms, as well as Western literary conventions, Ameen Rihani’s ", " is a unique contribution to American and World literature."], "author": "Ameen Rihani", "num_pages": "178", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-12 00:00:00", "ISBN": "161219088X"},
{"url": "https://www.goodreads.com/book/show/8253596-loom", "num_ratings": "45", "num_reviews": "14", "avg_ratings": 3.56, "genres": ["Fiction", "The United States Of America", "Cultural", "Lebanon"], "title": "Loom", "description": ["As a blizzard blankets the northeast United States, burying residents and shutting down airports, the Zaydan family eagerly awaits the arrival of Eva, a cousin visiting from Lebanon after a long separation from the family. Over the course of one day, while Eva is stranded in New York City, Chehade's nuanced story unfolds in the reminiscences and anxieties of each family me", "As a blizzard blankets the northeast United States, burying residents and shutting down airports, the Zaydan family eagerly awaits the arrival of Eva, a cousin visiting from Lebanon after a long separation from the family. Over the course of one day, while Eva is stranded in New York City, Chehade's nuanced story unfolds in the reminiscences and anxieties of each family member. ", "Emilie, the matriarch of this Lebanese American family, lives in a world of voluntary silence. Barely able to read and write in English and refusing to speak for the last several years, she immerses herself in her garden and leaves elaborately cooked meals anonymously for her solitary neighbor. Emilie's oldest daughter Josephine, middle aged and still living with her mother and married brother, struggles to regain the independence and confidence she had as a young girl in Lebanon. Young Marie, stifled by her conservative family, is determined to study at Berkeley and to leave behind her immigrant identity. All three are drawn to their mysterious neighbor, nicknamed Loom, whose loneliness and isolation mirror their own and kindle within each woman a desire to make a connection. When Emilie takes off during the blizzard in the direction of Loom's house and the rest of the family follows in her pursuit, their act is both an escape and a reaching out. Beautifully written and teeming with vivid portraits, Chehade's novel is both heartfelt and wise."], "author": "Thérèse Soukar Chehade", "num_pages": "182", "awards": ["Arab American Book Award for Fiction (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-11-17 00:00:00", "ISBN": "0815609825"},
{"url": "https://www.goodreads.com/book/show/10837280-birds-of-paradise", "num_ratings": "1,469", "num_reviews": "288", "avg_ratings": 3.32, "genres": ["Fiction", "Contemporary", "Adult Fiction", "Literary Fiction"], "title": "Birds of Paradise", "author": "Diana Abu-Jaber", "num_pages": "368", "awards": ["Arab American Book Award for Fiction (2012)"], "places": ["Miami Beach, Florida"], "character_names": [], "language": "English", "publish_date": "2011-09-06 00:00:00", "ISBN": "0393064611"},
{"url": "https://www.goodreads.com/book/show/460505.Return_of_the_Mummy", "num_ratings": "4,399", "num_reviews": "130", "avg_ratings": 3.52, "genres": ["Horror", "Childrens", "Young Adult", "Fiction"], "title": "Return of the Mummy", "description": ["After last year's scary adventure, Gabe's a little nervous about being back in Egypt. Back near the ancient pyramids. Back where he saw all of those creepy mummies. ", "Then he learns about an Egyptian superstition. A secret chant that is supposed to bring mummies to life. Gabe's uncle says it's just a hoax. ", "But now it sounds like something's moving in the mumm", "After last year's scary adventure, Gabe's a little nervous about being back in Egypt. Back near the ancient pyramids. Back where he saw all of those creepy mummies. ", "Then he learns about an Egyptian superstition. A secret chant that is supposed to bring mummies to life. Gabe's uncle says it's just a hoax. ", "But now it sounds like something's moving in the mummy's tomb.", "No way a couple of dumb words can wake the dead. ", "Can they?"], "author": "R.L. Stine", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-08-16 00:00:00", "ISBN": "0590477455"},
{"url": "https://www.goodreads.com/book/show/289115.Once_in_a_Promised_Land", "num_ratings": "241", "num_reviews": "37", "avg_ratings": 3.43, "genres": ["Fiction", "Academic", "School", "United States"], "title": "Once in a Promised Land", "description": ["A BookSense Notable Title for February 2007 ", "\"Once in a Promised Land\" is the story of a couple, Jassim and Salwa, who left the deserts of their native Jordan for those of Arizona, each chasing their own dreams of opportunity and freedom. Although the two live far from Ground Zero, they cannot escape the nationwide fallout from 9/11. Jassim, a hydrologist, believes passiona", "A BookSense Notable Title for February 2007 ", "\"Once in a Promised Land\" is the story of a couple, Jassim and Salwa, who left the deserts of their native Jordan for those of Arizona, each chasing their own dreams of opportunity and freedom. Although the two live far from Ground Zero, they cannot escape the nationwide fallout from 9/11. Jassim, a hydrologist, believes passionately in his mission to keep the water tables from dropping and make water accessible to all people, but his work is threatened by an FBI witch hunt for domestic terrorists. Salwa, a Palestinian now twice displaced, grappling to put down roots in an inhospitable climate, becomes pregnant against her husband's wishes and then loses the baby. When Jassim kills a teenage boy in a terrible accident and Salwa becomes hopelessly entangled with a shady young American, their tenuous lives in exile and their fragile marriage begin to unravel . This intimate account of two parallel lives is an achingly honest look at what it means to straddle cultures, to be viewed with suspicion, and to struggle to find save haven."], "author": "Laila Halaby", "num_pages": "338", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-01 00:00:00", "ISBN": "0807083909"},
{"url": "https://www.goodreads.com/book/show/1484306.The_Curse_of_the_Mummy_s_Tomb", "num_ratings": "10,917", "num_reviews": "302", "avg_ratings": 3.66, "genres": ["Horror", "Childrens", "Fiction", "Young Adult"], "title": "The Curse of the Mummy's Tomb", "description": ["Gabe just got lost - in a pyramid. One minute, his crazy cousin Sari was right ahead of him in the pyramid tunnel. The next minute, she'd disappeared.", "But Gabe isn't alone. Someone else is in the pyramid, too.", "Someone. Or some thing.", "Gabe doesn't believe in the curse of the mummy's tomb. But that doesn't mean that the curse isn't real.", "Does it?"], "author": "R.L. Stine", "num_pages": "132", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-16 00:00:00", "ISBN": "0590453696"},
{"url": "https://www.goodreads.com/book/show/26146347-escape-from-aleppo", "num_ratings": "543", "num_reviews": "157", "avg_ratings": 4.08, "genres": ["Childrens", "Middle Grade", "Historical", "Historical Fiction", "War", "Realistic Fiction", "Fiction", "Young Adult"], "title": "Escape from Aleppo", "description": ["Nadia stands at the center of attention in her parents’ elegant dining room. ", ", she thinks.", "Nadia stands at the center of attention in her parents’ elegant dining room. ", ", she thinks. Everyone is about to sing “Happy Birthday,” when her uncle calls from the living room, “", ", brothers, you need to see this.” Reluctantly, she follows her family into the other room. On TV, a reporter stands near an overturned vegetable cart on a dusty street. Beside it is a mound of smoldering ashes. The reporter explains that a vegetable vendor in the city of Tunis burned himself alive, protesting corrupt government officials who have been harassing his business. Nadia frowns.", "It is December 17, 2010: Nadia’s twelfth birthday and the beginning of the Arab Spring. Soon anti-government protests erupt across the Middle East and, one by one, countries are thrown into turmoil. As civil war flares in Syria and bombs fall across Nadia’s home city of Aleppo, her family decides to flee to safety. Inspired by current events, this novel sheds light on the complicated situation in Syria that has led to an international refugee crisis, and tells the story of one girl’s journey to safety."], "author": "N.H. Senzai", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-01-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22136.Out_of_Place", "num_ratings": "1,948", "num_reviews": "210", "avg_ratings": 3.97, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir"], "title": "Out of Place", "description": ["Out of Place"], "author": "Edward W. Said", "num_pages": "295", "awards": ["Anisfield-Wolf Book Award (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-08-16 00:00:00", "ISBN": "1862073708"},
{"url": "https://www.goodreads.com/book/show/21531932-baba-ali-and-the-clockwork-djinn", "num_ratings": "61", "num_reviews": "33", "avg_ratings": 4.2, "genres": ["Science Fiction", "Steampunk", "Fantasy", "Fantasy", "Fairy Tales", "Science Fiction", "Fiction"], "title": "Baba Ali and the Clockwork Djinn: A Steampunk Faerie Tale", "description": ["Come, Best Beloved, and sit you by my feet. I shall tell you a tale such as sister Scheherazade could have scarce imagined. A tale of wonders, of deeds both great and grievous, of courage that defies description, and above all, Child of Adam, I shall tell you a tale of love. ", "The night is for the telling of tales to which the morning may bear Truth. In the oldest of days an", "Come, Best Beloved, and sit you by my feet. I shall tell you a tale such as sister Scheherazade could have scarce imagined. A tale of wonders, of deeds both great and grievous, of courage that defies description, and above all, Child of Adam, I shall tell you a tale of love. ", "The night is for the telling of tales to which the morning may bear Truth. In the oldest of days and ages and times, there was, and there was not, a great evil that reached across the desert and beyond…", "In the Nejd there is nothing at all…except secrets. A band of thieves wish such secrets to remain hidden. ", "In England, far from his desert home, Ali bin-Massoud serves as apprentice to the famed Charles Babbage. One night a mysterious box is delivered by a clockwork falcon and Ali’s world is never the same again. Heartache, danger, and thieves mark his journey as Ali is summoned home at the death of his father.", "It will take faith, knowledge, and yes, love to realize his destiny, and more than a little skill with steam-driven technology. Can he unravel the mystery of the puzzle box and the clockwork djinn before it is too late? An ancient legacy and Ali's very life depend on his success. ", "Hear you the tale of Baba Ali and the Clockwork Djinn."], "author": "Danielle Ackley-McPhail", "num_pages": "229", "awards": [], "places": ["England", "Jerusalem", "Arabia"], "character_names": ["Charles Babbage", "Rashid", "Ali bin-Massoud", "Kassim bin-Massoud", "Shahin", "Lady Clara Pemberton", "Morgiana", "Fritz Langstrom", "Rassul"], "language": "English", "publish_date": "2014-09-01 00:00:00", "ISBN": "1937051900"},
{"url": "https://www.goodreads.com/book/show/18271349-terminal-rage", "num_ratings": "825", "num_reviews": "81", "avg_ratings": 4.16, "genres": ["Thriller", "Mystery", "Fiction"], "title": "Terminal Rage", "description": ["When a mysterious man besieges an office tower in Manhattan, he threatens to execute his hostages and unleash terror if his demands are not met. He informs the authorities he will only communicate with Alexander Blackwell, a former FBI hostage negotiator whose stellar career had ended abruptly a few years before.", "The FBI tracks Blackwell down on a tiny Caribbean island and", "When a mysterious man besieges an office tower in Manhattan, he threatens to execute his hostages and unleash terror if his demands are not met. He informs the authorities he will only communicate with Alexander Blackwell, a former FBI hostage negotiator whose stellar career had ended abruptly a few years before.", "The FBI tracks Blackwell down on a tiny Caribbean island and he reluctantly agrees to negotiate with the suspect. As the clock ticks fast to the deadline, Blackwell soon realizes the only way to save the hostages and prevent catastrophe is to figure out who this enigmatic hostage-taker really is, and why he asked for him by name. But what he discovers is a chilling global conspiracy at the highest levels of government that threatens to destroy his life all over again.", "Terminal Rage is an explosive novel set in the post 9/11 world, where terrorism is no longer defined by who the terrorists are, but the sophistication and impunity by which they operate"], "author": "A.M. Khalifa", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-16 00:00:00", "ISBN": "1940387000"},
{"url": "https://www.goodreads.com/book/show/896920.Mosaic", "num_ratings": "617", "num_reviews": "65", "avg_ratings": 3.41, "genres": ["Fiction", "Drama", "Adult Fiction"], "title": "Mosaic", "author": "Soheir Khashoggi", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-10-01 00:00:00", "ISBN": "0765312352"},
{"url": "https://www.goodreads.com/book/show/54881.Towelhead", "num_ratings": "3,509", "num_reviews": "528", "avg_ratings": 3.6, "genres": ["Fiction", "Young Adult", "Young Adult", "Coming Of Age", "Contemporary", "Adult Fiction"], "title": "Towelhead", "description": ["Thirteen-year-old Jasira wants what every girl wants: love and acceptance and the undivided attention of whoever she's with. And if she can't get that from her parents, then why not from her mother's boyfriend, or her father's muscle-bound neighbor, Mr. Vuoso? Alicia Erian's incandescent debut novel, ", ", will ring true for readers who remember the rarely poetic tran", "Thirteen-year-old Jasira wants what every girl wants: love and acceptance and the undivided attention of whoever she's with. And if she can't get that from her parents, then why not from her mother's boyfriend, or her father's muscle-bound neighbor, Mr. Vuoso? Alicia Erian's incandescent debut novel, ", ", will ring true for readers who remember the rarely poetic transition from childhood to young adulthood. Jasira is a creature of contradiction: both innocent (reading romantic intentions into the grossest displays of lust) and oddly clear-sighted, especially when it comes to the imbalance of power, and the things we do for love. When her mother exiles her to Houston to live with Jasira's strict, quick-to-anger Lebanese father, she quickly learns what aspects of herself to suppress in front of him. In private, however, she conducts her sexual awakening with all the false confidence that pop culture and her neighbor's ", " magazines have provided.", "Jasira tells her story with candor and glimmers of dark, unexpected humor--as when she describes her mother's boyfriend Barry's assistance in her personal grooming: \"A week later, Barry broke down and told her the truth. That he had shaved me himself. That he had been shaving me for weeks. That he couldn't seem to stop shaving me.\" The freshness of her narrative voice sets ", " apart from the sentimental or purely harsh treatment of similar subject matter elsewhere, and makes the novel a promising follow-up to Erian's well-regarded short story collection, ", ". "], "author": "Alicia Erian", "num_pages": "336", "awards": [], "places": ["Houston, Texas"], "character_names": ["Jasira", "Mr Vuoso", "Barry", "Zack"], "language": "English", "publish_date": "2006-04-10 00:00:00", "ISBN": "0743285123"},
{"url": "https://www.goodreads.com/book/show/641137.Mirage", "num_ratings": "628", "num_reviews": "60", "avg_ratings": 3.84, "genres": ["Fiction", "Sociology", "Abuse"], "title": "Mirage", "description": ["Amira Badir, a young woman from a wealthy family in the Middle Eastern country of al-Remal, lives a life of luxury in opulent palaces. But repressive al-Remal discourages intelligence and initiative, so her life is also one of stark contrasts: wearing designer gowns at home, but never stepping outside without being swathed in black veils and accompanied by an escort. ", "Amira", "Amira Badir, a young woman from a wealthy family in the Middle Eastern country of al-Remal, lives a life of luxury in opulent palaces. But repressive al-Remal discourages intelligence and initiative, so her life is also one of stark contrasts: wearing designer gowns at home, but never stepping outside without being swathed in black veils and accompanied by an escort. ", "Amira is not prepared for the sadistic savagery of her new husband, nor for the increasing control he exerts over her. Fearing for her safety, she escapes with her baby to start a new life in the United States. But her past--and her powerful husband--won't give her up easily. . . ."], "author": "Soheir Khashoggi", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-15 00:00:00", "ISBN": "0812550943"},
{"url": "https://www.goodreads.com/book/show/16175116-origin", "num_ratings": "1,273", "num_reviews": "249", "avg_ratings": 3.52, "genres": ["Mystery", "Fiction", "Thriller", "Suspense"], "title": "Origin", "description": ["In this \"mystery of cold beauty and dark isolation, written with crystalline precision\" (", "), a series of crib deaths in Syracuse, New York, draws the attention of police and national media. Is a serial infant murderer at large?", "A \"haunting story, icy cold in its upstate New York setting but glowing with the unusual brightness of its heroine\" (", "), ", "In this \"mystery of cold beauty and dark isolation, written with crystalline precision\" (", "), a series of crib deaths in Syracuse, New York, draws the attention of police and national media. Is a serial infant murderer at large?", "A \"haunting story, icy cold in its upstate New York setting but glowing with the unusual brightness of its heroine\" (", "), ", " stars a solitary fingerprint examiner who finds herself playing a critical role in the case. Diana Abu-Jaber, a \"gifted and graceful writer\" (", "), masterfully \"transcends formula\" (", ") as \"the tension of ", " escalates, shaped as much by beautifully nuanced prose as menacing events\" (", "). Reading group guide included."], "author": "Diana Abu-Jaber", "num_pages": "384", "awards": ["Arab American Book Award Nominee for Fiction (2008)", "Florida Book Award for General Fiction - Bronze (2007)"], "places": ["Syracuse, New York"], "character_names": ["Lena Dawson"], "language": null, "publish_date": "2008-05-17 00:00:00", "ISBN": "0393066657"},
{"url": "https://www.goodreads.com/book/show/14784908-lebanese-blonde", "num_ratings": "33", "num_reviews": "7", "avg_ratings": 3.88, "genres": [], "title": "Lebanese Blonde", "description": ["Winner of the 2013 Arab American Book Award, ", " takes place in 1975-76 at the beginning of Lebanon's sectarian civil war. Set primarily in the Toledo, Ohio, \"Little Syria\" community, it is the story of two immigrant cousins: Aboodeh, a self-styled entrepreneur; and Samir, his young, reluctant accomplice. Together the two concoct a scheme to import Lebanese Blo", "Winner of the 2013 Arab American Book Award, ", " takes place in 1975-76 at the beginning of Lebanon's sectarian civil war. Set primarily in the Toledo, Ohio, \"Little Syria\" community, it is the story of two immigrant cousins: Aboodeh, a self-styled entrepreneur; and Samir, his young, reluctant accomplice. Together the two concoct a scheme to import Lebanese Blonde, a potent strain of hashish, into the United States, using the family's mortuary business as a cover. When Teyib, a newly arrived war refugee, stumbles onto their plans, his clumsy efforts to gain acceptance raise suspicion. Who is this mysterious \"cousin,\" and what dangers does his presence pose? Aboodeh and Samir's problems grow still more serious when a shipment goes awry and their links to the war-ravaged homeland are severed. Soon it's not just Aboodeh and Samir's livelihoods and futures that are imperiled, but the stability of the entire family."], "author": "Joseph Geha", "num_pages": "296", "awards": ["Arab American Book Award for Fiction (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-30 00:00:00", "ISBN": "0472118455"},
{"url": "https://www.goodreads.com/book/show/19407487-coming-to-astoria", "num_ratings": "20", "num_reviews": "9", "avg_ratings": 3.25, "genres": [], "title": "Coming to Astoria: An Immigrant's Tale", "description": ["Why do children growing up together in the same household turn out so completely different? How can a child raised in a family of twelve be so lonely? ", "Coming to Astoria is a collections of essays on growing up in a different culture and the experiences of moving to a foreign land ", "Coming to Astoria tak", "Why do children growing up together in the same household turn out so completely different? How can a child raised in a family of twelve be so lonely? ", "Coming to Astoria is a collections of essays on growing up in a different culture and the experiences of moving to a foreign land ", "Coming to Astoria takes the reader on a journey of self-discovery which is humorous, entertaining, and educational. This is a fascinating human interest story filled with poignant memories about growing up alone in a large family."], "author": "Omar Kiam", "num_pages": "159", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/773454.Crescent", "num_ratings": "2,213", "num_reviews": "323", "avg_ratings": 3.78, "genres": ["Fiction", "Food and Drink", "Food", "Romance", "Contemporary"], "title": "Crescent", "description": ["Written in a lush, lyrical style, infused with the flavors and scents of Middle Eastern food, and spiced with history and fable, Crescent is a sensuous love story and a gripping tale of risk and commitment. The reading guide includes a number of recipes to share with friends and family!", "An Arab-American novel as delicious as Like Water for Chocolate.", "Praised by critics from", "Written in a lush, lyrical style, infused with the flavors and scents of Middle Eastern food, and spiced with history and fable, Crescent is a sensuous love story and a gripping tale of risk and commitment. The reading guide includes a number of recipes to share with friends and family!", "An Arab-American novel as delicious as Like Water for Chocolate.", "Praised by critics from The New Yorker to USA Today for her first novel, Arabian Jazz (\"an oracular tale that unfurls like gossamer\"), Diana Abu-Jaber weaves with spellbinding magic a multidimensional love story set in the Arab-American community of Los Angeles. ", "Thirty-nine-year-old Sirine, never married, lives with a devoted Iraqi-immigrant uncle and an adoring dog named King Babar. She works as a chef in a Lebanese restaurant, her passions aroused only by the preparation of food—until an unbearably handsome Arabic literature professor starts dropping by for a little home cooking. Falling in love brings Sirene's whole heart to a boil—stirring up memories of her parents and questions about her identity as an Arab American. ", "Written in a lush, lyrical style reminiscent of The God of Small Things, infused with the flavors and scents of Middle Eastern food, and spiced with history and fable, Crescent is a sensuous love story and a gripping tale of risk and commitment."], "author": "Diana Abu-Jaber", "num_pages": "416", "awards": ["American Book Award (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-05-17 00:00:00", "ISBN": "0393325547"},
{"url": "https://www.goodreads.com/book/show/28818930-the-angel-of-history", "num_ratings": "723", "num_reviews": "169", "avg_ratings": 3.85, "genres": ["Fiction", "Lgbt", "Literary Fiction", "Glbt", "Queer", "Novels"], "title": "The Angel of History", "description": ["Following the critical and commercial success of ", ", Alameddine delivers a spectacular portrait of a man and an era of profound political and social upheaval.", "Set over the course of one night in the waiting room of a psych clinic, ", " follows Yemeni-born poet Jacob as he revisits the events of his life, from his maternal upbringing in an E", "Following the critical and commercial success of ", ", Alameddine delivers a spectacular portrait of a man and an era of profound political and social upheaval.", "Set over the course of one night in the waiting room of a psych clinic, ", " follows Yemeni-born poet Jacob as he revisits the events of his life, from his maternal upbringing in an Egyptian whorehouse to his adolescence under the aegis of his wealthy father and his life as a gay Arab man in San Francisco at the height of AIDS. Hovered over by the presence of alluring, sassy Satan who taunts Jacob to remember his painful past and dour, frigid Death who urges him to forget and give up on life, Jacob is also attended to by 14 saints. Set in Cairo and Beirut; Sana'a, Stockholm, and San Francisco; Alameddine gives us a charged philosophical portrait of a brilliant mind in crisis. This is a profound, philosophical and hilariously winning story of the war between memory and oblivion we wrestle with every day of our lives."], "author": "Rabih Alameddine", "num_pages": "294", "awards": ["Arab American Book Award for Fiction (2017)", "Lambda Literary Award for Gay Fiction (2017)", "Andrew Carnegie Medal Nominee for Fiction (2017)"], "places": [], "character_names": [], "language": null, "publish_date": "2016-10-04 00:00:00", "ISBN": "080212576X"},
{"url": "https://www.goodreads.com/book/show/18975644-an-unnecessary-woman", "num_ratings": "8,552", "num_reviews": "1,466", "avg_ratings": 3.81, "genres": ["Fiction", "Writing", "Books About Books", "Literary Fiction", "Cultural", "Lebanon", "Contemporary"], "title": "An Unnecessary Woman", "description": ["One of Beirut’s most celebrated voices, Rabih Alameddine follows his international bestseller, The Hakawati, with a heartrending novel that celebrates the singular life of an obsessive introvert, revealing Beirut’s beauties and horrors along the way.", "Aaliya Sohbi lives alone in her Beirut apartment, surrounded by stockpiles of books. Godless, fatherless, divorced, and child", "One of Beirut’s most celebrated voices, Rabih Alameddine follows his international bestseller, The Hakawati, with a heartrending novel that celebrates the singular life of an obsessive introvert, revealing Beirut’s beauties and horrors along the way.", "Aaliya Sohbi lives alone in her Beirut apartment, surrounded by stockpiles of books. Godless, fatherless, divorced, and childless, Aaliya is her family’s \"unnecessary appendage.” Every year, she translates a new favorite book into Arabic, then stows it away. The thirty-seven books that Aaliya has translated have never been read—by anyone. After overhearing her neighbors, \"the three witches,” discussing her too-white hair, Aaliya accidentally dyes her hair too blue.", "In this breathtaking portrait of a reclusive woman’s late-life crisis, readers follow Aaliya’s digressive mind as it ricochets across visions of past and present Beirut. Insightful musings on literature, philosophy, and art are invaded by memories of the Lebanese Civil War and Aaliya’s volatile past. As she tries to overcome her aging body and spontaneous emotional upwellings, Aaliya is faced with an unthinkable disaster that threatens to shatter the little life she has left.", "A love letter to literature and its power to define who we are, the gifted Rabih Alameddine has given us a nuanced rendering of a single woman's reclusive life in the Middle East."], "author": "Rabih Alameddine", "num_pages": "320", "awards": ["California Book Award for Fiction (Gold) (2014)", "Prix Femina for Étranger (2016)", "Arab American Book Award for Fiction (2015)", "PEN Open Book Award Nominee for Shortlist (2015)", "National Book Critics Circle Award Nominee for Fiction (2014)", "National Book Award Finalist for Fiction (2014)"], "places": ["Beirut"], "character_names": [], "language": "English", "publish_date": "2014-02-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/407942.I_The_Divine", "num_ratings": "889", "num_reviews": "119", "avg_ratings": 4.03, "genres": ["Fiction", "Cultural", "Lebanon", "Novels", "Literary Fiction", "Contemporary", "Adult", "United States", "War", "Cultural", "Literature"], "title": "I, The Divine: A Novel in First Chapters", "description": ["Raised in a hybrid family shaped by divorce and remarriage, and by Beirut in wartime, Sarah finds a fragile peace in self-imposed exile in the United States. Her extraordinary dignity is supported by a best friend, a grown-up son, occasional sensual pleasures, and her determination to tell her own story."], "author": "Rabih Alameddine", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-17 00:00:00", "ISBN": "0393323560"},
{"url": "https://www.goodreads.com/book/show/1055996.Koolaids", "num_ratings": "508", "num_reviews": "59", "avg_ratings": 4.07, "genres": ["Fiction", "Lgbt", "Cultural", "Lebanon", "Glbt", "Queer"], "title": "Koolaids: The Art of War", "description": ["Detailing the impact of the AIDS epidemic and the Lebanese civil war in Beirut on a circle of friends and family, \"Koolaids\" tells the stories of characters who can no longer love or think except in fragments of time, each of which goes off along its own trajectory and immediately disappears. Clips, quips, vignettes and hallucinations, tragic news reports and hilarious sho", "Detailing the impact of the AIDS epidemic and the Lebanese civil war in Beirut on a circle of friends and family, \"Koolaids\" tells the stories of characters who can no longer love or think except in fragments of time, each of which goes off along its own trajectory and immediately disappears. Clips, quips, vignettes and hallucinations, tragic news reports and hilarious short plays, conversations with both the quick and the dead, all shine their combined lights to reveal the way we experience life today in this ambitious novel."], "author": "Rabih Alameddine", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-04-15 00:00:00", "ISBN": "0312186932"},
{"url": "https://www.goodreads.com/book/show/6067314-the-night-counter", "num_ratings": "471", "num_reviews": "97", "avg_ratings": 3.72, "genres": ["Fiction", "Fantasy", "Magical Realism", "Historical", "Historical Fiction", "Cultural", "Lebanon"], "title": "The Night Counter", "description": ["After 85 long years, Fatimah Abdullah is dying, and she knows when her time will come. In fact, it should come just nine days from tonight, the 992nd nightly visit of Scheherazade, the beautiful and immortal storyteller from the epic ", ".", "Just as Scheherazade spun magical stories for 1,001 nights to save her own life, Fatima has spent each night telling Scheh", "After 85 long years, Fatimah Abdullah is dying, and she knows when her time will come. In fact, it should come just nine days from tonight, the 992nd nightly visit of Scheherazade, the beautiful and immortal storyteller from the epic ", ".", "Just as Scheherazade spun magical stories for 1,001 nights to save her own life, Fatima has spent each night telling Scheherazade her life stories, all the while knowing that on the 1,001st night, her storytelling will end forever. But between tonight and night 1,001, Fatima has a few loose ends to tie up. She must find a wife for her openly gay grandson, teach Arabic (and birth control) to her 17-year-old great-granddaughter, make amends with her estranged husband, and decide which of her troublesome children should inherit her family's home in Lebanon--a house she herself has not seen in nearly 70 years. All this while under the surveillance of two bumbling FBI agents eager to uncover Al Qaeda in Los Angeles.", "But Fatima’s children are wrapped up in their own chaotic lives and disinterested in their mother or their inheritances. As Fatima weaves the stories of her husband, children, and grandchildren, we meet a visionless psychic, a conflicted U.S. soldier, a gynecologist who has a daughter with a love of shoplifting and a tendency to get unexpectedly pregnant, a Harvard-educated alcoholic cab driver edging towards his fifth marriage, a lovelorn matchmaker, and a Texas homecoming queen. Taken in parts, Fatima’s relations are capricious and steadfast, affectionate and smothering, connected yet terribly alone. Taken all together, they present a striking and surprising tapestry of modern Arab American life.", "Shifting between the U.S. and Lebanon over the last hundred years, Alia Yunis crafts a bewitching novel imbued with great humanity, imagination, and a touch of magic realism. Be prepared to be utterly charmed."], "author": "Alia Yunis", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-07-14 00:00:00", "ISBN": "0307453626"},
{"url": "https://www.goodreads.com/book/show/17335489-let-us-not-live-in-ignorance", "num_ratings": "6", "num_reviews": "2", "avg_ratings": 3.83, "genres": ["Romance"], "title": "Let Us Not Live in Ignorance", "description": ["Set against the backdrop of Lebanon's civil war and spanning three continents, \"Let Us Not Live in Ignorance\" is a story of hope and a story of love -- familial, fraternal, romantic.", "Michael Flanagan and Hector Nordheim have been friends since childhood. Well-educated, well-traveled, and successful, they lack for little. When Michael becomes interested in Milo Khoury, a bea", "Set against the backdrop of Lebanon's civil war and spanning three continents, \"Let Us Not Live in Ignorance\" is a story of hope and a story of love -- familial, fraternal, romantic.", "Michael Flanagan and Hector Nordheim have been friends since childhood. Well-educated, well-traveled, and successful, they lack for little. When Michael becomes interested in Milo Khoury, a beautiful woman from Lebanon, Hector is glad for him despite their cultural differences. But when Hector falls in love with Milo's friend Ibtysam, he finds no support whatsoever, not even from Ibtysam herself.", "When should we listen to the wisdom of others and when should we follow our hearts?"], "author": "Anastasia Abboud", "num_pages": "253", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/149569.Arabian_Jazz", "num_ratings": "485", "num_reviews": "53", "avg_ratings": 3.4, "genres": ["Fiction", "Contemporary", "Literature", "Novels", "Cultural"], "title": "Arabian Jazz", "description": ["In Diana Abu-Jaber's \"impressive, entertaining\" (", ") first novel, a small, poor-white community in upstate New York becomes home to the transplanted Jordanian family of Matussem Ramoud: his grown daughters, Jemorah and Melvina; his sister Fatima; and her husband, Zaeed. The widower Matuseem loves American jazz, kitschy lawn ornaments, and, of course, his daugh", "In Diana Abu-Jaber's \"impressive, entertaining\" (", ") first novel, a small, poor-white community in upstate New York becomes home to the transplanted Jordanian family of Matussem Ramoud: his grown daughters, Jemorah and Melvina; his sister Fatima; and her husband, Zaeed. The widower Matuseem loves American jazz, kitschy lawn ornaments, and, of course, his daughters. Fatima is obsessed with seeing her nieces married—Jemorah is nearly thirty! Supernurse Melvina is firmly committed to her work, but Jemorah is ambivalent about her identity and role. Is she Arab? Is she American? Should she marry and, if so, whom? Winner of the Oregon Book Award and finalist for the National PEN/Hemingway Award, ", " is \"a joy to read.... You will be tempted to read passages out loud. And you should\" (", "). ", " praises Abu-Jaber's \"gift for dialogue...her Arab-American rings musically, and hilariously, true.\""], "author": "Diana Abu-Jaber", "num_pages": "384", "awards": ["Oregon Book Award for Fiction (1994)"], "places": ["Syracuse, New York"], "character_names": [], "language": "English", "publish_date": "2003-04-17 00:00:00", "ISBN": "0393324222"},
{"url": "https://www.goodreads.com/book/show/3195325-a-map-of-home", "num_ratings": "1,159", "num_reviews": "201", "avg_ratings": 3.68, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Lgbt", "Glbt", "Queer"], "title": "A Map of Home", "description": ["Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where s", "Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where she and her family fled the 1990 Iraqi invasion), and her family’s last flight to Texas. Nidali mixes humor with a sharp, loving portrait of an eccentric middle-class family, and this perspective keeps her buoyant through the hardships she encounters: the humiliation of going through a checkpoint on a visit to her father’s home in the West Bank; the fights with her father, who wants her to become a famous professor and stay away from boys; the end of her childhood as Iraq invades Kuwait on her thirteenth birthday; and the scare she gives her family when she runs away from home. ", "Funny, charming, and heartbreaking, A Map of Home is the kind of book Tristram Shandy or Huck Finn would have narrated had they been born Egyptian-Palestinian and female in the 1970s."], "author": "Randa Jarrar", "num_pages": "304", "awards": ["Hopwood Award", "Arab American Book Award for Fiction (2009)", "Million Writers Award", "Geoffrey James Gosling Prize"], "places": ["Kuwait"], "character_names": [], "language": "English", "publish_date": "2008-09-02 00:00:00", "ISBN": "1590512723"},
{"url": "https://www.goodreads.com/book/show/89754.The_Girl_in_the_Tangerine_Scarf", "num_ratings": "1,187", "num_reviews": "204", "avg_ratings": 3.72, "genres": ["Fiction", "Religion", "Religion", "Islam", "Islam", "Muslims"], "title": "The Girl in the Tangerine Scarf", "description": ["Syrian immigrant Khadra Shamy is growing up in a devout, tightly knit Muslim family in 1970s Indiana, at the crossroads of bad polyester and Islamic dress codes. Along with her brother Eyad and her African-American friends, Hakim and Hanifa, she bikes the Indianapolis streets exploring the fault-lines between “Muslim” and “American.”", "When her picture-perfect marriage goes s", "Syrian immigrant Khadra Shamy is growing up in a devout, tightly knit Muslim family in 1970s Indiana, at the crossroads of bad polyester and Islamic dress codes. Along with her brother Eyad and her African-American friends, Hakim and Hanifa, she bikes the Indianapolis streets exploring the fault-lines between “Muslim” and “American.”", "When her picture-perfect marriage goes sour, Khadra flees to Syria and learns how to pray again. On returning to America she works in an eastern state — taking care to stay away from Indiana, where the murder of her friend Tayiba’s sister by Klan violence years before still haunts her. But when her job sends her to cover a national Islamic conference in Indianapolis, she’s back on familiar ground: Attending a concert by her brother’s interfaith band The Clash of Civilizations, dodging questions from the “aunties” and “uncles,” and running into the recently divorced Hakim everywhere.", "Beautifully written and featuring an exuberant cast of characters, ", " charts the spiritual and social landscape of Muslims in middle America, from five daily prayers to the Indy 500 car race. It is a riveting debut from an important new voice."], "author": "Mohja Kahf", "num_pages": "448", "awards": [], "places": ["Indiana", "Damascus"], "character_names": [], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "0786715197"},
{"url": "https://www.goodreads.com/book/show/31212936-where-jasmine-blooms", "num_ratings": "295", "num_reviews": "46", "avg_ratings": 3.96, "genres": ["Fiction", "Contemporary", "The United States Of America"], "title": "Where Jasmine Blooms", "description": ["American-born Margaret Mansour wants nothing more than to rekindle the struggling twenty-year marriage to her Palestinian husband, Ahmed—but not if it means uprooting their home and children in America and moving", "American-born Margaret Mansour wants nothing more than to rekindle the struggling twenty-year marriage to her Palestinian husband, Ahmed—but not if it means uprooting their home and children in America and moving halfway across the world.", "Young and ambitious Alison Mansour has a degree in Near East Studies, but her American education and Syrian background are of no use when her new marriage begins to crumble under the weight of cultural and religious differences. The communication between Alison and her husband is already shaky; how will they cope with the arrival of their first child?", "Zainab Mansour, the matriarch of her family, never expected to live in America, but after the death of her husband she finds herself lost in a faithless country and lonely within the walls of her eldest son’s home. She wants what’s best for her children but struggles to find her place in a new landscape.", "Emerging from the interwoven perspectives of these three women comes a story of love and longing, culture and compromise, home and homeland. Exploring the complex political backdrop of the Middle East from a personal perspective, ", " travels from the suburbs of Seattle to the villas of Jordan and the refugee camps of the West Bank, on an emotional journey exploring what it means to be a family."], "author": "Holly S. Warah", "num_pages": "392", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-04-18 00:00:00", "ISBN": "1628727497"}
]