[
{"url": "https://www.goodreads.com/book/show/18485370-real-life-lesson-from-quran", "num_ratings": "183", "num_reviews": "5", "avg_ratings": 4.43, "genres": ["Religion", "Islam", "Religion"], "title": "Real Life Lesson From Quran", "description": ["This book provides over a hundred lessons for life derived from the Qur’an for the 21st century Muslim. It will have succeeded in its effort if this book helps Muslims understand their religion better so that they become better Muslims. The lessons in this book are meant to be powerful words of advice to Muslims who find themselves at a certain situation in their lives, th", "This book provides over a hundred lessons for life derived from the Qur’an for the 21st century Muslim. It will have succeeded in its effort if this book helps Muslims understand their religion better so that they become better Muslims. The lessons in this book are meant to be powerful words of advice to Muslims who find themselves at a certain situation in their lives, the direct words of advice from Allah are quoted by quoting the Qur’an, and provide with an interpretation and an explanation to make it easier for the modern day Muslim to understand and use this advice practically."], "author": "Muhammad Bilal Lakhani", "num_pages": "110", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4906099-a-thousand-splendid-suns", "num_ratings": "950,043", "num_reviews": "46,564", "avg_ratings": 4.35, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "A Thousand Splendid Suns", "description": ["After 103 weeks on the ", " bestseller list and with four million copies of ", " shipped, Khaled Hosseini returns with a beautiful, riveting, and haunting novel that confirms his place as one of the most important literary writers today. ", " Propelled by the same superb instinct for storytelling that made ", " a beloved classic, ", "After 103 weeks on the ", " bestseller list and with four million copies of ", " shipped, Khaled Hosseini returns with a beautiful, riveting, and haunting novel that confirms his place as one of the most important literary writers today. ", " Propelled by the same superb instinct for storytelling that made ", " a beloved classic, ", " is at once an incredible chronicle of thirty years of Afghan history and a deeply moving story of family, friendship, faith, and the salvation to be found in love. ", " Born a generation apart and with very different ideas about love and family, Mariam and Laila are two women brought jarringly together by war, by loss and by fate. As they endure the ever escalating dangers around them-in their home as well as in the streets of Kabul-they come to form a bond that makes them both sisters and mother-daughter to each other, and that will ultimately alter the course not just of their own lives but of the next generation. With heart-wrenching power and suspense, Hosseini shows how a woman's love for her family can move her to shocking and heroic acts of self-sacrifice, and that in the end it is love, or even the memory of love, that is often the key to survival.", " A stunning accomplishment, ", " is a haunting, heartbreaking, compelling story of an unforgiving time, an unlikely friendship, and an indestructible love."], "author": "Khaled Hosseini", "num_pages": "379", "awards": ["British Book Award for Best Read of the Year (2008)", "Book Sense Book of the Year Award for Adult Fiction (2008)", "California Book Award for Fiction (Silver) (2007)", "Exclusive Books Boeke Prize Nominee (2007)", "Lincoln Award Nominee (2011)"], "places": ["Afghanistan", "Kabul", "Herat"], "character_names": ["Laila", "Mariam", "Rasheed", "Tariq"], "language": "English", "publish_date": "2008-11-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2678349", "num_ratings": "12,399", "num_reviews": "1,136", "avg_ratings": 4.19, "genres": ["Religion", "Religion", "Islam"], "title": "استمتع بحياتك", "description": ["فنون التعامل مع الناس في ظل السيرة النبوية", "حصيلة بحوث و دورات و ذكريات أكثر من عشرين سنة", "لمحة عن الكتاب : ابتسم .. ابتسم .. ابتسم أعرفه منذ سنين .. فهو أحد زملائي في عملي .. على كل حال .. لكن هل تصدق أنني إلى الآن لا أدري هل نبتت له أسنان أم لا !! دائم التجهم .. والعبوس .. وكأنه إذا ابتسم نقص عمره .. أو قلَّ ماله !! قال جرير بن عبد الله البجلي : ما رآني رسول الله صلى الله عل", "فنون التعامل مع الناس في ظل السيرة النبوية", "حصيلة بحوث و دورات و ذكريات أكثر من عشرين سنة", "لمحة عن الكتاب : ابتسم .. ابتسم .. ابتسم أعرفه منذ سنين .. فهو أحد زملائي في عملي .. على كل حال .. لكن هل تصدق أنني إلى الآن لا أدري هل نبتت له أسنان أم لا !! دائم التجهم .. والعبوس .. وكأنه إذا ابتسم نقص عمره .. أو قلَّ ماله !! قال جرير بن عبد الله البجلي : ما رآني رسول الله صلى الله عليه و سلم إلا تبسم في وجهي .. الابتسامة أنواع .. ومراتب .. فمنها البشاشة الدائمة .. أن يكون وجهك صبوحاً مبتهجاً دائماً .. فلو كنت مدرساً ودخلت الفصل على طلابك .. فالقهم بوجه بشوش .. ركبت طائرة .. ومشيت في الممر والناس ينظرون إليك .. كن بشوشاً .. دخلت بقالة .. أو محطة وقود .. مددت له الحساب .. ابتسم .. في المجلس .. ودخل شخص وسلم بصوت عال .. ومر بنظره على الجالسين .. ابتسم .. دخلت على مجموعة .. وصافحتهم .. ابتسم .. الابتسامة لها من التأثير الكبير في امتصاص الغضب والشك والتردد .. ما لا يشاركها غيرها .. البطل هو الذي يستطيع التغلب على عواطفه .. والتبسم .. كان أنس بن مالك يمشي مع النبي عليه السلام يوماً.. والنبي عليه بُرد نجراني غليظ الحاشية .. فلحقهما أعرابي .. أقبل هذا الأعرابي يجري وراء النبي يريد أن يلحق به .. حتى إذا اقترب منه .. جبذه بردائه جبذة شديدة .. فتحرك الرداء بعنف على رقبة النبي عليه السلام .. قال أنس : حتى نظرت إلى صفحة عاتق رسول الله .. قد أثرت بها حاشية البُرد من شدة جبذته .. فماذا يريد هذا الرجل ؟! لعل بيته يحترق وأقبل يريد معونة .. أو أحاطت بهم غارة من المشركين .. اسمع ماذا يريد .. قال : يا محمد .. ( لاحظ لم يقل : يا رسول الله ) .. قال : يا محمد .. مُر لي من مال الله الذي عندك .. فالتفت رسول الله .. ثم ضحك .. ثم أمر له بعطاء .. نعم .. كان بطلاً لا تستفزه مثل هذه التصرفات .. ولا يعاقب أو تثور أعصابه على التافهات .. كان واسع البطان .. قوياً يضبط أعصابه .. دائم الابتسامة حتى في أحلك الظروف .. يفكر في عواقب الأمور قبل أن يفعلها .. وماذا يفيد لو أنه صرخ بالرجل أو طرده ‍‍! هل سيشفى جرح عنقه ! أو يصلح أدب الرجل ! كلا .. إذن ليس مثل الصبر والتحمل .. نعم بعض الأمور نثور لها ونغضب .. وعلاجها شيء آخر تماماً .."], "author": "محمد عبد الرحمن العريفي", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6295209-love-in-a-headscarf", "num_ratings": "1,695", "num_reviews": "258", "avg_ratings": 3.68, "genres": ["Nonfiction", "Autobiography", "Memoir", "Religion", "Islam", "Religion", "Biography", "Romance"], "title": "Love in a Headscarf", "description": ["Shelina is keeping a very surprising secret under her headscarf - she wants to fall in love and find her faith. Torn between the Buxom A", "Shelina is keeping a very surprising secret under her headscarf - she wants to fall in love and find her faith. Torn between the Buxom Aunties, romantic comedies and mosque Imams, she decides to follow the arranged-marriage route to finding Mr Right, Muslim-style. Shelina's captivating journey begins as a search for the one, but along the way she also discovers herself and her faith."], "author": "Shelina Zahra Janmohamed", "num_pages": "267", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "1845134281"},
{"url": "https://www.goodreads.com/book/show/19228096-be-patient-and-paradise-will-be-yours", "num_ratings": "96", "num_reviews": "2", "avg_ratings": 4.54, "genres": ["Religion", "Islam"], "title": "Be Patient and Paradise Will Be Yours", "description": ["After Eemaan (faith), the most honorable trail with which man could be endowed is patience. It is the best course of action in all situations. It is a cause for Allah’s mercy and help. It is a source of spiritual joy. The final victory in both matters of the world and Hereafter is only earned by patience and the good end belongs only to the patient ones. Our trials in this", "After Eemaan (faith), the most honorable trail with which man could be endowed is patience. It is the best course of action in all situations. It is a cause for Allah’s mercy and help. It is a source of spiritual joy. The final victory in both matters of the world and Hereafter is only earned by patience and the good end belongs only to the patient ones. Our trials in this world are numerous and varied. Sometime, they comes as difficulties and some other times in forms of ease. Situations that life turns on us sometimes could stretch our will and faith to the extreame. In all situations, patience and eemaan remain our most valued companions for the Prophet (Peace be upon him) said:", "“Whoever remains patient, Allah will make him patient. Nobody can be given a blessing better and greater than patient.”(Bukhari)", "This book is a discussion of patience and how to develop that trait so that we might be a recipient of one of Allah’s greatest blessings"], "author": "Darussalam", "num_pages": "63", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18493701-strategies-of-prophet-muhammad", "num_ratings": "113", "num_reviews": "3", "avg_ratings": 4.5, "genres": ["Religion", "Islam", "Religion", "Islam", "Muslims", "Poetry"], "title": "Strategies of Prophet Muhammad", "description": ["Muhammad’s (Peace Be Upon Him) life is a rewarding subject for any sophisticated, intelligent and curious mind because of the impact he has had on world history. Not only did he change the world-view of a society, he practically moulded a nation out of a disparate group of warring tribes such that today, after 1400 years, more than 1.6 billion Muslims now live all over the", "Muhammad’s (Peace Be Upon Him) life is a rewarding subject for any sophisticated, intelligent and curious mind because of the impact he has had on world history. Not only did he change the world-view of a society, he practically moulded a nation out of a disparate group of warring tribes such that today, after 1400 years, more than 1.6 billion Muslims now live all over the world and try to follow in his foot-steps in their daily routines. Many demographers calculate that Islam will become’s the world’s largest religion by 2050. This amazing growth trajectory owes a great deal to the strategies pursued by him."], "author": "Omar Khayyám", "num_pages": "556", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6240926-destiny-disrupted", "num_ratings": "5,569", "num_reviews": "710", "avg_ratings": 4.36, "genres": ["Religion", "History", "Nonfiction", "Religion", "Islam", "History", "World History"], "title": "Destiny Disrupted: A History of the World Through Islamic Eyes", "description": ["We in the west share a common narrative of world history. But our story largely omits a whole civilization whose citizens shared an entirely different narrative for a thousand years.In ", ", Tamim Ansary tells the rich story of world history as the Islamic world saw it, from the time of Mohammed to the fall of the Ottoman Empire and beyond. He clarifies why ou", "We in the west share a common narrative of world history. But our story largely omits a whole civilization whose citizens shared an entirely different narrative for a thousand years.In ", ", Tamim Ansary tells the rich story of world history as the Islamic world saw it, from the time of Mohammed to the fall of the Ottoman Empire and beyond. He clarifies why our civilizations grew up oblivious to each other, what happened when they intersected, and how the Islamic world was affected by its slow recognition that Europe—a place it long perceived as primitive and disorganized—had somehow hijacked destiny."], "author": "Tamim Ansary", "num_pages": "392", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "1433272261"},
{"url": "https://www.goodreads.com/book/show/18513814-don-t-become-angry", "num_ratings": "92", "num_reviews": "2", "avg_ratings": 4.47, "genres": ["Religion", "Islam", "Religion"], "title": "Don't Become Angry", "description": ["Much of the flaws that afflict the individual and the community stem from the singular defect of Anger. Allah (Glorified and Exalted is He). and His Messenger (Peace be upon him) have given us instructions regarding the malady and advised us to keep it in check. This work is an extensive discussion on these instructions. We hope that this concise work will aid the one who", "Much of the flaws that afflict the individual and the community stem from the singular defect of Anger. Allah (Glorified and Exalted is He). and His Messenger (Peace be upon him) have given us instructions regarding the malady and advised us to keep it in check. This work is an extensive discussion on these instructions. We hope that this concise work will aid the one who is afflicted with this flaw to find cure in, Insha Allah; while the one who is free of it will find enough incentives to keep his emotions under control."], "author": "Darussalam", "num_pages": "51", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7620761-the-butterfly-mosque", "num_ratings": "3,693", "num_reviews": "454", "avg_ratings": 4.06, "genres": ["Autobiography", "Memoir", "Nonfiction", "Religion", "Religion", "Islam"], "title": "The Butterfly Mosque: A Young American Woman's Journey to Love and Islam", "description": ["The extraordinary story of an all-American girl’s conversion to Islam and her ensuing romance with a young Egyptian man, ", " is a stunning articulation of a Westerner embracing the Muslim world.", "When G. Willow Wilson—already an accomplished writer on modern religion and the Middle East at just twenty-seven—leaves her atheist parents in Denver to study at Bo", "The extraordinary story of an all-American girl’s conversion to Islam and her ensuing romance with a young Egyptian man, ", " is a stunning articulation of a Westerner embracing the Muslim world.", "When G. Willow Wilson—already an accomplished writer on modern religion and the Middle East at just twenty-seven—leaves her atheist parents in Denver to study at Boston University, she enrolls in an Islamic Studies course that leads to her shocking conversion to Islam and sends her on a fated journey across continents and into an uncertain future.", "She settles in Cairo where she teaches English and submerges herself in a culture based on her adopted religion. And then she meets Omar, a passionate young man with a mild resentment of the Western influences in his homeland. They fall in love, entering into a daring relationship that calls into question the very nature of family, belief, and tradition. Torn between the secular West and Muslim East, Willow records her intensely personal struggle to forge a “third culture” that might accommodate her own values without compromising the friends and family on both sides of the divide."], "author": "G. Willow Wilson", "num_pages": "304", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "2010-06-01 00:00:00", "ISBN": "0802118879"},
{"url": "https://www.goodreads.com/book/show/25307.No_god_but_God", "num_ratings": "18,915", "num_reviews": "1,302", "avg_ratings": 4.13, "genres": ["Religion", "Nonfiction", "History", "Religion", "Islam", "Politics"], "title": "No god but God: The Origins, Evolution and Future of Islam", "description": ["In ", "internationally acclaimed scholar Reza Aslan explains Islam—the origins and evolution of the faith—in all its beauty and complexity", "This updated edition addresses the events of", "In ", "internationally acclaimed scholar Reza Aslan explains Islam—the origins and evolution of the faith—in all its beauty and complexity", "This updated edition addresses the events of the past decade, analyzing how they have influenced Islam’s position in modern culture. Aslan explores what the popular demonstrations pushing for democracy in the Middle East mean for the future of Islam in the region, how the Internet and social media have affected Islam’s evolution, and how the war on terror has altered the geopolitical balance of power in the Middle East. He also provides an update on the contemporary Muslim women’s movement, a discussion of the controversy over veiling in Europe, an in-depth history of Jihadism, and a look at how Muslims living in North America and Europe are changing the face of Islam. Timely and persuasive, ", " is an elegantly written account that explains this magnificent yet misunderstood faith."], "author": "Reza Aslan", "num_pages": "310", "awards": ["Guardian First Book Award Nominee (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-10 00:00:00", "ISBN": "0812971892"},
{"url": "https://www.goodreads.com/book/show/7457439-the-art-of-islamic-banking-and-finance", "num_ratings": "11", "num_reviews": "2", "avg_ratings": 3.55, "genres": ["Economics", "Finance"], "title": "The Art of Islamic Banking and Finance: Tools and Techniques for Community-Based Banking", "description": ["A detailed look at the fast-growing field of Islamic banking and finance", " is a modern American take on what it means to incorporate Islamic finance principles into everyday banking and investment techniques by introducing a new brand of banking for all people of all faiths: The Riba-Free (RF) banking.", "The author is considered the father", "A detailed look at the fast-growing field of Islamic banking and finance", " is a modern American take on what it means to incorporate Islamic finance principles into everyday banking and investment techniques by introducing a new brand of banking for all people of all faiths: The Riba-Free (RF) banking.", "The author is considered the father of RF (Islamic) banking in America. He has been a banker and an Imam/scholar for over 40 years in America since 1968. He started the tedious process with a finance company, LARIBA, in Pasadena, California in 1987. This is the first book ever in the field to trace the origins of prohibiting the renting of money at a price called interest rate and over-indulging in debt. The book reviews in great details the theological foundations of prohibiting interest in the Jewish Bible, the Christian Bible, and the Qur'aan. The author then discusses money and how fiat money is created, the role of the Federal Reserve, and the banking system in America. The book also discusses for the first time ever how to include an important aspect of RF (Islamic) finance using commodity indexation and marking the items to be financed to market in order to avoid participating in economic \"bubbles.\" The author discusses how these rules work, how they affect consumer behavior, and how they change the role of the banker/financier.", "Covers a new pioneering model that is based on the Law (", ") and how it is applied in every transaction from joint ventures and portfolio management to home mortgages and personal financing Shows how to incorporate the Law (", ") into American financing and banking systems Points to RF (Islamic) finance and banking as a way to emphasize socially responsible investing ", " also includes a discussion on the emergence of a culture of RF (Islamic) banking and finance today, which is based on the real ", " spirit and very effective when compared to twentieth-century models that use financial engineering and structuring techniques to circumvent the Law (", "). The book also includes case studies based on the actual experience of the author and detailed analysis of the superior results realized by applying this new brand of banking to financing."], "author": "Yahia Abdul-Rahman", "num_pages": "396", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-07 00:00:00", "ISBN": "0470449934"},
{"url": "https://www.goodreads.com/book/show/3070131-the-muslim-next-door", "num_ratings": "409", "num_reviews": "69", "avg_ratings": 3.68, "genres": ["Religion", "Nonfiction", "Religion", "Islam", "History"], "title": "The Muslim Next Door: The Qurʼan, the Media, and That Veil Thing", "description": ["- Bronze Medal Winner of the Independent Publishers Award 2009 -", "Since 9/11, stories about Muslims and the Islamic world have flooded headlines, politics, and water-cooler conversations all across the country. And, although Americans hear about Islam on a daily basis, there remains no clear explanation of Islam or its people. ", " offers easy-to-understand y", "- Bronze Medal Winner of the Independent Publishers Award 2009 -", "Since 9/11, stories about Muslims and the Islamic world have flooded headlines, politics, and water-cooler conversations all across the country. And, although Americans hear about Islam on a daily basis, there remains no clear explanation of Islam or its people. ", " offers easy-to-understand yet academically sound answers to these questions while also dispelling commonly held misconceptions. Written from the point of view of an American Muslim, the book addresses what readers in the Western world are most curious about, beginning with the basics of Islam and how Muslims practice their religion before easing into more complicated issues like jihad, Islamic fundamentalism, and the status of women in Islam. Author Sumbul Ali-Karamali’s vivid anecdotes about growing up Muslim and female in the West, along with her sensitive, scholarly overview of Islam, combine for a uniquely insightful look at the world’s fastest growing religion."], "author": "Sumbul Ali-Karamali", "num_pages": "287", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "0974524565"},
{"url": "https://www.goodreads.com/book/show/144953.Black_Pilgrimage_to_Islam", "num_ratings": "17", "num_reviews": "5", "avg_ratings": 3.71, "genres": ["Religion", "Islam", "History", "Religion"], "title": "Black Pilgrimage to Islam", "description": ["This book offers a comprehensive ethnographic study of African-American Muslims. Drawing on hundreds of interviews conducted over a period of several years, Dannin provides an unprecedented look inside the fascinating and little understood world of black Muslims. He discovers that the well-known and cult-like Nation of Islam represents only a small part of the picture. Man", "This book offers a comprehensive ethnographic study of African-American Muslims. Drawing on hundreds of interviews conducted over a period of several years, Dannin provides an unprecedented look inside the fascinating and little understood world of black Muslims. He discovers that the well-known and cult-like Nation of Islam represents only a small part of the picture. Many more African-Americans are drawn to Islamic orthodoxy, with its strict adherence to the Qur'an. Dannin takes us to the First Cleveland Mosque, the oldest continuing Muslim institution in America, on to a permament Muslim village in Buffalo, and then inside New York's maximum-security prisons to hear testimony of the powerful attraction of Islam for individuals in desperate situations. He looks at the aftermath of the assassination of Malcolm X, and the ongoing warfare between the Nation of Islam and orthodox Muslims. Accessibly written, filled with gripping first-hand testimony, and featuring superb illustrations by photographer Jolie Stahl, this book will be the best available guide to the beliefs and culture of African-American Muslims."], "author": "Robert Dannin", "num_pages": "328", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-01 00:00:00", "ISBN": "0195300246"},
{"url": "https://www.goodreads.com/book/show/5953801-besa", "num_ratings": "19", "num_reviews": "4", "avg_ratings": 4.47, "genres": ["History", "World War II", "Holocaust", "Nonfiction", "Religion", "Islam"], "title": "Besa: Muslims Who Saved Jews in World War II", "description": ["This book reveals a hidden period in history, slowly emerging after the fall of an isolationist communist regime. It shows the compassionate side of ordinary people in saving Jews. They acted within their true Muslim faith."], "author": "Norman H. Gershman", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-11-01 00:00:00", "ISBN": "0815609345"},
{"url": "https://www.goodreads.com/book/show/248483.Austenland", "num_ratings": "75,132", "num_reviews": "10,647", "avg_ratings": 3.54, "genres": ["Romance", "Fiction", "Womens Fiction", "Chick Lit", "Contemporary", "Adult", "Adult Fiction"], "title": "Austenland", "description": ["Jane Hayes is a seemingly normal young New Yorker, but she has a secret. Her obsession with Mr. Darcy, as played by Colin Firth in the BBC adaptation of ", ", is ruining her love life: no real man can compare. But when a wealthy relative bequeaths her a trip to an English resort catering to Austen-crazed women, Jane's fantasies of meeting the perfect Regency", "Jane Hayes is a seemingly normal young New Yorker, but she has a secret. Her obsession with Mr. Darcy, as played by Colin Firth in the BBC adaptation of ", ", is ruining her love life: no real man can compare. But when a wealthy relative bequeaths her a trip to an English resort catering to Austen-crazed women, Jane's fantasies of meeting the perfect Regency-era gentleman suddenly become realer than she ever could have imagined.", "Decked out in empire-waist gowns, Jane struggles to master Regency etiquette and flirts with gardeners and gentlemen;or maybe even, she suspects, with the actors who are playing them. It's all a game, Jane knows. And yet the longer she stays, the more her insecurities seem to fall away, and the more she wonders: Is she about to kick the Austen obsession for good, or could all her dreams actually culminate in a Mr. Darcy of her own?"], "author": "Shannon Hale", "num_pages": "197", "awards": [], "places": ["United Kingdom", "New York City, New York"], "character_names": ["Jane Hayes", "Great-Aunt Carolyn"], "language": "English", "publish_date": "2007-05-29 00:00:00", "ISBN": "1596912855"},
{"url": "https://www.goodreads.com/book/show/292846.The_Ornament_of_the_World", "num_ratings": "1,676", "num_reviews": "227", "avg_ratings": 3.9, "genres": ["History", "Nonfiction", "Religion", "Cultural", "Spain", "Religion", "Islam", "Historical", "Medieval"], "title": "The Ornament of the World: How Muslims, Jews, and Christians Created a Culture of Tolerance in Medieval Spain", "description": ["Undoing the familiar notion of the Middle Ages as a period of religious persecution and intellectual stagnation, María Menocal now brings us a portrait of a medieval culture where literature, science, and tolerance flourished for 500 years.The story begins as a young prince in exilethe last heir to an Islamic dynastyfounds a new kingdom on the Iberian peninsula: al-Andalus", "Undoing the familiar notion of the Middle Ages as a period of religious persecution and intellectual stagnation, María Menocal now brings us a portrait of a medieval culture where literature, science, and tolerance flourished for 500 years.The story begins as a young prince in exile\u0097the last heir to an Islamic dynasty\u0097founds a new kingdom on the Iberian peninsula: al-Andalus. Combining the best of what Muslim, Jewish, and Christian cultures had to offer, al-Andalus and its successors influenced the rest of Europe in dramatic ways, from the death of liturgical Latin and the spread of secular poetry, to remarkable feats in architecture, science, and technology. The glory of the Andalusian kingdoms endured until the Renaissance, when Christian monarchs forcibly converted, executed, or expelled non-Catholics from Spain. In this wonderful book, we can finally explore the lost history whose legacy is still with us in countless ways. "], "author": "María Rosa Menocal", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-04-02 00:00:00", "ISBN": "0316168718"},
{"url": "https://www.goodreads.com/book/show/9777266-god-almighty-speaks-to-you", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "God Almighty Speaks to You", "author": "Mahmoud Abdullah Taiba", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "1590080513"},
{"url": "https://www.goodreads.com/book/show/301922.Islam_and_the_Blackamerican", "num_ratings": "176", "num_reviews": "17", "avg_ratings": 4.34, "genres": ["Religion", "Islam", "Religion", "History", "Nonfiction", "Culture", "Cultural Studies"], "title": "Islam and the Blackamerican: Looking Toward the Third Resurrection", "description": ["Sherman Jackson offers a trenchant examination of the career of Islam among the blacks of America. Jackson notes that no one has offered a convincing explanation of why Islam spread among Blackamericans (a coinage he explains and defends) but not among white Americans or Hispanics. The assumption has been that there is an African connection. In fact, Jackson shows, none of", "Sherman Jackson offers a trenchant examination of the career of Islam among the blacks of America. Jackson notes that no one has offered a convincing explanation of why Islam spread among Blackamericans (a coinage he explains and defends) but not among white Americans or Hispanics. The assumption has been that there is an African connection. In fact, Jackson shows, none of the distinctive features of African Islam appear in the proto-Islamic, black nationalist movements of the early 20th century. Instead, he argues, Islam owes its momentum to the distinctively American phenomenon of \"Black Religion,\" a God-centered holy protest against anti-black racism.", "Islam in Black America begins as part of a communal search for tools with which to combat racism and redefine American blackness. The 1965 repeal of the National Origins Quota System led to a massive influx of foreign Muslims, who soon greatly outnumbered the blacks whom they found here practicing an indigenous form of Islam. Immigrant Muslims would come to exercise a virtual monopoly over the definition of a properly constituted Islamic life in America. For these Muslims, the nemesis was not white supremacy, but \"the West.\" In their eyes, the West was not a racial, but a religious and civilizational threat. American blacks soon learned that opposition to the West and opposition to white supremacy were not synonymous. Indeed, says Jackson, one cannot be anti-Western without also being on some level anti-Blackamerican. Like the Black Christians of an earlier era struggling to find their voice in the context of Western Christianity, Black Muslims now began to strive to find their black, American voice in the context of the super-tradition of historical Islam. Jackson argues that Muslim tradition itself contains the resources to reconcile blackness, American-ness, and adherence to Islam. It is essential, he contends, to preserve within Islam the legitimate aspects of Black Religion, in order to avoid what Stephen Carter calls the domestication of religion, whereby religion is rendered incapable of resisting the state and the dominant culture. At the same time, Jackson says, it is essential for Blackamerican Muslims to reject an exclusive focus on the public square and the secular goal of subverting white supremacy (and Arab/immigrant supremacy) and to develop a tradition of personal piety and spirituality attuned to distinctive Blackamerican needs and idiosyncrasies."], "author": "Sherman A. Jackson", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-01 00:00:00", "ISBN": "019518081X"},
{"url": "https://www.goodreads.com/book/show/744950.What_Do_Muslims_Believe_", "num_ratings": "99", "num_reviews": "24", "avg_ratings": 3.48, "genres": ["Religion", "Nonfiction", "Religion", "Islam", "Reference"], "title": "What Do Muslims Believe?: The Roots and Realities of Modern Islam", "description": ["Perfect for adolescents and teens who are beginning to ask the big questions about life, religion, and current events, What Do Jews Believe? and What Do Muslims Believe? are the first a new series exploring the history and practices of world religions, their influences on current events and conflicts, as well as discussions on where these religions are headed. Both include", "Perfect for adolescents and teens who are beginning to ask the big questions about life, religion, and current events, What Do Jews Believe? and What Do Muslims Believe? are the first a new series exploring the history and practices of world religions, their influences on current events and conflicts, as well as discussions on where these religions are headed. Both include a chronology of the religion's history through today, a glossary of terms, and recommended further reading lists."], "author": "Ziauddin Sardar", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-13 00:00:00", "ISBN": "0802716423"},
{"url": "https://www.goodreads.com/book/show/18715719-umar-bin-abdul-aziz", "num_ratings": "41", "num_reviews": "1", "avg_ratings": 4.68, "genres": ["Religion", "Islam", "Biography", "History", "Religion"], "title": "Umar Bin Abdul Aziz", "description": ["This book describes, among other things, the principles based upon which 'Umar ibn Abd Al-Aziz governed the Muslims during his caliphate: among those principles were mutual consultation, justice, equality among people, and honoring of freedoms. ", "With the turn of every page, the reader will come to appreciate the fact that 'Umar was exceptional in his Faith, distinguished in", "This book describes, among other things, the principles based upon which 'Umar ibn Abd Al-Aziz governed the Muslims during his caliphate: among those principles were mutual consultation, justice, equality among people, and honoring of freedoms. ", "With the turn of every page, the reader will come to appreciate the fact that 'Umar was exceptional in his Faith, distinguished in his knowledge, profoundly wise in his thinking, remarkable in his eloquence, noble in his manners and great in the contribution he made to this Nation. ", "English readers have long been deprived of the life story of this outstanding Islamic hero and exemplar. While there are some short and scattered accounts about his general life, this is the first book to deal specifically with 'Umar bin 'Abd al-Aziz's reforms, which is surprising given that he has been attributed the title of Mujaddid (Reformer; Reviver) within Islamic scholarship, in great detail."], "author": "Darussalam", "num_pages": "483", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6888809-the-qur-anic-narrative", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 1.0, "genres": [], "title": "The Qur'anic Narrative: The Journey of Life as Told in the Qur'an", "description": ["Recent arguments surrounding the meaning and message of the Qur'an often focus on whether or not it supports or exhorts violence. Such arguments, though, tend to ignore the fact that the scriptures found there speak to various aspects of life and living. The Qur'anic Narrative attempts to show that the Qur'an has an inspiring message that aims to enlighten the path of thos", "Recent arguments surrounding the meaning and message of the Qur'an often focus on whether or not it supports or exhorts violence. Such arguments, though, tend to ignore the fact that the scriptures found there speak to various aspects of life and living. The Qur'anic Narrative attempts to show that the Qur'an has an inspiring message that aims to enlighten the path of those who embrace it and guides them through the journey of life. Exploring various themes related to everyday experiences, Safi reveals the meaning of the Qur'an with regard to issues of spirit, faith, charity, patience, fasting, salvation, pride, charity, moral discipline, and other relevant topics.", "In an attempt to recapture the Islamic spirit promoted in the Qur'an, this book offers an approach that speaks to areas of life many people are concerned about. It pastes together a narrative that is more consistent and more representative of the overall Qur'anic message, which, the author contends, is ultimately one of peace and hope. Safi places the Qur'an in context, too, by examining its meaning to early recipients of the scriptures and its place in that particular social and historical context. He continues by updating that meaning for modern readers and adherents, relating the intended meaning to an evolving human audience and to contemporary experiences. The author contends that extremist readings are misinterpretations and that those who may view the Qur'an as a holy text that encourages, even demands, violence are incorrect. Ultimately, readers will come away from this work with a broader appreciation of the Qur'an and its intended meaning and message."], "author": "Louay M. Safi", "num_pages": "212", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-10-01 00:00:00", "ISBN": "0313361991"},
{"url": "https://www.goodreads.com/book/show/686509.Critical_Lives", "num_ratings": "164", "num_reviews": "20", "avg_ratings": 4.24, "genres": ["Biography", "Religion", "Religion", "Islam", "History", "Nonfiction"], "title": "Critical Lives: Muhammad", "description": ["Muhammad was a religious visionary and political leader. Raised in the harsh Arabian Peninsula and orphaned while still a child, this unlikely leader and military genius received a calling to transform his society from a collection of raiding tribes into one of the world's most progressive societies. His message of monotheism and righetousness motivated an entire people to", "Muhammad was a religious visionary and political leader. Raised in the harsh Arabian Peninsula and orphaned while still a child, this unlikely leader and military genius received a calling to transform his society from a collection of raiding tribes into one of the world's most progressive societies. His message of monotheism and righetousness motivated an entire people to abandon idolatry and spread the word of God to surrounding nations. Although he was a military genius, his greatest accomplishments came from the religion he preached: Islam, which called its adherents to lead a life of prayer, charity, and contemplation. The second largest religion in the world, both Islam's prophet and its values are today often misunderstood by adherents and outsiders alike. This concise, informative biography explores Muhammad's background and boyhood; as well as the culture and society in which he lived. A look at Muhammad as a family man, and how his personal life was a testament to his high regard for women."], "author": "Yahiya Emerick", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-04-01 00:00:00", "ISBN": "0028643712"},
{"url": "https://www.goodreads.com/book/show/18715729-i-want-to-eat-my-food", "num_ratings": "24", "num_reviews": "0", "avg_ratings": 4.25, "genres": ["Religion", "Islam"], "title": "I Want to Eat My Food", "description": ["The present book which is written in a straightforward style, teaches younger children some basic 'Islamic manners' and reminds them of Allah's blessings."], "author": "Darussalam", "num_pages": "11", "awards": [], "places": [], "character_names": [], "language": "English"},
{"url": "https://www.goodreads.com/book/show/6943927-images-of-muhammad", "num_ratings": "13", "num_reviews": "4", "avg_ratings": 3.62, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "History"], "title": "Images of Muhammad: Narratives of the Prophet in Islam Across the Centuries", "description": ["The Prophet Muhammad has been revered for more than fifteen centuries. Today, one in five people throughout the world calls for daily praises and blessings u", "The Prophet Muhammad has been revered for more than fifteen centuries. Today, one in five people throughout the world calls for daily praises and blessings upon him and holds him up as a model of virtue. ", "In IMAGES OF MUHAMMAD, Tarif Khalidi examines the ways Muhammad has been depicted and revered from the immediate aftermath of his death to the present day. With scholarly authority, Khalidi explores how the â€œbiographyâ€ of Muhammad has been constructed, reconstructed, and utilized in various Islamic cultures, and traces the influences that have shaped his image, including the profound effect of negative perceptions promulgated by the West. As he describes the great variety of Islamic beliefs and practices, Khalidi illuminates the values and ideas shared by the Sunni, Shia, and Sufi sects, as well as the differences among them, providing Western readers with a clear, objective perspective on the current conflicts within the Muslim world as well as their global repercussions."], "author": "Tarif Khalidi", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-18 00:00:00", "ISBN": "0385518161"},
{"url": "https://www.goodreads.com/book/show/26947746-spanish-islam", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 2.33, "genres": [], "title": "Spanish Islam: A Concise History", "description": ["There are many books of history that fill you with garbage, let this one be the opposite and fill your heart with light and a clearer understanding of the misconceptions in relation to Al-Andalus that is one of the most extraordinary portions of our great Islamic history and is the greatest European expression of Islam. Many of the traits on which modern Europe prides itse", "There are many books of history that fill you with garbage, let this one be the opposite and fill your heart with light and a clearer understanding of the misconceptions in relation to Al-Andalus that is one of the most extraordinary portions of our great Islamic history and is the greatest European expression of Islam. Many of the traits on which modern Europe prides itself came to it from Muslim Spain. Diplomacy, free trade, open borders, the techniques of academic research, of anthropology, etiquette, fashion, various types of medicine and hospitals, all came from the great city of cities; Cordoba. The age that paved the way for the European renaissance was known as the Islamic Golden Age and a renaissance took place under the influence of the Arabs and Moorish revival of culture. Re-visiting the Islamic Golden Age is crucial to understanding the nature of a renaissance. Muslims were created to be leaders and to lead humanity to what is good and forbid what is evil."], "author": "Omar Ali Zafar", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18715732-golden-stories-of-sayida-khadija", "num_ratings": "71", "num_reviews": "4", "avg_ratings": 4.45, "genres": ["Religion", "Islam", "Womens", "Biography"], "title": "Golden Stories of Sayida Khadija (R.A)", "description": ["Khadijah (R.A), the first wife of Muhammad (P.B.U.H), is a shinning example to all Muslim men and Women. Even during pre-Islamic times, she was known as Tahirah- the pure and righteous. ", "This collection of authentic accounts, highlights her intelligence, commitment to religion, sincere belief in God and perseverance under the most difficult of circumstances. it literally tr", "Khadijah (R.A), the first wife of Muhammad (P.B.U.H), is a shinning example to all Muslim men and Women. Even during pre-Islamic times, she was known as Tahirah- the pure and righteous. ", "This collection of authentic accounts, highlights her intelligence, commitment to religion, sincere belief in God and perseverance under the most difficult of circumstances. it literally transports the reader back in time to the very beginning of Islam, providing deep insights into her life and those of her children and grandchildren. ", "this book is a wonderful, well-researched addition to the body of biographical work encompassing the lives of the Prophet (P.B.U.H), his family, companions and followers."], "author": "Abdul Malik Mujahid", "num_pages": "196", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18782852-life-and-times-of-the-messengers", "num_ratings": "23", "num_reviews": "0", "avg_ratings": 4.48, "genres": ["Religion", "Islam", "Biography"], "title": "Life and times of the Messengers", "description": ["The exact number of prophets and messengers sent by Allah is not known, but the Qur'an makes clear that all of the prophets were sent to various nations to preach Islamic monotheism. ", "Muslims believe that all the Divine Messengers including those in common with Judaism and Christianity - conveyed the same message of true monotheism and submission to the one God, Allah. Beli", "The exact number of prophets and messengers sent by Allah is not known, but the Qur'an makes clear that all of the prophets were sent to various nations to preach Islamic monotheism. ", "Muslims believe that all the Divine Messengers including those in common with Judaism and Christianity - conveyed the same message of true monotheism and submission to the one God, Allah. Belief in these prophets and messengers is an essential part of the Islamic faith and Muslims do not differentiate between them, according them all the same respect and reverence. ", "Darussalam is proud to present the abridged English translation of Al-Bidayah wan Nihayah (The Beginning and The End), by the renowned scholar Abu Al-Fida, 'Imad ad-Deen Isma'eel bin 'Umar bin Katheer (Ibn Katheer), recounting the stories of the prophets and their nations."], "author": "Darussalam", "num_pages": "391", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26808006-the-antichrist-and-armageddon", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "The Antichrist and Armageddon", "description": ["Danyal Nicholson was born in a Christian family and he grew up around religious clerics and pastors. He attended Church on a weekly basis. He later studied world religions and had particular interest in the field of Sufism. In this book, Danyal mentions in a nutshell, the shocking truth that people need to be mindful of. Many people have been misguided by lies with regards", "Danyal Nicholson was born in a Christian family and he grew up around religious clerics and pastors. He attended Church on a weekly basis. He later studied world religions and had particular interest in the field of Sufism. In this book, Danyal mentions in a nutshell, the shocking truth that people need to be mindful of. Many people have been misguided by lies with regards to The Antichrist and the coming of Armageddon. If you wish to know the truth, then this is the perfect book for you! We must know how to live in these times and we must be acquainted with what to expect. We must not turn a blind eye to the shocking realities. We must not be fooled by conjecture and theory, but rather, we should adhere firmly to fact. There are unfortunately many liars out there who have written books on the topic of eschatology, some people have even went to the extent of mentioning that they have made research in an exhaustive fashion. However, their books are truly satanic as they are full of lies. One should perform their own research on religious doctrine for all religions and one should not be fooled by such liars who paint a religious nation under one brush. Every person is a unique being. Generally, we should hold a good opinion about one another. This is the truth that God has revealed to you. This book is a must read, not only for Christians and Muslims, but for people of all other faiths and beliefs too."], "author": "Danyal Nicholson", "num_pages": "36", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19229720-mistress-of-the-throne", "num_ratings": "402", "num_reviews": "56", "avg_ratings": 3.78, "genres": ["Historical", "Historical Fiction", "Cultural", "India", "Historical", "Fiction"], "title": "Mistress of the Throne", "description": ["1631. The Empress of India Mumtaz Mahal has died. Yet, rather than anoint one of his several other wives to take her place as Empress of India, Mughal King Shah Jahan anoints his seventeen-year-old daughter Jahanara as the next Queen of India. ", "Bearing an almost identical resemblance to her mother, Jahanara is the first ever daughter of a sitting Mughal King to be anointed", "1631. The Empress of India Mumtaz Mahal has died. Yet, rather than anoint one of his several other wives to take her place as Empress of India, Mughal King Shah Jahan anoints his seventeen-year-old daughter Jahanara as the next Queen of India. ", "Bearing an almost identical resemblance to her mother, Jahanara is the first ever daughter of a sitting Mughal King to be anointed queen. She is reluctant to accept this title, but does so in hopes of averting the storm approaching her family and Mughal India. Her younger siblings harbor extreme personalities from a liberal multiculturalist (who views religion as an agent of evil) to an orthodox Muslim (who views razing non-Muslim buildings as divine will).", "Meanwhile, Jahanara struggles to come to terms with her own dark reality: as the daughter of a sitting King, she is forbidden to marry. Thus, while she lives in the shadow of her parents unflinching love story, she is devastated by the harsh reality that she is forbidden to share such a romance with another. ", "Mistress of the Throne narrates the powerful story of one of Indias most opulent and turbulent times through the eyes of an unsuspecting character: a Muslim queen. It uses actual historical figures to illuminate the complexity of an era that has often been called Indias Golden Age."], "author": "Ruchir Gupta", "num_pages": "324", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-01-01 00:00:00", "ISBN": "9382665072"},
{"url": "https://www.goodreads.com/book/show/18785785-the-caliphate-of-banu-ummaiya", "num_ratings": "28", "num_reviews": "0", "avg_ratings": 4.57, "genres": ["History", "Religion", "Religion", "Islam"], "title": "The Caliphate of Banu Ummaiya", "description": ["Darussalam is proud to present the abridged English translation of the classic work: Al-Bidayah Wan Nihayah. This book focuses on the tenure that took place after the wonderful time of “Khulfa-e-Rashidan” (the four caliphs) which took out the Arabian Peninsula from the darkness of associating ilahs (gods) with Almighty Allah swt. ", "This book discusses the tenure and the reig", "Darussalam is proud to present the abridged English translation of the classic work: Al-Bidayah Wan Nihayah. This book focuses on the tenure that took place after the wonderful time of “Khulfa-e-Rashidan” (the four caliphs) which took out the Arabian Peninsula from the darkness of associating ilahs (gods) with Almighty Allah swt. ", "This book discusses the tenure and the reign time of Banu Umaiyyah starting from 40th Hijri to 132nd Hijri year. In this book the author Ibn e Kathir explains the biography of the caliphs, the merits of their ruling times, major and minor events that took place during their reign, the year by year happenings and the transition of the government bodies known as Caliphs. All of the narrations and references are very much authentic as this phase of Islamic history is very much manipulated and distorted by historians of Islam. ", "As Al-Bidayah Wan Nihayah (The Beginning and The End), by the renowned and famous scholar Abu Al-Fida Imad ad-Deen Isma’eel bin Umar ibn Katheer, is considered as one of the most authoritative sources on Islamic History"], "author": "ابن كثير", "num_pages": "560", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18784416-therapy-from-the-quran-and-hadith", "num_ratings": "29", "num_reviews": "1", "avg_ratings": 4.52, "genres": ["Religion", "Islam", "Psychology", "Nonfiction", "Religion"], "title": "Therapy from the Quran and Hadith", "description": ["The re-emergence of Islamically - centred therapy has increased over the past few decades. This has been motivated by the need for a therapeutic approach to treating mental illness that is ideologically acceptable within the boundaries of Shari'ah. This has become a concern not only for Muslim therapists and their patients but in fact for all Muslims, as part of their adhe", "The re-emergence of Islamically - centred therapy has increased over the past few decades. This has been motivated by the need for a therapeutic approach to treating mental illness that is ideologically acceptable within the boundaries of Shari'ah. This has become a concern not only for Muslim therapists and their patients but in fact for all Muslims, as part of their adherence to Islam and towards improving their Iman. Muslim psychologists around the world are working hard at developing faith -based models of therapy that are acceptable to their peers and Muslim scholars alike. This book is precisely that; An easy-to-use collection of Qur'anic ayaat and authentic ahadith and their interpretations, that allow bi idh nillah individuals to challenge distressing psychological thoughts and behaviors. Written by an experienced clinical psychologist, the text may be used as a therapeutic aid or reference for clinicians or simply as a general guide to character development. The use of analogy means that the book is relevant to both Muslims and non-Muslims alike with the aim of using guidance from Islam to alleviate difficulties and to improve our understanding of human distress. Only the Creator best knows the creation."], "author": "ابن كثير", "num_pages": "354", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22145202-muslim-girl", "num_ratings": "62", "num_reviews": "11", "avg_ratings": 3.79, "genres": ["Religion"], "title": "Muslim Girl", "description": ["Faith turns to shame, confidence to doubt, and conviction to rebellion. Inaya was only nine when her mother converted to Islam and moved the family to Saudi Arabia. Now, at sixteen years old, Inaya returns to America and decides to remove her Muslim clothes and hide her religion at school. ...And she hopes to get the attention of a boy she likes. But she has no idea how to", "Faith turns to shame, confidence to doubt, and conviction to rebellion. Inaya was only nine when her mother converted to Islam and moved the family to Saudi Arabia. Now, at sixteen years old, Inaya returns to America and decides to remove her Muslim clothes and hide her religion at school. ...And she hopes to get the attention of a boy she likes. But she has no idea how to hide this double life from her mother, and from everyone who admires her strong faith."], "author": "Umm Zakiyyah", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-04-24 00:00:00", "ISBN": "0970766785"},
{"url": "https://www.goodreads.com/book/show/777703.The_Abrahamic_Faiths", "num_ratings": "23", "num_reviews": "2", "avg_ratings": 3.78, "genres": ["Religion", "Islam", "Religion"], "title": "The Abrahamic Faiths: Judaism, Christianity, and Islam: Similarities & Contrasts", "description": ["In this book, Dr. Jerald Dirks explores the similarities and contrasts among Judaism, Christianity, and Islam. Using the analogy of a tree, he notes that each of the three Abrahamic faiths claims to be the one, true, vertical extension of a trunk of primary revelation, with the other two religions being seen as lateral branches that deviate from the true verticality of the", "In this book, Dr. Jerald Dirks explores the similarities and contrasts among Judaism, Christianity, and Islam. Using the analogy of a tree, he notes that each of the three Abrahamic faiths claims to be the one, true, vertical extension of a trunk of primary revelation, with the other two religions being seen as lateral branches that deviate from the true verticality of the original trunk.", "Working within the framework of this metaphor, Dr. Dirks focuses on a series of topics, including his own journey from Christianity to Islam, the extensive common ground that is to be found among the three faiths, the basic differences that separate Islam and Christianity, the issue of religious pluralism in a global world, Islamophobia in the Christian West, and the role of women in the scriptures and foundational texts of the three religions. Along the way, he exposes and corrects numerous myths about the faiths, myths that are too often accepted as common knowledge. Dr. Dirks concludes by calling for a reconciliation among the faiths that embraces and celebrates the commonalities to be found among them and that honestly and respectfully acknowledges their differences.", "About the author --", "Dr. Jerald F. Dirks holds B.A. and M. Divinity from Harvard University and doctorate in Psychology from the University of Denver.", "He is a former ordained minister (deacon) in the United Methodist Church and is author of The Cross & The Crescent and Abraham - The Friend of God. He published over sixty articles in the field of clinical psychology and over one hundred and fifty articles on Arabian horses. He has traveled extensively in the Middle East and interacted widely with the Muslim communities in the United States."], "author": "Jerald F. Dirks", "num_pages": "284", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-30 00:00:00", "ISBN": "1590080319"},
{"url": "https://www.goodreads.com/book/show/6754961-islamic-history", "num_ratings": "403", "num_reviews": "99", "avg_ratings": 3.3, "genres": ["History", "Religion", "Nonfiction", "Religion", "Islam"], "title": "Islamic History: A Very Short Introduction", "description": ["Does history matter? This book argues not that history matters, but that Islamic history does. This Very Short Introduction introduces the story of Islamic history; the controversies surrounding its study; and the significance that it holds - for Muslims and for non-Muslims alike. Opening with a lucid overview of the rise and spread of Islam, from the seventh to twenty fir", "Does history matter? This book argues not that history matters, but that Islamic history does. This Very Short Introduction introduces the story of Islamic history; the controversies surrounding its study; and the significance that it holds - for Muslims and for non-Muslims alike. Opening with a lucid overview of the rise and spread of Islam, from the seventh to twenty first century, the book charts the evolution of what was originally a small, localised community of believers into an international religion with over a billion adherents. Chapters are also dedicated to the peoples - Arabs, Persians, and Turks - who shaped Islamic history, and to three representative institutions - the mosque, jihad, and the caliphate - that highlight Islam's diversity over time. ", "Finally, the roles that Islamic history has played in both religious and political contexts are analysed, while stressing the unique status that history enjoys amongst Muslims, especially compared to its lowly place in Western societies where history is often seen as little more than something that is not to be repeated.Some of the questions that will be answered are: ", "- How did Islam arise from the obscurity of seventh century Arabia to the headlines of twenty first century media?", "- How do we know what we claim to know about Islam's rise and development?", "- Why does any of this matter, either to Muslims or to non-Muslims?\""], "author": "Adam J. Silverstein", "num_pages": "157", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-02-01 00:00:00", "ISBN": "0199545723"},
{"url": "https://www.goodreads.com/book/show/20317264-book-of-purification", "num_ratings": "37", "num_reviews": "0", "avg_ratings": 4.46, "genres": ["Religion", "Islam", "Nonfiction"], "title": "Book of Purification", "description": ["Purification is one of the prominent features of Islam. It means thorough purity and cleanliness of body, clothes, place and all aspects of Muslim's life. ‘Book of Purification’ contains information on purity of water, types of impurities, ways of purification, Menstruation, Ghusl, Tayammum, Wudu etc. It is part of the “Encyclopedia of Islamic Jurisprudence Concerning Musl", "Purification is one of the prominent features of Islam. It means thorough purity and cleanliness of body, clothes, place and all aspects of Muslim's life. ‘Book of Purification’ contains information on purity of water, types of impurities, ways of purification, Menstruation, Ghusl, Tayammum, Wudu etc. It is part of the “Encyclopedia of Islamic Jurisprudence Concerning Muslim Women” series written by Yusuf Al-Hajj Ahmad. This series addresses those matters of life and religion that are essential in facilitating a woman’s role as a mother, teacher and nurturer. Men can also read and benefit from this particular book because the information in this book is relevant to both males and females. It has two very important and distinct qualities: ", "1.\tEasy to read, succinct and direct. ", "2.\tThe 'question and answer' layout of the book is intended to facilitate effortless comprehensibility and swift memorization. ", "It is in view of the 'questions and answers' format that the author has concluded this book to be easy to read and comprehensive, hoping that it will enable the Muslims to be well informed about matters concerning their religion which will in turn strengthen their faith."], "author": "Yusuf Al-Hajj Ahmad", "num_pages": "115", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16117127-refuge", "num_ratings": "476", "num_reviews": "112", "avg_ratings": 4.06, "genres": ["Romance", "Fiction", "Contemporary"], "title": "Refuge", "description": ["On a dusty, sweltering night, Noor Khan, a beautiful, headstrong Afghan refugee, comes face-to-face with Charlie Matthews, a brash, young American aid worker. To Noor's fury, Charlie breaks every cultural norm and pursues her. She wants nothing to do with him: her sole aim in life is to earn an overseas scholarship so she can escape the miseries of the refugee camps.", "Howeve", "On a dusty, sweltering night, Noor Khan, a beautiful, headstrong Afghan refugee, comes face-to-face with Charlie Matthews, a brash, young American aid worker. To Noor's fury, Charlie breaks every cultural norm and pursues her. She wants nothing to do with him: her sole aim in life is to earn an overseas scholarship so she can escape the miseries of the refugee camps.", "However when Noor's brother threatens to marry her off, she is forced to seek refuge in Charlie's home, of all places, and suddenly everything Noor believes in is put into question.", "Set in the mystical and seething city of Peshawar, where no one is without an agenda and few can be trusted, Refuge is a timeless and unforgettable love story about the struggle for love and purpose in a cruel and cynical world."], "author": "N.G. Osborne", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26808287-what-is-prophetic-medicine", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "What is Prophetic Medicine?", "description": ["This book gives a deeper insight on the meaning of Prophetic Medicine, which has been prescribed in Islam by prophet Muhammad SAW. Those who wish to lead a more healthier life, will find the topic of Prophetic Medicine very enlightening and intriguing."], "author": "Abdul-Jabbar Khan", "num_pages": "20", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1512091.The_Qur_an", "num_ratings": "170", "num_reviews": "33", "avg_ratings": 3.21, "genres": ["Religion", "Religion", "Islam", "Nonfiction", "History", "Audiobook"], "title": "The Qur'an: A Biography", "description": ["Few books in history have been as important or as poorly understood as the Qur'an. Sent down in a series of revelations to the Prophet Muhammad, the Qur'an is the unmediated word of Allah: a ritual, political, and legal authority, an ethical and spiritual guide, and a literary masterpiece. It is revered by Muslims throughout the world, in whom it inspires devotion, passion", "Few books in history have been as important or as poorly understood as the Qur'an. Sent down in a series of revelations to the Prophet Muhammad, the Qur'an is the unmediated word of Allah: a ritual, political, and legal authority, an ethical and spiritual guide, and a literary masterpiece. It is revered by Muslims throughout the world, in whom it inspires devotion, passion, fear, and sometimes incomprehension.", " In this book, one of the launch titles in the Atlantic Monthly Press's Books That Changed the World series, distinguished historian of religion Bruce Lawrence shows precisely how the Qur'an is Islam. He describes the origins of the faith and assesses its tremendous influence on today's societies and politics. Above all, Lawrence emphasizes that the Qur'an is a sacred book of signs that has no single message. It is a book that demands interpretation and one that can be properly understood only through its history. Lawrence's work is a beautifully written and, in these increasingly troubled times, invaluable introduction to and exploration of the core sacred text of Islam."], "author": "Bruce B. Lawrence", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-24 00:00:00", "ISBN": "1400133874"},
{"url": "https://www.goodreads.com/book/show/1067468.Discovering_Islam", "num_ratings": "45", "num_reviews": "5", "avg_ratings": 3.53, "genres": ["History", "Religion", "Islam", "Religion"], "title": "Discovering Islam: Making Sense of Muslim History and Society", "description": ["Now reissued with a new introduction, ", " is a classic account of how the history of Islam and its relations with the West have shaped Islamic society today. Islam is often caricatured as aggressive and fanatic. Written in the tradition of Ibn Khaldun, this readable and wide-ranging book balances that image, uncovers the roots of Islamic discontent and celebr", "Now reissued with a new introduction, ", " is a classic account of how the history of Islam and its relations with the West have shaped Islamic society today. Islam is often caricatured as aggressive and fanatic. Written in the tradition of Ibn Khaldun, this readable and wide-ranging book balances that image, uncovers the roots of Islamic discontent and celebrates the sources of its strength. From the four \"ideal Caliphs\" who succeeded the Prophet to the refugee camps of Peshawar, an objective picture emerges of the main features of Muslim history and the compulsions of Muslim society."], "author": "Akbar Ahmed", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-03-29 00:00:00", "ISBN": "0415285259"},
{"url": "https://www.goodreads.com/book/show/26134245-what-is-numerology", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "What is Numerology?", "description": ["This book describes what Numerology is and discusses its uses in some depth, explaining the Islamic view point of such a subject. This book is a great starter for anyone studying comparative religion or anyone interested in seeking further knowledge in the field of numerology, which spun off from mathematics."], "author": "Abdul-Jabbar Khan", "num_pages": "18", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5285757-the-beauty-of-pure-islam", "num_ratings": "6", "num_reviews": "0", "avg_ratings": 3.83, "genres": [], "title": "The Beauty of Pure Islam", "description": ["This book is dedicated to the ethics of Islam. It contains quotes from the Quran and Sunna, and other texts describing the true Islam."], "author": "Vladimir Antonov", "num_pages": "84", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-25 00:00:00", "ISBN": "143825721X"},
{"url": "https://www.goodreads.com/book/show/26059690-rumi", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "RUMI: Adherent of The Appointed", "description": ["Rumi is a renowned Sufi mystic, who lived a life in devotion to the divine, through adhering to the ways of the appointed, seal of the prophets, Muhammad (SAW) who can be more commonly referred to as the chosen one. Many fail to recognise and realise this. Many also fail to recognise who Shamsudeen Tabrizi (RA) was and how he had such a life changing impact on the life of", "Rumi is a renowned Sufi mystic, who lived a life in devotion to the divine, through adhering to the ways of the appointed, seal of the prophets, Muhammad (SAW) who can be more commonly referred to as the chosen one. Many fail to recognise and realise this. Many also fail to recognise who Shamsudeen Tabrizi (RA) was and how he had such a life changing impact on the life of Rumi that would then make him world famous and his works magnetic. In this book you will discover the meaning behind whirling and how the connection between Maulana Rumi and Shamsudeen Tabrizi was similar to that of the connection and bond between Abu Bakr (RA) and the prophet Muhammad (SAW). You will also discover how Rumi (RA) was an adherent of Muhammad (SAW).This is a unique book written about Maulana Jalaludeen ar-Rumi (RA), A renowned sufi who is famous for his poetry, writings, and his spirituality through his love for Allah, which is also expressed in his whirling. A unique and enticing book."], "author": "Omar Ali Zafar", "num_pages": "40", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6329488-a-historical-lie", "num_ratings": "11", "num_reviews": "2", "avg_ratings": 3.73, "genres": ["Religion", "Islam", "History", "World History", "Nonfiction", "Science", "History"], "title": "A Historical Lie : The Stone Age", "author": "Harun Yahya", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/1865197.Who_Speaks_For_Islam_", "num_ratings": "950", "num_reviews": "90", "avg_ratings": 4.03, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Politics", "History", "Sociology", "Reference", "Cultural", "Iran", "Religion", "Theology", "Spirituality"], "title": "Who Speaks For Islam?: What a Billion Muslims Really Think", "description": ["Based on the largest study of its kind, this book is the first to present the fascinating findings of the Gallup Poll of the Muslim World.", "The horrific events of 9/11 dramatically intensified what many saw as an ongoing conflict between the U.S. and parts of the Muslim world. Extremism has grown exponentially as Muslims and non-Muslims alike continue to be victims of global", "Based on the largest study of its kind, this book is the first to present the fascinating findings of the Gallup Poll of the Muslim World.", "The horrific events of 9/11 dramatically intensified what many saw as an ongoing conflict between the U.S. and parts of the Muslim world. Extremism has grown exponentially as Muslims and non-Muslims alike continue to be victims of global terrorism. Terrorist attacks have occurred from Morocco to Indonesia and from Madrid to London, as U.S.-led wars rage in Iraq and Afghanistan. As of this writing, war and terrorism have already claimed more than 300,000 lives since 9/11; the vast majority have been civilians.", "As we face savage actions in a world that seems ever more dangerous and out of control, we are confronted daily by analysis from terrorism experts and pundits who see the religion of Islam as responsible for global terrorism. At the same time, terrorist groups like al-Qaeda beam messages throughout the world that demonize the West as the enemy of Islam, responsible for all the ills of the Muslim world.", "Amid the rhetoric of hate and growing violence, both anti-Americanism in the Muslim world and Islamophobia — discrimination against or hostility toward Islam or Muslims — have increased precipitously. In the aftermath of 9/11, President George W. Bush emphasized that America was waging war against global terrorism, not against Islam. However, the continued acts of a terrorist minority, coupled with statements by preachers of hate (Muslim and Christian) as well as anti-Muslim talk show hosts and political commentators have inflamed our emotions and distorted our views. The religion of Islam and the mainstream Muslim majority have been conflated with the beliefs and actions of an extremist minority. The result was reflected in a USA Today/Gallup poll, which found substantial minorities of Americans admitting to negative feelings or prejudice against Muslims and favoring heightened security measures with Muslims to help prevent terrorism. Nearly one-quarter of Americans, 22%, say they would not want a Muslim as a neighbor; fewer than half believe U.S. Muslims are loyal to the United States; and 44% say Muslims are too extreme in their religious beliefs.", "Are the growing violence and negative perceptions on all sides only a prelude to an inevitable all-out war between the West and 1.3 billion Muslims?", "The vital missing piece among the many voices weighing in on this question is the actual views of Muslim publics. With all that is at stake for U.S. and Muslim societies, indeed for the future of the world, the time has come to democratize the debate.", " is about this silenced majority. It is the product of a mammoth Gallup research study over the last six years. Gallup conducted tens of thousands of face-to-face interviews with residents of more than 35 predominantly Muslim nations. Gallup’s sample represents urban and rural, young and old, educated and illiterate, women and men. In total, we surveyed a sample representing over 90% of the world’s 1.3 billion Muslims, including Muslims in the West, making this the largest, most comprehensive study of contemporary Muslims ever.", "The concept of this book is simple. After collecting vast amounts of data representing the views of the world’s Muslims, we asked the questions everyone wants answers to: What is at the root of anti-Americanism in the Muslim world? Who are the extremists? Is democracy a desired construct among Muslims, and if so, what might it look like? What do Muslim women really want? With questions in hand, we let the empirical evidence — the voices of a billion Muslims, not individual “experts” or “extremists,” dictate the answer."], "author": "John L. Esposito", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-02-25 00:00:00", "ISBN": "1595620176"},
{"url": "https://www.goodreads.com/book/show/27306.Islam", "num_ratings": "7,553", "num_reviews": "470", "avg_ratings": 4.02, "genres": ["History", "Religion", "Nonfiction", "Religion", "Islam", "Spirituality"], "title": "Islam: A Short History", "description": ["No religion in the modern world is as feared and misunderstood as Islam. It haunts the popular imagination as an extreme faith that promotes terrorism, authoritarian government, female oppression, and civil war. In a vital revision of this narrow view of Islam and a distillation of years of thinking and writing about the subject, Karen Armstrong’s short history demonstrate", "No religion in the modern world is as feared and misunderstood as Islam. It haunts the popular imagination as an extreme faith that promotes terrorism, authoritarian government, female oppression, and civil war. In a vital revision of this narrow view of Islam and a distillation of years of thinking and writing about the subject, Karen Armstrong’s short history demonstrates that the world’s fastest-growing faith is a much more complex phenomenon than its modern fundamentalist strain might suggest."], "author": "Karen Armstrong", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-08-06 00:00:00", "ISBN": "081296618X"},
{"url": "https://www.goodreads.com/book/show/9695487", "num_ratings": "4,397", "num_reviews": "768", "avg_ratings": 3.96, "genres": ["Religion", "Islam", "Religion"], "title": "معالم في الطريق", "description": ["من أشهر كتب سيد قطب ومن أكثرها جدلاً. يتحدث فيه الكاتب عن الجيل القرآني الفريد وطبيعة المنهج القرآني، ونشأة المجتمع المسلم، والجهاد في سبيل الله، وجنسية المسلم وعقيدته.", "The author speaks about the unique Quranic generation, the nature of the Quranic method, the characteristics of Islamic society, jihad in the cause of God, and a Muslim s nationality and his belief among oth", "من أشهر كتب سيد قطب ومن أكثرها جدلاً. يتحدث فيه الكاتب عن الجيل القرآني الفريد وطبيعة المنهج القرآني، ونشأة المجتمع المسلم، والجهاد في سبيل الله، وجنسية المسلم وعقيدته.", "The author speaks about the unique Quranic generation, the nature of the Quranic method, the characteristics of Islamic society, jihad in the cause of God, and a Muslim s nationality and his belief among other things."], "author": "Sayed Qutb", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/35632080-awakened-by-love", "num_ratings": "67", "num_reviews": "50", "avg_ratings": 4.15, "genres": ["Romance", "Contemporary", "Romance", "Love Story", "Did Not Finish"], "title": "Awakened by Love", "description": ["From the critically acclaimed and award-winning author, Azin Sametipour, comes a breath-taking story about forbidden love, heartbreak and identity.", "Born in California into a Muslim family from Iran, Zoha Farzam thought she had her entire life planned. Graduating from UC Davis in just three years, and attending Stanford Medical School. Even removing her scarf without her par", "From the critically acclaimed and award-winning author, Azin Sametipour, comes a breath-taking story about forbidden love, heartbreak and identity.", "Born in California into a Muslim family from Iran, Zoha Farzam thought she had her entire life planned. Graduating from UC Davis in just three years, and attending Stanford Medical School. Even removing her scarf without her parents knowing was a carefully planned rebellion, but she never in her wildest dreams planned Ethan. Ethan Renard was everything she was not, and when he made her question everything she believed in, Zoha found herself being torn between her happiness and her duty. Would she risk everything, her family, her faith, and even her reputation for him?", "A moving portrait about the challenges one faces from being in two cultures, or falling in love with someone who is, and the hard decisions one must make to be true to oneself.", "Awakened by Love is astonishingly beautiful and frighteningly honest. ", "Critics call it captivating, powerful and a novel for everyone. ", "The first in a trilogy, Awakened by Truth comes next!"], "author": "Azin Sametipour", "num_pages": "302", "awards": [], "places": ["California"], "character_names": ["Zoha Farzam", "Ethan Renard"], "language": "English", "publish_date": "2017-09-30 00:00:00", "ISBN": "0999061410"},
{"url": "https://www.goodreads.com/book/show/29930577-the-yard", "num_ratings": "40", "num_reviews": "26", "avg_ratings": 4.18, "genres": ["Fiction"], "title": "The Yard", "description": ["A story of love and redemption, set in Trinidad, that exposes the fault lines in Indo-Muslim culture. Behrooz is brought to a familial complex, The Yard, to live with a devout and extended family, where he struggles to belong. He forms a childish alliance with Maya, a wilful and rebellious girl, and his guardian’s daughter. After they share a night of adolescent tenderness", "A story of love and redemption, set in Trinidad, that exposes the fault lines in Indo-Muslim culture. Behrooz is brought to a familial complex, The Yard, to live with a devout and extended family, where he struggles to belong. He forms a childish alliance with Maya, a wilful and rebellious girl, and his guardian’s daughter. After they share a night of adolescent tenderness, Maya, fearing retribution, flees to London. Behrooz painstakingly rebuilds his life and marries another. When tragedy strikes, Maya returns to her childhood home. There, she and Behrooz must face up to old demons. Can their love endure? Even after Maya is dealt the most “righteous” blow of all?"], "author": "Aliyyah Eniath", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-04-10 00:00:00", "ISBN": "9385755080"},
{"url": "https://www.goodreads.com/book/show/26114587-islamic-exceptionalism", "num_ratings": "293", "num_reviews": "41", "avg_ratings": 3.85, "genres": ["Religion", "Islam", "Politics", "Religion", "Nonfiction", "History"], "title": "Islamic Exceptionalism: How the Struggle Over Islam Is Reshaping the World", "description": ["In ", "Brookings Institution scholar and acclaimed author Shadi Hamid offers a novel and provocative argument on how Islam is, in fact, \"exceptional\" in how it relates to politics, with profound implications for how we understand the future of the Middle East. Divides among citizens aren't just about power but are products of fundamental disagreements o", "In ", "Brookings Institution scholar and acclaimed author Shadi Hamid offers a novel and provocative argument on how Islam is, in fact, \"exceptional\" in how it relates to politics, with profound implications for how we understand the future of the Middle East. Divides among citizens aren't just about power but are products of fundamental disagreements over the very nature and purpose of the modern nation state—and the vexing problem of religion’s role in public life. Hamid argues for a new understanding of how Islam and Islamism shape politics by examining different models of reckoning with the problem of religion and state, including the terrifying—and alarmingly successful—example of ISIS.", "With unprecedented access to Islamist activists and leaders across the region, Hamid offers a panoramic and ambitious interpretation of the region's descent into violence. ", " is a vital contribution to our understanding of Islam's past and present, and its outsized role in modern politics. We don't have to like it, but we have to understand it—because Islam, as a religion and as an idea, will continue to be a force that shapes not just the region, but the West as well in the decades to come."], "author": "Shadi Hamid", "num_pages": "320", "awards": ["Lionel Gelber Prize Nominee (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-06-07 00:00:00", "ISBN": "1250061016"},
{"url": "https://www.goodreads.com/book/show/6920085-memories-of-muhammad", "num_ratings": "250", "num_reviews": "24", "avg_ratings": 4.3, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "History", "Spirituality"], "title": "Memories of Muhammad: Why the Prophet Matters", "description": ["Who was the historical Muhammad, and how do Muslims remember him—as a holy prophet, a cultural revolutionary, a military leader, or a spiritual mystic? Unending media coverage of extremist fanatics, the controversy over offensive cartoon depictions of Muhammad, and fatwas against journalists and authors are all hard to ignore and have prejudiced our Western perceptions of", "Who was the historical Muhammad, and how do Muslims remember him—as a holy prophet, a cultural revolutionary, a military leader, or a spiritual mystic? Unending media coverage of extremist fanatics, the controversy over offensive cartoon depictions of Muhammad, and fatwas against journalists and authors are all hard to ignore and have prejudiced our Western perceptions of Muslims and their founder. This definitive biography of the founder of Islam by a leading Muslim-American scholar will reveal invaluable new insights, finally providing a fully three-dimensional portrait of Muhammad and the one billion people who follow him today.", " presents Muhammad as a lens through which to view both the genesis of Islamic religion and the grand sweep of Islamic history—right up to the hot button issues of the day, such as the spread of Islam, holy wars, the status of women, the significance of Jerusalem, and current tensions with Jews, Hindus, and Christians. It also provides a rare glimpse into how Muslims spiritually connect to God through their Prophet, in the mosque, in the home, and even in cyberspace.", "This groundbreaking book offers the opportunity to move from telling Muhammad's story to talking about how different Muslims throughout Islamic history have both honored and contested Muhammad's legacy."], "author": "Omid Safi", "num_pages": "346", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-11-17 00:00:00", "ISBN": "0061231347"},
{"url": "https://www.goodreads.com/book/show/113567.The_Great_Theft", "num_ratings": "514", "num_reviews": "61", "avg_ratings": 4.14, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "History", "Politics", "Religion", "Faith"], "title": "The Great Theft: Wrestling Islam from the Extremists", "description": ["Despite President George W. Bush's assurances that Islam is a peaceful religion and that all good Muslims hunger for democracy, confusion persists and far too many Westerners remain convinced that Muslims and terrorists are synonymous. In the aftermath of the attacks of 9/11, the subsequent wars in Afghanistan and Iraq, and the recent bombings in London, an unprecedented a", "Despite President George W. Bush's assurances that Islam is a peaceful religion and that all good Muslims hunger for democracy, confusion persists and far too many Westerners remain convinced that Muslims and terrorists are synonymous. In the aftermath of the attacks of 9/11, the subsequent wars in Afghanistan and Iraq, and the recent bombings in London, an unprecedented amount of attention has been directed toward Islam and the Muslim world. Yet, even with this increased scrutiny, most of the public discourse regarding Islam revolves around the actions of extremist factions such as the Wahhabis and al-Qa'ida. But what of the Islam we don't hear about?", "As the second-largest and fastest-growing religion in the world, Islam is deemed by more than a billion Muslims to be a source of serenity and spiritual peace, and a touchstone for moral and ethical guidance. While extremists have an impact upon the religion that is wildly disproportionate to their numbers, moderates constitute the majority of Muslims worldwide. It is this rift between the quiet voice of the moderates and the deafening statements of the extremists that threatens the future of the faith.", "In ", ", Khaled Abou El Fadl, one of the world's preeminent Islamic scholars, argues that Islam is currently passing through a transformative period no less dramatic than the movements that swept through Europe during the Reformation. At this critical juncture there are two completely opposed worldviews within Islam competing to define this great world religion. The stakes have never been higher, and the future of the Muslim world hangs in the balance.", "Drawing on the rich tradition of Islamic history and law, ", " is an impassioned defense of Islam against the encroaching power of the extremists. As an accomplished Islamic jurist, Abou El Fadl roots his arguments in long-standing historical legal debates and delineates point by point the beliefs and practices of moderate Muslims, distinguishing these tenets from the corrupting influences of the extremists. From the role of women in Islam to the nature of jihad, from democracy and human rights to terrorism and warfare, Abou El Fadl builds a vital vision for a moderate Islam. At long last, the great majority of Muslims who oppose extremism have a desperately needed voice to help reclaim Islam's great moral tradition."], "author": "Khaled Abou El Fadl", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-23 00:00:00", "ISBN": "0061189030"},
{"url": "https://www.goodreads.com/book/show/5775729-american-muslim-women", "num_ratings": "37", "num_reviews": "8", "avg_ratings": 3.7, "genres": ["Religion", "Islam", "Feminism", "Nonfiction"], "title": "American Muslim Women: Negotiating Race, Class, and Gender Within the Ummah", "description": ["African American Muslims and South Asian Muslim immigrants are two of the largest ethnic Muslim groups in the U.S. Yet there are few sites in which African Americans and South Asian immigrants come together, and South Asians are often held up as a \"model minority\" against African Americans. However, the American ummah, or American Muslim community, stands as a unique site", "African American Muslims and South Asian Muslim immigrants are two of the largest ethnic Muslim groups in the U.S. Yet there are few sites in which African Americans and South Asian immigrants come together, and South Asians are often held up as a \"model minority\" against African Americans. However, the American ummah, or American Muslim community, stands as a unique site for interethnic solidarity in a time of increased tensions between native-born Americans and immigrants.", "This ethnographic study of African American and South Asian immigrant Muslims in Chicago and Atlanta explores how Islamic ideals of racial harmony and equality create hopeful possibilities in an American society that remains challenged by race and class inequalities. The volume focuses on women who, due to gender inequalities, are sometimes more likely to move outside of their ethnic Muslim spaces and interact with other Muslim ethnic groups in search of gender justice.", " explores the relationships and sometimes alliances between African Americans and South Asian immigrants, drawing on interviews with a diverse group of women from these two communities. Karim investigates what it means to negotiate religious sisterhood against America's race and class hierarchies, and how those in the American Muslim community both construct and cross ethnic boundaries.", " reveals the ways in which multiple forms of identity frame the American Muslim experience, in some moments reinforcing ethnic boundaries, and at other times, resisting them."], "author": "Jamillah Karim", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-12-01 00:00:00", "ISBN": "0814748104"},
{"url": "https://www.goodreads.com/book/show/527090.The_Complete_Idiot_s_Guide_to_Understanding_Islam", "num_ratings": "266", "num_reviews": "37", "avg_ratings": 3.93, "genres": ["Religion", "Religion", "Islam", "Nonfiction", "Reference"], "title": "The Complete Idiot's Guide to Understanding Islam", "description": ["Explains the history, doctrines, and beliefs of the Islamic faith; outlines the life and philophies of Muhammad; describes Islamic contributions to the arts and sciences; and describes its rituals, prayers, and holidays."], "author": "Yahiya Emerick", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-10-01 00:00:00", "ISBN": "0028642333"},
{"url": "https://www.goodreads.com/book/show/545425._", "num_ratings": "14,650", "num_reviews": "1,258", "avg_ratings": 4.57, "genres": ["Religion", "Islam", "Religion", "History", "Biography"], "title": "الرحيق المختوم", "description": ["الرحيق المختوم", "بحث في السيرة النبوية.", "تأليف: الشيخ صفي الرحمن المباركفوري.", "قُدِّم في مسابقة رابطة العالم الإسلامي في السيرة النبوية الشريفة، وحاز البحث على المركز الأول.", "\"ومن منهجي في هذا الكتاب ـ عدا ما جاء في إعلان الرابطة ـ أني قررت سلوك سبيل الاعتدال، متجنبًا التطويل الممل والإيجاز المخل، وقد وجدت المصادر تختلف فيما بينها حول كثير مما يتعلق بالأحداث اختلافًا لا يحتمل الجمع", "الرحيق المختوم", "بحث في السيرة النبوية.", "تأليف: الشيخ صفي الرحمن المباركفوري.", "قُدِّم في مسابقة رابطة العالم الإسلامي في السيرة النبوية الشريفة، وحاز البحث على المركز الأول.", "\"ومن منهجي في هذا الكتاب ـ عدا ما جاء في إعلان الرابطة ـ أني قررت سلوك سبيل الاعتدال، متجنبًا التطويل الممل والإيجاز المخل، وقد وجدت المصادر تختلف فيما بينها حول كثير مما يتعلق بالأحداث اختلافًا لا يحتمل الجمع والتوفيق، فاخترت سبيل الترجيح، وأثبت في الكتاب ما ترجح لدي بعد التدقيق في الدراسة والنقد، إلا أني طويت ذكر الدلائل والوجوه؛ لأن ذلك يفضي إلى طول غير مطلوب‏.", "أما بالنسبة لقبول الروايات وردها فقد استفدت في ذلك مما كتبه الأئمة المتقنون، واعتمدت عليهم فيما حكموا به من الصحة والحسن والضعف؛ إذ لم أجد وقتًا يكفي للخوض في هذا المجال‏.‏", "وقد أشرت في بعض المواضع إلى بعض الدلائل ووجوه الترجيح، وذلك حينما خِفْتُ الاستغراب ممن يقرأ الكتاب، أو رأيت شبه الاتفاق فيما بين الأولين والآخرين على خلاف ما هو الصواب‏.‏ والله ولي التوفيق‏.‏\"", "الجمعة المباركة ", "24/7/1396هـ", "23/7/1976م", "صفي الرحمن المباركفوري", "الجامعة السلفية", "بنارس - الهند"], "author": "Safiy al-Rahman al-Mubarakfuri", "num_pages": "498", "awards": ["Muslim World League at worldwide competition on the 'Biography of the Prophet'"], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2005-08-16 00:00:00", "ISBN": "9953320993"},
{"url": "https://www.goodreads.com/book/show/7992039-green-deen", "num_ratings": "134", "num_reviews": "23", "avg_ratings": 3.89, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Biology", "Ecology", "Environment", "Spirituality", "Science"], "title": "Green Deen: What Islam Teaches about Protecting the Planet", "description": ["New copy. Fast shipping. Will be shipped from US."], "author": "Ibrahim Abdul-Matin", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-11-11 00:00:00", "ISBN": "1605094641"},
{"url": "https://www.goodreads.com/book/show/29348840-meeting-of-two-seas", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 4.67, "genres": [], "title": "Meeting of Two Seas: Where the heart leads the mind", "description": [" ", " "], "author": "Saeed Malik", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-02-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/142124.The_Heart_of_Islam", "num_ratings": "1,425", "num_reviews": "42", "avg_ratings": 4.27, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Philosophy", "History", "Spirituality"], "title": "The Heart of Islam: Enduring Values for Humanity", "description": ["As the specter of religious extremism has become a fact of life today, the temptation is great to allow the evil actions and perspectives of a minority to represent an entire tradition. In the case of Islam, there has been much recent confusion in the Western world centered on distorted portrayals of its core values. Born of ignorance, such confusion feeds the very problem", "As the specter of religious extremism has become a fact of life today, the temptation is great to allow the evil actions and perspectives of a minority to represent an entire tradition. In the case of Islam, there has been much recent confusion in the Western world centered on distorted portrayals of its core values. Born of ignorance, such confusion feeds the very problem at hand.", " one of the great intellectual figures in Islamic history offers a timely presentation of the core spiritual and social values of Islam: peace, compassion, social justice, and respect for the other. Seizing this unique moment in history to reflect on the essence of his tradition, Seyyed Hossein Nasr seeks to \"open a spiritual and intellectual space for mutual understanding.\" Exploring Islamic values in scripture, traditional sources, and history, he also shows their clear counterparts in the Jewish and Christian traditions, revealing the common ground of the Abrahamic faiths.", "Nasr challenges members of the world's civilizations to stop demonizing others while identifying themselves with pure goodness and to turn instead to a deeper understanding of those shared values that can solve the acute problems facing humanity today. \"Muslims must ask themselves what went wrong within their own societies,\" he writes, \"but the West must also pose the same question about itself . . . whether we are Muslims, Jews, Christians, or even secularists, whether we live in the Islamic world or in the West, we are in need of meaning in our lives, of ethical norms to guide our actions, of a vision that would allow us to live at peace with each other and with the rest of God's creation.\" Such help, he believes, lies at the heart of every religion and can lead the followers of the Abrahamic religions (Judaism, Christianity, and Islam) as well as other religious and spiritual traditions to a new future of mutual respect and common global purpose.", " is a landmark presentation of enduring value that offers hope to humanity, and a compelling portrait of the beauty and appeal of the faith of 1.2 billion people."], "author": "Seyyed Hossein Nasr", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-08-17 00:00:00", "ISBN": "0060730641"},
{"url": "https://www.goodreads.com/book/show/834340.Women_in_the_Qur_an_Traditions_and_Interpretation", "num_ratings": "37", "num_reviews": "4", "avg_ratings": 3.78, "genres": ["Religion", "Islam", "Nonfiction", "Religion", "Womens", "Gender"], "title": "Women in the Qur'an, Traditions, and Interpretation", "description": ["Islamic ideas about women and their role in society spark considerable debate - both in the Western world and in the Islamic world itself. Despite the popular attention surrounding Middle Eastern attitudes toward women, there has been little systematic study of the statements regarding women in the Qur'an. Barbara Stowasser fills this void with this study on the women of I", "Islamic ideas about women and their role in society spark considerable debate - both in the Western world and in the Islamic world itself. Despite the popular attention surrounding Middle Eastern attitudes toward women, there has been little systematic study of the statements regarding women in the Qur'an. Barbara Stowasser fills this void with this study on the women of Islamic sacred history. Women in the Qur'an, Traditions, and Interpretation presents the Qur'anic revelations on female figures associated with God's prophets from Adam to Muhammad. Revealed narratives and legislation are then pursued through their medieval, modern, and contemporary interpretations. The theological exegetic sources here chosen, all Sunni, include the major classical works as well as, for the modern period, examples of modernist, traditionalist, and fundamentalist exegesis. For Hadith materials beyond the theological tafsir, Stowasser analyzes both popular narratives of the \"tales of the prophets\" genre and representative samples of the classical historical and legal Hadith. A close reading of modern sources, including those by lay writers, shows the waning influence of these traditional materials in present-day Islamic thought. By telling the stories of the women of sacred history in Qur'an and interpretation, this book presents an introduction to past and present Islamic paradigms of doctrine and their socio-economic and political applications. Stowasser establishes the link between the female figures as cultural symbols, and Islamic self-perceptions from the beginning to the present time."], "author": "Barbara Freyer Stowasser", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-07-29 00:00:00", "ISBN": "0195111486"},
{"url": "https://www.goodreads.com/book/show/8545788-sikander", "num_ratings": "231", "num_reviews": "42", "avg_ratings": 3.85, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Pakistan", "War"], "title": "Sikander", "description": ["It's 1986 and Ronald Reagan's commitment to the anti-Soviet mujahideen of Afghanistan is resolute. Meanwhile, 17 year-old Pakistani student, Sikander, yearns for the freedom of his tribal brethren in neighboring Afghanistan, and that leads him to admire everything American but more directly, to want to study and live in America. ", "When a heated quarrel stemming from a naive", "It's 1986 and Ronald Reagan's commitment to the anti-Soviet mujahideen of Afghanistan is resolute. Meanwhile, 17 year-old Pakistani student, Sikander, yearns for the freedom of his tribal brethren in neighboring Afghanistan, and that leads him to admire everything American but more directly, to want to study and live in America. ", "When a heated quarrel stemming from a naive indiscretion about his parents' financial woes provokes Sikander into leaving the comfort of his upper-middle class home, events lead to his being thrust into the very heart of the Afghan resistance. ", "Between fighting the Russians and living among the mujahideen villagers, Sikander meets Rabia, the independent, uneducated, but sharp-witted niece of his Afghan mentor and he begins to have feelings her. After two years, aided by long-awaited American Stinger missiles, Sikander and the mujahideen prevail. Amid the euphoria of victory and the prospects for peace Sikander and Rabia cement their love in marriage.", "With the war over, Sikander decides its time he and his new bride head back to Pakistan for a reconciliation with his family. To their delight he is welcomed back as a long missed, war hero and the couple settle in with his now financially recovered family. ", "Years pass, and Sikander prospers in the family business, while feeling though never fulfilling his desire to move to America. But then a bitter civil war rages in neighboring Afghanistan that results in the rise of the Taliban and with it, an unraveling of Rabia's family. Things get far worse when the tragedy of 9/11 strikes, and aided by Rabia's pleadings Sikander feels compelled to make the perilous journey across the border to persuade her family to come back with hm and away from the conflict. He manages to find them and lead them to the relative safety of Pakistan but not without himself being placed on collision course with the country of his dreams - America.", "Learn more about this remarkable story at "], "author": "M. Salahuddin Khan", "num_pages": "588", "awards": ["New York Book Festival Nominee for Fiction (2011)", "Paris Book Festival for Grand Prize and General Fiction (2011)", "CAIR-Chicago Book Award (2012)", "Hollywood Book Festival Awards for Fiction (2011)", "National Indie Excellence Awards for Muticultural Fiction (2011)"], "places": ["Peshawar", "Laghar Juy", "Applecross, Scotland", "Arghandab Valley", "Henderson, North Carolina", "Guantanamo Bay detention camp"], "character_names": [], "language": "English", "publish_date": "2010-07-28 00:00:00", "ISBN": "0578052881"},
{"url": "https://www.goodreads.com/book/show/524202.Western_Muslims_and_the_Future_of_Islam", "num_ratings": "431", "num_reviews": "21", "avg_ratings": 4.13, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Philosophy", "Politics"], "title": "Western Muslims and the Future of Islam", "description": ["In a Western world suddenly acutely interested in Islam, one question has been repeatedly heard above the din: where are the Muslim reformers? With this ambitious volume, Tariq Ramadan firmly establishes himself as one of Europe's leading thinkers and one of Islam's most innovative and important voices. As the number of Muslims living in the West grows, the question of wha", "In a Western world suddenly acutely interested in Islam, one question has been repeatedly heard above the din: where are the Muslim reformers? With this ambitious volume, Tariq Ramadan firmly establishes himself as one of Europe's leading thinkers and one of Islam's most innovative and important voices. As the number of Muslims living in the West grows, the question of what it means to be a Western Muslim becomes increasingly important to the futures of both Islam and the West. While the media are focused on radical Islam, Ramadan claims, a silent revolution is sweeping Islamic communities in the West, as Muslims actively seek ways to live in harmony with their faith within a Western context. French, English, German, and American Muslims--women as well as men--are reshaping their religion into one that is faithful to the principles of Islam, dressed in European and American cultures, and definitively rooted in Western societies. Ramadan's goal is to create an independent Western Islam, anchored not in the traditions of Islamic countries but in the cultural reality of the West. He begins by offering a fresh reading of Islamic sources, interpreting them for a Western context and demonstrating how a new understanding of universal Islamic principles can open the door to integration into Western societies. He then shows how these principles can be put to practical use. Ramadan contends that Muslims can-indeed must-be faithful to their principles while participating fully in the civic life of Western secular societies. Grounded in scholarship and bold in its aims, ", " offers a striking vision of a new Muslim Identity, one which rejects once and for all the idea that Islam must be defined in opposition to the West."], "author": "Tariq Ramadan", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-01 00:00:00", "ISBN": "0195183568"},
{"url": "https://www.goodreads.com/book/show/6533039-after-the-prophet", "num_ratings": "5,252", "num_reviews": "580", "avg_ratings": 4.07, "genres": ["History", "Religion", "Nonfiction", "Religion", "Islam", "Politics"], "title": "After the Prophet: The Epic Story of the Shia-Sunni Split in Islam", "author": "Lesley Hazleton", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-15 00:00:00", "ISBN": "0385523939"},
{"url": "https://www.goodreads.com/book/show/16066887-painted-hands", "num_ratings": "334", "num_reviews": "83", "avg_ratings": 3.96, "genres": ["Fiction", "Religion", "Womens Fiction", "Chick Lit", "Islam", "Muslims", "Romance", "Feminism"], "title": "Painted Hands", "description": ["Muslim bad girl Zainab Mir has just landed a job working for a post-feminist, Republican Senate candidate. Her best friend Amra Abbas is about to make partner at a top Boston law firm. Together they’ve thwarted proposal-slinging aunties, cultural expectations, and the occasional bigot to succeed in their careers. What they didn’t count on? Unlikely men and geopolitical fir", "Muslim bad girl Zainab Mir has just landed a job working for a post-feminist, Republican Senate candidate. Her best friend Amra Abbas is about to make partner at a top Boston law firm. Together they’ve thwarted proposal-slinging aunties, cultural expectations, and the occasional bigot to succeed in their careers. What they didn’t count on? Unlikely men and geopolitical firestorms.", "When a handsome childhood friend reappears, Amra makes choices that Zainab considers so 1950s—choices that involve the perfect ", "silk dress and a four-bedroom house in the suburbs. After hiding her long work hours during their courtship, Amra struggles to balance her demanding job and her unexpectedly traditional new husband.", "Zainab has her own problems. She generates controversy in the Muslim community with a suggestive magazine spread and friendship with a gay reporter. Her rising profile also inflames neocons like Chase Holland, the talk radio host who attacks her religion publicly but privately falls for her hard. When the political fallout from a terrorist attempt jeopardizes Zainab's job and protests surrounding a woman-led Muslim prayer service lead to violence, Amra and Zainab must decide what they’re willing to risk for their principles, their friendship, and love."], "author": "Jennifer Zobair", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-06-11 00:00:00", "ISBN": "1250027012"},
{"url": "https://www.goodreads.com/book/show/13260207-my-country-tis-of-thee", "num_ratings": "94", "num_reviews": "14", "avg_ratings": 3.79, "genres": ["Autobiography", "Memoir", "Politics", "Religion", "Religion", "Islam", "Nonfiction", "Biography", "Biography", "Autobiography", "Race"], "title": "My Country 'Tis of Thee", "description": [" As a former Catholic who converted to Islam, Keith Ellison, is the first Muslim elected to Congress—from a district with fewer than 1 percent Muslims and 11 percent Blacks. With his unique perspective on uniting a disparate community and speaking to a common g", " As a former Catholic who converted to Islam, Keith Ellison, is the first Muslim elected to Congress—from a district with fewer than 1 percent Muslims and 11 percent Blacks. With his unique perspective on uniting a disparate community and speaking to a common goal, Ellison takes a provocative look at America and what needs to change to accommodate different races and beliefs.", "Filled with anecdotes, statistics, and social commentary, Ellison touches on everything from the Tea Party to Obama, from race to the immigration debate and more. He also draws some very clear distinctions between parties and shows why the deep polarization is unhealthy for America. Deeply patriotic, with ", ", Ellison strives to help define what it means to be an American today."], "author": "Keith Ellison", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6147274-in-the-footsteps-of-the-prophet", "num_ratings": "3,219", "num_reviews": "203", "avg_ratings": 4.42, "genres": ["Religion", "Islam", "Religion", "History", "Nonfiction", "Biography", "Spirituality", "Biography Memoir", "Religion", "Theology", "Philosophy", "Self Help"], "title": "In the Footsteps of the Prophet: Lessons from the Life of Muhammad", "description": ["Named by ", " magazine as one of the 100 most important innovators of the century, Tariq Ramadan is a leading Muslim scholar, with a large following especially among young European and American Muslims. Now, in his first book written for a wide audience, he offers a marvelous biography of the Prophet Muhammad, one that highlights the spiritual and ethical teachings of one", "Named by ", " magazine as one of the 100 most important innovators of the century, Tariq Ramadan is a leading Muslim scholar, with a large following especially among young European and American Muslims. Now, in his first book written for a wide audience, he offers a marvelous biography of the Prophet Muhammad, one that highlights the spiritual and ethical teachings of one of the most influential figures in human history.", " is a fresh and perceptive look at Muhammad, capturing a life that was often eventful, gripping, and highly charged. Ramadan provides both an intimate portrait of a man who was shy, kind, but determined, as well as a dramatic chronicle of a leader who launched a great religion and inspired a vast empire. More important, Ramadan presents the main events of the Prophet's life in a way that highlights his spiritual and ethical teachings. The book underscores the significance of the Prophet's example for some of today's most controversial issues, such as the treatment of the poor, the role of women, Islamic criminal punishments, war, racism, and relations with other religions. Selecting those facts and stories from which we can draw a profound and vivid spiritual picture, the author asks how can the Prophet's life remain -- or become again -- an example, a model, and an inspiration? And how can Muslims move from formalism -- a fixation on ritual -- toward a committed spiritual and social presence?", "In this thoughtful and engaging biography, Ramadan offers Muslims a new understanding of Muhammad's life and he introduces non-Muslims not just to the story of the Prophet, but to the spiritual and ethical riches of Islam."], "author": "Tariq Ramadan", "num_pages": "242", "awards": [], "places": [], "character_names": ["Mohammad and his family"], "language": "English", "publish_date": "2009-01-06 00:00:00", "ISBN": "0195374762"},
{"url": "https://www.goodreads.com/book/show/6952762-a-perspective-on-the-signs-of-al-quran", "num_ratings": "20", "num_reviews": "0", "avg_ratings": 4.4, "genres": ["Religion", "Religion", "Islam"], "title": "A Perspective on the Signs of Al-Quran: Through the Prism of the Heart", "description": ["Unique amongst contemporary works on the Quran, Malik's \"Perspective on the Signs of al-Quran: through the prism of the heart\" lives up to its title! It is clear in every page of this brilliant work that it was written from a heart-felt perspective. A must read for every student of life, love, spirituality and of course the Quran."], "author": "Saeed Malik", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-02 00:00:00", "ISBN": "1439239622"},
{"url": "https://www.goodreads.com/book/show/18513811-rizq-and-lawful-earnings", "num_ratings": "81", "num_reviews": "3", "avg_ratings": 4.26, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Self Help"], "title": "Rizq And Lawful Earnings", "description": ["Narrated by Umar Ibn al-Khattaab (May Allah be pleased with him), the Prophet (Peace be upon him) said:", "“If you put your faith completely in Allah, He will arrange for your sustenance in the same way as he provides for the bird. They go out in the morning with their stomachs empty and return filled in the evening.” (Tirmidhee)", "This book discusses the place of pride Islam giv", "Narrated by Umar Ibn al-Khattaab (May Allah be pleased with him), the Prophet (Peace be upon him) said:", "“If you put your faith completely in Allah, He will arrange for your sustenance in the same way as he provides for the bird. They go out in the morning with their stomachs empty and return filled in the evening.” (Tirmidhee)", "This book discusses the place of pride Islam gives to making lawful earnings and rizq through hard work and striving. It also looks at the contempt Islam places on begging and indolence. Then it looks at which earnings are lawful, which are not and the many ways by which wealth can increase while seeking the pleasure of Allah (Glorified and Exalted is He)."], "author": "Darussalam", "num_pages": "75", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513841-loving-our-parents", "num_ratings": "117", "num_reviews": "3", "avg_ratings": 4.49, "genres": ["Religion", "Islam", "Religion"], "title": "LOVING OUR PARENTS", "description": ["Loving our Parents is a wonderful collection of stories from the lives of ordinary people on the rewards of treating our parents with honor and respect. It also has detailed and authentic accounts from both the Noble Qur’an and the Prophet’s Sunnah on our duties and obligations to those who have sacrificed so much to raise and educate us. In addition, it provides clear war", "Loving our Parents is a wonderful collection of stories from the lives of ordinary people on the rewards of treating our parents with honor and respect. It also has detailed and authentic accounts from both the Noble Qur’an and the Prophet’s Sunnah on our duties and obligations to those who have sacrificed so much to raise and educate us. In addition, it provides clear warnings of the penalties from Allah Almighty in this world and the Hereafter for abusing and disrespecting our parents. This is an essential publication for those who want to know the Divine Injunctions on not only how to treat their mothers and fathers, but also their grandparents, close relatives and elders."], "author": "Abdul Malik Mujahid", "num_pages": "247", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513827-fast-according-to-sunna", "num_ratings": "50", "num_reviews": "0", "avg_ratings": 4.6, "genres": ["Religion", "Islam"], "title": "Fast According to Sunna", "description": ["In the terminology of the Shari’ah, the word saūm means to abstain from food, drink and sexual activity from dawn to sunset, with the intention of doing so sincerely and solely for Allah, the Exalted. This is because fasting purifies the soul and cleanses it from the evil that might cause it to become a miser and their ill behavior."], "author": "Muhammad Zulfiqar", "num_pages": "235", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513820-the-end-of-the-world", "num_ratings": "3,677", "num_reviews": "336", "avg_ratings": 4.15, "genres": ["Religion"], "title": "The End of the World", "description": ["In recent times things have become very confusing and we have begun to see in book stores and on websites speculation about future events, based on verses and hadeeths which refer to these future events concerning the signs of the Hour.", "Every time as a calamity befalls Islam and the Muslim, people begin to look for a way out from them. Sometimes you hear about the appearanc", "In recent times things have become very confusing and we have begun to see in book stores and on websites speculation about future events, based on verses and hadeeths which refer to these future events concerning the signs of the Hour.", "Every time as a calamity befalls Islam and the Muslim, people begin to look for a way out from them. Sometimes you hear about the appearance of the Mahdi, sometimes you hear that the time for the final confrontation between good and evil is close at hand, other times you hear about land sides in the East or in the West, and so forth."], "author": "Muhammad Al-Areefi", "num_pages": "410", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513828-miracles-merits-of-allah-s-messenger---al-bidayah-vi", "num_ratings": "56", "num_reviews": "0", "avg_ratings": 4.57, "genres": ["Religion", "Islam"], "title": "Miracles & Merits of Allah's Messenger - Al Bidayah VI", "description": ["Darussalam is proud to present the abridged English translation of the classic work: Al-Bidayah wan Nihayah. This book focus on the events that took place after the death of Messenger of Allah, peace and blessings of Allah be upon him, such as the choosing of Abu Bakr as the Caliph, the ghusl of Prophet, peace and blessings of Allah be upon him, and his burial.", "The book the", "Darussalam is proud to present the abridged English translation of the classic work: Al-Bidayah wan Nihayah. This book focus on the events that took place after the death of Messenger of Allah, peace and blessings of Allah be upon him, such as the choosing of Abu Bakr as the Caliph, the ghusl of Prophet, peace and blessings of Allah be upon him, and his burial.", "The book then discusses the blessed and beautiful characteristics and merits of the Prophet and then goes on to describe the miracles that he performed. Ibn Katheer then compares the miracles given to Prophet Muhammad, peace and blessings of Allah be upon him, with those that were given to other prophets; he then shows that Prophet Muhammad, peace and blessings of Allah be upon him, collectively received the same miracles that were granted to other Prophets separately.", "Al-Bidayah wan Nihayah (The Beginning and The End) by the renowned scholar Abu Al-Fida ‘Imad ad-Deen Isma’eel bin ‘Umar ibn Katheer, is considered one of the most authoritative sources of Islamic history."], "author": "ابن كثير", "num_pages": "492", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513832-memoir-of-the-repentant-people", "num_ratings": "66", "num_reviews": "2", "avg_ratings": 4.44, "genres": ["Religion", "Islam"], "title": "Memoir of the repentant people", "description": ["Allah loves those who sincerely seek His forgiveness and want to live a life of obedience. This book has detailed and illuminating examples from the lives of our righteous predecessors, and ordinary Muslims, about how they turned to their Lord after going astray. It is an essential guide to everyone wanting to return to the straight path."], "author": "محمد عبد الرحمن العريفي", "num_pages": "52", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513781-description-of-paradise-in-the-glorious-qur-an", "num_ratings": "96", "num_reviews": "2", "avg_ratings": 4.48, "genres": ["Religion", "Islam"], "title": "Description of Paradise in the Glorious Qur'an", "description": ["Writing about Paradise is of great importance in view of its significance in the belief of a Muslim. This belief makes him eligible for enjoyment of the bliss and the happiness of the Hereafter. It is not a belief that is limited to the life of this finite and ephemeral world only as compared to the everlasting Hereafter.", "Rather, it is a great creed that links the life of m", "Writing about Paradise is of great importance in view of its significance in the belief of a Muslim. This belief makes him eligible for enjoyment of the bliss and the happiness of the Hereafter. It is not a belief that is limited to the life of this finite and ephemeral world only as compared to the everlasting Hereafter.", "Rather, it is a great creed that links the life of man in this world to that of the Hereafter so that his vision will not be restricted to this world alone but extends to the Hereafter.", "Belief in Paradise is one of the fundamentals of faith. The Messenger of Allah, blessings and peace of Allah be upon him, was asked about faith and he answered, “Faith is to believe in Allah, in His angels, in His Books, in His Messenger and in the Last Day; and to believe in pre-decree, its good and bad.”"], "author": "Abdul Halim Ibn Muhammad Nassae As-Salafi", "num_pages": "241", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513760-200-golden-hadith", "num_ratings": "246", "num_reviews": "19", "avg_ratings": 4.39, "genres": ["Religion", "Islam", "Religion", "Nonfiction"], "title": "200 Golden Hadith", "description": ["Get this book from iBook store by following URL ", "Every Muslim is aware of the importance of the Prophet’s hadiths. Islam is based on two major sources: the Qur’an and the Sunnah, and the latter is available to us in the form of hadiths. The Prophet said, “Whoever comes to know one hadith of mine should spread it.” However, the Prophet also told us to be", "Get this book from iBook store by following URL ", "Every Muslim is aware of the importance of the Prophet’s hadiths. Islam is based on two major sources: the Qur’an and the Sunnah, and the latter is available to us in the form of hadiths. The Prophet said, “Whoever comes to know one hadith of mine should spread it.” However, the Prophet also told us to be careful when spreading his hadiths so as not to alter any component of it, otherwise, “he can take his seat in the hellfire.”", "Within this book I have incorporated 200 small hadiths of the Prophet. The reason for choosing the smaller hadiths of the Prophets is so that the youth can easily become accustomed to the words of the Prophet. All the hadiths concern the important matters of the religion, which every person should have knowledge of. I have come to the realization that many youth from among the Muslims have not memorized even one hadith of the Prophet. For this reason I have chosen smaller hadiths so that they can be easily memorized by them and they can spread them to others. This way our relatives and our friends can memorize some words of the Prophet which will bring them benefit in the hereafter.", "This book has purposely not been organized into any specific categories. Experience through the years has taught me that this style of non-categorization is easier for the general masses who are not scholars or students of knowledge. I am also aware that many languages exists out there in which the hadiths of the Prophet have not yet been translated. This is why, Allah-willing, my intention is to have this small work translated into at least 30 different languages."], "author": "Abdul Malik Mujahid", "num_pages": "45", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513845-golden-stories-of-umar-ibn-al-khatab", "num_ratings": "142", "num_reviews": "5", "avg_ratings": 4.68, "genres": ["Religion", "Islam", "Biography", "Religion"], "title": "Golden Stories of Umar Ibn Al-Khatab", "description": ["This book highlights the interesting and valuable stories of ‘Umar’s life. In this book the author deliberately left the stories without a sequence, so that each story is read by itself with ease. This is intended to be a unique approach in presentation and reading of Islamic books. This book describes the fact that 'Umar was exceptional in his Faith, distinguished in his", "This book highlights the interesting and valuable stories of ‘Umar’s life. In this book the author deliberately left the stories without a sequence, so that each story is read by itself with ease. This is intended to be a unique approach in presentation and reading of Islamic books. This book describes the fact that 'Umar was exceptional in his Faith, distinguished in his knowledge, profoudly wise in his thinking, remarkable in his eloquence, noble in his manners and great in the contributions he made to this Nation."], "author": "Abdul Malik Mujahid", "num_pages": "476", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12849233-early-days", "num_ratings": "85", "num_reviews": "1", "avg_ratings": 4.36, "genres": ["Religion", "Islam", "History", "Religion"], "title": "Early Days: Stories of the Beginning of Creation & the Early Prophet Adam to Yoonus", "description": ["This is an abridged English translation of the classic work Al-Bidayah wan Nihayah (The Beginning and The End) by Ibn Katheer, which is considered to be one of the most authoritative souces on Islamic History."], "author": "ابن كثير", "num_pages": "408", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/646462.Qur_an_", "num_ratings": "48,707", "num_reviews": "2,771", "avg_ratings": 4.34, "genres": ["Religion", "Religion", "Islam", "Nonfiction", "Classics", "Philosophy", "Spirituality", "Reference", "History", "Religion", "Theology", "Fantasy", "Mythology"], "title": "Qurʾan / القرآن الكريم", "description": ["The Quran (English pronunciation: /kɔrˈɑːn/; Arabic: القرآن al-qurʾān, IPA: [qurˈʔaːn], literally meaning \"the recitation\"), also transliterated Qur'an, Koran, Al-Coran, Coran, Kuran, and Al-Qur'an, is the central religious text of Islam, which Muslims believe to be the verbatim word of God (Arabic: الله, Allah). ", "The Quran is composed of verses (Ayat) that make up 114 chap", "The Quran (English pronunciation: /kɔrˈɑːn/; Arabic: القرآن‎ al-qurʾān, IPA: [qurˈʔaːn], literally meaning \"the recitation\"), also transliterated Qur'an, Koran, Al-Coran, Coran, Kuran, and Al-Qur'an, is the central religious text of Islam, which Muslims believe to be the verbatim word of God (Arabic: الله‎, Allah). ", "The Quran is composed of verses (Ayat) that make up 114 chapters (suras) of unequal length which are classified either as Meccan (المكية) or Medinan (المدنية) depending upon the place and time of their claimed revelation. Muslims believe the Quran to be verbally revealed through the angel Jibrīl (Gabriel) from God to Muhammad gradually over a period of approximately 23 years beginning on 22 December 609 CE, when Muhammad was 40, and concluding in 632 CE, the year of his death.", "Muslims regard the Quran as the main miracle of Muhammad, the proof of his prophethood and the culmination of a series of divine messages that started with the messages revealed to Adam, regarded in Islam as the first prophet, and continued with Suhuf Ibrahim (Scrolls of Abraham), the Tawrat (Torah or Pentateuch) of Moses, the Zabur (Tehillim or Book of Psalms) of David, and the Injil (Gospel) of Jesus. The Quran assumes familiarity with major narratives recounted in Jewish and Christian scriptures, summarizing some, dwelling at length on others and in some cases presenting alternative accounts and interpretations of events. The Quran describes itself as a book of guidance, sometimes offering detailed accounts of specific historical events, and often emphasizing the moral significance of an event over its narrative sequence."], "author": "Anonymous", "num_pages": "604", "awards": [], "places": [], "character_names": ["Moses (jewish leader)", "Abraham (patriarch of 3 religions)", "Adam (Bible)", "Jesus", "Mary (mother of Jesus)"], "language": "Arabic", "publish_date": "0650-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6066095-the-kite-runner", "num_ratings": "2,055,110", "num_reviews": "63,994", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "The Kite Runner", "description": ["The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father's servant, The Kite Runner is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption, and it is also about the power of fathers over sons", "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father's servant, The Kite Runner is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption, and it is also about the power of fathers over sons—their love, their sacrifices, their lies.", "The first Afghan novel to be written in English, The Kite Runner tells a sweeping story of family, love, and friendship against a backdrop of history that has not been told in fiction before, bringing to mind the large canvases of the Russian writers of the nineteenth century. But just as it is old-fashioned in its narration, it is contemporary in its subject—the devastating history of Afghanistan over the last thirty years. As emotionally gripping as it is tender, The Kite Runner is an unusual and powerful debut."], "author": "Khaled Hosseini", "num_pages": "372", "awards": ["Borders Original Voices Award for Fiction (2003)", "Humo's Gouden Bladwijzer (2008)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Puddly Award for Fiction (2006)", "Lincoln Award Nominee (2006)", "Prix des libraires du Québec for Lauréats hors Québec (2006)"], "places": ["Kabul", "Fremont, California", "Afghanistan", "Peshawar"], "character_names": ["Amir", "Hassan", "Assef", "Bába", "Sohrab", "Soraya", "Rahim Khan"], "language": "English", "publish_date": "2004-04-27 00:00:00"}
]