[
{"url": "https://www.goodreads.com/book/show/133906.The_Collected_Poems", "num_ratings": "14,881", "num_reviews": "202", "avg_ratings": 4.33, "genres": ["Poetry", "Classics", "Cultural", "African American", "Fiction", "Literature"], "title": "The Collected Poems", "description": ["\"The ultimate book for both the dabbler and serious scholar--. [Hughes] is sumptuous and sharp, playful and sparse, grounded in an earthy music--. This book is a glorious revelation.\"--Boston Globe", "Spanning five decades and comprising 868 poems (nearly 300 of which have never before appeared in book form), this magnificent volume is the definitive sampling of a writer who h", "\"The ultimate book for both the dabbler and serious scholar--. [Hughes] is sumptuous and sharp, playful and sparse, grounded in an earthy music--. This book is a glorious revelation.\"--Boston Globe", "Spanning five decades and comprising 868 poems (nearly 300 of which have never before appeared in book form), this magnificent volume is the definitive sampling of a writer who has been called the poet laureate of African America--and perhaps our greatest popular poet since Walt Whitman.  Here, for the first time, are all the poems that Langston Hughes published during his lifetime, arranged in the general order in which he wrote them and annotated by Arnold Rampersad and David Roessel.", "Alongside such famous works as \"The Negro Speaks of Rivers\" and Montage of a Dream Deferred, ", " includes the author's lesser-known verse for children; topical poems distributed through the Associated Negro Press; and poems such as \"Goodbye Christ\" that were once suppressed.  Lyrical and pungent, passionate and polemical, the result is a treasure of a book, the essential collection of a poet whose words have entered our common language."], "author": "Langston Hughes", "num_pages": "736", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-10-31 00:00:00", "ISBN": "0679764089"},
{"url": "https://www.goodreads.com/book/show/22585014-bone", "num_ratings": "4,155", "num_reviews": "434", "avg_ratings": 4.17, "genres": ["Poetry", "Feminism"], "title": "bone", "description": [" ", " Bone. Visceral. Close to. Stark. ", " The poems in Yrsa Daley-Ward's collection ", " are exactly that: reflections on a particular life honed to their essence--so clear and pared-down, they become universal. ", " From navigating the oft competing w", " ", " Bone. Visceral. Close to. Stark. ", " The poems in Yrsa Daley-Ward's collection ", " are exactly that: reflections on a particular life honed to their essence--so clear and pared-down, they become universal. ", " From navigating the oft competing worlds of religion and desire, to balancing society's expectations with the raw experience of being a woman in the world; from detailing the experiences of growing up as a first generation black British woman, to working through situations of dependence and abuse; from finding solace in the echoing caverns of depression and loss, to exploring the vulnerability and redemption in falling in love, each of the raw and immediate poems in Daley-Ward's ", " resonate to the core of what it means to be human. "], "author": "Yrsa Daley-Ward", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-16 00:00:00", "ISBN": "1499170718"},
{"url": "https://www.goodreads.com/book/show/50214.Where_a_Nickel_Costs_a_Dime", "num_ratings": "112", "num_reviews": "11", "avg_ratings": 4.19, "genres": ["Poetry", "Cultural", "African American"], "title": "Where a Nickel Costs a Dime", "description": [" captures the hip-hop rhythms and in-your-face intensity of the Nuyorican Poets Cafe, a downtown Manhattan club where the hottest young poets are finding their fame.", "Willie Perdomo's poems, in the tradition of Amiri Baraka, Langston Hughes, and Ntozake Shange, meet at the intersection of the street and the academy.", "The world in these piercing and h", " captures the hip-hop rhythms and in-your-face intensity of the Nuyorican Poets Cafe, a downtown Manhattan club where the hottest young poets are finding their fame.", "Willie Perdomo's poems, in the tradition of Amiri Baraka, Langston Hughes, and Ntozake Shange, meet at the intersection of the street and the academy.", "The world in these piercing and heartbreaking poems is Spanish Harlem, \"where night turns to day without sleep,\" where \"Puerto Rico stays on our minds when the fresh breeze of cafe con leche y pan con mantequilla comes through half-opened windows and under our doors,\" where \"babies fall asleep to the bark of a German shepherd,\" where \"Independence Day is celebrated everyday,\" where \"the police come into your house without knocking. They throw us off rooftops and say we slipped. They shoot my father and say he was crazy. They put a bullet in my head and say they found me that way.\"", "Blending images of street life, drugs, and AIDS against hope and determination, Willie Perdomo is a cutting-edge bard who speaks to the soul of his generation."], "author": "Willie Perdomo", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-03-17 00:00:00", "ISBN": "0393313832"},
{"url": "https://www.goodreads.com/book/show/519494.Recyclopedia", "num_ratings": "484", "num_reviews": "29", "avg_ratings": 4.17, "genres": ["Poetry", "Literature", "American", "Womens", "Teaching"], "title": "Recyclopedia: Trimmings / S*PeRM**K*T / Muse and Drudge", "description": ["-from ", "shows the extraordinary development of Harryette Mullen's career, in her books ", "-from ", "shows the extraordinary development of Harryette Mullen's career, in her books ", "and ", ", all originally published in the 1990s and now available again to new readers. These prose poems and lyrics bring us into collision with the language of fashion and femininity, advertising and the supermarket, the blues and traditional lyric poetry. ", "is a major gathering of work by one of the most exciting and innovative poets writing in America today."], "author": "Harryette Mullen", "num_pages": "178", "awards": ["PEN Open Book Award (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-31 00:00:00", "ISBN": "1555974562"},
{"url": "https://www.goodreads.com/book/show/95874.Sleeping_With_the_Dictionary", "num_ratings": "1,229", "num_reviews": "80", "avg_ratings": 3.99, "genres": ["Poetry", "The United States Of America", "Cultural", "African American"], "title": "Sleeping With the Dictionary", "description": ["Harryette Mullen's fifth poetry collection, ", "is the abecedarian offspring of her collaboration with two of the poet's most seductive writing partners, ", "and ", "In her ménage à trois with these faithful companions, the poet is aware that while ", "seems obsessed with categories and hierarchies, th", "Harryette Mullen's fifth poetry collection, ", "is the abecedarian offspring of her collaboration with two of the poet's most seductive writing partners, ", "and ", "In her ménage à trois with these faithful companions, the poet is aware that while ", "seems obsessed with categories and hierarchies, the ", "whatever its faults, was compiled with the assistance of a democratic usage panel that included black poets Langston Hughes and Arna Bontemps, as well as feminist author and editor Gloria Steinem. With its arbitrary yet determinant alphabetical arrangement, its gleeful pursuit of the ludic pleasure of word games (acrostic, anagram, homophone, parody, pun), as well as its reflections on the politics of language and dialect, Mullen's work is serious play. A number of the poems are inspired or influenced by a technique of the international literary avant-garde group ", "a dictionary game called S+7 or N+7. This method of textual transformation--which is used to compose nonsensical travesties reminiscent of Lewis Carroll's \"Jabberwocky\"--also creates a kind of automatic poetic discourse.", "Mullen's parodies reconceive the African American's relation to the English language and Anglophone writing, through textual reproduction, recombining the genetic structure of texts from the Shakespearean sonnet and the fairy tale to airline safety instructions and unsolicited mail. The poet admits to being \"licked all over by the English tongue,\" and the title of this book may remind readers that an intimate partner who also gives language lessons is called, euphemistically, a \"pillow dictionary.\""], "author": "Harryette Mullen", "num_pages": "85", "awards": ["National Book Critics Circle Award Nominee for Poetry (2002)", "National Book Award Finalist for Poetry (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-02-22 00:00:00", "ISBN": "0520231430"},
{"url": "https://www.goodreads.com/book/show/765172.Cane", "num_ratings": "6,963", "num_reviews": "365", "avg_ratings": 3.89, "genres": ["Fiction", "Poetry", "Classics", "Short Stories", "Cultural", "African American"], "title": "Cane", "description": ["A literary masterpiece of the Harlem Renaissance, ", " is a powerful work of innovative fiction evoking black life in the South. The sketches, poems, and stories of black rural and urban life that make up ", " are rich in imagery. Visions of smoke, sugarcane, dusk, and flame permeate the Southern landscape: the Northern world is pictured as a harsher reality of asphalt str", "A literary masterpiece of the Harlem Renaissance, ", " is a powerful work of innovative fiction evoking black life in the South. The sketches, poems, and stories of black rural and urban life that make up ", " are rich in imagery. Visions of smoke, sugarcane, dusk, and flame permeate the Southern landscape: the Northern world is pictured as a harsher reality of asphalt streets. Impressionistic, sometimes surrealistic, the pieces are redolent of nature and Africa, with sensuous appeals to eye and ear."], "author": "Jean Toomer", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-17 00:00:00", "ISBN": "0871401517"},
{"url": "https://www.goodreads.com/book/show/65343.Selected_Poems", "num_ratings": "737", "num_reviews": "28", "avg_ratings": 3.96, "genres": ["Poetry", "Cultural", "African American", "American", "African American Literature"], "title": "Selected Poems", "description": ["Here in one volume is a selection of the extraordinary poems of Rita Dove, who, as the nation's Poet Laureate from 1993 to 1995, brought poetry into the lives of millions of people.  Along with a new introduction and poem, ", " comprises Dove's collections ", ", which includes a group of poems devoted to the themes of slavery and freedom", "Here in one volume is a selection of the extraordinary poems of Rita Dove, who, as the nation's Poet Laureate from 1993 to 1995, brought poetry into the lives of millions of people.  Along with a new introduction and poem, ", " comprises Dove's collections ", ", which includes a group of poems devoted to the themes of slavery and freedom; ", ", intimate ruminations on home and the world; and finally, ", ", winner of the Pulitzer Prize in 1987, a verse cycle loosely based on her grandparents' lives.  Precisely yet intensely felt, resonant with the voices of ordinary people, Rita Dove's ", " is marked by lyric intensity and compassionate storytelling."], "author": "Rita Dove", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-09-28 00:00:00", "ISBN": "0679750800"},
{"url": "https://www.goodreads.com/book/show/93933.Collected_Poems_1948_1984", "num_ratings": "728", "num_reviews": "29", "avg_ratings": 4.15, "genres": ["Poetry", "Literature", "Post Colonial", "Nobel Prize"], "title": "Collected Poems, 1948-1984", "author": "Derek Walcott", "num_pages": "528", "awards": ["Los Angeles Times Book Prize for Poetry (1986)"], "places": [], "character_names": [], "language": "English", "publish_date": "1987-01-01 00:00:00", "ISBN": "0374520259"},
{"url": "https://www.goodreads.com/book/show/759614.Complete_Poems_of_Paul_Laurence_Dunbar", "num_ratings": "153", "num_reviews": "7", "avg_ratings": 4.44, "genres": ["Poetry", "Cultural", "African American", "American", "African American Literature"], "title": "Complete Poems of Paul Laurence Dunbar", "description": ["Illustrated with 10 unique illustrations."], "author": "Paul Laurence Dunbar", "num_pages": "322", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "0848817044"},
{"url": "https://www.goodreads.com/book/show/2183600.Basho", "num_ratings": "733", "num_reviews": "59", "avg_ratings": 4.41, "genres": ["Poetry", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics", "Fiction"], "title": "Basho: The Complete Haiku", "description": ["Basho stands today as Japans most renowned writer, and one of the most revered. Wherever Japanese literature, poetry or Zen are studied, his ", " carries weight. Every new student of haiku quickly learns that Basho was the greatest of the Old Japanese Masters.", "Yet despite his stature, Bashos complete haiku have not been collected into a single volume. Until now.", "To render", "Basho stands today as Japans most renowned writer, and one of the most revered. Wherever Japanese literature, poetry or Zen are studied, his ", " carries weight. Every new student of haiku quickly learns that Basho was the greatest of the Old Japanese Masters.", "Yet despite his stature, Bashos complete haiku have not been collected into a single volume. Until now.", "To render the writers full body of work into English, Jane Reichhold, an American haiku poet and translator, dedicated over ten years of work. In ", ", she accomplishes the feat with distinction. Dividing his creative output into seven periods of development, Reichhold frames each period with a decisive biographical sketch of the poets travels, creative influences and personal triumphs and defeats. Scrupulously annotated notes accompany each poem; and a glossary and two indexes fill out the volume.", "Reichhold notes that, Basho was a genius with words. He obsessively sought out the right word for each phrase of the succinct seventeen-syllable haiku, seeking the very essence of experience and expression. With equal dedication, Reichhold sought the ideal translations. As a result, ", " ", " is likely to become the essential work on this brilliant poet and will stand as the most authoritative book on the subject for many years to come. Original sumi-e ink drawings by artist Shiro Tsujimura complement the haiku throughout the book."], "author": "Matsuo Bashō", "num_pages": "431", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-05-01 00:00:00", "ISBN": "4770030630"},
{"url": "https://www.goodreads.com/book/show/220063.The_City_in_Which_I_Love_You", "num_ratings": "2,518", "num_reviews": "97", "avg_ratings": 4.23, "genres": ["Poetry", "Nonfiction"], "title": "The City in Which I Love You", "description": ["I.", "Furious Versionis", "II.", "The Interrogation", "This Hour And What Is Dead", "Arise, Go Down", "My Father, In Heaven, Is Reading Out Loud", "For A New Citizen Of These United States", "With Ruins", "III.", "This Room And Everything In It", "The City In Which I Love You", "IV.", "The Waiting", "A Story", "Goodnight", "You Must Sing", "Here I Am", "A Final Thing", "V.", "The Cleaving"], "author": "Li-Young Lee", "num_pages": "89", "awards": ["James Laughlin Award (1990)"], "places": [], "character_names": [], "language": "English", "publish_date": "1990-06-01 00:00:00", "ISBN": "0918526833"},
{"url": "https://www.goodreads.com/book/show/6500650-harlem-shadows", "num_ratings": "52", "num_reviews": "2", "avg_ratings": 3.94, "genres": ["Poetry", "Classics", "American", "African American Literature"], "title": "Harlem Shadows", "description": ["Poetry collection by Claude McKay (1922)."], "author": "Claude McKay", "num_pages": "122", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/96051.She_Had_Some_Horses", "num_ratings": "1,007", "num_reviews": "55", "avg_ratings": 4.25, "genres": ["Poetry", "Feminism"], "title": "She Had Some Horses", "description": ["In this powerful collection of poetry, Creek Indian Joy Harjo explores womanhood's most intimate moments. Professor, poetry award winner, performer, and former member of the National Council on the Arts, Harjo’s prose speaks of women's despair, of their imprisonment and ruin at the hands of men and society, but also of their awakenings, power, and love."], "author": "Joy Harjo", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-11-30 00:00:00", "ISBN": "1560258306"},
{"url": "https://www.goodreads.com/book/show/32649.Notebook_of_a_Return_to_the_Native_Land", "num_ratings": "1,260", "num_reviews": "89", "avg_ratings": 4.06, "genres": ["Poetry", "Cultural", "France", "Literature", "European Literature", "French Literature"], "title": "Notebook of a Return to the Native Land", "description": ["Aime Cesaire's masterpiece, ", ", is a work of immense cultural significance and beauty. The long poem was the beginning of Cesaire's quest for negritude, and it became an anthem of Blacks around the world. With its emphasis on unusual juxtapositions of object and metaphor, manipulation of language into puns and neologisms, and rhythm, Ce", "Aime Cesaire's masterpiece, ", ", is a work of immense cultural significance and beauty. The long poem was the beginning of Cesaire's quest for negritude, and it became an anthem of Blacks around the world. With its emphasis on unusual juxtapositions of object and metaphor, manipulation of language into puns and neologisms, and rhythm, Cesaire considered his style a \"beneficial madness\" that could \"break into the forbidden\" and reach the powerful and overlooked aspects of black culture. ", "Clayton Eshleman and Annette Smith achieve a laudable adaptation of Cesaire's work to English by clarifying double meanings, stretching syntax, and finding equivalent English puns, all while remaining remarkably true to the French text. Their treatment of the poetry is marked with imagination, vigor, and accuracy that will clarify difficulties for those already familiar with French, and make the work accessible to those who are not. Andre Breton's introduction, A Great Black Poet, situates the text and provides a moving tribute to C saire. ", " is recommended for readers in comparative literature, post-colonial literature, African American studies, poetry, modernism, and French."], "author": "Aimé Césaire", "num_pages": "66", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-09-24 00:00:00", "ISBN": "0819564524"},
{"url": "https://www.goodreads.com/book/show/23513349-milk-and-honey", "num_ratings": "181,611", "num_reviews": "18,839", "avg_ratings": 4.15, "genres": ["Poetry", "Feminism", "Nonfiction"], "title": "Milk and Honey", "description": [" is a collection of poetry and prose about survival. It is about the experience of violence, abuse, love, loss, and femininity. It is split into four chapters, and each chapter serves a different purpose, deals with a different pain, heals a different heartache. ", " takes readers through a journey of the most bitter moments in life and finds sw", " is a collection of poetry and prose about survival. It is about the experience of violence, abuse, love, loss, and femininity. It is split into four chapters, and each chapter serves a different purpose, deals with a different pain, heals a different heartache. ", " takes readers through a journey of the most bitter moments in life and finds sweetness in them because there is sweetness everywhere if you are just willing to look."], "author": "Rupi Kaur", "num_pages": "204", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-04 00:00:00", "ISBN": "1502784270"},
{"url": "https://www.goodreads.com/book/show/11701.The_Collected_Poems_1957_1987", "num_ratings": "2,824", "num_reviews": "50", "avg_ratings": 4.3, "genres": ["Poetry", "European Literature", "Spanish Literature", "Literature"], "title": "The Collected Poems, 1957-1987", "description": ["Nobel Laureate Octavio Paz is incontestably Latin America's foremost living poet. The Collected Poems of Octavio Paz is a landmark bilingual gathering of all the poetry he has published in book form since 1952, the year of his premier long poem, Sunstone (Piedra de Sol)―here translated anew by Eliot Weinberger―made its appearance. This is followed by the complete texts of", "Nobel Laureate Octavio Paz is incontestably Latin America's foremost living poet. The Collected Poems of Octavio Paz is a landmark bilingual gathering of all the poetry he has published in book form since 1952, the year of his premier long poem, Sunstone (Piedra de Sol)―here translated anew by Eliot Weinberger―made its appearance. This is followed by the complete texts of Days and Occasions (Días Hábiles), Homage and Desecrations (Homenaje y Profanaciones), Salamander (Salamandra), Solo for Two Voices (Solo a Dos Voces), East Slope (Ladera Este), Toward the Beginning (Hacza el Comienzo), Blanco, Topoems (Topoemas), Return (Vuelta), A Draft of Shadows (Pasado en Claro), Airborn (Hijos del Aire), and Paz's most recent collection, A Tree Within (Árbol Adentro).", "With additional translations by Elizabeth Bishop, Paul Blackburn, Lysander Kemp, Denise Levertov, John Frederick Nims, and Charles Tomlinson."], "author": "Octavio Paz", "num_pages": "669", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-04-17 00:00:00", "ISBN": "0811211738"},
{"url": "https://www.goodreads.com/book/show/2213236.Madwomen", "num_ratings": "173", "num_reviews": "30", "avg_ratings": 3.91, "genres": ["Poetry", "Feminism", "Cultural", "Latin American"], "title": "Madwomen: The \"Locas mujeres\" Poems of Gabriela Mistral, a Bilingual Edition", "description": ["A schoolteacher whose poetry catapulted her to early fame in her native Chile and an international diplomat whose boundary-defying sexuality still challenges scholars, Gabriela Mistral (1889–1957) is one of the most important and enigmatic figures in Latin American literature of the last century. The ", " poems collected here are among Mistral’s most complex and c", "A schoolteacher whose poetry catapulted her to early fame in her native Chile and an international diplomat whose boundary-defying sexuality still challenges scholars, Gabriela Mistral (1889–1957) is one of the most important and enigmatic figures in Latin American literature of the last century. The ", " poems collected here are among Mistral’s most complex and compelling, exploring facets of the self ", "—poems marked by the wound of blazing catastrophe and its aftermath of mourning.", "            From disquieting humor to balladlike lyricism to folkloric wisdom, these pieces enact a tragic sense of life, depicting “madwomen” who are anything but mad. Strong and intensely human, Mistral’s poetic women confront impossible situations to which no sane response exists. This groundbreaking collection presents poems from Mistral’s final published volume as well as new editions of posthumous work, featuring the first English-language appearance of many essential poems. ", " promises to reveal a profound poet to a new generation of Anglophone readers while reacquainting Spanish readers with a stranger, more complicated “madwoman” than most have ever known.", " ", " "], "author": "Gabriela Mistral", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2008-04-15 00:00:00", "ISBN": "0226531902"},
{"url": "https://www.goodreads.com/book/show/4623079-from-unincorporated-territory", "num_ratings": "65", "num_reviews": "7", "avg_ratings": 4.4, "genres": ["Poetry", "Fiction"], "title": "From Unincorporated Territory", "description": ["In the preface to his first book, a lyrical epic on the violent convergences of colonialisms on Guam (Japanese and American), history, family, and language (Chamorro and English), Perez writes: \"On some maps, Guam doesn't exist; I point to an empty space in the Pacific and say, 'I'm from here.' On some maps, Guam is a small, unnamed island; I say, 'I'm from this unnamed pl", "In the preface to his first book, a lyrical epic on the violent convergences of colonialisms on Guam (Japanese and American), history, family, and language (Chamorro and English), Perez writes: \"On some maps, Guam doesn't exist; I point to an empty space in the Pacific and say, 'I'm from here.' On some maps, Guam is a small, unnamed island; I say, 'I'm from this unnamed place.' On some maps, Guam is named 'Guam, U.S.A.' I say, 'I'm from a territory of the United States.\" On some maps, Guam is named, simply, 'Guam'; I say, 'I am from Guam.'\" Written in the spirit of Theresa Hak Kyung Cha's Dictee and Barbara Jane Reyes's Poeta en San Francisco, Perez's book promises to add significantly to a growing canon of Pacific poetries."], "author": "Craig Santos Pérez", "num_pages": "98", "awards": [], "places": ["Guam"], "character_names": [], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "0978992962"},
{"url": "https://www.goodreads.com/book/show/23705600-catalog-of-unabashed-gratitude", "num_ratings": "1,399", "num_reviews": "203", "avg_ratings": 4.19, "genres": ["Poetry", "Spirituality", "Nonfiction"], "title": "Catalog of Unabashed Gratitude", "description": [" is a sustained meditation on that which goes away—loved ones, the seasons, the earth as we know it—that tries to find solace in the processes of the garden and the orchard. That is, this is a book that studies the wisdom of the garden and orchard, those places where all—death, sorrow, loss—is converted into what might, with patience, nourish", " is a sustained meditation on that which goes away—loved ones, the seasons, the earth as we know it—that tries to find solace in the processes of the garden and the orchard. That is, this is a book that studies the wisdom of the garden and orchard, those places where all—death, sorrow, loss—is converted into what might, with patience, nourish us."], "author": "Ross Gay", "num_pages": "102", "awards": ["National Book Award Nominee for Poetry (2015)", "National Book Critics Circle Award for Poetry (2015)", "Hurston/Wright Legacy Award Nominee for Poetry (Finalist) (2016)", "Goodreads Choice Award Nominee for Poetry (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-07 00:00:00", "ISBN": "0822963310"},
{"url": "https://www.goodreads.com/book/show/9258089-head-off-split", "num_ratings": "973", "num_reviews": "96", "avg_ratings": 4.11, "genres": ["Poetry", "Cultural", "African American", "Lgbt", "American", "African American Literature"], "title": "Head Off & Split", "description": ["Winner of 2011 National Book Award for Poetry", " Winner of 2012 GLCS Award for Poetry", " Winner of 2012 SIBA Book Award for Poetry", " Nominee for 2012 NAACP Image Award for Outstanding Literary Work in Poetry", " The poems in Nikky Finney’s breathtaking new collection ", "sustain a sensitive and intense dialogue with emblematic figures and events in African American li", "Winner of 2011 National Book Award for Poetry", " Winner of 2012 GLCS Award for Poetry", " Winner of 2012 SIBA Book Award for Poetry", " Nominee for 2012 NAACP Image Award for Outstanding Literary Work in Poetry", " The poems in Nikky Finney’s breathtaking new collection ", "sustain a sensitive and intense dialogue with emblematic figures and events in African American life: from civil rights matriarch Rosa Parks to former secretary of state Condoleezza Rice, from a brazen girl strung out on lightning to a terrified woman abandoned on a rooftop during Hurricane Katrina. Finney’s poetic voice is defined by an intimacy that holds a soft yet exacting eye on the erotic, on uncanny political and family events, like her mother’s wedding waltz with South Carolina senator Strom Thurmond, and then again on the heartbreaking hilarity of an American president’s final State of the Union address. ", "  ", "Artful and intense, Finney’s poems ask us to be mindful of what we fraction, fragment, cut off, dice, dishonor, or throw away, powerfully evoking both the lawless and the sublime."], "author": "Nikky Finney", "num_pages": "102", "awards": ["National Book Award for Poetry (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-27 00:00:00", "ISBN": "0810152169"},
{"url": "https://www.goodreads.com/book/show/226169.Dear_John_Dear_Coltrane", "num_ratings": "73", "num_reviews": "5", "avg_ratings": 4.21, "genres": ["Poetry", "Music"], "title": "Dear John, Dear Coltrane: Poems (Poetry from Illinois)", "description": ["A collection of rhythmic poems with such varied themes as pain, love, and the experience of jazz."], "author": "Michael S. Harper", "num_pages": "88", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-05-01 00:00:00", "ISBN": "0252011937"},
{"url": "https://www.goodreads.com/book/show/479299.The_Collected_Poems", "num_ratings": "61", "num_reviews": "5", "avg_ratings": 4.15, "genres": ["Poetry", "Cultural", "African American", "The United States Of America"], "title": "The Collected Poems", "description": ["Arguably the greatest African-American poet of the century, Sterling Brown was instrumental in bringing the traditions of African-American folk life to readers all over the world. This is the definitive collection of Brown's poems, and the only edition available in the U.S."], "author": "Sterling A. Brown", "num_pages": "267", "awards": ["Lenore Marshall Poetry Prize (1981)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-04-08 00:00:00", "ISBN": "081015045X"},
{"url": "https://www.goodreads.com/book/show/227061.Dura", "num_ratings": "81", "num_reviews": "7", "avg_ratings": 4.36, "genres": ["Poetry"], "title": "Dura", "description": ["Conceived as one poem, Myung Mi Kim's Dura is a whirling experimental symphony of images, forms and rhythms assembled and juxtaposed to translate the experience and gestures of the Korean immigrant woman surviving in America at the end of the twentieth century. Its language negotiates a past -- \"How was it to be the first arrivals in rows and columns\" -- as well as a prese", "Conceived as one poem, Myung Mi Kim's Dura is a whirling experimental symphony of images, forms and rhythms assembled and juxtaposed to translate the experience and gestures of the Korean immigrant woman surviving in America at the end of the twentieth century. Its language negotiates a past -- \"How was it to be the first arrivals in rows and columns\" -- as well as a present -- \"A perceiver without a state\", and has already gained Kim recognition as among the most moving and important \"translators\" in contemporary poetry."], "author": "Myung Mi Kim", "num_pages": "108", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-09-01 00:00:00", "ISBN": "1557132925"},
{"url": "https://www.goodreads.com/book/show/17265206-the-boss", "num_ratings": "165", "num_reviews": "22", "avg_ratings": 4.16, "genres": ["Poetry"], "title": "The Boss", "description": ["Written in “a breathless kind of fury,” the poems in award-winning poet Victoria Chang’s virtuosic third collection The Boss dance across the page with the brutal power and incandescent beauty of spring lightning. Obsessive, brilliant, linguistically playful—the mesmerizing world of ", " is as personal as it is distinctly post-9/11. The result is a breathtaking, one-of", "Written in “a breathless kind of fury,” the poems in award-winning poet Victoria Chang’s virtuosic third collection The Boss dance across the page with the brutal power and incandescent beauty of spring lightning. Obsessive, brilliant, linguistically playful—the mesmerizing world of ", " is as personal as it is distinctly post-9/11. The result is a breathtaking, one-of-a-kind exploration of contemporary American culture, power structures, family life, and ethnic and personal identity."], "author": "Victoria Chang", "num_pages": "64", "awards": ["California Book Award for Poetry (Silver) (2013)", "PEN Center USA Literary Award for Poetry (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-06 00:00:00", "ISBN": "1938073584"},
{"url": "https://www.goodreads.com/book/show/1639380.Girl_at_the_Window", "num_ratings": "4", "num_reviews": "0", "avg_ratings": 4.25, "genres": ["Poetry"], "title": "Girl at the Window: Poems", "description": ["Pinkie Gordon Lane, Louisiana poet laureate, has created in ", " a volume of poetry stitched together by love of place, love of language, and love of family, a volume both intimate and generously welcoming. The logic of the poems is lyrical, rather than narrative, but this poet's lyric is large enough to include a five-year-old child's memory of violence, a t", "Pinkie Gordon Lane, Louisiana poet laureate, has created in ", " a volume of poetry stitched together by love of place, love of language, and love of family, a volume both intimate and generously welcoming. The logic of the poems is lyrical, rather than narrative, but this poet's lyric is large enough to include a five-year-old child's memory of violence, a trip to the bootlegger's with a father likened to Ulyesses, and in a prose poem, memories of a mother who \"tumbled around in the tight little drum of a house in North Philadelphia, guarding its walls fiercely, as if they belonged to the Smithsonian.\""], "author": "Pinkie Gordon Lane", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-11-01 00:00:00", "ISBN": "0807117145"},
{"url": "https://www.goodreads.com/book/show/380189.Like_the_Singing_Coming_off_the_Drums", "num_ratings": "322", "num_reviews": "25", "avg_ratings": 4.25, "genres": ["Poetry", "Cultural", "African American", "Love"], "title": "Like the Singing Coming off the Drums: Love Poems", "description": [" is a dazzling exploration of the intimate and public landscapes of passion from one of our master poets. In haiku, tanka, and sensual blues, Sonia Sanchez writes of the many forms love takes: burning, dreamy, disappointed, vulnerable. With words that revel and reveal, she shares love's painful beauty."], "author": "Sonia Sanchez", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-01-01 00:00:00", "ISBN": "0807068438"},
{"url": "https://www.goodreads.com/book/show/403460.Circle", "num_ratings": "70", "num_reviews": "6", "avg_ratings": 3.84, "genres": ["Poetry"], "title": "Circle", "description": ["Taking its concept of concentricity from the eponymous Ralph Waldo Emerson essay, ", ", the first collection from Victoria Chang, adopts the shape as a trope for gender, family, and history. These lyrical, narrative, and hybrid poems trace the spiral trajectory of womanhood and growth and plot the progression of self as it ebbs away from and returns to its roots in an As", "Taking its concept of concentricity from the eponymous Ralph Waldo Emerson essay, ", ", the first collection from Victoria Chang, adopts the shape as a trope for gender, family, and history. These lyrical, narrative, and hybrid poems trace the spiral trajectory of womanhood and growth and plot the progression of self as it ebbs away from and returns to its roots in an Asian American family and context. Locating human desire within the helixes of politics, society, and war, Chang skillfully draws arcs between T’ang Dynasty suicides and Alfred Hitchcock leading ladies, between the Hong Kong Flower Lounge and an all-you-can-eat Sunday brunch, the Rape of Nanking and civilian casualties in Iraq.", " ", " ", " ", " "], "author": "Victoria Chang", "num_pages": "80", "awards": ["Crab Orchard Award Series in Poetry Open Competition (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-03 00:00:00", "ISBN": "0809326183"},
{"url": "https://www.goodreads.com/book/show/9654817-lucky-fish", "num_ratings": "336", "num_reviews": "44", "avg_ratings": 4.15, "genres": ["Poetry"], "title": "Lucky Fish", "description": ["From Publishers Weekly: Nezhukumatathil's fourth book is fascinated with the small mechanisms of being, whether natural, personal, or imagined. Everything from eating eels in the Ozark mountains to the history of red dye finds a rich life in her poems. At times her lush settings and small stories are reminiscent of fairy tales (\"The frog who wanted to see the sea was mostl", "From Publishers Weekly: Nezhukumatathil's fourth book is fascinated with the small mechanisms of being, whether natural, personal, or imagined. Everything from eating eels in the Ozark mountains to the history of red dye finds a rich life in her poems. At times her lush settings and small stories are reminiscent of fairy tales (\"The frog who wanted to see the sea was mostly disappointed\"), while at others Nezhukumatathil speaks with resonance and fierceness: \"The center of my hands boiled/ with blossoms when we made a family. I would never flee that garden. I swear to/ you here and now: If I ever go missing, know that I am trying to come home.\" Even as the poems jump from the Philippines to India to New York, they still take their time, stopping to notice that \"there is no mystery on water/ greater than the absence of rust,\" and to draw small but wonderful parallels: \"I loved you dark & late. The crocus have found ways to push up & say this/ too.\""], "author": "Aimee Nezhukumatathil", "num_pages": "78", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-15 00:00:00", "ISBN": "1932195580"},
{"url": "https://www.goodreads.com/book/show/52479.God_s_Trombones", "num_ratings": "338", "num_reviews": "50", "avg_ratings": 4.25, "genres": ["Poetry", "Classics", "Religion", "Cultural", "African American", "Nonfiction"], "title": "God's Trombones: Seven Negro Sermons in Verse", "author": "James Weldon Johnson", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-02-01 00:00:00", "ISBN": "0140184031"},
{"url": "https://www.goodreads.com/book/show/58098.for_colored_girls_who_have_considered_suicide_when_the_rainbow_is_enuf", "num_ratings": "27,184", "num_reviews": "647", "avg_ratings": 4.28, "genres": ["Poetry", "Plays", "Fiction", "Feminism", "Cultural", "African American", "Drama", "Race"], "title": "for colored girls who have considered suicide/when the rainbow is enuf", "description": ["From its inception in California in 1974 to its highly acclaimed critical success at Joseph Papp's Public Theater and on Broadway, the Obie Award-winning ", " has excited, inspired, and transformed audiences all over the country. Passionate and fearless, Shange's words reveal what it is to be of color and fe", "From its inception in California in 1974 to its highly acclaimed critical success at Joseph Papp's Public Theater and on Broadway, the Obie Award-winning ", " has excited, inspired, and transformed audiences all over the country. Passionate and fearless, Shange's words reveal what it is to be of color and female in the twentieth century. First published in 1975 when it was praised by ", " for \"encompassing...every feeling and experience a woman has ever had,\" ", " will be read and performed for generations to come. Here is the complete text, with stage directions, of a groundbreaking dramatic prose poem written in vivid and powerful language that resonates with unusual beauty in its fierce message to the world."], "author": "Ntozake Shange", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-09-01 00:00:00", "ISBN": "0684843269"},
{"url": "https://www.goodreads.com/book/show/5989.Li_Po_and_Tu_Fu", "num_ratings": "359", "num_reviews": "24", "avg_ratings": 4.1, "genres": ["Poetry", "Cultural", "China", "Asian Literature", "Chinese Literature", "Classics", "Cultural", "Asia", "Literature"], "title": "Li Po and Tu Fu: Poems", "description": ["Li Po (AD 701-62) and Tu Fu (AD 712-70) were devoted friends who are traditionally considered to be among China's greatest poets. Li Po, a legendary carouser, was an itinerant poet whose writing, often dream poems or spirit-journeys, soars to sublime heights in its descriptions of natural scenes and powerful emotions. His sheer escapism and joy is balanced by Tu Fu, who ex", "Li Po (AD 701-62) and Tu Fu (AD 712-70) were devoted friends who are traditionally considered to be among China's greatest poets. Li Po, a legendary carouser, was an itinerant poet whose writing, often dream poems or spirit-journeys, soars to sublime heights in its descriptions of natural scenes and powerful emotions. His sheer escapism and joy is balanced by Tu Fu, who expresses the Confucian virtues of humanity and humility in more autobiographical works that are imbued with great compassion and earthy reality, and shot through with humour. Together these two poets of the T'ang dynasty complement each other so well that they often came to be spoken of as one - 'Li-Tu' - who covers the whole spectrum of human life, experience and feeling."], "author": "Li Bai", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1973-04-26 00:00:00", "ISBN": "0140442723"},
{"url": "https://www.goodreads.com/book/show/44055.The_Heights_of_Macchu_Picchu", "num_ratings": "752", "num_reviews": "60", "avg_ratings": 4.17, "genres": ["Travel", "European Literature", "Spanish Literature", "Poetry", "Cultural", "Latin American"], "title": "The Heights of Macchu Picchu", "description": [" is the finest and most famous of Neruda's longer poems and provides the key to his earlier work. It was inspired by his journey to Macchu Picchu, the Peruvian Inca city high in the Andes. Neruda's journey takes on all the symbolic qualities of a personal \"venture into the interior\" as the poem progresses, exploring both the roots of the poet's", " is the finest and most famous of Neruda's longer poems and provides the key to his earlier work. It was inspired by his journey to Macchu Picchu, the Peruvian Inca city high in the Andes. Neruda's journey takes on all the symbolic qualities of a personal \"venture into the interior\" as the poem progresses, exploring both the roots of the poet's identity and the history of Latin America. This translation has been rendered by the distinquished poet Nathaniel Tarn and is presented in a bilingual edition, with the Spanish and English texts on facing pages."], "author": "Pablo Neruda", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1967-01-01 00:00:00", "ISBN": "0374506485"},
{"url": "https://www.goodreads.com/book/show/1094574.Jump_Back_Honey_Jump_Back_Honey", "num_ratings": "25", "num_reviews": "5", "avg_ratings": 4.36, "genres": ["Poetry", "Childrens", "Cultural", "African American", "Childrens", "Picture Books"], "title": "Jump Back, Honey Jump Back, Honey: The Poems of Paul Laurence Dunbar", "description": ["This joyous celebration of Paul Laurence Dunbar illuminates the beauty of Dunbar's poems. Young readers will rejoice in this vibrant collection, which resounds with a music all its own. Here, you'll find many poems that are considered classics -- \"Little Brown Baby, \" \"When Malindy Sings, \" \"Dawn\" -- and several others that have made Paul Laurence Dunbar one of the most ch", "This joyous celebration of Paul Laurence Dunbar illuminates the beauty of Dunbar's poems. Young readers will rejoice in this vibrant collection, which resounds with a music all its own. Here, you'll find many poems that are considered classics -- \"Little Brown Baby, \" \"When Malindy Sings, \" \"Dawn\" -- and several others that have made Paul Laurence Dunbar one of the most cherished of American poets. A rich collection that is at once playful and poignant, Jump Back, Honey is a gem to grace every bookshelf -- an unforgettable treasure that begs to be read again and again. In this beautiful book, the award-winning artists offer muses and memories of Paul Laurence Dunbar's poetry. Art styles range from watercolor to scratchboard, providing a lush, varied book that will delight readers of all ages"], "author": "Paul Laurence Dunbar", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-09-15 00:00:00", "ISBN": "0786804645"},
{"url": "https://www.goodreads.com/book/show/6472589-on-the-imperial-highway", "num_ratings": "25", "num_reviews": "7", "avg_ratings": 4.24, "genres": ["Poetry", "Cultural", "African American", "Love"], "title": "On the Imperial Highway: New and Selected Poems", "description": ["Poetry. African American Studies. Jayne Cortez is the author of eleven books of poetry and performer of her poems with music on nine recordings. Her voice is celebrated for its political, surrealistic, dynamic innovations in lyricism, and visceral sound. Cortez has presented her work and ideas at universities, museums, and festivals around the world. \"Cortez has been and c", "Poetry. African American Studies. Jayne Cortez is the author of eleven books of poetry and performer of her poems with music on nine recordings. Her voice is celebrated for its political, surrealistic, dynamic innovations in lyricism, and visceral sound. Cortez has presented her work and ideas at universities, museums, and festivals around the world. \"Cortez has been and continues to be an explorer, probing the valleys and chasms of human existence. No ravine is too perilous, no abyss too threatening for Jayne Cortez\"--Maya Angelou. \"If you haven't read Jayne Cortez, you're missing some of the best that life has to offer. A compellingly original voice of fire and freedom\"--Franklin Rosemont. \"Jayne Cortez's poems are filled with images that most of us are afraid to see\"--Walter Mosley."], "author": "Jayne Cortez", "num_pages": "131", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-02-24 00:00:00", "ISBN": "1931236909"},
{"url": "https://www.goodreads.com/book/show/24892461-bodymap", "num_ratings": "138", "num_reviews": "18", "avg_ratings": 4.58, "genres": ["Poetry", "Glbt", "Queer", "Disability", "Feminism", "Lgbt"], "title": "Bodymap", "description": ["In ", ", Lambda Award winning writer Leah Lakshmi Piepzna-Samarasinha sings a queer disabled femme of colour love song filled with hard femme poetics and disability justice. The first book of the author to examine disability from a queer femme of color lens, ", " contains work created and performed with Sins Invalid. ", " maps hard and vulnerable terrains of queer", "In ", ", Lambda Award winning writer Leah Lakshmi Piepzna-Samarasinha sings a queer disabled femme of colour love song filled with hard femme poetics and disability justice. The first book of the author to examine disability from a queer femme of color lens, ", " contains work created and performed with Sins Invalid. ", " maps hard and vulnerable terrains of queer desire, survivorhood, transformative love, sick and disabled queer genius and all the homes we claim and deserve.", "\"These poems are a gift for your love for self, your love itself and everyone you love. It is rare that a poet priestess offers words that allow us to emerge reborn with dirt, glitter and tenderness... Revere it. Revel in it. Read it again and again!\" ", "—Alexis Pauline Gumbs", "\"", " uses the alchemy of the voice on the page to transform words into an ache in the pit of me. I want what these poems demand: to be free to love & die, to be resurrected in time, & to be restored by desire. Piepzna-Samarasinha has located where this body houses the smirk learned from the sidewalk, the reason to do the difficult, and the blessings for the best worst thing.\"", "—Meg Day, author of ", " ", "\"Sharp, yet remarkably compassionate, Piepzna-Samarasinha knows that the poem is no place for tidy inquiry and easy answers. She offers her own tenacious guts and veins on each and every page. Only someone who understands rage and reconciliation and blood and bone can write like this.\"", "—Amber Dawn, author of "], "author": "Leah Lakshmi Piepzna-Samarasinha", "num_pages": "112", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-31 00:00:00", "ISBN": "1927494508"},
{"url": "https://www.goodreads.com/book/show/1549561.Border_Crosser_With_a_Lamborghini_Dream", "num_ratings": "22", "num_reviews": "2", "avg_ratings": 4.23, "genres": ["Poetry", "Literature", "American", "Poetry Plays", "Literature", "Multicultural Literature"], "title": "Border-Crosser With a Lamborghini Dream", "description": ["From one of the prominent Chicano poets writing today comes a collection of poems to take your breath away. With dazzling speed and energy, Juan Felipe Herrera sends readers rocketing through verbal space in a celebration of the rhythms and textures of words that will make you want to shout, dance, and read out loud. Like a wild ride in a fast car, ", "From one of the prominent Chicano poets writing today comes a collection of poems to take your breath away. With dazzling speed and energy, Juan Felipe Herrera sends readers rocketing through verbal space in a celebration of the rhythms and textures of words that will make you want to shout, dance, and read out loud. Like a wild ride in a fast car, ", " moves at breakneck speed, a post-Lorca journey across the new millennium terrain. Words careen through space and time, through blighted urban landscapes, past banjos and bees, past AIDS faces and mad friars, past severed heads and steel-toed border-crosser boots.", " To the rhythm of “The Blue Eyed Mambo that Unveils My Lover’s Belly”and the sounds of the Last Mayan Acid rock band, Herrera races through the hallucinations of a nation that remains just outside of paradise. With dazzling poems that roar from the darkest corners of our minds toward an ecstatic celebration of the lushness of language, ", " is a celebration of a world that is both sacred and cruel, a world of “Poesy Chicano style undone wild” by one of the most daring poets of our time."], "author": "Juan Felipe Herrera", "num_pages": "99", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-12-01 00:00:00", "ISBN": "0816519323"},
{"url": "https://www.goodreads.com/book/show/128222.The_August_Sleepwalker", "num_ratings": "104", "num_reviews": "8", "avg_ratings": 4.13, "genres": ["Poetry", "Cultural", "China"], "title": "The August Sleepwalker", "description": ["First published in the U.S. in 1990, the year after the uprising of Chinese students at Tiananmen Square, The August Sleepwalker collects all the early poetry of Bei Dao, China's premier poet, now living in exile."], "author": "Bei Dao", "num_pages": "140", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-04-01 00:00:00", "ISBN": "0811211320"},
{"url": "https://www.goodreads.com/book/show/106028.Collected_Poems", "num_ratings": "216", "num_reviews": "22", "avg_ratings": 4.23, "genres": ["Poetry", "Cultural", "African American", "The United States Of America", "Literature", "American"], "title": "Collected Poems", "description": ["Robert Hayden was a fellow of the American Academy of Poets, a poetry consultant to the Library of Congress, and a professor of English at the University of Michigan. He received numerous awards for his poetry in his lifetime, among them to Hopwood Awards, the Grand Prize for Poetry at the First World Festival of Negro Arts, and the Russell Loines Award for distinguished p", "Robert Hayden was a fellow of the American Academy of Poets, a poetry consultant to the Library of Congress, and a professor of English at the University of Michigan. He received numerous awards for his poetry in his lifetime, among them to Hopwood Awards, the Grand Prize for Poetry at the First World Festival of Negro Arts, and the Russell Loines Award for distinguished poetic achievement from the National Institute of Arts and Letters. Arnold Rampersad is Woodrow Wilson Professor of Literature at Princeton University."], "author": "Robert Hayden", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-02-17 00:00:00", "ISBN": "0871401592"},
{"url": "https://www.goodreads.com/book/show/17287063-urban-tumbleweed", "num_ratings": "151", "num_reviews": "30", "avg_ratings": 3.87, "genres": ["Poetry"], "title": "Urban Tumbleweed: Notes from a Tanka Diary", "description": ["Urban tumbleweed, some people call it,", "discarded plastic bag we see in every city", "blown down the street with vagrant wind.", "            —from ", "Urban tumbleweed, some people call it,", "discarded plastic bag we see in every city", "blown down the street with vagrant wind.", "            —from ", " is the poet Harryette Mullen’s exploration of spaces where the city and the natural world collide. Written out of a daily practice of walking, Mullen’s stanzas adapt the traditional Japanese tanka, a poetic form suited for recording fleeting impressions, describing environmental transitions, and contemplating the human being’s place in the natural world. But, as she writes in her preface, “What is natural about being human? What to make of a city dweller taking a ‘nature walk’ in a public park while listening to a podcast with ear-bud headphones?”"], "author": "Harryette Mullen", "num_pages": "138", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-05 00:00:00", "ISBN": "1555976565"},
{"url": "https://www.goodreads.com/book/show/807765.Spring_Essence", "num_ratings": "227", "num_reviews": "31", "avg_ratings": 4.17, "genres": ["Poetry", "Classics"], "title": "Spring Essence: The Poetry of Hô Xuân Huong", "description": ["Hồ Xuân Hương — whose name translates as \"Spring Essence\" — is one of the most important and popular poets in Vietnam. A concubine, she became renowned for her poetic skills, writing subtly risqué poems which used double entendre and sexual innuendo as a vehicle for social, religious, and political commentary.", "Hồ Xuân Hương — whose name translates as \"Spring Essence\" — is one of the most important and popular poets in Vietnam. A concubine, she became renowned for her poetic skills, writing subtly risqué poems which used double entendre and sexual innuendo as a vehicle for social, religious, and political commentary.", "The publication of ", " is a major historical and cultural event. It features a \"tri-graphic\" presentation of English translations alongside both the modern Vietnamese alphabet and the nearly extinct calligraphic ", " writing system, the hand-drawn calligraphy in which Hồ Xuân Hương originally wrote her poems. It represents the first time that this calligraphy—the carrier of Vietnamese culture for over a thousand years—will be printed using moveable type. From the technology demonstrated in this book scholars worldwide can begin to recover an important part of Vietnam’s literary history. Meanwhile, readers of all interests will be fascinated by the poetry of Ho Xuan Huong, and the scholarship of John Balaban.", "The translator, John Balaban, was twice a National Book Award finalist for his own poetry and is one of the preeminent American authorities on Vietnamese literature. During the war Balaban served as a conscientious objector, working to bring war-injured children better medical care. He later returned to Vietnam to record folk poetry. Like Alan Lomax’s pioneering work in American music, Balaban was to first to record Vietnam’s oral tradition. This important work led him to the poetry of Hồ Xuân Hương.", "Ngo Than Nhan, a computational linguist from NYU’s Courant Institute of Mathematics, has digitized the ancient ", " calligraphy."], "author": "Hồ Xuân Hương", "num_pages": "140", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-10-01 00:00:00", "ISBN": "1556591489"},
{"url": "https://www.goodreads.com/book/show/790525.Sunstone_Piedra_De_Sol", "num_ratings": "694", "num_reviews": "47", "avg_ratings": 4.39, "genres": ["Poetry", "Nobel Prize", "European Literature", "Spanish Literature"], "title": "Sunstone/Piedra De Sol", "description": ["Presented in Eliot Weinberger's excellent new translation with the Spanish texts ", ", this is the 1957 poem \"that definitively established Paz as a major international figure\" (", "). Written as a single cyclical sentence (at the end of the poem the first six lines are written again), ", " is a tour de force of momentum. It takes as its structural basis the ci", "Presented in Eliot Weinberger's excellent new translation with the Spanish texts ", ", this is the 1957 poem \"that definitively established Paz as a major international figure\" (", "). Written as a single cyclical sentence (at the end of the poem the first six lines are written again), ", " is a tour de force of momentum. It takes as its structural basis the circular Aztec calendar, which measured the synodic period of the planet Venus (584 days—the number of lines of ", "). But, as The New Republic noted, \"this esoteric correlative design... does not circumscribe its subject. [It is] a lyrically discursive exploration of time and memory, of erotic love, or art and writing.\""], "author": "Octavio Paz", "num_pages": "60", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-10-17 00:00:00", "ISBN": "0811211959"},
{"url": "https://www.goodreads.com/book/show/271456.Alabanza", "num_ratings": "238", "num_reviews": "25", "avg_ratings": 4.44, "genres": ["Poetry", "European Literature", "Spanish Literature"], "title": "Alabanza: New and Selected Poems 1982-2002", "description": [" is a twenty-year collection charting the emergence of Martín Espada as the preeminent Latino lyric voice of his generation. \"Alabanza\" means \"praise\" in Spanish, and Espada praises the people Whitman called \"them the others are down upon\": the African slaves who brought their music to Puerto Rico; a prison inmate provoking brawls so he could write poetry in solita", " is a twenty-year collection charting the emergence of Martín Espada as the preeminent Latino lyric voice of his generation. \"Alabanza\" means \"praise\" in Spanish, and Espada praises the people Whitman called \"them the others are down upon\": the African slaves who brought their music to Puerto Rico; a prison inmate provoking brawls so he could write poetry in solitary confinement; a janitor and his solitary strike; Espada's own father, who was jailed in Mississippi for refusing to go to the back of the bus. The poet bears witness to death and rebirth at the ruins of a famine village in Ireland, a town plaza in México welcoming a march of Zapatista rebels, and the courtroom where he worked as a tenant lawyer. The title poem pays homage to the immigrant food-service workers who lost their lives in the attack on the World Trade Center. From the earliest out-of-print work to the seventeen new poems included here, Espada celebrates the American political imagination and the resilience of human dignity. ", " is the epic vision of a writer who, in the words of Russell Banks, \"is one of the handful of American poets who are forging a new American language, one that tells the unwritten history of the continent, speaks truth to power, and sings songs of selves we can no longer silence.\" An American Library Association Notable Book of 2003 and a 2003 New York Public Library Book to Remember.", "\"To read this work is to be struck breathless, and surely, to come away changed.\"", "—Barbara Kingsolver ", "\"Martín Espada is the Pablo Neruda of North American authors. If it was up to me, I'd select him as the Poet Laureate of the United States.\"", "—Sandra Cisneros ", "\"With these new and selected poems, you can grasp how powerful a poet Espada is—his range, his compassion, his astonishing images, his sense of history, his knowledge of the lives on the underbelly of cities, his bright anger, his tenderness, his humor. \"", "—Marge Piercy ", "\"Espada's poems are not just clarion calls to the heart and conscience, but also wonderfully crafted gems.\"", "—Julia Alvarez ", "\"A passionate, readable poetry that makes [Espada] arguably the most important 'minority' U.S. poet since Langston Hughes.\"", "—", "\"Neruda is dead, but if ", " is any clue, his ghost lives through a poet named Martín Espada.\"", "—"], "author": "Martín Espada", "num_pages": "245", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-17 00:00:00", "ISBN": "0393326217"},
{"url": "https://www.goodreads.com/book/show/130550.The_Butterfly_s_Burden", "num_ratings": "3,753", "num_reviews": "497", "avg_ratings": 4.06, "genres": ["Poetry"], "title": "The Butterfly's Burden", "description": ["“Mahmoud Darwish is the Essential Breath of the Palestinian people, the eloquent witness of exile and belonging, exquisitely tuned singer of images that invoke, link, and shine a brilliant light into the world’s whole heart. What he speaks has been embraced by readers around the world—his in an utterly necessary voice, unforgettable once discovered.”—Naomi Shihab Nye", "Mahmou", "“Mahmoud Darwish is the Essential Breath of the Palestinian people, the eloquent witness of exile and belonging, exquisitely tuned singer of images that invoke, link, and shine a brilliant light into the world’s whole heart. What he speaks has been embraced by readers around the world—his in an utterly necessary voice, unforgettable once discovered.”—Naomi Shihab Nye", "Mahmoud Darwish is the leading poet in the Arab world, an artist and activist who attracts thousands to his public readings.", " combines the complete text of Darwish's two most recent full-length volumes, linked by the stunning memoir-witness poem “A State of Siege.” Love poems, sonnets, journal-like distillations, and interlaced lyrics balance old literary traditions with new forms, highlighting loving reflections alongside bitter longing.", " is the author of 30 books of poetry and prose, as well as the Palestinian Declaration of Independence. He has worked as a journalist, was director of the Palestinian Research Center, and lived in exile until his return to Palestine in 1996. He has received many international awards for his poetry.", "Translator ", " is a physician based in Houston, Texas. His first book of poems received the Yale Younger Poets prize."], "author": "Mahmoud Darwish", "num_pages": "327", "awards": ["Saif Ghobash Banipal Prize for Arabic Literary Translation (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-01 00:00:00", "ISBN": "1556592418"},
{"url": "https://www.goodreads.com/book/show/873430.Caroling_Dusk", "num_ratings": "32", "num_reviews": "3", "avg_ratings": 4.22, "genres": ["Poetry", "Cultural", "African American"], "title": "Caroling Dusk: An Anthology of Verse by Black Poets of the Twenties", "description": ["This selection from the work of thirty-eight poets was made by Countee Cullen in 1927. His stated purpose at the time was to bring together a miscellany of deeply appreciated but scattered verse. Beginning with the work of Paul Laurence Dunbar, who, though there were black poets before him, is generally credited as the first black poet to make a deep impression on the lite", "This selection from the work of thirty-eight poets was made by Countee Cullen in 1927. His stated purpose at the time was to bring together a miscellany of deeply appreciated but scattered verse. Beginning with the work of Paul Laurence Dunbar, who, though there were black poets before him, is generally credited as the first black poet to make a deep impression on the literary world, the book includes the writings of James Weldon Johnson, W. E. B. Du Bois, Jessie Faucet, Sterling A. Brown, Arna Bontemps, Langston Hughes, and Countee Cullen himself, to name only a few.", "Each poem includes poignant biographical notes written by the poets themselves, with the exception of the notes on Dunbar (written by his wife), Joseph S. Cotter, Jr. (written by his father), and Lula Weeden (written by her mother).", "Most of the poets became well known and widely published in the years that followed. These poems remain powerful statements of what it means to be human, whatever the race.", "Long out of print, \"Caroling Dusk\" is a valuable addition to the body of black literature. This is the first time the anthology has appeared in a paperback edition."], "author": "Countee Cullen", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-01-19 00:00:00", "ISBN": "0806513497"},
{"url": "https://www.goodreads.com/book/show/698169.Outlandish_Blues", "num_ratings": "29", "num_reviews": "3", "avg_ratings": 4.17, "genres": ["Poetry", "Cultural", "African American"], "title": "Outlandish Blues (Wesleyan Poetry Series)", "description": ["Fierce and sensual, the poems in Outlandish Blues merge everyday speech with a shimmering lyricism and burst from the page into song. Honoree Fanonne Jeffers sees the blues, what she terms the \"shared 'blue notes, ''' as an important intersection between the secular and the divine, and between the various African American vernacular traditions, from spirituals to jazz. Par", "Fierce and sensual, the poems in Outlandish Blues merge everyday speech with a shimmering lyricism and burst from the page into song. Honoree Fanonne Jeffers sees the blues, what she terms the \"shared 'blue notes, ''' as an important intersection between the secular and the divine, and between the various African American vernacular traditions, from spirituals to jazz. Part Nina Simone, part Bessie Smith, her poems are filled with a sweaty honesty, moving from the personal to the collective experience. This movement is often accomplished through the use of personae, concentrated here in a stunning series of poems on the Biblical figures of Hagar and Sarah. Whether about a contemporary domestic scene, a slave ship, or Aretha Franklin, these are poems that speak to the soul of experience."], "author": "Honorée Fanonne Jeffers", "num_pages": "72", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-04-29 00:00:00", "ISBN": "0819565849"},
{"url": "https://www.goodreads.com/book/show/899115.Loter_a_Cards_and_Fortune_Poems", "num_ratings": "50", "num_reviews": "6", "avg_ratings": 4.0, "genres": ["Poetry", "Art"], "title": "Lotería Cards and Fortune Poems: A Book of Lives", "description": ["The gorgeous black and white line art inside this hefty little book instantly caught my eye. These linocut drawings were not the regular lotería images. They were modern adaptations, made with painstaking detail (think of a turn-of-the-millenium, wired Posada) and showing a distinctive sense of humor and pathos. The poetry, commissioned especially for the drawings, also sh", "The gorgeous black and white line art inside this hefty little book instantly caught my eye. These linocut drawings were not the regular lotería images. They were modern adaptations, made with painstaking detail (think of a turn-of-the-millenium, wired Posada) and showing a distinctive sense of humor and pathos. The poetry, commissioned especially for the drawings, also showed a fresh and modern take on the icons of Mexicanismo and Chicanismo.\"—", "Introduction", "The Lottery", "The Hunchback", "The Armadillo", "Death", "The Fly", "The Bell", "The Horse", "The Press", "The Smokers", "The Pear", "The Guitar", "The Little Saint", "The Rooster", "The Bicycle", "The Archangel", "The Palm Tree", "The Hermit", "The Bat", "The Witch", "The Friends", "The Cactus", "God", "The Hand", "The Fruit", "The Pig", "The Glutton", "The Flight", "The Ostrich", "The Fall", "The Virgin", "The Tree", "The Star", "The Bottle", "The Drunkards", "The Scorpion", "Corn", "Fire", "The Clown", "Vengeance", "The Prodigal Son", "The Soldier", "The Hunter", "The Mermaid", "The Lion", "The Wrestler", "The Wetback", "The Immigration Officer", "Feet", "The Railroad", "The Ladder", "The Serpent", "The Dancer", "The Scissors", "Eve", "Adam", "The Plague", "Hell", "The Giant", "The Musicians", "The Poet", "The Devil", "The Goat", "The Victim", "The Flag", "The Canoe", "The Circus", "The Camel", "Bad Government", "Sadness", "The Sun", "The Fish", "The Wound", "The Chair", "The Worker", "The Airplane", "The Trap", "The Heart", "The Sword", "The Comet", "The Beggars", "The Cat", "The Horseman", "The Cow", "The Magician", "Torture", "The Absent One", "The Crab", "Heaven", "The Lizard", "The Sandals", "The Knife", "The Hen", "The Inspired One", "The Deer", "The Zapatista", "The Dog", "The Old Man", "The Monkey", "The Hanged One", "The Eagle", "The Bath", "The Guardian Angel", "The World", "The Rose"], "author": "Juan Felipe Herrera", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-01-01 00:00:00", "ISBN": "087286359X"},
{"url": "https://www.goodreads.com/book/show/807698.Poeta_En_San_Francisco", "num_ratings": "121", "num_reviews": "18", "avg_ratings": 4.17, "genres": ["Poetry", "Museology", "Cultural Heritage"], "title": "Poeta En San Francisco", "description": ["Poetry. Asian American Studies. POETA EN SAN FRANCISCO is the winner of the highly prestigious James Laughlin Award for 2005, awarded annually from the Academy of American Poetry and the only prize for a second book of poetry in the United States. Although Reyes' first book was not as widely known as the first book of many of the other eligible poets, the judges neverthele", "Poetry. Asian American Studies. POETA EN SAN FRANCISCO is the winner of the highly prestigious James Laughlin Award for 2005, awarded annually from the Academy of American Poetry and the only prize for a second book of poetry in the United States. Although Reyes' first book was not as widely known as the first book of many of the other eligible poets, the judges nevertheless courageously chose this risky, radical, and deserving second book put out by an energetic but very small publisher. Reyes received her undergraduate education at UC Berkeley, where she also served as Editor-in-Chief of the Filipino American literary publication Maganda. Her work has been nominated for a Pushcart Prize. Her first book, Gravities of Center, was published by Arkipelago Books (SF) in 2003."], "author": "Barbara Jane Reyes", "num_pages": "105", "awards": ["James Laughlin Award (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "0975937642"},
{"url": "https://www.goodreads.com/book/show/187143.Words_Under_the_Words", "num_ratings": "1,165", "num_reviews": "66", "avg_ratings": 4.4, "genres": ["Poetry", "Nonfiction"], "title": "Words Under the Words: Selected Poems", "description": [" gathers into a single volume the finest poems by one of the most exciting, accessible poets in America today. This long-awaited collection draws from Naomi Shihab Nye's three critically acclaimed books: ", " and National Poetry Series winner, "], "author": "Naomi Shihab Nye", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-10-01 00:00:00", "ISBN": "0933377290"},
{"url": "https://www.goodreads.com/book/show/6711397-lighthead", "num_ratings": "1,392", "num_reviews": "94", "avg_ratings": 4.11, "genres": ["Poetry", "Cultural", "African American"], "title": "Lighthead", "description": [" ", "In his fourth collection, Terrance Hayes investigates how we construct experience. With one foot firmly grounded in the everyday and the other hovering in the air, his poems braid dream and reality into a poetry that is both dark and buoyant. Cultural icons as diverse as Fela Kuti, Harriet Tubman, and Wallace Stevens appear", " ", "In his fourth collection, Terrance Hayes investigates how we construct experience. With one foot firmly grounded in the everyday and the other hovering in the air, his poems braid dream and reality into a poetry that is both dark and buoyant. Cultural icons as diverse as Fela Kuti, Harriet Tubman, and Wallace Stevens appear with meditations on desire and history. We see Hayes testing the line between story and song in a series of stunning poems inspired by the Pecha Kucha, a Japanese presenta­tion format. This innovative collection presents the light- headedness of a mind trying to pull against gravity and time. Fueled by an imagination that enlightens, delights, and ignites, ", " leaves us illuminated and scorched."], "author": "Terrance Hayes", "num_pages": "95", "awards": ["National Book Award for Poetry (2010)", "National Book Critics Circle Award Nominee for Poetry (2010)", "Hurston/Wright Legacy Award Nominee for Poetry (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-30 00:00:00", "ISBN": "0143116967"},
{"url": "https://www.goodreads.com/book/show/20702539-prelude-to-bruise", "num_ratings": "1,217", "num_reviews": "169", "avg_ratings": 4.3, "genres": ["Poetry", "Lgbt", "Glbt", "Queer", "Cultural", "African American", "Race"], "title": "Prelude to Bruise", "description": ["Take your hand out", "from under my pillow.", "And take your sheets with you.", "Drag them under. Make pretend ghosts.", "I can't have you rattling the bed springs", "so keep still, keep quiet.", "Mistake yourself for shadows.", "Learn the lullabies of lint.", "works as the editor of BuzzfeedLGBT."], "author": "Saeed Jones", "num_pages": "103", "awards": ["Stonewall Book Award for Literature (2015)", "Thom Gunn Award for Gay Poetry Nominee (2015)", "National Book Critics Circle Award Nominee for Poetry (2014)", "Goodreads Choice Award Nominee for Poetry (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-09 00:00:00", "ISBN": "1566893747"},
{"url": "https://www.goodreads.com/book/show/86560.Rub_iy_t_of_Omar_Khayy_m", "num_ratings": "15,170", "num_reviews": "1,257", "avg_ratings": 4.18, "genres": ["Poetry", "Classics", "Philosophy", "Fiction", "Literature"], "title": "Rubáiyát of Omar Khayyám", "description": ["The Rubáiyát of Omar Khayyám (Persian: رباعیات عمر خیام) is the title that Edward FitzGerald gave to his translation of a selection of poems, originally written in Persian and numbering about a thousand, attributed to Omar Khayyám (1048–1131), a Persian poet, mathematician and astronomer. A ruba'i is a two-line stanza with two parts (or hemistichs) per line, hence the word", "The Rubáiyát of Omar Khayyám (Persian: رباعیات عمر خیام‎) is the title that Edward FitzGerald gave to his translation of a selection of poems, originally written in Persian and numbering about a thousand, attributed to Omar Khayyám (1048–1131), a Persian poet, mathematician and astronomer. A ruba'i is a two-line stanza with two parts (or hemistichs) per line, hence the word rubáiyát (derived from the Arabic language root for \"four\"), meaning \"quatrains\"."], "author": "Omar Khayyám", "num_pages": "52", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-30 00:00:00", "ISBN": "1905432453"},
{"url": "https://www.goodreads.com/book/show/270905.Plot", "num_ratings": "151", "num_reviews": "12", "avg_ratings": 3.81, "genres": ["Poetry"], "title": "Plot", "description": ["In her third collection of poems, Claudia Rankine creates a profoundly daring, ingeniously experimental examination of pregnancy, childbirth, and artistic expression. Liv, an expectant mother, and her husband, Erland, are at an impasse from her reluctance to bring new life into a bewildering world. The couple's journey is charted through conversations, dreams, memories, an", "In her third collection of poems, Claudia Rankine creates a profoundly daring, ingeniously experimental examination of pregnancy, childbirth, and artistic expression. Liv, an expectant mother, and her husband, Erland, are at an impasse from her reluctance to bring new life into a bewildering world. The couple's journey is charted through conversations, dreams, memories, and meditations, expanding and exploding the emotive capabilities of language and form. A text like no other, it crosses genres, combining verse, prose, and dialogue to achieve an unparalleled understanding of creation and existence."], "author": "Claudia Rankine", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-13 00:00:00", "ISBN": "080213792X"},
{"url": "https://www.goodreads.com/book/show/200567.Domestic_Work", "num_ratings": "401", "num_reviews": "35", "avg_ratings": 4.14, "genres": ["Poetry", "Cultural", "African American", "Race", "Fiction", "American", "Southern"], "title": "Domestic Work: Poems", "description": ["Winner of the 2001 Mississippi Institute of Arts and Letters Award", "In this widely celebrated debut collection of poems, Natasha Trethewey draws moving domestic portraits of families, past and present, caught in the act of earning a living and managing their households. Small moments taken from a labor-filled day--and rendered here in graceful and readable verse--reveal the", "Winner of the 2001 Mississippi Institute of Arts and Letters Award", "In this widely celebrated debut collection of poems, Natasha Trethewey draws moving domestic portraits of families, past and present, caught in the act of earning a living and managing their households. Small moments taken from a labor-filled day--and rendered here in graceful and readable verse--reveal the equally hard emotional work of memory and forgetting, the extraordinary difficulty of trying to live with or without someone."], "author": "Natasha Trethewey", "num_pages": "70", "awards": ["Lillian Smith Book Award (2001)", "Cave Canem Poetry Prize (1999)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-08-01 00:00:00", "ISBN": "1555973094"},
{"url": "https://www.goodreads.com/book/show/150320.Thomas_and_Beulah", "num_ratings": "981", "num_reviews": "70", "avg_ratings": 3.87, "genres": ["Poetry", "Cultural", "African American", "Academic", "Read For School", "Literary Fiction", "Fiction"], "title": "Thomas and Beulah", "description": ["The poems in this unusual book tell a story, forming a narrative almost like a realistic novel. Read in sequence as intended, they tell of the lives of a married black couple (not unlike Dove's own grandparents) from the early part of the century until their deaths in the 1960s, a period that spans the great migration of blacks from rural south to urban north. But this is", "The poems in this unusual book tell a story, forming a narrative almost like a realistic novel. Read in sequence as intended, they tell of the lives of a married black couple (not unlike Dove's own grandparents) from the early part of the century until their deaths in the 1960s, a period that spans the great migration of blacks from rural south to urban north. But this is merely the social backdrop to the story of a marriage. Two separate sequences offer two views of the couple's lives: the first, \"Mandolin,\" consists of 23 poems giving Thomas's side, and \"Canary in Bloom\" gives Beulah's in 21 poems. Together they paint a detailed, poetically dense portrait of two lives in all their frailty, dignity and complexity. The collection was awarded the Pulitzer Prize for poetry in 1987."], "author": "Rita Dove", "num_pages": "80", "awards": ["Pulitzer Prize for Poetry (1987)"], "places": [], "character_names": [], "language": "English", "publish_date": "1986-01-01 00:00:00", "ISBN": "0887480217"},
{"url": "https://www.goodreads.com/book/show/11778691-kingdom-animalia", "num_ratings": "393", "num_reviews": "33", "avg_ratings": 4.2, "genres": ["Poetry", "The United States Of America"], "title": "Kingdom Animalia", "description": ["The poems in this highly anticipated second book are elegiac poems, as concerned with honoring our dead as they are with praising the living. Through Aracelis Girmay's lens, everything is animal: the sea, a jukebox, the desert. In these poems, everything possesses a system of desire, hunger, a set of teeth, and language. These are poems about what is both difficult and bea", "The poems in this highly anticipated second book are elegiac poems, as concerned with honoring our dead as they are with praising the living. Through Aracelis Girmay's lens, everything is animal: the sea, a jukebox, the desert. In these poems, everything possesses a system of desire, hunger, a set of teeth, and language. These are poems about what is both difficult and beautiful about our time here on earth.", "'s debut collection won the Great Lakes Colleges Association New Writers Award. A Cave Canem Fellow, she is on the faculty at Drew University and Hampshire College. She lives in Brooklyn, New York."], "author": "Aracelis Girmay", "num_pages": "120", "awards": ["National Book Critics Circle Award Nominee for Poetry (2011)", "Hurston/Wright Legacy Award Nominee for Poetry (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-20 00:00:00", "ISBN": "193441462X"},
{"url": "https://www.goodreads.com/book/show/44056.Selected_Odes", "num_ratings": "257", "num_reviews": "22", "avg_ratings": 4.4, "genres": ["Poetry", "European Literature", "Spanish Literature", "Literature", "Latin American Literature", "Cultural", "Latin American"], "title": "Selected Odes", "description": ["The atom, a tuna, laziness, love—the everyday elements and essences of human experience glow in the translucent language of Neruda's odes. Chilean poet Pablo Neruda wrote three books of odes during his lifetime. ", " was published in 1954, followed in subsequent years by ", " and ", " Margaret Sayers Peden's selection of", "The atom, a tuna, laziness, love—the everyday elements and essences of human experience glow in the translucent language of Neruda's odes. Chilean poet Pablo Neruda wrote three books of odes during his lifetime. ", " was published in 1954, followed in subsequent years by ", " and ", " Margaret Sayers Peden's selection of odes from all three volumes, printed with the Spanish originals on facing pages, is by far the most extensive yet to appear in English. She vividly conveys the poet's vision of the realities of day-to-day life in her trans-lations, while her brief introduction describes the genesis of the poems."], "author": "Pablo Neruda", "num_pages": "386", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-11-01 00:00:00", "ISBN": "0520227085"},
{"url": "https://www.goodreads.com/book/show/2253778.Language_for_a_New_Century", "num_ratings": "106", "num_reviews": "16", "avg_ratings": 4.35, "genres": ["Poetry", "Anthologies", "Cultural", "Asia", "Nonfiction"], "title": "Language for a New Century: Contemporary Poetry from the Middle East, Asia, and Beyond", "description": [" celebrates the artistic and cultural forces flourishing today in the East, bringing together an unprecedented selection of works by South Asian, East Asian, Middle Eastern, and Central Asian poets as well as poets", " celebrates the artistic and cultural forces flourishing today in the East, bringing together an unprecedented selection of works by South Asian, East Asian, Middle Eastern, and Central Asian poets as well as poets living in the Diaspora. Some poets, such as Bei Dao and Mahmoud Darwish, are acclaimed worldwide, but many more will be new to the reader. The collection includes 400 unique voices—political and apolitical, monastic and erotic—that represent a wider artistic movement that challenges thousand-year-old traditions, broadening our notion of contemporary literature. Each section of the anthology—organized by theme rather than by national affiliation—is preceded by a personal essay from the editors that introduces the poetry and exhorts readers to examine their own identities in light of these powerful poems. In an age of violence and terrorism, often predicated by cultural ignorance, this anthology is a bold declaration of shared humanity and devotion to the transformative power of art."], "author": "Tina Chang", "num_pages": "784", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-17 00:00:00", "ISBN": "0393332381"},
{"url": "https://www.goodreads.com/book/show/18166999-jimmy-s-blues-and-other-poems", "num_ratings": "390", "num_reviews": "69", "avg_ratings": 4.17, "genres": ["Poetry", "Cultural", "African American", "American", "African American Literature"], "title": "Jimmy's Blues and Other Poems", "description": ["  ", "During his lifetime (1924–1987), James Baldwin authored seven novels, as well as several plays and essay collections, which were published to wide-spread praise. These books, among them ", ",", ", ", ", and", "  ", "During his lifetime (1924–1987), James Baldwin authored seven novels, as well as several plays and essay collections, which were published to wide-spread praise. These books, among them ", ",", ", ", ", and ", ",", "brought him well-deserved acclaim as a public intellectual and admiration as a writer. However, Baldwin’s earliest writing was in poetic form, and Baldwin considered himself a poet throughout his lifetime. Nonetheless, his single book of poetry, ", ", never achieved the popularity of his novels and nonfiction, and is the one and only book to fall out of print.", " This new collection presents James Baldwin the poet, including all nineteen poems from ", ", as well as all the poems from a limited-edition volume called ", ", of which only 325 copies were ever printed and which was in production at the time of his death. Known for his relentless honesty and startlingly prophetic insights on issues of race, gender, class, and poverty, Baldwin is just as enlightening and bold in his poetry as in his famous novels and essays. The poems range from the extended dramatic narratives of “Staggerlee wonders” and “Gypsy” to the lyrical beauty of “Some days,” which has been set to music and interpreted by such acclaimed artists as Audra McDonald. Nikky Finney’s introductory essay reveals the importance, relevance, and rich rewards of these little-known works. Baldwin’s many devotees will find much to celebrate in these pages."], "author": "James Baldwin", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-04-01 00:00:00", "ISBN": "0807084867"},
{"url": "https://www.goodreads.com/book/show/143367.Loving_in_the_War_Years", "num_ratings": "910", "num_reviews": "35", "avg_ratings": 4.19, "genres": ["Poetry", "Feminism", "Nonfiction", "Glbt", "Queer", "Lgbt", "Autobiography", "Memoir"], "title": "Loving in the War Years", "description": ["Weaving together poetry and prose, Spanish and English, family history and political theory, ", " has been a classic in the feminist and Chicano canon since its 1983 release. This new edition—including a new introduction and three new essays—remains a testament of Moraga's coming-of-age as a Chicana and a lesbian at a time when the political merging of t", "Weaving together poetry and prose, Spanish and English, family history and political theory, ", " has been a classic in the feminist and Chicano canon since its 1983 release. This new edition—including a new introduction and three new essays—remains a testament of Moraga's coming-of-age as a Chicana and a lesbian at a time when the political merging of those two identities was severely censured.", "Drawing on the Mexican legacy of Malinche, the symbolic mother of the first mestizo peoples, Moraga examines the collective sexual and cultural wounding suffered by women since the Conquest. Moraga examines her own mestiza parentage and the seemingly inescapable choice of assimilation into a passionless whiteness or uncritical acquiescence to the patriarchal Chicano culture she was raised to reproduce. By finding Chicana feminism and honoring her own sexuality and loyalty to other women of color, Moraga finds a way to claim both her family and her freedom.", "Moraga's new essays, written with a voice nearly a generation older, continue the project of \"loving in the war years,\" but Moraga's posture is now closer to that of a zen warrior than a street-fighter. In these essays, loving is an extended prayer, where the poet-politica reflects on the relationship between our small individual deaths and the dyings of nations of people (pueblos). ", " is an angry response to the \"cultural tyranny\" of the mainstream art world and a celebration of the strategic use of \"cultural memory\" in the creation of an art of resistance.", " is the co-editor of the classic feminist anthology ", " and the author of ", " She is Artist-in-Residence at Stanford University."], "author": "Cherríe L. Moraga", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-01 00:00:00", "ISBN": "0896086267"},
{"url": "https://www.goodreads.com/book/show/65341.Selected_Poems", "num_ratings": "790", "num_reviews": "28", "avg_ratings": 4.19, "genres": ["Cultural", "India", "Asian Literature", "Indian Literature", "Classics"], "title": "Selected Poems", "description": ["The poems of Rabindranath Tagore (1861-1941) are among the most haunting and tender in Indian and in world literature, expressing a profound and passionate human yearning. His ceaselessly inventive works deal with such subjects as the interplay between God and the world, the eternal and transient, and with the paradox of an endlessly changing universe that is in tune with", "The poems of Rabindranath Tagore (1861-1941) are among the most haunting and tender in Indian and in world literature, expressing a profound and passionate human yearning. His ceaselessly inventive works deal with such subjects as the interplay between God and the world, the eternal and transient, and with the paradox of an endlessly changing universe that is in tune with unchanging harmonies. Poems such as 'Earth' and 'In the Eyes of a Peacock' present a picture of natural processes unaffected by human concerns, while others, as in 'Recovery - 14', convey the poet's bewilderment about his place in the world. And exuberant works such as 'New Rain' and 'Grandfather's Holiday' describe Tagore's sheer joy at the glories of nature or simply in watching a grandchild play."], "author": "Rabindranath Tagore", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-31 00:00:00", "ISBN": "0140449884"},
{"url": "https://www.goodreads.com/book/show/1143647.Mart_n_Meditations_on_the_South_Valley", "num_ratings": "224", "num_reviews": "14", "avg_ratings": 4.22, "genres": ["Poetry", "Academic", "Read For School"], "title": "Martín & Meditations on the South Valley", "description": ["Fiercely moving, the two long narrative poems of ", " revolve around the semi-autobiographical figure of Martin, a mestizo or \"detribalized Apache.\" Abandoned as a child and a long time on the hard path to building his own family, Martin at last finds his home in the stubborn and beautiful world of the barrio. Jimmy Santiago Baca \"writes w", "Fiercely moving, the two long narrative poems of ", " revolve around the semi-autobiographical figure of Martin, a mestizo or \"detribalized Apache.\" Abandoned as a child and a long time on the hard path to building his own family, Martin at last finds his home in the stubborn and beautiful world of the barrio. Jimmy Santiago Baca \"writes with unconcealed passion,\" Denise Levertov states in her introduction, “but he is far from being a naive realist; what makes his writing so exciting to me is the way in which it manifests both an intense lyricism and that transformative vision which perceives the mythic and archetypal significance of life-events.\""], "author": "Jimmy Santiago Baca", "num_pages": "104", "awards": ["American Book Award (1988)"], "places": [], "character_names": [], "language": "English", "publish_date": "1987-10-17 00:00:00", "ISBN": "0811210324"},
{"url": "https://www.goodreads.com/book/show/1221821.Crazy_Melon_and_Chinese_Apple", "num_ratings": "28", "num_reviews": "3", "avg_ratings": 4.32, "genres": ["Poetry"], "title": "Crazy Melon and Chinese Apple: The Poems of Frances Chung", "description": ["Frances Chung's poetry stands alone as the most perceptive, aesthetically accomplished, and compassionate depiction of a supposedly impenetrable community during the late 1960s and 70s. Written For the Chinatown People and imprinted with Chung's own ink seal, Crazy Melon is collects brief poems and prose vignettes set in New York's Chinatown and Lower East Side. Chung inco", "Frances Chung's poetry stands alone as the most perceptive, aesthetically accomplished, and compassionate depiction of a supposedly impenetrable community during the late 1960s and 70s. Written For the Chinatown People and imprinted with Chung's own ink seal, Crazy Melon is collects brief poems and prose vignettes set in New York's Chinatown and Lower East Side. Chung incorporates Spanish and Chinese into her English in deft evocations of these neighborhoods' streets, fantasies, commerce, and toil. The title of her second collection, Chinese Apple, translates the Chinese word for pomegranate: there she offers small crimson bites of new themes and cityscapes -- delightfully understated eroticism, tributes to other poets, impressions of other Chinese diasporic communities during her travels in Central America and Asia. Its new formal experiments show that Chung's poetic prowess continued to deepen before her early death.", "Publication of these two works will finally allow Chung's growing circle of admirers to experience the full range of her skills and sensibility, and will draw many others into that circle. Her poems are an inimitable synthesis of American urban vernacular and imagery, various East Asian and Spanish-language poetics, and a concern for ethnic and feminist cultural and political survival-in-writing that was so vital to American poets around the time that Chung first began to compose. Her always fresh perspective on the worlds around her smoothly shifts through multiple lenses, making wonderful use of her power to dream in four languages."], "author": "Frances Chung", "num_pages": "189", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-12-01 00:00:00", "ISBN": "0819564168"},
{"url": "https://www.goodreads.com/book/show/588066.Vice", "num_ratings": "434", "num_reviews": "29", "avg_ratings": 4.11, "genres": ["Poetry", "Academic", "Read For School", "Womens", "Literary Fiction"], "title": "Vice: New and Selected Poems", "description": ["Collected here are poems from Ai's previous five books—", ", and ", "—along with seventeen new poems. Employing her trademark ferocity, these new dramatic monologues continue to mine this award-winning poet's \"often brilliant\" (", ") vision."], "author": "AI", "num_pages": "272", "awards": ["National Book Award for Poetry (1999)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-17 00:00:00", "ISBN": "0393320189"},
{"url": "https://www.goodreads.com/book/show/6549._said_the_shotgun_to_the_head_", "num_ratings": "2,694", "num_reviews": "219", "avg_ratings": 4.22, "genres": ["Poetry", "Fiction", "Philosophy", "Literature"], "title": ", said the shotgun to the head.", "description": ["The greatest Americans", " "], "author": "Saul Williams", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-09-01 00:00:00", "ISBN": "0743470796"},
{"url": "https://www.goodreads.com/book/show/39102.The_Collected_Poetry_1968_1998", "num_ratings": "1,277", "num_reviews": "56", "avg_ratings": 4.42, "genres": ["Poetry", "Cultural", "African American", "Nonfiction"], "title": "The Collected Poetry, 1968-1998", "description": ["This omnibus covers Nikki Giovanni's complete work of poetry from 1967–1983. THE COLLECTED POETRY OF NIKKI GIOVANNI will include the complete volumes of five adult books of poetry: Black Feeling Black Talk/Black Judgement, My House, The Women and the Men, Cotton Candy on a Rainy Day, and Those Who Ride the Night Winds.", "Nikki self–published her first book Black Feeling, Blac", "This omnibus covers Nikki Giovanni's complete work of poetry from 1967–1983. THE COLLECTED POETRY OF NIKKI GIOVANNI will include the complete volumes of five adult books of poetry: Black Feeling Black Talk/Black Judgement, My House, The Women and the Men, Cotton Candy on a Rainy Day, and Those Who Ride the Night Winds.", "Nikki self–published her first book Black Feeling, Black Talk/BlackJudgement in 1969, selling 10,000 copies; William Morrow published in 1970. Know for its iconic revolutionary phrases, it is heralded as one of the most important volumes of modern African–American poetry and is considered the seminal volume of Nikki's body of work.", "My House (Morrow 1972) marks a new dimension in tone and philosphy––This is Giovanni's first foray into the autobiographical.", "In The Women and the Men (Morrow 1975), Nikki displays her compassion for the people, things and places she has encountered––She reveres the ordinary and is in search of the extraordinary.", "Cotton Candy on a Rainy Day (Morrow 1978) is one of the most poignant and introspective of all Giovanni's collections. These poems chronicle the drastic change that took place during the 1970s––when the dreams of the Civil Rights era seemed to have evaporated.", "Those Who Ride the Night Winds (Morrow 1983) is devoted to \"the day trippers and midnight cowboys,\" the ones who have devoted their lives to pushing the limits of the human condition and shattered the constraints of the stautus quo."], "author": "Nikki Giovanni", "num_pages": "512", "awards": ["American Book Award (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-23 00:00:00", "ISBN": "0060724293"},
{"url": "https://www.goodreads.com/book/show/13124956-when-my-brother-was-an-aztec", "num_ratings": "1,371", "num_reviews": "158", "avg_ratings": 4.36, "genres": ["Poetry", "Lgbt"], "title": "When My Brother Was an Aztec", "description": ["\"I write ", " sentences,\" Natalie Diaz once explained in an interview, \"because they want more and more lyricism and imagery to satisfy them.\" This debut collection is a fast-paced tour of Mojave life and family narrative: A sister fights for or against a brother on meth, and everyone from Antigone, Houdini, Huitzilopochtli, and Jesus is invoked and invited to hash it ou", "\"I write ", " sentences,\" Natalie Diaz once explained in an interview, \"because they want more and more lyricism and imagery to satisfy them.\" This debut collection is a fast-paced tour of Mojave life and family narrative: A sister fights for or against a brother on meth, and everyone from Antigone, Houdini, Huitzilopochtli, and Jesus is invoked and invited to hash it out. These darkly humorous poems illuminate far corners of the heart, revealing teeth, tails, and more than a few dreams.", "W", " was born and raised on the Fort Mojave Indian Reservation in Needles, California. After playing professional basketball for four years in Europe and Asia, Diaz returned to the states to complete her MFA at Old Dominion University. She lives in Surprise, Arizona, and is working to preserve the Mojave language."], "author": "Natalie Díaz", "num_pages": "103", "awards": ["American Book Award (2013)", "PEN Open Book Award Nominee for Shortlist (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-05-08 00:00:00", "ISBN": "155659383X"},
{"url": "https://www.goodreads.com/book/show/79521.Transbluesency", "num_ratings": "265", "num_reviews": "10", "avg_ratings": 4.18, "genres": ["Poetry", "Cultural", "African American", "The United States Of America"], "title": "Transbluesency: Selected Poems, 1961-1995", "description": ["Finally in print in a single volume, a selection from Baraka's mostly out-of-print collections of poetry, from 1961 to the present. Starting with ", " and concluding with recent limited-edition chapbooks and broadsides, this selection traces the more than thirty year career of a major writer who - along with Ezra Pound - may be one of the", "Finally in print in a single volume, a selection from Baraka's mostly out-of-print collections of poetry, from 1961 to the present. Starting with ", " and concluding with recent limited-edition chapbooks and broadsides, this selection traces the more than thirty year career of a major writer who - along with Ezra Pound - may be one of the most significant, and least understood, American poets of our century. "], "author": "Amiri Baraka", "num_pages": "271", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "1568860145"},
{"url": "https://www.goodreads.com/book/show/419167.Ceremonies", "num_ratings": "159", "num_reviews": "11", "avg_ratings": 4.39, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Nonfiction", "Race"], "title": "Ceremonies: Prose and Poetry", "description": ["Ceremonies offers provocative commentary on highly charged topics such as Robert Mapplethorpe's photographs of African-American men, feminism among men, and AIDS in the black community."], "author": "Essex Hemphill", "num_pages": "200", "awards": ["Stonewall Book Award for Literature (1993)", "Lambda Literary Award Nominee for Gay Men's Poetry (1993)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-05-09 00:00:00", "ISBN": "1573441015"},
{"url": "https://www.goodreads.com/book/show/37773.Collected_Poems", "num_ratings": "219", "num_reviews": "29", "avg_ratings": 3.79, "genres": ["Poetry", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria"], "title": "Collected Poems", "description": ["A collection of poetry spanning the full range of the African-born author's acclaimed career has been updated to include seven never-before-published works, as well as much of his early poetry that explores such themes as the African consciousness, the tragedy of Biafra, and the mysteries of human relationships."], "author": "Chinua Achebe", "num_pages": "84", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-01-16 00:00:00", "ISBN": "1400076587"},
{"url": "https://www.goodreads.com/book/show/5939.On_the_Blue_Shore_of_Silence", "num_ratings": "479", "num_reviews": "45", "avg_ratings": 4.48, "genres": ["Poetry", "European Literature", "Spanish Literature", "Nonfiction"], "title": "On the Blue Shore of Silence: Poemas frente al mar (Bilingual)", "description": ["Aunque existe un sinnúmero de antologías de la poesía de Neruda, A la Orilla Azul del Silencio es la primera en reunir algunos de sus más bellos poemas sobre el mar. Algunas veces apasionados, otras veces serenos, los poemas de este libro -- presentado en formato bilingüe -- ofrecen al lector la posibilidad de imaginarse lo que habría sido sentarse con Neruda en Isla Negra", "Aunque existe un sinnúmero de antologías de la poesía de Neruda, A la Orilla Azul del Silencio es la primera en reunir algunos de sus más bellos poemas sobre el mar. Algunas veces apasionados, otras veces serenos, los poemas de este libro -- presentado en formato bilingüe -- ofrecen al lector la posibilidad de imaginarse lo que habría sido sentarse con Neruda en Isla Negra frente al mar infinito, oyendo el eterno ir y venir de las olas. Con traducciones al inglés hechas por Alastair Reid,su traductor predilecto, y las extraordinarias pinturas de laartista Mary Heebner, A la Orilla Azul del Silencio es un nuevo pilar de la obra de Neruda, que combina con habilidad las sensibilidades del poeta, la artista y el lector."], "author": "Pablo Neruda", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-02-03 00:00:00", "ISBN": "0060591846"},
{"url": "https://www.goodreads.com/book/show/11320.The_Captain_s_Verses", "num_ratings": "6,645", "num_reviews": "339", "avg_ratings": 4.25, "genres": ["Poetry", "European Literature", "Spanish Literature"], "title": "The Captain's Verses", "description": ["New Directions celebrates the Pablo Neruda Centennial. In celebration of the 100th anniversary of Pablo Neruda's birth, New Directions is pleased to announce the reissue of a classic work in a timeless translation by Donald D. Walsh and fully bilingual.", " was first published anonymously in 1952, some years before Neruda married Matilde Urrutia - the one w", "New Directions celebrates the Pablo Neruda Centennial. In celebration of the 100th anniversary of Pablo Neruda's birth, New Directions is pleased to announce the reissue of a classic work in a timeless translation by Donald D. Walsh and fully bilingual.", " was first published anonymously in 1952, some years before Neruda married Matilde Urrutia - the one with \"the fire / of an unchained meteor\" - to whom he had addressed these poems of love, ecstasy, devotion, and fury. Our bilingual edition is seen by many as the most intimate and passionate volume of Neruda's love poetry, capturing all the erotic energy of a new love."], "author": "Pablo Neruda", "num_pages": "151", "awards": [], "places": [], "character_names": [], "language": "Multiple languages", "publish_date": "2004-07-19 00:00:00", "ISBN": "0811215806"},
{"url": "https://www.goodreads.com/book/show/50684.The_Black_Unicorn", "num_ratings": "1,049", "num_reviews": "71", "avg_ratings": 4.34, "genres": ["Poetry", "Feminism", "Lgbt", "Race", "American", "African American Literature"], "title": "The Black Unicorn: Poems", "description": ["Rich continues: \"Refusing to be circumscribed by any simple identity, Audre Lorde writes as a Black woman, a mother, a daughter, a Lesbian, a feminist, a visionary; poems of elemental wildness and healing, nightmare and lucidity. Her rhythms and accents have the timelessness of a poetry which extends beyond white Western politics, beyond the anger and wisdom of Black Ameri", "Rich continues: \"Refusing to be circumscribed by any simple identity, Audre Lorde writes as a Black woman, a mother, a daughter, a Lesbian, a feminist, a visionary; poems of elemental wildness and healing, nightmare and lucidity. Her rhythms and accents have the timelessness of a poetry which extends beyond white Western politics, beyond the anger and wisdom of Black America, beyond the North American earth, to Abomey and the Dahomeyan Amazons. These are poems nourished in an oral tradition, which also blaze and pulse on the page, beneath the reader's eye.\""], "author": "Audre Lorde", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-08-17 00:00:00", "ISBN": "0393312372"},
{"url": "https://www.goodreads.com/book/show/7840752-the-epic-of-gilgamesh", "num_ratings": "67,461", "num_reviews": "3,155", "avg_ratings": 3.66, "genres": ["Classics", "Poetry", "Fiction", "Fantasy", "Mythology", "Literature"], "title": "The Epic of Gilgamesh: An English Verison with an Introduction", "description": ["Miraculously preserved on clay tables which were deciphered in the last century, ", " is at least 1,500 years older than Homer. This volume contains a straightforward English version of the adventures of the great king of Uruk in his fruitless search for immortality and of his friendship with Enkidu, the wild man from the hills. Also included in the epic i", "Miraculously preserved on clay tables which were deciphered in the last century, ", " is at least 1,500 years older than Homer. This volume contains a straightforward English version of the adventures of the great king of Uruk in his fruitless search for immortality and of his friendship with Enkidu, the wild man from the hills. Also included in the epic is another legend of the Flood which agrees in many details with the Biblical story of Noah."], "author": "Anonymous", "num_pages": "128", "awards": [], "places": [], "character_names": ["Gilgamesh", "Enkidu", "Ishtar", "Humbaba", "Utnapishtim"], "language": "English", "publish_date": "1960-12-30 00:00:00", "ISBN": "1101160454"},
{"url": "https://www.goodreads.com/book/show/22523971-nejma", "num_ratings": "3,913", "num_reviews": "378", "avg_ratings": 4.05, "genres": ["Poetry", "Feminism"], "title": "Nejma", "description": ["all ", "of the ", "unsleeping. gold sweeping. poems. ", "i have in my hands."], "author": "Nayyirah Waheed", "num_pages": "172", "awards": ["Goodreads Choice Award Nominee for Poetry (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-17 00:00:00", "ISBN": "1494493322"},
{"url": "https://www.goodreads.com/book/show/270903.Don_t_Let_Me_Be_Lonely", "num_ratings": "3,021", "num_reviews": "216", "avg_ratings": 4.21, "genres": ["Poetry", "Nonfiction", "Writing", "Essays", "Race", "Autobiography", "Memoir"], "title": "Don’t Let Me Be Lonely: An American Lyric", "description": ["In this powerful sequence of TV images and essay, Claudia Rankine explores the personal and political unrest of our volatile new century. ", "The award-winning poet Claudia Rankine,", "In this powerful sequence of TV images and essay, Claudia Rankine explores the personal and political unrest of our volatile new century. ", "The award-winning poet Claudia Rankine, well known for her experimental multigenre writing, fuses the lyric, the essay, and the visual in this politically and morally fierce examination of solitude in the rapacious and media-driven assault on selfhood that is contemporary America. With wit and intelligence, Rankine strives toward an unprecedented clarity-of thought, imagination, and sentence-making-while arguing that recognition of others is the only salvation for ourselves, our art, and our government.", " is an important new confrontation with our culture, with a voice at its heart bewildered by its inadequacy in the face of race riots, terrorist attacks, medicated depression, and the antagonism of the television that won't leave us alone."], "author": "Claudia Rankine", "num_pages": "155", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "1555974074"},
{"url": "https://www.goodreads.com/book/show/402564.Dance_Dance_Revolution", "num_ratings": "402", "num_reviews": "72", "avg_ratings": 4.0, "genres": ["Poetry", "Fiction", "The United States Of America", "Science Fiction", "Dystopia"], "title": "Dance Dance Revolution", "description": ["\"The Guide\" is a former South Korean dissident and tour guide who speaks a fluid fabricated language; \"the Historian\" interviews the Guide and annotates the commentaries. Cathy Park Hong's passionate and artful poem sequence weaves an ultimately revitalizing dialogue on shared experience in a globalized world, using language as subversion and disguise."], "author": "Cathy Park Hong", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-17 00:00:00", "ISBN": "0393064840"},
{"url": "https://www.goodreads.com/book/show/280471.Poems_of_Phillis_Wheatley", "num_ratings": "189", "num_reviews": "26", "avg_ratings": 3.68, "genres": ["Poetry", "Classics", "Cultural", "African American", "Race", "Literature", "American"], "title": "Poems of Phillis Wheatley", "description": ["The poetry of America's first published black poet was published before the Revolutionary War and recognized throughout the English-speaking world. Phillis Wheatley was born in Africa, sold as a slave in America, and became a celebrity in Europe. This volume also contains a short memoir of her life."], "author": "Phillis Wheatley", "num_pages": "108", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-04-01 00:00:00", "ISBN": "1557092338"},
{"url": "https://www.goodreads.com/book/show/786699.Omeros", "num_ratings": "1,902", "num_reviews": "163", "avg_ratings": 3.99, "genres": ["Poetry", "Fiction", "Classics", "Literature"], "title": "Omeros", "description": ["A poem in five books, of circular narrative design, titled with the Greek name for Homer, which simultaneously charts two currents of history: the visible history charted in events—the tribal losses of the American Indian, the tragedy of African enslavement—and the interior, unwritten epic fashioned from the suffering of the individual in exile."], "author": "Derek Walcott", "num_pages": "325", "awards": ["WH Smith Literary Award (1991)"], "places": ["Saint Lucia"], "character_names": [], "language": "English", "publish_date": "1992-06-01 00:00:00", "ISBN": "0374523509"},
{"url": "https://www.goodreads.com/book/show/380191.Homegirls_and_Handgrenades", "num_ratings": "403", "num_reviews": "23", "avg_ratings": 4.46, "genres": ["Poetry", "Feminism", "Race", "Cultural", "African American", "Womens", "Short Stories"], "title": "Homegirls and Handgrenades", "description": ["“Only a poet with an innocent heart can exorcise so much pain with so much beauty.”—Isabel Allende", "A reprint of Sonia Sanchez’s award-winning collection, which contains some of her seminal work. Winner of the American Book Award.", " is a poet, activist, and scholar and one of the most important writers of the Black Arts Movement. She is the author of sixteen books", "“Only a poet with an innocent heart can exorcise so much pain with so much beauty.”—Isabel Allende", "A reprint of Sonia Sanchez’s award-winning collection, which contains some of her seminal work. Winner of the American Book Award.", " is a poet, activist, and scholar and one of the most important writers of the Black Arts Movement. She is the author of sixteen books and lives in Philadelphia."], "author": "Sonia Sanchez", "num_pages": "96", "awards": ["American Book Award (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "1893996808"},
{"url": "https://www.goodreads.com/book/show/183840.The_Book_of_American_Negro_Poetry", "num_ratings": "308", "num_reviews": "21", "avg_ratings": 4.22, "genres": ["Poetry", "Classics", "Cultural", "African American", "Literature", "American", "Fiction"], "title": "The Book of American Negro Poetry", "description": ["This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally importan", "This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide."], "author": "James Weldon Johnson", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-11 00:00:00", "ISBN": "1426457553"},
{"url": "https://www.goodreads.com/book/show/9132517-collected-poems", "num_ratings": "52", "num_reviews": "2", "avg_ratings": 4.04, "genres": ["Poetry", "Cultural", "African American"], "title": "Collected Poems", "author": "Countee Cullen", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-14 00:00:00", "ISBN": "1598530836"},
{"url": "https://www.goodreads.com/book/show/16169867-buck", "num_ratings": "1,551", "num_reviews": "242", "avg_ratings": 4.2, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Cultural", "African American"], "title": "Buck: A Memoir", "description": ["  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But t", "  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But things fell apart, and a decade later MK was in America, a teenager lost in a fog of drugs, sex, and violence on the streets of North Philadelphia. Now he was alone—his mother in a mental hospital, his father gone, his older brother locked up in a prison on the other side of the country—and forced to find his own way to survive physically, mentally, and spiritually, by any means necessary.", " is a powerful memoir of how a precocious kid educated himself through the most unconventional teachers—outlaws and eccentrics, rappers and mystic strangers, ghetto philosophers and strippers, and, eventually, an alternative school that transformed his life with a single blank sheet of paper. It’s a one-of-a-kind story about finding your purpose in life, and an inspiring tribute to the power of education, art, and love to heal and redeem us."], "author": "M.K. Asante", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "0812993411"},
{"url": "https://www.goodreads.com/book/show/3348584-blood-dazzler", "num_ratings": "963", "num_reviews": "81", "avg_ratings": 4.39, "genres": ["Poetry", "Cultural", "African American", "The United States Of America"], "title": "Blood Dazzler", "description": ["In minute-by-minute detail, Patricia Smith tracks Hurricane Katrina as it transforms into a full-blown mistress of destruction. From August 23, 2005, the day Tropical Depression Twelve developed, through August 28 when it became a Category Five storm with its “scarlet glare fixed on the trembling crescent,” to the heartbreaking aftermath, these poems evoke the horror that", "In minute-by-minute detail, Patricia Smith tracks Hurricane Katrina as it transforms into a full-blown mistress of destruction. From August 23, 2005, the day Tropical Depression Twelve developed, through August 28 when it became a Category Five storm with its “scarlet glare fixed on the trembling crescent,” to the heartbreaking aftermath, these poems evoke the horror that unfolded in New Orleans as America watched it on television.", "Assuming the voices of flailing politicians, the dying, their survivors, and the voice of the hurricane itself, Smith follows the woefully inadequate relief effort and stands witness to families held captive on rooftops and in the Superdome. She gives voice to the thirty-four nursing home residents who drowned in St. Bernard Parish and recalls the day after their deaths when George W. Bush accompanied country singer Mark Willis on guitar:", "***", "Look like this country done left us for dead.", "An unforgettable reminder that poetry can still be “news that stays news,” ", "is a necessary step toward national healing.", "is the author of four previous collections of poetry, including ", ", winner of the Hurston/Wright Legacy Award and the Paterson Poetry Prize. A record-setting, national poetry slam champion, she was featured in the film ", ", on the HBO series ", ", and is a frequent contributor to ", ", the Poetry Foundation’s blog. Visit her website at ", "."], "author": "Patricia Smith", "num_pages": "90", "awards": ["National Book Award Finalist for Poetry (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "156689218X"},
{"url": "https://www.goodreads.com/book/show/18585282-salt", "num_ratings": "12,805", "num_reviews": "1,380", "avg_ratings": 4.39, "genres": ["Poetry", "Feminism", "Nonfiction"], "title": "Salt", "author": "Nayyirah Waheed", "num_pages": "251", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "1492238287"},
{"url": "https://www.goodreads.com/book/show/13214.I_Know_Why_the_Caged_Bird_Sings", "num_ratings": "322,484", "num_reviews": "7,781", "avg_ratings": 4.21, "genres": ["Nonfiction", "Classics", "Autobiography", "Memoir", "Biography", "Biography", "Autobiography"], "title": "I Know Why the Caged Bird Sings", "description": ["Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Yea", "Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Years later, in San Francisco, Maya learns that love for herself, the kindness of others, her own strong spirit, and the ideas of great authors (\"I met and fell in love with William Shakespeare\") will allow her to be free instead of imprisoned.", "Poetic and powerful, ", " will touch hearts and change minds for as long as people read."], "author": "Maya Angelou", "num_pages": "246", "awards": ["Coretta Scott King Award for Author Honor (1971)"], "places": ["Arkansas", "Louisiana", "California", "Missouri"], "character_names": ["Marguerite Johnson 'Maya'", "Bailey Johnson Jr.", "Annie Henderson 'Momma'", "Uncle Willie", "Bailey Johnson", "Vivian Baxter"], "language": "English", "publish_date": "1993-11-16 00:00:00", "ISBN": "0553279378"},
{"url": "https://www.goodreads.com/book/show/45882.Borderlands_La_Frontera", "num_ratings": "7,572", "num_reviews": "298", "avg_ratings": 4.27, "genres": ["Feminism", "Nonfiction", "Poetry", "Glbt", "Queer", "Philosophy", "Theory", "Race"], "title": "Borderlands/La Frontera: The New Mestiza", "description": ["Anzaldua, a Chicana native of Texas, explores in prose and poetry the murky, precarious existence of those living on the frontier between cultures and languages. Writing in a lyrical mixture of Spanish and English that is her unique heritage, she meditates on the condition of Chicanos in Anglo culture, women in Hispanic culture, and lesbians in the straight world. Her essa", "Anzaldua, a Chicana native of Texas, explores in prose and poetry the murky, precarious existence of those living on the frontier between cultures and languages. Writing in a lyrical mixture of Spanish and English that is her unique heritage, she meditates on the condition of Chicanos in Anglo culture, women in Hispanic culture, and lesbians in the straight world. Her essays and poems range over broad territory, moving from the plight of undocumented migrant workers to memories of her grandmother, from Aztec religion to the agony of writing. Anzaldua is a rebellious and willful talent who recognizes that life on the border, \"life in the shadows,\" is vital territory for both literature and civilization. Venting her anger on all oppressors of people who are culturally or sexually different, the author has produced a powerful document that belongs in all collections with emphasis on Hispanic American or feminist issues."], "author": "Gloria E. Anzaldúa", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-05-01 00:00:00", "ISBN": "1879960575"},
{"url": "https://www.goodreads.com/book/show/67373.The_Essential_Rumi", "num_ratings": "29,818", "num_reviews": "810", "avg_ratings": 4.43, "genres": ["Poetry", "Spirituality", "Philosophy", "Classics", "Religion"], "title": "The Essential Rumi", "description": ["This revised and expanded edition of ", " includes a new introduction by Coleman Barks and more than 80 never-before-published poems.", "Through his lyrical translations, Coleman Barks has been instrumental in bringing this exquisite literature to a remarkably wide range of readers, making the ecstatic, spiritual poetry of thirteenth-century Sufi Mystic Rumi more", "This revised and expanded edition of ", " includes a new introduction by Coleman Barks and more than 80 never-before-published poems.", "Through his lyrical translations, Coleman Barks has been instrumental in bringing this exquisite literature to a remarkably wide range of readers, making the ecstatic, spiritual poetry of thirteenth-century Sufi Mystic Rumi more popular than ever.", " continues to be the bestselling of all Rumi books, and the definitive selection of his beautiful, mystical poetry."], "author": "Rumi", "num_pages": "310", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-07-01 00:00:00", "ISBN": "0140449531"},
{"url": "https://www.goodreads.com/book/show/5289373-breaking-poems", "num_ratings": "179", "num_reviews": "18", "avg_ratings": 4.32, "genres": ["Poetry", "Nonfiction"], "title": "Breaking Poems", "description": ["Poetry. In BREAKING POEMS Suheir Hammad departs from her previous poetry books with a bold and explosive style to do what the best poets have always done: create a new language. Using \"break\" as a trigger for every poem, Hammad destructs, constructs, and reconstructs the English language for us to hear the sound of a breath, a woman's body, a land, a culture, falling apart", "Poetry. In BREAKING POEMS Suheir Hammad departs from her previous poetry books with a bold and explosive style to do what the best poets have always done: create a new language. Using \"break\" as a trigger for every poem, Hammad destructs, constructs, and reconstructs the English language for us to hear the sound of a breath, a woman's body, a land, a culture, falling apart, broken, and put back together again. \"Suheir Hammad's BREAKING POEMS introduces English to an Arabic vernacular that startles into being an altogether new language, bridging the archipelago of a Palestine under siege to the diaspora and beyond, breaking through convention, breaking open locks on mind and heart, breaking into a music inspired by the Coltranes, Sun Ra and free jazz, Lee Scratch Perry and Ravi Shankar, a music that is at once a joyous celebration of survival and a poignant cri de Coeur that cannot be ignored and that Mahmoud Darwish should have lived to see. This is a poetry written for people who have endured the winds of hurricanes and invasions. What wisdom, energy, joy and poignancy Hammad brings to the page for all of this, and for teaching me a new speaking, I give her my thanks\" Carolyn Forche.\""], "author": "Suheir Hammad", "num_pages": "62", "awards": ["American Book Award (2009)", "Arab American Book Award for Poetry (2009)"], "places": [], "character_names": [], "language": null, "publish_date": "2008-12-01 00:00:00", "ISBN": "0981913121"},
{"url": "https://www.goodreads.com/book/show/97409.Native_Guard", "num_ratings": "2,825", "num_reviews": "282", "avg_ratings": 4.12, "genres": ["Poetry", "History", "Academic", "School", "Cultural", "African American", "Nonfiction"], "title": "Native Guard", "description": ["Through elegiac verse that honors her mother and tells of her own fraught childhood, Natasha Trethewey confronts the racial legacy of her native Deep South -- where one of the first black regiments, the Louisiana Native Guards, was called into service during the Civil War. Trethewey's resonant and beguiling collection is a haunting conversation between personal experience", "Through elegiac verse that honors her mother and tells of her own fraught childhood, Natasha Trethewey confronts the racial legacy of her native Deep South -- where one of the first black regiments, the Louisiana Native Guards, was called into service during the Civil War. Trethewey's resonant and beguiling collection is a haunting conversation between personal experience and national history."], "author": "Natasha Trethewey", "num_pages": "64", "awards": ["Pulitzer Prize for Poetry (2007)", "Lillian Smith Book Award (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-03 00:00:00", "ISBN": "0618872655"},
{"url": "https://www.goodreads.com/book/show/13376363-teaching-my-mother-how-to-give-birth", "num_ratings": "10,300", "num_reviews": "913", "avg_ratings": 4.33, "genres": ["Poetry", "Feminism", "Nonfiction"], "title": "Teaching My Mother How to Give Birth", "description": ["What elevates 'teaching my mother how to give birth', what gives the poems their disturbing brilliance, is Warsan Shire's ability to give simple, beautiful eloquence to the veiled world where sensuality lives in the dominant narrative of Islam; reclaiming the more nuanced truths of earlier times - as in Tayeb Salih's work - and translating to the realm of lyric the work of", "What elevates 'teaching my mother how to give birth', what gives the poems their disturbing brilliance, is Warsan Shire's ability to give simple, beautiful eloquence to the veiled world where sensuality lives in the dominant narrative of Islam; reclaiming the more nuanced truths of earlier times - as in Tayeb Salih's work - and translating to the realm of lyric the work of the likes of Nawal El Saadawi. As Rumi said, \"Love will find its way through all languages on its own\". ", "In 'teaching my mother how to give birth', Warsan's debut pamphlet, we witness the unearthing of a poet who finds her way through all preconceptions to strike the heart directly. Warsan Shire is a Kenyan-born Somali poet and writer who is based in London. Born in 1988, she is an artist and activist who uses her work to document narratives of journey and trauma. Warsan has read her work internationally, including recent readings in South Africa, Italy and Germany, and her poetry has been translated into Italian, Spanish and Portuguese."], "author": "Warsan Shire", "num_pages": "37", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-29 00:00:00", "ISBN": "1905233299"},
{"url": "https://www.goodreads.com/book/show/380188.Shake_Loose_My_Skin", "num_ratings": "775", "num_reviews": "60", "avg_ratings": 4.36, "genres": ["Poetry", "Feminism", "Cultural", "African American", "Race"], "title": "Shake Loose My Skin: New and Selected Poems", "description": ["An extraordinary retrospective covering over thirty years of work, ", " is a stunning testament to the literary, sensual, and political powers of the award-winning Sonia Sanchez."], "author": "Sonia Sanchez", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-04-07 00:00:00", "ISBN": "0807068535"},
{"url": "https://www.goodreads.com/book/show/20613761-citizen", "num_ratings": "20,227", "num_reviews": "2,149", "avg_ratings": 4.29, "genres": ["Poetry", "Nonfiction", "Race", "Writing", "Essays", "Cultural", "African American", "Politics"], "title": "Citizen: An American Lyric", "description": ["A provocative meditation on race, Claudia Rankine's long-awaited follow up to her groundbreaking book ", "Claudia Rankine's bold new book recounts mounting racial aggressions in ongoing encounters in twenty-first-century daily life and in the media. Some of these encounters are slights, seeming slips of the tongue, and some are intenti", "A provocative meditation on race, Claudia Rankine's long-awaited follow up to her groundbreaking book ", "Claudia Rankine's bold new book recounts mounting racial aggressions in ongoing encounters in twenty-first-century daily life and in the media. Some of these encounters are slights, seeming slips of the tongue, and some are intentional offensives in the classroom, at the supermarket, at home, on the tennis court with Serena Williams and the soccer field with Zinedine Zidane, online, on TV-everywhere, all the time. The accumulative stresses come to bear on a person's ability to speak, perform, and stay alive. Our addressability is tied to the state of our belonging, Rankine argues, as are our assumptions and expectations of citizenship. In essay, image, and poetry, ", " is a powerful testament to the individual and collective effects of racism in our contemporary, often named \"post-race\" society."], "author": "Claudia Rankine", "num_pages": "169", "awards": ["T.S. Eliot Prize for Poetry Nominee (2015)", "Sister Mariella Gable Prize (2014)", "Forward Prize for Best Collection (2015)", "Los Angeles Times Book Prize for Poetry (2014)", "PEN Open Book Award (2015)", "National Book Critics Circle Award for Poetry (2014)", "National Book Award Finalist for Poetry (2014)", "Goodreads Choice Award Nominee for Poetry (2014)", "PEN Center USA Literary Award for Poetry (2015)", "Bobbitt National Prize for Poetry (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-07 00:00:00", "ISBN": "1555976905"},
{"url": "https://www.goodreads.com/book/show/5932.Twenty_Love_Poems_and_a_Song_of_Despair", "num_ratings": "40,488", "num_reviews": "1,734", "avg_ratings": 4.32, "genres": ["Poetry", "Classics", "European Literature", "Spanish Literature", "Romance"], "title": "Twenty Love Poems and a Song of Despair", "description": ["Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an", "Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an insightful Introduction by Cristina Garcia. More than eighty years after its publication, ", " stands as an essential collection that continues to inspire lovers and poets around the world."], "author": "Pablo Neruda", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-26 00:00:00", "ISBN": "0143039962"},
{"url": "https://www.goodreads.com/book/show/50680.The_Collected_Poems", "num_ratings": "2,180", "num_reviews": "55", "avg_ratings": 4.35, "genres": ["Poetry", "Feminism", "Lgbt", "Glbt", "Queer", "Race"], "title": "The Collected Poems", "description": ["Collected here for the first time are more than three hundred poems from one of this country's major and most influential poets, representing the complete oeuvre of Audre Lorde's poetry. Lorde published nine volumes of poetry which, in her words, detail \"a linguistic and emotional tour through the conflicts, fears, and hopes of the world I have inhabited.\" Included here ar", "Collected here for the first time are more than three hundred poems from one of this country's major and most influential poets, representing the complete oeuvre of Audre Lorde's poetry. Lorde published nine volumes of poetry which, in her words, detail \"a linguistic and emotional tour through the conflicts, fears, and hopes of the world I have inhabited.\" Included here are Lorde's early, previously unavailable works: The First Cities, The New York Head Shop and Museum, Cables to Rage, and From a Land Where Other People Live."], "author": "Audre Lorde", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-02-17 00:00:00", "ISBN": "0393319725"},
{"url": "https://www.goodreads.com/book/show/607270.Blessing_the_Boats", "num_ratings": "1,471", "num_reviews": "74", "avg_ratings": 4.22, "genres": ["Poetry", "Cultural", "African American", "Feminism", "American", "African American Literature"], "title": "Blessing the Boats: New and Selected Poems, 1988-2000", "description": ["The long-awaited collection by one of the most distinguished poets working today."], "author": "Lucille Clifton", "num_pages": "145", "awards": ["National Book Award for Poetry (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-04-01 00:00:00", "ISBN": "1880238888"},
{"url": "https://www.goodreads.com/book/show/32956.Loose_Woman", "num_ratings": "3,342", "num_reviews": "235", "avg_ratings": 4.2, "genres": ["Poetry", "Feminism", "Fiction"], "title": "Loose Woman", "description": ["A candid, sexy and wonderfully mood-strewn collection of poetry that celebrates the female aspects of love, from the reflective to the overtly erotic. \"Poignant, sexy. . . lyrical, passionate. . . cool and delicate. . . hot as a chili pepper.\"--Boston Globe."], "author": "Sandra Cisneros", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-03-14 00:00:00", "ISBN": "0679755276"},
{"url": "https://www.goodreads.com/book/show/225750.Selected_Poems", "num_ratings": "1,660", "num_reviews": "82", "avg_ratings": 4.21, "genres": ["Poetry", "Cultural", "African American", "Womens", "Literature", "Literature", "American"], "title": "Selected Poems", "description": ["The classic volume by the distinguished modern poet, winner of the 1950 Pulitzer Prize, and recipient of the National Book Foundation Medal for Distinguished Contribution to American Letters, showcases an esteemed artist's technical mastery, her warm humanity, and her compassionate and illuminating response to a complex world."], "author": "Gwendolyn Brooks", "num_pages": "161", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-03 00:00:00", "ISBN": "0060882964"},
{"url": "https://www.goodreads.com/book/show/5936.The_Poetry_of_Pablo_Neruda", "num_ratings": "15,723", "num_reviews": "256", "avg_ratings": 4.44, "genres": ["Poetry", "Classics", "Fiction", "Romance", "Literature", "European Literature", "Spanish Literature", "Cultural", "Latin American", "Literature", "Latin American Literature", "Poetry Plays", "Nobel Prize"], "title": "The Poetry of Pablo Neruda", "description": ["The most comprehensive English-language collection of work ever by \"the greatest poet of the twentieth century - in any language\" - Gabriel García Márquez", "\"In his work a continent awakens to consciousness.\" So wrote the Swedish Academy in awarding the Nobel Prize to Pablo Neruda, the author of more than thirty-five books of poetry and one of Latin America's most revered wri", "The most comprehensive English-language collection of work ever by \"the greatest poet of the twentieth century - in any language\" - Gabriel García Márquez", "\"In his work a continent awakens to consciousness.\" So wrote the Swedish Academy in awarding the Nobel Prize to Pablo Neruda, the author of more than thirty-five books of poetry and one of Latin America's most revered writers, lionized during his lifetime as \"the people's poet.\" This selection of Neruda's poetry, the most comprehensive single volume available in English, presents nearly six hundred poems, scores of them in new and sometimes multiple translations, and many accompanied by the Spanish original. In his introduction, Ilan Stavans situates Neruda in his native milieu as well as in a contemporary English-language one, and a group of new translations by leading poets testifies to Neruda's enduring, vibrant legacy among English-speaking writers and readers today."], "author": "Pablo Neruda", "num_pages": "1040", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-16 00:00:00", "ISBN": "0374529604"},
{"url": "https://www.goodreads.com/book/show/51881.Poems", "num_ratings": "3,475", "num_reviews": "163", "avg_ratings": 4.33, "genres": ["Poetry", "Classics", "Cultural", "African American"], "title": "Poems", "description": ["Tenderly, joyously, sometimes in sadness,  sometimes in pain, Maya Angelou writes from the heart and  celebrates life as only she has discovered it. In  this moving volume of poetry, we hear the  multi-faceted voice of one of the most powerful and  vibrant writers of our time."], "author": "Maya Angelou", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-01-01 00:00:00", "ISBN": "0553255762"}
]