[
{"url": "https://www.goodreads.com/book/show/60931.Kindred", "num_ratings": "60,626", "num_reviews": "7,284", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Science Fiction", "Fantasy", "Science Fiction", "Time Travel"], "title": "Kindred", "description": ["The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into ante", "The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into antebellum Maryland. After saving a drowning white boy there, she finds herself staring into the barrel of a shotgun and is transported back to the present just in time to save her life. During numerous such time-defying episodes with the same young man, she realizes the challenge she’s been given: to protect this young slaveholder until he can father her own great-grandmother."], "author": "Octavia E. Butler", "num_pages": "287", "awards": [], "places": ["Maryland", "Altadena, California"], "character_names": ["Dana Franklin", "Kevin Franklin", "Rufus Weylin", "Tom Weylin", "Margaret Weylin", "Alice Greenwood"], "language": "English", "publish_date": "2004-02-01 00:00:00", "ISBN": "0807083690"},
{"url": "https://www.goodreads.com/book/show/2744.Anansi_Boys", "num_ratings": "166,972", "num_reviews": "8,617", "avg_ratings": 4.01, "genres": ["Fantasy", "Fiction", "Fantasy", "Urban Fantasy", "Fantasy", "Mythology"], "title": "Anansi Boys", "description": ["Fat Charlie Nancy's normal life ended the moment his father dropped dead on a Florida karaoke stage. Charlie didn't know his dad was a god. And he never knew he had a brother. ", "Now brother Spider's on his doorstep -- about to make Fat Charlie's life more interesting... and a lot more dangerous."], "author": "Neil Gaiman", "num_pages": "387", "awards": ["Locus Award for Best Fantasy Novel (2006)", "Mythopoeic Fantasy Award for Adult Literature (2006)", "ALA Alex Award (2006)", "British Fantasy Award for Best Novel (2006)"], "places": ["London, England", "Florida"], "character_names": ["Fat Charlie", "Rosie", "Spider", "Mrs. Higgler", "Mrs. Noah", "Mrs. Dunwiddy", "Graham Coates", "Maeve Livingston", "Daisy Day", "Mr. Nancy"], "language": "English", "publish_date": "2006-09-26 00:00:00", "ISBN": "0060515198"},
{"url": "https://www.goodreads.com/book/show/13206828-cress", "num_ratings": "212,995", "num_reviews": "22,471", "avg_ratings": 4.46, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Cress", "description": ["In this third book in the Lunar Chronicles, Cinder and Captain Thorne are fugitives on the run, now with Scarlet and Wolf in tow. Together, they're plotting to overthrow Queen Levana and her army.", "Their best hope lies with Cress, a girl imprisoned on a satellite since childhood who's only ever had her netscreens as company. All that screen time has made Cress an excellent h", "In this third book in the Lunar Chronicles, Cinder and Captain Thorne are fugitives on the run, now with Scarlet and Wolf in tow. Together, they're plotting to overthrow Queen Levana and her army.", "Their best hope lies with Cress, a girl imprisoned on a satellite since childhood who's only ever had her netscreens as company. All that screen time has made Cress an excellent hacker. Unfortunately, she's just received orders from Levana to track down Cinder and her handsome accomplice.", "When a daring rescue of Cress goes awry, the group is separated. Cress finally has her freedom, but it comes at a higher price. Meanwhile, Queen Levana will let nothing prevent her marriage to Emperor Kai. Cress, Scarlet, and Cinder may not have signed up to save the world, but they may be the only hope the world has."], "author": "Marissa Meyer", "num_pages": "552", "awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2014)"], "places": ["New Beijing", "Luna"], "character_names": ["Princess Winter", "Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Carswell Thorne", "Iko", "Crescent Moon \"Cress\" Darnel", "Jacin Clay", "Dr. Dmitri Erland", "Sybil Mira", "Aimery Park", "Linh Adri"], "language": "English", "publish_date": "2014-02-04 00:00:00", "ISBN": "0312642970"},
{"url": "https://www.goodreads.com/book/show/5577995-silver-phoenix", "num_ratings": "3,256", "num_reviews": "524", "avg_ratings": 3.57, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Romance"], "title": "Silver Phoenix", "description": ["No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that", "No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that her journey to the Palace of Fragrant Dreams isn't only a quest to find her beloved father but a venture with stakes larger than she could have imagined. ", " Bravery, intelligence, the will to fight and fight hard . . . she will need all of these things. Just as she will need the new and mysterious power growing within her. She will also need help. ", " It is Chen Yong who finds her partly submerged and barely breathing at the edge of a deep lake. There is something of unspeakable evil trying to drag her under. On a quest of his own, Chen Yong offers that help . . . and perhaps more."], "author": "Cindy Pon", "num_pages": "340", "awards": [], "places": [], "character_names": ["Ai Ling"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0061730211"},
{"url": "https://www.goodreads.com/book/show/60929.Dawn", "num_ratings": "19,895", "num_reviews": "1,953", "avg_ratings": 4.11, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Dawn", "description": ["Lilith Iyapo has just lost her husband and son when atomic fire consumes Earth—the last stage of the planet’s final war. Hundreds of years later Lilith awakes, deep in the hold of a massive alien spacecraft piloted by the Oankali—who arrived just in time to save humanity from extinction. They have kept Lilith and other survivors asleep for centuries, as they learned whatev", "Lilith Iyapo has just lost her husband and son when atomic fire consumes Earth—the last stage of the planet’s final war. Hundreds of years later Lilith awakes, deep in the hold of a massive alien spacecraft piloted by the Oankali—who arrived just in time to save humanity from extinction. They have kept Lilith and other survivors asleep for centuries, as they learned whatever they could about Earth. Now it is time for Lilith to lead them back to her home world, but life among the Oankali on the newly resettled planet will be nothing like it was before.", "The Oankali survive by genetically merging with primitive civilizations—whether their new hosts like it or not. For the first time since the nuclear holocaust, Earth will be inhabited. Grass will grow, animals will run, and people will learn to survive the planet’s untamed wilderness. But their children will not be human. Not exactly."], "author": "Octavia E. Butler", "num_pages": "248", "awards": [], "places": [], "character_names": ["Lilith lyapo", "Ahajas", "Dichaan", "Tediin", "Nikanj", "Kahguyaht", "Peter Van Weerden", "Jean Pelerin", "Gabriel Rinaldi", "Curt Loehr", "Celene Ivers", "Ray Ordway", "Victor Dominic", "Beatrice Dwyer", "Allison Zeigler", "Hillary Ballard", "Jdahya", "Tate"], "language": "English", "publish_date": "1997-04-16 00:00:00", "ISBN": "0446603775"},
{"url": "https://www.goodreads.com/book/show/34933239-the-last-faoii", "num_ratings": "25", "num_reviews": "17", "avg_ratings": 4.48, "genres": ["Fantasy", "Did Not Finish"], "title": "The Last Faoii", "description": ["The faoii have protected Clearwall for generations. With militaristic order and stalwart discipline, these women have reigned in unopposed prosperity. But when her monastery is attacked and her sisters slaughtered, only young Kaiya-faoii is left alive.", "Forced to cope without the long-standing traditions of her Order, Kaiya travels the country in a mission to avenge her sist", "The faoii have protected Clearwall for generations. With militaristic order and stalwart discipline, these women have reigned in unopposed prosperity. But when her monastery is attacked and her sisters slaughtered, only young Kaiya-faoii is left alive.", "Forced to cope without the long-standing traditions of her Order, Kaiya travels the country in a mission to avenge her sisters and preserve what is left of her heritage. The search brings her not only to dark discoveries and ancient family secrets, but to something she never wanted or dreamed of-- an estranged brother.", "Fighting against an uncle that has kept them apart their entire lives and forced into a war at the heart of a broken empire, the siblings must evaluate the true meanings of enemy, betrayal and freedom--and the grey areas surrounding each.", "Note from Author: Read excerpts, chapters, reviews, pre-order, and get updates on the publication process by going to "], "author": "Tahani Nelson", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-03 00:00:00", "ISBN": "1942645929"},
{"url": "https://www.goodreads.com/book/show/16081758-otherbound", "num_ratings": "2,159", "num_reviews": "452", "avg_ratings": 3.74, "genres": ["Fantasy", "Young Adult", "Lgbt", "Science Fiction"], "title": "Otherbound", "description": ["Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Eve", "Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Every time he blinks, he's yanked from his Arizona town into Amara's mind, a world away, which makes even simple things like hobbies and homework impossible. He's spent years as a powerless observer of Amara's life. Amara has no idea . . . until he learns to control her, and they communicate for the first time. Amara is terrified. Then, she's furious.", "All Amara and Nolan want is to be free of each other. But Nolan's breakthrough has dangerous consequences. Now, they'll have to work together to survive--and discover the truth about their connection."], "author": "Corinne Duyvis", "num_pages": "387", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2014)", "Bisexual Book Award for Speculative Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-17 00:00:00", "ISBN": "1419709283"},
{"url": "https://www.goodreads.com/book/show/9415946-huntress", "num_ratings": "9,287", "num_reviews": "982", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Young Adult", "Young Adult Fantasy", "Adventure", "Fantasy", "Magic"], "title": "Huntress", "description": ["Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, th", "Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, the city of the Fairy Queen. Taisin is a sage, thrumming with magic, and Kaede is of the earth, without a speck of the otherworldly. And yet the two girls' destinies are drawn together during the mission. As members of their party succumb to unearthly attacks and fairy tricks, the two come to rely on each other and even begin to fall in love. But the Kingdom needs only one huntress to save it, and what it takes could tear Kaede and Taisin apart forever.", "The exciting adventure prequel to Malinda Lo's highly acclaimed novel ", "is overflowing with lush Chinese influences and details inspired by the ", ", and is filled with action and romance."], "author": "Malinda Lo", "num_pages": "371", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2012)", "James Tiptree Jr. Award Nominee for Longlist (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "031604007X"},
{"url": "https://www.goodreads.com/book/show/20898019-ms-marvel-vol-1", "num_ratings": "70,177", "num_reviews": "4,927", "avg_ratings": 4.12, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Young Adult", "Comics", "Superheroes", "Fiction"], "title": "Ms. Marvel, Vol. 1: No Normal", "description": [" ", "Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of", " ", "Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of her newfound powers, she unlocks a secret behind them, as well. Is Kamala ready to wield these immense new gifts? Or will the weight of the legacy before her be too much to bear? Kamala has no idea, either. But she's comin' for you, Jersey! ", "It's history in the making from acclaimed writer G. Willow Wilson (Air, Cairo) and beloved artist Adrian Alphona (RUNAWAYS)! Collecting MS. MARVEL (2014) #1-5 and material from ALL-NEW MARVEL NOW! POINT ONE #1."], "author": "G. Willow Wilson", "num_pages": "120", "awards": ["Hugo Award for Best Graphic Story (2015)", "Harvey Awards Nominee for Best New Series, Best Writer (for G. Willow Wilson) (2015)", "Lincoln Award Nominee (2019)", "Will Eisner Comic Industry Awards Nominee for Best New Series, Best Writer (for G. Willow Wilson), Best Penciller/Inker (for Adrian Alphona), Best Lettering (for Joe Caramagna), Best Cover Artist (for Jamie McKelvie & Matthew Wilson) (2015)", "Goodreads Choice Award Nominee for Graphic Novels & Comics (2014)"], "places": ["Jersey City, New Jersey"], "character_names": ["Steve Rogers", "Carol Danvers", "Kamala Khan", "Tony Stark", "Zoe Zimmer", "Chatty Bob", "Sheik Abdullah", "Doyle", "Thomas Edison (clone)", "Knox", "Bruno Carrelli", "Nakia Badahir", "Yusuf Khan", "Muneeba Khan", "Aamir Khan", "Vittorio \"Vick\" Carrelli", "Josh Richardson"], "language": "English", "publish_date": "2014-10-30 00:00:00", "ISBN": "078519021X"},
{"url": "https://www.goodreads.com/book/show/15819028-the-golem-and-the-jinni", "num_ratings": "80,023", "num_reviews": "10,956", "avg_ratings": 4.11, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Historical", "Magical Realism"], "title": "The Golem and the Jinni", "description": ["In The Golem and the Jinni, a chance meeting between mythical beings takes readers on a dazzling journey through cultures in turn-of-the-century New York. ", "Chava is a golem, a creature made of clay, brought to life by a disgraced rabbi who dabbles in dark Kabbalistic magic and dies at sea on the voyage from Poland. Chava is unmoored and adrift as the ship arrives in New Yor", "In The Golem and the Jinni, a chance meeting between mythical beings takes readers on a dazzling journey through cultures in turn-of-the-century New York. ", "Chava is a golem, a creature made of clay, brought to life by a disgraced rabbi who dabbles in dark Kabbalistic magic and dies at sea on the voyage from Poland. Chava is unmoored and adrift as the ship arrives in New York harbor in 1899. ", "Ahmad is a jinni, a being of fire born in the ancient Syrian desert, trapped in an old copper flask, and released in New York City, though still not entirely free. ", "Ahmad and Chava become unlikely friends and soul mates with a mystical connection. Marvelous and compulsively readable, Helene Wecker's debut novel The Golem and the Jinni weaves strands of Yiddish and Middle Eastern literature, historical fiction and magical fable, into a wondrously inventive and unforgettable tale."], "author": "Helene Wecker", "num_pages": "486", "awards": ["Nebula Award Nominee for Best Novel (2013)", "World Fantasy Award Nominee for Best Novel (2014)", "Mythopoeic Fantasy Award for Adult Literature (2014)", "Cabell First Novelist Award (2014)", "Harold U. Ribalow Prize for Jewish fiction (2014)", "Goodreads Choice Award Nominee for Debut Author, Best Fantasy (2013)", "James Tiptree Jr. Award Honor List (2013)"], "places": ["New York City, New York", "The Syrian Desert"], "character_names": ["Ahmad Al-Hadid", "Chava", "Yehudah Schaalman", "Rabbi Avram Meyer", "Boutros Arbeely", "Maryam Faddoul", "Michael Levy", "Mahmoud Saleh", "Sayeed Faddoul", "Moe Radzin", "Thea Radzin", "Anna Blumberg", "Sophia Winston", "Fadwa al-Hadid"], "language": "English", "publish_date": "2013-04-23 00:00:00", "ISBN": "0062110837"},
{"url": "https://www.goodreads.com/book/show/15704307-saga-vol-1", "num_ratings": "178,636", "num_reviews": "10,253", "avg_ratings": 4.23, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Fantasy", "Science Fiction", "Fiction"], "title": "Saga, Vol. 1", "description": ["When two soldiers from opposite sides of a never-ending galactic war fall in love, they risk everything to bring a fragile new life into a dangerous old universe. ", "From bestselling writer Brian K. Vaughan, ", " is the sweeping tale of one young family fighting to find their place in the worlds. Fantasy and science fiction are wed like never before in this sexy, subversive d", "When two soldiers from opposite sides of a never-ending galactic war fall in love, they risk everything to bring a fragile new life into a dangerous old universe. ", "From bestselling writer Brian K. Vaughan, ", " is the sweeping tale of one young family fighting to find their place in the worlds. Fantasy and science fiction are wed like never before in this sexy, subversive drama for adults. ", ": ", " 1-6"], "author": "Brian K. Vaughan", "num_pages": "176", "awards": ["Hugo Award for Best Graphic Story (2013)", "Harvey Awards for Best Continuing or Limited Series, Best New Series, Best Single Issue or Story (Saga #1), Best Writer (for Brian K. Vaughan), Best Artist (for Fiona Staples), Best Colorist (for Fiona Staples) AND nominated for Best Cover Artist (for Fiona Staples) (2013)", "Will Eisner Comic Industry Awards for Best New Series, Best Continuing Series, Best Writer (for Brian K. Vaughan) (2013)", "Goodreads Choice Award for Best Graphic Novels & Comics Nominee (2012)"], "places": [], "character_names": ["Marko", "The Will (Saga)", "The Stalk", "Alana (Saga)", "Hazel (Saga)", "Prince Robot IV", "Izabel", "Klara (Saga)", "Barr (Saga)"], "language": "English", "publish_date": "2012-10-23 00:00:00", "ISBN": "1607066017"},
{"url": "https://www.goodreads.com/book/show/47520.Castle_in_the_Air", "num_ratings": "30,126", "num_reviews": "1,849", "avg_ratings": 3.93, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Castle in the Air", "description": ["Far to the south of the land of Ingary, in the Sultanates of Rashpuht, there lived in the city of Zanzib a young and not very prosperous carpet dealer named Abdullah who loved to spend his time daydreaming. He was content with his life and his daydreams until, one day, a stranger sold him a", "Far to the south of the land of Ingary, in the Sultanates of Rashpuht, there lived in the city of Zanzib a young and not very prosperous carpet dealer named Abdullah who loved to spend his time daydreaming. He was content with his life and his daydreams until, one day, a stranger sold him a magic carpet.", "That very night, the carpet flew him to an enchanted garden. There, he met and fell in love with the beauteous princess Flower-in-the-Night, only to have her snatched away, right under his very nose, by a wicked djinn. With only his magic carpet and his wits to help him, Abdullah sets off to rescue his princess...."], "author": "Diana Wynne Jones", "num_pages": "298", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (1992)"], "places": ["Ingary"], "character_names": ["Sophie Hatter", "Calcifer", "Abdullah"], "language": "English", "publish_date": "2001-08-07 00:00:00", "ISBN": "0064473457"},
{"url": "https://www.goodreads.com/book/show/12476820-partials", "num_ratings": "48,146", "num_reviews": "4,442", "avg_ratings": 3.94, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction"], "title": "Partials", "description": ["Humanity is all but extinguished after a war with Partials—engineered organic beings identical to humans—has decimated the population. Reduced to only tens of thousands by a weaponized virus to which only a fraction of humanity is immune, the survivors in North America have huddled together on Long Island. But sixteen-year-old Kira is determined to find a solution. As she", "Humanity is all but extinguished after a war with Partials—engineered organic beings identical to humans—has decimated the population. Reduced to only tens of thousands by a weaponized virus to which only a fraction of humanity is immune, the survivors in North America have huddled together on Long Island. But sixteen-year-old Kira is determined to find a solution. As she tries desperately to save what is left of her race, she discovers that that the survival of both humans and Partials rests in her attempts to answer questions about the war's origin that she never knew to ask.", "Playing on our curiosity of and fascination with the complete collapse of civilization, ", " is, at its heart, a story of survival, one that explores the individual narratives and complex relationships of those left behind, both humans and Partials alike—and of the way in which the concept of what is right and wrong in this world is greatly dependent on one's own point of view.", "Supports the Common Core State Standards."], "author": "Dan Wells", "num_pages": "468", "awards": [], "places": ["Long Island, New York"], "character_names": ["Marcus", "Kira Walker", "Haru Sato", "Madison Sato", "Jayden Van Rijn", "Senator Hobbs", "Sam Pettigrew", "Xochi Kessler", "Owen Tovar"], "language": "English", "publish_date": "2012-02-28 00:00:00", "ISBN": "0062071041"},
{"url": "https://www.goodreads.com/book/show/13496575-starflower", "num_ratings": "726", "num_reviews": "141", "avg_ratings": 4.47, "genres": ["Fantasy", "Christian Fiction", "Young Adult", "Christian", "Romance", "Fantasy", "Dragons"], "title": "Starflower", "description": ["When a cursed dragon-witch kidnaps fairest Lady Gleamdren, the Bard Eanrin sets boldly forth on a rescue mission...and a race against his rival for Gleamdren's favor. Intent upon his quest, the last thing the immortal Faerie needs is to become mixed up with the troubles of an insignificant mortal.", "But when he stumbles upon a maiden trapped in an enchanted sleep, he cannot l", "When a cursed dragon-witch kidnaps fairest Lady Gleamdren, the Bard Eanrin sets boldly forth on a rescue mission...and a race against his rival for Gleamdren's favor. Intent upon his quest, the last thing the immortal Faerie needs is to become mixed up with the troubles of an insignificant mortal.", "But when he stumbles upon a maiden trapped in an enchanted sleep, he cannot leave her alone in the dangerous Wood Between. One waking kiss later, Eanrin suddenly finds his story entangled with that of young Starflower. A strange link exists between this mortal girl and the dragon-witch. Will Starflower prove the key to Lady Gleamdren's rescue? Or will the dark power from which she flees destroy both her and her rescuer?"], "author": "Anne Elisabeth Stengl", "num_pages": "348", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-01 00:00:00", "ISBN": "0764210262"},
{"url": "https://www.goodreads.com/book/show/13206760-scarlet", "num_ratings": "244,570", "num_reviews": "25,870", "avg_ratings": 4.3, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Scarlet", "description": ["Cinder, the cyborg mechanic, returns in the second thrilling installment of the bestselling Lunar Chronicles. She’s trying to break out of prison—even though if she succeeds, she’ll be the Commonwealth’s most wanted fugitive. ", "Halfway around the world, Scarlet Benoit’s grandmother is missing. When Scarlet encounters Wolf, a street fighter who may have information as to her", "Cinder, the cyborg mechanic, returns in the second thrilling installment of the bestselling Lunar Chronicles. She’s trying to break out of prison—even though if she succeeds, she’ll be the Commonwealth’s most wanted fugitive. ", "Halfway around the world, Scarlet Benoit’s grandmother is missing. When Scarlet encounters Wolf, a street fighter who may have information as to her grandmother’s whereabouts, she is loath to trust this stranger, but is inexplicably drawn to him, and he to her. As Scarlet and Wolf unravel one mystery, they encounter another when they meet Cinder. Now, all of them must stay one step ahead of the vicious Lunar Queen Levana, who will do anything for the handsome Prince Kai to become her husband, her king, her ", "."], "author": "Marissa Meyer", "num_pages": "454", "awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2013)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2013)"], "places": ["Toulouse", "Paris", "New Beijing", "Rieux"], "character_names": ["Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Ran Kesley", "Carswell Thorne", "Iko", "Aimery Park", "Linh Adri", "Linh Pearl", "Michelle Benoit"], "language": "English", "publish_date": "2013-02-05 00:00:00", "ISBN": "0312642962"},
{"url": "https://www.goodreads.com/book/show/2986865-eon", "num_ratings": "50,254", "num_reviews": "4,122", "avg_ratings": 3.98, "genres": ["Fantasy", "Young Adult", "Fantasy", "Dragons", "Fantasy", "Magic"], "title": "Eon: Dragoneye Reborn", "description": ["Also Known As: Two Pearls of Wisdom, Eon: Rise of the Dragoneye, and Eon (All the same book just published with different publishers)", "Twelve-year-old Eon has been in training for years. His intensive study of Dragon Magic, based on East Asian astrology, involves two kinds of skills: sword-work and magical aptitude.", "Also Known As: Two Pearls of Wisdom, Eon: Rise of the Dragoneye, and Eon (All the same book just published with different publishers)", "Twelve-year-old Eon has been in training for years. His intensive study of Dragon Magic, based on East Asian astrology, involves two kinds of skills: sword-work and magical aptitude. He and his master hope that he will be chosen as a Dragoneye--an apprentice to one of the twelve energy dragons of good fortune. ", "But Eon has a dangerous secret. He is actually Eona, a sixteen-year-old girl who has been masquerading as a boy for the chance to become a Dragoneye. Females are forbidden to use Dragon Magic; if anyone discovers she has been hiding in plain sight, her death is assured.", "When Eon's secret threatens to come to light, she and her allies are plunged into grave danger and a deadly struggle for the Imperial throne. Eon must find the strength and inner power to battle those who want to take her magic...and her life."], "author": "Alison Goodman", "num_pages": "531", "awards": ["Victorian Premier's Literary Award Nominee for Young Adult Fiction Prize (2009)", "Aurealis Award for Best Fantasy Novel & Nominee for Young Adult Novel (2008)", "The Inky Awards Nominee for Gold Inky (2009)", "James Tiptree Jr. Award Honor List (2008)"], "places": [], "character_names": ["Dillon Walsh", "Eona", "Rilla", "Chart", "Ryoko", "Lady Jila", "Lord Ido"], "language": "English", "publish_date": "2008-12-26 00:00:00", "ISBN": "0670062278"},
{"url": "https://www.goodreads.com/book/show/25617862-minder-rising", "num_ratings": "132", "num_reviews": "36", "avg_ratings": 4.07, "genres": ["Science Fiction", "Romance", "Romance", "Science Fiction Romance", "Fiction"], "title": "Minder Rising", "description": ["A millennium into the future, all children are tested for minder talents, and the best are recruited for the Citizen Protection Service.", "Agent Lièrén Sòng is recovering from a near-fatal crash. He should want nothing more than to get back to using his talents to interrogate criminals for his covert CPS field unit, but being sidelined gains new appeal when he makes friends w", "A millennium into the future, all children are tested for minder talents, and the best are recruited for the Citizen Protection Service.", "Agent Lièrén Sòng is recovering from a near-fatal crash. He should want nothing more than to get back to using his talents to interrogate criminals for his covert CPS field unit, but being sidelined gains new appeal when he makes friends with a woman and her son. Imara Sesay, road crew chief and part-time bartender, breaks her ironclad rule never to get close to customers when she asks Lièrén to teach her son how to control his growing minder talents.", "Unexpected deaths in his field unit make Lièrén suspect he isn’t a lucky survivor, he’s a loose end. He should pull away from Imara and Derrit to keep them safe, but when the local CPS Testing Center is entirely too interested in Derrit’s talents, Lièrén must make an impossible choice. Can he stay alive long enough to save Imara and her prodigy son?", "- - - - - - - - - -", "The Central Galactic Concordance series:", " • Overload Flux (standalone story)", " • Minder Rising (standalone story)"], "author": "Carol Van Natta", "num_pages": "234", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/60932.Parable_of_the_Talents", "num_ratings": "15,239", "num_reviews": "1,206", "avg_ratings": 4.23, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Fantasy"], "title": "Parable of the Talents", "description": ["This Nebula Award-winning sequel to Parable of the Sower continues the story of Lauren Olamina in socially and economically depressed California in the 2030s. Convinced that her community should colonize the stars, Lauren and her followers make preparations. But the collapse of society and rise of fanatics result in Lauren's followers being enslaved, and her daughter stole", "This Nebula Award-winning sequel to Parable of the Sower continues the story of Lauren Olamina in socially and economically depressed California in the 2030s. Convinced that her community should colonize the stars, Lauren and her followers make preparations. But the collapse of society and rise of fanatics result in Lauren's followers being enslaved, and her daughter stolen from her. Now, Lauren must fight back to save the new world order."], "author": "Octavia E. Butler", "num_pages": "448", "awards": ["Nebula Award for Best Novel (1999)", "James Tiptree Jr. Award Honor List (1998)"], "places": ["United States of America"], "character_names": ["Lauren Olamina"], "language": "English", "publish_date": "2001-11-01 00:00:00", "ISBN": "0446610380"},
{"url": "https://www.goodreads.com/book/show/26338532-destiny-abounds", "num_ratings": "80", "num_reviews": "10", "avg_ratings": 3.69, "genres": ["Science Fiction", "Lgbt", "Space", "Space Opera", "Glbt", "Lesbian", "Science Fiction", "Aliens"], "title": "Destiny Abounds", "description": [" ", " ", "Branwen Hawke left behind the swords and castles of her ho", " ", " ", "Branwen Hawke left behind the swords and castles of her homeworld to take solace from the war that consumed most of her life. After stumbling into the role of captain of a one-of-a-kind starship with an unlikely crew, she must find a way to keep them together and thriving. But even with years of experience commanding troops, Branwen has her hands full with a lost pilot from a distant world, an engineer with crippling anxiety, an innocent young medic with a secret, a renowned Kala, and her insanely dangerous baggage. ", "Now tasked with an important mission that could make or break the crew’s reputation, Branwen must face her inner turmoil and find some sort of peace despite the struggles she can’t escape, while safeguarding the lives that have fallen so fatefully into her hands. ", " ", "Destiny Abounds is the first book in the Starlight Saga series. ", "Destiny Abounds ", "Fade Fall ", "More to be announced."], "author": "Annathesa Nikola Darksbane", "num_pages": "345", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25870538-awakened", "num_ratings": "344", "num_reviews": "38", "avg_ratings": 3.91, "genres": ["Fantasy", "Urban Fantasy", "Glbt", "Lesbian", "Lgbt", "Fantasy", "Fantasy", "Paranormal", "Fantasy", "Magic", "Romance"], "title": "Awakened", "description": ["Geeky lesbian Dakota Shepherd was just a bored night security guard, working at a museum in Knoxville, Tennessee until one fateful encounter changed it all. ", "A rogue wizard. A demonic ritual. A silver chalice. ", "Dakota Awakened, Hellfire blazing from her hands. ", "Dakota's powers are a danger to herself and everyone around her, and she has to learn to control them quickly or ris", "Geeky lesbian Dakota Shepherd was just a bored night security guard, working at a museum in Knoxville, Tennessee until one fateful encounter changed it all. ", "A rogue wizard. A demonic ritual. A silver chalice. ", "Dakota Awakened, Hellfire blazing from her hands. ", "Dakota's powers are a danger to herself and everyone around her, and she has to learn to control them quickly or risk losing her one chance to finally fulfill a lifelong dream.", "While coming to terms with her new reality, she stumbles upon a secret that changed the course of her life. ", "Now she wants to know who is responsible for the holes in her memory, the blocks that hold back her powers, and all the years she spent alone.", "Who put her back to sleep when she Awakened years before?"], "author": "Shei Darksbane", "num_pages": "330", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25027872-bound-by-the-summer-prince", "num_ratings": "61", "num_reviews": "18", "avg_ratings": 4.38, "genres": ["Fantasy", "Adult Fiction", "Erotica", "Romance", "Paranormal Romance"], "title": "Bound by the Summer Prince", "description": ["The Summer Court is in an uproar. The king has just been executed for unpardonable crimes, and the queen is prostrate with grief over his loss. This leaves the Summer kingdom bereft of true leadership; a problem which is compounded by the fact that the laws of Fairie require balance to be maintained by having a male and a female ruler for both Season Courts at all times. U", "The Summer Court is in an uproar. The king has just been executed for unpardonable crimes, and the queen is prostrate with grief over his loss. This leaves the Summer kingdom bereft of true leadership; a problem which is compounded by the fact that the laws of Fairie require balance to be maintained by having a male and a female ruler for both Season Courts at all times. Uaine, the Summer prince, is the only one who can put things right, but he is without a mate. Knowing that he must take a bride quickly, for the sake of his people, even though he is struggling with his own feelings of pain and anger over his father's treachery, he goes for a walk in a forest near the palace to try to clear his head and determine how best to choose a female to rule beside him. ", "While walking Uaine discovers a human female running loose in Fairie, which is against the most basic tenets of Fae law. Furious at one more problem he must deal with, he takes her prisoner and locks her in the dungeon; only to discover later that she is his soul-mate. The magical bond between them means they are meant to be together forever, but humans can't feel the magic of Fairie. Will Uaine be able to win her heart and convince her that she can trust him to keep her safe from all the dangers of Fairie...including himself? ", "Roni is a human con woman and petty thief. Having run afoul of the local crime syndicate in the city where she is staying, she finds herself running for her life. Trouble is no stranger to her, but when she falls through a hole in a wall and finds herself in a world with carnivorous trees and rocks that eat people she realizes she may have found more of it than she can deal with. Rescued/arrested by the prince of the Summer Court, it doesn't take long for her to formulate a plan to use him to get herself home. Unfortunately for her, she soon finds that her heart, which she had thought long ago turned to stone, has begun to feel the love she has been playing at. Will she be able to overcome a lifetime of caution and allow herself to follow her heart? Can a criminal love a cop? ", "Please be aware that this book contains explicit sexual scenes, depictions of BDSM, and anal play. If these things disturb you, then this may not be the book for you."], "author": "Mistral Dawn", "num_pages": "286", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/29419579-the-last-chronomancer", "num_ratings": "28", "num_reviews": "15", "avg_ratings": 4.36, "genres": ["Fantasy", "Glbt", "Queer", "Lgbt"], "title": "The Last Chronomancer", "description": ["Follow Mae on a tumultuous journey as he is forced to confront the horrific memories of his past.", "NINETEEN-YEAR-OLD Maestri Craft was perfectly content living in a small town in Aridete. A place he lived for nearly eight years now. His life was safe, simple and ordinary; none of which was ever enough for his best", "Follow Mae on a tumultuous journey as he is forced to confront the horrific memories of his past.", "NINETEEN-YEAR-OLD Maestri Craft was perfectly content living in a small town in Aridete. A place he lived for nearly eight years now. His life was safe, simple and ordinary; none of which was ever enough for his best friend, Jace. Jace was turning two decades and in the eyes of munfolk, that meant he would become a man. Only Jace wasn't of mun and that put him in danger. It would possibly even end his life.", "Knowing he would be forced to leave town, Mae was unwilling to let him go alone. He had secrets too, and it was time he did something about it. Their journey will send them on a unique quest. From being chased by a hag, to flying on winged horses and even a confrontation with a vampire, they come across friends and foes of all creatures. The only problem is, nothing is black and white, and not everyone is as friendly as they seem. Haunted by the curse that follows his bloodline, it soon becomes apparent to Mae that no matter what you do or how far you run, your past will always catch up to you.", "The tale of two, cursed for destruction.", "One with the strength to kill and the other, the courage to resist."], "author": "Reilyn J. Hardy", "num_pages": "434", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-01-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/36540225-the-timingila", "num_ratings": "17", "num_reviews": "11", "avg_ratings": 4.24, "genres": ["Fantasy", "Fiction"], "title": "The Timingila", "description": ["Who is the hero of a story? The one who is brave and honourable, or the one who survives to tell the story?", "Which is the more powerful weapon? The one that wins battles, or the one that wins the minds of people?", "Set in the ancient land of Jivavarta, 'The Timingila' is the story of Trishala, a weak kingdom at the mercy of its neighbours, and Tasvak, the unwanted child of its", "Who is the hero of a story? The one who is brave and honourable, or the one who survives to tell the story?", "Which is the more powerful weapon? The one that wins battles, or the one that wins the minds of people?", "Set in the ancient land of Jivavarta, 'The Timingila' is the story of Trishala, a weak kingdom at the mercy of its neighbours, and Tasvak, the unwanted child of its king.", "When a series of unexpected events put Trishala under a tyrant's control, Tasvak is forced into a web of deception as he struggles to resurrect Trishala's lost glory. Along the way, he has to deal with fanatics, assassins, victims, and reformers. Facing manipulation and betrayal at every step, will Tasvak succeed?", "'The Timingila' is a fast-paced thriller written as a series of short chapters."], "author": "Shon Mehta", "num_pages": "258", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-04-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23202158-taken-by-the-huntsman", "num_ratings": "165", "num_reviews": "52", "avg_ratings": 3.94, "genres": ["Fantasy", "Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance", "Fairies", "Fae", "Adult Fiction", "Erotica"], "title": "Taken By The Huntsman", "description": ["Discarded and ignored by those around her for most of her life, Cassie is a lonely human woman struggling to find her place in the world and meaning in her life. Cadeyrn is the Erlking, the leader of the Wild Hunt, a hundreds of thousands of years old Fae who has always known his purpose. He has spent his entire long existence tracking the criminals of Fairie and punishing", "Discarded and ignored by those around her for most of her life, Cassie is a lonely human woman struggling to find her place in the world and meaning in her life. Cadeyrn is the Erlking, the leader of the Wild Hunt, a hundreds of thousands of years old Fae who has always known his purpose. He has spent his entire long existence tracking the criminals of Fairie and punishing them for their crimes.", "While hunting for the murderer of a child who has escaped to Earth, Cadeyrn comes across Cassie and realizes that she is the one that the great mother goddess has designated as his soul mate. He kidnaps her and takes her to his fortress in Fairie to protect her from his many enemies. He knows she will be angry and that he'll have to work to earn her trust, but he finds his task to be even more challenging than he had thought it would be due to Cassie's difficulty in opening her heart.", "Will Cadeyrn be able to convince Cassie that the bond between them is real and earn her love?"], "author": "Mistral Dawn", "num_pages": "388", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/37569318-empress-of-all-seasons", "num_ratings": "80", "num_reviews": "60", "avg_ratings": 4.19, "genres": ["Fantasy", "Young Adult"], "title": "Empress of All Seasons", "description": ["Each generation, a competition is held to find the next empress of Honoku. The rules are simple. Survive the palace’s enchanted seasonal rooms. Conquer Winter, Spring, Summer, and Fall. Marry the prince. All are eligible to compete—all except yōkai, supernatural monsters and spirits whom the human emperor is determined to", "Each generation, a competition is held to find the next empress of Honoku. The rules are simple. Survive the palace’s enchanted seasonal rooms. Conquer Winter, Spring, Summer, and Fall. Marry the prince. All are eligible to compete—all except yōkai, supernatural monsters and spirits whom the human emperor is determined to enslave and destroy. ", "Mari has spent a lifetime training to become empress. Winning should be easy. And it would be, if she weren't hiding a dangerous secret. Mari is a yōkai with the ability to transform into a terrifying monster. If discovered, her life will be forfeit. As she struggles to keep her true identity hidden, Mari’s fate collides with that of Taro, the prince who has no desire to inherit the imperial throne, and Akira, a half-human, half-yōkai outcast.", "Torn between duty and love, loyalty and betrayal, vengeance and forgiveness, the choices of Mari, Taro, and Akira will decide the fate of Honoku in this beautifully written, edge-of-your-seat YA fantasy."], "author": "Emiko Jean", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": null, "ISBN": "0544530942"},
{"url": "https://www.goodreads.com/book/show/38746411-finding-magic", "num_ratings": "6", "num_reviews": "2", "avg_ratings": 4.5, "genres": [], "title": "Finding Magic (The Excelsior Witch Chronicles, #1)", "description": ["What if everything you heard about magic was wrong? Hollywood has twisted the story of Tituba in the Salem Witch Trials, to be an evil presence. It's thought that she brought evil voodoo to the world, but that's wrong. Bali, an unsure 18-year-old, African-American girl is a recent high school graduate, and is about to find out how her connection of lineage to Tituba gives", "What if everything you heard about magic was wrong? Hollywood has twisted the story of Tituba in the Salem Witch Trials, to be an evil presence. It's thought that she brought evil voodoo to the world, but that's wrong. Bali, an unsure 18-year-old, African-American girl is a recent high school graduate, and is about to find out how her connection of lineage to Tituba gives her great powers of good magic. Bali, along with her two new friends, Leilani and James, set out to figure out how to navigate these new magical gifts they've been given. During their time together, they must also learn how to navigate their own insecurities and personal problems, while saving New York City from an evil witch named Adelram. This story weaves the true tale of magic, and how #blackgirlmagic is that of goodness and love. Come step inside a fantastic story with Bali, James and Leilani and learn how powerful diversity can be."], "author": "Lyn McClenathan", "num_pages": "205", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-02-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/38227140-djinn", "num_ratings": "28", "num_reviews": "11", "avg_ratings": 4.57, "genres": ["Young Adult", "Fantasy", "Fantasy", "Urban Fantasy"], "title": "Djinn", "description": ["Some believe that at birth, we’re each born with a guardian attached to us, watching from afar, but never seen. Truth is, there are certain people, special people, born of this world and of the other, who need that extra protection. They go their entire lives, unaware of the other world, and unaware of the existence of their own personal watcher, watching from afar. But wh", "Some believe that at birth, we’re each born with a guardian attached to us, watching from afar, but never seen. Truth is, there are certain people, special people, born of this world and of the other, who need that extra protection. They go their entire lives, unaware of the other world, and unaware of the existence of their own personal watcher, watching from afar. But what happens when fate takes a turn for the worse, and The One who needs the aid of a watcher most can’t be found to be protected?", "Bijou Fitzroy is strange. With the unwanted gift of being an empath, she has spent her entire life as a sheltered recluse, homeschooled by her secretive and overprotective grandmother, who never allows them to stay in one place long enough for Bijou to settle and make friends. When Bijou and her grandmother move to Sykesville and she starts to attend the local high school, Bijou’s world begins to crumble. Town locals begin to disappear and the creatures from her nightmares begin to take shape in her reality. She finds herself at the center of a war she never knew was being fought all around her."], "author": "Sang Kromah", "num_pages": "343", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-03-20 00:00:00", "ISBN": "9780998388"},
{"url": "https://www.goodreads.com/book/show/24790901-the-abyss-surrounds-us", "num_ratings": "3,320", "num_reviews": "754", "avg_ratings": 3.99, "genres": ["Lgbt", "Fantasy", "Young Adult", "Science Fiction"], "title": "The Abyss Surrounds Us", "description": ["For Cassandra Leung, bossing around sea monsters is just the family business. She’s been a Reckoner trainer-in-training ever since she could walk, raising the genetically-engineered beasts to defend ships as they cross the pirate-infested NeoPacific. But when the pirate queen Santa Elena swoops i", "For Cassandra Leung, bossing around sea monsters is just the family business. She’s been a Reckoner trainer-in-training ever since she could walk, raising the genetically-engineered beasts to defend ships as they cross the pirate-infested NeoPacific. But when the pirate queen Santa Elena swoops in on Cas’s first solo mission and snatches her from the bloodstained decks, Cas’s dream of being a full-time trainer seems dead in the water. ", "There’s no time to mourn. Waiting for her on the pirate ship is an unhatched Reckoner pup. Santa Elena wants to take back the seas with a monster of her own, and she needs a proper trainer to do it. She orders Cas to raise the pup, make sure he imprints on her ship, and, when the time comes, teach him to fight for the pirates. If Cas fails, her blood will be the next to paint the sea."], "author": "Emily Skrutskie", "num_pages": "273", "awards": ["JLG Gold Standard (2016)"], "places": [], "character_names": ["Cassandra Leung", "Swift Kent"], "language": "English", "publish_date": "2016-02-08 00:00:00", "ISBN": "0738746916"},
{"url": "https://www.goodreads.com/book/show/116563.So_You_Want_to_Be_a_Wizard", "num_ratings": "23,818", "num_reviews": "1,044", "avg_ratings": 3.81, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Fantasy", "Urban Fantasy"], "title": "So You Want to Be a Wizard", "description": ["Nita Callahan is at the end of her rope because of the bullies who've been hounding her at school... until she discovers a mysterious library book that promises her the chance to become a wizard. But she has no idea of the difference that taking the Wizard's Oath is going to make in her life. Shortly, in company with fellow beginner-wizard Kit Rodriguez, Nita's catapulted", "Nita Callahan is at the end of her rope because of the bullies who've been hounding her at school... until she discovers a mysterious library book that promises her the chance to become a wizard. But she has no idea of the difference that taking the Wizard's Oath is going to make in her life. Shortly, in company with fellow beginner-wizard Kit Rodriguez, Nita's catapulted into what will be the adventure of a lifetime -- if she and Kit can both live through it. For every wizard's career starts with an Ordeal in which he or she must challenge the one power in the universe that hates wizardry more than anything else: the Lone Power that invented death and turned it loose in the worlds. Plunged into a dark and deadly alternate New York full of the Lone One's creatures, Kit and Nita must venture into the very heart of darkness to find the stolen, legendary Book of Night with Moon. Only with the dangerous power of the wizardly Book do they have a chance to save not just their own lives, but their world..."], "author": "Diane Duane", "num_pages": "323", "awards": [], "places": ["New York City, New York", "Hempstead, New York"], "character_names": ["Christopher \"Kit\" Rodriguez", "Juanita \"Nita\" Callahan", "Khairelikoblepharehglukumeilichephriedosd'enagouni \"Fred\""], "language": "English", "publish_date": "2003-07-01 00:00:00", "ISBN": "0152047387"},
{"url": "https://www.goodreads.com/book/show/15177.Bridge_of_Birds", "num_ratings": "8,769", "num_reviews": "942", "avg_ratings": 4.29, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Humor", "Historical"], "title": "Bridge of Birds", "description": ["When the children of his village were struck with a mysterious illness, Number Ten Ox sought a wiseman to save them. He found master Li Kao, a scholar with a slight flaw in his character. Together, they set out to find the Great Root of Power, the only possible cure.", "The quest led them to a host of truly memorable characters, multiple wonders, incredible adventures—and stra", "When the children of his village were struck with a mysterious illness, Number Ten Ox sought a wiseman to save them. He found master Li Kao, a scholar with a slight flaw in his character. Together, they set out to find the Great Root of Power, the only possible cure.", "The quest led them to a host of truly memorable characters, multiple wonders, incredible adventures—and strange coincidences, which were really not coincidences at all. And it involved them in an ancient crime that still perturbed the serenity of Heaven. Simply and charmingly told, this is a wry tale, a sly tale, and a story of wisdom delightfully askew. Once read, its marvels and beauty will not easily fade from the mind.", "The author claims that this is a novel of an ancient China that never was. But, oh…it should have been!"], "author": "Barry Hughart", "num_pages": "278", "awards": ["World Fantasy Award for Best Novel (1985)", "Mythopoeic Fantasy Award (1986)"], "places": [], "character_names": [], "language": "English", "publish_date": "1985-04-12 00:00:00", "ISBN": "0345321383"},
{"url": "https://www.goodreads.com/book/show/13376.The_House_of_the_Scorpion", "num_ratings": "69,395", "num_reviews": "5,808", "avg_ratings": 4.1, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fiction"], "title": "The House of the Scorpion", "description": ["With undertones of vampires, Frankenstein, dragons' hoards, and killing fields, Matt's story turns out to be an inspiring tale of friendship, survival, hope, and transcendence. A must-read for teenage fantasy fans.", "At his coming-of-age party, Matteo Alacrán asks El Patrón's bodyguard, \"How old am I?...I know I don't have a birthday like humans, but I was born.\" ", "\"You were ha", "With undertones of vampires, Frankenstein, dragons' hoards, and killing fields, Matt's story turns out to be an inspiring tale of friendship, survival, hope, and transcendence. A must-read for teenage fantasy fans.", "At his coming-of-age party, Matteo Alacrán asks El Patrón's bodyguard, \"How old am I?...I know I don't have a birthday like humans, but I was born.\" ", "\"You were harvested,\" Tam Lin reminds him. \"You were grown in that poor cow for nine months and then you were cut out of her.\" ", "To most people around him, Matt is not a boy, but a beast. A room full of chicken litter with roaches for friends and old chicken bones for toys is considered good enough for him. But for El Patrón, lord of a country called Opium—a strip of poppy fields lying between the U.S. and what was once called Mexico—Matt is a guarantee of eternal life. El Patrón loves Matt as he loves himself for Matt is himself. They share identical DNA."], "author": "Nancy Farmer", "num_pages": "380", "awards": ["Newbery Medal Nominee (2003)", "National Book Award for Young People's Literature (2002)", "Mythopoeic Fantasy Award Nominee for Children's Literature (2003)", "Buxtehuder Bulle (2003)", "Michael L. Printz Award Nominee (2003)", "South Carolina Book Award for Junior Book Award (2006)", "Grand Canyon Reader Award for Teen Book (2005)", "Dorothy Canfield Fisher Children's Book Award Nominee (2004)", "Pacific Northwest Library Association Young Reader's Choice Award for Senior (2005)", "Michigan Library Association Thumbs Up! Award Nominee (2003)", "Lincoln Award Nominee (2008)", "Missouri Gateway Readers Award Nominee (2005)", "Oklahoma Sequoyah Award for YA (2005)"], "places": [], "character_names": ["El Patron", "Tam Lin", "Maria Mendoza", "Chacho", "Fidelito", "Ton-Ton"], "language": "English", "publish_date": "2004-05-16 00:00:00", "ISBN": "0689852231"},
{"url": "https://www.goodreads.com/book/show/10671271-scorpion", "num_ratings": "1,068", "num_reviews": "250", "avg_ratings": 3.9, "genres": ["Romance", "M M Romance", "Fantasy", "Romance", "War", "Military Fiction"], "title": "Scorpion", "description": ["Kendras is a casualty of war: injured, penniless, and quite possibly the last surviving member of the only family he's ever known—the elite fighting force known as the Scorpions. When a steel-eyed stranger offers him medicine and shelter in exchange for submission and a secret", "Kendras is a casualty of war: injured, penniless, and quite possibly the last surviving member of the only family he's ever known—the elite fighting force known as the Scorpions. When a steel-eyed stranger offers him medicine and shelter in exchange for submission and a secret task, Kendras has no choice but to accept. He is a Scorpion; he’ll do whatever it takes to survive.", "But his true goal is to rebuild the Scorpions. Neither Steel’s possessive nature nor Kendras’s shattered foot can keep him from finding the last of his brothers... or the mysterious leader of the Scorpions, a man who held Kendras’s heart long before Steel tried to take it for himself. The goal is simple, the situation anything but. To rescue his leader and escape from Steel for good, Kendras must fight through a morass of politics and intrigue, where enemies are allies and even allies have hidden agendas."], "author": "Aleksandr Voinov", "num_pages": "242", "awards": [], "places": [], "character_names": ["Kendras", "Adrastes", "Widowmaker, aka Widow"], "language": "English", "publish_date": "2011-05-16 00:00:00", "ISBN": "161581860X"},
{"url": "https://www.goodreads.com/book/show/10582479-mad-shadows", "num_ratings": "41", "num_reviews": "22", "avg_ratings": 4.59, "genres": ["Fantasy", "Heroic Fantasy", "Sword and Sorcery", "Pulp", "Fantasy", "Weird Fiction", "Mystery", "Noir"], "title": "Mad Shadows: The Weird Tales of Dorgo the Dowser", "description": ["Valdar is a city of swordslingers and necromancers, witch cults and halfhuman races. It's a city in a world of darkness, black magic and creatures of the night . . . a city where demonic entities serve the needs of any witch or magicman who can open a doorway into their domain. This is my city. This is my world.", "With a special dowsing rod, I can detect the ectoplasmic resid", "Valdar is a city of swordslingers and necromancers, witch cults and halfhuman races. It's a city in a world of darkness, black magic and creatures of the night . . . a city where demonic entities serve the needs of any witch or magicman who can open a doorway into their domain. This is my city. This is my world.", "With a special dowsing rod, I can detect the ectoplasmic residue of any supernatural presence or demonic entity and sense the vestiges of odylic power and vile sorcery used in the commission of crimes. I hunt anyone and anything that poses a threat to the people of my city. My name's Dorgo. Folks call me the Dowser.", "From infernal depths where lost souls mutate into hell-spawned devils, from the other side of the veil that separates the earthly from the unearthly, from an ancient land whose borders cross into other dimensions, \"Mad Shadows-The Weird Tales of Dorgo the Dowser,\" will transport you to a world where sentient shadows, vengeful vampires, malevolent puppets, and raging werewolves haunt the night . . . a world where life is cheap and souls are always up for sale."], "author": "Joe Bonadonna", "num_pages": "332", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-05 00:00:00", "ISBN": "1450276156"},
{"url": "https://www.goodreads.com/book/show/11341277-tankborn", "num_ratings": "1,386", "num_reviews": "233", "avg_ratings": 3.67, "genres": ["Science Fiction", "Dystopia", "Fantasy", "Science Fiction", "Romance", "Young Adult", "Fiction"], "title": "Tankborn", "description": ["Best friends Kayla and Mishalla know they will be separated for their Assignments. They are GENs, Genetically Engineered Non-humans, and in their strict caste system, GENs are at the bottom rung of society. GENs are gestated in a tank and sent to work as slaves as soon as they reach age fifteen.", "When Kayla is Assigned to care for Zul Manel, the patriarch of a trueborn famil", "Best friends Kayla and Mishalla know they will be separated for their Assignments. They are GENs, Genetically Engineered Non-humans, and in their strict caste system, GENs are at the bottom rung of society. GENs are gestated in a tank and sent to work as slaves as soon as they reach age fifteen.", "When Kayla is Assigned to care for Zul Manel, the patriarch of a trueborn family, she finds secrets and surprises; not least of which is her unexpected friendship with Zul's great-grandson. Meanwhile, the children that Mishalla is Assigned to care for are being stolen in the middle of the night. ", "After weeks of toiling in their Assignments, mystifying circumstances enable Kayla and Mishalla to reunite. Together they hatch a plan to save the disappearing children. Yet can GENs really trust humans? Both girls must put their lives and hearts at risk to crack open a sinister conspiracy, revealing secrets no one is ready to face."], "author": "Karen Sandler", "num_pages": "373", "awards": ["Golden Duck Award Nominee for Hal Clement Award for Young Adult (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-01 00:00:00", "ISBN": "1600606628"},
{"url": "https://www.goodreads.com/book/show/15769788-rebel", "num_ratings": "9,903", "num_reviews": "1,099", "avg_ratings": 4.04, "genres": ["Science Fiction", "Dystopia", "Young Adult", "Science Fiction"], "title": "Rebel", "description": ["Wren Connolly thought she'd left her human side behind when she dies five years ago and came back 178 minutes later as a Reboot. With her new abilities of strength, speed, and healing—along with a lack of emotions—Wren 178 became the perfect soldier for HARC (Human Advancement and Repopulation Corporation). Then Callum 22 came along and changed everything.", "Now that they've", "Wren Connolly thought she'd left her human side behind when she dies five years ago and came back 178 minutes later as a Reboot. With her new abilities of strength, speed, and healing—along with a lack of emotions—Wren 178 became the perfect soldier for HARC (Human Advancement and Repopulation Corporation). Then Callum 22 came along and changed everything.", "Now that they've both escaped, they're ready to start a new life in peace on the Reboot reservation. But Micah 163, the Reboot running the reservation, has darker plans in mind: to wipe out the humans. ", ". Micah has been building a Reboot army for years and is now ready to launch his attack on the cities. Callum wants to stick around and protect the humans. Wren wants nothing more than to leave all the fighting behind them.", "With Micah on one side, HARC on the other, and Wren and Callum at odds in the middle, there's only one option left..."], "author": "Amy Tintera", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-13 00:00:00", "ISBN": "0062217100"},
{"url": "https://www.goodreads.com/book/show/18367581-afterworlds", "num_ratings": "17,302", "num_reviews": "2,891", "avg_ratings": 3.73, "genres": ["Young Adult", "Fantasy", "Fantasy", "Paranormal", "Contemporary"], "title": "Afterworlds", "description": ["BELIEVING IS DANGEROUS...", "Darcy Patel is afraid to believe all the hype. But it's really happening - her teen novel is getting published. Instead of heading to college, she's living in New York City, where she's welcomed into the dazzling world of YA publishing. That means book tours, parties with her favorite authors, and finding a place to live that won't leave her pennil", "BELIEVING IS DANGEROUS...", "Darcy Patel is afraid to believe all the hype. But it's really happening - her teen novel is getting published. Instead of heading to college, she's living in New York City, where she's welcomed into the dazzling world of YA publishing. That means book tours, parties with her favorite authors, and finding a place to live that won't leave her penniless. It means sleepless nights rewriting her first draft and struggling to find the perfect ending... all while dealing with the intoxicating, terrifying experience of falling in love - with another writer.", "Told in alternating chapters is Darcy's novel, the thrilling story of Lizzie, who wills her way into the afterworld to survive a deadly terrorist attack. With survival comes the responsibility to guide the restless spirits that walk our world, including one ghost with whom she shares a surprising personal connection. But Lizzie's not alone in her new calling - she has counsel from a fellow spirit guide, a very desirable one, who is torn between wanting Lizzie and warning her that...", "BELIEVING IS DANGEROUS.", "In a brilliant high-wire act of weaving two epic narratives - and two unforgettable heroines - into one novel, Scott Westerfeld's latest work is a triumph of storytelling."], "author": "Scott Westerfeld", "num_pages": "599", "awards": ["Aurealis Award Nominee for Best Fantasy Novel & for Best Young Adult (Shortlist) (2014)", "The Inky Awards Nominee for Silver Inky (2015)"], "places": [], "character_names": ["Darcy Patel"], "language": "English", "publish_date": "2014-09-23 00:00:00", "ISBN": "1481422340"},
{"url": "https://www.goodreads.com/book/show/48037.Carmilla", "num_ratings": "29,695", "num_reviews": "2,060", "avg_ratings": 3.84, "genres": ["Classics", "Horror", "Paranormal", "Vampires", "Gothic", "Fiction", "Fantasy", "Lgbt"], "title": "Carmilla", "description": ["A classic Victorian vampire novella, which influenced Bram Stoker's later treatment of the vampire mythos in ", "."], "author": "J. Sheridan Le Fanu", "num_pages": "108", "awards": [], "places": ["Austria"], "character_names": [], "language": "English", "publish_date": "2000-09-05 00:00:00", "ISBN": "0809510839"},
{"url": "https://www.goodreads.com/book/show/22876186-outsider", "num_ratings": "16", "num_reviews": "11", "avg_ratings": 4.75, "genres": ["Science Fiction", "Horror"], "title": "Outsider", "description": ["Surrounded by hunger and degradation, the city of Cherai is a sparkling, opulent metropolis, a dazzling centerpiece in humanity's fight against Slithers and acid rain. And at its heart, keeping everything shining and bright, are the Grey-Men, an oppressed workforce, drugged into submission.", "But not for long.", "Upon escaping her fate as a Grey-man, Niko is determined to free th", "Surrounded by hunger and degradation, the city of Cherai is a sparkling, opulent metropolis, a dazzling centerpiece in humanity's fight against Slithers and acid rain. And at its heart, keeping everything shining and bright, are the Grey-Men, an oppressed workforce, drugged into submission.", "But not for long.", "Upon escaping her fate as a Grey-man, Niko is determined to free the whole lot, liberating all from their bondage. Together with Ben, Songhay and the Gemini Gang, they plan to take control of the city. To do that they must control the one thing no one can live without.", "Water.", "It only takes four days to die of thirst."], "author": "Kayti Nika Raet", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/589979.Daughter_of_the_Empire", "num_ratings": "28,408", "num_reviews": "652", "avg_ratings": 4.25, "genres": ["Fiction", "Fantasy", "Epic Fantasy", "Fantasy", "Fantasy", "High Fantasy", "Science Fiction Fantasy"], "title": "Daughter of the Empire", "description": ["Magic and murder engulf the realm of Kelewan.  Fierce warlords ignite a bitter blood feud to enslave the empire of Tsuranuanni.  While in the opulent Imperial courts, assassins and spy-master plot cunning and devious intrigues against the rightful heir.  Now Mara, a young, untested Ruling lady, is called upon to lead her people in a heroic struggle for survival.  But first", "Magic and murder engulf the realm of Kelewan.  Fierce warlords ignite a bitter blood feud to enslave the empire of Tsuranuanni.  While in the opulent Imperial courts, assassins and spy-master plot cunning and devious intrigues against the rightful heir.  Now Mara, a young, untested Ruling lady, is called upon to lead her people in a heroic struggle for survival.  But first she must rally an army of rebel warriors, form a pact with the alien cho-ja, and marry the son of a hated enemy.  Only then can Mara face her most dangerous foe of all--in his own impregnable stronghold.  An epic tale of adventure and intrigue.  Daughter of the Empire is fantasy of the highest order by two of the most talented writers in the field today."], "author": "Raymond E. Feist", "num_pages": "421", "awards": [], "places": ["Kelewan"], "character_names": [], "language": "English", "publish_date": "1988-05-01 00:00:00", "ISBN": "055327211X"},
{"url": "https://www.goodreads.com/book/show/23197837-the-belles", "num_ratings": "8,148", "num_reviews": "2,514", "avg_ratings": 3.9, "genres": ["Fantasy", "Young Adult", "Young Adult", "Young Adult Fantasy", "Fiction"], "title": "The Belles", "description": ["Camellia Beauregard is a Belle. In the opulent world of Orléans, Belles are revered, for they control Beauty, and Beauty is a commodity coveted above all else. In Orléans, the people are born gray, they are born damned, and only with the help of a Belle and her talents can they transform and be made beautiful.", "But it’s not enough for Camellia to be just a Belle. She wants t", "Camellia Beauregard is a Belle. In the opulent world of Orléans, Belles are revered, for they control Beauty, and Beauty is a commodity coveted above all else. In Orléans, the people are born gray, they are born damned, and only with the help of a Belle and her talents can they transform and be made beautiful.", "But it’s not enough for Camellia to be just a Belle. She wants to be the favorite—the Belle chosen by the Queen of Orléans to live in the royal palace, to tend to the royal family and their court, to be recognized as the most talented Belle in the land. But once Camellia and her Belle sisters arrive at court, it becomes clear that being the favorite is not everything she always dreamed it would be. Behind the gilded palace walls live dark secrets, and Camellia soon learns that the very essence of her existence is a lie—that her powers are far greater, and could be more dangerous, than she ever imagined. And when the queen asks Camellia to risk her own life and help the ailing princess by using Belle powers in unintended ways, Camellia now faces an impossible decision. ", "With the future of Orléans and its people at stake, Camellia must decide—save herself and her sisters and the way of the Belles—or resuscitate the princess, risk her own life, and change the ways of her world forever."], "author": "Dhonielle Clayton", "num_pages": "440", "awards": [], "places": [], "character_names": ["Camellia Beauregard"], "language": "English", "publish_date": "2018-02-06 00:00:00", "ISBN": "1484728491"},
{"url": "https://www.goodreads.com/book/show/30376044-a-mortal-song", "num_ratings": "534", "num_reviews": "208", "avg_ratings": 3.74, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Fiction"], "title": "A Mortal Song", "description": ["Sora's life was full of magic--until she discovered it was all a lie.", "Heir to Mt. Fuji's spirit kingdom, Sora yearns to finally take on the sacred kami duties. But just as she confronts her parents to make a plea, a ghostly army invades the mountain. Barely escaping with her life, Sora follows her mother's last instructions to a heart-wrenching discovery: she is a human cha", "Sora's life was full of magic--until she discovered it was all a lie.", "Heir to Mt. Fuji's spirit kingdom, Sora yearns to finally take on the sacred kami duties. But just as she confronts her parents to make a plea, a ghostly army invades the mountain. Barely escaping with her life, Sora follows her mother's last instructions to a heart-wrenching discovery: she is a human changeling, raised as a decoy while her parents' true daughter remained safe but unaware in modern-day Tokyo. Her powers were only borrowed, never her own. Now, with the world's natural cycles falling into chaos and the ghosts plotting an even more deadly assault, it falls on her to train the unprepared kami princess.", "As Sora struggles with her emerging human weaknesses and the draw of an unanticipated ally with secrets of his own, she vows to keep fighting for her loved ones and the world they once protected. But for one mortal girl to make a difference in this desperate war between the spirits, she may have to give up the only home she's ever known."], "author": "Megan Crewe", "num_pages": "382", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17866959-niko", "num_ratings": "86", "num_reviews": "62", "avg_ratings": 4.19, "genres": ["Fantasy", "Science Fiction", "Dystopia", "Apocalyptic", "Post Apocalyptic", "Science Fiction"], "title": "Niko", "description": ["One can live for several weeks without food but only a few days without water, a fact seventeen year old Niko is only too aware of as she struggles to provide for her two younger brothers in a post apocalyptic landscape where the rain burns like acid, food grows increasingly scarce and any Slither that crosses her path is laid low before it can sink its teeth into her. ", "The", "One can live for several weeks without food but only a few days without water, a fact seventeen year old Niko is only too aware of as she struggles to provide for her two younger brothers in a post apocalyptic landscape where the rain burns like acid, food grows increasingly scarce and any Slither that crosses her path is laid low before it can sink its teeth into her. ", "Then one night everything she'd ever worked for and loved is consumed by a raging fire, leaving her with one brother missing, the other dead and herself gravely injured. ", "She's rescued by the Rose Circle, a rogue group of Slither hunters. They sneak her into Amaryllis City, a decadent metropolis where those able to pay the exorbitant entrance fee live a life of relative ease. ", "But for Niko, Amaryllis City is not the haven she grew up believing it would be and her unique abilities as a Slither hunter make her a particularly visible target to a city with hopes of experimentation, replication and other nasty bits. ", "All Niko ever wanted to do was find her baby brother, but that's proving to be harder than expected."], "author": "Kayti Nika Raet", "num_pages": "205", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24034941-the-kaleidoscope", "num_ratings": "40", "num_reviews": "10", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Philosophy", "Futurism"], "title": "The Kaleidoscope: The Gift of Madness", "description": ["The rise of Alec Helena's most ambitious dream creates an existential shift tainted by an imperfect god. The first generation of life beyond humanity will be riddled with inherit contradictions. Every new life will have its own challenges and strive to find meaning. When androids become the next unwelcome native immigrants, they will be faced with humanity's foreign and do", "The rise of Alec Helena's most ambitious dream creates an existential shift tainted by an imperfect god. The first generation of life beyond humanity will be riddled with inherit contradictions. Every new life will have its own challenges and strive to find meaning. When androids become the next unwelcome native immigrants, they will be faced with humanity's foreign and domestic failures. Can the oppressed forgive their oppressors, or are the scars of such trespasses too deeply ingrained?"], "author": "Adrian Mendoza", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-22 00:00:00", "ISBN": "1505209358"},
{"url": "https://www.goodreads.com/book/show/13526154-stray-souls", "num_ratings": "1,746", "num_reviews": "240", "avg_ratings": 3.87, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fiction", "Fantasy", "Paranormal", "Fantasy", "Magic", "Fantasy", "Supernatural"], "title": "Stray Souls", "description": ["London’s soul has gone missing. Lost? Kidnapped? Murdered? Nobody knows – but when Sharon Li unexpectedly discovers she’s a shaman, she is immediately called upon to use her newfound powers of oneness with the City to rescue it from a slow but inevitable demise.", "The problem is, while everyone expects Sharon to have all the answer", "London’s soul has gone missing. Lost? Kidnapped? Murdered? Nobody knows – but when Sharon Li unexpectedly discovers she’s a shaman, she is immediately called upon to use her newfound powers of oneness with the City to rescue it from a slow but inevitable demise.", "The problem is, while everyone expects Sharon to have all the answers – from the Midnight Mayor to Sharon’s magically-challenged self-help group – she doesn’t have a clue where to start.", "But with London’s soul missing and the Gate open, there are creatures loose that won’t wait for her to catch up before they go hunting."], "author": "Kate Griffin", "num_pages": "464", "awards": [], "places": [], "character_names": ["Matthew Swift", "Sharon Li", "Rhys Ellis", "Sammy the Elbow"], "language": "English", "publish_date": "2012-10-30 00:00:00", "ISBN": "0316187267"},
{"url": "https://www.goodreads.com/book/show/12109372-range-of-ghosts", "num_ratings": "3,231", "num_reviews": "494", "avg_ratings": 3.71, "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy"], "title": "Range of Ghosts", "description": ["Temur, grandson of the Great Khan, is walking away from a battlefield where he was left for dead. All around lie the fallen armies of his cousin and his brother, who made war to rule the Khaganate. Temur is now the legitimate heir by blood to his grandfather's throne, but he is not the strongest. Going into exile is the only way to survive his ruthless cousin.", "Once-Princess", "Temur, grandson of the Great Khan, is walking away from a battlefield where he was left for dead. All around lie the fallen armies of his cousin and his brother, who made war to rule the Khaganate. Temur is now the legitimate heir by blood to his grandfather's throne, but he is not the strongest. Going into exile is the only way to survive his ruthless cousin.", "Once-Princess Samarkar is climbing the thousand steps of the Citadel of the Wizards of Tsarepheth. She was heir to the Rasan Empire until her father got a son on a new wife. Then she was sent to be the wife of a Prince in Song, but that marriage ended in battle and blood. Now she has renounced her worldly power to seek the magical power of the wizards.", "These two will come together to stand against the hidden cult that has so carefully brought all the empires of the Celadon Highway to strife and civil war through guile and deceit and sorcerous power."], "author": "Elizabeth Bear", "num_pages": "334", "awards": ["Chesley Award Nominee for Hardback cover (2013)", "James Tiptree Jr. Award Honor List (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-27 00:00:00", "ISBN": "0765327546"},
{"url": "https://www.goodreads.com/book/show/17304775-claimings-tails-and-other-alien-artifacts", "num_ratings": "2,319", "num_reviews": "400", "avg_ratings": 3.99, "genres": ["Romance", "M M Romance", "Science Fiction", "Erotica", "Bdsm", "Romance", "Science Fiction", "Aliens"], "title": "Claimings, Tails, and Other Alien Artifacts", "description": ["Liam loves his life as a linguist and trader on the Rownt homeworld, but he has ignored his heart and sexual needs for years. He won't risk letting anyone come too close because he won't risk letting anyone see his deeply submissive nature. For him, submission comes with pain. Life burned that lesson into his soul from a young age. This fear keeps him from noticing that th", "Liam loves his life as a linguist and trader on the Rownt homeworld, but he has ignored his heart and sexual needs for years. He won't risk letting anyone come too close because he won't risk letting anyone see his deeply submissive nature. For him, submission comes with pain. Life burned that lesson into his soul from a young age. This fear keeps him from noticing that the Rownt trader Ondry cares for him.", "Ondry may not understand humans, but he recognizes a wounded soul, and his need to protect Liam is quickly outpacing his common sense. They may have laws, culture, and incompatible genitalia in their way, but Ondry knows that he can find a way to overcome all that if he can just overcome the ghosts of Liam's past. Only then can he take possession of a man he has grown to love.", "Available at "], "author": "Lyn Gala", "num_pages": "104", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/153792.Cold_Fire", "num_ratings": "19,306", "num_reviews": "264", "avg_ratings": 4.06, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Cold Fire", "description": ["Daja and Frostpine expect to have a peaceful winter's visit with old friends in Kugisko, a port in the vast empire of Namon. But there is no peace when mysterious fires begin to blaze across the vulnerable city. Daja assists Bennat Ladradun, a local firefighter with a tragic past, to fight the flames. The two become fast friends-unt", "Daja and Frostpine expect to have a peaceful winter's visit with old friends in Kugisko, a port in the vast empire of Namon. But there is no peace when mysterious fires begin to blaze across the vulnerable city. Daja assists Bennat Ladradun, a local firefighter with a tragic past, to fight the flames. The two become fast friends-until they realize the fires have been deliberately set, and their relationship is deeply tested. Daja's magic helps her track down the firestarter, but no magic can protect her or Ben from the effects of madness and betrayal."], "author": "Tamora Pierce", "num_pages": "355", "awards": [], "places": [], "character_names": ["Daja Kisubo", "Frostpine", "Niamara Bancanor", "Jorality Bancanor"], "language": "English", "publish_date": "2006-11-15 00:00:00", "ISBN": "0590396560"},
{"url": "https://www.goodreads.com/book/show/22489107-fairest", "num_ratings": "77,910", "num_reviews": "11,350", "avg_ratings": 4.02, "genres": ["Young Adult", "Fantasy", "Science Fiction"], "title": "Fairest", "description": ["In this stunning bridge book between ", " and ", " in the bestselling Lunar Chronicles, Queen Levana’s story is finally told.", "Fans of the Lunar Chronicles know Queen Levana as a ruler who uses her “glamour” to gain power. But long before she crossed paths with Cinder, Scarlet, and Cress, Levana lived a very differ", "In this stunning bridge book between ", " and ", " in the bestselling Lunar Chronicles, Queen Levana’s story is finally told.", "Fans of the Lunar Chronicles know Queen Levana as a ruler who uses her “glamour” to gain power. But long before she crossed paths with Cinder, Scarlet, and Cress, Levana lived a very different story – a story that has never been told . . . until now. ", "Marissa Meyer spins yet another unforgettable tale about love and war, deceit and death. This extraordinary book includes full-color art and an excerpt from ", ", the next book in the Lunar Chronicles series."], "author": "Marissa Meyer", "num_pages": "222", "awards": [], "places": ["Luna"], "character_names": ["Princess Winter", "Linh Cinder", "Queen Levana", "Jacin Clay", "Queen Channery"], "language": "English", "publish_date": "2015-01-27 00:00:00", "ISBN": "1250060559"},
{"url": "https://www.goodreads.com/book/show/13423346-ink", "num_ratings": "9,322", "num_reviews": "1,484", "avg_ratings": 3.67, "genres": ["Young Adult", "Fantasy", "Romance", "Fantasy", "Paranormal", "Fantasy", "Mythology"], "title": "Ink", "description": ["On the heels of a family tragedy, the last thing Katie Greene wants to do is move halfway across the world. Stuck with her aunt in Shizuoka, Japan, Katie feels lost. Alone. She doesn’t know the language, she can barely hold a pair of chopsticks, and she can’t seem to get the hang of taking her shoes off whenever she enters a building.", "Then there’s gorgeous but aloof Tomohir", "On the heels of a family tragedy, the last thing Katie Greene wants to do is move halfway across the world. Stuck with her aunt in Shizuoka, Japan, Katie feels lost. Alone. She doesn’t know the language, she can barely hold a pair of chopsticks, and she can’t seem to get the hang of taking her shoes off whenever she enters a building.", "Then there’s gorgeous but aloof Tomohiro, star of the school’s kendo team. How did he really get the scar on his arm? Katie isn’t prepared for the answer. But when she sees the things he draws start moving, there’s no denying the truth: Tomo has a connection to the ancient gods of Japan, and being near Katie is causing his abilities to spiral out of control. If the wrong people notice, they'll both be targets.", "Katie never wanted to move to Japan—now she may not make it out of the country alive."], "author": "Amanda Sun", "num_pages": "326", "awards": [], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "2013-06-25 00:00:00", "ISBN": "037321071X"},
{"url": "https://www.goodreads.com/book/show/19161852-the-fifth-season", "num_ratings": "55,862", "num_reviews": "7,699", "avg_ratings": 4.31, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia"], "title": "The Fifth Season", "description": ["This is the way the world ends. Again.", "Three terrible things happen in a single day. Essun, a woman living an ordinary life in a small town, comes home to find that her husband has brutally murdered their son and kidnapped their daughter. Meanwhile, mighty Sanze — the world-spanning empire whose innovations have been civilization’s bedrock for a thousand years — collapses a", "This is the way the world ends. Again.", "Three terrible things happen in a single day. Essun, a woman living an ordinary life in a small town, comes home to find that her husband has brutally murdered their son and kidnapped their daughter. Meanwhile, mighty Sanze — the world-spanning empire whose innovations have been civilization’s bedrock for a thousand years — collapses as most of its citizens are murdered to serve a madman’s vengeance. And worst of all, across the heart of the vast continent known as the Stillness, a great red rift has been torn into the heart of the earth, spewing ash enough to darken the sky for years. Or centuries.", "Now Essun must pursue the wreckage of her family through a deadly, dying land. Without sunlight, clean water, or arable land, and with limited stockpiles of supplies, there will be war all across the Stillness: a battle royale of nations not for power or territory, but simply for the basic resources necessary to get through the long dark night. Essun does not care if the world falls apart around her. She’ll break it herself, if she must, to save her daughter."], "author": "N.K. Jemisin", "num_pages": "468", "awards": ["Hugo Award for Best Novel (2016)", "Nebula Award Nominee for Best Novel (2015)", "Locus Award Nominee for Best Fantasy Novel (2016)", "World Fantasy Award Nominee for Best Novel (2016)", "The Kitschies Nominee for Red Tentacle (Novel) (2015)", "Goodreads Choice Award Nominee for Fantasy (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10429092-the-girl-of-fire-and-thorns", "num_ratings": "67,818", "num_reviews": "6,578", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Did Not Finish"], "title": "The Girl of Fire and Thorns", "description": ["Elisa is the chosen one. ", "But she is also the younger of two princesses, the one who has never done anything remarkable. She can't see how she ever will. ", "Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs the chosen one, not a fa", "Elisa is the chosen one. ", "But she is also the younger of two princesses, the one who has never done anything remarkable. She can't see how she ever will. ", "Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs the chosen one, not a failure of a princess.", "And he's not the only one who seeks her. Savage enemies seething with dark magic are hunting her. A daring, determined revolutionary thinks she could be his people's savior. And he looks at her in a way that no man has ever looked at her before. Soon it is not just her life, but her very heart that is at stake.", "Elisa could be everything to those who need her most. If the prophecy is fulfilled. If she finds the power deep within herself. If she doesn’t die young.", "Most of the chosen do."], "author": "Rae Carson", "num_pages": "423", "awards": ["William C. Morris YA Debut Award Nominee (2012)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)", "Ohioana Book Award for Young Adult (2012)", "Cybils Award Nominee for Fantasy & Science Fiction (Young Adult) (2011)"], "places": [], "character_names": ["Alejandro de Vega", "Lucero-Elisa de Riqueza", "Humberto", "Ximena", "Cosme", "Hector of Ventierra"], "language": "English", "publish_date": "2011-09-20 00:00:00", "ISBN": "0062026488"},
{"url": "https://www.goodreads.com/book/show/9636143-luck-in-the-shadows", "num_ratings": "16,168", "num_reviews": "933", "avg_ratings": 4.08, "genres": ["Fantasy", "Lgbt", "Romance", "M M Romance", "Fiction"], "title": "Luck in the Shadows", "description": ["When young Alec of Kerry is taken prisoner for a crime he didn’t commit, he is certain that his life is at an end. But one thing he never expected was his cellmate. Spy, rogue, thief, and noble, Seregil of Rhiminee is many things–none of them predictable. And when he offers to take on Alec as his apprentice, things may never be the same for either of them. Soon Alec is tra", "When young Alec of Kerry is taken prisoner for a crime he didn’t commit, he is certain that his life is at an end. But one thing he never expected was his cellmate. Spy, rogue, thief, and noble, Seregil of Rhiminee is many things–none of them predictable. And when he offers to take on Alec as his apprentice, things may never be the same for either of them. Soon Alec is traveling roads he never knew existed, toward a war he never suspected was brewing. Before long he and Seregil are embroiled in a sinister plot that runs deeper than either can imagine, and that may cost them far more than their lives if they fail. But fortune is as unpredictable as Alec’s new mentor, and this time there just might be…Luck in the Shadows."], "author": "Lynn Flewelling", "num_pages": "497", "awards": [], "places": [], "character_names": ["Alec í Amasa of Kerry", "Seregil í Korit Solun Meringil Bôkthersa"], "language": "English", "publish_date": "2010-11-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/36347830-song-of-blood-stone", "num_ratings": "915", "num_reviews": "481", "avg_ratings": 3.73, "genres": ["Fantasy", "Romance", "Young Adult", "New Adult"], "title": "Song of Blood & Stone", "description": ["Orphaned and alone, Jasminda lives in a land where cold whispers of invasion and war linger on the wind. Jasminda herself is an outcast in her homeland of Elsira, where her gift of Earthsong is feared. When ruthless soldiers seek refuge in her isolated cabin, they bring w", "Orphaned and alone, Jasminda lives in a land where cold whispers of invasion and war linger on the wind. Jasminda herself is an outcast in her homeland of Elsira, where her gift of Earthsong is feared. When ruthless soldiers seek refuge in her isolated cabin, they bring with them a captive--an injured spy who threatens to steal her heart. ", "Jack's mission behind enemy lines to prove that the Mantle between Elsira and Lagamiri is about to fall nearly cost him his life, but he is saved by the healing Song of a mysterious young woman. Now he must do whatever it takes to save Elsira and it's people from the True Father and he needs Jasminda's Earthsong to do it. They escape their ruthless captors and together they embark on a perilous journey to save Elsira and to uncover the secrets of The Queen Who Sleeps. ", "Thrust into a hostile society, Jasminda and Jack must rely on one another even as secrets jeopardize their bond. As an ancient evil gains power, Jasminda races to unlock a mystery that promises salvation. ", "The fates of two nations hang in the balance as Jasminda and Jack must choose between love and duty to fulfill their destinies and end the war."], "author": "L. Penelope", "num_pages": "372", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-05-01 00:00:00", "ISBN": "1250148073"},
{"url": "https://www.goodreads.com/book/show/34728667-children-of-blood-and-bone", "num_ratings": "34,893", "num_reviews": "8,432", "avg_ratings": 4.29, "genres": ["Fantasy", "Young Adult", "Fiction"], "title": "Children of Blood and Bone", "description": ["They killed my mother.", "They took our magic.", "They tried to bury us.", "Now we rise.", "Zélie Adebola remembers when the soil of Orïsha hummed with magic. Burners ignited flames, Tiders beckoned waves, and Zélie’s Reaper mother summoned forth souls.", "But everything changed the night magic disappeared. Under the orders of a ruthless king, maji were killed, leaving Zélie without a mother", "They killed my mother.", "They took our magic.", "They tried to bury us.", "Now we rise.", "Zélie Adebola remembers when the soil of Orïsha hummed with magic. Burners ignited flames, Tiders beckoned waves, and Zélie’s Reaper mother summoned forth souls.", "But everything changed the night magic disappeared. Under the orders of a ruthless king, maji were killed, leaving Zélie without a mother and her people without hope.", "Now Zélie has one chance to bring back magic and strike against the monarchy. With the help of a rogue princess, Zélie must outwit and outrun the crown prince, who is hell-bent on eradicating magic for good.", "Danger lurks in Orïsha, where snow leoponaires prowl and vengeful spirits wait in the waters. Yet the greatest danger may be Zélie herself as she struggles to control her powers and her growing feelings for an enemy."], "author": "Tomi Adeyemi", "num_pages": "525", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-03-06 00:00:00", "ISBN": "1250170974"},
{"url": "https://www.goodreads.com/book/show/18458653-goddess-tithe", "num_ratings": "243", "num_reviews": "56", "avg_ratings": 4.19, "genres": ["Fantasy", "Christian Fiction", "Young Adult", "Christian", "Adventure", "Christian Fiction", "Christian Fantasy", "Fiction"], "title": "Goddess Tithe", "description": ["When a stowaway is discovered aboard the merchant ship ", ", Munny, a cabin boy on his first voyage, knows what must be done. All stowaways are sacrificed to Risafeth, the evil goddess of the sea. Such is her right, and the ", " only hope to return safely home.", "Yet, to the horror of his crew, Captain Sunan vows to prot", "When a stowaway is discovered aboard the merchant ship ", ", Munny, a cabin boy on his first voyage, knows what must be done. All stowaways are sacrificed to Risafeth, the evil goddess of the sea. Such is her right, and the ", " only hope to return safely home.", "Yet, to the horror of his crew, Captain Sunan vows to protect the stowaway, a foreigner in clown's garb. A curse falls upon the ship and all who sail with her, for Risafeth will stop at nothing to claim her tithe.", "Will Munny find the courage to trust his captain and to protect the strange clown who has become his friend?"], "author": "Anne Elisabeth Stengl", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-12 00:00:00", "ISBN": "0989447804"},
{"url": "https://www.goodreads.com/book/show/25159239-the-girl-with-ghost-eyes", "num_ratings": "2,595", "num_reviews": "506", "avg_ratings": 3.89, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Historical"], "title": "The Girl with Ghost Eyes", "description": ["It’s the end of the nineteenth century in San Francisco’s Chinatown, and ghost hunters from the Maoshan traditions of Daoism keep malevolent spiritual forces at bay. Li-lin, the daughter of a renowned Daoshi exorcist, is a young widow burdened with yin eyes—the unique ability to see the spirit world. Her spiritual visions and the death of her husband bring shame to Li-lin", "It’s the end of the nineteenth century in San Francisco’s Chinatown, and ghost hunters from the Maoshan traditions of Daoism keep malevolent spiritual forces at bay. Li-lin, the daughter of a renowned Daoshi exorcist, is a young widow burdened with yin eyes—the unique ability to see the spirit world. Her spiritual visions and the death of her husband bring shame to Li-lin and her father—and shame is not something this immigrant family can afford.", "When a sorcerer cripples her father, terrible plans are set in motion, and only Li-lin can stop them. To aid her are her martial arts and a peachwood sword, her burning paper talismans, and a wisecracking spirit in the form of a human eyeball tucked away in her pocket. Navigating the dangerous alleys and backrooms of a male-dominated Chinatown, Li-lin must confront evil spirits, gangsters, and soulstealers before the sorcerer’s ritual summons an ancient evil that could burn Chinatown to the ground.", "With a rich and inventive historical setting, nonstop martial arts action, authentic Chinese magic, and bizarre monsters from Asian folklore, ", " is also the poignant story of a young immigrant searching to find her place beside the long shadow of a demanding father and the stigma of widowhood. In a Chinatown caught between tradition and modernity, one woman may be the key to holding everything together."], "author": "M.H. Boroson", "num_pages": "288", "awards": ["Colorado Gold Award for Best Speculative Fiction"], "places": ["Chinatown, San Francisco, California"], "character_names": [], "language": "English", "publish_date": "2015-11-03 00:00:00", "ISBN": "1940456363"},
{"url": "https://www.goodreads.com/book/show/32725389-log", "num_ratings": "12", "num_reviews": "5", "avg_ratings": 4.58, "genres": ["Comics", "Superheroes", "Science Fiction"], "title": "LOG: The Legends of Genesis: Not Your Ordinary Heroes", "description": ["The Legends of Genesis (Asian, African, and World mythology) (fantasy, super power, anime, super hero, wuxia, martial arts, philosophy, historical, romance, action, adventure, sci-fi, prehistoric) ", "Imagine a world where people don't age past their prime. Where a person that would labeled as intellectually gifted on Earth is nothing more than average there. A place where the", "The Legends of Genesis (Asian, African, and World mythology) (fantasy, super power, anime, super hero, wuxia, martial arts, philosophy, historical, romance, action, adventure, sci-fi, prehistoric) ", "Imagine a world where people don't age past their prime. Where a person that would labeled as intellectually gifted on Earth is nothing more than average there. A place where the average person is even more powerful than your typical super hero. A place several times more vast and mysterious than earth . and home to over 50 non hybrid races. Just Imagine how far they would have advanced in the time that we have had. Then imagine how far they would have advanced given 10, 100, or even 1000 times longer than we had. Do you imagine large skyscrapers and flying cars as in your common sci fi flicks and novels. Well, they've advanced far past that even. What would their super heroes be like, and the villains that they have to combine forces to fight against. And how would the planet survive the battles between these people. Not to mention what would every day life be like? And with their powers would they feel as gods themselves and not have need to reverence them? ", "In fact the heroes held a contest and after beating many Shenxian, kami, Orishas, and Immortals they believed they were indeed powerful enough to at least compete with the gods. They challenged the supreme gods and the realm gods. After loosing horribly they incurred the supreme goddess' wrath as punishment. However she was not satisfied with just punishing them, as she wanted to destroy them completely. However the supreme god felt that their punishment was enough and that they should be forgiven. Unable to agree they decided to settle it the way gods do. They made bet which would decide whether they would perish or thrive. Six beings would be created, beings much more powerful than any that have ever been created. Two beings would be of light, two would be of darkness, and two neutral ones that would pick a side. The gods would set up challenges for them along the way to train them until the day of the final contest. When that day comes they would fight each other to the death and if light won they would be saved, however if dark won they would all die. Which one would prevail light or darkness? Sounds like your typical fantasy novel right? However what if when they are born they decide not to be pawns in the god's game? Can and will they defy their destiny even when all their moves are being controlled leading them to that end? And if they do defy the gods what will be the retribution for their actions,... and more importantly how will they respond to it? ", "This story follows the lives of the 6 beings. ", "The children of Darkness ", "Titan- (master of dimensions, souls, energy, and matter/anti matter) ", "Nina- (Master of psyche, various elements and forces, space, and the dead) ", "The children of Light ", "Emerald- (elemental master, spirit and sentient, energy, matter and fusion) ", "Sapphire (Master of copying and reversing, Time, and various elements) ", "The neutral children ", "Rage (master of reality, mystic, and various elements.) ", "Dragon (master of magic, various elements, and death) ", "This story has hundreds of characters all with their own goals and interest. Full of unexpected plot twists and turns that will keep you guessing at each turn of the page. Volume 1 deals with the introduction of the main characters but is by no means slow paced. It pulls you right into the ever evolving and expanding world. Filled with action, romance, comedy, and philosophy that will have you rethink everything. This is anything but ordinary, and one thing to keep in mind is that nothing is as it seems."], "author": "Mark McCants", "num_pages": "656", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20821111-the-young-elites", "num_ratings": "84,958", "num_reviews": "11,485", "avg_ratings": 3.92, "genres": ["Fantasy", "Young Adult", "Science Fiction", "Dystopia"], "title": "The Young Elites", "description": [" A decade ago, the deadly illness swept through her nation. Most of the infected perished, while many of the children who survived were left with strange markings. Adelina’s black hair turned silver, her lashes went pale, and now she has only a jagged scar where her left eye on", " A decade ago, the deadly illness swept through her nation. Most of the infected perished, while many of the children who survived were left with strange markings. Adelina’s black hair turned silver, her lashes went pale, and now she has only a jagged scar where her left eye once was. Her cruel father believes she is a malfetto, an abomination, ruining their family’s good name and standing in the way of their fortune. But some of the fever’s survivors are rumored to possess more than just scars—they are believed to have mysterious and powerful gifts, and though their identities remain secret, they have come to be called the Young Elites.", " As Leader of the Inquisition Axis, it is his job to seek out the Young Elites, to destroy them before they destroy the nation. He believes the Young Elites to be dangerous and vengeful, but it’s Teren who may possess the darkest secret of all. ", " This secret sect of Young Elites seeks out others like them before the Inquisition Axis can. But when the Daggers find Adelina, they discover someone with powers like they’ve never seen. ", "Adelina wants to believe Enzo is on her side, and that Teren is the true enemy. But the lives of these three will collide in unexpected ways, as each fights a very different and personal battle. But of one thing they are all certain: Adelina has abilities that shouldn’t belong in this world. A vengeful blackness in her heart. And a desire to destroy all who dare to cross her."], "author": "Marie Lu", "num_pages": "355", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2014)"], "places": ["Kenettra"], "character_names": ["Adelina Amouteru", "Enzo Valenciano", "Teren Santoro"], "language": "English", "publish_date": "2014-10-07 00:00:00", "ISBN": "0399167838"},
{"url": "https://www.goodreads.com/book/show/11487807-throne-of-the-crescent-moon", "num_ratings": "9,327", "num_reviews": "1,505", "avg_ratings": 3.63, "genres": ["Fantasy", "Fiction", "Adventure", "Science Fiction Fantasy", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy"], "title": "Throne of the Crescent Moon", "description": ["The Crescent Moon Kingdoms, home to djenn and ghuls, holy warriors and heretics, are at the boiling point of a power struggle between the iron-fisted Khalif and the mysterious master thief known as the Falcon Prince. In the midst of this brewing rebellion a series of brutal supernatural murders strikes at the heart of the Kingdoms. It is up to a handful of heroes to learn", "The Crescent Moon Kingdoms, home to djenn and ghuls, holy warriors and heretics, are at the boiling point of a power struggle between the iron-fisted Khalif and the mysterious master thief known as the Falcon Prince. In the midst of this brewing rebellion a series of brutal supernatural murders strikes at the heart of the Kingdoms. It is up to a handful of heroes to learn the truth behind these killings:", "Doctor Adoulla Makhslood, “the last real ghul hunter in the great city of Dhamsawaat,” just wants a quiet cup of tea. Three score and more years old, he has grown weary of hunting monsters and saving lives, and is more than ready to retire from his dangerous and demanding vocation. But when an old flame’s family is murdered, Adoulla is drawn back to the hunter’s path.", "Raseed bas Raseed, Adoulla’s young assistant, is a hidebound holy warrior whose prowess is matched only by his piety. But even as Raseed’s sword is tested by ghuls and manjackals, his soul is tested when he and Adoulla cross paths with the tribeswoman Zamia.", "Zamia Badawi, Protector of the Band, has been gifted with the near-mythical power of the lion-shape, but shunned by her people for daring to take up a man’s title. She lives only to avenge her father’s death. Until she learns that Adoulla and his allies also hunt her father’s killer. Until she meets Raseed.", "When they learn that the murders and the Falcon Prince’s brewing revolution are connected, the companions must race against time—and struggle against their own misgivings—to save the life of a vicious despot. In so doing they discover a plot for the Throne of the Crescent Moon that threatens to turn Dhamsawaat, and the world itself, into a blood-soaked ruin."], "author": "Saladin Ahmed", "num_pages": "274", "awards": ["Hugo Award Nominee for Best Novel (2013)", "Nebula Award Nominee for Best Novel (2012)", "Locus Award for Best First Novel (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-02-07 00:00:00", "ISBN": "0756407117"},
{"url": "https://www.goodreads.com/book/show/28759.Magic_s_Pawn", "num_ratings": "21,850", "num_reviews": "700", "avg_ratings": 4.21, "genres": ["Fantasy", "Fiction", "Lgbt", "Romance", "M M Romance"], "title": "Magic's Pawn", "description": ["Mage-Craft—", "Though Vanyel has been born with near-legendary abilities to work both Herald and Mage magic, he wants no part of such things. Nor does he seek a warrior's path, wishing instead to become a Bard. Yet such talent as his if left untrained may prove a menace not only to Vanyel but to others as well. So he is sent to be fostered with his aunt, Savil, one of the fame", "Mage-Craft—", "Though Vanyel has been born with near-legendary abilities to work both Herald and Mage magic, he wants no part of such things. Nor does he seek a warrior's path, wishing instead to become a Bard. Yet such talent as his if left untrained may prove a menace not only to Vanyel but to others as well. So he is sent to be fostered with his aunt, Savil, one of the famed Herald-Mages of Valdemar.", "But, strong-willed and self-centered, Vanyel is a challenge which even Savil can not master alone. For soon he will become the focus of frightening forces, lending his raw magic to a spell that unleashes terrifying wyr-hunters on the land. And by the time Savil seeks the assistance of a Shin'a'in Adept, Vanyel's wild talent may have already grown beyond anyone's ability to contain, placing Vanyel, Savil, and Valdemar itself in desperate peril..."], "author": "Mercedes Lackey", "num_pages": "349", "awards": ["Lambda Literary Award Nominee for Gay Men's Science Fiction/Fantasy (1990)"], "places": ["Valdemar"], "character_names": ["Vanyel Ashkevron", "Yfandes", "Savil Ashkevron", "Tylendel Frelennye", "Starwind k'Treva", "Moondance k'Treva"], "language": "English", "publish_date": "1989-06-06 00:00:00", "ISBN": "0886773520"},
{"url": "https://www.goodreads.com/book/show/17559595-six-gun-snow-white", "num_ratings": "2,954", "num_reviews": "718", "avg_ratings": 3.72, "genres": ["Fantasy", "Fantasy", "Fairy Tales", "Fiction", "Westerns", "Historical", "Historical Fiction", "Retellings", "Novella"], "title": "Six-Gun Snow White", "description": ["From New York Times bestselling author Catherynne M. Valente comes a brilliant reinvention of one the best known fairy tales of all time. In the novella Six-Gun Snow White, Valente transports the title s heroine to a masterfully evoked Old West where Coyote is just as likely to be found as the seven dwarves.", "A plain-spoken, appealing narrator relates the history of her pare", "From New York Times bestselling author Catherynne M. Valente comes a brilliant reinvention of one the best known fairy tales of all time. In the novella Six-Gun Snow White, Valente transports the title s heroine to a masterfully evoked Old West where Coyote is just as likely to be found as the seven dwarves.", "A plain-spoken, appealing narrator relates the history of her parents--a Nevada silver baron who forced the Crow people to give up one of their most beautiful daughters, Gun That Sings, in marriage to him. With her mother s death in childbirth, so begins a heroine s tale equal parts heartbreak and strength. This girl has been born into a world with no place for a half-native, half-white child. After being hidden for years, a very wicked stepmother finally gifts her with the name Snow White, referring to the pale skin she will never have. Filled with fascinating glimpses through the fabled looking glass and a close-up look at hard living in the gritty gun-slinging West, readers will be enchanted by this story at once familiar and entirely new."], "author": "Catherynne M. Valente", "num_pages": "106", "awards": ["Hugo Award Nominee for Best Novella (2014)", "Nebula Award Nominee for Best Novella (2013)", "Locus Award for Best Novella (2014)"], "places": [], "character_names": [], "language": null, "publish_date": "2013-02-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/714902.Noughts_Crosses", "num_ratings": "37,695", "num_reviews": "2,738", "avg_ratings": 4.23, "genres": ["Young Adult", "Romance", "Science Fiction", "Dystopia", "Fiction"], "title": "Noughts & Crosses", "description": ["Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.", "Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their", "Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.", "Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their world, Noughts and Crosses simply don’t mix. Against a background of prejudice and distrust, intensely highlighted by violent terrorist activity, a romance builds between Sephy and Callum -- a romance that is to lead both of them into terrible danger. Can they possibly find a way to be together?"], "author": "Malorie Blackman", "num_pages": "490", "awards": ["FCBG Children’s Book Award (2002)", "Sheffields Children's Book of the Year (2002)", "Wirral Children’s Paperback of the Year Award (2003)", "Lancashire Children’s Book of the Year Award (2002)", "North East Teenage Book Award Nominee (2002)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2009)"], "places": [], "character_names": ["Callum McGregor", "Persephone 'Sephy' Hadley"], "language": "English", "publish_date": "2006-08-08 00:00:00", "ISBN": "0552555703"},
{"url": "https://www.goodreads.com/book/show/60925.Fledgling", "num_ratings": "15,020", "num_reviews": "2,109", "avg_ratings": 3.89, "genres": ["Fantasy", "Fiction", "Paranormal", "Vampires", "Science Fiction", "Horror", "Fantasy", "Paranormal", "Science Fiction Fantasy", "Speculative Fiction", "Fantasy", "Supernatural", "Fantasy", "Urban Fantasy"], "title": "Fledgling", "description": [", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wa", ", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wants - to destroy her and those she cares for and how she can save herself. ", " is a captivating novel that tests the limits of \"otherness\" and questions what it means to be truly human."], "author": "Octavia E. Butler", "num_pages": "320", "awards": ["Endeavour Award Nominee (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-02 00:00:00", "ISBN": "0446696161"},
{"url": "https://www.goodreads.com/book/show/10744752-adaptation", "num_ratings": "6,346", "num_reviews": "920", "avg_ratings": 3.62, "genres": ["Young Adult", "Science Fiction", "Lgbt", "Fiction", "Glbt", "Queer"], "title": "Adaptation", "description": ["Reese can’t remember anything from the time between the accident and the day she woke up almost a month later. She only knows one thing: She’s different now.", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of tra", "Reese can’t remember anything from the time between the accident and the day she woke up almost a month later. She only knows one thing: She’s different now.", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of travelers are stranded.", "Reese and her debate team partner and longtime crush David are in Arizona when it happens. Everyone knows the world will never be the same. On their drive home to San Francisco, along a stretch of empty highway at night in the middle of Nevada, a bird flies into their headlights. The car flips over. When they wake up in a military hospital, the doctor won’t tell them what happened, where they are—or how they’ve been miraculously healed.", "Things become even stranger when Reese returns home. San Francisco feels like a different place with police enforcing curfew, hazmat teams collecting dead birds, and a strange presence that seems to be following her. When Reese unexpectedly collides with the beautiful Amber Gray, her search for the truth is forced in an entirely new direction—and threatens to expose a vast global conspiracy that the government has worked for decades to keep secret."], "author": "Malinda Lo", "num_pages": "386", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-18 00:00:00", "ISBN": "0316197963"},
{"url": "https://www.goodreads.com/book/show/7507944-akata-witch", "num_ratings": "9,611", "num_reviews": "1,940", "avg_ratings": 4.09, "genres": ["Fantasy", "Young Adult", "Fiction", "Cultural", "Africa", "Childrens", "Middle Grade", "Fantasy", "Magic"], "title": "Akata Witch", "description": [" transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befr", " transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befriends Orlu and Chichi, Sunny is plunged in to the world of the Leopard People, where your worst defect becomes your greatest asset. Together, Sunny, Orlu, Chichi and Sasha form the youngest ever Oha Coven. Their mission is to track down Black Hat Otokoto, the man responsible for kidnapping and maiming children. Will Sunny be able to overcome the killer with powers stronger than her own, or will the future she saw in the flames become reality?"], "author": "Nnedi Okorafor", "num_pages": "349", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2011)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)"], "places": ["Nigeria"], "character_names": ["Sunny Nwazue"], "language": "English", "publish_date": "2011-04-14 00:00:00", "ISBN": "0670011967"},
{"url": "https://www.goodreads.com/book/show/7090447-the-red-pyramid", "num_ratings": "267,551", "num_reviews": "11,681", "avg_ratings": 4.07, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Red Pyramid", "description": ["Since his mother's death six years ago, Carter Kane has been living out of a suitcase, traveling the globe with his father, the brilliant Egyptologist, Dr. Julius Kane. But while Carter's been homeschooled, his younger sister, Sadie, has been living with their grandparents in London. Sadie has just what Carter wants—school friends and a chance at a \"normal\" life. But Carte", "Since his mother's death six years ago, Carter Kane has been living out of a suitcase, traveling the globe with his father, the brilliant Egyptologist, Dr. Julius Kane. But while Carter's been homeschooled, his younger sister, Sadie, has been living with their grandparents in London. Sadie has just what Carter wants—school friends and a chance at a \"normal\" life. But Carter has just what Sadie longs for—time with their father. After six years of living apart, the siblings have almost nothing in common. Until now.", "On Christmas Eve, Sadie and Carter are reunited when their father brings them to the British Museum, with a promise that he's going to \"make things right.\" But all does not go according to plan: Carter and Sadie watch as Julius summons a mysterious figure, who quickly banishes their father and causes a fiery explosion.", "Soon Carter and Sadie discover that the gods of Ancient Egypt are waking, and the worst of them—Set—has a frightening scheme. To save their father, they must embark on a dangerous journey—a quest that brings them ever closer to the truth about their family and its links to the House of Life, a secret order that has existed since the time of the pharaohs."], "author": "Rick Riordan", "num_pages": "516", "awards": ["Pennsylvania Young Readers' Choice Award for Grades 6-8 (2012)", "New Mexico Land of Enchantment Award for Young Adult (2012)", "Goodreads Choice Award Nominee for Favorite Book, Young Adult Fantasy (2010)", "Carnegie Medal Nominee (2011)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2011)"], "places": ["London, England", "Cairo", "Phoenix, Arizona", "Duat"], "character_names": ["Bast", "Isis", "Anubis", "Osiris", "Horus (God)", "Carter Kane", "Sadie Kane", "Zia Rashid", "Thoth", "Khufu", "Sekhmet", "Julius Kane", "Geb", "Nut", "Set", "Nephthys", "Serket", "Sobek", "Shu", "Nekhbet", "Apophis", "Philip II of Macedon (The albino crocodile)"], "language": "English", "publish_date": "2010-05-04 00:00:00", "ISBN": "1423113381"},
{"url": "https://www.goodreads.com/book/show/4214.Life_of_Pi", "num_ratings": "1,136,844", "num_reviews": "44,550", "avg_ratings": 3.89, "genres": ["Fiction", "Fantasy", "Adventure", "Classics"], "title": "Life of Pi", "description": ["Life of Pi is a fantasy adventure novel by Yann Martel published in 2001. The protagonist, Piscine Molitor \"Pi\" Patel, a Tamil boy from Pondicherry, explores issues of spirituality and practicality from an early age. He survives 227 days after a shipwreck while stranded on a boat in the Pacific Ocean with a Bengal tiger named Richard Parker."], "author": "Yann Martel", "num_pages": "460", "awards": ["Man Booker Prize (2002)", "Bollinger Everyman Wodehouse Prize Nominee for Comic Fiction (2003)", "Exclusive Books Boeke Prize (2003)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général Nominee for Fiction (2001)", "Lincoln Award Nominee (2005)", "Deutscher Bücherpreis for Belletristik (2004)", "CBC Canada Reads Nominee (2003)", "Luisterboek Award Nominee (2015)", "QWF (Quebec Writer's Federation) Awards for Paragraphe Hugh MacLennan Prize for Fiction (2001)", "Asian/Pacific American Award for Literature for Adult Fiction (2003)"], "places": ["Pacific Ocean", "Pondicherry", "Toronto, Ontario", "Tomatlan"], "character_names": ["Pi Patel", "Richard Parker"], "language": "English", "publish_date": "2006-08-29 00:00:00", "ISBN": "0770430074"},
{"url": "https://www.goodreads.com/book/show/15721624-orleans", "num_ratings": "3,186", "num_reviews": "646", "avg_ratings": 3.74, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Fiction", "Apocalyptic", "Post Apocalyptic"], "title": "Orleans", "description": ["After a string of devastating hurricanes and a severe outbreak of Delta Fever, the Gulf Coast has been quarantined. Years later, residents of the Outer States are under the assumption that life in the Delta is all but extinct… but in reality, a new primitive society has been born.", "Fen de la Guerre is living with the O-P", "After a string of devastating hurricanes and a severe outbreak of Delta Fever, the Gulf Coast has been quarantined. Years later, residents of the Outer States are under the assumption that life in the Delta is all but extinct… but in reality, a new primitive society has been born.", "Fen de la Guerre is living with the O-Positive blood tribe in the Delta when they are ambushed. Left with her tribe leader’s newborn, Fen is determined to get the baby to a better life over the wall before her blood becomes tainted. Fen meets Daniel, a scientist from the Outer States who has snuck into the Delta illegally. Brought together by chance, kept together by danger, Fen and Daniel navigate the wasteland of Orleans. In the end, they are each other’s last hope for survival.", "Sherri L. Smith delivers an expertly crafted story about a fierce heroine whose powerful voice and firm determination will stay with you long after you’ve turned the last page."], "author": "Sherri L. Smith", "num_pages": "324", "awards": ["Milwaukee County Teen Book Award Nominee (2014)"], "places": ["New Orleans, Louisiana"], "character_names": ["Fen de la Guerre"], "language": "English", "publish_date": "2013-03-07 00:00:00", "ISBN": "0399252940"},
{"url": "https://www.goodreads.com/book/show/24093.Street_Magic", "num_ratings": "21,163", "num_reviews": "302", "avg_ratings": 4.13, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Young Adult", "Young Adult Fantasy"], "title": "Street Magic", "description": ["It's been four years since Briar Moss began his training as a plant mage, but he still hasn't put his past behind him. Wandering through a Chammuri market, Briar comes across a street girl using powerful magic to polish stones for a merchant. He resolves to find her a teacher. But Briar understands the city's gangs as well as he understands Evvy, the young mage. When gang", "It's been four years since Briar Moss began his training as a plant mage, but he still hasn't put his past behind him. Wandering through a Chammuri market, Briar comes across a street girl using powerful magic to polish stones for a merchant. He resolves to find her a teacher. But Briar understands the city's gangs as well as he understands Evvy, the young mage. When gang warfare breaks out in Chammur, Briar discovers that the fiercest gang is seeking a stone mage to lead them to hidden gems. Briar once believed gangs offered protection, but now he and his mage may offer the only protection Evvy can count on. As Briar is swept up in a bloody conflict, he must decide whether he's ready to make the final step away from his former life as a \"street rat.\""], "author": "Tamora Pierce", "num_pages": "300", "awards": [], "places": [], "character_names": ["Rosethorn", "Evumeimei Dingzai", "Briar Moss"], "language": "English", "publish_date": "2006-11-15 00:00:00", "ISBN": "0590396439"},
{"url": "https://www.goodreads.com/book/show/248484.Book_of_a_Thousand_Days", "num_ratings": "44,285", "num_reviews": "5,890", "avg_ratings": 3.96, "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Fiction"], "title": "Book of a Thousand Days", "description": ["When Dashti, a maid, and Lady Saren, her mistress, are shut in a tower for seven years because of Saren's refusal to marry a man she despises, the two prepare for a very long and dark imprisonment.", "As food runs low and the days go from broiling hot to freezing cold, it is all Dashti can do to keep them fed and comfortable. With the arrival outside the tower of Saren's two s", "When Dashti, a maid, and Lady Saren, her mistress, are shut in a tower for seven years because of Saren's refusal to marry a man she despises, the two prepare for a very long and dark imprisonment.", "As food runs low and the days go from broiling hot to freezing cold, it is all Dashti can do to keep them fed and comfortable. With the arrival outside the tower of Saren's two suitors--one welcome, the other decidedly less so--the girls are confronted with both hope and great danger, and Dashti must make the desperate choices of a girl whose life is worth more than she knows.", "With Shannon Hale's lyrical language, this little-known classic fairy tale from the Brothers Grimm is reimagined and reset on the central Asian steppes; it is a completely unique retelling filled with adventure and romance, drama and disguise."], "author": "Shannon Hale", "num_pages": "306", "awards": ["Utah Book Award for Children/Young Adults (2007)", "Dorothy Canfield Fisher Children's Book Award Nominee (2009)", "Judy Lopez Memorial Award for Children's Literature Nominee (2008)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2010)"], "places": [], "character_names": ["Dashti", "Lady Saren", "Khan Tegus", "Lord Khasar"], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1599900513"},
{"url": "https://www.goodreads.com/book/show/13539191-three-parts-dead", "num_ratings": "9,710", "num_reviews": "1,441", "avg_ratings": 3.98, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Fiction", "Science Fiction", "Science Fiction Fantasy"], "title": "Three Parts Dead", "description": ["A god has died, and it’s up to Tara, first-year associate in the international necromantic firm of Kelethres, Albrecht, and Ao, to bring Him back to life before His city falls apart.", "Her client is Kos, recently deceased fire god of the city of Alt Coulumb. Without Him, the metropolis’s steam generators will shut down, its trains will cease running, and its four million citi", "A god has died, and it’s up to Tara, first-year associate in the international necromantic firm of Kelethres, Albrecht, and Ao, to bring Him back to life before His city falls apart.", "Her client is Kos, recently deceased fire god of the city of Alt Coulumb. Without Him, the metropolis’s steam generators will shut down, its trains will cease running, and its four million citizens will riot.", "Tara’s job: resurrect Kos before chaos sets in. Her only help: Abelard, a chain-smoking priest of the dead god, who’s having an understandable crisis of faith.", "When Tara and Abelard discover that Kos was murdered, they have to make a case in Alt Coulumb’s courts—and their quest for the truth endangers their partnership, their lives, and Alt Coulumb’s slim hope of survival.", "Set in a phenomenally built world in which justice is a collective force bestowed on a few, craftsmen fly on lightning bolts, and gargoyles can rule cities, ", " introduces readers to an ethical landscape in which the line between right and wrong blurs."], "author": "Max Gladstone", "num_pages": "336", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-02 00:00:00", "ISBN": "0765333104"},
{"url": "https://www.goodreads.com/book/show/60924.Seed_to_Harvest", "num_ratings": "3,513", "num_reviews": "249", "avg_ratings": 4.32, "genres": ["Science Fiction", "Fiction", "Fantasy"], "title": "Seed to Harvest", "description": ["Contains the novels Wild Seed, Mind of My Mind, Clay's Ark, and Patternmaster.", "In her classic Patternist series, multiple Hugo and Nebula award winner Octavia E. Butler established themes of identity and transformation that echo throughout her distinguished career. Now collected for the first time in one volume, these four novels take readers on a wondrous odyssey from a my", "Contains the novels Wild Seed, Mind of My Mind, Clay's Ark, and Patternmaster.", "In her classic Patternist series, multiple Hugo and Nebula award winner Octavia E. Butler established themes of identity and transformation that echo throughout her distinguished career. Now collected for the first time in one volume, these four novels take readers on a wondrous odyssey from a mythic, prim/ordial past to a fantastic far future.", "In ancient Africa, a female demigod of nurture and fertility mates with a powerful, destructive male entity. Together they birth a race of madmen, visionaries, and psychics who cling to civilization's margins and back alleys for millenia, coming together in a telepathic Pattern just as Earth is consumed by a cosmic invasion. Now these new beings--no longer mearly human--will battle to rule the transfigured world."], "author": "Octavia E. Butler", "num_pages": "767", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-05 00:00:00", "ISBN": "0446698903"},
{"url": "https://www.goodreads.com/book/show/11774272-the-killing-moon", "num_ratings": "9,282", "num_reviews": "1,169", "avg_ratings": 3.87, "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Science Fiction Fantasy"], "title": "The Killing Moon", "description": ["In the ancient city-state of Gujaareh, peace is the only law. Upon its rooftops and among the shadows of its cobbled streets wait the Gatherers - the keepers of this peace. Priests of the dream-goddess, their duty is to harvest the magic of the sleeping mind and use it to heal, soothe...and kill those judged corrupt.", "But when a consp", "In the ancient city-state of Gujaareh, peace is the only law. Upon its rooftops and among the shadows of its cobbled streets wait the Gatherers - the keepers of this peace. Priests of the dream-goddess, their duty is to harvest the magic of the sleeping mind and use it to heal, soothe...and kill those judged corrupt.", "But when a conspiracy blooms within Gujaareh's great temple, the Gatherer Ehiru must question everything he knows. Someone, or something, is murdering innocent dreamers in the goddess's name, and Ehiru must now protect the woman he was sent to kill - or watch the city be devoured by war and forbidden magic."], "author": "N.K. Jemisin", "num_pages": "418", "awards": ["Nebula Award Nominee for Best Novel (2012)", "Locus Award Nominee for Best Fantasy Novel (2013)", "World Fantasy Award Nominee for Best Novel (2013)", "Goodreads Choice Award Nominee for Best Fantasy (2012)"], "places": [], "character_names": ["Ehiru", "Nijiri", "Sunandi"], "language": "English", "publish_date": "2012-05-01 00:00:00", "ISBN": "0356500764"},
{"url": "https://www.goodreads.com/book/show/33142375-eric-olafson", "num_ratings": "96", "num_reviews": "25", "avg_ratings": 4.0, "genres": ["Glbt", "Queer", "Science Fiction"], "title": "Eric Olafson : Space Pirate", "description": ["It's the year 5021 and the Milky Way Galaxy is teeming with life and exotic species. The majority of the known civilisations have formed a multi-cultural mega organization called the United Stars of Galaxies. This Union is protected by the brave men and women of the United Stars Space fleet against external threats.", "Eric Olafson, born and raised under harsh conditions of th", "It's the year 5021 and the Milky Way Galaxy is teeming with life and exotic species. The majority of the known civilisations have formed a multi-cultural mega organization called the United Stars of Galaxies. This Union is protected by the brave men and women of the United Stars Space fleet against external threats.", "Eric Olafson, born and raised under harsh conditions of the traditional and inward looking society of Nilfeheim, left his planet to fulfil his dreams of becoming a Starship captain.", "When Eric gets kidnaped by an unknown organization and brought to Sin4, he slowly starts to discover his central role in an ancient conflict of cosmic proportions."], "author": "Vanessa Ravencroft", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/33022673-king-s-lament", "num_ratings": "70", "num_reviews": "26", "avg_ratings": 3.61, "genres": ["Fantasy", "Lgbt", "Romance", "Fiction", "War", "Relationships"], "title": "King's Lament", "description": ["Betrayed by his advisors, only the love of two mysterious men can rescue Inea and save his kingdom.", "After the death of his father, Inea finds himself the unprepared king of a country at war. When his council forsakes him, and he’s thrown into the dungeons of his own castle, Inea manages to escape only with the help of the intriguing stranger Ansyn.", "After one year in hiding,", "Betrayed by his advisors, only the love of two mysterious men can rescue Inea and save his kingdom.", "After the death of his father, Inea finds himself the unprepared king of a country at war. When his council forsakes him, and he’s thrown into the dungeons of his own castle, Inea manages to escape only with the help of the intriguing stranger Ansyn.", "After one year in hiding, Inea, driven by desire, seeks out Ansyn and discovers that there is more to his savior than he could have ever hoped for. Joined by their new ally Kaedon, passion builds, and they find themselves in a romance that helps fuel their plan to reclaim the throne."], "author": "Lilia Blanc", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-12-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8490112-daughter-of-smoke-bone", "num_ratings": "258,897", "num_reviews": "25,896", "avg_ratings": 4.03, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Paranormal", "Paranormal", "Angels"], "title": "Daughter of Smoke & Bone", "description": ["Around the world, black hand prints are appearing on doorways, scorched there by winged strangers who have crept through a slit in the sky.", "In a dark and dusty shop, a devil’s supply of human teeth grows dangerously low.", "And in the tangled lanes of Prague, a young art student is about to be caught up in a brutal otherworldly war.", "Meet Karou. She fills her sketchbooks with mon", "Around the world, black hand prints are appearing on doorways, scorched there by winged strangers who have crept through a slit in the sky.", "In a dark and dusty shop, a devil’s supply of human teeth grows dangerously low.", "And in the tangled lanes of Prague, a young art student is about to be caught up in a brutal otherworldly war.", "Meet Karou. She fills her sketchbooks with monsters that may or may not be real, she’s prone to disappearing on mysterious \"errands\", she speaks many languages - not all of them human - and her bright blue hair ", " grows out of her head that color. Who is she? That is the question that haunts her, and she’s about to find out.", "When beautiful, haunted Akiva fixes fiery eyes on her in an alley in Marrakesh, the result is blood and starlight, secrets unveiled, and a star-crossed love whose roots drink deep of a violent past. But will Karou live to regret learning the truth about herself?"], "author": "Laini Taylor", "num_pages": "422", "awards": ["Audie Award for Fantasy (2012)", "Milwaukee County Teen Book Award Nominee (2013)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2012)", "The Inky Awards Nominee for Silver Inky (2012)", "California Young Readers Medal Nominee for Young Adult (2015)", "Oregon Spirit Book Award for Young Adult (2011)", "Lincoln Award Nominee (2014)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)", "Goodreads Choice Award Nominee for Favorite Book of 2011 and Best Young Adult Fantasy & Science Fiction (2011)", "The Inky Awards Shortlist for Silver Inky (2012)", "Missouri Gateway Readers Award Nominee (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2012)"], "places": ["Prague (Praha)", "Marrakech (Marrakesh)", "Eretz"], "character_names": ["Madrigal", "Karou", "Akiva", "Kazimir", "Zuzana", "Issa", "Brimstone", "Thiago", "Mik", "Ziri"], "language": "English", "publish_date": "2011-09-27 00:00:00", "ISBN": "0316134023"},
{"url": "https://www.goodreads.com/book/show/8235178-across-the-universe", "num_ratings": "105,709", "num_reviews": "10,016", "avg_ratings": 3.77, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Romance"], "title": "Across the Universe", "description": [" ", "Seventeen-year-old Amy joins her parents as frozen cargo aboard the vast spaceship Godspeed and expects to awaken on a new planet, three hundred years in the future. Never could she have known that her frozen slumber would come to an end fifty years too soon and that she would be thrust into the brave new world o", " ", "Seventeen-year-old Amy joins her parents as frozen cargo aboard the vast spaceship Godspeed and expects to awaken on a new planet, three hundred years in the future. Never could she have known that her frozen slumber would come to an end fifty years too soon and that she would be thrust into the brave new world of a spaceship that lives by its own rules.", "Amy quickly realizes that her awakening was no mere computer malfunction. Someone—one of the few thousand inhabitants of the spaceship —tried to kill her. And if Amy doesn't do something soon, her parents will be next.", "Now Amy must race to unlock Godspeed's hidden secrets. But out of her list of murder suspects, there's only one who matters: Elder, the future leader of the ship and the love she could never have seen coming."], "author": "Beth Revis", "num_pages": "399", "awards": ["Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2011)", "Carnegie Medal Nominee (2012)"], "places": ["Godspeed", "United States of America", "Earth", "Outer Space"], "character_names": ["Harley", "\"Doc\" Bradley Stanwick", "Orion", "Amy Martin", "Elder", "Eldest"], "language": "English", "publish_date": "2011-01-11 00:00:00", "ISBN": "1595143971"},
{"url": "https://www.goodreads.com/book/show/633270.The_Ear_the_Eye_and_the_Arm", "num_ratings": "14,358", "num_reviews": "809", "avg_ratings": 3.86, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Fiction", "Adventure"], "title": "The Ear, the Eye, and the Arm", "description": ["General Matsika's children steal out of the house on a forbidden adventure--and disappear. In Zimbabwe, in the year 2194, the children's parents call in Africa's most unusual detectives--the Ear, the Eye and the Arm--who have powers far beyond those of other human beings. The children must avoid the evils of the past, the technology of the future, and a motley assortment o", "General Matsika's children steal out of the house on a forbidden adventure--and disappear. In Zimbabwe, in the year 2194, the children's parents call in Africa's most unusual detectives--the Ear, the Eye and the Arm--who have powers far beyond those of other human beings. The children must avoid the evils of the past, the technology of the future, and a motley assortment of criminals in order to return home safely. 1995 Newbery Honor Book; ALA Notable Book; ALA Best Book for Young Adults."], "author": "Nancy Farmer", "num_pages": "311", "awards": ["Newbery Medal Nominee (1995)", "Golden Duck Award for Hal Clement Award for Young Adult (1995)", "Dorothy Canfield Fisher Children's Book Award Nominee (1996)"], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "0140376410"},
{"url": "https://www.goodreads.com/book/show/18369509-the-second-mango", "num_ratings": "634", "num_reviews": "151", "avg_ratings": 3.75, "genres": ["Fantasy", "Lgbt", "Glbt", "Queer", "Romance", "Young Adult"], "title": "The Second Mango", "description": ["Queen Shulamit never expected to inherit the throne of the tropical land of Perach so young. At twenty, grief-stricken and fatherless, she's also coping with being the only lesbian she knows after her sweetheart ran off for an unknown reason. Not to mention, she's the victim of severe digestive problems that everybody think she's faking. When she meets Rivka, an athletic a", "Queen Shulamit never expected to inherit the throne of the tropical land of Perach so young. At twenty, grief-stricken and fatherless, she's also coping with being the only lesbian she knows after her sweetheart ran off for an unknown reason. Not to mention, she's the victim of severe digestive problems that everybody think she's faking. When she meets Rivka, an athletic and assertive warrior from the north who wears a mask and pretends to be a man, she finds the source of strength she needs so desperately.", "Unfortunately for her, Rivka is straight, but that's okay -- Shulamit needs a surrogate big sister just as much as she needs a girlfriend. Especially if the warrior's willing to take her around the kingdom on the back of her dragon in search of other women who might be open to same-sex romance. The real world outside the palace is full of adventure, however, and the search for a royal girlfriend quickly turns into a rescue mission when they discover a temple full of women turned to stone by an evil sorcerer."], "author": "Shira Glassman", "num_pages": "165", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "1610405196"},
{"url": "https://www.goodreads.com/book/show/20894732-golden-daughter", "num_ratings": "265", "num_reviews": "60", "avg_ratings": 4.52, "genres": ["Fantasy", "Christian Fiction", "Romance", "Christian", "Young Adult", "Fiction"], "title": "Golden Daughter", "description": ["BEYOND THE REALM OF DREAMS IS A WORLD SHE NEVER IMAGINED", "Masayi Sairu was raised to be dainty, delicate, demure . . . and deadly. She is one of the emperor’s Golden Daughters, as much a legend as she is a commodity. One day, Sairu will be contracted in marriage to a patron, whom she will secretly guard for the rest of her life.", "But when she learns that a sacred Dream Walker", "BEYOND THE REALM OF DREAMS IS A WORLD SHE NEVER IMAGINED", "Masayi Sairu was raised to be dainty, delicate, demure . . . and deadly. She is one of the emperor’s Golden Daughters, as much a legend as she is a commodity. One day, Sairu will be contracted in marriage to a patron, whom she will secretly guard for the rest of her life.", "But when she learns that a sacred Dream Walker of the temple seeks the protection of a Golden Daughter, Sairu forgoes marriage in favor of this role. Her skills are stretched to the limit, for assassins hunt in the shadows, and phantoms haunt in dreams. With only a mysterious Faerie cat and a handsome slave—possessed of his own strange abilities—to help her, can Sairu shield her new mistress from evils she can neither see nor touch?", "For the Dragon is building an army of fire, and soon the heavens will burn."], "author": "Anne Elisabeth Stengl", "num_pages": "570", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-25 00:00:00", "ISBN": "0989447855"},
{"url": "https://www.goodreads.com/book/show/58894.Daja_s_Book", "num_ratings": "25,435", "num_reviews": "367", "avg_ratings": 4.08, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Daja's Book", "description": ["Outcast Trader Daja, along with her fellow mages-in-training, journeys from Winding Circle to the Gold Ridge Mountains, where drought threatens widespread famine. There, Daja creates an astonishing object: a living metal vine, and Daja's dealings with her former people reawaken a longing for familiar ways.", "Daja must choose - should s", "Outcast Trader Daja, along with her fellow mages-in-training, journeys from Winding Circle to the Gold Ridge Mountains, where drought threatens widespread famine. There, Daja creates an astonishing object: a living metal vine, and Daja's dealings with her former people reawaken a longing for familiar ways.", "Daja must choose - should she return to the Traders or remain with the Winding Circle folk who have become her family?"], "author": "Tamora Pierce", "num_pages": "232", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2000)"], "places": [], "character_names": ["Rosethorn", "Sandrilene fa Toren", "Trisana Chandler", "Briar Moss", "Daja Kisubo", "Niklaren Goldeye", "Frostpine", "Lark"], "language": "English", "publish_date": "2006-06-24 00:00:00", "ISBN": "0590554107"},
{"url": "https://www.goodreads.com/book/show/7767021-who-fears-death", "num_ratings": "11,143", "num_reviews": "1,730", "avg_ratings": 3.96, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia", "Cultural", "Africa"], "title": "Who Fears Death", "description": [" In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, sh", " In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, she manages to escape, wandering farther into the desert. She gives birth to a baby girl with hair and skin the color of sand and instinctively knows that her daughter is different. She names her daughter Onyesonwu, which means \"Who Fears Death?\" in an ancient African tongue.", " Reared under the tutelage of a mysterious and traditional shaman, Onyesonwu discovers her magical destiny – to end the genocide of her people. The journey to fulfill her destiny will force her to grapple with nature, tradition, history, true love, the spiritual mysteries of her culture – and eventually death itself."], "author": "Nnedi Okorafor", "num_pages": "386", "awards": ["Nebula Award Nominee for Best Novel (2010)", "Locus Award Nominee for Best Fantasy Novel (2011)", "World Fantasy Award for Best Novel (2011)", "Grand Prix de l'Imaginaire Nominee for Roman étranger (2014)", "Prix Imaginales for Roman étranger (2014)", "Goodreads Choice Award Nominee for Fantasy (2010)", "James Tiptree Jr. Award Honor List (2010)"], "places": [], "character_names": ["Onyesonwu Ubaid-Ogundimu", "Mwita", "Najeeba", "Aro (Who Fears Death series)", "Luyu", "Binta", "Diti", "Fanasi", "Daib"], "language": "English", "publish_date": "2010-06-01 00:00:00", "ISBN": "075640617X"},
{"url": "https://www.goodreads.com/book/show/13642.A_Wizard_of_Earthsea", "num_ratings": "185,126", "num_reviews": "6,669", "avg_ratings": 4.0, "genres": ["Fantasy", "Fiction", "Young Adult", "Classics"], "title": "A Wizard of Earthsea", "description": ["Ged, the greatest sorcerer in all Earthsea, was called Sparrowhawk in his reckless youth. ", "Hungry for power and knowledge, Sparrowhawk tampered with long-held secrets and loosed a terrible shadow upon the world. This is the tale of his testing, how he mastered the mighty words of power, tamed an ancient dragon, and crossed death's threshold to restore the balance."], "author": "Ursula K. Le Guin", "num_pages": "183", "awards": ["Lewis Carroll Shelf Award (1979)", "Boston Globe-Horn Book Award for Fiction (1969)", "Złota Sepulka for Książka autora zagranicznego (1984)"], "places": ["Earthsea Realm"], "character_names": ["Ged"], "language": "English", "publish_date": "2004-09-28 00:00:00", "ISBN": "0553383043"},
{"url": "https://www.goodreads.com/book/show/27969081-labyrinth-lost", "num_ratings": "6,361", "num_reviews": "1,687", "avg_ratings": 3.76, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fantasy", "Paranormal", "Fiction"], "title": "Labyrinth Lost", "description": ["▶ ", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whos", "▶ ", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whose intentions are as dark as the strange marks on his skin.", "The only way to get her family back is to travel with Nova to Los Lagos, a land in-between, as dark as Limbo and as strange as Wonderland..."], "author": "Zoraida Córdova", "num_pages": "324", "awards": [], "places": ["Los Lagos realm, Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2016-09-06 00:00:00", "ISBN": "1492620947"},
{"url": "https://www.goodreads.com/book/show/9317452-rivers-of-london", "num_ratings": "58,436", "num_reviews": "6,284", "avg_ratings": 3.92, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Mystery", "Fiction", "Mystery", "Crime", "Fantasy", "Paranormal"], "title": "Rivers of London", "description": ["Probationary Constable Peter Grant dreams of being a detective in London’s Metropolitan Police. Too bad his superior plans to assign him to the Case Progression Unit, where the biggest threat he’ll face is a paper cut. But Peter’s prospects change in the aftermath of a puzzling murder, when he gains exclusive information from an eyewitness who happens to be a ghost. Peter’", "Probationary Constable Peter Grant dreams of being a detective in London’s Metropolitan Police. Too bad his superior plans to assign him to the Case Progression Unit, where the biggest threat he’ll face is a paper cut. But Peter’s prospects change in the aftermath of a puzzling murder, when he gains exclusive information from an eyewitness who happens to be a ghost. Peter’s ability to speak with the lingering dead brings him to the attention of Detective Chief Inspector Thomas Nightingale, who investigates crimes involving magic and other manifestations of the uncanny. Now, as a wave of brutal and bizarre murders engulfs the city, Peter is plunged into a world where gods and goddesses mingle with mortals and a long-dead evil is making a comeback on a rising tide of magic."], "author": "Ben Aaronovitch", "num_pages": "392", "awards": ["British Book Award Nominee for New Writer of the Year (2011)", "CityRead London (2015)"], "places": ["London, England"], "character_names": ["Peter Grant"], "language": "English", "publish_date": "2011-01-10 00:00:00", "ISBN": "0575097566"},
{"url": "https://www.goodreads.com/book/show/6472451-ash", "num_ratings": "27,424", "num_reviews": "3,025", "avg_ratings": 3.62, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Fiction"], "title": "Ash", "description": ["In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she bel", "In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she believes that her wish may be granted.", "The day that Ash meets Kaisa, the King's Huntress, her heart begins to change. Instead of chasing fairies, Ash learns to hunt with Kaisa. Though their friendship is as delicate as a new bloom, it reawakens Ash's capacity for love-and her desire to live. But Sidhean has already claimed Ash for his own, and she must make a choice between fairy tale dreams and true love.", "Entrancing, empowering, and romantic, ", " is about the connection between life and love, and solitude and death, where transformation can come from even the deepest grief."], "author": "Malinda Lo", "num_pages": "264", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2010)", "Gaylactic Spectrum Award Nominee for Best Novel (2010)", "William C. Morris YA Debut Award Nominee (2010)", "James Tiptree Jr. Award Nominee for Longlist (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Andre Norton Award Nominee (2009)"], "places": [], "character_names": ["Aisling", "Kaisa", "Sidhean"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0316040096"},
{"url": "https://www.goodreads.com/book/show/25437891-the-v-girl", "num_ratings": "5,708", "num_reviews": "676", "avg_ratings": 4.01, "genres": ["Romance", "Young Adult", "Young Adult", "Coming Of Age", "Science Fiction", "Dystopia", "Fiction", "Science Fiction"], "title": "The V Girl", "description": ["ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substi", "ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substitute for love.", "Lila’s coping mechanism to deal with her mother’s loss is her secret. A secret that will bring her closer to Aleksey Fürst, a foreign, broody man who she distrusts because of his links to the troops and his rough, yet irresistible appearance. He offers Lila an alternative to her plans, a possibility that terrifies her…and tempts her in spite of herself.", "With threats looming at every turn and no way to escape, Lila fears that falling in love will only lead to more heartache. The consequences of laying down her arms for Aleksey and welcoming hope might destroy more than her heart. They might force her to face the worst of her nightmares becoming a reality. Is love possible in a world that has forgotten what the human touch is?", "NOTES FROM THE AUTHOR", "* This is a book full of romance and anti-rape messages. I didn't write this book to romanticize violence against women but to tell the story of a girl who has to come of age under the most terrible circumstances. ", "* This full-length novel is a stand alone. No cliffhanger", "* Alpha male hero. No cheating. No slut-shaming.", "* Includes a discussion guide for bookclubs", "* Possible triggers for abuse survivors."], "author": "Mya Robarts", "num_pages": "341", "awards": [], "places": ["Starville"], "character_names": ["Lila Velez", "Aleksey Fürst", "Azalea Velez", "Olmo Velez", "Tristan Froh", "Ethan Velez"], "language": "English", "publish_date": "2015-06-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/60926.Lilith_s_Brood", "num_ratings": "11,394", "num_reviews": "844", "avg_ratings": 4.32, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Lilith's Brood", "description": ["Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny", "Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny, unimaginably alien creatures: their own children. This is their story..."], "author": "Octavia E. Butler", "num_pages": "746", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-01 00:00:00", "ISBN": "0446676101"},
{"url": "https://www.goodreads.com/book/show/22295304-shadowshaper", "num_ratings": "7,047", "num_reviews": "1,668", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Paranormal"], "title": "Shadowshaper", "description": ["Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York may", "Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York mayhem is going on.", "Sierra soon discovers a supernatural order called the Shadowshapers, who connect with spirits via paintings, music, and stories. Her grandfather once shared the order's secrets with an anthropologist, Dr. Jonathan Wick, who turned the Caribbean magic to his own foul ends. Now Wick wants to become the ultimate Shadowshaper by killing all the others, one by one. With the help of her friends and the hot graffiti artist Robbie, Sierra must dodge Wick's supernatural creations, harness her own Shadowshaping abilities, and save her family's past, present, and future."], "author": "Daniel José Older", "num_pages": "297", "awards": ["Locus Award Nominee for Best Young Adult Book (2016)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2016)", "Lincoln Award Nominee (2018)", "Andre Norton Award Nominee (2015)", "Kirkus Prize Nominee for Young Readers' Literature (Finalist) (2015)"], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-30 00:00:00", "ISBN": "0545591619"},
{"url": "https://www.goodreads.com/book/show/52397.Parable_of_the_Sower", "num_ratings": "35,611", "num_reviews": "3,530", "avg_ratings": 4.15, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Apocalyptic", "Post Apocalyptic"], "title": "Parable of the Sower", "description": ["In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a cul", "In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a culture that has been destroyed by drugs, disease, war, and chronic water shortages. While her father tries to lead people on the righteous path, Lauren struggles with hyperempathy, a condition that makes her extraordinarily sensitive to the pain of others.", "When fire destroys their compound, Lauren’s family is killed and she is forced out into a world that is fraught with danger. With a handful of other refugees, Lauren must make her way north to safety, along the way conceiving a revolutionary idea that may mean salvation for all mankind."], "author": "Octavia E. Butler", "num_pages": "345", "awards": [], "places": ["California"], "character_names": ["Lauren Olamina"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0446675504"},
{"url": "https://www.goodreads.com/book/show/30165203-american-gods", "num_ratings": "606,858", "num_reviews": "32,072", "avg_ratings": 4.11, "genres": ["Fantasy", "Fiction", "Fantasy", "Urban Fantasy", "Fantasy", "Mythology", "Science Fiction"], "title": "American Gods", "description": ["Days before his release from prison, Shadow's wife, Laura, dies in a mysterious car crash. Numbly, he makes his way back home. On the plane, he encounters the enigmatic Mr Wednesday, who claims to be a refugee from a distant war, a former god and the king of America.", "Together they embark on a profoundly strange journey across the heart of the USA, whilst all around them a s", "Days before his release from prison, Shadow's wife, Laura, dies in a mysterious car crash. Numbly, he makes his way back home. On the plane, he encounters the enigmatic Mr Wednesday, who claims to be a refugee from a distant war, a former god and the king of America.", "Together they embark on a profoundly strange journey across the heart of the USA, whilst all around them a storm of preternatural and epic proportions threatens to break.", "Scary, gripping and deeply unsettling, ", " takes a long, hard look into the soul of America. You'll be surprised by what - and who - it finds there..."], "author": "Neil Gaiman", "num_pages": "635", "awards": ["Bram Stoker Award for Best Novel (2001)", "Hugo Award for Best Novel (2002)", "Nebula Award for Best Novel (2002)", "Locus Award for Best Fantasy Novel (2002)", "International Horror Guild Award Nominee for Best Novel (2001)", "World Fantasy Award Nominee for Best Novel (2002)", "SFX Award for Best Novel (2002)", "Geffen Award (2003)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2002)", "Prix Bob Morane for roman traduit (2003)"], "places": ["United States of America", "Chicago, Illinois", "Chattanooga, Tennessee", "Minnesota", "Wisconsin", "Illinois"], "character_names": ["Shadow Moon", "Mr. Wednesday", "Spider", "Laura Moon", "Hinzelmann", "Easter", "Whiskey Jack", "Loki", "Odin", "Mr. Ibis", "Samantha Black Crow", "Bilquis", "Media", "Mad Sweeney", "Czernobog", "Mr. Jacquel", "Mr. Nancy", "Chad Mulligan", "Margaret Black Crow", "Mr. Town", "Mr. World", "Technical Boy"], "language": "English", "publish_date": "2011-06-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25667918-binti", "num_ratings": "21,667", "num_reviews": "3,627", "avg_ratings": 4.0, "genres": ["Science Fiction", "Fiction", "Fantasy", "Novella", "Short Stories"], "title": "Binti", "description": ["Her name is Binti, and she is the first of the Himba people ever to be offered a place at Oomza University, the finest institution of higher learning in the galaxy. But to accept the offer will mean giving up her place in her family to travel between the stars among strangers who do not share her ways or respect her customs.", "Knowledge comes at a cost, one that Binti is will", "Her name is Binti, and she is the first of the Himba people ever to be offered a place at Oomza University, the finest institution of higher learning in the galaxy. But to accept the offer will mean giving up her place in her family to travel between the stars among strangers who do not share her ways or respect her customs.", "Knowledge comes at a cost, one that Binti is willing to pay, but her journey will not be easy. The world she seeks to enter has long warred with the Meduse, an alien race that has become the stuff of nightmares. Oomza University has wronged the Meduse, and Binti's stellar travel will bring her within their deadly reach.", "If Binti hopes to survive the legacy of a war not of her making, she will need both the gifts of her people and the wisdom enshrined within the University, itself - but first she has to make it there, alive."], "author": "Nnedi Okorafor", "num_pages": "96", "awards": ["Hugo Award for Best Novella (2016)", "Nebula Award for Best Novella (2016)", "Locus Award Nominee for Best Novella (2016)", "Nommo Award for Best Novella (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-22 00:00:00", "ISBN": "0765384469"},
{"url": "https://www.goodreads.com/book/show/831874.The_Left_Hand_of_Darkness", "num_ratings": "87,120", "num_reviews": "6,257", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Fantasy", "Classics"], "title": "The Left Hand of Darkness", "description": ["Genly Ai is an emissary from the human galaxy to Winter, a lost, stray world. His mission is to bring the planet back into the fold of an evolving galactic civilization, but to do so he must bridge the gulf between his own culture and prejudices and those that he encounters. On a planet where people are of no gender--or both--this is a broad gulf indeed. The inventiveness", "Genly Ai is an emissary from the human galaxy to Winter, a lost, stray world. His mission is to bring the planet back into the fold of an evolving galactic civilization, but to do so he must bridge the gulf between his own culture and prejudices and those that he encounters. On a planet where people are of no gender--or both--this is a broad gulf indeed. The inventiveness and delicacy with which Le Guin portrays her alien world are not only unusual and inspiring, they are fundamental to almost all decent science fiction that has been written since. In fact, reading Le Guin again may cause the eye to narrow somewhat disapprovingly at the younger generation: what new ground are they breaking that is not already explored here with greater skill and acumen? It cannot be said, however, that this is a rollicking good story. Le Guin takes a lot of time to explore her characters, the world of her creation, and the philosophical themes that arise."], "author": "Ursula K. Le Guin", "num_pages": "248", "awards": ["Hugo Award for Best Novel (1970)", "Nebula Award for Best Novel (1969)", "James Tiptree Jr. Award for Retrospective"], "places": [], "character_names": ["Genly Ai", "Therem Harth rem ir Estraven", "Argaven XV"], "language": "English", "publish_date": "1992-08-16 00:00:00", "ISBN": "1857230744"},
{"url": "https://www.goodreads.com/book/show/6437061-the-hundred-thousand-kingdoms", "num_ratings": "38,000", "num_reviews": "4,171", "avg_ratings": 3.82, "genres": ["Fantasy", "Fiction", "Romance", "Fantasy", "High Fantasy", "Fantasy", "Epic Fantasy"], "title": "The Hundred Thousand Kingdoms", "description": ["Yeine Darr is an outcast from the barbarian north. But when her mother dies under mysterious circumstances, she is summoned to the majestic city of Sky. There, to her shock, Yeine is named an heiress to the king. But the throne of the Hundred Thousand Kingdoms is not easily won, and Yeine is thrust into a vicious power struggle."], "author": "N.K. Jemisin", "num_pages": "427", "awards": ["Hugo Award Nominee for Best Novel (2011)", "Nebula Award Nominee for Best Novel (2010)", "Locus Award for Best First Novel (2011)", "World Fantasy Award Nominee for Best Novel (2011)", "Goodreads Choice Award Nominee for Fantasy (2010)", "James Tiptree Jr. Award Honor List (2010)", "Prix Elbakin.net for Meilleur roman fantasy traduit (2011)"], "places": [], "character_names": ["Dekarta Arameri", "Kinneth Arameri (post mortem)", "Yeine Darr/Arameri", "Scimina Arameri", "Relad Arameri", "Itempas", "Nahadoth", "Enefa ('post mortem')", "Sieh", "T'vril Arameri"], "language": "English", "publish_date": "2010-02-25 00:00:00", "ISBN": "0316043915"},
{"url": "https://www.goodreads.com/book/show/11235712-cinder", "num_ratings": "537,762", "num_reviews": "46,012", "avg_ratings": 4.15, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Science Fiction", "Dystopia"], "title": "Cinder", "description": ["Sixteen-year-old Cinder is considered a technological mistake by most of society and a burden by her stepmother. Being cyborg does have its benefits, though: Cinder's brain interference has given her an uncanny ability to fix things (robots, hovers, her own malfunctioning parts), making her the best mechanic in New Beijing. This reputation brings Prince Kai himself to her", "Sixteen-year-old Cinder is considered a technological mistake by most of society and a burden by her stepmother. Being cyborg does have its benefits, though: Cinder's brain interference has given her an uncanny ability to fix things (robots, hovers, her own malfunctioning parts), making her the best mechanic in New Beijing. This reputation brings Prince Kai himself to her weekly market booth, needing her to repair a broken android before the annual ball. He jokingly calls it \"a matter of national security,\" but Cinder suspects it's more serious than he's letting on.", "Although eager to impress the prince, Cinder's intentions are derailed when her younger stepsister, and only human friend, is infected with the fatal plague that's been devastating Earth for a decade. Blaming Cinder for her daughter's illness, Cinder's stepmother volunteers her body for plague research, an \"honor\" that no one has survived.", "But it doesn't take long for the scientists to discover something unusual about their new guinea pig. Something others would kill for."], "author": "Marissa Meyer", "num_pages": "390", "awards": ["Kalbacher Klapperschlange for Altersgruppe 7. - 9. Klasse (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2014)", "California Young Readers Medal for Young Adult (2016)", "Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2012)", "Rebecca Caudill Young Readers' Book Award Nominee (2016)"], "places": ["New Beijing"], "character_names": ["Linh Cinder", "Queen Levana", "Emperor Kai", "Iko", "Crescent Moon \"Cress\" Darnel", "Dr. Dmitri Erland", "Sybil Mira", "Linh Adri", "Linh Peony", "Linh Pearl"], "language": "English", "publish_date": "2012-01-03 00:00:00", "ISBN": "0312641893"},
{"url": "https://www.goodreads.com/book/show/71811.Moon_Called", "num_ratings": "148,700", "num_reviews": "7,107", "avg_ratings": 4.18, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Shapeshifters", "Werewolves", "Romance"], "title": "Moon Called", "description": ["Mercedes Thompson, aka Mercy, is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot li", "Mercedes Thompson, aka Mercy, is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot like ours but is populated by those things that go bump in the night. And Mercy's connection to those things is about to get her into some serious hot water..."], "author": "Patricia Briggs", "num_pages": "288", "awards": [], "places": ["Tri-Cities, Washington", "Washington (the state)", "United States of America"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Leah", "Charles Cornick", "Darryl Zao", "Warren", "Kyle Brooks", "Stefan Uccello", "Alan MacKenzie Frazier", "Marsilia", "Auriele Zao", "Elizaveta Arkadyevna Vyshnevetskaya", "Gabriel Sandoval", "Tony Montenegro", "David Christiansen", "Bran \"The Marrok\" Cornick", "Ben (werewolf)"], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "0441013813"},
{"url": "https://www.goodreads.com/book/show/13206900-winter", "num_ratings": "138,168", "num_reviews": "20,230", "avg_ratings": 4.48, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Winter", "description": ["Princess Winter is admired by the Lunar people for her grace and kindness, and despite the scars that mark her face, her beauty is said to be even more breathtaking than that of her stepmother, Queen Levana.", "Winter despises her stepmother, and knows Levana won't approve of her feelings for her childhood friend--the handsome palace guard, Jacin. But Winter isn't as weak as L", "Princess Winter is admired by the Lunar people for her grace and kindness, and despite the scars that mark her face, her beauty is said to be even more breathtaking than that of her stepmother, Queen Levana.", "Winter despises her stepmother, and knows Levana won't approve of her feelings for her childhood friend--the handsome palace guard, Jacin. But Winter isn't as weak as Levana believes her to be and she's been undermining her stepmother's wishes for years. Together with the cyborg mechanic, Cinder, and her allies, Winter might even have the power to launch a revolution and win a war that's been raging for far too long.", "Can Cinder, Scarlet, Cress, and Winter defeat Levana and find their happily ever afters? Fans will not want to miss this thrilling conclusion to Marissa Meyer's national bestselling Lunar Chronicles series."], "author": "Marissa Meyer", "num_pages": "827", "awards": ["Pacific Book Review Award for Best Young Adult (2016)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)"], "places": ["Luna"], "character_names": ["Princess Winter", "Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Carswell Thorne", "Iko", "Crescent Moon \"Cress\" Darnel", "Jacin Clay", "Linh Adri", "Linh Pearl"], "language": "English", "publish_date": "2015-11-10 00:00:00", "ISBN": "0312642989"},
{"url": "https://www.goodreads.com/book/show/9275658-legend", "num_ratings": "354,355", "num_reviews": "25,467", "avg_ratings": 4.18, "genres": ["Young Adult", "Romance", "Fantasy", "Science Fiction", "Fiction"], "title": "Legend", "description": ["What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal.", "What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal. But his motives may not be as malicious as they seem.", "From very different worlds, June and Day have no reason to cross paths—until the day June's brother, Metias, is murdered and Day becomes the prime suspect. Caught in the ultimate game of cat and mouse, Day is in a race for his family's survival, while June seeks to avenge Metias's death. But in a shocking turn of events, the two uncover the truth of what has really brought them together, and the sinister lengths their country will go to keep its secrets."], "author": "Marie Lu", "num_pages": "305", "awards": ["Milwaukee County Teen Book Award Nominee (2013)", "The Inky Awards Nominee for Silver Inky (2012)", "California Young Readers Medal Nominee for Young Adult (2015)", "Lincoln Award Nominee (2014)", "Missouri Truman Readers Award (2014)", "Goodreads Choice Award Nominee for Young Adult Fantasy and Science Fiction (2012)", "Rebecca Caudill Young Readers' Book Award (2015)"], "places": ["Los Angeles, The Republic of America"], "character_names": ["June Iparis", "Daniel Altan Wing", "Metias Iparis", "Commander Jameson", "Thomas Bryant", "Tess", "Kaede"], "language": "English", "publish_date": "2011-11-29 00:00:00"}
]