[
{"url": "https://www.goodreads.com/book/show/3438000", "num_ratings": "32,584", "num_reviews": "6,029", "avg_ratings": 4.29, "genres": ["Novels"], "title": "ثلاثية غرناطة", "description": ["ثلاثية غرناطة هي ثلاثية روائية تتكون من ثلاث روايات للكاتبة المصرية رضوى عاشور و هم على التوالي: غرناطة - مريمة - الرحيل.", "وتدور الأحداث في مملكة غرناطة بعد سقوط جميع الممالك الإسلامية في الأندلس، و تبدأ أحداث الثلاثية في عام 1491م، وهو العام الذي سقطت فيه غرناطة بإعلان المعاهدة التي تنازل بمقتضاها (أبو عبد الله محمد الصغير) آخر ملوك غرناطة عن ملكه لملكي قشتالة وأراجون، وتنت", "ثلاثية غرناطة هي ثلاثية روائية تتكون من ثلاث روايات للكاتبة المصرية رضوى عاشور و هم على التوالي: غرناطة - مريمة - الرحيل.", "وتدور الأحداث في مملكة غرناطة بعد سقوط جميع الممالك الإسلامية في الأندلس، و تبدأ أحداث الثلاثية في عام 1491م، وهو العام الذي سقطت فيه غرناطة بإعلان المعاهدة التي تنازل بمقتضاها (أبو عبد الله محمد الصغير) آخر ملوك غرناطة عن ملكه لملكي قشتالة وأراجون، وتنتهى بمخالفة آخر أبطالها الأحياء (عليّ) لقرار ترحيل المسلمين حينما يكتشف أن الموت في الرحيل عن الأندلس و ليس في البقاء."], "author": "Radwa Ashour", "num_pages": "502", "awards": ["جائزة أحسن كتاب في مجال الرواية - معرض القاهرة الدولي للكتاب (1994)", "الجائزة الأولى - معرض كتاب المرأة العربية (1995)"], "places": ["الأندلس"], "character_names": ["علي", "أبو جعفر", "حسن", "سعد", "نعيم", "سليمة", "مريمة"], "language": "Arabic", "publish_date": "2009-08-16 00:00:00", "ISBN": "9770907375"},
{"url": "https://www.goodreads.com/book/show/108621.In_the_Eye_of_the_Sun", "num_ratings": "861", "num_reviews": "92", "avg_ratings": 3.9, "genres": ["Fiction", "Northern Africa", "Egypt", "Feminism", "Novels", "Literature"], "title": "In the Eye of the Sun", "description": ["Set amidst the turmoil of contemporary Middle Eastern politics, this vivid and highly-acclaimed novel by an Egyptian journalist is an intimate look into the lives of Arab women today. Here, a woman who grows up among the Egyptian elite, marries a Westernized husband, and, while pursuing graduate study, becomes embroiled in a love affair with an uncouth Englishman."], "author": "Ahdaf Soueif", "num_pages": "816", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-04-03 00:00:00", "ISBN": "0385720378"},
{"url": "https://www.goodreads.com/book/show/3110969", "num_ratings": "4,716", "num_reviews": "527", "avg_ratings": 3.88, "genres": ["Novels", "Fiction"], "title": "خالتي صفية والدير", "description": ["رائعة بهاء طاهر الممتعة خالتي صفية والدير والتي تدور في صعيد مصر من خلال قصة حب مثيرة وانتقام مدمر، فصفية الفتاة الجميلة تعشق حربي الشاب القوى والوسيم، ولكن حربي لا يشعر بحبها بل يتوسط في زواجها من الباشا. فلا تغفر صفية له ذلك وتقرر الانتقام. صدرت هذه الرواية عام 1991 وحققت نجاحا نقديا وجماهيريًا كبيرًا فطبعت عدة مرات وترجمت وتحولت إلى مسلسل تليفزيوني ومسرحية"], "author": "بهاء طاهر", "num_pages": "141", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2007-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11692.The_Black_Book", "num_ratings": "7,969", "num_reviews": "625", "avg_ratings": 3.9, "genres": ["Fiction", "Asian Literature", "Turkish Literature", "Cultural", "Turkish", "Mystery", "Novels", "Literature", "Nobel Prize", "Contemporary", "Literary Fiction", "Abandoned"], "title": "The Black Book", "description": ["Galip is a lawyer living in Istanbul. His wife, the detective novel–loving Ruya, has disappeared. Could she have left him for her ex-husband or", "Celâl, a popular newspaper columnist? But Celâl, too, seems to have vanished. As Galip investigates, he finds himself assuming the enviable Celâl's identity, wearing his clothes, ans", "Galip is a lawyer living in Istanbul. His wife, the detective novel–loving Ruya, has disappeared. Could she have left him for her ex-husband or", "Celâl, a popular newspaper columnist? But Celâl, too, seems to have vanished. As Galip investigates, he finds himself assuming the enviable Celâl's identity, wearing his clothes, answering his phone calls, even writing his columns. Galip pursues every conceivable clue, but the nature of the mystery keeps changing, and when he receives a death threat, he begins to fear the worst.", "With its cascade of beguiling stories about Istanbul, ", " is a brilliantly unconventional mystery, and a provocative meditation on identity. For Turkish literary readers it is the cherished cult novel in which Orhan Pamuk found his original voice, but it has largely been neglected by English-language readers. Now, in Maureen Freely’s beautiful new translation, they, too, may encounter all its riches."], "author": "Orhan Pamuk", "num_pages": "466", "awards": [], "places": [], "character_names": ["Galip", "Rüya", "Celal"], "language": "English", "publish_date": "2006-07-11 00:00:00", "ISBN": "1400078652"},
{"url": "https://www.goodreads.com/book/show/991197.The_Complete_Persepolis", "num_ratings": "89,753", "num_reviews": "6,206", "avg_ratings": 4.38, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "The Complete Persepolis", "description": ["Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.", " is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years", "Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.", " is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years in Vienna facing the trials of adolescence far from her family; of her homecoming--both sweet and terrible; and, finally, of her self-imposed exile from her beloved homeland. It is the chronicle of a girlhood and adolescence at once outrageous and familiar, a young life entwined with the history of her country yet filled with the universal trials and joys of growing up.", "Edgy, searingly observant, and candid, often heartbreaking but threaded throughout with raw humor and hard-earned wisdom--", " is a stunning work from one of the most highly regarded, singularly talented graphic artists at work today."], "author": "Marjane Satrapi", "num_pages": "341", "awards": [], "places": ["Vienna", "Iran", "Tehran"], "character_names": ["Rezā Shāh", "Marjane Satrapi", "Taji Chaltchi Satrapi", "Ebi Satrapi", "Grandma Chaltchi", "Anoosh Satrapi", "Taher Chaltchi", "Siamak Jari", "Mohsen Shakjiba", "Laly Jari", "Ahmadi", "Fereydoon Satrapi", "Kaveh", "Entezami", "Mali (Persepolis)", "Mehri", "Hossein (Bee Gees)", "Mrs. Nasrine", "Peyman", "Shahab", "Tinoosh", "Dr. Fathi", "Khosro (Persepolis)", "Niloufar", "Mardana", "Neda Baba-Levy", "Sherrie", "Zozo (Persepolis)"], "language": "English", "publish_date": "2007-10-30 00:00:00", "ISBN": "0375714839"},
{"url": "https://www.goodreads.com/book/show/5495.Palace_of_Desire", "num_ratings": "6,021", "num_reviews": "446", "avg_ratings": 4.2, "genres": ["Fiction", "Northern Africa", "Egypt", "Historical", "Historical Fiction", "Novels"], "title": "Palace of Desire", "description": ["The sensual and provocative second volume in the Cairo Trilogy, ", " follows the Al Jawad family into the awakening world of the 1920's and the sometimes violent clash between Islamic ideals, personal dreams and modern realities.", "Having given up his vices after his son's death, ageing patriarch Al-Sayyid Ahmad pursues an arousing lute-player - only to find she h", "The sensual and provocative second volume in the Cairo Trilogy, ", " follows the Al Jawad family into the awakening world of the 1920's and the sometimes violent clash between Islamic ideals, personal dreams and modern realities.", "Having given up his vices after his son's death, ageing patriarch Al-Sayyid Ahmad pursues an arousing lute-player - only to find she has married his eldest son. His rebellious children struggle to move beyond his domination as they test the loosening reins of societal and parental control. And Ahmad's youngest son, in an unforgettable portrayal of unrequited love, ardently courts the sophisticated daughter of a rich Europeanised family."], "author": "Naguib Mahfouz", "num_pages": "432", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1991-08-16 00:00:00", "ISBN": "0552995819"},
{"url": "https://www.goodreads.com/book/show/6692041-mornings-in-jenin", "num_ratings": "15,487", "num_reviews": "2,681", "avg_ratings": 4.36, "genres": ["Historical", "Historical Fiction", "Fiction", "Novels", "War", "Historical", "Politics", "Cultural", "Israel", "Contemporary", "Cultural", "Asia", "Literature"], "title": "Mornings in Jenin", "description": ["Forcibly removed from the ancient village of Ein Hod by the newly formed state of Israel in 1948, the Abulhejas are moved into the Jenin refugee camp. There, exiled from his beloved olive groves, the family patriarch languishes of a broken heart, his eldest son", "Forcibly removed from the ancient village of Ein Hod by the newly formed state of Israel in 1948, the Abulhejas are moved into the Jenin refugee camp. There, exiled from his beloved olive groves, the family patriarch languishes of a broken heart, his eldest son fathers a family and falls victim to an Israeli bullet, and his grandchildren struggle against tragedy toward freedom, peace, and home. This is the Palestinian story, told as never before, through four generations of a single family. ", "The very precariousness of existence in the camps quickens life itself. Amal, the patriarch's bright granddaughter, feels this with certainty when she discovers the joys of young friendship and first love and especially when she loses her adored father, who read to her daily as a young girl in the quiet of the early dawn. Through Amal we get the stories of her twin brothers, one who is kidnapped by an Israeli soldier and raised Jewish; the other who sacrifices everything for the Palestinian cause. Amal’s own dramatic story threads between the major Palestinian-Israeli clashes of three decades; it is one of love and loss, of childhood, marriage, and parenthood, and finally of the need to share her history with her daughter, to preserve the greatest love she has. ", "Previously published in a hardcover edition with a limited run under the title ", ", this powerful novel is now available in a fully revised, newly titled paperback edition. The deep and moving humanity of ", "forces us to take a fresh look at one of the defining political conflicts of our lifetimes."], "author": "Susan Abulhawa", "num_pages": "352", "awards": [], "places": ["Palestinian Territory, Occupied", "Pennsylvania", "Beirut"], "character_names": ["Yousef, Amal, David/Ismael"], "language": "English", "publish_date": "2010-02-15 00:00:00", "ISBN": "1608190463"},
{"url": "https://www.goodreads.com/book/show/5499.Midaq_Alley", "num_ratings": "7,387", "num_reviews": "746", "avg_ratings": 3.84, "genres": ["Fiction", "Northern Africa", "Egypt", "Novels", "Literature"], "title": "Midaq Alley", "description": ["Considered by many to be Mahfouz's best novel, ", " centers around the residents of one of the hustling, teeming back alleys of Cairo. No other novel so vividly evokes the sights and sounds of the city. The universality and timelessness of this book cannot be denied."], "author": "Naguib Mahfouz", "num_pages": "286", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1991-12-01 00:00:00", "ISBN": "0385264763"},
{"url": "https://www.goodreads.com/book/show/3418245", "num_ratings": "2,142", "num_reviews": "249", "avg_ratings": 3.63, "genres": ["Novels"], "title": "تغريدة البجعة", "description": ["يشتق الروائي مكاوي سعيد في روايته تغريدة البجعة، الشكل الروائي من واقع اجتماعي متحوّل ومتبدّل. معيناً الشكل الجديد مدخلاً إلى قراءة الواقع وتحولاته، في عمل روائي جميل يرثي زمناً غنائياً مضى، ويصوغ المستقبل المحتمل بأسئلة بلا إجابات. ", "يشير في روايته إلى الكثير من القضايا الاجتماعية التي يغلفها بطابع سياسي، مشيراً إلى الاجتياح الإسرائيلي للبنان، والمجازر التي ارتكبت بحق الأطف", "يشتق الروائي مكاوي سعيد في روايته تغريدة البجعة، الشكل الروائي من واقع اجتماعي متحوّل ومتبدّل. معيناً الشكل الجديد مدخلاً إلى قراءة الواقع وتحولاته، في عمل روائي جميل يرثي زمناً غنائياً مضى، ويصوغ المستقبل المحتمل بأسئلة بلا إجابات. ", "يشير في روايته إلى الكثير من القضايا الاجتماعية التي يغلفها بطابع سياسي، مشيراً إلى الاجتياح الإسرائيلي للبنان، والمجازر التي ارتكبت بحق الأطفال والأبرياء، وتداعيات هذا الاجتياح على المجتمع العربي. «لم أعد أجرؤ أن أجالس المسيّسين حتى على المقاهي، هربت إلى الخارج، وعندما عدت اختفيت خلف كاميرا تمتلكها أمريكية، ما الفرق بيني، وبين من يملكون دكاكين حقوق الإنسان، ومنع التمييز، وحقوق المرأة؟ زملاؤنا القدامى جاهروا بالسرية وتاجروا بأسابيع اعتقالهم، وملأوا الفضائيات فخراً بنضالهم. هم باعوا وقبضوا الثمن، ونحن وصِمنا بالجبن والتنازل»"], "author": "مكاوي سعيد", "num_pages": "290", "awards": ["الجائزة العالمية للرواية العربية (أي باف) / International Prize for Arabic Fiction (IPAF) Nominee (2008)"], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2008-08-16 00:00:00", "ISBN": "9776227058"},
{"url": "https://www.goodreads.com/book/show/8239301", "num_ratings": "17,867", "num_reviews": "3,299", "avg_ratings": 4.31, "genres": ["Novels"], "title": "الطنطورية", "description": ["الطنطورية (نسبة الى قرية الطنطورة الواقعة على الساحل الفلسطيني جنوب حيفا) ، تعرضت هذه القرية عام 1948 لمذبحة على يد العصابات الصهيونية ، تتناول الرواية هذه المذبحة كمنطلق و حدث من الاحداث الرئيسية ، لتتابع حياة عائلة اقتلعت من القرية وحياتها عبر ما يقرب من نصف قرن إلى الآن مرورًا بتجربة اللجوء في لبنان.", "بطلة الرواية هي امرأة من القرية يتابع القارئ حياتها منذ الصبا الى الشيخ", "الطنطورية (نسبة الى قرية الطنطورة الواقعة على الساحل الفلسطيني جنوب حيفا) ، تعرضت هذه القرية عام 1948 لمذبحة على يد العصابات الصهيونية ، تتناول الرواية هذه المذبحة كمنطلق و حدث من الاحداث الرئيسية ، لتتابع حياة عائلة اقتلعت من القرية وحياتها عبر ما يقرب من نصف قرن إلى الآن مرورًا بتجربة اللجوء في لبنان.", "بطلة الرواية هي امرأة من القرية يتابع القارئ حياتها منذ الصبا الى الشيخوخة.", "الرواية تمزج في سطورها بين الوقائع التاريخية من ناحية و الإبداع الأدبي من ناحية أخرى."], "author": "Radwa Ashour", "num_pages": "463", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2010-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/348632.The_Blood_of_Flowers", "num_ratings": "14,574", "num_reviews": "1,735", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "Iran"], "title": "The Blood of Flowers", "description": ["In the fabled city of Isfahan, in seventeenth-century Persia, a young woman confronts a dismal fate: Her beloved father had died and left her without a dowry. Forced to work as a servant in the home of her uncle, a rich rug designer in the court of the Shah, the young woman blossoms as a brilliant designer of carpets. But while her talent flourishes, her prospects for a ha", "In the fabled city of Isfahan, in seventeenth-century Persia, a young woman confronts a dismal fate: Her beloved father had died and left her without a dowry. Forced to work as a servant in the home of her uncle, a rich rug designer in the court of the Shah, the young woman blossoms as a brilliant designer of carpets. But while her talent flourishes, her prospects for a happy marriage grow dim, and she finds herself faced with a daunting decision--to forsake her own dignity or to risk everything in an effort to maintain it.", "Both a sweeping love story and a luminous portrait of a city, THE BLOOD OF FLOWERS is the mesmerizing historical novel of an ill-fated young woman whose gift as a rug designer transforms her life. Illuminated with glorious detail of Persian rug-making, and brilliantly bringing to life the sights sounds and life of 17th-century Isfahan, THE BLOOD OF FLOWERS has captured readers' imaginations everywhere as a timeless tale of one woman's struggle to live a life of her choosing."], "author": "Anita Amirrezvani", "num_pages": "368", "awards": ["Orange Prize Nominee for Fiction Longlist (2008)"], "places": ["Isfahan", "Persia", "Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2007-06-05 00:00:00", "ISBN": "0316065765"},
{"url": "https://www.goodreads.com/book/show/11713.The_English_Patient", "num_ratings": "98,393", "num_reviews": "3,732", "avg_ratings": 3.88, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Romance", "Historical"], "title": "The English Patient", "description": ["With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs ro", "With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs room and whose memories of passion, betrayal, and rescue illuminate this book like flashes of heat lightning."], "author": "Michael Ondaatje", "num_pages": "320", "awards": ["Man Booker Prize (1992)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (1992)", "Commonwealth Writers' Prize for Best Book in Caribbean and Canada (1993)", "Trillium Book Award (1993)", "Golden Man Booker Prize (2018)"], "places": ["Italy", "North Africa", "Sahara Desert", "Tuscany", "Fiesole, Tuscany", "Cairo", "Florence"], "character_names": ["Kip", "Hana", "Geoffrey Clifton", "Katharine Clifton", "David Caravaggio", "Ladislaus de Almásy"], "language": "English", "publish_date": "2006-04-18 00:00:00", "ISBN": "0771068719"},
{"url": "https://www.goodreads.com/book/show/27574.A_Tale_of_Love_and_Darkness", "num_ratings": "6,001", "num_reviews": "646", "avg_ratings": 4.2, "genres": ["Nonfiction", "Cultural", "Israel", "Autobiography", "Memoir", "Biography"], "title": "A Tale of Love and Darkness", "description": ["A family saga and a magical self-portrait of a writer who witnessed the birth of a nation and lived through its turbulent history. ", " is the story of a boy who grows up in war-torn Jerusalem, in a small apartment crowded with books in twelve languages and relatives speaking nearly as many. ", "The story of an adolescent whose life has been changed fore", "A family saga and a magical self-portrait of a writer who witnessed the birth of a nation and lived through its turbulent history. ", " is the story of a boy who grows up in war-torn Jerusalem, in a small apartment crowded with books in twelve languages and relatives speaking nearly as many. ", "The story of an adolescent whose life has been changed forever by his mother’s suicide. The story of a man who leaves the constraints of his family and community to join a kibbutz, change his name, marry, have children. The story of a writer who becomes an active participant in the political life of his nation."], "author": "Amos Oz", "num_pages": "560", "awards": ["Prix France Culture (2004)", "Koret Jewish Book Award for Biography, Autobiography or Literary Study (2005)", "Goethe Prize (2005)", "Jewish Quarterly-Wingate Prize for Nonfiction (2005)"], "places": ["Jerusalem", "Russia"], "character_names": [], "language": "English", "publish_date": "2005-11-01 00:00:00", "ISBN": "015603252X"},
{"url": "https://www.goodreads.com/book/show/5490.Children_of_the_Alley", "num_ratings": "18,645", "num_reviews": "2,171", "avg_ratings": 4.09, "genres": ["Novels", "Fiction"], "title": "Children of the Alley", "description": ["Children Of The Alley, by Mahfouz, Naguib", "The history of a Cairo alley through several generations. Successive heroes struggle to restore the rights of the people to the trust fund set up by their ancestor Gebelaawi, usurped by embezzlers and tyrants. Mahfouz creates in all its detail a world on the frontier between the real and the imaginary. At a deeper level, the book is", "Children Of The Alley, by Mahfouz, Naguib", "The history of a Cairo alley through several generations. Successive heroes struggle to restore the rights of the people to the trust fund set up by their ancestor Gebelaawi, usurped by embezzlers and tyrants. Mahfouz creates in all its detail a world on the frontier between the real and the imaginary. At a deeper level, the book is an allegory whose heroes relive the lives of Adam and Eve, Cain and Abel, Moses, Jesus and Muhammed. Their appearance in a modern context invites the reader to see them as human beings relevant to the present day, not as remote sacred figures - to the consternation of some traditionalists. Most controversial is the significance of Gebelaawi, the immensely long-lived patriarch. Mahfouz himself has said that his character represents 'not God, but a certain idea of God that men have made', standing for the god of those who forget the absolute transcendence of God affirmed by Islam."], "author": "Naguib Mahfouz", "num_pages": "464", "awards": [], "places": ["Egypt"], "character_names": ["Rifa'at, Syafi'i, Abdah, Aihab, Bayumi", "Adham", "Gabal", "Rifaa", "Qasem", "Arafa"], "language": "English", "publish_date": "1996-10-18 00:00:00", "ISBN": "0385264739"},
{"url": "https://www.goodreads.com/book/show/7433930", "num_ratings": "10,931", "num_reviews": "657", "avg_ratings": 4.42, "genres": ["Poetry"], "title": "الرباعيات", "description": ["بدأ صلاح جاهين كتابة رباعياته عام 1959، وكان ينشرها أسبوعيا في مجلة صباح الخير حتى عام 1962، وحين انتقل إلى الأهرام توقف عن كتابة الرباعيات ثم عاد لكتابتها عام 1966 حين رجع لصباح الخير رئيسا لتحريرها وذلك لمدة عام واحد، كف بعده نهائيا عن كتابة الرباعيات، إلا خمسا نشرها في مربعه بالأهرام تعليقا على مظاهرات الطلبة عام 1968.", "وهذه الطبعة هي نسخة تكاد تكون طبق الأصل الذي نشر عام", "بدأ صلاح جاهين كتابة رباعياته عام 1959، وكان ينشرها أسبوعيا في مجلة صباح الخير حتى عام 1962، وحين انتقل إلى الأهرام توقف عن كتابة الرباعيات ثم عاد لكتابتها عام 1966 حين رجع لصباح الخير رئيسا لتحريرها وذلك لمدة عام واحد، كف بعده نهائيا عن كتابة الرباعيات، إلا خمسا نشرها في مربعه بالأهرام تعليقا على مظاهرات الطلبة عام 1968.", "وهذه الطبعة هي نسخة تكاد تكون طبق الأصل الذي نشر عام 1963 في طبعة الرباعيات الأولى التي وضع رسومها الفنان الكبير ادم حنين", "بهاء جاهين"], "author": "صلاح جاهين", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6077054", "num_ratings": "1,266", "num_reviews": "154", "avg_ratings": 3.2, "genres": ["Novels", "Literature", "Fiction"], "title": "الحب تحت المطر", "description": ["عاد إلى بؤرة قديمة كان هجرها مذ عرف منى زهران. ذهب إلى ملهى \"مركب الشمس\" بالهرم وهو نصف ثمل. وأنزوى فى الحديقة رغم برودة الجو وطلب من النادل أن يدعو سميرة لمشاربته. وسميرة كانت صديقته، وهى راقصة من الدرجة الرابعة ترقص ضمن مجموعة فى خلفية المسرح عندما يغنى مطرب بالمهى. وهى فى الخامسة والثلاثين، وبها مسحة جمال، وجسمها أجمل من وجهها، ورخيصة الثمن نسبيا، وقد دهشت لعودته عقب غي", "عاد إلى بؤرة قديمة كان هجرها مذ عرف منى زهران. ذهب إلى ملهى \"مركب الشمس\" بالهرم وهو نصف ثمل. وأنزوى فى الحديقة رغم برودة الجو وطلب من النادل أن يدعو سميرة لمشاربته. وسميرة كانت صديقته، وهى راقصة من الدرجة الرابعة ترقص ضمن مجموعة فى خلفية المسرح عندما يغنى مطرب بالمهى. وهى فى الخامسة والثلاثين، وبها مسحة جمال، وجسمها أجمل من وجهها، ورخيصة الثمن نسبيا، وقد دهشت لعودته عقب غياب استمر أكثر من نصف عام، فتظاهرت بغضب لا أساس له، وقالت له: رجعت يا خائن وراحا يشربان. ولاحظت أنه- بخلاف عادته- يشرب بإفراط وكانت ترتاح إليه، لأنه مهذب، ولأنه يملك سيارة صغيرة، وأخيراً لأنه كريم. وقالت له ضاحكة: - أنت تشرب كالوحش. فقال لها: - سانتظرك آخر الليل. ومع أنها رحبت بذلك فى أعماقها إلا أنها قالت متسائلة مع رغبة فى تأديبه: كلا.. وتبادلا نظرة طويلة، ثم قالت: - مرتبطة الليلة.. فهتف بضجر: كلا.. - كلا ! - كيف حال بنتك الصغيرة؟ - مع أمى كما تعلم. - فأفرغ كأسه وقال : - عندى فكرة لا بأس بها.. - فكرة؟! فتريث قليلاً لأنه شعر رغم سكره بأنه مقدم على أخطر خطوة يتخذها فى حياته. وغضب لتريثه فقال: - أرغب يا سميرة فى أن نعيش معا! - فتفكرت قليلا ثم تمتمت: -فيها قولان! - ولكنك لم تدركى مقصدى! - أعتقد أنه واضح. فقال وهو يركز عينيه فى كأسه: - أريد أن إتزوج منك! فطالعته بإنكار، ثم قالت بحدة: - أنت سكران! - بل رجعت إليك لتحقيق ذلك. فجعلت تنظر إليه فى ريبة فقال: - ما قولك؟ - أفق! -الليلة إن أمكن! ثم وهو يتناول يدها: - ستبقى الصغيرة عند والدتك، ولكنى سأرتب لها مصروفا معقولا، لست غنيا ولست فقيرا.. فتساءلت بدهشة: - أنت جاد حقا؟! هيا بنا فى الحال إن شئت.. فضحكت وسألته: - ماذا جعلت تقرر ذلك؟ - أريد أن أستقر، أستقر مع امرأه معقولة بلا خداع، فهل أنت على استعداد لنسيان الماضى وبدء حياة جديدة؟ فضحكن ضحكة عصيبة وقالت: - لا يوجد مأذون مستيقظا فى هذه الساعة. فقام وهو يقول: - لا أهمية لذلك مادام سيستيقظ فى الصباح الباكر."], "author": "Naguib Mahfouz", "num_pages": "168", "awards": [], "places": ["Egypt"], "character_names": [], "language": "Arabic", "publish_date": "2006-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4988068-the-seven-veils-of-seth", "num_ratings": "111", "num_reviews": "19", "avg_ratings": 3.68, "genres": [], "title": "The Seven Veils of Seth: A Modern Arabic Novel from Libya", "description": ["Isan, the novel’s protagonist, is either Seth himself or a latter-day avatar. A desert-wandering seer and proponent of desert life, he settles for an extended stay in a fertile oasis. If Jack Frost, the personification of the arrival of winter, were to visit a tropical rain forest, the results might be similarly disastrous. Not surprisingly, since this is a novel by Ibrahi", "Isan, the novel’s protagonist, is either Seth himself or a latter-day avatar. A desert-wandering seer and proponent of desert life, he settles for an extended stay in a fertile oasis. If Jack Frost, the personification of the arrival of winter, were to visit a tropical rain forest, the results might be similarly disastrous. Not surprisingly, since this is a novel by Ibrahim al-Koni, infanticide, uxoricide, serial adultery, betrayal, metamorphosis, murder by a proxy animal, ordinary murder, and a life-threatening chase through the desert all figure in the plot, although the novel is also an existential reflection on the purpose of human life. Ibrahim al-Koni typically layers allusions in his works as if he were an artist adding a suggestion of depth to a painting by applying extra washes. Tuareg folklore, Egyptian mythology, Russian literature, and medieval European thought elbow each other for room on the page. One might expect a novel called The Seven Veils of Seth to be a heavy-handed allegory. Instead, the reader is left wondering. The truth is elusive, a mirage pulsing at the horizon."], "author": "Ibrahim al-Koni", "num_pages": "312", "awards": ["Arab Novel Award (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-01 00:00:00", "ISBN": "1859642020"},
{"url": "https://www.goodreads.com/book/show/23119930-tales-from-an-israeli-storyteller", "num_ratings": "17", "num_reviews": "9", "avg_ratings": 4.47, "genres": ["Fantasy", "Cultural", "Israel"], "title": "Tales from an Israeli Storyteller", "description": ["Tales from an Israeli Storyteller is an illustrated cycle of 20 short stories and novellas born from exploring the most iconic locations in Israel. This is the story of the Israel you don’t hear about on the news – the Israel where an evil rabbi creates a smartass golem that comes back to haunt him during an unholy ceremony on Mount Meron, where talking animals search for", "Tales from an Israeli Storyteller is an illustrated cycle of 20 short stories and novellas born from exploring the most iconic locations in Israel. This is the story of the Israel you don’t hear about on the news – the Israel where an evil rabbi creates a smartass golem that comes back to haunt him during an unholy ceremony on Mount Meron, where talking animals search for justice among the demons and spirits of Ein Gedi, where a Bedouin hero confronts a reportedly evil book in the caves of Qumran, and where one clueless efreet keeps losing his wife in the Negev desert until a conscientious policeman comes to his rescue.", "While some of the characters are hard to meet, all the locations are real and very accessible, making this book a guide to some very cool places as well as a modern fantasy setting inspired by the folklore and mythology of one of the oldest (and youngest) countries in the world."], "author": "Uri Kurlianchik", "num_pages": "295", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/45386.Persian_Girls", "num_ratings": "3,000", "num_reviews": "524", "avg_ratings": 3.88, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Iran", "Biography"], "title": "Persian Girls", "description": ["For many years, heartache prevented Nahid Rachlin from turning her sharp novelist's eye inward: to tell the story of how her own life diverged from that of her closest confidante and beloved sister, Pari. Growing up in Iran, both refused to accept traditional Muslim mores, and dreamed of careers in literature and on the stage. Their lives changed abruptly when Pari was coe", "For many years, heartache prevented Nahid Rachlin from turning her sharp novelist's eye inward: to tell the story of how her own life diverged from that of her closest confidante and beloved sister, Pari. Growing up in Iran, both refused to accept traditional Muslim mores, and dreamed of careers in literature and on the stage. Their lives changed abruptly when Pari was coerced by their father into marrying a wealthy and cruel suitor. Nahid narrowly avoided a similar fate, and instead negotiated with him to pursue her studies in America.", " When Nahid received the unsettling and mysterious news that Pari had died after falling down a flight of stairs, she traveled back to Iran-now under the Islamic regime-to find out what happened to her truest friend, confront her past, and evaluate what the future holds for the heartbroken in a tale of crushing sorrow, sisterhood, and ultimately, hope."], "author": "Nahid Rachlin", "num_pages": "304", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2006-10-05 00:00:00", "ISBN": "1585425206"},
{"url": "https://www.goodreads.com/book/show/3284984-the-window-over-the-way", "num_ratings": "153", "num_reviews": "18", "avg_ratings": 3.62, "genres": ["Cultural", "Belgium", "Fiction", "Cultural", "France"], "title": "The Window Over the Way", "description": ["Adil Bey was the Turkish consul. Sonia was his Russian secretary. They fell in love. That was their mistake...there was a watch on love. Fear, suspicion, and cruelty grip the bleak Russian oil-port in which Simenon set a novel which reads like an early echo of '1984'.", "Story of Love, Deceit and death set in Stalin's Russia."], "author": "Georges Simenon", "num_pages": "144", "awards": [], "places": ["Batum, USSR", "Soviet Union"], "character_names": [], "language": "English", "publish_date": "1972-08-16 00:00:00", "ISBN": "0140023631"},
{"url": "https://www.goodreads.com/book/show/1038088.The_Septembers_of_Shiraz", "num_ratings": "6,354", "num_reviews": "859", "avg_ratings": 3.79, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Literature", "Jewish"], "title": "The Septembers of Shiraz", "description": ["In the aftermath of the Iranian revolution, rare-gem dealer Isaac Amin is arrested, wrongly accused of being a spy. Terrified by his disappearance, his family must reconcile a new world of cruelty and chaos with the collapse of everything they have known. ", "As Isaac navigates the tedium and terrors of prison, forging tenuous trusts, his wife feverishly searches for him, susp", "In the aftermath of the Iranian revolution, rare-gem dealer Isaac Amin is arrested, wrongly accused of being a spy. Terrified by his disappearance, his family must reconcile a new world of cruelty and chaos with the collapse of everything they have known. ", "As Isaac navigates the tedium and terrors of prison, forging tenuous trusts, his wife feverishly searches for him, suspecting, all the while, that their once-trusted housekeeper has turned on them and is now acting as an informer. ", "And as his daughter, in a childlike attempt to stop the wave of baseless arrests, engages in illicit activities, his son, sent to New York before the rise of the Ayatollahs, struggles to find happiness even as he realizes that his family may soon be forced to embark on a journey of incalculable danger. ", "A page-turning literary debut, ", " simmers with questions of identity, alienation, and love, not simply for a spouse or a child, but for all the intangible sights and smells of the place we call home."], "author": "Dalia Sofer", "num_pages": "340", "awards": ["Orange Prize Nominee for Fiction Longlist (2008)", "PEN/Robert W. Bingham Prize (2008)", "Sami Rohr Prize Nominee for Jewish Literature (2009)"], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2007-07-24 00:00:00", "ISBN": "0061130400"},
{"url": "https://www.goodreads.com/book/show/6181854", "num_ratings": "819", "num_reviews": "168", "avg_ratings": 3.17, "genres": ["Novels", "Fiction"], "title": "عراقي في باريس", "description": ["\"عراقي في باريس\" رواية مؤثرة تقدم تأويلاً مباشراً يقوم على كبسة زر للمذاق المرير للحياة اليومية، مطعمة بروح السخرية والمفارقة بصورة لا تضاهى.", "إنها قصة جيل كامل من العرب الذين دمرت حياتهم الإيديولوجيات التي هيمنت على السياسة العربية. تتضمن الرواية أيضاً حساً فكاهياً وروح دعابة متميزين ومقدرة غير عادية للكاتب على خلق عالم داخلي.", "فهي تروي قصة حكواتي لا مقدسات لديه، ينتهي به الأ", "\"عراقي في باريس\" رواية مؤثرة تقدم تأويلاً مباشراً يقوم على كبسة زر للمذاق المرير للحياة اليومية، مطعمة بروح السخرية والمفارقة بصورة لا تضاهى.", "إنها قصة جيل كامل من العرب الذين دمرت حياتهم الإيديولوجيات التي هيمنت على السياسة العربية. تتضمن الرواية أيضاً حساً فكاهياً وروح دعابة متميزين ومقدرة غير عادية للكاتب على خلق عالم داخلي.", "فهي تروي قصة حكواتي لا مقدسات لديه، ينتهي به الأمر في باريس، مواصلاً حياته بين البارات ومحطات الميترو، حالماً بكتابة سيناريو عن والده الفران الأصم الأبكم، ولكنه بدلاً من ذلك يكتب نصاً ساحراً عن طفولته الفقيرة، كصبي عاشق للسينما. نصّ مكتوب، على خلفية سير ذاتية سابقة لأدباء عرب أقاموا في باريس لفترات مختلفة منذ بداية القرن التاسع عشر، ولكنه يتجاوز معظم هذه النصوص من حيث الصدق والصراحة. لا يرحم أحداً، ذو عين سينمائية حادة النظرة، وذو موقف حيادي من تقلبات الحياة في الشوارع الباريسية"], "author": "Samuel Shimon", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2005-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3195325-a-map-of-home", "num_ratings": "1,159", "num_reviews": "201", "avg_ratings": 3.68, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Lgbt", "Glbt", "Queer"], "title": "A Map of Home", "description": ["Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where s", "Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where she and her family fled the 1990 Iraqi invasion), and her family’s last flight to Texas. Nidali mixes humor with a sharp, loving portrait of an eccentric middle-class family, and this perspective keeps her buoyant through the hardships she encounters: the humiliation of going through a checkpoint on a visit to her father’s home in the West Bank; the fights with her father, who wants her to become a famous professor and stay away from boys; the end of her childhood as Iraq invades Kuwait on her thirteenth birthday; and the scare she gives her family when she runs away from home. ", "Funny, charming, and heartbreaking, A Map of Home is the kind of book Tristram Shandy or Huck Finn would have narrated had they been born Egyptian-Palestinian and female in the 1970s."], "author": "Randa Jarrar", "num_pages": "304", "awards": ["Hopwood Award", "Arab American Book Award for Fiction (2009)", "Million Writers Award", "Geoffrey James Gosling Prize"], "places": ["Kuwait"], "character_names": [], "language": "English", "publish_date": "2008-09-02 00:00:00", "ISBN": "1590512723"},
{"url": "https://www.goodreads.com/book/show/6386367", "num_ratings": "1,108", "num_reviews": "166", "avg_ratings": 3.77, "genres": ["Nonfiction", "Philosophy"], "title": "كلمات: التقاط الألماس من كلام الناس", "description": ["تضمُّ صفحاتُ هذا الكتاب، تأملاتٍ متواليةً استغرقتُ فيها لأوقاتٍ طوالٍ، محدِّقاً فى (المفردات) التى تجرى على الألسنة. وهى مفرداتٌ تبدو للوهلة الأولى محدودةَ الدلالة بسيطة المعنى ، غير أن التأمل فيها، يكشف عن الكثير من المعانى المضمرة، والشواهد المؤكِّدة أن (التواصل) بين المراحل الثقافية المتعاقبة، إنما يظهر على استحياءٍ وعلى نحوٍ من الغموض، فى عديد من الدلائل التى تخفيها ال", "تضمُّ صفحاتُ هذا الكتاب، تأملاتٍ متواليةً استغرقتُ فيها لأوقاتٍ طوالٍ، محدِّقاً فى (المفردات) التى تجرى على الألسنة. وهى مفرداتٌ تبدو للوهلة الأولى محدودةَ الدلالة بسيطة المعنى ، غير أن التأمل فيها، يكشف عن الكثير من المعانى المضمرة، والشواهد المؤكِّدة أن (التواصل) بين المراحل الثقافية المتعاقبة، إنما يظهر على استحياءٍ وعلى نحوٍ من الغموض، فى عديد من الدلائل التى تخفيها اللغة بين طيَّات كلماتها وتعبيراتها. ولذلك، فالناسُ فى بلادنا تجرى على ألسنتهم كلمات، معظمها عامىٌّ وبعضها فصيحٌ ، يستعملونها فى حياتهم بيسرٍ وتلقائيةٍ (وأحياناً باستهانة) من دون أن يدروا بما تخفيه الكلمة بين حروفها من معنى عميق ، بل طبقات متراكبة من المعانى ، تراكمت بفعل الامتداد الطويل لتاريخنا الثقافى .", " والكلمات عموماً، هى رَسْمُ العالم فى الأذهان. فالوعى الجماعى والفردى يصوغ صورة العالم فى الذهن، عبر عدد من الكلمات التى تتألف منها اللغة . ولذلك فإننا حين نفكِّر، وحين ندرك، وحتى حين نحلم؛ فإننا نقوم بتلك الأنشطة الذهنية كلِّها، من خلال اللغة والكلمات .. ومن ثمَّ، فالكلمات هى مفاتيحُ المعرفة، وهى حدودُ المعانى، وهى وجودُ الأشياء فى العقل الإنسانى، وربما فى العقل الإلهى أيضاً! بحسب ما جاء فى الآية القرآنية البديعة ]قُل لو كان البحر مداداً لكلمات ربى، لنفد البحر قبل أن تنفد كلمات ربى، ولو جئنا بمثله مدداً[ ونلاحظ هنا أن (كلمات ربى) تكرَّرت، مرتين ، لتوكيد هذا المعنى العميق الدال على أن الكلمات هى الوجود، وللإشارة إلى أن كلمات الله هى أمرٌ يفوق الإدراك والإحاطة. ولذا، نرى (المسيح) على جلال قدره، يوصف فى القرآن بأنه: كلمةٌ من الله .", " من هذه الزاوية ننظر فى الكلمات فنراها أبواباً واسعة للفهم، وسُبلاً فسيحة للمعرفة. سواءٌ كانت معرفة ظاهرة بوضوح فى الألفاظ، أو معارف دقيقة ومدهشة، كامنة فى الكلمات، على ما سوف نراه فى (موضوعات) هذا الكتاب .. ومن المهم هنا، الإشارة إلى أننى أفرِّق تفرقةً خاصة ما بين اللفظ والكلمة، باعتبار أن (اللفظ) هو المقولُ بشكل عام، وهو كل ما يُنطق به؛ سواء كان له معنى فى ذاته أم لا . فاللفظُ (صوتٌ) يدل على أمرٍ يخص المتلفِّظ، مثلما هو الحال فى الزفرات التى يُصدرها المحزون والمكلوم والمأزوم، التى يكون (المعنى) فيها مرتبطاً بالضرورة، بالشخص المتلفِّظ بهذا (الصوت) أو ذاك، فلا يمكن إدراك الدلالة إدراكاً تاماً ، إلا بالإضافة إليه والعطف عليه . وقد يدل (الصوت) على معنى عام تواضعت عليه الجماعة واعتادت، كما هو الحال فى (التأوُّه) الذى يدلُّ لفظُهُ (آه) على الشكوى أو البوح أو تبريح الجوى . وقد يدلُّ أيضاً على الاستحسان أو الموافقة ، أو لوم المحبوب إذا قلنا له مثلاً : آهِ منك .. وفى هذه الحالة ومثلها الكثير، يكون (المعنى) قد ارتبط فى اللفظ، بحال الفاعل تخصيصاً.", " فما يدلُّ بصاحبه، فهو (لفظ) حتى وإن كان مركباً من عدة أصوات. أما الذى يدل بذاته، بصرف النظر عن قائله؛ فهو (كلمة) حتى وإن كانت بسيطة التركيب، محدودة الصوت. وعلى ذلك، فالكلمة عندى، هى كُلُّ ما له معنىً مستقلٌ عن المتلفِّظ .. ولذلك، فإن كُلَّ (كلمة) لفظٌ، ولكن ليس كل (لفظ ) كلمةٌ .", "* * *", " وتضم صفحات هذا الكتاب ، أطرافاً متنوعة تسعى لتبيان معانى (كلمات) خصَّصنا لكل كلمة منها فصلاً قد يطول أو يقصر، بحسب ما يلزمه الغوص فى طبقات المعانى المحتجبة خلف هذه الكلمة أو تلك ، مهما كانت قليلة الحروف. مثلما هو الحال فى كلمة بدء الوجود (كن) التى ابتدأنا بها فصول الكتاب.", " وكان ابتداءُ هذا المسار، سلسلةً من المقالات التى نشرتها، ومازلتُ أنشرها أسبوعياً، بجريدة الوفد المصرية. وكانت فكرتى الأولى الداعية إلى كتابتها، أن أتوقف كل أسبوع عند واحدة من الكلمات، للنظر فى معانيها العميقة. ثم تطوَّر الأمر إلى بحث الحدود الدلالية للكلمات، لتعميق الوعى باللغة التى نستخدمها، وللنظر فى (انقلاب) المعنى فى الكلمة الواحدة أحياناً، من الضد إلى الضد، حتى أننا نستخدم أحياناً (كلمات) قاصدين بها معنىً معاصراً، هو فى واقع الأمر نقيضُ المعنى الأصلى للكلمة.", " وقد أشار لى بعض الأصدقاء، بضرورة نشر المقالات فى كتاب. فكنتُ أتعلَّل بأن الأمر لا يستحق، فما هى إلا خطراتٌ ونظراتٌ استشرافية، فى حدود المعانى المترامية بقلب هذه الكلمة أو تلك . ولما اتسع المدى مع دخول مقالاتى الأسبوعية عامها الثانى، ومع تعمُّق النظر فى معانى الكلمات، لم يعد التعلُّل مقنعاً . خاصةً مع اضطرارى للإيجاز فى كتابة عديد من تلك المقالات، حتى تتناسب مع المساحة المخصصة للنشر، مع ما يقتضيه ذلك من إهدار لكثيرٍ من المعانى، التى كان يجب الوقوف عندها فى هذه الكلمة أو تلك. وبالطبع، فمن شأن (الإيجاز) أن يخلَّ أحياناً بالمعنى، ويقلِّل من الأهمية الدلالية للكلمات.", " ومن طبيعة النشر فى الصحف، أنه قد يختلُّ سياقه مع إسقاط بعض العبارات والفقرات عن عمد أو غير عمد، وقد تتشوَّش الفكرة مع الأخطاء المطبعية التى صارت فى جرائدنا كلها ، أمراً لا غنى عنه ! ولذلك اقتضى نشر (الكلمات) فى هذا الكتاب، إعادة بناء للنصوص السابق نشرها كمقالات، وإعادة كتابة بعضها كليةً. وقد نشرتها هنا، كاملةً، بما فى ذلك بعضها الذى ما كان من الممكن أن يُنشر هناك. وعلى ذلك، فإن فصول هذا (الكتاب) هى الصورة الأقرب لناتج النظر فى مدلولات الكلمات، ولنتائج التأملات والمناقشات التى أعقبت نشرها مسلسلةً .", " وقد جعلتُ العنوان الجانبى للكتاب (التقاط الألماس..) انطلاقاً من أن عديداً من الكلمات، صار بحكم تراكم الطبقات المعرفية فوقه، مثل فحم الأرض الذى صار ألماساً، لما طال عليه الأمدُ .. وما كل الكلام ألماساً، وإنما هى مفردات بعينها، التقطتها كما تُلتقط فصوص الألماس، من كلام الناس ."], "author": "يوسف زيدان", "num_pages": "151", "awards": [], "places": ["Egypt"], "character_names": [], "language": "Arabic", "publish_date": "2011-01-16 00:00:00", "ISBN": "9771442139"},
{"url": "https://www.goodreads.com/book/show/880519.To_Know_a_Woman", "num_ratings": "1,270", "num_reviews": "81", "avg_ratings": 3.53, "genres": ["Fiction", "Cultural", "Israel", "Literature", "Jewish", "Literature", "Novels", "Contemporary", "Audiobook"], "title": "To Know a Woman", "description": ["A ", " Notable Book of the Year", "“[To Know a Woman has] the powerful undertow of myth . . . A rich and affecting novel.” — ", "Following the accidental death of his wife, Israeli secret service agent Yoel Ravid retires to the suburbs with his daughter, mother, and mother-in-law. After a lifetime of uncovering other people’s secrets, he is forced to look b", "A ", " Notable Book of the Year", "“[To Know a Woman has] the powerful undertow of myth . . . A rich and affecting novel.” — ", "Following the accidental death of his wife, Israeli secret service agent Yoel Ravid retires to the suburbs with his daughter, mother, and mother-in-law. After a lifetime of uncovering other people’s secrets, he is forced to look back on his own: the desolate enigma of his wife’s life and death, his years of service to the state, the riddle of his daughter’s behavior. Amos Oz infuses Yoel’s story with poetry, humor, and a vivid sense of the madness inherent in everyday existence.", "“His language is Hebrew, his setting Israel, his message is universal.” — "], "author": "Amos Oz", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-04-27 00:00:00", "ISBN": "0156906805"},
{"url": "https://www.goodreads.com/book/show/323945.Dreams_of_the_Compass_Rose", "num_ratings": "83", "num_reviews": "21", "avg_ratings": 4.17, "genres": ["Fantasy", "Fiction", "Short Stories"], "title": "Dreams of the Compass Rose", "description": ["When a young warrior of a dark race finds himself bound in servitude to a beautiful cruel princess, his loyalty becomes entwined with something more horrifying and mysterious than endless night falling over the ancient desert. When a courageous young servant reveals her hidden wisdom to the madman conqueror of the world, her fate is joined to a nightmare suspended beyond d", "When a young warrior of a dark race finds himself bound in servitude to a beautiful cruel princess, his loyalty becomes entwined with something more horrifying and mysterious than endless night falling over the ancient desert. When a courageous young servant reveals her hidden wisdom to the madman conqueror of the world, her fate is joined to a nightmare suspended beyond death and the universe. The destinies of two souls become connected through ancient truths that lie buried in an island between worlds. Both souls become enslaved through dream and desire in an endless conflict between truth and illusion. They can only be set free by the wonder of the Compass Rose."], "author": "Vera Nazarian", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-11-16 00:00:00", "ISBN": "1596873930"},
{"url": "https://www.goodreads.com/book/show/233997.Martyrs_Crossing", "num_ratings": "233", "num_reviews": "35", "avg_ratings": 3.69, "genres": ["Fiction", "Contemporary", "Cultural", "Israel", "Historical", "Historical Fiction"], "title": "Martyrs' Crossing", "description": ["“At a closed Israeli checkpoint, Marina, a Palestinian mother, clutches her ailing boy, desperate for access to Jerusalem and its doctors. When a young", "“At a closed Israeli checkpoint, Marina, a Palestinian mother, clutches her ailing boy, desperate for access to Jerusalem and its doctors. When a young Israeli soldier waits too long before deciding to disobey orders, a martyr is born. Thus begins a graceful, painful, illuminating novel of the Middle East. . . . [Wilentz’s] prose tugs at the reader. . . . The characters are magnetic. . . . [This] is a very human tale of regrets, revenge, and the elusive nature of absolution.”", "“MAGNIFICENT . . . Wilentz writes with a prose style reminiscent of ", "’s highest ambitions: crystalline, pure, faultlessly communicative. . . . Like the best documentaries, ", " allows us unprecedented access to a little-understood and often misrepresented part of the world.”"], "author": "Amy Wilentz", "num_pages": "330", "awards": ["Rosenthal Family Foundation Award (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-02 00:00:00", "ISBN": "0345449835"},
{"url": "https://www.goodreads.com/book/show/207333.A_Pigeon_and_a_Boy", "num_ratings": "2,417", "num_reviews": "318", "avg_ratings": 4.0, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Israel", "Literature", "Jewish"], "title": "A Pigeon and a Boy", "description": ["From the internationally acclaimed Israeli writer Meir Shalev comes a mesmerizing novel of two love stories, separated by half a century but connected by one enchanting act of devotion. During the 1948 War of Independence--a time when pigeons are still used to deliver battlefield messages--a gifted young pigeon handler is mortally wounded. In the moments before his death,", "From the internationally acclaimed Israeli writer Meir Shalev comes a mesmerizing novel of two love stories, separated by half a century but connected by one enchanting act of devotion. During the 1948 War of Independence--a time when pigeons are still used to deliver battlefield messages--a gifted young pigeon handler is mortally wounded. In the moments before his death, he dispatches one last pigeon. The bird is carrying his extraordinary gift to the girl he has loved since adolescence. Intertwined with this story is the contemporary tale of Yair Mendelsohn, who has his own legacy from the 1948 war. Yair is a tour guide specializing in bird-watching trips who, in middle age, falls in love again with a childhood girlfriend. His growing passion for her, along with a gift from his mother on her deathbed, becomes the key to a life he thought no longer possible. Unforgettable in both its particulars and its sweep, ", " is a tale of lovers then and now--of how deeply we love, of what home is, and why we, like pigeons trained to fly in one direction only, must eventually return to it. In a voice that is at once playful, wise, and altogether beguiling, Meir Shalev tells a story as universal as war and as intimate as a winged declaration of love. From the Hardcover edition."], "author": "Meir Shalev", "num_pages": "312", "awards": ["PEN Translation Prize Nominee for Evan Fallenberg (2008)", "Brenner Prize"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-16 00:00:00", "ISBN": "0805242511"},
{"url": "https://www.goodreads.com/book/show/7286511", "num_ratings": "1,464", "num_reviews": "277", "avg_ratings": 3.94, "genres": ["Novels", "Fiction"], "title": "أميركا", "description": ["صلبت على وجهها الشاحب البياض وهي ترى السيدة الحجرية تمد الشعلة الحجرية صوبها وتخرج من الضباب الذي يغطي البحر. سمعت صوتاً يقول هذا تمثال الحرية، وهناك وراء الضباب الغريب، هل ترون البنايات ناطحات السحاب، هذه مدينة نيويورك، انظروا البيوت العالية! ", "تسافر مرتا حداد، شابة فقيرة وجميلة، من جبل لبنان إلى نيويورك في سنة 1913 بحثاً عن زوجها. ", "بعد ذلك بسنوات طويلة، نراها في باسادينا-كا", "صلبت على وجهها الشاحب البياض وهي ترى السيدة الحجرية تمد الشعلة الحجرية صوبها وتخرج من الضباب الذي يغطي البحر. سمعت صوتاً يقول هذا تمثال الحرية، وهناك وراء الضباب الغريب، هل ترون البنايات ناطحات السحاب، هذه مدينة نيويورك، انظروا البيوت العالية! ", "تسافر مرتا حداد، شابة فقيرة وجميلة، من جبل لبنان إلى نيويورك في سنة 1913 بحثاً عن زوجها. ", "بعد ذلك بسنوات طويلة، نراها في باسادينا-كاليفورنيا، ثرية ومحاطة بأبناء وبنات وأحفاد. ", "عبر شخصيات وحكايات، تأخذنا الرواية إلى أميركا، إلى \"الجبهة العربية\"، وإلى سيبيريا. ", "الحرب الكبرى، ثم وباء الإنفلونزا المنسي، ثم سنوات طيبة ذهبية، ثم الأزمة الاقتصادية العالمية (1929)، ثم سنوات أخرى طيبة، ثم حرب عالمية ثانية... ", "تحيا مرتا عبر هذا كله،"], "author": "Rabie Jaber", "num_pages": "430", "awards": ["الجائزة العالمية للرواية العربية (أي باف) / International Prize for Arabic Fiction (IPAF) Nominee (2010)", "القائمة القصيرة لجائزة البوكر العربية (2010)"], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2009-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/65251.The_Lover", "num_ratings": "1,144", "num_reviews": "80", "avg_ratings": 3.99, "genres": ["Fiction", "Cultural", "Israel", "Literature", "Literature", "Jewish"], "title": "The Lover", "description": ["“Elusive, haunting.”—", "A husband’s search for his wife’s lover, lost amid the turbulence of the Yom Kippur War, is the heart of this dreamlike novel. Through five different perspectives, Yehoshua explores the realities and consequences of the affair and the search, laying bare deep-rooted tensions within family, between generations, between Jews and", "“Elusive, haunting.”—", "A husband’s search for his wife’s lover, lost amid the turbulence of the Yom Kippur War, is the heart of this dreamlike novel. Through five different perspectives, Yehoshua explores the realities and consequences of the affair and the search, laying bare deep-rooted tensions within family, between generations, between Jews and Arabs.", "“[A] profound study of personal and political trauma.” —", "\"Has the symmetry of an elegantly cut gem.” —"], "author": "A.B. Yehoshua", "num_pages": "368", "awards": [], "places": ["Israel"], "character_names": [], "language": "English", "publish_date": "1993-05-07 00:00:00", "ISBN": "0156539128"},
{"url": "https://www.goodreads.com/book/show/121645.Death_Comes_as_the_End", "num_ratings": "12,867", "num_reviews": "757", "avg_ratings": 3.84, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Historical", "Historical Fiction"], "title": "Death Comes as the End", "description": ["In this startling historical mystery, unique in the author's canon, Agatha Christie investigates a deadly mystery at the heart of a dissonant family in ancient Egypt. Imhotep, wealthy landowner and priest of Thebes, has outraged his sons and daughters by bringing a beautiful concubine into their fold. And the manipulative Nofret has already set about a plan to usurp her ri", "In this startling historical mystery, unique in the author's canon, Agatha Christie investigates a deadly mystery at the heart of a dissonant family in ancient Egypt. Imhotep, wealthy landowner and priest of Thebes, has outraged his sons and daughters by bringing a beautiful concubine into their fold. And the manipulative Nofret has already set about a plan to usurp her rivals' rightful legacies. When her lifeless body is discovered at the foot of a cliff, Imhotep's own flesh and blood become the apparent conspirators in her shocking murder. But vengeance and greed may not be the only motives..."], "author": "Agatha Christie", "num_pages": "277", "awards": [], "places": ["Thebes, Egypt"], "character_names": ["Imhotep", "Esa", "Sobek", "Renisenb", "Yahmose", "Ipy", "Satipy", "Kait", "Nofret", "Henet", "Kameni", "Hori", "Ashayet", "Khay", "Teti", "Ankh", "Ipi", "Montu", "Mersu"], "language": "English", "publish_date": "2002-04-15 00:00:00", "ISBN": "0312981619"},
{"url": "https://www.goodreads.com/book/show/206227.Minaret", "num_ratings": "1,969", "num_reviews": "254", "avg_ratings": 3.52, "genres": ["Fiction", "Northern Africa", "Sudan", "Religion", "Cultural", "Africa", "Religion", "Islam", "Islam", "Muslims", "Novels"], "title": "Minaret", "description": ["Leila Aboulela's American debut is a provocative, timely, and engaging novel about a young Muslim woman -- once privileged and secular in her native land and now impoverished in London -- gradually embracing her orthodox faith. ", "With her Muslim hijab and down-turned gaze, Najwa is invisible to most eyes, especially to the rich families whose houses she cleans in London. Twe", "Leila Aboulela's American debut is a provocative, timely, and engaging novel about a young Muslim woman -- once privileged and secular in her native land and now impoverished in London -- gradually embracing her orthodox faith. ", "With her Muslim hijab and down-turned gaze, Najwa is invisible to most eyes, especially to the rich families whose houses she cleans in London. Twenty years ago, Najwa, then at university in Khartoum, would never have imagined that one day she would be a maid. An upper-class Westernized Sudanese, her dreams were to marry well and raise a family. But a coup forces the young woman and her family into political exile in London. Soon orphaned, she finds solace and companionship within the Muslim community. Then Najwa meets Tamer, the intense, lonely younger brother of her employer. They find a common bond in faith and slowly, silently, begin to fall in love. ", "Written with directness and force, ", " is a lyric and insightful novel about Islam and an alluring glimpse into a culture Westerners are only just beginning to understand."], "author": "Leila Aboulela", "num_pages": "288", "awards": ["Orange Prize Nominee for Fiction Longlist (2006)"], "places": [], "character_names": ["Najwa"], "language": "English", "publish_date": "2005-08-19 00:00:00", "ISBN": "0802170145"},
{"url": "https://www.goodreads.com/book/show/3239371", "num_ratings": "2,240", "num_reviews": "136", "avg_ratings": 3.89, "genres": ["Novels", "Media Tie In", "Movies"], "title": "لا أنام", "description": ["تحت كل سقف قصة، وخلف كل جدار حكاية. يرصدها إحسان عبد القدوس وبخياله يرسم لوحاتها، وبقلمه يكتب تفاصيلها التي تعكس أكثر من توالي أحداث، إنها تعكس دواخل النفوس التي ينفذ إليها إحسان عبد القدوس وكمحلل نفسي بارع يسجل الهواجس والسقطات والارتفاعات التي تمرّ فيها النفس الإنسانية. عمل أدبي رائع اجتاز به إحسان عبد القدوس عتبات الدور إلى أعماق القلوب."], "author": "إحسان عبد القدوس", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "1969-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3085759", "num_ratings": "1,808", "num_reviews": "139", "avg_ratings": 3.99, "genres": ["Media Tie In", "Movies", "Novels"], "title": "نادية: الجزء الأول", "author": "يوسف السباعي", "num_pages": "347", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "1987-08-16 00:00:00", "ISBN": "9771103113"},
{"url": "https://www.goodreads.com/book/show/151740.The_Lemon_Tree", "num_ratings": "8,781", "num_reviews": "1,375", "avg_ratings": 4.04, "genres": ["Nonfiction", "History", "Cultural", "Israel", "Politics"], "title": "The Lemon Tree: An Arab, a Jew, and the Heart of the Middle East", "description": ["In 1967, Bashir Al-Khayri, a Palestinian twenty-five-year-old, journeyed to Israel, with the goal of seeing the beloved old stone house, with the lemon tree behind it, that he and his family had fled nineteen years earlier. To his surprise, when he found the house he was greeted by Dalia Ashkenazi Landau, a nineteen-year-old Israeli college student, whose family fled Europ", "In 1967, Bashir Al-Khayri, a Palestinian twenty-five-year-old, journeyed to Israel, with the goal of seeing the beloved old stone house, with the lemon tree behind it, that he and his family had fled nineteen years earlier. To his surprise, when he found the house he was greeted by Dalia Ashkenazi Landau, a nineteen-year-old Israeli college student, whose family fled Europe for Israel following the Holocaust. On the stoop of their shared home, Dalia and Bashir began a rare friendship, forged in the aftermath of war and tested over the next thirty-five years in ways that neither could imagine on that summer day in 1967. Based on extensive research, and springing from his enormously resonant documentary that aired on NPR’s ", " in 1998, Sandy Tolan brings the Israeli-Palestinian conflict down to its most human level, suggesting that even amid the bleakest political realities there exist stories of hope and reconciliation."], "author": "Sandy Tolan", "num_pages": "400", "awards": ["National Book Critics Circle Award Nominee for General Nonfiction (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "1596913436"},
{"url": "https://www.goodreads.com/book/show/25359012-chariots-on-the-highway", "num_ratings": "222", "num_reviews": "80", "avg_ratings": 4.16, "genres": ["Romance", "M M Romance", "War", "Military Fiction", "Gay Romance", "Gay For You", "Contemporary", "Did Not Finish", "Cultural", "Israel", "Romance", "Adult Fiction", "Erotica", "Glbt", "Gay", "War", "Soldiers"], "title": "Chariots on the Highway", "description": ["Every year, young men come from all over the world to join the IDF and fight for Israel. They leave everything behind and becoming what known as lone soldiers.", "Tom, a young man from Kansas, has traveled to Israel to fight for his people. He came to fight, He came to escape. Dan Green has it all. He owns Greentech technologies, lives in a small mention near Tel Aviv, and loo", "Every year, young men come from all over the world to join the IDF and fight for Israel. They leave everything behind and becoming what known as lone soldiers.", "Tom, a young man from Kansas, has traveled to Israel to fight for his people. He came to fight, He came to escape. Dan Green has it all. He owns Greentech technologies, lives in a small mention near Tel Aviv, and looks like a movie star. But his blue eyes, hiding a storm that threatens to smash him. The end of his marriage to Lena, his memories of his late father, his disappointment with himself and his internal wars, pushing him towards the edge. Dan and Tom cross paths at a crucial point in their lives. None of them thought that what began as volunteering mission, will change everything they thought they knew. This is a journey of exploration and discovery. About asking the right questions and finding the answers. In traffic jams of Ayalon Highway, the bustle of the city, on the battlefield, and deep in their dreams. Together they peel layers of pain, and find themselves."], "author": "Limor Moyal", "num_pages": "315", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6688712-the-house-of-the-mosque", "num_ratings": "6,089", "num_reviews": "450", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "Iran", "European Literature", "Dutch Literature", "Historical", "Historical Fiction"], "title": "The House of the Mosque", "description": ["A sweeping, compelling story which brings to life the Iranian Revolution, from an author who experienced it first-hand.", "In the house of the mosque, the family of Aqa Jaan has lived for eight centuries. Now it is occupied by three cousins: Aqa Jaan, a merchant and head of the city's bazaar; Alsaberi, the imam of the mosque; and Aqa Shoja, the mosque's muezzin. The house itse", "A sweeping, compelling story which brings to life the Iranian Revolution, from an author who experienced it first-hand.", "In the house of the mosque, the family of Aqa Jaan has lived for eight centuries. Now it is occupied by three cousins: Aqa Jaan, a merchant and head of the city's bazaar; Alsaberi, the imam of the mosque; and Aqa Shoja, the mosque's muezzin. The house itself teems with life, as each of their families grows up with their own triumphs and tragedies.", "Sadiq is waiting for a suitor to knock at the door to ask for her hand, while her two grandmothers sweep the floors each morning dreaming of travelling to Mecca. Meanwhile, Shahbal longs only to get hold of a television to watch the first moon landing. All these daily dramas are played out under the watchful eyes of the storks that nest on the minarets above.", "But this family will experience upheaval unknown to previous generations. For in Iran, political unrest is brewing. The shah is losing his hold on power; the ayatollah incites rebellion from his exile in France; and one day the ayatollah returns. The consequences will be felt in every corner of Aqa Jaan's family."], "author": "Kader Abdolah", "num_pages": "436", "awards": ["Publieksprijs voor het Nederlandse Boek Nominee (2006)"], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2010-03-15 00:00:00", "ISBN": "184767240X"},
{"url": "https://www.goodreads.com/book/show/23119338-ahriman", "num_ratings": "62", "num_reviews": "33", "avg_ratings": 4.05, "genres": [], "title": "Ahriman: The Spirit of Destruction", "description": ["\"Like Grisham and Clancy... this title shines among the genre simply though superb storytelling.\" -The US Review of Books", "The Day of the Jackal meets Syriana in the near future. ", "When the CIA intercepts intelligence on a terrorist attack in Kuwait, Petra Shirazi, a former field agent, comes face to face with the Ahriman, one of Iran's deadliest assassins. ", "It was the year whe", "\"Like Grisham and Clancy... this title shines among the genre simply though superb storytelling.\" -The US Review of Books", "The Day of the Jackal meets Syriana in the near future. ", "When the CIA intercepts intelligence on a terrorist attack in Kuwait, Petra Shirazi, a former field agent, comes face to face with the Ahriman, one of Iran's deadliest assassins. ", "It was the year when global economies continued to plummet despite analysts' predictions of a turnaround.", "It was the year when the Kuwaiti National Assembly consisted of the largest Islamic contingent in more than two decades.", "It was the month when the price of oil plunged to twenty dollars a barrel.", "It was the month when the Emir of Kuwait dissolved the National Assembly for the thirteenth time in fifteen years.", "It was the day when the head of the Islamic majority of the Assembly hired an assassin and the CIA intercepted intelligence about a new wave of terrorist attacks.", "It was the day that would change the face of the Middle East forever.", "It was May 15, 2021.", "After a disastrous mission forces her out of the field, Petra Shirazi retires from a life of espionage to work in a research position. Three years later, her division stumbles upon a money trail that reveals a massive new wave of terrorist attacks. The money trail places her in the midst of an assassination plot that implicates the highest levels of the Kuwaiti and Iranian governments. Petra will find herself face to face with the Ahriman, a man named for the Persian spirit of destruction who is responsible for a series of bomb blasts that paralyzed the Suez Canal two years earlier. As the investigation begins to unravel, the ripple effects threaten to engulf not only the Middle East and its Western allies, but also the darkest secrets of Petra's past."], "author": "Puja Guha", "num_pages": "540", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/21569585", "num_ratings": "13", "num_reviews": "2", "avg_ratings": 4.08, "genres": [], "title": "اموال ودماء", "description": ["ترصد الرواية قضية ثراء فاحش يظهر على رجل أعمال صاحب شركة للسياحة، الذي يكوِّن ثروة طائلة خلال فترة قصيرة، ويعلن للجميع أنه يعمل في مجال السياحة، ولكن الحقيقة أنه يعمل مع عصابات غسل الأموال التي يريد أصحابها إدخالها في مشروعات تجارية في منطقة الشرق الأوسط عن طريق شبكة الإنترنت الدولية، وعندما ينكشف الغطاء عن رجل الأعمال تتم تصفيته في مكتبه في جريمة بشعة وغامضة"], "author": "داليا محمد رضا", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2013-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4318.Monsieur_Ibrahim_and_The_Flowers_of_the_Qur_an", "num_ratings": "8,808", "num_reviews": "583", "avg_ratings": 3.81, "genres": ["Fiction", "Cultural", "France", "Academic", "School", "Contemporary"], "title": "Monsieur Ibrahim and The Flowers of the Qur'an", "description": ["Internationally acclaimed play of cross-cultural friendship", "Paris in the 1960s. Thirteen-year-old Moses lives in the shadow of his less-than loving father. When he's caught stealing from wise old shopkeeper Monsieur Ibrahim, he discovers an unlikely friend and a whole new world. Together they embark on a journey that takes them from the streets of Paris to the whirling derv", "Internationally acclaimed play of cross-cultural friendship", "Paris in the 1960s. Thirteen-year-old Moses lives in the shadow of his less-than loving father. When he's caught stealing from wise old shopkeeper Monsieur Ibrahim, he discovers an unlikely friend and a whole new world. Together they embark on a journey that takes them from the streets of Paris to the whirling dervishes of the Golden Crescent.", "This delightful, moving play has already been a huge hit in Paris and New York. Performed in thirteen countries and published in twelve languages, it is also an award-winning film starring Omar Sharif.", "Monsieur Ibrahim and the Flowers of the Qur'an received its UK premiere at the Bush Theatre on 17 January 2006."], "author": "Éric-Emmanuel Schmitt", "num_pages": "42", "awards": ["Deutscher Bücherpreis for Publikumspreis (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-17 00:00:00", "ISBN": "0413775909"},
{"url": "https://www.goodreads.com/book/show/7877057-syngu-sabour", "num_ratings": "3,459", "num_reviews": "632", "avg_ratings": 3.61, "genres": ["Fiction", "Cultural", "France", "Cultural", "Asia"], "title": "Syngué Sabour: Pierre de patience", "description": ["« Cette pierre que tu poses devant toi... devant laquelle tu te lamentes sur tous tes malheurs, toutes tes misères... à qui tu confies tout ce que tu as sur le cœur et que tu n'oses pas révéler aux autres... Tu lui parles, tu lui parles. Et la pierre t'écoute, éponge tous tes mots, tes secrets, jusqu'à ce qu'un beau jour elle éclate. Elle tombe en miettes. Et ce jour-là, t", "« Cette pierre que tu poses devant toi... devant laquelle tu te lamentes sur tous tes malheurs, toutes tes misères... à qui tu confies tout ce que tu as sur le cœur et que tu n'oses pas révéler aux autres... Tu lui parles, tu lui parles. Et la pierre t'écoute, éponge tous tes mots, tes secrets, jusqu'à ce qu'un beau jour elle éclate. Elle tombe en miettes. Et ce jour-là, tu es délivré de toutes tes souffrances, de toutes tes peines... Comment appelle-t-on cette pierre? » ", "En Afghanistan peut-être ou ailleurs, une femme veille son mari blessé. Au fond, ils ne se connaissent pas. Les heures et les jours passent tandis que la guerre approche. Et la langue de la femme se délie, tisse le récit d'une vie d'humiliations, dans l'espoir d'une possible rédemption."], "author": "Atiq Rahimi", "num_pages": "137", "awards": ["Prix Goncourt (2008)", "DSC Prize Nominee for South Asian Literature  for Longlist (2012)"], "places": ["France"], "character_names": [], "language": "French", "publish_date": "2010-03-01 00:00:00", "ISBN": "2070416739"},
{"url": "https://www.goodreads.com/book/show/212936.Balthasar_s_Odyssey", "num_ratings": "3,463", "num_reviews": "262", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Fiction", "Novels"], "title": "Balthasar's Odyssey", "description": ["An ambitious novel set in 1665, the tumultuous eve of the Year of the Beast, when the world was supposed to come to an end. Antiquarian merchant and sage Balthasar must go on an odyssey in search of a book that holds the secret of God's hundredth name, which is the key to the survival of the world."], "author": "Amin Maalouf", "num_pages": "391", "awards": ["Premio Grinzane Cavour Nominee for Narrativa Straniera (2001)", "International DUBLIN Literary Award Nominee (2004)"], "places": [], "character_names": ["Marta", "Baldassare Embriaco"], "language": "English", "publish_date": "2003-11-14 00:00:00", "ISBN": "155970702X"},
{"url": "https://www.goodreads.com/book/show/6642715-the-forty-rules-of-love", "num_ratings": "88,084", "num_reviews": "11,608", "avg_ratings": 4.16, "genres": ["Fiction", "Novels", "Historical", "Historical Fiction"], "title": "The Forty Rules of Love", "description": ["In this lyrical, exuberant follow-up to her 2007 novel, ", ", acclaimed Turkish author Elif Shafak unfolds two tantalizing parallel narratives—one contemporary and the other set in the thirteenth century, when Rumi encountered his spiritual mentor, the whirling dervish known as Shams of Tabriz—that together incarnate the poet's timeless message of love.", "In this lyrical, exuberant follow-up to her 2007 novel, ", ", acclaimed Turkish author Elif Shafak unfolds two tantalizing parallel narratives—one contemporary and the other set in the thirteenth century, when Rumi encountered his spiritual mentor, the whirling dervish known as Shams of Tabriz—that together incarnate the poet's timeless message of love.", " Ella Rubenstein is forty years old and unhappily married when she takes a job as a reader for a literary agent. Her first assignment is to read and report on ", ", a novel written by a man named Aziz Zahara. Ella is mesmerized by his tale of Shams's search for Rumi and the dervish's role in transforming the successful but unhappy cleric into a committed mystic, passionate poet, and advocate of love. She is also taken with Shams's lessons, or rules, that offer insight into an ancient philosophy based on the unity of all people and religions, and the presence of love in each and every one of us. As she reads on, she realizes that Rumi's story mir­rors her own and that Zahara—like Shams—has come to set her free."], "author": "Elif Shafak", "num_pages": "354", "awards": ["International DUBLIN Literary Award Nominee (2011)"], "places": [], "character_names": ["Rumi", "Shams-i Tabrizi"], "language": "English", "publish_date": "2010-02-18 00:00:00", "ISBN": "0670021458"},
{"url": "https://www.goodreads.com/book/show/212935.The_Rock_of_Tanios", "num_ratings": "4,553", "num_reviews": "272", "avg_ratings": 3.93, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "France", "Novels"], "title": "The Rock of Tanios", "description": ["Tanios was a child of the mountains of Lebanon in the 1880s when the Egyptian Pashas were struggling against Ottoman domination and the British and French plotted with and against each other. Amin Maalouf's novel, ", ", begins with a recollection of the rock on which Tanios was last seen sitting and weaves together the strands of the fascinating legend of his", "Tanios was a child of the mountains of Lebanon in the 1880s when the Egyptian Pashas were struggling against Ottoman domination and the British and French plotted with and against each other. Amin Maalouf's novel, ", ", begins with a recollection of the rock on which Tanios was last seen sitting and weaves together the strands of the fascinating legend of his disappearance. Tanios was the illegitimate son of a powerful Sheik whose every action brought chaos into his village. When Tanios's adopted father caused the death of a powerful political rival, he and his son together fled their homeland. In hiding, they became entangled with international spies and politicians; Tanios soon took on the roll of intermediary between dueling European and Middle Eastern powers."], "author": "Amin Maalouf", "num_pages": "275", "awards": ["Prix Goncourt (1993)"], "places": ["Lebanon", "Egypt", "Cyprus", "Ottoman Empire"], "character_names": [], "language": "English", "publish_date": "1995-09-07 00:00:00", "ISBN": "0349106622"},
{"url": "https://www.goodreads.com/book/show/5539594", "num_ratings": "2,173", "num_reviews": "350", "avg_ratings": 3.89, "genres": ["Novels"], "title": "قلب الليل", "description": ["تبدأ الرواية عندما يذهب جعفر سيد الراوي وهو بطل القصة إلى دائرة الأوقاف للمطالبة بأملاك جده, لكن الموظف في الأوقاف و الذي يعرف الرجل شرح له انه من غير الممكن الحصول على الإرث بعدما أوقف الجد جميع ثروته. لكن العجوز جعفر يصر على أن يحصل على ثروة جده. بعدها تتوطد العلاقة بين الموظف و جعفر وفي إحدى المرات في مقهى ودود بالباب الأخضر يقوم جعفر بقص حكايته على الموظف"], "author": "Naguib Mahfouz", "num_pages": "117", "awards": [], "places": ["Cairo"], "character_names": [], "language": "Arabic", "publish_date": "2007-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2302650.Finding_Nouf", "num_ratings": "7,722", "num_reviews": "1,292", "avg_ratings": 3.79, "genres": ["Mystery", "Thriller", "Mystery Thriller", "Fiction", "Adult"], "title": "Finding Nouf", "description": ["A novel of taut psychological suspense, offering an unprecedented window into Saudi Arabia and the lives of the men and women who live there.", "Zoë Ferraris’s electrifying debut of taut psychological suspense offers an unprecedented window into Saudi Arabia and the lives of men and women there. ", "When sixteen-year-old Nouf goes missing, along with a truck and her favorite camel", "A novel of taut psychological suspense, offering an unprecedented window into Saudi Arabia and the lives of the men and women who live there.", "Zoë Ferraris’s electrifying debut of taut psychological suspense offers an unprecedented window into Saudi Arabia and the lives of men and women there. ", "When sixteen-year-old Nouf goes missing, along with a truck and her favorite camel, her prominent family calls on Nayir al-Sharqi, a desert guide, to lead a search party. Ten days later, just as Nayir is about to give up in frustration, her body is discovered by anonymous desert travelers. But when the coroner’s office determines that Nouf died not of dehydration but from drowning, and her family seems suspiciously uninterested in getting at the truth, Nayir takes it upon himself to find out what really happened to her. ", "This mission will push gentle, hulking, pious Nayir, a Palestinian orphan raised by his bachelor uncle, to delve into the secret life of a rich, protected teenage girl -- in one of the most rigidly gender-segregated of Middle Eastern societies. Initially horrified at the idea of a woman bold enough to bare her face and to work in public, Nayir soon realizes that if he wants to gain access to the hidden world of women, he will have to join forces with Katya Hijazi, a lab worker at the coroner’s office. Their partnership challenges Nayir, bringing him face to face with his desire for female companionship and the limitations imposed by his beliefs. It also ultimately leads them both to surprising revelations. ", "Fast-paced and utterly transporting, Finding Nouf offers an intimate glimpse inside a closed society and a riveting literary mystery. ", "First published as Night of the Mi'raj in the UK."], "author": "Zoë Ferraris", "num_pages": "305", "awards": ["Macavity Award Nominee for Best First Mystery Novel (2009)", "Los Angeles Times Book Prize for Art Seidenbaum Award for First Fiction (2008)", "ALA Alex Award (2009)", "Sakura Medal Nominee for High School Book (2010)"], "places": ["Jeddah"], "character_names": [], "language": "English", "publish_date": "2008-06-20 00:00:00", "ISBN": "0618873880"},
{"url": "https://www.goodreads.com/book/show/6698181", "num_ratings": "3,759", "num_reviews": "655", "avg_ratings": 4.07, "genres": ["Novels"], "title": "ولدت هناك، ولدت هنا", "description": ["أصدر مريد البرغوثي كتابه \"رأيت رام الله\" في العام 1997، توقع الكثير من قرائه أن يتبعه بجزء ثانٍ، يحكي حكاية مع ابنه تميم إلى فلسطين. هذا الكتاب يروي رحلة الشاعرين، الأب والإبن، بمصاعبها ومباهجها ومفارقاتها، وفي الوقت نفسه يروي عشر سنوات (1998-2008) من تاريخ اللحظات الشخصية الحميمة التي يهملها عادة المؤرخون السياسيون. مريد البرغوثي هنا يجعل من الحميم تاريخاً، ومن العابر راس", "أصدر مريد البرغوثي كتابه \"رأيت رام الله\" في العام 1997، توقع الكثير من قرائه أن يتبعه بجزء ثانٍ، يحكي حكاية مع ابنه تميم إلى فلسطين. هذا الكتاب يروي رحلة الشاعرين، الأب والإبن، بمصاعبها ومباهجها ومفارقاتها، وفي الوقت نفسه يروي عشر سنوات (1998-2008) من تاريخ اللحظات الشخصية الحميمة التي يهملها عادة المؤرخون السياسيون. مريد البرغوثي هنا يجعل من الحميم تاريخاً، ومن العابر راسخاً، ومن المألوف مدهشاً"], "author": "Mourid Barghouti", "num_pages": "283", "awards": ["Saif Ghobash Banipal Prize Nominee for Arabic Literary Translation (2012)", "Palestine Book Awards Nominee for Shortlist (2012)"], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2009-08-16 00:00:00", "ISBN": "9953214123"},
{"url": "https://www.goodreads.com/book/show/20317106", "num_ratings": "46,414", "num_reviews": "5,910", "avg_ratings": 3.78, "genres": ["Novels"], "title": "هيبتا", "description": ["تأخذنا رواية (هيبتا) إلي ذلك العالم الذي أهلكه الجميع بحثا ..", "ذلك العالم الذي رغم تكرار قصصه ورواياته إلا أن الجميع فيه يقع في نفس الأخطاء، ويعيد نفس الأحداث، و يتألم نفس الألم ..", "خلال محاضرة مدتها ست ساعات يأخذنا (أسامة) المحاضر إلى حالات نادرة ..", "ورغم ندرتها لن تستطيع إلا أن تجد نفسك فيها ..", "في عالم الحب والأمل والألم .. من خلال حالات نعيشهم و نفهم منهم تلك المراحل السبع الت", "تأخذنا رواية (هيبتا) إلي ذلك العالم الذي أهلكه الجميع بحثا ..", "ذلك العالم الذي رغم تكرار قصصه ورواياته إلا أن الجميع فيه يقع في نفس الأخطاء، ويعيد نفس الأحداث، و يتألم نفس الألم ..", "خلال محاضرة مدتها ست ساعات يأخذنا (أسامة) المحاضر إلى حالات نادرة ..", "ورغم ندرتها لن تستطيع إلا أن تجد نفسك فيها ..", "في عالم الحب والأمل والألم .. من خلال حالات نعيشهم و نفهم منهم تلك المراحل السبع التي لخصت كل القواعد .. قواعد الـ\"هيبتا\" .."], "author": "محمد صادق", "num_pages": "223", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2014-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/179666.The_Journey_of_Ibn_Fattouma", "num_ratings": "3,106", "num_reviews": "473", "avg_ratings": 3.96, "genres": ["Fiction", "Novels"], "title": "The Journey of Ibn Fattouma", "description": ["First published in Arabic in 1983, this brief but powerful parable is presented as the journal of a traveler known as Ibn Fattouma. A mystical, lyrical Pilgrim's Progress set in a mythical, timeless Middle East, by the winner of the 1988 Nobel Prize for Literature."], "author": "Naguib Mahfouz", "num_pages": "148", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-08-01 00:00:00", "ISBN": "0385423233"},
{"url": "https://www.goodreads.com/book/show/31206812-the-kurdish-bike", "num_ratings": "275", "num_reviews": "61", "avg_ratings": 4.2, "genres": ["Fiction"], "title": "The Kurdish Bike", "description": ["This provocative and heart-warming novel, based on a true story, follows an American teacher whose values are challenged in an Iraqi village in 2010.", "\"Courageous teachers wanted to rebuild war-torn nation.\" With her marriage over and life gone flat, Theresa Turner responds to an online ad, and lands at a school in Kurdish Iraq. Befriended by a widow in a nearby village, The", "This provocative and heart-warming novel, based on a true story, follows an American teacher whose values are challenged in an Iraqi village in 2010.", "\"Courageous teachers wanted to rebuild war-torn nation.\" With her marriage over and life gone flat, Theresa Turner responds to an online ad, and lands at a school in Kurdish Iraq. Befriended by a widow in a nearby village, Theresa is embroiled in the joys and agonies of traditional Kurds, especially the women who survived Saddam's genocide only to be crippled by age-old restrictions, brutality and honor killings. Theresa's greatest challenge will be balancing respect for cultural values while trying to introduce more enlightened attitudes toward women - at the same time seeking new spiritual dimensions within herself. ", " is gripping, tender, wry and compassionate - an eye-opener into little-known customs in one of the world's most explosive regions - a novel of love, betrayal and redemption."], "author": "Alesa Lightbourne", "num_pages": "323", "awards": ["Independent Publisher Book Award (IPPY) for Best Regional e-Book Fiction (Gold) (2017)", "North Street Book Awards"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-07-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2722.Cities_of_Salt", "num_ratings": "3,045", "num_reviews": "469", "avg_ratings": 4.06, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels"], "title": "Cities of Salt", "description": ["Set in an unnamed Persian Gulf kingdom in the 1930s, this remarkable novel tells the story of the disruption and diaspora of a poor oasis community following the discovery of oil there. The meeting of Arabs and the Americans who, in essence, colonized the remote region is a cultural confrontation in which religion, history, superstition, and mutual incomprehension all play", "Set in an unnamed Persian Gulf kingdom in the 1930s, this remarkable novel tells the story of the disruption and diaspora of a poor oasis community following the discovery of oil there. The meeting of Arabs and the Americans who, in essence, colonized the remote region is a cultural confrontation in which religion, history, superstition, and mutual incomprehension all play a part.", "Powerful political fiction that it is, ", " has been banned in several Arab countries, including Saudi Arabia. The novel, the first volume in a trilogy, has been translated from the Arabic to English by Peter Theroux."], "author": "Abdul Rahman Munif", "num_pages": "627", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-07-17 00:00:00", "ISBN": "039475526X"},
{"url": "https://www.goodreads.com/book/show/16360.Murder_in_Mesopotamia", "num_ratings": "28,162", "num_reviews": "1,121", "avg_ratings": 3.88, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Classics", "Mystery", "Detective"], "title": "Murder in Mesopotamia", "description": ["When nurse Amy Leatheran agrees to look after American archaeologist Dr Leidner’s wife Louise at a dig near Hassanieh she finds herself taking on more than just nursing duties – she also has to help solve murders. Fortunately for Amy, Hercule Poirot is visiting the excavation site but will the great detective be in time to prevent a multiple murderer from striking again?"], "author": "Agatha Christie", "num_pages": "264", "awards": [], "places": ["Hassanieh"], "character_names": ["Amy Leatheran", "Dr. Erich Leidner", "Louise Leidner", "Anne Johnson", "Dr. Giles Reilly", "Richard Carey", "Hercule Poirot", "Sheila Reilly", "Marie Mercado", "Joseph Mercado", "David Emmott", "Bill Coleman", "Carl Reiter", "Captain Maitland", "Father Lavigny"], "language": "English", "publish_date": "2001-12-16 00:00:00", "ISBN": "0007113803"},
{"url": "https://www.goodreads.com/book/show/157985.Shahnameh", "num_ratings": "3,553", "num_reviews": "227", "avg_ratings": 4.51, "genres": ["Poetry", "Classics", "History", "Cultural", "Iran", "Literature", "Fantasy", "Mythology"], "title": "Shahnameh: The Persian Book of Kings", "description": ["Among the great works of world literature, perhaps one of the least familiar to English readers is the \"Shahnameh: ThePersian Book of Kings,\" the national epic of Persia. This prodigious narrative, composed by the poet Ferdowsi between the years 980 and 1010, tells the story of pre- Islamic Iran, beginning in the mythic time of Creation and continuing forward to the Arab i", "Among the great works of world literature, perhaps one of the least familiar to English readers is the \"Shahnameh: ThePersian Book of Kings,\" the national epic of Persia. This prodigious narrative, composed by the poet Ferdowsi between the years 980 and 1010, tells the story of pre- Islamic Iran, beginning in the mythic time of Creation and continuing forward to the Arab invasion in the seventh century. As a window on the world, \"Shahnameh\" belongs in the company of such literary masterpieces as Dante's \"Divine Comedy,\" the plays of Shakespeare, the epics of Homer- classics whose reach and range bring whole cultures into view. In its pages are unforgettable moments of national triumph and failure, human courage and cruelty, blissful love and bitter grief.", "In tracing the roots of Iran, \"Shahnameh\" initially draws on the depths of legend and then carries its story into historical times, when ancient Persia was swept into an expanding Islamic empire. Now Dick Davis, the greatest modern translator of Persian poetry, has revisited that poem, turning the finest stories of Ferdowsi's original into an elegant combination of prose and verse. For the first time in English, in the most complete form possible, readers can experience \"Shahnameh\" in the same way that Iranian storytellers have lovingly conveyed it in Persian for the past thousand years."], "author": "Abolqasem Ferdowsi", "num_pages": "886", "awards": [], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Sohrab", "Rostam", "Esfandiar", "Simorgh &..."], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0670034851"},
{"url": "https://www.goodreads.com/book/show/16304.Murder_on_the_Orient_Express", "num_ratings": "257,952", "num_reviews": "16,593", "avg_ratings": 4.16, "genres": ["Mystery", "Classics", "Fiction", "Mystery", "Crime"], "title": "Murder on the Orient Express", "description": ["What more can a mystery addict desire than a much-loathed murder victim found aboard the luxurious Orient Express with multiple stab wounds, thirteen likely suspects, an incomparably brilliant detective in Hercule Poirot, and the most ingenious crime ever conceived?"], "author": "Agatha Christie", "num_pages": "322", "awards": [], "places": ["Constantinople", "Vinkovci", "Yugoslavia"], "character_names": ["Samuel Edward Ratchett", "Hector MacQueen", "Masterman", "Colonel Arbuthnot", "Harriet Hubbard", "Count Rudolf Andrenyi", "Countess Elena Andrenyi", "Princess Natalia Dragomiroff", "Mary Debenham", "Hildegarde Schmidt", "Antonio Foscarel", "Greta Ohlsson", "Pierre Michel", "Cyrus Hardman", "Dr. Constantine", "M. Bouc", "Hercule Poirot"], "language": "English", "publish_date": "2004-08-31 00:00:00", "ISBN": "0425200450"},
{"url": "https://www.goodreads.com/book/show/30855.A_Woman_in_Jerusalem", "num_ratings": "1,102", "num_reviews": "171", "avg_ratings": 3.41, "genres": ["Fiction", "Cultural", "Israel", "Literature", "Jewish"], "title": "A Woman in Jerusalem", "description": ["A woman in her forties is a victim of a suicide bombing at a Jerusalem market. Her body lies nameless in a hospital morgue. She had apparently worked as a cleaning woman at a bakery, but there is no record of her employment. When a Jerusalem daily accuses the bakery of \"gross negligence and inhumanity toward an employee,\" the bakery's owner, overwhelmed by guilt, entrusts", "A woman in her forties is a victim of a suicide bombing at a Jerusalem market. Her body lies nameless in a hospital morgue. She had apparently worked as a cleaning woman at a bakery, but there is no record of her employment. When a Jerusalem daily accuses the bakery of \"gross negligence and inhumanity toward an employee,\" the bakery's owner, overwhelmed by guilt, entrusts the task of identifying and burying the victim to a human resources man. This man is at first reluctant to take on the job, but as the facts of the woman's life take shape-she was an engineer from the former Soviet Union, a non-Jew on a religious pilgrimage to Jerusalem, and, judging by an early photograph, beautiful-he yields to feelings of regret, atonement, and even love.", "At once profoundly serious and highly entertaining, A. B. Yehoshua astonishes us with his masterly, often unexpected turns in the story and with his ability to get under the skin and into the soul of Israel today. "], "author": "A.B. Yehoshua", "num_pages": "256", "awards": ["Los Angeles Times Book Prize for Fiction (2006)", "Jewish Quarterly-Wingate Prize Nominee (2007)"], "places": ["Israel"], "character_names": [], "language": "English", "publish_date": "2006-08-14 00:00:00", "ISBN": "0151012261"},
{"url": "https://www.goodreads.com/book/show/716696._", "num_ratings": "15,170", "num_reviews": "1,257", "avg_ratings": 4.18, "genres": ["Poetry", "Classics", "Philosophy", "Fiction", "Literature"], "title": "رباعيات خيام", "description": ["The rubaiyat are a series of poems or 'stanzas' by the famous 12th century Persian atronomer and philosopher", "The Rubáiyát of Omar Khayyám (Persian: رباعیات عمر خیام) is the title that Edward FitzGerald gave to his translation of a selection of poems, originally written in Persian and numbering about a thousand, attributed to Omar Khayyám (1048–1131), a Persian poet, mathema", "The rubaiyat are a series of poems or 'stanzas' by the famous 12th century Persian atronomer and philosopher", "The Rubáiyát of Omar Khayyám (Persian: رباعیات عمر خیام‎) is the title that Edward FitzGerald gave to his translation of a selection of poems, originally written in Persian and numbering about a thousand, attributed to Omar Khayyám (1048–1131), a Persian poet, mathematician and astronomer. A ruba'i is a two-line stanza with two parts (or hemistichs) per line, hence the word rubáiyát (derived from the Arabic language root for \"four\"), meaning \"quatrains\". (Courtesy: Wikipedia)(less)"], "author": "Omar Khayyám", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "Persian", "publish_date": "2007-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6122468", "num_ratings": "5,462", "num_reviews": "525", "avg_ratings": 3.82, "genres": ["Fiction", "Novels"], "title": "ثرثرة فوق النيل", "description": ["رواية"], "author": "Naguib Mahfouz", "num_pages": "161", "awards": [], "places": ["Cairo"], "character_names": [], "language": "Arabic", "publish_date": "2006-08-16 00:00:00", "ISBN": "9770915890"},
{"url": "https://www.goodreads.com/book/show/474078.Ali_and_Nino", "num_ratings": "4,576", "num_reviews": "555", "avg_ratings": 3.91, "genres": ["Fiction", "Historical", "Historical Fiction", "Romance", "Classics"], "title": "Ali and Nino: A Love Story", "description": ["First published in Vienna in 1937, this classic story of romance and adventure has been compared to ", " and ", ".  Its mysterious author was recently the subject of a feature article in the ", ", which has inspired a forthcoming biography. Out of print for nearly three decades until the hardcover re-release last year, ", " is Kurban Said's", "First published in Vienna in 1937, this classic story of romance and adventure has been compared to ", " and ", ".  Its mysterious author was recently the subject of a feature article in the ", ", which has inspired a forthcoming biography. Out of print for nearly three decades until the hardcover re-release last year, ", " is Kurban Said's masterpiece. It is a captivating novel as evocative of the exotic desert landscape as it is of the passion between two people pulled apart by culture, religion, and war.", "It is the eve of World War I in Baku, Azerbaijan, a city on the edge of the Caspian Sea, poised precariously between east and west.  Ali Khan Shirvanshir, a Muslim schoolboy from a proud, aristocratic family, has fallen in love with the beautiful and enigmatic Nino Kipiani, a Christian girl with distinctly European sensibilities.   To be together they must overcome blood feud and scandal, attempt a daring horseback rescue, and travel from the bustling street of oil-boom Baku, through starkly beautiful deserts and remote mountain villages, to the opulent palace of Ali's uncle in neighboring Persia.  Ultimately the lovers are drawn back to Baku, but when war threatens their future, Ali is forced to choose between his loyalty to the beliefs of his Asian ancestors and his profound devotion to Nino.  Combining the exotic fascination of a tale told by Scheherazade with the range and magnificence of an epic, ", " is a timeless classic of love in the face of war."], "author": "Kurban Said", "num_pages": "288", "awards": [], "places": ["Baku", "Tbilisi", "Shusha", "Tehran"], "character_names": [], "language": "English", "publish_date": "2000-10-03 00:00:00", "ISBN": "0385720408"},
{"url": "https://www.goodreads.com/book/show/3127736", "num_ratings": "8,177", "num_reviews": "1,756", "avg_ratings": 4.27, "genres": ["Novels", "Northern Africa", "Morocco", "Fiction"], "title": "تلك العتمة الباهرة", "description": ["مصابي جليل، والعزاء جميل، ...", "وظني بأن الله سوف يديل", "جراح وأسر، واشتياق، وغربة...", "أحمل إني، بعدها، لحمول", "وإني، في هذا الصباح، لصالح،...", "ولكن خطي في الظلام جليل ", "إذا أردتَ أن تعلَمَ قسوةَ السجّان، وتواطؤ السجن عليك، فأسأل سجين، أو ذويه", "إذا أردتَ أن تتذوَق صِدق المعاناة، وتتذوّق طعمَ الحياة الآخَر، فرجاءً لا تقرأ رواية عن الحبّ السرمديّ، ولكِن إقرأ في أدبِ السجون", "رواية الطاهر بن جلّ", "مصابي جليل، والعزاء جميل، ...", "وظني بأن الله سوف يديل", "جراح وأسر، واشتياق، وغربة...", "أحمل إني، بعدها، لحمول", "وإني، في هذا الصباح، لصالح،...", "ولكن خطي في الظلام جليل ", "إذا أردتَ أن تعلَمَ قسوةَ السجّان، وتواطؤ السجن عليك، فأسأل سجين، أو ذويه", "إذا أردتَ أن تتذوَق صِدق المعاناة، وتتذوّق طعمَ الحياة الآخَر، فرجاءً لا تقرأ رواية عن الحبّ السرمديّ، ولكِن إقرأ في أدبِ السجون", "رواية الطاهر بن جلّون هذه، مقتبسة عن الحقيقة، يروي لنا سجيننا معاناته، في الزنزانة \"ب\" مع 23 سجين غيره، ويقصّ علينا بأسلوب \"باهِر\" موتَ المعظم الساحِق من أصدقائه، وظروف موتهم", "سُجِنوا لمحاولتهم الإنقلاب على الملك المغربي الحسن الثاني، في إنقلاب الصخيرات الشهير في 10 آب 1971", "الكلمات لم تستعصِ على الطاهِر بن جلّون لوصف الحفرة -الحبس- الذي دفنوا فيهِ أحياء، على مدار 18 عاماً", "لم يفقدوا إيمانهم بالله، وبقيَت ألسنهم رطبى بالقرآن والحديثِ الحسن", "إرتقوا فوق عذاباتهم الجسمية، إرتقوا فوق الجوع، فوقَ التقتير، فوق الضيق، فوق العتمة، فوقَ العقارِب والصراصير، وفوقَ سخرية السجّان", "وفي النهايَة، يتواطؤ السجّان مع سجينه، ويبدأ نموّ أمل الحرية، بعدَ أن قتلوه", "هيَ فعلاً رواية باهِرة، فوقَ الوصف", "جميلة، مؤلمة، ولا ترتوي منها"], "author": "Tahar Ben Jelloun", "num_pages": "223", "awards": ["Independent Foreign Fiction Prize Nominee for Shortlist (2006)", "International DUBLIN Literary Award (2004)"], "places": ["Morocco"], "character_names": [], "language": "Arabic", "publish_date": "2004-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5492.Sugar_Street", "num_ratings": "4,981", "num_reviews": "456", "avg_ratings": 4.22, "genres": ["Fiction", "Northern Africa", "Egypt", "Novels", "Historical", "Historical Fiction"], "title": "Sugar Street", "description": ["Sugar Street is the third and concluding volume of the celebrated Cairo Trilogy, which brings the story of Al-Sayid Ahmad and his family up to the middle of the twentieth century.", "Aging and ill, the family patriarch surveys the world from his housewares's latticed balcony, as his long-suffering wife once did. While his children face middle age, it is through his grandsons t", "Sugar Street is the third and concluding volume of the celebrated Cairo Trilogy, which brings the story of Al-Sayid Ahmad and his family up to the middle of the twentieth century.", "Aging and ill, the family patriarch surveys the world from his housewares's latticed balcony, as his long-suffering wife once did. While his children face middle age, it is through his grandsons that we see a modern Egypt emerging."], "author": "نجيب محفوظ", "num_pages": "320", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1991-08-16 00:00:00", "ISBN": "0552995827"},
{"url": "https://www.goodreads.com/book/show/5557442", "num_ratings": "11,452", "num_reviews": "1,657", "avg_ratings": 2.99, "genres": ["Novels"], "title": "ظل الأفعى", "description": ["محيطًا بلا نهاية", ".... وحدى، أنا", "... سأبقى، وأصيرُ..", "... أفعى، عصيَّةً..", "تحكى هذه الرواية تحولات صورة الأنثى في ثقافتنا. فهي تروى سيرورة الصورة، وصيرورتها من أفق الأنثى المقدسة إلى دهاليز النسوة المدنسات. والرواية لا تقصد إلى الحطِّ والتهوين من شأن تلك الثقافات المتعاقبة المسماة، زوراً وبهتانًا بالسامية بل تعرض للأنثى السامِيَة، من حيث دنستها السامِيَّة. ولتحض على إعادة اكتشاف", "محيطًا بلا نهاية", ".... وحدى، أنا", "... سأبقى، وأصيرُ..", "... أفعى، عصيَّةً..", "تحكى هذه الرواية تحولات صورة الأنثى في ثقافتنا. فهي تروى سيرورة الصورة، وصيرورتها من أفق الأنثى المقدسة إلى دهاليز النسوة المدنسات. والرواية لا تقصد إلى الحطِّ والتهوين من شأن تلك الثقافات المتعاقبة المسماة، زوراً وبهتانًا بالسامية بل تعرض للأنثى السامِيَة، من حيث دنستها السامِيَّة. ولتحض على إعادة اكتشاف الذات وتصحيح مفهوم الإنسانية وصورة المرأة.", "يوسف زيدان كاتب وباحث متخصص في التراث العربي والمخطوطات ولد بسوهاج بجنوب مصر عام 1958. له العديد من المؤلفات والأبحاث العلمية في الفكر الإسلامي، والتصوف، وتاريخ الطب والعلوم عند العرب، وفهرسة المكتبات قاربت الخمسين كتابا والثمانين بحثا، وهذه هي روايته الأولى."], "author": "يوسف زيدان", "num_pages": "170", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2501458._", "num_ratings": "21,518", "num_reviews": "1,868", "avg_ratings": 3.85, "genres": ["Literature"], "title": "ذاكرة الجسد", "description": ["في حضور الوجدان تتألق معاني أحلام مستغانمي، وفي ذاكرة الجسد تتوج حضورها، حروفاً كلمات عبارات تتقاطر في حفل الغناء الروحي. موسيقاه الوطن المنبعث برغم الجراحات... مليون شهيد وثورة ومجاهد، وجزائر الثكلى بأبنائها تنبعث زوابع وعواصف الشوق والحنين في قلب خالد الرسام الذي امتشق الريشة بعد أن هوت يده التي حملت السلاح يوماً، والريشة والسلاح سيّان، كلاهما ريشة تعزف على أوتار الوطن.", "في حضور الوجدان تتألق معاني أحلام مستغانمي، وفي ذاكرة الجسد تتوج حضورها، حروفاً كلمات عبارات تتقاطر في حفل الغناء الروحي. موسيقاه الوطن المنبعث برغم الجراحات... مليون شهيد وثورة ومجاهد، وجزائر الثكلى بأبنائها تنبعث زوابع وعواصف الشوق والحنين في قلب خالد الرسام الذي امتشق الريشة بعد أن هوت يده التي حملت السلاح يوماً، والريشة والسلاح سيّان، كلاهما ريشة تعزف على أوتار الوطن. ففي فرنسا وعندما كان يرسم ما تراه عيناه، جسر ميرابو ونهر السين، وجد أن ما يرسمه هو جسراً آخر ووادياً آخر لمدينة أخرى هي قسنطينة، فأدرك لحظتها أنه في كل حال لا يرسم ما نسكنه، وإنما ما يسكننا. ", "وهل كانت أحلام مستغانمي تكتب ذاكرة الجسد أم أنها تكتب ذاكرة الوطن؟!! الأمر سيّان فما الجسد إلا جزء من الوطن وما الوطن إلا هذا الجسد الساكن فيه إلى الأبد. تتقاطر الذكرى مفعمة بروح الماضي الذي يأبى إلا الحضور في كل شيء متجسداً السي طاهر التي كما عرفها خالد طفلة رجل قاد خطواته على درب الكفاح؛ عرفها أنثى... كانت من الممكن أن تكون حبيبته، زوجته، ولكنها باتت زوجة في زواج لم يحضره، تلف الذكرى الصفحات، وتتهادى العبارات ممسكة بتلابيب الذكريات دون أن توقظ النفس ملل الحضور. الوطن والحبيبة يجتمعان، والثورة والحب ينصهران في بوتقة واحدة، ومزيجهما عطاء فكري، بعيد عن الخيال، للواقع أقرب، وللإنسان في صدق مشاعره وأحاسيسه أقرب وأقرب."], "author": "أحلام مستغانمي", "num_pages": "404", "awards": ["جائزة نجيب محفوظ للأدب (1998)"], "places": ["Algeria"], "character_names": [], "language": "Arabic", "publish_date": "2010-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6185102", "num_ratings": "2,583", "num_reviews": "283", "avg_ratings": 4.07, "genres": ["Biography"], "title": "في صالون العقاد كانت لنا أيام", "description": ["ليس هذا عملا أدبيا فلسفيا تاريخيا دينيا شخصيا فقط، وإنما هو جيل.. عصر.. دنيا الأديب الكبير أنيس منصور الحائز على جائزة الدولة التشجيعية سنة 1963 وجائزة الدول التقديرية سنة 1982 .. وفي هذه الدنيا كل ملامح الجيل ، وعذاب العصر وحيوية التاريخ ، وروعة الفلسفة وحرارة الدين .. ثم هذا الضياع الذي عاشه أنيس منصور هو وجيله من الشبان.. وكان الأستاذ عباس العقاد هو العملاق والمثل الأعل", "ليس هذا عملا أدبيا فلسفيا تاريخيا دينيا شخصيا فقط، وإنما هو جيل.. عصر.. دنيا الأديب الكبير أنيس منصور الحائز على جائزة الدولة التشجيعية سنة 1963 وجائزة الدول التقديرية سنة 1982 .. وفي هذه الدنيا كل ملامح الجيل ، وعذاب العصر وحيوية التاريخ ، وروعة الفلسفة وحرارة الدين .. ثم هذا الضياع الذي عاشه أنيس منصور هو وجيله من الشبان.. وكان الأستاذ عباس العقاد هو العملاق والمثل الأعلى.. الهدف والطريق ... البداية والنهاية . أو كان البداية وكان قيب النهاية فيد التقى به وسمعه وبكى عليه وتحيرت قدماه بين كل عباقرة العصر الأحياء والأموات.. * ففي صالون العقاد احتشدت كل العقول والأذواق والضمائر وكل الحديد والنار والقلق والعذاب والأبهة والكبرياء وكل المعارك بين المبادئ والقيم.. * ولكن كاتبنا الكبير أنيس منصور، الذي أصدر سبعين كتابا خرج سالما غانما وفي يده هذا الذي بين يديك : متاب من أروع الكتب التى صدرت فيا لخمسين عاما الماضية في عالمنا العربي .. إنه صالون العقاد بقلم انيس منصور أو صالون أنيس منصور على ضوء العقاد أو هو العقاد من اختراع أنيس منصور. أيا اخترت من هذه المعاني فإن متعتك مضمونة .. وهى متعه لا نهاية لجمالها وعمقها مع كتاب العام وكل عام!"], "author": "أنيس منصور", "num_pages": "667", "awards": [], "places": ["Cairo"], "character_names": ["Dante Alighieri", "أم كلثوم", "عباس محمود العقاد", "كامل الشناوي"], "language": "Arabic", "publish_date": "2005-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18114449-an-unnecessary-woman", "num_ratings": "8,551", "num_reviews": "1,466", "avg_ratings": 3.81, "genres": ["Fiction", "Writing", "Books About Books", "Literary Fiction", "Cultural", "Lebanon", "Contemporary"], "title": "An Unnecessary Woman", "description": ["One of Beirut’s most celebrated voices, Rabih Alameddine follows his international bestseller, ", ", with a heartrending novel that celebrates the singular life of an obsessive introvert, revealing Beirut’s beauties and horrors along the way.", "Aaliya Sohbi lives alone in her Beirut apartment, surrounded by stockpiles of books. Godless, fatherless, divorced, and child", "One of Beirut’s most celebrated voices, Rabih Alameddine follows his international bestseller, ", ", with a heartrending novel that celebrates the singular life of an obsessive introvert, revealing Beirut’s beauties and horrors along the way.", "Aaliya Sohbi lives alone in her Beirut apartment, surrounded by stockpiles of books. Godless, fatherless, divorced, and childless, Aaliya is her family’s \"unnecessary appendage.” Every year, she translates a new favorite book into Arabic, then stows it away. The thirty-seven books that Aaliya has translated have never been read—by anyone. After overhearing her neighbors, \"the three witches,” discussing her too-white hair, Aaliya accidentally dyes her hair too blue.", "In this breathtaking portrait of a reclusive woman’s late-life crisis, readers follow Aaliya’s digressive mind as it ricochets across visions of past and present Beirut. Insightful musings on literature, philosophy, and art are invaded by memories of the Lebanese Civil War and Aaliya’s volatile past. As she tries to overcome her aging body and spontaneous emotional upwellings, Aaliya is faced with an unthinkable disaster that threatens to shatter the little life she has left.", "A love letter to literature and its power to define who we are, the gifted Rabih Alameddine has given us a nuanced rendering of a single woman's reclusive life in the Middle East."], "author": "Rabih Alameddine", "num_pages": "291", "awards": ["California Book Award for Fiction (Gold) (2014)", "Prix Femina for Étranger (2016)", "Arab American Book Award for Fiction (2015)", "PEN Open Book Award Nominee for Shortlist (2015)", "National Book Critics Circle Award Nominee for Fiction (2014)", "National Book Award Finalist for Fiction (2014)"], "places": ["Beirut"], "character_names": [], "language": "English", "publish_date": "2014-02-04 00:00:00", "ISBN": "0802122140"},
{"url": "https://www.goodreads.com/book/show/98920.The_Bastard_of_Istanbul", "num_ratings": "25,926", "num_reviews": "3,101", "avg_ratings": 3.8, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "Asian Literature", "Turkish Literature"], "title": "The Bastard of Istanbul", "description": ["From one of Turkey’s most acclaimed and outspoken writers, a novel about the tangled histories of two families.", "In her second novel written in English, Elif Shafak confronts her country’s violent past in a vivid and colorful tale set in both Turkey and the United States. At its center is the “bastard” of the title, Asya, a nineteen-year-old woman who loves Johnny Cash and t", "From one of Turkey’s most acclaimed and outspoken writers, a novel about the tangled histories of two families.", "In her second novel written in English, Elif Shafak confronts her country’s violent past in a vivid and colorful tale set in both Turkey and the United States. At its center is the “bastard” of the title, Asya, a nineteen-year-old woman who loves Johnny Cash and the French Existentialists, and the four sisters of the Kazanci family who all live together in an extended household in Istanbul: Zehila, the zestful, headstrong youngest sister who runs a tattoo parlor and is Asya’s mother; Banu, who has newly discovered herself as a clairvoyant; Cevriye, a widowed high school teacher; and Feride, a hypochondriac obsessed with impending disaster. Their one estranged brother lives in Arizona with his wife and her Armenian daughter, Armanoush. When Armanoush secretly flies to Istanbul in search of her identity, she finds the Kazanci sisters and becomes fast friends with Asya. A secret is uncovered that links the two families and ties them to the 1915 Armenian deportations and massacres. Full of vigorous, unforgettable female characters, The Bastard of Istanbul is a bold, powerful tale that will confirm Shafak as a rising star of international fiction."], "author": "Elif Shafak", "num_pages": "368", "awards": ["Orange Prize Nominee for Longlist (2008)"], "places": [], "character_names": ["Asya", "Armanoush"], "language": "English", "publish_date": "2007-01-18 00:00:00", "ISBN": "0670038342"},
{"url": "https://www.goodreads.com/book/show/3692091-1-4", "num_ratings": "17,386", "num_reviews": "1,931", "avg_ratings": 4.01, "genres": ["Novels"], "title": "1/4 جرام", "description": ["رواية \"ربع جرام\" من الأدب الاجتماعى الذى يتخلل –بعمق- ذلك النسيج المجتمعى للفترة التى تمثلها الرواية , وتتبنى مشكلة إدمان المخدرات باعتبارها ظاهرة حياتية من أهم المشكلات التى تعانى منها كافة المجتمعات الإنسانية وترسم طريق الحل والخلاص ولا يأتى ذلك فى سياق موعظة وحكمة مباشرة, وإنما من خلال لغة أدبية رشيقة ,ترسم أدق المشاعر وأكثرها خصوصية وتحس بأن شخوصها أناس يحيون بيننا, نت", "رواية \"ربع جرام\" من الأدب الاجتماعى الذى يتخلل –بعمق- ذلك النسيج المجتمعى للفترة التى تمثلها الرواية , وتتبنى مشكلة إدمان المخدرات باعتبارها ظاهرة حياتية من أهم المشكلات التى تعانى منها كافة المجتمعات الإنسانية وترسم طريق الحل والخلاص ولا يأتى ذلك فى سياق موعظة وحكمة مباشرة, وإنما من خلال لغة أدبية رشيقة ,ترسم أدق المشاعر وأكثرها خصوصية وتحس بأن شخوصها أناس يحيون بيننا, نتعاطف معهم ونحاسبهم ونحاول أن نصل بهم إلى بر الأمان"], "author": "Essam Youssef", "num_pages": "644", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6219415", "num_ratings": "7,333", "num_reviews": "1,505", "avg_ratings": 4.43, "genres": ["Novels"], "title": "زمن الخيول البيضاء", "description": ["متزامنة مع الذكرى الستين لاحتلال فلسطين, تصدر (زمن الخيول البيضاء) رواية ملحمية استثنائية يتوج بها الشاعر والروائي إبراهيم نصرالله مشروعه الروائي الكبير ( الملهاة الفلسطينية ) الذي بدأ العمل عليه منذ عام 1985 , و الذي صدر منه ست روايات لكل رواية أجواؤها الخاصة بهاو شخوصها و بناؤها الفني و استقلالها عن الروايات الأخرى", "يتأمل نصرالله في هذا المشروع 125 عاما من تاريخ الشعب الفل", "متزامنة مع الذكرى الستين لاحتلال فلسطين, تصدر (زمن الخيول البيضاء) رواية ملحمية استثنائية يتوج بها الشاعر والروائي إبراهيم نصرالله مشروعه الروائي الكبير ( الملهاة الفلسطينية ) الذي بدأ العمل عليه منذ عام 1985 , و الذي صدر منه ست روايات لكل رواية أجواؤها الخاصة بهاو شخوصها و بناؤها الفني و استقلالها عن الروايات الأخرى", "يتأمل نصرالله في هذا المشروع 125 عاما من تاريخ الشعب الفلسطيني برؤية نقدية عميقة و مستويات فنية راقية , انطلاقا من تلك الحقيقة الراسخة التي عمل عليها دائما و التي تقول بأن إيماننا بالقضايا الكبيرة يحتم علينا إيجاد مستويات فنية عالية للتعبير عنها"], "author": "Ibrahim Nasrallah", "num_pages": "511", "awards": ["الجائزة العالمية للرواية العربية (أي باف) / International Prize for Arabic Fiction (IPAF) Nominee (2009)", "Palestine Book Awards Nominee for Shortlist (2014)"], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2007-08-16 00:00:00", "ISBN": "9953361843"},
{"url": "https://www.goodreads.com/book/show/641983.The_Sinners", "num_ratings": "3,285", "num_reviews": "213", "avg_ratings": 3.98, "genres": ["Novels"], "title": "The Sinners", "description": ["The Sinners, a novel by the contemporary Egyptian writer Yusuf Idris, focuses on the discovery of a baby's corpse. An intense desire to bring the killer to justice arouses the local peasants, and gives them the excuse to pry into the lives of the entire community. The primary suspects are a group of indigent migrant workers, and the question of their guilt or innocence soo", "The Sinners, a novel by the contemporary Egyptian writer Yusuf Idris, focuses on the discovery of a baby's corpse. An intense desire to bring the killer to justice arouses the local peasants, and gives them the excuse to pry into the lives of the entire community. The primary suspects are a group of indigent migrant workers, and the question of their guilt or innocence soon reveals other kinds of truths. The best-known novel of one of Egypt's leading writers, The Sinners is an evocative account of life in pre-revolutionary Egypt, taking a hard look at the social mores and taboos of peasant society."], "author": "Yusuf Idris", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-01-01 00:00:00", "ISBN": "0894103946"},
{"url": "https://www.goodreads.com/book/show/657196.Diary_of_a_Country_Prosecutor", "num_ratings": "6,877", "num_reviews": "704", "avg_ratings": 3.9, "genres": ["Novels"], "title": "Diary of a Country Prosecutor", "description": ["Who shot Kamar al-Dawla Alwan? Was it a crime of passion? What was the role of the beautiful peasant girl Rim? Is the mysterious Sheikh Asfur as crazy as he seems?", " is an Egyptian comedy of errors. Partly autobiographical, it is written as the journal of a young public prosecutor posted to a village in rural Egypt. Imbued with the ideals of a Eu", "Who shot Kamar al-Dawla Alwan? Was it a crime of passion? What was the role of the beautiful peasant girl Rim? Is the mysterious Sheikh Asfur as crazy as he seems?", " is an Egyptian comedy of errors. Partly autobiographical, it is written as the journal of a young public prosecutor posted to a village in rural Egypt. Imbued with the ideals of a European education, he encounters a world of poverty and backwardness where an imported legal system is both alien and incomprehensible.", " was born in Alexandria in 1898 and studied law in Paris. He worked as a public prosecutor in a provincial Egyptian town before becoming the Arab world’s leading dramatist, as well as a major short-story writer and man of letters. He died in 1987."], "author": "Tawfiq Al-Hakim", "num_pages": "135", "awards": [], "places": ["Egypt"], "character_names": ["توفيق الحكيم", "قمر الدولة علوان", "الشيخ عصفور", "ريم"], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0863565492"},
{"url": "https://www.goodreads.com/book/show/407942.I_The_Divine", "num_ratings": "889", "num_reviews": "119", "avg_ratings": 4.03, "genres": ["Fiction", "Cultural", "Lebanon", "Novels", "Literary Fiction", "Contemporary", "Adult", "United States", "War", "Cultural", "Literature"], "title": "I, The Divine: A Novel in First Chapters", "description": ["Raised in a hybrid family shaped by divorce and remarriage, and by Beirut in wartime, Sarah finds a fragile peace in self-imposed exile in the United States. Her extraordinary dignity is supported by a best friend, a grown-up son, occasional sensual pleasures, and her determination to tell her own story."], "author": "Rabih Alameddine", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-17 00:00:00", "ISBN": "0393323560"},
{"url": "https://www.goodreads.com/book/show/2774912-the-hakawati", "num_ratings": "3,233", "num_reviews": "486", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Lebanon", "Magical Realism", "Fantasy"], "title": "The Hakawati", "description": ["An inventive, exuberant novel that takes us from the shimmering dunes of ancient Egypt to the war-torn streets of twenty-first-century Lebanon.", "In 2003, Osama al-Kharrat returns to Beirut after many years in America to stand vigil at his father’s deathbed. The city is a shell of the Beirut Osama remembers, but he and his friends and family take solace in the things that hav", "An inventive, exuberant novel that takes us from the shimmering dunes of ancient Egypt to the war-torn streets of twenty-first-century Lebanon.", "In 2003, Osama al-Kharrat returns to Beirut after many years in America to stand vigil at his father’s deathbed. The city is a shell of the Beirut Osama remembers, but he and his friends and family take solace in the things that have always sustained them: gossip, laughter, and, above all, stories. ", "Osama’s grandfather was a hakawati, or storyteller, and his bewitching stories—of his arrival in Lebanon, an orphan of the Turkish wars, and of how he earned the name al-Kharrat, the fibster—are interwoven with classic tales of the Middle East, stunningly reimagined. Here are Abraham and Isaac; Ishmael, father of the Arab tribes; the ancient, fabled Fatima; and Baybars, the slave prince who vanquished the Crusaders. Here, too, are contemporary Lebanese whose stories tell a larger, heartbreaking tale of seemingly endless war—and of survival. ", "Like a true hakawati, Rabih Alameddine has given us an Arabian Nights for this century—a funny, captivating novel that enchants and dazzles from its very first lines: “Listen. Let me take you on a journey beyond imagining. Let me tell you a story.”"], "author": "Rabih Alameddine", "num_pages": "528", "awards": [], "places": [], "character_names": ["Baibars"], "language": "English", "publish_date": "2008-04-22 00:00:00", "ISBN": "0385664761"},
{"url": "https://www.goodreads.com/book/show/11693.The_White_Castle", "num_ratings": "9,457", "num_reviews": "700", "avg_ratings": 3.44, "genres": ["Fiction", "Historical", "Historical Fiction", "Asian Literature", "Turkish Literature", "Cultural", "Turkish", "Literature", "Novels"], "title": "The White Castle", "description": ["From a Turkish writer who has been compared with Borges, Nabokov, and DeLillo comes a dazzling novel that is at once a captivating work of historical fiction and a sinuous treatise on the enigma of identity and the relations between East and West. ", "In the 17th century, a young Italian scholar sailing from Venice to Naples is taken prisoner and delivered to Constantinople. T", "From a Turkish writer who has been compared with Borges, Nabokov, and DeLillo comes a dazzling novel that is at once a captivating work of historical fiction and a sinuous treatise on the enigma of identity and the relations between East and West. ", "In the 17th century, a young Italian scholar sailing from Venice to Naples is taken prisoner and delivered to Constantinople. There he falls into the custody of a scholar known as Hoja--\"master\"--a man who is his exact double. In the years that follow, the slave instructs his master in Western science and technology, from medicine to pyrotechnics. But Hoja wants to know more: why he and his captive are the persons they are and whether, given knowledge of each other's most intimate secrets, they could actually exchange identities. ", "Set in a world of magnificent scholarship and terrifying savagery, ", " is a colorful and intricately patterned triumph of the imagination."], "author": "Orhan Pamuk", "num_pages": "161", "awards": ["Independent Foreign Fiction Prize (1990)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-07-26 00:00:00", "ISBN": "0571164668"},
{"url": "https://www.goodreads.com/book/show/358627.Women_of_Sand_and_Myrrh", "num_ratings": "892", "num_reviews": "121", "avg_ratings": 3.23, "genres": ["Fiction", "Feminism", "Literature", "Womens"], "title": "Women of Sand and Myrrh", "description": ["A powerful and moving novel, by the Arab world's leading woman novelist, about four women coping with the insular, oppressive society of an unnamed desert state."], "author": "Hanan Al-Shaykh", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-07-01 00:00:00", "ISBN": "0385423586"},
{"url": "https://www.goodreads.com/book/show/131359.Death_on_the_Nile", "num_ratings": "85,904", "num_reviews": "2,941", "avg_ratings": 4.08, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Classics"], "title": "Death on the Nile", "description": ["The tranquillity of a cruise along the Nile is shattered by the discovery that Linnet Ridgeway has been shot through the head. She was young, stylish and beautiful, a girl who had everything - until she lost her life. Hercule Poirot recalls an earlier outburst by a fellow passenger: 'I'd like to put my dear little pistol against her head and just press the trigger.' Yet in", "The tranquillity of a cruise along the Nile is shattered by the discovery that Linnet Ridgeway has been shot through the head. She was young, stylish and beautiful, a girl who had everything - until she lost her life. Hercule Poirot recalls an earlier outburst by a fellow passenger: 'I'd like to put my dear little pistol against her head and just press the trigger.' Yet in this exotic setting, nothing is ever quite what it seems..."], "author": "Agatha Christie", "num_pages": "214", "awards": [], "places": ["Egypt"], "character_names": ["Colonel Race", "Simon  Doyle", "Hercule Poirot", "Linnet Ridgeway", "Jacqueline de Bellefort"], "language": "English", "publish_date": "1978-08-16 00:00:00", "ISBN": "0553119222"},
{"url": "https://www.goodreads.com/book/show/1333683.Love_In_Exile", "num_ratings": "5,601", "num_reviews": "681", "avg_ratings": 3.83, "genres": ["Novels"], "title": "Love In Exile", "description": ["In Love in Exile Bahaa Taher presents multilayered variations on the themes of exile, disillusionment, failed dreams, and the redemptive power of love. Unwilling to recant his Nasserist beliefs, the unnamed narrator is an Egyptian journalist in a self-imposed exile in Europe after conflict with the management of his newspaper and a divorce from his wife. Absorbed in intros", "In Love in Exile Bahaa Taher presents multilayered variations on the themes of exile, disillusionment, failed dreams, and the redemptive power of love. Unwilling to recant his Nasserist beliefs, the unnamed narrator is an Egyptian journalist in a self-imposed exile in Europe after conflict with the management of his newspaper and a divorce from his wife. Absorbed in introspection over his impotent position at the paper and in ill health, he suddenly finds himself faced with two issues he cannot ignore: the escalating tensions in Israeli-occupied Lebanon and, more personally, an unexpected love affair with a much younger Austrian woman, Brigitte. The narrator’s familial exile has left him a “long-distance father” facing the difficulties of raising children from whom he is rapidly growing distant. His son is drifting into fundamentalism while his daughter falls under the materialistic sway of the west. After struggling mightily to remain part of their lives, he finds himself marginalized and rejected. Brigitte, also an exile of sorts, encourages him to turn his back on the problems and pressures of the everyday world and cocoon himself in the warmth of their love. However, the horror of events surrounding the occupation of Lebanon in 1982 soon shocks them out of their contentment and safety."], "author": "Bahaa Taher", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-01 00:00:00", "ISBN": "977424902X"},
{"url": "https://www.goodreads.com/book/show/142395.Samarkand", "num_ratings": "16,227", "num_reviews": "1,319", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Literature", "Cultural", "France"], "title": "Samarkand", "description": ["Accused of mocking the inviolate codes of Islam, the Persian poet and sage Omar Khayyam fortuitously finds sympathy with the very man who is to judge his alleged crimes. Recognising genuis, the judge decides to spare him and gives him instead a small, blank book, encouraging him to confine his thoughts to it alone. Thus begins the seamless blend of fact and fiction that is", "Accused of mocking the inviolate codes of Islam, the Persian poet and sage Omar Khayyam fortuitously finds sympathy with the very man who is to judge his alleged crimes. Recognising genuis, the judge decides to spare him and gives him instead a small, blank book, encouraging him to confine his thoughts to it alone. Thus begins the seamless blend of fact and fiction that is ", ". Vividly re-creating the history of the manuscript of the Rubaiyaat of Omar Khayyam, Amin Maalouf spans continents and centuries with breathtaking vision: the dusky exoticism of 11th-century Persia, with its poetesses and assassins; the same country's struggles nine hundred years later, seen through the eyes of an American academic obsessed with finding the original manuscript; and the fated maiden voyage of the Titanic, whose tragedy led to the Rubaiyaat's final resting place - all are brought to life with keen assurance by this gifted and award-winning writer."], "author": "Amin Maalouf", "num_pages": "304", "awards": ["Prix Maison de la Presse for Roman (1988)"], "places": ["Persia", "Samarkand"], "character_names": [], "language": "English", "publish_date": "2003-09-01 00:00:00", "ISBN": "1566562937"},
{"url": "https://www.goodreads.com/book/show/18625722-the-ankhs", "num_ratings": "72", "num_reviews": "24", "avg_ratings": 4.61, "genres": ["Fiction", "Novella"], "title": "The Ankhs: Red Marks The Child (The Ankhs, #1)", "description": ["Red marks the child of an ancient prophecy.", "The ancient Egyptian gods were neither gods nor Men. Read the truth, as revealed to you by the words of a modern day descendent. ", "In an ancient world, Mankind discovers that we are not alone..", "\"A sheltered one, an ancient prophecy, and the discovery of a well kept secret..\""], "author": "Amira Awaad", "num_pages": "102", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1220507._", "num_ratings": "19,545", "num_reviews": "1,751", "avg_ratings": 3.41, "genres": ["Novels", "Fiction"], "title": "شيكاجو", "description": ["يقول الأستاذ جلال أمين عن هذه الرواية المتميزة: ها هى رواية علاء الأسوانى الجديدة «شيكاجو» تستحق بدورها نجاحًا مماثلاً وبنفس القدر من الجدارة كالذى استحقته عمارة يعقوبيان. فرحت عند انتهائى من قراءتها لأكثر من سبب، فقد أكدت لى هذه القراءة أن لدينا بالفعل أديبًا كبيرًا وموهوبًا، وظهر أن عمارة يعقوبيان ليست ظاهرة منفردة لا تتكرر، بل إن من الممكن أن تتكرر المرة بعد المرة. فى ا", "يقول الأستاذ جلال أمين عن هذه الرواية المتميزة: ها هى رواية علاء الأسوانى الجديدة «شيكاجو» تستحق بدورها نجاحًا مماثلاً وبنفس القدر من الجدارة كالذى استحقته عمارة يعقوبيان. فرحت عند انتهائى من قراءتها لأكثر من سبب، فقد أكدت لى هذه القراءة أن لدينا بالفعل أديبًا كبيرًا وموهوبًا، وظهر أن عمارة يعقوبيان ليست ظاهرة منفردة لا تتكرر، بل إن من الممكن أن تتكرر المرة بعد المرة. فى الرواية الجديدة (شيكاجو) كل مزايا الرواية السابقة: التشويق الذى يبدأ من أول صفحة ويستمر إلى آخر صفحة، أسلوب الكتابة السلس والسريع الذى يصيب الهدف باستمرار بلا تثاقل أو تسكع، الرسم الواضح والمتسق للشخصيات، اللغة العربية الراقية دون تكلف أو تعمد الإغراب، وقبل كل شيء وفوق كل شيء، نُبل المعني، إذ لا جدوى فى رأيى من رواية مهما كانت درجة تشويقها وإتقانها إذا لم تكن نبيلة المقصد، وإذا كان المقصد تافهًا أو حقيرًا قضى على ما قد يكون للمهارة والشطارة من أثر فى نفس القارئ"], "author": "Alaa Al Aswany", "num_pages": "456", "awards": [], "places": ["Chicago, Illinois", "University of Illinois, Chicago, Illinois"], "character_names": [], "language": "Arabic", "publish_date": "2007-02-01 00:00:00", "ISBN": "9770919403"},
{"url": "https://www.goodreads.com/book/show/1088137.The_Arabian_Nights", "num_ratings": "65,577", "num_reviews": "2,009", "avg_ratings": 4.05, "genres": ["Classics", "Fiction", "Fantasy", "Short Stories", "Literature", "Fantasy", "Fairy Tales", "Fantasy", "Mythology", "Adventure", "Folklore", "Childrens"], "title": "The Arabian Nights: Tales from a Thousand and One Nights", "description": ["Full of mischief, valor, ribaldry, and romance, ", " has enthralled readers for centuries. These are the tales that saved the life of Shahrazad, whose husband, the king, executed each of his wives after a single night of marriage. Beginning an enchanting story each evening, Shahrazad always withheld the ending: A thousand and one nights later, her life was sp", "Full of mischief, valor, ribaldry, and romance, ", " has enthralled readers for centuries. These are the tales that saved the life of Shahrazad, whose husband, the king, executed each of his wives after a single night of marriage. Beginning an enchanting story each evening, Shahrazad always withheld the ending: A thousand and one nights later, her life was spared forever. ", "This volume reproduces the 1932 Modern Library edition, for which Bennett A. Cerf chose the most famous and representative stories from Sir Richard F. Burton's multivolume translation, and includes Burton's extensive and acclaimed explanatory notes. These tales, including Alaeddin; or, the Wonderful Lamp, Sinbad the Seaman and Sinbad the Landsman, and Ali Baba and the Forty Thieves, have entered into the popular imagination, demonstrating that Shahrazad's spell remains unbroken."], "author": "Anonymous", "num_pages": "912", "awards": [], "places": [], "character_names": ["Dunyazad", "Shahryar", "Shah Zaman", "Aladdin", "Ali Baba", "Ali Baba", "Aladdin", "Caliph Haroun Al-Raschid", "Syed Nouman", "Cogia Hassan", "Ali Baba", "Aladdin", "Sinbad"], "language": "English", "publish_date": "2001-04-10 00:00:00", "ISBN": "0375756752"},
{"url": "https://www.goodreads.com/book/show/153496.Leo_Africanus", "num_ratings": "8,441", "num_reviews": "739", "avg_ratings": 4.18, "genres": ["Historical", "Historical Fiction", "Fiction", "Novels", "Cultural", "Africa"], "title": "Leo Africanus", "description": ["\"Leo Africanus is a beautiful book of tales about people who are forced to accept choices made for them by someone else...It relates, petically at times and often imaginatively, the story of those who did not make it to the New World.\"--New York Times Book Review"], "author": "Amin Maalouf", "num_pages": "370", "awards": ["Prix de l’Amitié franco-arabe (1986)"], "places": ["Granada", "Fes", "Timbuktu", "Cairo", "Mecca", "Istanbul", "Rome: Papal States", "Tunis"], "character_names": [], "language": "English", "publish_date": "1998-03-25 00:00:00", "ISBN": "1561310220"},
{"url": "https://www.goodreads.com/book/show/669780.Season_of_Migration_to_the_North", "num_ratings": "15,293", "num_reviews": "1,931", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Northern Africa", "Sudan", "Literature"], "title": "Season of Migration to the North", "description": ["After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into", "After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into his confidence, telling him the story of his own years in London, of his brilliant career as an economist, and of the series of fraught and deadly relationships with European women that led to a terrible public reckoning and his return to his native land.", "But what is the meaning of Mustafa’s shocking confession? Mustafa disappears without explanation, leaving the young man—whom he has asked to look after his wife—in an unsettled and violent no-man’s-land between Europe and Africa, tradition and innovation, holiness and defilement, and man and woman, from which no one will escape unaltered or unharmed.", "Season of Migration to the North is a rich and sensual work of deep honesty and incandescent lyricism. In 2001 it was selected by a panel of Arab writers and critics as the most important Arab novel of the twentieth century."], "author": "Tayeb Salih", "num_pages": "176", "awards": [], "places": ["North Africa"], "character_names": [], "language": "English", "publish_date": "1970-01-01 00:00:00", "ISBN": "0435900668"},
{"url": "https://www.goodreads.com/book/show/3243517", "num_ratings": "11,667", "num_reviews": "2,170", "avg_ratings": 4.15, "genres": ["Nonfiction"], "title": "رأيت رام الله", "description": ["\"رأيت رام الله\" كتاب فاز بجائزة نجيب محفوظ للإبداع الأدبي (1997) هل هي رام الله سرّ الإبداع المحقق!! أم أنها الثلاثون عاماً من الغربة أشعلت في القلب الحنين والاشتياق إلى ساكني رام الله!! أم أنه الوطن المحرم المنتظر على مشارف جسر العبور... جسر العودة ذاك الذي سكن في ذاكرة مريد البرغوثي بصرير خشبة، وبضيق مساحته وقصر طوله. هو ذاك الجسر القصير مشت عبره الذاكرة إلى ذاك الأفق ال", "\"رأيت رام الله\" كتاب فاز بجائزة نجيب محفوظ للإبداع الأدبي (1997) هل هي رام الله سرّ الإبداع المحقق!! أم أنها الثلاثون عاماً من الغربة أشعلت في القلب الحنين والاشتياق إلى ساكني رام الله!! أم أنه الوطن المحرم المنتظر على مشارف جسر العبور... جسر العودة ذاك الذي سكن في ذاكرة مريد البرغوثي بصرير خشبة، وبضيق مساحته وقصر طوله. هو ذاك الجسر القصير مشت عبره الذاكرة إلى ذاك الأفق الرحب المشبع برائحة الأهل والمترع بالصور القديمة الساكنة في الوجدان.", "مريد البرغوثي فاز بجائزة عبوره ذلك الجسر الخشبي الصغير وكأنه بتجاوزه تمكن من المثول أمام أيامه، وجعل أيامه تمثل أمامه، يلمس تفاصيل منها بلا سبب مهملاً منها تفاصيل أخرى بلا سبب، مثرثراً لنفسه عمراً كاملاً، في يوم عودته ومن حوله يحسبون أنه في صمت عبر الجسر المحرم عليه بعد ثلاثين عاماً، وفجأة انحنى ليلملم شتاته، كما يلمّ جهتي معطفه إلى بعضها في يوم من الصقيع والتلهف. أو كما يلملم تلميذ أوراقه التي بعثرها هواء الحقل وهو عائد من بعيد.", "وعلى مخدعه في تلك الليلة، ليلة العودة-لملم النهارات والليالي ذات الضحك، ذات الغضب، ذات الدموع، ذات العبث، وذات الشواهد الرخامية التي لا يكفيه عمر واحد لزيارتها جميعاً، من أجل تقديم الصمت والاحترام، وفي غمرة كل ذلك الروح شاحبة، والنفس ذابلة، وسؤال يقفز، ما الذي يسلب الروح ألوانها والنفس أنغامها؟!! وما الذي، غير قصف الغزاة أصاب الجسر؟. لملم مريد البرغوثي كل ذلك ليحكي في كتابه هذا رحلة عذاب فلسطين من خلال أسلوب قصصي شاعري رائع، جسد صدقه الإنساني المعذب والجميل."], "author": "Mourid Barghouti", "num_pages": "263", "awards": ["جائزة نجيب محفوظ للأدب (1997)"], "places": ["Egypt"], "character_names": [], "language": "Arabic", "publish_date": "2003-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7603.Reading_Lolita_in_Tehran", "num_ratings": "104,230", "num_reviews": "6,981", "avg_ratings": 3.59, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Reading Lolita in Tehran: A Memoir in Books", "author": "Azar Nafisi", "num_pages": "356", "awards": ["Book Sense Book of the Year Award for Adult Nonfiction (2004)", "Prix du Meilleur Livre Étranger for Essai (2004)"], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Azar Nafisi"], "language": "English", "publish_date": "2003-12-30 00:00:00", "ISBN": "081297106X"},
{"url": "https://www.goodreads.com/book/show/865.The_Alchemist", "num_ratings": "1,614,200", "num_reviews": "62,763", "avg_ratings": 3.84, "genres": ["Fiction", "Classics", "Fantasy", "Philosophy"], "title": "The Alchemist", "description": ["Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read t", "Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams."], "author": "Paulo Coelho", "num_pages": "197", "awards": ["NBDB National Book Award Nominee for Translation (2015)", "Grand Prix des lectrices de Elle for roman (1995)", "Premio Grinzane Cavour for Narrativa Straniera (1996)", "Corine Internationaler Buchpreis for Belletristik (2002)"], "places": ["Egypt", "Sahara Desert"], "character_names": ["Santiago", "Alchemist"], "language": "English", "publish_date": "1993-05-01 00:00:00", "ISBN": "0061122416"},
{"url": "https://www.goodreads.com/book/show/11691.Snow", "num_ratings": "33,045", "num_reviews": "3,183", "avg_ratings": 3.56, "genres": ["Fiction", "Literature", "Novels", "Contemporary"], "title": "Snow", "description": ["A spellbinding tale of disparate yearnings – for love, art, power, and God – set in a remote Turkish town, where stirrings of political Islamism threaten to unravel the secular order; by the winner of the 2006 Nobel Prize for Literature.", "From the acclaimed author of My Name Is Red comes a spellbinding tale of disparate yearnings–for love, art, power, and God–set in a remote", "A spellbinding tale of disparate yearnings – for love, art, power, and God – set in a remote Turkish town, where stirrings of political Islamism threaten to unravel the secular order; by the winner of the 2006 Nobel Prize for Literature.", "From the acclaimed author of My Name Is Red comes a spellbinding tale of disparate yearnings–for love, art, power, and God–set in a remote Turkish town, where stirrings of political Islamism threaten to unravel the secular order. ", "Following years of lonely political exile in Western Europe, Ka, a middle-aged poet, returns to Istanbul to attend his mother's funeral. Only partly recognizing this place of his cultured, middle-class youth, he is even more disoriented by news of strange events in the wider country: a wave of suicides among girls forbidden to wear their head scarves at school. An apparent thaw of his writer's curiosity–a frozen sea these many years–leads him to Kars, a far-off town near the Russian border and the epicenter of the suicides. ", "No sooner has he arrived, however, than we discover that Ka's motivations are not purely journalistic; for in Kars, once a province of Ottoman and then Russian glory, now a cultural gray-zone of poverty and paralysis, there is also Ipek, a radiant friend of Ka's youth, lately divorced, whom he has never forgotten. As a snowstorm, the fiercest in memory, descends on the town and seals it off from the modern, westernized world that has always been Ka's frame of reference, he finds himself drawn in unexpected directions: not only headlong toward the unknowable Ipek and the desperate hope for love–or at least a wife–that she embodies, but also into the maelstrom of a military coup staged to restrain the local Islamist radicals, and even toward God, whose existence Ka has never before allowed himself to contemplate. In this surreal confluence of emotion and spectacle, Ka begins to tap his dormant creative powers, producing poem after poem in untimely, irresistible bursts of inspiration. But not until the snows have melted and the political violence has run its bloody course will Ka discover the fate of his bid to seize a last chance for happiness. ", "Blending profound sympathy and mischievous wit, Snow illuminates the contradictions gripping the individual and collective heart in many parts of the Muslim world. But even more, by its narrative brilliance and comprehension of the needs and duties"], "author": "Orhan Pamuk", "num_pages": "463", "awards": ["Independent Foreign Fiction Prize Nominee for Shortlist (2005)", "Prix Médicis Etranger (2005)", "Prix Méditerranée Étranger (2006)", "Ein Buch für die Stadt (2006)"], "places": ["Kars"], "character_names": [], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0375706860"},
{"url": "https://www.goodreads.com/book/show/5500.Arabian_Nights_and_Days", "num_ratings": "5,078", "num_reviews": "701", "avg_ratings": 4.12, "genres": ["Fiction", "Fantasy", "Literature", "Novels"], "title": "Arabian Nights and Days", "description": ["A renowned Nobel Prize-winning novelist refashions the classic tales of Scheherazade in his own imaginative, spellbinding style. Here are genies and flying carpets, Aladdin and Sinbad, Ali Baba, and many other familiar stories, made new by the magical pen of the acknowledged dean of Arabic letters."], "author": "Naguib Mahfouz", "num_pages": "228", "awards": ["Laylā min layali alf layla"], "places": [], "character_names": [], "language": "English", "publish_date": "1995-08-16 00:00:00", "ISBN": "0385469012"},
{"url": "https://www.goodreads.com/book/show/5295735", "num_ratings": "11,248", "num_reviews": "1,384", "avg_ratings": 4.35, "genres": ["Novels", "Fiction"], "title": "الحرافيش", "description": ["ﻳﺼﻒ ﻟﻨﺎ ﻧﺠﻴﺐ ﻣﺤﻔﻮﻅ ﺳﻌﻲ ﺍﻟﻨﻔﺲ ﺍﻟﺒﺸﺮﻳﺔ ﺍﻟﺪﺍﺋﻢ ﺍﻟﻰ ﺍﻟﺨﻼﺹ ﻭﺗﻤﺮﺩﻫﺎ ﻋﻠﻰ ﻧﻔﺴﻬﺎ ﺍﻟﺘﻲ ﺍﺭﺗﻀﺖ ﺑﺎﻟﻮﺍﻗﻊ ﺍﻟﻤﺮﻳﺮ، ﻓﺘﺤﺜﻬﺎ ﺩﺍﺋﻤﺎ ﺍﻟﻰ ﺍﻟﺨﻼﺹ، ﻭﺍﻟﺨﺮﻭﺝ ﻣﻦ ﻧﻔﻖ ﺍﻟﻨﻔﺲ ﺍﻟﻤﻈﻠﻢ، ﻭﻟﻜﻨﻬﺎ ﺗﺼﻄﺪﻡ ﺩﺍﺋﻤﺎ ﺑﺤﺐ ﺍﻟﺪﻧﻴﺎ ﻭﺍﻏﻮﺍﺋﺎﺗﻬﺎ ﺍﻟﻼﻣﺤﺪﻭﺩﺓ ﻭﻫﻨﺎ ﻳﻜﻮﻥ ﻣﻔﺘﺮﻕ ﺍﻟﻄﺮﻕ ﺍﻟﺬﻱ ﺗﺨﺘﺎﺭ ﻓﻴﻪ ﺍﻟﻨﻔﺲ ﺍﻣﺎ ﺍﻟﺴﻴﺮ ﻋﻠﻰ ﺧﻄﻰ ﺍﻟﺼﺎﻟﺤﻴﻦ ﺍﻷﻭﺍﺋﻞ ﺃﻭ ﺍﻟﺤﻴﺎﺩ ﻋﻦ ﻃﺮﻳﻘﻬﻢ ﻭﺍﻳﺜﺎﺭ ﺷﻬﻮﺍﺗﻬﺎ ﺍﻟﺪﺍﺧﻠﻴﺔ، ﻛﻤﺎ ﻳﺼﻒ ﻟﻨﺎ ﺍﻟﺨﻨﻮﻉ ﻭﺍﻟﺬﻝ ﺍﻟﺬﻱ ﻳﺼﻴﺐ ﺍﻟﻨﻔﺲ ﻣﻦ ﺟﺮﺍﺀ ﻳ", "ﻳﺼﻒ ﻟﻨﺎ ﻧﺠﻴﺐ ﻣﺤﻔﻮﻅ ﺳﻌﻲ ﺍﻟﻨﻔﺲ ﺍﻟﺒﺸﺮﻳﺔ ﺍﻟﺪﺍﺋﻢ ﺍﻟﻰ ﺍﻟﺨﻼﺹ ﻭﺗﻤﺮﺩﻫﺎ ﻋﻠﻰ ﻧﻔﺴﻬﺎ ﺍﻟﺘﻲ ﺍﺭﺗﻀﺖ ﺑﺎﻟﻮﺍﻗﻊ ﺍﻟﻤﺮﻳﺮ، ﻓﺘﺤﺜﻬﺎ ﺩﺍﺋﻤﺎ ﺍﻟﻰ ﺍﻟﺨﻼﺹ، ﻭﺍﻟﺨﺮﻭﺝ ﻣﻦ ﻧﻔﻖ ﺍﻟﻨﻔﺲ ﺍﻟﻤﻈﻠﻢ، ﻭﻟﻜﻨﻬﺎ ﺗﺼﻄﺪﻡ ﺩﺍﺋﻤﺎ ﺑﺤﺐ ﺍﻟﺪﻧﻴﺎ ﻭﺍﻏﻮﺍﺋﺎﺗﻬﺎ ﺍﻟﻼﻣﺤﺪﻭﺩﺓ ﻭﻫﻨﺎ ﻳﻜﻮﻥ ﻣﻔﺘﺮﻕ ﺍﻟﻄﺮﻕ ﺍﻟﺬﻱ ﺗﺨﺘﺎﺭ ﻓﻴﻪ ﺍﻟﻨﻔﺲ ﺍﻣﺎ ﺍﻟﺴﻴﺮ ﻋﻠﻰ ﺧﻄﻰ ﺍﻟﺼﺎﻟﺤﻴﻦ ﺍﻷﻭﺍﺋﻞ ﺃﻭ ﺍﻟﺤﻴﺎﺩ ﻋﻦ ﻃﺮﻳﻘﻬﻢ ﻭﺍﻳﺜﺎﺭ ﺷﻬﻮﺍﺗﻬﺎ ﺍﻟﺪﺍﺧﻠﻴﺔ، ﻛﻤﺎ ﻳﺼﻒ ﻟﻨﺎ ﺍﻟﺨﻨﻮﻉ ﻭﺍﻟﺬﻝ ﺍﻟﺬﻱ ﻳﺼﻴﺐ ﺍﻟﻨﻔﺲ ﻣﻦ ﺟﺮﺍﺀ ﻳﺄﺳﻬﺎ ﻣﻦ ﺧﻼﺻﻬﺎ، ﻭﺟﻬﻠﻬﺎ ﺑﺄﻥ ﺍﻟﺨﻼﺹ ﺍﻟﺤﻘﻴﻘﻲ ﻫﻮ ﺍﻟﻨﺎﺑﻊ ﻣﻦ ﺩﺍﺧﻠﻬﺎ ﻻ ﺍﻟﻤﺴﻠﻂ ﻋﻠﻴﻬﺎ ﻣﻦ ﺍﻟﺨﺎﺭﺝ ﻓﻬﻮ ﺧﻼﺹ ﺯﺍﺋﻒ ﺳﺮﻋﺎﻥ ﻣﺎ ﻳﺘﺒﺨﺮ ﻭﻳﺬﻫﺐ ﺭﻳﺤﻪ ﻭﺗﺒﻘﻰ ﺍﻟﻨﻔﺲ ﻓﻲ ﻇﻠﻤﺎﺗﻬﺎ ﺗﺒﻜﻲ ﻋﻠﻰ ﻣﺎﺽ ﻗﺪ ﺗﻮﻟﻰ ﻭﺫﻛﺮﻳﺎﺕ ﻟﻦ ﺗﻌﻮﺩ. كل ذلك في ملحمة رائعة يظهر فيها تعاقب اﻷجيال على مدى قرنين من الزمان من خلال عشر قصص لطالما كانت نبعا للسينما المصرية تنهل منه."], "author": "Naguib Mahfouz", "num_pages": "599", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2006-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/762134.Palace_Walk", "num_ratings": "11,753", "num_reviews": "1,142", "avg_ratings": 4.15, "genres": ["Fiction", "Historical", "Historical Fiction", "Northern Africa", "Egypt", "Cultural", "Africa", "Novels"], "title": "Palace Walk", "description": ["Volume I of the masterful ", ". A national best-seller in both hardcover and paperback, it introduces the engrossing saga of a Muslim family in Cairo during Egypt's occupation by British forces in the early 1900s."], "author": "Naguib Mahfouz", "num_pages": "501", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1990-08-16 00:00:00", "ISBN": "0385264666"},
{"url": "https://www.goodreads.com/book/show/89821.The_Map_of_Love", "num_ratings": "5,102", "num_reviews": "771", "avg_ratings": 3.81, "genres": ["Fiction", "Historical", "Historical Fiction", "Northern Africa", "Egypt", "Novels", "Cultural", "Africa"], "title": "The Map of Love", "description": ["With her first novel, ", ", Ahdaf Soueif garnered comparisons to Tolstoy, Flaubert, and George Eliot.  In her latest novel, which was shortlisted for Britain's prestigious Booker Prize, she combines the romantic skill of the nineteenth-century novelists with a very modern sense of culture and politics--both sexual and international. ", "At either end of the tw", "With her first novel, ", ", Ahdaf Soueif garnered comparisons to Tolstoy, Flaubert, and George Eliot.  In her latest novel, which was shortlisted for Britain's prestigious Booker Prize, she combines the romantic skill of the nineteenth-century novelists with a very modern sense of culture and politics--both sexual and international. ", "At either end of the twentieth century, two women fall in love with men outside their familiar worlds. In 1901, Anna Winterbourne, recently widowed, leaves England for Egypt, an outpost of the Empire roiling with nationalist sentiment. Far from the comfort of the British colony, she finds herself enraptured by the real Egypt and in love with Sharif Pasha al-Baroudi. Nearly a hundred years later, Isabel Parkman, a divorced American journalist and descendant of Anna and Sharif has fallen in love with Omar al-Ghamrawi, a gifted and difficult Egyptian-American conductor with his own passionate politics. In an attempt to understand her conflicting emotions and to discover the truth behind her heritage, Isabel, too, travels to Egypt, and enlists Omar's sister's help in unravelling the story of Anna and Sharif's love.", "Joining the romance and intricate storytelling of A.S. Byatt's ", " and Michael Ondaatje's ", ", Ahdaf Soueif has once again created a mesmerizing tale of genuine eloquence and lasting importance."], "author": "Ahdaf Soueif", "num_pages": "529", "awards": ["Man Booker Prize Nominee (1999)"], "places": ["Egypt"], "character_names": [], "language": "English", "publish_date": "2000-09-12 00:00:00", "ISBN": "0385720114"},
{"url": "https://www.goodreads.com/book/show/128029.A_Thousand_Splendid_Suns", "num_ratings": "949,941", "num_reviews": "46,560", "avg_ratings": 4.35, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "A Thousand Splendid Suns", "description": [" is a breathtaking story set against the volatile events of Afghanistan's last thirty years—from the Soviet invasion to the reign of the Taliban to post-Taliban rebuilding—that puts the violence, fear, hope, and faith of this country in intimate, human terms. It is a tale of two generations of characters brought jarringly together by the tragic swee", " is a breathtaking story set against the volatile events of Afghanistan's last thirty years—from the Soviet invasion to the reign of the Taliban to post-Taliban rebuilding—that puts the violence, fear, hope, and faith of this country in intimate, human terms. It is a tale of two generations of characters brought jarringly together by the tragic sweep of war, where personal lives—the struggle to survive, raise a family, find happiness—are inextricable from the history playing out around them.", "Propelled by the same storytelling instinct that made ", " a beloved classic, ", " is at once a remarkable chronicle of three decades of Afghan history and a deeply moving account of family and friendship. It is a striking, heart-wrenching novel of an unforgiving time, an unlikely friendship, and an indestructible love—a stunning accomplishment."], "author": "Khaled Hosseini", "num_pages": "372", "awards": ["British Book Award for Best Read of the Year (2008)", "Book Sense Book of the Year Award for Adult Fiction (2008)", "California Book Award for Fiction (Silver) (2007)", "Exclusive Books Boeke Prize Nominee (2007)", "Lincoln Award Nominee (2011)"], "places": ["Afghanistan", "Kabul", "Herat"], "character_names": ["Laila", "Mariam", "Rasheed", "Tariq"], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "1594489505"},
{"url": "https://www.goodreads.com/book/show/77203.The_Kite_Runner", "num_ratings": "2,054,984", "num_reviews": "63,991", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "The Kite Runner", "description": ["Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amid", "Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amidst the increasing ethnic, religious, and political tensions of the dying years of the Afghan monarchy, wrenching them far apart. But so strong is the bond between the two boys that Amir journeys back to a distant world, to try to right past wrongs against the only true friend he ever had.", "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, ", " is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.", "A sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, ", " is an unusual and powerful novel that has become a beloved, one-of-a-kind classic."], "author": "Khaled Hosseini", "num_pages": "371", "awards": ["Borders Original Voices Award for Fiction (2003)", "Humo's Gouden Bladwijzer (2008)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Puddly Award for Fiction (2006)", "Lincoln Award Nominee (2006)", "Prix des libraires du Québec for Lauréats hors Québec (2006)"], "places": ["Kabul", "Fremont, California", "Afghanistan", "Peshawar"], "character_names": ["Amir", "Hassan", "Assef", "Bába", "Sohrab", "Soraya", "Rahim Khan"], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "1594480001"},
{"url": "https://www.goodreads.com/book/show/128711.The_Yacoubian_Building", "num_ratings": "15,691", "num_reviews": "1,336", "avg_ratings": 3.66, "genres": ["Fiction", "Northern Africa", "Egypt", "Novels", "Cultural", "Africa", "Literature", "Contemporary", "Historical", "Historical Fiction", "Book Club", "Religion", "Literary Fiction"], "title": "The Yacoubian Building", "description": ["All manner of flawed and fragile humanity reside in the Yacoubian Building, a once-elegant temple of Art Deco splendor now slowly decaying in the smog and bustle of downtown Cairo: a fading aristocrat and self-proc", "All manner of flawed and fragile humanity reside in the Yacoubian Building, a once-elegant temple of Art Deco splendor now slowly decaying in the smog and bustle of downtown Cairo: a fading aristocrat and self-proclaimed \"scientist of women\"; a sultry, voluptuous siren; a devout young student, feeling the irresistible pull toward fundamentalism; a newspaper editor helplessly in love with a policeman; a corrupt and corpulent politician, twisting the Koran to justify his desires.", "These disparate lives careen toward an explosive conclusion in Alaa Al Aswany's remarkable international bestseller. Teeming with frank sexuality and heartfelt compassion, this book is an important window on to the experience of loss and love in the Arab world."], "author": "Alaa Al Aswany", "num_pages": "256", "awards": ["Independent Foreign Fiction Prize Nominee for Longlist (2008)", "Premio Grinzane Cavour Nominee for Narrativa Straniera (2007)"], "places": ["Egypt", "Cairo"], "character_names": [], "language": "English", "publish_date": "2006-08-01 00:00:00", "ISBN": "0060878134"},
{"url": "https://www.goodreads.com/book/show/2517.My_Name_is_Red", "num_ratings": "37,082", "num_reviews": "3,367", "avg_ratings": 3.83, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Literature", "Novels"], "title": "My Name is Red", "description": ["At once a fiendishly devious mystery, a beguiling love story, and a brilliant symposium on the power of art, ", " is a transporting tale set amid the splendor and religious intrigue of sixteenth-century Istanbul, from one of the most prominent contemporary Turkish writers.", "The Sultan has commissioned a cadre of the most acclaimed artists in the land to create a gr", "At once a fiendishly devious mystery, a beguiling love story, and a brilliant symposium on the power of art, ", " is a transporting tale set amid the splendor and religious intrigue of sixteenth-century Istanbul, from one of the most prominent contemporary Turkish writers.", "The Sultan has commissioned a cadre of the most acclaimed artists in the land to create a great book celebrating the glories of his realm. Their task: to illuminate the work in the European style. But because figurative art can be deemed an affront to Islam, this commission is a dangerous proposition indeed. The ruling elite therefore mustn’t know the full scope or nature of the project, and panic erupts when one of the chosen miniaturists disappears. The only clue to the mystery–or crime? –lies in the half-finished illuminations themselves. Part fantasy and part philosophical puzzle, ", " is a kaleidoscopic journey to the intersection of art, religion, love, sex and power."], "author": "Orhan Pamuk", "num_pages": "417", "awards": ["Magnesia Litera for Translation (Litera za překladovou knihu) (2008)", "Prix du Meilleur Livre Étranger for Roman (2002)", "Premio Grinzane Cavour for Narrativa Straniera (2002)", "International DUBLIN Literary Award (2003)", "UBL Literary Award for Urdu Translation (2015)"], "places": ["Istanbul"], "character_names": ["Kara", "Şeküre", "Kelebek", "Zeytin", "Leylek", "Enişte"], "language": "English", "publish_date": "2002-08-27 00:00:00", "ISBN": "0375706852"},
{"url": "https://www.goodreads.com/book/show/3240691", "num_ratings": "11,493", "num_reviews": "1,417", "avg_ratings": 3.83, "genres": ["Novels"], "title": "واحة الغروب", "description": ["هذه الرواية حاصلة على الجائزة العالمية للرواية العربية 2008", "وقد طبع منها 3 طبعات خلال سنة", "يعود بهاء طاهر فى روايته الجديدة والبديعة «واحة الغروب» والتى لاقت نجاحا جماهيريا واستحسانا نقديا كبيرا، إلى نهايات القرن التاسع عشر، وبداية الاحتلال البريطانى لمصر.", "حيث يُرسل ضابط البوليس المصرى محمود عبدالظاهر، والذى كان يعيش حياة لاهية بين الحانات وبنات الليل، إلى واحة سيوة لشك السلطا", "هذه الرواية حاصلة على الجائزة العالمية للرواية العربية 2008", "وقد طبع منها 3 طبعات خلال سنة", "يعود بهاء طاهر فى روايته الجديدة والبديعة «واحة الغروب» والتى لاقت نجاحا جماهيريا واستحسانا نقديا كبيرا، إلى نهايات القرن التاسع عشر، وبداية الاحتلال البريطانى لمصر.", "حيث يُرسل ضابط البوليس المصرى محمود عبدالظاهر، والذى كان يعيش حياة لاهية بين الحانات وبنات الليل، إلى واحة سيوة لشك السلطات فى تعاطفه مع الأفكار الثورية لجمال الدين الأفغانى وأحمد عرابى.", "فيصطحب زوجته الأيرلندية «كاثرين» الشغوفة بالآثار، والتى تبحث عن مقبرة الإسكندر الأكبر، لينغمسا فى عالم جديد شديد الثراء والخصوصية يجبرهما وأهل الواحة على مواجهة أنفسهم فى زمن اختلطت فيه الانتهازية والخيانة والرغبة بالحب والبطولة.", "تعكس أحداث الرواية أيضا مزجا إبداعيا بين الماضى والحاضر وال.... والموضوعى والتاريخ والواقع يعبر عن هموم الوطن كما يقدم تجربة العلاقة بين الشرق والغرب على المستويين الإنسانى والحضارى بما فيها من صراع وتوافق"], "author": "بهاء طاهر", "num_pages": "325", "awards": ["Independent Foreign Fiction Prize Nominee for Longlist (2010)", "الجائزة العالمية للرواية العربية (أي باف) / International Prize for Arabic Fiction (IPAF) (2008)", "Saif Ghobash Banipal Prize Nominee for Arabic Literary Translation (2010)"], "places": ["Siwa", "Cairo", "Alexandria"], "character_names": ["Alexander the Great", "الضابط محمود عبد الظاهر", "كاثرين", "مليكة", "الشيخ يحيى", "فيونا"], "language": "Arabic", "publish_date": "2008-03-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5488.The_Cairo_Trilogy", "num_ratings": "3,258", "num_reviews": "247", "avg_ratings": 4.46, "genres": ["Fiction", "Northern Africa", "Egypt", "Historical", "Historical Fiction", "Classics", "Cultural", "Africa", "Literature"], "title": "The Cairo Trilogy: Palace Walk / Palace of Desire / Sugar Street", "description": ["Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patri", "Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patriarch Al-Sayyid Ahmad Abd al-Jawad, who rules his household with a strict hand while living a secret life of self-indulgence. ", " introduces us to his gentle, oppressed wife, Amina, his cloistered daughters, Aisha and Khadija, and his three sons–the tragic and idealistic Fahmy, the dissolute hedonist Yasin, and the soul-searching intellectual Kamal. Al-Sayyid Ahmad’s rebellious children struggle to move beyond his domination in ", ", as the world around them opens to the currents of modernity and political and domestic turmoil brought by the 1920s. ", " brings Mahfouz’s vivid tapestry of an evolving Egypt to a dramatic climax as the aging patriarch sees one grandson become a Communist, one a Muslim fundamentalist, and one the lover of a powerful politician.", "Throughout the trilogy, the family's trials mirror those of their turbulent country during the years spanning the two World Wars, as change comes to a society that has resisted it for centuries. Filled with compelling drama, earthy humor, and remarkable insight, ", " is the achievement of a master storyteller."], "author": "Naguib Mahfouz", "num_pages": "1313", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "2001-10-16 00:00:00", "ISBN": "0375413316"},
{"url": "https://www.goodreads.com/book/show/7568562-azazil", "num_ratings": "42,878", "num_reviews": "4,911", "avg_ratings": 4.06, "genres": ["Novels", "Fiction", "Historical", "Historical Fiction"], "title": "Azazil", "description": ["Azazil adalah buku laris fenomenal yang meraih The Arabic Booker Prize 2009, sebuah penghargaan bergengsi untuk novel yang terbit di Timur Tengah. Dalam novel ini, tokoh-tokoh historis yang disucikan oleh gereja berbaur dengan tokoh-tokoh rekaan, menjalin sebuah kisah yang menarik, kontroversial, dan bikin penasaran.", "Novel berlatar sejarah yang ditulis oleh seorang profesor", "Azazil adalah buku laris fenomenal yang meraih The Arabic Booker Prize 2009, sebuah penghargaan bergengsi untuk novel yang terbit di Timur Tengah. Dalam novel ini, tokoh-tokoh historis yang disucikan oleh gereja berbaur dengan tokoh-tokoh rekaan, menjalin sebuah kisah yang menarik, kontroversial, dan bikin penasaran.", "Novel berlatar sejarah yang ditulis oleh seorang profesor terkemuka ini mengisahkan autobiografi fiksional seorang rahib Mesir bernama Hypa yang hidup pada masa pergolakan iman Kristen di abad kelima Masehi. Saat itu terjadi pertentangan antara berbagai aliran gereja menyangkut konsep-konsep sakral, termasuk soal Trinitas dan ketuhanan Yesus, yang kemudian berpuncak pada serangkaian tragedi kekerasan yang mengatasnamakan Tuhan. ", "Novel kontroversial ini diwarnai pula oleh kisah cinta terlarang antara Hypa dengan dua wanita jelita: Oktavia yang penyembah berhala dan Martha sang penyanyi gereja. Adapun Azazil adalah raja iblis yang diusir Tuhan dari surga karena membangkang. Dalam kisah ini, Azazil yang licik menggoda Hypa untuk menuliskan rahasia kelam hidupnya serta pikiran-pikiran terlarangnya yang sesat menurut gereja."], "author": "Youssef Ziedan", "num_pages": "576", "awards": ["الجائزة العالمية للرواية العربية (أي باف) / International Prize for Arabic Fiction (IPAF) (2009)", "Saif Ghobash Banipal Prize for Arabic Literary Translation (2013)"], "places": [], "character_names": ["Hypa", "Martha", "Octavia"], "language": "Indonesian", "publish_date": "2010-01-02 00:00:00"}
]