[
{"url": "https://www.goodreads.com/book/show/16115612-and-the-mountains-echoed", "num_ratings": "252,342", "num_reviews": "25,452", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "And the Mountains Echoed", "description": ["So, then. You want a story and I will tell you one...Afghanistan, 1952. Abdullah and his sister Pari live with their father and stepmother in the small village of Shadbagh. Their father, Saboor, is constantly in search of work and they struggle together through poverty and brutal winters. To Abdullah, Pari - as beautiful and sweet-natured as the fairy for which she was nam", "So, then. You want a story and I will tell you one...Afghanistan, 1952. Abdullah and his sister Pari live with their father and stepmother in the small village of Shadbagh. Their father, Saboor, is constantly in search of work and they struggle together through poverty and brutal winters. To Abdullah, Pari - as beautiful and sweet-natured as the fairy for which she was named - is everything. More like a parent than a brother, Abdullah will do anything for her, even trading his only pair of shoes for a feather for her treasured collection. Each night they sleep together in their cot, their heads touching, their limbs tangled. One day the siblings journey across the desert to Kabul with their father. Pari and Abdullah have no sense of the fate that awaits them there, for the event which unfolds will tear their lives apart; sometimes a finger must be cut to save the hand. Crossing generations and continents, moving from Kabul, to Paris, to San Francisco, to the Greek island of Tinos, with profound wisdom, depth, insight and compassion, Khaled Hosseini writes about the bonds that define us and shape our lives, the ways in which we help our loved ones in need, how the choices we make resonate through history and how we are often surprised by the people closest to us."], "author": "Khaled Hosseini", "num_pages": "404", "awards": ["Andrew Carnegie Medal Nominee for Fiction (2014)", "Goodreads Choice Award for Fiction (2013)", "DSC Prize Nominee for South Asian Literature  for Longlist (2015)"], "places": ["Kabul", "California", "Paris", "Tinos"], "character_names": ["Julien", "Abdullah", "Pari", "Suleiman Wahdati", "Nila Wahdati", "Nabi", "Parwana", "Saboor", "Timur Bashiri", "Idris Bashiri", "Masooma", "Eric Lacombe", "Markos Varvaris", "Thalia"], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "159463176X"},
{"url": "https://www.goodreads.com/book/show/16065636-the-ghost-bride", "num_ratings": "15,420", "num_reviews": "2,667", "avg_ratings": 3.74, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Romance", "Fantasy", "Paranormal", "Historical", "Paranormal", "Ghosts", "Cultural", "China"], "title": "The Ghost Bride", "description": ["Though ruled by British overlords, the Chinese of colonial Malaya still cling to ancient customs. And in t", "Though ruled by British overlords, the Chinese of colonial Malaya still cling to ancient customs. And in the sleepy port town of Malacca, ghosts and superstitions abound.", "Li Lan, the daughter of a genteel but bankrupt family, has few prospects. But fate intervenes when she receives an unusual proposal from the wealthy and powerful Lim family. They want her to become a ghost bride for the family's only son, who recently died under mysterious circumstances. Rarely practiced, traditional ghost marriages are used to placate restless spirits. Such a union would guarantee Li Lan a home for the rest of her days, but at a terrible price.", "After an ominous visit to the opulent Lim mansion, Li Lan finds herself haunted not only by her ghostly would-be suitor, but also by her desire for the Lims' handsome new heir, Tian Bai. Night after night, she is drawn into the shadowy parallel world of the Chinese afterlife, with its ghost cities, paper funeral offerings, vengeful spirits, and monstrous bureaucracy—including the mysterious Er Lang, a charming but unpredictable guardian spirit. Li Lan must uncover the Lim family's darkest secrets—and the truth about her own family—before she is trapped in this ghostly world forever."], "author": "Yangsze Choo", "num_pages": "368", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2014)", "Shirley Jackson Award Nominee for Novel (Finalist) (2013)", "Goodreads Choice Award Nominee for Fantasy (2013)", "Carnegie Medal Nominee (2014)"], "places": ["Melaka"], "character_names": ["Li Lan", "Tian Bai", "Lim Tian Ching", "Yan Hong", "Er Lang"], "language": "English", "publish_date": "2013-08-06 00:00:00", "ISBN": "0062227386"},
{"url": "https://www.goodreads.com/book/show/16280051-claire-of-the-sea-light", "num_ratings": "8,101", "num_reviews": "1,122", "avg_ratings": 3.63, "genres": ["Fiction", "Literary Fiction", "Contemporary", "Adult Fiction"], "title": "Claire of the Sea Light", "description": ["A stunning work of fiction that brings us deep into the intertwined lives of a small seaside town where a little girl, the daughter of a fisherman, has gone missing.", "From the best-selling author of Brother, I'm Dying and The Dew Breaker: a stunning new work of fiction that brings us deep into the intertwined lives of a small seaside town where a little girl, the daughter of", "A stunning work of fiction that brings us deep into the intertwined lives of a small seaside town where a little girl, the daughter of a fisherman, has gone missing.", "From the best-selling author of Brother, I'm Dying and The Dew Breaker: a stunning new work of fiction that brings us deep into the intertwined lives of a small seaside town where a little girl, the daughter of a fisherman, has gone missing. ", "Claire Limyè Lanmè - Claire of the Sea Light - is an enchanting child born into love and tragedy in Ville Rose, Haiti. Claire's mother died in childbirth, and on each of her birthdays Claire is taken by her father, Nozias, to visit her mother's grave. Nozias wonders if he should give away his young daughter to a local shopkeeper, who lost a child of her own, so that Claire can have a better life. ", "But on the night of Claire's seventh birthday, when at last he makes the wrenching decision to do so, she disappears. As Nozias and others look for her, painful secrets, haunting memories, and startling truths are unearthed among the community of men and women whose individual stories connect to Claire, to her parents, and to the town itself. Told with piercing lyricism and the economy of a fable, Claire of the Sea Light is a tightly woven, breathtaking tapestry that explores what it means to be a parent, child, neighbor, lover, and friend, while revealing the mysterious bonds we share with the natural world and with one another. Embracing the magic and heartbreak of ordinary life, it is Edwidge Danticat's most spellbinding, astonishing book yet."], "author": "Edwidge Danticat", "num_pages": "238", "awards": ["Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-27 00:00:00", "ISBN": "030727179X"},
{"url": "https://www.goodreads.com/book/show/13707593-the-city-of-devi", "num_ratings": "863", "num_reviews": "167", "avg_ratings": 3.28, "genres": ["Fiction", "Cultural", "India", "Romance", "Lgbt", "Science Fiction", "Dystopia", "Science Fiction", "Contemporary"], "title": "The City of Devi", "description": ["Mumbai has emptied under the threat of imminent nuclear annihilation; gangs of marauding Hindu and Muslim thugs rove the desolate streets; yet Sarita can think of only one thing: buying the last pomegranate that remains in perhaps the e", "Mumbai has emptied under the threat of imminent nuclear annihilation; gangs of marauding Hindu and Muslim thugs rove the desolate streets; yet Sarita can think of only one thing: buying the last pomegranate that remains in perhaps the entire city. She is convinced that the fruit holds the key to reuniting her with her physicist husband, Karun, who has been mysteriously missing for more than a fortnight.", "Searching for his own lover in the midst of this turmoil is Jaz—cocky, handsome, and glib. \"The Jazter,\" as he calls himself, is Muslim, but his true religion has steadfastly been sex with men. Dodging danger at every step, both he and Sarita are inexorably drawn to Devi ma, the patron goddess who has reputedly appeared in person to save her city. What they find will alter their lives more fundamentally than any apocalypse to come.", "A wickedly comedic and fearlessly provocative portrayal of individuals balancing on the sharp edge of fate, ", " brilliantly upends assumptions of politics, religion, and sex, and offers a terrifying yet exuberant glimpse of the end of the world."], "author": "Manil Suri", "num_pages": "382", "awards": ["Bad Sex in Fiction Award (2013)", "Bisexual Book Award for Fiction (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-04 00:00:00", "ISBN": "0393088758"},
{"url": "https://www.goodreads.com/book/show/15957391-sunset-baby", "num_ratings": "40", "num_reviews": "5", "avg_ratings": 4.0, "genres": ["Plays", "Cultural", "African American"], "title": "Sunset Baby", "description": ["An energized, vibrant look at the point where the personal and political collide, from a rapidly rising star on the American playwriting scene. When a former Black Revolutionary and political prisoner decides to connect with his estranged daughter, he discovers that fatherhood might be the most challenging revolution of all."], "author": "Dominique Morisseau", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-26 00:00:00", "ISBN": "1849433879"},
{"url": "https://www.goodreads.com/book/show/15811539-white-dog-fell-from-the-sky", "num_ratings": "2,940", "num_reviews": "520", "avg_ratings": 4.02, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Southern Africa", "Botswana", "Southern Africa", "South Africa", "Literary Fiction"], "title": "White Dog Fell from the Sky", "description": [" Eleanor Morse’s rich and intimate portrait of Botswana, and of three people whose intertwined lives are at once tragic and remarkable, is an absorbing and deeply moving story.", " In apartheid South Africa in 1976, medical student Isaac Muthethe is forced to flee his", " Eleanor Morse’s rich and intimate portrait of Botswana, and of three people whose intertwined lives are at once tragic and remarkable, is an absorbing and deeply moving story.", " In apartheid South Africa in 1976, medical student Isaac Muthethe is forced to flee his country after witnessing a friend murdered by white members of the South African Defense Force. He is smuggled into Botswana, where he is hired as a gardener by a young American woman, Alice Mendelssohn, who has abandoned her Ph.D. studies to follow her husband to Africa. When Isaac goes missing and Alice goes searching for him, what she finds will change her life and inextricably bind her to this sunburned, beautiful land.", " Like the African terrain that Alice loves, Morse’s novel is alternately austere and lush, spare and lyrical. She is a writer of great and wide-ranging gifts."], "author": "Eleanor Morse", "num_pages": "368", "awards": [], "places": ["Africa"], "character_names": [], "language": "English", "publish_date": "2013-01-03 00:00:00", "ISBN": "0670026409"},
{"url": "https://www.goodreads.com/book/show/16082956-the-supremes-at-earl-s-all-you-can-eat", "num_ratings": "9,846", "num_reviews": "1,906", "avg_ratings": 3.95, "genres": ["Fiction", "Humor", "Historical", "Historical Fiction", "Audiobook", "Cultural", "African American"], "title": "The Supremes at Earl's All-You-Can-Eat", "description": ["Pull up a chair by the window table at Big Earl's diner and meet the 'Supremes': three women from Plainview, Indiana, who've been best friends since their high-school days in the Sixties. ", "There's Clarice, a pious wife and mother struggling with her husband's infidelity; Barbara Jean, who must confront the tragic reverberations of a youthful love affair; and Odette, whose f", "Pull up a chair by the window table at Big Earl's diner and meet the 'Supremes': three women from Plainview, Indiana, who've been best friends since their high-school days in the Sixties. ", "There's Clarice, a pious wife and mother struggling with her husband's infidelity; Barbara Jean, who must confront the tragic reverberations of a youthful love affair; and Odette, whose fearlessness has saved her friends many times, but who now faces a terrifying situation of her own. ", "Over iced tea and pecan pie, through forty years of marriage, children, happiness and the blues, the inseperable trio take on the world together. Come join them as they share the juiciest gossip, the occassional tear, and the most uproarious laughter...at the same time, at the same table, at Earl's All-You-Can-Eat."], "author": "Edward Kelsey Moore", "num_pages": "407", "awards": [], "places": ["Plainview, Indiana"], "character_names": ["Odette Henry", "Clarice Baker", "Barbara Jean Maxberry"], "language": "English", "publish_date": "2013-03-28 00:00:00", "ISBN": "1444758020"},
{"url": "https://www.goodreads.com/book/show/16130324-children-of-the-jacaranda-tree", "num_ratings": "2,531", "num_reviews": "486", "avg_ratings": 3.45, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Historical"], "title": "Children of the Jacaranda Tree", "description": ["A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. ", "We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of", "A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. ", "We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of a guard appear at the cell door one day and, simply, take her away. Omid, at age three, witnesses the arrests of his political activist parents from his perch at their kitchen table, yogurt dripping from his fingertips. More than twenty years after the violent, bloody purge that took place inside Tehran's prisons, Sheida learns that her father was one of those executed, that the silent void firmly planted between her and her mother all these years was not just the sad loss that comes with death, but the anguish and the horror of murder. ", "Neda, Omid, and Sheida are just three of the many unforgettable characters in Sahar Delijani's startling debut novel, Children of the Jacaranda Tree. Set in post-revolutionary Iran, from 1983 to 2011, it follows a group of mothers, fathers, children, and lovers, some connected by family, others brought together by the tide of history that forces its way into their lives. Finally, years later, it is the next generation that is left with the burden of the past and their country's tenuous future as a new wave of protest and political strife begins. ", "Based on the harrowing experiences of Delijani, her family, and friends, Children of the Jacaranda Tree is a moving, timely drama about three generations of men and women moved by love, inspired by poetry, and motivated by dreams of justice and freedom. For fans of The Kite Runner and In the Shadow of the Banyan, it is a stunningly evocative look at the intimate side of revolution and a brilliant tribute to anyone who has answered the call of history."], "author": "Sahar Delijani", "num_pages": "282", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-06-18 00:00:00", "ISBN": "1476709092"},
{"url": "https://www.goodreads.com/book/show/15944408-please-louise", "num_ratings": "250", "num_reviews": "57", "avg_ratings": 3.47, "genres": ["Childrens", "Picture Books", "Childrens", "Writing", "Books About Books"], "title": "Please, Louise", "description": ["A library card unlocks a new life for a young girl in this picture book about the power of imagination, from the Nobel Prize–winning author Toni Morrison.", "On one gray afternoon, Louise makes a fateful trip to the library. With the help of a new library card and through the transformative power of books, what started out as a dull day turns into one of surprises, ideas, and", "A library card unlocks a new life for a young girl in this picture book about the power of imagination, from the Nobel Prize–winning author Toni Morrison.", "On one gray afternoon, Louise makes a fateful trip to the library. With the help of a new library card and through the transformative power of books, what started out as a dull day turns into one of surprises, ideas, and fun, fun, fun!", "Inspired by Pulitzer Prize–winning author Toni Morrison’s experience working in a library as a young girl, this engaging picture book celebrates the wonders of reading, the enchanting capacity of the imagination, and, of course, the splendor of libraries."], "author": "Toni Morrison", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-04 00:00:00", "ISBN": "1416983384"},
{"url": "https://www.goodreads.com/book/show/16248295-maya-s-notebook", "num_ratings": "19,430", "num_reviews": "2,252", "avg_ratings": 3.81, "genres": ["Fiction", "Contemporary", "Young Adult"], "title": "Maya's Notebook: A Novel", "description": ["Neglected by her parents, nineteen-year-old Maya Nidal grows up in a rambling old house in Berkeley with her grandparents. Her grandmother, Nidia, affectionately known as Nini, is a force of nature--a woman whose formidable strength helped her build a new life after emigrating from Chile in 1973. Popo, Maya's grandfather, is an African American astronomer and professor--a", "Neglected by her parents, nineteen-year-old Maya Nidal grows up in a rambling old house in Berkeley with her grandparents. Her grandmother, Nidia, affectionately known as Nini, is a force of nature--a woman whose formidable strength helped her build a new life after emigrating from Chile in 1973. Popo, Maya's grandfather, is an African American astronomer and professor--a gentle man whose solid, comforting presence helps calm the turbulence of Maya's adolescence.", "When Popo dies of cancer, Maya goes completely off the rails. With her girlfriends Maya turns to drugs, alcohol, and petty crime, eventually bottoming out in Las Vegas. Lost in a dangerous underworld, she is caught in the crosshairs of warring forces--a gang of assassins, the police, the FBI, and Interpol. Her one chance for survival is Nini, who helps her escape to a -remote island off the coast of Chile. Here Maya tries to make sense of the past, unravels mysterious truths about life and her family, and embarks on her greatest adventure: the journey into her own soul."], "author": "Isabel Allende", "num_pages": "576", "awards": [], "places": [], "character_names": ["Maya Vidal"], "language": "English", "publish_date": "2013-04-23 00:00:00", "ISBN": "0062253778"},
{"url": "https://www.goodreads.com/book/show/15852479-we-need-new-names", "num_ratings": "14,827", "num_reviews": "2,013", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "We Need New Names", "description": ["An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by", "An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by paramilitary policemen, before the school closed, before the fathers left for dangerous jobs abroad.", "But Darling has a chance to escape: she has an aunt in America. She travels to this new land in search of America's famous abundance only to find that her options as an immigrant are perilously few. NoViolet Bulawayo's debut calls to mind the great storytellers of displacement and arrival who have come before her--from Junot Diaz to Zadie Smith to J.M. Coetzee--while she tells a vivid, raw story all her own."], "author": "NoViolet Bulawayo", "num_pages": "298", "awards": ["Man Booker Prize Nominee (2013)", "Guardian First Book Award Nominee (2013)", "PEN/Hemingway Foundation Award (2014)", "Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee (2015)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)", "Betty Trask Award (2014)"], "places": ["Tsholotsho", "Detroit, Michigan", "bulawayo"], "character_names": [], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "0316230812"},
{"url": "https://www.goodreads.com/book/show/15705011-the-last-runaway", "num_ratings": "26,226", "num_reviews": "3,618", "avg_ratings": 3.79, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Adult Fiction"], "title": "The Last Runaway", "description": ["In New York Times bestselling author Tracy Chevalier’s newest historical", "In New York Times bestselling author Tracy Chevalier’s newest historical saga, she introduces Honor Bright, a modest English Quaker who moves to Ohio in 1850, only to find herself alienated and alone in a strange land. Sick from the moment she leaves England, and fleeing personal disappointment, she is forced by family tragedy to rely on strangers in a harsh, unfamiliar landscape. ", "Nineteenth-century America is practical, precarious, and unsentimental, and scarred by the continuing injustice of slavery. In her new home Honor discovers that principles count for little, even within a religious community meant to be committed to human equality. ", "However, drawn into the clandestine activities of the Underground Railroad, a network helping runaway slaves escape to freedom, Honor befriends two surprising women who embody the remarkable power of defiance. Eventually she must decide if she too can act on what she believes in, whatever the personal costs. ", "A powerful journey brimming with color and drama, The Last Runaway is Tracy Chevalier’s vivid engagement with an iconic part of American history."], "author": "Tracy Chevalier", "num_pages": "305", "awards": [], "places": ["Faithwell, Ohio"], "character_names": ["Honor Bright Haymaker", "Donovan Mills", "Mrs. Reed", "Belle Mills", "Jack Haymaker"], "language": "English", "publish_date": "2013-01-08 00:00:00", "ISBN": "0525952993"},
{"url": "https://www.goodreads.com/book/show/13538652-see-now-then", "num_ratings": "857", "num_reviews": "221", "avg_ratings": 2.8, "genres": ["Fiction", "Abandoned", "Literary Fiction", "Cultural", "African American", "Family", "Novels"], "title": "See Now Then", "description": ["In ", ", the brilliant and evocative new novel from Jamaica Kincaid---her first in ten years---a marriage is revealed in all its joys and agonies. This piercing examination of the manifold ways in which the passing of time operates on the human consciousness unfolds g", "In ", ", the brilliant and evocative new novel from Jamaica Kincaid---her first in ten years---a marriage is revealed in all its joys and agonies. This piercing examination of the manifold ways in which the passing of time operates on the human consciousness unfolds gracefully, and Kincaid inhabits each of her characters, a mother and father and their two children living in a small village in New England, as they move, in their own minds, between the present, the past, and the future---for, as she writes, “the present will be a now then and the past is now then and the future will be a now then.”", "Her characters, constrained by the world, despair in their domestic situations. But their minds wander, trying to make linear sense of what is, in fact, nonlinear. ", " is Kincaid’s attempt to make clear what is unclear, and to make unclear what we assumed was clear: that is, the beginning, the middle, and the end.", "Since the publication of her first short-story collection, ", ", nominated for a PEN/Faulkner Award for fiction, Kincaid has demonstrated a unique talent for seeing beyond and through the surface of things. In ", ", she envelops the reader in a world that is both familiar and startling---creating her most emotionally and thematically daring work yet."], "author": "Jamaica Kincaid", "num_pages": "182", "awards": ["American Book Award (2014)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-05 00:00:00", "ISBN": "0374180563"},
{"url": "https://www.goodreads.com/book/show/15981687-little-green", "num_ratings": "2,367", "num_reviews": "409", "avg_ratings": 4.05, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Little Green: An Easy Rawlins Mystery", "description": ["When Walter Mosley burst onto the literary scene in 1990 with his first Easy Rawlins mystery, ", "—a combustible mixture of Raymond Chandler and Richard Wright—he captured the attention of hundreds of thousands of readers (including future president Bill Clinton). Eleven books later, Easy Rawlins is one of the few private eyes in contemporary crime fiction", "When Walter Mosley burst onto the literary scene in 1990 with his first Easy Rawlins mystery, ", "—a combustible mixture of Raymond Chandler and Richard Wright—he captured the attention of hundreds of thousands of readers (including future president Bill Clinton). Eleven books later, Easy Rawlins is one of the few private eyes in contemporary crime fiction who can be called iconic and immortal. In the incendiary and fast-paced ", ", he returns from the brink of death to investigate the dark side of L.A.’s 1960s hippie haven, the Sunset Strip.", "We last saw Easy in 2007’s ", ", fighting for his life after his car plunges over a cliff. True to form, the tough WWII veteran survives, and soon his murderous sidekick Mouse has him back cruising the mean streets of L.A., in all their psychedelic 1967 glory, to look for a young black man, Evander “Little Green” Noon, who disappeared during an acid trip. Fueled by an elixir called Gator’s Blood, brewed by the conjure woman Mama Jo, Easy experiences a physical, spiritual, and emotional resurrection, but peace and love soon give way to murder and mayhem. Written with Mosley’s signature grit and panache, this engrossing and atmospheric mystery is not only a trip back in time, it is also a tough-minded exploration of good and evil, and of the power of guilt and redemption. Once again, Easy asserts his reign over the City of (Fallen) Angels."], "author": "Walter Mosley", "num_pages": "291", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0385535988"},
{"url": "https://www.goodreads.com/book/show/4588.Extremely_Loud_and_Incredibly_Close", "num_ratings": "344,079", "num_reviews": "22,022", "avg_ratings": 3.97, "genres": ["Fiction", "Contemporary", "Historical", "Historical Fiction"], "title": "Extremely Loud and Incredibly Close", "description": ["Nine-year-old Oskar Schell is an inventor, amateur entomologist, Francophile, letter writer, pacifist, natural historian, percussionist, romantic, Great Explorer, jeweller, detective, vegan, and collector of butterflies. When his father is killed in the September 11th attacks on the World Trade Centre, Oskar sets out to solve the mystery of a key he discovers in his father", "Nine-year-old Oskar Schell is an inventor, amateur entomologist, Francophile, letter writer, pacifist, natural historian, percussionist, romantic, Great Explorer, jeweller, detective, vegan, and collector of butterflies. When his father is killed in the September 11th attacks on the World Trade Centre, Oskar sets out to solve the mystery of a key he discovers in his father's closet. It is a search which leads him into the lives of strangers, through the five boroughs of New York, into history, to the bombings of Dresden and Hiroshima, and on an inward journey which brings him ever closer to some kind of peace."], "author": "Jonathan Safran Foer", "num_pages": "326", "awards": ["Prix des libraires du Québec for Lauréats hors Québec (2007)", "Luisterboek Award (2009)"], "places": ["New York City, New York", "Dresden"], "character_names": ["Oskar Schell"], "language": "English", "publish_date": "2006-04-04 00:00:00", "ISBN": "0618711651"},
{"url": "https://www.goodreads.com/book/show/17336274-the-butterfly-lady", "num_ratings": "37", "num_reviews": "7", "avg_ratings": 4.3, "genres": ["Fiction", "Lgbt", "Travel", "Road Trip"], "title": "The Butterfly Lady", "description": ["Gabriel Smith is a black man in a dress. Always in full makeup, he ridicules, inspires, and entertains; he is both mother and father, pageant and relief.", "Tortured by his zealous father, Gabriel moves to Cleveland, Ohio, to start a new life. Soon, he learns that his presence, despite giving order to those closest to him, incites fear and hatred. As past and present collide,", "Gabriel Smith is a black man in a dress. Always in full makeup, he ridicules, inspires, and entertains; he is both mother and father, pageant and relief.", "Tortured by his zealous father, Gabriel moves to Cleveland, Ohio, to start a new life. Soon, he learns that his presence, despite giving order to those closest to him, incites fear and hatred. As past and present collide, Gabriel becomes the mirror that reflects the lives of the people surrounding him, the spectacle that isn’t as bad as the histories they want to escape completely.", "Set against the backdrop of a city recovering from one of the worst race riots in history, The Butterfly Lady is filled with pain encased in the blues. This stunning first novel wrestles with the horrors of love and the consequences of being black, gay, and male.", "\"In The Butterfly Lady, Hoey, clearly driven by love for his characters and a passion to understand their lives, weaves a cocoon of community. Fearless, in the tradition of Morrison, he looks under beds and throws open closet doors to present truth - drawing the reader in to the place where lives crash.\"", "- Anton Nimblett, author of Sections of an Orange", "\"The Butterfly Lady riffs from the page in bursts and twists, conflagrating image, sound, language and character in a literary mimicry of jazz ... Danny Hoey's confident prose takes the reader into the heart of Cleveland's inner-city where its inhabitants face sometimes unanswerable questions of sexuality, identity, and race.\"", "- Britta Coleman, author of Potter Springs, winner of the Lone Star Scribe Award", "\"Danny M. Hoey, Jr.'s The Butterfly Lady presents haunting characters that ask - demand - a great deal: Understand and embrace the complications and nuances of African-American identity. Arm yourself with these revelations. This is a terrific novel; devastating and hopeful because Hoey so unflinchingly educates the reader. He writes with the fierceness and truth of James Baldwin and has given us a story that lingers and informs long after the last sentence.\"", "- Dana Johnson, author of Elsewhere, California and Break Any Woman Down, winner of the Flannery O'Connor Award"], "author": "Danny M. Hoey Jr.", "num_pages": "171", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "1939675006"},
{"url": "https://www.goodreads.com/book/show/13330476-the-purchase", "num_ratings": "1,789", "num_reviews": "317", "avg_ratings": 3.39, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Canada", "Literary Fiction", "Historical"], "title": "The Purchase", "description": ["In 1798, Daniel Dickinson, a young Quaker father and widower, leaves his home in Pennsylvania to establish a new life. He sets out with two horses, a wagonful of belongings, his five children, a 15-year-old orphan wife, and a few land warrants for his future homestead. When Daniel suddenly trades a horse for a young slave, Onesimus, it sets in motion a struggle in his cons", "In 1798, Daniel Dickinson, a young Quaker father and widower, leaves his home in Pennsylvania to establish a new life. He sets out with two horses, a wagonful of belongings, his five children, a 15-year-old orphan wife, and a few land warrants for his future homestead. When Daniel suddenly trades a horse for a young slave, Onesimus, it sets in motion a struggle in his conscience that will taint his life forever, and sets in motion a chain of events that lead to two murders and the family's strange relationship with a runaway slave named Bett.", "Stripped down and as hard-edged as the realities of pioneer life, Spalding's writing is nothing short of stunning, as it instantly envelops the reader in the world and time of the novel, and follows the lives of unforgettable characters. Inspired by stories of the author's own ancestors, ", " is a resonant, powerful and timeless novel."], "author": "Linda Spalding", "num_pages": "368", "awards": ["Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (2012)", "Rogers Writers' Trust Fiction Prize Nominee (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-25 00:00:00", "ISBN": "0771079354"},
{"url": "https://www.goodreads.com/book/show/16130456-the-thirsty-earth", "num_ratings": "5", "num_reviews": "0", "avg_ratings": 2.4, "genres": ["Historical", "Historical Fiction"], "title": "The Thirsty Earth", "description": ["A twelve-year-old Caribbean boy wakes up to discover his grandmother, his only relative on the island, has died during the night. On his way into town to tell the authorities—and call his mother in", "A twelve-year-old Caribbean boy wakes up to discover his grandmother, his only relative on the island, has died during the night. On his way into town to tell the authorities—and call his mother in America—he becomes the lone witness of a police execution. Worse, when he calls his mother’s phone number, he gets a message saying the number has been disconnected. As he struggles to survive on his own, the boy finds himself holding secrets that could have devastating consequences—not only for his own survival, but the island’s as well. ", " is the first in a two-book series about the global struggle for human dignity."], "author": "David Valentine Bernard", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-08-13 00:00:00", "ISBN": "1593094612"},
{"url": "https://www.goodreads.com/book/show/16054679-supplying-salt-and-light", "num_ratings": "20", "num_reviews": "7", "avg_ratings": 4.3, "genres": ["Poetry"], "title": "Supplying Salt and Light", "description": ["This stunning new book of poems from internationally renowned poet Lorna Goodison opens in Spain and Portugal, conjuring up a new history of the Caribbean and a new way of setting up its heritage.", "     The title sets the tone for poems about backgrounds and outlines and shadows and sources of light. This extraordinary book -- \"a wide lotus on the dark waters of song\" -- is", "This stunning new book of poems from internationally renowned poet Lorna Goodison opens in Spain and Portugal, conjuring up a new history of the Caribbean and a new way of setting up its heritage.", "     The title sets the tone for poems about backgrounds and outlines and shadows and sources of light. This extraordinary book -- \"a wide lotus on the dark waters of song\" -- is filled with surprises at every turn, as a Moorish mosque becomes a cathedral in Seville, a country girl dresses in Sunday clothes to visit a Jamaican bookmobile, and a bear appears suddenly, only to slip away silently into the trees on a road in British Columbia. The heartache of Billy Holliday singing the blues, the burden of Charlie Chaplin tramping the banana walks of Jamaica's Golden Cloud, and the paintings of El Greco, the quintessential stranger, come together on the poet's pilgrimage to Heartease, guided by a limping angel and inspired by the passage-making of Dante; the book ends with a superb version of the first of his cantos, translated into the poet's Jamaican language and landscape with the gift of love."], "author": "Lorna Goodison", "num_pages": "82", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-03-26 00:00:00", "ISBN": "0771035918"},
{"url": "https://www.goodreads.com/book/show/16066961-the-slaves-gamble", "num_ratings": "25", "num_reviews": "9", "avg_ratings": 3.76, "genres": ["History", "North American Hi...", "American History", "Literature", "American", "Nonfiction"], "title": "The Slaves' Gamble: Choosing Sides in the War of 1812", "description": ["Images of American slavery conjure up cotton plantations and African American slaves locked in bondage until the Civil War. Yet early on in the nineteenth century the state of slavery was very different, and the political vicissitudes of the young nation offered diverse possibilities to slaves. In the century's first two decades, the nation waged war against Britain, Spain", "Images of American slavery conjure up cotton plantations and African American slaves locked in bondage until the Civil War. Yet early on in the nineteenth century the state of slavery was very different, and the political vicissitudes of the young nation offered diverse possibilities to slaves. In the century's first two decades, the nation waged war against Britain, Spain, and various Indian tribes. Slaves played a role in the military operations, and the different sides viewed them as a potential source of manpower. While surprising numbers did assist the Americans, the wars created opportunities for slaves to find freedom among the Redcoats, the Spaniards, or the Indians. Author Gene Smith draws on a decade of original research and his curatorial work at the Fort Worth Museum in this fascinating and original narrative history. The way the young nation responded sealed the fate of slaves for the next half century until the Civil War. This drama sheds light on an extraordinary yet little known chapter in the dark saga of American history."], "author": "Gene Allen Smith", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-01-22 00:00:00", "ISBN": "1137310081"},
{"url": "https://www.goodreads.com/book/show/16044977-after-the-dawn", "num_ratings": "231", "num_reviews": "32", "avg_ratings": 4.25, "genres": ["Romance", "Romance", "African American Romance"], "title": "After the Dawn: A Family Affair Novel", "description": [" bestselling author Francis Ray's third novel in the Family Affair series, featuring long lost siblings who find family, friendship, forgiveness, and love", "Samantha Collins is stunned when her grandfather turns Collins Industry over to her, causing more than a bit of ill will among the other family members, especially her uncle, Evan. But nothing stuns her more", " bestselling author Francis Ray's third novel in the Family Affair series, featuring long lost siblings who find family, friendship, forgiveness, and love", "Samantha Collins is stunned when her grandfather turns Collins Industry over to her, causing more than a bit of ill will among the other family members, especially her uncle, Evan. But nothing stuns her more than when she finds out that he has asked Dillon Montgomery to help her run the company. Her grandfather had fired Dillon and ordered him off the company property years ago.  Twelve years ago Samantha made her feelings known to Dillon and the whole thing ended in disaster and they haven't spoken since. Working together now, even all these years later, is sure to be a disaster. Still, she needs his help if she is going to keep Collins Industry afloat. But will the prodigal son return to the empire — and the woman — who desperately need him? Will he be able to admit how much he desperately needs her?"], "author": "Francis Ray", "num_pages": "320", "awards": [], "places": [], "character_names": ["Samantha Collins", "Dillion Montgomery"], "language": "English", "publish_date": "2013-06-18 00:00:00", "ISBN": "0312681631"},
{"url": "https://www.goodreads.com/book/show/13592268-the-gospel-according-to-cane", "num_ratings": "91", "num_reviews": "22", "avg_ratings": 3.18, "genres": ["Fiction", "Mystery", "Thriller", "Suspense", "Literary Fiction", "Family", "Drama"], "title": "The Gospel According to Cane", "description": ["Beverley Cottrell had a dream life: a prestigious job, a beautiful husband and baby boy. This is stolen from her one winter afternoon when her son Malakay is kidnapped from a parked car. Despite a media campaign, a full police investigation, and the offer of a reward, Malakay is never found. Beverley’s marriage soon dissolves and her husband immigrates from England to the", "Beverley Cottrell had a dream life: a prestigious job, a beautiful husband and baby boy. This is stolen from her one winter afternoon when her son Malakay is kidnapped from a parked car. Despite a media campaign, a full police investigation, and the offer of a reward, Malakay is never found. Beverley’s marriage soon dissolves and her husband immigrates from England to the U.S. with a new wife.", "Beverley gives up her job, sells the house, and moves from the leafy suburbs to the inner city to reside in a west London housing project. She cocoons herself in grief, growing more isolated with each passing year. After two decades she gives up any hope of finding her son. She teaches children who have been expelled from school in the local community center, bright kids thrown on society’s scrap heap.", "Beverley starts to believe she has finally pieced her life together—until a young man starts appearing wherever she goes. Beverley is convinced that he’s stalking her. One dark evening the stalker gets past her security door and calls through her letterbox. He tells her not to be scared. He says that he is Malakay, her son.", " is a novel about inner-city youth in contemporary London. It’s a meditation on pain and loss, the burden of heritage, and how the past can blur the present. It’s about trust and the perceived lack of trust, disillusion, and its consequences. A world where everyone is the victim, and no one is to blame."], "author": "Courttia Newland", "num_pages": "254", "awards": ["Hurston/Wright Legacy Award Nominee for Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-05 00:00:00", "ISBN": "1617751332"},
{"url": "https://www.goodreads.com/book/show/15762186-benediction", "num_ratings": "14,047", "num_reviews": "2,228", "avg_ratings": 3.98, "genres": ["Fiction", "Literary Fiction", "Family"], "title": "Benediction", "description": ["When Dad Lewis is diagnosed with terminal cancer, he and his wife must work together, along with their daughter, to make his final days as comfortable as possible, despite the bitter absence of their estranged son. Next door, a young girl moves in with her grandmother and contends with the memories that Dad’s condition stirs up of her own mother’s death. A newly arrived pr", "When Dad Lewis is diagnosed with terminal cancer, he and his wife must work together, along with their daughter, to make his final days as comfortable as possible, despite the bitter absence of their estranged son. Next door, a young girl moves in with her grandmother and contends with the memories that Dad’s condition stirs up of her own mother’s death. A newly arrived preacher attempts to mend his strained relationships with his wife and son, and soon faces the disdain of his congregation when he offers more than they are used to getting on Sunday mornings. And throughout, an elderly widow and her middle-aged daughter do all they can to ease the pain of their friends and neighbors."], "author": "Kent Haruf", "num_pages": "258", "awards": ["James Tait Black Memorial Prize Nominee for Fiction (2013)", "Folio Prize Nominee (2014)"], "places": ["Holt, Colorado"], "character_names": ["Dad Lewis"], "language": "English", "publish_date": "2013-02-26 00:00:00", "ISBN": "0307959880"},
{"url": "https://www.goodreads.com/book/show/15741170-the-best-of-all-possible-worlds", "num_ratings": "3,620", "num_reviews": "682", "avg_ratings": 3.6, "genres": ["Science Fiction", "Fiction", "Romance", "Fantasy", "Science Fiction", "Aliens"], "title": "The Best of all Possible Worlds", "description": ["The Sadiri were once the galaxy's ruling elite, but now their home planet has been rendered unlivable and most of the population destroyed. The few groups living on other worlds are desperately short of Sadiri women, and their extinction looks imminent."], "author": "Karen Lord", "num_pages": "325", "awards": ["Locus Award Nominee for Best Science Fiction Novel (2014)", "Romantic Times Reviewers' Choice Award (RT Award) for Best Science Fiction Novel (2013)", "Frank Collymore Award (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-31 00:00:00", "ISBN": "178087166X"},
{"url": "https://www.goodreads.com/book/show/18125285-the-sabi", "num_ratings": "46", "num_reviews": "20", "avg_ratings": 4.11, "genres": ["Cultural", "Africa", "Literature", "African Literature", "Biography Memoir", "Biography", "Autobiography", "Memoir"], "title": "The Sabi", "description": ["She does not know how, but has a sabi from her earliest memory that she was different. What she does know is that 'difference' had currency in the past, and it certainly still has currency today. The Sabi will have an effect on you - have no doubt about that. In her debut novel, Diane Brown takes a scenic and open-eyed walk down memory lane to the 1960's when apartheid was", "She does not know how, but has a sabi from her earliest memory that she was different. What she does know is that 'difference' had currency in the past, and it certainly still has currency today. The Sabi will have an effect on you - have no doubt about that. In her debut novel, Diane Brown takes a scenic and open-eyed walk down memory lane to the 1960's when apartheid was in full swing to the early 1990's when South Africa was beginning to sense freedom. She ventures further back in time to help solve the puzzle of the current time, how did South Africa become so angry and so violent? Writing from the heart to relate the events of her childhood and adolescence, the author takes you on a journey that will make you cry and laugh along with her as she tried to make sense of her life, the people around her and the system into which she was born. She is no doubt left extremely vulnerable and exposed in relating this account of her life. This honesty is anchored in an easy writing style which is deeply reflective, with an acute sense of contextual reasoning. She reflects on the news of the day in a 'free' country, tainted with the heavy stench of death, violence and abuse and notes that all too familiar script. She finally realises... Her story must be told.", "Themes covered in this book: Race, Colorism, Violence, South Africa, Apartheid, Acceptance, Prejudice, Coming-of-age, Love, Liberation"], "author": "Diane  Brown", "num_pages": "254", "awards": [], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "2013-07-01 00:00:00", "ISBN": "1909740845"},
{"url": "https://www.goodreads.com/book/show/16165298-jungle-justice", "num_ratings": "12", "num_reviews": "1", "avg_ratings": 3.33, "genres": ["Literature", "African Literature", "Fiction"], "title": "Jungle Justice", "description": ["In a world where an accusation of theft is enough for a person to be lynched brutally, all it takes is an old tire, some fuel, a box of matches, and an eager crowd.", "On a busy day in the streets, a young girl who has recently been transported from her uneventful life in a poor village, to live a life of forced servitude in Lagos, witnesses the vicious lynching of an innocent", "In a world where an accusation of theft is enough for a person to be lynched brutally, all it takes is an old tire, some fuel, a box of matches, and an eager crowd.", "On a busy day in the streets, a young girl who has recently been transported from her uneventful life in a poor village, to live a life of forced servitude in Lagos, witnesses the vicious lynching of an innocent young man, as well as the brutal and questionable justice that soon follows."], "author": "Somi Ekhasomhi", "num_pages": "24", "awards": [], "places": ["Lagos"], "character_names": [], "language": "English", "publish_date": "2012-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30555488-the-underground-railroad", "num_ratings": "159,515", "num_reviews": "17,034", "avg_ratings": 4.03, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "The Underground Railroad", "description": ["Cora is a slave on a cotton plantation in Georgia. Life is hellish for all the slaves but especially bad for Cora; an outcast even among her fellow Africans, she is coming into womanhood - where even greater pain awaits. When Caesar, a recent arrival from Virginia, tells her about the Underground Railroad, they decide to take a terrifying risk and escape. Matters do not go", "Cora is a slave on a cotton plantation in Georgia. Life is hellish for all the slaves but especially bad for Cora; an outcast even among her fellow Africans, she is coming into womanhood - where even greater pain awaits. When Caesar, a recent arrival from Virginia, tells her about the Underground Railroad, they decide to take a terrifying risk and escape. Matters do not go as planned and, though they manage to find a station and head north, they are being hunted.", "In Whitehead's ingenious conception, the Underground Railroad is no mere metaphor - engineers and conductors operate a secret network of tracks and tunnels beneath the Southern soil. Cora and Caesar's first stop is South Carolina, in a city that initially seems like a haven - but the city's placid surface masks an insidious scheme designed for its black denizens. Even worse: Ridgeway, the relentless slave catcher, is close on their heels. Forced to flee again, Cora embarks on a harrowing flight, state by state, seeking true freedom.", "As Whitehead brilliantly re-creates the unique terrors for black people in the pre-Civil War era, his narrative seamlessly weaves the saga of America from the brutal importation of Africans to the unfulfilled promises of the present day. ", " is at once a kinetic adventure tale of one woman's ferocious will to escape the horrors of bondage and a shattering, powerful meditation on the history we all share."], "author": "Colson Whitehead", "num_pages": "306", "awards": ["Man Booker Prize Nominee for Longlist (2017)", "Pulitzer Prize for Fiction (2017)", "National Book Award for Fiction (2016)", "Arthur C. Clarke Award (2017)", "John W. Campbell Memorial Award Nominee for Best Science Fiction Novel (2017)", "Hurston/Wright Legacy Award for Fiction (2017)", "The Rooster - The Morning News Tournament of Books (2017)", "NAIBA Book of the Year for Fiction (2017)", "Andrew Carnegie Medal for Fiction (2017)", "Kirkus Prize Nominee for Fiction (2016)", "Goodreads Choice Award for Historical Fiction (2016)", "PEN/Jean Stein Book Award Nominee (2017)"], "places": ["Georgia", "South Carolina", "North Carolina", "Indiana", "Tennessee"], "character_names": ["Caesar (The Underground Railroad)", "Cora Randall", "Mabel Randall", "Arnold Ridgeway", "Martin Wells", "Ethel Wells", "Royal (The Underground Railroad)", "Homer (The Underground Railroad)", "Boseman (The Underground Railroad)", "Ajarry (The Underground Railroad)", "Lovey (The Underground Railroad)", "Molly (The Underground Railroad)", "Sybil (The Underground Railroad)"], "language": "English", "publish_date": "2016-08-02 00:00:00", "ISBN": "0385542364"},
{"url": "https://www.goodreads.com/book/show/106393.The_Coldest_Winter_Ever", "num_ratings": "27,371", "num_reviews": "2,052", "avg_ratings": 4.48, "genres": ["Fiction", "Cultural", "African American", "Urban"], "title": "The Coldest Winter Ever", "description": ["The stunning national bestseller now features an illuminating discussion with Sister Souljah -- her secret thoughts on creating the story that has sold more than one million copies worldwide and introduced readers everywhere to the real ghetto experience. Here are answers to the questions fans", "The stunning national bestseller now features an illuminating discussion with Sister Souljah -- her secret thoughts on creating the story that has sold more than one million copies worldwide and introduced readers everywhere to the real ghetto experience. Here are answers to the questions fans everywhere have been asking; the meanings and inspirations behind such memorable characters as Winter, Midnight, and Santiaga; and insights into why and how Souljah conceived of one of the most powerful novels of our time."], "author": "Sister Souljah", "num_pages": "544", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "1416521690"},
{"url": "https://www.goodreads.com/book/show/16246620-grandma-can-i-get-a-dog", "num_ratings": "32", "num_reviews": "9", "avg_ratings": 4.47, "genres": ["Childrens"], "title": "Grandma! Can I Get a Dog?", "description": ["Grandma! Can I Get a Dog? is about the relationship between a grandmother and her grandson. It starts out with Grandma and her grandson Boy going to the store. There, Boy asks Grandma to buy him a dog, but Grandma is not happy with this idea at all. Will Boy ever get a dog of his own?"], "author": "Barry Jordan Jr.", "num_pages": "28", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-01 00:00:00", "ISBN": "1620861410"},
{"url": "https://www.goodreads.com/book/show/10822858-the-keeper-of-lost-causes", "num_ratings": "51,870", "num_reviews": "4,379", "avg_ratings": 3.98, "genres": ["Mystery", "Mystery", "Crime", "Fiction", "Thriller", "Thriller", "Mystery Thriller"], "title": "The Keeper of Lost Causes", "description": ["Carl Mørck used to be one of Copenhagen’s best homicide detectives. Then a hail of bullets destroyed the lives of two fellow cops, and Carl—who didn’t draw his weapon—blames himself. So a promotion is the last thing he expects. But Department Q is a department of one, and Carl’s got only a stack of Copenhagen’s coldest cases for company. His colleagues snicker, but Carl ma", "Carl Mørck used to be one of Copenhagen’s best homicide detectives. Then a hail of bullets destroyed the lives of two fellow cops, and Carl—who didn’t draw his weapon—blames himself. So a promotion is the last thing he expects. But Department Q is a department of one, and Carl’s got only a stack of Copenhagen’s coldest cases for company. His colleagues snicker, but Carl may have the last laugh, because one file keeps nagging at him: a liberal politician vanished five years earlier and is presumed dead. But she isn’t dead…yet."], "author": "Jussi Adler-Olsen", "num_pages": "395", "awards": ["Barry Award for Best Novel (2012)", "Prix du meilleur polar scandinave", "Grand Prix des lectrices de Elle for roman policier (2012)", "Sealed Room Award (2012)"], "places": [], "character_names": ["Carl Mørck", "Hafez el-Assad", "Rose Knudsen"], "language": "English", "publish_date": "2011-08-23 00:00:00", "ISBN": "0525952489"},
{"url": "https://www.goodreads.com/book/show/17050888-the-treason-of-mary-louvestre", "num_ratings": "92", "num_reviews": "20", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Historical", "Fiction", "Military History", "Civil War", "Literature", "American"], "title": "The Treason of Mary Louvestre", "description": ["The Treason of Mary Louvestre is based on the true story of Mary Louvestre, a seamstress slave from the confederate town of Norfolk, Virginia who steals and carries plans of the rebel ironclad to Washington DC."], "author": "My Haley", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-05-14 00:00:00", "ISBN": "1938467302"},
{"url": "https://www.goodreads.com/book/show/18140729-bird", "num_ratings": "73", "num_reviews": "15", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Historical"], "title": "Bird", "description": ["‘There is a ghost in the attic, some say, but I swear I heard a child laugh.’", "Set in nineteenth century England, Emily Sanderson is a middle class white girl born into wealth and respectability. Her future security is assured until she falls passionately in love with a sophisticated black man, Josiah Equiano. ", "When the irrevocably violent prejudice of her family is revealed,", "‘There is a ghost in the attic, some say, but I swear I heard a child laugh.’", "Set in nineteenth century England, Emily Sanderson is a middle class white girl born into wealth and respectability. Her future security is assured until she falls passionately in love with a sophisticated black man, Josiah Equiano. ", "When the irrevocably violent prejudice of her family is revealed, and a husband of their choice is about to be forced upon her, Emily must make a decision between freedom and her duty bound to obligation. ", "However, tragedy ensues and Emily is hidden away in the family mansion, along with a powerful secret, in this historical novel with a supernatural twist. ", "(Warning: contains mild adult content)", "*Please note that the language/spelling of this novel is English (UK)*"], "author": "Tami Egonu", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13456478-darius-and-the-vanilla-funk", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 4.0, "genres": [], "title": "Darius and the Vanilla Funk", "description": ["Darius and the Vanilla Funk centers on the special relationship between fifth-grade teacher and student, and the strong bond they have formed. Darius Mitchell walks a bumpy road after leaving Mr. Cohen's class, hitting the streets as a gang member. It isn't until he is knocking on death's door, that Mr. C steps in to teach the final lessons."], "author": "Phil Wohl", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-07-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18145249-the-blood-of-titans", "num_ratings": "40", "num_reviews": "21", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Fantasy", "Romance", "Historical", "Cultural", "Africa", "Fiction"], "title": "The Blood of Titans", "author": "C. Michael Forsyth", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-14 00:00:00", "ISBN": "0988478005"},
{"url": "https://www.goodreads.com/book/show/15885385-lime", "num_ratings": "37", "num_reviews": "8", "avg_ratings": 3.22, "genres": ["Fiction"], "title": "Lime", "description": ["Fashion Week, cover of Vogue, haute couture fashion, international appearances, and product endorsements propel Lime Prince into Supermodel icon and temporarily away from the realities of her past. Her Ethiopian and Jamaican genes, accented with piercing lime green eyes and a runner's physique, are the object of every man's desire and take the New York fashion world by sto", "Fashion Week, cover of Vogue, haute couture fashion, international appearances, and product endorsements propel Lime Prince into Supermodel icon and temporarily away from the realities of her past. Her Ethiopian and Jamaican genes, accented with piercing lime green eyes and a runner's physique, are the object of every man's desire and take the New York fashion world by storm. But when the fantasies of beauty collide with the realities of domestic violence, will her sordid past shame her out of the glitz and glamour of the modeling world?"], "author": "Melda Beaty", "num_pages": "316", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-25 00:00:00", "ISBN": "1475090714"},
{"url": "https://www.goodreads.com/book/show/13260207-my-country-tis-of-thee", "num_ratings": "94", "num_reviews": "14", "avg_ratings": 3.79, "genres": ["Autobiography", "Memoir", "Politics", "Religion", "Religion", "Islam", "Nonfiction", "Biography", "Biography", "Autobiography", "Race"], "title": "My Country 'Tis of Thee", "description": [" As a former Catholic who converted to Islam, Keith Ellison, is the first Muslim elected to Congress—from a district with fewer than 1 percent Muslims and 11 percent Blacks. With his unique perspective on uniting a disparate community and speaking to a common g", " As a former Catholic who converted to Islam, Keith Ellison, is the first Muslim elected to Congress—from a district with fewer than 1 percent Muslims and 11 percent Blacks. With his unique perspective on uniting a disparate community and speaking to a common goal, Ellison takes a provocative look at America and what needs to change to accommodate different races and beliefs.", "Filled with anecdotes, statistics, and social commentary, Ellison touches on everything from the Tea Party to Obama, from race to the immigration debate and more. He also draws some very clear distinctions between parties and shows why the deep polarization is unhealthy for America. Deeply patriotic, with ", ", Ellison strives to help define what it means to be an American today."], "author": "Keith Ellison", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17610829-raised-by-hand-lifted-by-the-tides", "num_ratings": "43", "num_reviews": "19", "avg_ratings": 3.81, "genres": ["Historical", "Historical Fiction", "Fiction", "Mystery", "Historical"], "title": "Raised by Hand, Lifted by the Tides: A Southern Child's Memoir", "description": ["When we first meet Lily “Lil Bit” Dalton, she is quite literally drowning. This “lip flapping” event, along with others, takes place in the quirky, yet racially divided waterway township of Arcadia, Florida in 1954.", "In ", ", Lil Bit recounts the years between ten and thirteen spent in the care of the woman she considers to be her grandmother, \"Bubbah,\" and this wo", "When we first meet Lily “Lil Bit” Dalton, she is quite literally drowning. This “lip flapping” event, along with others, takes place in the quirky, yet racially divided waterway township of Arcadia, Florida in 1954.", "In ", ", Lil Bit recounts the years between ten and thirteen spent in the care of the woman she considers to be her grandmother, \"Bubbah,\" and this woman's alcoholic son, Bobby. As the story opens, it’s been five years since Lil Bit’s mama, Violet, “dropped her off like nothin’ but a bit of dirty laundry,” when on “Ditch Thursday,” Lil Bit is pulled from the river by Sheriff Marin. The Sheriff’s act of heroism leaves her not only with the secret of what lies beneath the water, but also with gnawing doubts about Sheriff Marin, “the only white man worth a damn in all of Arcadia,” who also knows the river’s secret, but tells no one.", "Like the tales told by the young heroines in the classics ", " and ", ", Lily “Lil Bit” Dalton’s quest to reunite with her mother, while also keeping the secret of the Massaquatta’s murky depths, takes readers on a tumultuous ride filled with adventure and mystery. But more importantly, ", " answers the age old question: What does it take to be a family?"], "author": "Willett Thomas", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16246625-mom-what-s-that", "num_ratings": "31", "num_reviews": "9", "avg_ratings": 4.29, "genres": ["Childrens"], "title": "Mom! What's That?", "description": ["MOM! WHAT'S THAT? This is a question that most kids ask as they learn about their surroundings. Join Mom and Sadie as their story brings happiness and fun back in reading. This book will help to motivate your child's learning through rhyming patterns, language, and memorization skills."], "author": "Atlas Jordan", "num_pages": "28", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-01 00:00:00", "ISBN": "1620861437"},
{"url": "https://www.goodreads.com/book/show/17592275-the-awesome-girl-s-guide-to-dating-extraordinary-men", "num_ratings": "950", "num_reviews": "136", "avg_ratings": 3.95, "genres": ["Womens Fiction", "Chick Lit", "Fiction", "Cultural", "African American", "Romance"], "title": "The Awesome Girl's Guide to Dating Extraordinary Men", "description": ["Four women. Two years.", "A friendship to last a lifetime.", "The only things that Sharita, Thursday, Risa, and Tammy have in common are their disastrous love lives. But the year three of them turn 30 will be different, they swear!", "Sharita, a plump and conservative accountant wants to make partner at her firm and find the man of her dreams. Thursday, the daughter of a formerly char", "Four women. Two years.", "A friendship to last a lifetime.", "The only things that Sharita, Thursday, Risa, and Tammy have in common are their disastrous love lives. But the year three of them turn 30 will be different, they swear!", "Sharita, a plump and conservative accountant wants to make partner at her firm and find the man of her dreams. Thursday, the daughter of a formerly chart-topping political rapper, wants to stop being a serial one-month stander, and settle down into a stable life with a stable boyfriend. Risa, a skinny and audacious electronica punk rocker, wants to finally land an album deal, which she feels is the only way to win back the heart of her on-again-off-again closeted girlfriend. And after getting fired as the spokesmodel for her family’s hair company, sweet and gorgeous Tammy wants to prove that she has what it takes to make it on her own.", "None of these women get what they want, but over the course of two years, they get exactly what they need. And that proves to be the best thing after all."], "author": "Ernessa T. Carter", "num_pages": "442", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "1612182828"},
{"url": "https://www.goodreads.com/book/show/15954691-the-third-son", "num_ratings": "1,266", "num_reviews": "211", "avg_ratings": 3.78, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Asia", "Young Adult", "Coming Of Age", "Literature", "Asian Literature"], "title": "The Third Son", "description": ["In the middle of a terrifying air raid in Japanese-occupied Taiwan, Saburo, the least-favored son of a Taiwanese politician, runs through a forest for cover. It’s there he stumbles on Yoshiko, whose descriptions of her loving family are to Saburo like a glimpse of paradise. Meeting her is a moment he will remember forever, and for years he will try to find her again. When", "In the middle of a terrifying air raid in Japanese-occupied Taiwan, Saburo, the least-favored son of a Taiwanese politician, runs through a forest for cover. It’s there he stumbles on Yoshiko, whose descriptions of her loving family are to Saburo like a glimpse of paradise. Meeting her is a moment he will remember forever, and for years he will try to find her again. When he finally does, she is by the side of his oldest brother and greatest rival.", "In ", ", author Julie Wu has created an extraordinary character, determined to fight for everything he needs and wants, from food to education to his first love. ", " is a sparkling and moving story about a young boy with his head in the clouds who, against all odds, finds himself on the frontier of America’s space program."], "author": "Julie  Wu", "num_pages": "320", "awards": [], "places": ["Taiwan"], "character_names": [], "language": "English", "publish_date": "2013-04-30 00:00:00", "ISBN": "1616200790"},
{"url": "https://www.goodreads.com/book/show/13453104-the-summer-prince", "num_ratings": "4,257", "num_reviews": "840", "avg_ratings": 3.58, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fantasy", "Romance"], "title": "The Summer Prince", "description": ["The lush city of Palmares Tres shimmers with tech and tradition, with screaming gossip casters and practiced politicians. In the midst of this vibrant metropolis, June Costa creates art that's sure to make her legendary. But her dreams of fame become something more when she meets Enki, the bold new Summer King. The whole city falls in love with him including June's best fr", "The lush city of Palmares Tres shimmers with tech and tradition, with screaming gossip casters and practiced politicians. In the midst of this vibrant metropolis, June Costa creates art that's sure to make her legendary. But her dreams of fame become something more when she meets Enki, the bold new Summer King. The whole city falls in love with him including June's best friend, Gil. But June sees more to Enki than amber eyes and a lethal samba. She sees a fellow artist.", "Together, June and Enki will stage explosive, dramatic projects that Palmares Tres will never forget. They will add fuel to a growing rebellion against the governments strict limits on new tech. And June will fall deeply, unfortunately in love with Enki. Because like all Summer Kings before him, Enki is destined to die."], "author": "Alaya Dawn Johnson", "num_pages": "289", "awards": ["National Book Award Nominee for Young People’s Literature (2013)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2013)", "Cybils Award for Young Adult Speculative Fiction (2013)", "James Tiptree Jr. Award Honor List (2013)"], "places": ["Palmares Três", "Brazil"], "character_names": ["June Costa"], "language": "English", "publish_date": "2013-03-01 00:00:00", "ISBN": "0545417791"},
{"url": "https://www.goodreads.com/book/show/16049588-the-caretaker", "num_ratings": "875", "num_reviews": "208", "avg_ratings": 3.55, "genres": ["Fiction", "Mystery", "Thriller", "Suspense", "Thriller", "Mystery Thriller"], "title": "The Caretaker: A Ranjit Singh Novel", "description": ["Back in India, Ranjit Singh commanded an elite army squad. But that was years ago, before his Army career ended in dishonor, shattering his reputation. Driven from his homeland, he is now a caretaker on the exclusive resort island of Martha's Vineyard, looking after the vacation homes of", "Back in India, Ranjit Singh commanded an elite army squad. But that was years ago, before his Army career ended in dishonor, shattering his reputation. Driven from his homeland, he is now a caretaker on the exclusive resort island of Martha's Vineyard, looking after the vacation homes of the rich and powerful. One harsh winter, faced with no other choice, he secretly moves his family into the house of one of his clients, an African-American Senator. Here, his wife and daughter are happy, and he feels safe for the first time in ages. But Ranjit's idyll is shattered when mysterious men break into the house. Pursued and hunted, Ranjit is forced to enter the Senator's shadowy world, and his only ally is Anna, the Senator's beautiful wife, who has secrets of her own. Together, they uncover a trail of deception that leads from the calm shores of the Vineyard to countries half a world away. And when his investigation stirs up long forgotten events, the caretaker must finally face the one careless decision that ruined his life- and forced him to leave India. ", "A gripping tale of hidden histories, political intrigue and dangerous attractions, A. X. Ahmad's ", "introduces a new hero for our times: an immigrant caught between two worlds and a man caught between two loves."], "author": "A.X. Ahmad", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-05-21 00:00:00", "ISBN": "1250016835"},
{"url": "https://www.goodreads.com/book/show/16158570-virgin-soul", "num_ratings": "135", "num_reviews": "33", "avg_ratings": 3.31, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Literature", "Science Fiction", "Novels"], "title": "Virgin Soul", "description": ["From a lauded poet and playwright, a novel of a young woman's life with the Black Panthers in 1960s San Francisco", "At first glance, Geniece’s story sounds like that of a typical young woman: she goes to college, has romantic entanglements, builds meaningful friendships, and juggles her schedule with a part-time job. However, she does all of these things in 1960s San Francisc", "From a lauded poet and playwright, a novel of a young woman's life with the Black Panthers in 1960s San Francisco", "At first glance, Geniece’s story sounds like that of a typical young woman: she goes to college, has romantic entanglements, builds meaningful friendships, and juggles her schedule with a part-time job. However, she does all of these things in 1960s San Francisco while becoming a militant member of the Black Panther movement. ", "When Huey Newton is jailed in October 1967 and the Panthers explode nationwide, Geniece enters the organization’s dark and dangerous world of guns, FBI agents, freewheeling sex, police repression, and fatal shoot-outs—all while balancing her other life as a college student.", "A moving tale of one young woman’s life spinning out of the typical and into the extraordinary during one of the most politically and racially charged eras in America, ", " will resonate with readers of Monica Ali and Ntozake Shange.", "\"", "\" — Susan Straight, author of "], "author": "Judy Juanita", "num_pages": "312", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-18 00:00:00", "ISBN": "0670026581"},
{"url": "https://www.goodreads.com/book/show/17789384-honourable", "num_ratings": "5", "num_reviews": "0", "avg_ratings": 3.2, "genres": [], "title": "Honourable", "description": ["H.o.n.o.u.r.a.b.l.e. is a satire following the organisation of a real-life political campaign. The story follows the trials of the campaign management team behind the slogan ‘Oke Mosan Straight’, the machinery tasked to organise the lead character’s election into the Ogun State House of Assembly. The team has to overcome the challenge of having an inexperienced candidate,", "H.o.n.o.u.r.a.b.l.e. is a satire following the organisation of a real-life political campaign. The story follows the trials of the campaign management team behind the slogan ‘Oke Mosan Straight’, the machinery tasked to organise the lead character’s election into the Ogun State House of Assembly. The team has to overcome the challenge of having an inexperienced candidate, as well as inevitable logistical difficulties, smear campaigns and troublesome financiers. The main character is Segun Olatunji, a first-time aspirant, generally efficient but often succumbing to the need to win over his electorate by padding pockets and doing the bidding of the vicious executive committee members of his party, The Alliance Longevity Democratic Party (ALDP). A running thread in this story is the hint that his membership to ALDP is not as authentic as it seems. It is also clear that the candidate is heavily inspired by the Obama '08 campaign, although this remains unspoken.", "Meanwhile, Action Mommy is the character’s excitable but ultimately calculating mother – not your average pushy mother but pushy nevertheless. The entire strength of the campaign rests on her past political career. She imagines her son’s success as her ‘compensation’ for several failed attempts to win elections on her own steam.", "Then there is the campaign team: a ragtag bunch who gives the impression that they know all about Ijebu Ode politics and its complex power hierarchies but evidently do not."], "author": "Bobo Omotayo", "num_pages": "135", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-16 00:00:00", "ISBN": "9789320787"},
{"url": "https://www.goodreads.com/book/show/16059500-gloria", "num_ratings": "226", "num_reviews": "38", "avg_ratings": 3.71, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Novels"], "title": "Gloria", "description": ["Jamaica, 1938. Gloria Campbell is sixteen years old when a single violent act alters the course of her life forever. Taking along her younger sister, she flees their hometown to forge a new life in Kingston. But in a capital city awash with change, a black woman is still treated as a second-class citizen.", "Jamaica, 1938. Gloria Campbell is sixteen years old when a single violent act alters the course of her life forever. Taking along her younger sister, she flees their hometown to forge a new life in Kingston. But in a capital city awash with change, a black woman is still treated as a second-class citizen. From a room in a boarding house and a job at a supply store, Gloria finds her way to a house of ill repute on the edge of the city, intrigued by the glamorous, financially independent women within.It is an unlikely place to meet the love of your life, but here she encounters Pao, a Chinatown racketeer and a loyal customer who will become something more. It is also an unlikely place to gain a passion for social justice, but it is one of the house's proprietors who instills in Gloria new ideas about the rights of women and all humankind, eventually propelling her to Cuba, where even greater change is underway, and where Gloria must choose between the life she has made for herself and the one that might be.", "Alive with the energy of a country at a crossroads, this is a story of love in many forms, and of Gloria's evolution-from a frightened girl on the run to a woman fully possessed of her own power."], "author": "Kerry Young", "num_pages": "400", "awards": [], "places": ["Jamaica"], "character_names": [], "language": "English", "publish_date": "2013-07-16 00:00:00", "ISBN": "1620400758"},
{"url": "https://www.goodreads.com/book/show/16059650-love-is-power-or-something-like-that", "num_ratings": "350", "num_reviews": "55", "avg_ratings": 3.74, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria"], "title": "Love Is Power, or Something Like That: Stories", "description": ["Millions", "When it comes to love, things are not always what they seem. In contemporary Lagos, a young boy may pose as a woman online, and a maid may be suspected of sleeping with her employer and yet still become a young wife’s confidante. Men and wome", "Millions", "When it comes to love, things are not always what they seem. In contemporary Lagos, a young boy may pose as a woman online, and a maid may be suspected of sleeping with her employer and yet still become a young wife’s confidante. Men and women can be objects of fantasy, the subject of beery soliloquies. They can be trophies or status symbols. Or they can be overwhelming in their need.", "In these wide-ranging stories, A. Igoni Barrett roams the streets with people from all stations of life. A man with acute halitosis navigates the chaos of the Lagos bus system. A minor policeman, full of the authority and corruption of his uniform, beats his wife. A family’s fortunes fall from love and wealth to infidelity and poverty as poor choices unfurl over three generations. With humor and tenderness, Barrett introduces us to an utterly modern Nigeria, where desire is a means to an end, and love is a power as real as money."], "author": "A. Igoni Barrett", "num_pages": "199", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-07 00:00:00", "ISBN": "1555976409"},
{"url": "https://www.goodreads.com/book/show/15794111-the-abundance", "num_ratings": "747", "num_reviews": "160", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "India", "Food and Drink", "Food", "Contemporary", "Realistic Fiction", "Adult Fiction", "Novels"], "title": "The Abundance", "description": ["When Mala and Ronak learn that their mother has only a few months to live, they are reluctantly pulled back into the midwestern world of their Indian immigrant parents--a diaspora of prosperous doctors and", "When Mala and Ronak learn that their mother has only a few months to live, they are reluctantly pulled back into the midwestern world of their Indian immigrant parents--a diaspora of prosperous doctors and engineers who have successfully managed to keep faith with the old world while claiming the prizes of the new. More successfully than their children--equally ill at ease with Holi and Christmas, bhaji and barbecue, they are mysteries to their parents and themselves.", "In the short time between diagnosis and deterioration, Mala sets about learning everything she can about her mother's art of Indian cooking. Perfecting the naan and the raita, the two confront their deepest divisions and failures and learn to speak as well as cook. But when Ronak hits upon the idea of selling their experience as a book and a TV documentary, India and America, immigrant and native-born are torn as never before.", "With grace, acuity, and wry compassion, Amit Majmudar has written anew the immigrant experience, the clash of cultures, the conflicts of assimilation, and, most poignantly, the tangled ties between generations in ", "."], "author": "Amit Majmudar", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "0805096582"},
{"url": "https://www.goodreads.com/book/show/15814963-wash", "num_ratings": "1,164", "num_reviews": "227", "avg_ratings": 3.63, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "African American", "Cultural", "Africa", "Historical", "Adult Fiction", "American", "Southern", "Literary Fiction", "Abandoned", "North American Hi...", "American History"], "title": "Wash", "description": ["In this luminous debut, Margaret Wrinkle takes us on an unforgettable journey across continents and through time, from the burgeoning American South to West Africa and deep into the ancestral stories that reside in the soul. \"Wash\" introduces a remarkable new voice in American literature. ", "In early 1800s Tennessee, two men find themselves locked in an intimate power struggl", "In this luminous debut, Margaret Wrinkle takes us on an unforgettable journey across continents and through time, from the burgeoning American South to West Africa and deep into the ancestral stories that reside in the soul. \"Wash\" introduces a remarkable new voice in American literature. ", "In early 1800s Tennessee, two men find themselves locked in an intimate power struggle. Richardson, a troubled Revolutionary War veteran, has spent his life fighting not only for his country but also for wealth and status. When the pressures of westward expansion and debt threaten to destroy everything he s built, he sets Washington, a young man he owns, to work as his breeding sire. Wash, the first member of his family to be born into slavery, struggles to hold onto his only solace: the spirituality inherited from his shamanic mother. As he navigates the treacherous currents of his position, despair and disease lead him to a potent healer named Pallas. Their tender love unfolds against this turbulent backdrop while she inspires him to forge a new understanding of his heritage and his place in it. Once Richardson and Wash find themselves at a crossroads, all three lives are pushed to the brink.\""], "author": "Margaret Wrinkle", "num_pages": "408", "awards": ["American Book Award (2014)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2014)", "The Center for Fiction First Novel Prize (2013)"], "places": ["Tennessee"], "character_names": [], "language": "English", "publish_date": "2013-02-05 00:00:00", "ISBN": "0802120660"},
{"url": "https://www.goodreads.com/book/show/13495579-blackout", "num_ratings": "44", "num_reviews": "5", "avg_ratings": 4.77, "genres": ["Young Adult", "Fantasy", "Mythology", "Mystery", "Fantasy"], "title": "Blackout", "description": ["What was shall no longer be. What was not shall now become.", "Despite having the protection of the talisman and the Legion, a reforming force of warrior angels and elementals, guarding his every move, things are not looking good for Charlie Blake. Tasked with the responsibility of saving mankind, finding the four diamonds to restore the talisman is all he can think of, but wh", "What was shall no longer be. What was not shall now become.", "Despite having the protection of the talisman and the Legion, a reforming force of warrior angels and elementals, guarding his every move, things are not looking good for Charlie Blake. Tasked with the responsibility of saving mankind, finding the four diamonds to restore the talisman is all he can think of, but when his prophetic visions start to invade his reality and he suddenly can’t distinguish the dream world from the real world, the pending extinction of mankind becomes the least of his problems. Everyone assumes Charlie’s dormant powers are activating, until he starts showing symptoms of a deadly disease.", "With his nemesis, Gaddis, threatening the lives of his loved ones, he faces a race against time to locate the Stone of Raphael, the air diamond, before an imminent pandemic destroys civilization. As he ventures into dangerous lands once again, he unearths shocking revelations about his past life that forces him to question his allegiance. With no one to turn to for answers, he can’t help but wonder if his purpose is truly to save mankind."], "author": "Al   Stone", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15721624-orleans", "num_ratings": "3,186", "num_reviews": "646", "avg_ratings": 3.74, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Fiction", "Apocalyptic", "Post Apocalyptic"], "title": "Orleans", "description": ["After a string of devastating hurricanes and a severe outbreak of Delta Fever, the Gulf Coast has been quarantined. Years later, residents of the Outer States are under the assumption that life in the Delta is all but extinct… but in reality, a new primitive society has been born.", "Fen de la Guerre is living with the O-P", "After a string of devastating hurricanes and a severe outbreak of Delta Fever, the Gulf Coast has been quarantined. Years later, residents of the Outer States are under the assumption that life in the Delta is all but extinct… but in reality, a new primitive society has been born.", "Fen de la Guerre is living with the O-Positive blood tribe in the Delta when they are ambushed. Left with her tribe leader’s newborn, Fen is determined to get the baby to a better life over the wall before her blood becomes tainted. Fen meets Daniel, a scientist from the Outer States who has snuck into the Delta illegally. Brought together by chance, kept together by danger, Fen and Daniel navigate the wasteland of Orleans. In the end, they are each other’s last hope for survival.", "Sherri L. Smith delivers an expertly crafted story about a fierce heroine whose powerful voice and firm determination will stay with you long after you’ve turned the last page."], "author": "Sherri L. Smith", "num_pages": "324", "awards": ["Milwaukee County Teen Book Award Nominee (2014)"], "places": ["New Orleans, Louisiana"], "character_names": ["Fen de la Guerre"], "language": "English", "publish_date": "2013-03-07 00:00:00", "ISBN": "0399252940"},
{"url": "https://www.goodreads.com/book/show/16158074-rice", "num_ratings": "75", "num_reviews": "6", "avg_ratings": 4.37, "genres": ["Poetry", "Glbt", "Queer"], "title": "Rice: Poems", "description": ["In Rice, her second volume of poetry, Nikky Finney explores the complexity of rice as central to the culture, economy, and mystique of the coastal South Carolina region where she was born and raised. The prized Carolina Gold rice paradoxically made South Carolina one of the most oppressive states for slaves and also created the remarkable Gullah culture on the coastal isla", "In Rice, her second volume of poetry, Nikky Finney explores the complexity of rice as central to the culture, economy, and mystique of the coastal South Carolina region where she was born and raised. The prized Carolina Gold rice paradoxically made South Carolina one of the most oppressive states for slaves and also created the remarkable Gullah culture on the coastal islands. The poems in Rice compose a profound and unflinching journey connecting family and the paradoxes of American history, from the tragic times when African slaves disembarked on the South Carolina coast to the triumphant day when Judge Ernest A. Finney Jr., Nikky’s father, was sworn in as South Carolina’s first African American chief justice. Images from the Finney family archive illustrate and punctuate this collection. Rice showcases Finney’s hungry intellect, her regional awareness and pride, and her sensitivity to how cultures are built and threatened."], "author": "Nikky Finney", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-31 00:00:00", "ISBN": "0810152320"},
{"url": "https://www.goodreads.com/book/show/16158076-the-world-is-round", "num_ratings": "66", "num_reviews": "7", "avg_ratings": 4.27, "genres": ["Poetry"], "title": "The World Is Round: Poems", "description": ["The World Is Round, Nikky Finney’s third volume of poetry, collects the wisps of memory we carry with us throughout our earthly lives and weaves them into deft and nuanced poems that emphasize understanding the cycles of life. The settings offer a view into the kaleidoscope of human experience: the sweetness and shock of family life, the omnipresent wash of memory, and the", "The World Is Round, Nikky Finney’s third volume of poetry, collects the wisps of memory we carry with us throughout our earthly lives and weaves them into deft and nuanced poems that emphasize understanding the cycles of life. The settings offer a view into the kaleidoscope of human experience: the sweetness and shock of family life, the omnipresent wash of memory, and the ebullience of warm Southern air. The World Is Round carries with it an implicit challenge—to the author as a poet, and to the reader as a fellow human—to see the characters and details and events of our lives with clarity, fearlessness, and love. The result is poems that range the gamut of human reach and resilience, fury and frailty. The poet’s vision of community requires understanding and tolerance from every breathing soul. Finney illuminates the cruelties of the sometimes gawking, narrow-minded world and makes a plea for compassion inspired by our common humanity."], "author": "Nikky Finney", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-31 00:00:00", "ISBN": "0810152339"},
{"url": "https://www.goodreads.com/book/show/126381.Purple_Hibiscus", "num_ratings": "44,222", "num_reviews": "4,231", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her bro", "Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her brother away to stay with their aunt, a University professor, whose house is noisy and full of laughter. There, Kambili and her brother discover a life and love beyond the confines of their father’s authority. The visit will lift the silence from their world and, in time, give rise to devotion and defiance that reveal themselves in profound and unexpected ways. ", "This is a book about the promise of freedom; about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new."], "author": "Chimamanda Ngozi Adichie", "num_pages": "307", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0007189885"},
{"url": "https://www.goodreads.com/book/show/16171272-the-good-lord-bird", "num_ratings": "18,048", "num_reviews": "2,509", "avg_ratings": 3.76, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "African American", "Audiobook"], "title": "The Good Lord Bird", "description": [" Henry Shackleford is a young slave living in the Kansas Territory in 1857, when the region is a battleground between anti- and pro-slavery forces. When John Brown, the legendary ab", " Henry Shackleford is a young slave living in the Kansas Territory in 1857, when the region is a battleground between anti- and pro-slavery forces. When John Brown, the legendary abolitionist, arrives in the area, an argument between Brown and Henry’s master quickly turns violent. Henry is forced to leave town—with Brown, who believes he’s a girl.", " Over the ensuing months, Henry—whom Brown nicknames Little Onion—conceals his true identity as he struggles to stay alive. Eventually Little Onion finds himself with Brown at the historic raid on Harpers Ferry in 1859—one of the great catalysts for the Civil War.", " An absorbing mixture of history and imagination, and told with McBride’s meticulous eye for detail and character, ", "is both a rousing adventure and a moving exploration of identity and survival."], "author": "James McBride", "num_pages": "417", "awards": ["National Book Award for Fiction (2013)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)", "The Rooster - The Morning News Tournament of Books (2014)", "Andrew Carnegie Medal Nominee for Fiction (2014)"], "places": [], "character_names": ["John Brown", "Frederick Douglass"], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "1594486344"},
{"url": "https://www.goodreads.com/book/show/16248311-the-perfume-collector", "num_ratings": "31,148", "num_reviews": "3,381", "avg_ratings": 3.98, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "France", "Romance"], "title": "The Perfume Collector", "description": ["A remarkable novel about secrets, desire, memory, passion, and possibility.", "Newlywed Grace Monroe doesn’t fit anyone’s expectations of a successful 1950s London socialite, least of all her own. When she receives an unexpected inheritance from a complete stranger, Madame Eva d’Orsey, Grace is drawn to uncover the identity of her mysterious benefactor.", "Weaving through the deca", "A remarkable novel about secrets, desire, memory, passion, and possibility.", "Newlywed Grace Monroe doesn’t fit anyone’s expectations of a successful 1950s London socialite, least of all her own. When she receives an unexpected inheritance from a complete stranger, Madame Eva d’Orsey, Grace is drawn to uncover the identity of her mysterious benefactor.", "Weaving through the decades, from 1920s New York to Monte Carlo, Paris, and London, the story Grace uncovers is that of an extraordinary women who inspired one of Paris’s greatest perfumers. Immortalized in three evocative perfumes, Eva d’Orsey’s history will transform Grace’s life forever, forcing her to choose between the woman she is expected to be and the person she really is.", "The Perfume Collector explores the complex and obsessive love between muse and artist, and the tremendous power of memory and scent."], "author": "Kathleen Tessaro", "num_pages": "464", "awards": [], "places": ["London, England", "Paris"], "character_names": ["Eva d'Orsey", "Grace Munroe"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0062257838"},
{"url": "https://www.goodreads.com/book/show/15815811-the-black-russian", "num_ratings": "343", "num_reviews": "79", "avg_ratings": 3.75, "genres": ["Biography", "History", "Nonfiction", "Cultural", "Russia", "Biography Memoir", "Audiobook"], "title": "The Black Russian", "description": ["\"The Black Russian\" is the incredible true story of Frederick Bruce Thomas, born in 1872 to former slaves who became prosperous farmers in Mississippi. After his father was brutally murdered, Frederick left the South and worked as a waiter in Chicago and Brooklyn. Seeking greater freedom, he traveled to London, then crisscrossed Europe, andin a highly unusual choice for a", "\"The Black Russian\" is the incredible true story of Frederick Bruce Thomas, born in 1872 to former slaves who became prosperous farmers in Mississippi. After his father was brutally murdered, Frederick left the South and worked as a waiter in Chicago and Brooklyn. Seeking greater freedom, he traveled to London, then crisscrossed Europe, andin a highly unusual choice for a black American at the time went to Russia. ", "Because he found no color line there, Frederick settled in Moscow, becoming a rich and famous owner of variety theaters and restaurants. When the Bolshevik Revolution ruined him, he barely escaped to Constantinople, where he made another fortune by opening celebrated nightclubs as the \"Sultan of Jazz.\" However, the long arm of American racism, the xenophobia of the new Turkish Republic, and Frederick s own extravagance landed him in debtor s prison. He died in Constantinople in 1928.\""], "author": "Vladimir Alexandrov", "num_pages": "304", "awards": [], "places": [], "character_names": ["Frederick Bruce Thomas"], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "0802120695"},
{"url": "https://www.goodreads.com/book/show/13707557-the-gods-of-heavenly-punishment", "num_ratings": "784", "num_reviews": "203", "avg_ratings": 3.82, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "War", "World War II", "War", "Cultural", "Asia", "Literature", "Asian Literature"], "title": "The Gods of Heavenly Punishment", "description": ["In this evocative and thrilling epic novel, fifteen-year-old Yoshi Kobayashi, child of Japan’s New Empire, daughter of an ardent expansionist and a mother with a haunting past, is on her way home on a March night when American bombers shower her city with napalm—an attack that leaves one hundred thousand dead within hours and half the city in ashen ruins. In the days that", "In this evocative and thrilling epic novel, fifteen-year-old Yoshi Kobayashi, child of Japan’s New Empire, daughter of an ardent expansionist and a mother with a haunting past, is on her way home on a March night when American bombers shower her city with napalm—an attack that leaves one hundred thousand dead within hours and half the city in ashen ruins. In the days that follow, Yoshi’s old life will blur beyond recognition, leading her to a new world marked by destruction and shaped by those considered the enemy: Cam, a downed bomber pilot taken prisoner by the Imperial Japanese Army; Anton, a gifted architect who helped modernize Tokyo’s prewar skyline but is now charged with destroying it; and Billy, an Occupation soldier who arrives in the blackened city with a dark secret of his own. Directly or indirectly, each will shape Yoshi’s journey as she seeks safety, love, and redemption."], "author": "Jennifer Cody Epstein", "num_pages": "384", "awards": ["Asian/Pacific American Award for Literature for Adult Fiction Honor (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-11 00:00:00", "ISBN": "039307157X"},
{"url": "https://www.goodreads.com/book/show/13530966-another-sun", "num_ratings": "65", "num_reviews": "19", "avg_ratings": 2.94, "genres": ["Mystery", "Fiction", "Thriller", "Mystery Thriller"], "title": "Another Sun", "description": [" ", "The sun-drenched Caribbean island of Guadeloupe is technically part of France, subject to French law and loyal to the French Republic. But in 1980, the scars of colonialism are still fresh, and ethnic tens", " ", "The sun-drenched Caribbean island of Guadeloupe is technically part of France, subject to French law and loyal to the French Republic. But in 1980, the scars of colonialism are still fresh, and ethnic tensions and political unrest seethe just below the surface of everyday life. ", " ", "French-Algerian judge Anne Marie Laveaud relocated to this beautiful Caribbean island confident that she could make it her new home. But her day-to-day life is rife with frustration. Now she is assigned a murder case in which she is sure the chief suspect, an elderly ex-con named Hégésippe Bray, is a political scapegoat. Her superiors are dismissive of her efforts to prove Bray innocent, and to add insult to injury, Bray himself won’t even speak to her because she’s a woman. But she won’t give up, and Anne Marie’s investigations lead her into a complex tangle of injustice, domestic terrorists, broken hearts, and maybe even voodoo."], "author": "Timothy   Williams", "num_pages": "316", "awards": [], "places": ["Guadeloupe"], "character_names": [], "language": "English", "publish_date": "2013-04-02 00:00:00", "ISBN": "1616951567"},
{"url": "https://www.goodreads.com/book/show/15802306-bird-of-paradise", "num_ratings": "373", "num_reviews": "70", "avg_ratings": 3.94, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Race"], "title": "Bird of Paradise: How I Became Latina", "description": ["In 2009, when Raquel Cepeda almost lost her estranged father to heart disease, she was terrified she’d never know the truth about her ancestry. Every time she looked in the mirror, Cepeda saw a mystery—a tapestry of races and ethnicities that came together in an ambiguous mix. With time running out, she decided to embark on an archaeological dig of sorts by using the scien", "In 2009, when Raquel Cepeda almost lost her estranged father to heart disease, she was terrified she’d never know the truth about her ancestry. Every time she looked in the mirror, Cepeda saw a mystery—a tapestry of races and ethnicities that came together in an ambiguous mix. With time running out, she decided to embark on an archaeological dig of sorts by using the science of ancestral DNA testing to excavate everything she could about her genetic history.", "Digging through memories long buried, she embarks upon a journey not only into her ancestry but also into her own history. Born in Harlem to Dominican parents, she was sent to live with her maternal grandparents in the Paraíso (Paradise) district in Santo Domingo while still a baby. It proved to be an idyllic reprieve in her otherwise fraught childhood. Paraíso came to mean family, home, belonging. When Cepeda returned to the US, she discovered her family constellation had changed. Her mother had a new, abusive boyfriend, who relocated the family to San Francisco. When that relationship fell apart, Cepeda found herself back in New York City with her father and European stepmother: attending tennis lessons and Catholic schools; fighting vicious battles wih her father, who discouraged her from expressing the Dominican part of her hyphenated identity; and immersed in the ’80s hip-hop culture of uptown Manhattan. It was in these streets, through the prism of hip-hop and the sometimes loving embrace of her community, that Cepeda constructed her own identity.", "Years later, when Cepeda had become a successful journalist and documentary filmmaker, the strands of her DNA would take her further, across the globe and into history. Who were her ancestors? How did they—and she—become Latina? Her journey, as the most unforgettable ones often do, would lead her to places she hadn’t expected to go. With a vibrant lyrical prose and fierce honesty, Cepeda parses concepts of race, identity, and ancestral DNA among Latinos by using her own Dominican-American story as one example, and in the process arrives at some sort of peace with her father."], "author": "Raquel Cepeda", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "1451635869"},
{"url": "https://www.goodreads.com/book/show/15799370-montaro-caine", "num_ratings": "521", "num_reviews": "132", "avg_ratings": 3.35, "genres": ["Fiction", "Mystery", "Science Fiction"], "title": "Montaro Caine", "description": ["An inspirational first novel that blends elements of mystery, science fiction, and metaphysics by the beloved, legendary, and bestselling actor Sidney Poitier.", "When a coin is found in a baby's hand, the doctor who finds it sends it up to a lab at MIT, where Montaro Caine, a student, does a work-up on it and discovers it to be made of materials not known on Earth. Caine neve", "An inspirational first novel that blends elements of mystery, science fiction, and metaphysics by the beloved, legendary, and bestselling actor Sidney Poitier.", "When a coin is found in a baby's hand, the doctor who finds it sends it up to a lab at MIT, where Montaro Caine, a student, does a work-up on it and discovers it to be made of materials not known on Earth. Caine never learns the owner's identity, but two decades later, as Caine, now CEO of Fitzer Corp in New York City, is facing the possibility of a hostile corporate takeover and experiencing family troubles, a man and woman appear in his office bearing the coin. The find sets off a battle of intrigue and suspense, as scientists, collectors, and financiers all vie to get their hands on it. But the coin, and a second coin that appears, is of more value than mere monetary worth. In this ambitious, page-turning novel, the beloved actor Sidney Poitier takes us from New York to Europe to the Caribbean in an exploration of race, faith, and, beyond all else, the meaning of our lives on earth."], "author": "Sidney Poitier", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-07 00:00:00", "ISBN": "0385531117"},
{"url": "https://www.goodreads.com/book/show/15793744-earl-the-pearl", "num_ratings": "54", "num_reviews": "9", "avg_ratings": 3.56, "genres": ["Sports and Games", "Sports", "Biography", "Sports", "Basketball"], "title": "Earl The Pearl: My Story", "description": ["Earl “The Pearl” Monroe is a basketball legend whose impact on the game transcends statistics, a player known as much for his unorthodox, “playground” style of play as his championship pedigree. Observers said that watching him play was like listening to jazz, his moves resembling freefloating improvisations. “I don’t know what I’m going to do with the ball,” Monroe once a", "Earl “The Pearl” Monroe is a basketball legend whose impact on the game transcends statistics, a player known as much for his unorthodox, “playground” style of play as his championship pedigree. Observers said that watching him play was like listening to jazz, his moves resembling freefloating improvisations. “I don’t know what I’m going to do with the ball,” Monroe once admitted, “and if I don’t know, I’m quite sure the guy guarding me doesn’t know either.”", "Traded to the New York Knicks before the 1971–72 season, Monroe became a key member of the beloved, star-studded 1972–73 Knicks team that captured the NBA title. And now, on the 40th anniversary of that championship season—the franchise’s last—Monroe is finally ready to tell his remarkable story.", "Written with bestselling author Quincy Troupe (", ") ", " will retrace Monroe’s life from his upbringing in a tough South Philadelphia neighborhood through his record-setting days at Winston-Salem State, to his NBA Rookie of the Year season in 1967, his tremendous years with the Baltimore Bullets and ultimately his redemptive, championship glory with the New York Knicks. The book will culminate with a revealing epilogue in which Monroe reflects on the events of the past 40 years, offers his insights into the NBA today, and his thoughts on the future of the game he loves."], "author": "Earl Monroe", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-23 00:00:00", "ISBN": "1609615611"},
{"url": "https://www.goodreads.com/book/show/15792479-as-sweet-as-honey", "num_ratings": "262", "num_reviews": "61", "avg_ratings": 3.34, "genres": ["Fiction", "Cultural", "India", "Romance", "Literature"], "title": "As Sweet as Honey", "description": ["In her latest novel, Indira Ganesan, a writer often likened to Arundhati Roy and Chitra Divakaruni (see back of jacket for reviews), gives us an enchanting story of family life that is a dance of love and grief and rebirth set on a gorgeous island in the Indian Ocean.", " The island is filled with exotic flora and fauna and perfumed air. A large family compound is presided ove", "In her latest novel, Indira Ganesan, a writer often likened to Arundhati Roy and Chitra Divakaruni (see back of jacket for reviews), gives us an enchanting story of family life that is a dance of love and grief and rebirth set on a gorgeous island in the Indian Ocean.", " The island is filled with exotic flora and fauna and perfumed air. A large family compound is presided over by a benign, stalwart grandmother. There is a very tall South Asian heroine with the astonishing un-Indian name of Meterling, who has found love at last in the shape of a short, round, elegant Englishman who wears white suits. There are also numerous aunts, uncles, and young cousins—among them, Mina, grown now, and telling this story of a marriage ceremony that ends with a widowed bride who, in the midst of her grief, discovers she is pregnant.            ", " While enjoying their own games and growing pains, Mina and her young cousins follow every nuance of gossip, trying to puzzle out what is going on with their favorite aunt, particularly when the groom’s cousin arrives from England and begins to woo her. As Meterling—torn between Eastern and Western ideas of love and family, duty and loyalty—struggles to make a new life, we become as entranced with this family, its adventures and complications, as Mina is.", " And with her we celebrate a time and place where, although sometimes difficult, life was for the most part as sweet as honey.   "], "author": "Indira Ganesan", "num_pages": "288", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2013-02-12 00:00:00", "ISBN": "0307960447"},
{"url": "https://www.goodreads.com/book/show/15824233-the-world-will-follow-joy", "num_ratings": "309", "num_reviews": "55", "avg_ratings": 3.82, "genres": ["Poetry", "Nonfiction", "Feminism", "Cultural", "African American", "Politics", "Love"], "title": "The World Will Follow Joy: Turning Madness into Flowers (New Poems)", "description": ["\"Poetry is leading us,\" writes Alice Walker in ", ". In this dazzling collection, the beloved writer offers over sixty new poems to incite and nurture contemporary activists. Hailed as a “lavishly gifted writer” (", "), Walker imbues her poetry with evocative images, fresh language, anger, forgiveness, and profound wisdom. Casting her poe", "\"Poetry is leading us,\" writes Alice Walker in ", ". In this dazzling collection, the beloved writer offers over sixty new poems to incite and nurture contemporary activists. Hailed as a “lavishly gifted writer” (", "), Walker imbues her poetry with evocative images, fresh language, anger, forgiveness, and profound wisdom. Casting her poetic eye toward history, politics, and nature, as well as to world figures such as Jimmy Carter, Gloria Steinem, and the Dalai Lama, she is indeed a \"muse for our times\" (Amy Goodman).", "By attentively chronicling the conditions of human life today, Walker shows, as ever, her deep compassion, profound spirituality, and necessary political commitments. The poems in ", " remind us of our human capacity to come together and take action, even in our troubled political times. Above all, the gems in this collection illuminate what it means to live in our world today."], "author": "Alice Walker", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-02 00:00:00", "ISBN": "1595588760"},
{"url": "https://www.goodreads.com/book/show/15792900-percival-everett-by-virgil-russell", "num_ratings": "237", "num_reviews": "57", "avg_ratings": 3.7, "genres": ["Fiction", "Literature", "Literary Fiction", "Academic", "Grad School"], "title": "Percival Everett by Virgil Russell", "description": ["A story inside a story inside a story. A man visits his aging father in a nursing home, where his father writes the novel he imagines his son would write. Or is it the novel that the son imagines his father would imagine, if he were to imagine the kind of novel the s", "A story inside a story inside a story. A man visits his aging father in a nursing home, where his father writes the novel he imagines his son would write. Or is it the novel that the son imagines his father would imagine, if he were to imagine the kind of novel the son would write?", "Let’s simplify: a woman seeks an apprenticeship with a painter, claiming to be his long-lost daughter. A contractor-for-hire named Murphy can’t distinguish between the two brothers who employ him. And in Murphy’s troubled dreams, Nat Turner imagines the life of William Styron. These narratives twist together with anecdotes from the nursing home, each building on the other until they crest in a wild, outlandish excursion of the inmates led by the father. Anchoring these shifting plotlines is a running commentary between father and son that sheds doubt on the truthfulness of each story. Because, after all, what narrator can we ever trust?", "Not only is ", " a powerful, compassionate meditation on old age and its humiliations, it is an ingenious culmination of Everett’s recurring preoccupations. All of his prior work, his metaphysical and philosophical inquiries, his investigations into the nature of narrative, have led to this masterful book. Percival Everett has never been more cunning, more brilliant and subversive, than he is in this, his most important and elusive novel to date."], "author": "Percival Everett", "num_pages": "227", "awards": ["PEN/Faulkner Award for Fiction Nominee (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-05 00:00:00", "ISBN": "1555976344"},
{"url": "https://www.goodreads.com/book/show/576650.Half_of_a_Yellow_Sun", "num_ratings": "69,510", "num_reviews": "6,171", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["With effortless grace, celebrated author Chimamanda Ngozi Adichie illuminates a seminal moment in modern African history: Biafra's impassioned struggle to establish an independent republic in southeastern Nigeria during the late 1960s. We experience this tumultuous decade alongside five unforgettable characters: Ugwu, a thirteen-year-old houseboy who works for Odenigbo, a", "With effortless grace, celebrated author Chimamanda Ngozi Adichie illuminates a seminal moment in modern African history: Biafra's impassioned struggle to establish an independent republic in southeastern Nigeria during the late 1960s. We experience this tumultuous decade alongside five unforgettable characters: Ugwu, a thirteen-year-old houseboy who works for Odenigbo, a university professor full of revolutionary zeal; Olanna, the professor’s beautiful young mistress who has abandoned her life in Lagos for a dusty town and her lover’s charm; and Richard, a shy young Englishman infatuated with Olanna’s willful twin sister Kainene. Half of a Yellow Sun is a tremendously evocative novel of the promise, hope, and disappointment of the Biafran war."], "author": "Chimamanda Ngozi Adichie", "num_pages": "448", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2007-01-01 00:00:00", "ISBN": "0007200285"},
{"url": "https://www.goodreads.com/book/show/15815364-how-to-get-filthy-rich-in-rising-asia", "num_ratings": "15,128", "num_reviews": "2,065", "avg_ratings": 3.78, "genres": ["Fiction", "Cultural", "Asia", "Contemporary", "Cultural", "Pakistan", "Literary Fiction"], "title": "How to Get Filthy Rich in Rising Asia", "description": ["From the internationally bestselling author of ", ", the boldly imagined tale of a poor boy's quest for wealth and love. ", "His first two novels established Mohsin Hamid as a radically inventive storyteller with his finger on the world's pulse. ", " meets that reputation, and exceeds it. the astonishing and riveting tal", "From the internationally bestselling author of ", ", the boldly imagined tale of a poor boy's quest for wealth and love. ", "His first two novels established Mohsin Hamid as a radically inventive storyteller with his finger on the world's pulse. ", " meets that reputation, and exceeds it. the astonishing and riveting tale of a man's journey from impoverished rural boy to corporate tycoon, it steals its shape from the business self-help books devoured by ambitious youths all over \"rising Asia.\" It follows its nameless hero to the sprawling metropolis where he begins to amass an empire built on that most fluid, and increasingly scarce, of goods: water. Yet his heart remains set on something else, on the pretty girl whose star rises along with his, their paths crossing and recrossing, a lifelong affair sparked and snuffed and sparked again by the forces that careen their fates along. ", " is a striking slice of contemporary life at a time of crushing upheaval. Romantic without being sentimental, political without being didactic, and spiritual without being religious, it brings an unflinching gaze to the violence and hopes it depicts. And it creates two unforgettable characters who find moments of transcendent intimacy in the midst of shattering change."], "author": "Mohsin Hamid", "num_pages": "230", "awards": ["Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee (2014)", "DSC Prize Nominee for South Asian Literature (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "1594487294"},
{"url": "https://www.goodreads.com/book/show/15798312-the-blind-man-s-garden", "num_ratings": "1,412", "num_reviews": "254", "avg_ratings": 3.77, "genres": ["Fiction", "Cultural", "Pakistan", "Historical", "Historical Fiction", "War", "Contemporary", "Religion"], "title": "The Blind Man's Garden", "description": ["The acclaimed author of ", "now gives us a searing, exquisitely written novel set in Pakistan and Afghanistan in the months following 9/11: a story of war, of one family’s losses, and of the simplest, most enduring human impulses.", " Jeo and Mikal are foster brothers from a small town in Pakistan. Though they were inseparable as children, their adult lives have d", "The acclaimed author of ", "now gives us a searing, exquisitely written novel set in Pakistan and Afghanistan in the months following 9/11: a story of war, of one family’s losses, and of the simplest, most enduring human impulses.", " Jeo and Mikal are foster brothers from a small town in Pakistan. Though they were inseparable as children, their adult lives have diverged: Jeo is a dedicated medical student, married a year; Mikal has been a vagabond since he was fifteen, in love with a woman he can’t have. But when Jeo decides to sneak across the border into Afghanistan—not to fight with the Taliban against the Americans, rather to help care for wounded civilians—Mikal determines to go with him, to protect him. ", " Yet Jeo’s and Mikal’s good intentions cannot keep them out of harm’s way. As the narrative takes us from the wilds of Afghanistan to the heart of the family left behind—their blind father, haunted by the death of his wife and by the mistakes he may have made in the name of Islam and nationhood; Mikal’s beloved brother and sister-in-law; Jeo’s wife, whose increasing resolve helps keep the household running, and her superstitious mother—we see all of these lives upended by the turmoil of war. ", " In language as lyrical as it is piercing, in scenes at once beautiful and harrowing, ", " unflinchingly describes a crucially contemporary yet timeless world in which the line between enemy and ally is indistinct, and where the desire to return home burns brightest of all."], "author": "Nadeem Aslam", "num_pages": "384", "awards": ["The Royal Society of Literature Ondaatje Prize Nominee (2014)", "DSC Prize Nominee for South Asian Literature (2014)"], "places": [], "character_names": ["Rohan", "Naheed", "Tara", "Jeo", "Mikal", "Basie", "Yasmine", "Sophia"], "language": "English", "publish_date": "2013-04-30 00:00:00", "ISBN": "0307961710"},
{"url": "https://www.goodreads.com/book/show/16129174-long-division", "num_ratings": "2,186", "num_reviews": "415", "avg_ratings": 3.78, "genres": ["Fiction", "Science Fiction", "Time Travel", "Science Fiction", "Cultural", "African American", "Young Adult", "Novels", "Fantasy", "Abandoned", "American", "Southern", "Race"], "title": "Long Division", "description": ["Kiese Laymon’s debut novel is a Twain-esque exploration of celebrity, authorship, violence, religion, and coming of age in Post-Katrina Mississippi, written in a voice that’s alternately funny, lacerating, and wise. The book contains two interwoven stories. In the first, it’s 2013: after an on-stage meltdown during a nationally televised quiz contest, 14-year-old Citoyen \"", "Kiese Laymon’s debut novel is a Twain-esque exploration of celebrity, authorship, violence, religion, and coming of age in Post-Katrina Mississippi, written in a voice that’s alternately funny, lacerating, and wise. The book contains two interwoven stories. In the first, it’s 2013: after an on-stage meltdown during a nationally televised quiz contest, 14-year-old Citoyen \"City\" Coldson becomes an overnight YouTube celebrity. The next day, he’s sent to stay with his grandmother in the small coastal community of Melahatchie, where a young girl named Baize Shephard has recently disappeared.", "Before leaving, City is given a strange book without an author called ", " He learns that one of the book’s main characters is also named City Coldson--but ", " is set in 1985. This 1985 City, along with his friend and love-object, Shalaya Crump, discovers a way to travel into the future, and steals a laptop and cellphone from an orphaned teenage rapper called...Baize Shephard. They ultimately take these with them all the way back to 1964, to help another time-traveler they meet protect his family from the Klan.", "City’s two stories ultimately converge in the mysterious work shed behind his grandmother’s, where he discovers the key to Baize’s disappearance."], "author": "Kiese Laymon", "num_pages": "276", "awards": ["William Saroyan International Prize for Writing for Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-11 00:00:00", "ISBN": "1932841725"},
{"url": "https://www.goodreads.com/book/show/17159985-five-star-billionaire", "num_ratings": "3,454", "num_reviews": "475", "avg_ratings": 3.46, "genres": ["Fiction", "Cultural", "China", "Cultural", "Asia", "Contemporary"], "title": "Five Star Billionaire", "description": ["Phoebe is a factory girl who has come to Shanghai with the promise of a job - but when she arrives she discovers that the job doesn't exist", "Phoebe is a factory girl who has come to Shanghai with the promise of a job - but when she arrives she discovers that the job doesn't exist. Gary is a country boy turned pop star who is spinning out of control. Justin is in Shanghai to expand his family's real-estate empire, only to find that he might not be up to the task. He has long harboured a crush on Yinghui, who has reinvented herself from a poetry-loving, left-wing activist to a successful Shanghai businesswoman. She is about to make a deal with the shadowy figure of Walter Chao, the five-star billionaire of the novel, who - with his secrets and his schemes - has a hand in the lives of each of the characters. All bring their dreams and hopes to Shanghai, the shining symbol of the New China, which, like the novel's characters, is constantly in flux and which plays its own fateful role in the lives of its inhabitants. ", "the dazzling kaleidoscopic new novel by the award-winning writer Tash Aw, offers rare insight into China today, with its constant transformations and its promise of possibility."], "author": "Tash Aw", "num_pages": "400", "awards": ["Man Booker Prize Nominee for Longlist (2013)", "Green Carnation Prize Nominee for Longlist (2013)", "POPULAR-The Star Readers’ Choice Awards Nominee for Fiction (2014)"], "places": ["Shanghai"], "character_names": [], "language": null, "publish_date": "2013-07-02 00:00:00", "ISBN": "0670067148"},
{"url": "https://www.goodreads.com/book/show/15802671-strange-fruit", "num_ratings": "16", "num_reviews": "6", "avg_ratings": 2.5, "genres": ["Science Fiction Fantasy", "Fiction", "Cultural", "African American"], "title": "Strange Fruit", "description": [" ", "Traci and Bill Bianco were living the all-American dream, until the world as they knew it came crashing down. ", "Years after a black man is elected President of the United States and the Empire State building is toppled b", " ", "Traci and Bill Bianco were living the all-American dream, until the world as they knew it came crashing down. ", "Years after a black man is elected President of the United States and the Empire State building is toppled by an explosion, the nation is in a state of upheaval. But it’s Hurricane Molly in 2018 and The Stock Market Crash of 2020 that seals the country’s fate. Once the economy takes a nosedive, ordinary Americans must resort to the barter system to get by. ", "Food and shelter are exchanged for labor and initially it seems as though it may work, until the unscrupulous begin to take power and laws are changed. Though Traci and Bill actually fare better than most, economically, they are confronted with a new risk—interracial marriage is once again deemed unlawful and anyone caught is subject to arrest. Soon Traci and their four-year-old daughter are on the run. ", "offers a post-cataclysmic world when desperation reigns supreme and people resort to the cruelties of the past to take control."], "author": "Michelle Janine Robinson", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-19 00:00:00", "ISBN": "1451696507"},
{"url": "https://www.goodreads.com/book/show/16124505-on-sal-mal-lane", "num_ratings": "570", "num_reviews": "115", "avg_ratings": 3.84, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Asia", "Literary Fiction", "Adult", "Adult Fiction"], "title": "On Sal Mal Lane", "description": ["Set against the backdrop of the Sri Lankan civil war, Ru Freeman's epic novel explores the lives of the diverse families that live on Sal Mal Lane and the heartbreaking ways this once harmonious community turns on one another with the country on the brink of war.", "On the day the Herath family moves in, Sal Mal Lane is a quiet street, disturbed only by the cries of the childr", "Set against the backdrop of the Sri Lankan civil war, Ru Freeman's epic novel explores the lives of the diverse families that live on Sal Mal Lane and the heartbreaking ways this once harmonious community turns on one another with the country on the brink of war.", "On the day the Herath family moves in, Sal Mal Lane is a quiet street, disturbed only by the cries of the children whose triumphs and tragedies sustain the families that live there. As each neighbour adapts to the newcomers in different ways, the children fill their days with cricket matches, romantic crushes, and small rivalries.", "But when the tides of civil war begin to turn towards the neighbourhood, their differences ignite in ways no one could have imagined. As the stability of their neighborhood is threatened by clashing political beliefs and prejudices, the children of the community are forced to watch their parents and friends turn against one another. Seen through the children's eyes, the events on Sal Mal Lane come to mirror the course of modern Sri Lanka at its most violent and volatile.", "A powerful, evocative work, ", " masterfully illuminates the origins of this war and explores the lengths family will go to protect one another."], "author": "Ru Freeman", "num_pages": "408", "awards": ["Janet Heidinger Kafka Prize (2013)", "Sister Mariella Gable Prize (2013)", "DSC Prize Nominee for South Asian Literature  for Longlist (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-18 00:00:00", "ISBN": "1770893555"},
{"url": "https://www.goodreads.com/book/show/13814758-blak-al-f-bet", "num_ratings": "29", "num_reviews": "2", "avg_ratings": 4.17, "genres": ["Poetry", "Academic", "School"], "title": "\\blak\\ \\al-fə bet\\", "description": ["The lean, musical poems in this touching second collection depict a southern family after the death of its matriarch. Douglas transcribes the spirit and ghosts of one people's America in poems that are principled and tender."], "author": "Mitchell L.H. Douglas", "num_pages": "80", "awards": ["Lexi Rudnitsky/Editor's Choice Award (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-06 00:00:00", "ISBN": "0892554215"},
{"url": "https://www.goodreads.com/book/show/16240761-the-son", "num_ratings": "26,894", "num_reviews": "3,237", "avg_ratings": 3.99, "genres": ["Historical", "Historical Fiction", "Fiction", "Westerns", "Historical"], "title": "The Son", "description": ["The acclaimed author of American Rust, returns with The Son: an epic, multigenerational saga of power, blood, and land that follows the rise of one unforgettable Texas family from the Comanche raids of the 1800s to the border raids of the early 1900s to the oil booms of the 20th century.", "Part epic of Texas, part classic coming-of-age story, part unflinching portrait of the", "The acclaimed author of American Rust, returns with The Son: an epic, multigenerational saga of power, blood, and land that follows the rise of one unforgettable Texas family from the Comanche raids of the 1800s to the border raids of the early 1900s to the oil booms of the 20th century.", "Part epic of Texas, part classic coming-of-age story, part unflinching portrait of the bloody price of power, The Son is an utterly transporting novel that maps the legacy of violence in the American West through the lives of the McCulloughs, an ambitious family as resilient and dangerous as the land they claim.", "Spring, 1849. The first male child born in the newly established Republic of Texas, Eli McCullough is thirteen years old when a marauding band of Comanche storm his homestead and brutally murder his mother and sister, taking him captive. Brave and clever, Eli quickly adapts to Comanche life, learning their ways and language, answering to a new name, carving a place as the chief's adopted son, and waging war against their enemies, including white men-complicating his sense of loyalty and understanding of who he is. But when disease, starvation, and overwhelming numbers of armed Americans decimate the tribe, Eli finds himself alone. Neither white nor Indian, civilized or fully wild, he must carve a place for himself in a world in which he does not fully belong-a journey of adventure, tragedy, hardship, grit, and luck that reverberates in the lives of his progeny. ", "Intertwined with Eli's story are those of his son, Peter, a man who bears the emotional cost of his father's drive for power, and JA, Eli's great-granddaughter, a woman who must fight hardened rivals to succeed in a man's world.", "Phillipp Meyer deftly explores how Eli's ruthlessness and steely pragmatism transform subsequent generations of McCulloughs. Love, honor, children are sacrificed in the name of ambition, as the family becomes one of the richest powers in Texas, a ranching-and-oil dynasty of unsurpassed wealth and privilege. Yet, like all empires, the McCoulloughs must eventually face the consequences of their choices.", "Harrowing, panoramic, and vividly drawn, The Son is a masterful achievement from a sublime young talent."], "author": "Philipp Meyer", "num_pages": "561", "awards": ["Pulitzer Prize Nominee for Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-28 00:00:00", "ISBN": "0062120395"},
{"url": "https://www.goodreads.com/book/show/15793104-stepping-stone-and-love-machine", "num_ratings": "171", "num_reviews": "25", "avg_ratings": 3.23, "genres": ["Fiction", "Science Fiction", "Science Fiction Fantasy"], "title": "Stepping Stone and Love Machine: Two Short Novels from Crosstown to Oblivion", "description": ["Walter Mosley's talent knows no bounds. ", " and ", "are but two of six fragments in the ", " short novels in which Mosley entertainingly explores life's cosmic questions. From life's meaning to the nature of good and evil, these tales take us on speculative journeys beyond the reality we have come to know. In each tale someone in our wo", "Walter Mosley's talent knows no bounds. ", " and ", "are but two of six fragments in the ", " short novels in which Mosley entertainingly explores life's cosmic questions. From life's meaning to the nature of good and evil, these tales take us on speculative journeys beyond the reality we have come to know. In each tale someone in our world today is given insight into these long pondered mysteries. But how would the world really receive the answers?", "Truman Pope has spent his whole life watching the world go by--and waiting for something he can't quite put into words. A gentle, unassuming soul, he has worked in the mailroom of a large corporation for decades without making waves, until the day he spots a mysterious woman in yellow. A woman nobody else can see.", "Soon Truman's quiet life begins to turn upside-down. An old lover surfaces from his past even as he finds his job in jeopardy. Strange visions haunt his days and nights, until he begins to doubt his sanity. Is he losing his mind, or is he on the brink of a startling revelation that will change his life forever--and transform the nature of humanity?", "The Datascriber was supposed to merely allow individuals to share sensory experiences via a neurological link, but its true potential is even more revolutionary. The brainchild of an eccentric, possibly deranged scientist, the \"Love Machine\" can merge individual psyches and memories into a collective Co-Mind that transcends race, gender, species . . . and even death itself.", "Tricked into joining the Co-Mind, as part of a master plan to take over the world, Lois Kim struggles to adapt to her new reality and abilities. Is there any way back to the life that was stolen from her, or is she destined to lead humanity into a strange new era, despite the opposition of forces both human and otherwise?", "At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied."], "author": "Walter Mosley", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-02 00:00:00", "ISBN": "0765330105"},
{"url": "https://www.goodreads.com/book/show/16129205-apology", "num_ratings": "111", "num_reviews": "33", "avg_ratings": 3.54, "genres": ["Fiction", "Novels", "Realistic Fiction"], "title": "Apology", "description": ["When nine-year-old Tom Serafino’s twin sister Teagan suffers a debilitating brain injury, a police investigation implicates his playmate Mario’s uncle—an immigrant, transient worker known as Shoe. Innocent of the crime but burdened by his own childhood tragedy, Shoe takes the blame for what is in fact an accident caused by his young nephew, ensuring Mario’s chance at a fut", "When nine-year-old Tom Serafino’s twin sister Teagan suffers a debilitating brain injury, a police investigation implicates his playmate Mario’s uncle—an immigrant, transient worker known as Shoe. Innocent of the crime but burdened by his own childhood tragedy, Shoe takes the blame for what is in fact an accident caused by his young nephew, ensuring Mario’s chance at a future publicly unscarred.", "The lines between innocence and guilt, evasions and half-truths, love and duty are blurred. Can a lie born from resignation, fear, and love transform tragedy into hope? And is the life of one man worth the price of that lie?", "Told in vivid scenes alive with imagery and with thematic echoes of John Burnham Schwartz’s ", " and ", ", ", " explores how the decisions we make in an instant reverberate in the years to come. ", " further paints a portrait of sacrifice within two immigrant families raising first-generation Americans. It explores the measure of duty we have toward one another, and the extent to which abandoning the wreckage of family and the past often leads to unexpected consequences.", "Deeply empathetic and beautifully written, ", " marks the novelistic debut of a critically acclaimed Asian American writer."], "author": "Jon Pineda", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-04 00:00:00", "ISBN": "1571311041"},
{"url": "https://www.goodreads.com/book/show/13641208-tenth-of-december", "num_ratings": "49,605", "num_reviews": "6,245", "avg_ratings": 3.97, "genres": ["Short Stories", "Fiction", "Contemporary", "Literary Fiction"], "title": "Tenth of December", "description": ["One of the most important and blazingly original writers of his generation, George Saunders is an undisputed master of the short story, and ", " is his most honest, accessible, and moving collection yet.", "In the taut opening, \"Victory Lab,\" a boy witnesses the attempted abduction of the girl next door and is faced with a harrowing choice: Does he ignore what he", "One of the most important and blazingly original writers of his generation, George Saunders is an undisputed master of the short story, and ", " is his most honest, accessible, and moving collection yet.", "In the taut opening, \"Victory Lab,\" a boy witnesses the attempted abduction of the girl next door and is faced with a harrowing choice: Does he ignore what he sees, or override years of smothering advice from his parents and act? In \"Home,\" a combat-damaged soldier moves back in with his mother and struggles to reconcile the world he left with the one to which he has returned. And in the title story, a stunning meditation on imagination, memory, and loss, a middle-aged cancer patient walks into the woods to commit suicide, only to encounter a troubled young boy who, over the course of a fateful morning, gives the dying man a final chance to recall who he really is. A hapless, deluded owner of an antique store; two mothers struggling to do the right thing; a teenage girl whose idealism is challenged by a brutal brush with reality; a man tormented by a series of pharmaceutical experiments that force him to lust, to love, to kill—the unforgettable characters that populate the pages of ", " are vividly and lovingly infused with Saunders' signature blend of exuberant prose, deep humanity, and stylistic innovation.", "Writing brilliantly and profoundly about class, sex, love, loss, work, despair, and war, Saunders cuts to the core of the contemporary experience. These stories take on the big questions and explore the fault lines of our own morality, delving into the questions of what makes us good and what makes us human.", "Unsettling, insightful, and hilarious, the stories in "], "author": "George Saunders", "num_pages": "251", "awards": ["The Story Prize (2013)", "Folio Prize (2014)", "National Book Award Finalist for Fiction (2013)", "Goodreads Choice Award Nominee for Fiction (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-08 00:00:00", "ISBN": "0812993802"},
{"url": "https://www.goodreads.com/book/show/15808547-rita-moreno", "num_ratings": "1,052", "num_reviews": "172", "avg_ratings": 3.81, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Biography", "Autobiography"], "title": "Rita Moreno: A Memoir", "description": ["In this luminous memoir, Rita Moreno shares her remarkable journey from a young girl with simple beginnings in Puerto Rico  to Hollywood legend—and one of the few performers, and the only Hispanic, to win an Oscar, Grammy, Tony and two Emmys.", " Born Rosita Dolores Alverio in the idyll of Puerto Rico, Moreno, at age five, embarked on a harrowing sea voyage with her mother and", "In this luminous memoir, Rita Moreno shares her remarkable journey from a young girl with simple beginnings in Puerto Rico  to Hollywood legend—and one of the few performers, and the only Hispanic, to win an Oscar, Grammy, Tony and two Emmys.", " Born Rosita Dolores Alverio in the idyll of Puerto Rico, Moreno, at age five, embarked on a harrowing sea voyage with her mother and wound up in the harsh barrios of the Bronx, where she discovered dancing, singing, and acting as ways to escape a tumultuous childhood. Making her Broadway debut  by age thirteen—and moving on to Hollywood in its Golden Age just a few years later—she worked alongside such stars as Gary Cooper,  Yul Brynner, and Ann Miller.", " When discovered by Louis B. Mayer of MGM, the wizard himself declared: “She looks like a Spanish Elizabeth Taylor.”  Cast by Gene Kelly as Zelda Zanders in ", " and then  on to her Oscar-winning performance in", ", she catapulted to fame—yet found herself repeatedly typecast as the “utility ethnic,” a role she found almost impossible to elude.", " Here, for the first time, Rita reflects on her struggles to break through Hollywood’s racial and sexual barriers. She explores the wounded little girl behind the glamorous façade—and what it took to find her place in the world. She talks candidly about her relationship with Elvis Presley, her encounters with  Howard Hughes, and the passionate romance with Marlon Brando that drove her to attempt suicide. And she shares the illusiveness of a  “perfect” marriage and the incomparable joys of motherhood.", " Infused with Rita Moreno’s quick wit and deep insight, this memoir is the dazzling portrait of a stage and screen star who longed to become who she really is—and triumphed."], "author": "Rita Moreno", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "0451416376"},
{"url": "https://www.goodreads.com/book/show/16057215-the-roving-tree", "num_ratings": "106", "num_reviews": "28", "avg_ratings": 3.58, "genres": ["Fiction", "Contemporary", "Race", "Social Issues"], "title": "The Roving Tree", "description": ["\"A gorgeous new novel about a Haitian adoptee finding her way in many different corners of the world.\"", "--Edwidge Danticat, ", "\"Augustave, a first-time novelist, pens a well-balanced story about a young woman, caught between two worlds, who struggles to connect with her heritage...a polished narrative that addresses racism and cultural and class differences and pr", "\"A gorgeous new novel about a Haitian adoptee finding her way in many different corners of the world.\"", "--Edwidge Danticat, ", "\"Augustave, a first-time novelist, pens a well-balanced story about a young woman, caught between two worlds, who struggles to connect with her heritage...a polished narrative that addresses racism and cultural and class differences and provides a wealth of information about vaudou beliefs.\"", "--", "\"Augustave… illustrates the devastating rootlessness of cultural disaffiliation.\"", "--", "\"", " is both a song and a social essay. It provides a window on a world and rounds out by circling back to the prologue.\"", "--", "\"Augustave creates a stunning tale with beautiful language that dwells in the realm of magical realism…The characters are rich, complicated and full of color and nuance.\"", "--", "\"", " is truly an enthralling debut novel that deserves a wide audience; readers will undoubtedly be enriched by their engagement with it.\"", "--SX Salon", "\"The beauty of this book lies in its simplicity. An engaging read that packs a powerful punch.\"", "--Historical Novel Review", "\"", " is Elsie Augustave’s debut novel, and I can’t wait to see what she writes next. Augustave writes beautifully and it’s obvious that she cares a lot about the subject matter she chooses. I definitely recommend ", " to anyone who likes reading literary fiction and/or to anyone who is interested in the ideas and history portrayed in the book.\"", "--Between the Covers", "\"Augustave is a talented writer who brings her varied characters to life and shows readers parts of the world that few of us have experienced. Her book is an excellent anecdote to books about immigration that, intentionally or not, present the western world as the favored or inevitable destination…I strongly recommend ", " to all those who are interested in Haiti, Zaire, and African traditions more generally.\"", "--Me, You, and Books", "\"A beautiful, layered, nuanced story about a woman finding herself.\"", "--NBC COZI TV, ", " summer reading pick", "\"A fulfilling, exciting and ultra-lyrical read, ", " is really a novel about a lost soul’s identity quest.\"", "--Kreyolicious.com", "\"A fresh new voice who adds her own charming, beguiling brand of lyricism to the growing body of Haitian American stories. ", " is a unique and fascinating book, and I for one look forward to hearing more from this writer.\"", "--Lorna Goodison, author of ", "Elsie Augustave's debut novel explores multiple themes: separation and loss, rootlessness, the impact of class privilege and color consciousness, and the search for cultural identity. The central character, Iris Odys, is the offspring of Hagathe, a Haitian maid, and a French-educated mulatto father, Brahami, who cares little about his child. Hagathe, who had always dreamed of a better life for her child, is presented with the perfect opportunity when Iris is five years old. Adopted by a white American couple, Iris is transported from her tiny remote Haitian village, Monn Neg, to an American suburb.", " illuminates how imperfectly assimilated adoptees struggle to remember their original voices and recapture their personal histories and cultural legacy. Set between two worlds—suburban America and Haiti under Papa Doc's repressive regime—the novel offers a unique literary glimpse into the deeply entrenched class discrimination and political repression of Haiti during the Duvalier era, along with the subtle but nonetheless dangerous effects of American racism."], "author": "Elsie Augustave", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-07 00:00:00", "ISBN": "1617751650"},
{"url": "https://www.goodreads.com/book/show/20775537-twelve-years-a-slave", "num_ratings": "73,925", "num_reviews": "5,379", "avg_ratings": 4.17, "genres": ["Nonfiction", "History", "Biography", "Classics", "Autobiography", "Memoir"], "title": "Twelve Years a Slave", "description": ["Twelve Years a Slave, sub-title: Narrative of Solomon Northup, citizen of New-York, kidnapped in Washington city in 1841, and rescued in 1853, from a cotton plantation near the Red River in Louisiana, is a memoir by Solomon Northup as told to and edited by David Wilson. It is a slave narrative of a black man who was born free in New York state but kidnapped in Washington,", "Twelve Years a Slave, sub-title: Narrative of Solomon Northup, citizen of New-York, kidnapped in Washington city in 1841, and rescued in 1853, from a cotton plantation near the Red River in Louisiana, is a memoir by Solomon Northup as told to and edited by David Wilson. It is a slave narrative of a black man who was born free in New York state but kidnapped in Washington, D.C., sold into slavery, and kept in bondage for 12 years in Louisiana. He provided details of slave markets in Washington, D.C. and New Orleans, as well as describing at length cotton and sugar cultivation on major plantations in Louisiana."], "author": "Solomon Northup", "num_pages": "248", "awards": [], "places": ["Louisiana"], "character_names": ["Solomon Northup"], "language": "English", "publish_date": "2014-02-01 00:00:00", "ISBN": "1631680021"},
{"url": "https://www.goodreads.com/book/show/13642271-the-rebellious-life-of-mrs-rosa-parks", "num_ratings": "789", "num_reviews": "147", "avg_ratings": 3.96, "genres": ["Biography", "History", "Nonfiction", "Race", "Cultural", "African American", "Politics"], "title": "The Rebellious Life of Mrs. Rosa Parks", "description": ["Prese", "Presenting a corrective to the popular notion of Rosa Parks as the quiet seamstress who, with a single act, birthed the modern civil rights movement, Theoharis provides a revealing window into Parks’s politics and years of activism. She shows readers how this civil rights movement radical sought—for more than a half a century—to expose and eradicate the American racial-caste system in jobs, schools, public services, and criminal justice."], "author": "Jeanne Theoharis", "num_pages": "336", "awards": [], "places": [], "character_names": ["Rosa Parks"], "language": "English", "publish_date": "2013-01-29 00:00:00", "ISBN": "0807050482"},
{"url": "https://www.goodreads.com/book/show/15793158-a-murder-at-rosamund-s-gate", "num_ratings": "1,664", "num_reviews": "290", "avg_ratings": 3.56, "genres": ["Mystery", "Historical", "Historical Fiction", "Historical", "Fiction", "Mystery", "Historical Mystery", "European Literature", "British Literature"], "title": "A Murder at Rosamund's Gate", "description": ["For Lucy Campion, a seventeenth-century English chambermaid serving in the household of the local magistrate, life is an endless repetition of polishing pewter, emptying chamber pots, and dealing with other household chores until a fellow servant is ruthlessly killed, and someone close to Lucy falls under suspicion. Lucy can't believe it, but in a time where the accused ar", "For Lucy Campion, a seventeenth-century English chambermaid serving in the household of the local magistrate, life is an endless repetition of polishing pewter, emptying chamber pots, and dealing with other household chores until a fellow servant is ruthlessly killed, and someone close to Lucy falls under suspicion. Lucy can't believe it, but in a time where the accused are presumed guilty until proven innocent, lawyers aren't permitted to defend their clients, and—if the plague doesn't kill the suspect first—public executions draw a large crowd of spectators, Lucy knows she may never find out what really happened. Unless, that is, she can uncover the truth herself.", "Determined to do just that, Lucy finds herself venturing out of her expected station and into raucous printers' shops, secretive gypsy camps, the foul streets of London, and even the bowels of Newgate prison on a trail that might lead her straight into the arms of the killer.", "In her debut novel ", ", Susanna Calkins seamlessly blends historical detail, romance, and mystery in a moving and highly entertaining tale."], "author": "Susanna Calkins", "num_pages": "352", "awards": [], "places": ["London, England", "Warwickshire, England"], "character_names": ["Lucy Campion", "Bessie", "Adam"], "language": "English", "publish_date": "2013-04-23 00:00:00", "ISBN": "1250007909"},
{"url": "https://www.goodreads.com/book/show/15814530-happiness-like-water", "num_ratings": "961", "num_reviews": "142", "avg_ratings": 4.02, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Lgbt", "Literature", "African Literature", "Glbt", "Queer"], "title": "Happiness, Like Water", "description": ["Here are Nigerian women at home and transplanted to the United States, building lives out of longing and hope, faith and doubt, the struggle to stay and the mandate to leave, the burden and strength of love. Here are characters faced with dangerous decisions, children slick with oil from the river, a woman in love with another despite the penalties. Here is a world marked", "Here are Nigerian women at home and transplanted to the United States, building lives out of longing and hope, faith and doubt, the struggle to stay and the mandate to leave, the burden and strength of love. Here are characters faced with dangerous decisions, children slick with oil from the river, a woman in love with another despite the penalties. Here is a world marked by electricity outages, lush landscapes, folktales, buses that break down and never start up again. Here is a portrait of Nigerians that is surprising, shocking, heartrending, loving, and across social strata, dealing in every kind of change. Here are stories filled with language to make your eyes pause and your throat catch. ", "introduces a true talent, a young writer with a beautiful heart and a capacious imagination."], "author": "Chinelo Okparanta", "num_pages": "196", "awards": ["New York Public Library Young Lions Fiction Award Nominee (2014)", "Lambda Literary Award for Lesbian General Fiction (2014)", "Society of Midland Authors Award Nominee for Adult Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-13 00:00:00", "ISBN": "0544003454"},
{"url": "https://www.goodreads.com/book/show/15798021-my-beloved-world", "num_ratings": "22,083", "num_reviews": "2,997", "avg_ratings": 4.05, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Politics"], "title": "My Beloved World", "description": ["The first Latinx (Puerto Rican) and third woman appointed to the US Supreme Court, Sonia Sotomayor has become an instant American icon. Now, with a candor and intimacy never undertaken by a sitting Justice, she recounts her life from a Bronx housing project to the federal bench, a journey that offers an inspiring testament to her own extraordinary determination and the pow", "The first Latinx (Puerto Rican) and third woman appointed to the US Supreme Court, Sonia Sotomayor has become an instant American icon. Now, with a candor and intimacy never undertaken by a sitting Justice, she recounts her life from a Bronx housing project to the federal bench, a journey that offers an inspiring testament to her own extraordinary determination and the power of believing in oneself. ", "Here is the story of a precarious childhood, with an alcoholic father (who would die when she was 9) and a devoted but overburdened mother, and of the refuge a little girl took from the turmoil at home with her passionately spirited paternal grandmother. But it was when she was diagnosed with juvenile diabetes that the precocious Sonia recognized she must ultimately depend on herself.  She would learn to give herself the insulin shots she needed to survive and soon imagined a path to a different life.", "With only television characters for her professional role models, and little understanding of what was involved, she determined to become a lawyer, a dream that would sustain her on an unlikely course, from valedictorian of her high school class to the highest honors at Princeton, Yale Law School, the New York County District Attorney’s office, private practice, and appointment to the Federal District Court before the age of 40.", "She speaks with warmth and candor about her invaluable mentors, a failed marriage, and the modern version of extended family she has created from cherished friends and their children. Through her still-astonished eyes, America’s infinite possibilities are envisioned anew in this warm and honest book, destined to become a classic of self-invention and self-discovery."], "author": "Sonia Sotomayor", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-01-15 00:00:00", "ISBN": "0307913112"},
{"url": "https://www.goodreads.com/book/show/13642504-sugar-in-the-blood", "num_ratings": "630", "num_reviews": "118", "avg_ratings": 3.88, "genres": ["History", "Nonfiction", "Biography", "Historical"], "title": "Sugar in the Blood: A Family's Story of Slavery and Empire", "description": ["In the late 1630s, lured by the promise of the New World, Andrea Stuart’s earliest known maternal ancestor, George Ashby, set sail from England to settle in Barbados. He fell into the life of a sugar plantation owner by mere chance, but by the time he harvested his first crop, a revolution was fully under way: the farming of sugar cane, and the swiftly increasing demands f", "In the late 1630s, lured by the promise of the New World, Andrea Stuart’s earliest known maternal ancestor, George Ashby, set sail from England to settle in Barbados. He fell into the life of a sugar plantation owner by mere chance, but by the time he harvested his first crop, a revolution was fully under way: the farming of sugar cane, and the swiftly increasing demands for sugar worldwide, would not only lift George Ashby from abject poverty and shape the lives of his descendants, but it would also bind together ambitious white entrepreneurs and enslaved black workers in a strangling embrace. Stuart uses her own family story—from the seventeenth century through the present—as the pivot for this epic tale of migration, settlement, survival, slavery and the making of the Americas.", "As it grew, the sugar trade enriched Europe as never before, financing the Industrial Revolution and fueling the Enlightenment. And, as well, it became the basis of many economies in South America, played an important part in the evolution of the United States as a world power and transformed the Caribbean into an archipelago of riches. But this sweet and hugely profitable trade--“white gold,” as it was known--had profoundly less palatable consequences in its precipitation of the enslavement of Africans to work the fields on the islands and, ultimately, throughout the American continents.", "Interspersing the tectonic shifts of colonial history with her family’s experience, Stuart explores the interconnected themes of settlement, sugar and slavery with extraordinary subtlety and sensitivity. In examining how these forces shaped her own family--its genealogy, intimate relationships, circumstances of birth, varying hues of skin--she illuminates how her family, among millions of others like it, in turn transformed the society in which they lived, and how that interchange continues to this day. Shifting between personal and global history, Stuart gives us a deepened understanding of the connections between continents, between black and white, between men and women, between the free and the enslaved. It is a story brought to life with riveting and unparalleled immediacy, a story of fundamental importance to the making of our world."], "author": "Andrea Stuart", "num_pages": "384", "awards": [], "places": ["Barbados", "British Empire"], "character_names": [], "language": "English", "publish_date": "2013-01-22 00:00:00", "ISBN": "0307272834"},
{"url": "https://www.goodreads.com/book/show/15790940-sister-mine", "num_ratings": "1,029", "num_reviews": "198", "avg_ratings": 3.71, "genres": ["Fantasy", "Fiction", "Fantasy", "Urban Fantasy", "Science Fiction", "Speculative Fiction", "Disability", "Fantasy", "Mythology", "Science Fiction Fantasy", "Magical Realism", "Lgbt"], "title": "Sister Mine", "description": ["SISTER MINE", "Now adults, Makeda and Abby still share their childhood home. The surgery to separate the two girls gave Abby a permanent limp, but left Makeda with what feels like an even worse deformity: no mojo. The daughters of a celestial demigod and a human woman, Makeda and Abby were raised by their magical father, the god of growing things--a highly unusual childhood that made them extremely close. Ever since Abby's magical talent began to develop, though, in the form of an unearthly singing voice, the sisters have become increasingly distant.", "Today, Makeda has decided it's high time to move out and make her own life among the other nonmagical, claypicken humans--after all, she's one of them. In Cheerful Rest, a run-down warehouse space, Makeda finds exactly what she's been looking for: an opportunity to live apart from Abby and begin building her own independent life. There's even a resident band, led by the charismatic (and attractive) building superintendent.", "But when her father goes missing, Makeda will have to discover her own talent--and reconcile with Abby--if she's to have a hope of saving him . . ."], "author": "Nalo Hopkinson", "num_pages": "320", "awards": ["Sunburst Award Nominee for Adult (2014)", "Andre Norton Award for Young Adult Science Fiction and Fantasy (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-12 00:00:00", "ISBN": "0446576921"},
{"url": "https://www.goodreads.com/book/show/15811130-searching-for-zion", "num_ratings": "229", "num_reviews": "35", "avg_ratings": 3.84, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Africa", "Travel", "History", "Religion"], "title": "Searching for Zion: The Quest for Home in the African Diaspora", "description": ["A decade in the making, Emily Raboteau’s ", " takes readers around the world on an unexpected adventure of faith. Both one woman’s quest for a place to call “home” and an investigation into a people’s search for the Promised Land, this landmark work of creative nonfiction is a trenchant inquiry into contemporary and historical ethnic displacement.", "At the age o", "A decade in the making, Emily Raboteau’s ", " takes readers around the world on an unexpected adventure of faith. Both one woman’s quest for a place to call “home” and an investigation into a people’s search for the Promised Land, this landmark work of creative nonfiction is a trenchant inquiry into contemporary and historical ethnic displacement.", "At the age of twenty-three, award-winning writer Emily Raboteau traveled to Israel to visit her childhood best friend. While her friend appeared to have found a place to belong, Raboteau could not yet say the same for herself. As a biracial woman from a country still divided along racial lines, she’d never felt at home in America. But as a reggae fan and the daughter of a historian of African-American religion, Raboteau knew of \"Zion\" as a place black people yearned to be. She’d heard about it on Bob Marley’s ", " and in the speeches of Martin Luther King. She understood it as a metaphor for freedom, a spiritual realm rather than a geographical one. Now in Israel, the Jewish Zion, she was surprised to discover black Jews. More surprising was the story of how they got there. Inspired by their exodus, Raboteau sought out other black communities that left home in search of a Promised Land. Her question for them is same she asks herself: have you found the home you’re looking for? ", "On her ten-year journey back in time and around the globe, through the Bush years and into the age of Obama, Raboteau wanders to Jamaica, Ethiopia, Ghana, and the American South to explore the complex and contradictory perspectives of Black Zionists. She talks to Rastafarians and African Hebrew Israelites, Evangelicals and Ethiopian Jews, and Katrina transplants from her own family—people that have risked everything in search of territory that is hard to define and harder to inhabit. Uniting memoir with historical and cultural investigation, Raboteau overturns our ideas of place and patriotism, displacement and dispossession, citizenship and country in a disarmingly honest and refreshingly brave take on the pull of the story of ", "."], "author": "Emily  Raboteau", "num_pages": "320", "awards": ["American Book Award (2014)", "Hurston/Wright Legacy Award Nominee for Nonfiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-01 00:00:00", "ISBN": "0802120032"},
{"url": "https://www.goodreads.com/book/show/16032127-revenge", "num_ratings": "5,247", "num_reviews": "811", "avg_ratings": 3.87, "genres": ["Short Stories", "Fiction", "Horror", "Cultural", "Japan", "Asian Literature", "Japanese Literature"], "title": "Revenge", "description": ["Sinister forces draw together a cast of desperate characters in this eerie and absorbing novel from ", "An aspiring writer moves into a new apartment and discovers that her landlady has murdered her husband. Years later, the writer’s stepson reflects upon his stepmother and the strange stories she used to tell him. Meanwhile, a surgeon’s lover vows to kill him if he", "Sinister forces draw together a cast of desperate characters in this eerie and absorbing novel from ", "An aspiring writer moves into a new apartment and discovers that her landlady has murdered her husband. Years later, the writer’s stepson reflects upon his stepmother and the strange stories she used to tell him. Meanwhile, a surgeon’s lover vows to kill him if he does not leave his wife. Before she can follow-through on her crime of passion, though, the surgeon will cross paths with another remarkable woman, a cabaret singer whose heart beats delicately outside of her body. But when the surgeon promises to repair her condition, he sparks the jealousy of another man who would like to preserve the heart in a custom tailored bag. Murderers and mourners, mothers and children, lovers and innocent bystanders—their fates converge in a darkly beautiful web that they are each powerless to escape.", "Macabre, fiendishly clever, and with a touch of the supernatural, Yoko Ogawa’s Revenge creates a haunting tapestry of death—and the afterlife of the living."], "author": "Yōko Ogawa", "num_pages": "162", "awards": ["Independent Foreign Fiction Prize Nominee (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15753060-oleander-girl", "num_ratings": "4,129", "num_reviews": "589", "avg_ratings": 3.69, "genres": ["Fiction", "Cultural", "India", "Romance", "Contemporary"], "title": "Oleander Girl", "description": ["Beloved by critics and readers, Chitra Banerjee Divakaruni has been hailed by ", " as a “brilliant storyteller” and by ", " magazine as a “skilled cartographer of the hea", "Beloved by critics and readers, Chitra Banerjee Divakaruni has been hailed by ", " as a “brilliant storyteller” and by ", " magazine as a “skilled cartographer of the heart”. Now, Divakaruni returns with her most gripping novel yet.", "Orphaned at birth, seventeen-year-old Korobi Roy is the scion of a distinguished Kolkata family and has enjoyed a privileged, sheltered childhood with her adoring grandparents. But she is troubled by the silence that surrounds her parents’ death and clings fiercely to her only inheritance from them: the love note she found hidden in her mother's book of poetry. Korobi dreams of one day finding a love as powerful as her parents', and it seems her wish has come true when she meets the charming Rajat, the only son of a high-profile business family.", "But shortly after their engagement, a heart attack kills Korobi's grandfather, revealing serious financial problems and a devastating secret about Korobi's past. Shattered by this discovery and by her grandparents' betrayal, Korobi undertakes a courageous search across post 9/11 America to find her true identity. Her dramatic, often startling journey will, ultimately, thrust her into the most difficult decision of her life."], "author": "Chitra Banerjee Divakaruni", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-19 00:00:00", "ISBN": "1451695659"},
{"url": "https://www.goodreads.com/book/show/17262100-the-lowland", "num_ratings": "74,203", "num_reviews": "7,643", "avg_ratings": 3.83, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Literary Fiction"], "title": "The Lowland", "description": ["Epic in its canvas and intimate in its portrayal of lives undone and forged anew, The Lowland is a deeply felt novel of family ties that entangle and fray in ways unforeseen and unrevealed, of ties that ineluctably define who we are", "From Subhash's earliest memories, at every point, his brother was there. In the suburban streets of Calcutta where they wandered before dusk an", "Epic in its canvas and intimate in its portrayal of lives undone and forged anew, The Lowland is a deeply felt novel of family ties that entangle and fray in ways unforeseen and unrevealed, of ties that ineluctably define who we are", "From Subhash's earliest memories, at every point, his brother was there. In the suburban streets of Calcutta where they wandered before dusk and in the hyacinth-strewn ponds where they played for hours on end, Udayan was always in his older brother's sight. So close in age, they were inseparable in childhood and yet, as the years pass - as U.S tanks roll into Vietnam and riots sweep across India - their brotherly bond can do nothing to forestall the tragedy that will upend their lives. ", "Udayan - charismatic and impulsive - finds himself drawn to the Naxalite movement, a rebellion waged to eradicate inequity and poverty. He will give everything, risk all, for what he believes, and in doing so will transform the futures of those dearest to him: his newly married, pregnant wife, his brother and their parents. For all of them, the repercussions of his actions will reverberate across continents and seep through the generations that follow. ", "Epic in its canvas and intimate in its portrayal of lives undone and forged anew, The Lowland is a deeply felt novel of family ties that entangle and fray in ways unforeseen and unrevealed, of ties that ineluctably define who we are. With all the hallmarks of Jhumpa Lahiri's achingly poignant, exquisitely empathetic story-telling, this is her most devastating work of fiction to date."], "author": "Jhumpa Lahiri", "num_pages": "340", "awards": ["Man Booker Prize Nominee (2013)", "NAIBA Book of the Year for Fiction (2014)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (2014)", "National Book Award Finalist for Fiction (2013)", "Goodreads Choice Award Nominee for Fiction (2013)", "DSC Prize for South Asian Literature (2015)"], "places": ["Calcutta", "Providence, Rhode Island", "Kolkata", "Rhode Island"], "character_names": ["Subhash Mitra"], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "0307265749"},
{"url": "https://www.goodreads.com/book/show/15798797-mom-me-mom", "num_ratings": "13,932", "num_reviews": "1,611", "avg_ratings": 4.17, "genres": ["Nonfiction", "Autobiography", "Memoir", "Feminism", "Biography"], "title": "Mom & Me & Mom", "description": ["The story of Maya Angelou’s extraordinary life has been chronicled in her multiple bestselling autobiographies. But now, at last, the legendary author shares the deepest personal story of her life: her relationship with her mother.", "  ", " For the first time, Angelou reveals the triumphs and struggles of being the daughter of Vivian Baxter, an indomitabl", "The story of Maya Angelou’s extraordinary life has been chronicled in her multiple bestselling autobiographies. But now, at last, the legendary author shares the deepest personal story of her life: her relationship with her mother.", "  ", " For the first time, Angelou reveals the triumphs and struggles of being the daughter of Vivian Baxter, an indomitable spirit whose petite size belied her larger-than-life presence—a presence absent during much of Angelou’s early life. When her marriage began to crumble, Vivian famously sent three-year-old Maya and her older brother away from their California home to live with their grandmother in Stamps, Arkansas. The subsequent feelings of abandonment stayed with Angelou for years, but their reunion, a decade later, began a story that has never before been told. In ", ", Angelou dramatizes her years reconciling with the mother she preferred to simply call “Lady,” revealing the profound moments that shifted the balance of love and respect between them.", "  ", " Delving into one of her life’s most rich, rewarding, and fraught relationships, ", " explores the healing and love that evolved between the two women over the course of their lives, the love that fostered Maya Angelou’s rise from immeasurable depths to reach impossible heights."], "author": "Maya Angelou", "num_pages": "201", "awards": [], "places": [], "character_names": ["Maya Angelou"], "language": "English", "publish_date": "2013-04-02 00:00:00", "ISBN": "1400066115"},
{"url": "https://www.goodreads.com/book/show/15811545-a-tale-for-the-time-being", "num_ratings": "67,184", "num_reviews": "9,124", "avg_ratings": 3.99, "genres": ["Fiction", "Cultural", "Japan", "Historical", "Historical Fiction", "Magical Realism", "Contemporary"], "title": "A Tale for the Time Being", "description": ["In Tokyo, sixteen-year-old Nao has decided there’s only one escape from her aching loneliness and her classmates’ bullying, but before she ends it all, Nao plans to document the life of her great-grandmother, a Buddhist nun who’s lived more than a century. A diary is Nao’s only solace—and will touch lives in a ways she can scarcely imagine.", "Across the Pacific, we meet Ruth,", "In Tokyo, sixteen-year-old Nao has decided there’s only one escape from her aching loneliness and her classmates’ bullying, but before she ends it all, Nao plans to document the life of her great-grandmother, a Buddhist nun who’s lived more than a century. A diary is Nao’s only solace—and will touch lives in a ways she can scarcely imagine.", "Across the Pacific, we meet Ruth, a novelist living on a remote island who discovers a collection of artifacts washed ashore in a Hello Kitty lunchbox—possibly debris from the devastating 2011 tsunami. As the mystery of its contents unfolds, Ruth is pulled into the past, into Nao’s drama and her unknown fate, and forward into her own future. ", "Full of Ozeki’s signature humour and deeply engaged with the relationship between writer and reader, past and present, fact and fiction, quantum physics, history, and myth, ", " is a brilliantly inventive, beguiling story of our shared humanity and the search for home."], "author": "Ruth Ozeki", "num_pages": "422", "awards": ["Man Booker Prize Nominee (2013)", "Sunburst Award for Adult (2014)", "Los Angeles Times Book Prize for Fiction (2013)", "PEN Open Book Award Nominee for Longlist (2014)", "National Book Critics Circle Award Nominee for Fiction (2013)", "The Kitschies for Red Tentacle (Novel) (2013)", "Andrew Carnegie Medal Nominee for Fiction (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "Asian/Pacific American Award for Literature for Adult Fiction (2013)"], "places": ["Tokyo", "Cortes Island, British Columbia"], "character_names": ["Naoko Yasutani", "Ruth Ozeki", "Haruki Yasutani", "Jiko Yasutani"], "language": "English", "publish_date": "2013-03-12 00:00:00", "ISBN": "0670026638"},
{"url": "https://www.goodreads.com/book/show/15802824-a-deeper-love-inside", "num_ratings": "4,197", "num_reviews": "459", "avg_ratings": 4.02, "genres": ["Fiction", "Cultural", "African American", "Urban"], "title": "A Deeper Love Inside: The Porsche Santiaga Story", "description": ["THE SEQUEL MILLIONS OF READERS HAVE BEEN WAITING FOR... At last, mega-bestselling author Sister Souljah delivers the stunning sequel to ", ". Fierce, raw, and filled with adventure and emotional intensity, ", "is an unforgettable coming-of-age story in the words of Porsche Santiaga, Winter’s younger sister.", "Sharp-tongued, quick-witted Por", "THE SEQUEL MILLIONS OF READERS HAVE BEEN WAITING FOR... At last, mega-bestselling author Sister Souljah delivers the stunning sequel to ", ". Fierce, raw, and filled with adventure and emotional intensity, ", "is an unforgettable coming-of-age story in the words of Porsche Santiaga, Winter’s younger sister.", "Sharp-tongued, quick-witted Porsche worships her sister Winter. Cut from the same cloth as her father, Ricky Santiaga, Porsche is also a natural-born hustler. Passionate and loyal to the extreme, she refuses to accept her new life in group homes, foster care, and juvenile detention after her family is torn apart. Porsche—unique, young, and beautiful—cries as much as she fights and uses whatever she has to reclaim her status. Unselfish, she pushes to get back everything that ever belonged to her wealthy, loving family.", "In ", "readers will encounter their favorite characters from ", "including Winter and Midnight. Sister Souljah’s soulful writing will again move your heart and open your eyes to a shocking reality."], "author": "Sister Souljah", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15811505-ghana-must-go", "num_ratings": "7,568", "num_reviews": "1,004", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Ghana", "Contemporary"], "title": "Ghana Must Go", "description": ["Kweku Sai is dead. A renowned surgeon and failed husband, he succumbs suddenly at dawn outside his home in suburban Accra. The news of Kweku’s death sends a ripple around the world, bringing together the family he abandoned years before. ", " is their story. Electric, exhilarating, beautifully crafted, Ghana Must Go is a testament to the transformative power of un", "Kweku Sai is dead. A renowned surgeon and failed husband, he succumbs suddenly at dawn outside his home in suburban Accra. The news of Kweku’s death sends a ripple around the world, bringing together the family he abandoned years before. ", " is their story. Electric, exhilarating, beautifully crafted, Ghana Must Go is a testament to the transformative power of unconditional love, from a debut novelist of extraordinary talent.  ", "Moving with great elegance through time and place, ", "charts the Sais’ circuitous journey to one another. In the wake of Kweku’s death, his children gather in Ghana at their enigmatic mother’s new home. The eldest son and his wife; the mysterious, beautiful twins; the baby sister, now a young woman: each carries secrets of his own. What is revealed in their coming together is the story of how they came apart: the hearts broken, the lies told, the crimes committed in the name of love. Splintered, alone, each navigates his pain, believing that what has been lost can never be recovered—until, in Ghana, a new way forward, a new family, begins to emerge.", "is at once a portrait of a modern family, and an exploration of the importance of where we come from to who we are. In a sweeping narrative that takes us from Accra to Lagos to London to New York, ", " teaches that the truths we speak can heal the wounds we hide."], "author": "Taiye Selasi", "num_pages": "336", "awards": ["PEN Open Book Award Nominee for Shortlist (2014)"], "places": ["Accra", "Boston, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "1594204497"},
{"url": "https://www.goodreads.com/book/show/16130095-lowcountry-spirit", "num_ratings": "263", "num_reviews": "44", "avg_ratings": 3.75, "genres": ["Historical", "Historical Fiction", "Fiction", "Fantasy", "Paranormal", "Fantasy"], "title": "Lowcountry Spirit", "description": ["Meet Emmaline, Celestia, and Liza, three slave girls on a haunted barrier island in Georgia lowcountry.", "Emmaline is a mouthy, stubborn young woman who has magic in her blood and conjures the stronge", "Meet Emmaline, Celestia, and Liza, three slave girls on a haunted barrier island in Georgia lowcountry.", "Emmaline is a mouthy, stubborn young woman who has magic in her blood and conjures the strongest spells with hardly any effort. Celestia was ten when her mother was sold and taken from the island. She’s never stopped longing for her, even when the talking chain—a verbal underground railroad—sends word that her mother has been taken to a plantation in North Carolina. By the time she turns sixteen, she can no longer bring her mother’s face to mind, but she can still hear her urging Celestia to be thankful and keep safe. Liza was a birthday gift to the plantation’s mistress. Her mama was killed for throwing a spell on her master. Before she died she gave Liza her book of conjures, so she could protect herself. And when Liza hatches a plan for all three of them to escape, the three girls’ lives collide. What they don’t realize is that their chances of successfully escaping are slim, and the possibility that all three will die before they leave the island is more likely..."], "author": "Ann Hite", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-12 00:00:00", "ISBN": "1451692323"},
{"url": "https://www.goodreads.com/book/show/15781725-the-house-girl", "num_ratings": "48,949", "num_reviews": "4,677", "avg_ratings": 3.75, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "The House Girl", "description": ["A stunning debut novel of love, family, and justice that intertwines the stories of an escaped house slave in 1852 Virginia and ambitious young lawyer in contemporary New York ", "Virginia, 1852. Seventeen-year-old Josephine Bell decides to run from the failing tobacco farm where she is a slave and nurse to her ailing mistress, the aspiring artist Lu Anne Bell. ", "New York City,", "A stunning debut novel of love, family, and justice that intertwines the stories of an escaped house slave in 1852 Virginia and ambitious young lawyer in contemporary New York ", "Virginia, 1852. Seventeen-year-old Josephine Bell decides to run from the failing tobacco farm where she is a slave and nurse to her ailing mistress, the aspiring artist Lu Anne Bell. ", "New York City, 2004. Lina Sparrow, an ambitious first-year associate in an elite law firm, is given a difficult, highly sensitive assignment that could make her career: she must find the \"perfect plaintiff\" to lead a historic class-action lawsuit worth trillions of dollars in reparations for descendants of American slaves. ", "It is through her father, the renowned artist Oscar Sparrow, that Lina discovers Josephine Bell and a controversy roiling the art world: are the iconic paintings long ascribed to Lu Anne Bell really the work of her house slave, Josephine? A descendant of Josephine's would be the perfect face for the reparations lawsuit - if Lina can find one. While following the runaway girl's faint trail through old letters and plantation records, Lina finds herself questioning her own family history and the secrets that her father has never revealed: How did Lina's mother die? And why will he never speak about her? ", "Moving between antebellum Virginia and modern-day New York, this searing, suspenseful and heartbreaking tale of art and history, love and secrets, explores what it means to repair a wrong and asks whether truth is sometimes more important than justice."], "author": "Tara Conklin", "num_pages": "370", "awards": ["Goodreads Choice Award Nominee for Fiction (2013)"], "places": ["Virginia"], "character_names": [], "language": "English", "publish_date": "2013-02-12 00:00:00", "ISBN": "0062207393"},
{"url": "https://www.goodreads.com/book/show/16169867-buck", "num_ratings": "1,551", "num_reviews": "242", "avg_ratings": 4.2, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Cultural", "African American"], "title": "Buck: A Memoir", "description": ["  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But t", "  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But things fell apart, and a decade later MK was in America, a teenager lost in a fog of drugs, sex, and violence on the streets of North Philadelphia. Now he was alone—his mother in a mental hospital, his father gone, his older brother locked up in a prison on the other side of the country—and forced to find his own way to survive physically, mentally, and spiritually, by any means necessary.", " is a powerful memoir of how a precocious kid educated himself through the most unconventional teachers—outlaws and eccentrics, rappers and mystic strangers, ghetto philosophers and strippers, and, eventually, an alternative school that transformed his life with a single blank sheet of paper. It’s a one-of-a-kind story about finding your purpose in life, and an inspiring tribute to the power of education, art, and love to heal and redeem us."], "author": "M.K. Asante", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "0812993411"},
{"url": "https://www.goodreads.com/book/show/16130093-the-storycatcher", "num_ratings": "932", "num_reviews": "204", "avg_ratings": 3.86, "genres": ["Historical", "Historical Fiction", "Fiction", "Gothic", "Mystery", "Historical", "Paranormal", "Ghosts", "Fantasy", "Paranormal"], "title": "The Storycatcher", "description": ["Shelly Parker never much liked Faith Dobbins, the uppity way that girl bossed her around. But they", "Shelly Parker never much liked Faith Dobbins, the uppity way that girl bossed her around. But they had more in common than she knew. Shelly tried to ignore the haints that warned her Faith’s tyrannical father, Pastor Dobbins, was a devil in disguise. But when Faith started acting strange, Shelly couldn’t avoid the past—not anymore. ", "Critically acclaimed, award-winning author Ann Hite beckons readers back to the Depression-era South, from the saltwater marshes of Georgia’s coast to the whispering winds of North Carolina’s mystical Black Mountain, in a mesmerizing gothic tale about the dark family secrets that come back to haunt us."], "author": "Ann Hite", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-10 00:00:00", "ISBN": "1451692315"},
{"url": "https://www.goodreads.com/book/show/13320466-the-twelve-tribes-of-hattie", "num_ratings": "33,033", "num_reviews": "4,884", "avg_ratings": 3.47, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Historical", "Audiobook"], "title": "The Twelve Tribes of Hattie", "description": ["A debut of extraordinary distinction: Ayana Mathis tells the story of the children of the Great Migration through the trials of one unforgettable family. ", " In 1923, fifteen-year-old Hattie Shepherd flees Georgia and settles in Philadelphia, hoping for a chance at a better life. Instead, she marries a man who will bring her nothing but disappointment and watches helplessly a", "A debut of extraordinary distinction: Ayana Mathis tells the story of the children of the Great Migration through the trials of one unforgettable family. ", " In 1923, fifteen-year-old Hattie Shepherd flees Georgia and settles in Philadelphia, hoping for a chance at a better life. Instead, she marries a man who will bring her nothing but disappointment and watches helplessly as her firstborn twins succumb to an illness a few pennies could have prevented.  Hattie gives birth to nine more children whom she raises with grit and mettle and not an ounce of the tenderness they crave.  She vows to prepare them for the calamitous difficulty they are sure to face in their later lives, to meet a world that will not love them, a world that will not be kind. Captured here in twelve luminous narrative threads, their lives tell the story of a mother’s monumental courage and the journey of a nation. ", " Beautiful and devastating, Ayana Mathis’s ", " is wondrous from first to last—glorious, harrowing, unexpectedly uplifting, and blazing with life. An emotionally transfixing page-turner, a searing portrait of striving in the face of insurmountable adversity, an indelible encounter with the resilience of the human spirit and the driving force of the American dream, Mathis’s first novel heralds the arrival of a major new voice in contemporary fiction. "], "author": "Ayana Mathis", "num_pages": "243", "awards": ["Black Caucus of the American Library Association Literary Award for 1st Novelist (2013)", "Hurston/Wright Legacy Award Nominee for Fiction (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-06 00:00:00", "ISBN": "0385350287"},
{"url": "https://www.goodreads.com/book/show/15796700-americanah", "num_ratings": "169,639", "num_reviews": "16,436", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Feminism", "Literary Fiction"], "title": "Americanah", "description": ["Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a d", "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London. Fifteen years later, they reunite in a newly democratic Nigeria, and reignite their passion—for each other and for their homeland.", "Source: chimamanda.com"], "author": "Chimamanda Ngozi Adichie", "num_pages": "477", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0307271080"}
]