[
{"url": "https://www.goodreads.com/book/show/5981872-the-madness-of-lord-ian-mackenzie", "num_ratings": "24,596", "num_reviews": "2,146", "avg_ratings": 4.06, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Adult"], "title": "The Madness of Lord Ian Mackenzie", "description": ["The year is 1881. Meet the Mackenzie family—rich, powerful, dangerous, eccentric. A lady couldn't be seen with them without ruin. Rumors surround them—of tragic violence, of their mistresses, of their dark appetites, of scandals that set England and Scotland abuzz. ", "The youngest brother, Ian, known as the Mad Mackenzie, spent most of his young life in an asylum, and everyon", "The year is 1881. Meet the Mackenzie family—rich, powerful, dangerous, eccentric. A lady couldn't be seen with them without ruin. Rumors surround them—of tragic violence, of their mistresses, of their dark appetites, of scandals that set England and Scotland abuzz. ", "The youngest brother, Ian, known as the Mad Mackenzie, spent most of his young life in an asylum, and everyone agrees he is decidedly odd. He's also hard and handsome and has a penchant for Ming pottery and beautiful women. ", "Beth Ackerley, widow, has recently come into a fortune. She has decided that she wants no more drama in her life. She was raised in drama—an alcoholic father who drove them into the workhouse, a frail mother she had to nurse until her death, a fussy old lady she became constant companion to. No, she wants to take her money and find peace, to travel, to learn art, to sit back and fondly remember her brief but happy marriage to her late husband. ", "And then Ian Mackenzie decides he wants her. ", "The first of a new historical series."], "author": "Jennifer Ashley", "num_pages": "320", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Romance & Most Tortured Hero & Best Historical Set in the U.K. & Best Love Scenes & Honorable Mention for Best Romance Heroine (2010)", "Romantic Times Reviewers' Choice Award (RT Award) for Most Innovative Historical Romance (2009)", "DABWAHA Romance Tournament for Best Historical Romance (2010)", "Readers' Crown Award by RomCon® (Romance Conventions Inc.) for Best Historical Romance (2010)"], "places": ["London, England", "Paris", "Castle Kilmorgan, Scotland"], "character_names": ["Lord Ian Mackenzie", "Beth (Ackerley) Mackenzie", "Isabella (Scranton) Mackenzie", "Daniel Mackenzie", "Hart Mackenzie, Duke of Kilmorgan", "Lord Cameron Mackenzie", "Lord Roland \"Mac\" Mackenzie", "Lloyd Fellows"], "language": "English", "publish_date": "2009-05-01 00:00:00", "ISBN": "0843960434"},
{"url": "https://www.goodreads.com/book/show/39403.Love_Is_Blind", "num_ratings": "3,590", "num_reviews": "225", "avg_ratings": 4.0, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Love Is Blind", "description": ["He'd been warned that Lady Clarissa Crambray was dangerous. Stomping on toes and burning piffles, the chestnut haired beauty was clearly a force with which to be reckoned. But for Adrian Montfort, Earl of Mowbray, veteran of the Napoleonic wars, this was just the challenge he needed. He could handle one woman and her \"unfortunate past.\" Could any woma", "He'd been warned that Lady Clarissa Crambray was dangerous. Stomping on toes and burning piffles, the chestnut haired beauty was clearly a force with which to be reckoned. But for Adrian Montfort, Earl of Mowbray, veteran of the Napoleonic wars, this was just the challenge he needed. He could handle one woman and her \"unfortunate past.\" Could any woman handle him?", "Lady Clarissa Crambray wanted a husband, but maybe not as much as her mother wanted one for her. Really! Doffing her spectacles might make a girl prettier, but how would she see? She'd already caused enough mayhem to earn a rather horrible nickname. Yet, as all other suitors seemed to shy away in terror, there came a man to lead her to the dance floor. A dark, handsome blur of a man.", "Clumsy Clarissa was about to stumble onto true love."], "author": "Lynsay Sands", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-01 00:00:00", "ISBN": "0843955007"},
{"url": "https://www.goodreads.com/book/show/485439.Gallant_Waif", "num_ratings": "1,196", "num_reviews": "105", "avg_ratings": 3.86, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical Romance", "Regency Romance", "Historical", "Historical Fiction"], "title": "Gallant Waif", "description": ["Kate Farleigh was absolutely stunned when her refusal to accept Lady Cahill's offer of \"charity\" resulted in her being swept away in her sumptuous carriage. But the real reason behind the older woman's antics became stunningly clear upon meeting Lady Cahill's enigmatic grandson, Jack Carstairs. ", "Wounded in the Peninsular War, di", "Kate Farleigh was absolutely stunned when her refusal to accept Lady Cahill's offer of \"charity\" resulted in her being swept away in her sumptuous carriage. But the real reason behind the older woman's antics became stunningly clear upon meeting Lady Cahill's enigmatic grandson, Jack Carstairs. ", "Wounded in the Peninsular War, disowned by his father and dumped by his fiancee, Jack had shut himself up in his country estate, but Kate had no patience with such behavior. Suddenly, Jack found himself with a purpose, trying to steer clear of Miss Farleigh's attempts to interfere with his chosen lifestyle. Why, if he wasn't careful, Kate just might succeed in her attempts to make him want to rejoin the human race!"], "author": "Anne Gracie", "num_pages": "297", "awards": ["RITA Award by Romance Writers of America Nominee for Best First Book (2000)", "OKRWA National Readers Choice Award (2001)"], "places": ["London, England"], "character_names": ["Jack Carstairs", "Kate Farleigh"], "language": "English", "publish_date": "2001-04-01 00:00:00", "ISBN": "0373291574"},
{"url": "https://www.goodreads.com/book/show/8563824-the-many-sins-of-lord-cameron", "num_ratings": "11,549", "num_reviews": "759", "avg_ratings": 4.09, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "The Many Sins of Lord Cameron", "description": ["Cameron Mackenzie is a man who loves only horses and women—in that order—or so his mistresses say.", "Ainsley Douglas is a woman with a strong sense of justice and the desire to help others—even if that means sneaking around a rakish man's bedchamber.", "Which is exactly where Cam finds her—six years after he caught her the firs", "Cameron Mackenzie is a man who loves only horses and women—in that order—or so his mistresses say.", "Ainsley Douglas is a woman with a strong sense of justice and the desire to help others—even if that means sneaking around a rakish man's bedchamber.", "Which is exactly where Cam finds her—six years after he caught her the first time. Only then, she convinced Cam she was seeking a liaison, but couldn't go through with it because of her husband. Now a widow, she's on a mission to retrieve letters that could prove embarrassing to the queen. Cam has no interest in Ainsley's subterfuge, but he vows to finish what they started those many years ago. One game, one kiss at a time, he plans to seduce her. And what starts out as a lusty diversion may break Cam's own rules—and heal the scars of a dark and damaging past..."], "author": "Jennifer Ashley", "num_pages": "298", "awards": ["RITA Award by Romance Writers of America Nominee for Historical Romance (2012)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Innovative Historical Romance (2011)", "Australian Romance Readers Association (ARRA) Award Nominee for Favourite Historical Romance (2011)"], "places": ["London, England", "Paris", "Monte Carlo", "Scottish Highlands"], "character_names": ["Lord Ian Mackenzie", "Beth (Ackerley) Mackenzie", "Isabella (Scranton) Mackenzie", "Ainsley (Douglas) Mackenzie", "Daniel Mackenzie", "Hart Mackenzie, Duke of Kilmorgan", "Lord Cameron Mackenzie", "Lord Roland \"Mac\" Mackenzie"], "language": "English", "publish_date": "2011-08-02 00:00:00", "ISBN": "0425240495"},
{"url": "https://www.goodreads.com/book/show/17725791-embattled-minds", "num_ratings": "2,420", "num_reviews": "260", "avg_ratings": 4.18, "genres": ["Romance", "War", "Military Fiction", "Romance", "Contemporary Romance", "Contemporary", "Romance", "Romantic Suspense"], "title": "Embattled Minds", "description": ["Zeke Foster has little to no experience with women over the past couple of years, after being injured in Afghanistan. Brutally scarred, he has no expectation that he’ll ever find a woman capable of accepting him the way he is. But he can’t help but be enamored of Ember, the waitress of a local watering hole.", "Ember Norton’s life has turned into one devastating catastrophe af", "Zeke Foster has little to no experience with women over the past couple of years, after being injured in Afghanistan. Brutally scarred, he has no expectation that he’ll ever find a woman capable of accepting him the way he is. But he can’t help but be enamored of Ember, the waitress of a local watering hole.", "Ember Norton’s life has turned into one devastating catastrophe after another. When the scarred soldier with the kind eyes brings some security to her life, she’s afraid to trust her luck. She’s been self-sufficient for a long time. But his wounded soul calls to her and she finds herself falling for him. ", "In spite of the secrets he continues to keep."], "author": "J.M. Madden", "num_pages": "204", "awards": [], "places": [], "character_names": ["Ember Norton", "Zeke Foster"], "language": null, "publish_date": "2013-06-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11785513-she-tempts-the-duke", "num_ratings": "4,644", "num_reviews": "302", "avg_ratings": 3.88, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "She Tempts the Duke", "description": ["Three young heirs, imprisoned by an unscrupulous uncle, escaped—to the sea, to the streets, to faraway battle—awaiting the day when they would return to reclaim their birthright. ", "Sebastian Easton always vowed he would avenge his stolen youth and title. Now back in London, the rightful Duke of Keswick—returning from battle a wounded, hardened, changed man—cannot forget the", "Three young heirs, imprisoned by an unscrupulous uncle, escaped—to the sea, to the streets, to faraway battle—awaiting the day when they would return to reclaim their birthright. ", "Sebastian Easton always vowed he would avenge his stolen youth and title. Now back in London, the rightful Duke of Keswick—returning from battle a wounded, hardened, changed man—cannot forget the brave girl who once rescued him and his brothers from certain death. ", "Lady Mary Wynne-Jones paid dearly for helping the imprisoned young Lords of Pembrook, and she remembers well the promise she made to Sebastian all those years ago: to meet him once more in the abbey ruins where they shared a bold, forbidden kiss. While Mary is betrothed now to another, a friendship forged with dark secrets cannot be ignored. Unexpected passion soon burns dangerously between them, tempting Sebastian to abandon his quest for retribution to fight for a love that could once again set him free."], "author": "Lorraine Heath", "num_pages": "355", "awards": [], "places": ["London, England"], "character_names": ["Sebastian Easton (Duke of Keswick)", "Mary Wynne-Jones"], "language": "English", "publish_date": "2012-01-31 00:00:00", "ISBN": "0062022466"},
{"url": "https://www.goodreads.com/book/show/156565.The_Leopard_Prince", "num_ratings": "8,289", "num_reviews": "505", "avg_ratings": 3.9, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "The Leopard Prince", "description": ["Wealthy Lady Georgina Maitland doesn't want a husband, though she could use a good steward to run her estates. One look at Harry Pye, and Georgina knows she's not just dealing with a servant, but a man.", "Harry has known many aristocrats - including one particular nobleman who is his sworn enemy. But Harry has never met", "Wealthy Lady Georgina Maitland doesn't want a husband, though she could use a good steward to run her estates. One look at Harry Pye, and Georgina knows she's not just dealing with a servant, but a man.", "Harry has known many aristocrats - including one particular nobleman who is his sworn enemy. But Harry has never met a beautiful lady so independent, uninhibited, and eager to be in his arms.", "Still, it's impossible to conduct a discreet liaison when poisoned sheep, murdered villagers, and an enraged magistrate have the county in an uproar. The locals blame Harry for everything. Soon it's all Georgina can do to keep her head above water and Harry's out of the noose...without missing another night of love."], "author": "Elizabeth Hoyt", "num_pages": "372", "awards": ["RITA Award by Romance Writers of America Nominee for Historical Romance (2008)"], "places": ["Yorkshire, England"], "character_names": ["Lady Georgina Maitland", "Harry Pye"], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "0446618489"},
{"url": "https://www.goodreads.com/book/show/584004.The_Morning_Side_of_Dawn", "num_ratings": "244", "num_reviews": "18", "avg_ratings": 4.06, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Category Romance", "Harlequin"], "title": "The Morning Side of Dawn", "description": ["A brief, fated moment at a wedding, and Cassie Cameron was hooked. She'd been unable to forget Dar Cordell, though months had passed. Who could explain it? She was surrounded by handsome, glamorous men every day, and yet somehow Dar had touched her soul...in a once-in-a-lifetime way.", "Someone else had his eye on Cassie,", "A brief, fated moment at a wedding, and Cassie Cameron was hooked. She'd been unable to forget Dar Cordell, though months had passed. Who could explain it? She was surrounded by handsome, glamorous men every day, and yet somehow Dar had touched her soul...in a once-in-a-lifetime way.", "Someone else had his eye on Cassie, and time was running out when fate cruelly chose to reunite her with Dar. Suddenly the obstacles they faced were greater than ever - their very lives were on the line. Would one moment of passion have to last them a lifetime?"], "author": "Justine Davis", "num_pages": "256", "awards": ["RITA Award by Romance Writers of America for Best Long Contemporary Series Romance (1996)"], "places": [], "character_names": ["Cassandra Cameron", "Dar Cordell"], "language": "English", "publish_date": "1995-11-16 00:00:00", "ISBN": "0373076746"},
{"url": "https://www.goodreads.com/book/show/10429836-a-night-to-surrender", "num_ratings": "15,665", "num_reviews": "1,240", "avg_ratings": 3.78, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency", "Adult"], "title": "A Night to Surrender", "description": ["Spindle Cove is the destination of choice for certain types of well-bred young ladies: the painfully shy, young wives disenchanted with matrimony, and young girls too enchanted with the wrong men; it is a haven for those", "Spindle Cove is the destination of choice for certain types of well-bred young ladies: the painfully shy, young wives disenchanted with matrimony, and young girls too enchanted with the wrong men; it is a haven for those who live there. ", "Victor Bramwell, the new Earl of Rycliff, knows he doesn't belong here. So far as he can tell, there's nothing in this place but spinsters... and sheep. But he has no choice, he has orders to gather a militia. It's a simple mission, made complicated by the spirited, exquisite Susanna Finch—a woman who is determined to save her personal utopia from the invasion of Bram's makeshift army. ", "Susanna has no use for aggravating men; Bram has sworn off interfering women. The scene is set for an epic battle... but who can be named the winner when both have so much to lose?"], "author": "Tessa Dare", "num_pages": "372", "awards": ["RITA Award by Romance Writers of America for Best Regency Historical Romance (2012)", "Romantic Times Reviewers' Choice Award (RT Award) for Best Historical Love & Laughter (2011)"], "places": ["Sussex, England"], "character_names": ["Kate Taylor", "Lieutenant Colonel Victor Bramwell", "Susanna Finch", "Colin Frederick Sandhurst, Viscount Payne", "Minerva Highwood"], "language": "English", "publish_date": "2011-08-30 00:00:00", "ISBN": "0062049836"},
{"url": "https://www.goodreads.com/book/show/896625.A_Rose_in_Winter", "num_ratings": "9,101", "num_reviews": "466", "avg_ratings": 4.15, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Fiction"], "title": "A Rose in Winter", "description": ["A HEART TORMENTED ", "Erienne's father had given her hand to the richest suitor. She was now Lady Saxton, mistress of a great manor all but ruined by fire, wife to a man whose mysteriously shrouded form aroused fear and pity. Yet even as she fell in love with her adoring husband, Erienne despaired of freeing her heart from the dashingly handsome Yankee who couldn't forget her.", "A HEART TORMENTED ", "Erienne's father had given her hand to the richest suitor. She was now Lady Saxton, mistress of a great manor all but ruined by fire, wife to a man whose mysteriously shrouded form aroused fear and pity. Yet even as she fell in love with her adoring husband, Erienne despaired of freeing her heart from the dashingly handsome Yankee who couldn't forget her. The beautiful Erienne, once filled with young dreams of romance, was now a wife and woman ... torn between the two men she loved."], "author": "Kathleen E. Woodiwiss", "num_pages": "567", "awards": [], "places": ["England"], "character_names": ["Christopher Seton", "Erienne Fleming"], "language": "English", "publish_date": "1983-10-16 00:00:00", "ISBN": "0380844001"},
{"url": "https://www.goodreads.com/book/show/7102657-a-hearing-heart", "num_ratings": "879", "num_reviews": "76", "avg_ratings": 3.71, "genres": ["Romance", "Historical Romance", "Historical", "Romance", "Westerns", "Historical", "Historical Fiction", "Disability", "Romance", "Western Romance"], "title": "A Hearing Heart", "description": ["After the death of her fiancé, Catherine Johnson, a New York schoolteacher in 1901, travels to Nebraska to teach a one-room school and escape her sad memories. One afternoon, violence erupts in the sleepy town. Catherine saves deaf stable hand, Jim Kinney, from torture by drunken thugs.", "As she takes charge of his education, teaching him to read and sign, attraction grows be", "After the death of her fiancé, Catherine Johnson, a New York schoolteacher in 1901, travels to Nebraska to teach a one-room school and escape her sad memories. One afternoon, violence erupts in the sleepy town. Catherine saves deaf stable hand, Jim Kinney, from torture by drunken thugs.", "As she takes charge of his education, teaching him to read and sign, attraction grows between them. The warmth and humor in this silent man transcends the need for speech and his eyes tell her all she needs to know about his feelings for her. But the obstacles of class difference and the stigma of his handicap are almost insurmountable barriers to their growing attachment.", "Will Catherine flout society’s rules and allow herself to love again? Can Jim make his way out of poverty as a deaf man in a hearing world? And together will they beat the corrupt robber baron who has a stranglehold on the town?", "Romance, love and sensuality abound in this jam-packed, old-fashioned tale with plenty of heart and some steaming hot sex."], "author": "Bonnie Dee", "awards": [], "places": ["Broughton, Nebraska"], "character_names": ["Catherine Johnson", "Jim Kinney"], "language": "English", "publish_date": "2009-08-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/50718.This_Is_All_I_Ask", "num_ratings": "3,624", "num_reviews": "219", "avg_ratings": 4.28, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Medieval", "Science Fiction", "Time Travel", "Historical", "Historical Fiction", "Fiction", "Historical Romance", "Medieval Romance", "Fantasy", "Romance", "Clean Romance"], "title": "This Is All I Ask", "description": ["Gillian of Warewick knows no other treatment than the terrible physical and mental abuse issued by her father. When he arranges a match for Gillian with Christopher of Blackmour, she is fearful: Blackmour is rumored to be an evil sorcerer. When Gillian meets him, he proves to be far more of a man than her father is, yet he is unwilling to be a lover to Gillian. She finds t", "Gillian of Warewick knows no other treatment than the terrible physical and mental abuse issued by her father. When he arranges a match for Gillian with Christopher of Blackmour, she is fearful: Blackmour is rumored to be an evil sorcerer. When Gillian meets him, he proves to be far more of a man than her father is, yet he is unwilling to be a lover to Gillian. She finds that Blackmour has as many psychological scars to heal as she has physical scars."], "author": "Lynn Kurland", "num_pages": "432", "awards": [], "places": ["England"], "character_names": ["Gillian of Warewick", "Christopher Blackmour"], "language": "English", "publish_date": "2000-10-01 00:00:00", "ISBN": "0425180336"},
{"url": "https://www.goodreads.com/book/show/227636.Lord_Carew_s_Bride", "num_ratings": "2,125", "num_reviews": "124", "avg_ratings": 3.9, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Regency", "Historical", "Historical", "Historical Fiction", "Historical Romance", "Regency Romance"], "title": "Lord Carew's Bride", "description": ["Samantha Newman is getting older, but though she is beautiful and courted by a large number of gentlemen, she is restless and unhappy. While she is staying in the country with her friends Jennifer and Gabriel, she takes a walk alone and wanders onto the property of the reclusive Marquess of Carew. She meets him far from the house and mistakes him for a landscape designer.", "Samantha Newman is getting older, but though she is beautiful and courted by a large number of gentlemen, she is restless and unhappy. While she is staying in the country with her friends Jennifer and Gabriel, she takes a walk alone and wanders onto the property of the reclusive Marquess of Carew. She meets him far from the house and mistakes him for a landscape designer. He is an ordinary-looking man and is half crippled. He is also friendly and unassuming, and Samantha soon relaxes into a warm friendship with him. It is only much later, back in London, when she is again threatened by the man who broke her heart years ago during her come-out Season, that Samantha discovers who her friend really is. And this time she is tempted to settle for the contentment of friendship in order to escape the pain of love."], "author": "Mary Balogh", "num_pages": "224", "awards": ["RITA Award by Romance Writers of America Nominee for Regency Romance (1996)"], "places": [], "character_names": ["Samantha Newman", "Hartley Wade"], "language": "English", "publish_date": "1995-06-01 00:00:00", "ISBN": "0451185528"},
{"url": "https://www.goodreads.com/book/show/7781699-ten-ways-to-be-adored-when-landing-a-lord", "num_ratings": "16,055", "num_reviews": "1,149", "avg_ratings": 3.91, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency"], "title": "Ten Ways to Be Adored When Landing a Lord", "description": ["Since being named on of London’s “Lords to Land” by a popular ladies’ magazine, Nicholas St. John has been relentlessly pursued by every matrimony-minded female in the ton. So when an opportunity to escape fashionable society presents itself, he eagerly jumps—only t", "Since being named on of London’s “Lords to Land” by a popular ladies’ magazine, Nicholas St. John has been relentlessly pursued by every matrimony-minded female in the ton. So when an opportunity to escape fashionable society presents itself, he eagerly jumps—only to land in the path of the most determined, damnably delicious woman he’s ever met!", "The daughter of a titled wastrel, Lady Isabel Townsend has too many secrets and too little money. Though used to taking care of herself quite handily, her father’s recent passing has left Isabel at sea and in need of outside help to protect her young brother’s birthright. The sinfully handsome, eminently eligible Lord Nicholas could be the very salvation she seeks.", "But the lady must be wary and not do anything reckless… like falling madly, passionately in love."], "author": "Sarah MacLean", "num_pages": "384", "awards": [], "places": ["Yorkshire, England", "London, England"], "character_names": ["Lord Nicholas St. John", "Lady Isabel Townsend"], "language": "English", "publish_date": "2010-10-26 00:00:00", "ISBN": "0061852066"},
{"url": "https://www.goodreads.com/book/show/15507958-me-before-you", "num_ratings": "851,789", "num_reviews": "75,486", "avg_ratings": 4.26, "genres": ["Romance", "Fiction", "Contemporary", "Womens Fiction", "Chick Lit"], "title": "Me Before You", "description": ["Louisa Clark is an ordinary young woman living an exceedingly ordinary life—steady boyfriend, close family—who has never been farther afield than their tiny village. She takes a badly needed job working for ex-Master of the Universe Will Traynor, who is wheelchair-bound after an accident. Will has always lived a huge life—big deals, extreme sports, worldwide travel—and now", "Louisa Clark is an ordinary young woman living an exceedingly ordinary life—steady boyfriend, close family—who has never been farther afield than their tiny village. She takes a badly needed job working for ex-Master of the Universe Will Traynor, who is wheelchair-bound after an accident. Will has always lived a huge life—big deals, extreme sports, worldwide travel—and now he’s pretty sure he cannot live the way he is.", " Will is acerbic, moody, bossy—but Lou refuses to treat him with kid gloves, and soon his happiness means more to her than she expected. When she learns that Will has shocking plans of his own, she sets out to show him that life is still worth living.", "A love story for this generation, ", " brings to life two people who couldn’t have less in common—a heartbreakingly romantic novel that asks, What do you do when making the person you love happy also means breaking your own heart?"], "author": "Jojo Moyes", "num_pages": "369", "awards": ["Goodreads Choice Award Nominee for Fiction (2013)"], "places": [], "character_names": ["Will Traynor", "Louisa \"Lou\" Clark"], "language": "English", "publish_date": "2012-12-31 00:00:00", "ISBN": "0670026603"},
{"url": "https://www.goodreads.com/book/show/110394.Dancing_at_Midnight", "num_ratings": "10,041", "num_reviews": "425", "avg_ratings": 3.81, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction", "Historical Romance", "Regency Romance"], "title": "Dancing at Midnight", "description": [" has beauty and a brain, and she’s tired of men who can see only one without the other.", "When a suitor tells Arabella he’s willing to overlook her appalling bluestocking tendencies on account of her looks and fortune, she decides to take a break from the Marriage Mart. During an extended stay in the country, she never expects to meet ", ",", " has beauty and a brain, and she’s tired of men who can see only one without the other.", "When a suitor tells Arabella he’s willing to overlook her appalling bluestocking tendencies on account of her looks and fortune, she decides to take a break from the Marriage Mart. During an extended stay in the country, she never expects to meet ", ", a wounded war hero who intrigues her like no other man.", "Lord John has lived through the worst horrors of war… but nothing could have been as terrifying to his tormented heart as Lady Arabella. She is intoxicating, infuriating… and she makes him want to live again. Suddenly he’s writing bad poetry and climbing trees in the pitch-dark night… just so he can dance with her as the clock strikes midnight. And even though he knows he can never be the sort of man she deserves, he can’t help wanting her. But when the harsh light of day replaces the magic of midnight, can this tormented soul learn to love again?"], "author": "Julia Quinn", "num_pages": "375", "awards": [], "places": ["Oxfordshire, England"], "character_names": ["Lady Arabella Blydon", "Lord John Blackwood"], "language": "English", "publish_date": "2009-08-25 00:00:00", "ISBN": "0380780755"},
{"url": "https://www.goodreads.com/book/show/2213158.The_Warrior_s_Touch", "num_ratings": "484", "num_reviews": "26", "avg_ratings": 3.81, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Medieval", "Category Romance", "Harlequin", "European Literature", "Irish Literature"], "title": "The Warrior's Touch", "description": ["Connor MacEgan is a fighter; it's in his blood. But when his hands are crushed in a brutal attack, he finds he may never wield a sword, or touch a woman, ever again.", "He becomes reliant on Aileen A\" Duinne, whose determination matches his, for Aileen can no more ignore a person in pain than Connor can stop being a warrior.", "But she also holds a secret, one of passion and decep", "Connor MacEgan is a fighter; it's in his blood. But when his hands are crushed in a brutal attack, he finds he may never wield a sword, or touch a woman, ever again.", "He becomes reliant on Aileen A\" Duinne, whose determination matches his, for Aileen can no more ignore a person in pain than Connor can stop being a warrior.", "But she also holds a secret, one of passion and deception that could break their hearts, long after she has mended his hands....\""], "author": "Michelle Willingham", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-16 00:00:00", "ISBN": "0373294662"},
{"url": "https://www.goodreads.com/book/show/359270.Blind_Curve", "num_ratings": "195", "num_reviews": "16", "avg_ratings": 3.71, "genres": ["Romance", "Romantic Suspense", "Romance", "Contemporary", "Suspense", "Fiction", "Thriller", "Mystery Thriller", "Mystery"], "title": "Blind Curve", "description": ["From Darkness Bullets are whizzing around him, but he can't shoot back. In the middle of a weapons bust, undercover cop Danny Sinofsky suddenly goes blind. Now this man who has always looked out for himself can't cross a room without the help of his mobility instructor, Martha Crowe. Furious and frustrated, he'd almost rather die than live this way-and someone is more than", "From Darkness Bullets are whizzing around him, but he can't shoot back. In the middle of a weapons bust, undercover cop Danny Sinofsky suddenly goes blind. Now this man who has always looked out for himself can't cross a room without the help of his mobility instructor, Martha Crowe. Furious and frustrated, he'd almost rather die than live this way-and someone is more than willing to grant him his wish. To Danger Hiding her emotions beneath a calm, practical facade, Martha is sure Danny doesn't remember her, the plain girl from his high school who had a crush on him. When she witnesses an attack on his life, the two are thrown into a safe house, and this man without sight starts to see deep inside the soul of a courageous, passionate woman. Their very lives will depend on their fragile connection-and their ability to move as one, combining Danny's razor-sharp instincts with Martha's eyes. Because an enemy is stalking them both, moving in closer and closer for the kill."], "author": "Annie Solomon", "num_pages": "384", "awards": ["HOLT Medallion by Virginia Romance Writers for Romantic Suspense (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-02-01 00:00:00", "ISBN": "0446613584"},
{"url": "https://www.goodreads.com/book/show/693018.Midnight_Angel", "num_ratings": "5,290", "num_reviews": "286", "avg_ratings": 3.65, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "Midnight Angel", "author": "Lisa Kleypas", "num_pages": "373", "awards": [], "places": ["London, England"], "character_names": ["Lucas Stokehurst", "Anastasia Kaptereva"], "language": "English", "publish_date": "1995-01-01 00:00:00", "ISBN": "0380773538"},
{"url": "https://www.goodreads.com/book/show/11545997-paradox", "num_ratings": "25", "num_reviews": "2", "avg_ratings": 3.72, "genres": [], "title": "Paradox", "description": ["A diverse collection of romantic short stories featuring men with disabilities from a variety of dev authors such as Annabelle Costa, Ruth Madison, Amy Ahn, and Sakura Sakuran. Including an introduction by the famed reviewer, DevoGirl.", "Tokyo Story - Sumiko has feelings for her friend Hiroki, a congenital amputee, but can their friendship develop into something more?", "Knight i", "A diverse collection of romantic short stories featuring men with disabilities from a variety of dev authors such as Annabelle Costa, Ruth Madison, Amy Ahn, and Sakura Sakuran. Including an introduction by the famed reviewer, DevoGirl.", "Tokyo Story - Sumiko has feelings for her friend Hiroki, a congenital amputee, but can their friendship develop into something more?", "Knight in Shining Metal - After an unsuccessful night out on the town, paraplegic Ricky meets an unexpected woman and learns there’s more than one kind of damsel in distress", "The Best Friend - Two friends: one gorgeous and the other cute, kind, but in a wheelchair. Libby is so busy pursuing the first, will she ever realize the feelings she has for the other are more than just friendship?", "The Surgeon - Joel was a promising surgeon with a career on the rise when an accident left him a low-level quad with limited use of his hands. His confidence shattered, he can't see the real motives of the two women who are interested in him.", "...and more.", "140K words (approximately 400 pages). The majority of the proceeds are donated to the charity organization LifeRollsOn.Org"], "author": "Lee Nilsen", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-02-13 00:00:00", "ISBN": "145838490X"},
{"url": "https://www.goodreads.com/book/show/2974804-running-hot", "num_ratings": "8,502", "num_reviews": "349", "avg_ratings": 4.07, "genres": ["Fantasy", "Paranormal", "Romance", "Romance", "Paranormal Romance", "Mystery", "Romance", "Romantic Suspense", "Contemporary"], "title": "Running Hot", "description": ["Ex-cop Luther Malone, lifelong member of the secretive paranormal organization known as the Arcane Society, is waiting to meet Grace Renquist. Hired as an aura-reading consultant in the quest for a murder suspect, she’s got zero field experience. She’s from tiny Eclipse Bay, Oregon. She’s a librarian, for heaven’s sake.", "As for Grace, she’s not expecting much either from Mal", "Ex-cop Luther Malone, lifelong member of the secretive paranormal organization known as the Arcane Society, is waiting to meet Grace Renquist. Hired as an aura-reading consultant in the quest for a murder suspect, she’s got zero field experience. She’s from tiny Eclipse Bay, Oregon. She’s a librarian, for heaven’s sake.", "As for Grace, she’s not expecting much either from Malone, who walks with a cane and isn’t so good with a gun. Nice résumé for a bodyguard . . .", "But even before they reach their hotel in Maui—where they’ll be posing as honeymooners—Grace and Luther feel the electric charge between them. Problem is, they need to remain vigilant day and night, because it soon becomes clear there’s more going on here. Rogue sensitives—operatives for the underground group Nightshade—are pouring into the luxury resort like there’s a convention. Grace recognizes those dark spikes in their auras. She saw the same pattern in someone else in another life—a life she hasn’t revealed to Luther or anyone else. And she understands how dangerous these people can be . . . especially with those para-hunters at their sides.", "While the pair’s employers at Jones & Jones scramble to get them backup, Luther and Grace have to think on their feet. The criminals in their midst aren’t just high-level sensitives: They’ve enhanced their talents with a potent—and unpredictable—drug. And as Grace knows all too well, if you don’t control your powers, your powers will control you. . . ."], "author": "Jayne Ann Krentz", "num_pages": "337", "awards": [], "places": ["Maui, Hawaii"], "character_names": ["Luther Malone", "Grace Renquist"], "language": "English", "publish_date": "2008-12-30 00:00:00", "ISBN": "039915521X"},
{"url": "https://www.goodreads.com/book/show/9470293-never-a-gentleman", "num_ratings": "2,287", "num_reviews": "261", "avg_ratings": 3.64, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Never a Gentleman", "description": ["Miss Grace Fairchild is under no illusions about her charms. Painfully plain, she is a soldier's daughter who has spent her life being useful, not learning the treacherous ways of the ton. She may have been caught in a scandal with society's favorite rogue, but how can she marry him when it means losing herself?", "Miss Grace Fairchild is under no illusions about her charms. Painfully plain, she is a soldier's daughter who has spent her life being useful, not learning the treacherous ways of the ton. She may have been caught in a scandal with society's favorite rogue, but how can she marry him when it means losing herself?", "Diccan Hilliard doesn't know which of his enemies drugged him and dumped him in Grace's bed, but he does know the outcome. He and Grace must marry. To his surprise, a wild, heady passion flares between them. Yet Diccan is trapped in a deadly game of intrigue Grace knows nothing about. Will his lies destroy Grace just as he realizes how desperately he needs her? And how can he hope for a future with her, when an old enemy has set his murderous sights on them both?"], "author": "Eileen Dreyer", "num_pages": "433", "awards": [], "places": ["England"], "character_names": ["Diccan Hilliard", "Grace Fairchild"], "language": "English", "publish_date": "2011-04-01 00:00:00", "ISBN": "0446542067"},
{"url": "https://www.goodreads.com/book/show/2373.The_Bone_Collector", "num_ratings": "133,346", "num_reviews": "1,997", "avg_ratings": 4.19, "genres": ["Mystery", "Thriller", "Mystery", "Crime", "Fiction", "Thriller", "Mystery Thriller"], "title": "The Bone Collector", "description": ["Lincoln Rhyme was once a brilliant criminologist, a genius in the field of forensics -- until an accident left him physically and emotionally shattered. But now a diabolical killer is challenging Rhyme to a terrifying and ingenious duel of wits. With police detective Amelia Sachs by his side, Rhyme must follow a labyrinth of clues that reaches back to a dark chapter in New", "Lincoln Rhyme was once a brilliant criminologist, a genius in the field of forensics -- until an accident left him physically and emotionally shattered. But now a diabolical killer is challenging Rhyme to a terrifying and ingenious duel of wits. With police detective Amelia Sachs by his side, Rhyme must follow a labyrinth of clues that reaches back to a dark chapter in New York City's past -- and reach further into the darkness of the mind of a madman who won't stop until he has stripped life down to the bone."], "author": "Jeffery Deaver", "num_pages": "528", "awards": ["Nero Award (1999)"], "places": [], "character_names": ["Lincoln Rhyme", "Amelia Sachs"], "language": "English", "publish_date": "1998-04-01 00:00:00", "ISBN": "0451188454"},
{"url": "https://www.goodreads.com/book/show/18212796-smart-sexy-and-secretive", "num_ratings": "15,347", "num_reviews": "851", "avg_ratings": 4.23, "genres": ["Romance", "New Adult", "Romance", "Contemporary Romance", "Contemporary", "Disability"], "title": "Smart, Sexy and Secretive", "description": ["Emily", "I'm back in New York, ready to start my brand new life with Logan. Things are still up in the air between us, and it has been three months since I've even talked to him. But there's one thing I'm certain of -- I can't live without him.", "Logan", "I need her like I need air. But now she's back, and her dad and her ex-boyfriend are conspiring to keep us apart. We can do this,", "Emily", "I'm back in New York, ready to start my brand new life with Logan. Things are still up in the air between us, and it has been three months since I've even talked to him. But there's one thing I'm certain of -- I can't live without him.", "Logan", "I need her like I need air. But now she's back, and her dad and her ex-boyfriend are conspiring to keep us apart. We can do this, though. Can't we? We can make this work? We have to, because I can't imagine my life without her."], "author": "Tammy Falkner", "num_pages": "204", "awards": [], "places": ["New York (the state)"], "character_names": ["Logan", "Emily"], "language": "English", "publish_date": "2013-08-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2526.Blindness", "num_ratings": "150,810", "num_reviews": "12,418", "avg_ratings": 4.09, "genres": ["Science Fiction", "Dystopia", "Horror", "Apocalyptic", "Post Apocalyptic", "Abandoned", "Literary Fiction"], "title": "Blindness", "description": ["A city is hit by an epidemic of \"white blindness\" that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations and assaulting women. There is one eyewitness to this nightmare who guides her c", "A city is hit by an epidemic of \"white blindness\" that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations and assaulting women. There is one eyewitness to this nightmare who guides her charges—among them a boy with no mother, a girl with dark glasses, a dog of tears—through the barren streets, and their procession becomes as uncanny as the surroundings are harrowing. As ", " reclaims the age-old story of a plague, it evokes the vivid and trembling horrors of the twentieth century, leaving readers with a powerful vision of the human spirit that's bound both by weakness and exhilarating strength."], "author": "José Saramago", "num_pages": "326", "awards": ["Premio San Clemente for Novela Estranxeira (1999)"], "places": [], "character_names": ["The doctor (Blindness)", "The doctor's wife", "The girl with the dark glasses", "The first blind man", "The first blind man's wife", "The boy with the squint", "The old man with the black eye patch", "The car thief"], "language": "English", "publish_date": "1999-10-04 00:00:00", "ISBN": "0156007754"},
{"url": "https://www.goodreads.com/book/show/23362492-unconventional", "num_ratings": "72", "num_reviews": "14", "avg_ratings": 3.61, "genres": ["Romance", "Contemporary Romance"], "title": "UnConventional", "description": ["Santiago Durán walks straight out of Di Monroe’s dreams--crutches and all--into her heart. There’s only one problem: she’s already married.", "Di’s parents died suddenly when she was nineteen, leaving her shattered and grateful for Stephen’s rescue. Over the past ten years, her identity has faded into her husband’s logical, controlling shadow, but with familiarity lies comfort", "Santiago Durán walks straight out of Di Monroe’s dreams--crutches and all--into her heart. There’s only one problem: she’s already married.", "Di’s parents died suddenly when she was nineteen, leaving her shattered and grateful for Stephen’s rescue. Over the past ten years, her identity has faded into her husband’s logical, controlling shadow, but with familiarity lies comfort. When she heads to New Orleans for an editing convention, she meets Santiago--handsome, smart, and despite being affected by Becker’s muscular dystrophy--someone who sees the real Di, who appreciates her and wants her to shine. Pregnant after their one-night stand, Di realizes putting her ‘mistake’ behind her won’t be easy.", "\u2028Caught between her loyalty to her husband and the uncertain paternity of her baby, Di soon begins falling for Santiago, drawn to his strength and confidence, yet also his compassion and vulnerability. With Santiago’s help, Di experiences new passion, kindles hidden desires, and uncovers the sheltered part of herself she thought she’d lost long ago. Together, they discover that love is more than mere chemistry, but instead, means you’ve found the person with whom you can be yourself.", "Purchase here: "], "author": "Chie Alemán", "num_pages": "279", "awards": [], "places": ["Houston, Texas", "New Orleans, Louisiana"], "character_names": [], "language": "English", "publish_date": "2014-10-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/674393.Exposure", "num_ratings": "1,655", "num_reviews": "57", "avg_ratings": 3.82, "genres": ["Romance", "Romance", "Romantic Suspense", "Romance", "Contemporary Romance", "Suspense", "Contemporary"], "title": "Exposure", "description": ["A tragic childhood and a doomed marriage have forced Emma Sands to do what she does best -- run. Now, she and her young daughter have arrived in Washington Stale's Port Flannery, a remote fishing village where no one knows who she is...or where she is going.Big-city cop turned small-town sheriff Elvis Donnelly is six and a half feet of bruising muscle and solid hurt. The v", "A tragic childhood and a doomed marriage have forced Emma Sands to do what she does best -- run. Now, she and her young daughter have arrived in Washington Stale's Port Flannery, a remote fishing village where no one knows who she is...or where she is going.Big-city cop turned small-town sheriff Elvis Donnelly is six and a half feet of bruising muscle and solid hurt. The victim of a violent boyhood and a brutal bomb blast, all he wants is to forget the past...until it suddenly comes calling.", "When Elvis and Emma meet, the attraction instant -- and the passion all-consuming. But in a town of prying eyes, these two outsiders are soon sharing more than the heal of desire...they're sharing a fight for their lives."], "author": "Susan Andersen", "num_pages": "319", "awards": [], "places": ["United States of America"], "character_names": ["Emma Sands", "Elvis Donnelly"], "language": "English", "publish_date": "1999-12-01 00:00:00", "ISBN": "0821764039"},
{"url": "https://www.goodreads.com/book/show/15717100-what-i-didn-t-say", "num_ratings": "7,365", "num_reviews": "959", "avg_ratings": 3.96, "genres": ["Young Adult", "Romance", "Contemporary"], "title": "What I Didn't Say", "description": ["Getting drunk homecoming night your senior year is never a good idea, but Jake Hayes never expected it all to end with a car crash and a t-post embedded in his throat. ", "His biggest regret about it all? What he never said to Samantha Shay. He's been in love with her for years and never had the guts to tell her. Now it's too late. Because after that night, Jake will never be", "Getting drunk homecoming night your senior year is never a good idea, but Jake Hayes never expected it all to end with a car crash and a t-post embedded in his throat. ", "His biggest regret about it all? What he never said to Samantha Shay. He's been in love with her for years and never had the guts to tell her. Now it's too late. Because after that night, Jake will never be able to talk again.", "When Jake returns to his small island home, population 5,000, he'll have to learn how to deal with being mute. He also finds that his family isn't limited to his six brothers and sisters, that sometimes an entire island is watching out for you. And when he gets the chance to spend more time with Samantha, she'll help him learn that not being able to talk isn’t the worst thing that could ever happen to you. Maybe, if she'll let him, Jake will finally tell her what he didn't say before, even if he can't actually say it."], "author": "Keary Taylor", "num_pages": "326", "awards": [], "places": ["Orcas Island, San Juan Islands, Washington"], "character_names": [], "language": "English", "publish_date": "2012-05-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7094488-the-summer-of-you", "num_ratings": "961", "num_reviews": "128", "avg_ratings": 3.81, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction", "Historical Romance", "Regency Romance", "Fiction"], "title": "The Summer of You", "description": ["Lady Jane Cummings is certain that her summer is ruined when she is forced to reside at isolated Merrymere Lake with her reckless brother and ailing father. Her fast-paced London society is replaced with a small town grapevine. But one bit of gossip catches Jane's attention--rumors that th", "Lady Jane Cummings is certain that her summer is ruined when she is forced to reside at isolated Merrymere Lake with her reckless brother and ailing father. Her fast-paced London society is replaced with a small town grapevine. But one bit of gossip catches Jane's attention--rumors that the lake's brooding new resident is also an elusive highwayman.", "Jane must face the much-discussed mysterioso after he saves her brother from a pub brawl. She immediately recognizes him from London: Byrne Worth, war hero and apparent hermit--whom she finds strangely charming. The two build a fast friendship, and soon nothing can keep this Lady away from Merrymere's most wanted. Convinced of his innocence, Jane is determined to clear Byrne's name--and maybe have a little fun this summer after all."], "author": "Kate Noble", "num_pages": "343", "awards": ["DABWAHA Romance Tournament Nominee for Best Historical Romance (2011)"], "places": [], "character_names": ["Lady Jane Cummings, Byrne Worth"], "language": "English", "publish_date": "2010-04-06 00:00:00", "ISBN": "0425232395"},
{"url": "https://www.goodreads.com/book/show/18007521-the-escape", "num_ratings": "4,752", "num_reviews": "555", "avg_ratings": 3.9, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency", "Fiction"], "title": "The Escape", "description": ["✼ ✼ ", " This edition includes the novella ", " ✼ ✼", "After surviving the Napoleonic Wars, Sir Benedict Harper is struggling to move on, his body and spirit in need of a healing touch. Never does Ben imagine that hope will come in the form of a beautiful woman who has seen her own share of suffering. After the lingering death of her husband, Samantha McKay is", "✼ ✼ ", " This edition includes the novella ", " ✼ ✼", "After surviving the Napoleonic Wars, Sir Benedict Harper is struggling to move on, his body and spirit in need of a healing touch. Never does Ben imagine that hope will come in the form of a beautiful woman who has seen her own share of suffering. After the lingering death of her husband, Samantha McKay is at the mercy of her oppressive in-laws—until she plots an escape to distant Wales to claim a house she has inherited. Being a gentleman, Ben insists that he escort her on the fateful journey.", "Ben wants Samantha as much as she wants him, but he is cautious. What can a wounded soul offer any woman? Samantha is ready to go where fate takes her, to leave behind polite society and even propriety in her desire for this handsome, honorable soldier. But dare she offer her bruised heart as well as her body? The answers to both their questions may be found in an unlikely place: in each other’s arms."], "author": "Mary Balogh", "num_pages": "394", "awards": [], "places": [], "character_names": ["Benedict Harper", "Samantha McKay"], "language": "English", "publish_date": "2014-07-01 00:00:00", "ISBN": "0345536061"},
{"url": "https://www.goodreads.com/book/show/13341843-breath", "num_ratings": "41", "num_reviews": "2", "avg_ratings": 3.98, "genres": ["Romance"], "title": "Breath(e)", "description": ["College freshman Elizabeth Foster is beginning to come to terms with her attraction to disabled men but she fears others might judge her harshly if they knew.", "And that's exactly what happens.", "When her mother learns the truth, she does everything in her power to stop Elizabeth from finding the only kind of man she could", "College freshman Elizabeth Foster is beginning to come to terms with her attraction to disabled men but she fears others might judge her harshly if they knew.", "And that's exactly what happens.", "When her mother learns the truth, she does everything in her power to stop Elizabeth from finding the only kind of man she could love.", "Now Elizabeth must learn to trust herself and reject her parents' vision for her future.", "(This book is the sequel to the novel, (W)hole, but it also stands on its own.)"], "author": "Ruth Madison", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20560766-the-key", "num_ratings": "200", "num_reviews": "15", "avg_ratings": 3.63, "genres": ["Romance", "Disability", "Romance", "Contemporary Romance", "Fiction"], "title": "The Key", "description": ["Jack and Carrie are lost souls. Jack is an eminent university lecturer in English Literature who suffers from quadriplegia after a spinal cord injury in his late teens. Having convinced himself that he was better off on his own he has closed the door on any romantic entanglements and instead directed all his energy into his work. ", "Carrie is trying to unchain herself from a", "Jack and Carrie are lost souls. Jack is an eminent university lecturer in English Literature who suffers from quadriplegia after a spinal cord injury in his late teens. Having convinced himself that he was better off on his own he has closed the door on any romantic entanglements and instead directed all his energy into his work. ", "Carrie is trying to unchain herself from a cruel, neglectful and guilt ridden childhood. She has earned a place on a degree course of her dreams but it comes at a costly price. ", "Both are thrown together by Mary, a mutual friend and past social worker, who has hatched a plan to help Jack and Carrie with their predicaments. Carrie becomes Jack's live-in carer securing her with an income and unexpected benefits. ", "Will it be too late from them to find out that they both hold the key to unleash each other from the chains that hold them to their past? A key that will unlock their hearts."], "author": "Victoria Darkins", "num_pages": "194", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5598223-lover-awakened", "num_ratings": "148,689", "num_reviews": "6,237", "avg_ratings": 4.45, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance", "Paranormal", "Vampires", "Fantasy", "Urban Fantasy"], "title": "Lover Awakened", "description": ["In the shadows of the night in Caldwell, New York, there’s a deadly war raging between vampires and their slayers. And there exists a secret band of brothers like no other - six vampire warriors, defenders of their race. Of these, Zsadist is the most terrifying member of the Black Dagger Brotherhood.", "A former blood slave, the vampire Zsadist still bears the scars from a pas", "In the shadows of the night in Caldwell, New York, there’s a deadly war raging between vampires and their slayers. And there exists a secret band of brothers like no other - six vampire warriors, defenders of their race. Of these, Zsadist is the most terrifying member of the Black Dagger Brotherhood.", "A former blood slave, the vampire Zsadist still bears the scars from a past filled with suffering and humiliation. Renowned for his unquenchable fury and sinister deeds, he is a savage feared by humans and vampires alike. Anger is his only companion, and terror is his only passion—until he rescues a beautiful aristocrat from the evil Lessening Society.", "Bella is instantly entranced by the seething power Zsadist possesses. But even as their desire for one another begins to overtake them both, Zsadist’s thirst for vengeance against Bella’s tormentors drives him to the brink of madness. Now, Bella must help her lover overcome the wounds of his tortured past, and find a future with her…"], "author": "J.R. Ward", "num_pages": "468", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Romance & Best Paranormal & Most Tortured Hero & Strongest Heroine & Best Villain & Most-Hanky Read  & Honorable Mention for Best Couple (2007)", "Romantic Times Reviewers' Choice Award (RT Award) for Vampire Romance (2006)"], "places": ["Caldwell, New York"], "character_names": ["Mary Luce", "Marissa", "Brian O'Neal", "Zsadist", "Bella Soang", "Vishous", "Phury", "Beth (Elizabeth) Randall", "John Matthew", "Tohrment", "Rehvenge", "Wellesandra", "The Scribe Virgin", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2006-09-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15827731-just-remember-to-breathe", "num_ratings": "9,566", "num_reviews": "892", "avg_ratings": 4.0, "genres": ["New Adult", "Romance", "Romance", "Contemporary Romance", "Contemporary", "War", "Military Fiction"], "title": "Just Remember to Breathe", "description": ["Alex Thompson’s life is following the script. A pre-law student at Columbia University, she’s focused on her grades, her life and her future. The last thing she needs is to reconnect with the boy who broke her heart.", "Dylan Paris comes home from Afghanistan severely injured and knows that the one thing he cannot do is drag Alex into the mess he’s made of his life.", "When Dylan", "Alex Thompson’s life is following the script. A pre-law student at Columbia University, she’s focused on her grades, her life and her future. The last thing she needs is to reconnect with the boy who broke her heart.", "Dylan Paris comes home from Afghanistan severely injured and knows that the one thing he cannot do is drag Alex into the mess he’s made of his life.", "When Dylan and Alex are assigned to the same work study program and are forced to work side by side, they have to make new ground rules to keep from killing each other.", "Only problem is, they keep breaking the rules.", "The first rule is to never, ever talk about how they fell in love."], "author": "Charles Sheehan-Miles", "num_pages": "277", "awards": [], "places": ["New York (the state)"], "character_names": ["Alexandra \"Alex\" Thompson", "Dylan Paris"], "language": "English", "publish_date": "2012-11-12 00:00:00", "ISBN": "0988273608"},
{"url": "https://www.goodreads.com/book/show/2767052-the-hunger-games", "num_ratings": "5,448,058", "num_reviews": "159,973", "avg_ratings": 4.33, "genres": ["Young Adult", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Science Fiction", "Romance", "Adventure", "Young Adult", "Teen", "Apocalyptic", "Post Apocalyptic", "Action"], "title": "The Hunger Games", "description": ["The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as t", "The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory.", "When 16-year-old Katniss's young sister, Prim, is selected as District 12's female representative, Katniss volunteers to take her place. She and her male counterpart Peeta, are pitted against bigger, stronger representatives, some of whom have trained for this their whole lives. , she sees it as a death sentence. But Katniss has been close to death before. For her, survival is second nature."], "author": "Suzanne Collins", "num_pages": "374", "awards": ["Georgia Peach Book Award (2009)", "Buxtehuder Bulle (2009)", "Golden Duck Award for Hal Clement Award for Young Adult (2009)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2012)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2010)", "Red House Children's Book Award for Older Readers & Overall (2010)", "South Carolina Book Award for Junior and Young Adult Book (2011)", "Charlotte Award (2010)", "Colorado Blue Spruce Young Adult Book Award (2010)", "Teen Buckeye Book Award (2009)", "Pennsylvania Young Readers' Choice Award for Young Adults (2010)", "Rhode Island Teen Book Award (2010)", "Dorothy Canfield Fisher Children's Book Award (2010)", "Evergreen Teen Book Award (2011)", "Soaring Eagle Book Award (2009)", "Milwaukee County Teen Book Award Nominee (2010)", "Sakura Medal for Middle School Book (2010)", "Michigan Library Association Thumbs Up! Award (2009)", "Florida Teens Read (2009)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2010)", "Iowa High School Book Award (2011)", "New Mexico Land of Enchantment Award for Young Adult (2011)", "Eliot Rosewater Indiana High School Book Award (2010)", "The Inky Awards for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2011)", "Lincoln Award (2011)", "Kinderboekwinkelprijs (2010)", "Missouri Truman Readers Award (2011)", "Cybils Award for Young Adult Fantasy & Science Fiction (2008)", "Literaturpreis der Jury der jungen Leser for Jugendbuch (2010)", "The Inky Awards Shortlist for Silver Inky (2009)", "Prix Et-lisez-moi (2011)", "Missouri Gateway Readers Award (2011)", "Oklahoma Sequoyah Award for High School and Intermediate (2011)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2009)", "Rebecca Caudill Young Readers' Book Award (2011)"], "places": ["District 12, Panem", "Capitol, Panem", "Panem"], "character_names": ["Katniss Everdeen", "Peeta Mellark", "Cato (Hunger Games)", "Primrose Everdeen", "Gale Hawthorne", "Effie Trinket", "Haymitch Abernathy", "Cinna", "President Coriolanus Snow", "Rue", "Venia", "Flavius", "Lavinia (Hunger Games)", "Marvel", "Glimmer", "Clove", "Foxface", "Thresh", "Greasy Sae", "Madge Undersee", "Caesar Flickerman", "Claudius Templesmith", "Octavia (Hunger Games)", "Portia (hunger Games)"], "language": "English", "publish_date": "2008-09-14 00:00:00", "ISBN": "0439023483"},
{"url": "https://www.goodreads.com/book/show/10964.Outlander", "num_ratings": "657,798", "num_reviews": "39,763", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Romance", "Fantasy", "Fiction", "Science Fiction", "Time Travel", "Historical", "Romance", "Historical Romance"], "title": "Outlander", "description": ["The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743.", "Hurled back in ti", "The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743.", "Hurled back in time by forces she cannot understand, Claire is catapulted into the intrigues of lairds and spies that may threaten her life, and shatter her heart. For here James Fraser, a gallant young Scots warrior, shows her a love so absolute that Claire becomes a woman torn between fidelity and desire—and between two vastly different men in two irreconcilable lives."], "author": "Diana Gabaldon", "num_pages": "850", "awards": ["RITA Award by Romance Writers of America for Best Romance of 1991 & nominee for Best First Book & nominee for Single Title Historical Romance (1992)", "Puddly Award for Romance (2001)"], "places": ["Lallybroch, Scotland", "Scottish Highlands", "Inverness, Scotland", "Scotland"], "character_names": ["Jamie Fraser", "Ian Murray", "Claire Randall Fraser", "Jonathan Randall", "Dougal MacKenzie", "Colum MacKenzie", "Geillis Duncan", "Jenny Murray", "Frank Randall", "Laoghaire MacKenzie", "Murtagh Fraser"], "language": "English", "publish_date": "2005-07-26 00:00:00", "ISBN": "0440242940"},
{"url": "https://www.goodreads.com/book/show/182434.Tim", "num_ratings": "3,743", "num_reviews": "231", "avg_ratings": 3.8, "genres": ["Fiction", "Romance", "Cultural", "Australia", "Contemporary"], "title": "Tim", "description": ["Mary Horton is content with her comfortable, solitary existence . . . until she meets Tim. A beautiful young man with the mind of a child; a gentle outcast in a cruel, unbending world - he illuminates the darkness of Mary's days with his boyish innocence. And he will shatter the lonely, middle-aged spinster's respectable, ordered life with a forbidden promise of a very spe", "Mary Horton is content with her comfortable, solitary existence . . . until she meets Tim. A beautiful young man with the mind of a child; a gentle outcast in a cruel, unbending world - he illuminates the darkness of Mary's days with his boyish innocence. And he will shatter the lonely, middle-aged spinster's respectable, ordered life with a forbidden promise of a very special love."], "author": "Colleen McCullough", "num_pages": "311", "awards": [], "places": ["Sydney, New South Wales", "Australia"], "character_names": ["Mary Horton", "Tim Melville", "Dawnie"], "language": "French", "publish_date": "2000-03-14 00:00:00", "ISBN": "2268032639"},
{"url": "https://www.goodreads.com/book/show/12262889-trueman-bradley---aspie-detective", "num_ratings": "47", "num_reviews": "9", "avg_ratings": 4.4, "genres": ["Mystery", "New York", "Fiction"], "title": "Trueman Bradley - Aspie Detective", "description": ["Trueman Bradley is a genius detective with a difference, he has Asperger's Syndrome (AS).", "Trueman leaves his hometown of Heartville, Illinois, and arrives in New York City, hoping to fulfil his dream of becoming a private detective, like his comic book heroes. He is soon told that a guy with AS could not possibly succeed as a detective. Undeterred, Trueman uses his exceptio", "Trueman Bradley is a genius detective with a difference, he has Asperger's Syndrome (AS).", "Trueman leaves his hometown of Heartville, Illinois, and arrives in New York City, hoping to fulfil his dream of becoming a private detective, like his comic book heroes. He is soon told that a guy with AS could not possibly succeed as a detective. Undeterred, Trueman uses his exceptional mathematical skills to invent a crime-fighting equation, and with the help of his new friends and some amazing inventions, sets out to test his skills against the criminal world of New York. He is determined to show the police, his friends, and himself, that a guy with AS can become as good a detective as anyone else, maybe, even, one of the best.", "Trueman Bradley - Aspie Detective is a fantasy adventure that will capture the imagination of anyone interested in Asperger's Syndrome."], "author": "Alexei Maxim Russell", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-15 00:00:00", "ISBN": "184905262X"},
{"url": "https://www.goodreads.com/book/show/1130878.Beast", "num_ratings": "1,846", "num_reviews": "202", "avg_ratings": 3.52, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Fairy Tales", "Beauty and The Beast", "Historical", "Historical Fiction", "Fiction"], "title": "Beast", "description": ["An exquisite American heiress, Louise Vandermeer is beautiful, brilliant...and bored—which is why she has agreed to a daring adventure: to travel across the ocean to marry an aristocrat abroad. Rumor has it her intended is a hideous cad—a grim prospect that propels her into a passionate, reckless affair with a compelling stranger she never sees in the light of da", "An exquisite American heiress, Louise Vandermeer is beautiful, brilliant...and bored—which is why she has agreed to a daring adventure: to travel across the ocean to marry an aristocrat abroad. Rumor has it her intended is a hideous cad—a grim prospect that propels her into a passionate, reckless affair with a compelling stranger she never sees in the light of day.", "Though scarred by a childhood illness, Charles d'Harcourt has successfully wooed Europe's most sophisticated beauties. For a lark, he contrived to travel incognito on his own fiancée's ship—and seduce the young chit in utter darkness. But the rake's prank backfired. It was he who was smitten—while the hot-tempered Lulu, now his wife, loves only her shipboard lover, unaware it was d'Harcourt all the time! And Charles will never have her heart—unless he can open her eyes to the prince who hides within."], "author": "Judith Ivory", "num_pages": "384", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Turn-of-the-Century Historical Romance (1997)"], "places": ["France"], "character_names": [], "language": "English", "publish_date": "1997-04-01 00:00:00", "ISBN": "0380786443"},
{"url": "https://www.goodreads.com/book/show/15797358-the-arrangement", "num_ratings": "6,713", "num_reviews": "875", "avg_ratings": 3.84, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction", "Fiction"], "title": "The Arrangement", "description": ["Desperate to escape his mother’s matchmaking, Vincent Hunt, Viscount Darleigh, flees to a remote country village. But even there, another marital trap is sprung. So when Miss Sophia Fry’s intervention on his behalf finds her unceremoniously booted from her guardian’s home, Vincent is compelled to act. He may have been blinded in battle, but he can see a solution to both th", "Desperate to escape his mother’s matchmaking, Vincent Hunt, Viscount Darleigh, flees to a remote country village. But even there, another marital trap is sprung. So when Miss Sophia Fry’s intervention on his behalf finds her unceremoniously booted from her guardian’s home, Vincent is compelled to act. He may have been blinded in battle, but he can see a solution to both their problems: marriage.", "  ", " At first, quiet, unassuming Sophia rejects Vincent’s proposal. But when such a gloriously handsome man persuades her that he needs a wife of his own choosing as much as she needs protection from destitution, she agrees. Her alternative is too dreadful to contemplate. But how can an all-consuming fire burn from such a cold arrangement? As friendship and camaraderie lead to sweet seduction and erotic pleasure, dare they believe a bargain born of desperation might lead them both to a love destined to be?"], "author": "Mary Balogh", "num_pages": "366", "awards": [], "places": [], "character_names": ["Vincent Hunt", "Sophia Fry"], "language": "English", "publish_date": "2013-08-27 00:00:00", "ISBN": "0345535871"},
{"url": "https://www.goodreads.com/book/show/18752451-love-in-touch", "num_ratings": "774", "num_reviews": "87", "avg_ratings": 3.96, "genres": ["Romance", "Contemporary", "New Adult", "Disability", "Romance", "Contemporary Romance"], "title": "Love In Touch", "description": ["Kassie has felt adrift ever since her dad died when she was in college. Now 24 and living in Seattle, she gets interested in learning sign language through her roommate, a sign language interpreter. One day at a Deaf community event, she sees a young man sitting off by himself. Kassie feels compelled to try signing to him–the fact that he’s strikingly handsome doesn’t hurt", "Kassie has felt adrift ever since her dad died when she was in college. Now 24 and living in Seattle, she gets interested in learning sign language through her roommate, a sign language interpreter. One day at a Deaf community event, she sees a young man sitting off by himself. Kassie feels compelled to try signing to him–the fact that he’s strikingly handsome doesn’t hurt.", "Jake has been deaf and blind since birth. His disability has cut him off from the world, but beneath his isolated exterior, is a smart, sweet guy with a dry sense of humor. Despite the odds, he’s highly educated, but at 26, he’s gotten stuck in a rut, with few friends and no clear career plans. Until a sweet-smelling girl introduces herself to him unexpectedly, and opens up a whole new world to him.", "Jake is more intelligent, more genuine than anyone she has met before, and for the first time Kassie starts to feel like her life has some direction. But as their friendship deepens into something more, the difficulty in communicating with each other only grows, and it seems like everyone they know thinks their relationship won’t work. How can they come to a deeper understanding of each other, and find a future together?"], "author": "Lucy May Lennox", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-01 00:00:00", "ISBN": "0985826339"},
{"url": "https://www.goodreads.com/book/show/11995170-dev-dreams-volume-one", "num_ratings": "29", "num_reviews": "3", "avg_ratings": 3.55, "genres": ["Romance"], "title": "Dev Dreams, Volume One", "description": ["A collection of short love stories featuring physically disabled heroes. They are stories of love like you hope it will be, the way you expect it when you arrive in the grown-up world ready to make it yours."], "author": "Ruth Madison", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2011-06-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13455137-love-dreams", "num_ratings": "69", "num_reviews": "27", "avg_ratings": 3.48, "genres": ["Romance", "Contemporary Romance", "Romance"], "title": "Love Dreams", "description": ["She's a beautiful wreck who hates men, but loves animals. Beaten and left for dead, she suffers from night terrors. When she keeps running into a gorgeous guy things heat up, but memories of abuse dampen the fire.", "He's handsome. He's wealthy. He's in a wheelchair. His entire life has changed, and the past months have been hell. But there's a bright spot in Michael's life: S", "She's a beautiful wreck who hates men, but loves animals. Beaten and left for dead, she suffers from night terrors. When she keeps running into a gorgeous guy things heat up, but memories of abuse dampen the fire.", "He's handsome. He's wealthy. He's in a wheelchair. His entire life has changed, and the past months have been hell. But there's a bright spot in Michael's life: Sienna, an adorable klutz who seems to always be falling, so why can't she fall for him? He offers her a ride, not his lap, but that's where she ends up when he comes to her aid after she's had too much to drink. This is the beginning of the hit and miss love affair: He blows it the first time. She blows it the second.", "Roadblocks: Whether it's a doctor who won't take no for an answer, a family emergency, or a big mouth girlfriend who thinks she knows what's best for Sienna, there always seems to be something to stand in their way. The road is bumpy, filled with dreams and desires, awkward run-ins, and deliciously steamy encounters. Is there anything, short of a miracle, that could bring these two struggling souls together?", "If you're in the mood for a lighthearted contemporary romance for adults, you may be interested in Love Dreams, Romance and Drama. Like life, this story has its humorous moments. Seriously Graphic Sexual Content. Mature Audience Only."], "author": "January Valentine", "num_pages": "374", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-10 00:00:00", "ISBN": "0984360220"},
{"url": "https://www.goodreads.com/book/show/8853654-his-eyes", "num_ratings": "8,558", "num_reviews": "420", "avg_ratings": 3.77, "genres": ["Young Adult", "Romance", "Contemporary", "Womens Fiction", "Chick Lit", "Realistic Fiction"], "title": "His Eyes", "description": ["Amy Turner's about to graduate from high school and all she wants is a job. Actually, all she wants is to find a way to pay for college. Amy certainly isn't looking for love when she answers an ad to baby-sit a boy-she just needs the cash. But the job has a catch: The boy is blind...and he's her age.", "Tristan Edmund may be hot, but he doesn't want Amy's help. Or so he thinks", "Amy Turner's about to graduate from high school and all she wants is a job. Actually, all she wants is to find a way to pay for college. Amy certainly isn't looking for love when she answers an ad to baby-sit a boy-she just needs the cash. But the job has a catch: The boy is blind...and he's her age.", "Tristan Edmund may be hot, but he doesn't want Amy's help. Or so he thinks. After being blinded in a horse show-jumping competition, Tristan spends his days in the dark, refusing to accept his disability. Much to his annoyance, Amy bursts into his life and drags him into the light. But just as the two begin to see something in each other, Tristan's beautiful ex-girlfriend shows up. Will the temptation be too much, or will Tristan choose the girl who really sees him?"], "author": "Renee Carter", "num_pages": "196", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2284185.A_Man_Like_Mac", "num_ratings": "135", "num_reviews": "18", "avg_ratings": 3.84, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Disability", "Romance", "Category Romance"], "title": "A Man Like Mac", "description": ["When Keely Wilson turns to Mac McCandless for help, an intense but unacknowledged attraction between them is rekindled. First, though, Keely has to accept a devastating change in Mac's life and face the loss of the career she mistakenly believes defines her as a person. A Man Like Mac is a powerful story of courage, acceptance, and the ability of love to heal the wounded h", "When Keely Wilson turns to Mac McCandless for help, an intense but unacknowledged attraction between them is rekindled. First, though, Keely has to accept a devastating change in Mac's life and face the loss of the career she mistakenly believes defines her as a person. A Man Like Mac is a powerful story of courage, acceptance, and the ability of love to heal the wounded heart."], "author": "Fay Robinson", "num_pages": "297", "awards": ["RITA Award by Romance Writers of America for Best First Book (2001)"], "places": ["United States of America"], "character_names": ["Keely Wilson", "Mac McCandless"], "language": "English", "publish_date": "2000-04-16 00:00:00", "ISBN": "0373709110"},
{"url": "https://www.goodreads.com/book/show/419280.Once_a_Princess", "num_ratings": "10,021", "num_reviews": "297", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Fiction", "Historical", "Historical Fiction"], "title": "Once a Princess", "description": ["Once Upon A Time...In a rustic Mississippi tavern, a beautiful exiled princess was forced to dance for the pleasure of others unaware of her regal birthright...and infuriated by a magnificent golden-eyed devil who crossed an ocean to possess her. From A Far Off Land... A bold and brazen prince came to America to claim his promised bride. But the spirited vixen spurned his", "Once Upon A Time...In a rustic Mississippi tavern, a beautiful exiled princess was forced to dance for the pleasure of others unaware of her regal birthright...and infuriated by a magnificent golden-eyed devil who crossed an ocean to possess her. From A Far Off Land... A bold and brazen prince came to America to claim his promised bride. But the spirited vixen spurned his affections while inflaming his royal blood with passion's fire...impelling virile Stefan Barany to take in sensuous and searing conquest the love Tatiana vowed never to yield."], "author": "Johanna Lindsey", "num_pages": "432", "awards": [], "places": [], "character_names": ["Stefan Barany", "Tatiana Janacek", "Vasili Petroff", "Serge", "Lazar"], "language": "English", "publish_date": "1991-06-01 00:00:00", "ISBN": "0380756250"},
{"url": "https://www.goodreads.com/book/show/8469152-st-nacho-s", "num_ratings": "4,381", "num_reviews": "407", "avg_ratings": 3.89, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Disability"], "title": "St. Nacho's", "description": ["Cooper has spent the last three years running from a painful past. He's currently moving from town to town, working in restaurant kitchens, and playing his violin for tips. As soon as he starts to feel comfortable anywhere—with anyone—he moves on. He's aware that music may be the only human language he still knows. Ironically, the one man he's wanted to communicate with in", "Cooper has spent the last three years running from a painful past. He's currently moving from town to town, working in restaurant kitchens, and playing his violin for tips. As soon as he starts to feel comfortable anywhere—with anyone—he moves on. He's aware that music may be the only human language he still knows. Ironically, the one man he's wanted to communicate with in all that time is deaf.", "Shawn is part of a deaf theater group at the nearby college. Shawn wants Cooper as soon as they meet and he begins a determined flirtation. Cooper is comfortable with down and dirty sex, just not people. As far as Shawn is concerned, dirty sex is win-win, but he wants Cooper to let him into the rest of his life as well.", "Cooper needs time to heal and put his past away for good. Shawn needs to help Cooper forgive himself and accept that he can be loved. Both men find out that when it comes to the kind of healing love can bring, the sleepy beachside town of Santo Ignacio, \"St. Nacho's\" as the locals call it, may just be the very best place to start."], "author": "Z.A. Maxfield", "num_pages": "228", "awards": [], "places": ["St. Nacho, California", "River Falls, Wisconsin", "Santo Ignacio, California"], "character_names": ["Cooper Wyatt", "Shawn Fielding"], "language": "English", "publish_date": "2008-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17209447-new-life", "num_ratings": "538", "num_reviews": "92", "avg_ratings": 3.65, "genres": ["Romance", "Contemporary Romance", "Romance", "Contemporary", "Disability", "Adult"], "title": "New Life", "description": ["Since the car accident that caused traumatic brain injury, Jason has fought to regain his memories and the ability to organize thoughts and control emotions. His promising future shattered, he works as a night janitor in an office building and clings to routine to make it through his days.", "New lawyer Anna breaks down one evening after fumbling her first court case. Self-dou", "Since the car accident that caused traumatic brain injury, Jason has fought to regain his memories and the ability to organize thoughts and control emotions. His promising future shattered, he works as a night janitor in an office building and clings to routine to make it through his days.", "New lawyer Anna breaks down one evening after fumbling her first court case. Self-doubt brings her to tears in a deserted stairwell where Jason finds her and offers comforting words. From this unexpected meeting an unlikely romance begins.", "A casual coffee date soon leads to a deeper connection and eventually a steamy affair. But are Jason and Anna’s growing feelings for each other strong enough to overcome the social chasm that divides them and the very real issues of Jason’s disability?"], "author": "Bonnie Dee", "num_pages": "302", "awards": [], "places": [], "character_names": ["Jason Reitmiller", "Anna Stevens"], "language": "English", "publish_date": "2013-01-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7713857-pleasures-of-a-notorious-gentleman", "num_ratings": "2,868", "num_reviews": "196", "avg_ratings": 3.87, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical Romance", "Regency Romance"], "title": "Pleasures of a Notorious Gentleman", "description": ["As the black sheep second son of an Earl, Stephen Lyons has gained a reputation in the art of seduction, but when his wicked ways result in scandal, he joins the army to redeem himself. On the battlefield, he proves courageous . . . until he is seriously wounded. Returning home to recover, he discovers he can't remember the angelic beauty who arrives at his doorstep, his b", "As the black sheep second son of an Earl, Stephen Lyons has gained a reputation in the art of seduction, but when his wicked ways result in scandal, he joins the army to redeem himself. On the battlefield, he proves courageous . . . until he is seriously wounded. Returning home to recover, he discovers he can't remember the angelic beauty who arrives at his doorstep, his babe nestled in her arms.", "Mercy Dawson will risk everything to protect the son of the dashing soldier she once knew and admired. When Stephen offers to do the honorable thing, she is determined that London's most notorious gentleman will desire her and no other. But Mercy fears that what began as an innocent deception could destroy her dreams and their blossoming love if Stephen ever learns the scandalous truth . . .", "They are masters of seduction, London's greatest lovers. Living for pleasure, they will give their hearts to no one . . . until love takes them by surprise."], "author": "Lorraine Heath", "num_pages": "372", "awards": [], "places": ["England"], "character_names": ["Ransom Seymour (Duke of Ainsley)", "Stephen Lyons", "Mercy Dawson"], "language": "English", "publish_date": "2010-11-30 00:00:00", "ISBN": "0061922951"},
{"url": "https://www.goodreads.com/book/show/18187179-harvard-hottie", "num_ratings": "754", "num_reviews": "82", "avg_ratings": 3.34, "genres": ["Romance", "Contemporary", "Romance", "Contemporary Romance", "Disability"], "title": "Harvard Hottie", "description": ["When nerdy, unhip Ellie Jenson meets rich, handsome Luke Thayer the Third as freshmen at Harvard University, it's Hate At First Sight. Ellie loathes Luke's smirk and superior attitude, and decides if she never sees him again, it will be too soon.", "Fifteen years later, Ellie gets the surprise of her life: Luke is her new boss and owner of her company! But when Ellie discovers", "When nerdy, unhip Ellie Jenson meets rich, handsome Luke Thayer the Third as freshmen at Harvard University, it's Hate At First Sight. Ellie loathes Luke's smirk and superior attitude, and decides if she never sees him again, it will be too soon.", "Fifteen years later, Ellie gets the surprise of her life: Luke is her new boss and owner of her company! But when Ellie discovers that Luke was paralyzed in an accident and is now in a wheelchair, she wonders if it's possible to be friends with this new, down-to-earth version of her former foe. Or maybe even more than friends, if Luke gets his way..."], "author": "Annabelle Costa", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-07-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24445517-maybe-someday", "num_ratings": "137,232", "num_reviews": "15,389", "avg_ratings": 4.31, "genres": ["Romance", "New Adult", "Contemporary", "Young Adult", "Romance", "Contemporary Romance"], "title": "Maybe Someday", "description": ["Contains exclusive content: songs from Griffin Peterson ", "Sydney is living in an idyllic bubble—she's a dedicated student with a steady job on the side. She lives with her best friend, has a great boyfriend, and the music coming from the balcony opposite hers is fast becoming the soundtrack to her life. But when Sydney finds out her boyfriend is cheating on her, the bubble b", "Contains exclusive content: songs from Griffin Peterson ", "Sydney is living in an idyllic bubble—she's a dedicated student with a steady job on the side. She lives with her best friend, has a great boyfriend, and the music coming from the balcony opposite hers is fast becoming the soundtrack to her life. But when Sydney finds out her boyfriend is cheating on her, the bubble bursts. The mysterious and attractive man behind the music, Ridge, gives Sydney hope that she can move on and they begin to write songs together. But moving on is harder than she expects, Sydney can only hope…. ", "Maybe someday… ", "Colleen Hoover draws you in to this passionate tale of music, love and betrayal…"], "author": "Colleen Hoover", "num_pages": "385", "awards": ["Goodreads Choice Award Nominee for Romance (2014)"], "places": [], "character_names": ["Sydney Blake", "Ridge Lawson", "Warren Russell", "Bridgette Cox", "Brennan Lawson"], "language": "English", "publish_date": "2014-03-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/659607.The_Heart_s_Desire", "num_ratings": "96", "num_reviews": "10", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Romance", "Historical"], "title": "The Heart's Desire", "description": ["One Night of Glory", "Tall and lithe, Emily Fairfax was unaware of the power of her innocence. But from the first, Dominic knew the danger of their desire. For she alone could draw aside the mantle of despair that kept him safely hidden, and condemn them both to certain heartbreak....", "A soldier's daughter, Emily thought she knew what furies drove men in the name of honor, until", "One Night of Glory", "Tall and lithe, Emily Fairfax was unaware of the power of her innocence. But from the first, Dominic knew the danger of their desire. For she alone could draw aside the mantle of despair that kept him safely hidden, and condemn them both to certain heartbreak....", "A soldier's daughter, Emily thought she knew what furies drove men in the name of honor, until she met the enigmatic Duke of Avon, Dominic Maitland--a man with a tragic past and an empty future. A man who would grant her but one night to lie with abandon in his willing arms..."], "author": "Gayle Wilson", "num_pages": "352", "awards": ["RITA Award by Romance Writers of America Nominee for Best First Book (1995)"], "places": ["London, England", "Paris"], "character_names": ["Emily Fairfax", "Dominic Maitland"], "language": "English", "publish_date": "1994-03-01 00:00:00", "ISBN": "0373288115"},
{"url": "https://www.goodreads.com/book/show/8676331-the-admiral-s-penniless-bride", "num_ratings": "1,725", "num_reviews": "243", "avg_ratings": 3.74, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Regency", "Historical", "Historical", "Historical Fiction"], "title": "The Admiral's Penniless Bride", "description": ["Sally Paul is down to her last penny. As she spends it on a cup of tea--to stave off being at the mercy of the workhouse--the last thing she expects is an offer of marriage...from a complete stranger!Admiral Sir Charles Bright's seafaring days are over--and according to society, that must mean he's in need of a wife! Discovering Sally's in need of a home, he offers a solut", "Sally Paul is down to her last penny. As she spends it on a cup of tea--to stave off being at the mercy of the workhouse--the last thing she expects is an offer of marriage...from a complete stranger!Admiral Sir Charles Bright's seafaring days are over--and according to society, that must mean he's in need of a wife! Discovering Sally's in need of a home, he offers a solution.... They marry in haste--but will they enjoy their wedding night at leisure?"], "author": "Carla Kelly", "num_pages": "288", "awards": [], "places": [], "character_names": ["Sally Paul", "Sir Charles Bright"], "language": "English", "publish_date": "2010-12-21 00:00:00", "ISBN": "0373296258"},
{"url": "https://www.goodreads.com/book/show/414655.Frisco_s_Kid", "num_ratings": "3,980", "num_reviews": "144", "avg_ratings": 3.97, "genres": ["Romance", "Romance", "Romantic Suspense", "Contemporary", "War", "Military Fiction", "Romance", "Contemporary Romance", "Suspense"], "title": "Frisco's Kid", "description": ["When Navy SEAL lieutenant Alan Frisco Francisco's career is threatened by a bullet, he has two reasons not to wallow in self-pity: the appearance of his abandoned five-year-old niece, and his neighbor, Mia Summerton, who's determined to help him heal his leg and his heart. Reissue."], "author": "Suzanne Brockmann", "num_pages": "249", "awards": [], "places": ["San Felipe, California"], "character_names": ["Alan \"Frisco\" Francisco", "Mia Summerton"], "language": "English", "publish_date": "2003-06-01 00:00:00", "ISBN": "1551667592"},
{"url": "https://www.goodreads.com/book/show/5841519-surrender-to-the-devil", "num_ratings": "4,865", "num_reviews": "295", "avg_ratings": 4.0, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency"], "title": "Surrender to the Devil", "description": ["Frannie Darling was once a child of London's roughest streets, surrounded by petty thieves, pickpockets, and worse. But though she survived this harsh upbringing to become a woman of incomparable beauty, Frannie wants nothing to do with the men who lust for her, the rogues who frequent the gaming hall where she works. She can take", "Frannie Darling was once a child of London's roughest streets, surrounded by petty thieves, pickpockets, and worse. But though she survived this harsh upbringing to become a woman of incomparable beauty, Frannie wants nothing to do with the men who lust for her, the rogues who frequent the gaming hall where she works. She can take care of herself and feels perfectly safe on her own—safe, that is, until he strides into her world, and once again it becomes a very dangerous place indeed. ", "To bed her but not wed her. That's what Sterling Mabry, the eighth Duke of Greystone, wants. But Frannie abhors arrogant aristocrats interested only in their own pleasure. So why then does the thought of an illicit tryst with the devilish duke leave her trembling with desire? Her willing body begs for release... and a wicked, wonderful surrender."], "author": "Lorraine Heath", "num_pages": "384", "awards": [], "places": ["London, England"], "character_names": ["Frannie Darling", "Sterling Mabry, Duke of Greystone"], "language": "English", "publish_date": "2009-06-30 00:00:00", "ISBN": "0061733997"},
{"url": "https://www.goodreads.com/book/show/692985.Always_to_Remember", "num_ratings": "1,945", "num_reviews": "213", "avg_ratings": 4.19, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Romance", "Western Romance", "Historical", "Historical Fiction"], "title": "Always to Remember", "description": ["After refusing to fight for the Confederacy, Clayton was spurned by everyone in his hometown of Cedar Grove. To Meg, who lost her husbands and brothers in the war, Clay's presence was a constant offense. As punishment, Meg commissioned Clay to create a memorial for the town's war heroes. But as she spent months watching him, Meg's feelings began to change."], "author": "Lorraine Heath", "num_pages": "323", "awards": ["RITA Award by Romance Writers of America for Best Short Historical (1997)", "HOLT Medallion by Virginia Romance Writers for Short Historical & Nominee for Southern Theme (1997)"], "places": ["United States of America"], "character_names": ["Clayton Holland", "Meg Warner"], "language": "English", "publish_date": "1996-02-01 00:00:00", "ISBN": "0515118044"},
{"url": "https://www.goodreads.com/book/show/15702268-the-sum-of-all-kisses", "num_ratings": "12,518", "num_reviews": "1,144", "avg_ratings": 3.93, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency", "Historical Romance", "Regency Romance"], "title": "The Sum of All Kisses", "description": ["Hugh Prentice has never had patience for dramatic females, and if Lady Sarah Pleinsworth has ever been acquainted with the words shy or retiring, she's long since tossed them out the window. Besides, a reckless duel has left this brilliant mathematician with a ruined leg, and now he could never court a woman like Sarah, much less d", "Hugh Prentice has never had patience for dramatic females, and if Lady Sarah Pleinsworth has ever been acquainted with the words shy or retiring, she's long since tossed them out the window. Besides, a reckless duel has left this brilliant mathematician with a ruined leg, and now he could never court a woman like Sarah, much less dream of marrying her.", "Sarah has never forgiven Hugh for the duel he fought that nearly destroyed her family. But even if she could find a way to forgive him, it wouldn't matter. She doesn't care that his leg is less than perfect, it's his personality she can't abide. But forced to spend a week in close company they discover that first impressions are not always reliable. And when one kiss leads to two, three, and four, the mathematician may lose count, and the lady may, for the first time, find herself speechless ...", "New York Times bestselling author Julia Quinn's enchanting third novel in the Smythe-Smith quartet is guaranteed to make you laugh out loud and tug at your heartstrings in equal measures."], "author": "Julia Quinn", "num_pages": "373", "awards": [], "places": ["England"], "character_names": ["Honoria Smythe-Smith", "Marcus Holroyd", "Daniel Smythe-Smith", "Anne Wynter", "Lord Hugh Prentice", "Lady Sarah Pleinsworth", "Lady Frances Pleinsworth"], "language": "English", "publish_date": "2013-10-29 00:00:00", "ISBN": "0062072927"},
{"url": "https://www.goodreads.com/book/show/9755694-sing-my-name", "num_ratings": "1,501", "num_reviews": "141", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Westerns", "Historical", "Romance", "Romance", "Western Romance", "Historical", "Historical Fiction"], "title": "Sing My Name", "description": ["Sarah Hammond is the overprotected daughter of passionate Massachusetts abolitionists. Matt Slade is the orphaned son of hardscrabble Texas settlers. Sarah knows about every Civil War battle from studying newspaper accounts. Matt fought in the bloodiest of them under Generals Longstreet and Lee. If Matt and Sarah ever crossed paths, it should have been for an unremarkable", "Sarah Hammond is the overprotected daughter of passionate Massachusetts abolitionists. Matt Slade is the orphaned son of hardscrabble Texas settlers. Sarah knows about every Civil War battle from studying newspaper accounts. Matt fought in the bloodiest of them under Generals Longstreet and Lee. If Matt and Sarah ever crossed paths, it should have been for an unremarkable moment. He would tip his hat. She would nod and pass on by. ", "Except that as survivors of a Comanche attack, Matt and Sarah spend far more than a moment together. They come to know each other, depend on each other and love each other. Humiliated by Sarah's love for \"Rebel trash,\" her jilted fiance extracts a revenge so vicious, he boasts that he destroyed the young lovers. Did he? Or when Matt and Sarah meet again years later, can they put their lives and their love back together?"], "author": "Ellen O'Connell", "num_pages": "407", "awards": [], "places": ["Texas"], "character_names": ["Sarah Hammond", "Matt Slade"], "language": "English", "publish_date": "2010-11-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16073772-the-boy-next-door", "num_ratings": "810", "num_reviews": "87", "avg_ratings": 3.52, "genres": ["Romance", "Romance", "Contemporary Romance", "Womens Fiction", "Chick Lit", "Disability", "Fiction", "Contemporary"], "title": "The Boy Next Door", "description": ["Through middle school, high school, bad dates, and an ill-advised punk phase, Tasha has always been able to count on Jason. Since the day he moved in next door, he’s gone from the weird kid in a wheelchair to Tasha’s most trusted friend. But lives change and the friends are going in different directions. When Jason and Tasha rekindl", "Through middle school, high school, bad dates, and an ill-advised punk phase, Tasha has always been able to count on Jason. Since the day he moved in next door, he’s gone from the weird kid in a wheelchair to Tasha’s most trusted friend. But lives change and the friends are going in different directions. When Jason and Tasha rekindle their friendship, sparks fly. After years of being a wild soul, now the ex-lead of a band turned music teacher is just looking for a relationship to last.", "When none other than Jason introduces her to a man who can give her what she wants, Tasha is on the verge of throwing passion and love away just so she can forget her troubled past and settle down. But Jason isn’t ready to give her up just yet."], "author": "Annabelle Costa", "num_pages": "228", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-16 00:00:00", "ISBN": "0985826304"},
{"url": "https://www.goodreads.com/book/show/659600.Annie_s_Song", "num_ratings": "11,348", "num_reviews": "889", "avg_ratings": 4.2, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Historical", "Historical Fiction", "Adult"], "title": "Annie's Song", "description": ["Annie Trimble lives in a solitary world that no one enters or understands. As delicate and beautiful as the tender blossoms of the Oregon spring, she is shunned by a town that misinterprets her affliction. But cruelty cannot destroy the love Annie holds in her heart. ", "Annie Trimble lives in a solitary world that no one enters or understands. As delicate and beautiful as the tender blossoms of the Oregon spring, she is shunned by a town that misinterprets her affliction. But cruelty cannot destroy the love Annie holds in her heart. "], "author": "Catherine Anderson", "num_pages": "410", "awards": [], "places": ["Hooperville, Oregon"], "character_names": ["Alex Montgomery", "Annie Trimble"], "language": "English", "publish_date": "1996-01-16 00:00:00", "ISBN": "0380779617"},
{"url": "https://www.goodreads.com/book/show/16283298-the-embattled-road", "num_ratings": "1,727", "num_reviews": "245", "avg_ratings": 4.22, "genres": ["War", "Military Fiction", "Romance", "Contemporary", "Romance", "Contemporary Romance", "Romance", "Romantic Suspense", "Novella"], "title": "The Embattled Road", "description": ["In the harrowing prequel to The Lost and Found series, three embattled Marines must deal with their devastating physical and emotional injuries in a world that seems to have turned against them. ", "When the rescue helicopter crashes into his convoy in Iraq, Marine First Sergeant Duncan Wilde struggles with the loss of men, his career and the use of his body. Things can't get", "In the harrowing prequel to The Lost and Found series, three embattled Marines must deal with their devastating physical and emotional injuries in a world that seems to have turned against them. ", "When the rescue helicopter crashes into his convoy in Iraq, Marine First Sergeant Duncan Wilde struggles with the loss of men, his career and the use of his body. Things can't get much worse. Until his fiancée decides she has to move on with her life, and that of her unborn child by another man.", "Sergeant Chad Lowell knew when he went to war that it would come with a price. And it did. A young Marine under his command is killed by a landmine. Chad's left with one less leg and a mountain of recriminations. That doesn't mean he wants to be a pitied by every female he comes in contact with.", "Gunnery Sergeant John Palmer is furious at the hand he's been dealt. He's served his country faithfully, if not without antagonism, for many years. Now they're turning him out like a relative who has overstayed his welcome. And, since he's not even a real man anymore, maybe it is time to move on permanently. ", "Can these wounded warriors use a friendship borne out of adversity to form a partnership rescuing others? And can they find real love in spite of their challenges?"], "author": "J.M. Madden", "num_pages": "67", "awards": [], "places": [], "character_names": ["Duncan Wilde", "Chad Lowell", "John Palmer"], "language": "English", "publish_date": "2012-12-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10179673-england-s-perfect-hero", "num_ratings": "5,782", "num_reviews": "282", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical Romance", "Regency Romance", "Historical", "Historical Fiction"], "title": "England's Perfect Hero", "description": ["Lucinda Barrett's best friends ended up married to the men to whom they delivered their 'lessons in love'. So Lucinda decides to choose someone who definitely needs lessons, but someone who will not complicate her life. And that person is definitely not Robert Carroway.", "Robert is nothing if not complicated, and though he is the brother of a viscount, he rarely goes about so", "Lucinda Barrett's best friends ended up married to the men to whom they delivered their 'lessons in love'. So Lucinda decides to choose someone who definitely needs lessons, but someone who will not complicate her life. And that person is definitely not Robert Carroway.", "Robert is nothing if not complicated, and though he is the brother of a viscount, he rarely goes about society, and finds the weather and hat fashions ludicrous subjects for discussion. Robert is attracted to Lucinda's unpretentious ways, her serenity and her kindness. When she chooses someone for her love lessons, Robert offers to help her deliver her lessons, but sets out to convince the woman he has fallen for to take a chance on love ... and on him."], "author": "Suzanne Enoch", "num_pages": "384", "awards": [], "places": [], "character_names": ["Lucinda Barrett", "Robert Carroway"], "language": "English", "publish_date": "2009-10-13 00:00:00", "ISBN": "006174171X"},
{"url": "https://www.goodreads.com/book/show/4315240-the-write-man-for-her", "num_ratings": "206", "num_reviews": "22", "avg_ratings": 3.5, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Disability"], "title": "The Write Man for Her", "description": ["Work, work, work. That's how Jessica Anne Singer has dealt with the loneliness since her divorce. Except for her squawky cockatiel, Merlin, Jessica hasn't had a date in years, but all that's about to end. Jessica's best friend, Cath, has decided that Jessica needs to meet her dreamy online professor, Brant Wilson. Creative writing professor Brant Wilson is intrigued by one", "Work, work, work. That's how Jessica Anne Singer has dealt with the loneliness since her divorce. Except for her squawky cockatiel, Merlin, Jessica hasn't had a date in years, but all that's about to end. Jessica's best friend, Cath, has decided that Jessica needs to meet her dreamy online professor, Brant Wilson. Creative writing professor Brant Wilson is intrigued by one of his online students, Jessica Singer. She seems more worldly than most of his students and has a penchant for arguing with him over just about everything, which he finds oddly enjoyable. But when she asks to meet with him in person to discuss her grades he immediately refuses. He never meets with his students face-to-face. Never. Undeterred, Cath hatches a harebrained plan to find the reclusive professor. When the plan actually works, Jessica uncovers the real reason the professor doesn't meet with his students. Stunned by her discovery, Jessica must decide if she'll listen to her head or her heart when it comes to determining if Professor Brant Wilson is the right man for her."], "author": "Christie Walker Bos", "num_pages": "334", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-05-15 00:00:00", "ISBN": "1419957619"},
{"url": "https://www.goodreads.com/book/show/13627403-imperfect-beauty", "num_ratings": "129", "num_reviews": "22", "avg_ratings": 3.29, "genres": ["Romance", "Contemporary Romance", "Romance", "Disability", "Contemporary", "Short Stories"], "title": "Imperfect Beauty", "description": ["A visit to the Highland games goes awry for Alasdair Buchanan when his cousin abandons him in the crowd. His guide dog is terrible at describing the sights, but he does a great job of finding the river. Too bad Alasdair has no clue where that river is in relation to his cousin’s apartment.", "When Trisha Wright stops to speak with him in her angelic voice, Alasdair is certain", "A visit to the Highland games goes awry for Alasdair Buchanan when his cousin abandons him in the crowd. His guide dog is terrible at describing the sights, but he does a great job of finding the river. Too bad Alasdair has no clue where that river is in relation to his cousin’s apartment.", "When Trisha Wright stops to speak with him in her angelic voice, Alasdair is certain his cousin did him a favor by abandoning him. Trisha loves the Scot’s flirtatious ways and basks in his compliments, but she can’t shake the fear that he’ll hate her when he learns the truth about her—a truth everyone can see but him."], "author": "E.A. West", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/124830.The_Secret_Pearl", "num_ratings": "5,548", "num_reviews": "311", "avg_ratings": 3.89, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "The Secret Pearl", "description": ["He first spies her in the shadows outside a London theatre, a ravishing creature forced to barter her body to survive. ", "To the woman known simply as Fleur, the well-dressed gentleman with the mesmerizing eyes is an unlikely savior. And when she takes the stranger to her bed, she never expects to see him again. But then Fleur accepts a position as governess to a young girl…a", "He first spies her in the shadows outside a London theatre, a ravishing creature forced to barter her body to survive. ", "To the woman known simply as Fleur, the well-dressed gentleman with the mesmerizing eyes is an unlikely savior. And when she takes the stranger to her bed, she never expects to see him again. But then Fleur accepts a position as governess to a young girl…and is stunned to discover that her midnight lover is a powerful nobleman. As two wary hearts ignite—and the threat of scandal hovers over them—one question remains: will she be mistress or wife?"], "author": "Mary Balogh", "num_pages": "401", "awards": [], "places": ["United Kingdom"], "character_names": ["Isabella Fleur Bradshaw", "Adam Kent"], "language": "English", "publish_date": "2005-11-29 00:00:00", "ISBN": "0440242975"},
{"url": "https://www.goodreads.com/book/show/799268.Tapestry", "num_ratings": "840", "num_reviews": "84", "avg_ratings": 3.75, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Fairy Tales", "Beauty and The Beast", "Historical", "Regency"], "title": "Tapestry", "description": ["For Lady Laura Blake, there is only one man in the world: Alex, the Earl of Cardiff. Yet ever since he was wounded in battle, Alex has locked himself away in his great stone castle at Heddon Hall. Believing himself to be less than a man, he conceals his ravaged face behind a leather mask...and hides his scarred soul beneath an icy aloofness.", "A mere child when he went off to", "For Lady Laura Blake, there is only one man in the world: Alex, the Earl of Cardiff. Yet ever since he was wounded in battle, Alex has locked himself away in his great stone castle at Heddon Hall. Believing himself to be less than a man, he conceals his ravaged face behind a leather mask...and hides his scarred soul beneath an icy aloofness.", "A mere child when he went off to war, Laura has blossomed into a beautiful young woman Alex scarcely recognizes. The compassion and desire he sees shining out of her eyes tempts him to ease his pain in her sweet, sensual embrace. But as need flames into uncontrollable passion, an evil fate conspires against them both, weaving a web of treachery and betrayal that could bring heartbreak or happiness to those who dare to love."], "author": "Karen Ranney", "num_pages": "380", "awards": [], "places": [], "character_names": ["Lady Laura Blake", "Alex, the Earl of Cardiff"], "language": "English", "publish_date": "1995-04-01 00:00:00", "ISBN": "0821749021"},
{"url": "https://www.goodreads.com/book/show/16050911-beast", "num_ratings": "3,157", "num_reviews": "333", "avg_ratings": 4.22, "genres": ["Romance", "Romance", "Interracial Romance", "Contemporary", "Romance", "Contemporary Romance", "Fairy Tales", "Beauty and The Beast", "War", "Military Fiction"], "title": "Beast", "description": ["Pepper Pace's interracial fairytale is the story of Beast; a Marine with a destroyed face and a plus sized beauty who has identity issues. A lesson learned is that beauty is not what is on the outside...In this romance that is taken from the Beauty and the Beasts' fairytale, it will leave you questioning 'who is the beauty and who is the beast?'"], "author": "Pepper Pace", "num_pages": "401", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20821105-the-fault-in-our-stars", "num_ratings": "2,833,043", "num_reviews": "146,389", "avg_ratings": 4.25, "genres": ["Young Adult", "Fiction", "Romance", "Contemporary"], "title": "The Fault in Our Stars", "description": ["John Green's brilliant #1 bestselling novel \"The Fault in Our Stars\" is now a major motion picture starring Shailene Woodley, Ansel", "Elgort, Laura Dern, and Willem Dafoe, in movie theaters June 6, 2014! ", "Includes a full-color insert of stills from the movie! ", "TODAY Book Club pick", " TIME Magazine's #1 Fiction Book of 2012 ", " \"The greatest romance story of this decade.\" --\"Entertain", "John Green's brilliant #1 bestselling novel \"The Fault in Our Stars\" is now a major motion picture starring Shailene Woodley, Ansel", "Elgort, Laura Dern, and Willem Dafoe, in movie theaters June 6, 2014! ", "Includes a full-color insert of stills from the movie! ", "TODAY Book Club pick", " TIME Magazine's #1 Fiction Book of 2012 ", " \"The greatest romance story of this decade.\" --\"Entertainment Weekly\" ", " -Millions of copies sold- ", " #1 New York Times Bestseller", " #1 Wall Street Journal Bestseller", " #1 USA Today Bestseller", " #1 International Bestseller", " #1 Indie Bestseller ", " Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten. ", " Insightful, bold, irreverent, and raw, \"The Fault in Our Stars\" brilliantly explores the funny, thrilling, and tragic business of being alive and in love."], "author": "John Green", "num_pages": "313", "awards": ["Georgia Peach Book Award (2013)", "Buxtehuder Bulle (2012)", "Odyssey Award (2013)", "Audie Award for Teens (2013)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2013)", "Pennsylvania Young Readers' Choice Award for Young Adults (2013)", "Evergreen Teen Book Award (2015)", "Soaring Eagle Book Award (2014)", "Milwaukee County Teen Book Award (2013)", "Indies Choice Book Award for Young Adult (2013)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2013)", "Amelia Elizabeth Walden Award (2013)", "Dioraphte Jongerenliteratuurprijs for vertaald boek en publieksprijs (2013)", "The Inky Awards for Silver Inky (2012)", "California Young Readers Medal for Young Adult (2015)", "Lincoln Award (2014)", "Luisterboek Award (2015)", "Goodreads Choice Award for Best Young Adult Fiction (2012)", "Green Mountain Book Award (2014)", "The Inky Awards Shortlist for Silver Inky (2012)", "Louisiana Teen Readers' Choice (2015)", "Missouri Gateway Readers Award (2015)", "Oklahoma Sequoyah Award for High School (2015)", "Alabama Author Award for Young Adult (2013)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera independiente (2012)", "FAB Award Nominee (2014)"], "places": ["Indianapolis, Indiana", "Amsterdam"], "character_names": ["Hazel Grace Lancaster", "Augustus Waters", "Isaac"], "language": "English", "publish_date": "2014-04-08 00:00:00", "ISBN": "0147513731"},
{"url": "https://www.goodreads.com/book/show/8663392-unveiled", "num_ratings": "7,370", "num_reviews": "791", "avg_ratings": 3.87, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction"], "title": "Unveiled", "description": ["Ash Turner has waited a lifetime to seek revenge on the man who ruined his family - and now the time for justice has arrived. At Parford Manor, he intends to take his place as the rightful heir to the dukedom and settle an old score with the current duke once and for all. But instead he finds himself drawn to a tempting beauty who has the power to undo all his dreams of ve", "Ash Turner has waited a lifetime to seek revenge on the man who ruined his family - and now the time for justice has arrived. At Parford Manor, he intends to take his place as the rightful heir to the dukedom and settle an old score with the current duke once and for all. But instead he finds himself drawn to a tempting beauty who has the power to undo all his dreams of vengeance….", "Lady Margaret knows she should despise the man who's stolen her fortune and her father's legacy - the man she's been ordered to spy on in the guise of a nurse. Yet the more she learns about the new duke, the less she can resist his smoldering appeal. Soon Margaret and Ash find themselves torn between old loyalties - and the tantalizing promise of passion…."], "author": "Courtney Milan", "num_pages": "384", "awards": ["RITA Award by Romance Writers of America Nominee for Historical Romance (2012)", "DABWAHA Romance Tournament for Best Historical Romance (2012)"], "places": ["Somerset, England"], "character_names": ["Margaret Dalrymple", "Ash Turner", "Mark Turner", "Smite Turner"], "language": "English", "publish_date": "2011-01-25 00:00:00", "ISBN": "0373775431"},
{"url": "https://www.goodreads.com/book/show/13360101-never-seduce-a-scot", "num_ratings": "20,063", "num_reviews": "1,661", "avg_ratings": 4.18, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "Never Seduce a Scot", "description": ["Eveline Armstrong is fiercely loved and protected by her powerful clan, but outsiders consider her “touched.” Beautiful, fey, with a level, intent gaze, she doesn’t speak. No one, not even her family, knows that she cannot hear. Content with her life of seclusion, Eveline has taught herself to read lips and allows the outside world to view her as daft. But when an arranged", "Eveline Armstrong is fiercely loved and protected by her powerful clan, but outsiders consider her “touched.” Beautiful, fey, with a level, intent gaze, she doesn’t speak. No one, not even her family, knows that she cannot hear. Content with her life of seclusion, Eveline has taught herself to read lips and allows the outside world to view her as daft. But when an arranged marriage into a rival clan makes Graeme Montgomery her husband, Eveline accepts her duty—unprepared for the delights to come. Graeme is a rugged warrior with a voice so deep and powerful that his new bride can hear it, and hands and kisses so tender and skilled that he stirs her deepest passions.", "Graeme is intrigued by the mysterious Eveline, whose silent lips are ripe with temptation and whose bright, intelligent eyes can see into his soul. As intimacy deepens, he learns her secret. But when clan rivalries and dark deeds threaten the wife he has only begun to cherish, the Scottish warrior will move heaven and earth to save the woman who has awakened his heart to the beautiful song of a rare and magical love."], "author": "Maya Banks", "num_pages": "372", "awards": [], "places": [], "character_names": ["Eveline Armstrong", "Graeme Montgomery"], "language": "English", "publish_date": "2012-09-25 00:00:00", "ISBN": "0345533232"},
{"url": "https://www.goodreads.com/book/show/854757.Bet_Me", "num_ratings": "79,280", "num_reviews": "3,414", "avg_ratings": 3.93, "genres": ["Romance", "Womens Fiction", "Chick Lit", "Romance", "Contemporary Romance", "Contemporary", "Fiction", "Humor", "Humor", "Funny"], "title": "Bet Me", "description": ["Minerva Dobbs knows that happily-ever-after is a fairy tale, especially with a man who asked her to dinner to win a bet. Even if he is gorgeous and successful Calvin Morrisey. Cal knows commitment is impossible, especially with a woman as cranky as Min Dobbs. Even if she does wear great shoes and keeps him on his toes. When they say good-bye at the end of their evening, th", "Minerva Dobbs knows that happily-ever-after is a fairy tale, especially with a man who asked her to dinner to win a bet. Even if he is gorgeous and successful Calvin Morrisey. Cal knows commitment is impossible, especially with a woman as cranky as Min Dobbs. Even if she does wear great shoes and keeps him on his toes. When they say good-bye at the end of their evening, they cut their losses and agree never to see each other again.", "But Fate has other plans, and it's not long before Min and Cal meet again. Soon, they're dealing with a jealous ex-boyfriend, Krispy Kreme donuts, a determined psychologist, chaos theory, a freakishly intelligent cat, Chicken Marsala, and more risky propositions than either of them ever dreamed of. Including the biggest gamble of all—true love."], "author": "Jennifer Crusie", "num_pages": "391", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Romance & Best Contemporary Romance & Favorite Funny & Best Heroine & Best Chick Lit/Women's Fiction & Best Couple & Honorable Mention for Best Hero (2005)", "RITA Award by Romance Writers of America for Best Contemporary Single Title (2005)", "Romance Readers Anonymous (RRA) Award for Best Romance of the Year (2004)"], "places": ["United States of America", "Ohio"], "character_names": ["Minerva Dobbs", "Calvin Morrisey", "David Fisk"], "language": "English", "publish_date": "2004-08-31 00:00:00", "ISBN": "0312987854"},
{"url": "https://www.goodreads.com/book/show/42899.Dark_Lover", "num_ratings": "254,974", "num_reviews": "11,387", "avg_ratings": 4.21, "genres": ["Romance", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Paranormal Romance", "Fantasy"], "title": "Dark Lover", "description": ["In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherhood.", "The only purebred vampire left on earth, Wrath has a score", "In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherhood.", "The only purebred vampire left on earth, Wrath has a score to settle with the slayers who murdered his parents centuries ago. But, when one of his most trusted fighters is killed-leaving his half-breed daughter unaware of his existence or her fate-Wrath must usher her into the world of the undead-a world of sensuality beyond her wildest dreams."], "author": "J.R. Ward", "num_pages": "393", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Alt Reality/Paranormal (2006)", "RITA Award by Romance Writers of America Nominee for Paranormal Romance (2006)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Vampire Romance (2005)", "HOLT Medallion by Virginia Romance Writers Nominee for Paranormal/Time Travel/Futuristic/Fantasy (2006)", "DABWAHA Romance Tournament for Best Paranormal: Vampires, Werewolves, and the Supernatural (2006)"], "places": ["Caldwell, New York", "New York (the state)"], "character_names": ["Mr. X", "Marissa", "Brian O'Neal", "Zsadist", "Vishous", "Fritz Perlmutter", "Phury", "Beth (Elizabeth) Randall", "Tohrment", "Mr. O", "Wellesandra", "Darius", "The Scribe Virgin", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0451216954"},
{"url": "https://www.goodreads.com/book/show/17340459-embattled-hearts", "num_ratings": "4,280", "num_reviews": "446", "avg_ratings": 3.99, "genres": ["Romance", "War", "Military Fiction", "Romance", "Romantic Suspense", "Romance", "Contemporary Romance", "Contemporary"], "title": "Embattled Hearts", "description": ["John Palmer hasn't felt like a real man since he was injured during combat in Iraq. Though not content with his new life, he is mostly adapting, just like the other vets at the Lost ‘N’ Found Investigative Service. When Shannon Murphy is hired on as the new office manager, life suddenly gets a lot more interesting. Before long, John finds himself wondering if he could ever", "John Palmer hasn't felt like a real man since he was injured during combat in Iraq. Though not content with his new life, he is mostly adapting, just like the other vets at the Lost ‘N’ Found Investigative Service. When Shannon Murphy is hired on as the new office manager, life suddenly gets a lot more interesting. Before long, John finds himself wondering if he could ever be the kind of man Shannon needs."], "author": "J.M. Madden", "num_pages": "262", "awards": [], "places": ["Denver, Colorado"], "character_names": ["Shannon Murphy", "John Palmer", "Jimmy Wilkins", "Aiden Willingham", "Boohini", "Harper Preston", "Lisa Dixon", "Cameron Jennings", "Ralph Jamison", "Pickle", "Clayton Williams", "Roger Stottsberry", "Michael J. Gerbowski"], "language": "English", "publish_date": "2013-12-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18052985-romancing-the-duke", "num_ratings": "21,160", "num_reviews": "2,411", "avg_ratings": 3.91, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency", "Adult"], "title": "Romancing the Duke", "description": ["As the daughter of a famed author, Isolde Ophelia Goodnight grew up on tales of brave knights and fair maidens. She never doubted romance would be in her future, too. The storybooks offered endless possibilities.", "And as she grew older, Izzy cros", "As the daughter of a famed author, Isolde Ophelia Goodnight grew up on tales of brave knights and fair maidens. She never doubted romance would be in her future, too. The storybooks offered endless possibilities.", "And as she grew older, Izzy crossed them off. One by one by one.", "No, no, and… Heh.", "Now Izzy’s given up yearning for romance. She’ll settle for a roof over her head. What fairy tales are left over for an impoverished twenty-six year-old woman who’s never even been kissed?", "This one."], "author": "Tessa Dare", "num_pages": "370", "awards": ["RITA Award by Romance Writers of America for Best Historical Romance: Short (2015)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Historical Romance of the Year (2014)", "Goodreads Choice Award Nominee for Romance (2014)"], "places": [], "character_names": ["Isolde Ophelia Goodnight", "Ransom Vane, Duke of Rothbury"], "language": "English", "publish_date": "2014-01-28 00:00:00", "ISBN": "0062240196"},
{"url": "https://www.goodreads.com/book/show/7795220-the-prize", "num_ratings": "24,015", "num_reviews": "580", "avg_ratings": 4.22, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Medieval", "Historical", "Historical Fiction"], "title": "The Prize", "description": ["In the resplendence of William the Conqueror's London court, the lovely Saxon captive, Nicholaa was forced to choose a husband from the assembled Norman nobles. She chose Royce, a baron warrior whose fierce demeanor could not conceal his chivalrous and tender heart. Resourceful, rebellious and utterly naive,", "In the resplendence of William the Conqueror's London court, the lovely Saxon captive, Nicholaa was forced to choose a husband from the assembled Norman nobles. She chose Royce, a baron warrior whose fierce demeanor could not conceal his chivalrous and tender heart. Resourceful, rebellious and utterly naive, Nicholaa vowed to bend Royce to her will, despite the whirlwind of feelings he aroused in her. Ferocious in battle, seasoned in passion, Royce was surprised by the depth of his emotion whenever he caressed his charming bride.", "In a climate of utmost treachery, where Saxons still intrigued against their Norman invaders, Royce and Nicholaa reveled in their precious new love...a fervent bond soon to be disrupted by the call of blood, kin and country!"], "author": "Julie Garwood", "num_pages": "408", "awards": [], "places": ["England"], "character_names": ["Nicholaa", "Royce Melborn"], "language": "English", "publish_date": "1991-08-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16164536-playing-the-part", "num_ratings": "536", "num_reviews": "81", "avg_ratings": 3.76, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Disability", "Womens Fiction", "Chick Lit"], "title": "Playing the Part", "description": ["Anthea Cane is a successful actress—well, action star. Her films are mostly about how hot she looks silhouetted by fiery explosions. But Anthea is determined to prove she's more than just a body. With the role of a lifetime up for grabs—a serious adaptation of her favorite novel—Anthea sets off to her small hometown in the name of research.", "Cole Daniel is a blind farmer wit", "Anthea Cane is a successful actress—well, action star. Her films are mostly about how hot she looks silhouetted by fiery explosions. But Anthea is determined to prove she's more than just a body. With the role of a lifetime up for grabs—a serious adaptation of her favorite novel—Anthea sets off to her small hometown in the name of research.", "Cole Daniel is a blind farmer with no patience for divas, especially one who mercilessly teased him as a young boy. When Anthea shows up using a fake name and pestering him into letting her stay, he can't pass up the opportunity to torment her just a little.", "But Anthea won't let the stubborn farmer deter her from her goal, even if he is hotter than any man she's ever met. Cole finds his form of payback less than satisfying when Anthea keeps turning the tables on him, proving her mettle and gaining his respect. Will Anthea's research land her a man, as well as the part?"], "author": "Darcy Daniel", "num_pages": "179", "awards": ["Charter Oak Golden Acorn Award for contemporary series romance (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-04 00:00:00", "ISBN": "1426895011"},
{"url": "https://www.goodreads.com/book/show/18089551-tall-tatted-and-tempting", "num_ratings": "26,187", "num_reviews": "1,974", "avg_ratings": 4.22, "genres": ["Romance", "Contemporary", "Romance", "Contemporary Romance", "Disability"], "title": "Tall, Tatted and Tempting", "description": ["She’s locked up tight. But he might be the key.", "Logan Reed is tall, tatted and tempting. Kit’s a woman with a mean right hook and a secret.", "Kit wants a tattoo, but Logan sees more than she intends to share in the drawing of the tat she wants. He sees her in ways no one ever has.", "Logan’s not disabled; but he hasn’t spoken in eight years. He hasn’t needed to. Until he meets Kit", "She’s locked up tight. But he might be the key.", "Logan Reed is tall, tatted and tempting. Kit’s a woman with a mean right hook and a secret.", "Kit wants a tattoo, but Logan sees more than she intends to share in the drawing of the tat she wants. He sees her in ways no one ever has.", "Logan’s not disabled; but he hasn’t spoken in eight years. He hasn’t needed to. Until he meets Kit.", "Logan doesn’t know everything about Kit. Kit doesn’t know anything about herself, until she has to sacrifice all she ever wanted to save what’s most important to him."], "author": "Tammy Falkner", "num_pages": "323", "awards": [], "places": ["New York (the state)"], "character_names": ["Logan", "Emily"], "language": "English", "publish_date": "2013-06-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10210.Jane_Eyre", "num_ratings": "1,364,345", "num_reviews": "34,236", "avg_ratings": 4.11, "genres": ["Classics", "Fiction", "Romance"], "title": "Jane Eyre", "description": [" ", " "], "author": "Charlotte Brontë", "num_pages": "507", "awards": [], "places": ["Thornfield", "England"], "character_names": ["Jane Eyre", "Bertha Mason", "Grace Poole", "Blanche Ingram", "Adele Varens", "St. John Rivers", "Helen Burns", "Richard Mason", "Diana Rivers", "Mary Rivers", "Maria Temple", "Robert Brocklehurst", "Sarah Reed", "Georgiana Reed", "Eliza Reed", "Bessie Lee", "Alice Fairfax", "Rosamond Oliver", "Edward Rochester", "John Eyre", "Celine Varens"], "language": "English", "publish_date": "2003-02-04 00:00:00", "ISBN": "0142437204"},
{"url": "https://www.goodreads.com/book/show/420780.If_You_Deceive", "num_ratings": "10,477", "num_reviews": "439", "avg_ratings": 4.17, "genres": ["Romance", "Historical Romance", "Romance", "Historical"], "title": "If You Deceive", "description": ["Burning vengeance... ", "Ethan MacCarrick was a heartbreakingly handsome rake until a powerful nobleman ordered him brutally beaten and his face scarred for a crime he didn't commit. Ethan's reprisal -- bankrupting the nobleman and forcing his exile -- does little to appease his wrath. Ten years later, a haughty, mysterious beauty enchants Ethan -- the daughter of his enemy. A", "Burning vengeance... ", "Ethan MacCarrick was a heartbreakingly handsome rake until a powerful nobleman ordered him brutally beaten and his face scarred for a crime he didn't commit. Ethan's reprisal -- bankrupting the nobleman and forcing his exile -- does little to appease his wrath. Ten years later, a haughty, mysterious beauty enchants Ethan -- the daughter of his enemy. At last, Ethan will have the revenge he's craved; he'll promise her marriage, seduce her, then cast her aside. ", "Bitter hardships... ", "When Madeleine van Rowen's family was suddenly plunged into destitution and dishonor, she steeled herself against further heartache. She never weakened, never trusted, until a towering, scarred Highlander relentlessly pursues her, breaking down her defenses. ", "At what price forgiveness? ", "The passion between them burns hotter than Ethan's fury, and soon he finds he can't let her go. But when Madeleine uncovers the truth about him, can Ethan convince her to accept all he now offers -- when he once destroyed everything she had?"], "author": "Kresley Cole", "num_pages": "356", "awards": [], "places": ["London, England", "Paris"], "character_names": ["Maddie Moody", "Ethan MacCarrick"], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "1416503617"},
{"url": "https://www.goodreads.com/book/show/367689.Ravished", "num_ratings": "14,262", "num_reviews": "647", "avg_ratings": 4.01, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Ravished", "description": ["The New York Times bestselling author of Rendezvous presents a spellbinding new Regency historical destined to be a hot beach read this summer. Moving from the cozy confines of a tiny seaside village named Upper Biddleton to the glittering crush of a fashionable London soiree, Quick offers an enthralling tale of a mismatched couple poised to discover the rapture of love.", "Th", "The New York Times bestselling author of Rendezvous presents a spellbinding new Regency historical destined to be a hot beach read this summer. Moving from the cozy confines of a tiny seaside village named Upper Biddleton to the glittering crush of a fashionable London soiree, Quick offers an enthralling tale of a mismatched couple poised to discover the rapture of love.", "There was no doubt about it. What Miss Harriet Pomeroy needed was a man. Someone powerful and clever who could help her rout the unscrupulous thieves who were using her beloved caves to hide their loot. But when Harriet summoned Gideon Westbrook, Viscount St. Justin, to her aid, she could not know that she was summoning the devil himself. . . . ", "Dubbed the Beast of Blackthorne Hall for his scarred face and lecherous past, Gideon was strong and fierce and notoriously menacing. Yet Harriet could not find it in her heart to fear him. For in his tawny gaze she sensed a savage pain she longed to soothe . . . and a searing passion she yearned to answer. Now, caught up in the Beast’s clutches, Harriet must find a way to win his heart–and evade the deadly trap of a scheming villain who would see them parted for all time.", "RAVISHED is a retelling of the classic tale, Beauty and the Beast."], "author": "Amanda Quick", "num_pages": "385", "awards": [], "places": ["London, England", "Upper Biddleton, England"], "character_names": ["Harriet Pomeroy", "Gideon Westbrook, Viscount St. Justin"], "language": "English", "publish_date": "2005-12-16 00:00:00", "ISBN": "0553588699"},
{"url": "https://www.goodreads.com/book/show/20875501-scarred-horizon", "num_ratings": "148", "num_reviews": "5", "avg_ratings": 4.01, "genres": ["Romance", "Disability", "Contemporary", "War", "Military Fiction", "Action"], "title": "Scarred Horizon", "description": ["Paul’s story. ", "To be blind was bad enough; to question his sanity was a kick in the teeth; to give him a babysitter to monitor his every move was beyond his hard pressed endurance. ", "Kicked out of the army and queuing at the dreaded job centre, unable to even search for employment himself had been humiliating enough. Having to stan", "Paul’s story. ", "To be blind was bad enough; to question his sanity was a kick in the teeth; to give him a babysitter to monitor his every move was beyond his hard pressed endurance. ", "Kicked out of the army and queuing at the dreaded job centre, unable to even search for employment himself had been humiliating enough. Having to stand there and wait in line while listening to the vile terrorist who had murdered his team and had taken his sight, was more than Paul could take. The warlord had to die. It was a pity that the public didn’t see it that way and a prevented a raging Paul from dishing out his own form of justice. ", "Convincing the assault trial judge to choose an option preferable to prison was going to be an even harder task to perform. Paul’s former army mates are not going to let him be taken down without a fight but making a soft and fragrant minder a condition of his parole was a mortifying possibility that had never once crossed his mind. ", "Amy would do just about anything so see the big, handsome man sitting in the dock regain his pride but she hadn’t reckoned on Paul’s stubborn independence. Blind beyond reason, she just can’t get through to the obstinate blockhead that she only has his best interests in mind. If her good intentions break her own fragile heart then that is something she will just have to conquer but a month of child-minding the uncooperative ex soldier is becoming even more difficult than her generous spirit can survive. ", "With evil about to enter the beautiful château in the French countryside, will Paul open his mind and expose his hidden emotions for long enough to see the beautiful light in his forever darkened world or will his and Amy’s future perish under a viciously Scarred Horizon? ", "Scarred Horizon gently addresses the issues of disability after injuries sustained in battle. It is an uplifting read full of romance and intrigue suitable for age 16 and above. Contains sensual sex and some swearing."], "author": "Jackie Williams", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/71644.Simply_Love", "num_ratings": "5,839", "num_reviews": "364", "avg_ratings": 3.95, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Simply Love", "description": [" ...", "Anne first spied him in the deepening dusk of a Wales evening—a lone figure of breathtaking strength, his handsome face branded by a secret pain.", " ...", "Anne first spied him in the deepening dusk of a Wales evening—a lone figure of breathtaking strength, his handsome face branded by a secret pain. For teacher and single mother Anne Jewell, Sydnam Butler is a man whose sorrows—and passions—run deeper than she could have ever imagined. As steward of a remote seaside manor, Sydnam lives a reclusive existence. Yet he senses in Anne a kindred soul, and between these two wary hearts, desire stirs. Unable to resist the passion that has rescued them both, Anne and Sydnam share an afternoon of exquisite lovemaking. As scandal looms, suddenly the unwed mother and the war-scarred veteran must make a decision that could forever alter their lives ..."], "author": "Mary Balogh", "num_pages": "418", "awards": [], "places": [], "character_names": ["Anne Jewell", "Sydnam Butler"], "language": "English", "publish_date": "2007-02-27 00:00:00", "ISBN": "0440241979"},
{"url": "https://www.goodreads.com/book/show/7046495-lover-mine", "num_ratings": "94,931", "num_reviews": "4,018", "avg_ratings": 4.41, "genres": ["Romance", "Paranormal Romance", "Paranormal", "Vampires", "Romance", "Fantasy"], "title": "Lover Mine", "description": ["John Matthew has come a long way since he was found living among humans, his vampire nature unknown to himself and to those around him. After he was taken in by the Brotherhood, no one could guess what his true history was- or his true identity. Indeed, the fallen Brother Darius has returned, but with a different face and a very different destiny. As a vicious personal ven", "John Matthew has come a long way since he was found living among humans, his vampire nature unknown to himself and to those around him. After he was taken in by the Brotherhood, no one could guess what his true history was- or his true identity. Indeed, the fallen Brother Darius has returned, but with a different face and a very different destiny. As a vicious personal vendetta takes John into the heart of the war, he will need to call up on both who he is now and who he once was in order to face off against evil incarnate.", "Xhex, a symphath assassin, has long steeled herself against the attraction between her and John Matthew. Having already lost one lover to madness, she will not allow the male of worth to fall prey to the darkness of her twisted life. When fate intervenes, however, the two discover that love, like destiny, is inevitable between soul mates."], "author": "J.R. Ward", "num_pages": "528", "awards": ["All About Romance (AAR) Annual Reader Poll for Guiltiest Pleasure Romance & Honorable Mention for Best Paranormal Romance (2011)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Vampire Romance (2010)", "Goodreads Choice Award for Romance (2010)"], "places": ["Caldwell, New York"], "character_names": ["John Matthew", "Xhexania", "Qhuinn", "Blaylock", "Lash", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "0451229851"},
{"url": "https://www.goodreads.com/book/show/20639274-archer-s-voice", "num_ratings": "67,697", "num_reviews": "8,458", "avg_ratings": 4.43, "genres": ["Romance", "New Adult", "Contemporary", "Romance", "Contemporary Romance"], "title": "Archer's Voice", "description": ["When Bree Prescott arrives in the sleepy, lakeside town of Pelion, Maine, she hopes against hope that this is the place where she will finally find the peace she so desperately seeks. On her first day there, her life collides with Archer Hale, an isola", "When Bree Prescott arrives in the sleepy, lakeside town of Pelion, Maine, she hopes against hope that this is the place where she will finally find the peace she so desperately seeks. On her first day there, her life collides with Archer Hale, an isolated man who holds a secret agony of his own. A man no one else sees.", " is the story of a woman chained to the memory of one horrifying night and the man whose love is the key to her freedom. It is the story of a silent man who lives with an excruciating wound and the woman who helps him find his voice. It is the story of suffering, fate, and the transformative power of love.", "THIS IS A STANDALONE SIGN OF LOVE NOVEL, INSPIRED BY SAGITTARIUS. New Adult Contemporary Romance: Due to strong language and sexual content, this book is not intended for readers under the age of 18."], "author": "Mia Sheridan", "num_pages": "345", "awards": ["Goodreads Choice Award Nominee for Romance (2014)"], "places": ["Maine"], "character_names": ["Archer Hale", "Bree Prescott"], "language": "English", "publish_date": "2014-01-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/692935.Simple_Jess", "num_ratings": "2,493", "num_reviews": "244", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Historical", "Historical Fiction"], "title": "Simple Jess", "description": ["The last thing widow Althea Winsloe wanted to do was remarry. Unfortunately, her meddlesome mountain neighbors had other plans. So, one autumn night they banded together and gave Althea a shocking ultimatum: She was to find herself a husband by Christmas...or the town would do it for her! ", "Althea knew she had her choice of any single man in Marrying Stone, Arkansas. Yet the", "The last thing widow Althea Winsloe wanted to do was remarry. Unfortunately, her meddlesome mountain neighbors had other plans. So, one autumn night they banded together and gave Althea a shocking ultimatum: She was to find herself a husband by Christmas...or the town would do it for her! ", "Althea knew she had her choice of any single man in Marrying Stone, Arkansas. Yet the only one she felt truly comfortable with was Simple Jess.", "Sweet and gentle, Jess wasn't as smart as your average man. But his tender manner stirred Althea's heart in ways she had never dreamed possible.", "It would take a miracle to find a husband in Marrying Stone. But sometimes miracles are right under your nose."], "author": "Pamela Morsi", "num_pages": "325", "awards": [], "places": ["Ozark Mountains", "Arkansas"], "character_names": ["Althea Winsloe", "Jesse Best"], "language": "English", "publish_date": "1996-04-01 00:00:00", "ISBN": "0515118370"},
{"url": "https://www.goodreads.com/book/show/110391.The_Duke_and_I", "num_ratings": "68,670", "num_reviews": "2,978", "avg_ratings": 4.1, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency"], "title": "The Duke and I", "description": ["By all accounts, ", " is on the verge of proposing to his best friend’s sister, the lovely—and almost-on-the-shelf—", ". But the two of them know the truth—it’s all an elaborate plan to keep Simon free from marriage-minded", "By all accounts, ", " is on the verge of proposing to his best friend’s sister, the lovely—and almost-on-the-shelf—", ". But the two of them know the truth—it’s all an elaborate plan to keep Simon free from marriage-minded society mothers. And as for Daphne, surely she will attract some worthy suitors now that it seems a duke has declared her desirable.", "But as Daphne waltzes across ballroom after ballroom with Simon, it’s hard to remember that their courtship is a complete sham. Maybe it’s his devilish smile, certainly it’s the way his eyes seem to burn every time he looks at her… but somehow Daphne is falling for the dashing duke… for real! And now she must do the impossible and convince the handsome rogue that their clever little scheme deserves a slight alteration, and that nothing makes quite as much sense as falling in love…"], "author": "Julia Quinn", "num_pages": "384", "awards": ["RITA Award by Romance Writers of America Nominee for Short Historical Romance (2001)"], "places": ["London, England"], "character_names": ["Daphne Bridgerton", "Simon Basset, Duke of Hastings"], "language": "English", "publish_date": "2006-06-27 00:00:00", "ISBN": "0380800829"},
{"url": "https://www.goodreads.com/book/show/1814627.Texas_Destiny", "num_ratings": "4,937", "num_reviews": "391", "avg_ratings": 4.02, "genres": ["Romance", "Historical Romance", "Romance", "Westerns", "Historical", "Romance", "Western Romance", "Historical", "Historical Fiction"], "title": "Texas Destiny", "description": ["Arriving on the Fort Worth train, Miss Amelia Carson, mail-order bride, had never met Dallas Leigh, the Texan she promised to marry. The tall cowboy at the station wasn't Dallas. He was Houston, Dallas's brother, sent to escort her on the rugged three-week trek to the ranch where Dallas waited. Brought up in war-ravaged Georgia, Amelia thought", "Arriving on the Fort Worth train, Miss Amelia Carson, mail-order bride, had never met Dallas Leigh, the Texan she promised to marry. The tall cowboy at the station wasn't Dallas. He was Houston, Dallas's brother, sent to escort her on the rugged three-week trek to the ranch where Dallas waited. Brought up in war-ravaged Georgia, Amelia thought Dallas's letters made Texas sound like heaven, a place for her dreams to grow with the right man beside her.", "By all appearances, Houston Leigh would hardly be considered the \"right man.\" The war he survived had scarred him inside and out, and he was little competition for his handsome brother. But from the moment Houston met Amelia, he knew she possessed the courage this wild land needed. She had eyes that could see past his wounded face to his soul. And he would fight any man—except his brother—for her heart. Now he and Amelia were riding down dangerous trails, sleeping under the stars, and God help them, they were falling in love."], "author": "Lorraine Heath", "num_pages": "384", "awards": ["Texas Gold Award", "Desert Rose Golden Quill Award", "Camões Prize"], "places": ["Texas"], "character_names": ["Houston Leigh", "Amelia Carson"], "language": "English", "publish_date": "1997-06-01 00:00:00", "ISBN": "0451407520"},
{"url": "https://www.goodreads.com/book/show/18478373-forever-scarred", "num_ratings": "211", "num_reviews": "15", "avg_ratings": 4.02, "genres": ["Romance", "Contemporary", "War", "Military Fiction", "Romance", "Contemporary Romance", "Disability", "Romance", "Romantic Suspense", "Realistic Fiction"], "title": "Forever Scarred", "description": ["The long awaited sequel to Running Scarred. ", "Working alongside his ex-veteran friends in the isolated French chateau where he doesn’t have to explain how his face was destroyed, suits Joe perfectly. Barely able look at his own reflection let alone show himself to anyone else, the longer he can remain secluded from the outside world the better he likes it. ", "But Joe wants the", "The long awaited sequel to Running Scarred. ", "Working alongside his ex-veteran friends in the isolated French chateau where he doesn’t have to explain how his face was destroyed, suits Joe perfectly. Barely able look at his own reflection let alone show himself to anyone else, the longer he can remain secluded from the outside world the better he likes it. ", "But Joe wants the same as any man, he same things his friends have found and when a party of salesmen descends upon the chateau for a team building course, Joe’s resolve to keep out of the spotlight is put to its hardest test yet. The chief executive’s beautiful secretary is exactly the woman he is looking for, but he knows that she is unlikely to spare him even a glance. ", "Her life is complicated enough and embarking on any liaison is the last thing on Lucy’s mind but something about the huge ex-soldier has kept her heart pounding and her stomach fluttering from the moment she laid eyes on him. Joe’s scarred face pales into insignificance as she finds his potent strength, his gentle sincerity and his genial mood far too beguiling. ", "Can Lucy escape from her blackmailing boss and take what her heart desires without leaving herself destitute? Will Joe rise above his own crushing insecurities long enough to rescue Lucy not only from her own fears but from her handsome but lecherous employer, or will his lack of self-esteem and long practiced avoidance tactics prevent him from opening his heart and him keep him Forever Scarred? ", "Suitable for young adult upwards. Contains some swear words and beautiful sex."], "author": "Jackie Williams", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-15 00:00:00", "ISBN": "1492187224"},
{"url": "https://www.goodreads.com/book/show/28863.The_Raven_Prince", "num_ratings": "16,755", "num_reviews": "1,096", "avg_ratings": 3.98, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "The Raven Prince", "description": ["Widowed Anna Wren is having a wretched day. After an arrogant male on horseback nearly squashes her, she arrives home to learn that she is in dire financial straits.", "The Earl of Swartingham is in a quandary. Having frightened off two secretaries, Edward de Raaf needs someone who can withstand his bad t", "Widowed Anna Wren is having a wretched day. After an arrogant male on horseback nearly squashes her, she arrives home to learn that she is in dire financial straits.", "The Earl of Swartingham is in a quandary. Having frightened off two secretaries, Edward de Raaf needs someone who can withstand his bad temper and boorish behavior.", "When Anna becomes the earl's secretary, it would seem that ", " their problems are solved. Then she discovers he plans to visit the most notorious brothel in London for his \"manly\" needs. Well! Anna sees red—and decides to assuage her \"womanly\" desires...with the earl as her unknowing lover."], "author": "Elizabeth Hoyt", "num_pages": "392", "awards": ["All About Romance (AAR) Annual Reader Poll for Most Luscious Love Story & Honorable Mention for Best Buried Treasure (2007)", "Romantic Times Reviewers' Choice Award (RT Award) for Sensual Historical Romance (2006)"], "places": ["Little Battleford, England"], "character_names": ["Anna Wren", "Edward de Raaf, Earl of Swartingham"], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "0446618470"},
{"url": "https://www.goodreads.com/book/show/17402018-running-scarred", "num_ratings": "492", "num_reviews": "44", "avg_ratings": 3.7, "genres": ["Romance", "War", "Military Fiction", "Military Fiction", "Military Romance", "Contemporary", "Disability"], "title": "Running Scarred", "description": ["For three years ex-soldier, Patrick Reeves has avoided his once comfortable world. Unable to accept his terrible injuries, he moves to a secluded cottage in France and hides from everyone, most of all himself.", "But when a bright, beautiful woman, who stirs his blood and steals his heart, discovers the ruined Chateau and estate on which home stands, it's more than his unerrin", "For three years ex-soldier, Patrick Reeves has avoided his once comfortable world. Unable to accept his terrible injuries, he moves to a secluded cottage in France and hides from everyone, most of all himself.", "But when a bright, beautiful woman, who stirs his blood and steals his heart, discovers the ruined Chateau and estate on which home stands, it's more than his unerring control can bear. for her to flinch from his wounds would be terrible, but for to pity him would be the final insult. His only option is to ensure that she never sees him at all.", "Ellen doesn't give a damn what Patrick looks like. One glimpse of his shaded figure, one hint of his masculine scent and she is his forever. She ends her engagement and follows her heart, buying the Chateau to fulfil a dream that has been her only wish since her brother was blown up in Afghanistan. If she can capture the elusive Patrick while attaining her goals, her world will be complete.", "But Patrick is hiding from more than himself. Ellen is Devastated when he abandons her for a flame haired beauty and when her ex-fiance reappears, determined that he is surrendering neither Ellen or her fortune, she discovers that she is in danger of not only losing her lover but her life.", "Can Patrick escape in time to save the woman who loves and accepts him exactly as he is or will she be lost to him forever while he has been Running Scarred for far too long."], "author": "Jackie Williams", "num_pages": "242", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-19 00:00:00", "ISBN": "148190406X"},
{"url": "https://www.goodreads.com/book/show/360259.Flowers_from_the_Storm", "num_ratings": "11,702", "num_reviews": "1,165", "avg_ratings": 4.1, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency", "Fiction"], "title": "Flowers from the Storm", "description": ["The Duke of Jervaulx was brilliant - and dangerous. Considered dissolute, reckless, and extravagant, he was transparently referred to as the \"D of J\" in scandal sheets. But sometimes the most womanizing rakehell can be irresistible, and even his most causal attentions fascinated the sheltered Maddy Timms. ", "Then one fateful day she receives the shocking news - the duke is lo", "The Duke of Jervaulx was brilliant - and dangerous. Considered dissolute, reckless, and extravagant, he was transparently referred to as the \"D of J\" in scandal sheets. But sometimes the most womanizing rakehell can be irresistible, and even his most causal attentions fascinated the sheltered Maddy Timms. ", "Then one fateful day she receives the shocking news - the duke is lost to the world. And Maddy knows it is her destiny to help him and her only chance to find the true man behind the wicked facade. ", "But she never dreamed her gentle, healing touch would alter his life and her own so completely - and bind them together in need, desire...and love."], "author": "Laura Kinsale", "num_pages": "533", "awards": ["RITA Award by Romance Writers of America Nominee for Best Romance of the Year (1993)", "Romance Readers Anonymous (RRA) Award (1996)"], "places": ["London, England", "Wales"], "character_names": ["Christian Langland, Duke of Jervaulx", "Maddy Timms"], "language": "English", "publish_date": "2003-05-27 00:00:00", "ISBN": "0380761327"},
{"url": "https://www.goodreads.com/book/show/5554803-to-beguile-a-beast", "num_ratings": "11,003", "num_reviews": "569", "avg_ratings": 4.04, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Fairy Tales", "Beauty and The Beast", "Historical", "Historical Fiction"], "title": "To Beguile a Beast", "description": ["CAN A WOUNDED BEAST . . . ", "Reclusive Sir Alistair Munroe has hidden in his castle ever since returning from the Colonies, scarred inside and out. But when a mysterious beauty arrives at his door, the passions he's kept suppressed for years begin to awaken. ", "TRUST A BEAUTY WITH A PAST . . . ", "Running from past mistakes has taken legendary beauty Helen Fitzwilliam from the luxur", "CAN A WOUNDED BEAST . . . ", "Reclusive Sir Alistair Munroe has hidden in his castle ever since returning from the Colonies, scarred inside and out. But when a mysterious beauty arrives at his door, the passions he's kept suppressed for years begin to awaken. ", "TRUST A BEAUTY WITH A PAST . . . ", "Running from past mistakes has taken legendary beauty Helen Fitzwilliam from the luxury of the ton to a crumbling Scottish castle . . . and a job as a housekeeper. Yet Helen is determined to start a new life and she won't let dust-or a beast of a man-scare her away. ", "TO TAME HIS MOST SECRET DESIRES? ", "Beneath Helen's beautiful façade, Alistair finds a courageous and sensual woman. A woman who doesn't back away from his surliness-or his scars. But just as he begins to believe in true love, Helen's secret past threatens to tear them apart. Now both Beast and Beauty must fight for the one thing neither believed they could ever find-a happy ever after."], "author": "Elizabeth Hoyt", "num_pages": "333", "awards": ["RITA Award by Romance Writers of America Nominee for Historical Romance (2011)"], "places": ["Castle Greaves, Scotland", "London, England"], "character_names": ["Sir Alistair Munroe", "Helen Fitzwilliam"], "language": "English", "publish_date": "2009-05-01 00:00:00", "ISBN": "0446406937"},
{"url": "https://www.goodreads.com/book/show/8449698-when-beauty-tamed-the-beast", "num_ratings": "19,800", "num_reviews": "1,759", "avg_ratings": 4.06, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency", "Fantasy", "Fairy Tales"], "title": "When Beauty Tamed the Beast", "description": ["Miss Linnet Berry Thrynne is a Beauty . . . Naturally, she's betrothed to a Beast.", "Piers Yelverton, Earl of Marchant, lives in a castle in Wales where, it is rumored, his bad temper flays everyone he crosses. And rumor also has it that a wound has left the earl immune to the charms of any woman.", "Linnet is not just any woman.", "She is more than merely lovely: her wit and charm b", "Miss Linnet Berry Thrynne is a Beauty . . . Naturally, she's betrothed to a Beast.", "Piers Yelverton, Earl of Marchant, lives in a castle in Wales where, it is rumored, his bad temper flays everyone he crosses. And rumor also has it that a wound has left the earl immune to the charms of any woman.", "Linnet is not just any woman.", "She is more than merely lovely: her wit and charm brought a prince to his knees. She estimates the earl will fall madly in love—in just two weeks.", "Yet Linnet has no idea of the danger posed to her own heart by a man who may never love her in return.", "If she decides to be very wicked indeed . . . what price will she pay for taming his wild heart?"], "author": "Eloisa James", "num_pages": "372", "awards": ["All About Romance (AAR) Annual Reader Poll for Biggest Tearjerker (2012)", "RITA Award by Romance Writers of America Nominee for Regency Historical Romance (2012)"], "places": [], "character_names": ["Linnet Berry Thrynne", "Piers Yelverton, Earl of Marchant"], "language": "English", "publish_date": "2011-01-25 00:00:00", "ISBN": "0062021273"},
{"url": "https://www.goodreads.com/book/show/350683.Yours_Until_Dawn", "num_ratings": "8,964", "num_reviews": "579", "avg_ratings": 4.09, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Yours Until Dawn", "description": ["Gabriel Fairchild's valor during battle earns him the reputation of hero, but costs him both his sight and his hope for the future. Abandoned by the fiancée he adored, the man who once walked like a prince among London's elite secludes himself in his family's mansion, cursing his way through dark days and darker nights. ", "Gabriel Fairchild's valor during battle earns him the reputation of hero, but costs him both his sight and his hope for the future. Abandoned by the fiancée he adored, the man who once walked like a prince among London's elite secludes himself in his family's mansion, cursing his way through dark days and darker nights. "], "author": "Teresa Medeiros", "num_pages": "373", "awards": ["Maggie Award for Excellence (Georgia Romance Writers) Nominee for Historical Romance (2005)"], "places": ["England"], "character_names": ["Gabriel Fairchild", "Samantha Wickersham"], "language": "English", "publish_date": "2004-07-27 00:00:00", "ISBN": "0060513659"}
]