[
{"url": "https://www.goodreads.com/book/show/11486.The_Color_Purple", "num_ratings": "435,722", "num_reviews": "11,087", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "295", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "0671727796"},
{"url": "https://www.goodreads.com/book/show/1055996.Koolaids", "num_ratings": "508", "num_reviews": "59", "avg_ratings": 4.07, "genres": ["Fiction", "Lgbt", "Cultural", "Lebanon", "Glbt", "Queer"], "title": "Koolaids: The Art of War", "description": ["Detailing the impact of the AIDS epidemic and the Lebanese civil war in Beirut on a circle of friends and family, \"Koolaids\" tells the stories of characters who can no longer love or think except in fragments of time, each of which goes off along its own trajectory and immediately disappears. Clips, quips, vignettes and hallucinations, tragic news reports and hilarious sho", "Detailing the impact of the AIDS epidemic and the Lebanese civil war in Beirut on a circle of friends and family, \"Koolaids\" tells the stories of characters who can no longer love or think except in fragments of time, each of which goes off along its own trajectory and immediately disappears. Clips, quips, vignettes and hallucinations, tragic news reports and hilarious short plays, conversations with both the quick and the dead, all shine their combined lights to reveal the way we experience life today in this ambitious novel."], "author": "Rabih Alameddine", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-04-15 00:00:00", "ISBN": "0312186932"},
{"url": "https://www.goodreads.com/book/show/1884502.Wanting_in_Arabic", "num_ratings": "63", "num_reviews": "12", "avg_ratings": 4.21, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Lgbt", "Transgender", "Cultural", "Canada"], "title": "Wanting in Arabic", "description": ["Poetry. Braiding theoretic concerns with the ambivalences of sexed and raced identity.WANTING IN ARABIC attempts to traverse the fantasies of foundational loss and aggressive nostalgia in order to further a poetics of a conscious partiality of being, of generous struggle and comic rather than tragic misrecognition. \"Trish Salah's poetic sequence is not simply a narrative o", "Poetry. Braiding theoretic concerns with the ambivalences of sexed and raced identity.WANTING IN ARABIC attempts to traverse the fantasies of foundational loss and aggressive nostalgia in order to further a poetics of a conscious partiality of being, of generous struggle and comic rather than tragic misrecognition. \"Trish Salah's poetic sequence is not simply a narrative of gender change; it's a wandering, thoughtful text, one both fierce and tremulous\"--Erin Moure. \"This is a beautiful and disturbing collection of poems, writing from the uncharted langscape of the third sex\"--Mary Di Michele."], "author": "Trish Salah", "num_pages": "90", "awards": ["Lambda Literary Award for Transgender Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "1894770005"},
{"url": "https://www.goodreads.com/book/show/1642566.Medicine_Stories", "num_ratings": "123", "num_reviews": "15", "avg_ratings": 4.66, "genres": ["History", "Nonfiction", "Politics", "Feminism", "Health", "Medicine"], "title": "Medicine Stories: History, Culture and the Politics of Integrity", "description": ["Drawing vibrant connections between the colonization of whole nations, the health of the mountainsides and the abuse of individual women, children and men, ", " offers the paradigm of integrity as a political model to people who hunger for a world of justice, health and love."], "author": "Aurora Levins Morales", "num_pages": "135", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-07-01 00:00:00", "ISBN": "0896085813"},
{"url": "https://www.goodreads.com/book/show/24137295-insert-boy", "num_ratings": "542", "num_reviews": "78", "avg_ratings": 4.64, "genres": ["Poetry", "Glbt", "Queer", "Lgbt"], "title": "[insert] boy", "description": ["The next time someone tells you spoken word poets can’t make poems come to life on the page, send them to Danez Smith’s [insert] boy, a remarkable debut collection that puts that tired notion to bed once and for all. In these poems, Smith opens the reader to a world of desire, longing, and deep mourning that picks up where his brothers Hopkins and Whitman left off. Startli", "The next time someone tells you spoken word poets can’t make poems come to life on the page, send them to Danez Smith’s [insert] boy, a remarkable debut collection that puts that tired notion to bed once and for all. In these poems, Smith opens the reader to a world of desire, longing, and deep mourning that picks up where his brothers Hopkins and Whitman left off. Startling in their formal range and virtuosity, these poems interrogate the ways the body not only inhabits but actually becomes public and private space: …tonight, I am no one’s pet, maybe an animal, wounded & hungry for revenge or sympathy but what’s the difference? Danez Smith lays down the gauntlet for all of us to speak our deepest truths with more elegance, more ferocity, and almost more beauty than a reader can bear.", "—Gabrielle Calvocoressi, Apocalyptic Swing, Poetry Editor for The LA Review of Books", "Danez Smith is the crown prince of innovation and ferocity, a stunningly original voice that chooses not to recognize or respect those vexing artistic boundaries. Here is forte unleashed, an elicit glimpse of poetry's yet-to-be-turned page, a reason to stomp and romp in your church shoes. Hallelujah is an understatement.", "—Patricia Smith, Shoulda Been Jimi Savannah and Blood Dazzler"], "author": "Danez Smith", "num_pages": "116", "awards": ["Lambda Literary Award for Gay Poetry (2015)", "Debut-Litzer Award Nominee for Poetry (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/393004.Soul_Kiss", "num_ratings": "265", "num_reviews": "32", "avg_ratings": 3.93, "genres": ["Fiction", "Lgbt", "Cultural", "African American", "Glbt", "Lesbian", "Young Adult", "Coming Of Age", "American", "African American Literature"], "title": "Soul Kiss", "description": ["This \"tender coming-of-age story\" (Essence) follows Mariah Santos as she moves from an idyllic childhood of hot-plate food and blues on the radio in the company of her mother, to a stormy adolescence with her fierce, forbidding spinster aunts, to a slow, painful journey of self-discovery as she seeks out the father she never knew. A richly textured tale of sorrow, sensuali", "This \"tender coming-of-age story\" (Essence) follows Mariah Santos as she moves from an idyllic childhood of hot-plate food and blues on the radio in the company of her mother, to a stormy adolescence with her fierce, forbidding spinster aunts, to a slow, painful journey of self-discovery as she seeks out the father she never knew. A richly textured tale of sorrow, sensuality, and triumph, Soul Kiss marks the debut of an outstanding new literary voice."], "author": "Shay Youngblood", "num_pages": "224", "awards": [], "places": ["Georgia", "Los Angeles, California"], "character_names": [], "language": "English", "publish_date": "1998-04-01 00:00:00", "ISBN": "1573226580"},
{"url": "https://www.goodreads.com/book/show/20702399-she-of-the-mountains", "num_ratings": "751", "num_reviews": "115", "avg_ratings": 4.31, "genres": ["Glbt", "Queer", "Fiction", "Lgbt", "Sequential Art", "Graphic Novels", "Cultural", "Canada"], "title": "She of the Mountains", "description": [" is a beautifully rendered i", " is a beautifully rendered illustrated novel by Vivek Shraya, the author of the Lambda Literary Award finalist ", ". Shraya weaves a passionate, contemporary love story between a man and his body, with a re-imagining of Hindu mythology. Both narratives explore the complexities of embodiment and the damaging effects that policing gender and sexuality can have on the human heart.", "Illustrations are by Raymond Biesinger, whose work has appeared in such publications as ", " and the ", " is a multimedia artist, working in the mediums of music, performance, literature, and film. Her most recent film, ", ", has been expanded to include an online project and book with contributions from around the world. She is also author of ", "and Even This Page Is White."], "author": "Vivek Shraya", "num_pages": "128", "awards": ["Lambda Literary Award Nominee for Bisexual Fiction (2015)"], "places": [], "character_names": [], "language": null, "publish_date": "2014-10-14 00:00:00", "ISBN": "1551525607"},
{"url": "https://www.goodreads.com/book/show/1222519.Thinking_Class", "num_ratings": "117", "num_reviews": "12", "avg_ratings": 4.32, "genres": ["Glbt", "Queer", "Social Issues", "Class", "Nonfiction", "Feminism", "Politics", "Sociology"], "title": "Thinking Class: Sketches from a Cultural Worker", "description": ["Examining the elite's supposed hegemony over intellectual work, ", " rejects the ideaa that working class people are not thinkers, and affirms the culture that springs up, beautiful and honest, from this society's true base."], "author": "Joanna Kadi", "num_pages": "169", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-07-01 00:00:00", "ISBN": "0896085473"},
{"url": "https://www.goodreads.com/book/show/2774912-the-hakawati", "num_ratings": "3,233", "num_reviews": "486", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Lebanon", "Magical Realism", "Fantasy"], "title": "The Hakawati", "description": ["An inventive, exuberant novel that takes us from the shimmering dunes of ancient Egypt to the war-torn streets of twenty-first-century Lebanon.", "In 2003, Osama al-Kharrat returns to Beirut after many years in America to stand vigil at his father’s deathbed. The city is a shell of the Beirut Osama remembers, but he and his friends and family take solace in the things that hav", "An inventive, exuberant novel that takes us from the shimmering dunes of ancient Egypt to the war-torn streets of twenty-first-century Lebanon.", "In 2003, Osama al-Kharrat returns to Beirut after many years in America to stand vigil at his father’s deathbed. The city is a shell of the Beirut Osama remembers, but he and his friends and family take solace in the things that have always sustained them: gossip, laughter, and, above all, stories. ", "Osama’s grandfather was a hakawati, or storyteller, and his bewitching stories—of his arrival in Lebanon, an orphan of the Turkish wars, and of how he earned the name al-Kharrat, the fibster—are interwoven with classic tales of the Middle East, stunningly reimagined. Here are Abraham and Isaac; Ishmael, father of the Arab tribes; the ancient, fabled Fatima; and Baybars, the slave prince who vanquished the Crusaders. Here, too, are contemporary Lebanese whose stories tell a larger, heartbreaking tale of seemingly endless war—and of survival. ", "Like a true hakawati, Rabih Alameddine has given us an Arabian Nights for this century—a funny, captivating novel that enchants and dazzles from its very first lines: “Listen. Let me take you on a journey beyond imagining. Let me tell you a story.”"], "author": "Rabih Alameddine", "num_pages": "528", "awards": [], "places": [], "character_names": ["Baibars"], "language": "English", "publish_date": "2008-04-22 00:00:00", "ISBN": "0385664761"},
{"url": "https://www.goodreads.com/book/show/353325.The_Motion_Of_Light_In_Water", "num_ratings": "816", "num_reviews": "87", "avg_ratings": 4.3, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Glbt", "Queer"], "title": "The Motion Of Light In Water: Sex And Science Fiction Writing In The East Village", "description": ["\"A very moving, intensely fascinating literary biography from an extraordinary writer. Thoroughly admirable candor and luminous stylistic precision; the artist as a young man and a memorable picture of an age.\" -William Gibson", "\"Absolutely central to any consideration of black manhood. . . . Delany's vision of the necessity for total social and political transformation is re", "\"A very moving, intensely fascinating literary biography from an extraordinary writer. Thoroughly admirable candor and luminous stylistic precision; the artist as a young man and a memorable picture of an age.\" -William Gibson", "\"Absolutely central to any consideration of black manhood. . . . Delany's vision of the necessity for total social and political transformation is revolutionary.\" -Hazel Carby ", "\"The prose of ", " often has the shimmering beauty of the title itself. . . . This book is invaluable gay history.\" -Inches Magazine", "Born in New York City's black ghetto Harlem at the start of World War II, Samuel R. Delany married white poet Marilyn Hacker right out of high school. The interracial couple moved into the city's new bohemian quarter, the Lower East Side, in summer 1961. Through the decade's opening years, new art, new sexual practices, new music, and new political awareness burgeoned among the crowded streets and cheap railroad apartments. Beautifully, vividly, insightfully, Delany calls up this era of exploration and adventure as he details his development as a black gay writer in an open marriage, with tertiary walk-ons by Bob Dylan, Stokely Carmichael, W. H. Auden, and James Baldwin, and a panoply of brilliantly drawn secondary characters.", "Winner of the 1989 Hugo Award for Non-fiction", "Samuel R. Delany is the author of numerous science fiction books including ", " other fiction including ", " as well as the best-selling nonfiction study ", " He lives in New York City and teaches at Temple University. The Lambda Book Report chose Delany as one of the fifty most significant men and women of the past hundred years to change our concept of gayness, and he is a recipient of the William Whitehead Memorial Award for a lifetime's contribution to lesbian and gay literature."], "author": "Samuel R. Delany", "num_pages": "584", "awards": ["Hugo Award for Best Non-Fiction Book (1989)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-23 00:00:00", "ISBN": "0816645248"},
{"url": "https://www.goodreads.com/book/show/28801308-juliet-takes-a-breath", "num_ratings": "3,232", "num_reviews": "758", "avg_ratings": 4.24, "genres": ["Lgbt", "Young Adult", "Fiction", "Glbt", "Queer", "Feminism"], "title": "Juliet Takes a Breath", "description": ["Juliet Milagros Palante is leaving the Bronx and headed to Portland, Oregon. She just came out to her family and isn’t sure if her mom will ever speak to her again. But Juliet has a plan, sort of, one that’s going to help her figure out this whole “Puerto Rican lesbian” thing. She’s interning with the author of her favorite book: Harlowe Brisbane, the ultimate authority on", "Juliet Milagros Palante is leaving the Bronx and headed to Portland, Oregon. She just came out to her family and isn’t sure if her mom will ever speak to her again. But Juliet has a plan, sort of, one that’s going to help her figure out this whole “Puerto Rican lesbian” thing. She’s interning with the author of her favorite book: Harlowe Brisbane, the ultimate authority on feminism, women’s bodies, and other gay-sounding stuff. ", "Will Juliet be able to figure out her life over the course of one magical summer? Is that even possible? Or is she running away from all the problems that seem too big to handle? ", "With more questions than answers, Juliet takes on Portland, Harlowe, and most importantly, herself. "], "author": "Gabby Rivera", "num_pages": "274", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-01-27 00:00:00", "ISBN": "1626012512"},
{"url": "https://www.goodreads.com/book/show/28220826-when-the-moon-was-ours", "num_ratings": "4,306", "num_reviews": "1,215", "avg_ratings": 3.96, "genres": ["Young Adult", "Fantasy", "Magical Realism", "Lgbt"], "title": "When the Moon Was Ours", "description": ["To everyone who knows them, best friends Miel and Sam are as strange as they are inseparable. Roses grow out of Miel’s wrist, and rumors say that she spilled out of a water tower when she was five. Sam is known for the moons he paints and hangs in the trees, and for how little anyone knows about his life before he and his mother moved to town. But as odd as everyone consid", "To everyone who knows them, best friends Miel and Sam are as strange as they are inseparable. Roses grow out of Miel’s wrist, and rumors say that she spilled out of a water tower when she was five. Sam is known for the moons he paints and hangs in the trees, and for how little anyone knows about his life before he and his mother moved to town. But as odd as everyone considers Miel and Sam, even they stay away from the Bonner girls, four beautiful sisters rumored to be witches. Now they want the roses that grow from Miel’s skin, convinced that their scent can make anyone fall in love. And they’re willing to use every secret Miel has fought to protect to make sure she gives them up."], "author": "Anna-Marie McLemore", "num_pages": "288", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2017)", "James Tiptree Jr. Award (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-04 00:00:00", "ISBN": "125005866X"},
{"url": "https://www.goodreads.com/book/show/2418888.Skim", "num_ratings": "10,273", "num_reviews": "1,070", "avg_ratings": 3.79, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Lgbt", "Fiction"], "title": "Skim", "description": ["Heartbreakingly funny, moving and vibrantly drawn, ", " is an extraordinary book--a smart and sensitive graphic novel of the highest literary and artistic quality, by and about young women.", "\"Skim\" is Kimberly Keiko Cameron, a not-slim, would-be Wiccan goth who goes to a private girls' school. When Skim's classmate Katie Matthews is dumped by her boyfriend, who then kills hi", "Heartbreakingly funny, moving and vibrantly drawn, ", " is an extraordinary book--a smart and sensitive graphic novel of the highest literary and artistic quality, by and about young women.", "\"Skim\" is Kimberly Keiko Cameron, a not-slim, would-be Wiccan goth who goes to a private girls' school. When Skim's classmate Katie Matthews is dumped by her boyfriend, who then kills himself, the entire school goes into mourning overdrive. As concerned guidance counselors provide lectures on the \"cycle of grief,\" and the popular clique starts a new club (Girls Celebrate Life!) to bolster school spirit, Skim sinks into an ever-deepening depression. ", "And falling in love only makes things worse...", "Suicide, depression, love, being gay or not, crushes, cliques, and finding a way to be your own fully human self--are all explored in this brilliant collaboration by cousins Mariko and Jillian Tamaki. An edgy, keenly observed and poignant glimpse into the heartache of being young."], "author": "Mariko Tamaki", "num_pages": "143", "awards": ["Ignatz Award for Outstanding Graphic Novel (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "Doug Wright Award for Best Book (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["Toronto, Ontario"], "character_names": ["Kimberly Keiko Cameron, aka \"Skim\"", "Lisa Soor", "Ms. Archer"], "language": "English", "publish_date": "2008-01-01 00:00:00", "ISBN": "0888997531"},
{"url": "https://www.goodreads.com/book/show/18166999-jimmy-s-blues-and-other-poems", "num_ratings": "390", "num_reviews": "69", "avg_ratings": 4.17, "genres": ["Poetry", "Cultural", "African American", "American", "African American Literature"], "title": "Jimmy's Blues and Other Poems", "description": ["  ", "During his lifetime (1924–1987), James Baldwin authored seven novels, as well as several plays and essay collections, which were published to wide-spread praise. These books, among them ", ",", ", ", ", and", "  ", "During his lifetime (1924–1987), James Baldwin authored seven novels, as well as several plays and essay collections, which were published to wide-spread praise. These books, among them ", ",", ", ", ", and ", ",", "brought him well-deserved acclaim as a public intellectual and admiration as a writer. However, Baldwin’s earliest writing was in poetic form, and Baldwin considered himself a poet throughout his lifetime. Nonetheless, his single book of poetry, ", ", never achieved the popularity of his novels and nonfiction, and is the one and only book to fall out of print.", " This new collection presents James Baldwin the poet, including all nineteen poems from ", ", as well as all the poems from a limited-edition volume called ", ", of which only 325 copies were ever printed and which was in production at the time of his death. Known for his relentless honesty and startlingly prophetic insights on issues of race, gender, class, and poverty, Baldwin is just as enlightening and bold in his poetry as in his famous novels and essays. The poems range from the extended dramatic narratives of “Staggerlee wonders” and “Gypsy” to the lyrical beauty of “Some days,” which has been set to music and interpreted by such acclaimed artists as Audra McDonald. Nikky Finney’s introductory essay reveals the importance, relevance, and rich rewards of these little-known works. Baldwin’s many devotees will find much to celebrate in these pages."], "author": "James Baldwin", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-04-01 00:00:00", "ISBN": "0807084867"},
{"url": "https://www.goodreads.com/book/show/10744752-adaptation", "num_ratings": "6,346", "num_reviews": "920", "avg_ratings": 3.62, "genres": ["Young Adult", "Science Fiction", "Lgbt", "Fiction", "Glbt", "Queer"], "title": "Adaptation", "description": ["Reese can’t remember anything from the time between the accident and the day she woke up almost a month later. She only knows one thing: She’s different now.", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of tra", "Reese can’t remember anything from the time between the accident and the day she woke up almost a month later. She only knows one thing: She’s different now.", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of travelers are stranded.", "Reese and her debate team partner and longtime crush David are in Arizona when it happens. Everyone knows the world will never be the same. On their drive home to San Francisco, along a stretch of empty highway at night in the middle of Nevada, a bird flies into their headlights. The car flips over. When they wake up in a military hospital, the doctor won’t tell them what happened, where they are—or how they’ve been miraculously healed.", "Things become even stranger when Reese returns home. San Francisco feels like a different place with police enforcing curfew, hazmat teams collecting dead birds, and a strange presence that seems to be following her. When Reese unexpectedly collides with the beautiful Amber Gray, her search for the truth is forced in an entirely new direction—and threatens to expose a vast global conspiracy that the government has worked for decades to keep secret."], "author": "Malinda Lo", "num_pages": "386", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-18 00:00:00", "ISBN": "0316197963"},
{"url": "https://www.goodreads.com/book/show/21894948-he-mele-a-hilo", "num_ratings": "101", "num_reviews": "18", "avg_ratings": 4.47, "genres": ["Fiction", "Glbt", "Queer", "Lgbt", "Magical Realism", "Lgbt", "Transgender", "Novels"], "title": "He Mele A Hilo (A Hilo Song)", "description": ["Something strange is happening in Hilo. Noleani Choi’s new show about the life of Jesus Christ told through hula dance has everyone, especially her halau, wondering what she could possibly be thinking. Rumors circulate about a rich guy from the mainland, and the dancers and their friends must reckon with what is really hula, who is Hawaiian enough, and why each of them wan", "Something strange is happening in Hilo. Noleani Choi’s new show about the life of Jesus Christ told through hula dance has everyone, especially her halau, wondering what she could possibly be thinking. Rumors circulate about a rich guy from the mainland, and the dancers and their friends must reckon with what is really hula, who is Hawaiian enough, and why each of them wants to dance.", "On one beautiful island, we discover that loving other people in spite of their flaws might just begin with being true to our own selves."], "author": "Ryka Aoki", "num_pages": "310", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1512278.Imagine_Being_More_Afraid_of_Freedom_Than_Slavery", "num_ratings": "35", "num_reviews": "10", "avg_ratings": 4.06, "genres": ["Poetry", "Feminism", "Race", "Lgbt", "Glbt", "Queer"], "title": "Imagine Being More Afraid of Freedom Than Slavery: Poems", "description": ["When daddy pushed me ", "and girlhood innocence ", "out my bedroom window ", "I picked up the shattered pieces of myself ", "and became a woman ", "Imagine Being More Afraid of Freedom Than Slavery is lyrical and provocative, humorous and potent as it tackles both personal and contemporary issues of enslavement, sexuality, psychological trauma, and physical abuse. From beginning to end some o", "When daddy pushed me ", "and girlhood innocence ", "out my bedroom window ", "I picked up the shattered pieces of myself ", "and became a woman ", "Imagine Being More Afraid of Freedom Than Slavery is lyrical and provocative, humorous and potent as it tackles both personal and contemporary issues of enslavement, sexuality, psychological trauma, and physical abuse. From beginning to end some of these poems chart the journey that is life and one woman's cycle of dependency as she recovers her lost identity. Thematically, it is bound by a writer's search for love and fight for freedom, drawing on the spirit and will of Harriet Tubman, the image of the bloated body of Emmett Till, the bombing of Philadelphia Move, and lesbian love. In the tradition of June Jordan and Sapphire, Pamela Sneed presents an in-your-face, powerful, and stirring debut."], "author": "Pamela Sneed", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-04-15 00:00:00", "ISBN": "080505474X"},
{"url": "https://www.goodreads.com/book/show/29608771-i-am-woman", "num_ratings": "19", "num_reviews": "6", "avg_ratings": 4.26, "genres": ["Lgbt", "Lgbt", "Transgender", "Nonfiction"], "title": "I Am Woman: Surviving the Past, the Present, & the Future", "description": ["Living the life of her dreams won’t be easy—especially since she was born male. But her dream life may yet come true—if she truly wants it.", "In this raw and emotionally charged memoir, Daliah Husu declares her trans womanhood with an honest and authoritative voice. Searching for her true identity, yearning for her mother’s acceptance, and desperate to find love, Daliah share", "Living the life of her dreams won’t be easy—especially since she was born male. But her dream life may yet come true—if she truly wants it.", "In this raw and emotionally charged memoir, Daliah Husu declares her trans womanhood with an honest and authoritative voice. Searching for her true identity, yearning for her mother’s acceptance, and desperate to find love, Daliah shares her painful, yet enriching journey into self-actualization and womanhood—a journey that starts as a young boy growing up without his father or mother in the slums of Santo Domingo, and who later transforms into a young woman obsessed with the attention of men, forced into sex work, and haunted by alcohol and drug abuse.", "Remarkably, I Am Woman emphasizes that in midst of our loneliness, suffering, and darkness, our hopes and dreams continue to illuminate our path to personal freedom, survival, and ultimately love."], "author": "Daliah Husu", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-23 00:00:00", "ISBN": "1522798609"},
{"url": "https://www.goodreads.com/book/show/25731357-a-small-country-about-to-vanish", "num_ratings": "330", "num_reviews": "48", "avg_ratings": 3.65, "genres": ["Lgbt", "Romance", "Literature", "Jewish", "Fiction"], "title": "A Small Country about to Vanish", "description": ["\"A most remarkable homage to things Israeli, things Jewish, things human, and the love and honesty it takes to face down a country gone awry, a people prone to remembering and forgetting, a heart that knows true love and therefore knows its absence.", "A Small Country About To Vanish is love's survival story, between the author and her country of Israel, between Shelli and Ron", "\"A most remarkable homage to things Israeli, things Jewish, things human, and the love and honesty it takes to face down a country gone awry, a people prone to remembering and forgetting, a heart that knows true love and therefore knows its absence.", "A Small Country About To Vanish is love's survival story, between the author and her country of Israel, between Shelli and Rona, between a mother and her children, between a husband and wife. In many ways, Israel's story is reflected in Eithan's who finds himself ultimately alone and unloved in a sea of condemnation.", "Avilan, speaking directly to her beloved country, is saying, \"I love you enough to speak truth as I see it.\" Avilan writes about Israel with the love and pain stemming from the realization that not all that we love is perfect, but we can't help loving it, or him, or her.", "This book almost reads itself, so sure-footed is the pacing, the ease of being drawn in despite some unease about what is written; I admire the way the author does not intrude on her characters (and thus her readers) with the pointed finger of too much message forcibly delivered. A reader's ease and ability to identify with each main character is to have witnessed Avilan's magic literary show.", "As a reader, one leans into this character or that one, or all of them, as readily as one turns the pages. One of the hallmarks of a well-designed and well-written story, for me, is whether the characters stay with me long after the book is done. Do they ever! Read this book at your own peril and your own pleasure because it will make you feel. And you will remember the people from A Small Country About to Vanish.\" "], "author": "Victoria Avilan", "num_pages": "194", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3280188-humid-pitch", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 4.17, "genres": ["Poetry", "Lgbt", "Feminism"], "title": "Humid Pitch: Narrative Poetry", "description": ["Poems deal with childhood, the past, exile, art, sisters, music, identity, and school."], "author": "Cheryl Clarke", "num_pages": "129", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-10-01 00:00:00", "ISBN": "0932379664"},
{"url": "https://www.goodreads.com/book/show/27410604-digging-up-the-salt-mines", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 5.0, "genres": ["Autobiography", "Memoir", "Culture", "Film"], "title": "Digging Up the Salt Mines: A Film Memoir", "description": ["DIGGING UP THE SALT MINES is a film memoir recounting the authors experience shooting her first documentary film. In the early 1980s when New York City swarmed with a diversity of homeless populations, two young filmmakers encountered a community of homeless Latino drag queens living in abandoned garbage trucks by the Hudson River and set out to shoot a film depicting thei", "DIGGING UP THE SALT MINES is a film memoir recounting the author´s experience shooting her first documentary film. In the early 1980´s when New York City swarmed with a diversity of homeless populations, two young filmmakers encountered a community of homeless Latino drag queens living in abandoned garbage trucks by the Hudson River and set out to shoot a film depicting their lifestyle of drugs, prostitution and community dynamics in a garbage dump. A fascinating filmmaking odyssey into a world both far removed from our own, Susana Aikin’s recounting is at once a documentary tutorial and absorbing transformational journey. Following the lives of Sara, Gigi, and Giovanna, three Latino transvestites who worked Manhattan’s dangerous streets supporting their drug habits through prostitution, Susana and her cameraman/partner Carlos set out to capture their lifestyle as well as explore the boundaries of sexual identity and social tolerance. A profoundly moving memoir that captures the essence of the human struggle to find and form communities of shared experience, Aikin delivers a recounting of her journey with keen insight and bracing honesty. Her ability to capture not only the lives of her subjects but her own transformation is nothing short of a revelation. Gritty, poignant, and filled with a quiet reverence for life—and truth, Digging Up the Salt Mines is a captivating portrayal of a world long since abandoned but still resonant of the evolving urban experience."], "author": "Susana Aikin", "num_pages": "150", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-10 00:00:00", "ISBN": "0988617927"},
{"url": "https://www.goodreads.com/book/show/23876539-dream-machine", "num_ratings": "11", "num_reviews": "1", "avg_ratings": 4.64, "genres": ["Poetry"], "title": "Dream Machine", "description": ["Poetry. DREAM MACHINE, Sade Murphy's debut collection of prose poems, is a catalog of violence and somnambulant obsessions. This numerological tour de force creates a dreamscape that reflects various violence-saturated landscapes, including physical, sexual, psychological, racial, and gendered. Among these, the speaker of the poems both enacts violence and receives it, and", "Poetry. DREAM MACHINE, Sade Murphy's debut collection of prose poems, is a catalog of violence and somnambulant obsessions. This numerological tour de force creates a dreamscape that reflects various violence-saturated landscapes, including physical, sexual, psychological, racial, and gendered. Among these, the speaker of the poems both enacts violence and receives it, and violence becomes a neutral tool, taking on the qualities of the body that wields it. Both excessive and inclusive, the collection probes the speaker's desire to hold order and chaos, good and evil--any false dichotomy--simultaneously in tension and in harmony. To disturb these oppositions, Murphy invents Him, an uncanny, destructive, confining--yet somehow alluring--presence to interrogate the male gaze and normative masculinity. In conjunction with the nightmare man and mother, Him completes a trifecta of forces, both real and symbolic, that the dreamer must navigate and extricate herself from to attain the freedom she seeks."], "author": "Sade Murphy", "num_pages": "88", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-12-01 00:00:00", "ISBN": "0988819937"},
{"url": "https://www.goodreads.com/book/show/22876956-come-collecting", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Come Collecting (The Black Tree, Volume 6, #12)", "description": ["The gang searches for a way to seal Marduk back into his personal hell. Stuart starts behaving really strangely and can’t seem to stay away from Ariel. She learns she’s also an Evanalca and is rightly pissed. Meanwhile, the gang realizes that because there were talismans to open the prison that there must be others that can close it again. So begins their new adventure of", "The gang searches for a way to seal Marduk back into his personal hell. Stuart starts behaving really strangely and can’t seem to stay away from Ariel. She learns she’s also an Evanalca and is rightly pissed. Meanwhile, the gang realizes that because there were talismans to open the prison that there must be others that can close it again. So begins their new adventure of collecting the 12 seals that will end Marduk’s reign of terror."], "author": "Michón Neal", "num_pages": "146", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-04 00:00:00", "ISBN": "1500737704"},
{"url": "https://www.goodreads.com/book/show/23282187-lost-canyon", "num_ratings": "510", "num_reviews": "101", "avg_ratings": 3.39, "genres": ["Fiction", "Thriller", "Mystery", "Thriller", "Mystery Thriller", "Contemporary", "Adventure"], "title": "Lost Canyon", "description": ["Four people on a backpacking trip in the Sierra Nevada find more adventure than they ever imagined. Each of them is drawn to the mountains for reasons as diverse as their own lives. Gwen Foster, a counselor for at-risk youth, is struggling with burnout from the demands of her job. Real estate agent Oscar Barajas is adjusting to the fall of the housing market and being a si", "Four people on a backpacking trip in the Sierra Nevada find more adventure than they ever imagined. Each of them is drawn to the mountains for reasons as diverse as their own lives. Gwen Foster, a counselor for at-risk youth, is struggling with burnout from the demands of her job. Real estate agent Oscar Barajas is adjusting to the fall of the housing market and being a single parent. Todd Harris, an attorney, is stuck in a lucrative but unfulfilling career--and in a failing marriage. They are all brought together by their trainer, Tracy Cole, a former athlete with a taste for risky pursuits.", "When the hikers start up a pristine mountain trail that hasn't been traveled in years, all they have to guide them is a hand-drawn map of a remote, mysterious place called Lost Canyon. At first, the route past high alpine lakes and under towering, snowcapped peaks offers all the freedom and exhilaration they'd hoped for. But when they stumble onto someone who doesn't want to be found, the group finds itself faced with a series of dangerous conflicts, moral dilemmas, confrontations with nature, and an all-out struggle for survival.", "Moving effortlessly between city and wilderness, ", " explores the ways that race, class, and culture shape experience and perception. It examines the choices good people must face in desperate situations. Set in the grand, wild landscape of the California mountains, ", " is a story of brewing social tensions and breathtaking adventure that will keep readers on the edge of their seats."], "author": "Nina Revoyr", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-09-17 00:00:00", "ISBN": "1617753548"},
{"url": "https://www.goodreads.com/book/show/25034079-fallen-forever-rising", "num_ratings": "7", "num_reviews": "2", "avg_ratings": 5.0, "genres": ["Culture", "Society"], "title": "Fallen/Forever Rising", "description": ["This book was created as a tribute to victims of police violence and anti-Black repression in the aftermath of the murder of Michael Brown, Jr., in August 2014."], "author": "Tessara Dudley", "num_pages": "44", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-16 00:00:00", "ISBN": "1502722102"},
{"url": "https://www.goodreads.com/book/show/407942.I_The_Divine", "num_ratings": "889", "num_reviews": "119", "avg_ratings": 4.03, "genres": ["Fiction", "Cultural", "Lebanon", "Novels", "Literary Fiction", "Contemporary", "Adult", "United States", "War", "Cultural", "Literature"], "title": "I, The Divine: A Novel in First Chapters", "description": ["Raised in a hybrid family shaped by divorce and remarriage, and by Beirut in wartime, Sarah finds a fragile peace in self-imposed exile in the United States. Her extraordinary dignity is supported by a best friend, a grown-up son, occasional sensual pleasures, and her determination to tell her own story."], "author": "Rabih Alameddine", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-17 00:00:00", "ISBN": "0393323560"},
{"url": "https://www.goodreads.com/book/show/6116947-blue-boy", "num_ratings": "1,188", "num_reviews": "180", "avg_ratings": 3.66, "genres": ["Fiction", "Humor", "Lgbt", "Glbt", "Queer", "Young Adult"], "title": "Blue Boy", "description": ["Meet Kiran Sharma: lover of music, dance, and all things sensual; son of immigrants, social outcast, spiritual seeker. A boy who doesn't quite understand his lot--until he realizes he's a god. . .", " As an only son, Kiran has obligations--to excel in his studies, to honor the deities, to find a nice Indian girl, and, above all, to make his mother and father proud--standard st", "Meet Kiran Sharma: lover of music, dance, and all things sensual; son of immigrants, social outcast, spiritual seeker. A boy who doesn't quite understand his lot--until he realizes he's a god. . .", " As an only son, Kiran has obligations--to excel in his studies, to honor the deities, to find a nice Indian girl, and, above all, to make his mother and father proud--standard stuff for a boy of his background. If only Kiran had anything in common with the other Indian kids besides the color of his skin. They reject him at every turn, and his cretinous public schoolmates are no better. Cincinnati in the early 1990s isn't exactly a hotbed of cultural diversity, and Kiran's not-so-well-kept secrets don't endear him to any group. Playing with dolls, choosing ballet over basketball, taking the annual talent show way too seriously. . .the very things that make Kiran who he is also make him the star of his own personal freak show. . .", "Surrounded by examples of upstanding Indian Americans--in his own home, in his temple, at the weekly parties given by his parents' friends--Kiran nevertheless finds it impossible to get the knack of \"normalcy.\" And then one fateful day, a revelation: perhaps his desires aren't too earthly, but too divine. Perhaps the solution to the mystery of his existence has been before him since birth. For Kiran Sharma, a long, strange trip is about to begin--a journey so sublime, so ridiculous, so painfully beautiful, that it can only lead to the truth. . .", "\"The best fiction reminds us that humanity is much, much larger than our personal world, our own little reality. ", " shows us a world too funny and sad and sweet to be based on anything but the truth.\" --Chuck Palahniuk", " Bestselling Author"], "author": "Rakesh Satyal", "num_pages": "276", "awards": ["Edmund White Award for Debut Fiction Nominee (2010)", "Lambda Literary Award for Gay Debut Fiction (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-01 00:00:00", "ISBN": "0758231369"},
{"url": "https://www.goodreads.com/book/show/188044.Directed_by_Desire", "num_ratings": "299", "num_reviews": "22", "avg_ratings": 4.46, "genres": ["Poetry", "Feminism", "Race", "Glbt", "Queer", "Lgbt"], "title": "Directed by Desire: The Collected Poems", "description": ["“Jordan . . . is among the bravest of us, the most outraged. She feels for all. She is the universal poet.”—Alice Walker", "“Always urgent, inspiring, and demanding, Jordan’s work has left its indelible mark everywhere from ", " to ", ", and from theater stages to the floors of the United Nations and the United States Congress.”—", "“Jordan . . . is among the bravest of us, the most outraged. She feels for all. She is the universal poet.”—Alice Walker", "“Always urgent, inspiring, and demanding, Jordan’s work has left its indelible mark everywhere from ", " to ", ", and from theater stages to the floors of the United Nations and the United States Congress.”—", " is ", " definitive overview of the poetry of June Jordan, considered one of the most lyrically gifted poets of the late twentieth century. ", " gathers the finest work from Jordan’s 10 volumes, as well as 70 new, never-before-published poems that she wrote while dying of breast cancer. Throughout over 600 pages readers will find intimate lyricism, elegance, fury, meditative solos, and dazzling vernacular riffs.", "As Adrienne Rich writes in her introduction, June Jordan “wanted her readers, listeners, students, to feel their own latent power—of the word, the deed, of their own beauty and intrinsic value. . . . She believed, and nourished the belief, that genuine, up-from-the-bottom revolution must include art, laughter, sensual pleasure, and the widest possible human referentiality.”", " taught at the University of California Berkeley for many years and founded Poetry for the People. Her 28 books include poetry, essays, fiction, and children’s books. She was a regular columnist for ", " and a prolific writer whose articles appeared in ", ", ", ", ", ", and ", ". Her numerous awards include a PEN West Freedom to Write Award and a lifetime achievement award from the National Black Writers Conference. After her death from breast cancer in 2002, a school in the San Francisco School District was renamed in her honor."], "author": "June Jordan", "num_pages": "650", "awards": ["Lambda Literary Award (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-01 00:00:00", "ISBN": "1556592280"},
{"url": "https://www.goodreads.com/book/show/9685046-burnings", "num_ratings": "121", "num_reviews": "17", "avg_ratings": 4.38, "genres": ["Poetry", "Lgbt", "Glbt", "Queer"], "title": "Burnings", "description": ["“I was born because someone was starving…” ends one of Ocean Vuong’s poems, and in that poem, as in every other of his poems, Ocean manages to imbue the desperation of his being alive, with a savage beauty. It is not just that Ocean can render pain as a kind of loveliness, but that his poetic line will not let you forget the hurt or the garish brilliance of your triumph; w", "“I was born because someone was starving…” ends one of Ocean Vuong’s poems, and in that poem, as in every other of his poems, Ocean manages to imbue the desperation of his being alive, with a savage beauty. It is not just that Ocean can render pain as a kind of loveliness, but that his poetic line will not let you forget the hurt or the garish brilliance of your triumph; will not let you look away. These poems shatter us detail by detail because Ocean leaves nothing unturned, because every lived thing in his poems demands to be fed by you; to nourish you in turn. You will not leave these poems dissatisfied. They will fill you utterly.”", " -Roger Bonair-Agard, author of Tarnish and Masquerade and Gully", "“Vuong’s perfectly crafted poems are intensely personal, and intensely universal. What he has to whisper to us sears our eyes and minds like a branding iron, burning. Whether his words are of wars past or present, they are inescapably palpable. This is the work of a gifted cantor, singing of pain, singing of healing.”", " -Grady Harp, Amazon Top Reviewer and critic", "“Ocean Vuong is a poet of rare lyrical gifts and urgent stories to tell. “Memory,” he writes, “has not forgotten you.” No, it hasn’t forgotten the burning city or the taste of blood nor the hanging of rags or the violence of war. Vuong’s poems are testament to the enduring power of poetry and its place in this human universe.”", " -Hoa Nguyen, author of Hectate Lochia and As Long as Trees Last"], "author": "Ocean Vuong", "num_pages": "40", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-11-15 00:00:00", "ISBN": "0578070596"},
{"url": "https://www.goodreads.com/book/show/13124956-when-my-brother-was-an-aztec", "num_ratings": "1,371", "num_reviews": "158", "avg_ratings": 4.36, "genres": ["Poetry", "Lgbt"], "title": "When My Brother Was an Aztec", "description": ["\"I write ", " sentences,\" Natalie Diaz once explained in an interview, \"because they want more and more lyricism and imagery to satisfy them.\" This debut collection is a fast-paced tour of Mojave life and family narrative: A sister fights for or against a brother on meth, and everyone from Antigone, Houdini, Huitzilopochtli, and Jesus is invoked and invited to hash it ou", "\"I write ", " sentences,\" Natalie Diaz once explained in an interview, \"because they want more and more lyricism and imagery to satisfy them.\" This debut collection is a fast-paced tour of Mojave life and family narrative: A sister fights for or against a brother on meth, and everyone from Antigone, Houdini, Huitzilopochtli, and Jesus is invoked and invited to hash it out. These darkly humorous poems illuminate far corners of the heart, revealing teeth, tails, and more than a few dreams.", "W", " was born and raised on the Fort Mojave Indian Reservation in Needles, California. After playing professional basketball for four years in Europe and Asia, Diaz returned to the states to complete her MFA at Old Dominion University. She lives in Surprise, Arizona, and is working to preserve the Mojave language."], "author": "Natalie Díaz", "num_pages": "103", "awards": ["American Book Award (2013)", "PEN Open Book Award Nominee for Shortlist (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-05-08 00:00:00", "ISBN": "155659383X"},
{"url": "https://www.goodreads.com/book/show/17751274-ascension", "num_ratings": "1,098", "num_reviews": "246", "avg_ratings": 3.55, "genres": ["Science Fiction", "Lgbt", "Glbt", "Queer", "Fiction", "Romance"], "title": "Ascension", "description": ["Alana Quick is the best damned sky surgeon in Heliodor City, but repairing starship engines barely pays the bills. When the desperate crew of a cargo vessel stops by her shipyard looking for her spiritually advanced sister Nova, Alana stows away. Maybe her boldness will land her a long-term gig on the crew. But the ", " proves to be more than star-watching and plas", "Alana Quick is the best damned sky surgeon in Heliodor City, but repairing starship engines barely pays the bills. When the desperate crew of a cargo vessel stops by her shipyard looking for her spiritually advanced sister Nova, Alana stows away. Maybe her boldness will land her a long-term gig on the crew. But the ", " proves to be more than star-watching and plasma coils. The chief engineer thinks he's a wolf. The pilot fades in and out of existence. The captain is all blond hair, boots, and ego . . . and Alana can't keep her eyes off her. But there's little time for romance: Nova's in danger and someone will do anything--even destroying planets--to get their hands on her."], "author": "Jacqueline Koyanagi", "num_pages": "331", "awards": ["James Tiptree Jr. Award Honor List (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-04 00:00:00", "ISBN": "1607014017"},
{"url": "https://www.goodreads.com/book/show/24892461-bodymap", "num_ratings": "138", "num_reviews": "18", "avg_ratings": 4.58, "genres": ["Poetry", "Glbt", "Queer", "Disability", "Feminism", "Lgbt"], "title": "Bodymap", "description": ["In ", ", Lambda Award winning writer Leah Lakshmi Piepzna-Samarasinha sings a queer disabled femme of colour love song filled with hard femme poetics and disability justice. The first book of the author to examine disability from a queer femme of color lens, ", " contains work created and performed with Sins Invalid. ", " maps hard and vulnerable terrains of queer", "In ", ", Lambda Award winning writer Leah Lakshmi Piepzna-Samarasinha sings a queer disabled femme of colour love song filled with hard femme poetics and disability justice. The first book of the author to examine disability from a queer femme of color lens, ", " contains work created and performed with Sins Invalid. ", " maps hard and vulnerable terrains of queer desire, survivorhood, transformative love, sick and disabled queer genius and all the homes we claim and deserve.", "\"These poems are a gift for your love for self, your love itself and everyone you love. It is rare that a poet priestess offers words that allow us to emerge reborn with dirt, glitter and tenderness... Revere it. Revel in it. Read it again and again!\" ", "—Alexis Pauline Gumbs", "\"", " uses the alchemy of the voice on the page to transform words into an ache in the pit of me. I want what these poems demand: to be free to love & die, to be resurrected in time, & to be restored by desire. Piepzna-Samarasinha has located where this body houses the smirk learned from the sidewalk, the reason to do the difficult, and the blessings for the best worst thing.\"", "—Meg Day, author of ", " ", "\"Sharp, yet remarkably compassionate, Piepzna-Samarasinha knows that the poem is no place for tidy inquiry and easy answers. She offers her own tenacious guts and veins on each and every page. Only someone who understands rage and reconciliation and blood and bone can write like this.\"", "—Amber Dawn, author of "], "author": "Leah Lakshmi Piepzna-Samarasinha", "num_pages": "112", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-31 00:00:00", "ISBN": "1927494508"},
{"url": "https://www.goodreads.com/book/show/3195325-a-map-of-home", "num_ratings": "1,159", "num_reviews": "201", "avg_ratings": 3.68, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Lgbt", "Glbt", "Queer"], "title": "A Map of Home", "description": ["Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where s", "Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where she and her family fled the 1990 Iraqi invasion), and her family’s last flight to Texas. Nidali mixes humor with a sharp, loving portrait of an eccentric middle-class family, and this perspective keeps her buoyant through the hardships she encounters: the humiliation of going through a checkpoint on a visit to her father’s home in the West Bank; the fights with her father, who wants her to become a famous professor and stay away from boys; the end of her childhood as Iraq invades Kuwait on her thirteenth birthday; and the scare she gives her family when she runs away from home. ", "Funny, charming, and heartbreaking, A Map of Home is the kind of book Tristram Shandy or Huck Finn would have narrated had they been born Egyptian-Palestinian and female in the 1970s."], "author": "Randa Jarrar", "num_pages": "304", "awards": ["Hopwood Award", "Arab American Book Award for Fiction (2009)", "Million Writers Award", "Geoffrey James Gosling Prize"], "places": ["Kuwait"], "character_names": [], "language": "English", "publish_date": "2008-09-02 00:00:00", "ISBN": "1590512723"},
{"url": "https://www.goodreads.com/book/show/20702539-prelude-to-bruise", "num_ratings": "1,217", "num_reviews": "169", "avg_ratings": 4.3, "genres": ["Poetry", "Lgbt", "Glbt", "Queer", "Cultural", "African American", "Race"], "title": "Prelude to Bruise", "description": ["Take your hand out", "from under my pillow.", "And take your sheets with you.", "Drag them under. Make pretend ghosts.", "I can't have you rattling the bed springs", "so keep still, keep quiet.", "Mistake yourself for shadows.", "Learn the lullabies of lint.", "works as the editor of BuzzfeedLGBT."], "author": "Saeed Jones", "num_pages": "103", "awards": ["Stonewall Book Award for Literature (2015)", "Thom Gunn Award for Gay Poetry Nominee (2015)", "National Book Critics Circle Award Nominee for Poetry (2014)", "Goodreads Choice Award Nominee for Poetry (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-09 00:00:00", "ISBN": "1566893747"},
{"url": "https://www.goodreads.com/book/show/25074181-dirty-river", "num_ratings": "597", "num_reviews": "79", "avg_ratings": 4.2, "genres": ["Autobiography", "Memoir", "Glbt", "Queer", "Nonfiction", "Lgbt", "Feminism"], "title": "Dirty River: A Queer Femme of Color Dreaming Her Way Home", "description": ["In 1996, poet Leah Lakshmi Piepzna-Samarasinha ran away from America with two backpacks and ended up in Canada, where she discovered queer anarchopunk love and revolution, yet remained haunted by the reasons she left home in the first place. This passionate and riveting memoir is a mixtape of dreams and nightmares, of immigration court lineups", "In 1996, poet Leah Lakshmi Piepzna-Samarasinha ran away from America with two backpacks and ended up in Canada, where she discovered queer anarchopunk love and revolution, yet remained haunted by the reasons she left home in the first place. This passionate and riveting memoir is a mixtape of dreams and nightmares, of immigration court lineups and queer South Asian dance nights; it reveals how a disabled queer woman of color and abuse survivor navigates the dirty river of the past and, as the subtitle suggests, \"dreams her way home.\"", "'s poetry book ", "won a Lambda Literary Award."], "author": "Leah Lakshmi Piepzna-Samarasinha", "num_pages": "240", "awards": ["Judy Grahn Award Nominee (2016)"], "places": [], "character_names": [], "language": null, "publish_date": "2015-11-03 00:00:00", "ISBN": "155152600X"},
{"url": "https://www.goodreads.com/book/show/25325267-yemaya-s-daughters", "num_ratings": "8", "num_reviews": "2", "avg_ratings": 4.13, "genres": ["Lgbt", "Transgender", "Lgbt", "Fiction", "Speculative Fiction", "Glbt", "Queer"], "title": "Yemaya’s Daughters", "description": ["Inanna Au-Set Oya, a trans woman, priestess, and storyteller with deep connections to the goddess, emerges from a province in Africa untouched by colonialist hands to find a world twisted with misconception and pain. She and her sisters choose to go forth and correct the imbalances found by ushering in an age of love and worth.", "Maryam, mother of Jesus, holds fast to her con", "Inanna Au-Set Oya, a trans woman, priestess, and storyteller with deep connections to the goddess, emerges from a province in Africa untouched by colonialist hands to find a world twisted with misconception and pain. She and her sisters choose to go forth and correct the imbalances found by ushering in an age of love and worth.", "​", "Maryam, mother of Jesus, holds fast to her convictions when from tragedy is born a new god. Without sisters, or guidance for her choices, she finds a world under Roman foot and is determined to create a spiritual revolt that will create ripples for ages to come.", "​", " tells the tale of two different women with but one goal in mind: how best to change the world without losing themselves in the process."], "author": "Dane Figueroa Edidi", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8073047-god-loves-hair", "num_ratings": "376", "num_reviews": "59", "avg_ratings": 3.99, "genres": ["Short Stories", "Glbt", "Queer", "Young Adult", "Lgbt", "Fiction", "Sequential Art", "Graphic Novels", "Cultural", "Canada", "Young Adult", "Coming Of Age", "Gender", "Religion"], "title": "God Loves Hair", "description": [" is a collection of 20 short stories following a tender, intellectual, and curious child as he navigates complex realms of sexuality, gender, racial politics, religion, and belonging.", "Told with the poignant insight and honesty that only the voice of a young mind can convey, each story is accompanied by a vivid illustration by Toronto artist Juliana Neufeld."], "author": "Vivek Shraya", "num_pages": "99", "awards": ["Lambda Literary Award Nominee for LGBT Children's/Young Adult (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-05-16 00:00:00", "ISBN": "0986551201"},
{"url": "https://www.goodreads.com/book/show/60926.Lilith_s_Brood", "num_ratings": "11,394", "num_reviews": "844", "avg_ratings": 4.32, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Lilith's Brood", "description": ["Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny", "Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny, unimaginably alien creatures: their own children. This is their story..."], "author": "Octavia E. Butler", "num_pages": "746", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-01 00:00:00", "ISBN": "0446676101"},
{"url": "https://www.goodreads.com/book/show/11233128-sovereign-erotics", "num_ratings": "102", "num_reviews": "12", "avg_ratings": 4.4, "genres": ["Poetry", "Glbt", "Queer", "Short Stories", "Lgbt", "Anthologies"], "title": "Sovereign Erotics: A Collection of Two-Spirit Literature", "author": "Qwo-Li Driskill", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-01 00:00:00", "ISBN": "0816502420"},
{"url": "https://www.goodreads.com/book/show/65285.The_Death_of_Vishnu", "num_ratings": "8,124", "num_reviews": "557", "avg_ratings": 3.62, "genres": ["Fiction", "Cultural", "India", "Asian Literature", "Indian Literature"], "title": "The Death of Vishnu", "description": ["Manil Suri's comic prose and imaginative language transport readers to the petty squabbles and unrelenting conflicts of modern-day India. At the center of the narrative is the character of Vishnu, an aging alcoholic houseboy on the precipice of death, who lies, penniless, on the bottom step of a middle-class Bombay apartment house. While Vishnu appears to face his impendin", "Manil Suri's comic prose and imaginative language transport readers to the petty squabbles and unrelenting conflicts of modern-day India. At the center of the narrative is the character of Vishnu, an aging alcoholic houseboy on the precipice of death, who lies, penniless, on the bottom step of a middle-class Bombay apartment house. While Vishnu appears to face his impending death placidly and philosophically, a maelstrom swirls around him. The residents of the building include a reclusive widower mourning the untimely death of his young wife, a Moslem family coping with the daily prejudices of their Hindu neighbors, and two families who unhappily share a kitchen. Worlds collide when the Moslem family's son elopes with the Hindu family's daughter, and Mr. Jalal, the Moslem family patriarch, apparently flips his wig, recognizing Vishnu not as their dying houseboy but as the deity whose name he bears, with the power to save. And when Mr. Jalal is found sleeping on the stairs beside Vishnu, he becomes the scapegoat for the building's many ills. In its frenetic and hilarious conclusion, ", " trumpets the arrival of an extremely gifted Indian writer, bringing to spectacular life the tempestuous chaos that is life in India today. ", "(", ")"], "author": "Manil Suri", "num_pages": "301", "awards": ["Man Booker Prize Nominee for Longlist (2001)", "PEN/Hemingway Foundation Award Nominee (2002)", "PEN/Faulkner Award for Fiction Nominee (2002)", "PEN/Robert W. Bingham Prize (2002)", "McKitterick Prize (2002)", "Kiriyama Prize Nominee for Fiction (2001)", "Corine Internationaler Buchpreis for Rolf Heyne Buchpreis (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "006000438X"},
{"url": "https://www.goodreads.com/book/show/588739.Consensual_Genocide", "num_ratings": "155", "num_reviews": "10", "avg_ratings": 4.41, "genres": ["Poetry", "Glbt", "Queer", "Feminism", "Lgbt", "Race", "Nonfiction", "Disability"], "title": "Consensual Genocide", "description": ["This long-awaited first collection of poetry by queer Sri Lankan writer and spoken-word artist Leah Lakshmi Piepzna-Samarasinha is full of the stories we've been waiting for. Tracing bloodlines from Sri Lanka's civil wars to Brooklyn and Toronto streets, these fierce poems are full of heart and guts, telling raw truths about brown girl border crossings before and after 9/1", "This long-awaited first collection of poetry by queer Sri Lankan writer and spoken-word artist Leah Lakshmi Piepzna-Samarasinha is full of the stories we've been waiting for. Tracing bloodlines from Sri Lanka's civil wars to Brooklyn and Toronto streets, these fierce poems are full of heart and guts, telling raw truths about brown girl border crossings before and after 9/11, surviving abuse, mixed-race journeys and high femme rebellions. ", " celebrates our survival and marks our rebel memories into history."], "author": "Leah Lakshmi Piepzna-Samarasinha", "num_pages": "73", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-01 00:00:00", "ISBN": "1894770293"},
{"url": "https://www.goodreads.com/book/show/23308935-counternarratives", "num_ratings": "272", "num_reviews": "46", "avg_ratings": 4.15, "genres": ["Short Stories", "Fiction", "Historical", "Historical Fiction", "Contemporary", "Literature"], "title": "Counternarratives", "description": ["Ranging from the 17th century to the present and crossing multiple continents, ", "’s novellas and stories draw upon memoirs, newspaper accounts, detective stories, interrogation transcripts, and speculative fiction t", "Ranging from the 17th century to the present and crossing multiple continents, ", "’s novellas and stories draw upon memoirs, newspaper accounts, detective stories, interrogation transcripts, and speculative fiction to create new and strange perspectives on our past and present. In “Rivers,” a free Jim meets up decades later with his former raftmate Huckleberry Finn; “An Outtake” chronicles an escaped slave’s fate in the American Revolution; “On Brazil, or Dénouement” burrows deep into slavery and sorcery in early colonial South America; and in “Blues” the great poets Langston Hughes and Xavier Villaurrutia meet in Depression-era New York and share more than secrets."], "author": "John  Keene", "num_pages": "320", "awards": ["American Book Award (2016)", "Republic of Consciousness Prize (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-05 00:00:00", "ISBN": "0811224341"},
{"url": "https://www.goodreads.com/book/show/23719408-under-the-udala-trees", "num_ratings": "4,427", "num_reviews": "719", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Lgbt", "Glbt", "Queer", "Western Africa", "Nigeria"], "title": "Under the Udala Trees", "description": ["Inspired by Nigeria's folktales and its war, Under the Udala Trees is a deeply searching, powerful debut about the dangers of living and loving openly.", "Ijeoma comes of age as her nation does; born before independence, she is eleven when civil war breaks out in the young republic of Nigeria. Sent away to safety, she meets another displaced child and they, star-crossed, fall", "Inspired by Nigeria's folktales and its war, Under the Udala Trees is a deeply searching, powerful debut about the dangers of living and loving openly.", "Ijeoma comes of age as her nation does; born before independence, she is eleven when civil war breaks out in the young republic of Nigeria. Sent away to safety, she meets another displaced child and they, star-crossed, fall in love. They are from different ethnic communities. They are also both girls. ", "When their love is discovered, Ijeoma learns that she will have to hide this part of herself. But there is a cost to living inside a lie. ", "As Edwidge Danticat has made personal the legacy of Haiti's political coming of age, Okparanta's Under the Udala Trees uses one woman's lifetime to examine the ways in which Nigerians continue to struggle toward selfhood. Even as their nation contends with and recovers from the effects of war and division, Nigerian lives are also wrecked and lost from taboo and prejudice. This story offers a glimmer of hope — a future where a woman might just be able to shape her life around truth and love."], "author": "Chinelo Okparanta", "num_pages": "328", "awards": ["Lambda Literary Award for Lesbian General Fiction (2016)", "Hurston/Wright Legacy Award Nominee for Fiction (2016)", "The Center for Fiction First Novel Prize Nominee for Longlist (2015)", "International DUBLIN Literary Award Nominee for Shortlist (2017)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2015-09-22 00:00:00", "ISBN": "0544003446"},
{"url": "https://www.goodreads.com/book/show/17862189-corona", "num_ratings": "190", "num_reviews": "28", "avg_ratings": 3.81, "genres": ["Fiction", "Short Stories", "Glbt", "Queer", "Lgbt", "Lgbt", "Bisexual"], "title": "Corona", "description": ["Razia Mirza is a Pakistani woman from Corona, Queens, who grew up in a tight Muslim community surrounding the first Sunni masjid built in New York City. When a rebellious streak leads to her ex-communication, she decides to hit the road. Corona moves between Razia’s childhood and the comedic misadventures she encounters on her journey, from a Puritan Colony in Massachusett", "Razia Mirza is a Pakistani woman from Corona, Queens, who grew up in a tight Muslim community surrounding the first Sunni masjid built in New York City. When a rebellious streak leads to her ex-communication, she decides to hit the road. Corona moves between Razia’s childhood and the comedic misadventures she encounters on her journey, from a Puritan Colony in Massachusetts to New York City’s Bhangra music scene. With each story, we learn more about the past she’s escaping, a past which leads her to constantly travel in a spiral, always coming closer to but never quite arriving home."], "author": "Bushra Rehman", "num_pages": "154", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-01 00:00:00", "ISBN": "1937420396"},
{"url": "https://www.goodreads.com/book/show/195733.Trumpet", "num_ratings": "3,307", "num_reviews": "258", "avg_ratings": 4.03, "genres": ["Fiction", "Lgbt", "Glbt", "Queer"], "title": "Trumpet", "description": ["In her starkly beautiful and wholly unexpected tale, Jackie Kay delves into the most intimate workings of the human heart and mind and offers a triumphant tale of loving deception and lasting devotion.", "The death of legendary jazz trumpeter Joss Moody exposes an extraordinary secret, one that enrages his adopted son, Colman, leading him to collude with a tabloid journalist.", "In her starkly beautiful and wholly unexpected tale, Jackie Kay delves into the most intimate workings of the human heart and mind and offers a triumphant tale of loving deception and lasting devotion.", "The death of legendary jazz trumpeter Joss Moody exposes an extraordinary secret, one that enrages his adopted son, Colman, leading him to collude with a tabloid journalist. Besieged by the press, his widow Millie flees to a remote Scottish village, where she seeks solace in memories of their marriage. The reminiscences of those who knew Joss Moody render a moving portrait of a shared life founded on an intricate lie, one that preserved a rare, unconditional love."], "author": "Jackie Kay", "num_pages": "278", "awards": ["Guardian Fiction Award (1998)", "Orange Prize Nominee for Fiction Longlist (1999)", "Authors' Club Best First Novel Award (1998)", "International DUBLIN Literary Award Nominee (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-07-11 00:00:00", "ISBN": "0375704639"},
{"url": "https://www.goodreads.com/book/show/143366.The_Last_Generation", "num_ratings": "110", "num_reviews": "2", "avg_ratings": 4.18, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Nonfiction", "Feminism", "Religion"], "title": "The Last Generation: Prose and Poetry", "description": ["A classic work by award-winning author Cherríe Moraga, ", " is an electric mix of prose and poetry that continues conversations started in the beloved books ", " and ", " Highly politicized and intensely personal, Moraga's work dares to imagine the", "A classic work by award-winning author Cherríe Moraga, ", " is an electric mix of prose and poetry that continues conversations started in the beloved books ", " and ", " Highly politicized and intensely personal, Moraga's work dares to imagine the mythic nation Queer Atzlán: a brave vision for gender, sexuality, race, art, nationalism, and the politics of liberation. Moraga crosses literary genres to ruminate on the paradox of being at once inside and outside the myriad struggles and communities—interlocking and often at odds—that spur her art and activism. Speaking from her experience as a queer Chicana activist/artist, Moraga is committed to building a broad politic of solidarity and justice for all dispossessed people.", "With fierce honesty and incisive political analysis, Moraga offers more than an inspiring portrait of the struggle of an activist artist—she helps us see the world as it is and dream it up anew."], "author": "Cherríe L. Moraga", "num_pages": "196", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-07-01 00:00:00", "ISBN": "0896084663"},
{"url": "https://www.goodreads.com/book/show/21487668-james-baldwin", "num_ratings": "405", "num_reviews": "49", "avg_ratings": 4.44, "genres": ["Nonfiction", "Writing", "Essays", "Cultural", "African American", "Race", "Lgbt", "Biography"], "title": "James Baldwin: The Last Interview: and Other Conversations", "description": ["“I was not born to be what someone said I was. I was not born to be defined by someone else, but by myself, and myself only.” When, in the fall of 1987, the poet Quincy Troupe traveled to the south of France to interview James Baldwin, Baldwin’s brother David told him to ask Baldwin about everything—", "“I was not born to be what someone said I was. I was not born to be defined by someone else, but by myself, and myself only.” When, in the fall of 1987, the poet Quincy Troupe traveled to the south of France to interview James Baldwin, Baldwin’s brother David told him to ask Baldwin about everything—Baldwin was critically ill and David knew that this might be the writer’s last chance to speak at length about his life and work.", "The result is one of the most eloquent and revelatory interviews of Baldwin’s career, a conversation that ranges widely over such topics as his childhood in Harlem, his close friendship with Miles Davis, his relationship with writers like Toni Morrison and Richard Wright, his years in France, and his ever-incisive thoughts on the history of race relations and the African-American experience.", "Also collected here are significant interviews from other moments in Baldwin’s life, including an in-depth interview conducted by Studs Terkel shortly after the publication of ", ". These interviews showcase, above all, Baldwin’s fearlessness and integrity as a writer, thinker, and individual, as well as the profound struggles he faced along the way."], "author": "James Baldwin", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-12-02 00:00:00", "ISBN": "1612194001"},
{"url": "https://www.goodreads.com/book/show/25365.Out", "num_ratings": "18,814", "num_reviews": "2,122", "avg_ratings": 3.93, "genres": ["Fiction", "Cultural", "Japan", "Mystery", "Thriller", "Asian Literature", "Japanese Literature", "Mystery", "Crime", "Horror"], "title": "Out", "description": ["Natsuo Kirino's novel tells a story of random violence in the staid Tokyo suburbs, as a young mother who works a night shift making boxed lunches brutally strangles her deadbeat husband and then seeks the help of her co-workers to dispose of the body and cover up her crime.", "The ringleader of this cover-up, Masako Katori, emerges as the emotional heart of ", " and as one of t", "Natsuo Kirino's novel tells a story of random violence in the staid Tokyo suburbs, as a young mother who works a night shift making boxed lunches brutally strangles her deadbeat husband and then seeks the help of her co-workers to dispose of the body and cover up her crime.", "The ringleader of this cover-up, Masako Katori, emerges as the emotional heart of ", " and as one of the shrewdest, most clear-eyed creations in recent fiction. Masako's own search for a way out of the straitjacket of a dead-end life leads her, too, to take drastic action.", "The complex yet riveting narrative seamlessly combines a convincing glimpse into the grimy world of Japan's yakuza with a brilliant portrayal of the psychology of a violent crime and the ensuing game of cat-and-mouse between seasoned detectives and a group of determined but inexperienced criminals. Kirino has mastered a Thelma and Louise kind of graveyard humor that illuminates her stunning evocation of the pressures and prejudices that drive women to extreme deeds and the friendship that bolsters them in the aftermath."], "author": "Natsuo Kirino", "num_pages": "400", "awards": ["Naoki Prize 直木三十五賞 Nominee (1997)", "Edgar Award Nominee for Best Novel (2004)", "日本推理作家協会賞 for Best Novel (1998)", "このミステリーがすごい！ for Best Japanese Mystery Novel of the Year (1998)"], "places": ["Japan", "Tokyo"], "character_names": ["Masako", "Yayoi", "Kuniko", "Yoshie"], "language": "English", "publish_date": "2005-01-04 00:00:00", "ISBN": "1400078377"},
{"url": "https://www.goodreads.com/book/show/313110.This_Bridge_Called_My_Back", "num_ratings": "6,700", "num_reviews": "208", "avg_ratings": 4.46, "genres": ["Feminism", "Nonfiction", "Race", "Writing", "Essays", "Poetry", "Social Movements", "Social Justice"], "title": "This Bridge Called My Back: Writings by Radical Women of Color", "description": ["This groundbreaking collection reflects an uncompromised definition of feminism by women of color. Through personal essays, criticism, interviews, testimonials, poetry, and visual art, the collection explores, as coeditor Cherríe Moraga writes, “the complex confluence of identities—race, class, gender, and sexuality—systemic to women of color oppression and liberation.”"], "author": "Cherríe L. Moraga", "num_pages": "261", "awards": ["American Book Award (1986)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1983-03-01 00:00:00", "ISBN": "091317503X"},
{"url": "https://www.goodreads.com/book/show/419169.Brother_to_Brother", "num_ratings": "80", "num_reviews": "7", "avg_ratings": 4.49, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Nonfiction", "Race", "Queer", "Queer Lit", "Glbt", "Gay"], "title": "Brother to Brother: New Writing by Black Gay Men", "description": ["Literary Nonfiction. African American Studies. LGBT Studies. Winner of a Lambda Literary Award. BROTHER TO BROTHER, begun by Joseph Beam and completed by Essex Hemphill after Beam's death in 1988, is a collection of now-classic literary work by black gay male writers. Originally published in 1991 and out of print for several years, BROTHER TO BROTHER \"is a community of voi", "Literary Nonfiction. African American Studies. LGBT Studies. Winner of a Lambda Literary Award. BROTHER TO BROTHER, begun by Joseph Beam and completed by Essex Hemphill after Beam's death in 1988, is a collection of now-classic literary work by black gay male writers. Originally published in 1991 and out of print for several years, BROTHER TO BROTHER \"is a community of voices,\" Hemphill writes. \"[It] tells a story that laughs and cries and sings and celebrates...it's a conversation intimate friends share for hours. These are truly words mined syllable by syllable from the harts of black gay men. You're invited to listen in because you're family, and these aren't secrets-not to us, so why should they be secrets to you? Just listen. Your brother is speaking.\" This new edition includes an introduction by Jafari Allen."], "author": "Essex Hemphill", "num_pages": "389", "awards": ["Stonewall Book Award Nominee for Literature (1992)", "Lambda Literary Award for Gay Men's Anthologies (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "0978625110"},
{"url": "https://www.goodreads.com/book/show/32498369-black-panther", "num_ratings": "1,366", "num_reviews": "237", "avg_ratings": 3.71, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Comics", "Superheroes", "Fiction", "Fantasy", "Lgbt", "Superheroes", "Marvel", "Graphic Novels Comics"], "title": "Black Panther: World of Wakanda", "description": ["\"YOU DESERVED SO MUCH MORE, LITTLE FLOWER. YOU DESERVED A WAKANDA THAT CHERISHED YOU.\" Writer ROXANE GAY (Bad Feminst, Hunger) spins a Wakandan love story — its tenderness matched only by its brutality. You know them now as The Midnight Angels, but in this story they are just Ayo and Aneka, young women recruited to become Dora Milaje, an elite task force trained to protect", "\"YOU DESERVED SO MUCH MORE, LITTLE FLOWER. YOU DESERVED A WAKANDA THAT CHERISHED YOU.\" Writer ROXANE GAY (Bad Feminst, Hunger) spins a Wakandan love story — its tenderness matched only by its brutality. You know them now as The Midnight Angels, but in this story they are just Ayo and Aneka, young women recruited to become Dora Milaje, an elite task force trained to protect the crown at all costs. What happens when your nation needs your hearts and minds, but you already gave them to each other? Illustrated by industry veteran ALITHA E. MARTINEZ (Iron Man, Black Panther). And in a special backup story, acclaimed poet YONA HARVEY (Hemming the Water) explores the true origins of The People's mysterious leader Zenzi. Black Panther thinks he knows who Zenzi is and how she got her powers, but he only knows part of the story… Illustrated by rising star AFUA RICHARDSON (Genius)."], "author": "Roxane Gay", "num_pages": "144", "awards": ["Will Eisner Comic Industry Awards for Best Limited Series (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-27 00:00:00", "ISBN": "130290650X"},
{"url": "https://www.goodreads.com/book/show/20643015-willful-subjects", "num_ratings": "72", "num_reviews": "8", "avg_ratings": 4.32, "genres": ["Nonfiction", "Philosophy", "Feminism", "Philosophy", "Theory", "Academic"], "title": "Willful Subjects", "description": ["In ", " Sara Ahmed explores willfulness as a charge often made by some against others. One history of will is a history of attempts to eliminate willfulness from the will. Delving into philosophical and literary texts, Ahmed examines the relation between will and willfulness, ill will and good will, and the particular will and general will. Her reflections shed", "In ", " Sara Ahmed explores willfulness as a charge often made by some against others. One history of will is a history of attempts to eliminate willfulness from the will. Delving into philosophical and literary texts, Ahmed examines the relation between will and willfulness, ill will and good will, and the particular will and general will. Her reflections shed light on how will is embedded in a political and cultural landscape, how it is embodied, and how will and willfulness are socially mediated. Attentive to the wayward, the wandering, and the deviant, Ahmed considers how willfulness is taken up by those who have received its charge. Grounded in feminist, queer, and antiracist politics, her sui generis analysis of the willful subject, the figure who wills wrongly or wills too much, suggests that willfulness might be required to recover from the attempt at its elimination."], "author": "Sara Ahmed", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-16 00:00:00", "ISBN": "0822357836"},
{"url": "https://www.goodreads.com/book/show/16073046-bi", "num_ratings": "516", "num_reviews": "77", "avg_ratings": 3.78, "genres": ["Nonfiction", "Glbt", "Queer", "Lgbt", "Feminism", "Sexuality"], "title": "Bi: Notes for a Bisexual Revolution", "description": ["Depicted as duplicitous, traitorous, and promiscuous, bisexuality has long been suspected, marginalized, and rejected by both straight and gay communities alike.", " takes a long overdue, comprehensive look at bisexual politics—from the issues surrounding biphobia/monosexism, feminism, and transgenderism to the practice of labeling those who identify as bi as either \"too bis", "Depicted as duplicitous, traitorous, and promiscuous, bisexuality has long been suspected, marginalized, and rejected by both straight and gay communities alike.", " takes a long overdue, comprehensive look at bisexual politics—from the issues surrounding biphobia/monosexism, feminism, and transgenderism to the practice of labeling those who identify as bi as either \"too bisexual” (promiscuous and incapable of fidelity) or \"not bisexual enough” (not actively engaging romantically or sexually with people of at least two different genders). In this forward-thinking and eye-opening book, feminist bisexual and genderqueer activist Shiri Eisner takes readers on a journey through the many aspects of the meanings and politics of bisexuality, specifically highlighting how bisexuality can open up new and exciting ways of challenging social convention.", "Informed by feminist, transgender, and queer theory, as well as politics and activism, ", " is a radical manifesto for a group that has been too frequently silenced, erased, and denied—and a starting point from which to launch a bisexual revolution."], "author": "Shiri Eisner", "num_pages": "352", "awards": ["Lambda Literary Award Nominee for Bisexual Nonfiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-02 00:00:00", "ISBN": "1580054749"},
{"url": "https://www.goodreads.com/book/show/85866.Tales_of_Nev_r_on", "num_ratings": "1,090", "num_reviews": "90", "avg_ratings": 3.88, "genres": ["Fantasy", "Fiction", "Science Fiction", "Short Stories", "Science Fiction Fantasy"], "title": "Tales of Nevèrÿon", "description": ["In his four-volume series ", ", Hugo and Nebula award-winner Samuel R. Delany appropriated the conceits of sword-and-sorcery fantasy to explore his characteristic themes of language, power, gender, and the nature of civilization. Wesleyan University Press has reissued the long-unavailable ", " volumes in trade paperback. ", "The eleven stories, novellas, and", "In his four-volume series ", ", Hugo and Nebula award-winner Samuel R. Delany appropriated the conceits of sword-and-sorcery fantasy to explore his characteristic themes of language, power, gender, and the nature of civilization. Wesleyan University Press has reissued the long-unavailable ", " volumes in trade paperback. ", "The eleven stories, novellas, and novels in ", "'s four volumes chronicle a long-ago land on civilization's brink, perhaps in Asia or Africa, or even on the Mediterranean. Taken slave in childhood, Gorgik gains his freedom, leads a slave revolt, and becomes a minister of state, finally abolishing slavery. Ironically, however, he is sexually aroused by the iron slave collars of servitude. Does this contaminate his mission - or intensify it? Presumably elaborated from an ancient text of unknown geographical origin, the stories are sunk in translators' and commentators' introductions and appendices, forming a richly comic frame."], "author": "Samuel R. Delany", "num_pages": "260", "awards": ["Locus Award Nominee (1980)", "Prometheus Award Nominee (1982)", "National Book Award Finalist for Science Fiction (Paperback) (1980)"], "places": [], "character_names": ["Gorgik"], "language": "English", "publish_date": "1993-10-16 00:00:00", "ISBN": "081956270X"},
{"url": "https://www.goodreads.com/book/show/4498962-please", "num_ratings": "475", "num_reviews": "51", "avg_ratings": 4.37, "genres": ["Poetry", "Lgbt", "Glbt", "Queer"], "title": "Please", "description": ["Poetry. African American Studies. LGBT Studies. PLEASE explores the points in our lives at which love and violence intersect. Drunk on its own rhythms and full of imaginative and often frightening imagery, PLEASE is the album playing in the background of the history and culture that surround African American/male identity and sexuality. Just as radio favorites like Marvin", "Poetry. African American Studies. LGBT Studies. PLEASE explores the points in our lives at which love and violence intersect. Drunk on its own rhythms and full of imaginative and often frightening imagery, PLEASE is the album playing in the background of the history and culture that surround African American/male identity and sexuality. Just as radio favorites like Marvin Gaye, Donny Hathaway, and Pink Floyd characterize loss, loneliness, addiction, and denial with their voices, these poems' chorus of speakers transform moments of intimacy and humor into spontaneous music. In PLEASE, Jericho Brown sings the influence soul culture has on American life with the accuracy of the blues."], "author": "Jericho Brown", "num_pages": "69", "awards": ["American Book Award (2009)", "Thom Gunn Award for Gay Poetry Nominee (2009)", "Hurston/Wright Legacy Award Nominee for Poetry (2009)", "Paterson Poetry Prize Nominee (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-10-01 00:00:00", "ISBN": "1930974795"},
{"url": "https://www.goodreads.com/book/show/188038.Not_Vanishing", "num_ratings": "198", "num_reviews": "13", "avg_ratings": 4.44, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Glbt", "Lesbian"], "title": "Not Vanishing", "description": ["Passionate, vital poetry by acclaimed Native American writer and activist Chrystos addresses self-esteem and survival, the loving of women, and pride in her heritage."], "author": "Chrystos", "num_pages": "105", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-12-01 00:00:00", "ISBN": "0889740151"},
{"url": "https://www.goodreads.com/book/show/1672003.Spring_Snow", "num_ratings": "8,959", "num_reviews": "638", "avg_ratings": 4.15, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Historical", "Historical Fiction", "Classics"], "title": "Spring Snow", "description": ["Tokyo, 1912. The closed world of the ancient aristocracy is being breached for the first time by outsiders - rich provincial families, a new and powerful political and social elite.", "Kiyoaki has been raised among the elegant Ayakura family - members of the waning aristocracy - but he is not one of them. Coming of age, he is caught up in the tensions between old and new, and", "Tokyo, 1912. The closed world of the ancient aristocracy is being breached for the first time by outsiders - rich provincial families, a new and powerful political and social elite.", "Kiyoaki has been raised among the elegant Ayakura family - members of the waning aristocracy - but he is not one of them. Coming of age, he is caught up in the tensions between old and new, and his feelings for the exquisite, spirited Satoko, observed from the sidelines by his devoted friend Honda. When Satoko is engaged to a royal prince, Kiyoaki realises the magnitude of his passion."], "author": "Yukio Mishima", "num_pages": "376", "awards": ["National Book Award Finalist for Translation (1973)"], "places": [], "character_names": ["Kiyoaki 'Kiyo' Matsugae", "Satoko Ayakura"], "language": "English", "publish_date": "1975-07-16 00:00:00", "ISBN": "0671540629"},
{"url": "https://www.goodreads.com/book/show/7756473-chulito", "num_ratings": "481", "num_reviews": "100", "avg_ratings": 3.97, "genres": ["Romance", "M M Romance", "Young Adult", "Lgbt", "Glbt", "Queer", "Fiction", "Contemporary"], "title": "Chulito", "description": ["Set against a vibrant South Bronx neighborhood and the queer youth culture of Manhattan's piers, ", " is a coming-out, coming-of-age love story of a sexy, tough, hip hop–loving, young Latino man and the colorful characters in his vibrant neighborhood. Chulito, which means \"cutie,\" is one of the boys, and everyone in his neighborhood has seen him grow up—the owner of the", "Set against a vibrant South Bronx neighborhood and the queer youth culture of Manhattan's piers, ", " is a coming-out, coming-of-age love story of a sexy, tough, hip hop–loving, young Latino man and the colorful characters in his vibrant neighborhood. Chulito, which means \"cutie,\" is one of the boys, and everyone in his neighborhood has seen him grow up—the owner of the local bodega, the Lees from the Chinese restaurant, his buddies from the corner, and all of his neighbors and friends, including Carlos, who was Chulito's best friend until they hit puberty and people started calling Carlos a ", " . . . a faggot.", "Chulito rejects Carlos, buries his feelings for him, and becomes best friends with Kamikaze, a local drug dealer. When Carlos comes home from his first year away at college and they share a secret kiss, Chulito's worlds collide as his ideas of being a man, being macho, and being in love are challenged. Vivid, sexy, funny, heartbreaking, and fearless, this brilliant work is destined to become a queer classic."], "author": "Charles Rice-González", "num_pages": "280", "awards": ["TLA Gaybie Award for Best Fiction (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-05-01 00:00:00", "ISBN": "1593501722"},
{"url": "https://www.goodreads.com/book/show/86887.Pedagogies_of_Crossing", "num_ratings": "154", "num_reviews": "10", "avg_ratings": 4.4, "genres": ["Feminism", "Nonfiction", "Philosophy", "Theory", "Glbt", "Queer", "Academic", "Gender", "Gender Studies", "Sexuality"], "title": "Pedagogies of Crossing: Meditations on Feminism, Sexual Politics, Memory, and the Sacred", "description": ["M. Jacqui Alexander is one of the most important theorists of transnational feminism working today. ", " brings together essays she has written over the past decade, uniting her incisive critiques, which have had such a profound impact on feminist, queer, and critical race theories, with some of her more recent work. In this landmark interdisciplinary vol", "M. Jacqui Alexander is one of the most important theorists of transnational feminism working today. ", " brings together essays she has written over the past decade, uniting her incisive critiques, which have had such a profound impact on feminist, queer, and critical race theories, with some of her more recent work. In this landmark interdisciplinary volume, Alexander points to a number of critical imperatives made all the more urgent by contemporary manifestations of neoimperialism and neocolonialism. Among these are the need for North American feminism and queer studies to take up transnational frameworks that foreground questions of colonialism, political economy, and racial formation; for a thorough re-conceptualization of modernity to account for the heteronormative regulatory practices of modern state formations; and for feminists to wrestle with the spiritual dimensions of experience and the meaning of sacred subjectivity.In these meditations, Alexander deftly unites large, often contradictory, historical processes across time and space. She focuses on the criminalization of queer communities in both the United States and the Caribbean in ways that prompt us to rethink how modernity invents its own traditions; she juxtaposes the political organizing and consciousness of women workers in global factories in Mexico, the Caribbean, and Canada with the pressing need for those in the academic factory to teach for social justice; she reflects on the limits and failures of liberal pluralism; and she presents original and compelling arguments that show how and why transgenerational memory is an indispensable spiritual practice within differently constituted women-of-color communities as it operates as a powerful antidote to oppression. In this multifaceted, visionary book, Alexander maps the terrain of alternative histories and offers new forms of knowledge with which to mold alternative futures."], "author": "M. Jacqui Alexander", "num_pages": "424", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-18 00:00:00", "ISBN": "0822336456"},
{"url": "https://www.goodreads.com/book/show/38457.Just_Above_My_Head", "num_ratings": "1,389", "num_reviews": "153", "avg_ratings": 4.36, "genres": ["Fiction", "Classics", "Lgbt", "Cultural", "African American", "American", "African American Literature"], "title": "Just Above My Head", "description": ["The stark grief of a brother mourning a brother opens this novel with a stunning, unforgettable experience.  Here, in a monumental saga of love and rage, Baldwin goes back to Harlem, to the church of his groundbreaking novel ", ", to the homosexual passion of ", ", and to the political fire that enflames his nonfiction work.  Here, too, the", "The stark grief of a brother mourning a brother opens this novel with a stunning, unforgettable experience.  Here, in a monumental saga of love and rage, Baldwin goes back to Harlem, to the church of his groundbreaking novel ", ", to the homosexual passion of ", ", and to the political fire that enflames his nonfiction work.  Here, too, the story of gospel singer Arthur Hall and his family becomes both a journey into another country of the soul and senses--and a living contemporary history of black struggle in this land."], "author": "James Baldwin", "num_pages": "584", "awards": ["National Book Award Finalist for Fiction (Hardcover) (1980)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-13 00:00:00", "ISBN": "0385334567"},
{"url": "https://www.goodreads.com/book/show/445229.Nova", "num_ratings": "5,594", "num_reviews": "318", "avg_ratings": 3.83, "genres": ["Science Fiction", "Fiction", "Space", "Space Opera"], "title": "Nova", "description": ["These are [at least some of] the ways you can read NOVA: as a fast-action farflung interstellar adventure; as archetypal mystical/mythical allegory (in which the Tarot and the Grail both figure prominently); as modern myth told in the S-F idiom... the reader observes, recollects, or participates in a range of personal experience including violent pain and disfigurement, se", "These are [at least some of] the ways you can read NOVA: as a fast-action farflung interstellar adventure; as archetypal mystical/mythical allegory (in which the Tarot and the Grail both figure prominently); as modern myth told in the S-F idiom... the reader observes, recollects, or participates in a range of personal experience including violent pain and disfigurement, sensory deprivation and overload, man-machine communion, the drug experience, the creative experience - and inter-personal relationships which include incest and assassination, father-son, leader-follower, human-pet, and lots more!", "The balance of galactic power in the 31st century revolves around Illyrion, the most precious energy source in the universe. The varied and exotic crew who sign up with Captain Lorq van Ray know their mission is dangerous, and they soon learn that they are involved in a deadly race with the charismatic but vicious leader of an opposing space federation. But they have no idea of Lorq's secret obsession: to gather Illyrion at the source by flying through the very heart of an imploding star."], "author": "Samuel R. Delany", "num_pages": "216", "awards": ["Hugo Award Nominee for Best Novel (1969)"], "places": [], "character_names": [], "language": "English", "publish_date": "1975-06-16 00:00:00", "ISBN": "0553100319"},
{"url": "https://www.goodreads.com/book/show/445741.We_Came_All_the_Way_from_Cuba_So_You_Could_Dress_Like_This_", "num_ratings": "314", "num_reviews": "23", "avg_ratings": 3.84, "genres": ["Short Stories", "Fiction", "Glbt", "Queer", "Lgbt", "Glbt", "Lesbian"], "title": "We Came All the Way from Cuba So You Could Dress Like This?: Stories", "description": ["Achy Obejas writes stories about uprooted people. Some, like herself, are Latino immigrants and lesbians; others are men (gay and straight), people with AIDS, addicts, people living marginally, just surviving. As omniscient narrator to her characters' lives, Obejas generously delves into her own memories of exile and alienation to tell stories about women and men who strug", "Achy Obejas writes stories about uprooted people. Some, like herself, are Latino immigrants and lesbians; others are men (gay and straight), people with AIDS, addicts, people living marginally, just surviving. As omniscient narrator to her characters' lives, Obejas generously delves into her own memories of exile and alienation to tell stories about women and men who struggle for wholeness and love."], "author": "Achy Obejas", "num_pages": "160", "awards": ["Lambda Literary Award Nominee for Small Press Book (1995)"], "places": [], "character_names": [], "language": "English", "publish_date": "1994-08-16 00:00:00", "ISBN": "093941693X"},
{"url": "https://www.goodreads.com/book/show/2442061.The_Einstein_Intersection", "num_ratings": "3,826", "num_reviews": "329", "avg_ratings": 3.58, "genres": ["Science Fiction", "Fiction"], "title": "The Einstein Intersection", "description": ["The Einstein Intersection won the Nebula Award for best science fiction novel of 1967. The surface story tells of the problems a member of an alien race, Lo Lobey, has assimilating the mythology of earth, where his kind have settled among the leftover artifacts of humanity. The deeper tale concerns, however, the way those who are \"different\" must deal with the dominant cul", "The Einstein Intersection won the Nebula Award for best science fiction novel of 1967. The surface story tells of the problems a member of an alien race, Lo Lobey, has assimilating the mythology of earth, where his kind have settled among the leftover artifacts of humanity. The deeper tale concerns, however, the way those who are \"different\" must deal with the dominant cultural ideology. The tale follows Lobey's mythic quest for his lost love, Friza. In luminous and hallucinated language, it explores what new myths might emerge from the detritus of the human world as those who are \"different\" try to seize history and the day."], "author": "Samuel R. Delany", "num_pages": "155", "awards": ["Hugo Award Nominee for Best Novel (1968)", "Nebula Award for Best Novel (1967)"], "places": [], "character_names": ["Lobey", "Friza"], "language": "English", "publish_date": "1978-02-01 00:00:00", "ISBN": "0441196845"},
{"url": "https://www.goodreads.com/book/show/1199688.Babel_17", "num_ratings": "9,877", "num_reviews": "616", "avg_ratings": 3.78, "genres": ["Science Fiction", "Fiction"], "title": "Babel-17", "description": [" is all about the power of language. Humanity, which has spread throughout the universe, is involved in a war with the Invaders, who have been covertly assassinating officials and sabotaging spaceships. The only clues humanity has to go on are strange alien messages that have been intercepted in space. Poet and linguist Rydra Wong is determined to understand the la", " is all about the power of language. Humanity, which has spread throughout the universe, is involved in a war with the Invaders, who have been covertly assassinating officials and sabotaging spaceships. The only clues humanity has to go on are strange alien messages that have been intercepted in space. Poet and linguist Rydra Wong is determined to understand the language and stop the alien threat. "], "author": "Samuel R. Delany", "num_pages": "192", "awards": ["Hugo Award Nominee for Best Novel (1967)", "Nebula Award for Best Novel (1966)"], "places": [], "character_names": [], "language": "English", "publish_date": "1978-06-01 00:00:00", "ISBN": "0839823282"},
{"url": "https://www.goodreads.com/book/show/1280001.A_Burst_of_Light", "num_ratings": "263", "num_reviews": "41", "avg_ratings": 4.33, "genres": ["Nonfiction", "Writing", "Essays", "Feminism", "Lgbt", "Poetry", "Glbt", "Queer"], "title": "A Burst of Light", "description": ["Black freedom fighter's strength and signifying words. Essays. 1989 Before Columbus Foundation American Book Award."], "author": "Audre Lorde", "num_pages": "134", "awards": ["American Book Award (1989)", "Lambda Literary Award Nominee for Lesbian Nonfiction (1989)"], "places": [], "character_names": [], "language": "English", "publish_date": "1988-05-01 00:00:00", "ISBN": "0932379397"},
{"url": "https://www.goodreads.com/book/show/662005.Food_for_Our_Grandmothers", "num_ratings": "78", "num_reviews": "4", "avg_ratings": 4.4, "genres": ["Feminism", "Nonfiction", "Poetry", "Gender", "Anthologies"], "title": "Food for Our Grandmothers: Writings by Arab-American and Arab-Canadian Feminists", "description": ["This groundbreaking collection creates a space in which Arab-American and Arab-Canadian feminsts speak out about issues of history, culture and identity. While anti-Arab racism depicts Arab women as veiled, passive victims living in hopelessly sexist communities, ", " analyzes and challenges these innacurate and distorted views."], "author": "Joanna Kadi", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-07-01 00:00:00", "ISBN": "0896084892"},
{"url": "https://www.goodreads.com/book/show/616911.The_Sound_of_Waves", "num_ratings": "8,392", "num_reviews": "761", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics", "Literature", "Romance"], "title": "The Sound of Waves", "description": ["Set in a remote fishing village in Japan, The Sound of Waves is a timeless story of first love. A young fisherman is entranced at the sight of the beautiful daughter of the wealthiest man in the village. They fall in love, but must then endure the calumny and gossip of the villagers."], "author": "Yukio Mishima", "num_pages": "192", "awards": ["Shincho Prize (1954)"], "places": ["Japan"], "character_names": ["Shinji Kubo", "Terukichi Miyata", "Chiyoko", "Yasuo Kawamoto"], "language": "English", "publish_date": "1994-10-04 00:00:00", "ISBN": "0679752684"},
{"url": "https://www.goodreads.com/book/show/5600534-the-other-side-of-paradise", "num_ratings": "1,747", "num_reviews": "166", "avg_ratings": 4.16, "genres": ["Autobiography", "Memoir", "Nonfiction", "Glbt", "Queer", "Lgbt", "Biography"], "title": "The Other Side of Paradise", "description": ["Staceyann Chin has appeared on television and radio, including ", " , CNN, and PBS, discussing issues of race and sexuality. But it is her extraordinary voice that launched her career as a performer, poet, and activist. Here, she shares her unforgettable story of triumph against all odds in this brave and fiercely candid memoir..", "Staceyann Chin has appeared on television and radio, including ", " , CNN, and PBS, discussing issues of race and sexuality. But it is her extraordinary voice that launched her career as a performer, poet, and activist. Here, she shares her unforgettable story of triumph against all odds in this brave and fiercely candid memoir.."], "author": "Staceyann Chin", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-04-14 00:00:00", "ISBN": "0743292901"},
{"url": "https://www.goodreads.com/book/show/18050628-trauma-queen", "num_ratings": "32", "num_reviews": "2", "avg_ratings": 4.28, "genres": ["Autobiography", "Memoir", "Nonfiction", "Glbt", "Queer", "Poetry", "Lgbt", "Transgender", "Feminism", "Queer", "Queer Lit", "Lgbt"], "title": "Trauma Queen", "description": ["Lovemme Corazón’s debut book, ", ", is a memoir documenting the struggles of being a child survivor of rape and abuse. Through the use of multi-genre writing (poems, prose, story-telling, etc), this book is a collection of years of journal/diary entries. Lovemme is unapologetically facing the taboo truths of what it means to be a survivor and how that trauma shapes", "Lovemme Corazón’s debut book, ", ", is a memoir documenting the struggles of being a child survivor of rape and abuse. Through the use of multi-genre writing (poems, prose, story-telling, etc), this book is a collection of years of journal/diary entries. Lovemme is unapologetically facing the taboo truths of what it means to be a survivor and how that trauma shapes their life."], "author": "Luna Merbruja", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-31 00:00:00", "ISBN": "0991900839"},
{"url": "https://www.goodreads.com/book/show/697446.Twinkle_Twinkle", "num_ratings": "1,117", "num_reviews": "138", "avg_ratings": 3.65, "genres": ["Fiction", "Asian Literature", "Japanese Literature", "Cultural", "Japan", "Lgbt", "Romance", "Cultural", "Asia", "Literature", "Novels", "Contemporary", "Glbt", "Gay"], "title": "Twinkle Twinkle", "description": ["They got married ten days ago. They haven't had sex yet and they don't intend to. ", "As it turned out, the only way to make their parents get off their backs about trying to \"find someone\" was actually finding someone--with whom to put marriage for show. Mutsuki is strictly gay and has a boyfriend, while Shoko is a clinical case of emotional instability who's in no shape for", "They got married ten days ago. They haven't had sex yet and they don't intend to. ", "As it turned out, the only way to make their parents get off their backs about trying to \"find someone\" was actually finding someone--with whom to put marriage for show. Mutsuki is strictly gay and has a boyfriend, while Shoko is a clinical case of emotional instability who's in no shape for a relationship. They've each found in the other a perfect partner for a sham marriage. Since the conspirators' parents know of their own child's undesirability, but not the spouse's, the union manages to please them. And while the newlyweds hope, in their own way, to live happily ever after, they inevitably come face to face with the fact that no marriage real or staged, is a fairy tale."], "author": "Kaori Ekuni", "num_pages": "170", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-05-01 00:00:00", "ISBN": "1932234012"},
{"url": "https://www.goodreads.com/book/show/18585282-salt", "num_ratings": "12,805", "num_reviews": "1,380", "avg_ratings": 4.39, "genres": ["Poetry", "Feminism", "Nonfiction"], "title": "Salt", "author": "Nayyirah Waheed", "num_pages": "251", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "1492238287"},
{"url": "https://www.goodreads.com/book/show/13429614-calling-dr-laura", "num_ratings": "5,576", "num_reviews": "527", "avg_ratings": 3.83, "genres": ["Sequential Art", "Graphic Novels", "Autobiography", "Memoir", "Sequential Art", "Comics", "Nonfiction", "Lgbt", "Glbt", "Queer"], "title": "Calling Dr. Laura", "description": ["When Nicole Georges was two years old, her family told her that her father was dead. When she was twenty-three, a psychic told her he was alive. Her sister, saddled with guilt, admits that the psychic is right and that the whole family has conspired to keep him a secret. Sent into a tailspin about her identity, Nicole turns to radio talk-show host Dr. Laura Schlessinger fo", "When Nicole Georges was two years old, her family told her that her father was dead. When she was twenty-three, a psychic told her he was alive. Her sister, saddled with guilt, admits that the psychic is right and that the whole family has conspired to keep him a secret. Sent into a tailspin about her identity, Nicole turns to radio talk-show host Dr. Laura Schlessinger for advice.", "Packed cover-to-cover with heartfelt and disarming black-and-white illustrations, ", " tells the story of what happens to you when you are raised in a family of secrets, and what happens to your brain (and heart) when you learn the truth from an unlikely source. Part coming-of-age and part coming-out story, ", " marks the arrival of an exciting and winning new voice in graphic literature."], "author": "Nicole J. Georges", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-22 00:00:00", "ISBN": "0547615590"},
{"url": "https://www.goodreads.com/book/show/27158835-you-know-me-well", "num_ratings": "9,821", "num_reviews": "1,957", "avg_ratings": 3.79, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "You Know Me Well", "description": ["Mark and Kate have sat next to each other for an entire year, but have never spoken. For whatever reason, their paths outside of class have never crossed.", "That is, until Kate spots Mark miles away from home, out in the city for a wild, unexpected night. K", "Mark and Kate have sat next to each other for an entire year, but have never spoken. For whatever reason, their paths outside of class have never crossed.", "That is, until Kate spots Mark miles away from home, out in the city for a wild, unexpected night. Kate is lost, having just run away from a chance to finally meet the girl she has been in love with from afar. Mark, meanwhile, is in love with his best friend Ryan, who may or may not feel the same way.", "When Kate and Mark meet up, little do they know how important they will become to each other—and how, in a very short time, they will know each other better than any of the people who are supposed to know them more.", "Told in alternating points of view by Nina LaCour and David Levithan, ", " is a story about navigating the joys and heartaches of first love, one truth at a time."], "author": "Nina LaCour", "num_pages": "248", "awards": [], "places": ["San Francisco, California"], "character_names": [], "language": "English", "publish_date": "2016-06-07 00:00:00", "ISBN": "1250098645"},
{"url": "https://www.goodreads.com/book/show/1066830.Vanishing_Rooms", "num_ratings": "76", "num_reviews": "6", "avg_ratings": 3.79, "genres": ["Fiction", "Glbt", "Gay", "Lgbt", "Glbt", "Queer", "Queer", "Queer Lit"], "title": "Vanishing Rooms", "description": ["Prior to Melvin Dixon’s death from AIDS in 1992 when he was on the verge of breaking out as an acclaimed novelist, his talent was compared to that of Toni Morrison and James Baldwin. In Vanishing Rooms, the author amply demonstrates his literary promise with a compelling love story of interracial sex and urban violence set in Manhattan’s West Village in the 1970s."], "author": "Melvin Dixon", "num_pages": "211", "awards": ["Ferro-Grumley Award for Gay Fiction (1992)", "Lambda Literary Award Nominee for Gay Men's Fiction (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-04-23 00:00:00", "ISBN": "1573441236"},
{"url": "https://www.goodreads.com/book/show/9415946-huntress", "num_ratings": "9,287", "num_reviews": "982", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Young Adult", "Young Adult Fantasy", "Adventure", "Fantasy", "Magic"], "title": "Huntress", "description": ["Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, th", "Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, the city of the Fairy Queen. Taisin is a sage, thrumming with magic, and Kaede is of the earth, without a speck of the otherworldly. And yet the two girls' destinies are drawn together during the mission. As members of their party succumb to unearthly attacks and fairy tricks, the two come to rely on each other and even begin to fall in love. But the Kingdom needs only one huntress to save it, and what it takes could tear Kaede and Taisin apart forever.", "The exciting adventure prequel to Malinda Lo's highly acclaimed novel ", "is overflowing with lush Chinese influences and details inspired by the ", ", and is filled with action and romance."], "author": "Malinda Lo", "num_pages": "371", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2012)", "James Tiptree Jr. Award Nominee for Longlist (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "031604007X"},
{"url": "https://www.goodreads.com/book/show/20821284-brown-girl-dreaming", "num_ratings": "46,129", "num_reviews": "6,846", "avg_ratings": 4.13, "genres": ["Poetry", "Autobiography", "Memoir", "Nonfiction", "Childrens", "Middle Grade", "Biography"], "title": "Brown Girl Dreaming", "description": ["Jacqueline Woodson, one of today's finest writers, tells the moving story of her childhood in mesmerizing verse.", "Raised in South Carolina and New York, Woodson always felt halfway home in each place. In vivid poems, she shares what it was like to grow up as an African American in the 1960s and 1970s, living with the remnants of Jim Crow and her growing awareness of the Civi", "Jacqueline Woodson, one of today's finest writers, tells the moving story of her childhood in mesmerizing verse.", "Raised in South Carolina and New York, Woodson always felt halfway home in each place. In vivid poems, she shares what it was like to grow up as an African American in the 1960s and 1970s, living with the remnants of Jim Crow and her growing awareness of the Civil Rights movement. Touching and powerful, each poem is both accessible and emotionally charged, each line a glimpse into a child’s soul as she searches for her place in the world. Woodson’s eloquent poetry also reflects the joy of finding her voice through writing stories, despite the fact that she struggled with reading as a child. Her love of stories inspired her and stayed with her, creating the first sparks of the gifted writer she was to become."], "author": "Jacqueline Woodson", "num_pages": "337", "awards": ["Newbery Medal Nominee (2015)", "National Book Award for Young People's Literature (2014)", "Sibert Medal Nominee (2015)", "Coretta Scott King Award for Author (2015)", "Boston Globe-Horn Book Award Nominee for Nonfiction (2015)", "Claudia Lewis Award for Older Readers (2015)", "Goodreads Choice Award Nominee for Middle Grade & Children's (2014)", "YALSA Award Nominee for Excellence in Nonfiction (2015)"], "places": ["South Carolina"], "character_names": [], "language": "English", "publish_date": "2014-08-28 00:00:00", "ISBN": "0399252517"},
{"url": "https://www.goodreads.com/book/show/10252827-the-way-of-thorn-and-thunder", "num_ratings": "69", "num_reviews": "15", "avg_ratings": 4.1, "genres": ["Fantasy", "Glbt", "Queer", "Lgbt", "Fiction", "Glbt", "Gay"], "title": "The Way of Thorn and Thunder", "description": ["Taking fantasy literature beyond the stereotypes, Daniel Heath Justice's acclaimed Thorn and Thunder novels are set in a world resembling eighteenth-century North America. The original trilogy is available here for the first time as a fully revised one-volume novel. The story of the struggle for the green world of the Everland, home of the forest-dwelling Kyn, is an advent", "Taking fantasy literature beyond the stereotypes, Daniel Heath Justice's acclaimed Thorn and Thunder novels are set in a world resembling eighteenth-century North America. The original trilogy is available here for the first time as a fully revised one-volume novel. The story of the struggle for the green world of the Everland, home of the forest-dwelling Kyn, is an adventure tale that bends genre and gender.", "\"Justice has created a fantasy epic so rich in history and so complex with all of its inhabitants and mystery that you're never going to want The Way of Thorn and Thunder to end. What a treasure for anyone looking for heroes and adventure in a series based on Aboriginal philosophy and wisdom.\" --Richard Van Camp, author of ", "\"The Way of Thorn and Thunder is a beautifully wrought high fantasy novel, drawing from the unique and fascinating cultures of North America's aboriginal peoples but successfully creating a world and characters that stand on their own, and are even set apart from what we usually see in high fantasy. Readers who enjoy meticulously created landscapes and cultures, as well as language that is by turns both visceral and elegant, will likely find much to love in The Way of Thorn and Thunder.\"--Karin Lowachee, author ", "\"A powerful heroic fantasy, notable for being set, not in the familiar myth-Europe of most such fantasies, but (like Liliana Bodoc's haunting Saga de los Confines) in the Old World of the Western Hemisphere, the Native American world, where the true, deep roots of magic are threatened by conquest and destruction.\"--Ursula K. Le Guin"], "author": "Daniel Heath Justice", "num_pages": "616", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-05-15 00:00:00", "ISBN": "0826350127"},
{"url": "https://www.goodreads.com/book/show/272433.Edinburgh", "num_ratings": "1,259", "num_reviews": "187", "avg_ratings": 4.16, "genres": ["Fiction", "Lgbt", "Glbt", "Queer", "Contemporary", "Novels", "Glbt", "Gay"], "title": "Edinburgh", "author": "Alexander Chee", "num_pages": "224", "awards": [], "places": ["Maine"], "character_names": [], "language": "English", "publish_date": "2002-11-09 00:00:00", "ISBN": "0312305036"},
{"url": "https://www.goodreads.com/book/show/1063142.The_Gilda_Stories", "num_ratings": "1,129", "num_reviews": "130", "avg_ratings": 3.96, "genres": ["Fantasy", "Lgbt", "Paranormal", "Vampires", "Historical", "Historical Fiction", "Horror", "Fiction"], "title": "The Gilda Stories", "description": ["The winner of two Lambda Literary Awards (fiction and science fiction) ", " is a very American odyssey. Escaping from slavery in the 1850s Gilda's longing for kinship and community grows over two hundred years. Her induction into a family of benevolent vampires takes her on an adventurous and dangerous journey full of loud laughter and subtle terror."], "author": "Jewelle L. Gómez", "num_pages": "252", "awards": ["Lambda Literary Award for Lesbian Fiction and Lesbian Science Fiction/Fantasy/Horror (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "1991-04-01 00:00:00", "ISBN": "093237994X"},
{"url": "https://www.goodreads.com/book/show/269920.Another_Country", "num_ratings": "10,768", "num_reviews": "937", "avg_ratings": 4.3, "genres": ["Fiction", "Classics", "Lgbt", "Cultural", "African American", "Glbt", "Queer"], "title": "Another Country", "description": ["Baldwin, James. Another Country. First British Edition. London, Michael Joseph, 1963. 20.5cm x 13.7cm. 415 (3) pages. Original Hardcover with original, unclipped dustjacket. In protective Mylar. Very good condition with only minor signs of external wear. Published in 1962, this is an emotionally intense novel of love, hatred, race and liberal America in the 1960s. Set in G", "Baldwin, James. Another Country. First British Edition. London, Michael Joseph, 1963. 20.5cm x 13.7cm. 415 (3) pages. Original Hardcover with original, unclipped dustjacket. In protective Mylar. Very good condition with only minor signs of external wear. Published in 1962, this is an emotionally intense novel of love, hatred, race and liberal America in the 1960s. Set in Greenwhich Village, Harlem and France, ANOTHER COUNTRY tells the story of the suicide of jazz-musician Rufus Scott and the friends who search for an understanding of his life and death, discovering uncomfortable truths about themselves along the way."], "author": "James Baldwin", "num_pages": "436", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1962-08-16 00:00:00", "ISBN": "0718100107"},
{"url": "https://www.goodreads.com/book/show/598613.The_Woman_Who_Owned_the_Shadows", "num_ratings": "125", "num_reviews": "11", "avg_ratings": 3.86, "genres": ["Fiction", "Glbt", "Queer", "Lgbt", "Race"], "title": "The Woman Who Owned the Shadows", "description": ["The first novel about a Native American woman ", " a Native American woman in fifty years, this mesmerizing work tells the story of Ephanie, a half-breed who seeks herself through her roots. \"An absorbing...fascinating world is created...not only is it an exploration of racism, it is a powerful and moving testament...\"--"], "author": "Paula Gunn Allen", "num_pages": "225", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-01-01 00:00:00", "ISBN": "1879960184"},
{"url": "https://www.goodreads.com/book/show/3964595-the-fire-next-time", "num_ratings": "28,259", "num_reviews": "2,196", "avg_ratings": 4.49, "genres": ["Nonfiction", "Writing", "Essays", "Race", "Classics", "History", "Politics"], "title": "The Fire Next Time", "description": ["A national bestseller when it first appeared in 1963, ", " galvanized the nation and gave passionate voice to the emerging civil rights movement. At once a powerful evocation of James Baldwin's early life in Harlem and a disturbing examination of the consequences of racial injustice, the book is an intensely personal and provocative document. It consists of t", "A national bestseller when it first appeared in 1963, ", " galvanized the nation and gave passionate voice to the emerging civil rights movement. At once a powerful evocation of James Baldwin's early life in Harlem and a disturbing examination of the consequences of racial injustice, the book is an intensely personal and provocative document. It consists of two \"letters,\" written on the occasion of the centennial of the Emancipation Proclamation, that exhort Americans, both black and white, to attack the terrible legacy of racism. Described by The New York Times Book Review as \"sermon, ultimatum, confession, deposition, testament, and chronicle...all presented in searing, brilliant prose,\" ", " stands as a classic of our literature."], "author": "James Baldwin", "num_pages": "141", "awards": ["National Book Award Finalist for History and Biography (1964)"], "places": [], "character_names": [], "language": "English", "publish_date": "1964-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/913351.Red_Azalea", "num_ratings": "7,493", "num_reviews": "538", "avg_ratings": 3.84, "genres": ["Cultural", "China", "Autobiography", "Memoir", "Nonfiction", "Biography", "Cultural", "Asia"], "title": "Red Azalea", "description": ["This New York Times Notable Book tells the true story of what it was like growing up in Mao's China, where the soul was secondary to the state, beauty was mistrusted, and love could be punishable by death. Newsweek calls Anchee Min's prose \"as delicate and evocative as a traditional Chinese brush painting.\""], "author": "Anchee Min", "num_pages": "306", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-01-25 00:00:00", "ISBN": "067942332X"},
{"url": "https://www.goodreads.com/book/show/1211176.The_Sailor_Who_Fell_from_Grace_with_the_Sea", "num_ratings": "12,344", "num_reviews": "922", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics", "Literature"], "title": "The Sailor Who Fell from Grace with the Sea", "description": ["Thirteen-year-old Noboru is a member of a gang of highly philosophical teenage boys who reject the tenets of the adult world -- to them, adult life is illusory, hypocritical, and sentimental. When Noboru's widowed mother is romanced by Ryuji, a sailor, Noboru is thrilled. He idolizes this rugged man of the sea as a hero. But his admiration soon turns to hatred, as Ryuji fo", "Thirteen-year-old Noboru is a member of a gang of highly philosophical teenage boys who reject the tenets of the adult world -- to them, adult life is illusory, hypocritical, and sentimental. When Noboru's widowed mother is romanced by Ryuji, a sailor, Noboru is thrilled. He idolizes this rugged man of the sea as a hero. But his admiration soon turns to hatred, as Ryuji forsakes life onboard the ship for marriage, rejecting everything Noboru holds sacred. Upset and appalled, he and his friends respond to this apparent betrayal with a terrible ferocity."], "author": "Yukio Mishima", "num_pages": "181", "awards": [], "places": ["Yokohama"], "character_names": ["Ryuji Tsukazaki", "Fusako Kuroda", "Noboru Kuroda"], "language": null, "publish_date": "1986-01-01 00:00:00", "ISBN": "0399504893"},
{"url": "https://www.goodreads.com/book/show/111389.Funny_Boy", "num_ratings": "3,996", "num_reviews": "329", "avg_ratings": 3.92, "genres": ["Fiction", "Lgbt", "Historical", "Historical Fiction", "Glbt", "Queer", "Cultural", "Canada"], "title": "Funny Boy", "description": ["In the world of his large family, affluent Tamils living in Colombo, Arjie is an oddity, a 'funny boy' who prefers dressing as a girl to playing cricket with his brother. In FUNNY BOY we follow the life of the family through Arjie's eyes, as he comes to terms both with his own homo-sexuality and with the racism of the society in which he lives. In the north of Sri Lanka th", "In the world of his large family, affluent Tamils living in Colombo, Arjie is an oddity, a 'funny boy' who prefers dressing as a girl to playing cricket with his brother. In FUNNY BOY we follow the life of the family through Arjie's eyes, as he comes to terms both with his own homo-sexuality and with the racism of the society in which he lives. In the north of Sri Lanka there is a war going on between the army and the Tamil Tigers, and gradually it begins to encroach on the family's comfortable life. Sporadic acts of violence flare into full scale riots and lead, ultimately, to tragedy. Written in clear, simple prose, Syam Selvadurai's first novel is masterly in its mingling of the personal and political."], "author": "Shyam Selvadurai", "num_pages": "320", "awards": ["Scotiabank Giller Prize Nominee (1994)", "Lambda Literary Award for Gay Men's Fiction (1997)", "Amazon.ca First Novel Award (1994)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-08-16 00:00:00", "ISBN": "015600500X"},
{"url": "https://www.goodreads.com/book/show/6472451-ash", "num_ratings": "27,424", "num_reviews": "3,025", "avg_ratings": 3.62, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Fiction"], "title": "Ash", "description": ["In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she bel", "In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she believes that her wish may be granted.", "The day that Ash meets Kaisa, the King's Huntress, her heart begins to change. Instead of chasing fairies, Ash learns to hunt with Kaisa. Though their friendship is as delicate as a new bloom, it reawakens Ash's capacity for love-and her desire to live. But Sidhean has already claimed Ash for his own, and she must make a choice between fairy tale dreams and true love.", "Entrancing, empowering, and romantic, ", " is about the connection between life and love, and solitude and death, where transformation can come from even the deepest grief."], "author": "Malinda Lo", "num_pages": "264", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2010)", "Gaylactic Spectrum Award Nominee for Best Novel (2010)", "William C. Morris YA Debut Award Nominee (2010)", "James Tiptree Jr. Award Nominee for Longlist (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Andre Norton Award Nominee (2009)"], "places": [], "character_names": ["Aisling", "Kaisa", "Sidhean"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0316040096"},
{"url": "https://www.goodreads.com/book/show/57498.The_Salt_Roads", "num_ratings": "1,340", "num_reviews": "188", "avg_ratings": 3.83, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Magical Realism", "Glbt", "Queer", "Lgbt"], "title": "The Salt Roads", "description": ["A landmark work by a brilliant young author, THE SALT ROADS transports readers across centuries and civilizations as it fearlessly explores the relationships women have with their lovers, their people, and the divine. Jeanne Duval, the ginger-colored entertainer, struggles with her lover poet Charles Baudelaire...Mer, plantation slave and doctor, both hungers for and dread", "A landmark work by a brilliant young author, THE SALT ROADS transports readers across centuries and civilizations as it fearlessly explores the relationships women have with their lovers, their people, and the divine. Jeanne Duval, the ginger-colored entertainer, struggles with her lover poet Charles Baudelaire...Mer, plantation slave and doctor, both hungers for and dreads liberation...and Thais, a dark-skinned beauty from Alexandria, is impelled to seek a glorious revelation-as Ezili, a being born of hope, unites them all. Interweaving acts of brutality with passionate unions of spirit and flesh, this is a narrative that shocks, entertains, and dazzles-from an award-winning writer who dares to redefine the art of storytelling.", "A Nebula Award nominee -- A Locus Magazine recommended book"], "author": "Nalo Hopkinson", "num_pages": "416", "awards": ["Gaylactic Spectrum Award for Best Novel (2004)", "Hurston/Wright Legacy Award Nominee for Debut Fiction (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "0446677132"},
{"url": "https://www.goodreads.com/book/show/18114449-an-unnecessary-woman", "num_ratings": "8,551", "num_reviews": "1,466", "avg_ratings": 3.81, "genres": ["Fiction", "Writing", "Books About Books", "Literary Fiction", "Cultural", "Lebanon", "Contemporary"], "title": "An Unnecessary Woman", "description": ["One of Beirut’s most celebrated voices, Rabih Alameddine follows his international bestseller, ", ", with a heartrending novel that celebrates the singular life of an obsessive introvert, revealing Beirut’s beauties and horrors along the way.", "Aaliya Sohbi lives alone in her Beirut apartment, surrounded by stockpiles of books. Godless, fatherless, divorced, and child", "One of Beirut’s most celebrated voices, Rabih Alameddine follows his international bestseller, ", ", with a heartrending novel that celebrates the singular life of an obsessive introvert, revealing Beirut’s beauties and horrors along the way.", "Aaliya Sohbi lives alone in her Beirut apartment, surrounded by stockpiles of books. Godless, fatherless, divorced, and childless, Aaliya is her family’s \"unnecessary appendage.” Every year, she translates a new favorite book into Arabic, then stows it away. The thirty-seven books that Aaliya has translated have never been read—by anyone. After overhearing her neighbors, \"the three witches,” discussing her too-white hair, Aaliya accidentally dyes her hair too blue.", "In this breathtaking portrait of a reclusive woman’s late-life crisis, readers follow Aaliya’s digressive mind as it ricochets across visions of past and present Beirut. Insightful musings on literature, philosophy, and art are invaded by memories of the Lebanese Civil War and Aaliya’s volatile past. As she tries to overcome her aging body and spontaneous emotional upwellings, Aaliya is faced with an unthinkable disaster that threatens to shatter the little life she has left.", "A love letter to literature and its power to define who we are, the gifted Rabih Alameddine has given us a nuanced rendering of a single woman's reclusive life in the Middle East."], "author": "Rabih Alameddine", "num_pages": "291", "awards": ["California Book Award for Fiction (Gold) (2014)", "Prix Femina for Étranger (2016)", "Arab American Book Award for Fiction (2015)", "PEN Open Book Award Nominee for Shortlist (2015)", "National Book Critics Circle Award Nominee for Fiction (2014)", "National Book Award Finalist for Fiction (2014)"], "places": ["Beirut"], "character_names": [], "language": "English", "publish_date": "2014-02-04 00:00:00", "ISBN": "0802122140"},
{"url": "https://www.goodreads.com/book/show/20447732-a-cup-of-water-under-my-bed", "num_ratings": "922", "num_reviews": "135", "avg_ratings": 4.09, "genres": ["Autobiography", "Memoir", "Nonfiction", "Feminism", "Glbt", "Queer", "Lgbt"], "title": "A Cup of Water Under My Bed: A Memoir", "description": ["  ", "In this lyrical, coming-of-age memoir, Daisy Hernández chronicles what the women in her Cuban-Colombian family taught her about love, money, and race. Her mother warns her about ", "and men who seduce you with pastries, while one tía bemoans that her niece is turni", "  ", "In this lyrical, coming-of-age memoir, Daisy Hernández chronicles what the women in her Cuban-Colombian family taught her about love, money, and race. Her mother warns her about ", "and men who seduce you with pastries, while one tía bemoans that her niece is turning out to be “", "” instead of an American. Another auntie instructs that when two people are close, they are bound to become like ", ", fingernails and dirt, and that no, Daisy’s father is not godless. He’s simply praying to a candy dish that can be traced back to Africa. ", " These lessons—rooted in women’s experiences of migration, colonization, ", "—define in evocative detail what it means to grow up female in an immigrant home. In one story, Daisy sets out to defy the dictates of race and class that preoccupy her mother and tías, but dating women and transmen, and coming to identify as bisexual, leads her to unexpected questions. In another piece, NAFTA shuts local factories in her hometown on the outskirts of New York City, and she begins translating unemployment forms for her parents, moving between English and Spanish, as well as private and collective fears. In prose that is both memoir and commentary, Daisy reflects on reporting for the ", "as the paper is rocked by the biggest plagiarism scandal in its history and plunged into debates about the role of race in the newsroom.", " A heartfelt exploration of family, identity, and language, ", " is ultimately a daughter’s story of finding herself and her community, and of creating a new, queer life."], "author": "Daisy Hernandez", "num_pages": "185", "awards": ["Judy Grahn Award Nominee (2015)", "Bisexual Book Award for Memoir/Biography (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-09 00:00:00", "ISBN": "0807014486"},
{"url": "https://www.goodreads.com/book/show/50680.The_Collected_Poems", "num_ratings": "2,180", "num_reviews": "55", "avg_ratings": 4.35, "genres": ["Poetry", "Feminism", "Lgbt", "Glbt", "Queer", "Race"], "title": "The Collected Poems", "description": ["Collected here for the first time are more than three hundred poems from one of this country's major and most influential poets, representing the complete oeuvre of Audre Lorde's poetry. Lorde published nine volumes of poetry which, in her words, detail \"a linguistic and emotional tour through the conflicts, fears, and hopes of the world I have inhabited.\" Included here ar", "Collected here for the first time are more than three hundred poems from one of this country's major and most influential poets, representing the complete oeuvre of Audre Lorde's poetry. Lorde published nine volumes of poetry which, in her words, detail \"a linguistic and emotional tour through the conflicts, fears, and hopes of the world I have inhabited.\" Included here are Lorde's early, previously unavailable works: The First Cities, The New York Head Shop and Museum, Cables to Rage, and From a Land Where Other People Live."], "author": "Audre Lorde", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-02-17 00:00:00", "ISBN": "0393319725"},
{"url": "https://www.goodreads.com/book/show/23223155-queer-and-trans-artists-of-color", "num_ratings": "165", "num_reviews": "30", "avg_ratings": 4.47, "genres": ["Nonfiction", "Glbt", "Queer", "Lgbt", "Art", "Lgbt", "Transgender"], "title": "Queer and Trans Artists of Color: Stories of Some of Our Lives", "description": ["A collection of sixteen unique and honest conversations you won't read anywhere else... Mixed-race queer art activist Nia King left a full-time job in an effort to center her life around making art. Grappling with questions of purpose, survival, and compromise, she started a podcast called We Want the Airwaves in order to pick the brains of fellow queer and trans artists o", "A collection of sixteen unique and honest conversations you won't read anywhere else... Mixed-race queer art activist Nia King left a full-time job in an effort to center her life around making art. Grappling with questions of purpose, survival, and compromise, she started a podcast called We Want the Airwaves in order to pick the brains of fellow queer and trans artists of color about their work, their lives, and \"making it\" - both in terms of success and in terms of survival.", "In this collection of interviews, Nia discusses fat burlesque with Magnoliah Black, queer fashion with Kiam Marcelo Junio, interning at Playboy with Janet Mock, dating gay Latino Republicans with Julio Salgado, intellectual hazing with Kortney Ryan Ziegler, gay gentrification with Van Binfa, getting a book deal with Virgie Tovar, the politics of black drag with Micia Mosely, evading deportation with Yosimar Reyes, weird science with Ryka Aoki, gay public sex in Africa with Nick Mwaluko, thin privilege with Fabian Romero, the tyranny of \"self-care\" with Lovemme Corazon, \"selling out\" with Miss Persia and Daddie$ Pla$tik, the self-employed art activist hustle with Leah Lakshmi Piepzna-Samarsinha, and much, much more. Welcome to the future of QPOC art activism."], "author": "Nia King", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-05 00:00:00", "ISBN": "1492215643"},
{"url": "https://www.goodreads.com/book/show/1851593.The_Bone_People", "num_ratings": "17,513", "num_reviews": "1,510", "avg_ratings": 4.06, "genres": ["Fiction", "Magical Realism"], "title": "The Bone People", "description": ["Integrating both Maori myth and New Zealand reality, ", " became the most successful novel in New Zealand publishing history when it appeared in 1984. Set on the South Island beaches of New Zealand, a harsh environment, the novel chronicles the complicated relationships between three emotional outcasts of mixed European and Maori heritage. Kerewin Holmes is a pa", "Integrating both Maori myth and New Zealand reality, ", " became the most successful novel in New Zealand publishing history when it appeared in 1984. Set on the South Island beaches of New Zealand, a harsh environment, the novel chronicles the complicated relationships between three emotional outcasts of mixed European and Maori heritage. Kerewin Holmes is a painter and a loner, convinced that \"to care for anything is to invite disaster.\" Her isolation is disrupted one day when a six-year-old mute boy, Simon, breaks into her house. The sole survivor of a mysterious shipwreck, Simon has been adopted by a widower Maori factory worker, Joe Gillayley, who is both tender and horribly brutal toward the boy. Through shifting points of view, the novel reveals each character's thoughts and feelings as they struggle with the desire to connect and the fear of attachment. "], "author": "Keri Hulme", "num_pages": "450", "awards": ["Man Booker Prize (1985)", "Pegasus Prize for Literature (1985)", "Ockham New Zealand Book Awards for Fiction (NZ Book Awards) (1984)"], "places": ["New Zealand"], "character_names": ["Joe Gillayley", "Kerewin Holmes", "Simon Holt"], "language": "English", "publish_date": "1985-10-01 00:00:00", "ISBN": "0807112844"},
{"url": "https://www.goodreads.com/book/show/17302571-if-you-could-be-mine", "num_ratings": "6,680", "num_reviews": "1,021", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Romance", "Fiction", "Contemporary", "Glbt", "Queer"], "title": "If You Could Be Mine", "description": ["Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged f", "Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged for her marriage. Nasrin tries to persuade Sahar that they can go on as they have been, only now with new comforts provided by the decent, well-to-do doctor Nasrin will marry. But Sahar dreams of loving Nasrin exclusively—and openly.", "Then Sahar discovers what seems like the perfect solution. In Iran, homosexuality may be a crime, but to be a man trapped in a woman’s body is seen as nature’s mistake, and sex reassignment is legal and accessible. As a man, Sahar could be the one to marry Nasrin. Sahar will never be able to love the one she wants, in the body she wants to be loved in, without risking her life. Is saving her love worth sacrificing her true self?"], "author": "Sara Farizan", "num_pages": "256", "awards": ["Edmund White Award for Debut Fiction (2014)", "Ferro-Grumley Award for LGBT Fiction (2014)", "Lambda Literary Award for Debut Lesbian Fiction (2014)", "Lincoln Award Nominee (2016)"], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "1616202513"},
{"url": "https://www.goodreads.com/book/show/62794.Confessions_of_a_Mask", "num_ratings": "10,452", "num_reviews": "637", "avg_ratings": 3.91, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Lgbt", "Classics"], "title": "Confessions of a Mask", "description": [" is the story of an adolescent who must learn to live with the painful fact that he is unlike other young men. Mishima's protagonist discovers that he is becoming a homosexual in polite, post-war Japan. To survive, he must live behind a mask of propriety.", "Christopher Isherwood comments—\"One might say, 'Here is a Japanese Gide,'....But no, Mishima is him", " is the story of an adolescent who must learn to live with the painful fact that he is unlike other young men. Mishima's protagonist discovers that he is becoming a homosexual in polite, post-war Japan. To survive, he must live behind a mask of propriety.", "Christopher Isherwood comments—\"One might say, 'Here is a Japanese Gide,'....But no, Mishima is himself—a very Japanese Mishima; lucid in the midst of emotional confusion, funny in the midst of despair, quite without pomposity, sentimentality or self-pity. His book, like no other, has made me understand a little of how it feels to be Japanese. I think it is greatly superior, as art and as a human document to his deservedly praised novel, ", ".\""], "author": "Yukio Mishima", "num_pages": "224", "awards": [], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "1998-10-27 00:00:00", "ISBN": "0720610311"},
{"url": "https://www.goodreads.com/book/show/18280706-redefining-realness", "num_ratings": "7,918", "num_reviews": "887", "avg_ratings": 4.32, "genres": ["Nonfiction", "Autobiography", "Memoir", "Feminism", "Lgbt", "Glbt", "Queer"], "title": "Redefining Realness: My Path to Womanhood, Identity, Love  So Much More", "description": ["In a landmark book, an extraordinary young woman recounts her coming-of-age as a transgender teen—a deeply personal and empowering portrait of self-revelation, adversity, and heroism.In 2011, ", " magazine published a profile of Janet Mock in which she publicly stepped forward for the first time as a trans woman. Since then, Mock has gone from covering the red carp", "In a landmark book, an extraordinary young woman recounts her coming-of-age as a transgender teen—a deeply personal and empowering portrait of self-revelation, adversity, and heroism.In 2011, ", " magazine published a profile of Janet Mock in which she publicly stepped forward for the first time as a trans woman. Since then, Mock has gone from covering the red carpet for People.com to advocating for all those who live within the shadows of society. ", " offers a bold new perspective on being young,", "multiracial, economically challenged, and transgender in America.", "Welcomed into the world as her parents’ firstborn son, Mock set out early on to be her own person—no simple feat for a young person like herself. She struggled as the smart, determined child in a deeply loving, yet ill-equipped family that lacked money, education, and resources. Mock had to navigate her way through her teen years without parental guidance but luckily with a few close friends and mentors she overcame extremely daunting hurdles.", "This powerful memoir follows Mock’s quest for identity, from her early gender conviction to a turbulent adolescence in Honolulu that found her transitioning through the halls of her school, self-medicating with hormones at fifteen, and flying across the world for sex reassignment surgery at just eighteen. Ever resilient, Mock emerged with a scholarship to college and moved to New York City, where she earned her masters degree, basked in the success of an enviable career, and told no one about her past.", "It wasn’t until Mock fell for a man who called her the woman of his dreams that she felt ready to finally tell her story, becoming a fierce advocate for girls like herself. A profound statement of affirmation from a courageous woman, ", " shows as never before what it means to be a woman today and how to be yourself when you don’t fit the mold created for you."], "author": "Janet Mock", "num_pages": "288", "awards": ["Goodreads Choice Award Nominee for Memoir & Autobiography (2014)"], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-04 00:00:00", "ISBN": "1476709149"},
{"url": "https://www.goodreads.com/book/show/17571752-aristotle-and-dante-discover-the-secrets-of-the-universe", "num_ratings": "159,084", "num_reviews": "23,967", "avg_ratings": 4.35, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "Aristotle and Dante Discover the Secrets of the Universe", "description": ["A lyrical novel about family and friendship from critically acclaimed author Benjamin Alire Sáenz.", "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they shar", "A lyrical novel about family and friendship from critically acclaimed author Benjamin Alire Sáenz.", "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be."], "author": "Benjamin Alire Sáenz", "num_pages": "8", "awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2013)", "Michael L. Printz Award Nominee (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2015)", "Lambda Literary Award for LGBT Children's/Young Adult (2013)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2015)", "Amelia Elizabeth Walden Award Nominee (2013)", "Lincoln Award Nominee (2016)", "Pura Belpré Award for Narrative (2013)", "Les Incorruptibles (2017)"], "places": ["El Paso, Texas", "Texas"], "character_names": ["Aristotle \"Ari\" Mendoza", "Dante Quintana"], "language": "English", "publish_date": "2013-04-09 00:00:00", "ISBN": "1442366419"},
{"url": "https://www.goodreads.com/book/show/17143.Go_Tell_It_on_the_Mountain", "num_ratings": "34,835", "num_reviews": "1,784", "avg_ratings": 4.01, "genres": ["Fiction", "Cultural", "African American", "Classics", "Religion", "Novels"], "title": "Go Tell It on the Mountain", "description": [", first published in 1953, is Baldwin's first major work, a semi-autobiographical novel that has established itself as an American classic. With lyrical precision, psychological directness, resonating symbolic power, and a rage that is at once unrelenting and compassionate, Baldwin chronicles a fourteen-year-old boy's discovery of the terms of his", ", first published in 1953, is Baldwin's first major work, a semi-autobiographical novel that has established itself as an American classic. With lyrical precision, psychological directness, resonating symbolic power, and a rage that is at once unrelenting and compassionate, Baldwin chronicles a fourteen-year-old boy's discovery of the terms of his identity as the stepson of the minister of a storefront Pentecostal church in Harlem one Saturday in March of 1935. Baldwin's rendering of his protagonist's spiritual, sexual, and moral struggle of self-invention opened new possibilities in the American language and in the way Americans understand themselves."], "author": "James Baldwin", "num_pages": "256", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2001-08-16 00:00:00", "ISBN": "0141185910"},
{"url": "https://www.goodreads.com/book/show/32951.Sister_Outsider", "num_ratings": "11,041", "num_reviews": "528", "avg_ratings": 4.48, "genres": ["Feminism", "Nonfiction", "Writing", "Essays", "Race", "Glbt", "Queer"], "title": "Sister Outsider: Essays and Speeches", "description": ["A collection of fifteen essays written between 1976 and 1984 gives clear voice to Audre Lorde's literary and philosophical personae. These essays explore and illuminate the roots of Lorde's intellectual development and her deep-seated and longstanding concerns about ways of increasing empowerment among minority women writers and the absolute necessity to explicate the conc", "A collection of fifteen essays written between 1976 and 1984 gives clear voice to Audre Lorde's literary and philosophical personae. These essays explore and illuminate the roots of Lorde's intellectual development and her deep-seated and longstanding concerns about ways of increasing empowerment among minority women writers and the absolute necessity to explicate the concept of difference—difference according to sex, race, and economic status. The title Sister Outsider finds its source in her poetry collection The Black Unicorn (1978). These poems and the essays in Sister Outsider stress Lorde's oft-stated theme of continuity, particularly of the geographical and intellectual link between Dahomey, Africa, and her emerging self."], "author": "Audre Lorde", "num_pages": "190", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-06-01 00:00:00", "ISBN": "0895941414"},
{"url": "https://www.goodreads.com/book/show/38462.Giovanni_s_Room", "num_ratings": "36,903", "num_reviews": "2,928", "avg_ratings": 4.22, "genres": ["Fiction", "Classics", "Lgbt", "Glbt", "Queer", "Novels", "Glbt", "Gay"], "title": "Giovanni's Room", "description": ["An alternate cover for this ISBN can be found ", ".", "Baldwin's haunting and controversial second novel is his most sustained treatment of sexuality, and a classic of gay literature. In a 1950s Paris swarming with expatriates and characterized by dangerous liaisons and hidden violence, an American finds himself unable to repress his impulses, despite his determination to live", "An alternate cover for this ISBN can be found ", ".", "Baldwin's haunting and controversial second novel is his most sustained treatment of sexuality, and a classic of gay literature. In a 1950s Paris swarming with expatriates and characterized by dangerous liaisons and hidden violence, an American finds himself unable to repress his impulses, despite his determination to live the conventional life he envisions for himself. After meeting and proposing to a young woman, he falls into a lengthy affair with an Italian bartender and is confounded and tortured by his sexual identity as he oscillates between the two. ", "Examining the mystery of love and passion in an intensely imagined narrative, Baldwin creates a moving and complex story of death and desire that is revelatory in its insight."], "author": "James Baldwin", "num_pages": "159", "awards": [], "places": ["Paris"], "character_names": [], "language": "English", "publish_date": "2000-06-16 00:00:00", "ISBN": "0141186356"},
{"url": "https://www.goodreads.com/book/show/395220.Zami", "num_ratings": "10,752", "num_reviews": "464", "avg_ratings": 4.23, "genres": ["Feminism", "Autobiography", "Memoir", "Nonfiction", "Glbt", "Queer", "Lgbt"], "title": "Zami: A New Spelling of My Name", "description": ["ZAMI is a fast-moving chronicle. From the author's vivid childhood memories in Harlem to her coming of age in the late 1950s, the nature of Audre Lorde's work is cyclical. It especially relates the linkage of women who have shaped her . . . Lorde brings into play her craft of lush description and characterization. It keeps unfolding page after page.", "--"], "author": "Audre Lorde", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1982-01-01 00:00:00", "ISBN": "0895941228"}
]