[
{"url": "https://www.goodreads.com/book/show/41955.Ride_on_Rapunzel", "num_ratings": "30", "num_reviews": "8", "avg_ratings": 4.33, "genres": ["Fantasy", "Fairy Tales", "Fantasy", "Fiction", "Short Stories"], "title": "Ride on Rapunzel: Fairytales for Feminists", "description": ["A collection of the very best of feminist fairytales including such authors as Maeve Binchey, Zoe Fairbairns, Ivy Bannister, Mary Dorcey, Leland Bardwell and Mairide Woods amongst others."], "author": "Maeve Binchy", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-12-01 00:00:00", "ISBN": "1855940515"},
{"url": "https://www.goodreads.com/book/show/52778.The_Woman_Who_Walked_Into_Doors", "num_ratings": "8,014", "num_reviews": "538", "avg_ratings": 3.83, "genres": ["Fiction", "Cultural", "Ireland", "European Literature", "Irish Literature", "Contemporary", "Literary Fiction", "Novels", "Sociology", "Abuse", "Literature", "Academic", "School", "Literature", "20th Century"], "title": "The Woman Who Walked Into Doors", "description": ["Paula Spencer is a thirty-nine-year-old working-class woman struggling to reclaim her dignity after marriage to an abusive husband and a worsening drinking problem. Paula recalls her contented childhood, the audacity she learned as a teenager, the exhilaration of her romance with Charlo, and the marriage to him that left her feeling powerless. Capturing both her vulnerabil", "Paula Spencer is a thirty-nine-year-old working-class woman struggling to reclaim her dignity after marriage to an abusive husband and a worsening drinking problem. Paula recalls her contented childhood, the audacity she learned as a teenager, the exhilaration of her romance with Charlo, and the marriage to him that left her feeling powerless. Capturing both her vulnerability and her strength, Roddy Doyle gives Paula a voice that is real and unforgettable."], "author": "Roddy Doyle", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-01 00:00:00", "ISBN": "0140255125"},
{"url": "https://www.goodreads.com/book/show/17404760-one-step-too-far", "num_ratings": "7,908", "num_reviews": "1,289", "avg_ratings": 3.53, "genres": ["Mystery", "Thriller", "Suspense", "Contemporary"], "title": "One Step Too Far", "description": ["Een gelukkig huwelijk. Een gezin. Een fijn huis. Waarom loopt Emily Coleman op een ochtend zonder om te kijken weg van dit alles – om onder een andere naam helemaal opnieuw te beginnen? Emily heet nu Cat en ze werkt in Londen bij een reclamebureau. Ze deelt een huis met een nieuwe vriendin, Angel. Cat heeft elk spoor naar haar oude leven zo goed gewist dat niemand haar wee", "Een gelukkig huwelijk. Een gezin. Een fijn huis. Waarom loopt Emily Coleman op een ochtend zonder om te kijken weg van dit alles – om onder een andere naam helemaal opnieuw te beginnen? Emily heet nu Cat en ze werkt in Londen bij een reclamebureau. Ze deelt een huis met een nieuwe vriendin, Angel. Cat heeft elk spoor naar haar oude leven zo goed gewist dat niemand haar weet te vinden. Maar ze kan het verleden – en haar herinneringen – niet volledig begraven. Dan komt het moment dat Cat onder ogen moet zien wat ze heeft gedaan: een schokkende onthulling die haar uiteindelijk over de rand duwt…"], "author": "Tina Seskis", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-15 00:00:00", "ISBN": "0957544324"},
{"url": "https://www.goodreads.com/book/show/1554537.Glass_Room", "num_ratings": "50", "num_reviews": "4", "avg_ratings": 2.96, "genres": ["Fiction", "Did Not Finish"], "title": "Glass Room", "description": ["On the morning of her 37th birthday, Louisa Maguire decides that there has to be more to her existence than a routine that is frantic but familiar. She needs to live, and she needs to love. Her decision to change her life takes Louisa in many extraordinary directions."], "author": "Kate Holmquist", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2007-07-24 00:00:00", "ISBN": "1844880036"},
{"url": "https://www.goodreads.com/book/show/3328537-the-pirate-s-daughter", "num_ratings": "2,323", "num_reviews": "294", "avg_ratings": 3.48, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance"], "title": "The Pirate's Daughter", "description": ["A multi-generational story based around the extraordinary true story of Errol Flynn's arrival in 1940s Jamaica. The Pirate's Daughter follows Ida, a young girl who falls for Flynn's legendary charms. Through the eyes of Ida and her daughter, May, it also tells the story of their home, Jamaica before and after independence."], "author": "Margaret Cezair-Thompson", "num_pages": "503", "awards": ["Essence Literary Award for Fiction"], "places": ["Jamaica"], "character_names": [], "language": "English", "publish_date": "2008-06-12 00:00:00", "ISBN": "075534359X"},
{"url": "https://www.goodreads.com/book/show/2520823.Chapter_Hearse", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 3.5, "genres": [], "title": "Chapter & Hearse", "author": "Anne Schulman", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-01 00:00:00", "ISBN": "1853717800"},
{"url": "https://www.goodreads.com/book/show/16339646-to-iraq-and-back", "num_ratings": "208", "num_reviews": "43", "avg_ratings": 3.66, "genres": ["Nonfiction", "War", "Military Fiction", "Autobiography", "Memoir", "Biography"], "title": "To Iraq And Back", "description": ["My name is Jessica Scott. I am a soldier. I am a wife. I am a mother. This is my story. There are many like it but this one is mine. ", "In 2009, Army second lieutenant Jessica Scott deployed to Iraq as part of Operation Iraqi Freedom and Operation New Dawn. It was a year of many firsts. ", "This is the first person journey through a combat tour in Iraq, through being a woman in t", "My name is Jessica Scott. I am a soldier. I am a wife. I am a mother. This is my story. There are many like it but this one is mine. ", "In 2009, Army second lieutenant Jessica Scott deployed to Iraq as part of Operation Iraqi Freedom and Operation New Dawn. It was a year of many firsts. ", "This is the first person journey through a combat tour in Iraq, through being a woman in the army and learning to be an officer in the unforgiving environment of a brigade combat team. ", "This is the journey of a writer, learning to find her voice. This is the journey of a mother, confronting the emotions of leaving her children. This is the story of an inexperienced lieutenant, growing into a leader. This is the journey as it happened, without commentary.", "This is her blog. There are many blogs from the Iraq war, but this one is hers.", "364 KB"], "author": "Jessica Scott", "num_pages": "299", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-10 00:00:00", "ISBN": "1481122363"},
{"url": "https://www.goodreads.com/book/show/18754469-encounters", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 2.5, "genres": [], "title": "Encounters", "description": ["Fiction about a woman who decides to run a service for people to meet each other and dine. She pays great attention to detail."], "author": "Anne Schulman", "num_pages": "52", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-05-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/41967.Evening_Class", "num_ratings": "36,559", "num_reviews": "954", "avg_ratings": 3.99, "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Romance", "Cultural", "Ireland"], "title": "Evening Class", "description": ["Among the many evening classes starting all over Dublin is an 'Introduction to Italian'. On the surface it could be just one of hundreds in which some students will succeed and some will fall along the way. the hopes and dreams of so many people are tied up in the twice weekly lessons. they are ready to set off on the promised trip to Italy at the end of the year, everyone", "Among the many evening classes starting all over Dublin is an 'Introduction to Italian'. On the surface it could be just one of hundreds in which some students will succeed and some will fall along the way. the hopes and dreams of so many people are tied up in the twice weekly lessons. they are ready to set off on the promised trip to Italy at the end of the year, everyone's destiny has changed utterly."], "author": "Maeve Binchy", "num_pages": "528", "awards": [], "places": ["Dublin"], "character_names": [], "language": "English", "publish_date": "2005-06-30 00:00:00", "ISBN": "0752876821"},
{"url": "https://www.goodreads.com/book/show/9302.The_Other_Side_of_the_Story", "num_ratings": "36,992", "num_reviews": "952", "avg_ratings": 3.78, "genres": ["Womens Fiction", "Chick Lit", "Fiction", "Romance"], "title": "The Other Side of the Story", "description": ["Jojo Harvey is a dead ringer for Jessica Rabbit and the most ferocious literary agent in town. A former NYPD cop, she now lives in London making million-dollar book deals while trying to make partner at her firm . . . all the while sleeping with the boss man.", "Lily Wright is an author who believes in karma, and is waiting for the sky to fall after stealing her former best fr", "Jojo Harvey is a dead ringer for Jessica Rabbit and the most ferocious literary agent in town. A former NYPD cop, she now lives in London making million-dollar book deals while trying to make partner at her firm . . . all the while sleeping with the boss man.", "Lily Wright is an author who believes in karma, and is waiting for the sky to fall after stealing her former best friend's man. Though her first book failed to sell, her life turns upside down when her most recent book becomes a huge bestseller.", "Gemma Hogan is an event designer extraordinaire, but her personal life is nonexistent after losing the love of her life and her best friend in one fell swoop. To make matters worse, her father has just left her mother. While taking care of her mother, she e-mails a close colleague about her frustrations, who in turn forwards the hilarious e-mails to a famous literary agent named Jojo Harvey, who just happens to represent her former friend, now enemy, Lily Wright. . . .", "Written in the charming and chatty voice that has become Marian Keyes's signature style, this hilarious and heartwarming novel proves there are three sides to every story . . . especially in the world of publishing!"], "author": "Marian Keyes", "num_pages": "528", "awards": [], "places": ["London, England"], "character_names": ["Lily Wright", "Jojo Harvey", "Gemma Hogan"], "language": "English", "publish_date": "2008-02-05 00:00:00", "ISBN": "0060731486"},
{"url": "https://www.goodreads.com/book/show/41962.Light_a_Penny_Candle", "num_ratings": "15,523", "num_reviews": "654", "avg_ratings": 3.89, "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Cultural", "Ireland", "Romance", "Historical", "Historical Fiction"], "title": "Light a Penny Candle", "description": ["Evacuated from Blitz-battered London, shy and genteel Elizabeth White is sent to stay with the boisterous O'Connors in Kilgarret, Ireland. It is the beginning of an unshakeable bond between Elizabeth and Aisling O'Connor, a friendship which will endure through twenty turbulent years of change and chaos, joy and sorrow, soaring dreams and searing betrayals...", "Writing with wa", "Evacuated from Blitz-battered London, shy and genteel Elizabeth White is sent to stay with the boisterous O'Connors in Kilgarret, Ireland. It is the beginning of an unshakeable bond between Elizabeth and Aisling O'Connor, a friendship which will endure through twenty turbulent years of change and chaos, joy and sorrow, soaring dreams and searing betrayals...", "Writing with warmth, wit and great compassion, Maeve Binchy tells a magnificent story of the lives and loves of two women, bound together in a friendship that nothing could tear asunder - not even the man who threatened to come between them forever."], "author": "Maeve Binchy", "num_pages": "832", "awards": [], "places": ["Ireland"], "character_names": [], "language": "English", "publish_date": "2006-05-04 00:00:00", "ISBN": "009949857X"},
{"url": "https://www.goodreads.com/book/show/290890.Love_Like_Hate_Adore", "num_ratings": "69", "num_reviews": "8", "avg_ratings": 3.42, "genres": ["Fiction", "Cultural", "Ireland"], "title": "Love Like Hate Adore", "description": ["From the author of SKY and FRANCEY, a novel which charts what happens when someone who is known and trusted is accused of rape."], "author": "Deirdre Purcell", "num_pages": "384", "awards": ["Orange Prize Nominee for Fiction Shortlist (1998)"], "places": [], "character_names": [], "language": null, "publish_date": "2003-08-22 00:00:00", "ISBN": "0333637046"},
{"url": "https://www.goodreads.com/book/show/34303.Firefly_Summer", "num_ratings": "11,932", "num_reviews": "363", "avg_ratings": 3.89, "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Cultural", "Ireland", "Romance"], "title": "Firefly Summer", "description": ["Kate and John Ryan have four children, of whom the eldest are Michael and Dara. Their small town is peaceful and friendly, an unchanging background for a golden childhood. In long, hot summers Michael and Dara and their friends fish and swim or play in the ivy-clad ruins of Fernscourt, the great house burned down during the Troubles...", "No one in Mountfern has the slightest", "Kate and John Ryan have four children, of whom the eldest are Michael and Dara. Their small town is peaceful and friendly, an unchanging background for a golden childhood. In long, hot summers Michael and Dara and their friends fish and swim or play in the ivy-clad ruins of Fernscourt, the great house burned down during the Troubles...", "No one in Mountfern has the slightest inkling of what it will mean when the ruins are bought by Patrick O'Neill, an Irish American with a dream in his heart and a great deal of money in his pocket. It is not until the very end of this drama, with its interlocking stories of love lost and won, ambitions nurtured and secrets betrayed, that Patrick O'Neill will understand the irony and the significance of his great dream for Mountfern."], "author": "Maeve Binchy", "num_pages": "928", "awards": [], "places": ["Mountfern"], "character_names": ["Kate Ryan", "John Ryan", "Patrick O'Neill", "Fergus Slattery"], "language": "English", "publish_date": "2006-08-03 00:00:00", "ISBN": "0099498669"},
{"url": "https://www.goodreads.com/book/show/17240425-the-mummyfesto", "num_ratings": "273", "num_reviews": "48", "avg_ratings": 3.95, "genres": ["Womens Fiction", "Chick Lit", "Fiction"], "title": "The Mummyfesto", "description": ["When Sam, Jackie and Anna successfully campaign to save their children's school lollipop lady, they are asked by a TV reporter if they fancy standing in the general election. ", "It is, of course, a crazy idea: Sam's youngest son has an incurable disease, Jackie is desperate for another child and her mum is struggling with Alzheimers, Anna's teenagers - and marriage - are in d", "When Sam, Jackie and Anna successfully campaign to save their children's school lollipop lady, they are asked by a TV reporter if they fancy standing in the general election. ", "It is, of course, a crazy idea: Sam's youngest son has an incurable disease, Jackie is desperate for another child and her mum is struggling with Alzheimers, Anna's teenagers - and marriage - are in danger of going off the rails. ", "But sometimes the craziest ideas turn out to be the best. And just think what they could do if they got to run the country..."], "author": "Linda Green", "num_pages": "457", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-14 00:00:00", "ISBN": "1780875223"},
{"url": "https://www.goodreads.com/book/show/10378606-the-color-of-heaven", "num_ratings": "11,518", "num_reviews": "1,143", "avg_ratings": 4.01, "genres": ["Romance", "Fiction", "Contemporary"], "title": "The Color of Heaven", "description": ["A deeply emotional tale about Sophie Duncan, a successful columnist whose world falls apart after her daughter’s unexpected illness and her husband’s shocking affair. When it seems nothing else could possibly go wrong, her car skids off an icy road and plunges into a frozen lake. There, in the cold dark depths of the water, a profound and extraordinary experience unlocks t", "A deeply emotional tale about Sophie Duncan, a successful columnist whose world falls apart after her daughter’s unexpected illness and her husband’s shocking affair. When it seems nothing else could possibly go wrong, her car skids off an icy road and plunges into a frozen lake. There, in the cold dark depths of the water, a profound and extraordinary experience unlocks the surprising secrets from Sophie’s past, and teaches her what it means to truly live...and love."], "author": "Julianne MacLean", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1235784.Three_Women_of_Liverpool", "num_ratings": "259", "num_reviews": "19", "avg_ratings": 3.97, "genres": ["Historical", "Historical Fiction", "Fiction", "War", "World War II", "European Literature", "British Literature"], "title": "Three Women of Liverpool", "description": ["Liverpool, May 1941. The worst week of the Blitz. Helen Forrester produces another moving novel set on Merseyside. An extraordinary story of three brave women, each trying in her own way to deal with the brutal tide of destruction brought on by the air raids of the Second World War. There is Ellen - whose home is destroyed by bombs; Gwen, whose family absorbs all her time", "Liverpool, May 1941. The worst week of the Blitz. Helen Forrester produces another moving novel set on Merseyside. An extraordinary story of three brave women, each trying in her own way to deal with the brutal tide of destruction brought on by the air raids of the Second World War. There is Ellen - whose home is destroyed by bombs; Gwen, whose family absorbs all her time and energy; and Emmie, whose only fears are for the safety of her merchant seaman fiance, far away in the South Atlantic. None of them were prepared for what would follow, when the air raid siren sounded for the first time on 1 May, 1941..."], "author": "Helen Forrester", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-07-04 00:00:00", "ISBN": "0006170110"},
{"url": "https://www.goodreads.com/book/show/16115462-love-rehab", "num_ratings": "342", "num_reviews": "111", "avg_ratings": 3.31, "genres": ["Womens Fiction", "Chick Lit", "Romance", "Fiction", "Contemporary"], "title": "Love Rehab: A Novel in Twelve Steps", "description": ["Cyber-stalking, drive-bys, drunken text messaging, creating fake email accounts—you’re gonna have to face it, you’re addicted to love.", " ", "Sophie isn’t dealing with her breakup well. Dumped by her boyfriend, Eric, for his sexting, D-cupped, you", "Cyber-stalking, drive-bys, drunken text messaging, creating fake email accounts—you’re gonna have to face it, you’re addicted to love.", " ", "Sophie isn’t dealing with her breakup well. Dumped by her boyfriend, Eric, for his sexting, D-cupped, young Floozy McSecretary, Sophie leaves Manhattan and lands back in her hometown, crushed and pajama-clad, blaming herself and begging her ex for a second chance. ", " ", "But when her best friend, Annie, gets in trouble for driving drunk and is forced to go to an Alcoholics Anonymous meeting, something clicks in Sophie’s strung-out mind. Women need love rehab, she realizes, to help fix the craziness that comes along with falling for someone.", " ", "If you start it, they will come. When she opens up her home to the obsessed and lovelorn, Sophie finds a way to help women out there who have overdosed on the wrong men—and she saves herself in the process.", " ", "Love is a drug and the only things that can save us are the steps, rules, and one another. Step one: Admit you have a problem, and keep the hell away from Facebook."], "author": "Jo Piazza", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-04 00:00:00", "ISBN": "1453295070"},
{"url": "https://www.goodreads.com/book/show/133445.The_Edible_Woman", "num_ratings": "25,314", "num_reviews": "1,383", "avg_ratings": 3.67, "genres": ["Fiction", "Cultural", "Canada", "Feminism", "Classics"], "title": "The Edible Woman", "description": ["Marian is determined to be ordinary. She lays her head gently on the shoulder of her serious fiancé and quietly awaits marriage. But she didn't count on an inner rebellion that would rock her stable routine, and her digestion. Marriage a la mode, Marian discovers, is something she literally can't stomach... The Edible Woman is a funny, engaging novel about emotional cannib", "Marian is determined to be ordinary. She lays her head gently on the shoulder of her serious fiancé and quietly awaits marriage. But she didn't count on an inner rebellion that would rock her stable routine, and her digestion. Marriage a la mode, Marian discovers, is something she literally can't stomach... The Edible Woman is a funny, engaging novel about emotional cannibalism, men and women, and the desire to be consumed."], "author": "Margaret Atwood", "num_pages": "310", "awards": [], "places": ["Toronto, Ontario"], "character_names": ["Marian McAlpin", "Ainsley Tewce", "Peter Wollander"], "language": "English", "publish_date": "1998-06-11 00:00:00", "ISBN": "0385491069"},
{"url": "https://www.goodreads.com/book/show/36164647-i-ve-been-looking-for-you", "num_ratings": "26", "num_reviews": "10", "avg_ratings": 4.08, "genres": ["Lgbt"], "title": "I've Been Looking for You", "description": ["MAX: The new girl, the sarcastic asshole, the one who avoids getting attached to anyone.", "EMILY: The golden girl, the rule-abiding rebel, the one who unknowingly craves something more.", "When fate brings the two girls together, life seemed to fall into place. Until their future plans are shattered the moment someone leaves drugs inside Max's school locker. ", "While Max inevitably", "MAX: The new girl, the sarcastic asshole, the one who avoids getting attached to anyone.", "EMILY: The golden girl, the rule-abiding rebel, the one who unknowingly craves something more.", "When fate brings the two girls together, life seemed to fall into place. Until their future plans are shattered the moment someone leaves drugs inside Max's school locker. ", "While Max inevitably loses hope of escaping her new grim reality, Emily struggles to move on without the one she loves most. Especially when she’s the only one determined to find answers. But the closer Emily gets to discovering the truth, the harder it will be to stop her pursuit, even when it leads to dangerous consequences."], "author": "Jennifer  Dean", "num_pages": "278", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-12-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7244.The_Poisonwood_Bible", "num_ratings": "591,154", "num_reviews": "20,945", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Classics"], "title": "The Poisonwood Bible", "description": [" is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is", " is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is a suspenseful epic of one family's tragic undoing and remarkable reconstruction over the course of three decades in postcolonial Africa."], "author": "Barbara Kingsolver", "num_pages": "546", "awards": ["Pulitzer Prize Nominee for Fiction (1999)", "Orange Prize Nominee for Fiction Shortlist (1999)", "Book Sense Book of the Year Award for Adult (2000)", "PEN/Faulkner Award for Fiction Nominee (1999)", "Independent Publisher Book Award (IPPY) for Audio Fiction - Unabridged (1999)", "Exclusive Books Boeke Prize (2000)", "Puddly Award for Novel (2001)"], "places": ["Bethlehem, Georgia", "Kilanga", "Sanderling Island, Georgia", "Leopoldville"], "character_names": ["Orleanna Price", "Ruth May Price", "Rachel Rebeccah Price", "Leah Price", "Nathan Price", "Dr Bud Wharton", "Adah Price", "Reverend & Mrs. Underdown"], "language": "English", "publish_date": "2005-07-05 00:00:00", "ISBN": "0060786507"},
{"url": "https://www.goodreads.com/book/show/16254443-i-ll-never-let-you-go", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "I'll Never Let You Go", "description": ["Kevin is debonair, well educated, loyal and willing to do anything to make his significant other happy. Yet he has been unable to hold onto Brenda after being involved for over fifteen years. Kevin's attributes, which would be appreciated by most women, are considered to be boring, routine and predictable to Brenda. Brenda has a wild and insatiable side she feeds by freque", "Kevin is debonair, well educated, loyal and willing to do anything to make his significant other happy. Yet he has been unable to hold onto Brenda after being involved for over fifteen years. Kevin's attributes, which would be appreciated by most women, are considered to be boring, routine and predictable to Brenda. Brenda has a wild and insatiable side she feeds by frequently going out on manhunts seeking new conquests. Once amused and satisfied, she returns to Kevin who welcomes her back with open arms hoping she?ll finally commit. But was there always more to Brenda than meets the eye? Was Brenda's immoral behavior lying dormant and then suddenly awakened upon meeting Kevin? Will Kevin ever experience the love and respect he desires and deserves from Brenda? Or will he remain a helpless victim of Brenda's sorted and twist lifestyle?"], "author": "Leonard Anderson Jr.", "num_pages": "212", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2012-10-10 00:00:00", "ISBN": "1480033146"},
{"url": "https://www.goodreads.com/book/show/36218967-daisy-jones", "num_ratings": "45", "num_reviews": "11", "avg_ratings": 3.93, "genres": ["Contemporary"], "title": "Daisy Jones", "description": ["DAISY MAKES THE WORLD GO ROUND ", "Gorgeous temptress, Daisy Jones has the power to send men to prison for sexual relations with a minor. She is the epitome of a gold digger and raised to go after rich men by a bitter mother. Mama Jones mad at her fate in life taught Daisy the art of manipulation and how to scheme on her prey. She didn't warn Daisy about letting her heart get", "DAISY MAKES THE WORLD GO ROUND ", "Gorgeous temptress, Daisy Jones has the power to send men to prison for sexual relations with a minor. She is the epitome of a gold digger and raised to go after rich men by a bitter mother. Mama Jones mad at her fate in life taught Daisy the art of manipulation and how to scheme on her prey. She didn't warn Daisy about letting her heart get in the way of business, forcing her to fall for a southern rapper and the CEO of a multi-million dollar empire. The story begins in Atlanta, Georgia, traveling to New York City, and enters the notorious crew, the OBG s a gumbo of women hustlers, killers, and drug dealers, who have earned a reputation in the streets for being beyond terrorist. And they're connected to Daisy Jones, all of them wanting to get their \"Daisy\" on."], "author": "Mack Mama", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-02-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18281438-two-deserts", "num_ratings": "29", "num_reviews": "13", "avg_ratings": 4.21, "genres": ["Literature", "American"], "title": "Two Deserts", "description": ["Deserts of sand and deserts of the heart, Middle Eastern deserts and American deserts: Two Deserts, a collection of stories, spans cultures and deserts. Adventure travel agent Emma Solace plunges into the impossible conflicts in an Arabian Gulf country. Her circles embrace her radically political lover Samir, 17 year-old Ayshah yearning for freedom, Muslim mother Maryam pl", "Deserts of sand and deserts of the heart, Middle Eastern deserts and American deserts: Two Deserts, a collection of stories, spans cultures and deserts. Adventure travel agent Emma Solace plunges into the impossible conflicts in an Arabian Gulf country. Her circles embrace her radically political lover Samir, 17 year-old Ayshah yearning for freedom, Muslim mother Maryam plotting to rescue her son from a jihadist movement. Writer Livia Skyer plummets into the heart desert when ALS, aka Lou Gehrig’s disease strikes her beloved husband. Her circles include a hooker who is training her daughter for the life, an academic whose lust is depleting, a club of women whose husbands are dying, a priest who has fallen in love from the pulpit. A fierce and compassionate storyteller, Brickman’s ability to articulate the deep and invisible currents of life is eloquent and remarkable"], "author": "Julie Brickman", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-01 00:00:00", "ISBN": "1933435461"},
{"url": "https://www.goodreads.com/book/show/36166472-your-bloods-eve", "num_ratings": "18", "num_reviews": "3", "avg_ratings": 4.67, "genres": ["Romance", "Fiction", "Young Adult", "Young Adult Romance", "Romantic"], "title": "Your Bloods Eve", "description": ["To not let you know your secret, the sound of your blood is silenced, the trap has been made, and the game has been started. ", "((if I kneel the women's entity will be broken)) ", "She shouted. ", "At the moments of your weakness, cut off your connection with the outside world, then close your eyes and your ears, and listen to the sound of your blood, your blood is talking to you say", "To not let you know your secret, the sound of your blood is silenced, the trap has been made, and the game has been started. ", "((if I kneel the women's entity will be broken)) ", "She shouted. ", "At the moments of your weakness, cut off your connection with the outside world, then close your eyes and your ears, and listen to the sound of your blood, your blood is talking to you saying: ", "Your bloods eve……… ", "Hanna and Hilda are two sisters, they went to an adventure for saving their mother, ", "But their destiny became a game in hands of a girl lost her life because she loved in a cursed city had forbidden the love and the life to the women. ", "Was her love worth her sacrifice? ", "Did she choose her lover well? ", "That girl was fooling the two sisters to push them into an adventure to break curse had hit her. ", "That adventure leads the two sisters to plunge into the deep secrets of eve and discover the secret which they were trying to hide it from eve for hundreds of years……. Which is the unbeatable triad of women's power ", "What the secret of this triad? ", "how could they reach and know the triad? ", "What the relation between eve's blood and the triad of her power? ", "Eve, you blood is begging you to listen…. ", "Please listen. "], "author": "Linda Jawish", "num_pages": "193", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-07-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/32328057-diary-of-an-everyday-vampire", "num_ratings": "9", "num_reviews": "0", "avg_ratings": 3.33, "genres": [], "title": "Diary Of An Everyday Vampire: Volume I", "description": ["No glitter, no fuss, just a new-fangled view on life… ", "Did you know vampires are real? Of course you did. Well, you always suspected it. And they're not actually undead, just largely unenthusiastic about the modern world. ", "Here's your opportunity to find out the amusing truth... ", "Read the secret thoughts of one such outrageous creature: the Everyday Vampire. ", "\"I love the 'Brid", "No glitter, no fuss, just a new-fangled view on life… ", "Did you know vampires are real? Of course you did. Well, you always suspected it. And they're not actually undead, just largely unenthusiastic about the modern world. ", "Here's your opportunity to find out the amusing truth... ", "Read the secret thoughts of one such outrageous creature: the Everyday Vampire. ", "\"I love the 'Bridget Jones' vampire! This always makes me laugh! It's brilliant!\" ", "(Beta review)"], "author": "Thérésa Hedges", "num_pages": "77", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12994078-offbeat-love-stories-and-more", "num_ratings": "83", "num_reviews": "5", "avg_ratings": 3.64, "genres": ["Short Stories", "Romance", "Anthologies", "Fiction"], "title": "Offbeat Love Stories and More", "description": ["A collection of humorous and unique short stories by noted fiction and nonfiction author Jennifer K. Lafferty. The majority of the stories center on love and romance. The pieces are an eclectic mix, ranging from historic farce, such as \"Make Believe\", to contemporary comedy/dramas like \"A New Verse\", and \"It Happened at the Mall\". Other genres are represented by such stori", "A collection of humorous and unique short stories by noted fiction and nonfiction author Jennifer K. Lafferty. The majority of the stories center on love and romance. The pieces are an eclectic mix, ranging from historic farce, such as \"Make Believe\", to contemporary comedy/dramas like \"A New Verse\", and \"It Happened at the Mall\". Other genres are represented by such stories as the suspense filled \"A Familiar Place\", and the lighthearted coming of age tale \"The Prom Date\". The characters are colorful, witty and multi-dimensional. The writing style is original and imaginative. Selections include: A New Verse, Periwinkle 26, Choices, Make Believe, It Happened at the Mall, A Familiar Place, Eye on the Prize, Overseas Adoption, Chance Meeting, Riddles and Jingles, The Surprise, The Prom Date, The Anniversary Gift, Unlikely Friends."], "author": "Jennifer K. Lafferty", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16240566-a-fiery-lass", "num_ratings": "8", "num_reviews": "2", "avg_ratings": 4.38, "genres": [], "title": "A Fiery Lass", "description": ["\"I don't know about it being romantic, but the view here is very much to my liking.\" \"Yes, I agree; the view is excellent.\" His eyes rested on my semi-exposed breasts. And so began our hushed, yet explosive encounter. Fiery, self-absorbed Chanticleer Widden is about to meet her match. Let the heated tension begin!"], "author": "Virginia Aird", "num_pages": "88", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18805740-doctors-beyond-borders", "num_ratings": "27", "num_reviews": "13", "avg_ratings": 3.93, "genres": ["Romance"], "title": "Doctors Beyond Borders", "description": ["When Ariadne Tate takes a deployment to Sudan with a medical aid organisation, romance is the last thing on her mind…but Dr Ford Gosden puts a glitch in her plans. Too damn attractive for his own good and a thoroughly nice guy, Ford slowly seeps under Ariadne's skin. ", "But S", "When Ariadne Tate takes a deployment to Sudan with a medical aid organisation, romance is the last thing on her mind…but Dr Ford Gosden puts a glitch in her plans. Too damn attractive for his own good and a thoroughly nice guy, Ford slowly seeps under Ariadne's skin. ", "But Sudan is not a stable place to form a relationship, and as political tension escalates in the region, Ariadne has no choice but to focus on her job and her safety. Under the protection of a UN convoy, she heads out into the war-torn countryside — and the unthinkable happens. Captured and held hostage by a renegade with no chance of escape, Ariadne's hope for a new life with the man she loves begins to fade and the fight for her life begins."], "author": "Georgie Tyler", "num_pages": "125", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-01 00:00:00", "ISBN": "0857991132"},
{"url": "https://www.goodreads.com/book/show/36310387-trash", "num_ratings": "3", "num_reviews": "2", "avg_ratings": 4.67, "genres": [], "title": "Trash", "description": ["In the near future, society is split ever more into haves and have-nots. People will gladly pay through the teeth for the latest must-have product. Most famous and desirable of all these is a new 'green' furnishing material called Kalsinum, nicknamed 'Trash' by the popular press, due to its recycled components.", "Nina, a young biochemist goes to work at the labs that produce", "In the near future, society is split ever more into haves and have-nots. People will gladly pay through the teeth for the latest must-have product. Most famous and desirable of all these is a new 'green' furnishing material called Kalsinum, nicknamed 'Trash' by the popular press, due to its recycled components.", "Nina, a young biochemist goes to work at the labs that produce it, and meets the dashing but troubled Doctor Edwards. One by one, she uncovers the secrets behind her predecessor's departure; the unusual recruitment techniques used by the company; and the disturbing truth behind Kalsinum, unknown even to the people working with it..."], "author": "Thérésa Hedges", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30534410-chips-in-a-bag-classy-mr-murray", "num_ratings": "19", "num_reviews": "12", "avg_ratings": 3.84, "genres": [], "title": "Chips in a Bag Classy Mr Murray: A heartwarming love story blended with elements of deception, love lost, suspense and redemption.", "description": ["A heartwarming love story blended with elements of deception, love lost, suspense and redemption.In the shadow of heartbreak, new love blooms under the giant Irish sky.", "It’s been decades since the Brandon Lodge was at its peak: the idyllic background for many Irish summers and the romantic seeds its planted. Thirty years ago, this iconic landscape was the backdrop for a cha", "A heartwarming love story blended with elements of deception, love lost, suspense and redemption.In the shadow of heartbreak, new love blooms under the giant Irish sky.", "It’s been decades since the Brandon Lodge was at its peak: the idyllic background for many Irish summers and the romantic seeds its planted. Thirty years ago, this iconic landscape was the backdrop for a chance meeting between Clodagh Kenny and James Murray. It was there that they fell in love—and fell prey to heartbreak.", "Years later, the site of the lodge has fallen under new management and those who once loved it have returned in order to restore it. Now a successful knitwear designer, Clodagh has found herself a solid businesswoman with a lovely daughter whom she has raised as her own. Looking to create a fresh start in the newly developed Brandon Lodge Enterprise Park, Clodagh seeks to plant the seeds of new birth in the land of her past mistakes. Elsewhere, James is busy ascending the corporate ladder, only to find that no matter how far he climbs—he cannot escape the past.", "When their new lives become entangled once again—Clodagh and James must reconcile the past if they ever hope to become lucky in love once more."], "author": "Margaret  Kelleher", "num_pages": "326", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/32493154-the-time-saving-agency", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 4.17, "genres": ["Science Fiction", "Time Travel", "Science Fiction", "Lgbt", "Science Fiction", "Dystopia"], "title": "The Time Saving Agency", "description": ["The TSA liked having fresh agents on the job with a clear mind and steady hand. Time travel wasn’t for the faint of heart. The pay was good enough, but as Scrooby had decided long ago, that even if he didn’t get paid for it, the thrill alone was payment enough. Then again, the TSA realized they couldn’t afford to have disgruntled employees with the power of God at their fi", "The TSA liked having fresh agents on the job with a clear mind and steady hand. Time travel wasn’t for the faint of heart. The pay was good enough, but as Scrooby had decided long ago, that even if he didn’t get paid for it, the thrill alone was payment enough. Then again, the TSA realized they couldn’t afford to have disgruntled employees with the power of God at their fingertips, so the pay was very, very good.", "Things happen at a certain time in a certain way, which in a sense, is what it’s all about. If it didn’t, then things would be completely different. Johnathan Scrooby was extremely tense. His job at the Time Saving Agency was a tough one. Billions of lives depended on him not screwing up. Once, he’d screwed up in only a small way and people wore those little yellow smiley faces on t-shirts for decades afterwards. And that was just a small screw up."], "author": "Christina Engela", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/29430773-the-life-and-times-of-persimmon-wilson", "num_ratings": "710", "num_reviews": "161", "avg_ratings": 4.14, "genres": ["Historical", "Historical Fiction", "Fiction", "Westerns"], "title": "The Life and Times of Persimmon Wilson", "description": ["For fans of ", " and ", " comes “a tour de force of historical fiction” (Henry Wiencek, author of ", ") that follows the epic journey of a slave-turned-Comanche warrior who travels from the brutality of a New Orleans sugar cane plantation to the indomitable frontier of an untamed Texas, searching not only for the woman he loves", "For fans of ", " and ", " comes “a tour de force of historical fiction” (Henry Wiencek, author of ", ") that follows the epic journey of a slave-turned-Comanche warrior who travels from the brutality of a New Orleans sugar cane plantation to the indomitable frontier of an untamed Texas, searching not only for the woman he loves but so too for his own identity.", " Sitting in a jail cell on the eve of his hanging, April 1, 1875, freedman Persimmon “Persy” Wilson wants nothing more than to leave some record of the truth—his truth. He may be guilty, but not of what he stands accused: the kidnapping and rape of his former master’s wife.", " In 1860, Persy had been sold to Sweetmore, a Louisiana sugar plantation, alongside a striking, light-skinned house slave named Chloe. Their deep and instant connection fueled a love affair and inspired plans to escape their owner, Master Wilson, who claimed Chloe as his concubine. But on the eve of the Union Army’s attack on New Orleans, Wilson shot Persy, leaving him for dead, and fled with Chloe and his other slaves to Texas. So began Persy’s journey across the frontier, determined to reunite with his lost love. Along the way, he would be captured by the Comanche, his only chance of survival to prove himself fierce and unbreakable enough to become a warrior. His odyssey of warfare, heartbreak, unlikely friendships, and newfound family would change the very core of his identity and teach him the meaning and the price of freedom.", " From the author of the ", " Notable Book ", ", ", "is a sweeping love story that “is as deeply moving and exciting an American saga as has ever been penned” (Lee Smith, author of ", ")."], "author": "Nancy  Peacock", "num_pages": "336", "awards": [], "places": ["Drunken Bride, Texas"], "character_names": [], "language": null, "publish_date": "2017-01-17 00:00:00", "ISBN": "1501116355"},
{"url": "https://www.goodreads.com/book/show/46456.The_Women_s_Room", "num_ratings": "6,782", "num_reviews": "495", "avg_ratings": 3.94, "genres": ["Fiction", "Feminism", "Classics", "Womens", "Novels"], "title": "The Women's Room", "description": ["The bestselling feminist novel that awakened both women and men, ", " follows the transformation of Mira Ward and her circle as the women's movement begins to have an impact on their lives. A biting social commentary on an emotional world gone silently haywire, ", " is a modern classic that offers piercin", "The bestselling feminist novel that awakened both women and men, ", " follows the transformation of Mira Ward and her circle as the women's movement begins to have an impact on their lives. A biting social commentary on an emotional world gone silently haywire, ", " is a modern classic that offers piercing insight into the social norms accepted so blindly and revered so completely. Marilyn French questions those accepted norms and poignantly portrays the hopeful believers looking for new truths."], "author": "Marilyn French", "num_pages": "526", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-05-01 00:00:00", "ISBN": "1860492827"},
{"url": "https://www.goodreads.com/book/show/23700475-when-i-was-boudicca", "num_ratings": "6", "num_reviews": "0", "avg_ratings": 3.83, "genres": [], "title": "When I Was Boudicca", "description": ["When I Was Boudicca is a first person account of the first centruy Celtic mother who, when forced to witness the rape of her daughters by Roman soldiers, unities the tribes of Britain to bring her wrath to bear on the world's greatest army."], "author": "Joann Smith", "num_pages": "201", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-11 00:00:00", "ISBN": "1499529783"},
{"url": "https://www.goodreads.com/book/show/2657.To_Kill_a_Mockingbird", "num_ratings": "3,680,328", "num_reviews": "78,475", "avg_ratings": 4.26, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction"], "title": "To Kill a Mockingbird", "description": ["The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.", "Compassionate, dramatic, and deepl", "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.", "Compassionate, dramatic, and deeply moving, To Kill A Mockingbird takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature."], "author": "Harper Lee", "num_pages": "324", "awards": ["Pulitzer Prize for Fiction (1961)", "Audie Award for Classic (2007)", "National Book Award Finalist for Fiction (1961)", "Alabama Author Award for Fiction (1961)"], "places": ["Maycomb, Alabama"], "character_names": ["Scout Finch", "Atticus Finch", "Jem Finch", "Arthur Radley", "Mayella Ewell", "Aunt Alexandra", "Bob Ewell", "Calpurnia (housekeeper)", "Tom Robinson", "Miss Maudie Atkinson", "Judge John Taylor"], "language": "English", "publish_date": "2006-05-23 00:00:00", "ISBN": "0061120081"},
{"url": "https://www.goodreads.com/book/show/11486.The_Color_Purple", "num_ratings": "435,312", "num_reviews": "11,067", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "295", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "0671727796"},
{"url": "https://www.goodreads.com/book/show/14249.Prodigal_Summer", "num_ratings": "85,265", "num_reviews": "5,542", "avg_ratings": 3.99, "genres": ["Fiction", "Contemporary", "Novels"], "title": "Prodigal Summer", "description": [" weaves together three stories of human love within a larger tapestry of lives inhabiting the forested mountains and struggling small farms of southern Appalachia.", "From her outpost in an isolated mountain cabin, Deanna Wolfe, a reclusive wildlife biologist, watches a den of coyotes that have recently migrated into the region. She is caught off-guard by a youn", " weaves together three stories of human love within a larger tapestry of lives inhabiting the forested mountains and struggling small farms of southern Appalachia.", "From her outpost in an isolated mountain cabin, Deanna Wolfe, a reclusive wildlife biologist, watches a den of coyotes that have recently migrated into the region. She is caught off-guard by a young hunter who invades her most private spaces and confounds her self-assured, solitary life. On a farm several miles down the mountain, Lusa Maluf Landowski, a bookish city girl turned farmer's wife, finds herself unexpectedly marooned in a strange place where she must declare or lose her attachment to the land that has become her own. And a few more miles down the road, a pair of elderly feuding neighbors tend their respective farms and wrangle about God, pesticides, and the possibilities of a future neither of them expected.", "Over the course of one humid summer, these characters find their connections to one another and to the flora and fauna with whom they share a place. ", " demonstrates a balance of narrative, drama and ideas that is characteristic of Barbara Kingsolver's finest work."], "author": "Barbara Kingsolver", "num_pages": "444", "awards": [], "places": ["Egg Fork, Zebulon County, Kentucky"], "character_names": ["Deanna Wolfe", "Eddie Bondo", "Lusa Maluf Landowski", "Garnett Walker", "Nannie Rawley"], "language": "English", "publish_date": "2001-10-16 00:00:00", "ISBN": "0060959037"},
{"url": "https://www.goodreads.com/book/show/930.Memoirs_of_a_Geisha", "num_ratings": "1,512,200", "num_reviews": "26,922", "avg_ratings": 4.09, "genres": ["Fiction", "Historical", "Historical Fiction", "Romance", "Historical"], "title": "Memoirs of a Geisha", "description": ["A literary sensation and runaway bestseller, this brilliant debut novel presents with seamless authenticity and exquisite lyricism the true confessions of one of Japan's most celebrated geisha.", "In ", ", we enter a world where appearances are paramount; where a girl's virginity is auctioned to the highest bidder; where women are trained to beguile the most pow", "A literary sensation and runaway bestseller, this brilliant debut novel presents with seamless authenticity and exquisite lyricism the true confessions of one of Japan's most celebrated geisha.", "In ", ", we enter a world where appearances are paramount; where a girl's virginity is auctioned to the highest bidder; where women are trained to beguile the most powerful men; and where love is scorned as illusion. It is a unique and triumphant work of fiction - at once romantic, erotic, suspenseful - and completely unforgettable."], "author": "Arthur Golden", "num_pages": "434", "awards": [], "places": [], "character_names": ["Nitta Sayuri", "Mr. Bekku", "Mr. Tanaka", "Dr. Crab"], "language": "English", "publish_date": "2005-11-15 00:00:00", "ISBN": "0739326228"},
{"url": "https://www.goodreads.com/book/show/18692284-a-disconnected-life", "num_ratings": "6", "num_reviews": "0", "avg_ratings": 4.5, "genres": ["Short Stories", "Novels", "Womens"], "title": "A Disconnected Life", "description": ["Jane never thought her life would come to this. Sally expected nothing more from her menial existence. Their tortured souls collide one fateful day. Experience a dramatic view into the lives of two women and one's highly unusual method of coping."], "author": "Virginia Aird", "num_pages": "14", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/36901726-caught", "num_ratings": "94", "num_reviews": "19", "avg_ratings": 4.15, "genres": ["Romance", "Historical Romance", "Romance", "Romance", "Christian Romance", "Womens Fiction", "Historical", "Regency"], "title": "Caught", "author": "Christina J. Michaels", "num_pages": "314", "awards": [], "places": ["London, England"], "character_names": [], "language": "English", "publish_date": "2017-11-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/38447.The_Handmaid_s_Tale", "num_ratings": "908,896", "num_reviews": "49,381", "avg_ratings": 4.08, "genres": ["Fiction", "Classics", "Science Fiction", "Dystopia", "Science Fiction", "Feminism"], "title": "The Handmaid's Tale", "description": ["Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Ha", "Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the years before, when she lived and made love with her husband, Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now..."], "author": "Margaret Atwood", "num_pages": "311", "awards": ["Man Booker Prize Nominee (1986)", "Nebula Award Nominee for Best Novel (1986)", "Arthur C. Clarke Award for Best Novel (1987)", "Audie Award for Fiction (2013)", "Los Angeles Times Book Prize for Fiction (1986)", "Prometheus Award Nominee for Best Novel (1987)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (1985)", "Commonwealth Writers' Prize Nominee for Best Book in Caribbean and Canada (1987)", "CBC Canada Reads Nominee (2002)"], "places": ["Cambridge, Massachusetts", "Republic of Gilead"], "character_names": ["The Commander", "Offred", "Serena Joy", "Ofglen", "Nick", "Moira", "Luke Castellan"], "language": "English", "publish_date": "1998-03-16 00:00:00", "ISBN": "038549081X"}
]