[
{"url": "https://www.goodreads.com/book/show/7603.Reading_Lolita_in_Tehran", "num_ratings": "104,230", "num_reviews": "6,981", "avg_ratings": 3.59, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Reading Lolita in Tehran: A Memoir in Books", "author": "Azar Nafisi", "num_pages": "356", "awards": ["Book Sense Book of the Year Award for Adult Nonfiction (2004)", "Prix du Meilleur Livre Étranger for Essai (2004)"], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Azar Nafisi"], "language": "English", "publish_date": "2003-12-30 00:00:00", "ISBN": "081297106X"},
{"url": "https://www.goodreads.com/book/show/11500827-then-they-came-for-me", "num_ratings": "3,803", "num_reviews": "373", "avg_ratings": 4.1, "genres": ["Nonfiction", "Biography", "History", "Cultural", "Iran", "Autobiography", "Memoir"], "title": "Then They Came for Me: A Family's Story of Love, Captivity, and Survival", "description": ["When Maziar Bahari left London in June 2009 to cover Iran’s presidential election, he assured his pregnant fiancée, Paola, that he’d be back in just a few days, a week at most. Little did he know, as he kissed her good-bye, that he would spend the next three months in Iran’s most notorious prison, end", "When Maziar Bahari left London in June 2009 to cover Iran’s presidential election, he assured his pregnant fiancée, Paola, that he’d be back in just a few days, a week at most. Little did he know, as he kissed her good-bye, that he would spend the next three months in Iran’s most notorious prison, enduring brutal interrogation sessions at the hands of a man he knew only by his smell: Rosewater.", "For the Bahari family, wars, coups, and revolutions are not distant concepts but intimate realities they have suffered for generations: Maziar’s father was imprisoned by the shah in the 1950s, and his sister by Ayatollah Khomeini in the 1980s. Alone in his cell at Evin Prison, fearing the worst, Maziar draws strength from his memories of the courage of his father and sister in the face of torture, and hears their voices speaking to him across the years. He dreams of being with Paola in London, and imagines all that she and his rambunctious, resilient eighty-four-year-old mother must be doing to campaign for his release. During the worst of his encounters with Rosewater, he silently repeats the names of his loved ones, calling on their strength and love to protect him and praying he will be released in time for the birth of his first child.", "A riveting, heart-wrenching memoir, ", " offers insight into the past seventy years of regime change in Iran, as well as the future of a country where the democratic impulses of the youth continually clash with a government that becomes more totalitarian with each passing day. An intimate and fascinating account of contemporary Iran, it is also the moving and wonderfully written story of one family’s extraordinary courage in the face of repression."], "author": "Maziar Bahari", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-06-07 00:00:00", "ISBN": "1400069467"},
{"url": "https://www.goodreads.com/book/show/8718.Creation", "num_ratings": "3,207", "num_reviews": "263", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Literature", "Novels"], "title": "Creation", "description": ["Once again the incomparable Gore Vidal interprets and animates history -- this time in a panoramic tour of the 5th century B.C. -- and embellishes it with his own ironic humor, brilliant insights, and piercing observations. We meet a vast array of historical figures in a staggering novel of love, war, philosophy, and adventure . . . ", "\"There isn't a page of CREATION that doe", "Once again the incomparable Gore Vidal interprets and animates history -- this time in a panoramic tour of the 5th century B.C. -- and embellishes it with his own ironic humor, brilliant insights, and piercing observations. We meet a vast array of historical figures in a staggering novel of love, war, philosophy, and adventure . . . ", "\"There isn't a page of CREATION that doesn't inform and very few pages that do not delight.\"", "-- John Leonard, The New York Times \"From the Paperback edition.\""], "author": "Gore Vidal", "num_pages": "574", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-09-10 00:00:00", "ISBN": "0385507623"},
{"url": "https://www.goodreads.com/book/show/3985545-honeymoon-in-tehran", "num_ratings": "1,632", "num_reviews": "223", "avg_ratings": 3.79, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Iran", "Travel", "Biography Memoir", "Biography"], "title": "Honeymoon in Tehran: Two Years of Love and Danger in Iran", "description": ["A love story and a reporter's first draft of history, Honeymoon in Tehran is a stirring, trenchant, and deeply personal chronicle of two years in the maelstrom of Iranian life.", "Azadeh Moaveni, Middle East correspondent for Time magazine, returns to Iran to cover the rise of President Mahmoud Ahmadinejad. As she documents the firebrand leader's entry onto the world stage, Mo", "A love story and a reporter's first draft of history, Honeymoon in Tehran is a stirring, trenchant, and deeply personal chronicle of two years in the maelstrom of Iranian life.", "Azadeh Moaveni, Middle East correspondent for Time magazine, returns to Iran to cover the rise of President Mahmoud Ahmadinejad. As she documents the firebrand leader's entry onto the world stage, Moaveni portrays a society too often caricatured as the heartland of militant Islam. Living and working in Tehran, she finds a nation that yearns for freedom and contact with the West, but whose economic grievances and nationalist spirit find a temporary outlet in Ahmadinejad's strident pronouncements. She explores the cultural identity crisis and class frustration that pits Iran's next generation against the Islamic system.", "Azadeh falls in love with a young Iranian man and decides to get married. She finds herself navigating an altogether different side of Iranian life. Preparing to be wed by a mullah, she sits in on a government marriage prep class where young couples are instructed to enjoy sex. She visits Tehran's bridal bazaar and finds that the Iranian wedding has become an outrageously lavish-though often still gender-segregated-production. When she becomes pregnant, she must prepare to give birth in an Iranian hospital, at the same time observing her friends' struggles with their children, who must learn to say one thing at home and another at school.", "Azadeh continues to report for Time on Iran's nuclear standoff with the West and Iranians' dissatisfaction with Ahmadinejad's heavy-handed rule. But as women are arrested on the street for \"immodest dress\" and the authorities unleash a campaign of intimidation against journalists, the country's dark side reemerges. This fundamentalist turn, along with the chilling presence of \"Mr. X,\" the government agent assigned to mind her every step, Azadeh makes the hard decision that her future lies outside Iran."], "author": "Azadeh Moaveni", "num_pages": "338", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-02-03 00:00:00", "ISBN": "140006645X"},
{"url": "https://www.goodreads.com/book/show/16115612-and-the-mountains-echoed", "num_ratings": "252,342", "num_reviews": "25,452", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "And the Mountains Echoed", "description": ["So, then. You want a story and I will tell you one...Afghanistan, 1952. Abdullah and his sister Pari live with their father and stepmother in the small village of Shadbagh. Their father, Saboor, is constantly in search of work and they struggle together through poverty and brutal winters. To Abdullah, Pari - as beautiful and sweet-natured as the fairy for which she was nam", "So, then. You want a story and I will tell you one...Afghanistan, 1952. Abdullah and his sister Pari live with their father and stepmother in the small village of Shadbagh. Their father, Saboor, is constantly in search of work and they struggle together through poverty and brutal winters. To Abdullah, Pari - as beautiful and sweet-natured as the fairy for which she was named - is everything. More like a parent than a brother, Abdullah will do anything for her, even trading his only pair of shoes for a feather for her treasured collection. Each night they sleep together in their cot, their heads touching, their limbs tangled. One day the siblings journey across the desert to Kabul with their father. Pari and Abdullah have no sense of the fate that awaits them there, for the event which unfolds will tear their lives apart; sometimes a finger must be cut to save the hand. Crossing generations and continents, moving from Kabul, to Paris, to San Francisco, to the Greek island of Tinos, with profound wisdom, depth, insight and compassion, Khaled Hosseini writes about the bonds that define us and shape our lives, the ways in which we help our loved ones in need, how the choices we make resonate through history and how we are often surprised by the people closest to us."], "author": "Khaled Hosseini", "num_pages": "404", "awards": ["Andrew Carnegie Medal Nominee for Fiction (2014)", "Goodreads Choice Award for Fiction (2013)", "DSC Prize Nominee for South Asian Literature  for Longlist (2015)"], "places": ["Kabul", "California", "Paris", "Tinos"], "character_names": ["Julien", "Abdullah", "Pari", "Suleiman Wahdati", "Nila Wahdati", "Nabi", "Parwana", "Saboor", "Timur Bashiri", "Idris Bashiri", "Masooma", "Eric Lacombe", "Markos Varvaris", "Thalia"], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "159463176X"},
{"url": "https://www.goodreads.com/book/show/122977.An_Enduring_Love", "num_ratings": "1,053", "num_reviews": "145", "avg_ratings": 3.71, "genres": ["Biography", "Cultural", "Iran", "Nonfiction", "Autobiography", "Memoir", "History"], "title": "An Enduring Love: My Life with the Shah", "description": ["At the age of twenty-one, Farah Diba married the Shah of Iran, Mohammed Reza Shah Pahlavi. A loving marriage, the raising of four children, and a devotion to social and cultural causes marked her early years as queen, although there were already signs of grave national diversions on the horizon.", "Twenty years l", "At the age of twenty-one, Farah Diba married the Shah of Iran, Mohammed Reza Shah Pahlavi. A loving marriage, the raising of four children, and a devotion to social and cultural causes marked her early years as queen, although there were already signs of grave national diversions on the horizon.", "Twenty years later the dream had turned into a nightmare: demonstrations and riots shook the country, and Farah and the Shah decided to leave in order to avoid bloodshed. With the hardcover publication of ", ", a ", " bestseller (extended list) in 2004, Farah Diba, wife of the last emperor of Iran, broke her silence and told the wrenching story of her love for a man and his country. Her compelling memoir offers an intimate view of a time of upheaval, but stands above all as a powerful human document from one whose life was caught up in an epic and tragic national struggle."], "author": "Farah Pahlavi", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-06 00:00:00", "ISBN": "1401359612"},
{"url": "https://www.goodreads.com/book/show/680367.Divan_of_Hafez", "num_ratings": "6,632", "num_reviews": "300", "avg_ratings": 4.63, "genres": ["Poetry", "Classics", "Literature"], "title": "Divan of Hafez: دیوان خواجه شمس الدین محمد حافظ شیرازی", "description": ["عنوان: دیوان خواجه شمس الدین محمد حافظ شیرازی : متن کامل فارسی انگلیسی از روی نسخه علامه محمد قزوینی و و دکتر قاسم غنی؛ شاعر: حافظ؛ ترجمه به انگلیسی: ویلبر فورس کلارک؛ تهران، بهزاد، 1384، در 975 ص؛ شابک: 9789645959775؛ 9645959772؛ موضوع: شعر فارسی قرن 14 میلادی"], "author": "Hafez", "num_pages": "975", "awards": [], "places": ["Persia", "Iran, Islamic Republic of"], "character_names": [], "language": "Multiple languages", "publish_date": "2005-08-16 00:00:00", "ISBN": "9645959772"},
{"url": "https://www.goodreads.com/book/show/67700.The_Persian_Boy", "num_ratings": "6,566", "num_reviews": "448", "avg_ratings": 4.17, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Lgbt", "Glbt", "Gay"], "title": "The Persian Boy", "description": ["“It takes skill to depict, as Miss Renault has done, this half-man, half Courtesan who is so deeply in love with the warrior.”–", " traces the last years of Alexander’s life through the eyes of his lover, Bagoas. Abducted and gelded as a boy, Bagoas was sold as a courtesan to King Darius of Persia, but found freedom with Alexander after the M", "“It takes skill to depict, as Miss Renault has done, this half-man, half Courtesan who is so deeply in love with the warrior.”–", " traces the last years of Alexander’s life through the eyes of his lover, Bagoas. Abducted and gelded as a boy, Bagoas was sold as a courtesan to King Darius of Persia, but found freedom with Alexander after the Macedon army conquered his homeland. Their relationship sustains Alexander as he weathers assassination plots, the demands of two foreign wives, a sometimes-mutinous army, and his own ferocious temper. After Alexander’s mysterious death, we are left wondering if this Persian boy understood the great warrior and his ambitions better than anyone."], "author": "Mary Renault", "num_pages": "432", "awards": [], "places": ["Persia", "Persian Empire"], "character_names": ["Alexander the Great", "Hephaestion", "Roxana of Bactria", "Darius III", "Bagoas"], "language": "English", "publish_date": "1988-02-12 00:00:00", "ISBN": "0394751019"},
{"url": "https://www.goodreads.com/book/show/67375.The_Soul_of_Rumi", "num_ratings": "3,513", "num_reviews": "105", "avg_ratings": 4.51, "genres": ["Poetry", "Spirituality", "Classics", "Philosophy", "Religion"], "title": "The Soul of Rumi: A New Collection of Ecstatic Poems", "description": [" Rumi's masterpieces have inspired countless people throughout the centuries, and Coleman Barks's exquisite renderings of the thirteenth-century Persian mystic are widely considered the definitive versions for our time. Barks's translations capture the inward exploration and intensity that characterize Rumi's poe", " Rumi's masterpieces have inspired countless people throughout the centuries, and Coleman Barks's exquisite renderings of the thirteenth-century Persian mystic are widely considered the definitive versions for our time. Barks's translations capture the inward exploration and intensity that characterize Rumi's poetry, making this unique voice of mysticism and desire contemporary while remaining true to the original poems. In this volume readers will encounter the essence of Sufism's insights into the experience of divine love, wisdom, and the nature of both humanity and God.", "While Barks's stamp on this collection is clear, it is Rumi's voice that leaps off these pages with a rapturous power that leaves readers breathless. These poems express our deepest yearning for the transcendent connection with the source of the divine: there are passionate outbursts about the torment of longing for the beloved and the sweet delight that comes from union; stories of sexual adventures and of loss; poems of love and fury, sadness and joy; and quiet truths about the beauty and variety of human emotion. For Rumi, soul and body and emotion are not separate but are rather part of the great mystery of mortal life, a riddle whose solution is love. Above all else, Rumi's poetry exposes us to the delight that comes from being fully alive, urging us always to put aside our fears and take the risk of discovering our core self:", " These fresh, original translations magnificently convey Rumi's insights into the human heart and its longings with his signature passion and daring, focusing on the ecstatic experience of the inseparability of human and divine love. The match between Rumi's sublime poetry and Coleman Barks's poetic art are unequaled, and here this artistic union is raised to new heights."], "author": "Rumi", "num_pages": "425", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2002-09-17 00:00:00", "ISBN": "0060604522"},
{"url": "https://www.goodreads.com/book/show/9731880-the-gaze-of-the-gazelle", "num_ratings": "87", "num_reviews": "16", "avg_ratings": 4.41, "genres": ["Nonfiction", "Cultural", "Iran", "Autobiography", "Memoir", "History", "Biography"], "title": "The Gaze of the Gazelle: The Story of a Generation", "description": ["On June 20, 2009, during demonstrations to protest the contested and controversial Iranian presidential election, a young girl named Neda Agha-Soltan was shot to death in the streets of Tehran. Within hours, the video footage of her death, captured on a roving camera-phone, had circled the globe. It was also the moment of choice for Arash Hejazi—a writer who had originally", "On June 20, 2009, during demonstrations to protest the contested and controversial Iranian presidential election, a young girl named Neda Agha-Soltan was shot to death in the streets of Tehran. Within hours, the video footage of her death, captured on a roving camera-phone, had circled the globe. It was also the moment of choice for Arash Hejazi—a writer who had originally trained as a doctor—who tried and failed to save Neda’s life. Within days Hejazi left Iran to tell the world the story the government was denying: Neda had died at the hands of the pro-government militia.  ", " is Hejazi’s personal story of how that tragedy came to be and how it will change the course of politics in Iran for a new generation.", " ", "In a tale that mingles politics and the personal, mythology and history, Hejazi tries to answer the question: How did it come to this? His quest for an answer leads him through the story of the decades long aftermath of the Iranian Revolution, when Ayatollah Khomeini was brought back from exile to drive the Shah from his throne and set up the Islamic Republic of Iran.", "Against the background of Saddam Hussein’s invasion of Iran and the prolonged war that followed, Hejazi skillfully interweaves his own story and those of his family and friends with the machinations of the mullahs and politicians who seek to control Iranian lives. This timely, moving, and eloquent book describes the determination of a new generation to recover hope in the name of Neda, who gave her life in pursuit of a freer and better world."], "author": "Arash Hejazi", "num_pages": "363", "awards": [], "places": ["Tehran"], "character_names": ["Ahmadinejad", "Neda Agha Soltan", "Arash Hejazi", "Paulo Coelho", "Khatami", "Khomeini", "Shah"], "language": "English", "publish_date": "2011-09-15 00:00:00", "ISBN": "1906497907"},
{"url": "https://www.goodreads.com/book/show/610836.The_Art_and_Architecture_of_Persia", "num_ratings": "13", "num_reviews": "0", "avg_ratings": 4.38, "genres": ["Art", "Architecture", "Cultural", "Iran", "Nonfiction", "Art", "Art History"], "title": "The Art and Architecture of Persia", "description": ["The history of the area now known as Iran, but often still referred to as Persia, spans millennia, boasting a rich and complex artistic and cultural legacy. Populated since prehistoric times, thus making it one of the most dynamic areas of Islamic civilization, this region was home to the world’s first powerful empire (lead by Cyrus the Great during the Achaemenid dynasty)", "The history of the area now known as Iran, but often still referred to as Persia, spans millennia, boasting a rich and complex artistic and cultural legacy. Populated since prehistoric times, thus making it one of the most dynamic areas of Islamic civilization, this region was home to the world’s first powerful empire (lead by Cyrus the Great during the Achaemenid dynasty) and has influenced the aesthetic grammar of a large portion of central Asia, including Armenia, Georgia, and India.", "From the ancient Iranian civilizations in 500 BC, through the Islamic period, and on to modern-day Iran, Iran: ", " explores the common characteristics and thematic threads running through Persian art. Iran presents its readers with archaeological landscapes, monuments, sculptures, carpets, and dazzling ornaments and art objects from this stunning artistic milieu. The text takes as it subject the most fascinating and unusual facets of the Persian artistic experience, with a particular focus on post-Hellenic culture, namely late antiquity and the Middle Ages. Iran investigates how the examined regions were hothouses of specific artistic developments and identifies how the Iranian passage along the Silk Route acted as a bridge between distant lands for trade as well as the dissemination of religious and material culture.", "The two authors, Gianroberto Scarcia and Giovanni Curatola, write in an engaging, refreshingly accessible manner, catering both to specialists and to novices wishing to immerse themselves in this captivating region and its art. Author Scarcia writes the first part of the book, covering the era from the Achaemenids to the Sassanids and examining the great architecture from Persepolis onward while also addressing the powerful metalwork produced by these cultures. The second part, by Curatola, explores the Islamic period, when architectural decoration moved into the forefront with brilliant chromatic effects etched onto massive built works. The same colors bloom throughout the other arts, including carpets and miniature paintings. Dynamic and absorbing, Iran and its over 200 color photos will take readers on a virtual tour of this region and the art it has produced over the centuries."], "author": "Giovanni Curatola", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "0789209209"},
{"url": "https://www.goodreads.com/book/show/9517.Persepolis_2", "num_ratings": "52,906", "num_reviews": "2,239", "avg_ratings": 4.24, "genres": ["Sequential Art", "Graphic Novels", "Nonfiction", "Sequential Art", "Comics", "Autobiography", "Memoir", "Biography"], "title": "Persepolis 2: The Story of a Return", "description": ["In", ", heralded by the ", " as \"one of the freshest and most original memoirs of our day,\" Marjane Satrapi dazzled us with her heartrending memoir-in-comic-strips about growing up in Iran during the Islamic Revolution. Here is the continuation of her fascinating story. In 1984, Marjane flees fundamentalism and the war with Iraq to begin a new life in V", "In", ", heralded by the ", " as \"one of the freshest and most original memoirs of our day,\" Marjane Satrapi dazzled us with her heartrending memoir-in-comic-strips about growing up in Iran during the Islamic Revolution. Here is the continuation of her fascinating story. In 1984, Marjane flees fundamentalism and the war with Iraq to begin a new life in Vienna. Once there, she faces the trials of adolescence far from her friends and family, and while she soon carves out a place for herself among a group of fellow outsiders, she continues to struggle for a sense of belonging.", "Finding that she misses her home more than she can stand, Marjane returns to Iran after graduation. Her difficult homecoming forces her to confront the changes both she and her country have undergone in her absence and her shame at what she perceives as her failure in Austria. Marjane allows her past to weigh heavily on her until she finds some like-minded friends, falls in love, and begins studying art at a university. However, the repression and state-sanctioned chauvinism eventually lead her to question whether she can have a future in Iran.", "As funny and poignant as its predecessor, ", " is another clear-eyed and searing condemnation of the human cost of fundamentalism. In its depiction of the struggles of growing up--here compounded by Marjane's status as an outsider both abroad and at home--it is raw, honest, and incredibly illuminating."], "author": "Marjane Satrapi", "num_pages": "187", "awards": ["Prix du Festival d'Angoulême for Alph-art du meilleur scenario (2002)"], "places": ["Tehran", "Vienna"], "character_names": [], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "0375714669"},
{"url": "https://www.goodreads.com/book/show/144870.The_Conference_of_the_Birds", "num_ratings": "3,329", "num_reviews": "257", "avg_ratings": 4.21, "genres": ["Poetry", "Classics", "Religion", "Philosophy", "Religion", "Islam", "Literature"], "title": "The Conference of the Birds", "description": ["Composed in the twelfth century in north-eastern Iran, Attar's great mystical poem is among the most significant of all works of Persian literature. A marvellous, allegorical rendering of the Islamic doctrine of Sufism - an esoteric system concerned with the search for truth through God - it describes the consequences of the conference of the birds of the world when they m", "Composed in the twelfth century in north-eastern Iran, Attar's great mystical poem is among the most significant of all works of Persian literature. A marvellous, allegorical rendering of the Islamic doctrine of Sufism - an esoteric system concerned with the search for truth through God - it describes the consequences of the conference of the birds of the world when they meet to begin the search for their ideal king, the Simorgh bird. On hearing that to find him they must undertake an arduous journey, the birds soon express their reservations to their leader, the hoopoe. With eloquence and insight, however, the hoopoe calms their fears, using a series of riddling parables to provide guidance in the search for spiritual truth. By turns witty and profound, ", " transforms deep belief into magnificent poetry."], "author": "Attar of Nishapur", "num_pages": "278", "awards": [], "places": ["Persia"], "character_names": [], "language": "English", "publish_date": "1984-03-29 00:00:00", "ISBN": "0140444343"},
{"url": "https://www.goodreads.com/book/show/1090020.Return_to_Babylon", "num_ratings": "25", "num_reviews": "2", "avg_ratings": 4.12, "genres": ["History", "Nonfiction", "History", "Archaeology", "Cultural", "Asia"], "title": "Return to Babylon: Travelers, Archaeologists, and Monuments in Mesopotamia", "description": ["Tells the story of archaeological travel and excavation in Iraq - then Mesopotamia - from the time of the great Arab geographers to the 2003 devastation of the Iraq National Museum. This title chronicles the development of scientific archaeology in Mesopotamia, and the growing Iraqi involvement in archaeology."], "author": "Brian M. Fagan", "num_pages": "386", "awards": [], "places": ["Iraq"], "character_names": [], "language": "English", "publish_date": "2007-04-30 00:00:00", "ISBN": "0870818678"},
{"url": "https://www.goodreads.com/book/show/81763.The_Prince_of_the_Marshes", "num_ratings": "1,577", "num_reviews": "191", "avg_ratings": 4.0, "genres": ["Nonfiction", "History", "Autobiography", "Memoir", "Travel", "Politics"], "title": "The Prince of the Marshes: And Other Occupational Hazards of a Year in Iraq", "author": "Rory Stewart", "num_pages": "448", "awards": ["John Llewellyn Rhys Prize Nominee (2007)", "Orwell Prize Nominee (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "0156032791"},
{"url": "https://www.goodreads.com/book/show/2615934-kampf-dem-terror---kampf-dem-islam-chronik-eines-unbegrenzten-krieges", "num_ratings": "48", "num_reviews": "0", "avg_ratings": 3.79, "genres": ["Nonfiction", "Politics"], "title": "Kampf dem Terror - Kampf dem Islam? Chronik eines unbegrenzten Krieges.", "description": [" Oriana Fallaci wurde mit ihrer Anklageschrift ", " binnen kurzem zur Chiffre für die wütend-emotionale Bewältigung des 11. Septembers 2001. Peter Scholl-Latours Analyse ist ein gelungenes Beispiel für die erheblich rationalere Auseinandersetzung mit dem Thema.", " Oriana Fallaci wurde mit ihrer Anklageschrift ", " binnen kurzem zur Chiffre für die wütend-emotionale Bewältigung des 11. Septembers 2001. Peter Scholl-Latours Analyse ist ein gelungenes Beispiel für die erheblich rationalere Auseinandersetzung mit dem Thema."], "author": "Peter Scholl-Latour", "num_pages": "496", "awards": [], "places": [], "character_names": [], "language": "German", "publish_date": "2004-10-31 00:00:00", "ISBN": "3548366791"},
{"url": "https://www.goodreads.com/book/show/240541.In_the_Footsteps_of_Alexander_the_Great", "num_ratings": "436", "num_reviews": "31", "avg_ratings": 4.01, "genres": ["History", "Nonfiction", "Travel", "History", "Ancient History", "Biography"], "title": "In the Footsteps of Alexander the Great: A Journey from Greece to Asia", "description": ["Between 334 and 324 B.C. the Macedonian army, led by Alexander the Great, marched relentlessly across Asia. An event of bravery and cruelty, endurance and greed, Alexander's expedition was a turning point in human history. His conquest opened up contacts between Europe and Asia, unleashing astonishing historical energies that continue to affect the world today. This extrao", "Between 334 and 324 B.C. the Macedonian army, led by Alexander the Great, marched relentlessly across Asia. An event of bravery and cruelty, endurance and greed, Alexander's expedition was a turning point in human history. His conquest opened up contacts between Europe and Asia, unleashing astonishing historical energies that continue to affect the world today. This extraordinary book recreates Alexander's 22,000 mile, ten-year expedition from Greece to India, following as much as possible the actual route of his journey.", "Historian Michael Wood traversed seventeen countries, trekking through the Zagros Mountains to find the lost site of Alexander's battle at the \"Persian Gates,\" drinking black tea in the Hindu Kush, listening to ancient stories of ", ", and crossing the Makran Desert with twenty-three camels. He traveled with Lebanese traders, Iranian pilgrims, Afghan guerrillas, and other local people on a journey that took him through many of the twentieth century's major trouble spots, including Beirut and Kurdistan.", "Wood bases his account of Alexander's conquest on the texts of Greek and Roman historians, but he also reconsiders the Greek adventure in terms of modern ideas on colonialism, orientalism, and racism. The Macedonian conquest, which has mainly been seen through Greek sources, is illuminated for the first time by medieval travelers' narratives, newly discovered oracles, and prophecies on papyrus or clay tablet.", "At the heart of Wood's powerful story is the towering, enigmatic character of Alexander the Great. He ascended the throne at twenty, conquered much of the known world before he was thirty, and was dead by the age of thirty-two. A ruthless politician, brilliant military tactician, devoted son, family man, lover of both women and men, Alexander was known for his extreme generosity as well as his ferocious cruelty. Following in the conqueror's footsteps centuries later, Michael Wood overhears the words of the fabled Greek mermaid who calls to passing sailors: \"Great Alexander still lives!\""], "author": "Michael Wood", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-08-01 00:00:00", "ISBN": "0520231929"},
{"url": "https://www.goodreads.com/book/show/8898001-the-sirens-of-baghdad", "num_ratings": "1,868", "num_reviews": "193", "avg_ratings": 3.83, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Asia", "Northern Africa", "Algeria", "Cultural", "France", "Novels", "War", "Politics", "Thriller", "Religion"], "title": "The Sirens of Baghdad", "description": ["The third novel in Yasmina Khadra's bestselling trilogy about Islamic fundamentalism has the most compelling backdrop of any of his novels: Iraq in the wake of the American invasion. A young Iraqi student, unable to attend college because of the war, sees American soldiers leave a trail of humiliation and grief in his small village. Bent on revenge, he flees to the chaotic", "The third novel in Yasmina Khadra's bestselling trilogy about Islamic fundamentalism has the most compelling backdrop of any of his novels: Iraq in the wake of the American invasion. A young Iraqi student, unable to attend college because of the war, sees American soldiers leave a trail of humiliation and grief in his small village. Bent on revenge, he flees to the chaotic streets of Baghdad where insurgents soon realize they can make use of his anger. Eventually he is groomed for a secret terrorist mission meant to dwarf the attacks of September 11th, only to find himself struggling with moral qualms. ", " is a powerful look at the effects of violence on ordinary people, showing what can turn a decent human being into a weapon, and how the good in human nature can resist."], "author": "Yasmina Khadra", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-05-06 00:00:00", "ISBN": "0307455602"},
{"url": "https://www.goodreads.com/book/show/7025936-nylon-road", "num_ratings": "339", "num_reviews": "59", "avg_ratings": 3.4, "genres": ["Sequential Art", "Graphic Novels", "Autobiography", "Memoir", "Nonfiction", "Cultural", "Iran", "Sequential Art", "Comics"], "title": "Nylon Road: A Graphic Memoir of Coming of Age in Iran", "description": ["In the tradition of graphic memoirs such as Marjane Satrapi’s Persepolis, comes the story of a young Iranian woman’s struggles with growing up under Shiite Law, her journey into adulthood, and the daughter whom she had to leave behind when she left Iran."], "author": "Parsua Bashi", "num_pages": "127", "awards": [], "places": ["Iran, Islamic Republic of"], "character_names": ["Parsua Bashi"], "language": "English", "publish_date": "2009-11-10 00:00:00", "ISBN": "0312532865"},
{"url": "https://www.goodreads.com/book/show/8143903-guests-of-the-ayatollah", "num_ratings": "3,835", "num_reviews": "303", "avg_ratings": 4.13, "genres": ["History", "Nonfiction", "Cultural", "Iran", "Politics"], "title": "Guests of the Ayatollah: The Iran Hostage Crisis: The First Battle in America's War with Militant Islam", "description": ["From the best-selling author of Black Hawk Down comes a riveting, definitive chronicle of the Iran hostage crisis, America's first battle with militant Islam. On November 4, 1979, a group of radical Islamist students, inspired by the revolutionary Iranian leader Ayatollah Khomeini, stormed the U.S. embassy in Tehran. They took fifty-two Americans hostage, and kept nearly a", "From the best-selling author of Black Hawk Down comes a riveting, definitive chronicle of the Iran hostage crisis, America's first battle with militant Islam. On November 4, 1979, a group of radical Islamist students, inspired by the revolutionary Iranian leader Ayatollah Khomeini, stormed the U.S. embassy in Tehran. They took fifty-two Americans hostage, and kept nearly all of them hostage for 444 days. In Guests of the Ayatollah, Mark Bowden tells this sweeping story through the eyes of the hostages, the soldiers in a new special forces unit sent to free them, their radical, naive captors, and the diplomats working to end the crisis. Bowden takes us inside the hostages' cells and inside the Oval Office for meetings with President Carter and his exhausted team. We travel to international capitals where shadowy figures held clandestine negotiations, and to the deserts of Iran, where a courageous, desperate attempt to rescue the hostages exploded into tragic failure. Bowden dedicated five years to this research, including numerous trips to Iran and countless interviews with those involved on both sides. Guests of the Ayatollah is a detailed, brilliantly re-created, and suspenseful account of a crisis that gripped and ultimately changed the world."], "author": "Mark Bowden", "num_pages": "704", "awards": [], "places": [], "character_names": ["Jimmy Carter"], "language": "English", "publish_date": "2007-12-01 00:00:00", "ISBN": "1555846084"},
{"url": "https://www.goodreads.com/book/show/4584536-the-life-and-times-of-the-shah", "num_ratings": "28", "num_reviews": "6", "avg_ratings": 3.86, "genres": ["History", "Biography", "Cultural", "Asia", "Politics", "Nonfiction", "Cultural", "Iran"], "title": "The Life and Times of the Shah", "description": ["This epic biography, a gripping insider's account, is a long-overdue chronicle of the life and times of Mohammad Reza Shah, who ruled from 1941 to 1979 as the last Iranian monarch. Gholam Reza Afkhami uses his unparalleled access to a large number of individuals—including high-ranking figures in the shah's regime, members of his family, and members of the opposition—to dep", "This epic biography, a gripping insider's account, is a long-overdue chronicle of the life and times of Mohammad Reza Shah, who ruled from 1941 to 1979 as the last Iranian monarch. Gholam Reza Afkhami uses his unparalleled access to a large number of individuals—including high-ranking figures in the shah's regime, members of his family, and members of the opposition—to depict the unfolding of the shah's life against the forces and events that shaped the development of modern Iran. The first major biography of the Shah in twenty-five years, this richly detailed account provides a radically new perspective on key events in Iranian history, including the 1979 revolution, U.S.-Iran relations, and Iran's nuclear program. It also sheds new light on what now drives political and cultural currents in a country at the heart of today's most perplexing geopolitical dilemmas."], "author": "Gholam Reza Afkhami", "num_pages": "740", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-01-12 00:00:00", "ISBN": "0520253280"},
{"url": "https://www.goodreads.com/book/show/610844.The_Golden_Age_of_Persia", "num_ratings": "40", "num_reviews": "3", "avg_ratings": 4.03, "genres": ["History", "Cultural", "Iran", "Nonfiction"], "title": "The Golden Age of Persia", "description": ["The definitive history of the birth and development of the great age of Iranian civilization by the world authority on ancient Persian culture. \"This book is excellently written and well-organized to present a sound but reflectively new study of Islam's penetration...into Iran.\"--\"Peter Avery, The Middle East Journal.\" "], "author": "Richard Nelson Frye", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-12-31 00:00:00", "ISBN": "1842120115"},
{"url": "https://www.goodreads.com/book/show/3182968-belonging", "num_ratings": "27", "num_reviews": "8", "avg_ratings": 4.22, "genres": ["Poetry", "Cultural", "Asia"], "title": "Belonging: New Poetry by Iranians Around the World", "description": ["Recent political developments, including the shadow of a new war, have obscured the fact that Iran has a long and splendid artistic tradition ranging from the visual arts to literature. Western readers may have some awareness of the Iranian novel thanks to a few breakout successes like ", " and ", ", but the country's strong poetic traditio", "Recent political developments, including the shadow of a new war, have obscured the fact that Iran has a long and splendid artistic tradition ranging from the visual arts to literature. Western readers may have some awareness of the Iranian novel thanks to a few breakout successes like ", " and ", ", but the country's strong poetic tradition remains little known. This anthology remedies that situation with a rich selection of recent poetry by Iranians living all around the world, including Amir-Hossein Afrasiabi: “Although the path / tracks my footsteps, / I don’t travel it / for the path travels me.” Varying dramatically in style, tone, and theme, these expertly translated works include erotic divertissements by Ziba Karbassi, rigorously formal poetry by Yadollah Royaii, experimental poems by Naanaam, powerful polemics by Maryam Huleh, and the personal-epic work of Shahrouz Rashid. Eclectic and accessible, these vibrant poems deepen the often limited awareness of Iranian identity today by not only introducing readers to contemporary Iranian poetry, but also expanding the canon of significant writing in the Persian language. ", "offers a glimpse at a complex culture through some of its finest literary talents."], "author": "Niloufar Talebi", "num_pages": "256", "awards": ["PEN/New York State Council on the Arts for Translation (0)", "Willis Barnstone Translation Prize"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-05 00:00:00", "ISBN": "1556437129"},
{"url": "https://www.goodreads.com/book/show/737154.Medieval_Persia_1040_1797", "num_ratings": "31", "num_reviews": "2", "avg_ratings": 3.94, "genres": ["History", "Cultural", "Iran", "Historical", "Medieval", "Historical"], "title": "Medieval Persia 1040-1797", "description": ["The medieval period of Persia's remarkably continuous, history began with its conquest by the Muslim Arabs in the seventh century AD and gave way to the modern period at the end of the eighteenth century when the influence of the West became pervasive. Without an understanding of the confused legacy of these centuries, no-one can hope to understand the complexities and dyn", "The medieval period of Persia's remarkably continuous, history began with its conquest by the Muslim Arabs in the seventh century AD and gave way to the modern period at the end of the eighteenth century when the influence of the West became pervasive. Without an understanding of the confused legacy of these centuries, no-one can hope to understand the complexities and dynamism of modern Iran. Concise, clear and colourful, David Morgan's book is the best and most up-to-date short account of its subject in the English language."], "author": "David Morgan", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1988-03-14 00:00:00", "ISBN": "0582493242"},
{"url": "https://www.goodreads.com/book/show/27506.State_of_Denial", "num_ratings": "3,509", "num_reviews": "230", "avg_ratings": 3.78, "genres": ["Politics", "History", "Nonfiction", "War", "War", "Military Fiction"], "title": "State of Denial", "description": ["\"Insurgents and terrorists retain the resources and capabilities to sustain and even increase current level of violence through the next year.\" This was the secret Pentagon assessment sent to the White House in May 2006. The forecast of a more violent 2007 in Iraq contradicted the repeated optimistic statements of President Bush, including one, two days earlier, when he sa", "\"Insurgents and terrorists retain the resources and capabilities to sustain and even increase current level of violence through the next year.\" This was the secret Pentagon assessment sent to the White House in May 2006. The forecast of a more violent 2007 in Iraq contradicted the repeated optimistic statements of President Bush, including one, two days earlier, when he said we were at a \"turning point\" that history would mark as the time \"the forces of terror began their long retreat.\""], "author": "Bob Woodward", "num_pages": "576", "awards": [], "places": [], "character_names": ["George W. Bush", "Condoleezza Rice", "Henry Kissinger", "Donald Rumsfeld", "Andrew Card", "Stephen Hadley"], "language": "English", "publish_date": "2006-09-30 00:00:00", "ISBN": "0743272234"},
{"url": "https://www.goodreads.com/book/show/548555.The_Art_and_Architecture_of_Mesopotamia", "num_ratings": "9", "num_reviews": "1", "avg_ratings": 4.22, "genres": ["Art", "History", "Architecture", "Nonfiction"], "title": "The Art and Architecture of Mesopotamia", "description": ["The artistic traditions of ancient Iraq, or Mesopotamia, are among the oldest in the world, for it was in this flat, fertile land between the Tigris and Euphrates rivers that the world’s first advanced civilization, that of the Sumerians, arose around 3000 BC. But the long history of Mesopotamian art was marked by change as much as continuity; the region was then as now a", "The artistic traditions of ancient Iraq, or Mesopotamia, are among the oldest in the world, for it was in this flat, fertile land between the Tigris and Euphrates rivers that the world’s first advanced civilization, that of the Sumerians, arose around 3000 BC. But the long history of Mesopotamian art was marked by change as much as continuity; the region was then as now a center of political conflict, and the Sumerians gave way to a succession of powers both indigenous and foreign, each of which left a cultural imprint.", "This volume’s contributing authors, all art historians and archaeologists specializing in the ancient Near East, provide accessible and lively overviews of the successive phases of this eventful artistic saga. The first two chapters cover the “classic” age of the great Mesopotamian city-states, from the pre-Sumerian Ubaid culture to Alexander’s conquest of Babylon; the remains of this era range from the fabulous treasures of the royal cemeteries at Ur to the mighty ziggurats of Uruk and Babylon. The third chapter concerns the Greco-Mesopotamian art of the Hellenistic dynasty founded by Alexander’s general Seleucus; the ruins of Seleucia, his capital on the Tigris, cover some 1500 acres. The fourth chapter investigates the artistic contributions of the two Persian dynasties, the Parthian and the Sassanid, that dominated the region from the first century BC to the seventh century AD and established the soaring iwan, or vaulted portico, as one of its typical architectural forms. The final chapter is devoted to the area’s early Islamic period, during which the Abbasid caliphs (eighth to thirteenth century AD) made Iraq the center of the Islamic world, constructing splendid mosques in their capitals of Baghdad and Samarra and elaborating the fantastic arabesques that have never disappeared from Islamic decorative art.", "The ancient masterpieces discussed in these chapters are depicted in 217 stunning illustrations, most of them full-color photographs, and appended to the main text is a unique visual guide to Iraq’s principal archaeological sites, which provides a further 247 black-and-white photographs. With its authoritative, up-to-date texts and this wealth of illustrations, ", " is an essential publication for anyone with an interest in the cultural heritage of mankind."], "author": "Giovanni Curatola", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "0789209217"},
{"url": "https://www.goodreads.com/book/show/16130324-children-of-the-jacaranda-tree", "num_ratings": "2,531", "num_reviews": "486", "avg_ratings": 3.45, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Historical"], "title": "Children of the Jacaranda Tree", "description": ["A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. ", "We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of", "A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. ", "We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of a guard appear at the cell door one day and, simply, take her away. Omid, at age three, witnesses the arrests of his political activist parents from his perch at their kitchen table, yogurt dripping from his fingertips. More than twenty years after the violent, bloody purge that took place inside Tehran's prisons, Sheida learns that her father was one of those executed, that the silent void firmly planted between her and her mother all these years was not just the sad loss that comes with death, but the anguish and the horror of murder. ", "Neda, Omid, and Sheida are just three of the many unforgettable characters in Sahar Delijani's startling debut novel, Children of the Jacaranda Tree. Set in post-revolutionary Iran, from 1983 to 2011, it follows a group of mothers, fathers, children, and lovers, some connected by family, others brought together by the tide of history that forces its way into their lives. Finally, years later, it is the next generation that is left with the burden of the past and their country's tenuous future as a new wave of protest and political strife begins. ", "Based on the harrowing experiences of Delijani, her family, and friends, Children of the Jacaranda Tree is a moving, timely drama about three generations of men and women moved by love, inspired by poetry, and motivated by dreams of justice and freedom. For fans of The Kite Runner and In the Shadow of the Banyan, it is a stunningly evocative look at the intimate side of revolution and a brilliant tribute to anyone who has answered the call of history."], "author": "Sahar Delijani", "num_pages": "282", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-06-18 00:00:00", "ISBN": "1476709092"},
{"url": "https://www.goodreads.com/book/show/9526.Embroideries", "num_ratings": "15,984", "num_reviews": "1,458", "avg_ratings": 3.84, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "Autobiography", "Memoir", "Cultural", "Iran"], "title": "Embroideries", "description": ["From the best–selling author of ", " comes this gloriously entertaining and enlightening look into the sex lives of Iranian women. ", " gathers together Marjane’s tough–talking grandmother, stoic mother, glamorous and eccentric aunt and their friends and neighbors for an afternoon of tea drinking and talking. Naturally, the subject turns to love, sex and the", "From the best–selling author of ", " comes this gloriously entertaining and enlightening look into the sex lives of Iranian women. ", " gathers together Marjane’s tough–talking grandmother, stoic mother, glamorous and eccentric aunt and their friends and neighbors for an afternoon of tea drinking and talking. Naturally, the subject turns to love, sex and the vagaries of men.", "As the afternoon progresses, these vibrant women share their secrets, their regrets and their often outrageous stories about, among other things, how to fake one’s virginity, how to escape an arranged marriage, how to enjoy the miracles of plastic surgery and how to delight in being a mistress. By turns revealing and hilarious, these are stories about the lengths to which some women will go to find a man, keep a man or, most important, keep up appearances. ", "Full of surprises, this introduction to the private lives of some fascinating women, whose life stories and lovers will strike us as at once deeply familiar and profoundly different from our own, is sure to bring smiles of recognition to the faces of women everywhere—and to teach us all a thing or two."], "author": "Marjane Satrapi", "num_pages": "144", "awards": ["Urhunden Prize for Foreign Album (2007)"], "places": [], "character_names": ["Marjane Satrapi"], "language": "English", "publish_date": "2006-04-18 00:00:00", "ISBN": "0375714677"},
{"url": "https://www.goodreads.com/book/show/1167230.The_Ishtar_Gate", "num_ratings": "5", "num_reviews": "0", "avg_ratings": 3.6, "genres": ["History", "Design", "Art", "Architecture"], "title": "The Ishtar Gate: The Processional Way The New Year Festival Of Babylon", "description": ["An architectural reconstruction in the Near Eastern Wing of the Staatliche Museum in Berlin"], "author": "Joachim Marzahn", "awards": [], "places": [], "character_names": [], "language": null, "ISBN": "3805313071"},
{"url": "https://www.goodreads.com/book/show/17302571-if-you-could-be-mine", "num_ratings": "6,680", "num_reviews": "1,021", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Romance", "Fiction", "Contemporary", "Glbt", "Queer"], "title": "If You Could Be Mine", "description": ["Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged f", "Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged for her marriage. Nasrin tries to persuade Sahar that they can go on as they have been, only now with new comforts provided by the decent, well-to-do doctor Nasrin will marry. But Sahar dreams of loving Nasrin exclusively—and openly.", "Then Sahar discovers what seems like the perfect solution. In Iran, homosexuality may be a crime, but to be a man trapped in a woman’s body is seen as nature’s mistake, and sex reassignment is legal and accessible. As a man, Sahar could be the one to marry Nasrin. Sahar will never be able to love the one she wants, in the body she wants to be loved in, without risking her life. Is saving her love worth sacrificing her true self?"], "author": "Sara Farizan", "num_pages": "256", "awards": ["Edmund White Award for Debut Fiction (2014)", "Ferro-Grumley Award for LGBT Fiction (2014)", "Lambda Literary Award for Debut Lesbian Fiction (2014)", "Lincoln Award Nominee (2016)"], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "1616202513"},
{"url": "https://www.goodreads.com/book/show/398073.Sumer_and_the_Sumerians", "num_ratings": "50", "num_reviews": "11", "avg_ratings": 3.5, "genres": ["History", "History", "Ancient History", "Nonfiction", "History", "Archaeology"], "title": "Sumer and the Sumerians", "description": ["Mesopotamia produced one of the best-known ancient civilizations, with a literate, urban culture and highly-developed political institutions. Harriet Crawford reviews the extraordinary social and technological developments in the region over a period of two millennia (from 3800 to 2000 BC) in this fully revised and expanded edition of her classic text. Drawing on the most", "Mesopotamia produced one of the best-known ancient civilizations, with a literate, urban culture and highly-developed political institutions. Harriet Crawford reviews the extraordinary social and technological developments in the region over a period of two millennia (from 3800 to 2000 BC) in this fully revised and expanded edition of her classic text. Drawing on the most up-to-date historical and archaeological sources, she describes the physical environment and covers architecture, trade and industry, the development of writing, and changes in social and political structures. First Edition Hb (1991): 0-521-38175-4 First Edition Pb (1991): 0-521-38850-3"], "author": "Harriet E.W. Crawford", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-08 00:00:00", "ISBN": "0521825962"},
{"url": "https://www.goodreads.com/book/show/163353.A_New_Muslim_Order", "num_ratings": "7", "num_reviews": "1", "avg_ratings": 3.14, "genres": ["Religion", "Islam"], "title": "A New Muslim Order: Iraq and the Revival of Shia Islam", "author": "Nicolas Pelham", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2008-07-15 00:00:00", "ISBN": "1845111397"},
{"url": "https://www.goodreads.com/book/show/645494.Islamic_Art_in_Detail", "num_ratings": "21", "num_reviews": "4", "avg_ratings": 3.76, "genres": ["Art", "Art", "Art History", "Cultural", "Asia"], "title": "Islamic Art in Detail", "description": ["How do we know Islamic art? What tells us that images and artifacts are products of the Muslim world, a culture that has historically extended from Spain to Southeast Asia and spanned a period from A.D. 622 to our day? This exquisitely and extensively illustrated book allows readers to identify those elements and themes that define art forms as Islamic, and to examine them", "How do we know Islamic art? What tells us that images and artifacts are products of the Muslim world, a culture that has historically extended from Spain to Southeast Asia and spanned a period from A.D. 622 to our day? This exquisitely and extensively illustrated book allows readers to identify those elements and themes that define art forms as Islamic, and to examine them in works of painting and metalwork, in calligraphy and manuscripts, ceramics, glass, wood, and ivory comprising one of the most imposing collections of arts from across the Muslim world. Arranged thematically--in chapters focusing on religion and belief, the supernatural and natural worlds, feasting, the hunt, war, music, and power--Islamic Art in Detail provides a much-needed cultural context for these widely varied works while pointing out exceptional features. In its exploration of selected works, the book juxtaposes images of each object with enlarged details--details that might otherwise be virtually invisible to the naked eye--affording surprising comparisons between seemingly unrelated pieces and offering a rare multifaceted view of the art, technique, and iconography of some of the Islamic world's most beautiful images and artifacts."], "author": "Sheila R. Canby", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-01 00:00:00", "ISBN": "0674023900"},
{"url": "https://www.goodreads.com/book/show/708988.Mesopotamia", "num_ratings": "29", "num_reviews": "3", "avg_ratings": 3.45, "genres": ["History", "Nonfiction", "History", "Ancient History", "History", "Archaeology", "Art"], "title": "Mesopotamia: Assyrians, Sumerians, Babylonians", "description": ["This beautifully illustrated guide to the ancient civilization of Mesopotamia, the region between the Tigris and Euphrates rivers, is the perfect companion for travelers and armchair travelers alike. It provides a concise survey of three ancient cultures that have often been misunderstood, both because of Biblical and neoclassical traditions, and because of twentieth- and", "This beautifully illustrated guide to the ancient civilization of Mesopotamia, the region between the Tigris and Euphrates rivers, is the perfect companion for travelers and armchair travelers alike. It provides a concise survey of three ancient cultures that have often been misunderstood, both because of Biblical and neoclassical traditions, and because of twentieth- and twenty-first-century events. Lavishly illustrated in full color on every page, the book is arranged topically to cover the broad areas of life, such as people, politics, religion, the world of the dead, and important places and monuments. The text emphasizes the archaeological and literary evidence pertaining to Mesopotamia during the period before the arrival of Alexander the Great, beginning with the written sources, including the list of Sumerian kings and the epic of Gilgamesh, and continuing with the major personages, such as the Akkadian monarchy from Sargon through Nabonedo. The book also brings together the principal Mesopotamian works of art that have been dispersed in museums worldwide - notably the materials from the Baghdad Museum that were damaged or lost in the present war. Packed with information, images, maps, diagrams, and reconstructions, ", "is the perfect companion to an important ancient civilization. "], "author": "Enrico Ascalone", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-07-02 00:00:00", "ISBN": "0520252667"},
{"url": "https://www.goodreads.com/book/show/86342.Fiasco", "num_ratings": "5,613", "num_reviews": "413", "avg_ratings": 4.1, "genres": ["History", "Nonfiction", "Politics", "War", "Military Fiction", "War"], "title": "Fiasco: The American Military Adventure in Iraq", "description": ["This is the Story of The American Military Adventure in Iraq. The Heart of the story Fiasco has to tell, which has never been told before, is that of a Military occupation whose leaders failed to see a blooming insurgency for what it was and as a result lead their soldiers in such a way that the insurgency became inevitable."], "author": "Thomas E. Ricks", "num_pages": "482", "awards": ["Pulitzer Prize Nominee for General Nonfiction (2007)", "Lionel Gelber Prize Nominee (2007)", "Ambassador Book Award for Current Affairs (2007)", "PEN/John Kenneth Galbraith Award for Nonfiction Nominee (2007)", "Arthur Ross Book Award for Honorable Mention (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-25 00:00:00", "ISBN": "159420103X"},
{"url": "https://www.goodreads.com/book/show/9322215-our-man-in-tehran", "num_ratings": "259", "num_reviews": "42", "avg_ratings": 3.92, "genres": ["History", "Nonfiction", "Cultural", "Iran", "Cultural", "Canada", "Biography", "Politics"], "title": "Our Man in Tehran: The True Story Behind the Secret Mission to Save Six Americans during the Iran Hostage Crisis and the Foreign Ambassador Who Worked with the CIA to Bring Them Home", "description": ["The world watched with fear in November 1979, when Iranian students infiltrated and occupied the American embassy in Tehran. The Americans were caught entirely by surprise, and what began as a swift and seemingly short-lived takeover evolved into a crisis that would see fifty four embassy personnel held hostage, most fo", "The world watched with fear in November 1979, when Iranian students infiltrated and occupied the American embassy in Tehran. The Americans were caught entirely by surprise, and what began as a swift and seemingly short-lived takeover evolved into a crisis that would see fifty four embassy personnel held hostage, most for 444 days. As Tehran exploded in a fury of revolution, six American diplomats secretly escaped. For three months, Ken Taylor, the Canadian ambassador to Iran—along with his wife and embassy staffers—concealed the Americans in their homes, always with the prospect that the revolutionary government of Ayatollah Khomeini would exact deadly consequences. The United States found itself handcuffed by a fractured, fundamentalist government it could not understand and had completely underestimated. With limited intelligence resources available on the ground and anti-American sentiment growing, President Carter turned to Taylor to work with the CIA in developing their exfiltration plans. Until now, the true story behind Taylor’s involvement in the escape of the six diplomats and the Eagle Claw commando raid has remained classified.", "In ", "Robert Wright takes us back to a major historical flashpoint and unfolds a story of cloak-and-dagger intrigue that brings a new understanding of the strained relationship between the Unites States and Iran. With the world once again focused on these two countries, this book is the stuff of John le Carré and Daniel Silva made real."], "author": "Robert  Wright", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-11 00:00:00", "ISBN": "1590514130"},
{"url": "https://www.goodreads.com/book/show/3909038-the-strongest-tribe", "num_ratings": "329", "num_reviews": "28", "avg_ratings": 4.12, "genres": ["Nonfiction", "War", "Military Fiction", "Politics", "War"], "title": "The Strongest Tribe: War, Politics, and the Endgame in Iraq", "description": ["This Important Volume: The Strongest Tribe: War, Politics, and the Endgame in Iraq, is an important new chronicle in the Iraq war. Bing West reveals how America reached the brink of defeat in 2006 and then managed in 2007 to stage a stunning turnover. This book is a fitting tribute to the honor, valor and toughness of our soldiers. Sometimes the best way to support the tro", "This Important Volume: The Strongest Tribe: War, Politics, and the Endgame in Iraq, is an important new chronicle in the Iraq war. Bing West reveals how America reached the brink of defeat in 2006 and then managed in 2007 to stage a stunning turnover. This book is a fitting tribute to the honor, valor and toughness of our soldiers. Sometimes the best way to support the troops s to criticize the generals."], "author": "Bing West", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-12 00:00:00", "ISBN": "1400067014"},
{"url": "https://www.goodreads.com/book/show/3236297-war-journal", "num_ratings": "326", "num_reviews": "73", "avg_ratings": 4.25, "genres": ["Nonfiction", "War", "History", "Autobiography", "Memoir", "Writing", "Journalism", "War", "Military Fiction"], "title": "War Journal: My Five Years In Iraq", "description": ["Book by Engel, Richard"], "author": "Richard Engel", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-03 00:00:00", "ISBN": "1416563040"},
{"url": "https://www.goodreads.com/book/show/184713.The_Heart_s_Desire", "num_ratings": "32", "num_reviews": "2", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Iran"], "title": "The Heart's Desire", "description": ["\"Jennifer Sahary, an American artist, and her husband Karim, a professor and Iranian immigrant, make an extended visit to Teheran shortly after the Iran-Iraq War, encountering unforeseen dangers and sexual temptations that change the course of their lives.", "When their young son is taken by his grandmother to the holy city of Qom without Jennifer’s knowledge, she sets out to", "\"Jennifer Sahary, an American artist, and her husband Karim, a professor and Iranian immigrant, make an extended visit to Teheran shortly after the Iran-Iraq War, encountering unforeseen dangers and sexual temptations that change the course of their lives.", "When their young son is taken by his grandmother to the holy city of Qom without Jennifer’s knowledge, she sets out to find him, learning much about Iran and about herself along the way. And as Karim renews contact with his family and surveys the misery and needs of his war-torn country, he begins to question where he can best achieve his ideals.", "In sensuous and elegant prose, Rachlin weaves the interlinking stories of a man and a woman and their contrasting cultures with balance and sympathy.", "Nahid Rachlin is an Iranian who lives in New York City, where she teaches creative writing at Barnard College. She is author of Veils: Short Stories and Married to a Stranger (both published by City Lights) and Foreigner (W. W. Norton)."], "author": "Nahid Rachlin", "num_pages": "198", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2001-01-01 00:00:00", "ISBN": "0872863050"},
{"url": "https://www.goodreads.com/book/show/206873.The_Fortune_Catcher", "num_ratings": "85", "num_reviews": "14", "avg_ratings": 4.26, "genres": ["Fiction", "Family"], "title": "The Fortune Catcher", "description": ["Like Jean P. Sassoon's Princess, this emotionally charged debut novel offers a penetrating look behind the curtain of secrecy that shrouds modern Iran, exploring the dreams of the women there and telling the dramatic story of an American-Iranian woman whose once-perfect life and love fall victim to the battle between old and new ways."], "author": "Susanne Pari", "num_pages": "436", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-10-01 00:00:00", "ISBN": "0446520713"},
{"url": "https://www.goodreads.com/book/show/109512.The_Fist_of_God", "num_ratings": "9,423", "num_reviews": "206", "avg_ratings": 4.0, "genres": ["Fiction", "Thriller", "War", "Spy Thriller", "Espionage"], "title": "The Fist of God", "description": ["From the bestselling author of ", ", international master of intrigue Frederick Forsyth, comes a thriller that brilliantly  blends fact with fiction for one of this summer's--or any season's--most  explosive reads!", "From the behind-the-scenes decision-making of the Allies to the secret meetings of Saddam Hussein's war cabinet, from the brave American fliers", "From the bestselling author of ", ", international master of intrigue Frederick Forsyth, comes a thriller that brilliantly  blends fact with fiction for one of this summer's--or any season's--most  explosive reads!", "From the behind-the-scenes decision-making of the Allies to the secret meetings of Saddam Hussein's war cabinet, from the brave American fliers running their dangerous missions over Iraq to the heroic young spy planted deep in the heart of Baghdad, Forsyth's incomparable storytelling skill keeps the suspense at a breakneck pace.  Somewhere in Baghdad is the mysterious \"Jericho,\" the traitor who is willing--for a price--to reveal what is going on in the high councils of the Iraqi dictator.  But Saddam's ultimate weapon has been kept secret even from his most trusted advisers, and the nightmare scenario that haunts General Schwarzkopf and his colleagues is suddenly imminent, unless somehow, the spy can locate that weapon--The Fist of God--in time. Peopled with vivid characters, brilliantly displaying Forsyth's incomparable, knowledge of intelligence operations and tradecraft, moving back and forth between Washington and London, Baghdad and Kuwait, desert vastnesses and city bazaars, this breathtaking novel is an utterly convincing story of what may actually have happened behind the headlines."], "author": "Frederick Forsyth", "num_pages": "573", "awards": [], "places": ["Iraq"], "character_names": ["Saddam Hussein", "Benjamin Netanyahu", "Mike Martin", "Terry Martin", "Don Walker", "Tim Nathanson", "Steve Laing", "Simon Paxman", "Hassan Rahmani", "Omar Khatib", "Osman Badri", "Salah Siddiqui", "Kobi Dror", "Karim Aziz", "Edith Hardenberg", "Wolfgang Gemütlich", "Norman Schwarzkopf", "Chip Barber", "Leila Al-Hilla"], "language": "English", "publish_date": "1995-07-01 00:00:00", "ISBN": "0553572423"},
{"url": "https://www.goodreads.com/book/show/13588425-argo", "num_ratings": "10,427", "num_reviews": "1,175", "avg_ratings": 3.84, "genres": ["Nonfiction", "History", "Audiobook", "Politics", "Autobiography", "Memoir"], "title": "Argo: How the CIA & Hollywood Pulled Off the Most Audacious Rescue in History", "description": ["On November 4, 1979, Iranian militants stormed the American embassy in Tehran and held dozens of Americans hostage, sparking a 444-day ordeal and a quake in global politics that still reverberates today. Beaneath this crisis another shocking story was known by only a select few: six Americans escaped the", "On November 4, 1979, Iranian militants stormed the American embassy in Tehran and held dozens of Americans hostage, sparking a 444-day ordeal and a quake in global politics that still reverberates today. Beaneath this crisis another shocking story was known by only a select few: six Americans escaped the embassy and hid within a city roiling with suspicion and fear. A top-level CIA officer named Antonio Mendez devised an ingenious yet incredibly risky plan to rescue them before they were detected. Disguising himself as a Hollywood producer, and supported by a cast of expert forgers, deep-cover CIA operatives, foreign agents, and Hollywood special-effects artists, Mendez traveled to Tehran under the guise of scouting locations for a fake science fiction film called \"Argo.\" While pretending to find the ideal film backdrops, Mendez and a colleague succeeded in contacting the escapees and eventually smuggled them out of Iran.", "After more than three decades, Antonio Mendez finally details the extraordinarily complex and dangerous operation he led. A riveting story of secret identities, international intrigue, and good old-fashioned American ingenuity, ", " is the pulse-pounding account of the history-making collusion between Hollywood and high-stakes espionage."], "author": "Antonio J. Méndez", "num_pages": "310", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-13 00:00:00", "ISBN": "0670026220"},
{"url": "https://www.goodreads.com/book/show/1208948.Zadig", "num_ratings": "4,744", "num_reviews": "252", "avg_ratings": 3.78, "genres": ["Classics", "Philosophy", "Fiction", "Cultural", "France", "European Literature", "French Literature", "Literature"], "title": "Zadig", "description": ["\" Je vous offre la traduction d'un livre d'un ancien sage, qui, ayant le bonheur de n'avoir rien à faire, eut celui de s'amuser à écrire l'histoire de Zadig : ouvrage qui dit plus qu'il ne semble dire. Je vous prie de le lire et d'en juger \". Sadi écrit ici à la sultane Sheraa et Voltaire s'adresse à nous...", "Marchons donc sur les traces de Zadig, partageons ses aventures et", "\" Je vous offre la traduction d'un livre d'un ancien sage, qui, ayant le bonheur de n'avoir rien à faire, eut celui de s'amuser à écrire l'histoire de Zadig : ouvrage qui dit plus qu'il ne semble dire. Je vous prie de le lire et d'en juger \". Sadi écrit ici à la sultane Sheraa et Voltaire s'adresse à nous...", "Marchons donc sur les traces de Zadig, partageons ses aventures et découvrons le monde par ses yeux. Avec lui, regardons nos coutumes et nos institutions ; interrogeons-nous sur le sens de notre existence."], "author": "Voltaire", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "French", "publish_date": "1996-02-06 00:00:00", "ISBN": "2080720309"},
{"url": "https://www.goodreads.com/book/show/9919919-discourses-of-rumi", "num_ratings": "1,105", "num_reviews": "107", "avg_ratings": 4.23, "genres": ["Religion", "Poetry", "Literature", "Religion", "Islam"], "title": "Discourses of Rumi", "description": ["The discourses of Jalāl al-Dīn Rūmī, Muslim saint, mystic and poet of the thirteenth century, here translated for the first time out of the original Persian, must be allowed to rank amongst the most remarkable documents of religious literature."], "author": "Rumi", "num_pages": "286", "awards": [], "places": ["Konya"], "character_names": [], "language": "English", "publish_date": "1995-01-17 00:00:00", "ISBN": "0203696255"},
{"url": "https://www.goodreads.com/book/show/683915.The_Mathnawi_of_Jalalu_ddin_Rumi_Set", "num_ratings": "3,306", "num_reviews": "167", "avg_ratings": 4.44, "genres": ["Poetry", "Philosophy", "Literature"], "title": "The Mathnawi of Jalalu'ddin Rumi Set", "description": ["A three volume set of Nicholson's translation of Rumi's famous poem on Islamic mysticism."], "author": "Rumi", "num_pages": "1000", "awards": [], "places": ["Persia"], "character_names": [], "language": "English", "publish_date": "1990-06-01 00:00:00", "ISBN": "0906094275"},
{"url": "https://www.goodreads.com/book/show/244616.In_the_Rose_Garden_of_the_Martyrs", "num_ratings": "296", "num_reviews": "37", "avg_ratings": 3.47, "genres": ["Cultural", "Iran", "Autobiography", "Memoir", "Nonfiction", "History", "Biography Memoir", "Biography", "Travel", "Cultural", "Religion", "Travel", "Travelogue"], "title": "In the Rose Garden of the Martyrs: A Memoir of Iran", "description": ["The history of Iran in the late twentieth century is a chronicle of religious fervor and violent change -- from the Islamic Revolution that ousted the Shah in favor of a rigid fundamentalist government to the bloody eight-year war with Saddam Hussein's Iraq. But what happened to the hostage-takers, the suicidal holy warriors, the martyrs, and the mullahs responsible for th", "The history of Iran in the late twentieth century is a chronicle of religious fervor and violent change -- from the Islamic Revolution that ousted the Shah in favor of a rigid fundamentalist government to the bloody eight-year war with Saddam Hussein's Iraq. But what happened to the hostage-takers, the suicidal holy warriors, the martyrs, and the mullahs responsible for the now moribund revolution? Is modern Iran a society at peace with itself and the world, or truly a dangerous spoke in the \"Axis of Evil\"?", "Christopher de Bellaigue, a Western journalist married to an Iranian woman and a longtime resident of a prosperous suburb of Tehran, offers a stunning insider's view of a culture hitherto hidden from American eyes, and reveals the true hearts and minds of an extraordinary people."], "author": "Christopher De Bellaigue", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-03 00:00:00", "ISBN": "0060935367"},
{"url": "https://www.goodreads.com/book/show/184714.Married_to_a_Stranger", "num_ratings": "68", "num_reviews": "6", "avg_ratings": 3.54, "genres": ["Fiction", "Cultural", "Iran", "Romance", "Literature", "Asian Literature"], "title": "Married to a Stranger", "description": ["A woman's struggle for self-realization in contemporary Iran, a novel with \"the clarity and spare sensuousness of Persian poetry or miniature painting.\"-Ruth Prawer Jhabvala", "When Minou Hakini marries a man of her own choosing—an intellectual and a radical—and moves to Abadan, a thriving oil town near the Iraqi border, she imagines her life will be adventurous and liberating", "A woman's struggle for self-realization in contemporary Iran, a novel with \"the clarity and spare sensuousness of Persian poetry or miniature painting.\"-Ruth Prawer Jhabvala", "When Minou Hakini marries a man of her own choosing—an intellectual and a radical—and moves to Abadan, a thriving oil town near the Iraqi border, she imagines her life will be adventurous and liberating. Before long, however, she becomes aware of her husband's suspicious liaisons and dangerous activities. Her struggle to forge her own identity as a woman in contemporary Iran is charged with passion, anger, and finally a need to escape.", "Nahid Rachlin is an Iranian who lives in New York and teaches at Barnard College. She is the author of Foreigner and The Heart's Desire, both novels, and Veils, a collection of short stories."], "author": "Nahid Rachlin", "num_pages": "220", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2001-01-01 00:00:00", "ISBN": "0872862763"},
{"url": "https://www.goodreads.com/book/show/7235950-nabucco", "num_ratings": "9", "num_reviews": "1", "avg_ratings": 4.33, "genres": [], "title": "Nabucco: Italian Language Edition, Vocal Score", "description": ["Expertly arranged Vocal Score by Giuseppe Verdi from the Kalmus Edition series. This Opera Score is from the Romantic era."], "author": "Giuseppe Verdi", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-03-01 00:00:00", "ISBN": "0769264808"},
{"url": "https://www.goodreads.com/book/show/45386.Persian_Girls", "num_ratings": "3,000", "num_reviews": "524", "avg_ratings": 3.88, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Iran", "Biography"], "title": "Persian Girls", "description": ["For many years, heartache prevented Nahid Rachlin from turning her sharp novelist's eye inward: to tell the story of how her own life diverged from that of her closest confidante and beloved sister, Pari. Growing up in Iran, both refused to accept traditional Muslim mores, and dreamed of careers in literature and on the stage. Their lives changed abruptly when Pari was coe", "For many years, heartache prevented Nahid Rachlin from turning her sharp novelist's eye inward: to tell the story of how her own life diverged from that of her closest confidante and beloved sister, Pari. Growing up in Iran, both refused to accept traditional Muslim mores, and dreamed of careers in literature and on the stage. Their lives changed abruptly when Pari was coerced by their father into marrying a wealthy and cruel suitor. Nahid narrowly avoided a similar fate, and instead negotiated with him to pursue her studies in America.", " When Nahid received the unsettling and mysterious news that Pari had died after falling down a flight of stairs, she traveled back to Iran-now under the Islamic regime-to find out what happened to her truest friend, confront her past, and evaluate what the future holds for the heartbroken in a tale of crushing sorrow, sisterhood, and ultimately, hope."], "author": "Nahid Rachlin", "num_pages": "304", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2006-10-05 00:00:00", "ISBN": "1585425206"},
{"url": "https://www.goodreads.com/book/show/15814104-a-teaspoon-of-earth-and-sea", "num_ratings": "2,020", "num_reviews": "359", "avg_ratings": 3.73, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Contemporary", "Literary Fiction"], "title": "A Teaspoon of Earth and Sea", "description": [" Growing up in a small rice-farming village in 1980s Iran, eleven-year-old Saba Hafezi and her twin sister, Mahtab, are captivated by America. They keep lists of English words and collect illegal ", " magazines, television shows, and rock music. So when her", " Growing up in a small rice-farming village in 1980s Iran, eleven-year-old Saba Hafezi and her twin sister, Mahtab, are captivated by America. They keep lists of English words and collect illegal ", " magazines, television shows, and rock music. So when her mother and sister disappear, leaving Saba and her father alone in Iran, Saba is certain that they have moved to America without her. But her parents have taught her that “all fate is written in the blood,” and that twins will live the same life, even if separated by land and sea. As she grows up in the warmth and community of her local village, falls in and out of love, and struggles with the limited possibilities in post-revolutionary Iran, Saba envisions that there is another way for her story to unfold. Somewhere, it must be that her sister is living the Western version of this life. And where Saba’s world has all the grit and brutality of real life under the new Islamic regime, her sister’s experience gives her a freedom and control that Saba can only dream of."], "author": "Dina Nayeri", "num_pages": "432", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-01-31 00:00:00", "ISBN": "1594487049"},
{"url": "https://www.goodreads.com/book/show/129118.Journey_from_the_Land_of_No", "num_ratings": "936", "num_reviews": "109", "avg_ratings": 3.72, "genres": ["Cultural", "Iran", "Autobiography", "Memoir", "Nonfiction", "Biography Memoir", "History", "Biography", "Religion", "Womens", "Religion", "Judaism", "Religion", "Islam"], "title": "Journey from the Land of No: A Girlhood Caught in Revolutionary Iran", "description": ["“We stormed every classroom, inscribed our slogans on the blackboard . . . Never had mayhem brought more peace. All our lives we had been taught the virtues of behaving, and now we were discovering the importance of misbehaving. Too much fear had tainted our days. Too many afternoons had passed in silence, listening to a fanatic’s diatribes. We were rebel", "“We stormed every classroom, inscribed our slogans on the blackboard . . . Never had mayhem brought more peace. All our lives we had been taught the virtues of behaving, and now we were discovering the importance of misbehaving. Too much fear had tainted our days. Too many afternoons had passed in silence, listening to a fanatic’s diatribes. We were rebelling because we were not evil, we had not sinned, and we knew nothing of the apocalypse. . . . This was 1979, the year that showed us we could make our own destinies. We were rebelling because rebelling was all we could do to quell the rage in our teenage veins. Together as girls we found the courage we had been told was not in us.”", " Roya Hakakian recalls her childhood and adolescence in prerevolutionary Iran with candor and verve. The result is a beautifully written coming-of-age story about one deeply intelligent and perceptive girl’s attempt to ï¬?nd an authentic voice of her own at a time of cultural closing and repression. Remarkably, she manages to re-create a time and place dominated by religious fanaticism, violence, and fear with an open heart and often with great humor.", "Hakakian was twelve years old in 1979 when the revolution swept through Tehran. The daughter of an esteemed poet, she grew up in a household that hummed with intellectual life. Family gatherings were punctuated by witty, satirical exchanges and spontaneous recitations of poetry. But the Hakakians were also part of the very small Jewish population in Iran who witnessed the iron fist of the Islamic fundamentalists increasingly tightening its grip. It is with the innocent confusion of youth that Roya describes her discovery of a swastika—“a plus sign gone awry, a dark reptile with four hungry claws”—painted on the wall near her home. As a schoolgirl she watched as friends accused of reading blasphemous books were escorted from class by Islamic Society guards, never to return. Only much later did Roya learn that she was spared a similar fate because her teacher admired her writing.", "Hakakian relates in the most poignant, and at times painful, ways what life was like for women after the country fell into the hands of Islamic fundamentalists who had declared an insidious war against them, but we see it all through the eyes of a strong, youthful optimist who somehow came up in the world believing that she was different, knowing she was special. At her loneliest, Roya discovers the consolations of writing while sitting on the rooftop of her house late at night. There, “pen in hand, I led my own chorus of words, with a melody of my own making.” And she discovers the craft that would ultimately enable her to find her own voice and become her own person.", "A wonderfully evocative story, ", " reveals an Iran most readers have not encountered and marks the debut of a stunning new talent."], "author": "Roya Hakakian", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-28 00:00:00", "ISBN": "0609810308"},
{"url": "https://www.goodreads.com/book/show/310648.Gilgamesh_the_King", "num_ratings": "574", "num_reviews": "50", "avg_ratings": 3.71, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Science Fiction", "Fantasy", "Mythology", "Historical"], "title": "Gilgamesh the King", "description": ["The epic tale of Gilgamesh, the legendary god-king of Sumeria who discovered the secret of eternal life, has enflamed the imaginations of countless generations. In Gilgamesh, science fiction Grand Master Robert Silverberg gives us a vivid portrait of a courageous, lusty, sometimes reckless ruler of men. It is the majestic tale of a man haunted by gods, tormented by his pas", "The epic tale of Gilgamesh, the legendary god-king of Sumeria who discovered the secret of eternal life, has enflamed the imaginations of countless generations. In Gilgamesh, science fiction Grand Master Robert Silverberg gives us a vivid portrait of a courageous, lusty, sometimes reckless ruler of men. It is the majestic tale of a man haunted by gods, tormented by his passion for a woman who was his greatest rival, and driven by a thirst for immortality."], "author": "Robert Silverberg", "num_pages": "320", "awards": ["Tähtifantasia Award Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-09 00:00:00", "ISBN": "1416504796"},
{"url": "https://www.goodreads.com/book/show/361184.The_Code_of_Hammurabi_King_of_Babylon", "num_ratings": "692", "num_reviews": "59", "avg_ratings": 3.45, "genres": ["History", "Classics", "Nonfiction", "Philosophy", "Law"], "title": "The Code of Hammurabi King of Babylon", "description": ["This book on the legal Code of Hammurabi was published only three years after the monument on which it was engraved was discovered. ", "This book on the legal Code of Hammurabi was published only three years after the monument on which it was engraved was discovered. "], "author": "Hammurabi", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-01 00:00:00", "ISBN": "1410201023"},
{"url": "https://www.goodreads.com/book/show/46349.Funny_in_Farsi", "num_ratings": "15,863", "num_reviews": "2,280", "avg_ratings": 3.78, "genres": ["Autobiography", "Memoir", "Nonfiction", "Humor", "Biography"], "title": "Funny in Farsi: A Memoir of Growing Up Iranian in America", "description": ["In 1972, when she was seven, Firoozeh Dumas and her family moved from Iran to Southern California, arriving with no firsthand knowledge of this country beyond her father's glowing memories of his graduate school years here. More family soon followed, and the clan has been here ever since. ", " chronicles the American journey of Dumas's wonderfully engaging family", "In 1972, when she was seven, Firoozeh Dumas and her family moved from Iran to Southern California, arriving with no firsthand knowledge of this country beyond her father's glowing memories of his graduate school years here. More family soon followed, and the clan has been here ever since. ", " chronicles the American journey of Dumas's wonderfully engaging family: her engineer father, a sweetly quixotic dreamer who first sought riches on ", " and in Las Vegas, and later lost his job during the Iranian revolution; her elegant mother, who never fully mastered English (nor cared to); her uncle, who combated the effects of American fast food with an army of miraculous American weight-loss gadgets; and Firoozeh herself, who as a girl changed her name to Julie, and who encountered a second wave of culture shock when she met and married a Frenchman, becoming part of a one-couple melting pot."], "author": "Firoozeh Dumas", "num_pages": "240", "awards": ["Thurber Prize Nominee for American Humor (2005)"], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2004-01-13 00:00:00", "ISBN": "0812968379"},
{"url": "https://www.goodreads.com/book/show/892675.Sumer", "num_ratings": "20", "num_reviews": "3", "avg_ratings": 3.8, "genres": ["History"], "title": "Sumer: Cities of Eden", "description": ["Readers assume the role of archaeologists, uncovering secrets of ancient civilizations. Stunning photographs and illustrations, plus detailed cutaways, maps and diagrams."], "author": "Dale  Brown", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-06-01 00:00:00", "ISBN": "0809498871"},
{"url": "https://www.goodreads.com/book/show/4362.Night_Draws_Near", "num_ratings": "671", "num_reviews": "69", "avg_ratings": 4.09, "genres": ["History", "Nonfiction", "Politics", "War", "Writing", "Journalism"], "title": "Night Draws Near: Iraq's People in the Shadow of America's War", "description": ["In 2003, ", "'s Anthony Shadid went to war in Iraq, but not as an embedded journalist. Born and raised in Oklahoma, of Lebanese descent, Shadid, a fluent Arabic s", "In 2003, ", "'s Anthony Shadid went to war in Iraq, but not as an embedded journalist. Born and raised in Oklahoma, of Lebanese descent, Shadid, a fluent Arabic speaker, has spent the last three years dividing his time between Washington, D.C., and Baghdad. The only journalist to win a Pulitzer Prize for his extraordinary coverage of Iraq, Shadid is also the only writer to describe the human story of ordinary Iraqis weathering the unexpected impact of America's invasion and occupation. Through the moving stories of individual Iraqis, Shadid shows how Saddam's downfall paved the way not just for hopes of democracy but also for the importation of jihad and the rise of a bloody insurgency. \"A superb reporter's book,\" wrote Seymour Hersh; ", " is, according to Mark Danner, \"essential.\""], "author": "Anthony Shadid", "num_pages": "507", "awards": ["Los Angeles Times Book Prize for Current Interest (2005)", "Ridenhour Book Prize (2006)", "National Book Critics Circle Award Nominee for General Nonfiction (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-11 00:00:00", "ISBN": "0312426038"},
{"url": "https://www.goodreads.com/book/show/372850.The_Warrior_Who_Carried_Life", "num_ratings": "135", "num_reviews": "15", "avg_ratings": 3.58, "genres": ["Fantasy", "Fiction", "Science Fiction", "Speculative Fiction"], "title": "The Warrior Who Carried Life", "description": ["The story of a quest for revenge which becomes a quest for the infinite. Cara was five years old when her mother was killed. She was killed for going down into the wells of vision, where only men were allowed. Cara in turn seeks justice by transforming herself into a male warrior."], "author": "Geoff Ryman", "num_pages": "198", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1986-12-01 00:00:00", "ISBN": "0553263447"},
{"url": "https://www.goodreads.com/book/show/10290681-ode-to-fragile", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 4.17, "genres": ["Poetry"], "title": "Ode to Fragile", "description": ["A collection of poetry."], "author": "Shabnam Piryaei", "num_pages": "90", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-15 00:00:00", "ISBN": "193551475X"},
{"url": "https://www.goodreads.com/book/show/13514994-a-bitter-veil", "num_ratings": "570", "num_reviews": "112", "avg_ratings": 3.86, "genres": ["Historical", "Historical Fiction", "Fiction", "Mystery", "Romance", "Cultural", "Iran", "Suspense", "Thriller"], "title": "A Bitter Veil", "description": ["It all began with a line of Persian poetry . . .", "Anna and Nouri, both studying in Chicago, fall in love despite their very different backgrounds. Anna, who has never been close to her parents, is more than happy to return with Nouri to his native Iran, to be embraced by his wealthy family. Beginning their married life together in 1978, their world is abruptly turned upside", "It all began with a line of Persian poetry . . .", "Anna and Nouri, both studying in Chicago, fall in love despite their very different backgrounds. Anna, who has never been close to her parents, is more than happy to return with Nouri to his native Iran, to be embraced by his wealthy family. Beginning their married life together in 1978, their world is abruptly turned upside down by the overthrow of the Shah, and the rise of the Islamic Republic.", "Under the Ayatollah Khomeini and the Republican Guard, life becomes increasingly restricted and Anna must learn to exist in a transformed world, where none of the familiar Western rules apply. Random arrests and torture become the norm, women are required to wear hijab, and Anna discovers that she is no longer free to leave the country.", "As events reach a fevered pitch, Anna realizes that nothing is as she thought, and no one can be trusted…not even her husband."], "author": "Libby Fischer Hellmann", "num_pages": "314", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-15 00:00:00", "ISBN": "0983193814"},
{"url": "https://www.goodreads.com/book/show/16172.Desert_Queen", "num_ratings": "2,907", "num_reviews": "493", "avg_ratings": 3.9, "genres": ["Biography", "History", "Nonfiction", "Travel", "Adventure"], "title": "Desert Queen: The Extraordinary Life of Gertrude Bell: Adventurer, Adviser to Kings, Ally of Lawrence of Arabia", "description": ["Turning away from the privileged world of the \"eminent Victorians,\" Gertrude Bell (1868—1926) explored, mapped, and excavated the world of the Arabs. Recruited by British intelligence during World War I, she played a crucial role in obtaining the loyalty of Arab leaders, and her connections and information provided the brains to match T. E. Lawrence's brawn. After the war,", "Turning away from the privileged world of the \"eminent Victorians,\" Gertrude Bell (1868—1926) explored, mapped, and excavated the world of the Arabs. Recruited by British intelligence during World War I, she played a crucial role in obtaining the loyalty of Arab leaders, and her connections and information provided the brains to match T. E. Lawrence's brawn. After the war, she played a major role in creating the modern Middle East and was, at the time, considered the most powerful woman in the British Empire.", " ", "In this masterful biography, Janet Wallach shows us the woman behind these achievements–a woman whose passion and defiant independence were at odds wit the confined and custom-bound England she left behind. Too long eclipsed by Lawrence, Gertrude Bell emerges at last in her own right as a vital player on the stage of modern history, and as a woman whose life was both a heartbreaking story and a grand adventure."], "author": "Janet Wallach", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-07-12 00:00:00", "ISBN": "1400096197"},
{"url": "https://www.goodreads.com/book/show/23317959-keep-eyes-behind", "num_ratings": "5", "num_reviews": "1", "avg_ratings": 4.6, "genres": [], "title": "Keep Eyes Behind", "description": ["It is a time of danger. A colony of Persian refugees is under attack. Corrupt and powerful ministers of the Sultan have banished the community's well-loved and benevolent leader. Within three days a perfect horse must be found to carry him out of Baghdad in the majesty befitting his station. The 11-year-old story narrator, her 8-year old brother, and their uncle are chosen", "It is a time of danger. A colony of Persian refugees is under attack. Corrupt and powerful ministers of the Sultan have banished the community's well-loved and benevolent leader. Within three days a perfect horse must be found to carry him out of Baghdad in the majesty befitting his station. The 11-year-old story narrator, her 8-year old brother, and their uncle are chosen for the task because of their uncanny ability with horses. Enemies pursue them during their journey by carriage, horseback, and river barge. In order to protect themselves the children and their uncle must acquire the ability that horses have to see behind without turning their head. In spite of their vigilance they fall prey to poisoning, kidnapping, and murder attempts. Two horses, a magnificent Arabian mare and her wild foal, join them and expose the most ruthless instigator of hate crimes against their community. Along the way the trio discovers that trusting their own intuition is the best protection-a lesson that will help each one to survive separation from family and community.\""], "author": "Beverlee Patton", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-01 00:00:00", "ISBN": "0990461300"},
{"url": "https://www.goodreads.com/book/show/237255.Hubris", "num_ratings": "1,328", "num_reviews": "116", "avg_ratings": 3.94, "genres": ["Politics", "History", "Nonfiction", "War", "North American Hi...", "American History"], "title": "Hubris: The Inside Story of Spin, Scandal, and the Selling of the Iraq War", "description": ["March 2003: The United States invades Iraq. ", "October 2006: The world finds out why. ", "What was really behind the U.S.-led invasion of Iraq? As George W. Bush steered the nation to war, who spoke the truth and who tried to hide it? \"Hubris\" takes us behind the scenes at the Bush White House, the CIA, the Pentagon, the State Department, and Congress to answer all the vital ques", "March 2003: The United States invades Iraq. ", "October 2006: The world finds out why. ", "What was really behind the U.S.-led invasion of Iraq? As George W. Bush steered the nation to war, who spoke the truth and who tried to hide it? \"Hubris\" takes us behind the scenes at the Bush White House, the CIA, the Pentagon, the State Department, and Congress to answer all the vital questions about how the Bush administration came to invade Iraq. ", "Filled with new revelations, \"Hubris\" is a gripping narrative of intrigue that connects the dots between George W. Bush's expletive-laden outbursts at Saddam Hussein, the bitter battles between the CIA and the White House, the fights within the intelligence community over Saddam's weapons of mass destruction, the startling influence of an obscure academic on top government officials, the \"real \"reason Valerie Plame was outed, and a top reporter's ties to wily Iraqi exiles trying to start a war. Written by veteran reporters Michael Isikoff and David Corn, this is the inside story of how President Bush took the nation to war using faulty and fraudulent intelligence. It is a news-making account of conspiracy, backstabbing, bureaucratic ineptitude, journalistic malfeasance, and, especially, arrogance."], "author": "Michael Isikoff", "num_pages": "463", "awards": ["Audie Award for Politics (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-04 00:00:00", "ISBN": "0307346811"},
{"url": "https://www.goodreads.com/book/show/20313316-a-dangerous-element", "num_ratings": "24", "num_reviews": "14", "avg_ratings": 4.17, "genres": [], "title": "A Dangerous Element", "description": ["Written by retired USAF Colonel Gregory S. Lamb, \"A Dangerous Element\" is based heavily on events you'll be surprised to see in the news. It will take you past the Iranian borders into their nuclear weapons development and uncover a top-secret weapon developed by DARPA - through the eyes of a former combat pilot who knows how to work the system. Description: An American co", "Written by retired USAF Colonel Gregory S. Lamb, \"A Dangerous Element\" is based heavily on events you'll be surprised to see in the news. It will take you past the Iranian borders into their nuclear weapons development and uncover a top-secret weapon developed by DARPA - through the eyes of a former combat pilot who knows how to work the system. Description: An American covert operation to destroy the nuclear enrichment program at Natanz, Iran goes bad when a virus is discovered in the facility's closed control network. Former combat pilot, Colonel Mark \"Coolhand\" Reynolds holds the key to unraveling the cast of shady characters involved in the operation and cover up. In doing so, he becomes a target of another top-secret weapon developed by DARPA. With Iran threatening retribution and the start of a thermonuclear war, Coolhand doesn't have time to fix things the right way."], "author": "Gregory S. Lamb", "num_pages": "282", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-03-13 00:00:00", "ISBN": "1940820103"},
{"url": "https://www.goodreads.com/book/show/52142.The_Great_War_for_Civilisation", "num_ratings": "3,700", "num_reviews": "377", "avg_ratings": 4.39, "genres": ["History", "Nonfiction", "Politics", "War"], "title": "The Great War for Civilisation: The Conquest of the Middle East", "description": ["A sweeping and dramatic history of the last half century of conflict in the Middle East from an award-winning journalist who has covered the region for over thirty years, The Great War for Civilisation unflinchingly chronicles the tragedy of the region from the Algerian Civil War to the Iranian Revolution; from the American hostage crisis in Beirut to the Iran-Iraq War; fr", "A sweeping and dramatic history of the last half century of conflict in the Middle East from an award-winning journalist who has covered the region for over thirty years, The Great War for Civilisation unflinchingly chronicles the tragedy of the region from the Algerian Civil War to the Iranian Revolution; from the American hostage crisis in Beirut to the Iran-Iraq War; from the 1991 Gulf War to the American invasion of Iraq in 2003. A book of searing drama as well as lucid, incisive analysis, The Great War for Civilisation is a work of major importance for today's world."], "author": "Robert Fisk", "num_pages": "1136", "awards": ["National Book Critics Circle Award Nominee for General Nonfiction (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-13 00:00:00", "ISBN": "1400075173"},
{"url": "https://www.goodreads.com/book/show/2627504-a-universal-history-of-the-destruction-of-books", "num_ratings": "458", "num_reviews": "98", "avg_ratings": 3.96, "genres": ["History", "Nonfiction", "Writing", "Books About Books", "Cultural"], "title": "A Universal History of the Destruction of Books: From Ancient Sumer to Modern-Day Iraq", "description": ["A best-seller in Spain, Mexico, Venezuela, Argentina, and Brazil: the first-ever world history of the destruction of books. ", "A product of ten years of research and support from leading American and European universities, \"A Universal History of the Destruction of Books\" traces a tragic story: the smashed tablets of ancient Sumer, the widespread looting of libraries in post-", "A best-seller in Spain, Mexico, Venezuela, Argentina, and Brazil: the first-ever world history of the destruction of books. ", "A product of ten years of research and support from leading American and European universities, \"A Universal History of the Destruction of Books\" traces a tragic story: the smashed tablets of ancient Sumer, the widespread looting of libraries in post-war Iraq, the leveling of the Library of Alexandria, book burnings by Crusaders and Nazis, and censorship against authors past and present. ", "With diligence and grace, Baez mounts a compelling investigation into the motives behind the destruction of books, reading man's violence against writing as a perverse anti-creation. \"By destroying,\" Baez argues, \"man ratifies this ritual of permanence, purification and consecration; by destroying, man brings to the surface a behavior originating in the depth of his personality.\" His findings ultimately attest to the lasting power of books as the great human repository of knowledge and memory, fragile yet vital bulwarks against the intransigence and barbarity of every age."], "author": "Fernando Báez", "num_pages": "354", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "1934633011"},
{"url": "https://www.goodreads.com/book/show/92557.Quarantine", "num_ratings": "3,044", "num_reviews": "265", "avg_ratings": 3.69, "genres": ["Fiction", "Historical", "Historical Fiction", "Religion", "Literature", "Literary Fiction"], "title": "Quarantine", "description": ["Winner of the ", " and a ", " finalist.", "Two thousand years ago four travellers enter the Judean desert to fast and pray for their lost souls. In the blistering heat and barren rocks they encounter the evil merchant Musa — madman, sadist, rapist, even a Satan — who holds them in his tyrannical power. Yet there is also another, a faint figure in", "Winner of the ", " and a ", " finalist.", "Two thousand years ago four travellers enter the Judean desert to fast and pray for their lost souls. In the blistering heat and barren rocks they encounter the evil merchant Musa — madman, sadist, rapist, even a Satan — who holds them in his tyrannical power. Yet there is also another, a faint figure in the distance, fasting for forty days, a Galilean who they say has the power to work miracles... Here, trapped in the wilderness, their terrifying battle for survival begins..."], "author": "Jim Crace", "num_pages": "256", "awards": ["Man Booker Prize Nominee (1997)", "Whitbread Award for Novel (1997)", "International DUBLIN Literary Award Nominee (1999)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-03-15 00:00:00", "ISBN": "0312199511"},
{"url": "https://www.goodreads.com/book/show/177818.Love_in_a_Torn_Land", "num_ratings": "2,162", "num_reviews": "265", "avg_ratings": 3.97, "genres": ["Nonfiction", "Biography"], "title": "Love in a Torn Land: Joanna of Kurdistan: The True Story of a Freedom Fighter's Escape from Iraqi Vengeance", "description": ["In this incredible true love story, bestselling author Jean Sasson shares Joanna al-Askari's personal journey of fear and fortitude through a Baghdad childhood and life as a Kurdish freedom fighter during the Iran-Iraq War. Inspiring and unforgettable, ", " shares Joanna's passionate and unflagging determination to survive and fight—for love, life, and the f", "In this incredible true love story, bestselling author Jean Sasson shares Joanna al-Askari's personal journey of fear and fortitude through a Baghdad childhood and life as a Kurdish freedom fighter during the Iran-Iraq War. Inspiring and unforgettable, ", " shares Joanna's passionate and unflagging determination to survive and fight—for love, life, and the freedom of her beloved Kurdistan."], "author": "Jean Sasson", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "0470067292"},
{"url": "https://www.goodreads.com/book/show/1042416.The_Fall_of_Baghdad", "num_ratings": "276", "num_reviews": "20", "avg_ratings": 3.97, "genres": ["Nonfiction", "History", "War", "Politics", "Writing", "Journalism"], "title": "The Fall of Baghdad", "description": ["For every great historical event, seemingly, at least one reporter writes an eyewitness account of such power and literary weight that it becomes joined with its subject in our minds-George Orwell's ", " and the Spanish Civil War; John Hersey's ", " and the dropping of the first atomic bomb; Philip Gourevitch's ", "For every great historical event, seemingly, at least one reporter writes an eyewitness account of such power and literary weight that it becomes joined with its subject in our minds-George Orwell's ", " and the Spanish Civil War; John Hersey's ", " and the dropping of the first atomic bomb; Philip Gourevitch's ", " and the Rwandan genocide. Whatever else is written about the Iraqi people and the fall of Saddam, Jon Lee Anderson's ", " is worthy of mention in this company. No subject has become more hotly politicized than the toppling of Saddam Hussein's regime, and so a thick fog of propaganda, both from boosters of the war and its opponents, has obscured the reality of what the Iraqi people have endured and are enduring, under Saddam Hussein and now. For that reason alone, ", " is a great and necessary book. Jon Lee Anderson has drawn on all of his reserves of stamina and personal bravery to create an astonishing portrait of humanity in extremis, a work of great wisdom, human empathy, and moral clarity. He follows a remarkable and diverse group of Iraqis over the course of this extraordinary time: from the all-pervasive fear that comes from living under Saddam's brutal, Orwellian rule to the surreal atmosphere of Baghdad before the invasion; to the invasion's commencement and the regime's death spiral down into its terrible endgame; to America's disastrously ill-conceived seizure of power and its fruits. In channeling a tragedy of epic dimensions through the stories of real people caught up in the whirlwind of history, Jon Lee Anderson has written a book of timeless significance."], "author": "Jon Lee Anderson", "num_pages": "389", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2005-08-16 00:00:00", "ISBN": "0316729906"},
{"url": "https://www.goodreads.com/book/show/6456652-islamic-design", "num_ratings": "140", "num_reviews": "16", "avg_ratings": 4.16, "genres": ["Art", "Design", "Architecture", "History", "Religion", "Islam", "Science", "Mathematics", "Science"], "title": "Islamic Design: A Genius For Geometry", "description": ["An exploration of the construction and meaning of Islamic geometric patterns. ", "Throughout their long history the craft traditions of the Islamic world evolved a multitude of styles applied to a great variety of media but always with unifying factors that make them instantly recognizable. Harmony is central. There are two key aspects to the visual structure of Islamic design", "An exploration of the construction and meaning of Islamic geometric patterns. ", "Throughout their long history the craft traditions of the Islamic world evolved a multitude of styles applied to a great variety of media but always with unifying factors that make them instantly recognizable. Harmony is central. There are two key aspects to the visual structure of Islamic design--calligraphy using Arabic script (one of the world's great calligraphic traditions) and abstract ornamentation using a varied but remarkably integrated visual language. Focusing on Islamic geometric patterns, simple and complex, man-made and in nature, this book offers unique insight into Islamic culture."], "author": "Daud Sutton", "num_pages": "58", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-01 00:00:00", "ISBN": "1904263593"},
{"url": "https://www.goodreads.com/book/show/142395.Samarkand", "num_ratings": "16,227", "num_reviews": "1,319", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Literature", "Cultural", "France"], "title": "Samarkand", "description": ["Accused of mocking the inviolate codes of Islam, the Persian poet and sage Omar Khayyam fortuitously finds sympathy with the very man who is to judge his alleged crimes. Recognising genuis, the judge decides to spare him and gives him instead a small, blank book, encouraging him to confine his thoughts to it alone. Thus begins the seamless blend of fact and fiction that is", "Accused of mocking the inviolate codes of Islam, the Persian poet and sage Omar Khayyam fortuitously finds sympathy with the very man who is to judge his alleged crimes. Recognising genuis, the judge decides to spare him and gives him instead a small, blank book, encouraging him to confine his thoughts to it alone. Thus begins the seamless blend of fact and fiction that is ", ". Vividly re-creating the history of the manuscript of the Rubaiyaat of Omar Khayyam, Amin Maalouf spans continents and centuries with breathtaking vision: the dusky exoticism of 11th-century Persia, with its poetesses and assassins; the same country's struggles nine hundred years later, seen through the eyes of an American academic obsessed with finding the original manuscript; and the fated maiden voyage of the Titanic, whose tragedy led to the Rubaiyaat's final resting place - all are brought to life with keen assurance by this gifted and award-winning writer."], "author": "Amin Maalouf", "num_pages": "304", "awards": ["Prix Maison de la Presse for Roman (1988)"], "places": ["Persia", "Samarkand"], "character_names": [], "language": "English", "publish_date": "2003-09-01 00:00:00", "ISBN": "1566562937"},
{"url": "https://www.goodreads.com/book/show/22121.Imperial_Life_in_the_Emerald_City", "num_ratings": "5,223", "num_reviews": "604", "avg_ratings": 4.02, "genres": ["History", "Nonfiction", "Politics", "War", "War", "Military Fiction"], "title": "Imperial Life in the Emerald City: Inside Iraq's Green Zone", "description": ["An unprecedented account of life in Baghdad’s Green Zone, a walled-off enclave of towering plants, posh villas, and sparkling swimming pools that was the headquarters for the American occupation of Iraq.", "’s former Baghdad bureau chief Rajiv Chandrasekaran takes us with him into the Zone: into a bubble, cut off from wartime realities, where the task of rec", "An unprecedented account of life in Baghdad’s Green Zone, a walled-off enclave of towering plants, posh villas, and sparkling swimming pools that was the headquarters for the American occupation of Iraq.", "’s former Baghdad bureau chief Rajiv Chandrasekaran takes us with him into the Zone: into a bubble, cut off from wartime realities, where the task of reconstructing a devastated nation competed with the distractions of a Little America—a half-dozen bars stocked with cold beer, a disco where women showed up in hot pants, a movie theater that screened shoot-’em-up films, an all-you-could-eat buffet piled high with pork, a shopping mall that sold pornographic movies, a parking lot filled with shiny new SUVs, and a snappy dry-cleaning service—much of it run by Halliburton. Most Iraqis were barred from entering the Emerald City for fear they would blow it up.", " Drawing on hundreds of interviews and internal documents, Chandrasekaran tells the story of the people and ideas that inhabited the Green Zone during the occupation, from the imperial viceroy L. Paul Bremer III to the fleet of twentysomethings hired to implement the idea that Americans could build a Jeffersonian democracy in an embattled Middle Eastern country.", " In the vacuum of postwar planning, Bremer ignores what Iraqis tell him they want or need and instead pursues irrelevant neoconservative solutions—a flat tax, a sell-off of Iraqi government assets, and an end to food rationing. His underlings spend their days drawing up pie-in-the-sky policies, among them a new traffic code and a law protecting microchip designs, instead of rebuilding looted buildings and restoring electricity production. His almost comic initiatives anger the locals and help fuel the insurgency.", " Chandrasekaran details Bernard Kerik’s ludicrous attempt to train the Iraqi police and brings to light lesser known but typical travesties: the case of the twenty-four-year-old who had never worked in finance put in charge of reestablishing Baghdad’s stock exchange; a contractor with no previous experience paid millions to guard a closed airport; a State Department employee forced to bribe Americans to enlist their help in preventing Iraqi weapons scientists from defecting to Iran; Americans willing to serve in Iraq screened by White House officials for their views on ", "people", "with prior expertise in the Middle East excluded in favor of lesser-qualified Republican Party loyalists. Finally, he describes Bremer’s ignominious departure in 2004, fleeing secretly in a helicopter two days ahead of schedule.", " This is a startling portrait of an Oz-like place where a vital aspect of our government’s folly in Iraq played out. It is a book certain to be talked about for years to come."], "author": "Rajiv Chandrasekaran", "num_pages": "320", "awards": ["Guardian First Book Award Nominee (2007)", "Ridenhour Book Prize (2007)", "Samuel Johnson Prize for Non-Fiction (2007)", "Cornelius Ryan Award (2006)", "National Book Award Finalist for Nonfiction (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-19 00:00:00", "ISBN": "1400044871"},
{"url": "https://www.goodreads.com/book/show/174722.Our_Oriental_Heritage", "num_ratings": "1,822", "num_reviews": "198", "avg_ratings": 4.28, "genres": ["History", "Nonfiction", "Philosophy", "History", "Ancient History", "History", "World History"], "title": "Our Oriental Heritage", "description": ["This is the ", " reference on world history, recognized as the most comprehensive general history ever written, the result of four decades of work by Will and Ariel Durant -- a set that The New York Times called \"a splendid, broad panorama of hereditary culture in words and images that the layman can fully understand.\" This series began as an effort to write a history o", "This is the ", " reference on world history, recognized as the most comprehensive general history ever written, the result of four decades of work by Will and Ariel Durant -- a set that The New York Times called \"a splendid, broad panorama of hereditary culture in words and images that the layman can fully understand.\" This series began as an effort to write a history on the nineteenth century, an undertaking that Will Durant realized could only be understood in terms of what had come before. So the Durants embarked on an encyclopedic survey of all civilization, ancient and modern, Occidental and Oriental. "], "author": "Will Durant", "num_pages": "1047", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-16 00:00:00", "ISBN": "1567310125"},
{"url": "https://www.goodreads.com/book/show/415450.Even_After_All_This_Time", "num_ratings": "475", "num_reviews": "60", "avg_ratings": 4.04, "genres": ["Cultural", "Iran", "Nonfiction", "Autobiography", "Memoir", "Biography", "History"], "title": "Even After All This Time: A Story of Love, Revolution, and Leaving Iran", "description": ["At the age of ten, a young Iranian girl witnesses the horror of her father's execution and escapes the revolution with her sister.", "Growing up in Tehran in the 1970s, Afschineh Latifi and her sister and two brothers enjoyed a life of luxury and privilege. Their father, a self–made man, had worked his way up from nothing to become a colonel in the Shah's army, and their mothe", "At the age of ten, a young Iranian girl witnesses the horror of her father's execution and escapes the revolution with her sister.", "Growing up in Tehran in the 1970s, Afschineh Latifi and her sister and two brothers enjoyed a life of luxury and privilege. Their father, a self–made man, had worked his way up from nothing to become a colonel in the Shah's army, and their mother, a woman of equally modest roots, had made a career for herself as a respected schoolteacher. But in February, 1979, Colonel Latifi was arrested by members of the newly installed Khomeini regime, and publicly pilloried as an \"Enemy of God.\" Some months later, after having been shunted from one prison cell to another, and without benefit of a legitimate trial, Colonel Latifi was summarily executed.", "Fearing for the safety of her children, Mrs. Latifi made a wrenching decision: to send her daughters, ages ten and eleven, to the west, splitting up the family until they could safely reunite. Out on their own, Afschineh and her sister, Afsaneh, were forced to become strong young women before they'd even had a childhood.", "Even After All This Time is a story of hope and heartache, a story of a family torn apart for six harrowing years, and finally coming together to rebuild in America. In the richly evocative tradition of the bestselling Reading Lolita in Tehran, this is a story of a family that had the courage to dream impossible dreams and to make them come true against impossible odds."], "author": "Afschineh Latifi", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-03-28 00:00:00", "ISBN": "0060745347"},
{"url": "https://www.goodreads.com/book/show/509686.Persian_Letters", "num_ratings": "4,871", "num_reviews": "116", "avg_ratings": 3.73, "genres": ["Classics", "Philosophy", "Cultural", "France", "Fiction", "European Literature", "French Literature", "Literature", "Literature", "18th Century"], "title": "Persian Letters", "description": ["This richly evocative novel-in-letters tells the story of two Persian noblemen who have left their country - the modern Iran - to journey to Europe in search of wisdom. As they travel, they write home to wives and eunuchs in the harem and to friends in France and elsewhere. Their colourful observations on the culture differences between West and East culture conjure up Eas", "This richly evocative novel-in-letters tells the story of two Persian noblemen who have left their country - the modern Iran - to journey to Europe in search of wisdom. As they travel, they write home to wives and eunuchs in the harem and to friends in France and elsewhere. Their colourful observations on the culture differences between West and East culture conjure up Eastern sensuality, repression and cruelty in contrast to the freer, more civilized West - but here also unworthy nobles and bishops, frivolous women of fashion and conceited people of all kinds are satirized. Storytellers as well as letter-writers, Montesquieu's Usbek and Rica are disrespectful and witty, but also serious moralists. Persian Letters was a succès de scandale in Paris society, and encapsulates the libertarian, critical spirit of the early eighteenth century."], "author": "Montesquieu", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1973-01-25 00:00:00", "ISBN": "0140442812"},
{"url": "https://www.goodreads.com/book/show/281572.Prisoner_of_Tehran", "num_ratings": "9,550", "num_reviews": "1,249", "avg_ratings": 4.18, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Cultural", "Iran"], "title": "Prisoner of Tehran", "description": ["Marina Nemat's peaceful childhood in Tehran was shattered when the Iranian Revolution of 1979 ushered in a new era of Islamic rule. After complaining to her teachers about lessons being replaced by Koran study, Marina was arrested late one evening. She was taken to the notorious prison, Evin, where she was interrogated and tortured. Aged sixteen, she was sentenced to death", "Marina Nemat's peaceful childhood in Tehran was shattered when the Iranian Revolution of 1979 ushered in a new era of Islamic rule. After complaining to her teachers about lessons being replaced by Koran study, Marina was arrested late one evening. She was taken to the notorious prison, Evin, where she was interrogated and tortured. Aged sixteen, she was sentenced to death. ", " is the astonishing account of one woman's remarkable courage in the face of terror and her quest for freedom."], "author": "Marina Nemat", "num_pages": "306", "awards": [], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "1416537422"},
{"url": "https://www.goodreads.com/book/show/292195.Myths_from_Mesopotamia", "num_ratings": "1,869", "num_reviews": "89", "avg_ratings": 4.0, "genres": ["Fantasy", "Mythology", "History", "Classics", "Nonfiction", "Religion", "Literature", "Ancient", "Poetry", "Literature"], "title": "Myths from Mesopotamia: Creation, the Flood, Gilgamesh, and Others", "description": ["The ancient civilization of Mesopotamia thrived between the rivers Tigris and Euphrates over 4,000 years ago. The myths collected here, originally written in cuneiform on clay tablets, include parallels with the biblical stories of the Creation and the Flood, and the famous Epic of Gilgamesh, the tale of a man of great strength, whose heroic quest for immortality is dashed", "The ancient civilization of Mesopotamia thrived between the rivers Tigris and Euphrates over 4,000 years ago. The myths collected here, originally written in cuneiform on clay tablets, include parallels with the biblical stories of the Creation and the Flood, and the famous Epic of Gilgamesh, the tale of a man of great strength, whose heroic quest for immortality is dashed through one moment of weakness.", " Recent developments in Akkadian grammar and lexicography mean that this new translation--complete with notes, a glossary of deities, place-names, and key terms, and illustrations of the mythical monsters featured in the text--will replace all other versions."], "author": "Anonymous", "num_pages": "339", "awards": [], "places": ["Mesopotamia"], "character_names": [], "language": "English", "publish_date": "1998-09-17 00:00:00", "ISBN": "0192835890"},
{"url": "https://www.goodreads.com/book/show/59661.Shah_of_Shahs", "num_ratings": "3,839", "num_reviews": "320", "avg_ratings": 4.21, "genres": ["History", "Nonfiction", "Cultural", "Iran", "Writing", "Journalism", "Politics", "Travel", "European Literature", "Polish Literature", "Literature", "20th Century", "Biography", "Cultural", "Poland"], "title": "Shah of Shahs", "description": ["In ", " Kapuscinski brings a mythographer's perspective and a novelist's virtuosity to bear on the overthrow of the last Shah of Iran, one of the most infamous of the United States' client-dictators, who resolved to transform his country into \"a second America in a generation,\" only to be toppled virtually overnight. From his vantage point at the break-up of the o", "In ", " Kapuscinski brings a mythographer's perspective and a novelist's virtuosity to bear on the overthrow of the last Shah of Iran, one of the most infamous of the United States' client-dictators, who resolved to transform his country into \"a second America in a generation,\" only to be toppled virtually overnight. From his vantage point at the break-up of the old regime, Kapuscinski gives us a compelling history of conspiracy, repression, fanatacism, and revolution."], "author": "Ryszard Kapuściński", "num_pages": "160", "awards": [], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": [], "language": "English", "publish_date": "1992-02-04 00:00:00", "ISBN": "0679738010"},
{"url": "https://www.goodreads.com/book/show/54859.Lipstick_Jihad", "num_ratings": "4,319", "num_reviews": "402", "avg_ratings": 3.68, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Iran", "Biography", "Religion", "Islam"], "title": "Lipstick Jihad: A Memoir of Growing up Iranian in America and American in Iran", "description": ["As far back as she can remember, Azadeh Moaveni has felt at odds with her tangled identity as an Iranian-American. In suburban America, Azadeh lived in two worlds. At home, she was the daughter of the Iranian exile community, serving tea, clinging to tradition, and dreaming of Tehran. Outside, she was a California girl who practiced yoga and listened to Madonna. For years,", "As far back as she can remember, Azadeh Moaveni has felt at odds with her tangled identity as an Iranian-American. In suburban America, Azadeh lived in two worlds. At home, she was the daughter of the Iranian exile community, serving tea, clinging to tradition, and dreaming of Tehran. Outside, she was a California girl who practiced yoga and listened to Madonna. For years, she ignored the tense standoff between her two cultures. But college magnified the clash between Iran and America, and after graduating, she moved to Iran as a journalist. This is the story of her search for identity, between two cultures cleaved apart by a violent history. It is also the story of Iran, a restive land lost in the twilight of its revolution. ", " Moaveni's homecoming falls in the heady days of the country's reform movement, when young people demonstrated in the streets and shouted for the Islamic regime to end. In these tumultuous times, she struggles to build a life in a dark country, wholly unlike the luminous, saffron and turquoise-tinted Iran of her imagination. As she leads us through the drug-soaked, underground parties of Tehran, into the hedonistic lives of young people desperate for change, Moaveni paints a rare portrait of Iran's rebellious next generation. The landscape of her Tehran — ski slopes, fashion shows, malls and cafes — is populated by a cast of young people whose exuberance and despair brings the modern reality of Iran to vivid life."], "author": "Azadeh Moaveni", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-03-28 00:00:00", "ISBN": "1586483781"},
{"url": "https://www.goodreads.com/book/show/25307.No_god_but_God", "num_ratings": "18,915", "num_reviews": "1,302", "avg_ratings": 4.13, "genres": ["Religion", "Nonfiction", "History", "Religion", "Islam", "Politics"], "title": "No god but God: The Origins, Evolution and Future of Islam", "description": ["In ", "internationally acclaimed scholar Reza Aslan explains Islam—the origins and evolution of the faith—in all its beauty and complexity", "This updated edition addresses the events of", "In ", "internationally acclaimed scholar Reza Aslan explains Islam—the origins and evolution of the faith—in all its beauty and complexity", "This updated edition addresses the events of the past decade, analyzing how they have influenced Islam’s position in modern culture. Aslan explores what the popular demonstrations pushing for democracy in the Middle East mean for the future of Islam in the region, how the Internet and social media have affected Islam’s evolution, and how the war on terror has altered the geopolitical balance of power in the Middle East. He also provides an update on the contemporary Muslim women’s movement, a discussion of the controversy over veiling in Europe, an in-depth history of Jihadism, and a look at how Muslims living in North America and Europe are changing the face of Islam. Timely and persuasive, ", " is an elegantly written account that explains this magnificent yet misunderstood faith."], "author": "Reza Aslan", "num_pages": "310", "awards": ["Guardian First Book Award Nominee (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-10 00:00:00", "ISBN": "0812971892"},
{"url": "https://www.goodreads.com/book/show/2547.The_Prophet", "num_ratings": "180,594", "num_reviews": "7,125", "avg_ratings": 4.23, "genres": ["Poetry", "Philosophy", "Classics", "Fiction", "Spirituality", "Religion"], "title": "The Prophet", "description": ["Kahlil Gibran’s masterpiece, ", "is one of the most beloved classics of our time. Published in 1923, it has been translated into more than twenty languages, and the American editions alone have sold more than nine million copies.", "is a collection of poetic essays that are philosophical, spiritual, and, above all, inspirational. Gibran’s musings are divid", "Kahlil Gibran’s masterpiece, ", "is one of the most beloved classics of our time. Published in 1923, it has been translated into more than twenty languages, and the American editions alone have sold more than nine million copies.", "is a collection of poetic essays that are philosophical, spiritual, and, above all, inspirational. Gibran’s musings are divided into twenty-eight chapters covering such sprawling topics as love, marriage, children, giving, eating and drinking, work, joy and sorrow, housing, clothes, buying and selling, crime and punishment, laws, freedom, reason and passion, pain, self-knowledge, teaching, friendship, talking, time, good and evil, prayer, pleasure, beauty, religion, and death."], "author": "Kahlil Gibran", "num_pages": "127", "awards": [], "places": ["Orphalese"], "character_names": ["Al Mustafa", "Al Mitra"], "language": "English", "publish_date": "2010-01-01 00:00:00", "ISBN": "000100039X"},
{"url": "https://www.goodreads.com/book/show/2910034-things-i-ve-been-silent-about", "num_ratings": "3,366", "num_reviews": "486", "avg_ratings": 3.65, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Iran", "Biography", "Biography Memoir"], "title": "Things I've Been Silent About: Memories", "description": ["--From ", "Azar Nafisi, author of the beloved international bestseller ", ", now gives us a stunning personal story of growing up in Iran, memories of her life lived in thrall to a powerful and complex mother, against the background of a country’s political revolution. A girl’s pain over family secrets; a young woman’s discovery of the power of sensuality in literature; the price a family pays for freedom in a country beset by political upheaval–these and other threads are woven together in this beautiful memoir, as a gifted storyteller once again transforms the way we see the world and “reminds us of why we read in the first place” (", ").", "Nafisi’s intelligent and complicated mother, disappointed in her dreams of leading an important and romantic life, created mesmerizing fictions about herself, her family, and her past. But her daughter soon learned that these narratives of triumph hid as much as they revealed. Nafisi’s father escaped into narratives of another kind, enchanting his children with the classic tales like the Shahnamah, the Persian Book of Kings. When her father started seeing other women, young Azar began to keep his secrets from her mother. Nafisi’s complicity in these childhood dramas ultimately led her to resist remaining silent about other personal, as well as political, cultural, and social, injustices. ", "Reaching back in time to reflect on other generations in the Nafisi family, ", " is also a powerful historical portrait of a family that spans many periods of change leading up to the Islamic Revolution of 1978-79, which turned Azar Nafisi’s beloved Iran into a religious dictatorship. Writing of her mother’s historic term in Parliament, even while her father, once mayor of Tehran, was in jail, Nafisi explores the remarkable “coffee hours” her mother presided over, where at first women came together to gossip, to tell fortunes, and to give silent acknowledgment of things never spoken about, and which then evolved into gatherings where men and women would meet to openly discuss the unfolding revolution. ", " is, finally, a deeply personal reflection on women’s choices, and on how Azar Nafisi found the inspiration for a different kind of life. This unforgettable portrait of a woman, a family, and a troubled homeland is a stunning book that readers will embrace, a new triumph from an author who is a modern master of the memoir."], "author": "Azar Nafisi", "num_pages": "336", "awards": [], "places": ["Iran, Islamic Republic of", "Tehran"], "character_names": [], "language": "English", "publish_date": "2008-12-30 00:00:00", "ISBN": "1400063612"},
{"url": "https://www.goodreads.com/book/show/31206812-the-kurdish-bike", "num_ratings": "275", "num_reviews": "61", "avg_ratings": 4.2, "genres": ["Fiction"], "title": "The Kurdish Bike", "description": ["This provocative and heart-warming novel, based on a true story, follows an American teacher whose values are challenged in an Iraqi village in 2010.", "\"Courageous teachers wanted to rebuild war-torn nation.\" With her marriage over and life gone flat, Theresa Turner responds to an online ad, and lands at a school in Kurdish Iraq. Befriended by a widow in a nearby village, The", "This provocative and heart-warming novel, based on a true story, follows an American teacher whose values are challenged in an Iraqi village in 2010.", "\"Courageous teachers wanted to rebuild war-torn nation.\" With her marriage over and life gone flat, Theresa Turner responds to an online ad, and lands at a school in Kurdish Iraq. Befriended by a widow in a nearby village, Theresa is embroiled in the joys and agonies of traditional Kurds, especially the women who survived Saddam's genocide only to be crippled by age-old restrictions, brutality and honor killings. Theresa's greatest challenge will be balancing respect for cultural values while trying to introduce more enlightened attitudes toward women - at the same time seeking new spiritual dimensions within herself. ", " is gripping, tender, wry and compassionate - an eye-opener into little-known customs in one of the world's most explosive regions - a novel of love, betrayal and redemption."], "author": "Alesa Lightbourne", "num_pages": "323", "awards": ["Independent Publisher Book Award (IPPY) for Best Regional e-Book Fiction (Gold) (2017)", "North Street Book Awards"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-07-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/21402543-tehran-moonlight", "num_ratings": "114", "num_reviews": "27", "avg_ratings": 4.08, "genres": ["Cultural", "Iran", "Fiction", "Contemporary", "Novels"], "title": "Tehran Moonlight", "description": ["Love, loyalty and identity collide in Azin Sametipour's compelling debut novel, Tehran Moonlight. ", "Vividly set in a country where women have no voice, one woman's fight for love and her own identity result in unimaginable consequences. She was 23, beautiful, a violinist in love with her passion. A rebel born into a conservative family where belief was everything and honor s", "Love, loyalty and identity collide in Azin Sametipour's compelling debut novel, Tehran Moonlight. ", "Vividly set in a country where women have no voice, one woman's fight for love and her own identity result in unimaginable consequences. She was 23, beautiful, a violinist in love with her passion. A rebel born into a conservative family where belief was everything and honor shackled women in place. Then she met Ashkan. He was 27, gorgeous, born to an Iranian father in Boston. A successful architect in the States who had returned to Iran to find his past. Then he met Mahtab."], "author": "Azin Sametipour", "num_pages": "278", "awards": [], "places": ["Teharan"], "character_names": [], "language": "English", "publish_date": "2014-03-07 00:00:00", "ISBN": "1491265191"},
{"url": "https://www.goodreads.com/book/show/103749.Persian_Fire", "num_ratings": "5,738", "num_reviews": "379", "avg_ratings": 4.15, "genres": ["History", "Nonfiction", "History", "Ancient History", "Historical"], "title": "Persian Fire: The First World Empire and the Battle for the West", "description": ["In 480 B.C., Xerxes, the King of Persia, led an invasion of mainland Greece. Its success should have been a formality. For seventy years, victory—rapid, spectacular victory—had seemed the birthright of the Persian Empire. In the space of a single generation, they had swept across the Near East, shattering ancient kingdoms, storming famous cities, putting together an empire", "In 480 B.C., Xerxes, the King of Persia, led an invasion of mainland Greece. Its success should have been a formality. For seventy years, victory—rapid, spectacular victory—had seemed the birthright of the Persian Empire. In the space of a single generation, they had swept across the Near East, shattering ancient kingdoms, storming famous cities, putting together an empire which stretched from India to the shores of the Aegean. As a result of those conquests, Xerxes ruled as the most powerful man on the planet. Yet somehow, astonishingly, against the largest expeditionary force ever assembled, the Greeks of the mainland managed to hold out. The Persians were turned back. Greece remained free. Had the Greeks been defeated in the epochal naval battle at Salamis, not only would the West have lost its first struggle for independence and survival, but it is unlikely that there would ever have been such an entity as the West at all.", "Tom Holland’s brilliant new book describes the very first “clash of Empires” between East and West. As he did in the critically praised ", ", he has found extraordinary parallels between the ancient world and our own. There is no other popular history that takes in the entire sweep of the Persian Wars, and no other classical historian, academic or popular, who combines scholarly rigor with novelistic depth with a worldly irony in quite the fashion that Tom Holland does."], "author": "Tom Holland", "num_pages": "418", "awards": ["Runciman Book Prize (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-02 00:00:00", "ISBN": "0385513119"},
{"url": "https://www.goodreads.com/book/show/7997697-the-good-daughter", "num_ratings": "2,644", "num_reviews": "424", "avg_ratings": 3.89, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Cultural", "Iran"], "title": "The Good Daughter: A Memoir of My Mother's Hidden Life", "description": ["Jasmin Darznik came to America from Iran when she was only three years old, and she grew up knowing very little about her family's history. When she was in her early twenties, on a day shortl", "Jasmin Darznik came to America from Iran when she was only three years old, and she grew up knowing very little about her family's history. When she was in her early twenties, on a day shortly following her father's death, Jasmin was helping her mother move; a photograph fell from a stack of old letters. The girl pictured was her mother. She was wearing a wedding veil, and at her side stood a man whom Jasmin had never seen before.", "At first, Jasmin's mother, Lili, refused to speak about the photograph, and Jasmin returned to her own home frustrated and confused. But a few months later, she received from her mother the first of ten cassette tapes that would bring to light the wrenching hidden story of her family's true origins in Iran: Lili's marriage at thirteen, her troubled history of abuse and neglect, and a daughter she was forced to abandon in order to escape that life. The final tape revealed that Jasmin's sister, Sara - The Good Daughter - was still living in Iran.", "In this sweeping, poignant, and beautifully written memoir, Jasmin weaves the stories of three generations of Iranian women into a unique tale of one family's struggle for freedom and understanding. The result is an enchanting and unforgettable story of secrets, betrayal, and the unbreakable mother-daughter bond."], "author": "Jasmin Darznik", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-27 00:00:00", "ISBN": "0446534978"},
{"url": "https://www.goodreads.com/book/show/348632.The_Blood_of_Flowers", "num_ratings": "14,578", "num_reviews": "1,736", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "Iran"], "title": "The Blood of Flowers", "description": ["In the fabled city of Isfahan, in seventeenth-century Persia, a young woman confronts a dismal fate: Her beloved father had died and left her without a dowry. Forced to work as a servant in the home of her uncle, a rich rug designer in the court of the Shah, the young woman blossoms as a brilliant designer of carpets. But while her talent flourishes, her prospects for a ha", "In the fabled city of Isfahan, in seventeenth-century Persia, a young woman confronts a dismal fate: Her beloved father had died and left her without a dowry. Forced to work as a servant in the home of her uncle, a rich rug designer in the court of the Shah, the young woman blossoms as a brilliant designer of carpets. But while her talent flourishes, her prospects for a happy marriage grow dim, and she finds herself faced with a daunting decision--to forsake her own dignity or to risk everything in an effort to maintain it.", "Both a sweeping love story and a luminous portrait of a city, THE BLOOD OF FLOWERS is the mesmerizing historical novel of an ill-fated young woman whose gift as a rug designer transforms her life. Illuminated with glorious detail of Persian rug-making, and brilliantly bringing to life the sights sounds and life of 17th-century Isfahan, THE BLOOD OF FLOWERS has captured readers' imaginations everywhere as a timeless tale of one woman's struggle to live a life of her choosing."], "author": "Anita Amirrezvani", "num_pages": "368", "awards": ["Orange Prize Nominee for Fiction Longlist (2008)"], "places": ["Isfahan", "Persia", "Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2007-06-05 00:00:00", "ISBN": "0316065765"},
{"url": "https://www.goodreads.com/book/show/157985.Shahnameh", "num_ratings": "3,553", "num_reviews": "227", "avg_ratings": 4.51, "genres": ["Poetry", "Classics", "History", "Cultural", "Iran", "Literature", "Fantasy", "Mythology"], "title": "Shahnameh: The Persian Book of Kings", "description": ["Among the great works of world literature, perhaps one of the least familiar to English readers is the \"Shahnameh: ThePersian Book of Kings,\" the national epic of Persia. This prodigious narrative, composed by the poet Ferdowsi between the years 980 and 1010, tells the story of pre- Islamic Iran, beginning in the mythic time of Creation and continuing forward to the Arab i", "Among the great works of world literature, perhaps one of the least familiar to English readers is the \"Shahnameh: ThePersian Book of Kings,\" the national epic of Persia. This prodigious narrative, composed by the poet Ferdowsi between the years 980 and 1010, tells the story of pre- Islamic Iran, beginning in the mythic time of Creation and continuing forward to the Arab invasion in the seventh century. As a window on the world, \"Shahnameh\" belongs in the company of such literary masterpieces as Dante's \"Divine Comedy,\" the plays of Shakespeare, the epics of Homer- classics whose reach and range bring whole cultures into view. In its pages are unforgettable moments of national triumph and failure, human courage and cruelty, blissful love and bitter grief.", "In tracing the roots of Iran, \"Shahnameh\" initially draws on the depths of legend and then carries its story into historical times, when ancient Persia was swept into an expanding Islamic empire. Now Dick Davis, the greatest modern translator of Persian poetry, has revisited that poem, turning the finest stories of Ferdowsi's original into an elegant combination of prose and verse. For the first time in English, in the most complete form possible, readers can experience \"Shahnameh\" in the same way that Iranian storytellers have lovingly conveyed it in Persian for the past thousand years."], "author": "Abolqasem Ferdowsi", "num_pages": "886", "awards": [], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Sohrab", "Rostam", "Esfandiar", "Simorgh &..."], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0670034851"},
{"url": "https://www.goodreads.com/book/show/67376.The_Book_of_Love", "num_ratings": "3,084", "num_reviews": "172", "avg_ratings": 4.35, "genres": ["Poetry", "Classics", "Spirituality", "Philosophy", "Romance"], "title": "The Book of Love: Poems of Ecstasy and Longing", "description": ["Now in paperback, this is the definitive collection of America′s bestselling poet Rumi′s finest poems of love and lovers. In Coleman Barks′ delightful and wise renderings, these poems will open your heart and soul to the lover inside and out.", "′There are lovers content with longing.", "I′m not one of them.′", "Rumi is best known for his poems expressing the ecstasies and mysteries o", "Now in paperback, this is the definitive collection of America′s bestselling poet Rumi′s finest poems of love and lovers. In Coleman Barks′ delightful and wise renderings, these poems will open your heart and soul to the lover inside and out.", "′There are lovers content with longing.", "I′m not one of them.′", "Rumi is best known for his poems expressing the ecstasies and mysteries of love of all kinds - erotic, divine, friendship -and Coleman Barks collects here the best of those poems, ranging from the ′wholeness′ one experiences with a true lover, to the grief of a lover′s loss, and all the states in between: from the madness of sudden love to the shifting of a romance to deep friendship - these poems cover all ′the magnificent regions of the heart′."], "author": "Rumi", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-01-18 00:00:00", "ISBN": "0060750502"},
{"url": "https://www.goodreads.com/book/show/1038088.The_Septembers_of_Shiraz", "num_ratings": "6,354", "num_reviews": "859", "avg_ratings": 3.79, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Literature", "Jewish"], "title": "The Septembers of Shiraz", "description": ["In the aftermath of the Iranian revolution, rare-gem dealer Isaac Amin is arrested, wrongly accused of being a spy. Terrified by his disappearance, his family must reconcile a new world of cruelty and chaos with the collapse of everything they have known. ", "As Isaac navigates the tedium and terrors of prison, forging tenuous trusts, his wife feverishly searches for him, susp", "In the aftermath of the Iranian revolution, rare-gem dealer Isaac Amin is arrested, wrongly accused of being a spy. Terrified by his disappearance, his family must reconcile a new world of cruelty and chaos with the collapse of everything they have known. ", "As Isaac navigates the tedium and terrors of prison, forging tenuous trusts, his wife feverishly searches for him, suspecting, all the while, that their once-trusted housekeeper has turned on them and is now acting as an informer. ", "And as his daughter, in a childlike attempt to stop the wave of baseless arrests, engages in illicit activities, his son, sent to New York before the rise of the Ayatollahs, struggles to find happiness even as he realizes that his family may soon be forced to embark on a journey of incalculable danger. ", "A page-turning literary debut, ", " simmers with questions of identity, alienation, and love, not simply for a spouse or a child, but for all the intangible sights and smells of the place we call home."], "author": "Dalia Sofer", "num_pages": "340", "awards": ["Orange Prize Nominee for Fiction Longlist (2008)", "PEN/Robert W. Bingham Prize (2008)", "Sami Rohr Prize Nominee for Jewish Literature (2009)"], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2007-07-24 00:00:00", "ISBN": "0061130400"},
{"url": "https://www.goodreads.com/book/show/9516.Persepolis", "num_ratings": "131,716", "num_reviews": "7,505", "avg_ratings": 4.24, "genres": ["Sequential Art", "Graphic Novels", "Nonfiction", "Autobiography", "Memoir", "Sequential Art", "Comics", "Biography"], "title": "Persepolis: The Story of a Childhood", "description": ["A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, ye", "A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, years that saw the overthrow of the Shah’s regime, the triumph of the Islamic Revolution, and the devastating effects of war with Iraq. The intelligent and outspoken only child of committed Marxists and the great-granddaughter of one of Iran’s last emperors, Marjane bears witness to a childhood uniquely entwined with the history of her country.", " paints an unforgettable portrait of daily life in Iran and of the bewildering contradictions between home life and public life. Marjane’s child’s-eye view of dethroned emperors, state-sanctioned whippings, and heroes of the revolution allows us to learn as she does the history of this fascinating country and of her own extraordinary family. Intensely personal, profoundly political, and wholly original, ", " is at once a story of growing up and a reminder of the human cost of war and political repression. It shows how we carry on, with laughter and tears, in the face of absurdity. And, finally, it introduces us to an irresistible little girl with whom we cannot help but fall in love."], "author": "Marjane Satrapi", "num_pages": "153", "awards": ["Harvey Awards for Best US Edition of Foreign Material (2004)", "ALA Alex Award (2004)", "Prix du Festival d'Angoulême for Alph-art du coup de coeur (2001)"], "places": ["Iran, Islamic Republic of", "Tehran", "Persia"], "character_names": [], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "037571457X"},
{"url": "https://www.goodreads.com/book/show/128029.A_Thousand_Splendid_Suns", "num_ratings": "949,941", "num_reviews": "46,560", "avg_ratings": 4.35, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "A Thousand Splendid Suns", "description": [" is a breathtaking story set against the volatile events of Afghanistan's last thirty years—from the Soviet invasion to the reign of the Taliban to post-Taliban rebuilding—that puts the violence, fear, hope, and faith of this country in intimate, human terms. It is a tale of two generations of characters brought jarringly together by the tragic swee", " is a breathtaking story set against the volatile events of Afghanistan's last thirty years—from the Soviet invasion to the reign of the Taliban to post-Taliban rebuilding—that puts the violence, fear, hope, and faith of this country in intimate, human terms. It is a tale of two generations of characters brought jarringly together by the tragic sweep of war, where personal lives—the struggle to survive, raise a family, find happiness—are inextricable from the history playing out around them.", "Propelled by the same storytelling instinct that made ", " a beloved classic, ", " is at once a remarkable chronicle of three decades of Afghan history and a deeply moving account of family and friendship. It is a striking, heart-wrenching novel of an unforgiving time, an unlikely friendship, and an indestructible love—a stunning accomplishment."], "author": "Khaled Hosseini", "num_pages": "372", "awards": ["British Book Award for Best Read of the Year (2008)", "Book Sense Book of the Year Award for Adult Fiction (2008)", "California Book Award for Fiction (Silver) (2007)", "Exclusive Books Boeke Prize Nominee (2007)", "Lincoln Award Nominee (2011)"], "places": ["Afghanistan", "Kabul", "Herat"], "character_names": ["Laila", "Mariam", "Rasheed", "Tariq"], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "1594489505"},
{"url": "https://www.goodreads.com/book/show/304079.The_Essential_Rumi", "num_ratings": "29,815", "num_reviews": "810", "avg_ratings": 4.43, "genres": ["Poetry", "Spirituality", "Philosophy", "Classics", "Religion"], "title": "The Essential Rumi", "description": ["This revised and expanded edition of ", " includes a new introduction by Coleman Barks and more than 80 never-before-published poems.", "Through his lyrical translations, Coleman Barks has been instrumental in bringing this exquisite literature to a remarkably wide range of readers, making the ecstatic, spiritual poetry of thirteenth-century Sufi Mystic Rumi more", "This revised and expanded edition of ", " includes a new introduction by Coleman Barks and more than 80 never-before-published poems.", "Through his lyrical translations, Coleman Barks has been instrumental in bringing this exquisite literature to a remarkably wide range of readers, making the ecstatic, spiritual poetry of thirteenth-century Sufi Mystic Rumi more popular than ever.", " continues to be the bestselling of all Rumi books, and the definitive selection of his beautiful, mystical poetry."], "author": "Rumi", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-05-28 00:00:00", "ISBN": "0062509594"},
{"url": "https://www.goodreads.com/book/show/16360.Murder_in_Mesopotamia", "num_ratings": "28,162", "num_reviews": "1,121", "avg_ratings": 3.88, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Classics", "Mystery", "Detective"], "title": "Murder in Mesopotamia", "description": ["When nurse Amy Leatheran agrees to look after American archaeologist Dr Leidner’s wife Louise at a dig near Hassanieh she finds herself taking on more than just nursing duties – she also has to help solve murders. Fortunately for Amy, Hercule Poirot is visiting the excavation site but will the great detective be in time to prevent a multiple murderer from striking again?"], "author": "Agatha Christie", "num_pages": "264", "awards": [], "places": ["Hassanieh"], "character_names": ["Amy Leatheran", "Dr. Erich Leidner", "Louise Leidner", "Anne Johnson", "Dr. Giles Reilly", "Richard Carey", "Hercule Poirot", "Sheila Reilly", "Marie Mercado", "Joseph Mercado", "David Emmott", "Bill Coleman", "Carl Reiter", "Captain Maitland", "Father Lavigny"], "language": "English", "publish_date": "2001-12-16 00:00:00", "ISBN": "0007113803"},
{"url": "https://www.goodreads.com/book/show/93101.The_Arabian_Nights", "num_ratings": "65,573", "num_reviews": "2,009", "avg_ratings": 4.05, "genres": ["Classics", "Fiction", "Fantasy", "Short Stories", "Literature", "Fantasy", "Fairy Tales", "Fantasy", "Mythology", "Adventure", "Folklore", "Childrens"], "title": "The Arabian Nights", "description": ["The tales of told by Shahrazad over a thousand and one nights to delay her execution by the vengeful King Shahriyar have become among the most popular in both Eastern and Western literature, as recounted by Sir Francis Burton. From the epic adventures of \"Aladdin and the Enchanted Lamp\" to the farcical \"Young Woman and her Five Lovers\" and the social criticism of \"The Tale", "The tales of told by Shahrazad over a thousand and one nights to delay her execution by the vengeful King Shahriyar have become among the most popular in both Eastern and Western literature, as recounted by Sir Francis Burton. From the epic adventures of \"Aladdin and the Enchanted Lamp\" to the farcical \"Young Woman and her Five Lovers\" and the social criticism of \"The Tale of the Hunchback\", the stories depict a fabulous world of all-powerful sorcerers, jinns imprisoned in bottles and enchanting princesses. But despite their imaginative extravagance, the Tales are anchored to everyday life by their realism, providing a full and intimate record of medieval Islam.'"], "author": "Anonymous", "num_pages": "1049", "awards": [], "places": [], "character_names": ["Dunyazad", "Shahryar", "Shah Zaman", "Aladdin", "Ali Baba", "Ali Baba", "Aladdin", "Caliph Haroun Al-Raschid", "Syed Nouman", "Cogia Hassan", "Ali Baba", "Aladdin", "Sinbad"], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "0812972147"},
{"url": "https://www.goodreads.com/book/show/19351.The_Epic_of_Gilgamesh", "num_ratings": "67,455", "num_reviews": "3,155", "avg_ratings": 3.66, "genres": ["Classics", "Poetry", "Fiction", "Fantasy", "Mythology", "Literature"], "title": "The Epic of Gilgamesh", "description": ["Miraculously preserved on clay tablets dating back as much as four thousand years, the poem of Gilgamesh, king of Uruk, is the world’s oldest epic, predating Homer by many centuries. The story tells of Gilgamesh’s adventures with the wild man Enkidu, and of his arduous", "Miraculously preserved on clay tablets dating back as much as four thousand years, the poem of Gilgamesh, king of Uruk, is the world’s oldest epic, predating Homer by many centuries. The story tells of Gilgamesh’s adventures with the wild man Enkidu, and of his arduous journey to the ends of the earth in quest of the Babylonian Noah and the secret of immortality. Alongside its themes of family, friendship and the duties of kings, the ", " is, above all, about mankind’s eternal struggle with the fear of death.", "The Babylonian version has been known for over a century, but linguists are still deciphering new fragments in Akkadian and Sumerian. Andrew George’s gripping translation brilliantly combines these into a fluent narrative and will long rank as the definitive English Gilgamesh.", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."], "author": "Anonymous", "num_pages": "120", "awards": [], "places": [], "character_names": ["Gilgamesh", "Enkidu", "Ishtar", "Humbaba", "Utnapishtim"], "language": "English", "publish_date": "2006-05-04 00:00:00", "ISBN": "0141026286"},
{"url": "https://www.goodreads.com/book/show/8936224-rooftops-of-tehran", "num_ratings": "6,248", "num_reviews": "842", "avg_ratings": 4.04, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Iran", "Romance"], "title": "Rooftops of Tehran", "description": ["From “a striking new talent”(Sandra Dallas, author of Tallgrass) comes an unforgettable debut novel of young love and coming of age in an Iran headed toward revolution.In this poignant, eye-opening and emotionally vivid novel, Mahbod Seraji lays bare the beauty and brutality of the centuries-old Persian culture, while reaffirming the human experiences we all share.In a mid", "From “a striking new talent”(Sandra Dallas, author of Tallgrass) comes an unforgettable debut novel of young love and coming of age in an Iran headed toward revolution.In this poignant, eye-opening and emotionally vivid novel, Mahbod Seraji lays bare the beauty and brutality of the centuries-old Persian culture, while reaffirming the human experiences we all share.In a middle-class neighborhood of Iran’s sprawling capital city, 17-year-old Pasha Shahed spends the summer of 1973 on his rooftop with his best friend Ahmed, joking around one minute and asking burning questions about life the next. He also hides a secret love for his beautiful neighbor Zari, who has been betrothed since birth to another man. But the bliss of Pasha and Zari’s stolen time together is shattered when Pasha unwittingly acts as a beacon for the Shah’s secret police. The violent consequences awaken him to the reality of living under a powerful despot, and lead Zari to make a shocking choice…"], "author": "Mahbod Seraji", "num_pages": "368", "awards": [], "places": [], "character_names": ["Pasha Shahed", "Zari", "Ahmed", "Faheemeh"], "language": null, "publish_date": "2009-05-05 00:00:00", "ISBN": "1101046619"},
{"url": "https://www.goodreads.com/book/show/86560.Rub_iy_t_of_Omar_Khayy_m", "num_ratings": "15,170", "num_reviews": "1,257", "avg_ratings": 4.18, "genres": ["Poetry", "Classics", "Philosophy", "Fiction", "Literature"], "title": "Rubáiyát of Omar Khayyám", "description": ["The Rubáiyát of Omar Khayyám (Persian: رباعیات عمر خیام) is the title that Edward FitzGerald gave to his translation of a selection of poems, originally written in Persian and numbering about a thousand, attributed to Omar Khayyám (1048–1131), a Persian poet, mathematician and astronomer. A ruba'i is a two-line stanza with two parts (or hemistichs) per line, hence the word", "The Rubáiyát of Omar Khayyám (Persian: رباعیات عمر خیام‎) is the title that Edward FitzGerald gave to his translation of a selection of poems, originally written in Persian and numbering about a thousand, attributed to Omar Khayyám (1048–1131), a Persian poet, mathematician and astronomer. A ruba'i is a two-line stanza with two parts (or hemistichs) per line, hence the word rubáiyát (derived from the Arabic language root for \"four\"), meaning \"quatrains\"."], "author": "Omar Khayyám", "num_pages": "52", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-30 00:00:00", "ISBN": "1905432453"},
{"url": "https://www.goodreads.com/book/show/43255.Not_Without_My_Daughter", "num_ratings": "21,305", "num_reviews": "1,188", "avg_ratings": 4.06, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Cultural", "Iran"], "title": "Not Without My Daughter", "description": ["In August 1984, Michigan housewife Betty Mahmoody accompanied her husband to his native Iran for a two-week vacation that turned into a permanent stay. To her horror, she found herself and her four-year-old daughter, Mahtob, virtual prisoners of a man rededicated to his Shiite Moslem faith, in a land where women are near-slaves and Americans despised. Their only hope for e", "In August 1984, Michigan housewife Betty Mahmoody accompanied her husband to his native Iran for a two-week vacation that turned into a permanent stay. To her horror, she found herself and her four-year-old daughter, Mahtob, virtual prisoners of a man rededicated to his Shiite Moslem faith, in a land where women are near-slaves and Americans despised. Their only hope for escape lay in a dangerous underground that would not take her child."], "author": "Betty Mahmoody", "num_pages": "528", "awards": [], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2004-07-05 00:00:00", "ISBN": "0552152161"}
]