[
{"url": "https://www.goodreads.com/book/show/693208.The_Absolutely_True_Diary_of_a_Part_Time_Indian", "num_ratings": "191,231", "num_reviews": "21,153", "avg_ratings": 4.12, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Contemporary", "Humor"], "title": "The Absolutely True Diary of a Part-Time Indian", "description": ["Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolut", "Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolutely True Diary of a Part-Time Indian, which is based on the author's own experiences, coupled with poignant drawings by Ellen Forney that reflect the character's art, chronicles the contemporary adolescence of one Native American boy as he attempts to break away from the life he was destined to live.", "With a forward by Markus Zusak, interviews with Sherman Alexie and Ellen Forney, and four-color interior art throughout, this edition is perfect for fans and collectors alike. "], "author": "Sherman Alexie", "num_pages": "230", "awards": ["National Book Award for Young People's Literature (2007)", "Odyssey Award (2009)", "American Indian Library Association Award", "South Carolina Book Award Nominee for Young Adult Book Award (2010)", "Michigan Library Association Thumbs Up! Award Nominee (2008)", "Florida Teens Read Nominee (2009)", "American Indian Youth Literature Award for Best Young Adult Book (Award Retroactively Rescinded in 2018) (2008)", "Boston Globe-Horn Book Award for Fiction (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2010)", "Lincoln Award Nominee (2011)", "James Cook Book Award Nominee (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["United States of America", "Washington (the state)"], "character_names": ["Arnold \"Junior\" Spirit", "Coach", "Rowdy", "Mary \"Runs Away\" Spirit", "Mr. P", "Agnes Adams / Spirit", "Melinda", "Mr. Grant", "Penelope (divers)", "Micah", "Roger \"The Giant\"", "Grandma Spirit", "Eugene", "Dawn", "Mr. Dodge", "Gordy", "Dad Spirit", "Rowdy's Dad", "Mr. Sheridan", "Earl", "Gerald", "Ted", "Bobby"], "language": "English", "publish_date": "2007-09-12 00:00:00", "ISBN": "0316013684"},
{"url": "https://www.goodreads.com/book/show/7736182-the-lost-hero", "num_ratings": "527,663", "num_reviews": "18,705", "avg_ratings": 4.35, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Lost Hero", "description": [".", "He doesn’t remember anything before waking up in a bus full of kids on a field trip. Apparently he has a girlfriend named Piper, and a best friend named Leo. They’re all students at a boarding school for “bad kids.” What did Jason do to end up here? And where is here, exactly?", ".", "Her father has been missing for three days, ever since she", ".", "He doesn’t remember anything before waking up in a bus full of kids on a field trip. Apparently he has a girlfriend named Piper, and a best friend named Leo. They’re all students at a boarding school for “bad kids.” What did Jason do to end up here? And where is here, exactly?", ".", "Her father has been missing for three days, ever since she had that terrifying nightmare about his being in trouble. Piper doesn’t understand her dream, or why her boyfriend suddenly doesn’t recognize her. When a freak storm hits during the school trip, unleashing strange creatures and whisking her, Jason, and Leo away to someplace called Camp Half-Blood, she has a feeling she’s going to find out.", ".", "When he sees his cabin at Camp Half-Blood, filled with power tools and machine parts, he feels right at home. But there’s weird stuff, too—like the curse everyone keeps talking about, and some camper who's gone missing. Weirdest of all, his bunkmates insist that each of them—including Leo—is related to a ", ". Does this have anything to do with Jason's amnesia, or the fact that Leo keeps seeing ghosts?"], "author": "Rick Riordan", "num_pages": "557", "awards": ["West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2011)", "Evergreen Teen Book Award (2013)", "Goodreads Choice Award Nominee for Favorite Book, Young Adult Fantasy  (2010)"], "places": ["New York City, New York", "Detroit, Michigan", "San Francisco, California", "Quebec City, Quebec", "Chicago, Illinois", "Omaha, Nebraska", "Walnut Creek"], "character_names": ["Leo Valdez", "Thalia Grace", "Annabeth Chase", "Hera", "Juno", "Rachel Elizabeth Dare", "Jason Grace", "Piper McLean", "Will Solace"], "language": "English", "publish_date": "2010-10-12 00:00:00", "ISBN": "142311339X"},
{"url": "https://www.goodreads.com/book/show/248484.Book_of_a_Thousand_Days", "num_ratings": "44,285", "num_reviews": "5,890", "avg_ratings": 3.96, "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Fiction"], "title": "Book of a Thousand Days", "description": ["When Dashti, a maid, and Lady Saren, her mistress, are shut in a tower for seven years because of Saren's refusal to marry a man she despises, the two prepare for a very long and dark imprisonment.", "As food runs low and the days go from broiling hot to freezing cold, it is all Dashti can do to keep them fed and comfortable. With the arrival outside the tower of Saren's two s", "When Dashti, a maid, and Lady Saren, her mistress, are shut in a tower for seven years because of Saren's refusal to marry a man she despises, the two prepare for a very long and dark imprisonment.", "As food runs low and the days go from broiling hot to freezing cold, it is all Dashti can do to keep them fed and comfortable. With the arrival outside the tower of Saren's two suitors--one welcome, the other decidedly less so--the girls are confronted with both hope and great danger, and Dashti must make the desperate choices of a girl whose life is worth more than she knows.", "With Shannon Hale's lyrical language, this little-known classic fairy tale from the Brothers Grimm is reimagined and reset on the central Asian steppes; it is a completely unique retelling filled with adventure and romance, drama and disguise."], "author": "Shannon Hale", "num_pages": "306", "awards": ["Utah Book Award for Children/Young Adults (2007)", "Dorothy Canfield Fisher Children's Book Award Nominee (2009)", "Judy Lopez Memorial Award for Children's Literature Nominee (2008)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2010)"], "places": [], "character_names": ["Dashti", "Lady Saren", "Khan Tegus", "Lord Khasar"], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1599900513"},
{"url": "https://www.goodreads.com/book/show/6752378-city-of-fallen-angels", "num_ratings": "406,788", "num_reviews": "20,211", "avg_ratings": 4.15, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal", "Romance"], "title": "City of Fallen Angels", "description": ["The Mortal War is over, and sixteen-year-old Clary Fray is back home in New York, excited about all the possibilities before her. She’s training to become a Shadowhunter and to use her unique power. Her mother is getting married to the love of her life. Downworlders and Shadowhunters are at peace at last. And—most importantly of all—she can finally call Jace her boyfriend.", "The Mortal War is over, and sixteen-year-old Clary Fray is back home in New York, excited about all the possibilities before her. She’s training to become a Shadowhunter and to use her unique power. Her mother is getting married to the love of her life. Downworlders and Shadowhunters are at peace at last. And—most importantly of all—she can finally call Jace her boyfriend.", "But nothing comes without a price.", "Someone is murdering Shadowhunters, provoking tensions between Downworlders and Shadowhunters that could lead to a second, bloody war. Clary’s best friend, Simon, can’t help her—his mother just found out that he’s a vampire, and now he’s homeless. When Jace begins to pull away from her without explaining why, Clary is forced to delve into the heart of a mystery whose solution reveals her worst nightmare: she herself has set in motion a terrible chain of events that could lead to her losing everything she loves. Even Jace."], "author": "Cassandra Clare", "num_pages": "424", "awards": [], "places": ["New York City, New York"], "character_names": ["Alec Lightwood", "Jonathan \"Jace\" Wayland", "Isabelle Lightwood", "Magnus Bane", "Simon Lewis", "Jordan Kyle", "Maia Roberts", "Jocelyn Fray", "Luke Garroway", "Camille Belcourt", "Clarissa \"Clary\" Fray"], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "1442403543"},
{"url": "https://www.goodreads.com/book/show/8490112-daughter-of-smoke-bone", "num_ratings": "258,897", "num_reviews": "25,896", "avg_ratings": 4.03, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Paranormal", "Paranormal", "Angels"], "title": "Daughter of Smoke & Bone", "description": ["Around the world, black hand prints are appearing on doorways, scorched there by winged strangers who have crept through a slit in the sky.", "In a dark and dusty shop, a devil’s supply of human teeth grows dangerously low.", "And in the tangled lanes of Prague, a young art student is about to be caught up in a brutal otherworldly war.", "Meet Karou. She fills her sketchbooks with mon", "Around the world, black hand prints are appearing on doorways, scorched there by winged strangers who have crept through a slit in the sky.", "In a dark and dusty shop, a devil’s supply of human teeth grows dangerously low.", "And in the tangled lanes of Prague, a young art student is about to be caught up in a brutal otherworldly war.", "Meet Karou. She fills her sketchbooks with monsters that may or may not be real, she’s prone to disappearing on mysterious \"errands\", she speaks many languages - not all of them human - and her bright blue hair ", " grows out of her head that color. Who is she? That is the question that haunts her, and she’s about to find out.", "When beautiful, haunted Akiva fixes fiery eyes on her in an alley in Marrakesh, the result is blood and starlight, secrets unveiled, and a star-crossed love whose roots drink deep of a violent past. But will Karou live to regret learning the truth about herself?"], "author": "Laini Taylor", "num_pages": "422", "awards": ["Audie Award for Fantasy (2012)", "Milwaukee County Teen Book Award Nominee (2013)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2012)", "The Inky Awards Nominee for Silver Inky (2012)", "California Young Readers Medal Nominee for Young Adult (2015)", "Oregon Spirit Book Award for Young Adult (2011)", "Lincoln Award Nominee (2014)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)", "Goodreads Choice Award Nominee for Favorite Book of 2011 and Best Young Adult Fantasy & Science Fiction (2011)", "The Inky Awards Shortlist for Silver Inky (2012)", "Missouri Gateway Readers Award Nominee (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2012)"], "places": ["Prague (Praha)", "Marrakech (Marrakesh)", "Eretz"], "character_names": ["Madrigal", "Karou", "Akiva", "Kazimir", "Zuzana", "Issa", "Brimstone", "Thiago", "Mik", "Ziri"], "language": "English", "publish_date": "2011-09-27 00:00:00", "ISBN": "0316134023"},
{"url": "https://www.goodreads.com/book/show/21471358-ia", "num_ratings": "672", "num_reviews": "335", "avg_ratings": 4.04, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Fiction"], "title": "IA: Initiate", "description": [" ", "One young man with latent supernatural abilities plus one street gang hell-bent on recruiting him equals... IA: Initiate. ", " thing in the world to thirteen-year-old orphan, \"Naz\" Andersen is keeping his little sister safe from the streets of a Chicago/Detroit-like urban ghetto known as the Exclave.", " ", "One young man with latent supernatural abilities plus one street gang hell-bent on recruiting him equals... IA: Initiate. ", " thing in the world to thirteen-year-old orphan, \"Naz\" Andersen is keeping his little sister safe from the streets of a Chicago/Detroit-like urban ghetto known as the Exclave. Naz tries to stay out of the way at his foster parent's home, but he walks in his sleep. He is unable to keep the fact that he hears voices from his therapist. He attempts to go unnoticed at school and in the streets of the Exclave but attracts the attention of friends and bullies alike. ", "Naz is ordinary, or so he thinks. He harbors a secret of which he is unaware. A seemingly random act of gang violence propels Naz on a path that leads to discoveries about his supernatural abilities, abilities that will ultimately decide whether he lives or dies. Now he must navigate his turbulent surroundings and face the full force of the world around him. The only way he can survive is to discover the supernatural world within. "], "author": "John Darryl Winston", "num_pages": "220", "awards": ["Readers' Favorite Book Award (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-03-07 00:02:00", "ISBN": "1946006785"},
{"url": "https://www.goodreads.com/book/show/20734410-brainwashed", "num_ratings": "214", "num_reviews": "21", "avg_ratings": 4.26, "genres": ["Mystery", "Childrens", "Middle Grade", "Young Adult", "Adventure", "Fiction", "Cultural", "France"], "title": "Brainwashed", "description": ["While sleeping on the roof of his father’s hotel, thirteen-year-old Lucas Benes finds a baby alone and learns that the Good Company has restarted its profitable kidnapping business.", "Brainwashed (Crime Travelers #1) tracks the secret urban adventures of the New Resistance, a network of international teenage spies. Headquartered in Las Vegas’s posh Globe Hotel, the New Resist", "While sleeping on the roof of his father’s hotel, thirteen-year-old Lucas Benes finds a baby alone and learns that the Good Company has restarted its profitable kidnapping business.", "Brainwashed (Crime Travelers #1) tracks the secret urban adventures of the New Resistance, a network of international teenage spies. Headquartered in Las Vegas’s posh Globe Hotel, the New Resistance sends its Tier One kids to Paris on its biggest mission to date. Lucas leads a group of friends through the hotspots of Paris—from the catacombs to the Eiffel tower—in an all-out effort to sabotage a brainwashing ceremony that could potentially turn them all into “Good” kids."], "author": "Paul Aertker", "num_pages": "308", "awards": [], "places": ["Paris"], "character_names": [], "language": "English", "publish_date": "2014-01-14 00:00:00", "ISBN": "194013711X"},
{"url": "https://www.goodreads.com/book/show/17347389-the-dream-thieves", "num_ratings": "104,552", "num_reviews": "12,750", "avg_ratings": 4.27, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal"], "title": "The Dream Thieves", "description": ["The second installment in the all-new series from the masterful, #1 NEW YORK TIMES bestselling author Maggie Stiefvater!", "Now that the ley lines around Cabeswater have been woken, nothing for Ronan, Gansey, Blue, and Adam will be the same. Ronan, for one, is falling more and more deeply into his dreams, and his dreams are intruding more and more into waking life. Meanwhile,", "The second installment in the all-new series from the masterful, #1 NEW YORK TIMES bestselling author Maggie Stiefvater!", "Now that the ley lines around Cabeswater have been woken, nothing for Ronan, Gansey, Blue, and Adam will be the same. Ronan, for one, is falling more and more deeply into his dreams, and his dreams are intruding more and more into waking life. Meanwhile, some very sinister people are looking for some of the same pieces of the Cabeswater puzzle that Gansey is after…"], "author": "Maggie Stiefvater", "num_pages": "439", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2017)", "Milwaukee County Teen Book Award Nominee (2015)"], "places": ["Henrietta, Virginia"], "character_names": ["Blue Sargent", "Richard \"Dick\" Campbell Gansey III", "Adam Parrish", "Ronan Lynch", "Noah (The Raven Cycle)"], "language": "English", "publish_date": "2013-09-17 00:00:00", "ISBN": "0545424941"},
{"url": "https://www.goodreads.com/book/show/764347.Unwind", "num_ratings": "166,093", "num_reviews": "16,570", "avg_ratings": 4.18, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction"], "title": "Unwind", "description": ["The Second Civil War was fought over reproductive rights. The chilling resolution: Life is inviolable from the moment of conception until age thirteen. Between the ages of thirteen and eighteen, however, parents can have their child \"unwound,\" whereby all of the child's organs are transplanted into different donors, so life", "The Second Civil War was fought over reproductive rights. The chilling resolution: Life is inviolable from the moment of conception until age thirteen. Between the ages of thirteen and eighteen, however, parents can have their child \"unwound,\" whereby all of the child's organs are transplanted into different donors, so life doesn't technically end. Connor is too difficult for his parents to control. Risa, a ward of the state, is not enough to be kept alive. And Lev is a tithe, a child conceived and raised to be unwound. Together, they may have a chance to escape and to survive."], "author": "Neal Shusterman", "num_pages": "335", "awards": ["Evergreen Teen Book Award (2010)", "Sakura Medal for Middle School Book (2009)", "Florida Teens Read Nominee (2009)", "California Young Readers Medal Nominee for Young Adult (2011)", "Gouden Lijst Nominee (2013)", "Green Mountain Book Award (2010)", "Missouri Gateway Readers Award Nominee (2010)", "Oklahoma Sequoyah Award for Intermediate (2010)"], "places": ["Akron, Ohio", "Ohio", "Scottsburg, Indiana", "Arizona", "Joplin, Missouri"], "character_names": ["Lev Calder", "Connor Lassiter", "Risa Ward"], "language": "English", "publish_date": "2007-11-06 00:00:00", "ISBN": "1416912045"},
{"url": "https://www.goodreads.com/book/show/7507944-akata-witch", "num_ratings": "9,611", "num_reviews": "1,940", "avg_ratings": 4.09, "genres": ["Fantasy", "Young Adult", "Fiction", "Cultural", "Africa", "Childrens", "Middle Grade", "Fantasy", "Magic"], "title": "Akata Witch", "description": [" transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befr", " transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befriends Orlu and Chichi, Sunny is plunged in to the world of the Leopard People, where your worst defect becomes your greatest asset. Together, Sunny, Orlu, Chichi and Sasha form the youngest ever Oha Coven. Their mission is to track down Black Hat Otokoto, the man responsible for kidnapping and maiming children. Will Sunny be able to overcome the killer with powers stronger than her own, or will the future she saw in the flames become reality?"], "author": "Nnedi Okorafor", "num_pages": "349", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2011)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)"], "places": ["Nigeria"], "character_names": ["Sunny Nwazue"], "language": "English", "publish_date": "2011-04-14 00:00:00", "ISBN": "0670011967"},
{"url": "https://www.goodreads.com/book/show/8235178-across-the-universe", "num_ratings": "105,709", "num_reviews": "10,016", "avg_ratings": 3.77, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Romance"], "title": "Across the Universe", "description": [" ", "Seventeen-year-old Amy joins her parents as frozen cargo aboard the vast spaceship Godspeed and expects to awaken on a new planet, three hundred years in the future. Never could she have known that her frozen slumber would come to an end fifty years too soon and that she would be thrust into the brave new world o", " ", "Seventeen-year-old Amy joins her parents as frozen cargo aboard the vast spaceship Godspeed and expects to awaken on a new planet, three hundred years in the future. Never could she have known that her frozen slumber would come to an end fifty years too soon and that she would be thrust into the brave new world of a spaceship that lives by its own rules.", "Amy quickly realizes that her awakening was no mere computer malfunction. Someone—one of the few thousand inhabitants of the spaceship —tried to kill her. And if Amy doesn't do something soon, her parents will be next.", "Now Amy must race to unlock Godspeed's hidden secrets. But out of her list of murder suspects, there's only one who matters: Elder, the future leader of the ship and the love she could never have seen coming."], "author": "Beth Revis", "num_pages": "399", "awards": ["Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2011)", "Carnegie Medal Nominee (2012)"], "places": ["Godspeed", "United States of America", "Earth", "Outer Space"], "character_names": ["Harley", "\"Doc\" Bradley Stanwick", "Orion", "Amy Martin", "Elder", "Eldest"], "language": "English", "publish_date": "2011-01-11 00:00:00", "ISBN": "1595143971"},
{"url": "https://www.goodreads.com/book/show/751635.The_Skin_I_m_In", "num_ratings": "11,822", "num_reviews": "1,533", "avg_ratings": 4.14, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Childrens", "Middle Grade", "Young Adult", "Teen"], "title": "The Skin I'm In", "description": ["Miss Saunders, whose skin is blotched with a rare skin condition, serves as a mirror to Maleeka Madison's struggle against the burden of low self-esteem that many black girls face when they're darker skinned. Miss Saunders is tough and through this, Maleeka learns to stand up to tough-talking Charlese."], "author": "Sharon G. Flake", "num_pages": "176", "awards": ["John Steptoe New Talent Author Award for Author (1999)", "California Young Readers Medal Nominee for Middle School/Junior High (2002)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0786813075"},
{"url": "https://www.goodreads.com/book/show/6472451-ash", "num_ratings": "27,424", "num_reviews": "3,025", "avg_ratings": 3.62, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Fiction"], "title": "Ash", "description": ["In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she bel", "In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she believes that her wish may be granted.", "The day that Ash meets Kaisa, the King's Huntress, her heart begins to change. Instead of chasing fairies, Ash learns to hunt with Kaisa. Though their friendship is as delicate as a new bloom, it reawakens Ash's capacity for love-and her desire to live. But Sidhean has already claimed Ash for his own, and she must make a choice between fairy tale dreams and true love.", "Entrancing, empowering, and romantic, ", " is about the connection between life and love, and solitude and death, where transformation can come from even the deepest grief."], "author": "Malinda Lo", "num_pages": "264", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2010)", "Gaylactic Spectrum Award Nominee for Best Novel (2010)", "William C. Morris YA Debut Award Nominee (2010)", "James Tiptree Jr. Award Nominee for Longlist (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Andre Norton Award Nominee (2009)"], "places": [], "character_names": ["Aisling", "Kaisa", "Sidhean"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0316040096"},
{"url": "https://www.goodreads.com/book/show/9415946-huntress", "num_ratings": "9,287", "num_reviews": "982", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Young Adult", "Young Adult Fantasy", "Adventure", "Fantasy", "Magic"], "title": "Huntress", "description": ["Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, th", "Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, the city of the Fairy Queen. Taisin is a sage, thrumming with magic, and Kaede is of the earth, without a speck of the otherworldly. And yet the two girls' destinies are drawn together during the mission. As members of their party succumb to unearthly attacks and fairy tricks, the two come to rely on each other and even begin to fall in love. But the Kingdom needs only one huntress to save it, and what it takes could tear Kaede and Taisin apart forever.", "The exciting adventure prequel to Malinda Lo's highly acclaimed novel ", "is overflowing with lush Chinese influences and details inspired by the ", ", and is filled with action and romance."], "author": "Malinda Lo", "num_pages": "371", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2012)", "James Tiptree Jr. Award Nominee for Longlist (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "031604007X"},
{"url": "https://www.goodreads.com/book/show/7090447-the-red-pyramid", "num_ratings": "267,551", "num_reviews": "11,681", "avg_ratings": 4.07, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Red Pyramid", "description": ["Since his mother's death six years ago, Carter Kane has been living out of a suitcase, traveling the globe with his father, the brilliant Egyptologist, Dr. Julius Kane. But while Carter's been homeschooled, his younger sister, Sadie, has been living with their grandparents in London. Sadie has just what Carter wants—school friends and a chance at a \"normal\" life. But Carte", "Since his mother's death six years ago, Carter Kane has been living out of a suitcase, traveling the globe with his father, the brilliant Egyptologist, Dr. Julius Kane. But while Carter's been homeschooled, his younger sister, Sadie, has been living with their grandparents in London. Sadie has just what Carter wants—school friends and a chance at a \"normal\" life. But Carter has just what Sadie longs for—time with their father. After six years of living apart, the siblings have almost nothing in common. Until now.", "On Christmas Eve, Sadie and Carter are reunited when their father brings them to the British Museum, with a promise that he's going to \"make things right.\" But all does not go according to plan: Carter and Sadie watch as Julius summons a mysterious figure, who quickly banishes their father and causes a fiery explosion.", "Soon Carter and Sadie discover that the gods of Ancient Egypt are waking, and the worst of them—Set—has a frightening scheme. To save their father, they must embark on a dangerous journey—a quest that brings them ever closer to the truth about their family and its links to the House of Life, a secret order that has existed since the time of the pharaohs."], "author": "Rick Riordan", "num_pages": "516", "awards": ["Pennsylvania Young Readers' Choice Award for Grades 6-8 (2012)", "New Mexico Land of Enchantment Award for Young Adult (2012)", "Goodreads Choice Award Nominee for Favorite Book, Young Adult Fantasy (2010)", "Carnegie Medal Nominee (2011)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2011)"], "places": ["London, England", "Cairo", "Phoenix, Arizona", "Duat"], "character_names": ["Bast", "Isis", "Anubis", "Osiris", "Horus (God)", "Carter Kane", "Sadie Kane", "Zia Rashid", "Thoth", "Khufu", "Sekhmet", "Julius Kane", "Geb", "Nut", "Set", "Nephthys", "Serket", "Sobek", "Shu", "Nekhbet", "Apophis", "Philip II of Macedon (The albino crocodile)"], "language": "English", "publish_date": "2010-05-04 00:00:00", "ISBN": "1423113381"},
{"url": "https://www.goodreads.com/book/show/15749186-to-all-the-boys-i-ve-loved-before", "num_ratings": "197,833", "num_reviews": "22,023", "avg_ratings": 4.11, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction", "Womens Fiction", "Chick Lit", "Realistic Fiction", "Young Adult", "Young Adult Contemporary", "Audiobook", "Did Not Finish", "Young Adult", "High School"], "title": "To All the Boys I've Loved Before", "description": ["What if all the crushes you ever had found out how you felt about them… all at once? ", "Sixteen-year-old Lara Jean Song keeps her love letters in a hatbox her mother gave her. They aren’t love letters that anyone else wrote for her; these are ones she’s written. One for every boy she’s ever loved—five in all. When she writes, she pours out her heart and soul and says all the", "What if all the crushes you ever had found out how you felt about them… all at once? ", "Sixteen-year-old Lara Jean Song keeps her love letters in a hatbox her mother gave her. They aren’t love letters that anyone else wrote for her; these are ones she’s written. One for every boy she’s ever loved—five in all. When she writes, she pours out her heart and soul and says all the things she would never say in real life, because her letters are for her eyes only. Until the day her secret letters are mailed, and suddenly, Lara Jean’s love life goes from imaginary to out of control."], "author": "Jenny Han", "num_pages": "355", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Lincoln Award Nominee (2018)", "Goodreads Choice Award Nominee for Young Adult Fiction (2014)"], "places": ["Charlottesville, Virginia"], "character_names": ["Josh", "Kitty", "Margot", "Lara Jean", "Peter Kavinsky"], "language": "English", "publish_date": "2015-03-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11861062-starters", "num_ratings": "37,814", "num_reviews": "4,231", "avg_ratings": 3.91, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Fantasy"], "title": "Starters", "description": ["Callie lost her parents when the Spore Wars wiped out everyone between the ages of twenty and sixty. She and her little brother, Tyler, go on the run, living as squatters with their friend Michael and fighting off renegades who would kill them for a cookie. Callie's only hope is Prime Destinations, a disturbing place in Beverly Hills run by a my", "Callie lost her parents when the Spore Wars wiped out everyone between the ages of twenty and sixty. She and her little brother, Tyler, go on the run, living as squatters with their friend Michael and fighting off renegades who would kill them for a cookie. Callie's only hope is Prime Destinations, a disturbing place in Beverly Hills run by a mysterious figure known as the Old Man.", "He hires teens to rent their bodies to Enders—seniors who want to be young again. Callie, desperate for the money that will keep her, Tyler, and Michael alive, agrees to be a donor. But the neurochip they place in Callie's head malfunctions and she wakes up in the life of her renter, living in her mansion, driving her cars, and going out with a senator's grandson. It feels almost like a fairy tale, until Callie discovers that her renter intends to do more than party—and that Prime Destinations' plans are more evil than Callie could ever have imagined. . . ."], "author": "Lissa Price", "num_pages": "352", "awards": ["Missouri Gateway Readers Award Nominee (2015)"], "places": ["Los Angeles, California"], "character_names": ["Callie Woodland"], "language": "English", "publish_date": "2012-03-13 00:00:00", "ISBN": "0385742371"},
{"url": "https://www.goodreads.com/book/show/8849382-gone-gone-gone", "num_ratings": "2,712", "num_reviews": "360", "avg_ratings": 3.81, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance", "Realistic Fiction"], "title": "Gone, Gone, Gone", "description": ["It's a year after 9/11. Sniper shootings throughout the D.C. area have everyone on edge and trying to make sense of these random acts of violence. Meanwhile, Craig and Lio are just trying to make sense of their lives.", "It's a year after 9/11. Sniper shootings throughout the D.C. area have everyone on edge and trying to make sense of these random acts of violence. Meanwhile, Craig and Lio are just trying to make sense of their lives. ", "Craig’s crushing on quiet, distant Lio, and preoccupied with what it meant when Lio kissed him...and if he’ll do it again...and if kissing Lio will help him finally get over his ex-boyfriend, Cody.", "Lio feels most alive when he's with Craig. He forgets about his broken family, his dead brother, and the messed up world. But being with Craig means being vulnerable...and Lio will have to decide whether love is worth the risk.", "This intense, romantic novel from the author of ", " and ", " is a poignant look at what it is to feel needed, connected, and alive."], "author": "Hannah Moskowitz", "num_pages": "251", "awards": [], "places": [], "character_names": ["Craig Privett"], "language": "English", "publish_date": "2012-04-17 00:00:00", "ISBN": "1442453125"},
{"url": "https://www.goodreads.com/book/show/169762.The_Pox_Party", "num_ratings": "13,109", "num_reviews": "2,047", "avg_ratings": 3.5, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Young Adult", "Teen"], "title": "The Pox Party", "description": ["It sounds like a fairy tale. He is a boy dressed in silks and white wigs and given the finest of classical educations. Raised by a group of rational philosophers known only by numbers, the boy and his mother -- a princess in exile from a faraway land -- are the only persons in their household assigned names. As the boy's regal mother, Cassiopeia, entertains the house schol", "It sounds like a fairy tale. He is a boy dressed in silks and white wigs and given the finest of classical educations. Raised by a group of rational philosophers known only by numbers, the boy and his mother -- a princess in exile from a faraway land -- are the only persons in their household assigned names. As the boy's regal mother, Cassiopeia, entertains the house scholars with her beauty and wit, young Octavian begins to question the purpose behind his guardians' fanatical studies. Only after he dares to open a forbidden door does he learn the hideous nature of their experiments -- and his own chilling role in them. Set against the disquiet of Revolutionary Boston, M. T. Anderson's extraordinary novel takes place at a time when American Patriots rioted and battled to win liberty while African slaves were entreated to risk their lives for a freedom they would never claim. The first of two parts, this deeply provocative novel reimagines the past as an eerie place that has startling resonance for readers today."], "author": "M.T. Anderson", "num_pages": "359", "awards": ["National Book Award for Young People's Literature (2006)", "Michael L. Printz Award Nominee (2007)", "Boston Globe-Horn Book Award (2006)", "Boston Author's Club Young Reader Award (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "0763624020"},
{"url": "https://www.goodreads.com/book/show/25622589-flexible-wings", "num_ratings": "69", "num_reviews": "46", "avg_ratings": 4.65, "genres": ["Fiction", "Young Adult", "Audiobook", "Childrens", "Childrens", "Middle Grade"], "title": "Flexible Wings", "description": ["Summer Stevenson is an eleven-year-old military kid who dreams of having a permanent home and swimming in the Olympics one day, just like her idol Olympian Lia Neal. But those things seem out of reach as her parents “the heroes” continually move the family from house to house like boxed-up toys. ", "After their last move, she thought her life would never change, but now the mo", "Summer Stevenson is an eleven-year-old military kid who dreams of having a permanent home and swimming in the Olympics one day, just like her idol Olympian Lia Neal. But those things seem out of reach as her parents “the heroes” continually move the family from house to house like boxed-up toys. ", "After their last move, she thought her life would never change, but now the moving truck is idling in front of her house again, this time taking the family to Valencia, a small town in southern California known for its bike trails, roller coasters and great schools. But things aren't so great for Summer. She worries constantly that her fighter-pilot mom could be redeployed at any moment, and she struggles to make new friends, finding herself in humiliating circumstances with her neighbors. ", "Summer sees a glimmer of hope when her parents sign her up for competitive swimming, but she turns out to be the worst swimmer on the team! Inspired by nature and drawing support from friendships both old and new, including those with Grandma \"Bachaan,\" her coaches, and other kids on the swim team, Summer seeks the courage she'll need to tackle life's challenges. It isn't until her little sister is in an accident that Summer truly finds the source of her inner strength and uses it to face her greatest fears head-on. "], "author": "Veda Stamps", "num_pages": "298", "awards": ["Independent Publisher Book Award (IPPY) for Multicultural Fiction (2016)", "Moonbeam Children's Book Award", "Readers' Favorite Book Award", "Global Ebook Awards for Juvenile Fiction (Bronze) (2015)", "National Indie Excellence Awards for African American Fiction (2016)", "Foreword INDIES Book of the Year Award Nominee for War & Military & for Juvenile Fiction (2015)", "IBPA Benjamin Franklin Awards for Best New Voice in Children's / YA - Gold (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12893742-the-serpent-s-shadow", "num_ratings": "99,125", "num_reviews": "4,705", "avg_ratings": 4.29, "genres": ["Fantasy", "Fantasy", "Mythology", "Young Adult"], "title": "The Serpent's Shadow", "description": ["He's b-a-a-ack! Despite their best efforts, Carter and Sadie Kane can't seem to keep Apophis, the chaos snake, down. Now Apophis is threatening to plunge the world into eternal darkness, and the Kanes are faced with the impossible task of having to destroy him once and for all. Unfortunately, the magicians of the House of Life are on the brink of civil war, the gods are di", "He's b-a-a-ack! Despite their best efforts, Carter and Sadie Kane can't seem to keep Apophis, the chaos snake, down. Now Apophis is threatening to plunge the world into eternal darkness, and the Kanes are faced with the impossible task of having to destroy him once and for all. Unfortunately, the magicians of the House of Life are on the brink of civil war, the gods are divided, and the young initiates of Brooklyn House stand almost alone against the forces of chaos. The Kanes' only hope is an ancient spell that might turn the serpent's own shadow into a weapon, but the magic has been lost for a millennia. To find the answer they need, the Kanes must rely on the murderous ghost of a powerful magician who might be able to lead them to the serpent's shadow . . . or might lead them to their deaths in the depths of the underworld. Nothing less than the mortal world is at stake when the Kane family fulfills its destiny in this thrilling conclusion to the Kane Chronicles."], "author": "Rick Riordan", "num_pages": "406", "awards": [], "places": [], "character_names": ["Bast", "Bes", "Anubis", "Osiris", "Carter Kane", "Sadie Kane"], "language": "English", "publish_date": "2012-05-01 00:00:00", "ISBN": "1423140575"},
{"url": "https://www.goodreads.com/book/show/522782.Parrotfish", "num_ratings": "5,341", "num_reviews": "479", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Glbt", "Queer", "Fiction"], "title": "Parrotfish", "description": ["\"Last week I cut my hair, bought some boys' clothes and shoes, wrapped a large ACE bandage around my chest to flatten my fortunately-not-large breasts, and began looking for a new name.\" ", "\"Last week I cut my hair, bought some boys' clothes and shoes, wrapped a large ACE bandage around my chest to flatten my fortunately-not-large breasts, and began looking for a new name.\" "], "author": "Ellen Wittlinger", "num_pages": "294", "awards": [], "places": ["Massachusetts"], "character_names": [], "language": "English", "publish_date": "2007-07-10 00:00:00", "ISBN": "1416916229"},
{"url": "https://www.goodreads.com/book/show/13642.A_Wizard_of_Earthsea", "num_ratings": "185,126", "num_reviews": "6,669", "avg_ratings": 4.0, "genres": ["Fantasy", "Fiction", "Young Adult", "Classics"], "title": "A Wizard of Earthsea", "description": ["Ged, the greatest sorcerer in all Earthsea, was called Sparrowhawk in his reckless youth. ", "Hungry for power and knowledge, Sparrowhawk tampered with long-held secrets and loosed a terrible shadow upon the world. This is the tale of his testing, how he mastered the mighty words of power, tamed an ancient dragon, and crossed death's threshold to restore the balance."], "author": "Ursula K. Le Guin", "num_pages": "183", "awards": ["Lewis Carroll Shelf Award (1979)", "Boston Globe-Horn Book Award for Fiction (1969)", "Złota Sepulka for Książka autora zagranicznego (1984)"], "places": ["Earthsea Realm"], "character_names": ["Ged"], "language": "English", "publish_date": "2004-09-28 00:00:00", "ISBN": "0553383043"},
{"url": "https://www.goodreads.com/book/show/633270.The_Ear_the_Eye_and_the_Arm", "num_ratings": "14,358", "num_reviews": "809", "avg_ratings": 3.86, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Fiction", "Adventure"], "title": "The Ear, the Eye, and the Arm", "description": ["General Matsika's children steal out of the house on a forbidden adventure--and disappear. In Zimbabwe, in the year 2194, the children's parents call in Africa's most unusual detectives--the Ear, the Eye and the Arm--who have powers far beyond those of other human beings. The children must avoid the evils of the past, the technology of the future, and a motley assortment o", "General Matsika's children steal out of the house on a forbidden adventure--and disappear. In Zimbabwe, in the year 2194, the children's parents call in Africa's most unusual detectives--the Ear, the Eye and the Arm--who have powers far beyond those of other human beings. The children must avoid the evils of the past, the technology of the future, and a motley assortment of criminals in order to return home safely. 1995 Newbery Honor Book; ALA Notable Book; ALA Best Book for Young Adults."], "author": "Nancy Farmer", "num_pages": "311", "awards": ["Newbery Medal Nominee (1995)", "Golden Duck Award for Hal Clement Award for Young Adult (1995)", "Dorothy Canfield Fisher Children's Book Award Nominee (1996)"], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "0140376410"},
{"url": "https://www.goodreads.com/book/show/3682.A_Great_and_Terrible_Beauty", "num_ratings": "189,729", "num_reviews": "9,293", "avg_ratings": 3.79, "genres": ["Fantasy", "Young Adult", "Historical", "Historical Fiction", "Fiction", "Historical"], "title": "A Great and Terrible Beauty", "description": ["In this debut gothic novel mysterious visions, dark family secrets and a long-lost diary thrust Gemma and her classmates back into the horrors that followed her from India. (Ages 12+)", "It's 1895, and after the suicide of her mother, 16-year-old Gemma Doyle is shipped off from the life she knows in India to Spence, a proper boarding school in England. Lonely, guilt-ridden, an", "In this debut gothic novel mysterious visions, dark family secrets and a long-lost diary thrust Gemma and her classmates back into the horrors that followed her from India. (Ages 12+)", "It's 1895, and after the suicide of her mother, 16-year-old Gemma Doyle is shipped off from the life she knows in India to Spence, a proper boarding school in England. Lonely, guilt-ridden, and prone to visions of the future that have an uncomfortable habit of coming true, Gemma's reception there is a chilly one. To make things worse, she's been followed by a mysterious young Indian man, a man sent to watch her. But why? What is her destiny? And what will her entanglement with Spence's most powerful girls—and their foray into the spiritual world—lead to?"], "author": "Libba Bray", "num_pages": "403", "awards": ["Iowa High School Book Award (2007)", "Lincoln Award Nominee (2007)"], "places": ["United Kingdom", "India", "London, England"], "character_names": ["Gemma Doyle", "Kartik", "Ann Bradshaw", "Felicity Worthington", "Pippa Cross"], "language": "English", "publish_date": "2003-12-09 00:00:00", "ISBN": "0689875347"},
{"url": "https://www.goodreads.com/book/show/9284655-tiger-s-curse", "num_ratings": "52,967", "num_reviews": "5,573", "avg_ratings": 4.06, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Paranormal"], "title": "Tiger's Curse", "description": ["Passion. Fate. Loyalty.", "Would you risk it all to change your destiny?", "The last thing Kelsey Hayes thought she’d be doing this summer was trying to break a 300-year-old Indian curse. With a mysterious white tiger named Ren. Halfway around the world. But that’s exactly what happened. Face-to-face with dark forces, spellbinding magic, and mystical worlds where nothing is what i", "Passion. Fate. Loyalty.", "Would you risk it all to change your destiny?", "The last thing Kelsey Hayes thought she’d be doing this summer was trying to break a 300-year-old Indian curse. With a mysterious white tiger named Ren. Halfway around the world. But that’s exactly what happened. Face-to-face with dark forces, spellbinding magic, and mystical worlds where nothing is what it seems, Kelsey risks everything to piece together an ancient prophecy that could break the curse forever.", "Tiger’s Curse is the exciting first volume in an epic fantasy-romance that will leave you breathless and yearning for more."], "author": "Colleen Houck", "num_pages": "403", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Protagonist Novel (2011)", "Soaring Eagle Book Award (2013)", "Next Generation Indie Book Awards Nominee for Young Adult Fiction (2010)"], "places": [], "character_names": ["Kishan", "Kelsey Hayes", "Dhiren"], "language": "English", "publish_date": "2011-01-11 00:00:00", "ISBN": "1402784031"},
{"url": "https://www.goodreads.com/book/show/13601203-where-shadows-dance", "num_ratings": "16", "num_reviews": "9", "avg_ratings": 3.88, "genres": ["Young Adult", "Young Adult", "Young Adult Fantasy", "Horror", "Fantasy", "Paranormal"], "title": "Where Shadows Dance", "description": ["Ash was looking forward to a summer of camping with friends and time travelling. Then his Great Aunt fades away (literally), his near-death nightmare gets even weirder and he keeps falling into someone else's dreams. On top of that, his house is attacked and he gets trapped in the past while trying to help a new friend who isn't too friendly. Juna isn't having a great time", "Ash was looking forward to a summer of camping with friends and time travelling. Then his Great Aunt fades away (literally), his near-death nightmare gets even weirder and he keeps falling into someone else's dreams. On top of that, his house is attacked and he gets trapped in the past while trying to help a new friend who isn't too friendly. Juna isn't having a great time of it either: having escaped from her parole officer, she barely survives falling out of a plane and getting sucked into a bizarre tornado that keeps appearing in the most unlikely situations. While Ash and Juna try to get out of the past and back home, events and dreams keep pointing them to the place where it all starts and ends, where shadows dance and time bends. If they can get there, they may be able to stop an implacable enemy from destroying their future. Of course, getting there means surviving first."], "author": "Vered Ehsani", "num_pages": "140", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-03 00:00:00", "ISBN": "1470179857"},
{"url": "https://www.goodreads.com/book/show/20344662-just-a-drop-of-water", "num_ratings": "527", "num_reviews": "132", "avg_ratings": 4.12, "genres": ["Childrens", "Middle Grade", "Historical", "Historical Fiction", "Realistic Fiction", "Historical", "Fiction"], "title": "Just a Drop of Water", "description": ["Ever since he was little, Jake Green has longed to be a soldier and a hero like his grandpa, who died serving his country. Right now, though, he just wants to outsmart—and outrun—the rival cross country team, the Palmetto Bugs. But then the tragedy of September 11 happens. It’s quickly discovered that one of the hijackers lived nearby, making Jake’s Florida town an FBI hot", "Ever since he was little, Jake Green has longed to be a soldier and a hero like his grandpa, who died serving his country. Right now, though, he just wants to outsmart—and outrun—the rival cross country team, the Palmetto Bugs. But then the tragedy of September 11 happens. It’s quickly discovered that one of the hijackers lived nearby, making Jake’s Florida town an FBI hot spot. Two days later, the tragedy becomes even more personal when Jake’s best friend, Sam Madina, is pummeled for being an Arab Muslim by their bully classmate, Bobby.", "According to Jake’s personal code of conduct, anyone who beats up your best friend is due for a butt kicking, and so Jake goes after Bobby. But soon after, Sam’s father is detained by the FBI and Jake’s mom doubts the innocence of Sam’s family, forcing Jake to choose between his best friend and his parents. When Jake finds out that Sam’s been keeping secrets, too, he doesn’t know who his allies are anymore. But the final blow comes when his grandpa’s real past is revealed to Jake. Suddenly, everything he ever knew to be true feels like one big lie. In the end, he must decide: either walk away from Sam and the revenge that Bobby has planned, or become the hero he’s always aspired to be.", "A gripping and intensely touching debut middle grade novel by Kerry O’Malley Cerra, ", " brings the events of September 11, which shook the world, into the lens of a young boy who is desperately trying to understand the ramifications of this life-altering event.", "Winner of a Florida Book Award, the Crystal Kite Award, and named to VOYAs Top Shelf Fiction for Middle Readers' 2014 list, ", " is a read for all age levels."], "author": "Kerry O'Malley Cerra", "num_pages": "320", "awards": ["Missouri Truman Readers Award Nominee (2017)", "Florida Book Award for Children's Literature - Bronze (2014)", "SCBWI Crystal Kite Member Choice Award for Southeast (2015)", "The Magnolia Award Nominee for 6-8 (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-02 00:00:00", "ISBN": "1629146137"},
{"url": "https://www.goodreads.com/book/show/8537327-inside-out-back-again", "num_ratings": "31,957", "num_reviews": "5,077", "avg_ratings": 4.1, "genres": ["Historical", "Historical Fiction", "Poetry", "Childrens", "Middle Grade", "Young Adult", "Fiction", "Childrens", "Historical", "Cultural", "Realistic Fiction", "War"], "title": "Inside Out & Back Again", "description": ["For all the ten years of her life, Hà has only known Saigon: the thrills of its markets, the joy of its traditions, and the warmth of her friends close by. But now the Vietnam War has reached her home. Hà and her family are forced to flee as Saigon falls, and they board a ship headed toward hope. In America, Hà discovers the foreign world of Alabama: the coldness of its st", "For all the ten years of her life, Hà has only known Saigon: the thrills of its markets, the joy of its traditions, and the warmth of her friends close by. But now the Vietnam War has reached her home. Hà and her family are forced to flee as Saigon falls, and they board a ship headed toward hope. In America, Hà discovers the foreign world of Alabama: the coldness of its strangers, the dullness of its food . . . and the strength of her very own family."], "author": "Thanhha Lai", "num_pages": "272", "awards": ["Newbery Medal Nominee (2012)", "National Book Award for Young People's Literature (2011)", "Jane Addams Children's Book Award Nominee for Older Children (2012)", "Pennsylvania Young Readers' Choice Award Nominee for Grades 6-8 (2014)", "Dorothy Canfield Fisher Children's Book Award Nominee (2013)", "Washington State Sasquatch Award Nominee (2014)", "Rebecca Caudill Young Readers' Book Award Nominee (2013)"], "places": ["Saigon", "Alabama"], "character_names": ["Mother", "Kim Ha", "Miss Washington", "Brother Quang", "Vu Lee", "Brother Khoi", "Cowboy"], "language": "English", "publish_date": "2011-02-22 00:00:00", "ISBN": "0061962783"},
{"url": "https://www.goodreads.com/book/show/11735983-insurgent", "num_ratings": "1,008,781", "num_reviews": "57,100", "avg_ratings": 4.06, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Fiction", "Fantasy"], "title": "Insurgent", "description": ["One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.", "Tris's initiation day should have been marked by celebration", "One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.", "Tris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable—and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.", " bestselling author Veronica Roth's much-anticipated second book of the dystopian DIVERGENT series is another intoxicating thrill ride of a story, rich with hallmark twists, heartbreaks, romance, and powerful insights about human nature."], "author": "Veronica Roth", "num_pages": "525", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Young Adult Protagonist (2011)", "Goodreads Choice Award for Best Young Adult Fantasy and Best Goodreads Author (2012)"], "places": ["Chicago, Illinois"], "character_names": ["Albert", "Drew Leighton (Divergent)", "Eric (Divergent)", "Beatrice Prior", "Peter", "Caleb Prior", "Natalie Prior", "Molly Atwood", "Christina", "Jeanine Matthews", "Marcus Eaton", "Tobias Eaton"], "language": "English", "publish_date": "2012-05-01 00:00:00", "ISBN": "0007442912"},
{"url": "https://www.goodreads.com/book/show/3348596-ten-things-i-hate-about-me", "num_ratings": "3,514", "num_reviews": "443", "avg_ratings": 3.6, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction", "Religion"], "title": "Ten Things I Hate About Me", "description": ["Randa Abdel-Fattah's new novel about finding your place in life . . . and learning to accept yourself and your culture.", "At school I'm Aussie-blonde Jamie -- one of the crowd. At home I'm Muslim Jamilah -- driven mad by my Stone Age dad. I should win an Oscar for my acting skills. But I can't keep it up for much longer...", "Jamie just wants to fit in. She doesn't want to be see", "Randa Abdel-Fattah's new novel about finding your place in life . . . and learning to accept yourself and your culture.", "At school I'm Aussie-blonde Jamie -- one of the crowd. At home I'm Muslim Jamilah -- driven mad by my Stone Age dad. I should win an Oscar for my acting skills. But I can't keep it up for much longer...", "Jamie just wants to fit in. She doesn't want to be seen as a stereotypical Muslim girl, so she does everything possible to hide that part of herself. Even if it means pushing her friends away because she's afraid to let them know her dad forbids her from hanging out with boys or that she secretly loves to play the darabuka (Arabic drums)."], "author": "Randa Abdel-Fattah", "num_pages": "304", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Novel (2009)"], "places": ["Australia"], "character_names": [], "language": "English", "publish_date": "2009-01-01 00:00:00", "ISBN": "0545050553"},
{"url": "https://www.goodreads.com/book/show/6380296-liar", "num_ratings": "8,211", "num_reviews": "1,603", "avg_ratings": 3.3, "genres": ["Young Adult", "Fantasy", "Fiction", "Mystery", "Fantasy", "Paranormal", "Young Adult", "Teen"], "title": "Liar", "author": "Justine Larbalestier", "num_pages": "376", "awards": ["Ditmar Award Nominee for Best Novel (2010)", "Western Australian Premier's Book Award for Young Adult (2009)", "Children's Book Council of Australia Award Nominee for Older Readers Book of the Year (2010)", "Queensland Premier's Literary Awards Nominee for Young Adult Book Award (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Davitt Award for Best Young Adult Novel (2010)", "The Inky Awards Shortlist for Gold Inky (2010)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "1599903059"},
{"url": "https://www.goodreads.com/book/show/1257586.Zahrah_the_Windseeker", "num_ratings": "1,670", "num_reviews": "289", "avg_ratings": 4.12, "genres": ["Fantasy", "Young Adult", "Fiction", "Science Fiction", "Cultural", "Africa", "Childrens", "Middle Grade"], "title": "Zahrah the Windseeker", "description": ["In the northern Ooni Kingdom, fear of the unknown runs deep, and children born dada are rumored to have special powers. Thirteen-year-old Zahrah Tsami feels like a normal girl -- she grows her own flora computer, has mirrors sewn onto her clothes, and stays clear of the Forbidden Greeny Jungle. But unlike other kids in the village of Kirki, Zahrah was born with the telling", "In the northern Ooni Kingdom, fear of the unknown runs deep, and children born dada are rumored to have special powers. Thirteen-year-old Zahrah Tsami feels like a normal girl -- she grows her own flora computer, has mirrors sewn onto her clothes, and stays clear of the Forbidden Greeny Jungle. But unlike other kids in the village of Kirki, Zahrah was born with the telling dadalocks. Only her best friend, Dari, isn't afraid of her, even when something unusual begins happening -- something that definitely makes Zahrah different. The two friends investigate, edging closer and closer to danger. When Dari's life is threatened. Zahrah must face her worst fears alone, including the very thing that makes her different.", "In this exciting debut novel by Nnedi Okorafor-Mbachu, things aren't always what they seem -- monkeys tell fortunes, plants offer wisdom, and a teenage girl is the only one who stands a chance at saving her best friend's life.", "-from the Hardcover edition"], "author": "Nnedi Okorafor", "num_pages": "308", "awards": ["Wole Soyinka Prize for Literature in Africa  (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-26 00:00:00", "ISBN": "0618340904"},
{"url": "https://www.goodreads.com/book/show/2986865-eon", "num_ratings": "50,254", "num_reviews": "4,122", "avg_ratings": 3.98, "genres": ["Fantasy", "Young Adult", "Fantasy", "Dragons", "Fantasy", "Magic"], "title": "Eon: Dragoneye Reborn", "description": ["Also Known As: Two Pearls of Wisdom, Eon: Rise of the Dragoneye, and Eon (All the same book just published with different publishers)", "Twelve-year-old Eon has been in training for years. His intensive study of Dragon Magic, based on East Asian astrology, involves two kinds of skills: sword-work and magical aptitude.", "Also Known As: Two Pearls of Wisdom, Eon: Rise of the Dragoneye, and Eon (All the same book just published with different publishers)", "Twelve-year-old Eon has been in training for years. His intensive study of Dragon Magic, based on East Asian astrology, involves two kinds of skills: sword-work and magical aptitude. He and his master hope that he will be chosen as a Dragoneye--an apprentice to one of the twelve energy dragons of good fortune. ", "But Eon has a dangerous secret. He is actually Eona, a sixteen-year-old girl who has been masquerading as a boy for the chance to become a Dragoneye. Females are forbidden to use Dragon Magic; if anyone discovers she has been hiding in plain sight, her death is assured.", "When Eon's secret threatens to come to light, she and her allies are plunged into grave danger and a deadly struggle for the Imperial throne. Eon must find the strength and inner power to battle those who want to take her magic...and her life."], "author": "Alison Goodman", "num_pages": "531", "awards": ["Victorian Premier's Literary Award Nominee for Young Adult Fiction Prize (2009)", "Aurealis Award for Best Fantasy Novel & Nominee for Young Adult Novel (2008)", "The Inky Awards Nominee for Gold Inky (2009)", "James Tiptree Jr. Award Honor List (2008)"], "places": [], "character_names": ["Dillon Walsh", "Eona", "Rilla", "Chart", "Ryoko", "Lady Jila", "Lord Ido"], "language": "English", "publish_date": "2008-12-26 00:00:00", "ISBN": "0670062278"},
{"url": "https://www.goodreads.com/book/show/19542841-more-happy-than-not", "num_ratings": "24,119", "num_reviews": "4,970", "avg_ratings": 4.07, "genres": ["Young Adult", "Lgbt", "Contemporary", "Fiction"], "title": "More Happy Than Not", "description": ["Part Eternal Sunshine of the Spotless Mind, part Aristotle and Dante Discover the Secrets of the Universe, Adam Silvera's extraordinary debut confronts race, class, and sexuality during one charged near-future summer in the Bronx. ", "Sixteen-year-old Aaron Soto is struggling to find happiness after a family tragedy leaves him reeling. He's slowly remembering what happiness mi", "Part Eternal Sunshine of the Spotless Mind, part Aristotle and Dante Discover the Secrets of the Universe, Adam Silvera's extraordinary debut confronts race, class, and sexuality during one charged near-future summer in the Bronx. ", "Sixteen-year-old Aaron Soto is struggling to find happiness after a family tragedy leaves him reeling. He's slowly remembering what happiness might feel like this summer with the support of his girlfriend Genevieve, but it's his new best friend, Thomas, who really gets Aaron to open up about his past and confront his future.", "As Thomas and Aaron get closer, Aaron discovers things about himself that threaten to shatter his newfound contentment. A revolutionary memory-alteration procedure, courtesy of the Leteo Institute, might be the way to straighten himself out. But what if it means forgetting who he truly is?"], "author": "Adam Silvera", "num_pages": "295", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2015)"], "places": ["Bronx, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-02 00:00:00", "ISBN": "1616955600"},
{"url": "https://www.goodreads.com/book/show/6596547-mockingbird", "num_ratings": "26,009", "num_reviews": "3,954", "avg_ratings": 4.18, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Childrens", "Middle Grade", "Childrens"], "title": "Mockingbird", "description": ["In Caitlin’s world, everything is black or white. Things are good or bad. Anything in between is confusing. That’s the stuff Caitlin’s older brother, Devon, has always explained. But now Devon’s dead and Dad is no help at all. Caitlin wants to get over it, but as an eleven-year-old girl with Asperger’s, she doesn’t know how. When she reads the definition of closure, she re", "In Caitlin’s world, everything is black or white. Things are good or bad. Anything in between is confusing. That’s the stuff Caitlin’s older brother, Devon, has always explained. But now Devon’s dead and Dad is no help at all. Caitlin wants to get over it, but as an eleven-year-old girl with Asperger’s, she doesn’t know how. When she reads the definition of closure, she realizes that is what she needs. In her search for it, Caitlin discovers that not everything is black and white—the world is full of colors—messy and beautiful.Kathryn Erskine has written a must-read gem, one of the most moving novels of the year."], "author": "Kathryn Erskine", "num_pages": "235", "awards": ["National Book Award for Young People's Literature (2010)", "Dorothy Canfield Fisher Children's Book Award Nominee (2012)", "Charlie May Simon Children's Book Award Nominee (2013)", "Iowa Children's Choice Award Nominee (2013)", "Georgia Book Award Nominee (2010)", "Washington State Sasquatch Award Nominee (2014)", "Goodreads Choice Award Nominee (2010)", "Dolly Gray Children's Literature Award (2012)", "Rebecca Caudill Young Readers' Book Award Nominee (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-04-15 00:00:00", "ISBN": "0399252649"},
{"url": "https://www.goodreads.com/book/show/6461779-magic-under-glass", "num_ratings": "4,453", "num_reviews": "719", "avg_ratings": 3.61, "genres": ["Fantasy", "Young Adult", "Romance", "Science Fiction", "Steampunk", "Fantasy", "Magic", "Fiction"], "title": "Magic Under Glass", "description": ["Nimira is a music-hall performer forced to dance for pennies to an audience of leering drunks. When wealthy sorcerer Hollin Parry hires her to do a special act - singing accompaniment to an exquisite piano-playing automaton, Nimira believes it is the start of a new life. In Parry's world, however, buried secrets stir. ", "Unsettling below-stairs rumours abound about ghosts, a", "Nimira is a music-hall performer forced to dance for pennies to an audience of leering drunks. When wealthy sorcerer Hollin Parry hires her to do a special act - singing accompaniment to an exquisite piano-playing automaton, Nimira believes it is the start of a new life. In Parry's world, however, buried secrets stir. ", "Unsettling below-stairs rumours abound about ghosts, a mad woman roaming the halls, and of Parry's involvement in a gang of ruthless sorcerers who torture fairies for sport. When Nimira discovers the spirit of a dashing young fairy gentleman is trapped inside the automaton's stiff limbs, waiting for someone to break the curse and set him free, the two fall in love. But it is a love set against a dreadful race against time to save the entire fairy realm, which is in mortal peril."], "author": "Jaclyn Dolamore", "num_pages": "225", "awards": [], "places": ["Lorinar"], "character_names": ["Nimira", "Erris", "Hollin Parry"], "language": "English", "publish_date": "2010-02-01 00:00:00", "ISBN": "1408802120"},
{"url": "https://www.goodreads.com/book/show/17302571-if-you-could-be-mine", "num_ratings": "6,680", "num_reviews": "1,021", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Romance", "Fiction", "Contemporary", "Glbt", "Queer"], "title": "If You Could Be Mine", "description": ["Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged f", "Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged for her marriage. Nasrin tries to persuade Sahar that they can go on as they have been, only now with new comforts provided by the decent, well-to-do doctor Nasrin will marry. But Sahar dreams of loving Nasrin exclusively—and openly.", "Then Sahar discovers what seems like the perfect solution. In Iran, homosexuality may be a crime, but to be a man trapped in a woman’s body is seen as nature’s mistake, and sex reassignment is legal and accessible. As a man, Sahar could be the one to marry Nasrin. Sahar will never be able to love the one she wants, in the body she wants to be loved in, without risking her life. Is saving her love worth sacrificing her true self?"], "author": "Sara Farizan", "num_pages": "256", "awards": ["Edmund White Award for Debut Fiction (2014)", "Ferro-Grumley Award for LGBT Fiction (2014)", "Lambda Literary Award for Debut Lesbian Fiction (2014)", "Lincoln Award Nominee (2016)"], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "1616202513"},
{"url": "https://www.goodreads.com/book/show/9067850-the-throne-of-fire", "num_ratings": "134,091", "num_reviews": "5,299", "avg_ratings": 4.21, "genres": ["Fantasy", "Fantasy", "Mythology", "Young Adult"], "title": "The Throne of Fire", "description": ["Ever since the gods of Ancient Egypt were unleashed in the modern world, Carter Kane and his sister Sadie have been in trouble. As descendants of the House of Life, the Kanes have some powers at their command, but the devious gods haven't given them much time to master their skills at Brooklyn House, which has become a training ground for young magicians. ", "And now their mos", "Ever since the gods of Ancient Egypt were unleashed in the modern world, Carter Kane and his sister Sadie have been in trouble. As descendants of the House of Life, the Kanes have some powers at their command, but the devious gods haven't given them much time to master their skills at Brooklyn House, which has become a training ground for young magicians. ", "And now their most threatening enemy yet - the chaos snake Apophis - is rising. If they don't prevent him from breaking free in a few days' time, the world will come to an end. In other words, it's a typical week for the Kane family. ", "To have any chance of battling the Forces of Chaos, the Kanes must revive the sun god Ra. But that would be a feat more powerful than any magician has ever accomplished. ", "First they have to search the world for the three sections of the Book of Ra, then they have to learn how to chant its spells. Oh, and did we mention that no one knows where Ra is exactly? ", "Narrated in two different wisecracking voices, featuring a large cast of new and unforgettable characters, and with adventures spanning the globe, this second installment in the Kane Chronicles is nothing short of a thrill ride."], "author": "Rick Riordan", "num_pages": "452", "awards": [], "places": ["Brooklyn, New York City, New York", "Duat", "Alexandria", "London, England", "Saint Petersburg"], "character_names": ["Bast", "Bes", "Isis", "Anubis", "Osiris", "Horus (God)", "Carter Kane", "Sadie Kane", "Zia Rashid", "Thoth", "Khufu", "Babi", "Ra", "Set", "Nephthys", "Sobek", "Taweret", "Nekhbet", "Apophis", "Vladimir Menshikov", "Walt Stone", "Khepri", "Khnum", "Khonsu", "Ptah"], "language": "English", "publish_date": "2011-05-03 00:00:00", "ISBN": "1423140567"},
{"url": "https://www.goodreads.com/book/show/10429045-shatter-me", "num_ratings": "228,134", "num_reviews": "23,806", "avg_ratings": 3.99, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Romance", "Fantasy"], "title": "Shatter Me", "description": ["I have a gift", "I'm more than human", "My touch is power", "I will fight back", "Juliette hasn’t touched anyone in exactly 264 days.", "The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really car", "I have a gift", "I'm more than human", "My touch is power", "I will fight back", "Juliette hasn’t touched anyone in exactly 264 days.", "The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color.", "The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now.", "Juliette has to make a choice: Be a weapon. Or be a warrior."], "author": "Tahereh Mafi", "num_pages": "338", "awards": ["Arab American Book Award Nominee for Children's/Young Adult (2013)"], "places": [], "character_names": ["Adam Kent", "Juliette Ferrars", "Aaron Warner Anderson", "Kenji Kishimoto", "Castle"], "language": "English", "publish_date": "2011-11-15 00:00:00", "ISBN": "0062085484"},
{"url": "https://www.goodreads.com/book/show/10429092-the-girl-of-fire-and-thorns", "num_ratings": "67,818", "num_reviews": "6,578", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Did Not Finish"], "title": "The Girl of Fire and Thorns", "description": ["Elisa is the chosen one. ", "But she is also the younger of two princesses, the one who has never done anything remarkable. She can't see how she ever will. ", "Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs the chosen one, not a fa", "Elisa is the chosen one. ", "But she is also the younger of two princesses, the one who has never done anything remarkable. She can't see how she ever will. ", "Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs the chosen one, not a failure of a princess.", "And he's not the only one who seeks her. Savage enemies seething with dark magic are hunting her. A daring, determined revolutionary thinks she could be his people's savior. And he looks at her in a way that no man has ever looked at her before. Soon it is not just her life, but her very heart that is at stake.", "Elisa could be everything to those who need her most. If the prophecy is fulfilled. If she finds the power deep within herself. If she doesn’t die young.", "Most of the chosen do."], "author": "Rae Carson", "num_pages": "423", "awards": ["William C. Morris YA Debut Award Nominee (2012)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)", "Ohioana Book Award for Young Adult (2012)", "Cybils Award Nominee for Fantasy & Science Fiction (Young Adult) (2011)"], "places": [], "character_names": ["Alejandro de Vega", "Lucero-Elisa de Riqueza", "Humberto", "Ximena", "Cosme", "Hector of Ventierra"], "language": "English", "publish_date": "2011-09-20 00:00:00", "ISBN": "0062026488"},
{"url": "https://www.goodreads.com/book/show/175395.Code_Talker", "num_ratings": "8,046", "num_reviews": "1,183", "avg_ratings": 3.86, "genres": ["Young Adult", "War", "Historical", "War", "World War II"], "title": "Code Talker: A Novel About the Navajo Marines of World War Two", "description": ["Throughout World War II, in the conflict fought against Japan, Navajo code talkers were a crucial part of the U.S. effort, sending messages back and forth in an unbreakable code that used their native language. They braved some of the heaviest fighting of the war, and with their code, they saved countless American lives. Yet their story remained classified for more than tw", "Throughout World War II, in the conflict fought against Japan, Navajo code talkers were a crucial part of the U.S. effort, sending messages back and forth in an unbreakable code that used their native language. They braved some of the heaviest fighting of the war, and with their code, they saved countless American lives. Yet their story remained classified for more than twenty years.", "Joseph Bruchac brings their stories to life for young adults through the riveting fictional tale of Ned Begay, a sixteen-year-old Navajo boy who becomes a code talker. His grueling journey is eye-opening and inspiring. This deeply affecting novel honors all of those young men, like Ned, who dared to serve, and it honors the culture and language of the Navajo Indians."], "author": "Joseph Bruchac", "num_pages": "240", "awards": ["Rebecca Caudill Young Readers' Book Award Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-06 00:00:00", "ISBN": "0142405965"},
{"url": "https://www.goodreads.com/book/show/11004020-diary-of-a-part-time-ghost", "num_ratings": "18", "num_reviews": "11", "avg_ratings": 4.0, "genres": ["Fantasy", "Paranormal", "Young Adult", "Young Adult Fantasy", "Science Fiction", "Time Travel", "Fantasy", "Paranormal", "Ghosts"], "title": "Diary of a Part-Time Ghost", "description": ["In the first book of the 'Ghost & Shadows' series, fifteen-year old Ash wants nothing more than to be a normal kid and avoid trouble. And then his birthday gift transforms him into a ghost and zaps him back in time to the beginning of the American Revolution. If he thought that was bad, it's about to get a whole lot worse. Armed only with an ancient history book and th", "In the first book of the 'Ghost & Shadows' series, fifteen-year old Ash wants nothing more than to be a normal kid and avoid trouble. And then his birthday gift transforms him into a ghost and zaps him back in time to the beginning of the American Revolution. If he thought that was bad, it's about to get a whole lot worse. Armed only with an ancient history book and the quirky advice of an annoying mentor, Ash must rescue his ancestor from one danger after another, including an implacable enemy who controls the very shadows. What starts out as a brief experiment in time travel rapidly changes into a race for his very survival, and Ash is running out of time. Despite his efforts to stay out of trouble, Ash finds plenty of it as he must decide what his role will be in the shifting balance of forces. As he moves through one shadow- plagued adventure after another, Ash gradually discovers that true power lives in the most unexpected place: himself. Humorous and action-packed, Diary of a Part-Time Ghost will hold readers in its grip from the first sentence to the last."], "author": "Vered Ehsani", "num_pages": "268", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-22 00:00:00", "ISBN": "1456579231"},
{"url": "https://www.goodreads.com/book/show/94072.Geography_Club", "num_ratings": "13,610", "num_reviews": "742", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Fiction", "Glbt", "Queer", "Glbt", "Gay"], "title": "Geography Club", "description": ["I knew that any wrong action, however slight, could reveal my true identity...", "Russel is still going on dates with girls. Kevin would do anything to prevent his teammates on the baseball team from finding out. Min and Terese tell everyone they're really just good friends. But after a while, the truth's too hard to hide - at least from each other - so they form the \"Geograph", "I knew that any wrong action, however slight, could reveal my true identity...", "Russel is still going on dates with girls. Kevin would do anything to prevent his teammates on the baseball team from finding out. Min and Terese tell everyone they're really just good friends. But after a while, the truth's too hard to hide - at least from each other - so they form the \"Geography Club.\" Nobody else will come. Why would they want to? Their secret should be safe."], "author": "Brent Hartinger", "num_pages": "226", "awards": [], "places": [], "character_names": ["Russel Middlebrook"], "language": "English", "publish_date": "2004-02-17 00:00:00", "ISBN": "0060012234"},
{"url": "https://www.goodreads.com/book/show/23842764-drawn", "num_ratings": "74", "num_reviews": "38", "avg_ratings": 4.18, "genres": ["Young Adult", "Fantasy", "Romance", "Contemporary", "Adventure", "Young Adult", "Teen"], "title": "Drawn", "description": ["Caught between the sweltering fall landscape of Wilmington, NC beaches and southern illusions and expectations, all sixteen year-old Cameron Shade thinks about is art. That, and for Farrah Spangled to view him as more than just a friend. Cameron longs to win her heart through art.", "After several warm interactions with Farrah, including painting together at the beach, Cameron", "Caught between the sweltering fall landscape of Wilmington, NC beaches and southern illusions and expectations, all sixteen year-old Cameron Shade thinks about is art. That, and for Farrah Spangled to view him as more than just a friend. Cameron longs to win her heart through art.", "After several warm interactions with Farrah, including painting together at the beach, Cameron discovers just how complex Farrah’s life is with her boyfriend and her family. Following a tense run-in with Farrah’s father, she forbids Cameron to ever speak to her again, but Cameron’s convinced there’s more behind the request.", "To impress Farrah with a last-ditch effort, Cameron sketches her portrait. But the sketchbook he uses hides a dark secret. Farrah’s now in grave danger because the sketch he drew of her siphons her real-life’s soul into the sketchbook. Cameron now has twenty days to extract Farrah. To save her, he must draw himself into the book. ", "If he fails… they both die.", "\"Read this book. From the start, I was intrigued with the rare sighting of a young adult male action hero... then, with a quick flip of the switch... Ledbetter takes an innovative turn, with the right amount of creative risk, to amp the story with action-driven, suspenseful, mysterious and romantic elements.", "What I appreciated was that the twist and turns, once started, didn't stop until the end. Lives must be saved. Time is running out. The bad guy … well, you'll never guess who it is. But this story energetically moves between time, inspires many to step up, challenges many to dig deep and opens the eyes (and hearts) of those hiding behind their fears. So my last wish is that this fantasy adventure hasn't ended.\" ~Michelle Monkou, USATODAY HEA Blog", "\"Stunning! Each word was vividly woven together, creating a brilliant read... Art is a huge theme throughout, and the way the author clearly weaves fantasy and real-life scenarios is simply amazing. I couldn't stop reading this once I picked it up. Filled with tender moments, hard decisions Cameron has to make. Drawn was original every step of the way! ", "YA lovers, look no further for your next read!\"  BTS Book Review"], "author": "Chris  Ledbetter", "num_pages": "239", "awards": ["Evernight Publishing Readers Choice Award for Best YA Book (2015)"], "places": ["Wilmington, North Carolina"], "character_names": [], "language": "English", "publish_date": "2015-06-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7260188-mockingjay", "num_ratings": "1,992,478", "num_reviews": "98,271", "avg_ratings": 4.03, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Fiction", "Fantasy", "Science Fiction"], "title": "Mockingjay", "description": ["Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.", "It is by design that Katniss was rescued fr", "Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.", "It is by design that Katniss was rescued from the arena in the cruel and haunting Quarter Quell, and it is by design that she has long been part of the revolution without knowing it. District 13 has come out of the shadows and is plotting to overthrow the Capitol. Everyone, it seems, has had a hand in the carefully laid plans--except Katniss.", "The success of the rebellion hinges on Katniss's willingness to be a pawn, to accept responsibility for countless lives, and to change the course of the future of Panem. To do this, she must put aside her feelings of anger and distrust. She must become the rebels' Mockingjay--no matter what the personal cost."], "author": "Suzanne Collins", "num_pages": "392", "awards": ["Locus Award Nominee for Best Young Adult Book (2011)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2011)", "Publishers Weekly's Best Children's Books of the Year for Fiction (2010)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2010)", "DABWAHA Romance Tournament for Best Young Adult Romance (2011)", "Goodreads Choice Award for Favorite Book, Young Adult Fantasy, Favorite Heroine, and Favorite Hero (2010)"], "places": ["District 13, Panem", "District 12, Panem", "Capitol, Panem", "Panem"], "character_names": ["Katniss Everdeen", "Peeta Mellark", "Primrose Everdeen", "Gale Hawthorne", "Haymitch Abernathy", "Finnick Odair", "Johanna Mason", "President Coriolanus Snow", "President Coin"], "language": "English", "publish_date": "2010-08-24 00:00:00", "ISBN": "0439023513"},
{"url": "https://www.goodreads.com/book/show/1251032.Hero", "num_ratings": "16,062", "num_reviews": "1,478", "avg_ratings": 3.87, "genres": ["Young Adult", "Lgbt", "Fantasy", "Comics", "Superheroes", "Fiction"], "title": "Hero", "description": ["The last thing in the world Thom Creed wants is to add to his father's pain, so he keeps secrets. Like that he has special powers. And that he's been asked to join the League - the very organization of superheroes that spurned his dad. But the most painful secret of all is one Thom can barely face himself: he's gay.", "But becoming a member of the League opens up a new world t", "The last thing in the world Thom Creed wants is to add to his father's pain, so he keeps secrets. Like that he has special powers. And that he's been asked to join the League - the very organization of superheroes that spurned his dad. But the most painful secret of all is one Thom can barely face himself: he's gay.", "But becoming a member of the League opens up a new world to Thom. There, he connects with a misfit group of aspiring heroes, including Scarlett, who can control fire but not her anger; Typhoid Larry, who can make anyone sick with his touch; and Ruth, a wise old broad who can see the future. Like Thom, these heroes have things to hide; but they will have to learn to trust one another when they uncover a deadly conspiracy within the League.", "To survive, Thom will face challenges he never imagined. To find happiness, he'll have to come to terms with his father's past and discover the kind of hero he really wants to be."], "author": "Perry Moore", "num_pages": "428", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2008)", "Lambda Literary Award for LGBT Children’s/Young Adult (2007)", "The Inky Awards Nominee for Silver Inky (2008)"], "places": [], "character_names": ["Ruth Jansen", "Thom Creed", "Scarlett", "Typhoid Larry", "Goran"], "language": "English", "publish_date": "2007-08-28 00:00:00", "ISBN": "1423101952"},
{"url": "https://www.goodreads.com/book/show/7362158-girl-in-translation", "num_ratings": "40,363", "num_reviews": "5,036", "avg_ratings": 3.97, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Contemporary", "Cultural", "China", "Adult Fiction"], "title": "Girl in Translation", "description": ["When Kimberly Chang and her mother emigrate from Hong Kong to Brooklyn squalor, she quickly begins a secret double life: exceptional schoolgirl during the day, Chinatown sweatshop worker in the evenings. Disguising the more di", "When Kimberly Chang and her mother emigrate from Hong Kong to Brooklyn squalor, she quickly begins a secret double life: exceptional schoolgirl during the day, Chinatown sweatshop worker in the evenings. Disguising the more difficult truths of her life like the staggering degree of her poverty, the weight of her family’s future resting on her shoulders, or her secret love for a factory boy who shares none of her talent or ambition. Kimberly learns to constantly translate not just her language but herself back and forth between the worlds she straddles.", "Through Kimberly’s story, author Jean Kwok, who also emigrated from Hong Kong as a young girl, brings to the page the lives of countless immigrants who are caught between the pressure to succeed in America, their duty to their family, and their own personal desires, exposing a world that we rarely hear about. ", "Written in an indelible voice that dramatizes the tensions of an immigrant girl growing up between two cultures, surrounded by a language and world only half understood, ", " is an unforgettable and classic novel of an American immigrant-a moving tale of hardship and triumph, heartbreak and love, and all that gets lost in translation."], "author": "Jean Kwok", "num_pages": "290", "awards": ["ALA Alex Award (2011)", "Lincoln Award Nominee (2016)", "Suburban Mosaic Book of the Year (2011)", "Chinese Library Association Best Book (2010)", "John Gardner Book Award Nominee for Fiction (2011)", "Goodreads Choice Award Nominee for Fiction, Debut Author (2010)"], "places": ["Brooklyn, New York City, New York"], "character_names": ["Kimberly Chang", "Aunt Paula", "Uncle Bob", "Matt Wu", "Annette Avery", "Curt"], "language": "English", "publish_date": "2010-04-29 00:00:00", "ISBN": "1594487561"},
{"url": "https://www.goodreads.com/book/show/12893536-burning-emerald", "num_ratings": "570", "num_reviews": "80", "avg_ratings": 4.06, "genres": ["Young Adult", "Fantasy", "Paranormal", "Fantasy", "Romance", "Paranormal Romance", "Romance"], "title": "Burning Emerald", "description": ["Dating the most popular guy in school is every girl's fantasy. But to Samara Marshall, he's a dangerous force come to rekindle their tangled past. Only it's not her past. . .", "Samara faces a challenging senior year. Controlling her inner demon is a struggle, even with help from her Cambion boyfriend, Caleb. But her life takes a turn for the wo", "Dating the most popular guy in school is every girl's fantasy. But to Samara Marshall, he's a dangerous force come to rekindle their tangled past. Only it's not her past. . .", "Samara faces a challenging senior year. Controlling her inner demon is a struggle, even with help from her Cambion boyfriend, Caleb. But her life takes a turn for the worse when the hottest jock in school begins pursuing her--especially since Malik's anything but what he seems. They share a connection from a forgotten past--a secret that could destroy her and Caleb.", "As the attraction becomes harder to resist, Samara is now at the mercy of the demon within her. To break free, Sam must fight a battle where she is the enemy and the prize. . .and victory will come at a deadly price.", "\"Sexy and snarky! I dare you not to laugh while reading this fantastic debut.\" --Kody Keplinger, author of ", "and ", "\"Jaime Reed breathes fresh life into paranormal romance.\" --Lee Nichols, author of the Haunting Emma series"], "author": "Jaime Reed", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-05-29 00:00:00", "ISBN": "0758269250"},
{"url": "https://www.goodreads.com/book/show/7818683-five-flavors-of-dumb", "num_ratings": "9,474", "num_reviews": "1,074", "avg_ratings": 3.87, "genres": ["Young Adult", "Contemporary", "Music", "Realistic Fiction", "Romance", "Fiction"], "title": "Five Flavors of Dumb", "description": ["The Challenge: Piper has one month to get the rock band Dumb a paying gig.", " The Deal: If she does it, Piper will become the band's manager and get her share of the profits.", " The Catch: How can Piper possibly manage one egomaniacal pretty boy, one talentless piece of eye candy, one crush, one silent rocker, and one angry girl? And how can she do it when she's deaf?", " Piper can'", "The Challenge: Piper has one month to get the rock band Dumb a paying gig.", " The Deal: If she does it, Piper will become the band's manager and get her share of the profits.", " The Catch: How can Piper possibly manage one egomaniacal pretty boy, one talentless piece of eye candy, one crush, one silent rocker, and one angry girl? And how can she do it when she's deaf?", " Piper can't hear Dumb's music, but with growing self-confidence, a budding romance, and a new understanding of the decision her family made to buy a cochlear implant for her deaf baby sister, she discovers her own inner rock star and what it truly means to be a flavor of Dumb."], "author": "Antony John", "num_pages": "338", "awards": ["Schneider Family Book Award for Teen Book (2011)", "Lincoln Award Nominee (2014)", "Missouri Gateway Readers Award Nominee (2013)"], "places": ["Seattle, Washington", "Washington (the state)"], "character_names": [], "language": "English", "publish_date": "2010-11-11 00:00:00", "ISBN": "0803734336"},
{"url": "https://www.goodreads.com/book/show/714902.Noughts_Crosses", "num_ratings": "37,695", "num_reviews": "2,738", "avg_ratings": 4.23, "genres": ["Young Adult", "Romance", "Science Fiction", "Dystopia", "Fiction"], "title": "Noughts & Crosses", "description": ["Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.", "Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their", "Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.", "Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their world, Noughts and Crosses simply don’t mix. Against a background of prejudice and distrust, intensely highlighted by violent terrorist activity, a romance builds between Sephy and Callum -- a romance that is to lead both of them into terrible danger. Can they possibly find a way to be together?"], "author": "Malorie Blackman", "num_pages": "490", "awards": ["FCBG Children’s Book Award (2002)", "Sheffields Children's Book of the Year (2002)", "Wirral Children’s Paperback of the Year Award (2003)", "Lancashire Children’s Book of the Year Award (2002)", "North East Teenage Book Award Nominee (2002)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2009)"], "places": [], "character_names": ["Callum McGregor", "Persephone 'Sephy' Hadley"], "language": "English", "publish_date": "2006-08-08 00:00:00", "ISBN": "0552555703"},
{"url": "https://www.goodreads.com/book/show/71332.Push", "num_ratings": "43,905", "num_reviews": "5,785", "avg_ratings": 3.83, "genres": ["Fiction", "Young Adult", "Cultural", "African American", "Contemporary", "Sociology", "Abuse"], "title": "Push", "description": ["Precious Jones, an illiterate sixteen-year-old, has up until now been invisible: invisible to the father who rapes her and the mother who batters her and to the authorities who dismiss her as just one more of Harlem's casualties. But when Precious, pregnant with a second child by her father, meets a determined and highly radical teacher, we follow her on a journey of educa", "Precious Jones, an illiterate sixteen-year-old, has up until now been invisible: invisible to the father who rapes her and the mother who batters her and to the authorities who dismiss her as just one more of Harlem's casualties. But when Precious, pregnant with a second child by her father, meets a determined and highly radical teacher, we follow her on a journey of education and enlightenment as Precious learns not only how to write about her life, but how to make it her own for the first time."], "author": "Sapphire", "num_pages": "177", "awards": [], "places": ["Harlem, New York City, New York", "New York (the state)"], "character_names": ["Claireece Precious Jones", "Blue Rain"], "language": "English", "publish_date": "1997-04-29 00:00:00", "ISBN": "0679766758"},
{"url": "https://www.goodreads.com/book/show/14836136-fading-amber", "num_ratings": "404", "num_reviews": "55", "avg_ratings": 4.2, "genres": ["Young Adult", "Fantasy", "Paranormal", "Fantasy", "Romance", "Paranormal", "Demons", "Romance", "Paranormal Romance", "Fantasy", "Urban Fantasy", "Fiction", "Young Adult", "Young Adult Fantasy", "Family"], "title": "Fading Amber", "description": ["After falling for a Cambion and then turning into one herself, Samara never thought her senior year could get any more complicated. The gaps in her memory, the mysterious deaths and the constant danger that threaten her once quiet town have a common thread: Tobias, a demon with a lot of enemies. He's also Samara's other soul mate and he's suddenly disappeared. But Samara i", "After falling for a Cambion and then turning into one herself, Samara never thought her senior year could get any more complicated. The gaps in her memory, the mysterious deaths and the constant danger that threaten her once quiet town have a common thread: Tobias, a demon with a lot of enemies. He's also Samara's other soul mate and he's suddenly disappeared. But Samara isn't the only one who wants to find Tobias. His enemies are getting closer and their plans for retribution could mean deadly consequences for Samara and her true soul mate, Caleb."], "author": "Jaime Reed", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-24 00:00:00", "ISBN": "0758269269"},
{"url": "https://www.goodreads.com/book/show/16081758-otherbound", "num_ratings": "2,159", "num_reviews": "452", "avg_ratings": 3.74, "genres": ["Fantasy", "Young Adult", "Lgbt", "Science Fiction"], "title": "Otherbound", "description": ["Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Eve", "Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Every time he blinks, he's yanked from his Arizona town into Amara's mind, a world away, which makes even simple things like hobbies and homework impossible. He's spent years as a powerless observer of Amara's life. Amara has no idea . . . until he learns to control her, and they communicate for the first time. Amara is terrified. Then, she's furious.", "All Amara and Nolan want is to be free of each other. But Nolan's breakthrough has dangerous consequences. Now, they'll have to work together to survive--and discover the truth about their connection."], "author": "Corinne Duyvis", "num_pages": "387", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2014)", "Bisexual Book Award for Speculative Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-17 00:00:00", "ISBN": "1419709283"},
{"url": "https://www.goodreads.com/book/show/13414446-prodigy", "num_ratings": "175,528", "num_reviews": "13,725", "avg_ratings": 4.28, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Romance"], "title": "Prodigy", "description": ["Injured and on the run, it has been seven days since June and Day barely escaped Los Angeles and the Republic with their lives. Day is believed dead having lost his own brother to an execution squad who thought they were assassinating him. June is now the Republic's most wanted traitor. Desperate for help, they turn to the Patriots - a vigilante rebel group sworn to bring", "Injured and on the run, it has been seven days since June and Day barely escaped Los Angeles and the Republic with their lives. Day is believed dead having lost his own brother to an execution squad who thought they were assassinating him. June is now the Republic's most wanted traitor. Desperate for help, they turn to the Patriots - a vigilante rebel group sworn to bring down the Republic. But can they trust them or have they unwittingly become pawns in the most terrifying of political games?"], "author": "Marie Lu", "num_pages": "371", "awards": [], "places": ["Nevada"], "character_names": ["June Iparis", "Daniel Altan Wing"], "language": "English", "publish_date": "2013-01-29 00:00:00", "ISBN": "0399256768"},
{"url": "https://www.goodreads.com/book/show/9969571-ready-player-one", "num_ratings": "622,436", "num_reviews": "73,949", "avg_ratings": 4.29, "genres": ["Science Fiction", "Fiction", "Young Adult", "Science Fiction", "Dystopia", "Fantasy"], "title": "Ready Player One", "description": ["In the year 2045, reality is an ugly place. The only time teenage Wade Watts really feels alive is when he's jacked into the virtual utopia known as the OASIS. Wade's devoted his life to studying the puzzles hidden within this world's digital confines, puzzles that are based on their creator's obsession with the pop culture of decades past and that promise massive power an", "In the year 2045, reality is an ugly place. The only time teenage Wade Watts really feels alive is when he's jacked into the virtual utopia known as the OASIS. Wade's devoted his life to studying the puzzles hidden within this world's digital confines, puzzles that are based on their creator's obsession with the pop culture of decades past and that promise massive power and fortune to whoever can unlock them. When Wade stumbles upon the first clue, he finds himself beset by players willing to kill to take this ultimate prize. The race is on, and if Wade's going to survive, he'll have to win—and confront the real world he's always been so desperate to escape."], "author": "Ernest Cline", "num_pages": "374", "awards": ["Prometheus Award for Best Novel (2012)", "ALA Alex Award (2012)", "Lincoln Award Nominee (2014)", "Tähtivaeltaja Award Nominee (2013)", "Mary Shelley Award for Outstanding Fictional Work (2016)", "Green Mountain Book Award Nominee (2015)"], "places": ["Columbus, Ohio", "Oklahoma City, Oklahoma"], "character_names": ["Wade Owen Watts", "Ogden Morrow", "Parzival", "Aech", "James Donovan Halliday", "Art3mis", "Kira Morrow", "Daito", "Shoto", "Nolan Sorrento"], "language": "English", "publish_date": "2011-08-16 00:00:00", "ISBN": "030788743X"},
{"url": "https://www.goodreads.com/book/show/6609765-out-of-my-mind", "num_ratings": "80,877", "num_reviews": "11,451", "avg_ratings": 4.37, "genres": ["Realistic Fiction", "Young Adult", "Fiction", "Childrens", "Middle Grade", "Contemporary", "Childrens", "Disability", "Academic", "School", "Childrens", "Juvenile", "Family"], "title": "Out of My Mind", "description": ["Melody is not like most people. She cannot walk or talk, but she has a photographic memory; she can remember every detail of everything she has ever experienced. She is smarter than most of the adults who try to diagnose her and smarter than her classmates in her integrated classroom - the very same classmates who dismiss her as mentally challenged because she cannot tell", "Melody is not like most people. She cannot walk or talk, but she has a photographic memory; she can remember every detail of everything she has ever experienced. She is smarter than most of the adults who try to diagnose her and smarter than her classmates in her integrated classroom - the very same classmates who dismiss her as mentally challenged because she cannot tell them otherwise. But Melody refuses to be defined by cerebral palsy. And she's determined to let everyone know it - somehow.", " In this breakthrough story, reminiscent of ", ", from multiple Coretta Scott King Award-winner Sharon Draper, readers will come to know a brilliant mind and a brave spirit who will change forever how they look at anyone with a disability."], "author": "Sharon M. Draper", "num_pages": "295", "awards": ["Josette Frank Award (2011)", "Buckeye Children's Book Award for 6-8 (2011)", "Pennsylvania Young Readers' Choice Award for Grades 6-8 (2013)", "Dorothy Canfield Fisher Children's Book Award Nominee (2012)", "New Mexico Land of Enchantment Award for Young Adult (2013)", "California Young Readers Medal for Middle School/Junior High (2013)", "Washington State Sasquatch Award (2013)", "Bluestem Book Award (2013)", "Goodreads Choice Award Nominee for Middle Grade & Children's Books (2010)", "Intermediate Nutmeg Book Award (2014)", "Rebecca Caudill Young Readers' Book Award Nominee (2013)"], "places": ["Ohio"], "character_names": [], "language": "English", "publish_date": "2010-03-09 00:00:00", "ISBN": "141697170X"},
{"url": "https://www.goodreads.com/book/show/25487847-chameleon", "num_ratings": "176", "num_reviews": "37", "avg_ratings": 4.18, "genres": ["Science Fiction", "Young Adult", "Fantasy", "Science Fiction", "Dystopia"], "title": "Chameleon", "description": ["After Sai's newly awoken psionic power accidentally destroys her apartment complex, she’s thrown into an intensive training program. The only grades are pass or die. ", "Surviving means proving her continued existence isn't a mistake--a task her new mentor, Bastian, takes personally. Her abilities place her in the GNW Enforcer division, which partners her with Domino 12, who i", "After Sai's newly awoken psionic power accidentally destroys her apartment complex, she’s thrown into an intensive training program. The only grades are pass or die. ", "Surviving means proving her continued existence isn't a mistake--a task her new mentor, Bastian, takes personally. Her abilities place her in the GNW Enforcer division, which partners her with Domino 12, who is eerily human for an alien-parasite and psionic hybrid. When her assassination duties are revealed, Sai understands the real reason for her training.", "On a mission to dispatch a dangerous Exiled scientist, she uncovers truths she never thought possible. Sai is unsure who to trust as her next mission might be her last, and a double agent seems to be manipulating both sides."], "author": "K.T. Hanna", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/47281.Number_the_Stars", "num_ratings": "369,266", "num_reviews": "11,384", "avg_ratings": 4.12, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Classics", "Childrens", "Historical", "World War II", "Holocaust"], "title": "Number the Stars", "description": ["Ten-year-old Annemarie Johansen and her best friend Ellen Rosen often think of life before the war. It's now 1943 and their life in Copenhagen is filled with school, food shortages, and the Nazi soldiers marching through town. When the Jews of Denmark are \"relocated,\" Ellen moves in with the Johansens and pretends to be one of the family. Soon Annemarie is asked to go on a", "Ten-year-old Annemarie Johansen and her best friend Ellen Rosen often think of life before the war. It's now 1943 and their life in Copenhagen is filled with school, food shortages, and the Nazi soldiers marching through town. When the Jews of Denmark are \"relocated,\" Ellen moves in with the Johansens and pretends to be one of the family. Soon Annemarie is asked to go on a dangerous mission to save Ellen's life."], "author": "Lois Lowry", "num_pages": "137", "awards": ["Newbery Medal (1990)", "National Jewish Book Award for Children's Literature (1990)", "Sydney Taylor Book Award for Older Readers (1989)", "Jane Addams Children's Book Award Nominee (1990)", "Charlotte Award (1992)", "Dorothy Canfield Fisher Children's Book Award (1991)", "Charlie May Simon Children's Book Award (1992)", "Rebecca Caudill Young Readers' Book Award (1992)"], "places": ["Denmark"], "character_names": ["Annemarie Johansen", "Ellen Rosen"], "language": "English", "publish_date": "1998-02-09 00:00:00", "ISBN": "0440227534"},
{"url": "https://www.goodreads.com/book/show/6186357-the-maze-runner", "num_ratings": "852,667", "num_reviews": "51,958", "avg_ratings": 4.02, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction"], "title": "The Maze Runner", "description": ["When Thomas wakes up in the lift, the only thing he can remember is his name. He’s surrounded by strangers—boys whose memories are also gone.", "Outside the towering stone walls that surround the Glade is a limitless, ever-changing ma", "When Thomas wakes up in the lift, the only thing he can remember is his name. He’s surrounded by strangers—boys whose memories are also gone.", "Outside the towering stone walls that surround the Glade is a limitless, ever-changing maze. It’s the only way out—and no one’s ever made it through alive.", "Then a girl arrives. The first girl ever. And the message she delivers is terrifying.", "Remember. Survive. Run."], "author": "James Dashner", "num_pages": "384", "awards": ["Georgia Peach Book Award (2011)", "Utah Book Award Nominee for Young Adults (2009)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Paranormal/Fantasy Novel  (2009)", "Charlotte Award (2012)", "Pennsylvania Young Readers' Choice Award Nominee (2011)", "Evergreen Teen Book Award (2012)", "Milwaukee County Teen Book Award Nominee (2011)", "Lincoln Award (2012)", "Missouri Truman Readers Award (2012)"], "places": [], "character_names": ["Chuck", "Teresa Agnes", "Minho", "Alby", "Gally", "Thomas", "Ben", "Newt"], "language": "English", "publish_date": "2009-10-06 00:00:00", "ISBN": "0385737947"},
{"url": "https://www.goodreads.com/book/show/5577995-silver-phoenix", "num_ratings": "3,256", "num_reviews": "524", "avg_ratings": 3.57, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Romance"], "title": "Silver Phoenix", "description": ["No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that", "No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that her journey to the Palace of Fragrant Dreams isn't only a quest to find her beloved father but a venture with stakes larger than she could have imagined. ", " Bravery, intelligence, the will to fight and fight hard . . . she will need all of these things. Just as she will need the new and mysterious power growing within her. She will also need help. ", " It is Chen Yong who finds her partly submerged and barely breathing at the edge of a deep lake. There is something of unspeakable evil trying to drag her under. On a quest of his own, Chen Yong offers that help . . . and perhaps more."], "author": "Cindy Pon", "num_pages": "340", "awards": [], "places": [], "character_names": ["Ai Ling"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0061730211"},
{"url": "https://www.goodreads.com/book/show/23228.Boy_Meets_Boy", "num_ratings": "56,913", "num_reviews": "3,492", "avg_ratings": 3.85, "genres": ["Young Adult", "Lgbt", "Romance", "Contemporary", "Fiction"], "title": "Boy Meets Boy", "description": ["This is the story of Paul, a sophomore at a high school like no other: The cheerleaders ride Harleys, the homecoming queen used to be a guy named Daryl (she now prefers Infinite Darlene and is also the star quarterback), and the gay-straight alliance was formed to help the straight kids learn how to dance.", "When Paul meets Noah, he thinks he’s found the one his heart is made", "This is the story of Paul, a sophomore at a high school like no other: The cheerleaders ride Harleys, the homecoming queen used to be a guy named Daryl (she now prefers Infinite Darlene and is also the star quarterback), and the gay-straight alliance was formed to help the straight kids learn how to dance.", "When Paul meets Noah, he thinks he’s found the one his heart is made for. Until he blows it. The school bookie says the odds are 12-to-1 against him getting Noah back, but Paul’s not giving up without playing his love really loud. His best friend Joni might be drifting away, his other best friend Tony might be dealing with ultra-religious parents, and his ex-boyfriend Kyle might not be going away anytime soon, but sometimes everything needs to fall apart before it can really fit together right.", "This is a happy-meaningful romantic comedy about finding love, losing love, and doing what it takes to get love back in a crazy-wonderful world."], "author": "David Levithan", "num_pages": "185", "awards": ["Lambda Literary Award (2003)", "Lincoln Award Nominee (2008)"], "places": ["New Jersey"], "character_names": [], "language": "English", "publish_date": "2005-05-10 00:00:00", "ISBN": "0375832998"},
{"url": "https://www.goodreads.com/book/show/13376.The_House_of_the_Scorpion", "num_ratings": "69,395", "num_reviews": "5,808", "avg_ratings": 4.1, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fiction"], "title": "The House of the Scorpion", "description": ["With undertones of vampires, Frankenstein, dragons' hoards, and killing fields, Matt's story turns out to be an inspiring tale of friendship, survival, hope, and transcendence. A must-read for teenage fantasy fans.", "At his coming-of-age party, Matteo Alacrán asks El Patrón's bodyguard, \"How old am I?...I know I don't have a birthday like humans, but I was born.\" ", "\"You were ha", "With undertones of vampires, Frankenstein, dragons' hoards, and killing fields, Matt's story turns out to be an inspiring tale of friendship, survival, hope, and transcendence. A must-read for teenage fantasy fans.", "At his coming-of-age party, Matteo Alacrán asks El Patrón's bodyguard, \"How old am I?...I know I don't have a birthday like humans, but I was born.\" ", "\"You were harvested,\" Tam Lin reminds him. \"You were grown in that poor cow for nine months and then you were cut out of her.\" ", "To most people around him, Matt is not a boy, but a beast. A room full of chicken litter with roaches for friends and old chicken bones for toys is considered good enough for him. But for El Patrón, lord of a country called Opium—a strip of poppy fields lying between the U.S. and what was once called Mexico—Matt is a guarantee of eternal life. El Patrón loves Matt as he loves himself for Matt is himself. They share identical DNA."], "author": "Nancy Farmer", "num_pages": "380", "awards": ["Newbery Medal Nominee (2003)", "National Book Award for Young People's Literature (2002)", "Mythopoeic Fantasy Award Nominee for Children's Literature (2003)", "Buxtehuder Bulle (2003)", "Michael L. Printz Award Nominee (2003)", "South Carolina Book Award for Junior Book Award (2006)", "Grand Canyon Reader Award for Teen Book (2005)", "Dorothy Canfield Fisher Children's Book Award Nominee (2004)", "Pacific Northwest Library Association Young Reader's Choice Award for Senior (2005)", "Michigan Library Association Thumbs Up! Award Nominee (2003)", "Lincoln Award Nominee (2008)", "Missouri Gateway Readers Award Nominee (2005)", "Oklahoma Sequoyah Award for YA (2005)"], "places": [], "character_names": ["El Patron", "Tam Lin", "Maria Mendoza", "Chacho", "Fidelito", "Ton-Ton"], "language": "English", "publish_date": "2004-05-16 00:00:00", "ISBN": "0689852231"},
{"url": "https://www.goodreads.com/book/show/11595276-the-miseducation-of-cameron-post", "num_ratings": "22,718", "num_reviews": "2,642", "avg_ratings": 3.99, "genres": ["Young Adult", "Lgbt", "Fiction", "Contemporary", "Glbt", "Queer"], "title": "The Miseducation of Cameron Post", "description": ["When Cameron Post’s parents die suddenly in a car crash, her shocking first thought is relief. Relief they’ll never know that, hours earlier, she had been kissing a girl.", "But that relief doesn’t last, and Cam is soon forced to move in with her conservative aunt Ruth and her well-intentioned but hopelessly old-fashioned grandmother. She knows that from this point on, her lif", "When Cameron Post’s parents die suddenly in a car crash, her shocking first thought is relief. Relief they’ll never know that, hours earlier, she had been kissing a girl.", "But that relief doesn’t last, and Cam is soon forced to move in with her conservative aunt Ruth and her well-intentioned but hopelessly old-fashioned grandmother. She knows that from this point on, her life will forever be different. Survival in Miles City, Montana, means blending in and leaving well enough alone (as her grandmother might say), and Cam becomes an expert at both.", "Then Coley Taylor moves to town. Beautiful, pickup-driving Coley is a perfect cowgirl with the perfect boyfriend to match. She and Cam forge an unexpected and intense friendship — one that seems to leave room for something more to emerge. But just as that starts to seem like a real possibility, ultrareligious Aunt Ruth takes drastic action to ‘fix’ her niece, bringing Cam face-to-face with the cost of denying her true self — even if she’s not exactly sure who that is.", " is a stunning and unforgettable literary debut about discovering who you are and finding the courage to live life according to your own rules."], "author": "Emily M. Danforth", "num_pages": "470", "awards": ["William C. Morris YA Debut Award Nominee (2013)", "Montana Book Award (2012)", "Goodreads Choice Award Nominee for Best Young Adult Fiction (2012)"], "places": ["Miles City, Montana"], "character_names": ["Cameron Post", "Coley Taylor"], "language": "English", "publish_date": "2012-02-07 00:00:00", "ISBN": "0062020560"},
{"url": "https://www.goodreads.com/book/show/316445.Luna", "num_ratings": "20,158", "num_reviews": "1,434", "avg_ratings": 3.84, "genres": ["Young Adult", "Lgbt", "Fiction", "Glbt", "Queer"], "title": "Luna", "description": [" Regan's brother Liam can't stand the person he is during the day. Like the moon from whom Liam has chosen his female name, his true self, Luna, only reveals herself at night. In the secrecy of his basement bedroom Liam transforms himself into the beautiful girl he longs to be, with", " Regan's brother Liam can't stand the person he is during the day. Like the moon from whom Liam has chosen his female name, his true self, Luna, only reveals herself at night. In the secrecy of his basement bedroom Liam transforms himself into the beautiful girl he longs to be, with help from his sister's clothes and makeup. Now, everything is about to change: Luna is preparing to emerge from her cocoon. But are Liam's family and friends ready to welcome Luna into their lives?", "Compelling and provocative, this is an unforgettable novel about a transgender teen's struggle for self-identity and acceptance."], "author": "Julie Anne Peters", "num_pages": "248", "awards": ["Colorado Book Award for Young Adult (2005)", "National Book Award Finalist for Young People's Literature (2004)", "Missouri Gateway Readers Award Nominee (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "0316011274"},
{"url": "https://www.goodreads.com/book/show/18079719-grasshopper-jungle", "num_ratings": "15,092", "num_reviews": "3,084", "avg_ratings": 3.65, "genres": ["Young Adult", "Lgbt", "Science Fiction"], "title": "Grasshopper Jungle", "description": ["Sixteen-year-old Austin Szerba interweaves the story of his Polish legacy with the story of how he and his best friend , Robby, brought about the end of humanity and the rise of an army of unstoppable, six-foot tall praying mantises in small-town Iowa.", "To make matters worse, Austin's hormones are totally oblivious; they don't care that the world is in utter chaos: Austin is", "Sixteen-year-old Austin Szerba interweaves the story of his Polish legacy with the story of how he and his best friend , Robby, brought about the end of humanity and the rise of an army of unstoppable, six-foot tall praying mantises in small-town Iowa.", "To make matters worse, Austin's hormones are totally oblivious; they don't care that the world is in utter chaos: Austin is in love with his girlfriend, Shann, but remains confused about his sexual orientation. He's stewing in a self-professed constant state of maximum horniness, directed at both Robby and Shann. Ultimately, it's up to Austin to save the world and propagate the species in this sci-fright journey of survival, sex, and the complex realities of the human condition."], "author": "Andrew  Smith", "num_pages": "388", "awards": ["Michael L. Printz Award Nominee (2015)", "Milwaukee County Teen Book Award Nominee (2015)", "Boston Globe-Horn Book Award for Fiction (2014)", "The Inky Awards Nominee for Silver Inky (2015)", "The Kitschies for Red Tentacle (Novel) (2014)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera independiente (2014)"], "places": ["Ealing, Iowa"], "character_names": [], "language": "English", "publish_date": "2014-02-11 00:00:00", "ISBN": "0525426035"},
{"url": "https://www.goodreads.com/book/show/12476820-partials", "num_ratings": "48,146", "num_reviews": "4,442", "avg_ratings": 3.94, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction"], "title": "Partials", "description": ["Humanity is all but extinguished after a war with Partials—engineered organic beings identical to humans—has decimated the population. Reduced to only tens of thousands by a weaponized virus to which only a fraction of humanity is immune, the survivors in North America have huddled together on Long Island. But sixteen-year-old Kira is determined to find a solution. As she", "Humanity is all but extinguished after a war with Partials—engineered organic beings identical to humans—has decimated the population. Reduced to only tens of thousands by a weaponized virus to which only a fraction of humanity is immune, the survivors in North America have huddled together on Long Island. But sixteen-year-old Kira is determined to find a solution. As she tries desperately to save what is left of her race, she discovers that that the survival of both humans and Partials rests in her attempts to answer questions about the war's origin that she never knew to ask.", "Playing on our curiosity of and fascination with the complete collapse of civilization, ", " is, at its heart, a story of survival, one that explores the individual narratives and complex relationships of those left behind, both humans and Partials alike—and of the way in which the concept of what is right and wrong in this world is greatly dependent on one's own point of view.", "Supports the Common Core State Standards."], "author": "Dan Wells", "num_pages": "468", "awards": [], "places": ["Long Island, New York"], "character_names": ["Marcus", "Kira Walker", "Haru Sato", "Madison Sato", "Jayden Van Rijn", "Senator Hobbs", "Sam Pettigrew", "Xochi Kessler", "Owen Tovar"], "language": "English", "publish_date": "2012-02-28 00:00:00", "ISBN": "0062071041"},
{"url": "https://www.goodreads.com/book/show/17925536-no-surrender-soldier", "num_ratings": "129", "num_reviews": "45", "avg_ratings": 3.94, "genres": ["Young Adult", "Fiction", "Historical", "Historical", "Historical Fiction", "War"], "title": "No Surrender Soldier", "description": ["A young man, an old soldier , and a terrible injustice. Should the punishment be death?", "Growing up on Guam in 1972, fifteen-year-old Kiko is beset by worries: He’s never kissed a girl, and he thinks it’s possible he never will. The popular guys get all the attention, but the worst part is that Kiko has serious problems at home. His older brother is missing in Vietnam; his g", "A young man, an old soldier , and a terrible injustice. Should the punishment be death?", "Growing up on Guam in 1972, fifteen-year-old Kiko is beset by worries: He’s never kissed a girl, and he thinks it’s possible he never will. The popular guys get all the attention, but the worst part is that Kiko has serious problems at home. His older brother is missing in Vietnam; his grandfather is losing it to dementia; he just learned that his mother was raped in World War II by a Japanese soldier. It all comes together when he discovers an old man, a Japanese soldier, hiding in the jungle behind his house. It’s not the same man who raped his mother, but, in his rage, Kiko cares only about protecting his family and avenging his mom – no matter what it takes. And so, a shy, peaceable boy begins to plan a murder. But how far will Kiko go to prove to himself that he’s a man ? Based on a historical incident, No Surrender Soldier is the story of a boy grappling with ancient questions of courage and manhood before he can move on."], "author": "Christine Kohler", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-01 00:00:00", "ISBN": "1440565619"},
{"url": "https://www.goodreads.com/book/show/10025305-clockwork-prince", "num_ratings": "374,072", "num_reviews": "19,346", "avg_ratings": 4.45, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Paranormal", "Science Fiction", "Steampunk"], "title": "Clockwork Prince", "description": ["In the magical underworld of Victorian London, Tessa Gray has at last found safety with the Shadowhunters. But that safety proves fleeting when rogue forces in the Clave plot to see her protector, Charlotte, replaced as head of the Institute. If Charlotte loses her position, Tessa will be out on the street—and easy prey for the mysterious Magister, who wants to use Tessa’s", "In the magical underworld of Victorian London, Tessa Gray has at last found safety with the Shadowhunters. But that safety proves fleeting when rogue forces in the Clave plot to see her protector, Charlotte, replaced as head of the Institute. If Charlotte loses her position, Tessa will be out on the street—and easy prey for the mysterious Magister, who wants to use Tessa’s powers for his own dark ends.", "With the help of the handsome, self-destructive Will and the fiercely devoted Jem, Tessa discovers that the Magister’s war on the Shadowhunters is deeply personal. He blames them for a long-ago tragedy that shattered his life. To unravel the secrets of the past, the trio journeys from mist-shrouded Yorkshire to a manor house that holds untold horrors, from the slums of London to an enchanted ballroom where Tessa discovers that the truth of her parentage is more sinister than she had imagined. When they encounter a clockwork demon bearing a warning for Will, they realize that the Magister himself knows their every move—and that one of their own has betrayed them.", "Tessa finds her heart drawn more and more to Jem, but her longing for Will, despite his dark moods, continues to unsettle her. But something is changing in Will—the wall he has built around himself is crumbling. Could finding the Magister free Will from his secrets and give Tessa the answers about who she is and what she was born to do?", "As their dangerous search for the Magister and the truth leads the friends into peril, Tessa learns that when love and lies are mixed, they can corrupt even the purest heart."], "author": "Cassandra Clare", "num_pages": "502", "awards": ["Teen Buckeye Book Award Nominee (2012)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2012)"], "places": ["London, England"], "character_names": ["Theresa Gray", "Magnus Bane", "William Herondale", "James Carstairs", "Jessamine Lovelace", "Henry Branwell", "Charlotte Branwell", "Nathaniel Gray", "Gideon Lightwood", "Gabriel Lightwood", "Sophie Collins"], "language": "English", "publish_date": "2011-12-06 00:00:00", "ISBN": "1416975888"},
{"url": "https://www.goodreads.com/book/show/53496.Walk_Two_Moons", "num_ratings": "138,270", "num_reviews": "6,051", "avg_ratings": 3.96, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Childrens", "Childrens", "Middle Grade"], "title": "Walk Two Moons", "description": ["\"How about a story? Spin us a yarn.\"", "Instantly, Phoebe Winterbottom came to mind. \"I could tell you an extensively strange story,\" I warned.", "\"Oh, good!\" Gram said. \"Delicious!\"", "And that is how I happened to tell them about Phoebe, her disappearing mother, and the lunatic.", "As Sal entertains her grandparents with Phoebe's outrageous story, her own story begins to unfold — the st", "\"How about a story? Spin us a yarn.\"", "Instantly, Phoebe Winterbottom came to mind. \"I could tell you an extensively strange story,\" I warned.", "\"Oh, good!\" Gram said. \"Delicious!\"", "And that is how I happened to tell them about Phoebe, her disappearing mother, and the lunatic.", "As Sal entertains her grandparents with Phoebe's outrageous story, her own story begins to unfold — the story of a thirteen-year-old girl whose only wish is to be reunited with her missing mother.", "In her own award-winning style, Sharon Creech intricately weaves together two tales, one funny, one bittersweet, to create a heartwarming, compelling, and utterly moving story of love, loss, and the complexity of human emotion."], "author": "Sharon Creech", "num_pages": "280", "awards": ["Newbery Medal (1995)", "Dorothy Canfield Fisher Children's Book Award Nominee (1996)", "W.H. Smith's Mind-Boggling Books Award (1996)", "Oklahoma Sequoyah Award for YA (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-05-24 00:00:00", "ISBN": "0060739495"},
{"url": "https://www.goodreads.com/book/show/10215349-the-immortal-rules", "num_ratings": "59,715", "num_reviews": "5,903", "avg_ratings": 4.1, "genres": ["Paranormal", "Vampires", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Science Fiction", "Dystopia"], "title": "The Immortal Rules", "description": ["Allison Sekemoto survives in the Fringe, the outermost circle of a walled-in city. By day, she and her crew scavenge for food. By night, any one of them could be eaten. Some days, all that drives Allie is her hatred of", "—the vampires who keep humans as blood cattle. Until the night Allie herself dies and becomes", "Allison Sekemoto survives in the Fringe, the outermost circle of a walled-in city. By day, she and her crew scavenge for food. By night, any one of them could be eaten. Some days, all that drives Allie is her hatred of", "—the vampires who keep humans as blood cattle. Until the night Allie herself dies and becomes one of the monsters.", "Forced to flee her city, Allie must pass for human as she joins a ragged group of pilgrims seeking a legend—a place that might have a cure for the disease that killed off most of civilization and created the rabids, the bloodthirsty creatures who threaten human and vampire alike. And soon Allie will have to decide what and who is worth dying for\u0085 again.", "Enter Julie Kagawa's dark and twisted world as an unforgettable journey begins."], "author": "Julie Kagawa", "num_pages": "485", "awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)"], "places": [], "character_names": ["Allison Sekemoto", "Stick", "Kanin", "Jackal", "Zeke Crosse"], "language": "English", "publish_date": "2012-04-24 00:00:00", "ISBN": "0373210515"},
{"url": "https://www.goodreads.com/book/show/20579291-lies-we-tell-ourselves", "num_ratings": "9,232", "num_reviews": "1,498", "avg_ratings": 4.11, "genres": ["Historical", "Historical Fiction", "Young Adult", "Lgbt", "Historical", "Fiction"], "title": "Lies We Tell Ourselves", "description": ["In 1959 Virginia, the lives of two girls on opposite sides of the battle for civil rights will be changed forever.", "Sarah Dunbar is one of the first black students to attend the previously all-white Jefferson High School. An honors student at her old school, she is put into remedial classes, spit on and tormented daily.", "Linda Hairston is the daughter of one of the town's most", "In 1959 Virginia, the lives of two girls on opposite sides of the battle for civil rights will be changed forever.", "Sarah Dunbar is one of the first black students to attend the previously all-white Jefferson High School. An honors student at her old school, she is put into remedial classes, spit on and tormented daily.", "Linda Hairston is the daughter of one of the town's most vocal opponents of school integration. She has been taught all her life that the races should be kept separate but equal.", "Forced to work together on a school project, Sarah and Linda must confront harsh truths about race, power and how they really feel about one another.", "Boldly realistic and emotionally compelling, Lies We Tell Ourselves is a brave and stunning novel about finding truth amid the lies, and finding your voice even when others are determined to silence it."], "author": "Robin Talley", "num_pages": "368", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Lambda Literary Award Nominee (2015)", "Goodreads Choice Award Nominee for Young Adult Fiction (2014)", "Carnegie Medal Nominee (2016)"], "places": ["Virginia"], "character_names": [], "language": "English", "publish_date": "2014-09-30 00:00:00", "ISBN": "0373211333"},
{"url": "https://www.goodreads.com/book/show/201114.Sold", "num_ratings": "42,339", "num_reviews": "5,289", "avg_ratings": 4.2, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Poetry", "Sociology", "Abuse"], "title": "Sold", "description": ["Although Lakshmi's family is desperately poor her life still contains simple pleasures; but, when the harsh Himalayan monsoons wash away all the family’s crops, Lakshmi’s stepfather sends her away to take a job to support her family. When she arrives at “Happiness House”, full of hope, she learns the unthinkable truth: she has been sold into prostitution. An exceptional no", "Although Lakshmi's family is desperately poor her life still contains simple pleasures; but, when the harsh Himalayan monsoons wash away all the family’s crops, Lakshmi’s stepfather sends her away to take a job to support her family. When she arrives at “Happiness House”, full of hope, she learns the unthinkable truth: she has been sold into prostitution. An exceptional novel suitable for teens and adults.", "Lakshmi is a thirteen-year-old girl who lives with her family in a small hut in the mountains of Nepal. Her family is desperately poor, but her life is full of simple pleasures, like raising her black-and-white speckled goat, and having her mother brush her hair by the light of an oil lamp. But when the harsh Himalayan monsoons wash away all that remains of the family’s crops, Lakshmi’s stepfather says she must leave home and take a job to support her family. ", "He introduces her to a glamorous stranger who tells her she will find her a job as a maid working for a wealthy woman in the city. Glad to be able to help, Lakshmi undertakes the long journey to India and arrives at “Happiness House” full of hope. But she soon learns the unthinkable truth: she has been sold into prostitution. ", "An old woman named Mumtaz rules the brothel with cruelty and cunning. She tells Lakshmi that she is trapped there until she can pay off her family’s debt – then cheats Lakshmi of her meager earnings so that she can never leave. ", "Lakshmi’s life becomes a nightmare from which she cannot escape. Still, she lives by her mother’s words – “Simply to endure is to triumph” – and gradually, she forms friendships with the other girls that enable her to survive in this terrifying new world. Then the day comes when she must make a decision – will she risk everything for a chance to reclaim her life? ", "Written in spare and evocative vignettes, this powerful novel renders a world that is as unimaginable as it is real, and a girl who not only survives but triumphs. ", "To research Sold, Patricia McCormick traveled to India and Nepal where she interviewed the women of Calcutta’s red-light district and girls who have been rescued from the sex trade. She is the author of the acclaimed novels Cut and My Brother’s Keeper."], "author": "Patricia McCormick", "num_pages": "268", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2009)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2009)", "California Young Readers Medal for Young Adult (2009)", "Lincoln Award Nominee (2009)", "James Cook Book Award Nominee (2007)", "National Book Award Finalist for Young People's Literature (2006)", "Missouri Gateway Readers Award Nominee (2009)"], "places": ["Nepal"], "character_names": [], "language": "English", "publish_date": "2006-09-15 00:00:00", "ISBN": "0786851716"},
{"url": "https://www.goodreads.com/book/show/12363795-living-violet", "num_ratings": "1,274", "num_reviews": "223", "avg_ratings": 3.93, "genres": ["Young Adult", "Fantasy", "Paranormal", "Romance", "Fantasy", "Romance", "Paranormal Romance", "Paranormal", "Demons"], "title": "Living Violet", "description": ["He's persuasive, charming, and way too mysterious. And for Samara Marshall, her co-worker is everything she wants most--and everything she most fears. . .", "Samara Marshall is determined to make the summer before her senior year the best ever. Her plan: enjoy downtime with friends and work to save up cash for her dream car. Summer romance is not on her to-do list, but uncover", "He's persuasive, charming, and way too mysterious. And for Samara Marshall, her co-worker is everything she wants most--and everything she most fears. . .", "Samara Marshall is determined to make the summer before her senior year the best ever. Her plan: enjoy downtime with friends and work to save up cash for her dream car. Summer romance is not on her to-do list, but uncovering the truth about her flirtatious co-worker, Caleb Baker, is. From the peculiar glow to his eyes to the unfortunate events that befall the girls who pine after him, Samara is the only one to sense danger behind his smile.", "But Caleb's secrets are drawing Samara into a world where the laws of attraction are a means of survival. And as a sinister power closes in on those she loves, Samara must take a risk that will change her life forever. . .or consume it."], "author": "Jaime Reed", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-27 00:00:00", "ISBN": "0758269242"},
{"url": "https://www.goodreads.com/book/show/20517739-far-from-you", "num_ratings": "9,773", "num_reviews": "1,204", "avg_ratings": 4.03, "genres": ["Young Adult", "Mystery", "Lgbt", "Contemporary"], "title": "Far From You", "description": ["That's how long recovering addict Sophie's been drug-free. Four months ago her best friend, Mina, died in what everyone believes was a drug deal gone wrong - a deal they think Sophie set up. Only Sophie knows the truth. She and Mina shared a secret, but there was no drug deal. Mina was deliberately murdered.", "Forced into rehab for an addictio", "That's how long recovering addict Sophie's been drug-free. Four months ago her best friend, Mina, died in what everyone believes was a drug deal gone wrong - a deal they think Sophie set up. Only Sophie knows the truth. She and Mina shared a secret, but there was no drug deal. Mina was deliberately murdered.", "Forced into rehab for an addiction she'd already beaten, Sophie's finally out and on the trail of the killer—but can she track them down before they come for her?"], "author": "Tess Sharpe", "num_pages": "341", "awards": [], "places": ["Northern California"], "character_names": ["Sophie Winters", "Mina Bishop", "Trev Bishop"], "language": "English", "publish_date": "2014-03-27 00:00:00", "ISBN": "1780621655"},
{"url": "https://www.goodreads.com/book/show/20820994-i-ll-give-you-the-sun", "num_ratings": "196,152", "num_reviews": "19,524", "avg_ratings": 4.13, "genres": ["Young Adult", "Contemporary", "Lgbt", "Romance", "Fiction"], "title": "I'll Give You the Sun", "description": ["At first, Jude and her twin brother Noah, are inseparable. Noah draws constantly and is falling in love with the charismatic boy next door, while daredevil Jude wears red-red lipstick, cliff-dives, and does all the talking for both of them.", "At first, Jude and her twin brother Noah, are inseparable. Noah draws constantly and is falling in love with the charismatic boy next door, while daredevil Jude wears red-red lipstick, cliff-dives, and does all the talking for both of them. ", "Years later, they are barely speaking. Something has happened to change the twins in different yet equally devastating ways . . . but then Jude meets an intriguing, irresistible boy and a mysterious new mentor. ", "The early years are Noah’s to tell; the later years are Jude’s. But they each have only half the story, and if they can only find their way back to one another, they’ll have a chance to remake their world. ", "This radiant, award-winning novel from the acclaimed author of The Sky Is Everywhere will leave you breathless and teary and laughing—often all at once. "], "author": "Jandy Nelson", "num_pages": "371", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2015)", "Georgia Peach Book Award Nominee for Honor book (2015)", "Josette Frank Award for Younger Readers (2015)", "Michael L. Printz Award (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Milwaukee County Teen Book Award Nominee (2016)", "The Inky Awards for Silver Inky (2016)", "Lincoln Award Nominee (2016)", "Goodreads Choice Award Nominee for Young Adult Fiction (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2015)"], "places": ["California"], "character_names": ["Jude Sweetwine", "Noah Sweetwine", "Dianna Sweetwine", "Benjamin Sweetwine", "Grandma Sweetwine", "Guillermo Garcia", "Brian Connelly", "Oscar Ralph"], "language": "English", "publish_date": "2014-09-16 00:00:00", "ISBN": "0803734964"},
{"url": "https://www.goodreads.com/book/show/32075671-the-hate-u-give", "num_ratings": "170,749", "num_reviews": "28,706", "avg_ratings": 4.56, "genres": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "title": "The Hate U Give", "description": ["Sixteen-year-old Starr Carter moves between two worlds: the poor neighborhood where she lives and the fancy suburban prep school she attends. The uneasy balance between these worlds is shattered when Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Khalil was unarmed.", "Soon afterward, his death is a national headline. S", "Sixteen-year-old Starr Carter moves between two worlds: the poor neighborhood where she lives and the fancy suburban prep school she attends. The uneasy balance between these worlds is shattered when Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Khalil was unarmed.", "Soon afterward, his death is a national headline. Some are calling him a thug, maybe even a drug dealer and a gangbanger. Protesters are taking to the streets in Khalil's name. Some cops and the local drug lord try to intimidate Starr and her family. What everyone wants to know is: what ", " went down that night? And the only person alive who can answer that is Starr.", "But what Starr does or does not say could upend her community. It could also endanger her life."], "author": "Angie Thomas", "num_pages": "453", "awards": ["National Book Award Nominee for Young People's Literature (2017)", "Odyssey Award (2018)", "Los Angeles Times Book Prize Nominee for Young Adult Literature (2017)", "Edgar Award Nominee for Best Young Adult (2018)", "Coretta Scott King Award Nominee for Author Honor (2018)", "Boston Globe-Horn Book Award for Fiction (2017)", "Lincoln Award Nominee (2019)", "Kirkus Prize Nominee for Young Readers' Literature (2017)", "Goodreads Choice Award for Young Adult Fiction & for Debut Goodreads Author (2017)", "Carnegie Medal Nominee (2018)", "NAACP Image Award Nominee for Youth/Teens (2018)", "Michael L. Printz Honor Award (2018)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2017-02-28 00:00:00", "ISBN": "0062498533"},
{"url": "https://www.goodreads.com/book/show/17237214-two-boys-kissing", "num_ratings": "32,874", "num_reviews": "3,645", "avg_ratings": 4.09, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance", "Fiction"], "title": "Two Boys Kissing", "description": ["  bestselling author David Levithan tells the based-on-true-events story of Harry and Craig, two 17-year-olds who are about to take part in a 32-hour marathon of kissing to set a new Guinness World Record—all of which is narrated by a Greek Chorus of the generation of gay men lost to AIDS. ", "While the two increasingly dehydrated and sleep-deprived boys are lock", "  bestselling author David Levithan tells the based-on-true-events story of Harry and Craig, two 17-year-olds who are about to take part in a 32-hour marathon of kissing to set a new Guinness World Record—all of which is narrated by a Greek Chorus of the generation of gay men lost to AIDS. ", "While the two increasingly dehydrated and sleep-deprived boys are locking lips, they become a focal point in the lives of other teen boys dealing with languishing long-term relationships, coming out, navigating gender identity, and falling deeper into the digital rabbit hole of gay hookup sites—all while the kissing former couple tries to figure out their own feelings for each other."], "author": "David Levithan", "num_pages": "196", "awards": ["National Book Award Nominee for Young People’s Literature (2013)", "Stonewall Book Award Nominee for Children's & Young Adult Literature (2014)", "Milwaukee County Teen Book Award Nominee (2014)", "Lambda Literary Award Nominee for LGBT Children's/Young Adult (2014)", "The Inky Awards Nominee for Silver Inky (2014)", "NAIBA Book of the Year for Young Adult (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-27 00:00:00", "ISBN": "0307931900"},
{"url": "https://www.goodreads.com/book/show/28187.The_Lightning_Thief", "num_ratings": "1,594,603", "num_reviews": "50,192", "avg_ratings": 4.24, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Fiction"], "title": "The Lightning Thief", "description": ["Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth ab", "Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth about where he came from, and that he go to the one place he'll be safe. She sends Percy to Camp Half Blood, a summer camp for demigods (on Long Island), where he learns that the father he never knew is Poseidon, God of the Sea. Soon a mystery unfolds and together with his friends—one a satyr and the other the demigod daughter of Athena - Percy sets out on a quest across the United States to reach the gates of the Underworld (located in a recording studio in Hollywood) and prevent a catastrophic war between the gods."], "author": "Rick Riordan", "num_pages": "375", "awards": ["Young Readers' Choice Award (2008)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2011)", "South Carolina Book Award for Junior Book Award (2008)", "Grand Canyon Reader Award for Tween Book (2008)", "Nene Award (2008)", "Massachusetts Children's Book Award (2008)", "Pennsylvania Young Readers' Choice Award for Grades 6-8 (2008)", "Sunshine State Young Readers Award for Grades 6-8 (2007)", "Pacific Northwest Library Association Young Reader's Choice Award for Intermediate (2008)", "Iowa Teen Award (2009)", "Lincoln Award Nominee (2009)", "Oklahoma Sequoyah Award for YA (2008)", "Rebecca Caudill Young Readers' Book Award (2009)"], "places": ["New York City, New York", "Montauk, New York", "New Jersey", "St. Louis, Missouri", "Las Vegas, Nevada", "Long Island, New York"], "character_names": ["Annabeth Chase", "Grover Underwood", "Luke Castellan", "Zeus (God)", "Dionysus (mythology)", "Ares (god)", "Hades", "Poseidon (God)", "Chiron", "Percy Jackson"], "language": "English", "publish_date": "2006-03-01 00:00:00", "ISBN": "0786838655"},
{"url": "https://www.goodreads.com/book/show/18692431-everything-everything", "num_ratings": "238,228", "num_reviews": "31,220", "avg_ratings": 4.09, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "Everything, Everything", "description": ["My disease is as rare as it is famous. Basically, I’m allergic to the world. I don’t leave my house, have not left my house in seventeen years. The only people I ever see are my mom and my nurse, Carla.", "But then one day, a moving truck arrives next door. I look out my window, and I see him. He’s tall, lean and wearing all black—black T-shirt, black jeans, black sneakers, an", "My disease is as rare as it is famous. Basically, I’m allergic to the world. I don’t leave my house, have not left my house in seventeen years. The only people I ever see are my mom and my nurse, Carla.", "But then one day, a moving truck arrives next door. I look out my window, and I see him. He’s tall, lean and wearing all black—black T-shirt, black jeans, black sneakers, and a black knit cap that covers his hair completely. He catches me looking and stares at me. I stare right back. His name is Olly.", "Maybe we can’t predict the future, but we can predict some things. For example, I am certainly going to fall in love with Olly. It’s almost certainly going to be a disaster."], "author": "Nicola Yoon", "num_pages": "307", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Soaring Eagle Book Award (2016)", "Milwaukee County Teen Book Award Nominee (2017)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2016)", "Goodreads Choice Award Nominee for Debut Goodreads Author, and for Young Adult Fiction (2015)", "Missouri Gateway Readers Award Nominee (2017)"], "places": ["Los Angeles, California", "Maui, Hawaii"], "character_names": ["Madeline \"Maddy\" Furukawa Whittier", "Oliver \"Olly\" Bright", "Pauline Furukawa Whittier", "Carla Flores"], "language": "English", "publish_date": "2015-09-01 00:00:00", "ISBN": "0553496646"},
{"url": "https://www.goodreads.com/book/show/25437891-the-v-girl", "num_ratings": "5,708", "num_reviews": "676", "avg_ratings": 4.01, "genres": ["Romance", "Young Adult", "Young Adult", "Coming Of Age", "Science Fiction", "Dystopia", "Fiction", "Science Fiction"], "title": "The V Girl", "description": ["ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substi", "ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substitute for love.", "Lila’s coping mechanism to deal with her mother’s loss is her secret. A secret that will bring her closer to Aleksey Fürst, a foreign, broody man who she distrusts because of his links to the troops and his rough, yet irresistible appearance. He offers Lila an alternative to her plans, a possibility that terrifies her…and tempts her in spite of herself.", "With threats looming at every turn and no way to escape, Lila fears that falling in love will only lead to more heartache. The consequences of laying down her arms for Aleksey and welcoming hope might destroy more than her heart. They might force her to face the worst of her nightmares becoming a reality. Is love possible in a world that has forgotten what the human touch is?", "NOTES FROM THE AUTHOR", "* This is a book full of romance and anti-rape messages. I didn't write this book to romanticize violence against women but to tell the story of a girl who has to come of age under the most terrible circumstances. ", "* This full-length novel is a stand alone. No cliffhanger", "* Alpha male hero. No cheating. No slut-shaming.", "* Includes a discussion guide for bookclubs", "* Possible triggers for abuse survivors."], "author": "Mya Robarts", "num_pages": "341", "awards": [], "places": ["Starville"], "character_names": ["Lila Velez", "Aleksey Fürst", "Azalea Velez", "Olmo Velez", "Tristan Froh", "Ethan Velez"], "language": "English", "publish_date": "2015-06-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/29844228-thirteen-reasons-why", "num_ratings": "645,104", "num_reviews": "48,147", "avg_ratings": 3.99, "genres": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "title": "Thirteen Reasons Why", "description": ["Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker–his classmate and crush–who committed suicide two weeks earlier. Hannah’s voice tells him that", "Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker–his classmate and crush–who committed suicide two weeks earlier. Hannah’s voice tells him that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he’ll find out why. ", "Clay spends the night crisscrossing his town with Hannah as his guide. He becomes a firsthand witness to Hannah’s pain, and as he follows Hannah’s recorded words throughout his town, what he discovers changes his life forever."], "author": "Jay Asher", "num_pages": "352", "awards": ["Georgia Peach Book Award Nominee for Honor book (2009)", "California Book Award for Young Adult (Silver) (2007)", "South Carolina Book Award for Young Adult Book (2010)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2010)", "Lincoln Award (2013)", "Missouri Gateway Readers Award (2010)", "Oklahoma Sequoyah Award for High School (2010)"], "places": [], "character_names": ["Clay Jensen", "Hannah Baker", "Bryce Walker", "Jessica Davis", "Justin Foley", "Tyler Down", "Courtney Crimsen", "Alex Standall", "Mr. Porter", "Marcus Cooley", "Zach Dempsey", "Ryan Shaver", "Jenny Kurtz"], "language": "English", "publish_date": "2016-12-27 00:00:00", "ISBN": "1595147888"},
{"url": "https://www.goodreads.com/book/show/13206828-cress", "num_ratings": "212,995", "num_reviews": "22,471", "avg_ratings": 4.46, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Cress", "description": ["In this third book in the Lunar Chronicles, Cinder and Captain Thorne are fugitives on the run, now with Scarlet and Wolf in tow. Together, they're plotting to overthrow Queen Levana and her army.", "Their best hope lies with Cress, a girl imprisoned on a satellite since childhood who's only ever had her netscreens as company. All that screen time has made Cress an excellent h", "In this third book in the Lunar Chronicles, Cinder and Captain Thorne are fugitives on the run, now with Scarlet and Wolf in tow. Together, they're plotting to overthrow Queen Levana and her army.", "Their best hope lies with Cress, a girl imprisoned on a satellite since childhood who's only ever had her netscreens as company. All that screen time has made Cress an excellent hacker. Unfortunately, she's just received orders from Levana to track down Cinder and her handsome accomplice.", "When a daring rescue of Cress goes awry, the group is separated. Cress finally has her freedom, but it comes at a higher price. Meanwhile, Queen Levana will let nothing prevent her marriage to Emperor Kai. Cress, Scarlet, and Cinder may not have signed up to save the world, but they may be the only hope the world has."], "author": "Marissa Meyer", "num_pages": "552", "awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2014)"], "places": ["New Beijing", "Luna"], "character_names": ["Princess Winter", "Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Carswell Thorne", "Iko", "Crescent Moon \"Cress\" Darnel", "Jacin Clay", "Dr. Dmitri Erland", "Sybil Mira", "Aimery Park", "Linh Adri"], "language": "English", "publish_date": "2014-02-04 00:00:00", "ISBN": "0312642970"},
{"url": "https://www.goodreads.com/book/show/1618.The_Curious_Incident_of_the_Dog_in_the_Night_Time", "num_ratings": "994,449", "num_reviews": "38,720", "avg_ratings": 3.86, "genres": ["Fiction", "Mystery", "Young Adult", "Contemporary"], "title": "The Curious Incident of the Dog in the Night-Time", "description": ["Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. And he detests the color yellow.", "Although gifted with a superbly logical brain, for fifteen-year-old Christopher everyday interactions and admonishment", "Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. And he detests the color yellow.", "Although gifted with a superbly logical brain, for fifteen-year-old Christopher everyday interactions and admonishments have little meaning. He lives on patterns, rules, and a diagram kept in his pocket. Then one day, a neighbor's dog, Wellington, is killed and his carefully constructive universe is threatened. Christopher sets out to solve the murder in the style of his favourite (logical) detective, Sherlock Holmes. What follows makes for a novel that is funny, poignant and fascinating in its portrayal of a person whose curse and blessing are a mind that perceives the world entirely literally."], "author": "Mark Haddon", "num_pages": "226", "awards": ["Man Booker Prize Nominee for Longlist (2003)", "James Tait Black Memorial Prize Nominee for Fiction (2003)", "Whitbread Award for Novel and Book of the Year (2003)", "Guardian Children's Fiction Prize (2003)", "McKitterick Prize (2004)", "Los Angeles Times Book Prize for Art Seidenbaum Award for First Fiction (2003)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Zilveren Zoen (2004)", "Lincoln Award Nominee (2006)", "Commonwealth Writers' Prize for Best First Book Overall (2004)", "North East Teenage Book Award Nominee (2004)", "Dolly Gray Children's Literature Award (2004)"], "places": ["Swindon, England", "London, England", "England"], "character_names": ["Christopher John Francis Boone", "Toby", "Siobhan", "Mr. Jeavons", "Mrs. Alexander", "Ed Boone", "Judy Boone", "Mr. Roger Shears", "Mrs. Eileen Shears", "Rhodri", "Wellington"], "language": "English", "publish_date": "2004-05-18 00:00:00", "ISBN": "1400032717"},
{"url": "https://www.goodreads.com/book/show/256683.City_of_Bones", "num_ratings": "1,368,756", "num_reviews": "55,039", "avg_ratings": 4.11, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal", "Romance"], "title": "City of Bones", "description": ["When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is not", "When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is nothing―not even a smear of blood―to show that a boy has died. Or was he a boy?", "This is Clary's first meeting with the Shadowhunters, warriors dedicated to ridding the earth of demons. It's also her first encounter with Jace, a Shadowhunter who looks a little like an angel and acts a lot like a jerk. Within twenty-four hours Clary is pulled into Jace's world with a vengeance when her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in ordinary mundanes like Clary and her mother? And how did Clary suddenly get the Sight? The Shadowhunters would like to know..."], "author": "Cassandra Clare", "num_pages": "485", "awards": ["Locus Award Nominee for Best First Novel (2007)", "Georgia Peach Book Award Nominee for Honor book (2009)", "South Carolina Book Award Nominee for Young Adult Book Award (2010)", "Pacific Northwest Library Association Young Reader's Choice Award (2010)", "Lincoln Award (2010)"], "places": ["New York City, New York"], "character_names": ["Alec Lightwood", "Jonathan \"Jace\" Wayland", "Valentine Morgenstern", "Isabelle Lightwood", "Magnus Bane", "Simon Lewis", "Jocelyn Fray", "Luke Garroway", "Clarissa \"Clary\" Fray"], "language": "English", "publish_date": "2007-03-27 00:00:00", "ISBN": "1416914285"},
{"url": "https://www.goodreads.com/book/show/19547856-simon-vs-the-homo-sapiens-agenda", "num_ratings": "158,196", "num_reviews": "24,566", "avg_ratings": 4.34, "genres": ["Young Adult", "Contemporary", "Lgbt", "Romance"], "title": "Simon vs. the Homo Sapiens Agenda", "description": ["Sixteen-year-old and not-so-openly gay Simon Spier prefers to save his drama for the school musical. But when an email falls into the wrong hands, his secret is at risk of being thrust into the spotlight. Now Simon is actually being blackmailed: if he doesn’t play wingman for class clown Martin, his sexual identity will become everyone’s business. Worse, the privacy of Blu", "Sixteen-year-old and not-so-openly gay Simon Spier prefers to save his drama for the school musical. But when an email falls into the wrong hands, his secret is at risk of being thrust into the spotlight. Now Simon is actually being blackmailed: if he doesn’t play wingman for class clown Martin, his sexual identity will become everyone’s business. Worse, the privacy of Blue, the pen name of the boy he’s been emailing, will be compromised.", "With some messy dynamics emerging in his once tight-knit group of friends, and his email correspondence with Blue growing more flirtatious every day, Simon’s junior year has suddenly gotten all kinds of complicated. Now, change-averse Simon has to find a way to step out of his comfort zone before he’s pushed out—without alienating his friends, compromising himself, or fumbling a shot at happiness with the most confusing, adorable guy he’s never met."], "author": "Becky Albertalli", "num_pages": "303", "awards": ["National Book Award Nominee for Young People's Literature (2015)", "William C. Morris YA Debut Award (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Milwaukee County Teen Book Award (2016)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2017)", "Lincoln Award Nominee (2017)", "Goodreads Choice Award Nominee for Debut Goodreads Author, and for Young Adult Fiction (2015)"], "places": ["Atlanta, Georgia"], "character_names": ["Simon Spier", "Martin Addison", "Abby Suso", "Nick Eisner", "Leah Burke"], "language": "English", "publish_date": "2015-04-07 00:00:00", "ISBN": "0062348671"},
{"url": "https://www.goodreads.com/book/show/233818.Island_of_the_Blue_Dolphins", "num_ratings": "258,053", "num_reviews": "7,260", "avg_ratings": 3.81, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Classics", "Childrens"], "title": "Island of the Blue Dolphins", "description": ["An alternate cover edition can be found ", "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.", "This is the story of Karana, the Indian girl", "An alternate cover edition can be found ", "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.", "This is the story of Karana, the Indian girl who lived alone for years on the Island of the Blue Dolphins. Year after year, she watched one season pass into another and waited for a ship to take her away. But while she waited, she kept herself alive by building shelter, making weapons, finding food, and fighting her enemies, the wild dogs. It is not only an unusual adventure of survival, but also a tale of natural beauty and personal discovery."], "author": "Scott O'Dell", "num_pages": "184", "awards": ["Newbery Medal (1961)", "Lewis Carroll Shelf Award (1961)", "Nene Award (1964)", "Dorothy Canfield Fisher Children's Book Award Nominee (1962)", "Deutscher Jugendliteraturpreis for Jugendbuch (1963)"], "places": ["Island of the Blue Dolphins", "California"], "character_names": ["Karana"], "language": "English", "publish_date": "1987-02-01 00:00:00", "ISBN": "0440439884"},
{"url": "https://www.goodreads.com/book/show/13206900-winter", "num_ratings": "138,168", "num_reviews": "20,230", "avg_ratings": 4.48, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Winter", "description": ["Princess Winter is admired by the Lunar people for her grace and kindness, and despite the scars that mark her face, her beauty is said to be even more breathtaking than that of her stepmother, Queen Levana.", "Winter despises her stepmother, and knows Levana won't approve of her feelings for her childhood friend--the handsome palace guard, Jacin. But Winter isn't as weak as L", "Princess Winter is admired by the Lunar people for her grace and kindness, and despite the scars that mark her face, her beauty is said to be even more breathtaking than that of her stepmother, Queen Levana.", "Winter despises her stepmother, and knows Levana won't approve of her feelings for her childhood friend--the handsome palace guard, Jacin. But Winter isn't as weak as Levana believes her to be and she's been undermining her stepmother's wishes for years. Together with the cyborg mechanic, Cinder, and her allies, Winter might even have the power to launch a revolution and win a war that's been raging for far too long.", "Can Cinder, Scarlet, Cress, and Winter defeat Levana and find their happily ever afters? Fans will not want to miss this thrilling conclusion to Marissa Meyer's national bestselling Lunar Chronicles series."], "author": "Marissa Meyer", "num_pages": "827", "awards": ["Pacific Book Review Award for Best Young Adult (2016)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)"], "places": ["Luna"], "character_names": ["Princess Winter", "Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Carswell Thorne", "Iko", "Crescent Moon \"Cress\" Darnel", "Jacin Clay", "Linh Adri", "Linh Pearl"], "language": "English", "publish_date": "2015-11-10 00:00:00", "ISBN": "0312642989"},
{"url": "https://www.goodreads.com/book/show/89763.Esperanza_Rising", "num_ratings": "56,269", "num_reviews": "5,255", "avg_ratings": 3.94, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Middle Grade", "Childrens", "Cultural"], "title": "Esperanza Rising", "description": ["Esperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance", "Esperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance she now faces. When their new life is threatened, Esperanza must find a way to rise above her difficult circumstances--Mama's life, and her own, depend on it."], "author": "Pam Muñoz Ryan", "num_pages": "304", "awards": ["Jane Addams Children's Book Award for Older Children (2001)", "California Young Readers Medal Nominee for Middle School/Junior High (2003)", "Judy Lopez Memorial Award for Children's Literature (2001)", "Pura Belpré Award for Narrative (2002)"], "places": ["Aguascalientes", "California"], "character_names": [], "language": "English", "publish_date": "2002-09-27 00:00:00", "ISBN": "043912042X"},
{"url": "https://www.goodreads.com/book/show/6148028-catching-fire", "num_ratings": "2,108,645", "num_reviews": "90,663", "avg_ratings": 4.29, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Fiction", "Fantasy", "Science Fiction"], "title": "Catching Fire", "description": ["Against all odds, Katniss has won the Hunger Games. She and fellow District 12 tribute Peeta Mellark are miraculously still alive. Katniss should be relieved, happy even. After all, she has returned to her family and her longtime friend, Gale. Yet nothing is the way Katniss wishes it to be. Gale holds h", "Against all odds, Katniss has won the Hunger Games. She and fellow District 12 tribute Peeta Mellark are miraculously still alive. Katniss should be relieved, happy even. After all, she has returned to her family and her longtime friend, Gale. Yet nothing is the way Katniss wishes it to be. Gale holds her at an icy distance. Peeta has turned his back on her completely. And there are whispers of a rebellion against the Capitol - a rebellion that Katniss and Peeta may have helped create.", "Much to her shock, Katniss has fueled an unrest she's afraid she cannot stop. And what scares her even more is that she's not entirely convinced she should try. As time draws near for Katniss and Peeta to visit the districts on the Capitol's cruel Victory Tour, the stakes are higher than ever. If they can't prove, without a shadow of a doubt, that they are lost in their love for each other, the consequences will be horrifying.", "In ", ", the second novel in the Hunger Games trilogy, Suzanne Collins continues the story of Katniss Everdeen, testing her more than ever before...and surprising readers at every turn."], "author": "Suzanne Collins", "num_pages": "391", "awards": ["Golden Duck Award for Hal Clement Award for Young Adult (2010)", "Soaring Eagle Book Award (2011)", "Children's Choice Book Award for Teen Choice Book of the Year (2010)", "Indies Choice Book Award for Young Adult (2010)", "Teen Read Award Nominee for Best Read (2010)", "DABWAHA Romance Tournament for Best Young Adult (2010)", "Goodreads Choice Award for Favorite Book and Young Adult Series (2009)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2010)"], "places": ["District 12, Panem", "Capitol, Panem", "Panem"], "character_names": ["Katniss Everdeen", "Peeta Mellark", "Primrose Everdeen", "Gale Hawthorne", "Effie Trinket", "Haymitch Abernathy", "Cinna", "Finnick Odair", "Johanna Mason", "President Coriolanus Snow", "Madge Undersee", "Caesar Flickerman", "Twill", "Cashmere", "Gloss", "Enobaria", "Beetee", "Wiress", "Mags", "Blight", "Woof", "Cecilia", "Chaff", "Seeder", "Plutarch Heavensbee", "Octavia (Hunger Games)", "Portia (hunger Games)"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0439023491"},
{"url": "https://www.goodreads.com/book/show/13206760-scarlet", "num_ratings": "244,570", "num_reviews": "25,870", "avg_ratings": 4.3, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Scarlet", "description": ["Cinder, the cyborg mechanic, returns in the second thrilling installment of the bestselling Lunar Chronicles. She’s trying to break out of prison—even though if she succeeds, she’ll be the Commonwealth’s most wanted fugitive. ", "Halfway around the world, Scarlet Benoit’s grandmother is missing. When Scarlet encounters Wolf, a street fighter who may have information as to her", "Cinder, the cyborg mechanic, returns in the second thrilling installment of the bestselling Lunar Chronicles. She’s trying to break out of prison—even though if she succeeds, she’ll be the Commonwealth’s most wanted fugitive. ", "Halfway around the world, Scarlet Benoit’s grandmother is missing. When Scarlet encounters Wolf, a street fighter who may have information as to her grandmother’s whereabouts, she is loath to trust this stranger, but is inexplicably drawn to him, and he to her. As Scarlet and Wolf unravel one mystery, they encounter another when they meet Cinder. Now, all of them must stay one step ahead of the vicious Lunar Queen Levana, who will do anything for the handsome Prince Kai to become her husband, her king, her ", "."], "author": "Marissa Meyer", "num_pages": "454", "awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2013)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2013)"], "places": ["Toulouse", "Paris", "New Beijing", "Rieux"], "character_names": ["Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Ran Kesley", "Carswell Thorne", "Iko", "Aimery Park", "Linh Adri", "Linh Pearl", "Michelle Benoit"], "language": "English", "publish_date": "2013-02-05 00:00:00", "ISBN": "0312642962"},
{"url": "https://www.goodreads.com/book/show/9275658-legend", "num_ratings": "354,355", "num_reviews": "25,467", "avg_ratings": 4.18, "genres": ["Young Adult", "Romance", "Fantasy", "Science Fiction", "Fiction"], "title": "Legend", "description": ["What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal.", "What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal. But his motives may not be as malicious as they seem.", "From very different worlds, June and Day have no reason to cross paths—until the day June's brother, Metias, is murdered and Day becomes the prime suspect. Caught in the ultimate game of cat and mouse, Day is in a race for his family's survival, while June seeks to avenge Metias's death. But in a shocking turn of events, the two uncover the truth of what has really brought them together, and the sinister lengths their country will go to keep its secrets."], "author": "Marie Lu", "num_pages": "305", "awards": ["Milwaukee County Teen Book Award Nominee (2013)", "The Inky Awards Nominee for Silver Inky (2012)", "California Young Readers Medal Nominee for Young Adult (2015)", "Lincoln Award Nominee (2014)", "Missouri Truman Readers Award (2014)", "Goodreads Choice Award Nominee for Young Adult Fantasy and Science Fiction (2012)", "Rebecca Caudill Young Readers' Book Award (2015)"], "places": ["Los Angeles, The Republic of America"], "character_names": ["June Iparis", "Daniel Altan Wing", "Metias Iparis", "Commander Jameson", "Thomas Bryant", "Tess", "Kaede"], "language": "English", "publish_date": "2011-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/118944.American_Born_Chinese", "num_ratings": "57,628", "num_reviews": "6,641", "avg_ratings": 3.88, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Fiction", "Fantasy"], "title": "American Born Chinese", "description": ["All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...", "Born to rule over all the monkeys in the world, the story of the Monkey K", "All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...", "Born to rule over all the monkeys in the world, the story of the Monkey King is one of the oldest and greatest Chinese fables. Adored by his subjects, master of the arts of kung-fu, he is the most powerful monkey on earth. But the Monkey King doesn't want to be a monkey. He wants to be hailed as a god...", "Chin-Kee is the ultimate negative Chinese stereotype, and he's ruining his cousin Danny's life. Danny's a popular kid at school, but every year Chin-Kee comes to visit, and every year Danny has to transfer to a new school to escape the shame. This year, though, things quickly go from bad to worse...", "These three apparently unrelated tales come together with an unexpected twist, in a modern fable that is hilarious, poignant and action-packed. ", " is an amazing rise, all the way up to the astonishing climax--and confirms what a growing number of readers already know: Gene Yang is a major talent."], "author": "Gene Luen Yang", "num_pages": "240", "awards": ["Michael L. Printz Award (2007)", "James Cook Book Award Nominee (2007)", "Will Eisner Comic Industry Awards for Best Graphic Album - New (2007)", "National Book Award Finalist for Young People's Literature (2006)", "One Book One San Diego for Young Adult (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "1596431520"},
{"url": "https://www.goodreads.com/book/show/6567017-will-grayson-will-grayson", "num_ratings": "287,794", "num_reviews": "16,861", "avg_ratings": 3.82, "genres": ["Young Adult", "Contemporary", "Lgbt", "Fiction"], "title": "Will Grayson, Will Grayson", "description": ["Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.", "It's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the sa", "Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.", "It's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the same surprising crossroads, the Will Graysons find their lives overlapping and hurtling in new and unexpected directions. With a push from friends new and old - including the massive, and massively fabulous, Tiny Cooper, offensive lineman and musical theater auteur extraordinaire - Will and Will begin building toward respective romantic turns-of-heart and the epic production of history's most awesome high school musical."], "author": "John Green", "num_pages": "310", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2011)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Novel (2010)", "Odyssey Award Nominee (2011)", "Milwaukee County Teen Book Award (2011)", "Children's Choice Book Award for Teen Choice Book of the Year (2011)", "The Inky Awards Nominee for Silver Inky (2010)", "Lincoln Award Nominee (2013)", "Goodreads Choice Award Nominee for Young Adult Fiction (2010)", "The Inky Awards Shortlist for Silver Inky (2010)"], "places": ["Illinois"], "character_names": ["Will Grayson", "Tiny Cooper", "Jane Turner", "Maura"], "language": "English", "publish_date": "2010-04-06 00:00:00", "ISBN": "0525421580"},
{"url": "https://www.goodreads.com/book/show/11387515-wonder", "num_ratings": "521,768", "num_reviews": "56,075", "avg_ratings": 4.45, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Contemporary", "Childrens", "Middle Grade"], "title": "Wonder", "description": ["Alternate Cover Edition ISBN 0375869026 (ISBN13: 9780375869020)", "August Pullman was born with a facial difference that, up until now, has prevented him from going to a mainstream school. Starting 5th grade at Beecher Prep, he wants nothing more than to be treated as an ordinary kid—but his new", "Alternate Cover Edition ISBN 0375869026 (ISBN13: 9780375869020)", "August Pullman was born with a facial difference that, up until now, has prevented him from going to a mainstream school. Starting 5th grade at Beecher Prep, he wants nothing more than to be treated as an ordinary kid—but his new classmates can’t get past Auggie’s extraordinary face. WONDER, now a #1 New York Times bestseller and included on the Texas Bluebonnet Award master list, begins from Auggie’s point of view, but soon switches to include his classmates, his sister, her boyfriend, and others. These perspectives converge in a portrait of one community’s struggle with empathy, compassion, and acceptance."], "author": "R.J. Palacio", "num_pages": "316", "awards": ["Josette Frank Award (2013)", "Texas Bluebonnet Award Nominee (2013)", "West Australian Young Readers' Book Award (WAYRBA) for Younger Readers (2013)", "Dorothy Canfield Fisher Children's Book Award (2014)", "Charlie May Simon Children's Book Award (2015)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2014)", "New Mexico Land of Enchantment Award for Children (2014)", "California Young Readers Medal for Intermediate (2015)", "James Cook Book Award Nominee (2013)", "Judy Lopez Memorial Award for Children's Literature (2013)", "Louisiana Young Readers' Choice for Grades 3-5 (2015)", "NAIBA Book of the Year for Middle Readers (2012)", "Waterstones Children's Book Prize (2013)", "Washington State Sasquatch Award Nominee (2015)", "Bluestem Book Award (2014)", "Goodreads Choice Award Nominee for Best Middle Grade & Children's (2012)", "Carnegie Medal Nominee (2013)", "North Carolina Children's Book Award (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2012)", "Rhode Island Children’s Book Award (2014)", "FAB Award Nominee (2014)", "Rebecca Caudill Young Readers' Book Award (2014)"], "places": ["Upper Manhattan, New York"], "character_names": ["August Pullman", "Olivia Pullman", "Jack Will", "Julian Albans", "Summer Dawson", "Miranda Navas", "Nate Pullman", "Isabel Pullman", "Justin (Wonder)", "Charlotte Cody"], "language": "English", "publish_date": "2012-02-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2767052-the-hunger-games", "num_ratings": "5,448,058", "num_reviews": "159,973", "avg_ratings": 4.33, "genres": ["Young Adult", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Science Fiction", "Romance", "Adventure", "Young Adult", "Teen", "Apocalyptic", "Post Apocalyptic", "Action"], "title": "The Hunger Games", "description": ["The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as t", "The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory.", "When 16-year-old Katniss's young sister, Prim, is selected as District 12's female representative, Katniss volunteers to take her place. She and her male counterpart Peeta, are pitted against bigger, stronger representatives, some of whom have trained for this their whole lives. , she sees it as a death sentence. But Katniss has been close to death before. For her, survival is second nature."], "author": "Suzanne Collins", "num_pages": "374", "awards": ["Georgia Peach Book Award (2009)", "Buxtehuder Bulle (2009)", "Golden Duck Award for Hal Clement Award for Young Adult (2009)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2012)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2010)", "Red House Children's Book Award for Older Readers & Overall (2010)", "South Carolina Book Award for Junior and Young Adult Book (2011)", "Charlotte Award (2010)", "Colorado Blue Spruce Young Adult Book Award (2010)", "Teen Buckeye Book Award (2009)", "Pennsylvania Young Readers' Choice Award for Young Adults (2010)", "Rhode Island Teen Book Award (2010)", "Dorothy Canfield Fisher Children's Book Award (2010)", "Evergreen Teen Book Award (2011)", "Soaring Eagle Book Award (2009)", "Milwaukee County Teen Book Award Nominee (2010)", "Sakura Medal for Middle School Book (2010)", "Michigan Library Association Thumbs Up! Award (2009)", "Florida Teens Read (2009)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2010)", "Iowa High School Book Award (2011)", "New Mexico Land of Enchantment Award for Young Adult (2011)", "Eliot Rosewater Indiana High School Book Award (2010)", "The Inky Awards for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2011)", "Lincoln Award (2011)", "Kinderboekwinkelprijs (2010)", "Missouri Truman Readers Award (2011)", "Cybils Award for Young Adult Fantasy & Science Fiction (2008)", "Literaturpreis der Jury der jungen Leser for Jugendbuch (2010)", "The Inky Awards Shortlist for Silver Inky (2009)", "Prix Et-lisez-moi (2011)", "Missouri Gateway Readers Award (2011)", "Oklahoma Sequoyah Award for High School and Intermediate (2011)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2009)", "Rebecca Caudill Young Readers' Book Award (2011)"], "places": ["District 12, Panem", "Capitol, Panem", "Panem"], "character_names": ["Katniss Everdeen", "Peeta Mellark", "Cato (Hunger Games)", "Primrose Everdeen", "Gale Hawthorne", "Effie Trinket", "Haymitch Abernathy", "Cinna", "President Coriolanus Snow", "Rue", "Venia", "Flavius", "Lavinia (Hunger Games)", "Marvel", "Glimmer", "Clove", "Foxface", "Thresh", "Greasy Sae", "Madge Undersee", "Caesar Flickerman", "Claudius Templesmith", "Octavia (Hunger Games)", "Portia (hunger Games)"], "language": "English", "publish_date": "2008-09-14 00:00:00", "ISBN": "0439023483"},
{"url": "https://www.goodreads.com/book/show/22628.The_Perks_of_Being_a_Wallflower", "num_ratings": "1,051,774", "num_reviews": "50,385", "avg_ratings": 4.21, "genres": ["Young Adult", "Fiction", "Contemporary"], "title": "The Perks of Being a Wallflower", "description": ["The critically acclaimed debut novel from Stephen Chbosky, Perks follows observant “wallflower” Charlie as he charts a course through the strange world between adolescence and adulthood. First dates, family drama, and new friends. Sex, drugs, and The Rocky Horror Picture Show. Devastating loss, young love, and life on the fringes. Caught between trying to live his life and", "The critically acclaimed debut novel from Stephen Chbosky, Perks follows observant “wallflower” Charlie as he charts a course through the strange world between adolescence and adulthood. First dates, family drama, and new friends. Sex, drugs, and The Rocky Horror Picture Show. Devastating loss, young love, and life on the fringes. Caught between trying to live his life and trying to run from it, Charlie must learn to navigate those wild and poignant roller-coaster days known as growing up.", "Listening Length: 6 hours and 18 minutes"], "author": "Stephen Chbosky", "num_pages": "213", "awards": [], "places": ["Pittsburgh, Pennsylvania"], "character_names": ["Bill", "Patrick Grogan", "Charlie Scorsoni", "Sam Turner", "Michael Dobson", "Mary-Elizabeth", "Candace Grogan"], "language": "English", "publish_date": "1999-02-16 00:00:00", "ISBN": "0671027344"},
{"url": "https://www.goodreads.com/book/show/12000020-aristotle-and-dante-discover-the-secrets-of-the-universe", "num_ratings": "159,127", "num_reviews": "23,968", "avg_ratings": 4.35, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "Aristotle and Dante Discover the Secrets of the Universe", "description": ["Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this fr", "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be."], "author": "Benjamin Alire Sáenz", "num_pages": "359", "awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2013)", "Michael L. Printz Award Nominee (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2015)", "Lambda Literary Award for LGBT Children's/Young Adult (2013)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2015)", "Amelia Elizabeth Walden Award Nominee (2013)", "Lincoln Award Nominee (2016)", "Pura Belpré Award for Narrative (2013)", "Les Incorruptibles (2017)"], "places": ["El Paso, Texas", "Texas"], "character_names": ["Aristotle \"Ari\" Mendoza", "Dante Quintana"], "language": "English", "publish_date": "2012-02-21 00:00:00", "ISBN": "1442408928"},
{"url": "https://www.goodreads.com/book/show/15745753-eleanor-park", "num_ratings": "680,500", "num_reviews": "57,919", "avg_ratings": 4.09, "genres": ["Young Adult", "Romance", "Contemporary", "Fiction"], "title": "Eleanor & Park", "description": ["... Red hair, wrong clothes. Standing behind him until he turns his head. Lying beside him until he wakes up. Making everyone else seem drabber and flatter and never good enough...Eleanor.", "... He knows she'll love a song before he plays it for her. He laughs at her jokes before she ever gets to the punch line. There's a place on", "... Red hair, wrong clothes. Standing behind him until he turns his head. Lying beside him until he wakes up. Making everyone else seem drabber and flatter and never good enough...Eleanor.", "... He knows she'll love a song before he plays it for her. He laughs at her jokes before she ever gets to the punch line. There's a place on his chest, just below his throat, that makes her want to keep promises...Park.", "Set over the course of one school year, this is the story of two star-crossed sixteen-year-olds—smart enough to know that first love almost never lasts, but brave and desperate enough to try."], "author": "Rainbow Rowell", "num_pages": "328", "awards": ["Georgia Peach Book Award (2014)", "All About Romance (AAR) Annual Reader Poll for Best Young Adult Romance (2014)", "Odyssey Award Nominee (2014)", "Michael L. Printz Award Nominee (2016)", "Pennsylvania Young Readers' Choice Award for Young Adults (2015)", "Milwaukee County Teen Book Award (2014)", "Michigan Library Association Thumbs Up! Award (2014)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2016)", "Amelia Elizabeth Walden Award (2014)", "Boston Globe-Horn Book Award for Fiction (2013)", "Dioraphte Jongerenliteratuurprijs for vertaald boek (2015)", "California Young Readers Medal Nominee for Young Adult (2016)", "Lincoln Award (2015)", "DABWAHA Romance Tournament Nominee for Best Young Adult Romance (2014)", "North Carolina Young Adult Book Award for High School (2016)", "Goodreads Choice Award for Best Young Adult Fiction (2013)", "Green Mountain Book Award Nominee (2015)", "The Magnolia Award for 9-12 (2015)", "Missouri Gateway Readers Award Nominee (2016)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2013)"], "places": ["Omaha, Nebraska"], "character_names": ["Park Sheridan", "Eleanor Douglas"], "language": "English", "publish_date": "2013-02-26 00:00:00", "ISBN": "1250012570"},
{"url": "https://www.goodreads.com/book/show/11235712-cinder", "num_ratings": "537,762", "num_reviews": "46,012", "avg_ratings": 4.15, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Science Fiction", "Dystopia"], "title": "Cinder", "description": ["Sixteen-year-old Cinder is considered a technological mistake by most of society and a burden by her stepmother. Being cyborg does have its benefits, though: Cinder's brain interference has given her an uncanny ability to fix things (robots, hovers, her own malfunctioning parts), making her the best mechanic in New Beijing. This reputation brings Prince Kai himself to her", "Sixteen-year-old Cinder is considered a technological mistake by most of society and a burden by her stepmother. Being cyborg does have its benefits, though: Cinder's brain interference has given her an uncanny ability to fix things (robots, hovers, her own malfunctioning parts), making her the best mechanic in New Beijing. This reputation brings Prince Kai himself to her weekly market booth, needing her to repair a broken android before the annual ball. He jokingly calls it \"a matter of national security,\" but Cinder suspects it's more serious than he's letting on.", "Although eager to impress the prince, Cinder's intentions are derailed when her younger stepsister, and only human friend, is infected with the fatal plague that's been devastating Earth for a decade. Blaming Cinder for her daughter's illness, Cinder's stepmother volunteers her body for plague research, an \"honor\" that no one has survived.", "But it doesn't take long for the scientists to discover something unusual about their new guinea pig. Something others would kill for."], "author": "Marissa Meyer", "num_pages": "390", "awards": ["Kalbacher Klapperschlange for Altersgruppe 7. - 9. Klasse (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2014)", "California Young Readers Medal for Young Adult (2016)", "Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2012)", "Rebecca Caudill Young Readers' Book Award Nominee (2016)"], "places": ["New Beijing"], "character_names": ["Linh Cinder", "Queen Levana", "Emperor Kai", "Iko", "Crescent Moon \"Cress\" Darnel", "Dr. Dmitri Erland", "Sybil Mira", "Linh Adri", "Linh Peony", "Linh Pearl"], "language": "English", "publish_date": "2012-01-03 00:00:00", "ISBN": "0312641893"}
]