[
{"url": "https://www.goodreads.com/book/show/320.One_Hundred_Years_of_Solitude", "num_ratings": "623,503", "num_reviews": "23,998", "avg_ratings": 4.05, "genres": ["Fiction", "Classics", "Magical Realism", "Literature", "Novels", "Fantasy", "Historical", "Historical Fiction", "European Literature", "Spanish Literature", "Abandoned", "Cultural", "Latin American"], "title": "One Hundred Years of Solitude", "description": ["The brilliant, bestselling, landmark novel that tells the story of the Buendia family, and chronicles the irreconcilable conflict between the desire for solitude and the need for love—in rich, imaginative prose that has come to define an entire genre known as \"magical realism.\""], "author": "Gabriel García Márquez", "num_pages": "417", "awards": ["Premio Internacional de Novela Rómulo Gallegos (1972)", "Prix du Meilleur Livre Étranger for Roman (1969)"], "places": ["Macondo"], "character_names": ["Úrsula Iguarán", "Remedios Moscote", "Remedios, la bella", "Fernanda del Carpio", "Aureliano Buendía", "José Arcadio Buendía", "Amaranta Buendía", "Amaranta Úrsula Buendía", "Aureliano Babilonia", "José Arcadio Segundo", "Aureliano Segundo", "Aureliano José", "Pilar Ternera", "Rebeca Buendía", "Santa Sofía de la Piedad", "Arcadio Buendía", "José Arcadio Buendía, hijo", "Meme Buendía", "Petra Cotes", "Pietro Crespi", "Melquiades"], "language": "English", "publish_date": "2003-06-24 00:00:00", "ISBN": "0060531045"},
{"url": "https://www.goodreads.com/book/show/146422.The_Book_of_Sand_and_Shakespeare_s_Memory", "num_ratings": "8,501", "num_reviews": "539", "avg_ratings": 4.16, "genres": ["Fiction", "Short Stories", "Literature", "Classics", "Magical Realism"], "title": "The Book of Sand and Shakespeare's Memory", "description": ["Alternate cover edition — ISBN: 0141183829", "'One of the most remarkable artists of our age' - Mario Vargas Llosa. ", " was the last of Borges' major collections to be published. The stories are, in his words, 'variations on favourite themes...combining a plain and at times almost colloquial style with a fantastic plot'. It includes such marvellous tales as \"The C", "Alternate cover edition — ISBN: 0141183829", "'One of the most remarkable artists of our age' - Mario Vargas Llosa. ", " was the last of Borges' major collections to be published. The stories are, in his words, 'variations on favourite themes...combining a plain and at times almost colloquial style with a fantastic plot'. It includes such marvellous tales as \"The Congress\", \"Undr\" and \"The Mirror and the Mask\". Also included are the handful of stories written right at the end of Borges' life - \"August 25, 1983\", \"Blue Tigers\", \"The Rose of Paracelsus\" and \"Shakespeare's Memory\"."], "author": "Jorge Luis Borges", "num_pages": "159", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-04-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12764.The_Death_of_Artemio_Cruz", "num_ratings": "7,575", "num_reviews": "451", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "Latin American", "European Literature", "Spanish Literature"], "title": "The Death of Artemio Cruz", "description": ["Hailed as a masterpiece since its publication in 1962, ", " is Carlos Fuentes's haunting voyage into the soul of modern Mexico. Its acknowledged place in Latin American fiction and its appeal to a fresh generation of readers have warranted this new translation by Alfred Mac Adam, translator (with the author) of Fuentes's ", ".", "As in all hi", "Hailed as a masterpiece since its publication in 1962, ", " is Carlos Fuentes's haunting voyage into the soul of modern Mexico. Its acknowledged place in Latin American fiction and its appeal to a fresh generation of readers have warranted this new translation by Alfred Mac Adam, translator (with the author) of Fuentes's ", ".", "As in all his fiction, but perhaps most powerfully in this book, Fuentes is a passionate guide to the ironies of Mexican history, the burden of its past, and the anguish of its present."], "author": "Carlos Fuentes", "num_pages": "307", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-05-01 00:00:00", "ISBN": "0374522839"},
{"url": "https://www.goodreads.com/book/show/501817.Cuentos_de_amor_de_locura_y_de_muerte", "num_ratings": "9,142", "num_reviews": "371", "avg_ratings": 4.06, "genres": ["Short Stories", "Classics", "European Literature", "Spanish Literature", "Fiction"], "title": "Cuentos de amor, de locura y de muerte", "description": ["Constituye la obra cumbre del autor, en las breves y apasionantes historias que componen el libro, la intriga, el drama y el misterio se desbordan y nos invaden. Quiroga es aquí consagrado como uno de los mejores cuentistas de todos los tiempos."], "author": "Horacio Quiroga", "num_pages": "151", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2006-10-13 00:00:00", "ISBN": "1406832588"},
{"url": "https://www.goodreads.com/book/show/32957.Caramelo", "num_ratings": "9,148", "num_reviews": "736", "avg_ratings": 3.88, "genres": ["Fiction", "Novels", "Historical", "Historical Fiction"], "title": "Caramelo", "description": ["Every year, Ceyala \"Lala\" Reyes' family--aunts, uncles, mothers, fathers, and Lala's six older brothers--packs up three cars and, in a wild ride, drive from Chicago to the Little Grandfather and Awful Grandmother's house in Mexico City for the summer. Struggling to find a voice above the boom of her brothers and to understand her place on this side of the border and that,", "Every year, Ceyala \"Lala\" Reyes' family--aunts, uncles, mothers, fathers, and Lala's six older brothers--packs up three cars and, in a wild ride, drive from Chicago to the Little Grandfather and Awful Grandmother's house in Mexico City for the summer. Struggling to find a voice above the boom of her brothers and to understand her place on this side of the border and that, Lala is a shrewd observer of family life. But when she starts telling the Awful Grandmother's life story, seeking clues to how she got to be so awful, grandmother accuses Lala of exaggerating. Soon, a multigenerational family narrative turns into a whirlwind exploration of storytelling, lies, and life. Like the cherished ", ", or shawl, that has been passed down through generations of Reyes women,", " is alive with the vibrations of history, family, and love."], "author": "Sandra Cisneros", "num_pages": "441", "awards": ["Orange Prize Nominee for Fiction Longlist (2003)", "International DUBLIN Literary Award Nominee (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-09-09 00:00:00", "ISBN": "0679742581"},
{"url": "https://www.goodreads.com/book/show/56899.Aura", "num_ratings": "17,271", "num_reviews": "1,226", "avg_ratings": 3.79, "genres": ["Fiction", "European Literature", "Spanish Literature", "Cultural", "Latin American", "Classics", "Literature"], "title": "Aura", "description": ["Felipe Montero is employed in the house of an aged widow to edit her deceased husband's memoirs. There Felipe meets her beautiful green-eyed niece, Aura. His passion for Aura and his gradual discovery of the true relationship between the young woman and her aunt propel the story to its extraordinary conclusion."], "author": "Carlos Fuentes", "num_pages": "65", "awards": [], "places": ["Mexico City (México City)"], "character_names": [], "language": "English", "publish_date": "2004-01-01 00:00:00", "ISBN": "9580469717"},
{"url": "https://www.goodreads.com/book/show/16532.Of_Love_and_Shadows", "num_ratings": "20,981", "num_reviews": "663", "avg_ratings": 3.97, "genres": ["Fiction", "Historical", "Historical Fiction", "Romance", "Magical Realism"], "title": "Of Love and Shadows", "description": ["Beautiful and headstrong, Irene Beltrán works as a magazine journalist—a profession that belies her privileged upbringing and her engagement to an army captain. Her investigative partner is photographer Francisco Leal, the son of impoverished Spanish Marxist émigrés. Together, they form an unlikely but inseparable team—and Francisco quickly falls in love with the fierce an", "Beautiful and headstrong, Irene Beltrán works as a magazine journalist—a profession that belies her privileged upbringing and her engagement to an army captain. Her investigative partner is photographer Francisco Leal, the son of impoverished Spanish Marxist émigrés. Together, they form an unlikely but inseparable team—and Francisco quickly falls in love with the fierce and loyal Irene. When an assignment leads them to a young girl whom locals believe to possess miraculous powers, they uncover an unspeakable crime perpetrated by an oppressive regime. Determined to reveal the truth in a nation overrun by terror and violence, each will risk everything to find justice—and, ultimately, to embrace the passion and fervor that binds them.", "Profoundly moving and ultimately uplifting, ", " is a tale of romance, bravery, and tragedy, set against the indelible backdrop of a country ruled with an iron fist—and peopled with those who dare to challenge it."], "author": "Isabel Allende", "num_pages": "304", "awards": ["Soaring Eagle Book Award for 10-12 (1990)"], "places": [], "character_names": ["Irene Beltran", "Francisco Leal"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0553383833"},
{"url": "https://www.goodreads.com/book/show/588242.Kiss_of_the_Spider_Woman", "num_ratings": "10,385", "num_reviews": "622", "avg_ratings": 3.96, "genres": ["Fiction", "Lgbt", "European Literature", "Spanish Literature", "Cultural", "Latin American"], "title": "Kiss of the Spider Woman", "description": ["Sometimes they talk all night long. In the still darkness of their cell, Molina re-weaves the glittering and fragile stories of the film he loves, and the cynical Valentin listens. Valentin believes in the just cause which makes all suffering bearable; Molina believes in the magic of love which makes all else endurable. Each has always been alone, and always - especially n", "Sometimes they talk all night long. In the still darkness of their cell, Molina re-weaves the glittering and fragile stories of the film he loves, and the cynical Valentin listens. Valentin believes in the just cause which makes all suffering bearable; Molina believes in the magic of love which makes all else endurable. Each has always been alone, and always - especially now - in danger of betrayal. But in cell 7 each surrenders to the other something of himself that he has never surrendered before."], "author": "Manuel Puig", "num_pages": "281", "awards": [], "places": [], "character_names": ["Valentín Arregui Paz", "Luis Molina"], "language": "English", "publish_date": "1991-04-03 00:00:00", "ISBN": "0679724494"},
{"url": "https://www.goodreads.com/book/show/23884.The_General_in_His_Labyrinth", "num_ratings": "14,691", "num_reviews": "685", "avg_ratings": 3.67, "genres": ["Historical", "Historical Fiction", "Classics", "Literature", "Novels", "European Literature", "Spanish Literature", "Literature", "Latin American Literature", "Fiction", "Historical", "Literature", "20th Century", "Literary Fiction"], "title": "The General in His Labyrinth", "description": ["(Book Jacket Status: Jacketed)", "Gabriel García Márquez's most political novel is the tragic story of General Simón Bolívar, the man who tried to unite a continent.", "Bolívar, known in six Latin American countries as the Liberator, is one of the most revered heroes of the western hemisphere; in García Márquez's brilliant reimagining he is magnificently flawed as well. The novel", "(Book Jacket Status: Jacketed)", "Gabriel García Márquez's most political novel is the tragic story of General Simón Bolívar, the man who tried to unite a continent.", "Bolívar, known in six Latin American countries as the Liberator, is one of the most revered heroes of the western hemisphere; in García Márquez's brilliant reimagining he is magnificently flawed as well. The novel follows Bolívar as he takes his final journey in 1830 down the Magdalena River toward the sea, revisiting the scenes of his former glory and lamenting his lost dream of an alliance of American nations. Forced from power, dogged by assassins, and prematurely aged and wasted by a fatal illness, the General is still a remarkably vital and mercurial man. He seems to remain alive by the sheer force of will that led him to so many victories in the battlefields and love affairs of his past. As he wanders in the labyrinth of his failing powers-and still-powerful memories-he defies his impending death until the last.", "is an unforgettable portrait of a visionary from one of the greatest writers of our time."], "author": "Gabriel García Márquez", "num_pages": "248", "awards": [], "places": [], "character_names": ["Simon Bolivar"], "language": "English", "publish_date": "2004-10-26 00:00:00", "ISBN": "1400043336"},
{"url": "https://www.goodreads.com/book/show/24796.Zorro", "num_ratings": "18,044", "num_reviews": "1,506", "avg_ratings": 3.75, "genres": ["Fiction", "Historical", "Historical Fiction", "Adventure", "Historical", "Romance"], "title": "Zorro", "description": ["A swashbuckling adventure story that reveals for the first time how Diego de la Vega became the masked man we all know so well Born in southern California late in the eighteenth century, Diego de la Vega is a child of two worlds. His father is an aristocratic Spanish military man turned landowner; his mother, a Shoshone warrior. At the age of sixteen, Diego is sent to Spai", "A swashbuckling adventure story that reveals for the first time how Diego de la Vega became the masked man we all know so well Born in southern California late in the eighteenth century, Diego de la Vega is a child of two worlds. His father is an aristocratic Spanish military man turned landowner; his mother, a Shoshone warrior. At the age of sixteen, Diego is sent to Spain, a country chafing under the corruption of Napoleonic rule. He soon joins La Justicia, a secret underground resistance movement devoted to helping the powerless and the poor. Between the New World and the Old, the persona of Zorro is formed, a great hero is born, and the legend begins. After many adventures -- duels at dawn, fierce battles with pirates at sea, and impossible rescues -- Diego de la Vega, a.k.a. Zorro, returns to America to reclaim the hacienda on which he was raised and to seek justice for all who cannot fight for it themselves."], "author": "Isabel Allende", "num_pages": "677", "awards": [], "places": ["California"], "character_names": ["Bernardo", "Zorro", "Alejandro de la Vega", "Lolita Pulido", "Lechuza Blanca", "Toypurnia", "Jean Lafitte"], "language": "English", "publish_date": "2005-05-03 00:00:00", "ISBN": "006078721X"},
{"url": "https://www.goodreads.com/book/show/24790.Paula", "num_ratings": "25,910", "num_reviews": "1,641", "avg_ratings": 4.09, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Paula", "description": ["Paula es el libro más conmovedor, más personal y más íntimo de Isabel Allende. Junto al lecho en que agonizaba su hija Paula, la gran narradora chilena escribió la historia de su familia y de sí misma con el propósito de regalársela a Paula cuando ésta superara el dramático trance. El resultado se convirtió en un autorretrato de insólita emotividad y en una exquisita recre", "Paula es el libro más conmovedor, más personal y más íntimo de Isabel Allende. Junto al lecho en que agonizaba su hija Paula, la gran narradora chilena escribió la historia de su familia y de sí misma con el propósito de regalársela a Paula cuando ésta superara el dramático trance. El resultado se convirtió en un autorretrato de insólita emotividad y en una exquisita recreación de la sensibilidad de las mujeres de nuestra época."], "author": "Isabel Allende", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2004-06-30 00:00:00", "ISBN": "849759388X"},
{"url": "https://www.goodreads.com/book/show/94486.The_Invention_of_Morel", "num_ratings": "12,827", "num_reviews": "1,075", "avg_ratings": 4.06, "genres": ["Fiction", "Science Fiction", "Classics", "Cultural", "Latin American"], "title": "The Invention of Morel", "description": ["Jorge Luis Borges declared ", " a masterpiece of plotting, comparable to ", " and ", ". Set on a mysterious island, Bioy's novella is a story of suspense and exploration, as well as a wonderfully unlikely romance, in which every detail is at once crystal clear and deeply mysterious. ", "Inspired by Bioy Casares's", "Jorge Luis Borges declared ", " a masterpiece of plotting, comparable to ", " and ", ". Set on a mysterious island, Bioy's novella is a story of suspense and exploration, as well as a wonderfully unlikely romance, in which every detail is at once crystal clear and deeply mysterious. ", "Inspired by Bioy Casares's fascination with the movie star Louise Brooks, ", " has gone on to live a secret life of its own. Greatly admired by Julio Cortázar, Gabriel García Márquez, and Octavio Paz, the novella helped to usher in Latin American fiction's now famous postwar boom. As the model for Alain Resnais and Alain Robbe-Grillet's Last Year in Marienbad, it also changed the history of film.", " "], "author": "Adolfo Bioy Casares", "num_pages": "103", "awards": ["Premio Municipal de Literatura de la Ciudad de Buenos Aires"], "places": [], "character_names": ["Dora", "Irene", "El fugitivo", "Faustine", "Morel", "Dalmacio Ombrellieri", "La mujer vieja", "Haynes", "Stoever"], "language": "English", "publish_date": "2003-08-31 00:00:00", "ISBN": "1590170571"},
{"url": "https://www.goodreads.com/book/show/89763.Esperanza_Rising", "num_ratings": "56,269", "num_reviews": "5,255", "avg_ratings": 3.94, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Middle Grade", "Childrens", "Cultural"], "title": "Esperanza Rising", "description": ["Esperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance", "Esperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance she now faces. When their new life is threatened, Esperanza must find a way to rise above her difficult circumstances--Mama's life, and her own, depend on it."], "author": "Pam Muñoz Ryan", "num_pages": "304", "awards": ["Jane Addams Children's Book Award for Older Children (2001)", "California Young Readers Medal Nominee for Middle School/Junior High (2003)", "Judy Lopez Memorial Award for Children's Literature (2001)", "Pura Belpré Award for Narrative (2002)"], "places": ["Aguascalientes", "California"], "character_names": [], "language": "English", "publish_date": "2002-09-27 00:00:00", "ISBN": "043912042X"},
{"url": "https://www.goodreads.com/book/show/85987.Portrait_in_Sepia", "num_ratings": "27,087", "num_reviews": "1,231", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Romance"], "title": "Portrait in Sepia", "description": [" is the best book Allende has published in the United States since her first novel of nearly two decades ago, ", ".” ", "—Jonathan Yardley, ", "“", " tightens the weave of a multigenerational fantasy as complete and inspiring as the real world it parallels … Allende’s enchanting historical universe keeps", " is the best book Allende has published in the United States since her first novel of nearly two decades ago, ", ".” ", "—Jonathan Yardley, ", "“", " tightens the weave of a multigenerational fantasy as complete and inspiring as the real world it parallels … Allende’s enchanting historical universe keeps expanding and ", " is a new galactic jewel.” ", "—", "A richly imagined historical novel about memory and family secrets from the ", " bestselling author of ", "and ", "."], "author": "Isabel Allende", "num_pages": "336", "awards": ["Premio de traducción literaria Valle Inclán Nominee for Margaret Sayers Peden (2001)"], "places": [], "character_names": ["Aurora del Valle", "Eliza Sommers", "Tao Chi'en", "Paulina del Valle", "Lynn Sommers", "Severo del Valle", "Nivea del Valle"], "language": "English", "publish_date": "2006-05-02 00:00:00", "ISBN": "0060898488"},
{"url": "https://www.goodreads.com/book/show/25419.When_I_Was_Puerto_Rican", "num_ratings": "8,960", "num_reviews": "590", "avg_ratings": 4.0, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography"], "title": "When I Was Puerto Rican", "description": ["Esmeralda Santiago's story begins in rural Puerto Rico, where her childhood was full of both tenderness and domestic strife, tropical sounds and sights as well as poverty. Growing up, she learned the proper way to eat a guava, the sound of tree frogs in the mango groves at night, the taste of the delectable sausage called morcilla, and the formula for ushering a dead baby'", "Esmeralda Santiago's story begins in rural Puerto Rico, where her childhood was full of both tenderness and domestic strife, tropical sounds and sights as well as poverty. Growing up, she learned the proper way to eat a guava, the sound of tree frogs in the mango groves at night, the taste of the delectable sausage called morcilla, and the formula for ushering a dead baby's soul to heaven. As she enters school we see the clash, both hilarious and fierce, of Puerto Rican and Yankee culture. When her mother, Mami, a force of nature, takes off to New York with her seven, soon to be eleven children, Esmeralda, the oldest, must learn new rules, a new language, and eventually take on a new identity. In this first volume of her much-praised, bestselling trilogy, Santiago brilliantly recreates the idyllic landscape and tumultuous family life of her earliest years and her tremendous journey from the barrio to Brooklyn, from translating for her mother at the welfare office to high honors at Harvard."], "author": "Esmeralda Santiago", "num_pages": "274", "awards": [], "places": ["Santurce, San Juan", "New York (the state)"], "character_names": [], "language": "English", "publish_date": "1994-10-11 00:00:00", "ISBN": "0679756760"},
{"url": "https://www.goodreads.com/book/show/53969.The_Feast_of_the_Goat", "num_ratings": "19,222", "num_reviews": "1,561", "avg_ratings": 4.23, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "European Literature", "Spanish Literature", "Cultural", "Latin American"], "title": "The Feast of the Goat", "description": ["Haunted all her life by feelings of terror and emptiness, forty-nine-year-old Urania Cabral returns to her native Dominican Republic - and finds herself reliving the events of 1961, when the capital was still called Trujillo City and one old man terrorized a nation of three million. Rafael Trujillo, the depraved ailing dictator whom Dominicans call the Goat, controls his i", "Haunted all her life by feelings of terror and emptiness, forty-nine-year-old Urania Cabral returns to her native Dominican Republic - and finds herself reliving the events of 1961, when the capital was still called Trujillo City and one old man terrorized a nation of three million. Rafael Trujillo, the depraved ailing dictator whom Dominicans call the Goat, controls his inner circle with a combination of violence and blackmail. In Trujillo's gaudy palace, treachery and cowardice have become a way of life. But Trujillo's grasp is slipping. There is a conspiracy against him, and a Machiavellian revolution already underway that will have bloody consequences of its own. In this 'masterpiece of Latin American and world literature, and one of the finest political novels ever written' (\"Bookforum\"), Mario Vargas Llosa recounts the end of a regime and the birth of a terrible democracy, giving voice to the historical Trujillo and the victims, both innocent and complicit, drawn into his deadly orbit."], "author": "Mario Vargas Llosa", "num_pages": "475", "awards": ["Independent Foreign Fiction Prize Nominee for Shortlist (2003)"], "places": ["Dominican Republic"], "character_names": ["Urania Cabral", "Agustín Cabral", "Rafael Trujillo", "Johnny Abbes García", "Ramfis Trujillo", "Joaquín Balaguer", "Antonio Imbert Barrera", "Antonio de la Maza"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0571207766"},
{"url": "https://www.goodreads.com/book/show/59504.El_siglo_de_las_luces", "num_ratings": "1,848", "num_reviews": "93", "avg_ratings": 4.14, "genres": ["Fiction", "European Literature", "Spanish Literature", "Literature", "Historical", "Historical Fiction"], "title": "El siglo de las luces", "description": ["This fine, somber novel, by the author of the widely acclaimed ", ", deals with the French Revolution, chiefly in the Caribbean. Not an ordinary historical novel, but rather a poetic, highly informed essay, it forth, in rich prose, a host of memorable impressions -- of Revolutionary Paris, of Caribbean islands sweltering in the sunlight, and of the Revolutionary", "This fine, somber novel, by the author of the widely acclaimed ", ", deals with the French Revolution, chiefly in the Caribbean. Not an ordinary historical novel, but rather a poetic, highly informed essay, it forth, in rich prose, a host of memorable impressions -- of Revolutionary Paris, of Caribbean islands sweltering in the sunlight, and of the Revolutionary ideals which, transplanted to these islands, died in blood, sweat and a return to slavery and the old ways. Its chief protagonist is Victor Hugues, a historical figure, who is shown through the eyes of three fictional orphaned adolescents -- Carlos, Sofia, and their cousin Esteban, whom he dazzled at first meeting. Esteban follows Victor as he rises from baker's son and merchant to Revolutionary master of the Caribbean, but sickens eventually of bloodshed and of Victor's ruthless changing to fit shifting policies. Sofia, who loves Victor and joins him, is also finally sickened by the betrayal of Revolutionary ideals, and the changes power has made in Victor. Above its many modern political parallels, this story is powerful evocation of the mysterious evolution, decay and persistence of all human relations and ambitions. Splendidly written."], "author": "Alejo Carpentier", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-01 00:00:00", "ISBN": "8432216976"},
{"url": "https://www.goodreads.com/book/show/151605.The_Decapitated_Chicken_and_Other_Stories", "num_ratings": "965", "num_reviews": "62", "avg_ratings": 4.14, "genres": ["Short Stories", "Fiction", "Classics", "Horror"], "title": "The Decapitated Chicken and Other Stories", "description": ["Horacio Quiroga's short stories are infused with the themes of life and death that so obsessed him. They span many fiction genres; jungle tale, Gothic horror story, psychological study, and morality tale- and possess a universality that has made him a classic Latin American writer.", "Horacio Quiroga was a master storyteller and author of over two hundred pieces of Latin Ameri", "Horacio Quiroga's short stories are infused with the themes of life and death that so obsessed him. They span many fiction genres; jungle tale, Gothic horror story, psychological study, and morality tale- and possess a universality that has made him a classic Latin American writer.", "Horacio Quiroga was a master storyteller and author of over two hundred pieces of Latin American fiction that have been compared to the works of Poe, Kipling, and London. Like his stories, his own life from his birth in Uruguay to his suicide in Argentina was filled with adventure, tragedy, and violence."], "author": "Horacio Quiroga", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-10 00:00:00", "ISBN": "0299198340"},
{"url": "https://www.goodreads.com/book/show/23875.El_coronel_no_tiene_qui_n_le_escriba", "num_ratings": "22,808", "num_reviews": "1,113", "avg_ratings": 3.72, "genres": ["Fiction", "European Literature", "Spanish Literature", "Classics", "Literature", "Latin American Literature"], "title": "El coronel no tiene quién le escriba", "description": ["El coronel no tiene quien le escriba fue escrita por Gabriel García Márquez durante su estancia en París, adonde había llegado como corresponsal de prensa y con la secreta intención de estudiar cine, a mediados de los años cincuenta. El cierre del periódico para el que trabajaba le sumió en la pobreza, mientras redactaba en tres versiones distintas esta excepcional novela,", "El coronel no tiene quien le escriba fue escrita por Gabriel García Márquez durante su estancia en París, adonde había llegado como corresponsal de prensa y con la secreta intención de estudiar cine, a mediados de los años cincuenta. El cierre del periódico para el que trabajaba le sumió en la pobreza, mientras redactaba en tres versiones distintas esta excepcional novela, que fue rechazada por varios editores antes de su publicación. Tras el barroquismo faulkneriano de La hojarasca, esta segunda novela supone un paso hacia la ascesis, hacia la economía expresiva, y el estilo del escritor se hace más puro y transparente. Se trata también de una historia de injusticia y violencia: un viejo coronel retirado va al puerto todos los viernes a esperar la llegada de la carta oficial que responda a la justa reclamación de sus derechos por los servicios prestados a la patria. Pero la patria permanece muda..."], "author": "Gabriel García Márquez", "num_pages": "104", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2006-02-07 00:00:00", "ISBN": "0307350436"},
{"url": "https://www.goodreads.com/book/show/163330.Death_and_the_Maiden", "num_ratings": "2,760", "num_reviews": "166", "avg_ratings": 3.95, "genres": ["Plays", "Drama", "Fiction", "Academic", "School", "Historical", "Historical Fiction"], "title": "Death and the Maiden", "description": ["Ariel Dorfman's explosively provocative, award-winning drama is set in a country that has only recently returned to democracy. Gerardo Escobar has just been chosen to head the commission that will investigate the crimes of the old regime when his car breaks down and he is picked up by the humane doctor Roberto Miranda. But in the voice of this good Samaritan, Gerardo's wif", "Ariel Dorfman's explosively provocative, award-winning drama is set in a country that has only recently returned to democracy. Gerardo Escobar has just been chosen to head the commission that will investigate the crimes of the old regime when his car breaks down and he is picked up by the humane doctor Roberto Miranda. But in the voice of this good Samaritan, Gerardo's wife, Paulina Salas, thinks she recognizes another man—the one who raped and tortured her as she lay blindfolded in a military detention center years before."], "author": "Ariel Dorfman", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-12-01 00:00:00", "ISBN": "0140246843"},
{"url": "https://www.goodreads.com/book/show/214802.Santa_Evita", "num_ratings": "1,587", "num_reviews": "151", "avg_ratings": 3.79, "genres": ["Fiction", "Historical", "Historical Fiction"], "title": "Santa Evita", "description": ["Among the great corpses of our age are Lenin, Mao Tse-tung and Stalin. Mao, at least, is still on view for the masses to see, some two decades after his demise. But no corpse engendered as much intrigue as that of Eva Peron. Elevated to near sainthood in Argentina after her death in 1952, her perfectly preserved corpse was seized by the Argentine Army following the ouster", "Among the great corpses of our age are Lenin, Mao Tse-tung and Stalin. Mao, at least, is still on view for the masses to see, some two decades after his demise. But no corpse engendered as much intrigue as that of Eva Peron. Elevated to near sainthood in Argentina after her death in 1952, her perfectly preserved corpse was seized by the Argentine Army following the ouster of her husband in 1955. By then her corpse had acquired the status of a sacred relic, and while army officials wanted to keep it out of the hands of Peronists, they were loath to destroy the corpse for fear of the backlash that might follow. Tomas Eloy Martinez has reassembled the story of the corpse of Eve Peron in ", ", and in the process, produced a riveting, rich book that not only tells the tale of one of the more bizarre sagas in the history of South American politics, but that also gets to the heart of the age-old human impulse to create myths and tell stories."], "author": "Tomás Eloy Martínez", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-08-16 00:00:00", "ISBN": "186230002X"},
{"url": "https://www.goodreads.com/book/show/49144.Peel_My_Love_Like_an_Onion", "num_ratings": "782", "num_reviews": "77", "avg_ratings": 3.79, "genres": ["Fiction", "Contemporary"], "title": "Peel My Love Like an Onion", "description": ["The seductive world of flamenco forms the backdrop for a classic tale of independence found, lost, and reclaimed. Like Bizet's legendary gypsy, Carmen \"La Coja\" (The Cripple) Santos is hilarious, passionate, triumphant, and mesmerizing.  A renowned flamenco dancer in Chicago despite the legacy of childhood polio, Carmen has long enjoyed an affair with Agustín, the married", "The seductive world of flamenco forms the backdrop for a classic tale of independence found, lost, and reclaimed. Like Bizet's legendary gypsy, Carmen \"La Coja\" (The Cripple) Santos is hilarious, passionate, triumphant, and mesmerizing.  A renowned flamenco dancer in Chicago despite the legacy of childhood polio, Carmen has long enjoyed an affair with Agustín, the married director of her troupe--a romance that's now growing stale. When she begins a new, passionate liaison with Manolo, Agustín's grandson and a dancer of natural genius, an angry rivalry is sparked. Carmen finally makes her way back to happiness in this funny, fiery story that's equal parts soap opera, tragicomedy, and rhapsody."], "author": "Ana Castillo", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-12 00:00:00", "ISBN": "038549677X"},
{"url": "https://www.goodreads.com/book/show/414729.The_Dark_Bride", "num_ratings": "844", "num_reviews": "78", "avg_ratings": 3.68, "genres": ["Fiction", "Cultural", "Latin American", "European Literature", "Spanish Literature", "Historical", "Historical Fiction"], "title": "The Dark Bride", "description": ["Once a month, the refinery workers of the Tropical Oil Company descend upon Tora, a city in the Colombian forest. They journey down from the mountains searching for earthly bliss and hoping to encounter Sayonara, the legendary Indian prostitute who rules their squalid paradise like a queen. Beautiful, exotic, and mysterious, Sayonara, the undisputed barrio angel, captivate", "Once a month, the refinery workers of the Tropical Oil Company descend upon Tora, a city in the Colombian forest. They journey down from the mountains searching for earthly bliss and hoping to encounter Sayonara, the legendary Indian prostitute who rules their squalid paradise like a queen. Beautiful, exotic, and mysterious, Sayonara, the undisputed barrio angel, captivates whoever crosses her path. Then, one day, she violates the unwritten rules of her profession and falls in love with a man she can never have. Sayonara's unrequited passion has tragic consequences not only for her, but for all those whose lives ultimately depend on the Tropical Oil Company.", "A slyly humorous yet poignant love story, ", " lovingly recreates the lusty, heartrending world of Colombian prostitutes and the men of the oil fields who are entranced by them. Full of wit and intelligence, tragedy and compassion, ", " is luminous and unforgettable."], "author": "Laura Restrepo", "num_pages": "368", "awards": [], "places": ["Colombia"], "character_names": [], "language": "English", "publish_date": "2003-09-02 00:00:00", "ISBN": "0060088958"},
{"url": "https://www.goodreads.com/book/show/271095.Bitter_Grounds", "num_ratings": "762", "num_reviews": "86", "avg_ratings": 3.92, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Latin American"], "title": "Bitter Grounds", "author": "Sandra Benítez", "num_pages": "464", "awards": ["Orange Prize Nominee for Fiction Longlist (1998)", "American Book Award (1998)"], "places": ["El Salvador"], "character_names": [], "language": "English", "publish_date": "1998-08-15 00:00:00", "ISBN": "0312195419"},
{"url": "https://www.goodreads.com/book/show/53412.La_autopista_del_sur_y_otros_cuentos", "num_ratings": "2,697", "num_reviews": "33", "avg_ratings": 4.43, "genres": ["Short Stories", "European Literature", "Spanish Literature", "Fiction", "Cultural", "Latin American"], "title": "La autopista del sur y otros cuentos", "description": ["A young girl spends her summer vacation in a country house where a tiger roams...A man reading a mystery finds out too late that he is the murderer's victim...In the stories collected here—including ", ", on which Antonioni based his film—Julio Cortazar explores the boundary where the everyday meets the mysterious, perhaps even the terrible. This is the most brilliant a", "A young girl spends her summer vacation in a country house where a tiger roams...A man reading a mystery finds out too late that he is the murderer's victim...In the stories collected here—including ", ", on which Antonioni based his film—Julio Cortazar explores the boundary where the everyday meets the mysterious, perhaps even the terrible. This is the most brilliant and celebrated book of short stories by a master of the form."], "author": "Julio Cortázar", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "1996-08-01 00:00:00", "ISBN": "014025580X"},
{"url": "https://www.goodreads.com/book/show/23882.Ojos_de_perro_azul", "num_ratings": "4,284", "num_reviews": "206", "avg_ratings": 3.74, "genres": ["Short Stories", "Fiction", "Magical Realism", "European Literature", "Spanish Literature", "Literature", "Latin American Literature"], "title": "Ojos de perro azul", "description": ["Estos relatos tempranos de Gabriel García Márquez fueron escritos y publicados entre 1947 y 1955, aunque, como libro, Ojos de perro azul no aparecería hasta 1974 cuando el escritor ya había publicado otros dos libros de relatos y cuatro novelas, de las que la última, \"Cien años de soledad\", le proporcionaría su primer gran éxito internacional.", "En este libro se incluye su pr", "Estos relatos tempranos de Gabriel García Márquez fueron escritos y publicados entre 1947 y 1955, aunque, como libro, Ojos de perro azul no aparecería hasta 1974 cuando el escritor ya había publicado otros dos libros de relatos y cuatro novelas, de las que la última, \"Cien años de soledad\", le proporcionaría su primer gran éxito internacional.", "En este libro se incluye su primer cuento célebre, el \"Monólogo de Isabel viendo llover en Macondo\", escenario de sus obras posteriores. El personaje de Isabel reaparecerá en su primera novela, y el tema de la lluvia cayendo interminablemente, en su personal versión del diluvio universal, acabaría integrándose suave y flexiblemente en \"Cien años de soledad\". Este relato, incluido en todas las antologías del cuento latinoamericano de nuestros días, fue la primera piedra de ese gigantesco edificio, tan imaginario como real, que terminaría fundando el espacio literario más poderoso de las letras universales de nuestro tiempo: Macondo."], "author": "Gabriel García Márquez", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2006-02-07 00:00:00", "ISBN": "0307350517"},
{"url": "https://www.goodreads.com/book/show/44055.The_Heights_of_Macchu_Picchu", "num_ratings": "752", "num_reviews": "60", "avg_ratings": 4.17, "genres": ["Travel", "European Literature", "Spanish Literature", "Poetry", "Cultural", "Latin American"], "title": "The Heights of Macchu Picchu", "description": [" is the finest and most famous of Neruda's longer poems and provides the key to his earlier work. It was inspired by his journey to Macchu Picchu, the Peruvian Inca city high in the Andes. Neruda's journey takes on all the symbolic qualities of a personal \"venture into the interior\" as the poem progresses, exploring both the roots of the poet's", " is the finest and most famous of Neruda's longer poems and provides the key to his earlier work. It was inspired by his journey to Macchu Picchu, the Peruvian Inca city high in the Andes. Neruda's journey takes on all the symbolic qualities of a personal \"venture into the interior\" as the poem progresses, exploring both the roots of the poet's identity and the history of Latin America. This translation has been rendered by the distinquished poet Nathaniel Tarn and is presented in a bilingual edition, with the Spanish and English texts on facing pages."], "author": "Pablo Neruda", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1967-01-01 00:00:00", "ISBN": "0374506485"},
{"url": "https://www.goodreads.com/book/show/3300.In_s_of_My_Soul", "num_ratings": "18,884", "num_reviews": "1,563", "avg_ratings": 3.91, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "Inés of My Soul", "description": ["Born into a poor family in Spain, Inés, a seamstress, finds herself condemned to a life of hard work without reward or hope for the future. It is the sixteenth century, the beginning of the Spanish conquest of the Americas, and when her shiftless husband disappears to the New World, Inés uses the opportunity to search for him as an excuse to flee her stifling homeland and", "Born into a poor family in Spain, Inés, a seamstress, finds herself condemned to a life of hard work without reward or hope for the future. It is the sixteenth century, the beginning of the Spanish conquest of the Americas, and when her shiftless husband disappears to the New World, Inés uses the opportunity to search for him as an excuse to flee her stifling homeland and seek adventure. After her treacherous journey takes her to Peru, she learns that her husband has died in battle. Soon she begins a fiery love affair with a man who will change the course of her life: Pedro de Valdivia, war hero and field marshal to the famed Francisco Pizarro.", "Valdivia's dream is to succeed where other Spaniards have failed: to become the conquerer of Chile. The natives of Chile are fearsome warriors, and the land is rumored to be barren of gold, but this suits Valdivia, who seeks only honor and glory. Together the lovers Inés Suárez and Pedro de Valdivia will build the new city of Santiago, and they will wage a bloody, ruthless war against the indigenous Chileans—the fierce local Indians led by the chief Michimalonko, and the even fiercer Mapuche from the south. The horrific struggle will change them forever, pulling each of them toward their separate destinies.", " is a work of breathtaking scope: meticulously researched, it engagingly dramatizes the known events of Inés Suárez's life, crafting them into a novel full of the narrative brilliance and passion readers have come to expect from Isabel Allende."], "author": "Isabel Allende", "num_pages": "321", "awards": [], "places": ["Peru (Perú)", "Chile"], "character_names": ["اينس سوارس"], "language": "English", "publish_date": "2006-11-07 00:00:00", "ISBN": "0061161535"},
{"url": "https://www.goodreads.com/book/show/112148.Always_Running", "num_ratings": "5,775", "num_reviews": "704", "avg_ratings": 4.03, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Literature", "Banned Books", "Mystery", "Crime"], "title": "Always Running", "description": ["The award-winning and bestselling classic memoir about a young Chicano gang member surviving the dangerous streets of East Los Angeles, now featuring a new introduction by the author.", "Winner of the Carl Sandburg Literary Award, hailed as a ", " notable book, and read by hundreds of thousands, ", " is the searing true story of one man’s life in a Chicano", "The award-winning and bestselling classic memoir about a young Chicano gang member surviving the dangerous streets of East Los Angeles, now featuring a new introduction by the author.", "Winner of the Carl Sandburg Literary Award, hailed as a ", " notable book, and read by hundreds of thousands, ", " is the searing true story of one man’s life in a Chicano gang—and his heroic struggle to free himself from its grip.", "By age twelve, Luis Rodriguez was a veteran of East Los Angeles gang warfare. Lured by a seemingly invincible gang culture, he witnessed countless shootings, beatings, and arrests and then watched with increasing fear as gang life claimed friends and family members. Before long, Rodriguez saw a way out of the barrio through education and the power of words and successfully broke free from years of violence and desperation. ", "Achieving success as an award-winning poet, he was sure the streets would haunt him no more—until his young son joined a gang. Rodriguez fought for his child by telling his own story in ", " a vivid memoir that explores the motivations of gang life and cautions against the death and destruction that inevitably claim its participants.", "At times heartbreakingly sad and brutal, ", " is ultimately an uplifting true story, filled with hope, insight, and a hard-earned lesson for the next generation."], "author": "Luis J. Rodríguez", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-04 00:00:00", "ISBN": "0743276914"},
{"url": "https://www.goodreads.com/book/show/5981625-the-invisible-mountain", "num_ratings": "1,343", "num_reviews": "276", "avg_ratings": 3.96, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical"], "title": "The Invisible Mountain", "description": ["From Perón's glittering Buenos Aires to the rustic hills of Rio de Janeiro, from the haven of a Montevideo butchershop to U.S. embassy halls, The Invisible Mountain celebrates a nation’s spirit, the will to survive in the most desperate of circumstances, and the fierce and complex connections between mother and daughter.", "On the first day of the century, a small town gathers", "From Perón's glittering Buenos Aires to the rustic hills of Rio de Janeiro, from the haven of a Montevideo butchershop to U.S. embassy halls, The Invisible Mountain celebrates a nation’s spirit, the will to survive in the most desperate of circumstances, and the fierce and complex connections between mother and daughter.", "On the first day of the century, a small town gathers to witness a miracle and unravel its portents: the mysterious reappearance of a lost infant, Pajarita. Later, as a young woman in the capital city—Montevideo, brimming with growth and promise—Pajarita begins a lineage of independent women. Her daughter Eva, intent on becoming a poet, overcomes an early, shattering betrayal to embark on a most unconventional path toward personal and artistic fulfillment. And Eva’s daughter Salomé, awakening to both her sensuality and political convictions amidst the violent turmoil of the late 1960s, finds herself dangerously attracted to a cadre of urban guerilla rebels. ", "From Perón's glittering Buenos Aires to the rustic hills of Rio de Janeiro, from the haven of a Montevideo butchershop to U.S. embassy halls, The Invisible Mountain celebrates a nation’s spirit, the will to survive in the most desperate of circumstances, and the fierce and complex connections between mother and daughter."], "author": "Carolina De Robertis", "num_pages": "384", "awards": [], "places": ["Uruguay"], "character_names": [], "language": "English", "publish_date": "2009-08-25 00:00:00", "ISBN": "0307271633"},
{"url": "https://www.goodreads.com/book/show/16568.The_Book_of_Imaginary_Beings", "num_ratings": "6,286", "num_reviews": "404", "avg_ratings": 4.09, "genres": ["Fantasy", "Fiction", "Fantasy", "Mythology", "Classics", "Literature", "Short Stories"], "title": "The Book of Imaginary Beings", "description": ["In a perfect pairing of talent, this volume blends twenty illustrations by Peter S?s with Jorge Luis Borges?s 1957 compilation of 116 \"strange creatures conceived through time and space by the human imagination,\" from dragons and centaurs to Lewis Carroll?s Cheshire Cat and the Morlocks of H. G. Wells?s The Time Machine. A lavish feast of exotica brought vividly to life wi", "In a perfect pairing of talent, this volume blends twenty illustrations by Peter S?s with Jorge Luis Borges?s 1957 compilation of 116 \"strange creatures conceived through time and space by the human imagination,\" from dragons and centaurs to Lewis Carroll?s Cheshire Cat and the Morlocks of H. G. Wells?s The Time Machine. A lavish feast of exotica brought vividly to life with art commissioned specifically for this volume, The Book of Imaginary Beings will delight readers of classic fantasy as well as Borges?s many admirers."], "author": "Jorge Luis Borges", "num_pages": "236", "awards": ["Tähtifantasia Award Nominee (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-26 00:00:00", "ISBN": "0143039938"},
{"url": "https://www.goodreads.com/book/show/312435.So_Far_from_God", "num_ratings": "2,967", "num_reviews": "212", "avg_ratings": 3.88, "genres": ["Fiction", "Magical Realism", "Fantasy", "Contemporary", "Novels", "Feminism", "Literature"], "title": "So Far from God", "description": ["Sofia and her fated daughters, Fe, Esperanza, Caridad, and la Loca, endure hardship and enjoy love in the sleepy New Mexico hamlet of Tome, a town teeming with marvels where the comic and the horrific, the real and the supernatural, reside."], "author": "Ana Castillo", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-17 00:00:00", "ISBN": "0393326934"},
{"url": "https://www.goodreads.com/book/show/18500112-the-offenders", "num_ratings": "21", "num_reviews": "6", "avg_ratings": 4.52, "genres": ["Childrens", "Middle Grade"], "title": "The Offenders: Saving the World, While Serving Detention!", "description": ["Bullies beware! A freak accident gives five middle school bullies super powers. But instead of being able to transform into cool super-beings, they take on the characteristics of the kids they bully. Sure their abilities may be at an all-time high, but do they really have what it takes to save their school when their self-esteem is at an all-time low? \"The Offenders is the", "Bullies beware! A freak accident gives five middle school bullies super powers. But instead of being able to transform into cool super-beings, they take on the characteristics of the kids they bully. Sure their abilities may be at an all-time high, but do they really have what it takes to save their school when their self-esteem is at an all-time low? \"The Offenders is the best use of detention since The Breakfast Club - funny, exciting, and the most charming thing I've read in ages. Writing something entertaining is tough, but writing something important is even tougher. Jerry and his boys have made it look easy.\" - Drew Pearce, writer of Iron Man 3"], "author": "Jerry Craft", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-22 00:00:00", "ISBN": "0979613272"},
{"url": "https://www.goodreads.com/book/show/94351.Death_in_the_Andes", "num_ratings": "5,011", "num_reviews": "436", "avg_ratings": 3.68, "genres": ["Fiction", "Cultural", "Latin American", "European Literature", "Spanish Literature"], "title": "Death in the Andes", "description": ["In an isolated community in the Peruvian Andes, a series of mysterious disappearances has occurred. Army corporal Lituma and his deputy Tom�s believe the Shining Path guerrillas are responsible, but the townspeople have their own ideas about the forces that claimed the bodies of the missing men. This riveting novel is filled with unforgettable characters, among them disenf", "In an isolated community in the Peruvian Andes, a series of mysterious disappearances has occurred. Army corporal Lituma and his deputy Tom�s believe the Shining Path guerrillas are responsible, but the townspeople have their own ideas about the forces that claimed the bodies of the missing men. This riveting novel is filled with unforgettable characters, among them disenfranchised Indians, eccentric local folk, and a couple performing strange cannibalistic sacrifices. As the investigation progresses, Tom�s entertains Lituma with the surreal tale of a precarious love affair.", " is both a fascinating detective novel and an insightful political allegory. Mario Vargas Llosa offers a panoramic view of Peruvian society, from the recent social upheaval to the cultural influences in its past."], "author": "Mario Vargas Llosa", "num_pages": "322", "awards": ["Premio Planeta (1993)", "Premio San Clemente for Novela Castelá (1995)"], "places": [], "character_names": ["Tomás Carreño", "Corporal Lituma"], "language": "English", "publish_date": "1996-08-16 00:00:00", "ISBN": "057117549X"},
{"url": "https://www.goodreads.com/book/show/53930.Los_jefes_y_Los_cachorros", "num_ratings": "2,173", "num_reviews": "149", "avg_ratings": 3.5, "genres": ["Short Stories", "Fiction", "Literature", "Latin American Literature", "European Literature", "Spanish Literature", "Literature", "Nobel Prize", "Cultural", "Latin American", "Literature", "20th Century", "Adult Fiction", "Novels"], "title": "Los jefes y Los cachorros", "description": ["Los Jefes y Los cachorros sirvieron como antecedente, para la construcción de las obras de Vargas Llosa. Muchos de los elementos técnicos y narrativos que caracterizan la prosa del gran escritor peruano ya aparecen en estas primeras piezas breves: el espacio exterior, por ejemplo, que tiende a ser reducido y opresivo, describe un universo carente de equilibrio o armonía qu", "Los Jefes y Los cachorros sirvieron como antecedente, para la construcción de las obras de Vargas Llosa. Muchos de los elementos técnicos y narrativos que caracterizan la prosa del gran escritor peruano ya aparecen en estas primeras piezas breves: el espacio exterior, por ejemplo, que tiende a ser reducido y opresivo, describe un universo carente de equilibrio o armonía que en demasiadas ocasiones conduce a la fustración. Ese espacio obliga a personajes -adolescentes sobre todo- a ofrecer una máscara, fruto de la acomodación a las normas sociales, que impide la autenticidad. Sin embargo, en un nivel más íntimo, aflora la cara mas sincera, la verdad de las existencias individuales, que choca con la otra superficie y crea una tensión insoportable. De este modo, tanto las pequeñas historias que aparecen en Los jefes como novela corta Los cachorros nos introducen en el mundo sugestivo que Vargas Llosa ha sabido crear y desarrollar desde hace casi medio siglo y que lo ha colocado en la cima más alta de la literatura de nuestro tiempo"], "author": "Mario Vargas Llosa", "num_pages": "159", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2005-12-03 00:00:00", "ISBN": "842044300X"},
{"url": "https://www.goodreads.com/book/show/73723.The_President", "num_ratings": "2,759", "num_reviews": "190", "avg_ratings": 3.99, "genres": ["Fiction", "European Literature", "Spanish Literature", "Cultural", "Latin American", "Classics"], "title": "The President", "description": ["Guatemalan diplomat and writer Miguel Angel Asturias (1899–1974) began this award-winning work while still a law student. It is a story of a ruthless dictator and his schemes to dispose of a political adversary in an unnamed Latin American country usually identified as Guatemala. The book has been acclaimed for portraying both a totalitarian government and its damaging psy", "Guatemalan diplomat and writer Miguel Angel Asturias (1899–1974) began this award-winning work while still a law student. It is a story of a ruthless dictator and his schemes to dispose of a political adversary in an unnamed Latin American country usually identified as Guatemala. The book has been acclaimed for portraying both a totalitarian government and its damaging psychological effects. Drawing from his experiences as a journalist writing under repressive conditions, Asturias employs such literary devices as satire to convey the government’s transgressions and surrealistic dream sequences to demonstrate the police state’s impact on the individual psyche. Asturias’s stance against all forms of injustice in Guatemala caused critics to view the author as a compassionate spokesperson for the oppressed. My work,” Asturias promised when he accepted the Nobel Prize for Literature, “will continue to reflect the voice of the people, gathering their myths and popular beliefs and at the same time seeking to give birth to a universal consciousness of Latin American problems.”"], "author": "Miguel Ángel Asturias", "num_pages": "286", "awards": ["Prix du Meilleur Livre Étranger for Roman (1950)"], "places": ["Guatemala"], "character_names": [], "language": "English", "publish_date": "1997-09-01 00:00:00", "ISBN": "0881339512"},
{"url": "https://www.goodreads.com/book/show/888423.Rosaura_a_las_diez", "num_ratings": "1,976", "num_reviews": "99", "avg_ratings": 3.72, "genres": ["Mystery", "European Literature", "Spanish Literature", "Classics", "Fiction"], "title": "Rosaura a las diez", "description": ["In Rosaura a las diez,published in 1956 by the Argentine Marco ", "Denevi and winner of the Premio Kraft, the mystery surrounds the sudden appearance of a young woman in the life of a lonely middle-aged portrait painter named Camilo Canegato. When this woman is murdered and Camilo is accused of the homicide, the mystery takes on bizarre proportions. The gradual unfolding of th", "In Rosaura a las diez,published in 1956 by the Argentine Marco ", "Denevi and winner of the Premio Kraft, the mystery surrounds the sud­den appearance of a young woman in the life of a lonely middle-aged portrait painter named Camilo Canegato. When this woman is murdered and Camilo is accused of the homicide, the mystery takes on bizarre proportions. The gradual un­folding of the mystery involves the reader intellectually, but also holds him captive to the special interests of several narrators. And the unravel­ling and ultimate resolution of the mystery permit the reader to be gratified that his efforts at following the narrative carefully have finally been rewarded."], "author": "Marco Denevi", "num_pages": "240", "awards": ["Premio Kraft (1955)"], "places": [], "character_names": [], "language": "English", "publish_date": "1964-01-12 00:00:00", "ISBN": "0137832346"},
{"url": "https://www.goodreads.com/book/show/59425.Los_a_os_con_Laura_D_az", "num_ratings": "999", "num_reviews": "67", "avg_ratings": 3.78, "genres": ["Fiction", "Cultural", "Latin American", "Historical", "Historical Fiction"], "title": "Los años con Laura Díaz", "description": ["Laura Diaz is a passionate character, intimately connected to many historical events. Through her story, Fuentes writes the journal of the Mexican twentieth century, supporting his novel with facts and characters that define the shape of today's Mexico."], "author": "Carlos Fuentes", "num_pages": "648", "awards": ["Premio letterario Giuseppe Acerbi (2004)", "Kiriyama Prize Nominee for Fiction (2000)", "International DUBLIN Literary Award Nominee (2002)"], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2002-08-01 00:00:00", "ISBN": "8466303456"},
{"url": "https://www.goodreads.com/book/show/1427.The_Zahir", "num_ratings": "60,490", "num_reviews": "2,927", "avg_ratings": 3.57, "genres": ["Fiction", "Philosophy", "Novels"], "title": "The Zahir", "description": ["The narrator of  ", "  is a bestselling novelist who lives in Paris and enjoys all the privileges money and celebrity bring. His wife of ten years, Esther, is a war correspondent who has disappeared along with a friend, Mikhail, who may or may not be her lover.", "Was Esther kidnapped, murdered, or did she simply escape a marriage that left her unfulfilled? The narrator d", "The narrator of  ", "  is a bestselling novelist who lives in Paris and enjoys all the privileges money and celebrity bring. His wife of ten years, Esther, is a war correspondent who has disappeared along with a friend, Mikhail, who may or may not be her lover.", "Was Esther kidnapped, murdered, or did she simply escape a marriage that left her unfulfilled? The narrator doesn’t have any answers, but he has plenty of questions of his own. Then one day Mikhail finds the narrator and promises to reunite him with his wife. In his attempt to recapture a lost love, the narrator discovers something unexpected about himself."], "author": "Paulo Coelho", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-03 00:00:00", "ISBN": "0060832819"},
{"url": "https://www.goodreads.com/book/show/12000020-aristotle-and-dante-discover-the-secrets-of-the-universe", "num_ratings": "159,127", "num_reviews": "23,968", "avg_ratings": 4.35, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "Aristotle and Dante Discover the Secrets of the Universe", "description": ["Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this fr", "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be."], "author": "Benjamin Alire Sáenz", "num_pages": "359", "awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2013)", "Michael L. Printz Award Nominee (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2015)", "Lambda Literary Award for LGBT Children's/Young Adult (2013)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2015)", "Amelia Elizabeth Walden Award Nominee (2013)", "Lincoln Award Nominee (2016)", "Pura Belpré Award for Narrative (2013)", "Les Incorruptibles (2017)"], "places": ["El Paso, Texas", "Texas"], "character_names": ["Aristotle \"Ari\" Mendoza", "Dante Quintana"], "language": "English", "publish_date": "2012-02-21 00:00:00", "ISBN": "1442408928"},
{"url": "https://www.goodreads.com/book/show/778431.Obras_completas", "num_ratings": "126", "num_reviews": "4", "avg_ratings": 4.28, "genres": ["Poetry", "Classics", "Literature", "Latin American Literature", "European Literature", "Spanish Literature"], "title": "Obras completas", "description": ["La presente colección de obras es ofrecida en homenaje a la memoria de la Cruz, por su categoría tanto de poeta como de prosista. ", "Leída y admirada mientras vivió, es una autora, predilecta en nuestros días, a quien mejor se puede apreciar cuando se conoce más sobre su vida.", "La poesía fue para ella medio, no fin. Su afán de conocimiento, que incluyó las matemáticas, la condu", "La presente colección de obras es ofrecida en homenaje a la memoria de la Cruz, por su categoría tanto de poeta como de prosista. ", "Leída y admirada mientras vivió, es una autora, predilecta en nuestros días, a quien mejor se puede apreciar cuando se conoce más sobre su vida.", "La poesía fue para ella medio, no fin. Su afán de conocimiento, que incluyó las matemáticas, la conducía hacia profundos horizontes filósoficos, ansiosamente buscados por ella en sus lecturas, aunque no desdeñaba tocar temas concretos, humildes, tomados de la vida monjil, y hacía menudas observaciones cotidianas. ", "Todo aquel que desee estudiar la obra de Sor Juan y conocer sus escritos, los encontrará ahora completos aquí, reproducidos con la mayor fidelidad en un tomo que permite consultarlos fácilmente."], "author": "Juana Inés de la Cruz", "num_pages": "941", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "1969-08-16 00:00:00", "ISBN": "9684326505"},
{"url": "https://www.goodreads.com/book/show/19065420-la-os-fortes-e-decis-es-dif-ceis", "num_ratings": "15", "num_reviews": "0", "avg_ratings": 4.73, "genres": [], "title": "Laços fortes e decisões difíceis", "description": ["Saiu disparada, batendo com a porta, pôs os óculos de sol e entrou na rua debaixo de um abrasador calor de agosto. Agosto no centro de Manhattan! Nova Iorque! Mas Nova Iorque é Nova Iorque, naquele calor ou noutro, é sempre New York City.", "Só que ela nem o calor conseguia sentir. Sentia-se como que anestesiada pela discussão que acabara de ter. Parecia-lhe agora que a sua vi", "Saiu disparada, batendo com a porta, pôs os óculos de sol e entrou na rua debaixo de um abrasador calor de agosto. Agosto no centro de Manhattan! Nova Iorque! Mas Nova Iorque é Nova Iorque, naquele calor ou noutro, é sempre New York City.", "Só que ela nem o calor conseguia sentir. Sentia-se como que anestesiada pela discussão que acabara de ter. Parecia-lhe agora que a sua vinda a Nova Iorque fora um profundo erro. ", "Mas afinal do que é que estava à espera? Questionou-se. Saíra da sua terra natal, atravessara o oceano Atlântico na esperança de encontrar a sua", "mãe biológica, aquela que a trouxera ao mundo, sangue do seu sangue. Mas aquela discussão acabava agora com todas as expectativas. Todas!"], "author": "Graça Jacinto", "num_pages": "415", "awards": [], "places": [], "character_names": [], "language": "Portuguese", "publish_date": "2012-11-16 00:00:00", "ISBN": "9789898541"},
{"url": "https://www.goodreads.com/book/show/53926.Travesuras_de_la_ni_a_mala", "num_ratings": "21,994", "num_reviews": "1,697", "avg_ratings": 4.05, "genres": ["Fiction", "Romance", "Novels", "Cultural", "Latin American"], "title": "Travesuras de la niña mala", "description": ["Ricardo ve cumplido, a una edad muy temprana, el sueño que en su Lima natal alimentó desde que tenía uso de razón: vivir en París. Pero el rencuentro con un amor de adolescencia lo cambiará todo. La joven, inconformista, aventurera, pragmática e inquieta, lo arrastrará fuera del pequeño mundo de sus ambiciones.", "Testigos de épocas convul", "Ricardo ve cumplido, a una edad muy temprana, el sueño que en su Lima natal alimentó desde que tenía uso de razón: vivir en París. Pero el rencuentro con un amor de adolescencia lo cambiará todo. La joven, inconformista, aventurera, pragmática e inquieta, lo arrastrará fuera del pequeño mundo de sus ambiciones.", "Testigos de épocas convulsas y florecientes en ciudades como Londres, París, Tokio o Madrid, que aquí son mucho más que escenarios, ambos personajes verán sus vidas entrelazarse sin llegar a coincidir del todo. Sin embargo, esta danza de encuentros y desencuentros hará crecer la intensidad del relato página a página hasta propiciar una verdadera fusión del lector con el universo emocional de los protagonistas.", "Creando una admirable tensión entre lo cómico y lo trágico, Mario Vargas Llosa juega en Travesuras de la niña mala (2006) con la realidad y la ficción para liberar una historia en la que el amor se nos muestra indefinible, dueño de mil caras, como la niña mala. Pasión y distancia, azar y destino, dolor y disfrute... ¿Cuál es el verdadero rostro del amor?"], "author": "Mario Vargas Llosa", "num_pages": "384", "awards": [], "places": [], "character_names": ["Ricardo Somocurcio", "La niña mala", "Paúl", "Juan Barreto", "Los Gravoski"], "language": "Spanish", "publish_date": "2006-05-30 00:00:00", "ISBN": "9707704667"},
{"url": "https://www.goodreads.com/book/show/382975.The_Obscene_Bird_of_Night", "num_ratings": "1,777", "num_reviews": "165", "avg_ratings": 4.14, "genres": ["Fiction", "Magical Realism", "Cultural", "Latin American", "Novels"], "title": "The Obscene Bird of Night", "description": ["This haunting jungle of a novel has been hailed as “a masterpiece” by Luis Bunuel and “one of the great novels not only of Spanish America, but of our time” by Carlos Fuentes. The story of the last member of the aristocratic Azcoitia family, a monstrous mutation protected from the knowledge of his deformity by being surrounded with other freaks as companions, The Obscene B", "This haunting jungle of a novel has been hailed as “a masterpiece” by Luis Bunuel and “one of the great novels not only of Spanish America, but of our time” by Carlos Fuentes. The story of the last member of the aristocratic Azcoitia family, a monstrous mutation protected from the knowledge of his deformity by being surrounded with other freaks as companions, The Obscene Bird of Night is a triumph of imaginative, visionary writing. Its luxuriance, fecundity, horror, and energy will not soon fade from the reader’s mind.", "The story is like a great puzzle . . . invested with a vibrant, almost tangible reality.", "—The New York Times", "Although many of the other “boom” writers may have received more attention—especially Fuentes and Vargas Llosa—Donoso and his masterpiece may be the most lasting, visionary, strangest of the books from this time period. Seriously, it’s a novel about the last member of an aristocratic family, a monstrous mutant, who is surrounded by other freaks so as to not feel out of place.", "—Publishers Weekly", "Nicola Barker has said: ", "\"I'm no expert on the topic of South American literature (in fact I'm a dunce), but I have reason to believe (after diligently scouring the internet) that Chile's Jose Donoso, while a very highly regarded author on home turf, is little known on this side of the Atlantic. His masterpiece is the fabulously entitled The Obscene Bird of Night. It would be a crass understatement to say that this book is a challenging read; it's totally and unapologetically psychotic. It's also insanely gothic, brilliantly engaging, exquisitely written, filthy, sick, terrifying, supremely perplexing, and somehow connives to make the brave reader feel like a tiny, sleeping gnat being sucked down a fabulously kaleidoscopic dream plughole.\""], "author": "José Donoso", "num_pages": "438", "awards": ["PEN Translation Prize for Hardie St. Martin & Leonard Mades (1974)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-06-30 00:00:00", "ISBN": "1567920462"},
{"url": "https://www.goodreads.com/book/show/286843.Yo_", "num_ratings": "4,009", "num_reviews": "177", "avg_ratings": 3.78, "genres": ["Fiction", "Novels"], "title": "Yo!", "description": ["At last! A zesty, exuberant follow-up to the wildly popular How the Garcia Girls Lost Their Accents, full of Julia Alvarez's keen observations and tender affection for her characters.", "The Garcia Girls are back, most notably Yolanda, or Yo, who has grown up to be a writer. In the process, she has managed to get kicked out of college, break more than a few hearts, have her ow", "At last! A zesty, exuberant follow-up to the wildly popular How the Garcia Girls Lost Their Accents, full of Julia Alvarez's keen observations and tender affection for her characters.", "The Garcia Girls are back, most notably Yolanda, or Yo, who has grown up to be a writer. In the process, she has managed to get kicked out of college, break more than a few hearts, have her own heart broken many times, return for extended visits to the Dominican Republic her family fled when she was a child, and marry three times. She has also infuriated her entire family by publishing the intimate details of their lives as fiction.", "This brilliant novel is a full and true exploration of a woman's soul, a meditation on the writing life, and a lyrical account of the immigrant's search for identity and a place in the world. !Yo!'s bright colors, zesty dialogue, warm feeling, and genuine insight could only come from the palette of Julia Alvarez.", "Description from Penguin Group."], "author": "Julia Alvarez", "num_pages": "309", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-01 00:00:00", "ISBN": "1565121570"},
{"url": "https://www.goodreads.com/book/show/53979.Who_Killed_Palomino_Molero_", "num_ratings": "3,746", "num_reviews": "314", "avg_ratings": 3.53, "genres": ["Mystery", "Cultural", "Latin American", "Novels", "Fiction", "Nobel Prize", "Mystery", "Detective", "Literature", "Literary Fiction", "European Literature", "Spanish Literature", "Thriller", "Mystery Thriller"], "title": "Who Killed Palomino Molero?", "author": "Mario Vargas Llosa", "num_pages": "160", "awards": ["Ars Translationis (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "1998-06-24 00:00:00", "ISBN": "0374525560"},
{"url": "https://www.goodreads.com/book/show/11702.The_Labyrinth_of_Solitude_and_Other_Writings", "num_ratings": "6,216", "num_reviews": "240", "avg_ratings": 4.19, "genres": ["Nonfiction", "Writing", "Essays", "History", "European Literature", "Spanish Literature"], "title": "The Labyrinth of Solitude and Other Writings", "description": ["Octavio Paz has long been acknowledged as Mexico's foremost writer and critic. In this international classic, Paz has written one of the most enduring and powerful works ever created on Mexico and its people, character, and culture. Compared to Ortega y Gasset's The Revolt of the Masses for its trenchant analysis, this collection contains his most famous work, \"The Labyrin", "Octavio Paz has long been acknowledged as Mexico's foremost writer and critic. In this international classic, Paz has written one of the most enduring and powerful works ever created on Mexico and its people, character, and culture. Compared to Ortega y Gasset's The Revolt of the Masses for its trenchant analysis, this collection contains his most famous work, \"The Labyrinth of Solitude,\" a beautifully written and deeply felt discourse on Mexico's quest for identity that gives us an unequalled look at the country hidden behind \"the mask.\" Also included are \"The Other Mexico,\" \"Return to the Labyrinth of Solitude,\" \"Mexico and the United States,\" and \"The Philanthropic Ogre,\" all of which develop the themes of the title essay and extend his penetrating commentary to the United States and Latin America."], "author": "Octavio Paz", "num_pages": "398", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-01-12 00:00:00", "ISBN": "080215042X"},
{"url": "https://www.goodreads.com/book/show/965154.Platero_y_yo", "num_ratings": "5,241", "num_reviews": "270", "avg_ratings": 3.77, "genres": ["Poetry", "Classics", "European Literature", "Spanish Literature", "Fiction", "Cultural", "Spain"], "title": "Platero y yo", "description": ["Juan Ramón Jiménez escribe Platero y yo al volver a su pueblo natal, Moguer, después de haber pasado unos años en Madrid. A su regreso, Juan Ramón se encuentra en un estado de salud delicado y su familia atraviesa una mala situación económica tras la muerte de su padre.La visión de un Moguer deteriorado hace que Juan Ramón se distancie de la gente del pueblo y se desilusio", "Juan Ramón Jiménez escribe Platero y yo al volver a su pueblo natal, Moguer, después de haber pasado unos años en Madrid. A su regreso, Juan Ramón se encuentra en un estado de salud delicado y su familia atraviesa una mala situación económica tras la muerte de su padre.La visión de un Moguer deteriorado hace que Juan Ramón se distancie de la gente del pueblo y se desilusione. Atrás quedó el Moguer de su infancia. En su aislamiento, encuentra la comunicación deseada con Platero, el destinatario de sus pensamientos. Platero será el objeto de la exteriorización poética de Juan Ramón, el ser que le mueve a la manifestación lírica, y quien parece entender todo loque nombra el poeta. Sólo con Platero puede compartir su mundo interior, su alma de poeta.Este personaje creado por Juan Ramón, no es un burro concreto, pues como él mismo dice: En realidad, mi Platero no es un solo burro, sino varios, una síntesis de burros plateros. Yo tuve de muchacho y de joven varios. Todos eran plateros."], "author": "Juan Ramón Jiménez", "num_pages": "47", "awards": [], "places": [], "character_names": ["Platero"], "language": "Spanish", "publish_date": "1994-04-18 00:00:00", "ISBN": "0395623650"},
{"url": "https://www.goodreads.com/book/show/491735.The_Dirty_Girls_Social_Club", "num_ratings": "12,008", "num_reviews": "706", "avg_ratings": 3.46, "genres": ["Womens Fiction", "Chick Lit", "Fiction"], "title": "The Dirty Girls Social Club", "description": ["Inseparable since their days at Boston University almost ten years before, six friends form the Dirty Girls Social Club, a mutual support and (mostly) admiration society that no matter what happens to each of them (and a lot does), meets regularly to dish, dine and compare notes on the bumpy course of life and love.", "Las sucias are:", "--Lauren, the resident “caliente” columnist", "Inseparable since their days at Boston University almost ten years before, six friends form the Dirty Girls Social Club, a mutual support and (mostly) admiration society that no matter what happens to each of them (and a lot does), meets regularly to dish, dine and compare notes on the bumpy course of life and love.", "Las sucias are:", "--Lauren, the resident “caliente” columnist for the local paper, which advertises her work with the line “her casa is su casa, Boston”, but whose own home life has recently involved hiding in her boyfriend’s closet to catch him in the act", "--Sara, the perfect wife and mother who always knew exactly the life she wanted and got it, right down to the McMansion in the suburbs and two boisterious boys, but who is paying a hefty price", "--Amber, the most idealistic and artistic member of the club, who was raised a valley girl without a word of Spanish and whose increasing attachment to her Mexica roots coincides with a major record label’s interest in her rock ‘n’ roll", "--Elizabeth, the stunning black Latina whose high profile job as a morning television anchor conflicts with her intensely private personal life, which would explain why the dates the other dirty girls set her up on never work out", "--Rebecca, intense and highly controlled, who flawlessly runs Ella, the magazine she created for Latinas, but who can’t explain why she didn’t understand the man she married and now doesn’t even share a room with; and", "--Usnavys, irrepressible and larger than life, whose agenda to land the kind of man who can keep her in Manolo Blahniks and platanos almost prevents her seeing true love when it lands in her lap.", "There’s a lot of catching up to do.", "A vibrant, can’t-put-it-down novel of six friends—each one an unforgettable Latina woman in her late ‘20s—and the complications and triumphs in their lives."], "author": "Alisa Valdes", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-05-13 00:00:00", "ISBN": "0312313829"},
{"url": "https://www.goodreads.com/book/show/2363958.Grande_Sert_o", "num_ratings": "2,690", "num_reviews": "164", "avg_ratings": 4.53, "genres": ["Fiction", "Classics", "Cultural", "Brazil"], "title": "Grande Sertão: Veredas", "description": ["Lively reminiscences of bandit warfare in the sertao, the still primitive Brazilian back country, told by a wise, retired outlaw chief. ~Worldcat.org", "Grande Sertão: Veredas (Portuguese for \"Great Backlands: Tracks\"; English translation: The Devil to Pay in the Backlands) is a novel published in 1956 by the Brazilian writer João Guimarães Rosa.", "The original title refers to th", "Lively reminiscences of bandit warfare in the sertao, the still primitive Brazilian back country, told by a wise, retired outlaw chief. ~Worldcat.org", "Grande Sertão: Veredas (Portuguese for \"Great Backlands: Tracks\"; English translation: The Devil to Pay in the Backlands) is a novel published in 1956 by the Brazilian writer João Guimarães Rosa.", "The original title refers to the veredas - small paths through wetlands usually located at higher altitudes characterized by the presence of grasses and buritizais, groups of the buriti palm-tree (Mauritia flexuosa), that criss-cross the Sertão region in northern Minas Gerais, Southeast Brazil - as a labyrinthine net where an outsider can easily get lost, and where there is no single way to a certain place, since all paths interconnect in such a way that any road can lead anywhere. The English title refers to a later episode in the book involving an attempt to make a deal with the Devil. Most of the book's spirit is however lost in translation, as the Portuguese original is written in a register that is both archaic and colloquial, making it a very difficult book to translate. The combination of its size, linguistic oddness and polemic themes caused a shock when it was published, but now it is considered one of the most important novels of South American literature.", "In a 2002 poll of 100 noted writers conducted by Norwegian Book Clubs, the book was named among the top 100 books of all time."], "author": "João Guimarães Rosa", "num_pages": "624", "awards": [], "places": [], "character_names": ["Riobaldo", "Diadorim"], "language": "Portuguese", "publish_date": "2001-05-01 00:00:00", "ISBN": "8520912095"},
{"url": "https://www.goodreads.com/book/show/623851.Final_del_juego", "num_ratings": "4,073", "num_reviews": "174", "avg_ratings": 4.32, "genres": ["Short Stories", "Fiction", "European Literature", "Spanish Literature"], "title": "Final del juego", "description": ["Final del juego es una de las colecciones de cuentos más importantes de la segunda mitad del siglo XX. Empeñado en transgredir las leyes de la narrativa convencional, en estos dieciocho relatos Julio Cortázar combina la intertextualidad, un uso inédito de lo coloquial y el juego interminable para hacer entrar al lector en un particularísimo universo donde nada es lo que pa", "Final del juego es una de las colecciones de cuentos más importantes de la segunda mitad del siglo XX. Empeñado en transgredir las leyes de la narrativa convencional, en estos dieciocho relatos Julio Cortázar combina la intertextualidad, un uso inédito de lo coloquial y el juego interminable para hacer entrar al lector en un particularísimo universo donde nada es lo que parece. No se trata de simple literatura: a lo que nos invita el autor argentino es a sospechar de la seriedad y el racionalismo crédulo de nuestro mundo. «Continuidad de los parques», «Los venenos», «Axolotl» o «La noche boca arriba» son algunos de los míticos relatos que componen este imprescindible volumen."], "author": "Julio Cortázar", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2004-10-01 00:00:00", "ISBN": "8466311807"},
{"url": "https://www.goodreads.com/book/show/7005479-island-beneath-the-sea", "num_ratings": "27,377", "num_reviews": "2,830", "avg_ratings": 4.03, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Magical Realism"], "title": "Island Beneath the Sea", "description": [" ", " ", " ", "Translated from the Spanish by Margaret Sayers Peden."], "author": "Isabel Allende", "num_pages": "457", "awards": [], "places": ["Saint-Domingue"], "character_names": ["Jean Lafitte", "Zarité Sedella", "Toulouse Valmorain", "Violette Boisier", "Sancho García del Solar", "Maurice Valmorain", "Rosette Sedella", "Tante Rose", "Dr. Parmentier", "Loula"], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "0061988243"},
{"url": "https://www.goodreads.com/book/show/3018539-death-with-interruptions", "num_ratings": "26,111", "num_reviews": "2,763", "avg_ratings": 3.98, "genres": ["Fiction", "Fantasy", "Magical Realism", "Novels", "Cultural", "Portugal", "Literature"], "title": "Death with Interruptions", "description": ["Nobel Prize-winner Jose Saramago's brilliant new novel poses the question what happens when the grim reaper decides there will be no more death? On the first day of the new year, no one dies. This, of course, causes consternation among politicians, religious leaders, morticians, and doctors. Among the general public, on the other hand, there is initially celebration. Flags", "Nobel Prize-winner Jose Saramago's brilliant new novel poses the question what happens when the grim reaper decides there will be no more death? On the first day of the new year, no one dies. This, of course, causes consternation among politicians, religious leaders, morticians, and doctors. Among the general public, on the other hand, there is initially celebration. Flags are hung out on balconies; people dance in the streets. They have achieved the great goal of humanity: eternal life. Then reality hits home—families are left to care for the permanently dying; life-insurance policies become meaningless; and funeral parlors are reduced to arranging burials for pet dogs, cats, hamsters, and parrots. ", "Death sits in her chilly apartment, where she lives alone with scythe and filing cabinets and contemplates her experiment: What if no one ever died again? What if she, death with a small \"d,\" became human and were to fall in love?"], "author": "José Saramago", "num_pages": "238", "awards": ["BTBA Best Translated Book Award Nominee for Fiction Longlist (2009)", "Tähtifantasia Award Nominee (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-10-06 00:00:00", "ISBN": "0151012741"},
{"url": "https://www.goodreads.com/book/show/14345.Rain_of_Gold", "num_ratings": "5,892", "num_reviews": "639", "avg_ratings": 4.48, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism"], "title": "Rain of Gold", "description": ["In ", ", Victor Villasenor weaves the parallel stories of two families and two countries…bringing us the timeless romance between the volatile bootlegger who would become his father and the beautiful Lupe, his mother–men and women in whose lives the real and the fantastical exist side by side…and in whose hearts the spirit to survive is fueled by a family’s uncondi", "In ", ", Victor Villasenor weaves the parallel stories of two families and two countries…bringing us the timeless romance between the volatile bootlegger who would become his father and the beautiful Lupe, his mother–men and women in whose lives the real and the fantastical exist side by side…and in whose hearts the spirit to survive is fueled by a family’s unconditional love."], "author": "Victor Villaseñor", "num_pages": "576", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-09-01 00:00:00", "ISBN": "038531177X"},
{"url": "https://www.goodreads.com/book/show/105189.The_Story_of_a_Shipwrecked_Sailor", "num_ratings": "13,380", "num_reviews": "783", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "European Literature", "Spanish Literature", "Literature"], "title": "The Story of a Shipwrecked Sailor", "description": ["This is Marquez's account of a real-life event. In 1955, eight crew members of the destroyer Caldas, were swept into the Caribbean Sea. The sole survivor, Luis Alejandro Belasco, told the true version of the events to Marquez, causing great scandal at the time."], "author": "Gabriel García Márquez", "num_pages": "106", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-02-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/822469.Pantale_n_y_las_visitadoras", "num_ratings": "6,935", "num_reviews": "303", "avg_ratings": 3.96, "genres": ["Fiction", "European Literature", "Spanish Literature", "Cultural", "Latin American", "Humor"], "title": "Pantaleón y las visitadoras", "description": ["Pantaleón Pantoja, un capitán del Ejército recientemente ascendido, recibe la misión de establecer un servicio de prostitución para las Fuerzas Armadas del Perú en el más absoluto secreto militar. Estricto cumplidor del deber que le ha sido asignado, Pantaleón se traslada a Iquitos, en plena selva, para llevar a cabo su cometido, pero se entrega a esta misión con tal obcec", "Pantaleón Pantoja, un capitán del Ejército recientemente ascendido, recibe la misión de establecer un servicio de prostitución para las Fuerzas Armadas del Perú en el más absoluto secreto militar. Estricto cumplidor del deber que le ha sido asignado, Pantaleón se traslada a Iquitos, en plena selva, para llevar a cabo su cometido, pero se entrega a esta misión con tal obcecación que termina por poner en peligro el engranaje que él mismo ha puesto en movimiento. ", "Así arranca la novela de Mario Vargas Llosa ", ", publicada en 1973 y llevada posteriormente al cine. ", "Mario Vargas Llosa utiliza está anécdota para subrayar la hipocresía de las instituciones que se llaman ejemplares en relación con el oficio más viejo del mundo."], "author": "Mario Vargas Llosa", "num_pages": "392", "awards": [], "places": ["Iquitos", "Peru (Perú)"], "character_names": [], "language": "Spanish", "publish_date": "2000-08-16 00:00:00", "ISBN": "8495501023"},
{"url": "https://www.goodreads.com/book/show/87264.Mem_rias_P_stumas_de_Br_s_Cubas", "num_ratings": "12,199", "num_reviews": "485", "avg_ratings": 4.23, "genres": ["Fiction", "Classics", "Cultural", "Brazil"], "title": "Memórias Póstumas de Brás Cubas", "description": ["A publicação de 'Memórias Póstumas de Brás Cubas' não só inaugura o Realismo no Brasil, como inicia a etapa mais complexa da obra de Machado de Assis. Com ela, aprofunda-se a sua análise da realidade e refina-se a sua linguagem, sendo considerada a obra que prenuncia algumas técnicas da literatura moderna."], "author": "Machado de Assis", "num_pages": "165", "awards": [], "places": ["Rio de Janeiro"], "character_names": ["Brás Cubas", "Virgília", "Lobo Neves", "Quincas Borba"], "language": "Portuguese", "publish_date": "2005-01-31 00:00:00", "ISBN": "0850515025"},
{"url": "https://www.goodreads.com/book/show/59503.The_Lost_Steps", "num_ratings": "2,144", "num_reviews": "162", "avg_ratings": 3.94, "genres": ["Fiction", "European Literature", "Spanish Literature"], "title": "The Lost Steps", "description": ["A composer, fleeing an empty existence in New York City, takes a journey with his mistress to one of the few remaining areas of the world not yet touched by civilization-the upper reaches of a great South American river. ", " describes his search, his adventures, and the remarkable decision he makes in a village that seems to be truly outside history."], "author": "Alejo Carpentier", "num_pages": "296", "awards": ["Prix du Meilleur Livre Étranger for Roman (1956)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-13 00:00:00", "ISBN": "0816638071"},
{"url": "https://www.goodreads.com/book/show/19250523-the-skinwalker-s-apprentice", "num_ratings": "82", "num_reviews": "21", "avg_ratings": 4.18, "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal"], "title": "The Skinwalker's Apprentice", "description": ["-out of print-", "Welcome to The Empire State, where banshees, witches, and skinwalkers wait…” Margo Pennyfeather is being hunted. The 16-year-old witch has always been an outcast, in her home back in England, and now in the village of East Hampton, New York, where her family has settled. No one but her family has ever cared for Margo, but now the most important witch in the m", "-out of print-", "Welcome to The Empire State, where banshees, witches, and skinwalkers wait…” Margo Pennyfeather is being hunted. The 16-year-old witch has always been an outcast, in her home back in England, and now in the village of East Hampton, New York, where her family has settled. No one but her family has ever cared for Margo, but now the most important witch in the magic world wants her as an apprentice, giving her a chance to bring her family out of poverty. Before long, Margo realizes things aren't what they seem, least of all, what kind of witch she really is. Now, the young witch must face a terrifying monster on her own, and the reverberations will reach farther than she could have ever imagined. More than three hundred years later, in 1984 Emerald Kipp is a high school senior in New York City. A troubled teen with a rebellious streak, Emerald can't seem to figure out what to do with her life, and unfortunately for her, “witch” isn’t one of the available career choices in her guidance counselor’s office. As she struggles to figure herself out, Emerald is faced with the threat of being stuck in school and missing her final summer with her three best friends. Her last year of high school is turning out to be the worst yet, and Emerald thinks it can’t possibly get any worse. Unfortunately for her, she’s dead wrong. And there’s something else, something far more sinister stirring in Emerald’s world, and she’ll have to believe in herself if she wants to get through it alive. Two witches, three hundred years apart, one inescapable fate. The Skinwalker's Apprentice is a companion novella l to the upcoming novel, Emerald Kipp and The Riddle of The Timekeeper, a terrifying magical scavenger hunt through the gritty streets of 1980’s New York City,set to a killer soundtrack"], "author": "Claribel Ortega", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/53931.The_Storyteller", "num_ratings": "3,318", "num_reviews": "284", "avg_ratings": 3.71, "genres": ["Fiction", "European Literature", "Spanish Literature", "Literature", "Cultural", "Latin American"], "title": "The Storyteller", "author": "Mario Vargas Llosa", "num_pages": "245", "awards": [], "places": ["Peru (Perú)"], "character_names": [], "language": "English", "publish_date": "2001-11-03 00:00:00", "ISBN": "0312420285"},
{"url": "https://www.goodreads.com/book/show/53972.The_Green_House", "num_ratings": "2,795", "num_reviews": "178", "avg_ratings": 3.72, "genres": ["Fiction", "European Literature", "Spanish Literature", "Cultural", "Latin American"], "title": "The Green House", "description": ["Mario Vargas Llosa's classic early novel takes place in a Peruvian town, situated between desert and jungle, which is torn by boredom and lust. Don Anselmo, a stranger in a black coat, builds a brothel on the outskirts of the town while he charms its innocent people, setting in motion a chain reaction with extraordinary consequences.This brothel, called the Green House, br", "Mario Vargas Llosa's classic early novel takes place in a Peruvian town, situated between desert and jungle, which is torn by boredom and lust. Don Anselmo, a stranger in a black coat, builds a brothel on the outskirts of the town while he charms its innocent people, setting in motion a chain reaction with extraordinary consequences.This brothel, called the Green House, brings together the innocent and the corrupt; Bonificia, a young Indian girl saved by the nuns only to become a prostitute; Father Garcia, struggling for the church; and four best friends drawn to both excitement and escape.The conflicting forces that haunt the Green House evoke a world balanced between savagery and civilization -- and one that is cursed by not being able to discern between the two."], "author": "Mario Vargas Llosa", "num_pages": "416", "awards": ["Premio Internacional de Novela Rómulo Gallegos (1967)", "Premio de la Crítica de narrativa castellana (1967)"], "places": ["Peru (Perú)"], "character_names": ["Corporal Lituma"], "language": "English", "publish_date": "2005-02-01 00:00:00", "ISBN": "0060732792"},
{"url": "https://www.goodreads.com/book/show/53423.Cronopios_and_Famas", "num_ratings": "10,165", "num_reviews": "464", "avg_ratings": 4.28, "genres": ["Fiction", "Short Stories", "Classics", "Literature", "European Literature", "Spanish Literature"], "title": "Cronopios and Famas", "description": ["\"The Instruction Manual,\" the first chapter, is an absurd assortment of tasks and items dissected in an instruction-manual format. \"Unusual Occupations,\" the second chapter, describes the obsessions and predilections of the narrator's family, including the lodging of a tiger-just one tiger- \"for the sole purpose of seeing the mechanism at work in all its complexity.\" Final", "\"The Instruction Manual,\" the first chapter, is an absurd assortment of tasks and items dissected in an instruction-manual format. \"Unusual Occupations,\" the second chapter, describes the obsessions and predilections of the narrator's family, including the lodging of a tiger-just one tiger- \"for the sole purpose of seeing the mechanism at work in all its complexity.\" Finally, the \"Cronopios and Famas\" section delightfully characterizes, in the words of Carlos Fuentes, \"those enemies of pomposity, academic rigor mortis and cardboard celebrity-a band of literary Marx Brothers.\" As the ", " remarked; \"Each page of ", " sparkles with vivid satire that goes to the heart of human character and, in the best pieces, to the essence of the human condition.\""], "author": "Julio Cortázar", "num_pages": "162", "awards": [], "places": ["Argentina"], "character_names": [], "language": "English", "publish_date": "1999-04-17 00:00:00", "ISBN": "0811214028"},
{"url": "https://www.goodreads.com/book/show/531989.Drown", "num_ratings": "28,128", "num_reviews": "2,234", "avg_ratings": 4.05, "genres": ["Short Stories", "Fiction", "Contemporary", "Literature"], "title": "Drown", "description": ["With ten stories that move from the barrios of the Dominican Republic to the struggling urban communities of New Jersey, Junot Diaz makes his remarkable debut. Diaz's work is unflinching and strong, and these stories crackle with an electric sense of discovery. Diaz evokes a world in which fathers are gone, mothers fight with grim determination for their families and thems", "With ten stories that move from the barrios of the Dominican Republic to the struggling urban communities of New Jersey, Junot Diaz makes his remarkable debut. Diaz's work is unflinching and strong, and these stories crackle with an electric sense of discovery. Diaz evokes a world in which fathers are gone, mothers fight with grim determination for their families and themselves, and the next generation inherits the casual cruelty, devastating ambivalence, and knowing humor of lives circumscribed by poverty and uncertainty. In ", ", Diaz has harnessed the rhythms of anger and release, frustration and joy, to indelible effect."], "author": "Junot Díaz", "num_pages": "208", "awards": [], "places": ["Dominican Republic", "New Jersey"], "character_names": ["Yunior de Las Casas"], "language": "English", "publish_date": "1997-07-01 00:00:00", "ISBN": "1573226068"},
{"url": "https://www.goodreads.com/book/show/23887.The_Autumn_of_the_Patriarch", "num_ratings": "15,052", "num_reviews": "815", "avg_ratings": 3.84, "genres": ["Fiction", "Cultural", "Latin American"], "title": "The Autumn of the Patriarch", "description": ["One of Gabriel Garcia Marquez's most intricate and ambitious works, ", " is a brilliant tale of a Caribbean tyrant and the corruption of power.", "From charity to deceit, benevolence to violence, fear of God to extreme cruelty, the dictator of ", " embodies the best and the worst of human nature. Gabriel Garcia Marquez, the renowne", "One of Gabriel Garcia Marquez's most intricate and ambitious works, ", " is a brilliant tale of a Caribbean tyrant and the corruption of power.", "From charity to deceit, benevolence to violence, fear of God to extreme cruelty, the dictator of ", " embodies the best and the worst of human nature. Gabriel Garcia Marquez, the renowned master of magical realism, vividly portrays the dying tyrant caught in the prison of his own dictatorship. Employing an innovative, dreamlike style, and overflowing with symbolic descriptions, the novel transports the reader to a world that is at once fanciful and real."], "author": "Gabriel García Márquez", "num_pages": "255", "awards": ["PEN Translation Prize for Gregory Rabassa (1977)", "National Book Award Finalist for Translation (1977)", "Mikael Agricola -palkinto (1987)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-03-14 00:00:00", "ISBN": "0060882867"},
{"url": "https://www.goodreads.com/book/show/53925.The_War_of_the_End_of_the_World", "num_ratings": "6,939", "num_reviews": "549", "avg_ratings": 4.21, "genres": ["Fiction", "Historical", "Historical Fiction", "Literature", "Novels", "Cultural", "Latin American"], "title": "The War of the End of the World", "description": ["The War of the End of the World is one of the great modern historical novels. Inspired by a real episode in Brazilian history, Mario Vargas Llosa tells the story of an apocalyptic movement, led by a mysterious prophet, in which prostitutes, beggars and bandits establish Canudos, a new republic, a libertarian paradise.", "~publisher's web site"], "author": "Mario Vargas Llosa", "num_pages": "568", "awards": ["PEN Translation Prize for Prose for Helen R. Lane (1985)"], "places": ["Canudos"], "character_names": [], "language": "English", "publish_date": "1986-08-16 00:00:00", "ISBN": "0571139612"},
{"url": "https://www.goodreads.com/book/show/91289.The_Hummingbird_s_Daughter", "num_ratings": "9,143", "num_reviews": "1,359", "avg_ratings": 4.16, "genres": ["Historical", "Historical Fiction", "Fiction", "Magical Realism", "Historical"], "title": "The Hummingbird's Daughter", "description": ["The prizewinning writer Luis Alberto Urrea's long-awaited novel is an epic mystical drama of a young woman's sudden sainthood in late 19th-century Mexico.It is 1889, and civil war is brewing in Mexico. A 16-year-old girl, Teresita, illegitimate but beloved daughter of the wealthy and powerful rancher Don Tomas Urrea, wakes from the strangest dream--a dream that she has die", "The prizewinning writer Luis Alberto Urrea's long-awaited novel is an epic mystical drama of a young woman's sudden sainthood in late 19th-century Mexico.It is 1889, and civil war is brewing in Mexico. A 16-year-old girl, Teresita, illegitimate but beloved daughter of the wealthy and powerful rancher Don Tomas Urrea, wakes from the strangest dream--a dream that she has died. Only it was not a dream. This passionate and rebellious young woman has arisen from death with a power to heal--but it will take all her faith to endure the trials that await her and her family now that she has become the Saint of Cabora.", " is a vast, hugely satisfying novel of love and loss, joy and pain. Two decades in the writing, this is the masterpiece that Luis Alberto Urrea has been building up to."], "author": "Luis Alberto Urrea", "num_pages": "528", "awards": ["Kiriyama Prize for Fiction (2006)"], "places": ["Mexico"], "character_names": [], "language": "English", "publish_date": "2006-04-03 00:00:00", "ISBN": "0316154520"},
{"url": "https://www.goodreads.com/book/show/1430.Eleven_Minutes", "num_ratings": "126,843", "num_reviews": "5,878", "avg_ratings": 3.69, "genres": ["Fiction", "Romance", "Novels", "Contemporary"], "title": "Eleven Minutes", "description": [" is the story of Maria, a young girl from a Brazilian village, whose first innocent brushes with love leave her heartbroken. At a tender age, she becomes convinced that she will never find true love, instead believing that “love is a terrible thing that will make you suffer. . . .” A chance meeting in Rio takes her to Geneva, where she dreams of finding fame", " is the story of Maria, a young girl from a Brazilian village, whose first innocent brushes with love leave her heartbroken. At a tender age, she becomes convinced that she will never find true love, instead believing that “love is a terrible thing that will make you suffer. . . .” A chance meeting in Rio takes her to Geneva, where she dreams of finding fame and fortune.", "Maria’s despairing view of love is put to the test when she meets a handsome young painter. In this odyssey of self-discovery, Maria has to choose between pursuing a path of darkness—sexual pleasure for its own sake—or risking everything to find her own “inner light” and the possibility of sacred sex, sex in the context of love."], "author": "Paulo Coelho", "num_pages": "273", "awards": [], "places": ["Geneva"], "character_names": ["Mariecke", "Ralph"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0060589280"},
{"url": "https://www.goodreads.com/book/show/14362.Bless_Me_Ultima", "num_ratings": "22,681", "num_reviews": "1,952", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "Young Adult", "Magical Realism", "Academic", "School"], "title": "Bless Me, Ultima", "description": ["Antonio Marez is six years old when Ultima enters his life. She is a curandera, one who heals with herbs and magic. 'We cannot let her live her last days in loneliness,' says Antonio's mother. 'It is not the way of our people,' agrees his father. And so Ultima comes to live with Antonio's family in New Mexico. Soon Tony will journey to the threshold of manhood. Always, Ult", "Antonio Marez is six years old when Ultima enters his life. She is a curandera, one who heals with herbs and magic. 'We cannot let her live her last days in loneliness,' says Antonio's mother. 'It is not the way of our people,' agrees his father. And so Ultima comes to live with Antonio's family in New Mexico. Soon Tony will journey to the threshold of manhood. Always, Ultima watches over him. She graces him with the courage to face childhood bigotry, diabolical possession, the moral collapse of his brother, and too many violent deaths. Under her wise guidance, Tony will probe the family ties that bind him, and he will find in himself the magical secrets of the pagan past—a mythic legacy equally as palpable as the Catholicism of Latin America in which he has been schooled. At each turn in his life there is Ultima who will nurture the birth of his soul."], "author": "Rudolfo Anaya", "num_pages": "290", "awards": ["Premio Quinto Sol"], "places": ["United States of America", "New Mexico"], "character_names": ["Antonio Marez", "Ultima, la Grande", "Tenorio", "Narciso"], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "0446675369"},
{"url": "https://www.goodreads.com/book/show/294081.The_Mambo_Kings_Play_Songs_of_Love", "num_ratings": "10,634", "num_reviews": "452", "avg_ratings": 3.69, "genres": ["Fiction", "Music"], "title": "The Mambo Kings Play Songs of Love", "description": ["A Pulitzer Prize winning, bestselling sensation, Hijuelos captures in vivid and elegant prose the passion and poignancy of a world where the pulsing and rhythmic beat of the mambo imbues and fulfills dreams."], "author": "Oscar Hijuelos", "num_pages": "407", "awards": ["Pulitzer Prize for Fiction (1990)", "National Book Critics Circle Award Nominee for Fiction (1989)", "National Book Award Finalist for Fiction (1989)"], "places": ["New York City, New York", "Manhattan, New York City, New York"], "character_names": [], "language": "English", "publish_date": "1990-08-16 00:00:00", "ISBN": "0140143912"},
{"url": "https://www.goodreads.com/book/show/77092.Dreaming_in_Cuban", "num_ratings": "8,239", "num_reviews": "581", "avg_ratings": 3.69, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism"], "title": "Dreaming in Cuban", "description": ["Here is the dreamy and bittersweet story of a family divided by politics and geography by the Cuban revolution. It is the family story of Celia del Pino, and her husband, daughter and grandchildren, from the mid-1930s to 1980. Celia's story mirrors the magical realism of Cuba itself, a country of beauty and poverty, idealism and corruption. DREAMING IN CUBAN presents a uni", "Here is the dreamy and bittersweet story of a family divided by politics and geography by the Cuban revolution. It is the family story of Celia del Pino, and her husband, daughter and grandchildren, from the mid-1930s to 1980. Celia's story mirrors the magical realism of Cuba itself, a country of beauty and poverty, idealism and corruption. DREAMING IN CUBAN presents a unique vision and a haunting lamentation for a past that might have been."], "author": "Cristina García", "num_pages": "245", "awards": ["National Book Award Finalist for Fiction (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "1993-02-10 00:00:00", "ISBN": "0345381432"},
{"url": "https://www.goodreads.com/book/show/53410.Blow_Up_and_Other_Stories", "num_ratings": "5,470", "num_reviews": "263", "avg_ratings": 4.23, "genres": ["Short Stories", "Fiction", "Magical Realism", "Literature", "Cultural", "Latin American"], "title": "Blow-Up and Other Stories", "description": ["A young girl spends her summer vacation in a country house where a tiger roams . . . A man reading a mystery finds out too late that he is the murderer's victim . . . In the fifteen stories collected here—including \"Blow-Up,\" which was the basis for Michelangelo Antonioni's film of the same name—Julio Cortazar explores the boundary where the everyday meets the mysterious,", "A young girl spends her summer vacation in a country house where a tiger roams . . . A man reading a mystery finds out too late that he is the murderer's victim . . . In the fifteen stories collected here—including \"Blow-Up,\" which was the basis for Michelangelo Antonioni's film of the same name—Julio Cortazar explores the boundary where the everyday meets the mysterious, perhaps even the terrible.", "Axolotl ", "House taken over ", "Distances ", "Idol of the Cyclades ", "Letter to a young lady in Paris ", "Yellow flower ", "Continuity of parks ", "Night face up ", "Bestiary ", "Gates of heaven ", "Blow-up ", "End of the game ", "At your service ", "Pursuer ", "Secret weapons."], "author": "Julio Cortázar", "num_pages": "277", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-02-12 00:00:00", "ISBN": "0394728815"},
{"url": "https://www.goodreads.com/book/show/149196.Eva_Luna", "num_ratings": "33,247", "num_reviews": "1,095", "avg_ratings": 3.95, "genres": ["Fiction", "Magical Realism", "Historical", "Historical Fiction"], "title": "Eva Luna", "description": ["Meet New York Times bestselling author Isabel Allende’s most enchanting creation, ", ": a lover, a writer, a revolutionary, and above all a storyteller—available for the first time in ebook.", "Eva Luna is the daughter of a professor’s assistant and a snake-bitten gardener—born poor, orphaned at an early age, and working as a servant. Eva is a naturally gifted and imaginat", "Meet New York Times bestselling author Isabel Allende’s most enchanting creation, ", ": a lover, a writer, a revolutionary, and above all a storyteller—available for the first time in ebook.", "Eva Luna is the daughter of a professor’s assistant and a snake-bitten gardener—born poor, orphaned at an early age, and working as a servant. Eva is a naturally gifted and imaginative storyteller who meets people from all stations and walks of life. Though she has no wealth, she trades her stories like currency with people who are kind to her. In this novel, she shares the story of her own life and introduces readers to a diverse and eccentric cast of characters including the Lebanese émigré who befriends her and takes her in; her unfortunate godmother, whose brain is addled by rum and who believes in all the Catholic saints and a few of her own invention; a street urchin who grows into a petty criminal and, later, a leader in the guerrilla struggle; a celebrated transsexual entertainer who instructs her in the ways of the adult world; and a young refugee whose flight from postwar Europe will prove crucial to Eva's fate.", "As Eva tells her story, Isabel Allende conjures up a whole complex South American nation—the rich, the poor, the simple, and the sophisticated—in a novel replete with character and incident, with drama and comedy and history, with battles and passions, rebellions and reunions, a novel that celebrates the power of imagination to create a better world."], "author": "Isabel Allende", "num_pages": "307", "awards": ["American Book Award (1989)"], "places": ["Chile"], "character_names": ["Eva Luna", "Huberto Naranjo", "Consuelo", "Riad Hilabi", "El Negro", "La Señora", "Melesio/Mimi", "Zulema", "Rolf Carlé"], "language": "English", "publish_date": "1989-08-01 00:00:00", "ISBN": "0553280589"},
{"url": "https://www.goodreads.com/book/show/172366.The_Library_of_Babel", "num_ratings": "4,401", "num_reviews": "215", "avg_ratings": 4.47, "genres": ["Fiction", "Short Stories", "Classics", "Philosophy", "Fantasy", "Writing", "Books About Books", "Magical Realism"], "title": "The Library of Babel", "description": ["Jorge Luis Borges's famous 1941 meditation on language, alphabets, and the library that contains all knowledge is an allegory of our Universe, and in this edition is complemented and enhanced by the etching of the French artist, Érik Desmazières"], "author": "Jorge Luis Borges", "num_pages": "39", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-08-01 00:00:00", "ISBN": "156792123X"},
{"url": "https://www.goodreads.com/book/show/54016.Todos_los_fuegos_el_fuego", "num_ratings": "6,139", "num_reviews": "217", "avg_ratings": 4.3, "genres": ["Short Stories", "Fiction", "Cultural", "Latin American", "European Literature", "Spanish Literature"], "title": "Todos los fuegos el fuego", "description": ["Todos los fuegos el fuego offers eight great examples of the creative fullness that encompasses Cortazar's stories. From the exasperated metaphor of human relationships that is \"La autopista del sur\" through the masterpiece that is \"El otro cielo,\" Cortazar once again paves the way to stories that are a must-read for lovers of the story genre in general. \"La salud de los e", "Todos los fuegos el fuego offers eight great examples of the creative fullness that encompasses Cortazar's stories. From the exasperated metaphor of human relationships that is \"La autopista del sur\" through the masterpiece that is \"El otro cielo,\" Cortazar once again paves the way to stories that are a must-read for lovers of the story genre in general. \"La salud de los enfermos,\" \"Reunisn,\" \"La seqorita Cora,\" \"La isla a mediodma,\" \"Instrucciones para John Howell,\" and \"Todos los fuegos el fuego\" are a celebration of intelligence, passion, and genius."], "author": "Julio Cortázar", "num_pages": "198", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2005-06-01 00:00:00", "ISBN": "9681675940"},
{"url": "https://www.goodreads.com/book/show/53970.Conversation_in_the_Cathedral", "num_ratings": "5,270", "num_reviews": "391", "avg_ratings": 4.32, "genres": ["Fiction", "Literature", "Cultural", "Latin American", "Classics", "Novels"], "title": "Conversation in the Cathedral", "description": ["A Haunting tale of power, corruption, and the complex search for identity, ", " takes place in 1950s Peru during the dictatorship of Manuel Apolinario Odría Amoretti. Over beers and a sea of freely spoken words, the conversation flows between two individuals, Santiago and Ambrosia, who talk of their tormented lives and of the overall degradation an", "A Haunting tale of power, corruption, and the complex search for identity, ", " takes place in 1950s Peru during the dictatorship of Manuel Apolinario Odría Amoretti. Over beers and a sea of freely spoken words, the conversation flows between two individuals, Santiago and Ambrosia, who talk of their tormented lives and of the overall degradation and frustration that has slowly taken over their town. Through a complicated web of secrets and historical references, Mario Vargas Llosa analyzes the mental and moral mechanisms that govern power and the people behind it. More than a historic analysis, ", " is a groundbreaking novel that tackles identity as well as the role of a citizen and how a lack of personal freedom can forever scar a people and a nation."], "author": "Mario Vargas Llosa", "num_pages": "608", "awards": [], "places": ["Lima"], "character_names": [], "language": "English", "publish_date": "2005-02-01 00:00:00", "ISBN": "0060732806"},
{"url": "https://www.goodreads.com/book/show/7443012-mid-ocean", "num_ratings": "188", "num_reviews": "27", "avg_ratings": 3.98, "genres": ["Fiction", "Thriller", "Mystery Thriller"], "title": "Mid Ocean", "description": ["The Sea Holds Many Secrets. ", "Special Agent Joel Kenyon, just out of the U.S. Customs Academy, has been assigned to the badlands of drug enforcement, the Florida Keys. In a short time he must adjust himself to lifestyle of sandals, Jimmy Buffett and the quest for the perfect frozen drink. Set in 1984, Mid Ocean will take you to the Caribbean wild west. A place tourists never", "The Sea Holds Many Secrets. ", "Special Agent Joel Kenyon, just out of the U.S. Customs Academy, has been assigned to the badlands of drug enforcement, the Florida Keys. In a short time he must adjust himself to lifestyle of sandals, Jimmy Buffett and the quest for the perfect frozen drink. Set in 1984, Mid Ocean will take you to the Caribbean wild west. A place tourists never see, where, for centuries, fortunes have been won and lost along the treacherous reefs; a haven divers and fishermen during the day; a conduit for smugglers at night. With the lure of easy money and the temptations available to those in authority, the lines of right and wrong are often blurred, testing even the strongest moral compass in an atmosphere where navigating a bad course can be deadly. In the end, Joel will question everyone, including himself in his quest for what is right and what is true. Mid Ocean was inspired by real-life events."], "author": "T. Rafael Cimino", "num_pages": "422", "awards": [], "places": ["Florida"], "character_names": ["Mike West", "Joel Kenyon", "Tessa Alazar", "Owen Sands", "Jade Sands", "Jordan Cheney", "Pat Stephens", "Jhenna Kenyon-Stephens", "Peter Delgado", "Mima Alazar", "Roberto Alazar", "Roberto \"Bobby\" Alazar", "Salvador Magludez", "Ralph Linez"], "language": "English", "publish_date": "2009-12-09 00:00:00", "ISBN": "0615305733"},
{"url": "https://www.goodreads.com/book/show/1677.Sobre_h_roes_y_tumbas", "num_ratings": "7,031", "num_reviews": "273", "avg_ratings": 4.28, "genres": ["Fiction", "Classics", "European Literature", "Spanish Literature", "Novels"], "title": "Sobre héroes y tumbas", "description": ["Esta es la segunda novela de Ernesto Sabato, que profundiza la senda iniciada por El túnel. Una obra, considerada uno de los mejores libros del siglo, que indaga en las zonas más oscuras del espíritu"], "author": "Ernesto Sabato", "num_pages": "547", "awards": [], "places": ["Buenos Aires", "Buenos Aires"], "character_names": ["Martín Castillo", "Alejandra Vidal Olmos", "Fernando Vidal Olmos", "Bruno", "Pancho", "tío Bebe", "Humberto J. D'Arcángelo", "Buchich", "Chichín"], "language": "Spanish", "publish_date": "1999-10-28 00:00:00", "ISBN": "9500716054"},
{"url": "https://www.goodreads.com/book/show/2526.Blindness", "num_ratings": "150,810", "num_reviews": "12,418", "avg_ratings": 4.09, "genres": ["Science Fiction", "Dystopia", "Horror", "Apocalyptic", "Post Apocalyptic", "Abandoned", "Literary Fiction"], "title": "Blindness", "description": ["A city is hit by an epidemic of \"white blindness\" that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations and assaulting women. There is one eyewitness to this nightmare who guides her c", "A city is hit by an epidemic of \"white blindness\" that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations and assaulting women. There is one eyewitness to this nightmare who guides her charges—among them a boy with no mother, a girl with dark glasses, a dog of tears—through the barren streets, and their procession becomes as uncanny as the surroundings are harrowing. As ", " reclaims the age-old story of a plague, it evokes the vivid and trembling horrors of the twentieth century, leaving readers with a powerful vision of the human spirit that's bound both by weakness and exhilarating strength."], "author": "José Saramago", "num_pages": "326", "awards": ["Premio San Clemente for Novela Estranxeira (1999)"], "places": [], "character_names": ["The doctor (Blindness)", "The doctor's wife", "The girl with the dark glasses", "The first blind man", "The first blind man's wife", "The boy with the squint", "The old man with the black eye patch", "The car thief"], "language": "English", "publish_date": "1999-10-04 00:00:00", "ISBN": "0156007754"},
{"url": "https://www.goodreads.com/book/show/60142.La_ciudad_y_los_perros", "num_ratings": "13,206", "num_reviews": "574", "avg_ratings": 4.1, "genres": ["Fiction", "European Literature", "Spanish Literature", "Cultural", "Latin American"], "title": "La ciudad y los perros", "description": ["En 1962, La ciudad y los perros recibía el Premio Biblioteca Breve. Así comenzaba la andadura literaria de esta obra considerada una de las mejores novelas en español del siglo XX.Los personajes de La ciudad y los perros, un grupo de jóvenes que se «educan» en una disciplina militar implacable y violenta, aprenden a sobrevivir en un ambiente en el que están muy arraigados", "En 1962, La ciudad y los perros recibía el Premio Biblioteca Breve. Así comenzaba la andadura literaria de esta obra considerada una de las mejores novelas en español del siglo XX.Los personajes de La ciudad y los perros, un grupo de jóvenes que se «educan» en una disciplina militar implacable y violenta, aprenden a sobrevivir en un ambiente en el que están muy arraigados los prejuicios raciales y las diferencias entre clases sociales y económicas; donde todos se muestran como no son en realidad y la transgresión de las normas establecidas parece ser la única salida."], "author": "Mario Vargas Llosa", "num_pages": "446", "awards": ["Premio Biblioteca Breve (1962)", "Premio de la Crítica de narrativa castellana (1964)"], "places": [], "character_names": ["Ricardo Arana “El Esclavo”", "\"El Jaguar\"", "Alberto Fernández “El Poeta”", "\"El Boa”", "Porfirio Cava \"El Serrano\"", "\"El Rulos”", "Brigadier Arróspide", "\"El Negro\" Vallano", "Teniente Gamboa", "\"Pies Dorados\"", "Paulino \"El Injerto\""], "language": "Spanish", "publish_date": "2000-11-01 00:00:00", "ISBN": "8466309152"},
{"url": "https://www.goodreads.com/book/show/63032.2666", "num_ratings": "24,932", "num_reviews": "3,164", "avg_ratings": 4.21, "genres": ["Fiction", "Literature", "Novels", "Abandoned", "European Literature", "Spanish Literature"], "title": "2666", "description": ["A cuatro profesores de literatura, Pelletier, Morini, Espinoza y Norton, los une su fascinación por la obra de Beno von Archimboldi, un enigmático escritor alemán cuyo prestigio crece en todo el mundo. La complicidad se vuelve vodevil intelectual y desemboca en un peregrinaje a Santa Teresa (trasunto de Ciudad Juárez), donde hay quien dice que Archimboldi ha sido visto. Ya", "A cuatro profesores de literatura, Pelletier, Morini, Espinoza y Norton, los une su fascinación por la obra de Beno von Archimboldi, un enigmático escritor alemán cuyo prestigio crece en todo el mundo. La complicidad se vuelve vodevil intelectual y desemboca en un peregrinaje a Santa Teresa (trasunto de Ciudad Juárez), donde hay quien dice que Archimboldi ha sido visto. Ya allí, Pelletier y Espinoza se enteran de que la ciudad es desde años atrás escenario de una larga cadena de crímenes: en los vertederos aparecen cadáveres de mujeres con señales de haber sido violadas y torturadas. Es el primer asomo de la novela a sus procelosos caudales, repletos de personajes memorables cuyas historias, a caballo entre la risa y el horror, abarcan dos continentes e incluyen un vertiginoso travelling por la historia europea del siglo XX. 2666 confirma el veredicto de Susan Sontag: \"el más influyente y admirado novelista en lengua española de su generación. Su muerte, a los cincuenta años, es una gran pérdida para la literatura\"."], "author": "Roberto Bolaño", "num_pages": "1126", "awards": ["BTBA Best Translated Book Award Nominee for Fiction shortlist (2009)", "Magnesia Litera Nominee for Translation (Litera za překladovou knihu) (2013)", "PEN Translation Prize for Natasha Wimmer (2009)", "National Book Critics Circle Award for Fiction (2008)", "Premio Salambó (2004)", "本屋大賞 Nominee for Translated Fiction (2013)", "Premio Altazor for Narrativa (2005)"], "places": ["Santa Teresa", "Paris", "Madrid", "London, England", "Wilhelmshaven", "Buenos Aires", "Hamburg", "Mexico City (México City)", "Barcelona, Catalonia", "Detroit, Michigan", "Berlin", "Moscow, USSR", "Köln", "Paderborn"], "character_names": ["Óscar Amalfitano", "Oscar Fate", "Rosa Amalfitano", "Jean-Claude Pelletier", "Piero Morini", "Manuel Espinoza", "Liz  Norton", "Baroness von Zumpe", "Benno von Archimboldi", "Chucho Flores", "Klaus Haas", "Elvira Campo", "Juan de Dios Martínez"], "language": "Spanish", "publish_date": "2006-02-28 00:00:00", "ISBN": "843396867X"},
{"url": "https://www.goodreads.com/book/show/63033.The_Savage_Detectives", "num_ratings": "26,235", "num_reviews": "2,801", "avg_ratings": 4.1, "genres": ["Fiction", "Novels", "Cultural", "Latin American", "Abandoned"], "title": "The Savage Detectives", "description": ["New Year’s Eve, 1975: Arturo Belano and Ulises Lima, founders of the visceral realist movement in poetry, leave Mexico City in a borrowed white Impala. Their quest: to track down the obscure, vanished poet Cesárea Tinajero. A violent showdown in the Sonora desert turns search to flight; twenty years later Belano and Lima are still on the run.", "The explosive first long work b", "New Year’s Eve, 1975: Arturo Belano and Ulises Lima, founders of the visceral realist movement in poetry, leave Mexico City in a borrowed white Impala. Their quest: to track down the obscure, vanished poet Cesárea Tinajero. A violent showdown in the Sonora desert turns search to flight; twenty years later Belano and Lima are still on the run.", "The explosive first long work by “the most exciting writer to come from south of the Rio Grande in a long time” (Ilan Stavans, ", "), ", "follows Belano and Lima through the eyes of the people whose paths they cross in Central America, Europe, Israel, and West Africa. This chorus includes the muses of visceral realism, the beautiful Font sisters; their father, an architect interned in a Mexico City asylum; a sensitive young follower of Octavio Paz; a foul-mouthed American graduate student; a French girl with a taste for the Marquis de Sade; the great-granddaughter of Leon Trotsky; a Chilean stowaway with a mystical gift for numbers; the anorexic heiress to a Mexican underwear empire; an Argentinian photojournalist in Angola; and assorted hangers-on, detractors, critics, lovers, employers, vagabonds, real-life literary figures, and random acquaintances.", "A polymathic descendant of Borges and Pynchon, Roberto Bolaño traces the hidden connection between literature and violence in a world where national boundaries are fluid and death lurks in the shadow of the avant-garde. ", " is a dazzling original, the first great Latin American novel of the twenty-first century."], "author": "Roberto Bolaño", "num_pages": "577", "awards": ["Premio Herralde de Novela (1998)", "Premio Internacional de Novela Rómulo Gallegos (1999)", "BTBA Best Translated Book Award Nominee for Fiction shortlist (2008)"], "places": ["Mexico City (México City)"], "character_names": ["Ulises Lima", "Arturo Belano", "Auxilio Lacouture", "Ernesto San Epifanio"], "language": "English", "publish_date": "2007-04-03 00:00:00", "ISBN": "0374191484"},
{"url": "https://www.goodreads.com/book/show/5787.The_Aleph_and_Other_Stories", "num_ratings": "25,290", "num_reviews": "933", "avg_ratings": 4.38, "genres": ["Short Stories", "Fiction", "Classics", "Fantasy", "Literature", "Magical Realism"], "title": "The Aleph and Other Stories", "description": ["Full of philosophical puzzles and supernatural surprises, these stories contain some of Borges’s most fully realized human characters. With uncanny insight he takes us inside the minds of an unrepentant Nazi, an imprisoned Mayan priest, fanatical Christian theologians, a woman plotting vengeance on her father’s “killer,” and a man awaiting his assassin in a Buenos Aires gu", "Full of philosophical puzzles and supernatural surprises, these stories contain some of Borges’s most fully realized human characters. With uncanny insight he takes us inside the minds of an unrepentant Nazi, an imprisoned Mayan priest, fanatical Christian theologians, a woman plotting vengeance on her father’s “killer,” and a man awaiting his assassin in a Buenos Aires guest house.  This volume also contains the hauntingly brief vignettes about literary imagination and personal identity collected in ", ", which Borges wrote as failing eyesight and public fame began to undermine his sense of self.", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."], "author": "Jorge Luis Borges", "num_pages": "210", "awards": [], "places": [], "character_names": ["Cruz"], "language": "English", "publish_date": "2004-07-27 00:00:00", "ISBN": "0142437883"},
{"url": "https://www.goodreads.com/book/show/77298.Aunt_Julia_and_the_Scriptwriter", "num_ratings": "13,527", "num_reviews": "853", "avg_ratings": 3.91, "genres": ["Fiction", "Cultural", "Latin American", "Nobel Prize", "European Literature", "Spanish Literature"], "title": "Aunt Julia and the Scriptwriter", "description": ["Mario Vargas Llosa's brilliant, multilayered novel is set in the Lima, Peru, of the author's youth, where a young student named Marito is toiling away in the news department of a local radio station. His young life is disrupted by two arrivals.", "The first is his aunt Julia, recently divorced and thirteen years older, with whom he begins a secret affair. The second is a manic", "Mario Vargas Llosa's brilliant, multilayered novel is set in the Lima, Peru, of the author's youth, where a young student named Marito is toiling away in the news department of a local radio station. His young life is disrupted by two arrivals.", "The first is his aunt Julia, recently divorced and thirteen years older, with whom he begins a secret affair. The second is a manic radio scriptwriter named Pedro Camacho, whose racy, vituperative soap operas are holding the city's listeners in thrall. Pedro chooses young Marito to be his confidant as he slowly goes insane.", "Interweaving the story of Marito's life with the ever-more-fevered tales of Pedro Camacho, Vargas Llosa's novel is hilarious, mischievous, and masterful, a classic named one of the best books of the year by the New York Times Book Review."], "author": "Mario Vargas Llosa", "num_pages": "384", "awards": ["Prix du Meilleur Livre Étranger for Roman (1980)"], "places": ["Lima", "Peru (Perú)"], "character_names": ["Pedro Camacho", "Mario", "Julia", "Javier"], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "0140248927"},
{"url": "https://www.goodreads.com/book/show/11208.How_the_Garc_a_Girls_Lost_Their_Accents", "num_ratings": "20,426", "num_reviews": "1,405", "avg_ratings": 3.63, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult"], "title": "How the García Girls Lost Their Accents", "description": ["Uprooted from their family home in the Dominican Republic, the four Garcia sisters - Carla, Sandra, Yolanda, and Sofia - arrive in New York City in 1960 to find a life far different from the genteel existence of maids, manicures, and extended family they left behind. What they have lost - and what they find - is revealed in the fifteen interconnected stories that make up t", "Uprooted from their family home in the Dominican Republic, the four Garcia sisters - Carla, Sandra, Yolanda, and Sofia - arrive in New York City in 1960 to find a life far different from the genteel existence of maids, manicures, and extended family they left behind. What they have lost - and what they find - is revealed in the fifteen interconnected stories that make up this exquisite novel from one of the premier novelists of our time."], "author": "Julia Alvarez", "num_pages": "304", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2005-10-04 00:00:00", "ISBN": "0452287073"},
{"url": "https://www.goodreads.com/book/show/17717.Labyrinths", "num_ratings": "24,853", "num_reviews": "1,187", "avg_ratings": 4.46, "genres": ["Fiction", "Short Stories", "Classics", "Literature", "Magical Realism", "Fantasy", "Philosophy"], "title": "Labyrinths:  Selected Stories and Other Writings", "description": ["Although his work has been restricted to the short story, the essay, and poetry, Jorge Luis Borges of Argentina is recognized all over the world as one of the most original and significant figures in modern literature. In his preface, Andre Maurois writes: \"Borges is a great writer who has composed only little essays or short narratives. Yet they suffice for us to call him", "Although his work has been restricted to the short story, the essay, and poetry, Jorge Luis Borges of Argentina is recognized all over the world as one of the most original and significant figures in modern literature. In his preface, Andre Maurois writes: \"Borges is a great writer who has composed only little essays or short narratives. Yet they suffice for us to call him great because of their wonderful intelligence, their wealth of invention, and their tight, almost mathematical style.\"", " is a representative selection of Borges' writing, some forty pieces drawn from various of his books published over the years. The translations are by Harriet de Onis, Anthony Kerrigan, and others, including the editors, who have provided a biographical and critical introduction, as well as an extensive bibliography."], "author": "Jorge Luis Borges", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "Multiple languages", "publish_date": "1964-08-16 00:00:00", "ISBN": "0811200124"},
{"url": "https://www.goodreads.com/book/show/23876.Of_Love_and_Other_Demons", "num_ratings": "45,385", "num_reviews": "2,017", "avg_ratings": 3.98, "genres": ["Fiction", "Magical Realism", "Classics", "Historical", "Historical Fiction", "Literature"], "title": "Of Love and Other Demons", "description": ["On her twelfth birthday, Sierva Maria, the only child of a decaying noble family in an eighteenth-century South American seaport, is bitten by a rabid dog. Believed to be possessed, she is brought to a convent for observation. And into her cell stumbles Father Cayetano Delaura, who has already dreamed about a girl with hair trailing after her like a bridal train. As he ten", "On her twelfth birthday, Sierva Maria, the only child of a decaying noble family in an eighteenth-century South American seaport, is bitten by a rabid dog. Believed to be possessed, she is brought to a convent for observation. And into her cell stumbles Father Cayetano Delaura, who has already dreamed about a girl with hair trailing after her like a bridal train. As he tends to her with holy water and sacramental oils, Delaura feels something shocking begin to occur. He has fallen in love, and it is not long until Sierva Maria joins him in his fevered misery. ", "Unsettling and indelible, ", " is an evocative, majestic tale of the most universal experiences known to woman and man."], "author": "Gabriel García Márquez", "num_pages": "160", "awards": [], "places": [], "character_names": ["Sierva María", "Cayetano Delaura"], "language": "English", "publish_date": "1995-05-02 00:00:00", "ISBN": "0517405091"},
{"url": "https://www.goodreads.com/book/show/53447.El_t_nel", "num_ratings": "32,920", "num_reviews": "1,987", "avg_ratings": 4.04, "genres": ["Fiction", "Classics", "European Literature", "Spanish Literature"], "title": "El túnel", "description": ["Breve e intensa novela publicada en 1948, este logrado fruto de la denominada \"literatura existencial\" le dio a su autor un reconocimiento que traspasó las fronteras nacionales. Para quien todavía no la leyó, ", " es la mejor introducción al universo prodigioso de Ernesto Sábato; para quien la conoce, un clásico de las letras del continente, una historia sobre el drama", "Breve e intensa novela publicada en 1948, este logrado fruto de la denominada \"literatura existencial\" le dio a su autor un reconocimiento que traspasó las fronteras nacionales. Para quien todavía no la leyó, ", " es la mejor introducción al universo prodigioso de Ernesto Sábato; para quien la conoce, un clásico de las letras del continente, una historia sobre el drama del hombre arrojado en el sinsentido más doloroso: la conciencia de la nada. ", "El narrador describe una historia de amor y muerte en la que muestra la soledad del individuo contemporáneo. No están ausentes de esta trama policial y de suspenso, la locura y la increíble reflexión del protagonista, el pintor Juan Pablo Castel, debatiéndose por comprender las causas que lo arrastraron a matar a la mujer que amaba, María Iribarne, y que era su única vía de salvación. En este alucinante drama de la vida interior, seres intrincados en la bestial búsqueda de comprensión ceden a la mentira, la hipocresía y los celos desmedidos hasta el crimen más inexplicable. Aventura amorosa, aventura onírica, aventura del ser que dan testimonio de un asesinato, de cierta memoria culpable y de una valiente introspección. ", "Técnicamente perfecta y de lectura apasionante, ", " excede el negativismo ácido de Sartre y la frenética huida hacia el vacío que plantea ", " de Camus, pero tiene de esos dos maestros literarios la impronta genial que hace de la escritura una radiografía del alma atormentada."], "author": "Ernesto Sabato", "num_pages": "158", "awards": [], "places": ["Buenos Aires"], "character_names": ["Juan Pablo Castel", "Maria Iribarne"], "language": "Spanish", "publish_date": "2003-01-28 00:00:00", "ISBN": "9871144261"},
{"url": "https://www.goodreads.com/book/show/53413.Hopscotch", "num_ratings": "23,494", "num_reviews": "1,540", "avg_ratings": 4.25, "genres": ["Fiction", "Classics", "Cultural", "Latin American", "European Literature", "Spanish Literature", "Literature"], "title": "Hopscotch", "description": ["Horacio Oliveira is an Argentinian writer who lives in Paris with his mistress, La Maga, surrounded by a loose-knit circle of bohemian friends who call themselves \"the Club.\" A child's death and La Maga's disappearance put an end to his life of empty pleasures and intellectual acrobatics, and prompt Oliveira to return to Buenos Aires, where he works by turns as a salesman,", "Horacio Oliveira is an Argentinian writer who lives in Paris with his mistress, La Maga, surrounded by a loose-knit circle of bohemian friends who call themselves \"the Club.\" A child's death and La Maga's disappearance put an end to his life of empty pleasures and intellectual acrobatics, and prompt Oliveira to return to Buenos Aires, where he works by turns as a salesman, a keeper of a circus cat which can truly count, and an attendant in an insane asylum. Hopscotch is the dazzling, freewheeling account of Oliveira's astonishing adventures.", "The book is highly influenced by Henry Miller’s reckless and relentless search for truth in post-decadent Paris and Daisetz Teitaro Suzuki’s modal teachings on Zen Buddhism.", "Cortázar's employment of interior monologue, punning, slang, and his use of different languages is reminiscent of Modernist writers like Joyce, although his main influences were Surrealism and the French New Novel, as well as the \"riffing\" aesthetic of jazz and New Wave Cinema.", "In 1966, Gregory Rabassa won the first National Book Award to recognize the work of a translator, for his English-language edition of ", ". Julio Cortazar was so pleased with Rabassa's translation of ", " that he recommended the translator to Gabriel García Márquez when García Márquez was looking for someone to translate his novel ", " into English. \"Rabassa's ", " improved the original,\" according to García Márquez."], "author": "Julio Cortázar", "num_pages": "564", "awards": ["National Book Award for Translation (1967)", "Mikael Agricola -palkinto (2006)"], "places": [], "character_names": ["Traveler", "Talita", "Horacio Oliveira", "La Maga", "Morelli"], "language": "English", "publish_date": "1987-02-12 00:00:00", "ISBN": "0394752848"},
{"url": "https://www.goodreads.com/book/show/16527.Daughter_of_Fortune", "num_ratings": "101,828", "num_reviews": "3,424", "avg_ratings": 3.89, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance"], "title": "Daughter of Fortune", "description": ["Orphaned at birth, Eliza Sommers is raised in the British colony of Valparaíso, Chile, by the well-intentioned Victorian spinster Miss Rose and her more rigid brother Jeremy. Just as she meets and falls in love with the wildly inappropriate Joaquín Andieta, a lowly clerk who works for Jeremy, gold is discovered in the hills of northern California. By 1849, Chileans of ever", "Orphaned at birth, Eliza Sommers is raised in the British colony of Valparaíso, Chile, by the well-intentioned Victorian spinster Miss Rose and her more rigid brother Jeremy. Just as she meets and falls in love with the wildly inappropriate Joaquín Andieta, a lowly clerk who works for Jeremy, gold is discovered in the hills of northern California. By 1849, Chileans of every stripe have fallen prey to feverish dreams of wealth. Joaquín takes off for San Francisco to seek his fortune, and Eliza, pregnant with his child, decides to follow him.", "As we follow her spirited heroine on a perilous journey north in the hold of a ship to the rough-and-tumble world of San Francisco and northern California, we enter a world whose newly arrived inhabitants are driven mad by gold fever. A society of single men and prostitutes among whom Eliza moves--with the help of her good friend and savior, the Chinese doctor Tao Chien--California opens the door to a new life of freedom and independence for the young Chilean. Her search for the elusive Joaquín gradually turns into another kind of journey that transforms her over time, and what began as a search for love ends up as the conquest of personal freedom."], "author": "Isabel Allende", "num_pages": "432", "awards": ["Premio de traducción literaria Valle Inclán Nominee for Margaret Sayers Peden (2000)"], "places": ["California", "Valparaíso"], "character_names": ["Eliza Sommers", "Rose Sommers", "Joaquín Andieta", "Jacob Todd", "Tao Chi'en"], "language": "English", "publish_date": "2006-05-02 00:00:00", "ISBN": "0061120251"},
{"url": "https://www.goodreads.com/book/show/11206.In_the_Time_of_the_Butterflies", "num_ratings": "47,144", "num_reviews": "3,437", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Fiction"], "title": "In the Time of the Butterflies", "description": ["Set during the waning days of the Trujillo dictatorship in the Dominican Republic in 1960, this extraordinary novel tells the story of the Mirabal sisters, three young wives and mothers who are assassinated after visiting their jailed husbands. ", "From the author of ", " comes this tale of courage and sisterhood set in the Dominican Republic", "Set during the waning days of the Trujillo dictatorship in the Dominican Republic in 1960, this extraordinary novel tells the story of the Mirabal sisters, three young wives and mothers who are assassinated after visiting their jailed husbands. ", "From the author of ", " comes this tale of courage and sisterhood set in the Dominican Republic during the rise of the Trujillo dictatorship. A skillful blend of fact and fiction, ", " is inspired by the true story of the three Mirabal sisters who, in 1960, were murdered for their part in an underground plot to overthrow the government. Alvarez breathes life into these historical figures--known as \"las mariposas,\" or \"the butterflies,\" in the underground--as she imagines their teenage years, their gradual involvement with the revolution, and their terror as their dissentience is uncovered. ", " Alvarez's controlled writing perfectly captures the mounting tension as \"the butterflies\" near their horrific end. The novel begins with the recollections of Dede, the fourth and surviving sister, who fears abandoning her routines and her husband to join the movement. Alvarez also offers the perspectives of the other sisters: brave and outspoken Minerva, the family's political ringleader; pious Patria, who forsakes her faith to join her sisters after witnessing the atrocities of the tyranny; and the baby sister, sensitive Maria Teresa, who, in a series of diaries, chronicles her allegiance to Minerva and the physical and spiritual anguish of prison life. ", " is an American Library Association Notable Book and a 1995 National Book Critics Circle Award nominee."], "author": "Julia Alvarez", "num_pages": "324", "awards": ["National Book Critics Circle Award Nominee for Fiction (1994)"], "places": ["Dominican Republic"], "character_names": ["Patria Mirabal de Gonzalez", "Minerva Mirabal de Tavarez", "Maria Teresa Mirabal de Guzman", "Bélgica Adela Mirabal de Reyes"], "language": "English", "publish_date": "1995-08-16 00:00:00", "ISBN": "0452274427"},
{"url": "https://www.goodreads.com/book/show/297673.The_Brief_Wondrous_Life_of_Oscar_Wao", "num_ratings": "200,112", "num_reviews": "17,901", "avg_ratings": 3.9, "genres": ["Fiction", "Contemporary", "Magical Realism", "Novels"], "title": "The Brief Wondrous Life of Oscar Wao", "description": ["Things have never been easy for Oscar, a sweet but disastrously overweight, lovesick Dominican ghetto nerd. From his home in New Jersey, where he lives with his old-world mother and rebellious sister, Oscar dreams of becoming the Dominican J. R. R. Tolkien and, most of all, of finding love. But he may never get what he wants, thanks to the Fukœ—the curse that has haunted t", "Things have never been easy for Oscar, a sweet but disastrously overweight, lovesick Dominican ghetto nerd. From his home in New Jersey, where he lives with his old-world mother and rebellious sister, Oscar dreams of becoming the Dominican J. R. R. Tolkien and, most of all, of finding love. But he may never get what he wants, thanks to the Fukœ—the curse that has haunted the Oscar's family for generations, dooming them to prison, torture, tragic accidents, and, above all, ill-starred love. Oscar, still waiting for his first kiss, is just its most recent victim. ", "Diaz immerses us in the tumultuous life of Oscar and the history of the family at large, rendering with genuine warmth and dazzling energy, humor, and insight the Dominican-American experience, and, ultimately, the endless human capacity to persevere in the face of heartbreak and loss. A true literary triumph, ", " confirms Junot Diaz as one of the best and most exciting voices of our time."], "author": "Junot Díaz", "num_pages": "335", "awards": ["Pulitzer Prize for Fiction (2008)", "Anisfield-Wolf Book Award (2008)", "Massachusetts Book Award for Fiction (2008)", "Dayton Literary Peace Prize for Fiction (2008)", "National Book Critics Circle Award for Fiction (2007)", "Hurston/Wright Legacy Award for Fiction (2008)", "The Rooster - The Morning News Tournament of Books (2008)", "The Center for Fiction First Novel Prize (2007)"], "places": ["Dominican Republic", "Washington Heights, New York", "Paterson, New Jersey"], "character_names": ["Oscar de León", "Lola de León", "Hypatía Belicia \"Beli\" Cabral de León", "La Inca", "Yunior de Las Casas", "Ybón Pimentel", "Dr Abelard Luis Cabral"], "language": "English", "publish_date": "2007-09-06 00:00:00", "ISBN": "1594489580"},
{"url": "https://www.goodreads.com/book/show/23878.Chronicle_of_a_Death_Foretold", "num_ratings": "93,372", "num_reviews": "4,637", "avg_ratings": 3.96, "genres": ["Fiction", "Classics", "Magical Realism", "Literature", "Academic", "School"], "title": "Chronicle of a Death Foretold", "description": ["A man returns to the town where a baffling murder took place 27 years earlier, determined to get to the bottom of the story. Just hours after marrying the beautiful Angela Vicario, everyone agrees, Bayardo San Roman returned his bride in disgrace to her parents. Her distraught family forced her to name her first lover; and her twin brothers announced their intention to mur", "A man returns to the town where a baffling murder took place 27 years earlier, determined to get to the bottom of the story. Just hours after marrying the beautiful Angela Vicario, everyone agrees, Bayardo San Roman returned his bride in disgrace to her parents. Her distraught family forced her to name her first lover; and her twin brothers announced their intention to murder Santiago Nasar for dishonoring their sister.", "Yet if everyone knew the murder was going to happen, why did no one intervene to stop it? The more that is learned, the less is understood, and as the story races to its inexplicable conclusion, an entire society--not just a pair of murderers—is put on trial."], "author": "Gabriel García Márquez", "num_pages": "120", "awards": [], "places": [], "character_names": ["Santiago Nasar", "Ángela Vicario", "Bayardo San Román", "Pablo and Pedro Vicario"], "language": "English", "publish_date": "2003-10-07 00:00:00", "ISBN": "140003471X"},
{"url": "https://www.goodreads.com/book/show/38787.Pedro_P_ramo", "num_ratings": "30,497", "num_reviews": "2,105", "avg_ratings": 4.05, "genres": ["Fiction", "Magical Realism", "Classics", "European Literature", "Spanish Literature", "Cultural", "Latin American"], "title": "Pedro Páramo", "description": ["A classic of Mexican modern literature about a haunted village.", "As one enters Juan Rulfo's legendary novel, one follows a dusty road to a town of death. Time shifts from one consciousness to another in a hypnotic flow of dreams, desires, and memories, a world of ghosts dominated by the figure of Pedro Páramo - lover, overlord, murderer.", "Rulfo's extraordinary mix of sensory i", "A classic of Mexican modern literature about a haunted village.", "As one enters Juan Rulfo's legendary novel, one follows a dusty road to a town of death. Time shifts from one consciousness to another in a hypnotic flow of dreams, desires, and memories, a world of ghosts dominated by the figure of Pedro Páramo - lover, overlord, murderer.", "Rulfo's extraordinary mix of sensory images, violent passions and unfathomable mysteries has been a profound influence on a whole generation of Latin American writers including Carlos Fuentes, Mario Vargas Llosa, and Gabriel García Márquez. To read Pedro Páramo today is as overwhelming an experience as when it was first published in Mexico nearly fifty years ago."], "author": "Juan Rulfo", "num_pages": "128", "awards": [], "places": ["Comala"], "character_names": ["Juan Preciado"], "language": "English", "publish_date": "1994-03-10 00:00:00", "ISBN": "0802133908"},
{"url": "https://www.goodreads.com/book/show/5932.Twenty_Love_Poems_and_a_Song_of_Despair", "num_ratings": "40,488", "num_reviews": "1,734", "avg_ratings": 4.32, "genres": ["Poetry", "Classics", "European Literature", "Spanish Literature", "Romance"], "title": "Twenty Love Poems and a Song of Despair", "description": ["Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an", "Drawn from the most intimate and personal associations, Pablo Neruda's most beloved collection of poetry juxtaposes the exuberance of youthful passion with the desolation of grief, the sensuality of the body with the metaphorical nuances of nature. Pulitzer Prize-winning poet W. S. Merwin's masterly translation faces the original Spanish text. This edition also features an insightful Introduction by Cristina Garcia. More than eighty years after its publication, ", " stands as an essential collection that continues to inspire lovers and poets around the world."], "author": "Pablo Neruda", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-26 00:00:00", "ISBN": "0143039962"},
{"url": "https://www.goodreads.com/book/show/139253.The_House_on_Mango_Street", "num_ratings": "98,014", "num_reviews": "8,146", "avg_ratings": 3.6, "genres": ["Fiction", "Young Adult", "Classics", "Short Stories", "Academic", "School"], "title": "The House on Mango Street", "description": ["Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up", "Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up in Chicago, inventing for herself who and what she will become. Few other books in our time have touched so many readers."], "author": "Sandra Cisneros", "num_pages": "110", "awards": ["American Book Award (1985)", "George C. Stone Center for Children's Books Recognition of Merit Award (1994)"], "places": ["Chicago, Illinois"], "character_names": ["Esperanza", "Nenny"], "language": "English", "publish_date": "2009-04-03 00:00:00", "ISBN": "0679734775"},
{"url": "https://www.goodreads.com/book/show/865.The_Alchemist", "num_ratings": "1,614,200", "num_reviews": "62,763", "avg_ratings": 3.84, "genres": ["Fiction", "Classics", "Fantasy", "Philosophy"], "title": "The Alchemist", "description": ["Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read t", "Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams."], "author": "Paulo Coelho", "num_pages": "197", "awards": ["NBDB National Book Award Nominee for Translation (2015)", "Grand Prix des lectrices de Elle for roman (1995)", "Premio Grinzane Cavour for Narrativa Straniera (1996)", "Corine Internationaler Buchpreis for Belletristik (2002)"], "places": ["Egypt", "Sahara Desert"], "character_names": ["Santiago", "Alchemist"], "language": "English", "publish_date": "1993-05-01 00:00:00", "ISBN": "0061122416"},
{"url": "https://www.goodreads.com/book/show/426504.Ficciones", "num_ratings": "39,244", "num_reviews": "1,802", "avg_ratings": 4.46, "genres": ["Fiction", "Short Stories", "Classics", "Magical Realism", "Literature", "Fantasy"], "title": "Ficciones", "description": ["The seventeen pieces in ", " demonstrate the whirlwind of Borges's genius and mirror the precision and potency of his intellect and inventiveness, his piercing irony, his skepticism, and his obsession with fantasy. Borges sends us on a journey into a compelling, bizarre, and profoundly resonant realm; we enter the fearful sphere of Pascal's abyss, the surreal and lite", "The seventeen pieces in ", " demonstrate the whirlwind of Borges's genius and mirror the precision and potency of his intellect and inventiveness, his piercing irony, his skepticism, and his obsession with fantasy. Borges sends us on a journey into a compelling, bizarre, and profoundly resonant realm; we enter the fearful sphere of Pascal's abyss, the surreal and literal labyrinth of books, and the iconography of eternal return. To enter the worlds in ", " is to enter the mind of Jorge Luis Borges, wherein lies Heaven, Hell, and everything in between.", " Part One: The Garden of Forking Paths", " Prologue", " Tlön, Uqbar, Orbis Tertius (1940)", " The Approach to Al-Mu'tasim (1936, not included in the 1941 edition)", " Pierre Menard, Author of the Quixote (1939)", " The Circular Ruins (1940)", " The Lottery in Babylon (1941)", " An Examination of the Work of Herbert Quain (1941)", " The Library of Babel (1941)", " The Garden of Forking Paths (1941)", " Part Two: Artifices", " Prologue", " Funes the Memorious (1942)", " The Form of the Sword (1942)", " Theme of the Traitor and the Hero (1944)", " Death and the Compass (1942)", " The Secret Miracle (1943)", " Three Versions of Judas (1944)", " The End (1953, 2nd edition only)", " The Sect of the Phoenix (1952, 2nd edition only)", " The South (1953, 2nd edition only)"], "author": "Jorge Luis Borges", "num_pages": "174", "awards": ["Premio Formentor de las Letras for International (1961)"], "places": [], "character_names": [], "language": "English", "publish_date": "1994-02-01 00:00:00", "ISBN": "0802130305"},
{"url": "https://www.goodreads.com/book/show/6952.Like_Water_for_Chocolate", "num_ratings": "297,606", "num_reviews": "7,299", "avg_ratings": 3.94, "genres": ["Fiction", "Romance", "Magical Realism", "Historical", "Historical Fiction", "Classics", "Fantasy", "Food and Drink", "Food"], "title": "Like Water for Chocolate", "description": ["Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico became a best-selling phenomenon with its winning blend of poignant romance and bittersweet wit.", "The number one bestseller in Mexico and America for almost two years, and subsequently a bestseller around the world, ", " is a romantic, poignant tale, touched with", "Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico became a best-selling phenomenon with its winning blend of poignant romance and bittersweet wit.", "The number one bestseller in Mexico and America for almost two years, and subsequently a bestseller around the world, ", " is a romantic, poignant tale, touched with moments of magic, graphic earthiness, bittersweet wit - and recipes. ", "A sumptuous feast of a novel, it relates the bizarre history of the all-female De La Garza family. Tita, the youngest daughter of the house, has been forbidden to marry, condemned by Mexican tradition to look after her mother until she dies. But Tita falls in love with Pedro, and he is seduced by the magical food she cooks. In desperation, Pedro marries her sister Rosaura so that he can stay close to her, so that Tita and Pedro are forced to circle each other in unconsummated passion. Only a freakish chain of tragedies, bad luck and fate finally reunite them against all the odds."], "author": "Laura Esquivel", "num_pages": "221", "awards": ["Prêmio Jabuti for Tradução (1994)", "American Booksellers Book Of The Year  Award for Adult Trade (1994)"], "places": ["Mexico"], "character_names": ["Tita de la Garza", "Gertrudis de la Garza", "Rosaura de la Garza", "Mamá Elena", "Pedro Muzquiz", "John Brown", "Nacha", "Chencha", "Juan Alejandrez"], "language": "English", "publish_date": "1996-10-01 00:00:00", "ISBN": "0552995878"},
{"url": "https://www.goodreads.com/book/show/9328.The_House_of_the_Spirits", "num_ratings": "153,042", "num_reviews": "6,035", "avg_ratings": 4.21, "genres": ["Fiction", "Magical Realism", "Historical", "Historical Fiction", "Classics", "Fantasy"], "title": "The House of the Spirits", "description": ["In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. ", "Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherwor", "In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. ", "Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherworldly hand. Their daughter, Blanca, whose forbidden love for a man Esteban has deemed unworthy infuriates her father, yet will produce his greatest joy: his granddaughter Alba, a beautiful, ambitious girl who will lead the family and their country into a revolutionary future.", " is an enthralling saga that spans decades and lives, twining the personal and the political into an epic novel of love, magic, and fate."], "author": "Isabel Allende", "num_pages": "448", "awards": ["Deutscher Hörbuchpreis for Beste Fiktion (2011)", "Prix du Grand Roman d'évasion (1984)"], "places": ["Chile"], "character_names": ["Esteban Trueba", "Clara del Valle", "Férula Trueba", "Blanca Trueba", "Jaime Trueba", "Nicolàs Trueba", "Pedro Tercero Garcia", "Alba Trueba", "Esteban Garcia"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0553383809"},
{"url": "https://www.goodreads.com/book/show/9712.Love_in_the_Time_of_Cholera", "num_ratings": "345,442", "num_reviews": "16,492", "avg_ratings": 3.9, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Romance", "Magical Realism"], "title": "Love in the Time of Cholera", "description": ["In their youth, Florentino Ariza and Fermina Daza fall passionately in love. When Fermina eventually chooses to marry a wealthy, well-born doctor, Florentino is devastated, but he is a romantic. As he rises in his business career he whiles away the years in 622 affairs--yet he reserves his heart for Fermina. Her husband dies at last, and Florentino purposefully attends the", "In their youth, Florentino Ariza and Fermina Daza fall passionately in love. When Fermina eventually chooses to marry a wealthy, well-born doctor, Florentino is devastated, but he is a romantic. As he rises in his business career he whiles away the years in 622 affairs--yet he reserves his heart for Fermina. Her husband dies at last, and Florentino purposefully attends the funeral. Fifty years, nine months, and four days after he first declared his love for Fermina, he will do so again."], "author": "Gabriel García Márquez", "num_pages": "348", "awards": ["Audie Award", "Los Angeles Times Book Prize for Fiction (1988)"], "places": ["Colombia", "Cartagena"], "character_names": ["Fermina Daza", "Florentino Ariza", "Juvenal Urbino", "Lorenzo Daza", "Aunt Escolástica", "Hildebranda Sánchez"], "language": "English", "publish_date": "2003-10-05 00:00:00", "ISBN": "140003468X"}
]