[
{"url": "https://www.goodreads.com/book/show/2184798.Blood_River", "num_ratings": "6,232", "num_reviews": "560", "avg_ratings": 4.05, "genres": ["Cultural", "Africa", "Travel", "Nonfiction", "History", "Adventure", "Autobiography", "Memoir"], "title": "Blood River: A Journey to Africa's Broken Heart", "description": ["A compulsively readable account of a journey to the Congo — a country virtually inaccessible to the outside world — vividly told by a daring and adventurous journalist.", "Ever since Stanley first charted its mighty river in the 1870s, the Congo has epitomized the dark and turbulent history of a failed continent. However, its troubles only served to increase the interest of Da", "A compulsively readable account of a journey to the Congo — a country virtually inaccessible to the outside world — vividly told by a daring and adventurous journalist.", "Ever since Stanley first charted its mighty river in the 1870s, the Congo has epitomized the dark and turbulent history of a failed continent. However, its troubles only served to increase the interest of Daily Telegraph correspondent Tim Butcher, who was sent to cover Africa in 2000. Before long he became obsessed with the idea of recreating Stanley’s original expedition — but travelling alone.", "Despite warnings Butcher spent years poring over colonial-era maps and wooing rebel leaders before making his will and venturing to the Congo’s eastern border. He passed through once thriving cities of this country and saw the marks left behind by years of abuse and misrule. Almost, 2,500 harrowing miles later, he reached the Atlantic Ocean, a thinner and a wiser man.", "Butcher’s journey was a remarkable feat. But the story of the Congo, vividly told in Blood River, is more remarkable still."], "author": "Tim Butcher", "num_pages": "363", "awards": ["Ryszard Kapuściński Prize Nominee (2009)", "Samuel Johnson Prize for Non-Fiction Nominee (2008)", "Stanford Dolman Travel Book of the Year Nominee (2008)"], "places": ["Congo, Democratic Republic of the "], "character_names": ["Henry Morton Stanley"], "language": "English", "publish_date": "2008-01-03 00:00:00", "ISBN": "0099494280"},
{"url": "https://www.goodreads.com/book/show/875441.Someone_Knows_My_Name", "num_ratings": "61,418", "num_reviews": "5,638", "avg_ratings": 4.45, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Canada", "Historical", "Cultural", "Africa"], "title": "Someone Knows My Name", "description": ["Abducted from Africa as a child and enslaved in South Carolina, Aminata Diallo thinks only of freedom―and of the knowledge, she needs to get home. Sold to an indigo trader who recognizes her intelligence, Aminata is torn from her husband and child and thrown into the chaos of the Revolutionary War. In Manhattan, Aminata helps pen the Book of Negroes, a list of blacks rewar", "Abducted from Africa as a child and enslaved in South Carolina, Aminata Diallo thinks only of freedom―and of the knowledge, she needs to get home. Sold to an indigo trader who recognizes her intelligence, Aminata is torn from her husband and child and thrown into the chaos of the Revolutionary War. In Manhattan, Aminata helps pen the Book of Negroes, a list of blacks rewarded for service to the king with safe passage to Nova Scotia. There Aminata finds a life of hardship and stinging prejudice. When the British abolitionists come looking for \"adventurers\" to create a new colony in Sierra Leone, Aminata assists in moving 1,200 Nova Scotians to Africa and aiding the abolitionist cause by revealing the realities of slavery to the British public. ", "This captivating story of one woman's remarkable experience spans six decades and three continents and brings to life a crucial chapter in world history."], "author": "Lawrence Hill", "num_pages": "489", "awards": ["Scotiabank Giller Prize Nominee (2007)", "Gustavus Myers Outstanding Book Award (2009)", "Hurston/Wright Legacy Award Nominee for Fiction (2008)", "Commonwealth Writers' Prize for Best Book Overall (2008)", "CBC Canada Reads (2009)", "Rogers Writers' Trust Fiction Prize (2007)", "OLA Evergreen Award (2008)"], "places": ["United States of America", "London, England", "Canada", "Nova Scotia", "Sierra Leone"], "character_names": ["Aminata Diallo"], "language": "English", "publish_date": "2007-11-05 00:00:00", "ISBN": "0393065782"},
{"url": "https://www.goodreads.com/book/show/80213.Anthills_of_the_Savannah", "num_ratings": "3,011", "num_reviews": "158", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Classics", "Novels"], "title": "Anthills of the Savannah", "description": ["Chris, Ikem and Beatrice are like-minded friends working under the military regime of His Excellency, the Sandhurst-educated President of Kangan. In the pressurized atmosphere of oppression and intimidation they are simply trying to live and love - and remain friends. But in a world where each day brings a new betrayal, hope is hard to cling on to. ", "Chris, Ikem and Beatrice are like-minded friends working under the military regime of His Excellency, the Sandhurst-educated President of Kangan. In the pressurized atmosphere of oppression and intimidation they are simply trying to live and love - and remain friends. But in a world where each day brings a new betrayal, hope is hard to cling on to. ", " (1987), Achebe's candid vision of contemporary African politics, is a powerful fusion of angry voices. It continues the journey that Achebe began with his earlier novels, tracing the history of modern Africa through colonialism and beyond, and is a work ultimately filled with hope."], "author": "Chinua Achebe", "num_pages": "240", "awards": ["Man Booker Prize Nominee (1987)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-29 00:00:00", "ISBN": "0141186909"},
{"url": "https://www.goodreads.com/book/show/151374.So_Long_a_Letter", "num_ratings": "5,441", "num_reviews": "453", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Senegal", "Literature", "African Literature", "Cultural", "France", "Feminism"], "title": "So Long a Letter", "description": ["This novel is in the form of a letter, written by the widowed Ramatoulaye and describing her struggle for survival. It is the winner of the Noma Award."], "author": "Mariama Bâ", "num_pages": "90", "awards": ["Noma Award for Publishing in Africa (1980)"], "places": ["Senegal"], "character_names": ["Ramatoulaye", "Aissatou", "Mawdo Ba", "Modou Fall", "Binetou"], "language": "English", "publish_date": "1989-06-28 00:00:00", "ISBN": "0435905554"},
{"url": "https://www.goodreads.com/book/show/5587960-the-thing-around-your-neck", "num_ratings": "18,423", "num_reviews": "1,814", "avg_ratings": 4.21, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Contemporary", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "The Thing Around Your Neck", "description": ["Searing and profound, suffused with beauty, sorrow, and longing, the stories in The Thing Around Your Neck map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them.", "Chimamanda Ngozi Adichie burst onto the literary scene with her remarkable debut novel, Purple Hibiscus, which critics hailed as \"one of the b", "Searing and profound, suffused with beauty, sorrow, and longing, the stories in The Thing Around Your Neck map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them.", "Chimamanda Ngozi Adichie burst onto the literary scene with her remarkable debut novel, Purple Hibiscus, which critics hailed as \"one of the best novels to come out of Africa in years\" (Baltimore Sun), with \"prose as lush as the Nigerian landscape that it powerfully evokes\" (The Boston Globe); The Washington Post called her \"the twenty-first-century daughter of Chinua Achebe.\" Her award-winning Half of a Yellow Sun became an instant classic upon its publication three years later, once again putting her tremendous gifts - graceful storytelling, knowing compassion, and fierce insight into her characters' hearts - on display. Now, in her most intimate and seamlessly crafted work to date, Adichie turns her penetrating eye on not only Nigeria but America, in twelve dazzling stories that explore the ties that bind men and women, parents and children, Africa and the United States.", "In \"A Private Experience,\" a medical student hides from a violent riot with a poor Muslim woman whose dignity and faith force her to confront the realities and fears she's been pushing away. In \"Tomorrow is Too Far,\" a woman unlocks the devastating secret that surrounds her brother's death. The young mother at the center of \"Imitation\" finds her comfortable life in Philadelphia threatened when she learns that her husband has moved his mistress into their Lagos home. And the title story depicts the choking loneliness of a Nigerian girl who moves to an America that turns out to be nothing like the country she expected; though falling in love brings her desires nearly within reach, a death in her homeland forces her to reexamine them.", "Searing and profound, suffused with beauty, sorrow, and longing, these stories map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them. The Thing Around Your Neck is a resounding confirmation of the prodigious literary powers of one of our most essential writers."], "author": "Chimamanda Ngozi Adichie", "num_pages": "218", "awards": ["John Llewellyn Rhys Prize Nominee (2009)", "O. Henry Award for 'The American Embassy' (2003)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-16 00:00:00", "ISBN": "0307271072"},
{"url": "https://www.goodreads.com/book/show/131359.Death_on_the_Nile", "num_ratings": "85,904", "num_reviews": "2,941", "avg_ratings": 4.08, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Classics"], "title": "Death on the Nile", "description": ["The tranquillity of a cruise along the Nile is shattered by the discovery that Linnet Ridgeway has been shot through the head. She was young, stylish and beautiful, a girl who had everything - until she lost her life. Hercule Poirot recalls an earlier outburst by a fellow passenger: 'I'd like to put my dear little pistol against her head and just press the trigger.' Yet in", "The tranquillity of a cruise along the Nile is shattered by the discovery that Linnet Ridgeway has been shot through the head. She was young, stylish and beautiful, a girl who had everything - until she lost her life. Hercule Poirot recalls an earlier outburst by a fellow passenger: 'I'd like to put my dear little pistol against her head and just press the trigger.' Yet in this exotic setting, nothing is ever quite what it seems..."], "author": "Agatha Christie", "num_pages": "214", "awards": [], "places": ["Egypt"], "character_names": ["Colonel Race", "Simon  Doyle", "Hercule Poirot", "Linnet Ridgeway", "Jacqueline de Bellefort"], "language": "English", "publish_date": "1978-08-16 00:00:00", "ISBN": "0553119222"},
{"url": "https://www.goodreads.com/book/show/758153.Born_Free", "num_ratings": "30,298", "num_reviews": "287", "avg_ratings": 4.17, "genres": ["Nonfiction", "Animals", "Cultural", "Africa", "Biography", "Autobiography", "Memoir", "Environment", "Nature"], "title": "Born Free: A Lioness of Two Worlds", "description": ["There have been many accounts of the return to the wild of tame animals, but since its original publication in 1960, when the ", " hailed it as a \"fascinating and remarkable book,\" ", " has stood alone in its power to move us.", "Joy Adamson's story of a lion cub in transition between the captivity in which she is raised and the fearsome wild to which she is ret", "There have been many accounts of the return to the wild of tame animals, but since its original publication in 1960, when the ", " hailed it as a \"fascinating and remarkable book,\" ", " has stood alone in its power to move us.", "Joy Adamson's story of a lion cub in transition between the captivity in which she is raised and the fearsome wild to which she is returned captures the abilities of both humans and animals to cross the seemingly unbridgeable gap between their radically different worlds. Especially now, at a time when the sanctity of the wild and its inhabitants is increasingly threatened by human development and natural disaster, Adamson's remarkable tale is an idyll, and a model, to return to again and again.", "Illustrated with the same beautiful, evocative photographs that first enchanted the world forty years ago and updated with a new introduction by George Page, former host and executive editor of the PBS series ", " and author of ", " this anniversary edition introduces to a new generation one of the most heartwarming associations between man and animal."], "author": "Joy Adamson", "num_pages": "224", "awards": [], "places": ["East Africa", "Africa"], "character_names": [], "language": "English", "publish_date": "2000-05-16 00:00:00", "ISBN": "0375714383"},
{"url": "https://www.goodreads.com/book/show/264587.The_Beautyful_Ones_Are_Not_Yet_Born", "num_ratings": "2,122", "num_reviews": "150", "avg_ratings": 3.91, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Ghana", "Literature", "African Literature", "Historical", "Historical Fiction"], "title": "The Beautyful Ones Are Not Yet Born", "description": ["A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after i", "A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after independence in the 1960s. It is often claimed to rank with \"Things Fall Apart\" as one of the high points of post-colonial African Literature. ", "A quote from Chapter 6: ", "\"And where is my solid ground these days? Let us say just that the cycle from birth to decay has been short. Short, brief. But otherwise not at all unusual. And even in the decline into the end there are things that remind the longing mind of old beginnings and hold out the promise of new ones, things even like your despair itself. I have heard this pain before, only then it was multiplied many, many times, but that may only be because at that time I was not so alone, so far apart. Maybe there are other lonely voices despairing now. I will not be entranced by the voice, even if it should swell as it did in the days of hope. I will not be entranced, since I have seen the destruction of the promises it made. But I shall not resist it either. I will be like a cork. It is so surprising, is it not, how even the worst happenings of the past acquire a sweetness in the memory. Old harsh distresses are now merely pictures and tastes which hurt no more, like itching scars which can only give pleasure now. Strange, because when I can think soberly about it all, with out pushing any later joys into the deepr past, I can remember that things were terrible then. When the war was over the soldiers came back to homes broken in their absence and they themselves brought murder in their hearts and gave it to those nearest them. I saw it, not very clearly, because I had no way of understanding it, but it frightened me. We had gone on marches of victory and I do not think there was anyone mean enough in spirit to ask whether we knew what we were celebrating. Whose victory? Ours? It did not matter. We marched, and only a dishonest fool will look back on his boyhood and say he knew even then that there was no meaning in any of it. It is so funny now, to remember that we all thought we were welcoming victory. Or perhaps there is nothing funny here at all, and it is only that victory itself happens to be the identical twin of defeat. \""], "author": "Ayi Kwei Armah", "num_pages": "191", "awards": [], "places": ["Ghana"], "character_names": [], "language": "English", "publish_date": "1989-10-23 00:00:00", "ISBN": "0435905406"},
{"url": "https://www.goodreads.com/book/show/6419887-the-boy-who-harnessed-the-wind", "num_ratings": "16,650", "num_reviews": "2,762", "avg_ratings": 4.09, "genres": ["Nonfiction", "Cultural", "Africa", "Autobiography", "Memoir", "Biography", "Science"], "title": "The Boy Who Harnessed the Wind: Creating Currents of Electricity and Hope", "description": ["William Kamkwamba was born in Malawi, a country where magic ruled and modern science was mystery. It was also a land withered by drought and hunger, and a place where hope and opportunity were hard to find. But William had read about windmills in a book called Using Energy, and he dreamed of building one that would bring electricity and water to his village and change his", "William Kamkwamba was born in Malawi, a country where magic ruled and modern science was mystery. It was also a land withered by drought and hunger, and a place where hope and opportunity were hard to find. But William had read about windmills in a book called Using Energy, and he dreamed of building one that would bring electricity and water to his village and change his life and the lives of those around him. His neighbors may have mocked him and called him misala—crazy—but William was determined to show them what a little grit and ingenuity could do.", "Enchanted by the workings of electricity as a boy, William had a goal to study science in Malawi's top boarding schools. But in 2002, his country was stricken with a famine that left his family's farm devastated and his parents destitute. Unable to pay the eighty-dollar-a-year tuition for his education, William was forced to drop out and help his family forage for food as thousands across the country starved and died.", "Yet William refused to let go of his dreams. With nothing more than a fistful of cornmeal in his stomach, a small pile of once-forgotten science textbooks, and an armory of curiosity and determination, he embarked on a daring plan to bring his family a set of luxuries that only two percent of Malawians could afford and what the West considers a necessity—electricity and running water. Using scrap metal, tractor parts, and bicycle halves, William forged a crude yet operable windmill, an unlikely contraption and small miracle that eventually powered four lights, complete with homemade switches and a circuit breaker made from nails and wire. A second machine turned a water pump that could battle the drought and famine that loomed with every season.", "Soon, news of William's ", "—his \"electric wind\"—spread beyond the borders of his home, and the boy who was once called crazy became an inspiration to those around the world.", "Here is the remarkable story about human inventiveness and its power to overcome crippling adversity. ", " will inspire anyone who doubts the power of one individual's ability to change his community and better the lives of those around him."], "author": "William Kamkwamba", "num_pages": "270", "awards": ["ALA Alex Award (2010)", "Corine Internationaler Buchpreis for FOCUS Zukunftspreis (2010)"], "places": ["Malawi"], "character_names": [], "language": "English", "publish_date": "2009-09-29 00:00:00", "ISBN": "0061730327"},
{"url": "https://www.goodreads.com/book/show/4078927-little-bee", "num_ratings": "208,375", "num_reviews": "20,272", "avg_ratings": 3.71, "genres": ["Historical", "Historical Fiction", "Fiction", "Adult Fiction", "Contemporary", "Adult", "Book Club"], "title": "Little Bee", "description": ["This is the story of two women. Their lives collide one fateful day, and one of them has to make a terrible choice, the kind of choice we hope you never have to face. Two years later, they meet again - the story starts there ..."], "author": "Chris Cleave", "num_pages": "288", "awards": ["Costa Book Award Nominee for Novel (2008)", "Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Kingston-upon-Thames, London, England"], "character_names": ["Sarah O'Rourke", "Pequena Abelha", "Andrew O'Rourke", "Little Bee"], "language": "English", "publish_date": "2009-02-10 00:00:00", "ISBN": "038566530X"},
{"url": "https://www.goodreads.com/book/show/1624.West_with_the_Night", "num_ratings": "24,747", "num_reviews": "2,524", "avg_ratings": 4.18, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Cultural", "Africa", "Travel"], "title": "West with the Night", "description": [" is the story of Beryl Markham--aviator, racehorse trainer, beauty--and her life in the Kenya of the 1920s and '30s."], "author": "Beryl Markham", "num_pages": "294", "awards": [], "places": ["Kenya"], "character_names": ["Beryl Markham"], "language": "English", "publish_date": "1983-01-01 00:00:00", "ISBN": "0865471185"},
{"url": "https://www.goodreads.com/book/show/16213.The_Hot_Zone", "num_ratings": "82,777", "num_reviews": "4,188", "avg_ratings": 4.11, "genres": ["Nonfiction", "Science", "History", "Medical", "Health", "Medicine"], "title": "The Hot Zone: The Terrifying True Story of the Origins of the Ebola Virus", "description": [" A highly infectious, deadly virus from the central African rain forest suddenly appears in the suburbs of Washington, D.C. There is no cure. In a few days 90 percent of its victims are dead. A secret military SWAT team of soldiers and scientists is mobilized to stop the outbreak of this exotic \"hot", " A highly infectious, deadly virus from the central African rain forest suddenly appears in the suburbs of Washington, D.C. There is no cure. In a few days 90 percent of its victims are dead. A secret military SWAT team of soldiers and scientists is mobilized to stop the outbreak of this exotic \"hot\" virus. ", " tells this dramatic story, giving a hair-raising account of the appearance of rare and lethal viruses and their \"crashes\" into the human race. Shocking, frightening, and impossible to ignore, ", " proves that truth really is scarier than fiction."], "author": "Richard Preston", "num_pages": "352", "awards": ["Evergreen Teen Book Award (1998)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1999-06-15 00:00:00", "ISBN": "0385495226"},
{"url": "https://www.goodreads.com/book/show/28239.Dark_Star_Safari", "num_ratings": "11,131", "num_reviews": "784", "avg_ratings": 3.95, "genres": ["Travel", "Cultural", "Africa", "Nonfiction", "Autobiography", "Memoir", "Adventure"], "title": "Dark Star Safari: Overland from Cairo to Cape Town", "description": ["In ", " the wittily observant and endearingly irascible Paul Theroux takes readers the length of Africa by rattletrap bus, dugout canoe, cattle truck, armed convoy, ferry, and train. In the course of his epic and enlightening journey, he endures danger, delay, and dismaying circumstances.", "Gauging the state of affairs, he talks to Africans, aid workers, missionar", "In ", " the wittily observant and endearingly irascible Paul Theroux takes readers the length of Africa by rattletrap bus, dugout canoe, cattle truck, armed convoy, ferry, and train. In the course of his epic and enlightening journey, he endures danger, delay, and dismaying circumstances.", "Gauging the state of affairs, he talks to Africans, aid workers, missionaries, and tourists. What results is an insightful mediation on the history, politics, and beauty of Africa and its people.", "In a new postscript, Theroux recounts the dramatic events of a return to Africa to visit Zimbabwe."], "author": "Paul Theroux", "num_pages": "485", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-05 00:00:00", "ISBN": "0618446877"},
{"url": "https://www.goodreads.com/book/show/11989.The_Plague", "num_ratings": "122,879", "num_reviews": "4,036", "avg_ratings": 3.98, "genres": ["Fiction", "Classics", "Philosophy", "Cultural", "France", "Literature"], "title": "The Plague", "description": ["A gripping tale of human unrelieved horror, of survival and resilience, and of the ways in which humankind confronts death, ", " is at once a masterfully crafted novel, eloquently understated and epic in scope, and a parable of ageless moral resonance, profoundly relevant to our times. In Oran, a coastal town in North Africa, the plague begins as a series of portents", "A gripping tale of human unrelieved horror, of survival and resilience, and of the ways in which humankind confronts death, ", " is at once a masterfully crafted novel, eloquently understated and epic in scope, and a parable of ageless moral resonance, profoundly relevant to our times. In Oran, a coastal town in North Africa, the plague begins as a series of portents, unheeded by the people. It gradually becomes a omnipresent reality, obliterating all traces of the past and driving its victims to almost unearthly extremes of suffering, madness, and compassion."], "author": "Albert Camus", "num_pages": "308", "awards": ["Prix des Critiques (1947)"], "places": ["Oran"], "character_names": ["Raoul", "Dr Bernard Rieux", "Father Paneloux (Jesuit Priest)", "Joseph Grand", "Raymond Rambert", "Jean Tarrou", "Cottard", "M. Othon", "Garcia", "Gonzales", "Dr. Castel", "Dr. Richard", "Jacques Othon", "The Prefect", "Mme. Rieux", "Asthma Patient", "Marcel"], "language": "English", "publish_date": "1991-03-16 00:00:00", "ISBN": "0679720219"},
{"url": "https://www.goodreads.com/book/show/19000.The_Constant_Gardener", "num_ratings": "18,114", "num_reviews": "1,137", "avg_ratings": 3.78, "genres": ["Fiction", "Thriller", "Mystery", "Cultural", "Africa", "Spy Thriller", "Espionage"], "title": "The Constant Gardener", "description": [" ", " is a magnificent exploration of the new world order by one of the most compelling and elegant storytellers of our time. The novel opens in northern Kenya with the gruesome murder of Tessa Quayle--young, beautiful, and dearly beloved to husband Justi", " ", " is a magnificent exploration of the new world order by one of the most compelling and elegant storytellers of our time. The novel opens in northern Kenya with the gruesome murder of Tessa Quayle--young, beautiful, and dearly beloved to husband Justin. When Justin sets out on a personal odyssey to uncover the mystery of her death, what he finds could make him not only a suspect among his own colleagues, but a target for Tessa's killers as well. ", " A master chronicler of the betrayals of ordinary people caught in political conflict, John le Carre portrays the dark side of unbridled capitalism as only he can. In ", " he tells a compelling, complex story of a man elevated through tragedy as Justin Quayle--amateur gardener, aging widower, and ineffectual bureaucrat--discovers his own natural resources and the extraordinary courage of the woman he barely had time to love."], "author": "John le Carré", "num_pages": "496", "awards": [], "places": ["Nairobi", "London, England"], "character_names": ["Tessa Quayle", "Justin Quayle", "Sandy Woodrow", "Arnold Bluhm"], "language": "English", "publish_date": "2005-08-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6194.Waiting_for_the_Barbarians", "num_ratings": "20,672", "num_reviews": "1,445", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Literature", "Southern Africa", "South Africa"], "title": "Waiting for the Barbarians", "description": ["For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that bran", "For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that brands him an enemy of the state.J. M. Coetzee's prize-winning novel is a startling allegory of the war between opressor and opressed. The Magistrate is not simply a man living through a crisis of conscience in an obscure place in remote times; his situation is that of all men living in unbearable complicity with regimes that ignore justice and decency."], "author": "J.M. Coetzee", "num_pages": "152", "awards": ["James Tait Black Memorial Prize for Fiction (1980)", "Philip K. Dick Award Nominee (1982)", "CNA Literary Award", "Geoffrey Faber Memorial Prize (1981)"], "places": [], "character_names": ["The Magistrate"], "language": "English", "publish_date": "1999-10-01 00:00:00", "ISBN": "0140283358"},
{"url": "https://www.goodreads.com/book/show/17113.The_African_Trilogy", "num_ratings": "408", "num_reviews": "40", "avg_ratings": 4.27, "genres": ["Fiction", "Cultural", "Africa", "Literature", "Classics", "Historical", "Historical Fiction", "Literature", "African Literature"], "title": "The African Trilogy", "description": ["Picador 1988, the famous African Trilogy by the recently late Chinua Achebe, 'the man whose writing redefined Colonialism' Achebe was a towering literary figure whose work always repays the reader."], "author": "Chinua Achebe", "num_pages": "560", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-10-07 00:00:00", "ISBN": "0330303317"},
{"url": "https://www.goodreads.com/book/show/159334.Devil_on_the_Cross", "num_ratings": "1,016", "num_reviews": "86", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Novels", "Eastern Africa", "Kenya", "Literature"], "title": "Devil on the Cross", "description": ["This remarkable and symbolic novel centers on Wariinga's tragedy and uses it to tell a story of contemporary Kenya."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-10-23 00:00:00", "ISBN": "0435908448"},
{"url": "https://www.goodreads.com/book/show/256214.The_Emperor", "num_ratings": "4,674", "num_reviews": "273", "avg_ratings": 4.11, "genres": ["Nonfiction", "History", "Cultural", "Africa", "European Literature", "Polish Literature", "Travel", "Writing", "Journalism"], "title": "The Emperor", "description": ["After the deposition of Haile Selassie in 1974, which ended the ancient rule of the Abyssinian monarchy, Ryszard Kapuściński travelled to Ethiopia and sought out surviving courtiers to tell their stories. Here, their eloquent and ironic voices depict the lavish, corrupt world they had known - from the rituals, hierarchies and intrigues at court to the vagaries of a ruler w", "After the deposition of Haile Selassie in 1974, which ended the ancient rule of the Abyssinian monarchy, Ryszard Kapuściński travelled to Ethiopia and sought out surviving courtiers to tell their stories. Here, their eloquent and ironic voices depict the lavish, corrupt world they had known - from the rituals, hierarchies and intrigues at court to the vagaries of a ruler who maintained absolute power over his impoverished people. They describe his inexorable downfall as the Ethiopian military approach, strange omens appear in the sky and courtiers vanish, until only the Emperor and his valet remain in the deserted palace, awaiting their fate. Dramatic and mesmerising, ", " is one of the great works of reportage and a haunting epitaph on the last moments of a dying regime.", "This edition includes an introduction by Neal Ascherson."], "author": "Ryszard Kapuściński", "num_pages": "164", "awards": [], "places": ["Addis Ababa"], "character_names": ["Hailé Selassié I", "Ryszard Kapuściński"], "language": "English", "publish_date": "2006-06-01 00:00:00", "ISBN": "0141188030"},
{"url": "https://www.goodreads.com/book/show/417780.Why_Mosquitoes_Buzz_in_People_s_Ears", "num_ratings": "23,180", "num_reviews": "1,166", "avg_ratings": 4.02, "genres": ["Childrens", "Picture Books", "Childrens", "Folklore", "Cultural", "Africa", "Animals", "Fiction", "Cultural", "Fantasy", "Folk Tales", "Classics"], "title": "Why Mosquitoes Buzz in People's Ears", "description": ["\"In this Caldecott Medal winner, Mosquito tells a story that causes a jungle disaster. \"Elegance has become the Dillons' hallmark. . . . Matching the art is Aardema's uniquely onomatopoeic text . . . An impressive showpiece.\"", ", starred review."], "author": "Verna Aardema", "num_pages": "32", "awards": ["Caldecott Medal (1976)"], "places": ["West Africa"], "character_names": [], "language": null, "publish_date": "1992-08-15 00:00:00", "ISBN": "0140549056"},
{"url": "https://www.goodreads.com/book/show/77837.A_Good_Man_in_Africa", "num_ratings": "3,224", "num_reviews": "183", "avg_ratings": 3.85, "genres": ["Fiction", "Cultural", "Africa", "Humor", "Humor", "Comedy"], "title": "A Good Man in Africa", "description": ["In the small African republic of Kinjanja, British diplomat Morgan Leafy bumbles heavily through his job. His love of women, his fondness for drink, and his loathing for the country prove formidable obstacles on his road to any kind of success. But when he becomes an operative in Operation Kingpin and is charged with monitoring the front runner in Kinjanja’s national elect", "In the small African republic of Kinjanja, British diplomat Morgan Leafy bumbles heavily through his job. His love of women, his fondness for drink, and his loathing for the country prove formidable obstacles on his road to any kind of success. But when he becomes an operative in Operation Kingpin and is charged with monitoring the front runner in Kinjanja’s national elections, Morgan senses an opportunity to achieve real professional recognition and, more importantly, reassignment.", "After he finds himself being blackmailed, diagnosed with a venereal disease, attempting bribery, and confounded with a dead body, Morgan realizes that very little is going according to plan."], "author": "William  Boyd", "num_pages": "352", "awards": ["Whitbread Award for First Novel (1981)", "Somerset Maugham Award (1982)"], "places": ["Kinjanja"], "character_names": ["Morgan Leafy"], "language": "English", "publish_date": "2003-01-14 00:00:00", "ISBN": "1400030021"},
{"url": "https://www.goodreads.com/book/show/505556.Death_and_the_King_s_Horseman", "num_ratings": "2,546", "num_reviews": "161", "avg_ratings": 3.75, "genres": ["Plays", "Drama", "Cultural", "Africa", "Fiction", "Literature", "African Literature", "Western Africa", "Nigeria", "Plays", "Theatre", "Classics", "Academic", "School", "Nobel Prize"], "title": "Death and the King's Horseman: A Play", "description": ["Based on events that took place in Oyo, an ancient Yoruba city of Nigeria, in 1946, Wole Soyinka's powerful play concerns the intertwined lives of Elesin Oba, the king's chief horseman; his son, Olunde, now studying medicine in England; and Simon Pilkings, the colonial district officer. The king has died and Elesin, his chief horseman, is expected by law and custom to comm", "Based on events that took place in Oyo, an ancient Yoruba city of Nigeria, in 1946, Wole Soyinka's powerful play concerns the intertwined lives of Elesin Oba, the king's chief horseman; his son, Olunde, now studying medicine in England; and Simon Pilkings, the colonial district officer. The king has died and Elesin, his chief horseman, is expected by law and custom to commit suicide and accompany his ruler to heaven. The stage is set for a dramatic climax when Pilkings learns of the ritual and decides to intervene and Elesin's son arrives home."], "author": "Wole Soyinka", "num_pages": "80", "awards": ["Premio letterario Giuseppe Acerbi (1993)"], "places": ["Oyo"], "character_names": [], "language": "English", "publish_date": "2002-04-17 00:00:00", "ISBN": "0393322998"},
{"url": "https://www.goodreads.com/book/show/95826.Ways_of_Dying", "num_ratings": "1,301", "num_reviews": "109", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Literature", "African Literature", "Novels"], "title": "Ways of Dying", "description": ["In ", ", Zakes Mda's acclaimed first novel, Toloki is a \"professional mourner\" in a vast and violent city of the new South Africa. Day after day he attends funerals in the townships, dressed with dignity in a threadbare suit, cape, and battered top hat, to comfort the grieving families of the victims of the city's crime, racial hatred, and crippling poverty. At a", "In ", ", Zakes Mda's acclaimed first novel, Toloki is a \"professional mourner\" in a vast and violent city of the new South Africa. Day after day he attends funerals in the townships, dressed with dignity in a threadbare suit, cape, and battered top hat, to comfort the grieving families of the victims of the city's crime, racial hatred, and crippling poverty. At a Christmas day funeral for a young boy Toloki is reunited with Noria, a woman from his village. Together they help each other to heal the past, and as their story interweaves with those of their acquaintances this elegant short novel provides a magical and painful picture of South Africa today."], "author": "Zakes Mda", "num_pages": "216", "awards": ["M-Net Literary Award (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-08-01 00:00:00", "ISBN": "0312420919"},
{"url": "https://www.goodreads.com/book/show/159336.Weep_Not_Child", "num_ratings": "1,951", "num_reviews": "157", "avg_ratings": 3.85, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Eastern Africa", "Kenya", "Classics", "Literature", "Academic", "School", "Novels", "Historical", "Historical Fiction", "Literary Fiction"], "title": "Weep Not, Child", "description": ["Tells the moving story about the effects of the Mau Mau war on the lives of ordinary men and women in Kenya. In the forests, the Mau Mau are waging war against the white government, and two brothers, Kamau and Njoroge, and the rest of the family must decide where their loyalties lie."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-04-30 00:00:00", "ISBN": "0435908308"},
{"url": "https://www.goodreads.com/book/show/15852479-we-need-new-names", "num_ratings": "14,827", "num_reviews": "2,013", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "We Need New Names", "description": ["An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by", "An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by paramilitary policemen, before the school closed, before the fathers left for dangerous jobs abroad.", "But Darling has a chance to escape: she has an aunt in America. She travels to this new land in search of America's famous abundance only to find that her options as an immigrant are perilously few. NoViolet Bulawayo's debut calls to mind the great storytellers of displacement and arrival who have come before her--from Junot Diaz to Zadie Smith to J.M. Coetzee--while she tells a vivid, raw story all her own."], "author": "NoViolet Bulawayo", "num_pages": "298", "awards": ["Man Booker Prize Nominee (2013)", "Guardian First Book Award Nominee (2013)", "PEN/Hemingway Foundation Award (2014)", "Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee (2015)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)", "Betty Trask Award (2014)"], "places": ["Tsholotsho", "Detroit, Michigan", "bulawayo"], "character_names": [], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "0316230812"},
{"url": "https://www.goodreads.com/book/show/429138.River_God", "num_ratings": "29,423", "num_reviews": "1,234", "avg_ratings": 4.2, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Northern Africa", "Egypt", "Adventure", "Fantasy"], "title": "River God", "description": ["For Tanus, the fair-haired young lion of a warrior, the gods have decreed that he will lead Egypt's army in a bold attempt to reunite the Kingdom's shared halves. But Tanus will have to defy the same gods to attain the reward they have forbidden him, an object more prized than battle's glory: possession of the Lady Lostris, a rare beauty with skin the color of oiled ceder-", "For Tanus, the fair-haired young lion of a warrior, the gods have decreed that he will lead Egypt's army in a bold attempt to reunite the Kingdom's shared halves. But Tanus will have to defy the same gods to attain the reward they have forbidden him, an object more prized than battle's glory: possession of the Lady Lostris, a rare beauty with skin the color of oiled ceder--destined for the adoration of a nation, and the love of one extraordinary man."], "author": "Wilbur Smith", "num_pages": "664", "awards": [], "places": ["Egypt"], "character_names": ["Taita", "Tanus", "Lostris", "Menom", "Kratas"], "language": "English", "publish_date": "1995-02-15 00:00:00", "ISBN": "0312954468"},
{"url": "https://www.goodreads.com/book/show/35282472-in-the-shadow-of-10-000-hills", "num_ratings": "379", "num_reviews": "171", "avg_ratings": 4.26, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Africa", "Literary Fiction", "Eastern Africa", "Rwanda"], "title": "In The Shadow of 10,000 Hills", "description": ["Follow the intertwining stories of three women from diverse backgrounds, all searching for family and personal peace in post-genocide Rwanda. At the heart of this inspiring novel that bestselling author Wally Lamb calls \"an evocative page-turner\" and Caroline Leavitt calls \"blazingly original\" is the discovery of grace when there can be no forgiveness.", "In 1968, Lillian Carl", "Follow the intertwining stories of three women from diverse backgrounds, all searching for family and personal peace in post-genocide Rwanda. At the heart of this inspiring novel that bestselling author Wally Lamb calls \"an evocative page-turner\" and Caroline Leavitt calls \"blazingly original\" is the discovery of grace when there can be no forgiveness.", "In 1968, Lillian Carlson left Atlanta, disillusioned and heartbroken, after the assassination of Martin Luther King. She found meaning in the hearts of orphaned African children and cobbled together her own small orphanage in the Rift Valley alongside the lush forests of Rwanda.", "Three decades later, in New York, Rachel Shepherd, lost and heartbroken herself, embarks on a journey to find the father who abandoned her as a young child, determined to solve the enigma of Henry Shepherd, a now-famous photographer.", "When an online search turns up a clue to his whereabouts, Rachel travels to Rwanda to connect with an unsuspecting and uncooperative Lillian. While Rachel tries to unravel the mystery of her father's disappearance, she finds unexpected allies in an ex-pat doctor running from his past and a young Tutsi woman who lived through a profound experience alongside her father."], "author": "Jennifer Haupt", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-04-01 00:00:00", "ISBN": "1771681330"},
{"url": "https://www.goodreads.com/book/show/762134.Palace_Walk", "num_ratings": "11,753", "num_reviews": "1,142", "avg_ratings": 4.15, "genres": ["Fiction", "Historical", "Historical Fiction", "Northern Africa", "Egypt", "Cultural", "Africa", "Novels"], "title": "Palace Walk", "description": ["Volume I of the masterful ", ". A national best-seller in both hardcover and paperback, it introduces the engrossing saga of a Muslim family in Cairo during Egypt's occupation by British forces in the early 1900s."], "author": "Naguib Mahfouz", "num_pages": "501", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1990-08-16 00:00:00", "ISBN": "0385264666"},
{"url": "https://www.goodreads.com/book/show/6193.Life_and_Times_of_Michael_K", "num_ratings": "13,514", "num_reviews": "784", "avg_ratings": 3.85, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa"], "title": "Life and Times of Michael K", "description": [" On the way there she dies, leaving him alone in an anarchic world of brutal roving armies. Imprisoned, Michael is unable to bear confinement and escapes, determined to live with dignity. ", "goes to the centre of human experience - the need for an inte", " On the way there she dies, leaving him alone in an anarchic world of brutal roving armies. Imprisoned, Michael is unable to bear confinement and escapes, determined to live with dignity. ", "goes to the centre of human experience - the need for an interior, spiritual life, for some connections to the world in which we live, and for purity of vision."], "author": "J.M. Coetzee", "num_pages": "192", "awards": ["Man Booker Prize (1983)", "Prix Femina for Étranger (1985)", "Βραβείο Λογοτεχνικής Μετάφρασης ΕΚΕΜΕΛ for Αγγλόφωνη Λογοτεχνία (2007)"], "places": ["Capetown", "Prince Albert"], "character_names": ["Michael K"], "language": "English", "publish_date": "2004-09-02 00:00:00", "ISBN": "009947915X"},
{"url": "https://www.goodreads.com/book/show/7194279-the-secret-lives-of-baba-segi-s-wives", "num_ratings": "4,470", "num_reviews": "700", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Literature", "African Literature", "Contemporary"], "title": "The Secret Lives of Baba Segi's Wives", "description": ["African-born poet Lola Shoneyin makes her fiction debut with ", "a perceptive, entertaining, and eye-opening novel of polygamy in modern-day Nigeria. The struggles, rivalries, intricate family politics, and the interplay of personalities and relationships within the complex private world of a polygamous union come to life in ", "African-born poet Lola Shoneyin makes her fiction debut with ", "a perceptive, entertaining, and eye-opening novel of polygamy in modern-day Nigeria. The struggles, rivalries, intricate family politics, and the interplay of personalities and relationships within the complex private world of a polygamous union come to life in ", "—", " ", "and ", "set against a contemporary African background."], "author": "Lola Shoneyin", "num_pages": "280", "awards": ["Orange Prize Nominee for Fiction Longlist (2011)", "Nigeria Prize Nominee for Literature (2012)", "ANA/NDDC Ken Saro-Wiwa Prose Prize (2011)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2010-06-29 00:00:00", "ISBN": "0061946370"},
{"url": "https://www.goodreads.com/book/show/121120.Petals_of_Blood", "num_ratings": "1,401", "num_reviews": "119", "avg_ratings": 3.87, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Kenya"], "title": "Petals of Blood", "description": ["The puzzling murder of three African directors of a foreign-owned brewery sets the scene for this fervent, hard-hitting novel about disillusionment in independent Kenya. A deceptively simple tale, ", " is on the surface a suspenseful investigation of a spectacular triple murder in upcountry Kenya. Yet as the intertwined stories of the four suspects unfold, a dev", "The puzzling murder of three African directors of a foreign-owned brewery sets the scene for this fervent, hard-hitting novel about disillusionment in independent Kenya. A deceptively simple tale, ", " is on the surface a suspenseful investigation of a spectacular triple murder in upcountry Kenya. Yet as the intertwined stories of the four suspects unfold, a devastating picture emerges of a modern third-world nation whose frustrated people feel their leaders have failed them time after time. First published in 1977, this novel was so explosive that its author was imprisoned without charges by the Kenyan government. His incarceration was so shocking that newspapers around the world called attention to the case, and protests were raised by human-rights groups, scholars, and writers, including James Baldwin, Toni Morrison, Donald Barthelme, Harold Pinter, and Margaret Drabble.First time in Penguin Classics"], "author": "Ngũgĩ wa Thiong'o", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-02-22 00:00:00", "ISBN": "0143039172"},
{"url": "https://www.goodreads.com/book/show/111085.No_Longer_at_Ease", "num_ratings": "5,919", "num_reviews": "438", "avg_ratings": 3.83, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Classics", "Western Africa", "Nigeria", "Historical", "Historical Fiction"], "title": "No Longer at Ease", "description": ["An alternate cover for this ISBN can be found ", ".", "Obi Okonkwo is an idealistic young man who has now returned to Nigeria for a job in the civil service. However in his new role he finds that the way of government seems to be corruption. Obi manages to resist the bribes offered to him, but when he falls in love with an unsuitable girl, he sinks further into emotional and f", "An alternate cover for this ISBN can be found ", ".", "Obi Okonkwo is an idealistic young man who has now returned to Nigeria for a job in the civil service. However in his new role he finds that the way of government seems to be corruption. Obi manages to resist the bribes offered to him, but when he falls in love with an unsuitable girl, he sinks further into emotional and financial turmoil."], "author": "Chinua Achebe", "num_pages": "194", "awards": [], "places": ["Lagos"], "character_names": ["Obi Okonkwo"], "language": "English", "publish_date": "1994-09-16 00:00:00", "ISBN": "0385474555"},
{"url": "https://www.goodreads.com/book/show/7036.The_Kalahari_Typing_School_for_Men", "num_ratings": "32,142", "num_reviews": "1,376", "avg_ratings": 4.0, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime", "Southern Africa", "Botswana"], "title": "The Kalahari Typing School for Men", "description": ["Life is never without its problems. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Find out in this, the fourth volume in the No.1 Ladies Detective Agency series featuring Botswana's first and only lady detective.", "Now that The No. 1 Ladies’ Detective Agency (the only detective agency for ladies and others in Botswana) is established", "Life is never without its problems. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Find out in this, the fourth volume in the No.1 Ladies Detective Agency series featuring Botswana's first and only lady detective.", "Now that The No. 1 Ladies’ Detective Agency (the only detective agency for ladies and others in Botswana) is established, its founder, Precious Ramotswe, can look upon her life with pride: she’s reached her late thirties (\"the finest age to be\"), has a house, two children, a good fiancé -- Mr. J. L. B. Matekoni -- and many satisfied customers. But life is never without its problems. It turns out that her adopted son is responsible for the dead hoopoe bird in the garden; her assistant, Mma Makutsi, wants a husband and needs help with her idea to open the Kalahari Typing School for Men; yet Mma Ramotswe’s sexist rival has no trouble opening his Satisfaction Guaranteed Detective Agency across town. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Follow the continuing story of Botswana’s first lady detective in the irresistible The Kalahari Typing School for Men."], "author": "Alexander McCall Smith", "num_pages": "210", "awards": [], "places": ["Botswana"], "character_names": ["Precious Ramotswe", "Puso", "Silvia Potokwani", "Charlie the older apprentice", "Note Mokoti", "Mr. J.L.B. Matekoni", "Motholeli", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe", "Cephas Buthelezi", "Mr. Molefelo", "Tebogoå Bathopi", "Bernard Selelipeng", "Mma Selelipeng"], "language": "English", "publish_date": "2004-02-26 00:00:00", "ISBN": "0349117047"},
{"url": "https://www.goodreads.com/book/show/8745.Desert_Flower", "num_ratings": "14,623", "num_reviews": "911", "avg_ratings": 4.11, "genres": ["Nonfiction", "Biography", "Cultural", "Africa", "Autobiography", "Memoir", "Biography", "Autobiography", "Feminism", "Eastern Africa", "Somalia", "Biography Memoir", "Womens", "Contemporary"], "title": "Desert Flower", "description": ["Waris Dirie ran away from her oppressive life in the African desert when she was barely in her teens, illiterate and impoverished, with nothing to her name but a tattered shawl. She traveled alone across the dangerous Somali desert to Mogadishu—the first leg of a remarkable journey that would take her to London, where she worked as a house servant; then to nearly every cor", "Waris Dirie ran away from her oppressive life in the African desert when she was barely in her teens, illiterate and impoverished, with nothing to her name but a tattered shawl. She traveled alone across the dangerous Somali desert to Mogadishu—the first leg of a remarkable journey that would take her to London, where she worked as a house servant; then to nearly every corner of the globe as an internationally renowned fashion model; and ultimately to New York City, where she became a human rights ambassador for the U.N. ", " is her extraordinary story."], "author": "Waris Dirie", "num_pages": "240", "awards": ["Corine Internationaler Buchpreis for Sachbuch (2002)"], "places": ["Mogadishu"], "character_names": [], "language": "English", "publish_date": "2011-03-15 00:00:00", "ISBN": "0688172377"},
{"url": "https://www.goodreads.com/book/show/447434.I_Dreamed_of_Africa", "num_ratings": "2,930", "num_reviews": "173", "avg_ratings": 3.9, "genres": ["Cultural", "Africa", "Nonfiction", "Autobiography", "Memoir", "Biography", "Travel"], "title": "I Dreamed of Africa", "description": ["At the age of twenty-five, ", ", divorced and badly injured in a devastating car accident, left Italy to convalesce in Africa with the man who would become her second husband. Enchanted by the land, they established a vast ranch on the Laikipia plateau in Kenya. But Africa's splendor came with a price. Filled with pain and joy, beauty and drama, Gallman's haunting", "At the age of twenty-five, ", ", divorced and badly injured in a devastating car accident, left Italy to convalesce in Africa with the man who would become her second husband. Enchanted by the land, they established a vast ranch on the Laikipia plateau in Kenya. But Africa's splendor came with a price. Filled with pain and joy, beauty and drama, Gallman's haunting memoir \"captures perfectly the magic of Kenya\" (", ")."], "author": "Kuki Gallmann", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-04-01 00:00:00", "ISBN": "0140287442"},
{"url": "https://www.goodreads.com/book/show/7767021-who-fears-death", "num_ratings": "11,143", "num_reviews": "1,730", "avg_ratings": 3.96, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia", "Cultural", "Africa"], "title": "Who Fears Death", "description": [" In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, sh", " In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, she manages to escape, wandering farther into the desert. She gives birth to a baby girl with hair and skin the color of sand and instinctively knows that her daughter is different. She names her daughter Onyesonwu, which means \"Who Fears Death?\" in an ancient African tongue.", " Reared under the tutelage of a mysterious and traditional shaman, Onyesonwu discovers her magical destiny – to end the genocide of her people. The journey to fulfill her destiny will force her to grapple with nature, tradition, history, true love, the spiritual mysteries of her culture – and eventually death itself."], "author": "Nnedi Okorafor", "num_pages": "386", "awards": ["Nebula Award Nominee for Best Novel (2010)", "Locus Award Nominee for Best Fantasy Novel (2011)", "World Fantasy Award for Best Novel (2011)", "Grand Prix de l'Imaginaire Nominee for Roman étranger (2014)", "Prix Imaginales for Roman étranger (2014)", "Goodreads Choice Award Nominee for Fantasy (2010)", "James Tiptree Jr. Award Honor List (2010)"], "places": [], "character_names": ["Onyesonwu Ubaid-Ogundimu", "Mwita", "Najeeba", "Aro (Who Fears Death series)", "Luyu", "Binta", "Diti", "Fanasi", "Daib"], "language": "English", "publish_date": "2010-06-01 00:00:00", "ISBN": "075640617X"},
{"url": "https://www.goodreads.com/book/show/865.The_Alchemist", "num_ratings": "1,614,200", "num_reviews": "62,763", "avg_ratings": 3.84, "genres": ["Fiction", "Classics", "Fantasy", "Philosophy"], "title": "The Alchemist", "description": ["Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read t", "Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams."], "author": "Paulo Coelho", "num_pages": "197", "awards": ["NBDB National Book Award Nominee for Translation (2015)", "Grand Prix des lectrices de Elle for roman (1995)", "Premio Grinzane Cavour for Narrativa Straniera (1996)", "Corine Internationaler Buchpreis for Belletristik (2002)"], "places": ["Egypt", "Sahara Desert"], "character_names": ["Santiago", "Alchemist"], "language": "English", "publish_date": "1993-05-01 00:00:00", "ISBN": "0061122416"},
{"url": "https://www.goodreads.com/book/show/143819.They_Poured_Fire_on_Us_from_the_Sky", "num_ratings": "7,545", "num_reviews": "616", "avg_ratings": 4.17, "genres": ["Nonfiction", "Cultural", "Africa", "Autobiography", "Memoir", "History", "War", "Northern Africa", "Sudan"], "title": "They Poured Fire on Us from the Sky: The True Story of Three Lost Boys from Sudan", "description": ["Benjamin, Alepho, and Benson were raised among the Dinka tribe of Sudan. Their world was an insulated, close-knit community of grass-roofed cottages, cattle herders, and tribal councils. The lions and pythons that prowled beyond the village fences were the greatest threat they knew. All that changed the night the government-armed Murahiliin began attacking their villages.", "A", "Benjamin, Alepho, and Benson were raised among the Dinka tribe of Sudan. Their world was an insulated, close-knit community of grass-roofed cottages, cattle herders, and tribal councils. The lions and pythons that prowled beyond the village fences were the greatest threat they knew. All that changed the night the government-armed Murahiliin began attacking their villages.", "Amid the chaos, screams, conflagration, and gunfire, 5-year-old Benson and 7-year-old Benjamin fled into the dark night. Two years later, Alepho, age 7, was forced to do the same. Across the Southern Sudan, over the next 5 years, thousands of other boys did likewise, joining this stream of child refugees that became known as the Lost Boys. Their journey would take them more than 1000 miles across a war-ravaged country, through landmine-sown paths, crocodile-infested waters, and grotesque extremes of hunger, thirst, and disease. The refugee camps they eventually filtered through offered little respite from the brutality they were fleeing.", "In ", ", Alepho, Benson, and Benjamin, by turn, recount their experiences along this unthinkable journey. They vividly recall the family, friends, and tribal world they left far behind them and their desperate efforts to keep track of one another. This is a captivating memoir of Sudan and a powerful portrait of war as seen through the eyes of children. And it is, in the end, an inspiring and unforgettable tribute to the tenacity of even the youngest human spirits."], "author": "Benson Deng", "num_pages": "334", "awards": [], "places": ["Juol", "South Sudan", "Ethiopia", "Natinga", "Kenya"], "character_names": [], "language": "English", "publish_date": "2006-06-13 00:00:00", "ISBN": "1586483889"},
{"url": "https://www.goodreads.com/book/show/215758.Shake_Hands_with_the_Devil", "num_ratings": "9,370", "num_reviews": "575", "avg_ratings": 4.23, "genres": ["Nonfiction", "History", "Cultural", "Africa", "Politics", "War", "Biography", "Eastern Africa", "Rwanda"], "title": "Shake Hands with the Devil: The Failure of Humanity in Rwanda", "description": ["On the 10th anniversary of when UN peacekeepers landed in Rwanda, Random House Canada proudly publishes the unforgettable 1st-hand account of the genocide by the leader of the mission. Digging deep into shattering memories, Dallaire has written a powerful story of betrayal, naïveté, racism & international politics. His message is simple, undeniable: Never again. ", "When L", "On the 10th anniversary of when UN peacekeepers landed in Rwanda, Random House Canada proudly publishes the unforgettable 1st-hand account of the genocide by the leader of the mission. Digging deep into shattering memories, Dallaire has written a powerful story of betrayal, naïveté, racism & international politics. His message is simple, undeniable: Never again. ", "When Lt-Gen. Roméo Dallaire was called to serve as force commander of the UN intervention in Rwanda in '93, he thought he was heading off on a straightforward peacekeeping mission. Thirteen months later he flew home from Africa, broken, disillusioned & suicidal, having witnessed the slaughter of 800,000 Rwandans in 100 days. ", "In Shake Hands with the Devil, he takes readers with him on a return voyage into hell, vividly recreating the events the international community turned its back on. This book is an unsparing eyewitness account of the failure by humanity to stop the genocide, despite timely warnings. Woven thru the story of this disastrous mission is his own journey from confident Cold Warrior, to devastated UN commander, to retired general engaged in a painful struggle to find a measure of peace, hope & reconciliation. ", "This book is a personal account of his conversion from a man certain of his worth & secure in his assumptions to one conscious of his own weaknesses & failures & critical of the institutions he'd relied on. It might not sit easily with standard ideas of military leadership, but understanding what happened to him & his mission to Rwanda is crucial to understanding the moral minefields peacekeepers are forced to negotiate when we ask them to step into dirty wars."], "author": "Roméo Dallaire", "num_pages": "562", "awards": ["Shaughnessy Cohen Prize for Political Writing (2003)", "Canadian Booksellers Association Libris Award for Non‐Fiction Book (2004)"], "places": ["Rwanda"], "character_names": [], "language": "English", "publish_date": "2004-12-21 00:00:00", "ISBN": "0786715103"},
{"url": "https://www.goodreads.com/book/show/212326.Tsotsi", "num_ratings": "1,232", "num_reviews": "130", "avg_ratings": 3.68, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Contemporary"], "title": "Tsotsi", "description": [" ", "One of the world's preeminent playwrights, who could be a primary candidate for either the Nobel Prize in Literature or", " ", "One of the world's preeminent playwrights, who could be a primary candidate for either the Nobel Prize in Literature or the Nobel Peace Prize (Mel Gussow, ", "), Athol Fugard is renowned for his relentless explorations of personal and political survival in apartheid South Africa -- which include his now classic plays ", " and ", ". Fugard has written a single novel, ", " which director Gavin Hood has made into a feature film that ", " (London) calls a remarkable achievement and is South Africa s official entry for the 2006 Academy Awards. ", "Set amid the sprawling Johannesburg township of Soweto, where survival is the primary objective, ", " traces six days in the life of a ruthless young gang leader. When we meet Tsotsi, he is a man without a name (", " is Afrikaans for hoodlum ) who has repressed his past and now exists only to stage and execute vicious crimes. When he inadvertently kidnaps a baby, Tsotsi is confronted with memories of his own painful childhood, and this angry young man begins to rediscover his own humanity, dignity, and capacity to love."], "author": "Athol Fugard", "num_pages": "232", "awards": [], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "2006-01-27 00:00:00", "ISBN": "0802142680"},
{"url": "https://www.goodreads.com/book/show/7035.Morality_for_Beautiful_Girls", "num_ratings": "34,301", "num_reviews": "1,647", "avg_ratings": 3.97, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime", "Southern Africa", "Botswana"], "title": "Morality for Beautiful Girls", "description": ["Botswana PI Precious Ramotswe investigates the alleged poisoning of the brother of an important government official, and the moral character of four beauty contestants. When her business has money trouble, and problems arise at at her reliable fiance Mr J.L.B. Matekoni's Speedy Motors, she finds he is more complicated then he seems."], "author": "Alexander McCall Smith", "num_pages": "227", "awards": [], "places": ["Gaborone"], "character_names": ["Precious Ramotswe", "Puso", "Silvia Potokwani", "Charlie the older apprentice", "Note Mokoti", "Mr. J.L.B. Matekoni", "Motholeli", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe"], "language": "English", "publish_date": "2002-11-12 00:00:00", "ISBN": "1400031362"},
{"url": "https://www.goodreads.com/book/show/6282334-strength-in-what-remains", "num_ratings": "13,829", "num_reviews": "1,724", "avg_ratings": 4.01, "genres": ["Nonfiction", "Cultural", "Africa", "Biography", "Autobiography", "Memoir", "History"], "title": "Strength in What Remains: A Journey of Remembrance and Forgiveness", "description": ["Strength in What Remains is a wonderfully written, inspiring account of one man’s remarkable American journey and of the ordinary people who helped him – a brilliant testament to the power of will and of second chances.", "Tracy Kidder, winner of the Pulitzer Prize and author of the bestsellers The Soul of a New Machine, House, and the enduring classic Mountains Beyond Mountai", "Strength in What Remains is a wonderfully written, inspiring account of one man’s remarkable American journey and of the ordinary people who helped him – a brilliant testament to the power of will and of second chances.", "Tracy Kidder, winner of the Pulitzer Prize and author of the bestsellers The Soul of a New Machine, House, and the enduring classic Mountains Beyond Mountains, has been described by the Baltimore Sun as the “master of the non-fiction narrative.” In this new book, Kidder gives us the superb story of a hero for our time. Strength in What Remains is a wonderfully written, inspiring account of one man’s remarkable American journey and of the ordinary people who helped him – a brilliant testament to the power of will and of second chances. ", "Deo arrives in America from Burundi in search of a new life. Having survived a civil war and genocide, plagued by horrific dreams, he lands at JFK airport with two hundred dollars, no English, and no contacts. He ekes out a precarious existence delivering groceries, living in Central Park, and learning English by reading dictionaries in bookstores. Then Deo begins to meet the strangers who will change his life, pointing him eventually in the direction of Columbia University, medical school, and a life devoted to healing. Kidder breaks new ground in telling this unforgettable story as he travels with Deo back over a turbulent life in search of meaning and forgiveness. ", "An extraordinary writer, Tracy Kidder once again shows us what it means to be fully human by telling a story about the heroism inherent in ordinary people, a story about a life based on hope."], "author": "Tracy Kidder", "num_pages": "277", "awards": ["Los Angeles Times Book Prize Nominee for Current Interest (2009)", "National Book Critics Circle Award Nominee for General Nonfiction (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-25 00:00:00", "ISBN": "1400066212"},
{"url": "https://www.goodreads.com/book/show/2643182-the-house-at-sugar-beach", "num_ratings": "6,437", "num_reviews": "898", "avg_ratings": 3.87, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Africa", "Western Africa", "Liberia", "Biography"], "title": "The House at Sugar Beach", "description": ["Journalist Helene Cooper examines the violent past of her home country Liberia and the effects of its 1980 military coup in this deeply personal memoir and finalist for the 2008 National Book Critics Circle Award.", "Helene Cooper is “Congo,” a descendant of two Liberian dynasties—traced back to the first ship of freemen that set sail from New York in 1820 to found Monrovia. H", "Journalist Helene Cooper examines the violent past of her home country Liberia and the effects of its 1980 military coup in this deeply personal memoir and finalist for the 2008 National Book Critics Circle Award.", "Helene Cooper is “Congo,” a descendant of two Liberian dynasties—traced back to the first ship of freemen that set sail from New York in 1820 to found Monrovia. Helene grew up at Sugar Beach, a twenty-two-room mansion by the sea. Her childhood was filled with servants, flashy cars, a villa in Spain, and a farmhouse up-country. It was also an African childhood, filled with knock foot games and hot pepper soup, heartmen and neegee. When Helene was eight, the Coopers took in a foster child—a common custom among the Liberian elite. Eunice, a Bassa girl, suddenly became known as “Mrs. Cooper’s daughter.”", "For years the Cooper daughters—Helene, her sister Marlene, and Eunice—blissfully enjoyed the trappings of wealth and advantage. But Liberia was like an unwatched pot of water left boiling on the stove. And on April 12, 1980, a group of soldiers staged a coup d'état, assassinating President William Tolbert and executing his cabinet. The Coopers and the entire Congo class were now the hunted, being imprisoned, shot, tortured, and raped. After a brutal daylight attack by a ragtag crew of soldiers, Helene, Marlene, and their mother fled Sugar Beach, and then Liberia, for America. They left Eunice behind.", "A world away, Helene tried to assimilate as an American teenager. At the University of North Carolina at Chapel Hill she found her passion in journalism, eventually becoming a reporter for the Wall Street Journal and the New York Times. She reported from every part of the globe—except Africa—as Liberia descended into war-torn, third-world hell.", "In 2003, a near-death experience in Iraq convinced Helene that Liberia—and Eunice—could wait no longer. At once a deeply personal memoir and an examination of a violent and stratified country, The House at Sugar Beach tells of tragedy, forgiveness, and transcendence with unflinching honesty and a survivor's gentle humor. And at its heart, it is a story of Helene Cooper’s long voyage home."], "author": "Helene Cooper", "num_pages": "354", "awards": ["National Book Critics Circle Award Nominee for Autobiography (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-02 00:00:00", "ISBN": "0743266242"},
{"url": "https://www.goodreads.com/book/show/61118.My_Traitor_s_Heart", "num_ratings": "3,034", "num_reviews": "182", "avg_ratings": 4.22, "genres": ["Cultural", "Africa", "Nonfiction", "Southern Africa", "South Africa", "Autobiography", "Memoir", "History", "Biography"], "title": "My Traitor's Heart: A South African Exile Returns to Face His Country, His Tribe, and His Conscience", "description": ["A classic of literary nonfiction, My Traitor's Heart has been acclaimed as a masterpiece by readers around the world. Rian Malan is an Afrikaner, scion of a centuries-old clan and relative of the architect of apartheid, who fled South Africa after coming face-to-face with the atrocities and terrors of an undeclared civil war between the races. This book is the searing acco", "A classic of literary nonfiction, My Traitor's Heart has been acclaimed as a masterpiece by readers around the world. Rian Malan is an Afrikaner, scion of a centuries-old clan and relative of the architect of apartheid, who fled South Africa after coming face-to-face with the atrocities and terrors of an undeclared civil war between the races. This book is the searing account of his return after eight years of uneasy exile. Armed with new insight and clarity, Malan explores apartheid's legacy of hatred and suffering, bearing witness to the extensive physical and emotional damage it has caused to generations of South Africans on both sides of the color line. Plumbing the darkest recesses of the white and black South African psyches, Malan ultimately finds his way toward the light of redemption and healing. My Traitor's Heart is an astonishing book -- beautiful, horrifying, profound, and impossible to put down."], "author": "Rian Malan", "num_pages": "368", "awards": [], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "2000-03-09 00:00:00", "ISBN": "0802136842"},
{"url": "https://www.goodreads.com/book/show/210722.The_Joys_of_Motherhood", "num_ratings": "3,782", "num_reviews": "282", "avg_ratings": 4.06, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria", "Feminism"], "title": "The Joys of Motherhood", "description": ["Nnu Ego is a woman who gives all her energy, money and everything she has to raising her children - leaving her little time to make friends."], "author": "Buchi Emecheta", "num_pages": "224", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1994-02-04 00:00:00", "ISBN": "043590972X"},
{"url": "https://www.goodreads.com/book/show/77829.Brazzaville_Beach", "num_ratings": "4,109", "num_reviews": "310", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "Africa", "Novels"], "title": "Brazzaville Beach", "description": ["In the heart of a civil war-torn African nation, primate researcher Hope Clearwater made a shocking discovery about apes and man . . .", "Young, alone, and far from her family in Britain, Hope Clearwater contemplates the extraordinary events that left her washed up like driftwood on Brazzaville Beach. It is here, on the distant, lonely outskirts of Africa, where she must come", "In the heart of a civil war-torn African nation, primate researcher Hope Clearwater made a shocking discovery about apes and man . . .", "Young, alone, and far from her family in Britain, Hope Clearwater contemplates the extraordinary events that left her washed up like driftwood on Brazzaville Beach. It is here, on the distant, lonely outskirts of Africa, where she must come to terms with the perplexing and troubling circumstances of her recent past. For Hope is a survivor of the devastating cruelities of apes and humans alike. And to move forward, she must first grasp some hard and elusive truths: about marriage and madness, about the greed and savagery of charlatan science . . . and about what compels seemingly benign creatures to kill for pleasure alone."], "author": "William  Boyd", "num_pages": "320", "awards": ["James Tait Black Memorial Prize for Fiction (1990)"], "places": ["Republic of the Congo"], "character_names": ["Hope Clearwater", "Eugene Mallabar", "John Clearwater", "Usman Shoukry"], "language": "English", "publish_date": "1995-08-01 00:00:00", "ISBN": "0380780496"},
{"url": "https://www.goodreads.com/book/show/836746.A_Grain_of_Wheat", "num_ratings": "3,068", "num_reviews": "170", "avg_ratings": 3.83, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Kenya", "Historical", "Historical Fiction", "Literature", "African Literature"], "title": "A Grain of Wheat", "description": ["Set in the wake of the Mau Mau rebellion and on the cusp of Kenya's independence from Britain, A Grain of Wheat follows a group of villagers whose lives have been transformed by the 1952–1960 Emergency. At the center of it all is the reticent Mugo, the village's chosen hero and a man haunted by a terrible secret. As we learn of the villagers' tangled histories in a narrati", "Set in the wake of the Mau Mau rebellion and on the cusp of Kenya's independence from Britain, A Grain of Wheat follows a group of villagers whose lives have been transformed by the 1952–1960 Emergency. At the center of it all is the reticent Mugo, the village's chosen hero and a man haunted by a terrible secret. As we learn of the villagers' tangled histories in a narrative interwoven with myth and peppered with allusions to real-life leaders, including Jomo Kenyatta, a masterly story unfolds in which compromises are forced, friendships are betrayed, and loves are tested."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "247", "awards": [], "places": ["East Africa"], "character_names": [], "language": "English", "publish_date": "1994-01-01 00:00:00", "ISBN": "0435909878"},
{"url": "https://www.goodreads.com/book/show/595069.Into_Africa", "num_ratings": "4,717", "num_reviews": "379", "avg_ratings": 4.07, "genres": ["History", "Nonfiction", "Cultural", "Africa", "Adventure", "Biography", "Travel"], "title": "Into Africa: The Epic Adventures of Stanley & Livingstone", "description": ["With the utterance of a single line--\"Doctor Livingstone, I presume?\"--a remote meeting in the heart of Africa was transformed into one of the most famous encounters in exploration history. But the true story behind Dr. David Livingstone and journalist Henry Morton Stanley is one that has escaped telling. ", "is an extraordinarily researched account of a thrilling", "With the utterance of a single line--\"Doctor Livingstone, I presume?\"--a remote meeting in the heart of Africa was transformed into one of the most famous encounters in exploration history. But the true story behind Dr. David Livingstone and journalist Henry Morton Stanley is one that has escaped telling. ", "is an extraordinarily researched account of a thrilling adventure--defined by alarming foolishness, intense courage, and raw human achievement.", "In the mid-1860s, exploration had reached a plateau. The seas and continents had been mapped, the globe circumnavigated. Yet one vexing puzzle remained unsolved: what was the source of the mighty Nile river? Aiming to settle the mystery once and for all, Great Britain called upon its legendary explorer, Dr. David Livingstone, who had spent years in Africa as a missionary. In March 1866, Livingstone steered a massive expedition into the heart of Africa. In his path lay nearly impenetrable, uncharted terrain, hostile cannibals, and deadly predators. Within weeks, the explorer had vanished without a trace. Years passed with no word.", "While debate raged in England over whether Livingstone could be found--or rescued--from a place as daunting as Africa, James Gordon Bennett, Jr., the brash American newspaper tycoon, hatched a plan to capitalize on the world's fascination with the missing legend. He would send a young journalist, Henry Morton Stanley, into Africa to search for Livingstone. A drifter with great ambition, but little success to show for it, Stanley undertook his assignment with gusto, filing reports that would one day captivate readers and dominate the front page of the ", ".", "Tracing the amazing journeys of Livingstone and Stanley in alternating chapters, author Martin Dugard captures with breathtaking immediacy the perils and challenges these men faced. Woven into the narrative, Dugard tells an equally compelling story of the remarkable transformation that occurred over the course of nine years, as Stanley rose in power and prominence and Livingstone found himself alone and in mortal danger. The first book to draw on modern research and to explore the combination of adventure, politics, and larger-than-life personalities involved, ", " is a riveting read."], "author": "Martin Dugard", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-13 00:00:00", "ISBN": "0767910745"},
{"url": "https://www.goodreads.com/book/show/126151.Kaffir_Boy", "num_ratings": "13,670", "num_reviews": "688", "avg_ratings": 4.14, "genres": ["Nonfiction", "Cultural", "Africa", "Autobiography", "Memoir", "Biography", "History", "Southern Africa", "South Africa"], "title": "Kaffir Boy: An Autobiography", "author": "Mark Mathabane", "num_pages": "354", "awards": [], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "1998-10-07 00:00:00", "ISBN": "0684848287"},
{"url": "https://www.goodreads.com/book/show/416108.The_Scramble_for_Africa", "num_ratings": "1,726", "num_reviews": "108", "avg_ratings": 4.12, "genres": ["History", "Cultural", "Africa", "Nonfiction", "History", "World History", "Politics"], "title": "The Scramble for Africa: The White Man's Conquest of the Dark Continent from 1876 to 1912", "author": "Thomas Pakenham", "num_pages": "800", "awards": ["WH Smith Literary Award (1992)", "Alan Paton Award (1992)"], "places": [], "character_names": ["Charles George Gordon", "Otto von Bismarck", "Leopold II of Belgium", "David Livingstone", "Henry Morton Stanley"], "language": "English", "publish_date": "1992-12-01 00:00:00", "ISBN": "0380719991"},
{"url": "https://www.goodreads.com/book/show/891224.Whatever_You_Do_Don_t_Run", "num_ratings": "7,145", "num_reviews": "746", "avg_ratings": 3.94, "genres": ["Nonfiction", "Travel", "Cultural", "Africa", "Animals", "Autobiography", "Memoir", "Humor", "Adventure"], "title": "Whatever You Do, Don't Run: True Tales of a Botswana Safari Guide", "description": ["A hilarious, highly original collection of essays based on the Botswana truism: \"only food runs!\"In the tradition of Bill Bryson, a new writer brings us the lively adventures and biting wit of an African safari guide. Peter Allison gives us the guide's-eye view of living in the bush, confronting the world's fiercest terrain of wild animals and, most challenging of all, man", "A hilarious, highly original collection of essays based on the Botswana truism: \"only food runs!\"In the tradition of Bill Bryson, a new writer brings us the lively adventures and biting wit of an African safari guide. Peter Allison gives us the guide's-eye view of living in the bush, confronting the world's fiercest terrain of wild animals and, most challenging of all, managing herds of gaping tourists. Passionate for the animals of the Kalahari, Allison works as a top safari guide in the wildlife-rich Okavango Delta. As he serves the whims of his wealthy clients, he often has to stop the impulse to run as far away from them as he can, as these tourists are sometimes more dangerous than a pride of lions. No one could make up these outrageous-but-true tales: the young woman who rejected the recommended safari-friendly khaki to wear a more \"fashionable\" hot pink ensemble; the lost tourist who happened to be drunk, half-naked, and a member of the British royal family; establishing a real friendship with the continent's most vicious animal; the Japanese tourist who requested a repeat performance of Allison's being charged by a lion so he could videotape it; and spending a crazy night in the wild after blowing a tire on a tour bus, revealing that Allison has as much good-natured scorn for himself. The author's humor is exceeded only by his love and respect for the animals, and his goal is to limit any negative exposure to humans by planning trips that are minimally invasive--unfortunately it doesn't always work out that way! Peter Allison is originally from Sydney, Australia. His safaris have been featured in National Geographic, Conde Nast Traveler, and on television programs such as Jack Hanna's Animal Adventures. He travels frequently to speaking appearances, and splits most of his time between Botswana, Sydney, and San Francisco."], "author": "Peter Allison", "num_pages": "246", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-01 00:00:00", "ISBN": "0762745657"},
{"url": "https://www.goodreads.com/book/show/201111.Unbowed", "num_ratings": "3,306", "num_reviews": "471", "avg_ratings": 4.05, "genres": ["Cultural", "Africa", "Autobiography", "Memoir", "Nonfiction", "Biography", "Eastern Africa", "Kenya", "Feminism", "Environment"], "title": "Unbowed: A Memoir", "description": ["Hugely charismatic, humble, and possessed of preternatural luminosity of spirit, Wangari Maathai, recounts her extraordinary life as a political activist, feminist, and environmentalist in Kenya.", "Hugely charismatic, humble, and possessed of preternatural luminosity of spirit, Wangari Maathai, the winner of the 2004 Nobel Peace Prize and a single mother of three, recounts he", "Hugely charismatic, humble, and possessed of preternatural luminosity of spirit, Wangari Maathai, recounts her extraordinary life as a political activist, feminist, and environmentalist in Kenya.", "Hugely charismatic, humble, and possessed of preternatural luminosity of spirit, Wangari Maathai, the winner of the 2004 Nobel Peace Prize and a single mother of three, recounts her extraordinary life as a political activist, feminist, and environmentalist in Kenya. ", "Born in a rural village in 1940, Wangari Maathai was already an iconoclast as a child, determined to get an education even though most girls were uneducated. We see her studying with Catholic missionaries, earning bachelor’s and master’s degrees in the United States, and becoming the first woman both to earn a PhD in East and Central Africa and to head a university department in Kenya. We witness her numerous run-ins with the brutal Moi government. She makes clear the political and personal reasons that compelled her, in 1977, to establish the Green Belt Movement, which spread from Kenya across Africa and which helps restore indigenous forests while assisting rural women by paying them to plant trees in their villages. We see how Maathai’s extraordinary courage and determination helped transform Kenya’s government into the democracy in which she now serves as assistant minister for the environment and as a member of Parliament. And we are with her as she accepts the Nobel Peace Prize, awarded in recognition of her “contribution to sustainable development, human rights, and peace.” ", "In Unbowed, Wangari Maathai offers an inspiring message of hope and prosperity through self-sufficiency."], "author": "Wangari Maathai", "num_pages": "352", "awards": ["Hurston/Wright Legacy Award for Nonfiction (2007)"], "places": ["Kenya"], "character_names": [], "language": "English", "publish_date": "2006-10-03 00:00:00", "ISBN": "0307263487"},
{"url": "https://www.goodreads.com/book/show/101094.The_Famished_Road", "num_ratings": "9,613", "num_reviews": "658", "avg_ratings": 3.73, "genres": ["Fiction", "Cultural", "Africa", "Magical Realism", "Fantasy", "Western Africa", "Nigeria", "Novels", "Literature", "African Literature", "Literary Fiction", "Literature", "20th Century", "Classics"], "title": "The Famished Road", "description": ["In the decade since it won the Booker Prize, Ben Okri's ", " has become a classic. Like Salman Rushdie's ", " or Gabriel Garcia Marquez's ", ", it combines brilliant narrative technique with a fresh vision to create an essential work of world literature.", "The narrator, Azaro, is an ", ", a spirit child, who in the Yoruba trad", "In the decade since it won the Booker Prize, Ben Okri's ", " has become a classic. Like Salman Rushdie's ", " or Gabriel Garcia Marquez's ", ", it combines brilliant narrative technique with a fresh vision to create an essential work of world literature.", "The narrator, Azaro, is an ", ", a spirit child, who in the Yoruba tradition of Nigeria exists between life and death. The life he foresees for himself and the tale he tells is full of sadness and tragedy, but inexplicably he is born with a smile on his face. Nearly called back to the land of the dead, he is resurrected. But in their efforts to save their child, Azaro's loving parents are made destitute. The tension between the land of the living, with its violence and political struggles, and the temptations of the carefree kingdom of the spirits propels this latter-day Lazarus's story."], "author": "Ben Okri", "num_pages": "512", "awards": ["Man Booker Prize (1991)", "Premio Grinzane Cavour Nominee for Narrativa Straniera (1994)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1993-06-01 00:00:00", "ISBN": "0385425139"},
{"url": "https://www.goodreads.com/book/show/57485.Wizard_of_the_Crow", "num_ratings": "2,140", "num_reviews": "298", "avg_ratings": 4.17, "genres": ["Fiction", "Cultural", "Africa", "Magical Realism", "Literature", "African Literature", "Fantasy", "Eastern Africa", "Kenya"], "title": "Wizard of the Crow", "description": ["From the exiled Kenyan novelist, playwright, poet, and literary critic--a magisterial comic novel that is certain to take its place as a landmark of postcolonial African literature.", "In exile now for more than twenty years, Ngũgĩ wa Thiong'o has become one of the most widely read African writers of our time, the power and scope of his work garnering him international attenti", "From the exiled Kenyan novelist, playwright, poet, and literary critic--a magisterial comic novel that is certain to take its place as a landmark of postcolonial African literature.", "In exile now for more than twenty years, Ngũgĩ wa Thiong'o has become one of the most widely read African writers of our time, the power and scope of his work garnering him international attention and praise. His aim in ", " is, in his own words,nothing less than “to sum up Africa of the twentieth century in the context of two thousand years of world history.”", "Commencing in “our times” and set in the “Free Republic of Aburĩria,” the novel dramatizes with corrosive humor and keenness of observation a battle for control of the souls of the Aburĩrian people. Among the contenders: His High Mighty Excellency; the eponymous Wizard, an avatar of folklore and wisdom; the corrupt Christian Ministry; and the nefarious Global Bank. Fashioning the stories of the powerful and the ordinary into a dazzling mosaic, ", " reveals humanity in all its endlessly surprising complexity.", "Informed by richly enigmatic traditional African storytelling, ", " is a masterpiece, the crowning achievement in Ngugl wa Thiong’o’s career thus far."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "768", "awards": ["California Book Award for Fiction (Gold) (2006)", "Independent Foreign Fiction Prize Nominee for Longlist (2007)", "Tähtifantasia Award (2008)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Republic of Aburiria"], "character_names": [], "language": "English", "publish_date": "2006-08-08 00:00:00", "ISBN": "037542248X"},
{"url": "https://www.goodreads.com/book/show/111050.July_s_People", "num_ratings": "5,468", "num_reviews": "433", "avg_ratings": 3.54, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Historical", "Historical Fiction", "Novels"], "title": "July's People", "description": ["For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable lo", "For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable look into the terrifying, tacit understandings and misunderstandings between blacks and whites."], "author": "Nadine Gordimer", "num_pages": "160", "awards": ["Premio Grinzane Cavour Nominee for Narrativa Straniera (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "1982-07-29 00:00:00", "ISBN": "0140061401"},
{"url": "https://www.goodreads.com/book/show/27586.In_the_Footsteps_of_Mr_Kurtz", "num_ratings": "2,392", "num_reviews": "132", "avg_ratings": 3.98, "genres": ["Cultural", "Africa", "History", "Nonfiction", "Politics", "Biography"], "title": "In the Footsteps of Mr. Kurtz: Living on the Brink of Disaster in Mobutu's Congo", "description": ["He was known as \"the Leopard,\" and for the thirty-two years of his reign Mobutu Sese Seko, president of Zaire, showed all the cunning of his namesake, seducing Western powers, buying up the opposition, and dominating his people with a devastating combination of brutality and charm. While the population was pauperized, he plundered the country's copper and diamond resources", "He was known as \"the Leopard,\" and for the thirty-two years of his reign Mobutu Sese Seko, president of Zaire, showed all the cunning of his namesake, seducing Western powers, buying up the opposition, and dominating his people with a devastating combination of brutality and charm. While the population was pauperized, he plundered the country's copper and diamond resources, downing pink champagne in his jungle palace like some modern-day reincarnation of Joseph Conrad's crazed station manager.", "Michela Wrong, a correspondent who witnessed firsthand Mobutu's last days, traces the rise and fall of the idealistic young journalist who became the stereotype of an African despot. Engrossing, highly readable, and as funny as it is tragic, her book assesses how Belgium's King Leopold, the CIA, and the World Bank all helped to bring about the disaster that is now the Democratic Republic of Congo. If, in this poignant account, the villains are the \"Big Vegetables\" (", ") — the fat cats who benefited from Mobutu's largesse — the heroes are the ordinary citizens trapped in a parody of a state. Living in the shadow of a disintegrating nuclear reactor, where banknotes are not worth the paper they are printed on, they have turned survival into an art form. For all its valuable insights into Africa's colonial heritage and the damage done by Western intervention, ", " is ultimately a celebration of the irrepressible human spirit."], "author": "Michela Wrong", "num_pages": "338", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-05-28 00:00:00", "ISBN": "0060934433"},
{"url": "https://www.goodreads.com/book/show/5137.The_Flame_Trees_of_Thika", "num_ratings": "4,703", "num_reviews": "233", "avg_ratings": 4.12, "genres": ["Cultural", "Africa", "Autobiography", "Memoir", "Nonfiction", "Biography", "Eastern Africa", "Kenya"], "title": "The Flame Trees of Thika: Memories of an African Childhood", "description": ["In an open cart Elspeth Huxley set off with her parents to travel to Thika in Kenya. As pioneering settlers, they built a house of grass, ate off a damask cloth spread over packing cases, and discovered—the hard way—the world of the African. With an extraordinary gift for detail and a keen sense of humor, Huxley recalls her childhood on the small farm at a time when Europe", "In an open cart Elspeth Huxley set off with her parents to travel to Thika in Kenya. As pioneering settlers, they built a house of grass, ate off a damask cloth spread over packing cases, and discovered—the hard way—the world of the African. With an extraordinary gift for detail and a keen sense of humor, Huxley recalls her childhood on the small farm at a time when Europeans waged their fortunes on a land that was as harsh as it was beautiful. For a young girl, it was a time of adventure and freedom, and Huxley paints an unforgettable portrait of growing up among the Masai and Kikuyu people, discovering both the beauty and the terrors of the jungle, and enduring the rugged realities of the pioneer life."], "author": "Elspeth Huxley", "num_pages": "281", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-02-01 00:00:00", "ISBN": "0141183780"},
{"url": "https://www.goodreads.com/book/show/10046142-dancing-in-the-glory-of-monsters", "num_ratings": "3,055", "num_reviews": "237", "avg_ratings": 4.15, "genres": ["History", "Cultural", "Africa", "Nonfiction"], "title": "Dancing in the Glory of Monsters: The Collapse of the Congo and the Great War of Africa", "description": ["At the heart of Africa is Congo, a country the size of Western Europe, bordering nine other nations, that since 1996 has been wracked by a brutal and unstaunchable war in which millions have died. And yet, despite its epic proportions, it has received little sustained media attention. In this deeply reported book, Jason Stearns vividly tells the story of this misunderstood", "At the heart of Africa is Congo, a country the size of Western Europe, bordering nine other nations, that since 1996 has been wracked by a brutal and unstaunchable war in which millions have died. And yet, despite its epic proportions, it has received little sustained media attention. In this deeply reported book, Jason Stearns vividly tells the story of this misunderstood conflict through the experiences of those who engineered and perpetrated it. He depicts village pastors who survived massacres, the child soldier assassin of President Kabila, a female Hutu activist who relives the hunting and methodical extermination of fellow refugees, and key architects of the war that became as great a disaster as--and was a direct consequence of--the genocide in neighboring Rwanda. Through their stories, he tries to understand why such mass violence made sense, and why stability has been so elusive.", "Through their voices, and an astonishing wealth of knowledge and research, Stearns chronicles the political, social, and moral decay of the Congolese State."], "author": "Jason  Stearns", "num_pages": "400", "awards": ["Arthur Ross Book Award for Silver Medal (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-29 00:00:00", "ISBN": "1586489291"},
{"url": "https://www.goodreads.com/book/show/152622.Decolonising_the_Mind", "num_ratings": "1,225", "num_reviews": "76", "avg_ratings": 4.3, "genres": ["Nonfiction", "Cultural", "Africa", "Politics", "History", "Philosophy", "Theory", "Humanities", "Language", "Literature", "Post Colonial", "Literature", "African Literature", "Criticism", "Literary Criticism", "Humanities", "Linguistics"], "title": "Decolonising the Mind: The Politics of Language in African Literature", "description": ["Ngugi describes this book as \"a summary of some of the issues in which I have been passionately involved for the last twenty years of my practice in fiction, theatre, criticism and in the teaching of literature.", "In the eighteenth and nineteenth centuries Europe stole art treasures from Africa to decorate their houses and museums; in the twentieth century Europe is stealing", "Ngugi describes this book as \"a summary of some of the issues in which I have been passionately involved for the last twenty years of my practice in fiction, theatre, criticism and in the teaching of literature.", "In the eighteenth and nineteenth centuries Europe stole art treasures from Africa to decorate their houses and museums; in the twentieth century Europe is stealing the treasures of the mind to enrich their languages and cultures....\""], "author": "Ngũgĩ wa Thiong'o", "num_pages": "114", "awards": [], "places": ["Kenya"], "character_names": [], "language": "English", "publish_date": "1986-07-16 00:00:00", "ISBN": "0435080164"},
{"url": "https://www.goodreads.com/book/show/178460.Slave", "num_ratings": "6,574", "num_reviews": "518", "avg_ratings": 4.3, "genres": ["Nonfiction", "Cultural", "Africa", "Biography", "Autobiography", "Memoir", "Biography", "Autobiography"], "title": "Slave: My True Story", "description": ["Mende Nazer lost her childhood at age twelve, when she was sold into slavery. It all began one horrific night in 1993, when Arab raiders swept through her Nuba village, murdering the adults and rounding up thirty-one children, including Mende.", " Mende was sold to a wealthy Arab family who lived in Sudan's capital city, Khartoum. So began her dark years of enslavement. Her Ar", "Mende Nazer lost her childhood at age twelve, when she was sold into slavery. It all began one horrific night in 1993, when Arab raiders swept through her Nuba village, murdering the adults and rounding up thirty-one children, including Mende.", " Mende was sold to a wealthy Arab family who lived in Sudan's capital city, Khartoum. So began her dark years of enslavement. Her Arab owners called her \"Yebit,\" or \"black slave.\" She called them \"master.\" She was subjected to appalling physical, sexual, and mental abuse. She slept in a shed and ate the family leftovers like a dog. She had no rights, no freedom, and no life of her own.", " Normally, Mende's story never would have come to light. But seven years after she was seized and sold into slavery, she was sent to work for another master—a diplomat working in the United Kingdom. In London, she managed to make contact with other Sudanese, who took pity on her. In September 2000, she made a dramatic break for freedom.", " is a story almost beyond belief. It depicts the strength and dignity of the Nuba tribe. It recounts the savage way in which the Nuba and their ancient culture are being destroyed by a secret modern-day trade in slaves. Most of all, it is a remarkable testimony to one young woman's unbreakable spirit and tremendous courage."], "author": "Mende Nazer", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-27 00:00:00", "ISBN": "1586483188"},
{"url": "https://www.goodreads.com/book/show/65249.A_Dry_White_Season", "num_ratings": "2,976", "num_reviews": "184", "avg_ratings": 4.04, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "South Africa", "Historical", "Historical Fiction"], "title": "A Dry White Season", "description": ["As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple", "As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple, apolitical man, he believes in the essential fairness of the South African government and its policies—until the sudden arrest and subsequent \"suicide\" of a black janitor from Du Toit's school. Haunted by new questions and desperate to believe that the man's death was a tragic accident, Du Toit undertakes an investigation into the terrible affair—a quest for the truth that will have devastating consequences for the teacher and his family, as it draws him into a lethal morass of lies, corruption, and murder."], "author": "André Brink", "num_pages": "316", "awards": ["Prix Médicis Etranger (1980)"], "places": ["Johannesburg"], "character_names": [], "language": "English", "publish_date": "2006-09-19 00:00:00", "ISBN": "0061138630"},
{"url": "https://www.goodreads.com/book/show/669780.Season_of_Migration_to_the_North", "num_ratings": "15,293", "num_reviews": "1,931", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Northern Africa", "Sudan", "Literature"], "title": "Season of Migration to the North", "description": ["After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into", "After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into his confidence, telling him the story of his own years in London, of his brilliant career as an economist, and of the series of fraught and deadly relationships with European women that led to a terrible public reckoning and his return to his native land.", "But what is the meaning of Mustafa’s shocking confession? Mustafa disappears without explanation, leaving the young man—whom he has asked to look after his wife—in an unsettled and violent no-man’s-land between Europe and Africa, tradition and innovation, holiness and defilement, and man and woman, from which no one will escape unaltered or unharmed.", "Season of Migration to the North is a rich and sensual work of deep honesty and incandescent lyricism. In 2001 it was selected by a panel of Arab writers and critics as the most important Arab novel of the twentieth century."], "author": "Tayeb Salih", "num_pages": "176", "awards": [], "places": ["North Africa"], "character_names": [], "language": "English", "publish_date": "1970-01-01 00:00:00", "ISBN": "0435900668"},
{"url": "https://www.goodreads.com/book/show/232577.Gorillas_in_the_Mist", "num_ratings": "17,549", "num_reviews": "180", "avg_ratings": 4.17, "genres": ["Nonfiction", "Science", "Animals", "Cultural", "Africa", "Biography", "Autobiography", "Memoir", "Environment", "Nature"], "title": "Gorillas in the Mist", "author": "Dian Fossey", "num_pages": "326", "awards": [], "places": [], "character_names": ["Dian Fossey", "Digit"], "language": "English", "publish_date": "2000-10-06 00:00:00", "ISBN": "061808360X"},
{"url": "https://www.goodreads.com/book/show/185540.The_Fate_of_Africa", "num_ratings": "5,124", "num_reviews": "408", "avg_ratings": 4.16, "genres": ["History", "Cultural", "Africa", "Nonfiction", "Politics"], "title": "The Fate of Africa: A History of Fifty Years of Independence", "description": ["\"The fortunes of Africa have changed dramatically in the fifty years since the independence era began. As Europe's colonial powers withdrew, dozens of new states were launched amid much jubilation and to the world's applause. African leaders stepped forward with energy and enthusiasm to tackle the problems of development and nation-building, boldly proclaiming their hopes", "\"The fortunes of Africa have changed dramatically in the fifty years since the independence era began. As Europe's colonial powers withdrew, dozens of new states were launched amid much jubilation and to the world's applause. African leaders stepped forward with energy and enthusiasm to tackle the problems of development and nation-building, boldly proclaiming their hopes of establishing new societies that might offer inspiration to the world at large. The circumstances seemed auspicious. Independence came in the midst of an economic boom. On the world stage, African states excited the attention of the world's rival power blocs; in the Cold War era, the position that each newly independent state adopted in its relations with the West or the East was viewed as a matter of crucial importance. Africa was considered too valuable a prize to lose.\" \"Today, Africa is spoken of only in pessimistic terms. The sum of its misfortunes - its wars, its despotisms, its corruption, its droughts - is truly daunting. No other area of the world arouses such a sense of foreboding. Few states have managed to escape the downward spiral: Botswana stands out as a unique example of an enduring multi-party democracy; South Africa, after narrowly avoiding revolution, has emerged in the post-apartheid era as a well-managed democratic state. But most African countries are effectively bankrupt, prone to civil strife, subject to dictatorial rule, weighted down by debt, and heavily dependent on Western assistance for survival.\" \"So what went wrong? What happened to this vast continent, so rich in resources, culture and history, to bring it so close to destitution and despair in the space of two generations?\" Focusing on the key personalities, events and themes of the independence era, Martin Meredith's narrative history seeks to explore and explain the myriad problems that Africa has faced in the past half-century, and faces still. The Fate of Africa is essential reading for anyone seeking to understand how it came to this — and what, if anything, is to be done."], "author": "Martin Meredith", "num_pages": "752", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-06-27 00:00:00", "ISBN": "1586483986"},
{"url": "https://www.goodreads.com/book/show/5488.The_Cairo_Trilogy", "num_ratings": "3,258", "num_reviews": "247", "avg_ratings": 4.46, "genres": ["Fiction", "Northern Africa", "Egypt", "Historical", "Historical Fiction", "Classics", "Cultural", "Africa", "Literature"], "title": "The Cairo Trilogy: Palace Walk / Palace of Desire / Sugar Street", "description": ["Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patri", "Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patriarch Al-Sayyid Ahmad Abd al-Jawad, who rules his household with a strict hand while living a secret life of self-indulgence. ", " introduces us to his gentle, oppressed wife, Amina, his cloistered daughters, Aisha and Khadija, and his three sons–the tragic and idealistic Fahmy, the dissolute hedonist Yasin, and the soul-searching intellectual Kamal. Al-Sayyid Ahmad’s rebellious children struggle to move beyond his domination in ", ", as the world around them opens to the currents of modernity and political and domestic turmoil brought by the 1920s. ", " brings Mahfouz’s vivid tapestry of an evolving Egypt to a dramatic climax as the aging patriarch sees one grandson become a Communist, one a Muslim fundamentalist, and one the lover of a powerful politician.", "Throughout the trilogy, the family's trials mirror those of their turbulent country during the years spanning the two World Wars, as change comes to a society that has resisted it for centuries. Filled with compelling drama, earthy humor, and remarkable insight, ", " is the achievement of a master storyteller."], "author": "Naguib Mahfouz", "num_pages": "1313", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "2001-10-16 00:00:00", "ISBN": "0375413316"},
{"url": "https://www.goodreads.com/book/show/7039.Tears_of_the_Giraffe", "num_ratings": "43,656", "num_reviews": "2,442", "avg_ratings": 3.96, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime"], "title": "Tears of the Giraffe", "description": ["\"This is a superior piece of detective fiction, written in simple, direct but effective prose. Perhaps most importantly, this novel offers a refreshingly positive picture of an African nation - and probably deserves a wide audience in the West on those grounds alone.\"", "In 1999 The No. 1 Ladies' Detective Agency received two Booker Judges' Special Recommendations and was vote", "\"This is a superior piece of detective fiction, written in simple, direct but effective prose. Perhaps most importantly, this novel offers a refreshingly positive picture of an African nation - and probably deserves a wide audience in the West on those grounds alone.\"", "In 1999 The No. 1 Ladies' Detective Agency received two Booker Judges' Special Recommendations and was voted one of the ‘International Books of the Year and the Millennium' by the Times Literary Supplement. ", "Tears of the Giraffe takes us further into the life of the engaging and sassy Precious Ramotswe, the owner and detective of Botswana's only Ladies' detective agency. Among her cases are wayward wives, unscrupulous maids and a challenge to resolve a mother's pain for her son, who is long lost on the African plains. Mma Ramotswe's own impending marriage to that most gentlemanly of men, Mr. J. L. B. Matekoni, the promotion of her secretary to the dizzy heights of Assistant Detective and new additions to the Matekoni family, all brew up the most humorous and charmingly entertaining of tales."], "author": "Alexander McCall Smith", "num_pages": "217", "awards": [], "places": ["Bulawayo", "Gaborone"], "character_names": ["Precious Ramotswe", "Puso", "Silvia Potokwani", "Mr. J.L.B. Matekoni", "Motholeli", "Grace Makutsi", "Obed Ramotswe"], "language": "English", "publish_date": "2003-08-07 00:00:00", "ISBN": "0349116652"},
{"url": "https://www.goodreads.com/book/show/4645.The_Snows_of_Kilimanjaro_and_Other_Stories", "num_ratings": "29,299", "num_reviews": "1,155", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Short Stories", "Literature"], "title": "The Snows of Kilimanjaro and Other Stories", "author": "Ernest Hemingway", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-08-16 00:00:00", "ISBN": "0684862212"},
{"url": "https://www.goodreads.com/book/show/130115.The_Grass_is_Singing", "num_ratings": "8,755", "num_reviews": "796", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Classics", "Historical", "Historical Fiction", "Southern Africa", "South Africa"], "title": "The Grass is Singing", "description": ["Set in South Africa under white rule, Doris Lessing's first novel is both a riveting chronicle of human disintegration and a beautifully understated social critique. ", "Mary Turner is a self-confident, independent young woman who becomes the depressed, frustrated wife of an ineffectual, unsuccessful farmer. Little by little the ennui of years on the farm work their slow poiso", "Set in South Africa under white rule, Doris Lessing's first novel is both a riveting chronicle of human disintegration and a beautifully understated social critique. ", "Mary Turner is a self-confident, independent young woman who becomes the depressed, frustrated wife of an ineffectual, unsuccessful farmer. Little by little the ennui of years on the farm work their slow poison, and Mary's despair progresses until the fateful arrival of an enigmatic and virile black servant, Moses. Locked in anguish, Mary and Moses -- master and slave -- are trapped in a web of mounting attraction and repulsion. Their psychic tension explodes in an electrifying scene that ends this disturbing tale of racial strife in colonial South Africa.", " blends Lessing's imaginative vision with her own vividly remembered early childhood to recreate the quiet horror of a woman's struggle against a ruthless fate."], "author": "Doris Lessing", "num_pages": "208", "awards": [], "places": [], "character_names": ["Mary Turner", "Dick Turner", "Moses"], "language": "English", "publish_date": "2000-03-06 00:00:00", "ISBN": "0002257556"},
{"url": "https://www.goodreads.com/book/show/37772.A_Man_of_the_People", "num_ratings": "3,072", "num_reviews": "202", "avg_ratings": 3.87, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria", "Historical", "Historical Fiction"], "title": "A Man of the People", "description": ["By the renowned author of \"Things Fall Apart,\" this novel foreshadows the Nigerian coups of 1966 and shows the color and vivacity as well as the violence and corruption of a society making its own way between the two worlds."], "author": "Chinua Achebe", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-16 00:00:00", "ISBN": "0385086164"},
{"url": "https://www.goodreads.com/book/show/12663.The_Covenant", "num_ratings": "17,727", "num_reviews": "379", "avg_ratings": 4.18, "genres": ["Historical", "Historical Fiction", "Southern Africa", "South Africa", "Fiction"], "title": "The Covenant", "description": ["Set in South Africa, beginning 15,000 years ago and ending with the Boer War, this is a novel about people caught up in the march of world history. It is a story of adventure and heroism, love and loyalty, and cruelty and betrayal."], "author": "James A. Michener", "num_pages": "1240", "awards": [], "places": ["South Africa", "Africa"], "character_names": [], "language": "English", "publish_date": "1992-01-09 00:00:00", "ISBN": "0749311614"},
{"url": "https://www.goodreads.com/book/show/5845.A_Bend_in_the_River", "num_ratings": "13,432", "num_reviews": "750", "avg_ratings": 3.77, "genres": ["Cultural", "Africa", "Classics", "Literature"], "title": "A Bend in the River", "description": ["When Salim, a young Indian man, is offered a small business in Central Africa, he accepts. As he strives to establish himself, he becomes closely involved with the fluid and dangerous politics of the newly-dependent state."], "author": "V.S. Naipaul", "num_pages": "326", "awards": ["Man Booker Prize Nominee (1979)"], "places": ["Africa"], "character_names": ["Salim", "Metty", "Zabeth", "Ferdinand (A Bend in the River)", "Nazruddin", "Mahesh", "Shoba", "Father Huismans", "Indar", "Raymond (A Bend in the River)", "Yvette (A Bend in the River)"], "language": "English", "publish_date": "2002-05-10 00:00:00", "ISBN": "0330487140"},
{"url": "https://www.goodreads.com/book/show/144214.When_a_Crocodile_Eats_the_Sun", "num_ratings": "7,138", "num_reviews": "769", "avg_ratings": 4.14, "genres": ["Cultural", "Africa", "Nonfiction", "Autobiography", "Memoir", "History", "Biography", "Eastern Africa", "Zimbabwe"], "title": "When a Crocodile Eats the Sun: A Memoir of Africa", "description": ["After his father's heart attack in 1984, Peter Godwin began a series of pilgrimages back to Zimbabwe, the land of his birth, from Manhattan, where he now lives. On these frequent visits to check on his elderly parents, he bore witness to Zimbabwe's dramatic spiral downwards into the", "jaws of violent chaos, presided over by an increasingly enraged dictator. And yet long after", "After his father's heart attack in 1984, Peter Godwin began a series of pilgrimages back to Zimbabwe, the land of his birth, from Manhattan, where he now lives. On these frequent visits to check on his elderly parents, he bore witness to Zimbabwe's dramatic spiral downwards into the", "jaws of violent chaos, presided over by an increasingly enraged dictator. And yet long after their comfortable lifestyle had been shattered and millions were fleeing, his parents refuse to leave, steadfast in their allegiance to the failed state that has been their adopted home for 50 years.", "Then Godwin discovered a shocking family secret that helped explain their loyalty. Africa was his father's sanctuary from another identity, another world.", "WHEN A CROCODILE EATS THE SUN is a stirring memoir of the disintegration of a family set against the collapse of a country. But it is also a vivid portrait of the profound strength of the human spirit and the enduring power of love."], "author": "Peter Godwin", "num_pages": "344", "awards": ["Borders Original Voices Award for Nonfiction (2007)", "Orwell Prize (1997)"], "places": ["Zimbabwe", "Rhodesia"], "character_names": ["Ian Smith", "Robert Mugabe", "Peter Godwin"], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0316158941"},
{"url": "https://www.goodreads.com/book/show/26404001-the-tears-of-dark-water", "num_ratings": "2,135", "num_reviews": "372", "avg_ratings": 4.15, "genres": ["Fiction", "Thriller", "Contemporary", "Mystery", "Suspense"], "title": "The Tears of Dark Water", "description": ["Daniel and Vanessa Parker are an American success story. He is a Washington, DC, power broker, and she is a physician with a thriving practice. But behind the gilded facade, their marriage is a shambles, and their teenage son, Quentin, is self-destructing. In desperation, Daniel dusts off a long-delayed dream a sailing trip around the world. Little does he know, the voyage", "Daniel and Vanessa Parker are an American success story. He is a Washington, DC, power broker, and she is a physician with a thriving practice. But behind the gilded facade, their marriage is a shambles, and their teenage son, Quentin, is self-destructing. In desperation, Daniel dusts off a long-delayed dream a sailing trip around the world. Little does he know, the voyage he hopes will save them may destroy them instead.", "Half a world away on the lawless coast of Somalia, Ismail Adan Ibrahim is living a life of crime in violation of everything he was raised to believe except for the love and loyalty driving him to hijack ships for ransom and plot the rescue of his sister, Yasmin, from the man who murdered their father. There is nothing he will not do to save her, even if it means taking innocent lives.", "Paul Derrick is the FBI s top hostage negotiator. His twin sister, Megan, is a celebrated defense attorney. They have reached the summit of their careers by savvy, grit, and a secret determination to escape the memory of the day their family died. When Paul is dispatched to handle a hostage crisis at sea, he has no idea how far it will take him and Megan into the past or the chance it will give them to redeem the future.", "Across continents and oceans, through storms and civil wars, the paths of these individuals converge in a single, explosive moment. It is a moment that will test them and break them, but it will also leave behind an unexpected glimmer of hope that out of the ashes of tragedy and misfortune, the seeds of justice and reconciliation can grow.\""], "author": "Corban Addison", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-10-13 00:00:00", "ISBN": "0718042204"},
{"url": "https://www.goodreads.com/book/show/2296567.Say_You_re_One_of_Them", "num_ratings": "13,296", "num_reviews": "2,280", "avg_ratings": 3.5, "genres": ["Fiction", "Cultural", "Africa", "Short Stories", "Historical", "Historical Fiction", "Abandoned", "War", "Western Africa", "Nigeria", "Adult", "Literature", "African Literature", "Eastern Africa", "Rwanda"], "title": "Say You're One of Them", "description": ["Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds,", "Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds, his dream can't be granted. Food comes first. His family lives in a street shanty in Nairobi, Kenya, but their way of both loving and taking advantage of each other strikes a universal chord. ", "In the second of his stories published in a New Yorker special fiction issue, Akpan takes us far beyond what we thought we knew about the tribal conflict in Rwanda. The story is told by a young girl, who, with her little brother, witnesses the worst possible scenario between parents. They are asked to do the previously unimaginable in order to protect their children. This singular collection will also take the reader inside Nigeria, Benin, and Ethiopia, revealing in beautiful prose the harsh consequences for children of life in Africa. ", "Akpan's voice is a literary miracle, rendering lives of almost unimaginable deprivation and terror into stories that are nothing short of transcendent."], "author": "Uwem Akpan", "num_pages": "358", "awards": ["Guardian First Book Award Nominee for Longlist (2008)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2009)", "PEN Open Book Award (2009)", "Paris Book Festival for Compilation/Anthology (2010)", "Hurston/Wright Legacy Award for Fiction (2009)", "Commonwealth Writers' Prize for Best First Book in Africa (2009)"], "places": ["Benin", "Kenya", "Ethiopia", "Rwanda", "Nigeria", "Africa"], "character_names": [], "language": "English", "publish_date": "2009-09-18 00:00:00", "ISBN": "0316113786"},
{"url": "https://www.goodreads.com/book/show/11713.The_English_Patient", "num_ratings": "98,393", "num_reviews": "3,732", "avg_ratings": 3.88, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Romance", "Historical"], "title": "The English Patient", "description": ["With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs ro", "With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs room and whose memories of passion, betrayal, and rescue illuminate this book like flashes of heat lightning."], "author": "Michael Ondaatje", "num_pages": "320", "awards": ["Man Booker Prize (1992)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (1992)", "Commonwealth Writers' Prize for Best Book in Caribbean and Canada (1993)", "Trillium Book Award (1993)", "Golden Man Booker Prize (2018)"], "places": ["Italy", "North Africa", "Sahara Desert", "Tuscany", "Fiesole, Tuscany", "Cairo", "Florence"], "character_names": ["Kip", "Hana", "Geoffrey Clifton", "Katharine Clifton", "David Caravaggio", "Ladislaus de Almásy"], "language": "English", "publish_date": "2006-04-18 00:00:00", "ISBN": "0771068719"},
{"url": "https://www.goodreads.com/book/show/15796700-americanah", "num_ratings": "169,639", "num_reviews": "16,436", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Feminism", "Literary Fiction"], "title": "Americanah", "description": ["Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a d", "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London. Fifteen years later, they reunite in a newly democratic Nigeria, and reignite their passion—for each other and for their homeland.", "Source: chimamanda.com"], "author": "Chimamanda Ngozi Adichie", "num_pages": "477", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0307271080"},
{"url": "https://www.goodreads.com/book/show/9541.The_Shadow_of_the_Sun", "num_ratings": "8,359", "num_reviews": "677", "avg_ratings": 4.37, "genres": ["Nonfiction", "Cultural", "Africa", "Travel", "History", "Writing", "Journalism", "European Literature", "Polish Literature"], "title": "The Shadow of the Sun", "description": ["In 1957, Ryszard Kapuscinski arrived in Africa to witness the beginning of the end of colonial rule as the first African correspondent of Poland's state newspaper. From the early days of independence in Ghana to the ongoing ethnic genocide in Rwanda, Kapuscinski has crisscrossed vast distances pursuing the swift, and often violent, events that followed liberation. Kapuscin", "In 1957, Ryszard Kapuscinski arrived in Africa to witness the beginning of the end of colonial rule as the first African correspondent of Poland's state newspaper. From the early days of independence in Ghana to the ongoing ethnic genocide in Rwanda, Kapuscinski has crisscrossed vast distances pursuing the swift, and often violent, events that followed liberation. Kapuscinski hitchhikes with caravans, wanders the Sahara with nomads, and lives in the poverty-stricken slums of Nigeria. He wrestles a king cobra to the death and suffers through a bout of malaria. What emerges is an extraordinary depiction of Africa--not as a group of nations or geographic locations--but as a vibrant and frequently joyous montage of peoples, cultures, and encounters. Kapuscinski's trenchant observations, wry analysis and overwhelming humanity paint a remarkable portrait of the continent and its people. His unorthodox approach and profound respect for the people he meets challenge conventional understandings of the modern problems faced by Africa at the dawn of the twenty-first century."], "author": "Ryszard Kapuściński", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-04-09 00:00:00", "ISBN": "0679779078"},
{"url": "https://www.goodreads.com/book/show/122.The_Power_of_One", "num_ratings": "67,235", "num_reviews": "4,818", "avg_ratings": 4.34, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Classics"], "title": "The Power of One", "description": ["Alternate cover for ISBN 034541005X, 9780345410054", "In 1939, as Hitler casts his enormous, cruel shadow across the world, the seeds of apartheid take root in South Africa. There, a boy called Peekay is born. His childhood is marked by humiliation and abandonment, yet he vows to survive and conceives heroic dreams, which are nothing compared to what life actually has in store", "Alternate cover for ISBN 034541005X, 9780345410054", "In 1939, as Hitler casts his enormous, cruel shadow across the world, the seeds of apartheid take root in South Africa. There, a boy called Peekay is born. His childhood is marked by humiliation and abandonment, yet he vows to survive and conceives heroic dreams, which are nothing compared to what life actually has in store for him. He embarks on an epic journey through a land of tribal superstition and modern prejudice where he will learn the power of words, the power to transform lives and the power of one."], "author": "Bryce Courtenay", "num_pages": "544", "awards": ["West Australian Young Readers' Book Award (WAYRBA) for Older Readers (1996)"], "places": ["South Africa"], "character_names": ["\"Doc\" Bradley Stanwick", "Peekay", "Geel Piet", "Morris Levy", "The Judge", "Mrs. Boxall", "Miss Bornstein"], "language": "English", "publish_date": "1996-09-29 00:00:00", "ISBN": "034541005X"},
{"url": "https://www.goodreads.com/book/show/9478000-the-liquidator", "num_ratings": "54", "num_reviews": "10", "avg_ratings": 3.91, "genres": ["Cultural", "Africa", "Fiction"], "title": "The Liquidator", "description": ["Dangerous things happen in Africa. People disappear. Everybody knows that.", "But as an outsider, Paul thinks he is safe, even from the secret police, whatever he starts to find, or wherever it leads; despite the turmoil leading up to the country’s first multi party election and with a diamond fuelled civil war raging in the failed state just across the border.", "But when Paul fi", "Dangerous things happen in Africa. People disappear. Everybody knows that.", "But as an outsider, Paul thinks he is safe, even from the secret police, whatever he starts to find, or wherever it leads; despite the turmoil leading up to the country’s first multi party election and with a diamond fuelled civil war raging in the failed state just across the border.", "But when Paul finds himself and his friends trapped holding a potentially deadly secret as the country begins to implode, what will he be prepared to do to protect himself and those around him in order to escape?", "Iain’s first novel, The Liquidator, is a contemporary political mystery / black comedy that asks, when the chips are down, what would you do if you felt threatened enough in an alien situation?"], "author": "Iain Parke", "num_pages": "284", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-24 00:00:00", "ISBN": "0956161502"},
{"url": "https://www.goodreads.com/book/show/158674.Nervous_Conditions", "num_ratings": "9,179", "num_reviews": "651", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Eastern Africa", "Zimbabwe", "Feminism"], "title": "Nervous Conditions", "description": ["A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousn", "A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousness' of the 'postcolonial' conditions that bedevil us still. In Tambu and the women of her family, we African women see ourselves, whether at home or displaced, doing daily battle with our changing world with a mixture of tenacity, bewilderment and grace."], "author": "Tsitsi Dangarembga", "num_pages": "204", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1989)"], "places": ["Rhodesia", "Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2004-11-29 00:00:00", "ISBN": "1580051340"},
{"url": "https://www.goodreads.com/book/show/11472.We_Wish_to_Inform_You_That_Tomorrow_We_Will_Be_Killed_with_Our_Families", "num_ratings": "23,063", "num_reviews": "1,437", "avg_ratings": 4.26, "genres": ["Nonfiction", "History", "Cultural", "Africa", "War", "Eastern Africa", "Rwanda", "Politics"], "title": "We Wish to Inform You That Tomorrow We Will Be Killed with Our Families", "description": ["In April of 1994, the government of Rwanda called on everyone in the Hutu majority to kill everyone in the Tutsi minority. Over the next three months, 800,000 Tutsis were murdered in the most unambiguous case of genocide since Hitler's war against the Jews. Philip Gourevitch's haunting work is an anatomy of the killings in Rwanda, a vivid history of the genocide's backgrou", "In April of 1994, the government of Rwanda called on everyone in the Hutu majority to kill everyone in the Tutsi minority. Over the next three months, 800,000 Tutsis were murdered in the most unambiguous case of genocide since Hitler's war against the Jews. Philip Gourevitch's haunting work is an anatomy of the killings in Rwanda, a vivid history of the genocide's background, and an unforgettable account of what it means to survive in its aftermath."], "author": "Philip Gourevitch", "num_pages": "356", "awards": ["Guardian First Book Award (1999)", "Helen Bernstein Book Award for Excellence in Journalism (1999)", "Los Angeles Times Book Prize for Current Interest (1998)", "PEN/Martha Albrand Award for First Nonfiction Writers (1999)", "National Book Critics Circle Award for General Nonfiction (1998)", "Cornelius Ryan Award (1998)"], "places": ["Rwanda"], "character_names": [], "language": "English", "publish_date": "1999-09-04 00:00:00", "ISBN": "0312243359"},
{"url": "https://www.goodreads.com/book/show/81227.Infidel", "num_ratings": "67,436", "num_reviews": "5,944", "avg_ratings": 4.2, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Religion", "Cultural", "Africa"], "title": "Infidel", "description": ["One of today’s most admired and controversial political figures, Ayaan Hirsi Ali burst into international headlines following the murder of Theo van Gogh by an Islamist who threatened that she would be next. She made headlines again when she was stripped of her citizenship and resigned from the Dutch Parliament.", " shows the coming of age of this distinguished politica", "One of today’s most admired and controversial political figures, Ayaan Hirsi Ali burst into international headlines following the murder of Theo van Gogh by an Islamist who threatened that she would be next. She made headlines again when she was stripped of her citizenship and resigned from the Dutch Parliament.", " shows the coming of age of this distinguished political superstar and champion of free speech as well as the development of her beliefs, iron will, and extraordinary determination to fight injustice. Raised in a strict Muslim family, Hirsi Ali survived civil war, female mutilation, brutal beatings, adolescence as a devout believer during the rise of the Muslim Brotherhood, and life in four troubled, unstable countries ruled largely by despots. She escaped from a forced marriage and sought asylum in the Netherlands, where she earned a college degree in political science, tried to help her tragically depressed sister adjust to the West, and fought for the rights of Muslim women and the reform of Islam as a member of Parliament. Under constant threat, demonized by reactionary Islamists and politicians, disowned by her father, and expelled from family and clan, she refuses to be silenced.", "Ultimately a celebration of triumph over adversity, Hirsi Ali’s story tells how a bright little girl evolves out of dutiful obedience to become an outspoken, pioneering freedom fighter. As Western governments struggle to balance democratic ideals with religious pressures, no other book could be more timely or more significant."], "author": "Ayaan Hirsi Ali", "num_pages": "353", "awards": ["Anisfield-Wolf Book Award (2008)", "Hurston/Wright Legacy Award Nominee for Nonfiction (2008)"], "places": [], "character_names": ["Rita Verdonk", "Ayaan Hirsi Ali"], "language": "English", "publish_date": "2007-02-01 00:00:00", "ISBN": "0743289684"},
{"url": "https://www.goodreads.com/book/show/4952.What_Is_the_What", "num_ratings": "68,029", "num_reviews": "6,934", "avg_ratings": 4.16, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction"], "title": "What Is the What", "description": ["From the bestselling author of ", ", ", " is the epic novel based on the life of Valentino Achak Deng who, along with thousands of other children —the so-called Lost Boys—was forced to leave his village in Sudan at the age of seven and trek hundreds of miles by foot, pursued by militias, government bombers, and wild animals,", "From the bestselling author of ", ", ", " is the epic novel based on the life of Valentino Achak Deng who, along with thousands of other children —the so-called Lost Boys—was forced to leave his village in Sudan at the age of seven and trek hundreds of miles by foot, pursued by militias, government bombers, and wild animals, crossing the deserts of three countries to find freedom. When he finally is resettled in the United States, he finds a life full of promise, but also heartache and myriad new challenges. Moving, suspenseful, and unexpectedly funny, ", " is an astonishing novel that illuminates the lives of millions through one extraordinary man.", "-back cover"], "author": "Dave Eggers", "num_pages": "475", "awards": ["Independent Publisher Book Award (IPPY) for Literary Fiction (2007)", "Prix Médicis Etranger (2009)", "National Book Critics Circle Award Nominee for Fiction (2006)"], "places": ["Sudan", "Ethiopia", "Kakuma", "Marial Bai"], "character_names": [], "language": "English", "publish_date": "2006-10-18 00:00:00", "ISBN": "1932416641"},
{"url": "https://www.goodreads.com/book/show/49552.The_Stranger", "num_ratings": "546,479", "num_reviews": "17,285", "avg_ratings": 3.97, "genres": ["Classics", "Fiction", "Philosophy", "Cultural", "France", "Literature"], "title": "The Stranger", "description": ["Through the story of an ordinary man unwittingly drawn into a senseless murder on an Algerian beach, Camus explored what he termed \"the nakedness of man faced with the absurd.\" First published in English in 1946; now in a new translation by Matthew Ward."], "author": "Albert Camus", "num_pages": "123", "awards": ["PEN Translation Prize for Matthew Ward (1989)"], "places": ["Algeria"], "character_names": ["Meursault", "Raymond Sintès", "Marie Cardona", "Salamano"], "language": "English", "publish_date": "1989-03-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6192.Disgrace", "num_ratings": "69,576", "num_reviews": "5,066", "avg_ratings": 3.84, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Novels", "Literature"], "title": "Disgrace", "description": ["Set in post-apartheid South Africa, J. M. Coetzee’s searing novel tells the story of David Lurie, a twice divorced, 52-year-old professor of communications and Romantic Poetry at Cape Technical University. Lurie believes he has created a comfortable, if somewhat passionless, life for himself. He lives within his financial and emotional means. Though his position at the uni", "Set in post-apartheid South Africa, J. M. Coetzee’s searing novel tells the story of David Lurie, a twice divorced, 52-year-old professor of communications and Romantic Poetry at Cape Technical University. Lurie believes he has created a comfortable, if somewhat passionless, life for himself. He lives within his financial and emotional means. Though his position at the university has been reduced, he teaches his classes dutifully; and while age has diminished his attractiveness, weekly visits to a prostitute satisfy his sexual needs. He considers himself happy. But when Lurie seduces one of his students, he sets in motion a chain of events that will shatter his complacency and leave him utterly disgraced."], "author": "J.M. Coetzee", "num_pages": "220", "awards": ["Man Booker Prize (1999)", "National Book Critics Circle Award Nominee for Fiction (1999)", "Commonwealth Writers' Prize for Best Book Overall (2000)", "The Best of the Booker Nominee (2008)"], "places": ["South Africa", "Cape Town"], "character_names": ["David Lurie", "Lucy Lurie", "Petrus", "Bev Shaw", "Melanie Isaacs"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0143036378"},
{"url": "https://www.goodreads.com/book/show/24687.Don_t_Let_s_Go_to_the_Dogs_Tonight", "num_ratings": "44,010", "num_reviews": "3,108", "avg_ratings": 3.96, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Africa", "Biography"], "title": "Don't Let's Go to the Dogs Tonight: An African Childhood", "description": ["In ", ", Alexandra Fuller remembers her African childhood with candor and sensitivity. Though it is a diary of an unruly life in an often inhospitable place, it is suffused with Fuller’s endearing ability to find laughter, even when there is little to celebrate. Fuller’s debut is unsentimental and unflinching but always captivating. In wry and", "In ", ", Alexandra Fuller remembers her African childhood with candor and sensitivity. Though it is a diary of an unruly life in an often inhospitable place, it is suffused with Fuller’s endearing ability to find laughter, even when there is little to celebrate. Fuller’s debut is unsentimental and unflinching but always captivating. In wry and sometimes hilarious prose, she stares down disaster and looks back with rage and love at the life of an extraordinary family in an extraordinary time."], "author": "Alexandra Fuller", "num_pages": "315", "awards": ["Guardian First Book Award Nominee (2002)", "Book Sense Book of the Year Award for Adult Nonfiction (2003)", "Winifred Holtby Memorial Prize (2002)"], "places": ["Zimbabwe", "Malawi", "Zambia"], "character_names": [], "language": "English", "publish_date": "2003-03-11 00:00:00", "ISBN": "0375758992"},
{"url": "https://www.goodreads.com/book/show/3591262-cutting-for-stone", "num_ratings": "304,871", "num_reviews": "23,928", "avg_ratings": 4.28, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Book Club", "Eastern Africa", "Ethiopia", "Health", "Medicine"], "title": "Cutting for Stone", "description": ["An unforgettable journey into one man's remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others set in 1960s & 1970s Ethiopia and 1980s America.", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon at a mission hospital in Addis Ababa. Orphaned by", "An unforgettable journey into one man's remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others set in 1960s & 1970s Ethiopia and 1980s America.", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon at a mission hospital in Addis Ababa. Orphaned by their mother’s death in childbirth and their father’s disappearance, bound together by a preternatural connection and a shared fascination with medicine, the twins come of age as Ethiopia hovers on the brink of revolution. Yet it will be love, not politics—their passion for the same woman—that will tear them apart and force Marion, fresh out of medical school, to flee his homeland. He makes his way to America, finding refuge in his work as an intern at an underfunded, overcrowded New York City hospital. When the past catches up to him—nearly destroying him—Marion must entrust his life to the two men he thought he trusted least in the world: the surgeon father who abandoned him and the brother who betrayed him. ", "An unforgettable journey into one man’s remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others."], "author": "Abraham Verghese", "num_pages": "541", "awards": ["PEN/Hemingway Foundation Award Nominee (2010)", "Exclusive Books Boeke Prize Nominee (2011)", "Indies Choice Book Award for Adult Fiction (2010)", "Dayton Literary Peace Prize Nominee for Fiction (2010)", "Wellcome Book Prize Nominee for Shortlist (2009)", "Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Addis Ababa"], "character_names": ["Thomas Stone", "Sister Mary Joseph Praise", "Marion Stone", "Shiva Stone"], "language": "English", "publish_date": "2009-02-03 00:00:00", "ISBN": "0375414495"},
{"url": "https://www.goodreads.com/book/show/781787.Out_of_Africa", "num_ratings": "27,903", "num_reviews": "1,561", "avg_ratings": 3.96, "genres": ["Nonfiction", "Cultural", "Africa", "Classics", "Autobiography", "Memoir", "Biography"], "title": "Out of Africa", "description": [" is Isak Dinesen's memoir of her years in Africa, from 1914 to 1931, on a four-thousand-acre coffee plantation in the hills near Nairobi. She had come to Kenya from Denmark with her husband, and when they separated she stayed on to manage the farm by herself, visited frequently by her lover, the big-game hunter Denys Finch-Hatton, for whom she would make up st", " is Isak Dinesen's memoir of her years in Africa, from 1914 to 1931, on a four-thousand-acre coffee plantation in the hills near Nairobi. She had come to Kenya from Denmark with her husband, and when they separated she stayed on to manage the farm by herself, visited frequently by her lover, the big-game hunter Denys Finch-Hatton, for whom she would make up stories \"like Scheherazade.\" In Africa, \"I learned how to tell tales,\" she recalled many years later. \"The natives have an ear still. I told stories constantly to them, all kinds.\" Her account of her African adventures, written after she had lost her beloved farm and returned to Denmark, is that of a master storyteller, a woman whom John Updike called \"one of the most picturesque and flamboyant literary personalities of the century.\""], "author": "Isak Dinesen", "num_pages": "399", "awards": [], "places": ["Africa", "Nairobi", "Kenya"], "character_names": ["Gustav Mohr", "Isak Dinesen"], "language": "English", "publish_date": "1992-08-16 00:00:00", "ISBN": "0679600213"},
{"url": "https://www.goodreads.com/book/show/43015.A_Long_Way_Gone", "num_ratings": "139,576", "num_reviews": "9,677", "avg_ratings": 4.15, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Africa", "Biography", "War"], "title": "A Long Way Gone: Memoirs of a Boy Soldier", "description": ["The devastating story of war through the eyes of a child soldier. Beah tells how, at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and became a soldier.", "My new friends have begun to suspect I haven’t told them the full story of my life.", "“Why did you leave Sierra Le", "The devastating story of war through the eyes of a child soldier. Beah tells how, at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and became a soldier.", "My new friends have begun to suspect I haven’t told them the full story of my life.", "“Why did you leave Sierra Leone?”", "“Because there is a war.”", "“You mean, you saw people running around with guns and shooting each other?”", "“Yes, all the time.”", "“Cool.”", "I smile a little.", "“You should tell us about it sometime.”", "“Yes, sometime.” ", "This is how wars are fought now: by children, hopped-up on drugs and wielding AK-47s. Children have become soldiers of choice. In the more than fifty conflicts going on worldwide, it is estimated that there are some 300,000 child soldiers. Ishmael Beah used to be one of them. ", "What is war like through the eyes of a child soldier? How does one become a killer? How does one stop? Child soldiers have been profiled by journalists, and novelists have struggled to imagine their lives. But until now, there has not been a first-person account from someone who came through this hell and survived.", "In A Long Way Gone, Beah, now twenty-five years old, tells a riveting story: how at the age of twelve, he fled attacking rebels and wandered a land rendered unrecognizable by violence. By thirteen, he’d been picked up by the government army, and Beah, at heart a gentle boy, found that he was capable of truly terrible acts. ", "This is a rare and mesmerizing account, told with real literary force and heartbreaking honesty."], "author": "Ishmael Beah", "num_pages": "229", "awards": ["Christopher Award (2008)", "ALA Alex Award (2008)", "Lincoln Award Nominee (2010)", "NAIBA Book of the Year for Nonfiction (2007)", "Bill Duthie Booksellers’ Choice Award Nominee (2008)"], "places": ["Sierra Leone", "New York City, New York"], "character_names": ["Ishmael Beah", "Musa", "Esther", "\"Junior\" Beah", "Talloi", "Kanei", "Alhaji", "Jumah", "Moriba", "Saidu", "Khalilou"], "language": "English", "publish_date": "2007-02-13 00:00:00", "ISBN": "0374105235"},
{"url": "https://www.goodreads.com/book/show/318431.Long_Walk_to_Freedom", "num_ratings": "51,804", "num_reviews": "2,896", "avg_ratings": 4.32, "genres": ["History", "Cultural", "Africa", "Nonfiction", "Politics", "Autobiography", "Memoir", "Biography"], "title": "Long Walk to Freedom", "description": ["Nelson Mandela is one of the great moral and political leaders of our time: an international hero whose lifelong dedication to the fight against racial oppression in South Africa won him the Nobel Peace Prize and the presidency of his country. Since his triumphant release in 1990 from more th", "Nelson Mandela is one of the great moral and political leaders of our time: an international hero whose lifelong dedication to the fight against racial oppression in South Africa won him the Nobel Peace Prize and the presidency of his country. Since his triumphant release in 1990 from more than a quarter-century of imprisonment, Mandela has been at the center of the most compelling and inspiring political drama in the world. As president of the African National Congress and head of South Africa's antiapartheid movement, he was instrumental in moving the nation toward multiracial government and majority rule. He is revered everywhere as a vital force in the fight for human rights and racial equality.", "LONG WALK TO FREEDOM is his moving and exhilarating autobiography, destined to take its place among the finest memoirs of history's greatest figures. Here for the first time, Nelson Rolihlahla Mandela tells the extraordinary story of his life--an epic of struggle, setback, renewed hope, and ultimate triumph."], "author": "Nelson Mandela", "num_pages": "656", "awards": ["Alan Paton Award (1995)"], "places": [], "character_names": ["Nelson Mandela"], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "0316548189"},
{"url": "https://www.goodreads.com/book/show/126381.Purple_Hibiscus", "num_ratings": "44,222", "num_reviews": "4,231", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her bro", "Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her brother away to stay with their aunt, a University professor, whose house is noisy and full of laughter. There, Kambili and her brother discover a life and love beyond the confines of their father’s authority. The visit will lift the silence from their world and, in time, give rise to devotion and defiance that reveal themselves in profound and unexpected ways. ", "This is a book about the promise of freedom; about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new."], "author": "Chimamanda Ngozi Adichie", "num_pages": "307", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0007189885"},
{"url": "https://www.goodreads.com/book/show/7061.The_No_1_Ladies_Detective_Agency", "num_ratings": "203,056", "num_reviews": "10,007", "avg_ratings": 3.76, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime"], "title": "The No. 1 Ladies' Detective Agency", "description": ["Precious Ramotswe has only just set up shop as Botswana's No.1 (and only) lady detective when she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. However, the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "First published in the UK in 1998, and in", "Precious Ramotswe has only just set up shop as Botswana's No.1 (and only) lady detective when she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. However, the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "First published in the UK in 1998, and in the USA in 2001 by Polygon. Republished in 2002 and 2003 by Anchor. ", "This first novel in Alexander McCall Smith's widely acclaimed The No. 1 Ladies Detective Agency series tells the story of the delightfully cunning and enormously engaging Precious Ramotswe, who is drawn to her profession to \"help people with problems in their lives.\" Immediately upon setting up shop in a small storefront in Gaborone, she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. But the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "The No. 1 Ladies' Detective Agency received two Booker Judges' Special Recommendations and was voted one of the International Books of the Year and the Millennium by the Times Literary Supplement."], "author": "Alexander McCall Smith", "num_pages": "235", "awards": ["Martin Beck Award (2004)"], "places": ["Botswana", "Johannesburg", "Mafikeng"], "character_names": ["Precious Ramotswe", "Silvia Potokwani", "Charlie the older apprentice", "Note Mokoti", "Mr. J.L.B. Matekoni", "Violet Sepotho", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe"], "language": "English", "publish_date": "2003-02-06 00:00:00", "ISBN": "1400034779"},
{"url": "https://www.goodreads.com/book/show/347610.King_Leopold_s_Ghost", "num_ratings": "30,736", "num_reviews": "2,029", "avg_ratings": 4.15, "genres": ["History", "Nonfiction", "Cultural", "Africa", "Biography", "Politics"], "title": "King Leopold's Ghost", "description": ["In the 1880s, as the European powers were carving up Africa, King Leopold II of Belgium seized for himself the vast and mostly unexplored territory surrounding the Congo River. Carrying out a genocidal plundering of the Congo, he looted its rubber, brutalized its people, and ultimately slashed its population by ten million--all the while shrewdly cultivating his reputation", "In the 1880s, as the European powers were carving up Africa, King Leopold II of Belgium seized for himself the vast and mostly unexplored territory surrounding the Congo River. Carrying out a genocidal plundering of the Congo, he looted its rubber, brutalized its people, and ultimately slashed its population by ten million--all the while shrewdly cultivating his reputation as a great humanitarian. Heroic efforts to expose these crimes eventually led to the first great human rights movement of the twentieth century, in which everyone from Mark Twain to the Archbishop of Canterbury participated. ", " is the haunting account of a megalomaniac of monstrous proportions, a man as cunning, charming, and cruel as any of the great Shakespearean villains. It is also the deeply moving portrait of those who fought Leopold: a brave handful of missionaries, travelers, and young idealists who went to Africa for work or adventure and unexpectedly found themselves witnesses to a holocaust. Adam Hochschild brings this largely untold story alive with the wit and skill of a Barbara Tuchman. Like her, he knows that history often provides a far richer cast of characters than any novelist could invent. Chief among them is Edmund Morel, a young British shipping agent who went on to lead the international crusade against Leopold. Another hero of this tale, the Irish patriot Roger Casement, ended his life on a London gallows. Two courageous black Americans, George Washington Williams and William Sheppard, risked much to bring evidence of the Congo atrocities to the outside world. Sailing into the middle of the story was a young Congo River steamboat officer named Joseph Conrad. And looming above them all, the duplicitous billionaire King Leopold II. With great power and compassion, ", " will brand the tragedy of the Congo--too long forgotten--onto the conscience of the West"], "author": "Adam Hochschild", "num_pages": "306", "awards": ["Mark Lynton History Prize (1999)", "California Book Award for Nonfiction (Gold) (1998)", "Lionel Gelber Prize (1999)", "National Book Critics Circle Award Nominee for General Nonfiction (1998)", "Duff Cooper Prize (1999)"], "places": ["Congo, Democratic Republic of the ", "Congo Free State"], "character_names": ["Leopold II of Belgium"], "language": "English", "publish_date": "1999-09-03 00:00:00", "ISBN": "0618001905"},
{"url": "https://www.goodreads.com/book/show/6150.Cry_the_Beloved_Country", "num_ratings": "57,772", "num_reviews": "3,472", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Southern Africa", "South Africa"], "title": "Cry, the Beloved Country", "description": ["Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.", "Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.", "The eminent literary critic Lewis Gannett wrote, “We have had many novels from statesmen and reformers, almost all bad; many novels from poets, almost all thin. In Alan Paton’s ", " the statesman, the poet and the novelist meet in a unique harmony.” ", " is the deeply moving story of the Zulu pastor Stephen Kumalo and his son, Absalom, set against the background of a land and a people riven by racial injustice. Remarkable for its lyricism, unforgettable for character and incident, ", " is a classic work of love and hope, courage and endurance, born of the dignity of man."], "author": "Alan Paton", "num_pages": "316", "awards": ["Anisfield-Wolf Book Award for Fiction (1949)"], "places": ["South Africa"], "character_names": ["Stephen Kumalo", "Absalom Kumalo", "Msimangu", "James Jarvis"], "language": "English", "publish_date": "2003-11-25 00:00:00", "ISBN": "074326195X"},
{"url": "https://www.goodreads.com/book/show/4900.Heart_of_Darkness", "num_ratings": "342,801", "num_reviews": "11,081", "avg_ratings": 3.42, "genres": ["Classics", "Fiction", "Literature", "Cultural", "Africa", "Academic", "School"], "title": "Heart of Darkness", "description": ["Dark allegory describes the narrator's journey up the Congo River and his meeting with, and fascination by, Mr. Kurtz, a mysterious personage who dominates the unruly inhabitants of the region. Masterly blend of adventure, character development, psychological penetration. Considered by many Conrad's finest, most enigmatic story."], "author": "Joseph Conrad", "num_pages": "188", "awards": [], "places": ["Africa", "Belgian Congo", "Brussels", "Congo Free State"], "character_names": ["Charles Marlow", "Kurtz"], "language": "English", "publish_date": "2003-10-01 00:00:00", "ISBN": "1892295490"},
{"url": "https://www.goodreads.com/book/show/18749.Half_of_a_Yellow_Sun", "num_ratings": "69,512", "num_reviews": "6,171", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21", "Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed. ", "With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another. ", "Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had."], "author": "Chimamanda Ngozi Adichie", "num_pages": "433", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "1400044162"},
{"url": "https://www.goodreads.com/book/show/7940583-chasing-the-devil", "num_ratings": "1,325", "num_reviews": "135", "avg_ratings": 4.08, "genres": ["Cultural", "Africa", "Travel", "Nonfiction", "Western Africa", "Liberia", "History", "Western Africa", "Sierra Leone"], "title": "Chasing the Devil: The Search for Africa's Fighting Spirit", "description": ["For many years Sierra Leone and Liberia have been too dangerous to travel through, bedevilled by a uniquely brutal form of violence from which sprang many of Africa's cruellest contemporary icons. This travel book touches on one of the most fraught parts of the globe at a different moment in its history."], "author": "Tim Butcher", "num_pages": "336", "awards": [], "places": ["Sierra Leone", "Liberia"], "character_names": [], "language": "English", "publish_date": "2010-09-02 00:00:00", "ISBN": "0701183608"},
{"url": "https://www.goodreads.com/book/show/7244.The_Poisonwood_Bible", "num_ratings": "591,565", "num_reviews": "20,959", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Classics"], "title": "The Poisonwood Bible", "description": [" is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is", " is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is a suspenseful epic of one family's tragic undoing and remarkable reconstruction over the course of three decades in postcolonial Africa."], "author": "Barbara Kingsolver", "num_pages": "546", "awards": ["Pulitzer Prize Nominee for Fiction (1999)", "Orange Prize Nominee for Fiction Shortlist (1999)", "Book Sense Book of the Year Award for Adult (2000)", "PEN/Faulkner Award for Fiction Nominee (1999)", "Independent Publisher Book Award (IPPY) for Audio Fiction - Unabridged (1999)", "Exclusive Books Boeke Prize (2000)", "Puddly Award for Novel (2001)"], "places": ["Bethlehem, Georgia", "Kilanga", "Sanderling Island, Georgia", "Leopoldville"], "character_names": ["Orleanna Price", "Ruth May Price", "Rachel Rebeccah Price", "Leah Price", "Nathan Price", "Dr Bud Wharton", "Adah Price", "Reverend & Mrs. Underdown"], "language": "English", "publish_date": "2005-07-05 00:00:00", "ISBN": "0060786507"},
{"url": "https://www.goodreads.com/book/show/37781.Things_Fall_Apart", "num_ratings": "236,327", "num_reviews": "11,136", "avg_ratings": 3.63, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Academic", "School", "Literature"], "title": "Things Fall Apart", "description": ["THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict betw", "THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict between the individual and society. ", "The second story, which is as modern as the first is ancient, and which elevates the book to a tragic plane, concerns the clash of cultures and the destruction of Okonkwo's world through the arrival of aggressive, proselytizing European missionaries. These twin dramas are perfectly harmonized, and they are modulated by an awareness capable of encompassing at once the life of nature, human history, and the mysterious compulsions of the soul. THINGS FALL APART is the most illuminating and permanent monument we have to the modern African experience as seen from within."], "author": "Chinua Achebe", "num_pages": "209", "awards": [], "places": ["Africa"], "character_names": ["Okonkwo"], "language": "English", "publish_date": "1994-09-01 00:00:00", "ISBN": "0385474547"}
]