[
{"url": "https://www.goodreads.com/book/show/1885.Pride_and_Prejudice", "num_ratings": "2,417,846", "num_reviews": "53,623", "avg_ratings": 4.25, "genres": ["Classics", "Fiction", "Romance", "Historical", "Historical Fiction", "Literature", "Historical", "Novels", "Romance", "Historical Romance", "Classics", "Classic Literature", "Adult"], "title": "Pride and Prejudice", "description": ["'It is a truth universally acknowledged, that a single man in possession of a good fortune must be in want of a wife.' Thus memorably begins ", "'s ", ", one of the world's most popular novels. ", "--Austen's own 'darling child'--tells the story of fiercely independent Elizabeth Bennett, one of five sisters who must marry rich, as she c", "'It is a truth universally acknowledged, that a single man in possession of a good fortune must be in want of a wife.' Thus memorably begins ", "'s ", ", one of the world's most popular novels. ", "--Austen's own 'darling child'--tells the story of fiercely independent Elizabeth Bennett, one of five sisters who must marry rich, as she confounds the arrogant, wealthy Mr. Darcy. What ensues is one of the most delightful and engrossingly readable courtships known to literature, written by a precocious Austen when she was just twenty-one years old.", "Humorous and profound, and filled with highly entertaining dialogue, this witty comedy of manners dips and turns through drawing-rooms and plots to reach an immensely satisfying finale."], "author": "Jane Austen", "num_pages": "279", "awards": [], "places": ["England", "Hertfordshire, England", "Derbyshire, England"], "character_names": ["Mr. Bennet", "Mrs. Bennet", "Jane Bennet", "Elizabeth Bennet", "Mary Bennet", "Kitty Bennet", "Lydia Bennet", "Louisa Hurst", "Caroline Bingley", "Fitzwilliam Darcy", "Georgiana Darcy", "Lady Catherine de Bourgh", "Anne de Bourgh", "Colonel Fitzwilliam", "Mr. Gardiner", "Mrs. Gardiner", "Sir William Lucas", "Lady Lucas", "Charlotte Lucas", "Maria Lucas", "Mr. Darcy", "Charles Bingley", "George Wickham", "Mr. William Collins"], "language": "English", "publish_date": "2000-10-10 00:00:00", "ISBN": "0679783261"},
{"url": "https://www.goodreads.com/book/show/1162543.Breaking_Dawn", "num_ratings": "1,147,914", "num_reviews": "45,299", "avg_ratings": 3.69, "genres": ["Young Adult", "Fantasy", "Romance", "Paranormal", "Vampires", "Fiction"], "title": "Breaking Dawn", "description": ["To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, she has endured a tumultuous year of temptation, loss, and strife to reach the ultimate turning point. Her immi", "To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, she has endured a tumultuous year of temptation, loss, and strife to reach the ultimate turning point. Her imminent choice to either join the dark but seductive world of immortals or to pursue a fully human life has become the thread from which the fates of two tribes hangs.", "Now that Bella has made her decision, a startling chain of unprecedented events is about to unfold with potentially devastating and unfathomable, consequences. Just when the frayed strands of Bella's life - first discovered in ", ", then scattered and torn in ", " and ", " - seem ready to heal and knit together, could they be destroyed... forever?"], "author": "Stephenie Meyer", "num_pages": "756", "awards": ["Children's Choice Book Award for Teen Choice Book of the Year (2009)"], "places": ["Forks, Washington", "Washington (the state)"], "character_names": ["Edward Cullen", "Jacob Black", "Bella Swan", "Esme Cullen", "Alice Cullen", "Jasper Hale", "Emmett Cullen", "Rosalie Hale", "Charlie Swan", "Renesmee Cullen"], "language": "English", "publish_date": "2008-08-02 00:00:00", "ISBN": "031606792X"},
{"url": "https://www.goodreads.com/book/show/13831.Alanna", "num_ratings": "99,617", "num_reviews": "4,261", "avg_ratings": 4.27, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Adventure"], "title": "Alanna: The First Adventure", "description": ["And so young Alanna of Trebond begins the journey to knighthood. Though a girl, Alanna has always craved the adventure and daring allowed only for boys; her twin brother, Thom, yearns to learn the art of magic. So one day they decide to switch places: Thom heads for the convent to learn magic; Alanna, pret", "And so young Alanna of Trebond begins the journey to knighthood. Though a girl, Alanna has always craved the adventure and daring allowed only for boys; her twin brother, Thom, yearns to learn the art of magic. So one day they decide to switch places: Thom heads for the convent to learn magic; Alanna, pretending to be a boy, is on her way to the castle of King Roald to begin her training as a page. "], "author": "Tamora Pierce", "num_pages": "274", "awards": ["Preis der Leseratten des ZDF", "NSK Neustadt Prize for Children's Literature Nominee (2013)"], "places": ["Tortall"], "character_names": ["Alanna of Trebond", "Thom of Trebond", "Coram Smythesson", "George Cooper", "Jonathan of Conte", "Raoul of Goldenlake", "Gareth of Naxen the Second (Gary)", "Alex of Tirrigan", "Duke Roger of Conte"], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "0689878559"},
{"url": "https://www.goodreads.com/book/show/439288.Speak", "num_ratings": "404,800", "num_reviews": "19,990", "avg_ratings": 4.01, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction"], "title": "Speak", "description": ["\"Speak up for yourself--we want to know what you have to say.\" From the first moment of her freshman year at Merryweather High, Melinda knows this is a big fat lie, part of the nonsense of high school. She is friendless, outcast, because she busted an end-of-summer party by calling the cops, so now nobody will talk to her, let alone listen to her. As time passes, she becom", "\"Speak up for yourself--we want to know what you have to say.\" From the first moment of her freshman year at Merryweather High, Melinda knows this is a big fat lie, part of the nonsense of high school. She is friendless, outcast, because she busted an end-of-summer party by calling the cops, so now nobody will talk to her, let alone listen to her. As time passes, she becomes increasingly isolated and practically stops talking altogether. Only her art class offers any solace, and it is through her work on an art project that she is finally able to face what really happened at that terrible party: she was raped by an upperclassman, a guy who still attends Merryweather and is still a threat to her. Her healing process has just begun when she has another violent encounter with him. But this time Melinda fights back, refuses to be silent, and thereby achieves a measure of vindication. ", "In Laurie Halse Anderson's powerful novel, an utterly believable heroine with a bitterly ironic voice delivers a blow to the hypocritical world of high school. She speaks for many a disenfranchised teenager while demonstrating the importance of speaking up for oneself."], "author": "Laurie Halse Anderson", "num_pages": "208", "awards": ["SCBWI Golden Kite Award for Fiction (1999)", "Edgar Award Nominee for Best Young Adult (2000)", "Michael L. Printz Award Nominee (2000)", "South Carolina Book Award for Young Adult Book Award (2002)", "Dorothy Canfield Fisher Children's Book Award Nominee (2001)", "Evergreen Teen Book Award (2002)", "Boston Globe-Horn Book Award (2000)", "California Young Readers Medal Nominee for Young Adult (2003)", "Lincoln Award Nominee (2005)", "National Book Award Finalist for Young People's Literature (1999)", "Oklahoma Sequoyah Award for YA (2002)"], "places": ["Syracuse, New York"], "character_names": ["Rachel Honeybourne (Beauty)", "Ivy Hall", "Heather", "Nichole Smythe Burnell", "Melinda Sordino", "Andy Evans", "David Petrakis", "Mr. Freeman"], "language": "English", "publish_date": "2001-04-01 00:00:00", "ISBN": "014131088X"},
{"url": "https://www.goodreads.com/book/show/37415.Their_Eyes_Were_Watching_God", "num_ratings": "216,774", "num_reviews": "10,236", "avg_ratings": 3.88, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Academic", "School", "Cultural", "African American"], "title": "Their Eyes Were Watching God", "description": ["Fair and long-legged, independent and articulate, Janie Crawford sets out to be her own person -- no mean feat for a black woman in the '30s. Janie's quest for identity takes her through three marriages and into a journey back to her roots."], "author": "Zora Neale Hurston", "num_pages": "219", "awards": ["Audie Award for Solo Narration - Female (2001)"], "places": ["Florida", "Everglades, Florida"], "character_names": ["Eleanor", "Sam Watson", "Shelby", "Janie Starks", "Pheoby Watson", "Nanny", "Leafy", "Johnny Taylor", "Logan Killicks", "Jody Starks", "Tea Cake", "Pearl Stone", "Mrs. Sumpkins", "Lulu Moss", "Mis' Washburn", "Mr. Washburn", "Miss Nellie", "Mayrella"], "language": "English", "publish_date": "2006-05-30 00:00:00", "ISBN": "0061120065"},
{"url": "https://www.goodreads.com/book/show/9590422-impeding-justice", "num_ratings": "1,206", "num_reviews": "146", "avg_ratings": 4.0, "genres": ["Thriller", "Fiction", "Suspense", "Mystery", "Crime", "Mystery"], "title": "Impeding Justice", "description": ["Detective Inspector Lorne Simpkins comes up against her long-time nemesis, The Unicorn. After leading Simpkins and her partner into a trap, in which Pete is killed, Lorne comes to the conclusion the criminal is obtaining insider information, enabling him to stay one step ahead of them.", "Can Lorne uncover who the mole is before The Unicorn harms her daughter?"], "author": "M.A. Comley", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/337113.The_Tenant_of_Wildfell_Hall", "num_ratings": "74,726", "num_reviews": "3,323", "avg_ratings": 3.92, "genres": ["Classics", "Fiction", "Romance", "Literature", "19th Century"], "title": "The Tenant of Wildfell Hall", "description": ["This is the story of a woman's struggle for independence. Helen \"Graham\" has returned to Wildfell Hall in flight from a disastrous marriage. Exiled to the desolate moorland mansion,", "This is the story of a woman's struggle for independence. Helen \"Graham\" has returned to Wildfell Hall in flight from a disastrous marriage. Exiled to the desolate moorland mansion, she adopts an assumed name and earns her living as a painter."], "author": "Anne Brontë", "num_pages": "542", "awards": [], "places": ["Yorkshire, England", "London, England"], "character_names": ["Helen Graham", "Gilbert Markham", "Arthur Huntingdon", "Eliza Millward", "Frederick Lawrence", "Milicent Hargrave", "Esther Hargrave", "Walter Hargrave", "Arthur Huntingdon-Jr.", "Rachel (The Tenant of Wildfell Hall)"], "language": "English", "publish_date": "1996-04-16 00:00:00", "ISBN": "0140434747"},
{"url": "https://www.goodreads.com/book/show/8536738-the-portal-between", "num_ratings": "42", "num_reviews": "10", "avg_ratings": 3.88, "genres": ["Fantasy"], "title": "The Portal Between (The Portal Series, #1)", "description": ["Sam was gone, and no one knew where or why. Her car was found near the old oak tree, empty and abandoned. There was no sign of foul play, but also no sign of Sam, except for footprints that led to the oak tree...and stopped.", " Two years later, her best friend Kate still cares for Sam’s children, waiting for Sam to return for them. Then one day she does. “I don’t have long,”", "Sam was gone, and no one knew where or why. Her car was found near the old oak tree, empty and abandoned. There was no sign of foul play, but also no sign of Sam, except for footprints that led to the oak tree...and stopped.", " Two years later, her best friend Kate still cares for Sam’s children, waiting for Sam to return for them. Then one day she does. “I don’t have long,” Sam says. “Can you help me?” Kate must help her return home from a place that is closer than you might think, but still a world away.", "Sam's escape is just the beginning of her journey. Sam must go back to confront and defeat her abductor, leaving Kate to care for her children. Sam returns to the old oak tree, and the Portal to the world where she was held prisoner. In a whirlwind world of magic and monsters, where people and things are not who or what they appear to be, there are hard choices ahead, and Sam must learn if she's strong enough to make them."], "author": "Sarah Barnard", "num_pages": "204", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-02-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/14942.Mrs_Dalloway", "num_ratings": "181,895", "num_reviews": "7,377", "avg_ratings": 3.79, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "Mrs. Dalloway", "description": [" chronicles a June day in the life of Clarissa Dalloway –a day that is taken up with running minor errands in preparation for a party and that is punctuated, toward the end, by the suicide of a young man she has never met. In giving an apparently ordinary day such immense resonance and significance–infusing it with the elemental conflict between death and life", " chronicles a June day in the life of Clarissa Dalloway –a day that is taken up with running minor errands in preparation for a party and that is punctuated, toward the end, by the suicide of a young man she has never met. In giving an apparently ordinary day such immense resonance and significance–infusing it with the elemental conflict between death and life–Virginia Woolf triumphantly discovers her distinctive style as a novelist. Originally published in 1925, ", "is Woolf’s first complete rendering of what she described as the “luminous envelope” of consciousness: a dazzling display of the mind’s inside as it plays over the brilliant surface and darker depths of reality.", "This edition uses the text of the original British publication of ", ", which includes changes Woolf made that never appeared in the first or subsequent American editions.", "(Book Jacket Status: Jacketed)"], "author": "Virginia Woolf", "num_pages": "194", "awards": [], "places": ["London, England"], "character_names": ["Clarissa Dalloway", "Septimus Warren Smith", "Peter Walsh", "Sally Seton"], "language": "English", "publish_date": "2002-10-28 00:00:00", "ISBN": "0151009988"},
{"url": "https://www.goodreads.com/book/show/6149.Beloved", "num_ratings": "265,879", "num_reviews": "8,680", "avg_ratings": 3.79, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Literature", "Magical Realism"], "title": "Beloved", "description": ["Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by", "Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by the ghost of her baby, who died nameless and whose tombstone is engraved with a single word: Beloved. ", "Filled with bitter poetry and suspense as taut as a rope, ", " is a towering achievement by Nobel Prize laureate Toni Morrison."], "author": "Toni Morrison", "num_pages": "324", "awards": ["Pulitzer Prize for Fiction (1988)", "American Book Award (1988)", "Anisfield-Wolf Book Award (1988)", "National Book Critics Circle Award Nominee for Fiction (1987)", "Frederic G. Melcher Book Award (1988)", "National Book Award Finalist for Fiction (1987)"], "places": ["Delaware", "Ohio", "Kentucky"], "character_names": ["Baby Suggs", "Sethe", "Beloved", "Paul D Garner", "Denver"], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "1400033411"},
{"url": "https://www.goodreads.com/book/show/10356874-the-lost-book-of-mala-r", "num_ratings": "97", "num_reviews": "42", "avg_ratings": 3.74, "genres": ["Historical", "Historical Fiction", "Fiction", "Adult Fiction", "Contemporary", "Business", "Amazon"], "title": "The Lost Book of Mala R.", "description": [" ", "In a once-grand Southern California neighborhood, Linda, a New York City transplant, is panicking over the disappearance of her precocious ten-year-old stepdaughter. Christine, who has struggled to get pregnant for years, finds herself expect", " ", "In a once-grand Southern California neighborhood, Linda, a New York City transplant, is panicking over the disappearance of her precocious ten-year-old stepdaughter. Christine, who has struggled to get pregnant for years, finds herself expecting a baby—just as her husband is accused of murder. And Audrey, who’s always played it safe because of her family’s history of bad luck, takes a romantic risk and suddenly finds herself facing a disaster of her own. ", "When an old journal surfaces at a neighbor’s tag sale, the women are inexorably drawn into the life of Mala Rinehart, an itinerant Romany woman who wrote down spells and predictions in a cryptic, slanting hand. As the three women feel the pull from across sixty intervening years, they vow to discover what became of Mala. For through the worn pages, their happiness has intertwined with hers, their futures spelled out in her chants and recipes. And as they unravel the mystery of Mala’s origins, their lives transform in ways they never could have expected."], "author": "Rose MacDowell", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-27 00:00:00", "ISBN": "0385338589"},
{"url": "https://www.goodreads.com/book/show/821611.The_Story_of_My_Life", "num_ratings": "116,518", "num_reviews": "1,965", "avg_ratings": 4.07, "genres": ["Nonfiction", "Biography", "Classics", "Autobiography", "Memoir", "Biography", "Autobiography", "History", "Biography Memoir", "Historical", "Inspirational", "Disability"], "title": "The Story of My Life", "description": ["An American classic rediscovered by each generation, ", " is Helen Keller’s account of her triumph over deafness and blindness. Popularized by the stage play and movie The Miracle Worker, Keller’s story has become a symbol of hope for people all over the world. ", "This book–published when Keller was only twenty-two–portrays the wild child who is locked in the", "An American classic rediscovered by each generation, ", " is Helen Keller’s account of her triumph over deafness and blindness. Popularized by the stage play and movie The Miracle Worker, Keller’s story has become a symbol of hope for people all over the world. ", "This book–published when Keller was only twenty-two–portrays the wild child who is locked in the dark and silent prison of her own body. With an extraordinary immediacy, Keller reveals her frustrations and rage, and takes the reader on the unforgettable journey of her education and breakthroughs into the world of communication. From the moment Keller recognizes the word “water” when her teacher finger-spells the letters, we share her triumph as “that living word awakened my soul, gave it light, hope, joy, set it free!” An unparalleled chronicle of courage, ", " remains startlingly fresh and vital more than a century after its first publication, a timeless testament to an indomitable will."], "author": "Helen Keller", "num_pages": "240", "awards": [], "places": ["Tuscumbia, Alabama", "Boston, Massachusetts", "Alabama"], "character_names": ["Anne Sullivan", "Helen Keller"], "language": "English", "publish_date": "1990-05-01 00:00:00", "ISBN": "0553213873"},
{"url": "https://www.goodreads.com/book/show/6001758-fire", "num_ratings": "143,857", "num_reviews": "9,570", "avg_ratings": 4.12, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction"], "title": "Fire", "description": ["Fire is one of the most dangerous monsters of all - a human one. Marked out by her vivid red hair, she's more than attractive. But with this extraordinary beauty comes influence and power. Aware of her power, Fire lives in a corner of the world away from people. But now the day has come when she is needed by her king."], "author": "Kristin Cashore", "num_pages": "334", "awards": ["Milwaukee County Teen Book Award Nominee (2011)", "Amelia Elizabeth Walden Award (2010)", "Cybils Award for Young Adult Fantasy & Science Fiction (2009)"], "places": [], "character_names": ["Brocker (Graceling Realm)", "Roen (Graceling Realm)", "Nash (Graceling Realm)", "Brigan (Graceling Realm)", "Leck (Graceling Realm)", "Garan (Graceling Realm)", "Archer (Graceling Realm)", "Fire (Graceling Realm)"], "language": "English", "publish_date": "2009-09-24 00:00:00", "ISBN": "0575085118"},
{"url": "https://www.goodreads.com/book/show/156538.North_and_South", "num_ratings": "121,029", "num_reviews": "6,073", "avg_ratings": 4.13, "genres": ["Classics", "Fiction", "Romance", "Historical", "Historical Fiction", "Historical"], "title": "North and South", "description": ["When her father leaves the Church in a crisis of conscience, Margaret Hale is uprooted from her comfortable home in Hampshire to move with her family to the north of England. Initially repulsed by the ugliness of her new surroundings in the industrial town of Milton, Margaret becomes aware of the poverty and suffering of the local mill workers and develops a passionate sen", "When her father leaves the Church in a crisis of conscience, Margaret Hale is uprooted from her comfortable home in Hampshire to move with her family to the north of England. Initially repulsed by the ugliness of her new surroundings in the industrial town of Milton, Margaret becomes aware of the poverty and suffering of the local mill workers and develops a passionate sense of social justice. This is intensified by her tempestuous relationship with the mill-owner and self-made man, John Thornton, as their fierce opposition over his treatment of his employees masks a deeper attraction.", "In ", ", Elizabeth Gaskell skillfully fuses individual feeling with social concern, and in Margaret Hale creates one of the most original heroines of Victorian literature."], "author": "Elizabeth Gaskell", "num_pages": "521", "awards": [], "places": ["England"], "character_names": ["Margaret Hale", "Frederick Hale", "Mr. Hale", "Mrs. Hale", "Mr. Bell", "Dixon", "Mrs. Hannah Thornton", "Fanny Thornton", "Bessy Higgins", "Nicholas Higgins", "John   Thornton"], "language": "English", "publish_date": "1994-01-13 00:00:00", "ISBN": "0140620192"},
{"url": "https://www.goodreads.com/book/show/1656001.The_Host", "num_ratings": "808,612", "num_reviews": "40,497", "avg_ratings": 3.84, "genres": ["Science Fiction", "Fiction", "Young Adult", "Science Fiction", "Dystopia", "Fantasy", "Paranormal", "Science Fiction", "Aliens"], "title": "The Host", "description": [" ", " - ", "Melanie Stryder refuses to fade away. The earth has been invaded by a species that take over the minds of human hosts while leaving their bodies intact. Wanderer, the invading \"soul\" who has been given Melanie's body, didn't expect to find its former tenant refusing to relinquish possession of her m", " ", " - ", "Melanie Stryder refuses to fade away. The earth has been invaded by a species that take over the minds of human hosts while leaving their bodies intact. Wanderer, the invading \"soul\" who has been given Melanie's body, didn't expect to find its former tenant refusing to relinquish possession of her mind.", "As Melanie fills Wanderer's thoughts with visions of Jared, a human who still lives in hiding, Wanderer begins to yearn for a man she's never met. Reluctant allies, Wanderer and Melanie set off to search for the man they both love."], "author": "Stephenie Meyer", "num_pages": "620", "awards": [], "places": ["Arizona"], "character_names": ["Melanie Stryder", "Ian O'Shea", "Wanderer", "Jamie Stryder", "Jebediah Stryder", "Kyle O'Shea", "Jared Howe"], "language": "English", "publish_date": "2008-05-06 00:00:00", "ISBN": "0316068047"},
{"url": "https://www.goodreads.com/book/show/10964.Outlander", "num_ratings": "657,798", "num_reviews": "39,763", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Romance", "Fantasy", "Fiction", "Science Fiction", "Time Travel", "Historical", "Romance", "Historical Romance"], "title": "Outlander", "description": ["The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743.", "Hurled back in ti", "The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743.", "Hurled back in time by forces she cannot understand, Claire is catapulted into the intrigues of lairds and spies that may threaten her life, and shatter her heart. For here James Fraser, a gallant young Scots warrior, shows her a love so absolute that Claire becomes a woman torn between fidelity and desire—and between two vastly different men in two irreconcilable lives."], "author": "Diana Gabaldon", "num_pages": "850", "awards": ["RITA Award by Romance Writers of America for Best Romance of 1991 & nominee for Best First Book & nominee for Single Title Historical Romance (1992)", "Puddly Award for Romance (2001)"], "places": ["Lallybroch, Scotland", "Scottish Highlands", "Inverness, Scotland", "Scotland"], "character_names": ["Jamie Fraser", "Ian Murray", "Claire Randall Fraser", "Jonathan Randall", "Dougal MacKenzie", "Colum MacKenzie", "Geillis Duncan", "Jenny Murray", "Frank Randall", "Laoghaire MacKenzie", "Murtagh Fraser"], "language": "English", "publish_date": "2005-07-26 00:00:00", "ISBN": "0440242940"},
{"url": "https://www.goodreads.com/book/show/153784.First_Test", "num_ratings": "45,885", "num_reviews": "1,255", "avg_ratings": 4.25, "genres": ["Fantasy", "Young Adult", "Fiction"], "title": "First Test", "description": ["In the medieval and fantastic realm of Tortall, Keladry of Mindelan is the first girl to take advantage of the decree that permits females to train for knighthood. Up against the traditional hazing of pages and a grueling schedule, Kel faces only one real roadblock: Lord Wyldon, the training master of pages and squires. He is absolutely against girls becoming knights. So w", "In the medieval and fantastic realm of Tortall, Keladry of Mindelan is the first girl to take advantage of the decree that permits females to train for knighthood. Up against the traditional hazing of pages and a grueling schedule, Kel faces only one real roadblock: Lord Wyldon, the training master of pages and squires. He is absolutely against girls becoming knights. So while he is forced to train her, Wyldon puts her on probation for one year. It is a trial period that no male page has ever had to endure and one that separates the good natured Kel even more from her fellow trainees during the tough first year. But Kel Is not a girl to underestimate, as everyone is about to find out..."], "author": "Tamora Pierce", "num_pages": "240", "awards": [], "places": ["Tortall"], "character_names": [], "language": "English", "publish_date": "2000-05-23 00:00:00", "ISBN": "0679889175"},
{"url": "https://www.goodreads.com/book/show/12557.The_Kitchen_God_s_Wife", "num_ratings": "65,931", "num_reviews": "1,908", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia", "Contemporary"], "title": "The Kitchen God's Wife", "description": ["Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside", "Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside Shanghai in the 1920s, and other places in China during World War II, and traces the happy and desperate events that led to Winnie's coming to America in 1949."], "author": "Amy Tan", "num_pages": "416", "awards": [], "places": ["United States of America"], "character_names": ["Winnie", "Auntie Helen", "Pearl Bright", "Mary", "Frank Russell", "Roger \"Bao Bao\"", "Doug Cheu", "Phil Brandt", "Tessa Russo", "Cleo", "Mimi Wong", "Loy Fong", "Edna Fong", "New Aunt", "Old Aunt", "Wen Fu", "Huazheng \"Peanut\"", "Uncle Henry"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038109"},
{"url": "https://www.goodreads.com/book/show/18053548-running-from-romeo", "num_ratings": "570", "num_reviews": "104", "avg_ratings": 3.58, "genres": ["Romance", "New Adult", "Contemporary", "Academic", "College"], "title": "Running from Romeo", "description": ["Emilia King is entering her senior year at Santa Barbara University. For the past three years, she lived in the library – doing what she knows best – focusing on her studies and forgetting her past…a past that has forever changed her life. But this year marks a new beginning…", "Logan Prescott is not only the hottest guy on campus, he’s heir to a billionaire hotel fortune. Emi", "Emilia King is entering her senior year at Santa Barbara University. For the past three years, she lived in the library – doing what she knows best – focusing on her studies and forgetting her past…a past that has forever changed her life. But this year marks a new beginning…", "Logan Prescott is not only the hottest guy on campus, he’s heir to a billionaire hotel fortune. Emilia knows he’s trouble and should stay clear of him. But his notorious good looks and piercing blue eyes make him simply irresistible – especially when he’s quoting her favorite literary works.", "Intrigued by Emilia’s innocence and resistance to his charm, Logan discovers she’s a challenge he simply can’t resist. Getting involved with him is dangerous, but running from him may be impossible."], "author": "Diane Mannino", "num_pages": "345", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/383206.Wives_and_Daughters", "num_ratings": "37,348", "num_reviews": "2,063", "avg_ratings": 4.08, "genres": ["Classics", "Fiction", "Romance", "Historical", "Historical Fiction", "Literature", "19th Century"], "title": "Wives and Daughters", "description": ["Set in English society before the 1832 Reform Bill, ", " centres on the story of youthful Molly Gibson, brought up from childhood by her father. When he remarries, a new step-sister enters Molly's quiet life – loveable, but worldly and troubling, Cynthia. The narrative traces the development of the two girls into womanhood within the gossiping and watchful s", "Set in English society before the 1832 Reform Bill, ", " centres on the story of youthful Molly Gibson, brought up from childhood by her father. When he remarries, a new step-sister enters Molly's quiet life – loveable, but worldly and troubling, Cynthia. The narrative traces the development of the two girls into womanhood within the gossiping and watchful society of Hollingford.", " is far more than a nostalgic evocation of village life; it offers an ironic critique of mid-Victorian society. 'No nineteenth-century novel contains a more devastating rejection than this of the Victorian male assumption of moral authority', writes Pam Morris in her introduction to this new edition, in which she explores the novel's main themes – the role of women, Darwinism and the concept of Englishness – and its literary and social context."], "author": "Elizabeth Gaskell", "num_pages": "679", "awards": [], "places": ["United Kingdom"], "character_names": ["Molly Gibson", "Roger Hamley", "Cynthia Kirkpatrick"], "language": "English", "publish_date": "1996-05-30 00:00:00", "ISBN": "014043478X"},
{"url": "https://www.goodreads.com/book/show/1295.The_Clan_of_the_Cave_Bear", "num_ratings": "198,350", "num_reviews": "5,592", "avg_ratings": 4.03, "genres": ["Historical", "Historical Fiction", "Fiction", "Fantasy", "Historical"], "title": "The Clan of the Cave Bear", "description": ["This novel of awesome beauty and power is a moving saga about people, relationships, and the boundaries of love. Through Jean M. Auel's magnificent storytelling we are taken back to the dawn of modern humans, and with a girl named Ayla we are swept up in the harsh and beautiful Ice Age world they shared with the ones who called themselves the ", ". ", "A natur", "This novel of awesome beauty and power is a moving saga about people, relationships, and the boundaries of love. Through Jean M. Auel's magnificent storytelling we are taken back to the dawn of modern humans, and with a girl named Ayla we are swept up in the harsh and beautiful Ice Age world they shared with the ones who called themselves the ", ". ", "A natural disaster leaves the young girl wandering alone in an unfamiliar and dangerous land until she is found by a woman of the Clan, people very different from her own kind. To them, blond, blue-eyed Ayla looks peculiar and ugly--she is one of the Others, those who have moved into their ancient homeland; but Iza cannot leave the girl to die and takes her with them. Iza and Creb, the old Mog-ur, grow to love her, and as Ayla learns the ways of the Clan and Iza's way of healing, most come to accept her. But the brutal and proud youth who is destined to become their next leader sees her differences as a threat to his authority. He develops a deep and abiding hatred for the strange girl of the Others who lives in their midst, and is determined to get his revenge."], "author": "Jean M. Auel", "num_pages": "512", "awards": ["National Book Award Finalist for First Novel (1981)"], "places": ["Stone Age"], "character_names": ["Ayla", "Brun", "Broud", "Mog-Ur", "Iza"], "language": "English", "publish_date": "2002-06-25 00:00:00", "ISBN": "0553381679"},
{"url": "https://www.goodreads.com/book/show/11901.The_Witching_Hour", "num_ratings": "92,609", "num_reviews": "3,178", "avg_ratings": 4.11, "genres": ["Horror", "Fantasy", "Fiction", "Fantasy", "Paranormal", "Paranormal", "Witches"], "title": "The Witching Hour", "description": ["On the veranda of a great New Orleans house, now faded, a mute and fragile woman sits rocking. And the witching hour begins...", "Demonstrating once again her gift for spellbinding storytelling and the creation of legend, Anne Rice makes real for us a great dynasty of witches - a family given to poetry and incest, to murder and philosophy, a family that over the ages is itself", "On the veranda of a great New Orleans house, now faded, a mute and fragile woman sits rocking. And the witching hour begins...", "Demonstrating once again her gift for spellbinding storytelling and the creation of legend, Anne Rice makes real for us a great dynasty of witches - a family given to poetry and incest, to murder and philosophy, a family that over the ages is itself haunted by a powerful, dangerous, and seductive being.", "A hypnotic novel of witchcraft and the occult across four centuries, by the spellbinding, bestselling author of ", "."], "author": "Anne Rice", "num_pages": "1207", "awards": ["Locus Award for Best Dark Fantasy/Horror Novel (1991)"], "places": ["New Orleans, Louisiana", "Louisiana", "Scotland Yard, London, England"], "character_names": ["Rowan Mayfair", "Michael James Timothy Curry", "Aaron Lightner", "Lasher", "Deirdre Mayfair", "Stella Mayfair", "Mary Beth Mayfair", "Antha Mayfair", "Carlotta Mayfair", "Ellie Mayfair", "Julien Mayfair", "Marie Claudette Mayfair Landry", "Angélique Mayfair", "Katherine Mayfair", "Remy Mayfair", "Graham Franklin", "Lionel Mayfair", "Belle Mayfair", "Darcy Monahan", "Sean Lacy", "Petyr van Abel", "Deborah Mayfair de Montcleve", "Suzanne Mayfair", "Lestan Mayfair", "Marguerite Mayfair", "Tyrone Clifford McNamara", "Augustin Mayfair", "Jeannette Mayfair", "Cortland Mayfair", "Barclay Mayfair", "Garland Mayfair", "Corrington Mayfair", "Daniel McIntyre", "Nancy Mayfair", "Millie Mayfair", "Amanda Grady Mayfair", "Sean McIntyre", "Alice Mayfair"], "language": "English", "publish_date": "2004-11-04 00:00:00", "ISBN": "0099471426"},
{"url": "https://www.goodreads.com/book/show/9375.Fried_Green_Tomatoes_at_the_Whistle_Stop_Cafe", "num_ratings": "237,869", "num_reviews": "5,104", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Lgbt", "Womens Fiction", "Chick Lit", "Classics", "American", "Southern"], "title": "Fried Green Tomatoes at the Whistle Stop Cafe", "description": ["It's first the story of two women in the 1980s, of gray-headed Mrs. Threadgoode telling her life story to Evelyn, who is in the sad slump of middle age. The tale she tells is ", " of two women—of the irrepressibly daredevilish tomboy Idgie and her friend Ruth, who back in the thirties ran a little place in Whistle Stop, Alabama, a Southern kind of Cafe Wobegon offering goo", "It's first the story of two women in the 1980s, of gray-headed Mrs. Threadgoode telling her life story to Evelyn, who is in the sad slump of middle age. The tale she tells is ", " of two women—of the irrepressibly daredevilish tomboy Idgie and her friend Ruth, who back in the thirties ran a little place in Whistle Stop, Alabama, a Southern kind of Cafe Wobegon offering good barbecue and good coffee and all kinds of love and laughter, even an occasional murder."], "author": "Fannie Flagg", "num_pages": "416", "awards": ["Alabama Author Award for Fiction (1989)"], "places": ["Davenport, Iowa", "Troutville, Alabama", "Birmingham, Alabama", "Whistle Stop, Alabama", "Alabama"], "character_names": ["Ruth", "Mrs. Ninny Threadgoode", "Evelyn Couch", "Idgie"], "language": "English", "publish_date": "2002-05-07 00:00:00", "ISBN": "0375508414"},
{"url": "https://www.goodreads.com/book/show/6514.The_Bell_Jar", "num_ratings": "485,489", "num_reviews": "18,037", "avg_ratings": 3.99, "genres": ["Classics", "Fiction", "Feminism"], "title": "The Bell Jar", "description": ["Sylvia Plath's shocking, realistic, and intensely emotional novel about a woman falling into the grip of insanity. ", "Esther Greenwood is brilliant, beautiful, enormously talented, and successful, but slowly going under—maybe for the last time. In her acclaimed and enduring masterwork, Sylvia Plath brilliantly draws the reader into Esther's breakdown with such intensity that", "Sylvia Plath's shocking, realistic, and intensely emotional novel about a woman falling into the grip of insanity. ", "Esther Greenwood is brilliant, beautiful, enormously talented, and successful, but slowly going under—maybe for the last time. In her acclaimed and enduring masterwork, Sylvia Plath brilliantly draws the reader into Esther's breakdown with such intensity that her insanity becomes palpably real, even rational—as accessible an experience as going to the movies. A deep penetration into the darkest and most harrowing corners of the human psyche, ", " is an extraordinary accomplishment and a haunting American classic."], "author": "Sylvia Plath", "num_pages": "244", "awards": [], "places": ["Boston, Massachusetts", "New York City, New York"], "character_names": ["Constantin", "Esther Greenwood", "Valerie", "Marco", "Mrs. Greenwood", "Buddy Willard", "Doctor Nolan", "Joan Gilling", "Jay Cee", "Betsy", "Irwin", "Doctor Gordon", "Philomena Guinea", "Mrs. Willard", "Lenny Shepherd", "Dodo Conway", "Eric", "Doreen"], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0061148512"},
{"url": "https://www.goodreads.com/book/show/11735983-insurgent", "num_ratings": "1,008,781", "num_reviews": "57,100", "avg_ratings": 4.06, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Fiction", "Fantasy"], "title": "Insurgent", "description": ["One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.", "Tris's initiation day should have been marked by celebration", "One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.", "Tris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable—and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.", " bestselling author Veronica Roth's much-anticipated second book of the dystopian DIVERGENT series is another intoxicating thrill ride of a story, rich with hallmark twists, heartbreaks, romance, and powerful insights about human nature."], "author": "Veronica Roth", "num_pages": "525", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Young Adult Protagonist (2011)", "Goodreads Choice Award for Best Young Adult Fantasy and Best Goodreads Author (2012)"], "places": ["Chicago, Illinois"], "character_names": ["Albert", "Drew Leighton (Divergent)", "Eric (Divergent)", "Beatrice Prior", "Peter", "Caleb Prior", "Natalie Prior", "Molly Atwood", "Christina", "Jeanine Matthews", "Marcus Eaton", "Tobias Eaton"], "language": "English", "publish_date": "2012-05-01 00:00:00", "ISBN": "0007442912"},
{"url": "https://www.goodreads.com/book/show/58027.Alias_Grace", "num_ratings": "81,421", "num_reviews": "4,668", "avg_ratings": 4.01, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Cultural", "Canada", "Historical"], "title": "Alias Grace", "description": ["Toronto, 1843: Das junge Dienstmädchen Grace wird mit sechzehn des Doppelmordes an ihren Arbeitgebern schuldig gesprochen. In letzter Sekunde wandelt das Gericht ihr Todesurteil in eine lebenslange Gefängnisstrafe um. Sie verbringt Jahre hinter Gittern, bis man sie schließlich entlässt. Im Haushalt des Anstaltdirektors begegnet sie dem Nervenarzt Simon, der ihrer Geschicht", "Toronto, 1843: Das junge Dienstmädchen Grace wird mit sechzehn des Doppelmordes an ihren Arbeitgebern schuldig gesprochen. In letzter Sekunde wandelt das Gericht ihr Todesurteil in eine lebenslange Gefängnisstrafe um. Sie verbringt Jahre hinter Gittern, bis man sie schließlich entlässt. Im Haushalt des Anstaltdirektors begegnet sie dem Nervenarzt Simon, der ihrer Geschichte auf den Grund gehen will: Ist Grace eine gemeingefährliche Verbrecherin oder unschuldig? Margaret Atwood hat einen Roman von hypnotischer Spannung geschrieben, der die Geschichte einer realen Gestalt, einer der berüchtigtsten Frauen Kanadas erzählt."], "author": "Margaret Atwood", "num_pages": "636", "awards": ["Man Booker Prize Nominee (1996)", "Orange Prize Nominee for Fiction Shortlist (1997)", "Scotiabank Giller Prize (1996)", "James Tiptree Jr. Award Nominee for Longlist (1996)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général Nominee for Fiction (1996)", "International DUBLIN Literary Award Nominee (1998)", "Mikael Agricola -palkinto (1998)"], "places": ["Toronto, Ontario", "Kingston, Ontario"], "character_names": ["Grace Marks"], "language": "German", "publish_date": "1998-10-01 00:00:00", "ISBN": "3442723434"},
{"url": "https://www.goodreads.com/book/show/3682.A_Great_and_Terrible_Beauty", "num_ratings": "189,729", "num_reviews": "9,293", "avg_ratings": 3.79, "genres": ["Fantasy", "Young Adult", "Historical", "Historical Fiction", "Fiction", "Historical"], "title": "A Great and Terrible Beauty", "description": ["In this debut gothic novel mysterious visions, dark family secrets and a long-lost diary thrust Gemma and her classmates back into the horrors that followed her from India. (Ages 12+)", "It's 1895, and after the suicide of her mother, 16-year-old Gemma Doyle is shipped off from the life she knows in India to Spence, a proper boarding school in England. Lonely, guilt-ridden, an", "In this debut gothic novel mysterious visions, dark family secrets and a long-lost diary thrust Gemma and her classmates back into the horrors that followed her from India. (Ages 12+)", "It's 1895, and after the suicide of her mother, 16-year-old Gemma Doyle is shipped off from the life she knows in India to Spence, a proper boarding school in England. Lonely, guilt-ridden, and prone to visions of the future that have an uncomfortable habit of coming true, Gemma's reception there is a chilly one. To make things worse, she's been followed by a mysterious young Indian man, a man sent to watch her. But why? What is her destiny? And what will her entanglement with Spence's most powerful girls—and their foray into the spiritual world—lead to?"], "author": "Libba Bray", "num_pages": "403", "awards": ["Iowa High School Book Award (2007)", "Lincoln Award Nominee (2007)"], "places": ["United Kingdom", "India", "London, England"], "character_names": ["Gemma Doyle", "Kartik", "Ann Bradshaw", "Felicity Worthington", "Pippa Cross"], "language": "English", "publish_date": "2003-12-09 00:00:00", "ISBN": "0689875347"},
{"url": "https://www.goodreads.com/book/show/407813.The_Blue_Sword", "num_ratings": "49,663", "num_reviews": "2,482", "avg_ratings": 4.24, "genres": ["Fantasy", "Young Adult", "Fiction", "Romance", "Adventure"], "title": "The Blue Sword", "description": ["Harry Crewe is an orphan girl who comes to live in Damar, the desert country shared by the Homelanders and the secretive, magical Hillfolk. Her life is quiet and ordinary-until the night she is kidnapped by Corlath, the Hillfolk King, who takes her deep into the desert. She does not know the Hillfolk language; she does not know why she has been chosen. But Corlath does. Ha", "Harry Crewe is an orphan girl who comes to live in Damar, the desert country shared by the Homelanders and the secretive, magical Hillfolk. Her life is quiet and ordinary-until the night she is kidnapped by Corlath, the Hillfolk King, who takes her deep into the desert. She does not know the Hillfolk language; she does not know why she has been chosen. But Corlath does. Harry is to be trained in the arts of war until she is a match for any of his men. Does she have the courage to accept her true fate?"], "author": "Robin McKinley", "num_pages": "256", "awards": ["Newbery Medal Nominee (1983)", "Dorothy Canfield Fisher Children's Book Award Nominee (1984)"], "places": [], "character_names": [], "language": null, "publish_date": "1987-03-15 00:00:00", "ISBN": "0441068804"},
{"url": "https://www.goodreads.com/book/show/13833.Emperor_Mage", "num_ratings": "49,928", "num_reviews": "767", "avg_ratings": 4.31, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Emperor Mage", "description": ["Sent to Carthak as part of the Tortallan peace delegation, Daine finds herself in the middle of a sticky political situation. She doesn't like the Carthaki practice of keeping slaves, but it's not her place to say anything -- she's just there to heal the emperor's birds. It's extremely frustrating! What's more, her power has grown in a mysterious way. ", " As the peace talks s", "Sent to Carthak as part of the Tortallan peace delegation, Daine finds herself in the middle of a sticky political situation. She doesn't like the Carthaki practice of keeping slaves, but it's not her place to say anything -- she's just there to heal the emperor's birds. It's extremely frustrating! What's more, her power has grown in a mysterious way. ", " As the peace talks stall, Daine puzzles over Carthak's two-faced Emperor Ozorne. How can he be so caring with his birds and so cruel to his people? Daine is sure he's planning something. Daine must fight the powerful Emperor Mage, knowing that the safety and peace of the realm depend on stopping Ozorne's power-hungry schemes."], "author": "Tamora Pierce", "num_pages": "358", "awards": [], "places": [], "character_names": ["Veralidaine Sarrasri", "Numair Salmalín", "Alanna of Trebond", "Rikash Moonsword", "Ozorne", "Skysong (Kitten)"], "language": "English", "publish_date": "2005-06-01 00:00:00", "ISBN": "1416903372"},
{"url": "https://www.goodreads.com/book/show/28541.Dragonsong", "num_ratings": "42,202", "num_reviews": "1,240", "avg_ratings": 4.25, "genres": ["Fantasy", "Science Fiction", "Fantasy", "Dragons", "Fiction", "Young Adult"], "title": "Dragonsong", "description": ["It was not Threadfall that made Menolly unhappy. It was her father who betrayed her ambition to be a Harper, who thwarted her love of music. Menolly had no choice but to run away. She came upon a group of fire lizards, wild relatives of the fire-breathing dragons. Her music swirled about them; she taught nine to sing, suddenly Menolly was no longer alone."], "author": "Anne McCaffrey", "num_pages": "192", "awards": ["California Young Readers Medal Nominee for Middle School/Junior High (1980)"], "places": ["Pern"], "character_names": ["Menolly"], "language": "English", "publish_date": "2006-06-01 00:00:00", "ISBN": "141692499X"},
{"url": "https://www.goodreads.com/book/show/53835.The_Age_of_Innocence", "num_ratings": "123,208", "num_reviews": "5,553", "avg_ratings": 3.94, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Romance"], "title": "The Age of Innocence", "description": ["Winner of the 1921 Pulitzer Prize, ", " is ", "’s masterful portrait of desire and betrayal during the sumptuous Golden Age of Old New York, a time when society people “dreaded scandal more than disease.”", "This is Newland Archer’s world as he prepares to marry the beautiful but conventional May Welland. But when the mysterious Countess Ellen Olenska", "Winner of the 1921 Pulitzer Prize, ", " is ", "’s masterful portrait of desire and betrayal during the sumptuous Golden Age of Old New York, a time when society people “dreaded scandal more than disease.”", "This is Newland Archer’s world as he prepares to marry the beautiful but conventional May Welland. But when the mysterious Countess Ellen Olenska returns to New York after a disastrous marriage, Archer falls deeply in love with her. Torn between duty and passion, Archer struggles to make a decision that will either courageously define his life—or mercilessly destroy it."], "author": "Edith Wharton", "num_pages": "332", "awards": ["Pulitzer Prize for Novel (1921)"], "places": ["New York City, New York", "New York City's Upper East Side"], "character_names": ["Newland Archer", "May Welland", "Ellen Olenska"], "language": "English", "publish_date": "2004-08-26 00:00:00", "ISBN": "159308143X"},
{"url": "https://www.goodreads.com/book/show/9328.The_House_of_the_Spirits", "num_ratings": "153,042", "num_reviews": "6,035", "avg_ratings": 4.21, "genres": ["Fiction", "Magical Realism", "Historical", "Historical Fiction", "Classics", "Fantasy"], "title": "The House of the Spirits", "description": ["In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. ", "Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherwor", "In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. ", "Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherworldly hand. Their daughter, Blanca, whose forbidden love for a man Esteban has deemed unworthy infuriates her father, yet will produce his greatest joy: his granddaughter Alba, a beautiful, ambitious girl who will lead the family and their country into a revolutionary future.", " is an enthralling saga that spans decades and lives, twining the personal and the political into an epic novel of love, magic, and fate."], "author": "Isabel Allende", "num_pages": "448", "awards": ["Deutscher Hörbuchpreis for Beste Fiktion (2011)", "Prix du Grand Roman d'évasion (1984)"], "places": ["Chile"], "character_names": ["Esteban Trueba", "Clara del Valle", "Férula Trueba", "Blanca Trueba", "Jaime Trueba", "Nicolàs Trueba", "Pedro Tercero Garcia", "Alba Trueba", "Esteban Garcia"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0553383809"},
{"url": "https://www.goodreads.com/book/show/13829.Terrier", "num_ratings": "53,990", "num_reviews": "1,731", "avg_ratings": 4.16, "genres": ["Fantasy", "Young Adult", "Fiction"], "title": "Terrier", "description": ["Hundreds of years before Alanna first drew her sword in Tamora Pierce's memorable debut, ", ", Tortall had a heroine named Beka Cooper - a fierce young woman who fights crime in a world of magic. This is the beginning of her story, her legend, and her legacy....", "Beka Cooper is a rookie with the law-enforcing Provost's Guard, commonly known as \"the Pro", "Hundreds of years before Alanna first drew her sword in Tamora Pierce's memorable debut, ", ", Tortall had a heroine named Beka Cooper - a fierce young woman who fights crime in a world of magic. This is the beginning of her story, her legend, and her legacy....", "Beka Cooper is a rookie with the law-enforcing Provost's Guard, commonly known as \"the Provost's Dogs,\" in Corus, the capital city of Tortall. To the surprise of both the veteran \"Dogs\" and her fellow \"puppies,\" Beka requests duty in the Lower City. The Lower City is a tough beat. But it's also where Beka was born, and she's comfortable there.", "Beka gets her wish. She's assigned to work with Mattes and Clary, famed veterans among the Provost's Dogs. They're tough, they're capable, and they're none too happy about the indignity of being saddled with a puppy for the first time in years. What they don't know is that Beka has something unique to offer. Never much of a talker, Beka is a good listener. So good, in fact, that she hears things that Mattes and Clary never could - information that is passed in murmurs when flocks of pigeons gather ... murmurs that are the words of the dead.", "In this way, Beka learns of someone in the Lower City who has overturned the power structure of the underworld and is terrorizing its citizens into submission and silence. Beka's magical listening talent is the only way for the Provost's Dogs to find out the identity of this brutal new underlord, for the dead are beyond fear. And the ranks of the dead will be growing if the Dogs can't stop a crime wave the likes of which has never been seen. Luckily for the people of the Lower City, the new puppy is a true terrier!"], "author": "Tamora Pierce", "num_pages": "584", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2012)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2009)", "Missouri Gateway Readers Award Nominee (2009)"], "places": ["Tortall"], "character_names": ["Beka Cooper"], "language": "English", "publish_date": "2006-10-24 00:00:00", "ISBN": "037581468X"},
{"url": "https://www.goodreads.com/book/show/10917.My_Sister_s_Keeper", "num_ratings": "948,287", "num_reviews": "31,753", "avg_ratings": 4.06, "genres": ["Fiction", "Contemporary", "Womens Fiction", "Chick Lit"], "title": "My Sister's Keeper", "description": ["Anna is not sick, but she might as well be. By age thirteen, she has undergone countless surgeries, transfusions, and shots so that her older sister, Kate, can somehow fight the leukemia that has plagued her since childhood. The product of preimplantation genetic diagnosis, Anna was conceived as a bone marrow match for Kate -- a life and a role that she has never challenge", "Anna is not sick, but she might as well be. By age thirteen, she has undergone countless surgeries, transfusions, and shots so that her older sister, Kate, can somehow fight the leukemia that has plagued her since childhood. The product of preimplantation genetic diagnosis, Anna was conceived as a bone marrow match for Kate -- a life and a role that she has never challenged... until now. Like most teenagers, Anna is beginning to question who she truly is. But unlike most teenagers, she has always been defined in terms of her sister—and so Anna makes a decision that for most would be unthinkable, a decision that will tear her family apart and have perhaps fatal consequences for the sister she loves.", "A provocative novel that raises some important ethical issues, ", " is the story of one family's struggle for survival at all human costs and a stunning parable for all time."], "author": "Jodi Picoult", "num_pages": "423", "awards": ["Audie Award for Multi-Voiced Performance (2005)", "Pennsylvania Young Readers' Choice Award for Young Adults (2007)", "ALA Alex Award (2005)", "Lincoln Award (2006)", "Green Mountain Book Award (2007)", "Missouri Gateway Readers Award Nominee (2007)"], "places": ["United States of America", "Providence, Rhode Island", "Rhode Island"], "character_names": ["Anna Fitzgerald", "Sara Fitzgerald", "Kate Fitzgerald", "Brian Fitzgerald", "Jesse Fitzgerald", "Campbell Alexander", "Julia Romana"], "language": "English", "publish_date": "2005-02-01 00:00:00", "ISBN": "0743454537"},
{"url": "https://www.goodreads.com/book/show/17878747-the-forsaken", "num_ratings": "65", "num_reviews": "20", "avg_ratings": 4.62, "genres": ["Magical Realism", "Fantasy"], "title": "The Forsaken", "description": ["The Forsaken ", "Her mother is dead, her home is destroyed. Gwenevere flees into the forest in the dead of winter and stumbles into the human world. Unable to speak their language, but capable of reading their thoughts, Gwen acclimates quickly. Meanwhile she discovers that her native tongue is magical, giving her the power to control the world around her. Seeking the answers t", "The Forsaken ", "Her mother is dead, her home is destroyed. Gwenevere flees into the forest in the dead of winter and stumbles into the human world. Unable to speak their language, but capable of reading their thoughts, Gwen acclimates quickly. Meanwhile she discovers that her native tongue is magical, giving her the power to control the world around her. Seeking the answers to her identity and her forgotten past, orphaned Gwen runs off in search of her own kind. Her dark gifts bring to light horrible truths, the discovery of which forces Gwen to make a fatal decision. The only thing that is certain, her life is about to take a drastic turn - there is no going back from murder."], "author": "R.J. Craddock", "num_pages": "395", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-01 00:00:00", "ISBN": "0615806481"},
{"url": "https://www.goodreads.com/book/show/8854594-the-cruiserweight", "num_ratings": "20", "num_reviews": "6", "avg_ratings": 4.15, "genres": ["Business", "Amazon", "Romance", "Erotic Romance", "Fiction"], "title": "The Cruiserweight", "description": ["In this punchy, romantic take on the wrestling world where only some of the physical contact takes place in the ring, sports journalist Karen Montgomery has been following for years the career of Brett Kerrigan, one of the smallest cruiserweight wrestlers in the business, and can recall in detail every bout he has ever fought, recognising his outstanding skills as a wrestl", "In this punchy, romantic take on the wrestling world where only some of the physical contact takes place in the ring, sports journalist Karen Montgomery has been following for years the career of Brett Kerrigan, one of the smallest cruiserweight wrestlers in the business, and can recall in detail every bout he has ever fought, recognising his outstanding skills as a wrestler and his intuitive flair for entertaining the crowd.", "She has even written an award-winning article about him. Now she desperately wants to meet him.", "One night, after many failed attempts to reach him, she looks up to find him standing right there in front of her. They get talking and they immediately hit it off.", "However, as they become involved and grow ever-closer, Brett loses his contract and must strike out on his own. Will their relationship survive the pressures on both of them, their differences in ages, and the other women in Brett's life?", "Or will one of them decide they are not the ideal tag-team after all?"], "author": "L. Anne Carrington", "num_pages": "308", "awards": [], "places": [], "character_names": ["Brett Kerrigan", "Karen Montgomery"], "language": "English", "publish_date": "2010-12-15 00:00:00", "ISBN": "1456465198"},
{"url": "https://www.goodreads.com/book/show/17150.My_ntonia", "num_ratings": "107,726", "num_reviews": "6,375", "avg_ratings": 3.77, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "My Ántonia", "description": ["Through Jim Burden's endearing, smitten voice, we revisit the remarkable vicissitudes of immigrant life in the Nebraska heartland, with all its insistent bonds. Guiding the way are some of literature's most beguiling characters: the Russian brothers plagued by memories of a fateful sleigh ride, Antonia's desperately homesick father and self-indulgent mother, and the coy Le", "Through Jim Burden's endearing, smitten voice, we revisit the remarkable vicissitudes of immigrant life in the Nebraska heartland, with all its insistent bonds. Guiding the way are some of literature's most beguiling characters: the Russian brothers plagued by memories of a fateful sleigh ride, Antonia's desperately homesick father and self-indulgent mother, and the coy Lena Lingard. Holding the pastoral society's heart, of course, is the bewitching, free-spirited Antonia."], "author": "Willa Cather", "num_pages": "232", "awards": [], "places": ["Nebraska"], "character_names": ["Ántonia Shimerda", "Jim Burden", "Josiah Burden", "Emmaline Burden", "Ambrosch Shimerda", "Lena Lingard", "Otto Fuchs", "Jake Marpole", "Mr. Shimerda", "Mrs. Shimerda"], "language": "English", "publish_date": "2000-02-20 00:00:00", "ISBN": "1583485090"},
{"url": "https://www.goodreads.com/book/show/153800.Lady_Knight", "num_ratings": "42,733", "num_reviews": "794", "avg_ratings": 4.31, "genres": ["Fantasy", "Young Adult", "Fiction", "Young Adult", "Young Adult Fantasy"], "title": "Lady Knight", "description": ["In the final thrilling installment of Tamora Pierce's Protector of the Small series (", ", ", ", and ", "), our sturdy young heroine, Keladry of Mindelan (a.k.a. Kel), has finally been knighted. Never one to rest on her laurels, Kel champs at the bit, ready to tackle the horrific magic killing devices she was shown in the Chamber of the Ordeal during her knighthoo", "In the final thrilling installment of Tamora Pierce's Protector of the Small series (", ", ", ", and ", "), our sturdy young heroine, Keladry of Mindelan (a.k.a. Kel), has finally been knighted. Never one to rest on her laurels, Kel champs at the bit, ready to tackle the horrific magic killing devices she was shown in the Chamber of the Ordeal during her knighthood initiation. The huge, insectlike machines, \"made of iron-coated giants' bones, chains, pulleys, dagger-fingers and -toes, and a long whiplike tail,\" feed on the souls of dead children and are systematically killing off the citizens and warriors of Tortall. "], "author": "Tamora Pierce", "num_pages": "416", "awards": [], "places": ["Tortall"], "character_names": ["Keladry"], "language": "English", "publish_date": "2007-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/139253.The_House_on_Mango_Street", "num_ratings": "98,014", "num_reviews": "8,146", "avg_ratings": 3.6, "genres": ["Fiction", "Young Adult", "Classics", "Short Stories", "Academic", "School"], "title": "The House on Mango Street", "description": ["Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up", "Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up in Chicago, inventing for herself who and what she will become. Few other books in our time have touched so many readers."], "author": "Sandra Cisneros", "num_pages": "110", "awards": ["American Book Award (1985)", "George C. Stone Center for Children's Books Recognition of Merit Award (1994)"], "places": ["Chicago, Illinois"], "character_names": ["Esperanza", "Nenny"], "language": "English", "publish_date": "2009-04-03 00:00:00", "ISBN": "0679734775"},
{"url": "https://www.goodreads.com/book/show/285205.Blood_Bound", "num_ratings": "97,823", "num_reviews": "3,441", "avg_ratings": 4.31, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Shapeshifters", "Werewolves", "Romance", "Romance", "Paranormal Romance"], "title": "Blood Bound", "description": ["Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since", "Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since she can shapeshift at will, she agrees to act as some extra muscle when her vampire friend Stefan goes to deliver a message to another of his kind.", "But this new vampire is hardly ordinary-and neither is the demon inside of him."], "author": "Patricia Briggs", "num_pages": "292", "awards": [], "places": ["United States of America", "Washington (the state)", "Tri-Cities, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Charles Cornick", "Darryl Zao", "Warren", "Honey", "Wulfe", "Kyle Brooks", "Stefan Uccello", "Marsilia", "Uncle Mike", "Gabriel Sandoval", "Tony Montenegro", "Bran \"The Marrok\" Cornick", "Ben (werewolf)", "Andre (vampire)"], "language": "English", "publish_date": "2007-01-30 00:00:00", "ISBN": "0441014739"},
{"url": "https://www.goodreads.com/book/show/20564.The_Mill_on_the_Floss", "num_ratings": "42,774", "num_reviews": "1,621", "avg_ratings": 3.78, "genres": ["Classics", "Fiction", "Literature", "19th Century", "Literature"], "title": "The Mill on the Floss", "description": ["Brought up at Dorlcote Mill, Maggie Tulliver worships her brother Tom and is desperate to win the approval of her parents, but her passionate, wayward nature and her fierce intelligence bring her into constant conflict with her family. As she reaches adulthood, the clash between their expectations and her desires", "Brought up at Dorlcote Mill, Maggie Tulliver worships her brother Tom and is desperate to win the approval of her parents, but her passionate, wayward nature and her fierce intelligence bring her into constant conflict with her family. As she reaches adulthood, the clash between their expectations and her desires is painfully played out as she finds herself torn between her relationships with three very different men: her proud and stubborn brother, a close friend who is also the son of her family's worst enemy, and a charismatic but dangerous suitor. With its poignant portrayal of sibling relationships, The Mill on the Floss is considered George Eliot's most autobiographical novel; it is also one of her most powerful and moving.", "In this edition writer and critic A.S. Byatt provides full explanatory notes and an introduction relating ", " to George Eliot's own life and times.", "Edited with an introduction and notes by A.S. BYATT"], "author": "George Eliot", "num_pages": "579", "awards": [], "places": ["St. Ogg's"], "character_names": ["Maggie Tulliver", "Tom Tulliver"], "language": "English", "publish_date": "2003-02-27 00:00:00", "ISBN": "0141439629"},
{"url": "https://www.goodreads.com/book/show/13662.The_Tombs_of_Atuan", "num_ratings": "73,208", "num_reviews": "2,135", "avg_ratings": 4.08, "genres": ["Fiction", "Young Adult", "Fantasy", "Science Fiction Fantasy", "Fantasy", "Magic"], "title": "The Tombs of Atuan", "description": ["When young Tenar is chosen as high priestess to the ancient and nameless Powers of the Earth, everything is taken away - home, family, possessions, even her name. For she is now Arha, the Eaten One, guardian of the ominous Tombs of Atuan. ", "While she is learning her way through the dark labyrinth,", "When young Tenar is chosen as high priestess to the ancient and nameless Powers of the Earth, everything is taken away - home, family, possessions, even her name. For she is now Arha, the Eaten One, guardian of the ominous Tombs of Atuan. ", "While she is learning her way through the dark labyrinth, a young wizard, Ged, comes to steal the Tombs' greatest hidden treasure, the Ring of Erreth-Akbe. But Ged also brings with him the light of magic, and together, he and Tenar escape from the darkness that has become her domain."], "author": "Ursula K. Le Guin", "num_pages": "180", "awards": ["Newbery Medal Nominee (1972)", "National Book Award Nominee for Children's Books (1972)", "Mythopoeic Fantasy Award Nominee (1972)"], "places": ["Earthsea Realm"], "character_names": ["Ged", "Tenar"], "language": "English", "publish_date": "2001-09-01 00:00:00", "ISBN": "0689845367"},
{"url": "https://www.goodreads.com/book/show/4989.The_Red_Tent", "num_ratings": "467,764", "num_reviews": "17,942", "avg_ratings": 4.16, "genres": ["Historical", "Historical Fiction", "Fiction", "Christian", "Religion"], "title": "The Red Tent", "description": ["Her name is Dinah. In the Bible, her life is only hinted at in a brief and violent detour within the more familiar chapters of the Book of Genesis that are about her father, Jacob, and his dozen sons. Told in Dinah's voice, this novel reveals the traditions and turmoils of ancient womanhood--the world of the red tent. It begins with the story of her mothers--Leah, Rachel,", "Her name is Dinah. In the Bible, her life is only hinted at in a brief and violent detour within the more familiar chapters of the Book of Genesis that are about her father, Jacob, and his dozen sons. Told in Dinah's voice, this novel reveals the traditions and turmoils of ancient womanhood--the world of the red tent. It begins with the story of her mothers--Leah, Rachel, Zilpah, and Bilhah--the four wives of Jacob. They love Dinah and give her gifts that sustain her through a hard-working youth, a calling to midwifery, and a new home in a foreign land. Dinah's story reaches out from a remarkable period of early history and creates an intimate connection with the past. Deeply affecting, ", " combines rich storytelling with a valuable achievement in modern fiction: a new view of biblical women's society."], "author": "Anita Diamant", "num_pages": "336", "awards": ["Book Sense Book of the Year Award for Adult Fiction (2001)", "Boston Author's Club Award (1998)"], "places": [], "character_names": ["Jacob (Bible)", "Isaac (Bible)", "Dinah (Bible)"], "language": "English", "publish_date": "2005-11-01 00:00:00", "ISBN": "0312353766"},
{"url": "https://www.goodreads.com/book/show/41219.Possession", "num_ratings": "63,528", "num_reviews": "3,811", "avg_ratings": 3.88, "genres": ["Fiction", "Historical", "Historical Fiction", "Romance", "Mystery", "Classics", "Literature", "Literary Fiction", "Historical", "European Literature", "British Literature", "Poetry"], "title": "Possession", "description": [" is an exhilarating novel of wit and romance, at once an intellectual mystery and triumphant love story. It is the tale of a pair of young scholars researching the lives of two Victorian poets. As they uncover their letters, journals, and poems, and track their movements from London to Yorkshire—from spiritualist séances to the fairy-haunted far west of Brittany—", " is an exhilarating novel of wit and romance, at once an intellectual mystery and triumphant love story. It is the tale of a pair of young scholars researching the lives of two Victorian poets. As they uncover their letters, journals, and poems, and track their movements from London to Yorkshire—from spiritualist séances to the fairy-haunted far west of Brittany—what emerges is an extraordinary counterpoint of passions and ideas."], "author": "A.S. Byatt", "num_pages": "555", "awards": ["Man Booker Prize (1990)", "Irish Times International Fiction Prize (1990)", "Commonwealth Writers' Prize for Best Book in South Asia and Europe (1991)"], "places": ["London, England", "Lincoln, England"], "character_names": ["Maud Bailey", "Roland Michell", "Christabel LaMotte", "Randolph Henry Ash", "Leonora Stern", "Mortimer Cropper", "James Blackadder", "Beatrice Nest", "Val", "Euan MacIntyre", "Ellen Ash", "Blanche Glover", "Sabine de Kerkoz"], "language": "English", "publish_date": "1991-10-01 00:00:00", "ISBN": "0679735909"},
{"url": "https://www.goodreads.com/book/show/18583974-blood-and-fire", "num_ratings": "455", "num_reviews": "18", "avg_ratings": 4.05, "genres": ["Fantasy", "Urban Fantasy", "Paranormal", "Vampires", "Fantasy", "Paranormal", "Paranormal", "Witches", "Fantasy", "Magic", "Shapeshifters", "Werewolves", "Romance"], "title": "Blood and Fire", "description": ["Ari thought her biggest problem was deciding if she should move in with her vampire boyfriend, Andreas. That was before they found the dead body at the bottom of the Riverdale cliffs. And before she realized he'd been cursed by black magic.", "Just as she begins the murder investigation, the vampire rulers in Europe send an en", "Ari thought her biggest problem was deciding if she should move in with her vampire boyfriend, Andreas. That was before they found the dead body at the bottom of the Riverdale cliffs. And before she realized he'd been cursed by black magic.", "Just as she begins the murder investigation, the vampire rulers in Europe send an enforcer to make inquiries into the recent defeat of the Toronto vampire prince. While Andreas has taken responsibility for the brutal dictator’s death, there is much about the incident that he and Ari must keep to themselves—secrets the vampire elders would stop at nothing to learn.", "With threats of retaliation hanging over their heads, Ari moves into Andreas’s Victorian mansion—for safety’s sake—while the enforcer begins a campaign of terror. Ari is caught between competing dangers and challenges: black magic, a ghost, a missing Native American artifact…not to mention a new roommate…all while trying to stay alive…"], "author": "Ally Shields", "num_pages": "257", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/232576.Harriet_the_Spy", "num_ratings": "88,143", "num_reviews": "2,131", "avg_ratings": 3.95, "genres": ["Childrens", "Fiction", "Young Adult"], "title": "Harriet the Spy", "description": ["Harriet M. Welsch is a spy. She's staked out a spy route, and she writes down everything about everyone she sees - including her classmates and her best friends - in her notebook. ", "I bet the lady with the cross-eye looks in the mirror and feels just terrible.", "Pinky Whitehead will never change. Does his mother hate him? If I had him I'd hate him.", "Then Harriet loses track of he", "Harriet M. Welsch is a spy. She's staked out a spy route, and she writes down everything about everyone she sees - including her classmates and her best friends - in her notebook. ", "I bet the lady with the cross-eye looks in the mirror and feels just terrible.", "Pinky Whitehead will never change. Does his mother hate him? If I had him I'd hate him.", "Then Harriet loses track of her notebook, and it ends up in the wrong hands. Before Harriet can stop them, her friends have read the always truthful, sometimes awful things she’s written about each of them. Will Harriet find a way to put her life and her friendships back together?", "--back cover"], "author": "Louise Fitzhugh", "num_pages": "300", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (1966)", "Oklahoma Sequoyah Award (1967)"], "places": ["New York City, New York"], "character_names": ["Harriet M. Welsch", "Ole Golly", "Simon \"Sport\" Rocque", "Janie Gibbs"], "language": "English", "publish_date": "2002-08-16 00:00:00", "ISBN": "0440416795"},
{"url": "https://www.goodreads.com/book/show/16169129-october-snow", "num_ratings": "330", "num_reviews": "48", "avg_ratings": 3.88, "genres": ["Thriller", "Contemporary", "Fiction", "Mystery", "Suspense", "Sociology", "Abuse"], "title": "October Snow", "description": ["Josie Kane is a “difficult” woman, a pure enigma - one who survives her abusive husband by honing her unnerving talent for playing mind games: ", "she knows exactly how to manipulate a bully. ", "Finally divorced, she thinks the abuse is over, and she’s free. ", "She’s wrong. And her cynicism is building.", "Josie works with battered women, tryi", "Josie Kane is a “difficult” woman, a pure enigma - one who survives her abusive husband by honing her unnerving talent for playing mind games: ", "she knows exactly how to manipulate a bully. ", "Finally divorced, she thinks the abuse is over, and she’s free. ", "She’s wrong. And her cynicism is building.", "Josie works with battered women, trying to rescue them from a fate similar to hers. But on the night that yet another battered woman is murdered by her husband, pining for a hero as she dies in Josie's arms, her cynicism becomes a quiet, simmering hatred. ", "Her one remaining refuge is in her bond with Maxine and Samantha, the two friends whom she loves like sisters. When Samantha becomes pregnant by Jack - an abuser who makes known his intentions to use the baby as a weapon of control - Josie’s hatred ripens to a vengeful fury.", "She sets out to take on one more batterer, manipulate one more bully… And she lures Jack into the crosshairs of the ultimate mind game. ", "Her friends are convinced that she intends to rid Samantha of Jack. ", "They're right. ", "But with Josie Kane, as always, there's a twist. ", "With her friends helpless to stop her - and with Samantha hanging in the balance - Josie squares off with Jack in a life-and-death, winner-lose-all battle of wits to determine which side will win Sammy's future. ", "And this time, there will be a hero."], "author": "Jenna Brooks", "num_pages": "370", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-29 00:00:00", "ISBN": "1479234826"},
{"url": "https://www.goodreads.com/book/show/32979.The_Secret_of_the_Old_Clock", "num_ratings": "53,693", "num_reviews": "2,491", "avg_ratings": 3.98, "genres": ["Mystery", "Young Adult", "Fiction", "Childrens", "Classics"], "title": "The Secret of the Old Clock", "description": ["This is a facsimile reprint of the first ever Nancy Drew book, published 1930.", "Nancy Drew's keen mind is tested when she searches for Mr. Crowley's missing will."], "author": "Carolyn Keene", "num_pages": "210", "awards": [], "places": ["United States of America"], "character_names": ["Nancy Drew", "Ada Topham", "Carson Drew", "Josiah Crowley", "Isabel Topham", "Richard Topham", "Cora Topham", "Henry Rolsted", "Allie Horner", "Grace Horner", "Helen Corning", "Matilda Turner", "Edna Turner", "William Mathews", "Fred Mathews", "Abigail Rowen", "Jeff Tucker"], "language": "English", "publish_date": "1991-09-01 00:00:00", "ISBN": "1557091552"},
{"url": "https://www.goodreads.com/book/show/456908.A_Tree_Grows_in_Brooklyn", "num_ratings": "330,051", "num_reviews": "17,299", "avg_ratings": 4.25, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Young Adult"], "title": "A Tree Grows in Brooklyn", "description": ["A Tree Grows in Brooklyn.", "A profoundly moving novel, and an honest and true one. It cuts right to the heart of life ... If you miss A Tree Grows in Brooklyn you will deny yourself a rich experience ... It is a poignant and deeply understanding story of childhood and family relationships. The Nolans lived in the Williamsburg slums of Brooklyn from 1902 until 1919 ... Their d", "A Tree Grows in Brooklyn.", "A profoundly moving novel, and an honest and true one. It cuts right to the heart of life ... If you miss A Tree Grows in Brooklyn you will deny yourself a rich experience ... It is a poignant and deeply understanding story of childhood and family relationships. The Nolans lived in the Williamsburg slums of Brooklyn from 1902 until 1919 ... Their daughter Francie and their son Neely knew more than their fair share of the privations and sufferings that are the lot of a great city's poor. Primarily this is Francie's book. She is a superb feat of characterization, an imaginative, alert, resourceful child. And Francie's growing up and beginnings of wisdom are the substance of A Tree Grows in Brooklyn."], "author": "Betty  Smith", "num_pages": "489", "awards": ["Audie Award for Classic (2002)"], "places": ["Brooklyn, New York City, New York", "Williamsburg, Brooklyn, New York"], "character_names": ["Francie Nolan", "Neeley Nolan", "Katie Nolan", "Johnny Nolan", "Mary Rommely", "Sissy Rommely", "Eva \"Evy\" Rommely Flittman", "Thomas Rommely"], "language": "English", "publish_date": "1998-09-01 00:00:00", "ISBN": "006092988X"},
{"url": "https://www.goodreads.com/book/show/268602.Naked_in_Death", "num_ratings": "140,417", "num_reviews": "4,930", "avg_ratings": 4.13, "genres": ["Mystery", "Romance", "Mystery", "Crime", "Romance", "Romantic Suspense", "Fiction"], "title": "Naked in Death", "description": ["In hardcover for the first time, here is the novel that started it all-the first book in J. D. Robb's number-one ", "-bestselling In Death series, featuring New York City homicide detective Lieutenant Eve Dallas and Roarke. ", " It is the year 2058, and technology now completely rules the world. But New York City Detective Eve Dallas knows that the irresistible impul", "In hardcover for the first time, here is the novel that started it all-the first book in J. D. Robb's number-one ", "-bestselling In Death series, featuring New York City homicide detective Lieutenant Eve Dallas and Roarke. ", " It is the year 2058, and technology now completely rules the world. But New York City Detective Eve Dallas knows that the irresistible impulses of the human heart are still ruled by just one thing: passion. ", " When a senator's daughter is killed, the secret life of prostitution she'd been leading is revealed. The high-profile case takes Lieutenant Eve Dallas into the rarefied circles of Washington politics and society. Further complicating matters is Eve's growing attraction to Roarke, who is one of the wealthiest and most influential men on the planet, devilishly handsome... and the leading suspect in the investigation."], "author": "J.D. Robb", "num_pages": "294", "awards": [], "places": ["New York City, New York"], "character_names": ["Eve Dallas", "Roarke", "Ryan Feeney", "Charlotte Mira", "Commander Jack Whitney", "Mavis Freestone", "Nadine Furst", "Lawrence Charles Summerset", "Charles Monroe"], "language": "English", "publish_date": "2004-03-08 00:00:00", "ISBN": "0399151575"},
{"url": "https://www.goodreads.com/book/show/2998.The_Secret_Garden", "num_ratings": "755,584", "num_reviews": "14,685", "avg_ratings": 4.12, "genres": ["Classics", "Fiction", "Childrens", "Young Adult"], "title": "The Secret Garden", "description": ["\"One of the most delightful and enduring classics of children's literature, The Secret Garden by Victorian author Frances Hodgson Burnett has remained a firm favorite with children the world over ever since it made its first appearance. Initially published as a serial story in 1910 in The American Magazine, it was brought out in novel form in 1911. ", "The plot centers round M", "\"One of the most delightful and enduring classics of children's literature, The Secret Garden by Victorian author Frances Hodgson Burnett has remained a firm favorite with children the world over ever since it made its first appearance. Initially published as a serial story in 1910 in The American Magazine, it was brought out in novel form in 1911. ", "The plot centers round Mary Lennox, a young English girl who returns to England from India, having suffered the immense trauma by losing both her parents in a cholera epidemic. However, her memories of her parents are not pleasant, as they were a selfish, neglectful and pleasure-seeking couple. Mary is given to the care of her uncle Archibald Craven, whom she has never met. She travels to his home, Misselthwaite Manor located in the gloomy Yorkshire, a vast change from the sunny and warm climate she was used to. When she arrives, she is a rude, stubborn and given to stormy temper tantrums. However, her nature undergoes a gradual transformation when she learns of the tragedies that have befallen her strict and disciplinarian uncle whom she earlier feared and despised. Once when he's away from home, Mary discovers a charming walled garden which is always kept locked. The mystery deepens when she hears sounds of sobbing from somewhere within her uncle's vast mansion. The kindly servants ignore her queries or pretend they haven't heard, spiking Mary's curiosity. ", "The Secret Garden appeals to both young and old alike. It has wonderful elements of mystery, spirituality, charming characters and an authentic rendering of childhood emotions and experiences. Commonsense, truth and kindness, compassion and a belief in the essential goodness of human beings lie at the heart of this unforgettable story. It is the best known of Frances Hodgson Burnett's works, though most of us have definitely heard of, if not read, her other novel Little Lord Fauntleroy. ", "The book has been adapted extensively on stage, film and television and translated into all the world's major languages. In 1991, a Japanese anime version was launched for television in Japan. It remains a popular and beloved story of a child's journey into maturity, and a must-read for every child, parent, teacher and anyone who would enjoy this fascinating glimpse of childhood. One of the most delightful and enduring classics of children's literature, The Secret Garden by Victorian author Frances Hodgson Burnett has remained a firm favorite with children the world over ever since it made its first appearance. Initially published as a serial story in 1910 in The American Magazine, it was brought out in novel form in 1911.\" "], "author": "Frances Hodgson Burnett", "num_pages": "331", "awards": ["Lewis Carroll Shelf Award (1958)"], "places": ["Yorkshire, England"], "character_names": ["Mary Lennox", "Colin Craven", "Dickon Sowerby", "Martha Sowerby", "Ben Weatherstaff", "Archibald Craven", "Lilias Craven", "Susan Sowerby", "Mrs. Medlock", "Dr. Craven"], "language": "English", "publish_date": "1998-09-01 00:00:00", "ISBN": "0517189607"},
{"url": "https://www.goodreads.com/book/show/37380.The_Heart_Is_a_Lonely_Hunter", "num_ratings": "81,103", "num_reviews": "5,338", "avg_ratings": 3.97, "genres": ["Fiction", "Classics", "Literature"], "title": "The Heart Is a Lonely Hunter", "description": ["An alternate cover for this ISBN can be found ", ".", "Carson McCullers’ prodigious first novel was published to instant acclaim when she was just twenty-three. Set in a small town in the middle of the deep South, it is the story of John Singer, a lonely deaf-mute, and a disparate group of people who are drawn towards his kind, sympathetic nature. The owner of the café where S", "An alternate cover for this ISBN can be found ", ".", "Carson McCullers’ prodigious first novel was published to instant acclaim when she was just twenty-three. Set in a small town in the middle of the deep South, it is the story of John Singer, a lonely deaf-mute, and a disparate group of people who are drawn towards his kind, sympathetic nature. The owner of the café where Singer eats every day, a young girl desperate to grow up, an angry drunkard, a frustrated black doctor: each pours their heart out to Singer, their silent confidant, and he in turn changes their disenchanted lives in ways they could never imagine.", "Contains Chronology, list of Further Reading and Notes."], "author": "Carson McCullers", "num_pages": "368", "awards": [], "places": [], "character_names": ["John Singer", "Spiros Antonapoulos", "Biff Brannon", "Jake Blount", "Mick Kelly", "Benedict Copeland"], "language": "English", "publish_date": "2000-09-08 00:00:00", "ISBN": "0618084746"},
{"url": "https://www.goodreads.com/book/show/37435.The_Secret_Life_of_Bees", "num_ratings": "994,566", "num_reviews": "27,841", "avg_ratings": 4.03, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Adult Fiction"], "title": "The Secret Life of Bees", "description": ["Set in South Carolina in 1964, ", " tells the story of Lily Owens, whose life has been shaped around the blurred memory of the afternoon her mother was killed. When Lily's fierce-hearted black \"stand-in mother,\" Rosaleen, insults three of the deepest racists in town, Lily decides to spring them both free. They escape to Tiburon, South Carolina--a town th", "Set in South Carolina in 1964, ", " tells the story of Lily Owens, whose life has been shaped around the blurred memory of the afternoon her mother was killed. When Lily's fierce-hearted black \"stand-in mother,\" Rosaleen, insults three of the deepest racists in town, Lily decides to spring them both free. They escape to Tiburon, South Carolina--a town that holds the secret to her mother's past. Taken in by an eccentric trio of black beekeeping sisters, Lily is introduced to their mesmerizing world of bees and honey, and the Black Madonna. This is a remarkable novel about divine female power, a story women will share and pass on to their daughters for years to come."], "author": "Sue Monk Kidd", "num_pages": "336", "awards": ["Orange Prize Nominee for Fiction Longlist (2002)", "Book Sense Book of the Year Award for Paperback (2004)", "Lincoln Award Nominee (2005)", "Missouri Gateway Readers Award Nominee (2005)"], "places": ["United States of America", "South Carolina", "Tiburon, South Carolina"], "character_names": ["Lily Owens", "Rosaleen", "August Boatwright", "June Boatwright", "May Boatwright", "T. Ray Owens"], "language": "English", "publish_date": "2003-01-28 00:00:00", "ISBN": "0142001740"},
{"url": "https://www.goodreads.com/book/show/13836.Wild_Magic", "num_ratings": "61,462", "num_reviews": "1,738", "avg_ratings": 4.33, "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic", "Fiction"], "title": "Wild Magic", "description": ["Young Daine's knack with horses gets her a job helping the royal horsemistress drive a herd of ponies to Tortall. Soon it becomes clear that Daine's talent, as much as she struggles to hide it, is downright magical. Horses and other animals not only obey, but listen to her words. Daine, though, will have to learn to trust humans before she can come to terms with her powers", "Young Daine's knack with horses gets her a job helping the royal horsemistress drive a herd of ponies to Tortall. Soon it becomes clear that Daine's talent, as much as she struggles to hide it, is downright magical. Horses and other animals not only obey, but listen to her words. Daine, though, will have to learn to trust humans before she can come to terms with her powers, her past, and herself."], "author": "Tamora Pierce", "num_pages": "362", "awards": [], "places": ["Tortall"], "character_names": ["Veralidaine Sarrasri", "Numair Salmalín", "Alanna of Trebond", "George Cooper", "Jonathan of Conte", "Onua Chamtong"], "language": "English", "publish_date": "2005-06-01 00:00:00", "ISBN": "1416903437"},
{"url": "https://www.goodreads.com/book/show/50398.Northanger_Abbey", "num_ratings": "255,541", "num_reviews": "9,822", "avg_ratings": 3.81, "genres": ["Classics", "Fiction", "Romance"], "title": "Northanger Abbey", "description": ["Jane Austen's first novel—published posthumously in 1818—tells the story of Catherine Morland and her dangerously sweet nature, innocence, and sometime self-delusion. Though Austen's fallible heroine is repeatedly drawn into scrapes while vacationing at Bath and during her subsequent visit to Northanger Abbey, Catherine eventually triumphs, blossoming into a discerning wom", "Jane Austen's first novel—published posthumously in 1818—tells the story of Catherine Morland and her dangerously sweet nature, innocence, and sometime self-delusion. Though Austen's fallible heroine is repeatedly drawn into scrapes while vacationing at Bath and during her subsequent visit to Northanger Abbey, Catherine eventually triumphs, blossoming into a discerning woman who learns truths about love, life, and the heady power of literature. The satirical novel pokes fun at the gothic novel while earnestly emphasizing caution to the female sex.", "This book was converted from its physical edition to the digital format by a community of volunteers. You may find it for free on the web. Purchase of the Kindle edition includes wireless delivery."], "author": "Jane Austen", "num_pages": "251", "awards": [], "places": ["Bath, Somerset, England", "Devon, England"], "character_names": ["Catherine Morland", "Henry Tilney", "Eleanor Tilney", "General Tilney", "John Thorpe", "Isabella Thorpe", "James Morland", "Mrs. Morland", "Mr. Morland", "Mrs. Allen", "Mr. Allen", "Captain Tilney", "Mrs. Thorpe"], "language": "English", "publish_date": "2005-03-03 00:00:00", "ISBN": "1593082649"},
{"url": "https://www.goodreads.com/book/show/30183.Marked", "num_ratings": "391,564", "num_reviews": "13,356", "avg_ratings": 3.79, "genres": ["Young Adult", "Paranormal", "Vampires", "Fantasy", "Fantasy", "Paranormal"], "title": "Marked", "description": [" ", "After a Vampire Tracker Marks her with a crescent moon on her forehead, 16-year-old Zoey Redbird enters the House of Night and learns that she is no average fledgling. She has been Marked as special by the vampyre Goddess Nyx and has affinities for all five elements: Air, Fire Water, Earth and Spirit. But she", " ", "After a Vampire Tracker Marks her with a crescent moon on her forehead, 16-year-old Zoey Redbird enters the House of Night and learns that she is no average fledgling. She has been Marked as special by the vampyre Goddess Nyx and has affinities for all five elements: Air, Fire Water, Earth and Spirit. But she is not the only fledgling at the House of Night with special powers. When she discovers that the leader of the Dark Daughters, the school’s most elite club, is mis-using her Goddess-given gifts, Zoey must look deep within herself for the courage to embrace her destiny – with a little help from her new vampyre friends (or Nerd Herd, as Aphrodite calls them)"], "author": "P.C. Cast", "num_pages": "306", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Young Adult (2007)"], "places": ["United States of America", "Tulsa, Oklahoma", "Oklahoma"], "character_names": ["Zoey Redbird", "Nyx (House of Night)", "Erik Night", "Stevie Rae Johnson", "Neferet", "Heath Luck", "Aphrodite LaFont", "Sylvia Redbird", "Erin Bates", "Shaunee Cole", "Damien Maslin"], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "0312360266"},
{"url": "https://www.goodreads.com/book/show/153008.Kushiel_s_Dart", "num_ratings": "61,601", "num_reviews": "3,632", "avg_ratings": 4.04, "genres": ["Fantasy", "Romance", "Fiction", "Fantasy", "Epic Fantasy", "Adult Fiction", "Erotica"], "title": "Kushiel's Dart", "description": ["The land of Terre d'Ange is a place of unsurpassing beauty and grace. It is said that angels found the land and saw it was good... and the ensuing race that rose from the seed of angels and men live by one simple rule: Love as thou wilt. ", "Phèdre nó Delaunay is a young woman who was born with a scarlet mote in her left eye. Sold into indentured servitude as a child, her bond", "The land of Terre d'Ange is a place of unsurpassing beauty and grace. It is said that angels found the land and saw it was good... and the ensuing race that rose from the seed of angels and men live by one simple rule: Love as thou wilt. ", "Phèdre nó Delaunay is a young woman who was born with a scarlet mote in her left eye. Sold into indentured servitude as a child, her bond is purchased by Anafiel Delaunay, a nobleman with very a special mission... and the first one to recognize who and what she is: one pricked by Kushiel's Dart, chosen to forever experience pain and pleasure as one.", "Phèdre is trained equally in the courtly arts and the talents of the bedchamber, but, above all, the ability to observe, remember, and analyze. Almost as talented a spy as she is courtesan, Phèdre stumbles upon a plot that threatens the very foundations of her homeland. Treachery sets her on her path; love and honor goad her further. And in the doing, it will take her to the edge of despair... and beyond. Hateful friend, loving enemy, beloved assassin; they can all wear the same glittering mask in this world, and Phèdre will get but one chance to save all that she holds dear. ", "Set in a world of cunning poets, deadly courtiers, heroic traitors, and a truly Machiavellian villainess, this is a novel of grandeur, luxuriance, sacrifice, betrayal, and deeply laid conspiracies. Not since Dune has there been an epic on the scale of Kushiel's Dart-a massive tale about the violent death of an old age, and the birth of a new."], "author": "Jacqueline Carey", "num_pages": "1015", "awards": ["Locus Award for Best First Novel (2002)", "Gaylactic Spectrum Award Nominee for Best Novel (2002)", "Romantic Times Reviewers' Choice Award (RT Award) for Best Fantasy Novel (2001)"], "places": ["Terre D'Ange"], "character_names": ["Phèdre nó Delaunay", "Joscelin Verreuil", "Melisande Shahrizai", "Anafiel Delaunay", "Hyacinthe (Jacqueline Carey)", "Ysandre de la Courcel"], "language": "English", "publish_date": "2003-09-05 00:00:00", "ISBN": "0330493744"},
{"url": "https://www.goodreads.com/book/show/10648723-changeling", "num_ratings": "46", "num_reviews": "9", "avg_ratings": 4.04, "genres": ["Paranormal", "Vampires", "Fiction", "Fantasy", "Paranormal"], "title": "Changeling", "description": ["Changeling ", "A young woman vanished from the streets, a life destroyed, her humanity a battle ground.", "London, April 1987. Joanne is out for a night on the town and her plans go awry. She slips into a pub for a quick drink before going to see a film. Jonathon Dreyfuss is on the prowl, looking for something tasty to devour. He spots Joanne through the window. Joanne vanishes fr", "Changeling ", "A young woman vanished from the streets, a life destroyed, her humanity a battle ground.", "London, April 1987. Joanne is out for a night on the town and her plans go awry. She slips into a pub for a quick drink before going to see a film. Jonathon Dreyfuss is on the prowl, looking for something tasty to devour. He spots Joanne through the window. Joanne vanishes from sight. ", "She wakes in a room with no windows, trapped in a nightmare of pain and terror. Dreyfuss finds her boring and tedious... yet he can’t quite kill her. Something about her, some aspect of her, is pleasing to him. He keeps her for a little while, house training her as he’s attempted to train others in the past. She resists, as they all did, and he takes up the challenge, to prove once again he is master of all. Joanne fights back as best she can, terrified and confused, beaten, starved and lost in a madman’s fantasy. He spends months schooling her to obey, tearing her down. When she begins to break, as hope of escape fades... he reveals his final madness: he is Vampire. She too, will be Vampire: his Changeling. ", "He wishes her to be his immortal companion, his eternal mate. What Dreyfuss wishes, Dreyfuss gets.", "The battle for her soul begins. All she has is her will and the need to be free. Dreyfuss holds all the cards: money, power and no conscience. Can she keep fighting, or will he win? How long can Joanne stay human? ", "What price would you pay for your freedom? ", "Changeling is the first novel in the Dreyfuss Trilogy: a compelling and unique vampire mythology for adults."], "author": "Morgan Gallagher", "num_pages": "378", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/179064.The_Goose_Girl", "num_ratings": "101,459", "num_reviews": "9,247", "avg_ratings": 4.18, "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Fiction"], "title": "The Goose Girl", "description": ["Anidora-Kiladra Talianna Isilee, Crown Princess of Kildenree spent the first years of her life listening to her aunt's incredible stories, and learning the language of the birds. Little knowing how valuable her aunt's strange knowledge would prove to be when she grew older. From the Grimm's fairy tale of the princess who became a goose girl before she could become a queen,", "Anidora-Kiladra Talianna Isilee, Crown Princess of Kildenree spent the first years of her life listening to her aunt's incredible stories, and learning the language of the birds. Little knowing how valuable her aunt's strange knowledge would prove to be when she grew older. From the Grimm's fairy tale of the princess who became a goose girl before she could become a queen, Shannon Hale has woven an incredible, original and magical tale of a girl who must understand her own incredible talents before she can overcome those who wish her harm."], "author": "Shannon Hale", "num_pages": "383", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2010)", "Utah Book Award for Children/Young Adults (2003)", "Josette Frank Award (2004)"], "places": [], "character_names": ["Razo", "Geric", "Enna", "Princess Anidori-Kiladra", "Finn", "Selia"], "language": "English", "publish_date": "2005-05-01 00:00:00", "ISBN": "1582349908"},
{"url": "https://www.goodreads.com/book/show/24337.Ella_Enchanted", "num_ratings": "362,161", "num_reviews": "9,099", "avg_ratings": 3.97, "genres": ["Fantasy", "Young Adult", "Fiction", "Romance", "Fantasy", "Fairy Tales", "Childrens"], "title": "Ella Enchanted", "description": [" ", "At birth, Ella is inadvertently cursed by an imprudent young fairy named Lucinda, who bestows on her the \"gift\" of obedience. Anything anyone tells her to do, Ella must obey. Another girl might have been cowed by this affliction, but not feisty Ella: \"Instead of making me docile, Lucinda's curse made a rebel o", " ", "At birth, Ella is inadvertently cursed by an imprudent young fairy named Lucinda, who bestows on her the \"gift\" of obedience. Anything anyone tells her to do, Ella must obey. Another girl might have been cowed by this affliction, but not feisty Ella: \"Instead of making me docile, Lucinda's curse made a rebel of me. Or perhaps I was that way naturally.\" When her beloved mother dies, leaving her in the care of a mostly absent and avaricious father, and later, a loathsome stepmother and two treacherous stepsisters, Ella's life and well-being seem to be in grave peril. But her intelligence and saucy nature keep her in good stead as she sets out on a quest for freedom and self-discovery as she tries to track down Lucinda to undo the curse, fending off ogres, befriending elves, and falling in love with a prince along the way. Yes, there is a pumpkin coach, a glass slipper, and a happily ever after, but this is the most remarkable, delightful, and profound version of Cinderella you'll ever read.", "Gail Carson Levine's examination of traditional female roles in fairy tales takes some satisfying twists and deviations from the original. Ella is bound by obedience against her will, and takes matters in her own hands with ambition and verve. Her relationship with the prince is balanced and based on humor and mutual respect; in fact, it is she who ultimately rescues ", ". Ella Enchanted has won many well-deserved awards, including a Newbery Honor."], "author": "Gail Carson Levine", "num_pages": "232", "awards": ["Newbery Medal Nominee (1998)", "Mythopoeic Fantasy Award Nominee for Children's Literature (1999)", "Grand Canyon Reader Award for Teen Book (1999)", "Maryland Black-Eyed Susan Book Award for Grade 6-9 (2000)", "Dorothy Canfield Fisher Children's Book Award (1999)", "Iowa Teen Award (2000)", "California Young Readers Medal for Middle School/Junior High (2000)", "Rebecca Caudill Young Readers' Book Award (2000)"], "places": [], "character_names": ["Ella Varner", "Lucinda", "Mandy", "Prince Charmont", "Areida", "Hattie", "Olive Abroholos Elephanta"], "language": "English", "publish_date": "1998-09-01 00:00:00", "ISBN": "0590920685"},
{"url": "https://www.goodreads.com/book/show/6479259-spirit-bound", "num_ratings": "244,015", "num_reviews": "8,388", "avg_ratings": 4.36, "genres": ["Young Adult", "Fantasy", "Paranormal", "Fantasy", "Paranormal", "Vampires", "Romance"], "title": "Spirit Bound", "description": ["After a long and heartbreaking journey to Dimitri’s birthplace in Siberia, Rose Hathaway has finally returned to St. Vladimir’s—and to her best friend, Lissa. It is nearly graduation, and the girls can’t wait for their real lives beyond the Academy’s iron gates to begin. But Rose’s heart still aches for Dimitri, and she knows he’s out there, somewhere."], "author": "Richelle Mead", "num_pages": "489", "awards": ["Children's Choice Book Award Nominee for Teen Choice Book of the Year (2011)", "Teen Read Award Nominee for Best Series (2010)", "Goodreads Choice Award for Goodreads Author, Nominee for Favorite Heroine, Nominee for Favorite Book (2010)"], "places": ["Montana", "Las Vegas, Nevada", "Alaska", "Pennsylvania"], "character_names": ["Vasilisa \"Lissa\" Dragomir", "Dimitri Belikov", "Christian Ozera", "Adrian Ivashkov", "Victor Dashkov", "Mia Rinaldi", "Jillian Mastrano", "Abe Mazur", "Natasha Ozera", "Rosemarie \"Rose\" Hathaway"], "language": "English", "publish_date": "2010-05-18 00:00:00", "ISBN": "1595142509"},
{"url": "https://www.goodreads.com/book/show/1582996.City_of_Ashes", "num_ratings": "630,945", "num_reviews": "25,369", "avg_ratings": 4.2, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal", "Romance"], "title": "City of Ashes", "description": [" ", "Clary Fray just wishes that her life would go back to normal. But what's normal when you're a demon-slaying Shadowhunter, your mother is in a magically induced coma, and you can suddenly see Downworlders like werewolves, vampires, and faeries? If Clary left the world of the Shadowhunters behind, it would mean", " ", "Clary Fray just wishes that her life would go back to normal. But what's normal when you're a demon-slaying Shadowhunter, your mother is in a magically induced coma, and you can suddenly see Downworlders like werewolves, vampires, and faeries? If Clary left the world of the Shadowhunters behind, it would mean more time with her best friend, Simon, who's becoming more than a friend. But the Shadowhunting world isn't ready to let her go — especially her handsome, infuriating, newfound brother, Jace. And Clary's only chance to help her mother is to track down rogue Shadowhunter Valentine, who is probably insane, certainly evil — and also her father.", "To complicate matters, someone in New York City is murdering Downworlder children. Is Valentine behind the killings — and if he is, what is he trying to do? When the second of the Mortal Instruments, the Soul-Sword, is stolen, the terrifying Inquisitor arrives to investigate and zooms right in on Jace. How can Clary stop Valentine if Jace is willing to betray everything he believes in to help their father?", "In this breathtaking sequel to ", ", Cassandra Clare lures her readers back into the dark grip of New York City's Downworld, where love is never safe and power becomes the deadliest temptation."], "author": "Cassandra Clare", "num_pages": "453", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2009)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2009)"], "places": ["New York City, New York"], "character_names": ["Alec Lightwood", "Jonathan \"Jace\" Wayland", "Valentine Morgenstern", "Isabelle Lightwood", "Magnus Bane", "Simon Lewis", "Maia Roberts", "Luke Garroway", "Imogen Herondale", "Clarissa \"Clary\" Fray"], "language": "English", "publish_date": "2008-03-25 00:00:00", "ISBN": "1416914293"},
{"url": "https://www.goodreads.com/book/show/41865.Twilight", "num_ratings": "4,234,882", "num_reviews": "97,585", "avg_ratings": 3.58, "genres": ["Young Adult", "Fantasy", "Romance", "Paranormal", "Vampires", "Fiction", "Fantasy", "Paranormal"], "title": "Twilight", "description": ["In the first book of the Twilight Saga, internationally bestselling author Stephenie Meyer introduces Bella Swan and Edward Cul", "In the first book of the Twilight Saga, internationally bestselling author Stephenie Meyer introduces Bella Swan and Edward Cullen, a pair of star-crossed lovers whose forbidden relationship ripens against the backdrop of small-town suspicion and a mysterious coven of vampires. This is a love story with bite."], "author": "Stephenie Meyer", "num_pages": "498", "awards": ["Georgia Peach Book Award (2007)", "Buxtehuder Bulle (2006)", "Kentucky Bluegrass Award for 9-12 (2007)", "Prijs van de Kinder- en Jeugdjury Vlaanderen (2008)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2009)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2008)", "Garden State Book Award for Fiction (Grades 9-12) (2008)", "South Carolina Book Award for Young Adult Book Award (2008)", "Grand Canyon Reader Award for Teen Book (2008)", "Maryland Black-Eyed Susan Book Award for High School (2008)", "Golden Sower Award for Young Adult (2009)", "Nevada Young Readers' Award for Young Adult Category  (2007)", "The Flume: New Hampshire Teen Reader's Choice Award (2007)", "Pennsylvania Young Readers' Choice Award for Young Adult (2009)", "Rhode Island Teen Book Award (2007)", "Evergreen Teen Book Award (2008)", "Michigan Library Association Thumbs Up! Award Nominee (2006)", "Teen Read Award Nominee for Best All-Time-Fave (2010)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2007)", "Iowa High School Book Award (2008)", "Lincoln Award (2008)", "Literaturpreis der Jury der jungen Leser for Cover (2007)", "Prix Et-lisez-moi (2008)", "Missouri Gateway Readers Award (2008)"], "places": ["Forks, Washington", "Phoenix, Arizona", "Washington (the state)"], "character_names": ["Edward Cullen", "Jacob Black", "Laurent", "Renee", "Bella Swan", "Billy Black", "Esme Cullen", "Alice Cullen", "Jasper Hale", "Carlisle Cullen", "Emmett Cullen", "Rosalie Hale", "Charlie Swan", "Mike Newton", "Jessica Stanley", "Angela Weber", "Tyler Crowley"], "language": "English", "publish_date": "2006-09-06 00:00:00", "ISBN": "0316015849"},
{"url": "https://www.goodreads.com/book/show/2802316-shadow-kiss", "num_ratings": "300,066", "num_reviews": "10,572", "avg_ratings": 4.37, "genres": ["Young Adult", "Paranormal", "Vampires", "Fantasy", "Fantasy", "Paranormal", "Romance"], "title": "Shadow Kiss", "description": ["WHAT IF FOLLOWING HER HEART MEANS ROSE COULD LOSE HER BEST FRIEND FOREVER?", "Lissa Dragomir is a Moroi princess: a mortal vampire with a rare gift for harnessing the earth's magic. She must be protected at all times from Strigoi; the fiercest vampires - the ones who never die. The powerful blend of human and vampire blood that flows through Rose Hathaway, Lissa's best friend,", "WHAT IF FOLLOWING HER HEART MEANS ROSE COULD LOSE HER BEST FRIEND FOREVER?", "Lissa Dragomir is a Moroi princess: a mortal vampire with a rare gift for harnessing the earth's magic. She must be protected at all times from Strigoi; the fiercest vampires - the ones who never die. The powerful blend of human and vampire blood that flows through Rose Hathaway, Lissa's best friend, makes her a Dhampir. Rose is dedicated to a dangerous life of protecting Lissa from the Strigoi, who are hell-bent on making Lissa one of them.", "Rose knows it is forbidden to love another guardian. Her best friend, Lissa - the last Dragomir princess - must always come first. Unfortunately, when it comes to gorgeous Dimitri Belikov, some rules are meant to be broken...", "Then a strange darkness begins to grow in Rose's mind, and ghostly shadows warn of a terrible evil drawing nearer to the Academy's iron gates. The immortal undead are closing in, and they want vengeance for the lives Rose has stolen. In a heart-stopping battle to rival her worst nightmares, Rose will have to choose between life, love, and the two people who matter most... but will her choice mean that only one can survive?"], "author": "Richelle Mead", "num_pages": "443", "awards": ["Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2011)"], "places": ["Montana"], "character_names": ["Vasilisa \"Lissa\" Dragomir", "Dimitri Belikov", "Christian Ozera", "Mason Ashford", "Adrian Ivashkov", "Victor Dashkov", "Mia Rinaldi", "Janine Hathaway", "Jillian Mastrano", "Edison \"Eddie\" Castile", "Rosemarie \"Rose\" Hathaway", "Camille Conta", "Stan Alto", "Jesse Zeklos", "Tatiana Ivashkov", "Ryan Aylesworth", "Shane Reyes", "Brandon Lazar", "Dean Barnes"], "language": "English", "publish_date": "2008-01-02 00:00:00", "ISBN": "1595141979"},
{"url": "https://www.goodreads.com/book/show/5996153-blood-promise", "num_ratings": "255,549", "num_reviews": "9,208", "avg_ratings": 4.35, "genres": ["Young Adult", "Paranormal", "Vampires", "Fantasy", "Fantasy", "Paranormal", "Romance"], "title": "Blood Promise", "description": ["Rose Hathaway's life will never be the same. ", "The recent attack on St. Vladimir's Academy devastated the entire Moroi world. Many are dead. And, for the few victims carried off by Strigoi, their fates are even worse. A rare tattoo now adorns Rose's neck, a mark that says she's killed far too many Strigoi to count. But only one victim matters ... Dimitri Belikov. Rose must n", "Rose Hathaway's life will never be the same. ", "The recent attack on St. Vladimir's Academy devastated the entire Moroi world. Many are dead. And, for the few victims carried off by Strigoi, their fates are even worse. A rare tattoo now adorns Rose's neck, a mark that says she's killed far too many Strigoi to count. But only one victim matters ... Dimitri Belikov. Rose must now choose one of two very different paths: honoring her life's vow to protect Lissa—her best friend and the last surviving Dragomir princess—or, dropping out of the Academy to strike out on her own and hunt down the man she loves. She'll have to go to the ends of the earth to find Dimitri and keep the promise he begged her to make. But the question is, when the time comes, will he want to be saved? ", "Now, with everything at stake—and worlds away from St. Vladimir's and her unguarded, vulnerable, and newly rebellious best friend—can Rose find the strength to destroy Dimitri? Or, will she sacrifice herself for a chance at eternal love?"], "author": "Richelle Mead", "num_pages": "503", "awards": ["Children's Choice Book Award Nominee for Teen Choice Book of the Year (2010)", "Goodreads Choice Award Nominee for Young Adult Series (2009)"], "places": ["Montana", "Baia (Russia)"], "character_names": ["Sydney Sage", "Vasilisa \"Lissa\" Dragomir", "Dimitri Belikov", "Christian Ozera", "Adrian Ivashkov", "Mia Rinaldi", "Janine Hathaway", "Avery Lazar", "Jillian Mastrano", "Abe Mazur", "Rosemarie \"Rose\" Hathaway", "Olena Belikov"], "language": "English", "publish_date": "2009-08-25 00:00:00", "ISBN": "1595141987"},
{"url": "https://www.goodreads.com/book/show/19089.Middlemarch", "num_ratings": "118,283", "num_reviews": "5,997", "avg_ratings": 3.94, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Middlemarch", "description": ["Taking place in the years leading up to the First Reform Bill of 1832, Middlemarch explores nearly every subject of concern to modern life: art, religion, science, politics, self, society, human relationships. Among her characters are some of the most remarkable portraits in English literature: Dorothea Brooke, the heroine, idealistic but naive; Rosamond Vincy, beautiful a", "Taking place in the years leading up to the First Reform Bill of 1832, Middlemarch explores nearly every subject of concern to modern life: art, religion, science, politics, self, society, human relationships. Among her characters are some of the most remarkable portraits in English literature: Dorothea Brooke, the heroine, idealistic but naive; Rosamond Vincy, beautiful and egoistic: Edward Casaubon, the dry-as-dust scholar: Tertius Lydgate, the brilliant but morally-flawed physician: the passionate artist Will Ladislaw: and Fred Vincey and Mary Garth, childhood sweethearts whose charming courtship is one of the many humorous elements in the novel's rich comic vein."], "author": "George Eliot", "num_pages": "904", "awards": [], "places": ["Midlands, England"], "character_names": ["Dorothea Brooke", "Celia Brooke", "Will Ladislaw", "Mary Garth", "Rosamond Vincy", "Fred Vincy", "Sir James Chettam", "Tertius Lydgate", "Peter Featherstone", "Edward Casaubon", "Caleb Garth", "Camden Farebrother", "Joshua Rigg", "John Raffles", "Nicholas Bulstrode", "Harriet Bulstrode", "Arthur Brooke"], "language": "English", "publish_date": "2004-08-16 00:00:00", "ISBN": "0451529170"},
{"url": "https://www.goodreads.com/book/show/60510.Poison_Study", "num_ratings": "118,635", "num_reviews": "10,347", "avg_ratings": 4.15, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Magic", "Fiction"], "title": "Poison Study", "description": ["About to be executed for murder, Yelena is offered an extraordinary reprieve. She'll eat the best meals, have rooms in the palace—and risk assassination by anyone trying to kill the Commander of Ixia.", "And so Yelena chooses to become a food taster. But the chief of security, leaving nothing to chance, deliberately feeds her Butterfly's", "About to be executed for murder, Yelena is offered an extraordinary reprieve. She'll eat the best meals, have rooms in the palace—and risk assassination by anyone trying to kill the Commander of Ixia.", "And so Yelena chooses to become a food taster. But the chief of security, leaving nothing to chance, deliberately feeds her Butterfly's Dust—and only by appearing for her daily antidote will she delay an agonizing death from the poison.", "As Yelena tries to escape her new dilemma, disasters keep mounting. Rebels plot to seize Ixia and Yelena develops magical powers she can't control. Her life is threatened again and choices must be made. But this time the outcomes aren't so clear..."], "author": "Maria V. Snyder", "num_pages": "409", "awards": ["RITA Award by Romance Writers of America Nominee for First Book (2006)", "Compton Crook Award (2006)"], "places": ["Ixia"], "character_names": ["Valek", "Commander Ambrose", "Janco", "Yelena Zaltana"], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "0778324338"},
{"url": "https://www.goodreads.com/book/show/85990.Princess_Academy", "num_ratings": "91,852", "num_reviews": "8,116", "avg_ratings": 4.02, "genres": ["Fantasy", "Young Adult", "Fiction", "Childrens", "Middle Grade", "Childrens", "Romance"], "title": "Princess Academy", "author": "Shannon Hale", "num_pages": "314", "awards": ["Newbery Medal Nominee (2006)", "Utah Book Award for Children/Young Adults (2005)", "Dorothy Canfield Fisher Children's Book Award Nominee (2007)", "Rebecca Caudill Young Readers' Book Award Nominee (2008)"], "places": ["Mount Eskel"], "character_names": ["Knut", "Miri", "Peder", "Britta", "Marda", "Katar", "Olana", "Esa", "Frid"], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "1599900734"},
{"url": "https://www.goodreads.com/book/show/7763.The_Joy_Luck_Club", "num_ratings": "548,448", "num_reviews": "7,390", "avg_ratings": 3.91, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Cultural", "China", "Contemporary"], "title": "The Joy Luck Club", "description": ["In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her se", "In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her secrets, trying to unravel the truth about her life, the strings become more tangled, more entwined..."], "author": "Amy Tan", "num_pages": "288", "awards": ["California Book Award for Fiction (Gold) (1989)", "Los Angeles Times Book Prize Nominee for Fiction (1989)", "Northern California Book Awards for Fiction (1989)", "National Book Critics Circle Award Nominee for Fiction (1989)", "National Book Award Finalist for Fiction (1989)"], "places": ["San Francisco, California", "China"], "character_names": ["Suyuan Woo", "June Woo", "Lindo Jong", "Waverly Jong", "An-Mei Hsu", "Rose Hsu Jordan", "Ying-Ying St. Clair", "Lena St. Clair"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038095"},
{"url": "https://www.goodreads.com/book/show/13214.I_Know_Why_the_Caged_Bird_Sings", "num_ratings": "322,484", "num_reviews": "7,781", "avg_ratings": 4.21, "genres": ["Nonfiction", "Classics", "Autobiography", "Memoir", "Biography", "Biography", "Autobiography"], "title": "I Know Why the Caged Bird Sings", "description": ["Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Yea", "Sent by their mother to live with their devout, self-sufficient grandmother in a small Southern town, Maya and her brother, Bailey, endure the ache of abandonment and the prejudice of the local \"powhitetrash.\" At eight years old and back at her mother’s side in St. Louis, Maya is attacked by a man many times her age—and has to live with the consequences for a lifetime. Years later, in San Francisco, Maya learns that love for herself, the kindness of others, her own strong spirit, and the ideas of great authors (\"I met and fell in love with William Shakespeare\") will allow her to be free instead of imprisoned.", "Poetic and powerful, ", " will touch hearts and change minds for as long as people read."], "author": "Maya Angelou", "num_pages": "246", "awards": ["Coretta Scott King Award for Author Honor (1971)"], "places": ["Arkansas", "Louisiana", "California", "Missouri"], "character_names": ["Marguerite Johnson 'Maya'", "Bailey Johnson Jr.", "Annie Henderson 'Momma'", "Uncle Willie", "Bailey Johnson", "Vivian Baxter"], "language": "English", "publish_date": "1993-11-16 00:00:00", "ISBN": "0553279378"},
{"url": "https://www.goodreads.com/book/show/1078.The_Good_Earth", "num_ratings": "203,900", "num_reviews": "8,855", "avg_ratings": 3.97, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Literature", "Historical", "Cultural", "Asia", "Novels", "Academic", "School", "Classics", "Classic Literature"], "title": "The Good Earth", "description": ["This tells the poignant tale of a Chinese farmer and his family in old agrarian China. The humble Wang Lung glories in the soil he works, nurturing the land as it nurtures him and his family. Nearby, the nobles of the House of Hwang consider themselves above the land and its workers; but they will soon meet their own downfall.", "Hard times come upon Wang Lung and his family w", "This tells the poignant tale of a Chinese farmer and his family in old agrarian China. The humble Wang Lung glories in the soil he works, nurturing the land as it nurtures him and his family. Nearby, the nobles of the House of Hwang consider themselves above the land and its workers; but they will soon meet their own downfall.", "Hard times come upon Wang Lung and his family when flood and drought force them to seek work in the city. The working people riot, breaking into the homes of the rich and forcing them to flee. When Wang Lung shows mercy to one noble and is rewarded, he begins to rise in the world, even as the House of Hwang falls."], "author": "Pearl S. Buck", "num_pages": "418", "awards": ["Pulitzer Prize for Novel (1932)", "William Dean Howells Medal (1935)"], "places": ["China"], "character_names": ["Wang Lung", "O-lan"], "language": "English", "publish_date": "2009-03-04 00:00:00", "ISBN": "1416500189"},
{"url": "https://www.goodreads.com/book/show/58345.The_Awakening", "num_ratings": "150,695", "num_reviews": "6,234", "avg_ratings": 3.64, "genres": ["Classics", "Fiction", "Feminism", "Academic", "School", "Literature"], "title": "The Awakening", "description": ["When first published in 1899, ", " shocked readers with its honest treatment of female marital infidelity. Audiences accustomed to the pieties of late Victorian romantic fiction were taken aback by Chopin's daring portrayal of a woman trapped in a stifling marriage, who seeks and finds passionate physical love outside the confines of her domestic situation.", "Aside f", "When first published in 1899, ", " shocked readers with its honest treatment of female marital infidelity. Audiences accustomed to the pieties of late Victorian romantic fiction were taken aback by Chopin's daring portrayal of a woman trapped in a stifling marriage, who seeks and finds passionate physical love outside the confines of her domestic situation.", "Aside from its unusually frank treatment of a then-controversial subject, the novel is widely admired today for its literary qualities. Edmund Wilson characterized it as a work \"quite uninhibited and beautifully written, which anticipates D. H. Lawrence in its treatment of infidelity.\" Although the theme of marital infidelity no longer shocks, few novels have plumbed the psychology of a woman involved in an illicit relationship with the perception, artistry, and honesty that Kate Chopin brought to ", "."], "author": "Kate Chopin", "num_pages": "195", "awards": [], "places": ["New Orleans, Louisiana", "Grand Isle, Louisiana"], "character_names": ["Edna Pontellier", "Léonce Pontellier", "Robert Lebrun", "Alcée Arobin", "Adèle Ratignolle", "Mademoiselle Reisz"], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0543898083"},
{"url": "https://www.goodreads.com/book/show/256683.City_of_Bones", "num_ratings": "1,368,756", "num_reviews": "55,039", "avg_ratings": 4.11, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal", "Romance"], "title": "City of Bones", "description": ["When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is not", "When fifteen-year-old Clary Fray heads out to the Pandemonium Club in New York City, she hardly expects to witness a murder― much less a murder committed by three teenagers covered with strange tattoos and brandishing bizarre weapons. Then the body disappears into thin air. It's hard to call the police when the murderers are invisible to everyone else and when there is nothing―not even a smear of blood―to show that a boy has died. Or was he a boy?", "This is Clary's first meeting with the Shadowhunters, warriors dedicated to ridding the earth of demons. It's also her first encounter with Jace, a Shadowhunter who looks a little like an angel and acts a lot like a jerk. Within twenty-four hours Clary is pulled into Jace's world with a vengeance when her mother disappears and Clary herself is attacked by a demon. But why would demons be interested in ordinary mundanes like Clary and her mother? And how did Clary suddenly get the Sight? The Shadowhunters would like to know..."], "author": "Cassandra Clare", "num_pages": "485", "awards": ["Locus Award Nominee for Best First Novel (2007)", "Georgia Peach Book Award Nominee for Honor book (2009)", "South Carolina Book Award Nominee for Young Adult Book Award (2010)", "Pacific Northwest Library Association Young Reader's Choice Award (2010)", "Lincoln Award (2010)"], "places": ["New York City, New York"], "character_names": ["Alec Lightwood", "Jonathan \"Jace\" Wayland", "Valentine Morgenstern", "Isabelle Lightwood", "Magnus Bane", "Simon Lewis", "Jocelyn Fray", "Luke Garroway", "Clarissa \"Clary\" Fray"], "language": "English", "publish_date": "2007-03-27 00:00:00", "ISBN": "1416914285"},
{"url": "https://www.goodreads.com/book/show/19302.Pippi_Longstocking", "num_ratings": "141,816", "num_reviews": "2,978", "avg_ratings": 4.12, "genres": ["Childrens", "Classics", "Fiction"], "title": "Pippi Longstocking", "description": ["Tommy and his sister Annika have a new neighbor, and her name is Pippi Longstocking. She has crazy red pigtails, no parents to tell her what to do, a horse that lives on her porch, and a flair for the outrageous that seems to lead to one adventure after another!", "--back cover"], "author": "Astrid Lindgren", "num_pages": "160", "awards": ["Lewis Carroll Shelf Award (1973)"], "places": ["Sweden"], "character_names": ["Tommy Settergren", "Pippi Långstrump", "Annika Gannec", "Mrs. Settergren", "Mr. Nilsson the monkey"], "language": "English", "publish_date": "2005-04-21 00:00:00", "ISBN": "0142402494"},
{"url": "https://www.goodreads.com/book/show/536.The_Lovely_Bones", "num_ratings": "1,772,591", "num_reviews": "38,036", "avg_ratings": 3.79, "genres": ["Fiction", "Mystery", "Young Adult", "Contemporary", "Fantasy", "Mystery", "Crime", "Adult Fiction", "Adult", "Drama", "Novels"], "title": "The Lovely Bones", "description": ["On her way home from school on a snowy December day in 1973, 14-year-old Susie Salmon (\"like the fish\") is lured into a makeshift underground den in a cornfield and brutally raped and murdered, the latest victim of a serial killer--the man she knew as her neighbor, Mr. Harvey."], "author": "Alice Sebold", "num_pages": "327", "awards": ["Bram Stoker Award for Best First Novel (2002)", "Orange Prize Nominee for Fiction Longlist (2003)", "British Book Award for Best Read of the Year (2004)", "Book Sense Book of the Year Award for Adult Fiction (2003)", "California Book Award for First Fiction (Silver) (2002)", "South Carolina Book Award for Young Adult Book Award (2005)", "Chicago Tribune Heartland Prize for Fiction (2002)", "Iowa High School Book Award (2005)", "Puddly Award for Fiction (2003)", "Lincoln Award Nominee (2005)", "Missouri Gateway Readers Award (2005)"], "places": ["United States of America", "Philadelphia, Pennsylvania", "Pennsylvania"], "character_names": ["Susie Salmon", "Clarissa", "Holly", "Jack Salmon", "Abigail Salmon", "Lindsey Salmon", "Buckley Salmon", "George Harvey"], "language": "English", "publish_date": "2006-09-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12873.Rebecca", "num_ratings": "361,678", "num_reviews": "17,091", "avg_ratings": 4.21, "genres": ["Classics", "Fiction", "Mystery", "Romance", "Gothic"], "title": "Rebecca", "description": ["Working as a lady's companion, the heroine of ", " learns her place. Her future looks bleak until, on a trip to the South of France, she meets Max de Winter, a handsome widower whose sudden proposal of marriage takes her by surprise. She accepts, but whisked from glamorous Monte Carlo to the ominous and brooding Manderley,", "Working as a lady's companion, the heroine of ", " learns her place. Her future looks bleak until, on a trip to the South of France, she meets Max de Winter, a handsome widower whose sudden proposal of marriage takes her by surprise. She accepts, but whisked from glamorous Monte Carlo to the ominous and brooding Manderley, the new Mrs de Winter finds Max a changed man. And the memory of his dead wife Rebecca is forever kept alive by the forbidding housekeeper, Mrs Danvers...", "Not since Jane Eyre has a heroine faced such difficulty with the Other Woman. An international bestseller that has never gone out of print, ", " is the haunting story of a young girl consumed by love and the struggle to find her identity."], "author": "Daphne du Maurier", "num_pages": "441", "awards": ["National Book Award for Fiction (1938)", "Anthony Award for Best Novel of the Century"], "places": ["Cornwall", "Monte Carlo"], "character_names": ["Maxim de Winter", "Mrs. Danvers", "the second Mrs. de Winter", "Rebecca de Winter", "Frank Crowley", "Jack Favell", "Beatrice Lacy", "Giles Lacy"], "language": "English", "publish_date": "2007-12-01 00:00:00", "ISBN": "1844080382"},
{"url": "https://www.goodreads.com/book/show/18131.A_Wrinkle_in_Time", "num_ratings": "788,452", "num_reviews": "29,185", "avg_ratings": 4.02, "genres": ["Fantasy", "Young Adult", "Fiction", "Classics", "Science Fiction", "Childrens"], "title": "A Wrinkle in Time", "description": ["It was a dark and stormy night; Meg Murry, her small brother Charles Wallace, and her mother had come down to the kitchen for a midnight snack when they were upset by the arrival of a most disturbing stranger. ", "It was a dark and stormy night; Meg Murry, her small brother Charles Wallace, and her mother had come down to the kitchen for a midnight snack when they were upset by the arrival of a most disturbing stranger. ", "Meg's father had been experimenting with this fifth dimension of time travel when he mysteriously disappeared. Now the time has come for Meg, her friend Calvin, and Charles Wallace to rescue him. But can they outwit the forces of evil they will encounter on their heart-stopping journey through space?"], "author": "Madeleine L'Engle", "num_pages": "211", "awards": ["Newbery Medal (1963)", "Dorothy Canfield Fisher Children's Book Award Nominee (1964)", "Oklahoma Sequoyah Award (1965)"], "places": [], "character_names": ["Meg Murry", "Charles Wallace Murry", "Calvin O'Keefe", "Dr. Kate Murry", "Mrs. Whatsit", "Mrs. Who", "Mrs. Which"], "language": "English", "publish_date": "1973-03-15 00:00:00", "ISBN": "0440498058"},
{"url": "https://www.goodreads.com/book/show/18660669-vampire-academy", "num_ratings": "486,835", "num_reviews": "20,654", "avg_ratings": 4.13, "genres": ["Young Adult", "Paranormal", "Vampires", "Fantasy", "Fantasy", "Paranormal", "Romance"], "title": "Vampire Academy", "description": ["Lissa Dragomir is a Moroi princess: a mortal vampire with a rare gift for harnessing the earth's magic. She must be protected at all times from Strigoi; the fiercest vampires - the ones who never die. The powerful blend of human and vampire blood that flows through Rose Hathaway, Lissa's best friend,", "Lissa Dragomir is a Moroi princess: a mortal vampire with a rare gift for harnessing the earth's magic. She must be protected at all times from Strigoi; the fiercest vampires - the ones who never die. The powerful blend of human and vampire blood that flows through Rose Hathaway, Lissa's best friend, makes her a dhampir. Rose is dedicated to a dangerous life of protecting Lissa from the Strigoi, who are hell-bent on making Lissa one of them.", "After two years of freedom, Rose and Lissa are caught and dragged back to St. Vladimir's Academy, a school for vampire royalty and their guardians-to-be, hidden in the deep forests of Montana. But inside the iron gates, life is even more fraught with danger . . . and the Strigoi are always close by.", "Rose and Lissa must navigate their dangerous world, confront the temptations of forbidden love, and never once let their guard down, lest the evil undead make Lissa one of them forever . . ."], "author": "Richelle Mead", "num_pages": "332", "awards": [], "places": ["Montana"], "character_names": ["Vasilisa \"Lissa\" Dragomir", "Dimitri Belikov", "Christian Ozera", "Mason Ashford", "Victor Dashkov", "Mia Rinaldi", "Janine Hathaway", "Natalie Dashkov", "Edison \"Eddie\" Castile", "Ellen Kirova", "Rosemarie \"Rose\" Hathaway", "Camille Conta", "Stan Alto", "Jesse Zeklos", "Tatiana Ivashkov"], "language": "English", "publish_date": "2013-11-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/402045.The_Mists_of_Avalon", "num_ratings": "171,806", "num_reviews": "5,993", "avg_ratings": 4.12, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Mythology", "Arthurian", "Science Fiction Fantasy"], "title": "The Mists of Avalon", "description": ["Here is the magical legend of King Arthur, vividly retold through the eyes and lives of the women who wielded power from behind the throne. A spellbinding novel, an extraordinary literary achievement, THE MISTS OF AVALON will stay with you for a long time to come...."], "author": "Marion Zimmer Bradley", "num_pages": "884", "awards": ["Locus Award for Best Fantasy Novel (1984)"], "places": ["Camelot", "Avalon"], "character_names": ["Morgause", "Igraine", "Viviane", "Uther", "Gorlois", "Morgaine", "Gwenhwyfar", "Merlin", "Kevin, the Bard", "Lancelet", "Uriens", "Accolon", "King Arthur"], "language": "English", "publish_date": "1984-04-12 00:00:00", "ISBN": "0345350499"},
{"url": "https://www.goodreads.com/book/show/11486.The_Color_Purple", "num_ratings": "435,722", "num_reviews": "11,087", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "295", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "0671727796"},
{"url": "https://www.goodreads.com/book/show/13335037-divergent", "num_ratings": "2,459,125", "num_reviews": "103,920", "avg_ratings": 4.22, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Fiction", "Fantasy"], "title": "Divergent", "description": ["In Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the", "In Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is—she can't have both. So she makes a choice that surprises everyone, including herself.", "During the highly competitive initiation that follows, Beatrice renames herself Tris and struggles alongside her fellow initiates to live out the choice they have made. Together they must undergo extreme physical tests of endurance and intense psychological simulations, some with devastating consequences. As initiation transforms them all, Tris must determine who her friends really are—and where, exactly, a romance with a sometimes fascinating, sometimes exasperating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers unrest and growing conflict that threaten to unravel her seemingly perfect society, she also learns that her secret might help her save those she loves . . . or it might destroy her."], "author": "Veronica Roth", "num_pages": "487", "awards": ["Georgia Peach Book Award (2012)", "Evergreen Teen Book Award (2014)", "Soaring Eagle Book Award (2012)", "Milwaukee County Teen Book Award Nominee (2012)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2012)", "Sakura Medal", "New Mexico Land of Enchantment Award for Young Adult (2014)", "California Young Readers Medal for Young Adult (2014)", "Lincoln Award Nominee (2014)", "DABWAHA Romance Tournament for Best Young Adult Romance (2012)", "Goodreads Choice Award for Favorite Book and Best Young Adult Fantasy & Science Fiction (2011)", "Green Mountain Book Award (2013)", "The Magnolia Award for 6-8 (2014)", "Louisiana Teen Readers' Choice (2014)", "Missouri Gateway Readers Award (2014)", "Oklahoma Sequoyah Award for High Schol (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2011)"], "places": ["Chicago, Illinois"], "character_names": ["Albert", "Drew Leighton (Divergent)", "Eric (Divergent)", "Beatrice Prior", "Peter", "Caleb Prior", "Natalie Prior", "Molly Atwood", "Christina", "Jeanine Matthews", "Marcus Eaton", "翠丝", "老四", "Tobias Eaton"], "language": "English", "publish_date": "2012-02-28 00:00:00", "ISBN": "0062024035"},
{"url": "https://www.goodreads.com/book/show/7260188-mockingjay", "num_ratings": "1,992,478", "num_reviews": "98,271", "avg_ratings": 4.03, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Fiction", "Fantasy", "Science Fiction"], "title": "Mockingjay", "description": ["Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.", "It is by design that Katniss was rescued fr", "Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.", "It is by design that Katniss was rescued from the arena in the cruel and haunting Quarter Quell, and it is by design that she has long been part of the revolution without knowing it. District 13 has come out of the shadows and is plotting to overthrow the Capitol. Everyone, it seems, has had a hand in the carefully laid plans--except Katniss.", "The success of the rebellion hinges on Katniss's willingness to be a pawn, to accept responsibility for countless lives, and to change the course of the future of Panem. To do this, she must put aside her feelings of anger and distrust. She must become the rebels' Mockingjay--no matter what the personal cost."], "author": "Suzanne Collins", "num_pages": "392", "awards": ["Locus Award Nominee for Best Young Adult Book (2011)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2011)", "Publishers Weekly's Best Children's Books of the Year for Fiction (2010)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2010)", "DABWAHA Romance Tournament for Best Young Adult Romance (2011)", "Goodreads Choice Award for Favorite Book, Young Adult Fantasy, Favorite Heroine, and Favorite Hero (2010)"], "places": ["District 13, Panem", "District 12, Panem", "Capitol, Panem", "Panem"], "character_names": ["Katniss Everdeen", "Peeta Mellark", "Primrose Everdeen", "Gale Hawthorne", "Haymitch Abernathy", "Finnick Odair", "Johanna Mason", "President Coriolanus Snow", "President Coin"], "language": "English", "publish_date": "2010-08-24 00:00:00", "ISBN": "0439023513"},
{"url": "https://www.goodreads.com/book/show/4667024-the-help", "num_ratings": "1,769,459", "num_reviews": "80,387", "avg_ratings": 4.46, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Adult"], "title": "The Help", "description": ["Be prepared to meet three unforgettable women:", "Twenty-two-year-old Skeeter has just returned home after graduating from Ole Miss. She may have a degree, but it is 1962, Mississippi, and her mother will not be happy till Skeeter has a ring on her finger. Skeeter would normally find solace with her beloved maid Constantine, the woman who raised her, but Constantine has disapp", "Be prepared to meet three unforgettable women:", "Twenty-two-year-old Skeeter has just returned home after graduating from Ole Miss. She may have a degree, but it is 1962, Mississippi, and her mother will not be happy till Skeeter has a ring on her finger. Skeeter would normally find solace with her beloved maid Constantine, the woman who raised her, but Constantine has disappeared and no one will tell Skeeter where she has gone.", "Aibileen is a black maid, a wise, regal woman raising her seventeenth white child. Something has shifted inside her after the loss of her own son, who died while his bosses looked the other way. She is devoted to the little girl she looks after, though she knows both their hearts may be broken.", "Minny, Aibileen’s best friend, is short, fat, and perhaps the sassiest woman in Mississippi. She can cook like nobody’s business, but she can’t mind her tongue, so she’s lost yet another job. Minny finally finds a position working for someone too new to town to know her reputation. But her new boss has secrets of her own.", "Seemingly as different from one another as can be, these women will nonetheless come together for a clandestine project that will put them all at risk. And why? Because they are suffocating within the lines that define their town and their times. And sometimes lines are made to be crossed.", "In pitch-perfect voices, Kathryn Stockett creates three extraordinary women whose determination to start a movement of their own forever changes a town, and the way women — mothers, daughters, caregivers, friends — view one another. A deeply moving novel filled with poignancy, humor, and hope, The Help is a timeless and universal story about the lines we abide by, and the ones we don't."], "author": "Kathryn Stockett", "num_pages": "465", "awards": ["Orange Prize Nominee for Fiction Longlist (2010)", "Audie Award for Fiction (2010)", "Exclusive Books Boeke Prize (2009)", "SIBA Book Award for Fiction (2010)", "Indies Choice Book Award for Adult Debut (2010)", "Puddly Award for Fiction (2011)", "Lincoln Award Nominee (2013)", "Grand Prix des lectrices de Elle for roman (2011)", "Goodreads Choice Award for Fiction (2009)", "Townsend Prize for Fiction (2010)"], "places": ["Jackson, Mississippi"], "character_names": ["Constantine Bates", "Eugenia “Skeeter” Phelan", "Aibileen Clark", "Minny Jackson", "Hilly Holbrook", "Elizabeth Leefolt", "Celia Foote", "Stuart Whitworth", "Mae Mobley Leefolt", "Leroy Jackson", "Elaine Stein", "Yule May Crookle", "Johnny Foote", "William Holbrook", "Senator “Stoolie” Whitworth", "Pascagoula", "Treelore Clark"], "language": "English", "publish_date": "2009-02-10 00:00:00", "ISBN": "0399155341"},
{"url": "https://www.goodreads.com/book/show/3236307-graceling", "num_ratings": "327,985", "num_reviews": "20,232", "avg_ratings": 4.09, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction"], "title": "Graceling", "description": ["Katsa has been able to kill a man with her bare hands since she was eight—she’s a Graceling, one of the rare people in her land born with an extreme skill. As niece of the king, she should be able to live a life of privilege, but Graced as she is with killing, she is forced to work as the king’s thug. ", "She never expects to fall in love with beautiful Prince Po. ", "She never ex", "Katsa has been able to kill a man with her bare hands since she was eight—she’s a Graceling, one of the rare people in her land born with an extreme skill. As niece of the king, she should be able to live a life of privilege, but Graced as she is with killing, she is forced to work as the king’s thug. ", "She never expects to fall in love with beautiful Prince Po. ", "She never expects to learn the truth behind her Grace—or the terrible secret that lies hidden far away . . . a secret that could destroy all seven kingdoms with words alone. ", "With elegant, evocative prose and a cast of unforgettable characters, debut author Kristin Cashore creates a mesmerizing world, a death-defying adventure, and a heart-racing romance that will consume you, hold you captive, and leave you wanting more."], "author": "Kristin Cashore", "num_pages": "471", "awards": ["Mythopoeic Fantasy Award for Children's Literature (2009)", "William C. Morris YA Debut Award Nominee (2009)", "Rhode Island Teen Book Award Nominee (2011)", "Milwaukee County Teen Book Award Nominee (2010)", "Sakura Medal Nominee for High School Book (2010)", "Florida Teens Read Nominee (2010)", "Amelia Elizabeth Walden Award Nominee (2009)", "Iowa High School Book Award Nominee (2011)", "California Young Readers Medal for Young Adult (2012)", "Lincoln Award Nominee (2011)", "Andre Norton Award Nominee (2008)", "Cybils Award Nominee for Young Adult Fantasy & Science Fiction (2008)", "Green Mountain Book Award (2011)", "Missouri Gateway Readers Award Nominee (2011)"], "places": [], "character_names": ["Katsa (Graceling Realm)", "Bitterblue", "Leck (Graceling Realm)", "Randa (Graceling Realm)", "Grandfather Tealiff", "Po (Graceling Realm)"], "language": "English", "publish_date": "2008-10-01 00:00:00", "ISBN": "015206396X"},
{"url": "https://www.goodreads.com/book/show/8127.Anne_of_Green_Gables", "num_ratings": "591,699", "num_reviews": "16,410", "avg_ratings": 4.24, "genres": ["Classics", "Fiction", "Young Adult", "Childrens", "Historical", "Historical Fiction", "Historical", "Cultural", "Canada", "Childrens", "Middle Grade", "Audiobook", "Young Adult", "Coming Of Age"], "title": "Anne of Green Gables", "description": ["As soon as Anne Shirley arrives at the snug white farmhouse called Green Gables, she is sure she wants to stay forever . . . but will the Cuthberts send her back to to the orphanage? Anne knows she's not what they expected—a skinny girl with fiery red hair and a temper to match. If only she can convince them to let her stay, she'll try very hard not to keep rushing headlon", "As soon as Anne Shirley arrives at the snug white farmhouse called Green Gables, she is sure she wants to stay forever . . . but will the Cuthberts send her back to to the orphanage? Anne knows she's not what they expected—a skinny girl with fiery red hair and a temper to match. If only she can convince them to let her stay, she'll try very hard not to keep rushing headlong into scrapes and blurting out the first thing that comes to her mind. Anne is not like anyone else, the Cuthberts agree; she is special—a girl with an enormous imagination. This orphan girl dreams of the day when she can call herself Anne of Green Gables."], "author": "L.M. Montgomery", "num_pages": "320", "awards": [], "places": ["Avonlea, Prince Edward Island", "Prince Edward Island"], "character_names": ["Marilla Cuthbert", "Matthew Cuthbert", "Diana Barry", "Gilbert Blythe", "Rachel Lynde", "Anne Blythe", "Anne Shirley"], "language": "English", "publish_date": "2003-05-06 00:00:00", "ISBN": "0451528824"},
{"url": "https://www.goodreads.com/book/show/2156.Persuasion", "num_ratings": "445,075", "num_reviews": "14,551", "avg_ratings": 4.13, "genres": ["Classics", "Fiction", "Romance"], "title": "Persuasion", "description": ["Twenty-seven-year old Anne Elliot is Austen's most adult heroine. Eight years before the story proper begins, she is happily betrothed to a naval officer, Frederick Wentworth, but she precipitously breaks off the engagement when persuaded by her friend Lady Russell that such a match is unworthy. The breakup produces in Anne a deep and long-lasting regret. When later Wentwo", "Twenty-seven-year old Anne Elliot is Austen's most adult heroine. Eight years before the story proper begins, she is happily betrothed to a naval officer, Frederick Wentworth, but she precipitously breaks off the engagement when persuaded by her friend Lady Russell that such a match is unworthy. The breakup produces in Anne a deep and long-lasting regret. When later Wentworth returns from sea a rich and successful captain, he finds Anne's family on the brink of financial ruin and his own sister a tenant in Kellynch Hall, the Elliot estate. All the tension of the novel revolves around one question: Will Anne and Wentworth be reunited in their love?", "Jane Austen once compared her writing to painting on a little bit of ivory, 2 inches square. Readers of ", " will discover that neither her skill for delicate, ironic observations on social custom, love, and marriage nor her ability to apply a sharp focus lens to English manners and morals has deserted her in her final finished work."], "author": "Jane Austen", "num_pages": "249", "awards": [], "places": ["Somersetshire, England", "Lyme Regis, England", "Bath, Somerset, England"], "character_names": ["Lady Russell", "Charles Musgrove", "Admiral Croft", "Elizabeth Elliot", "Frederick Wentworth", "Lady Russell", "Mary Musgrove", "Sophia Croft", "Sir Walter Elliot", "Louisa Musgrove", "Captain James Benwick", "William Elliot", "Mrs. Smith", "Anne Elliot", "Henrietta Musgrave", "Captain Harville"], "language": "English", "publish_date": "2004-03-18 00:00:00", "ISBN": "0192802631"},
{"url": "https://www.goodreads.com/book/show/6185.Wuthering_Heights", "num_ratings": "1,106,470", "num_reviews": "28,954", "avg_ratings": 3.83, "genres": ["Classics", "Fiction", "Romance", "Literature"], "title": "Wuthering Heights", "description": ["Wuthering Heights is a wild, passionate story of the intense and almost demonic love between Catherine Earnshaw and Heathcliff, a foundling adopted by Catherine's father. After Mr Earnshaw's death, Heathcliff is bullied and humiliated by Catherine's brother Hindley and wrongly believing that his love for Catherine is n", "Wuthering Heights is a wild, passionate story of the intense and almost demonic love between Catherine Earnshaw and Heathcliff, a foundling adopted by Catherine's father. After Mr Earnshaw's death, Heathcliff is bullied and humiliated by Catherine's brother Hindley and wrongly believing that his love for Catherine is not reciprocated, leaves Wuthering Heights, only to return years later as a wealthy and polished man. He proceeds to exact a terrible revenge for his former miseries. The action of the story is chaotic and unremittingly violent, but the accomplished handling of a complex structure, the evocative descriptions of the lonely moorland setting and the poetic grandeur of vision combine to make this unique novel a masterpiece of English literature."], "author": "Emily Brontë", "num_pages": "464", "awards": [], "places": ["Yorkshire Dales, England"], "character_names": ["Heathcliff", "Catherine Earnshaw", "Edgar Linton", "Isabella Linton", "Hindley Earnshaw", "Ellen (Nelly) Dean", "Mr. Lockwood", "Hareton Earnshaw", "Catherine Linton", "Linton Heathcliff"], "language": "English", "publish_date": "2002-08-16 00:00:00", "ISBN": "0393978893"},
{"url": "https://www.goodreads.com/book/show/38447.The_Handmaid_s_Tale", "num_ratings": "912,590", "num_reviews": "49,580", "avg_ratings": 4.08, "genres": ["Fiction", "Classics", "Science Fiction", "Dystopia", "Science Fiction", "Feminism"], "title": "The Handmaid's Tale", "description": ["Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Ha", "Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the years before, when she lived and made love with her husband, Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now..."], "author": "Margaret Atwood", "num_pages": "311", "awards": ["Man Booker Prize Nominee (1986)", "Nebula Award Nominee for Best Novel (1986)", "Arthur C. Clarke Award for Best Novel (1987)", "Audie Award for Fiction (2013)", "Los Angeles Times Book Prize for Fiction (1986)", "Prometheus Award Nominee for Best Novel (1987)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (1985)", "Commonwealth Writers' Prize Nominee for Best Book in Caribbean and Canada (1987)", "CBC Canada Reads Nominee (2002)"], "places": ["Cambridge, Massachusetts", "Republic of Gilead"], "character_names": ["The Commander", "Offred", "Serena Joy", "Ofglen", "Nick", "Moira", "Luke Castellan"], "language": "English", "publish_date": "1998-03-16 00:00:00", "ISBN": "038549081X"},
{"url": "https://www.goodreads.com/book/show/6148028-catching-fire", "num_ratings": "2,108,645", "num_reviews": "90,663", "avg_ratings": 4.29, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Fiction", "Fantasy", "Science Fiction"], "title": "Catching Fire", "description": ["Against all odds, Katniss has won the Hunger Games. She and fellow District 12 tribute Peeta Mellark are miraculously still alive. Katniss should be relieved, happy even. After all, she has returned to her family and her longtime friend, Gale. Yet nothing is the way Katniss wishes it to be. Gale holds h", "Against all odds, Katniss has won the Hunger Games. She and fellow District 12 tribute Peeta Mellark are miraculously still alive. Katniss should be relieved, happy even. After all, she has returned to her family and her longtime friend, Gale. Yet nothing is the way Katniss wishes it to be. Gale holds her at an icy distance. Peeta has turned his back on her completely. And there are whispers of a rebellion against the Capitol - a rebellion that Katniss and Peeta may have helped create.", "Much to her shock, Katniss has fueled an unrest she's afraid she cannot stop. And what scares her even more is that she's not entirely convinced she should try. As time draws near for Katniss and Peeta to visit the districts on the Capitol's cruel Victory Tour, the stakes are higher than ever. If they can't prove, without a shadow of a doubt, that they are lost in their love for each other, the consequences will be horrifying.", "In ", ", the second novel in the Hunger Games trilogy, Suzanne Collins continues the story of Katniss Everdeen, testing her more than ever before...and surprising readers at every turn."], "author": "Suzanne Collins", "num_pages": "391", "awards": ["Golden Duck Award for Hal Clement Award for Young Adult (2010)", "Soaring Eagle Book Award (2011)", "Children's Choice Book Award for Teen Choice Book of the Year (2010)", "Indies Choice Book Award for Young Adult (2010)", "Teen Read Award Nominee for Best Read (2010)", "DABWAHA Romance Tournament for Best Young Adult (2010)", "Goodreads Choice Award for Favorite Book and Young Adult Series (2009)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2010)"], "places": ["District 12, Panem", "Capitol, Panem", "Panem"], "character_names": ["Katniss Everdeen", "Peeta Mellark", "Primrose Everdeen", "Gale Hawthorne", "Effie Trinket", "Haymitch Abernathy", "Cinna", "Finnick Odair", "Johanna Mason", "President Coriolanus Snow", "Madge Undersee", "Caesar Flickerman", "Twill", "Cashmere", "Gloss", "Enobaria", "Beetee", "Wiress", "Mags", "Blight", "Woof", "Cecilia", "Chaff", "Seeder", "Plutarch Heavensbee", "Octavia (Hunger Games)", "Portia (hunger Games)"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0439023491"},
{"url": "https://www.goodreads.com/book/show/6969.Emma", "num_ratings": "538,754", "num_reviews": "12,927", "avg_ratings": 3.99, "genres": ["Classics", "Fiction", "Romance"], "title": "Emma", "description": ["Clever, rich - and single - Emma Woodhouse is perfectly content with her life and sees no need for either love or marriage. Nothing, however, delights her more than interfering in the romantic lives of others. But when she ignores the warnings of her good friend Mr. Knightley and attempts to arrange a suitable match for her protegee Harriet Smith, her carefully laid plans", "Clever, rich - and single - Emma Woodhouse is perfectly content with her life and sees no need for either love or marriage. Nothing, however, delights her more than interfering in the romantic lives of others. But when she ignores the warnings of her good friend Mr. Knightley and attempts to arrange a suitable match for her protegee Harriet Smith, her carefully laid plans soon unravel and have consequences that she never expected. With its imperfect but charming heroine and its witty and subtle exploration of relationships, Emma is often seen as Jane Austen's most flawless work."], "author": "Jane Austen", "num_pages": "474", "awards": [], "places": ["Surrey, England"], "character_names": ["Emma Woodhouse", "George Knightley", "Harriet Smith", "Jane Fairfax", "Frank Churchill", "Henry Woodhouse", "Mr. Woodhouse", "Mrs. Weston", "Philip Elton", "Augusta Elton", "Mr Weston", "Mrs Anne Weston", "Miss Bates", "Isabella Woodhouse", "John Knightley", "Mr. Elton", "Mrs. Elton"], "language": "English", "publish_date": "2003-05-06 00:00:00", "ISBN": "0141439580"},
{"url": "https://www.goodreads.com/book/show/862041.Harry_Potter_Series_Box_Set", "num_ratings": "219,860", "num_reviews": "6,797", "avg_ratings": 4.74, "genres": ["Fantasy", "Young Adult", "Fiction"], "title": "Harry Potter Series Box Set", "description": ["Over 4000 pages of Harry Potter and his world, including all 7 books.", "Siedmiopak zawierajacy wszystkie tomy w nowych, czarnych - \"doroslych\" okladkach w oprawie broszurowej.", "Harry Potter i kamien filozoficzny", "Harry Potter i komnata tajemnic", "Harry Potter i wiezien Azkabanu", "Harry Potter i czara ognia", "Harry Potter i zakon Feniksa", "Harry Potter i ksiaze pólkrwi", "Harry Potter i insygnia", "Over 4000 pages of Harry Potter and his world, including all 7 books.", "Siedmiopak zawierajacy wszystkie tomy w nowych, czarnych - \"doroslych\" okladkach w oprawie broszurowej.", "Harry Potter i kamien filozoficzny", "Harry Potter i komnata tajemnic", "Harry Potter i wiezien Azkabanu", "Harry Potter i czara ognia", "Harry Potter i zakon Feniksa", "Harry Potter i ksiaze pólkrwi", "Harry Potter i insygnia smierci"], "author": "J.K. Rowling", "num_pages": "4100", "awards": ["Mythopoeic Fantasy Award for Children's Literature (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-01 00:00:00", "ISBN": "0545044251"},
{"url": "https://www.goodreads.com/book/show/48855.The_Diary_of_a_Young_Girl", "num_ratings": "2,254,414", "num_reviews": "23,243", "avg_ratings": 4.12, "genres": ["Nonfiction", "Classics", "History", "Biography", "Autobiography", "Memoir"], "title": "The Diary of a Young Girl", "description": ["Anne Frank's extraordinary diary, written in the Amsterdam attic where she and her family hid from the Nazis for two years, has become a world classic and a timeless testament to the human spirit. Now, in a new edition enriched by many passages originally withheld by her father, we meet an Anne more real, more human, and more vital than ever. Here she is first and foremost", "Anne Frank's extraordinary diary, written in the Amsterdam attic where she and her family hid from the Nazis for two years, has become a world classic and a timeless testament to the human spirit. Now, in a new edition enriched by many passages originally withheld by her father, we meet an Anne more real, more human, and more vital than ever. Here she is first and foremost a teenage girl—stubbornly honest, touchingly vulnerable, in love with life. She imparts her deeply secret world of soul-searching and hungering for affection, rebellious clashes with her mother, romance and newly discovered sexuality, and wry, candid observations of her companions. Facing hunger, fear of discovery and death, and the petty frustrations of such confined quarters, Anne writes with adult wisdom and views beyond her years. Her story is that of every teenager, lived out in conditions few teenagers have ever known."], "author": "Anne Frank", "num_pages": "283", "awards": ["Luisterboek Award (2008)"], "places": ["Amsterdam"], "character_names": ["Anne Frank", "Otto Frank", "Petronella Van Daan", "Hermann Van Daan", "Margot Frank", "Peter Van Daan", "Edith Frank", "Miep Gies", "Albert Dussel"], "language": "English", "publish_date": "1993-07-16 00:00:00", "ISBN": "0553296981"},
{"url": "https://www.goodreads.com/book/show/14935.Sense_and_Sensibility", "num_ratings": "831,098", "num_reviews": "12,804", "avg_ratings": 4.06, "genres": ["Classics", "Fiction", "Romance"], "title": "Sense and Sensibility", "description": ["Marianne Dashwood wears her heart on her sleeve, and when she falls in love with the dashing but unsuitable John Willoughby she ignores her sister Elinor's warning that her impulsive behaviour leaves her open to gossip and innuendo. Meanwhile Elino", "Marianne Dashwood wears her heart on her sleeve, and when she falls in love with the dashing but unsuitable John Willoughby she ignores her sister Elinor's warning that her impulsive behaviour leaves her open to gossip and innuendo. Meanwhile Elinor, always sensitive to social convention, is struggling to conceal her own romantic disappointment, even from those closest to her. Through their parallel experience of love—and its threatened loss—the sisters learn that sense must mix with sensibility if they are to find personal happiness in a society where status and money govern the rules of love.", "This edition includes explanatory notes, textual variants between the first and second editions, and Tony Tanner's introduction to the original Penguin Classic edition."], "author": "Jane Austen", "num_pages": "409", "awards": [], "places": ["Devonshire, England", "Sussex, England"], "character_names": ["Elinor Dashwood", "Marianne Dashwood", "Edward Ferrars", "Colonel Brandon", "Lady Middleton", "John Middleton", "Mr. Dashwood", "Mrs. John Dashwood", "Mrs. Dashwood", "John Willoughby"], "language": "English", "publish_date": "2003-04-29 00:00:00", "ISBN": "0141439661"},
{"url": "https://www.goodreads.com/book/show/1934.Little_Women", "num_ratings": "1,414,516", "num_reviews": "18,783", "avg_ratings": 4.05, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Young Adult", "Romance", "Historical", "Literature", "Childrens", "Classics", "Classic Literature", "Literature", "19th Century"], "title": "Little Women", "description": ["Generations of readers young and old, male and female, have fallen in love with the March sisters of Louisa May Alcott’s most popular and enduring novel, ", ". Here are talented tomboy and author-to-be Jo, tragically frail Beth, beautiful Meg, and romantic, spoiled Amy, united in their devotion to each other and their struggles to survive in New England during the", "Generations of readers young and old, male and female, have fallen in love with the March sisters of Louisa May Alcott’s most popular and enduring novel, ", ". Here are talented tomboy and author-to-be Jo, tragically frail Beth, beautiful Meg, and romantic, spoiled Amy, united in their devotion to each other and their struggles to survive in New England during the Civil War."], "author": "Louisa May Alcott", "num_pages": "449", "awards": [], "places": ["Concord, Massachusetts", "Massachusetts", "London, England", "New England"], "character_names": ["Marmee", "Jo March", "Meg March", "Beth March", "Amy March", "Laurie Laurence", "Mr. Laurence", "Aunt March", "John Brooke", "Professor Bhaer", "Mr. March", "Hannah Brown"], "language": "English", "publish_date": "2004-04-06 00:00:00", "ISBN": "0451529308"},
{"url": "https://www.goodreads.com/book/show/514811.The_Secret_Magdalene", "num_ratings": "3,341", "num_reviews": "410", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Religion", "Historical"], "title": "The Secret Magdalene", "description": ["Raised like sisters, Mariamne and Salome are indulged with riches, position, and learning-a rare thing for females in Jerusalem. But Mariamne has a further gift: an illness has left her with visions; she has the power of prophecy. It is her prophesying that drives the two girls to flee to Egypt, where they study philosophy, mathematics, and astronomy in the Great Library o", "Raised like sisters, Mariamne and Salome are indulged with riches, position, and learning-a rare thing for females in Jerusalem. But Mariamne has a further gift: an illness has left her with visions; she has the power of prophecy. It is her prophesying that drives the two girls to flee to Egypt, where they study philosophy, mathematics, and astronomy in the Great Library of Alexandria.", "After seven years they return to a Judaea where many now believe John the Baptizer is the messiah. Salome too begins to believe, but Mariamne, now called Magdalene, is drawn to his cousin, Yeshu’a, a man touched by the divine in the same way she was during her days of illness. Together they speak of sharing their direct experience of God; but Yeshu’a unexpectedly gains a reputation as a healer, and as the ill and the troubled flock to him, he and Magdalene are forced to make a terrible decision.", "This radical retelling of the greatest story ever told brings Mary Magdalene to life-not as a prostitute or demon-possessed-but as an educated woman who was truly the “apostle to the apostles.”"], "author": "Ki Longfellow", "num_pages": "448", "awards": [], "places": [], "character_names": ["Salome", "John the Baptizer", "Yeshu’a", "Mary Magdalene"], "language": "English", "publish_date": "2007-03-27 00:00:00", "ISBN": "0307346668"},
{"url": "https://www.goodreads.com/book/show/18405.Gone_with_the_Wind", "num_ratings": "961,156", "num_reviews": "17,257", "avg_ratings": 4.29, "genres": ["Classics", "Historical", "Historical Fiction", "Fiction", "Romance", "Historical"], "title": "Gone with the Wind", "description": [" is a novel written by Margaret Mitchell, first published in 1936. The story is set in Clayton County, Georgia, and Atlanta during the American Civil War and Reconstruction era. It depicts the struggles of young Scarlett O'Hara, the daughter of a well-to-do plantation owner, who must use every means at her disposal to claw her way out of the poverty she f", " is a novel written by Margaret Mitchell, first published in 1936. The story is set in Clayton County, Georgia, and Atlanta during the American Civil War and Reconstruction era. It depicts the struggles of young Scarlett O'Hara, the daughter of a well-to-do plantation owner, who must use every means at her disposal to claw her way out of the poverty she finds herself in after Sherman's March to the Sea. A historical novel, the story is a Bildungsroman or coming-of-age story, with the title taken from a poem written by Ernest Dowson."], "author": "Margaret Mitchell", "num_pages": "1037", "awards": ["Pulitzer Prize for Novel (1937)", "National Book Award for Novel (1936)"], "places": ["Atlanta, Georgia"], "character_names": ["Scarlett O'Hara", "Rhett Butler", "Ashley Wilkes", "Melanie Hamilton Wilkes", "Wade Hampton Hamilton", "Ella Lorena Kennedy", "Eugenie Victoria \"Bonnie Blue\" Butler", "Beau Wilkes", "India Wilkes", "Honey Wilkes", "John  Wilkes", "Gerald O'Hara", "Ellen O'Hara", "Suellen O'Hara", "Carreen O'Hara", "Eulalie", "Pauline", "Mammy Abigail", "Prissy", "Pork", "Dilcey", "Charles Hamilton", "Frank Kennedy", "Belle Watling", "Jonas Wilkerson", "Emmie Slattery", "Will Benteen", "Aunt Pittypat Hamilton", "Uncle Peter", "Rhett Butler", "Ashley Wilkes"], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "0446675539"},
{"url": "https://www.goodreads.com/book/show/2657.To_Kill_a_Mockingbird", "num_ratings": "3,688,978", "num_reviews": "78,532", "avg_ratings": 4.26, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Academic", "School", "Literature", "Young Adult", "Academic", "Read For School", "Historical", "Novels", "Young Adult", "High School"], "title": "To Kill a Mockingbird", "description": ["The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.", "Compassionate, dramatic, and deepl", "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it, To Kill A Mockingbird became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.", "Compassionate, dramatic, and deeply moving, To Kill A Mockingbird takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature."], "author": "Harper Lee", "num_pages": "324", "awards": ["Pulitzer Prize for Fiction (1961)", "Audie Award for Classic (2007)", "National Book Award Finalist for Fiction (1961)", "Alabama Author Award for Fiction (1961)"], "places": ["Maycomb, Alabama"], "character_names": ["Scout Finch", "Atticus Finch", "Jem Finch", "Arthur Radley", "Mayella Ewell", "Aunt Alexandra", "Bob Ewell", "Calpurnia (housekeeper)", "Tom Robinson", "Miss Maudie Atkinson", "Judge John Taylor"], "language": "English", "publish_date": "2006-05-23 00:00:00", "ISBN": "0061120081"},
{"url": "https://www.goodreads.com/book/show/10210.Jane_Eyre", "num_ratings": "1,364,400", "num_reviews": "34,237", "avg_ratings": 4.11, "genres": ["Classics", "Fiction", "Romance"], "title": "Jane Eyre", "description": [" ", " "], "author": "Charlotte Brontë", "num_pages": "507", "awards": [], "places": ["Thornfield", "England"], "character_names": ["Jane Eyre", "Bertha Mason", "Grace Poole", "Blanche Ingram", "Adele Varens", "St. John Rivers", "Helen Burns", "Richard Mason", "Diana Rivers", "Mary Rivers", "Maria Temple", "Robert Brocklehurst", "Sarah Reed", "Georgiana Reed", "Eliza Reed", "Bessie Lee", "Alice Fairfax", "Rosamond Oliver", "Edward Rochester", "John Eyre", "Celine Varens"], "language": "English", "publish_date": "2003-02-04 00:00:00", "ISBN": "0142437204"},
{"url": "https://www.goodreads.com/book/show/2767052-the-hunger-games", "num_ratings": "5,448,058", "num_reviews": "159,973", "avg_ratings": 4.33, "genres": ["Young Adult", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Science Fiction", "Romance", "Adventure", "Young Adult", "Teen", "Apocalyptic", "Post Apocalyptic", "Action"], "title": "The Hunger Games", "description": ["The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as t", "The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory.", "When 16-year-old Katniss's young sister, Prim, is selected as District 12's female representative, Katniss volunteers to take her place. She and her male counterpart Peeta, are pitted against bigger, stronger representatives, some of whom have trained for this their whole lives. , she sees it as a death sentence. But Katniss has been close to death before. For her, survival is second nature."], "author": "Suzanne Collins", "num_pages": "374", "awards": ["Georgia Peach Book Award (2009)", "Buxtehuder Bulle (2009)", "Golden Duck Award for Hal Clement Award for Young Adult (2009)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2012)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2010)", "Red House Children's Book Award for Older Readers & Overall (2010)", "South Carolina Book Award for Junior and Young Adult Book (2011)", "Charlotte Award (2010)", "Colorado Blue Spruce Young Adult Book Award (2010)", "Teen Buckeye Book Award (2009)", "Pennsylvania Young Readers' Choice Award for Young Adults (2010)", "Rhode Island Teen Book Award (2010)", "Dorothy Canfield Fisher Children's Book Award (2010)", "Evergreen Teen Book Award (2011)", "Soaring Eagle Book Award (2009)", "Milwaukee County Teen Book Award Nominee (2010)", "Sakura Medal for Middle School Book (2010)", "Michigan Library Association Thumbs Up! Award (2009)", "Florida Teens Read (2009)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2010)", "Iowa High School Book Award (2011)", "New Mexico Land of Enchantment Award for Young Adult (2011)", "Eliot Rosewater Indiana High School Book Award (2010)", "The Inky Awards for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2011)", "Lincoln Award (2011)", "Kinderboekwinkelprijs (2010)", "Missouri Truman Readers Award (2011)", "Cybils Award for Young Adult Fantasy & Science Fiction (2008)", "Literaturpreis der Jury der jungen Leser for Jugendbuch (2010)", "The Inky Awards Shortlist for Silver Inky (2009)", "Prix Et-lisez-moi (2011)", "Missouri Gateway Readers Award (2011)", "Oklahoma Sequoyah Award for High School and Intermediate (2011)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2009)", "Rebecca Caudill Young Readers' Book Award (2011)"], "places": ["District 12, Panem", "Capitol, Panem", "Panem"], "character_names": ["Katniss Everdeen", "Peeta Mellark", "Cato (Hunger Games)", "Primrose Everdeen", "Gale Hawthorne", "Effie Trinket", "Haymitch Abernathy", "Cinna", "President Coriolanus Snow", "Rue", "Venia", "Flavius", "Lavinia (Hunger Games)", "Marvel", "Glimmer", "Clove", "Foxface", "Thresh", "Greasy Sae", "Madge Undersee", "Caesar Flickerman", "Claudius Templesmith", "Octavia (Hunger Games)", "Portia (hunger Games)"], "language": "English", "publish_date": "2008-09-14 00:00:00", "ISBN": "0439023483"}
]