[
{"url": "https://www.goodreads.com/book/show/81227.Infidel", "num_ratings": "67,436", "num_reviews": "5,944", "avg_ratings": 4.2, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Religion", "Cultural", "Africa"], "title": "Infidel", "description": ["One of today’s most admired and controversial political figures, Ayaan Hirsi Ali burst into international headlines following the murder of Theo van Gogh by an Islamist who threatened that she would be next. She made headlines again when she was stripped of her citizenship and resigned from the Dutch Parliament.", " shows the coming of age of this distinguished politica", "One of today’s most admired and controversial political figures, Ayaan Hirsi Ali burst into international headlines following the murder of Theo van Gogh by an Islamist who threatened that she would be next. She made headlines again when she was stripped of her citizenship and resigned from the Dutch Parliament.", " shows the coming of age of this distinguished political superstar and champion of free speech as well as the development of her beliefs, iron will, and extraordinary determination to fight injustice. Raised in a strict Muslim family, Hirsi Ali survived civil war, female mutilation, brutal beatings, adolescence as a devout believer during the rise of the Muslim Brotherhood, and life in four troubled, unstable countries ruled largely by despots. She escaped from a forced marriage and sought asylum in the Netherlands, where she earned a college degree in political science, tried to help her tragically depressed sister adjust to the West, and fought for the rights of Muslim women and the reform of Islam as a member of Parliament. Under constant threat, demonized by reactionary Islamists and politicians, disowned by her father, and expelled from family and clan, she refuses to be silenced.", "Ultimately a celebration of triumph over adversity, Hirsi Ali’s story tells how a bright little girl evolves out of dutiful obedience to become an outspoken, pioneering freedom fighter. As Western governments struggle to balance democratic ideals with religious pressures, no other book could be more timely or more significant."], "author": "Ayaan Hirsi Ali", "num_pages": "353", "awards": ["Anisfield-Wolf Book Award (2008)", "Hurston/Wright Legacy Award Nominee for Nonfiction (2008)"], "places": [], "character_names": ["Rita Verdonk", "Ayaan Hirsi Ali"], "language": "English", "publish_date": "2007-02-01 00:00:00", "ISBN": "0743289684"},
{"url": "https://www.goodreads.com/book/show/64533.The_Crusades_Through_Arab_Eyes", "num_ratings": "5,878", "num_reviews": "481", "avg_ratings": 4.17, "genres": ["History", "Nonfiction", "Religion", "Religion", "Islam", "Historical", "Medieval", "War", "Politics", "History", "Medieval History", "Cultural", "France", "Military", "Military History"], "title": "The Crusades Through Arab Eyes", "description": ["The author has combed the works of contemporary Arab chronicles of the Crusades, eyewitnesses, and often participants. He retells their story and offers insights into the historical forces that shape Arab and Islamic consciousness today."], "author": "Amin Maalouf", "num_pages": "293", "awards": [], "places": [], "character_names": ["Richard I of England", "Saladin"], "language": "English", "publish_date": "1989-04-29 00:00:00", "ISBN": "0805208984"},
{"url": "https://www.goodreads.com/book/show/3488337-the-ayatollah-begs-to-differ", "num_ratings": "1,898", "num_reviews": "235", "avg_ratings": 3.75, "genres": ["Nonfiction", "Cultural", "Iran", "History", "Politics", "Religion", "Religion", "Islam"], "title": "The Ayatollah Begs to Differ: The Paradox of Modern Iran", "description": ["The Ayatollah Begs to Differ: The Paradox of Modern Iran"], "author": "Hooman Majd", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-23 00:00:00", "ISBN": "0385523343"},
{"url": "https://www.goodreads.com/book/show/8275612-none-of-us-were-like-this-before", "num_ratings": "187", "num_reviews": "25", "avg_ratings": 4.07, "genres": ["Nonfiction", "War", "War", "Military Fiction", "Sociology", "History", "Politics", "Psychology"], "title": "None of Us Were Like This Before: American Soldiers and Torture", "description": ["Sergeant Adam Gray made it home from Iraq only to die in his barracks. For more than three years, reporter Joshua E. S. Phillips—with the support of Adam’s mother and several of his Army buddies—investigated Adam’s death. What Phillips uncovered was a story of American veterans psychologically scarred by the abuse they had meted out to Iraqi prisoners.", "How did US forces tur", "Sergeant Adam Gray made it home from Iraq only to die in his barracks. For more than three years, reporter Joshua E. S. Phillips—with the support of Adam’s mother and several of his Army buddies—investigated Adam’s death. What Phillips uncovered was a story of American veterans psychologically scarred by the abuse they had meted out to Iraqi prisoners.", "How did US forces turn to torture? Phillips’s narrative recounts the journey of a tank battalion—trained for conventional combat—as its focus switches to guerrilla war and prisoner detention. It tells of how a group of ordinary soldiers, ill trained for the responsibilities foisted upon them, descended into the degradation of abuse. The location is far from CIA prisons and Guantanamo, but the story captures the widespread use and nature of torture in the US armed forces. ", "Based on firsthand reporting from the Middle East, as well as interviews with soldiers, their families and friends, military officials, and the victims of torture, ", " reveals how soldiers, senior officials, and the US public came to believe that torture was both effective and necessary. The book illustrates that the damaging legacy of torture is not only borne by the detainees, but also by American soldiers and the country to which they’ve returned."], "author": "Joshua E.S. Phillips", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-06-14 00:00:00", "ISBN": "1844675998"},
{"url": "https://www.goodreads.com/book/show/138299.The_Great_Game", "num_ratings": "4,792", "num_reviews": "362", "avg_ratings": 4.3, "genres": ["History", "Nonfiction", "Cultural", "Asia", "Cultural", "Russia", "Politics"], "title": "The Great Game: The Struggle for Empire in Central Asia", "description": ["Hopkirk's spellbinding account of the great imperial struggle for supremacy in Central Asia has been hailed as essential reading with that era's legacy playing itself out today. The Great Game between Victorian Britain & Tsarist Russia was fought across desolate terrain from the Caucasus to China, over the lonely passes of the Parmirs & Karakorams, in the blazing K", "Hopkirk's spellbinding account of the great imperial struggle for supremacy in Central Asia has been hailed as essential reading with that era's legacy playing itself out today. The Great Game between Victorian Britain & Tsarist Russia was fought across desolate terrain from the Caucasus to China, over the lonely passes of the Parmirs & Karakorams, in the blazing Kerman & Helmund deserts, & thru the caravan towns of the old Silk Road-both powers scrambling to control access to the riches of India & the East. When play first began, the frontiers of Russia & British India lay 2000 miles apart; by the end, this distance had shrunk to 20 miles at some points. Now, in the vacuum left by the disintegration of the USSR, there's once again talk of Russian soldiers \"dipping their toes in the Indian Ocean.\"", " The Washington Post has said that \"every story Peter Hopkirk touches is totally engrossing.\" In this gripping narrative he recounts a breathtaking tale of espionage & treachery thru the actual experiences of its colorful characters. Based on meticulous scholarship & on-the-spot research, this is the history at the core of today's geopolitics."], "author": "Peter Hopkirk", "num_pages": "565", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-08-16 00:00:00", "ISBN": "1568360223"},
{"url": "https://www.goodreads.com/book/show/68016.A_Border_Passage", "num_ratings": "826", "num_reviews": "72", "avg_ratings": 3.81, "genres": ["Nonfiction", "Autobiography", "Memoir", "Northern Africa", "Egypt", "Religion", "Islam", "Travel"], "title": "A Border Passage: From Cairo to America – A Woman's Journey", "description": ["A Border Passage: From Cairo to America--A Woman's Journey"], "author": "Leila Ahmed", "num_pages": "307", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-05 00:00:00", "ISBN": "0140291830"},
{"url": "https://www.goodreads.com/book/show/46347.All_the_Shah_s_Men", "num_ratings": "5,716", "num_reviews": "633", "avg_ratings": 4.23, "genres": ["History", "Nonfiction", "Politics", "Cultural", "Iran", "North American Hi...", "American History"], "title": "All the Shah's Men: An American Coup and the Roots of Middle East Terror", "description": ["An American Coup & the Roots of Middle East Terror", "Half a century ago, the United States overthrew a Middle Eastern government for the first time. The victim was Mohammad Mossadegh, the democratically elected prime minister of Iran. Although the coup seemed a success at first, today it serves as a chilling lesson about the dangers of foreign intervention.In this book, v", "An American Coup & the Roots of Middle East Terror", "Half a century ago, the United States overthrew a Middle Eastern government for the first time. The victim was Mohammad Mossadegh, the democratically elected prime minister of Iran. Although the coup seemed a success at first, today it serves as a chilling lesson about the dangers of foreign intervention.In this book, veteran New York Times correspondent Stephen Kinzer gives the first full account of this fateful operation. His account is centered around an hour-by-hour reconstruction of the events of August 1953, and concludes with an assessment of the coup's \"haunting and terrible legacy.\"Operation Ajax, as the plot was code-named, reshaped the history of Iran, the Middle East, and the world. It restored Mohammad Reza Shah to the Peacock Throne, allowing him to impose a tyranny that ultimately sparked the Islamic Revolution of 1979. The Islamic Revolution, in turn, inspired fundamentalists throughout the Muslim world, including the Taliban and terrorists who thrived under its protection.\"It is not far-fetched,\" Kinzer asserts in this book, \"to draw a line from Operation Ajax through the Shah's repressive regime and the Islamic Revolution to the fireballs that engulfed the World Trade Center in New York.\"Drawing on research in the United States and Iran, and using material from a long-secret CIA report, Kinzer explains the background of the coup and tells how it was carried out. It is a cloak-and-dagger story of spies, saboteurs, and secret agents. There are accounts of bribes, staged riots, suitcases full of cash, and midnight meetings between the Shah and CIA agent Kermit Roosevelt, who was smuggled in and out of the royal palace under a blanket in the back seat of a car. Roosevelt,the grandson of President Theodore Roosevelt, was a real-life James Bond in an era when CIA agents operated mainly by their wits. After his first coup attempt failed, he organized a second attempt that succeeded three days later.The colorful cast of characters includes the terrified young Shah, who fled his country at the first sign of trouble; General H. Norman Schwarzkopf, father of the Gulf War commander and the radio voice of \"Gang Busters,\" who flew to Tehran on a secret mission that helped set the coup in motion; and the fiery Prime Minister Mossadegh, who outraged the West by nationalizing the immensely profitable Anglo-Iranian Oil Company. The British, outraged by the seizure of their oil company, persuaded President Dwight Eisenhower that Mossadegh was leading Iran toward Communism. Eisenhower and Prime Minister Winston Churchill of Great Britain became the coup's main sponsors.Brimming with insights into Middle Eastern history and American foreign policy, this book is an eye-opening look at an event whose unintended consequences--Islamic revolution and violent anti-Americanism--have shaped the modern world. As the United States assumes an ever-widening role in the Middle East, it is essential reading."], "author": "Stephen Kinzer", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-08-01 00:00:00", "ISBN": "0471678783"},
{"url": "https://www.goodreads.com/book/show/59661.Shah_of_Shahs", "num_ratings": "3,839", "num_reviews": "320", "avg_ratings": 4.21, "genres": ["History", "Nonfiction", "Cultural", "Iran", "Writing", "Journalism", "Politics", "Travel", "European Literature", "Polish Literature", "Literature", "20th Century", "Biography", "Cultural", "Poland"], "title": "Shah of Shahs", "description": ["In ", " Kapuscinski brings a mythographer's perspective and a novelist's virtuosity to bear on the overthrow of the last Shah of Iran, one of the most infamous of the United States' client-dictators, who resolved to transform his country into \"a second America in a generation,\" only to be toppled virtually overnight. From his vantage point at the break-up of the o", "In ", " Kapuscinski brings a mythographer's perspective and a novelist's virtuosity to bear on the overthrow of the last Shah of Iran, one of the most infamous of the United States' client-dictators, who resolved to transform his country into \"a second America in a generation,\" only to be toppled virtually overnight. From his vantage point at the break-up of the old regime, Kapuscinski gives us a compelling history of conspiracy, repression, fanatacism, and revolution."], "author": "Ryszard Kapuściński", "num_pages": "160", "awards": [], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": [], "language": "English", "publish_date": "1992-02-04 00:00:00", "ISBN": "0679738010"},
{"url": "https://www.goodreads.com/book/show/400598.Leap_of_Faith_", "num_ratings": "8,435", "num_reviews": "722", "avg_ratings": 3.79, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir"], "title": "Leap of Faith : Memoirs of an Unexpected Life", "description": [" is the dramatic and inspiring story of an American woman's remarkable journey into the heart of a man and his nation. ", "Born into a distinguished Arab-American family and raised amid privilege, Lisa Halaby joined the first freshman class at Princeton to accept women, graduating in 1974 with a degree in architecture and urban planning. Two years later, while vis", " is the dramatic and inspiring story of an American woman's remarkable journey into the heart of a man and his nation. ", "Born into a distinguished Arab-American family and raised amid privilege, Lisa Halaby joined the first freshman class at Princeton to accept women, graduating in 1974 with a degree in architecture and urban planning. Two years later, while visiting her father in Jordan, she was casually introduced on the airport runway to King Hussein. Widely admired in the Arab world as a voice of moderation, and for his direct lineage to the prophet Muhammad, Hussein would soon become the world's most eligible bachelor after the tragic death of his wife. The next time they met, Hussein would fall headlong in love with the athletic, outspoken daughter of his longtime friend. After a whirlwind, secret courtship Lisa Halaby became Noor Al Hussein, Queen of Jordan.", "With eloquence and candor, Queen Noor speaks of the obstacles she faced as a naive young bride in the royal court, of rebelling against the smothering embrace of security guards and palace life, and of her own successful struggle to create a working role as a humanitarian activist in a court that simply expected Noor to keep her husband happy. As she gradually took on the mantle of a queen, Noor's joys and challenges grew. After a heartbreaking miscarriage, she gave birth to four children. Meshing the demands of motherhood with the commitments of her position often proved difficult, but she tried to keep her young children by her side, even while flying the world with her husband in his relentless quest for peace. This mission would reap satisfying rewards, including greater Arab unity and a peace treaty with Israel, and suffer such terrible setbacks as the Gulf War and the assassination of Prime Minister Rabin.", " is a remarkable document. It is the story of a young American woman who became wife and partner to an Arab monarch. It provides a compelling portrait of the late King Hussein and his lifelong effort to bring peace to his war-torn region, and an insider's view of the growing gulf between the United States and the Arab nations. It is also the refreshingly candid story of a mother coming to terms with the demands the king's role as a world statesman placed on her family's private life. But most of all it is a love story — the intimate account of a woman who lost her heart to a king, and to his people."], "author": "Noor Al-Hussein", "num_pages": "496", "awards": [], "places": [], "character_names": ["Noor of Jordan"], "language": "English", "publish_date": "2005-03-09 00:00:00", "ISBN": "1401359485"},
{"url": "https://www.goodreads.com/book/show/336463.Whatever_Happened_to_the_Egyptians_", "num_ratings": "188", "num_reviews": "14", "avg_ratings": 3.69, "genres": ["Northern Africa", "Egypt", "History", "Nonfiction", "Politics", "Economics", "Religion", "Islam", "Writing", "Essays"], "title": "Whatever Happened to the Egyptians?: Changes in Egyptian Society from 1950 to the Present", "description": ["Based on both academic research and the author's own personal experiences and impressions, this delightful and informative book examines the underlying causes of some of the more disturbing social, political, economic, and cultural phenomena that characterize Egyptian society in the 1990s. ", "Egypt's crisis of culture and other woes are often attributed to the 'open door poli", "Based on both academic research and the author's own personal experiences and impressions, this delightful and informative book examines the underlying causes of some of the more disturbing social, political, economic, and cultural phenomena that characterize Egyptian society in the 1990s. ", "Egypt's crisis of culture and other woes are often attributed to the 'open door policy' (Infitah) initiated under President Sadat in the mid-1970s, and to the large-scale migration of Egyptian workers to the oil-rich states of the Gulf that began around the same time. Galal Amin contends, however, that these factors alone are insufficient to explain the fundamental changes in behavior and attitudes that characterize modern Egyptian life. The 'missing link, ' Amin argues, lies in the social mobility unleashed by the July Revolution of 1952, which was later accelerated by Infitah and workers' migration. The sudden upward mobility and attendant prestige, self-confidence, and purchasing power of a large segment of Egyptian society and the desire to display this new-found social position as conspicuously as possible have had an enormous effect on the attitudes and allegiances of these groups. ", "Through a fascinating and often highly entertaining examination of issues ranging from the middle class, religious fanaticism, and attitudes to the West and Western culture, to the Egyptian institution of the summer holiday by the sea and the performing arts and entertainment, Amin posits that social mobility has changed the customs and habits, moral and material values, and patterns of consumption and investment of the aspiring classes, and has, furthermore, induced the Egyptian people to ignore national and ideological issues of grave importance.", "This insightful book will prove a thought-provoking read for those concerned with emerging economies, international development, and privatization, and will intrigue anyone with an interest in the social history of Egypt.", "The Arabic edition of this book was awarded the Cairo International Book Fair Prize for the best book in Social Studies in 1998. ", "Comments on the Arabic edition: ", "'A rare example of combining social theory with concrete observation and intimate personal experience.... A very perceptive account of Egyptian social development with almost the impact of a dramatic creation.\" Abd al-Qader al-Qutt, al-Ahram, 2000.", "\"A very valuable and highly important contribution to social thought and to Egypt's social history.... A highly original and enjoyable book.\" Faruq Shusha, al-Ahram, 1999."], "author": "Galal Amin", "num_pages": "177", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-03-01 00:00:00", "ISBN": "9774245598"},
{"url": "https://www.goodreads.com/book/show/151740.The_Lemon_Tree", "num_ratings": "8,781", "num_reviews": "1,375", "avg_ratings": 4.04, "genres": ["Nonfiction", "History", "Cultural", "Israel", "Politics"], "title": "The Lemon Tree: An Arab, a Jew, and the Heart of the Middle East", "description": ["In 1967, Bashir Al-Khayri, a Palestinian twenty-five-year-old, journeyed to Israel, with the goal of seeing the beloved old stone house, with the lemon tree behind it, that he and his family had fled nineteen years earlier. To his surprise, when he found the house he was greeted by Dalia Ashkenazi Landau, a nineteen-year-old Israeli college student, whose family fled Europ", "In 1967, Bashir Al-Khayri, a Palestinian twenty-five-year-old, journeyed to Israel, with the goal of seeing the beloved old stone house, with the lemon tree behind it, that he and his family had fled nineteen years earlier. To his surprise, when he found the house he was greeted by Dalia Ashkenazi Landau, a nineteen-year-old Israeli college student, whose family fled Europe for Israel following the Holocaust. On the stoop of their shared home, Dalia and Bashir began a rare friendship, forged in the aftermath of war and tested over the next thirty-five years in ways that neither could imagine on that summer day in 1967. Based on extensive research, and springing from his enormously resonant documentary that aired on NPR’s ", " in 1998, Sandy Tolan brings the Israeli-Palestinian conflict down to its most human level, suggesting that even amid the bleakest political realities there exist stories of hope and reconciliation."], "author": "Sandy Tolan", "num_pages": "400", "awards": ["National Book Critics Circle Award Nominee for General Nonfiction (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "1596913436"},
{"url": "https://www.goodreads.com/book/show/9076.Guests_of_the_Ayatollah", "num_ratings": "3,835", "num_reviews": "303", "avg_ratings": 4.13, "genres": ["History", "Nonfiction", "Cultural", "Iran", "Politics"], "title": "Guests of the Ayatollah: The First Battle in America's War With Militant Islam", "description": ["From the best-selling author of ", " comes a riveting, definitive chronicle of the Iran hostage crisis, America's first battle with militant Islam. On November 4, 1979, a group of radical Islamist students, inspired by the revolutionary Iranian leader Ayatollah Khomeini, stormed the U.S. embassy in Tehran. They took fifty-two Americans hostage, and kept nearly a", "From the best-selling author of ", " comes a riveting, definitive chronicle of the Iran hostage crisis, America's first battle with militant Islam. On November 4, 1979, a group of radical Islamist students, inspired by the revolutionary Iranian leader Ayatollah Khomeini, stormed the U.S. embassy in Tehran. They took fifty-two Americans hostage, and kept nearly all of them hostage for 444 days.", "In ", ", Mark Bowden tells this sweeping story through the eyes of the hostages, the soldiers in a new special forces unit sent to free them, their radical, naïve captors, and the diplomats working to end the crisis. Bowden takes us inside the hostages' cells and inside the Oval Office for meetings with President Carter and his exhausted team. We travel to international capitals where shadowy figures held clandestine negotiations, and to the deserts of Iran, where a courageous, desperate attempt to rescue the hostages exploded into tragic failure. Bowden dedicated five years to this research, including numerous trips to Iran and countless interviews with those involved on both sides.", " is a detailed, brilliantly re-created, and suspenseful account of a crisis that gripped and ultimately changed the world."], "author": "Mark Bowden", "num_pages": "704", "awards": [], "places": [], "character_names": ["Jimmy Carter"], "language": "English", "publish_date": "2006-03-27 00:00:00", "ISBN": "0871139251"},
{"url": "https://www.goodreads.com/book/show/43255.Not_Without_My_Daughter", "num_ratings": "21,305", "num_reviews": "1,188", "avg_ratings": 4.06, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Cultural", "Iran"], "title": "Not Without My Daughter", "description": ["In August 1984, Michigan housewife Betty Mahmoody accompanied her husband to his native Iran for a two-week vacation that turned into a permanent stay. To her horror, she found herself and her four-year-old daughter, Mahtob, virtual prisoners of a man rededicated to his Shiite Moslem faith, in a land where women are near-slaves and Americans despised. Their only hope for e", "In August 1984, Michigan housewife Betty Mahmoody accompanied her husband to his native Iran for a two-week vacation that turned into a permanent stay. To her horror, she found herself and her four-year-old daughter, Mahtob, virtual prisoners of a man rededicated to his Shiite Moslem faith, in a land where women are near-slaves and Americans despised. Their only hope for escape lay in a dangerous underground that would not take her child."], "author": "Betty Mahmoody", "num_pages": "528", "awards": [], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2004-07-05 00:00:00", "ISBN": "0552152161"},
{"url": "https://www.goodreads.com/book/show/151579.Covering_Islam", "num_ratings": "1,374", "num_reviews": "93", "avg_ratings": 4.05, "genres": ["Nonfiction", "Religion", "Islam", "Politics", "History", "Religion"], "title": "Covering Islam: How the Media and the Experts Determine How We See the Rest of the World", "description": ["From the Iranian hostage crisis through the Gulf War and the bombing of the World Trade Center, the American news media have portrayed \"Islam\" as a monolithic entity, synonymous with terrorism and religious hysteria. In this classic work, now updated, the author of Culture and Imperialism reveals the hidden agendas and distortions of fact that underlie even the most \"objec", "From the Iranian hostage crisis through the Gulf War and the bombing of the World Trade Center, the American news media have portrayed \"Islam\" as a monolithic entity, synonymous with terrorism and religious hysteria. In this classic work, now updated, the author of Culture and Imperialism reveals the hidden agendas and distortions of fact that underlie even the most \"objective\" coverage of the Islamic world."], "author": "Edward W. Said", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-11 00:00:00", "ISBN": "0679758909"},
{"url": "https://www.goodreads.com/book/show/88271.The_Shia_Revival", "num_ratings": "1,987", "num_reviews": "150", "avg_ratings": 3.89, "genres": ["Religion", "History", "Nonfiction", "Religion", "Islam", "Politics", "Cultural", "Iran", "Political Science", "International Relations", "Spirituality", "Cultural", "Philosophy"], "title": "The Shia Revival: How Conflicts within Islam Will Shape the Future", "description": ["Iranian-born scholar Vali Nasr has become one of America's leading commentators on current events in the Middle East, admired and welcomed by both media and government for his \"concise and coherent\" analysis (", ", front-page profile). In this \"remarkable work\" (Anderson Cooper), Nasr brilliantly dissects the political and theological antagonisms within Isla", "Iranian-born scholar Vali Nasr has become one of America's leading commentators on current events in the Middle East, admired and welcomed by both media and government for his \"concise and coherent\" analysis (", ", front-page profile). In this \"remarkable work\" (Anderson Cooper), Nasr brilliantly dissects the political and theological antagonisms within Islam, providing a unique and objective understanding of the 1,400-year bitter struggle between Shias and Sunnis and shedding crucial light on its modern-day consequences."], "author": "Vali Nasr", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0393329682"},
{"url": "https://www.goodreads.com/book/show/7104988-our-last-best-chance", "num_ratings": "590", "num_reviews": "91", "avg_ratings": 4.05, "genres": ["History", "Politics", "Biography", "Nonfiction"], "title": "Our Last Best Chance: The Pursuit of Peace in a Time of Peril", "description": [" ", " When a dying King Hussein shocked the world by picking his son rather than his brother, the longtime crown prince, to be the next king of Jordan, no one was more surprised than the young head of Special Operations, who discovered his life was in for a major upheaval. ", " This is the inspir", " ", " When a dying King Hussein shocked the world by picking his son rather than his brother, the longtime crown prince, to be the next king of Jordan, no one was more surprised than the young head of Special Operations, who discovered his life was in for a major upheaval. ", " This is the inspirational story of a young prince who went to boarding school in America and military academy in Britain and grew up believing he would be a soldier. Back home, he hunted down terrorists and modernized Jordan's Special Forces. Then, suddenly, he found himself king. Together with his wife, Queen Rania, he transformed what it meant to be a monarch, going undercover to escape the bubble of the court while she became the Muslim world's most passionate advocate of women's rights. ", " In this exceptionally candid memoir, King Abdullah tackles the single toughest issue he faces head-on- how to solve the Israeli-Palestinian standoff- and reveals himself to be an invaluable intermediary between America and the Arab world. He writes about the impact of the Iraq war on his neighborhood and how best to tackle Iran's nuclear ambitions. ", " Why would a sitting head of state choose to write about the most explosive issues he faces? King Abdullah does so now because he believes we face a moment of truth: a last chance for peace in the Middle East. The prize is enormous, the cost of failure far greater than we dare imagine."], "author": "Abdullah II of Jordan", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-02-22 00:00:00", "ISBN": "0670021717"},
{"url": "https://www.goodreads.com/book/show/103342.Stolen_Lives", "num_ratings": "25,214", "num_reviews": "2,857", "avg_ratings": 4.1, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Stolen Lives: Twenty Years in a Desert Jail", "description": ["A gripping memoir that reads like a political thriller--the story of Malika Oufkir's turbulent and remarkable life. Born in 1953, Malika Oufkir was the eldest daughter of General Oufkir, the King of Morocco's closest aide. Adopted by the king at the age of five, Malika spent most of her childhood and adolescence in the seclusion of the court harem, one of the most eligible", "A gripping memoir that reads like a political thriller--the story of Malika Oufkir's turbulent and remarkable life. Born in 1953, Malika Oufkir was the eldest daughter of General Oufkir, the King of Morocco's closest aide. Adopted by the king at the age of five, Malika spent most of her childhood and adolescence in the seclusion of the court harem, one of the most eligible heiresses in the kingdom, surrounded by luxury and extraordinary privilege. "], "author": "Malika Oufkir", "num_pages": "304", "awards": [], "places": [], "character_names": ["Malika Oufkir"], "language": "English", "publish_date": "2002-05-01 00:00:00", "ISBN": "0786886307"},
{"url": "https://www.goodreads.com/book/show/6728612-dubai", "num_ratings": "433", "num_reviews": "53", "avg_ratings": 3.92, "genres": ["History", "Nonfiction", "Politics", "Travel", "Business"], "title": "Dubai: The Story Of The World's Fastest City", "description": ["Dubai is capitalism on cocaine. Las Vagas without the gambling but twice the prostitutes. It's the fastest-growing city in the world, with an economy that outpaced China's last year while luring more tourists than all of India. It's one of the world's safest places, but a stone's throw from its most dangerous. This book tells the story of Dubai."], "author": "Jim Krane", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "1848870078"},
{"url": "https://www.goodreads.com/book/show/3204677-palestinian-walks", "num_ratings": "647", "num_reviews": "85", "avg_ratings": 3.98, "genres": ["Nonfiction", "Travel", "History", "Autobiography", "Memoir"], "title": "Palestinian Walks: Forays into a Vanishing Landscape", "description": ["Raja Shehadeh is a passionate hill walker. He enjoys nothing more than heading out into the countryside that surrounds his home. But in recent years, his hikes have become less than bucolic and sometimes downright dangerous. That is because his home is Ramallah, on the Palestinian West Bank, and the landscape he traverses is now the site of a tense standoff between his fel", "Raja Shehadeh is a passionate hill walker. He enjoys nothing more than heading out into the countryside that surrounds his home. But in recent years, his hikes have become less than bucolic and sometimes downright dangerous. That is because his home is Ramallah, on the Palestinian West Bank, and the landscape he traverses is now the site of a tense standoff between his fellow Palestinians and settlers newly arrived from Israel. ", " In this original and evocative book, we accompany Raja on six walks taken between 1978 and 2006. The earlier forays are peaceful affairs, allowing our guide to meditate at length on the character of his native land, a terrain of olive trees on terraced hillsides, luxuriant valleys carved by sacred springs, carpets of wild iris and hyacinth and ancient monasteries built more than a thousand years ago. Shehadeh's love for this magical place saturates his renderings of its history and topography. But latterly, as seemingly endless concrete is poured to build settlements and their surrounding walls, he finds the old trails are now impassable and the countryside he once traversed freely has become contested ground. He is harassed by Israeli border patrols, watches in terror as a young hiking companion picks up an unexploded missile and even, on one occasion when accompanied by his wife, comes under prolonged gunfire. ", " Amid the many and varied tragedies of the Middle East, the loss of a simple pleasure such as the ability to roam the countryside at will may seem a minor matter. But in ", " Raja Shehadeh's elegy for his lost footpaths becomes a heartbreaking metaphor for the deprivations of an entire people estranged from their land."], "author": "Raja Shehadeh", "num_pages": "224", "awards": ["Orwell Prize (2008)", "Ryszard Kapuściński Prize Nominee (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-03 00:00:00", "ISBN": "1416569669"},
{"url": "https://www.goodreads.com/book/show/2885565-the-age-of-the-warrior", "num_ratings": "490", "num_reviews": "48", "avg_ratings": 3.96, "genres": ["Nonfiction", "Politics", "History", "Writing", "Essays", "Culture", "Society", "Writing", "Journalism", "War"], "title": "The Age Of The Warrior: Selected Essays", "description": ["A selection of Robert Fisk's finest 'Comment' pieces from the Saturday Independent. He is best known for his writing about the Middle East, its wars, dictators and international relations, but these 'Comment' articles cover an array of topics, from his soldier grandfather to handwriting to the Titanic."], "author": "Robert Fisk", "num_pages": "522", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "0007270739"},
{"url": "https://www.goodreads.com/book/show/108622.Mezzaterra", "num_ratings": "84", "num_reviews": "8", "avg_ratings": 3.73, "genres": ["Nonfiction", "Northern Africa", "Egypt", "Writing", "Essays", "Politics"], "title": "Mezzaterra: Fragments from the Common Ground", "description": ["From the bestselling author of the Booker Prize finalist ", "–an incisive collection of essays on Arab identity, art, and politics that seeks to locate the mezzaterra, or common ground, in an increasingly globalized world.", "The twenty-five years’ worth of criticism and commentary collected here have earned Ahdaf Soueif a place among our most prominent Arab intelle", "From the bestselling author of the Booker Prize finalist ", "–an incisive collection of essays on Arab identity, art, and politics that seeks to locate the mezzaterra, or common ground, in an increasingly globalized world.", "The twenty-five years’ worth of criticism and commentary collected here have earned Ahdaf Soueif a place among our most prominent Arab intellectuals. Clear-eyed and passionate, and syndicated throughout the world, they are the direct result of Soueif’s own circumstances of being “like hundreds of thousands of others: people with an Arab or a Muslim background doing daily double-takes when faced with their reflection in a western mirror.” Whether an account of visiting Palestine and entering the Noble Sanctuary for the first time, an interpretation of women who choose to wear the veil, or her post—September 11 reflections, Soueif’s intelligent, fearless, deeply informed essays embody the modern search for identity and community."], "author": "Ahdaf Soueif", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-11 00:00:00", "ISBN": "1400096634"},
{"url": "https://www.goodreads.com/book/show/26114587-islamic-exceptionalism", "num_ratings": "293", "num_reviews": "41", "avg_ratings": 3.85, "genres": ["Religion", "Islam", "Politics", "Religion", "Nonfiction", "History"], "title": "Islamic Exceptionalism: How the Struggle Over Islam Is Reshaping the World", "description": ["In ", "Brookings Institution scholar and acclaimed author Shadi Hamid offers a novel and provocative argument on how Islam is, in fact, \"exceptional\" in how it relates to politics, with profound implications for how we understand the future of the Middle East. Divides among citizens aren't just about power but are products of fundamental disagreements o", "In ", "Brookings Institution scholar and acclaimed author Shadi Hamid offers a novel and provocative argument on how Islam is, in fact, \"exceptional\" in how it relates to politics, with profound implications for how we understand the future of the Middle East. Divides among citizens aren't just about power but are products of fundamental disagreements over the very nature and purpose of the modern nation state—and the vexing problem of religion’s role in public life. Hamid argues for a new understanding of how Islam and Islamism shape politics by examining different models of reckoning with the problem of religion and state, including the terrifying—and alarmingly successful—example of ISIS.", "With unprecedented access to Islamist activists and leaders across the region, Hamid offers a panoramic and ambitious interpretation of the region's descent into violence. ", " is a vital contribution to our understanding of Islam's past and present, and its outsized role in modern politics. We don't have to like it, but we have to understand it—because Islam, as a religion and as an idea, will continue to be a force that shapes not just the region, but the West as well in the decades to come."], "author": "Shadi Hamid", "num_pages": "320", "awards": ["Lionel Gelber Prize Nominee (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-06-07 00:00:00", "ISBN": "1250061016"},
{"url": "https://www.goodreads.com/book/show/648343.Religion_of_Peace_", "num_ratings": "149", "num_reviews": "19", "avg_ratings": 3.88, "genres": ["Religion", "Islam", "Religion", "Politics", "Christian", "Nonfiction", "Religion", "Christianity"], "title": "Religion of Peace?: Why Christianity Is and Islam Isn't", "description": ["Christianity or Islam: which is the real \"religion of peace\"?", "Almost any liberal pundit will tell you that there's a religion bent on destroying our Constitution, stripping us of our liberties, and imposing religious rule on the U.S. And that religion is . . .Christianity! About Islam, however, the Left is silent--except to claim a moral equivalence between the two: if Isla", "Christianity or Islam: which is the real \"religion of peace\"?", "Almost any liberal pundit will tell you that there's a religion bent on destroying our Constitution, stripping us of our liberties, and imposing religious rule on the U.S. And that religion is . . .Christianity! About Islam, however, the Left is silent--except to claim a moral equivalence between the two: if Islam has terrorists today, that's nothing compared to the Crusades, inquisitions, and religious wars in Christianity's past.", "But is this true? Are conservative Christians really more of a threat to free societies than Islamic jihadists? Is the Bible really \"just as violent\" as the Qur'an? Is Christianity's history really as bloodstained as Islam's? In Religion of Peace? Why Christianity Is and Islam Isn't, New York Times bestselling author Robert Spencer not only refutes such charges, but also explains why Americans and Europeans must regain an appreciation of our Christian heritage if we ever hope to defeat Islamic supremacism. In this eye opening work, Spencer reveals:", "* The fundamental differences between Islamic and Christian teachings about warfare against other religions: \"Love your enemies\" vs. \"Be ruthless to the unbelievers\"", "* The myth of Western immorality and Islamic puritanism and why the Islamic world is less moral than the West", "* Why the Islamic world has never developed the distinction between religious and secular law that is inherent in Christianity", "* Why Christianity has always embraced reason--and Islam has always rejected it", "* Why the most determined enemies of Western civilization may not be the jihadists at all, but the leftists who fear their churchgoing neighbors more than Islamic terrorists", "* Why Jews, Christians, and peoples of other faiths (or no faith) are equally at risk from militant Islam", "Spencer writes not to proselytize, but to state a fact: Christianity is a true \"religion of peace,\" and on it Western civilization stands. If we are not to perish under Islam's religion of the sword--with its more than 100 million active jihadists seeking to impose sharia law--we had better defend our own civilization."], "author": "Robert Spencer", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-07-17 00:00:00", "ISBN": "1596985151"},
{"url": "https://www.goodreads.com/book/show/13587149-games-without-rules", "num_ratings": "650", "num_reviews": "108", "avg_ratings": 4.32, "genres": ["History", "Nonfiction", "Politics", "Audiobook"], "title": "Games Without Rules: The Often Interrupted History of Afghanistan", "description": ["Today, most Westerners still see the war in Afghanistan as a contest between democracy and Islamist fanaticism. That war is real; but it sits atop an older struggle, between Kabul and the countryside, between order and chaos, between a modernist impulse to join the world and the pull of an older Afghanistan: a tribal universe of village republics permeated by Islam.", "Now, Ta", "Today, most Westerners still see the war in Afghanistan as a contest between democracy and Islamist fanaticism. That war is real; but it sits atop an older struggle, between Kabul and the countryside, between order and chaos, between a modernist impulse to join the world and the pull of an older Afghanistan: a tribal universe of village republics permeated by Islam.", "Now, Tamim Ansary draws on his Afghan background, Muslim roots, and Western and Afghan sources to explain history from the inside out, and to illuminate the long, internal struggle that the outside world has never fully understood. It is the story of a nation struggling to take form, a nation undermined by its own demons while, every 40 to 60 years, a great power crashes in and disrupts whatever progress has been made. Told in conversational, storytelling style, and focusing on key events and personalities, \"Games without Rules\" provides revelatory insight into a country at the center of political debate."], "author": "Tamim Ansary", "num_pages": "397", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-27 00:00:00", "ISBN": "1610390946"},
{"url": "https://www.goodreads.com/book/show/13333943-it-s-a-happy-life", "num_ratings": "29", "num_reviews": "7", "avg_ratings": 4.14, "genres": ["Self Help", "Christian", "Nonfiction"], "title": "It's a Happy Life: Keys to Successful Enjoyable Living", "description": ["Arrested and harassed by the Turkish police and military over 50 times, Dr. Evan Edwards shares secrets to living the happy life - discovered and hammered out while living and working in the Middle East. Full of inspirational and true dramatic stories that illustrate a wealth of penetrating insights, this book will motivate you to enjoy your life, accomplish your dreams. T", "Arrested and harassed by the Turkish police and military over 50 times, Dr. Evan Edwards shares secrets to living the happy life - discovered and hammered out while living and working in the Middle East. Full of inspirational and true dramatic stories that illustrate a wealth of penetrating insights, this book will motivate you to enjoy your life, accomplish your dreams. The book about YOU... ..\".You have what it takes! Believe! You are the one with the dream. You own it. And you will walk through the open doors. Nothing can stop you.. Risk, even if you make mistakes. So live with faith and abandon. Have some fun. You are being carried...\""], "author": "Evan Edwards", "num_pages": "278", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-12 00:00:00", "ISBN": "0615573363"},
{"url": "https://www.goodreads.com/book/show/17559406-iraq-war-2003", "num_ratings": "23", "num_reviews": "7", "avg_ratings": 4.26, "genres": ["History", "Politics"], "title": "Iraq War 2003: What Really Happened Behind The Political Scenes", "description": ["With more than 600 citations, ranging from insider memoirs to the accounts of journalists, former government officials, policy wonks, military leaders, and news broadcasters, the 'Iraq War 2003: What Really Happened Behind The Political Scenes' develops a thorough analysis of what led the Bush administration use the 'War on Terror' to attack Iraq.", " Both the Afghan and Iraq", "With more than 600 citations, ranging from insider memoirs to the accounts of journalists, former government officials, policy wonks, military leaders, and news broadcasters, the 'Iraq War 2003: What Really Happened Behind The Political Scenes' develops a thorough analysis of what led the Bush administration use the 'War on Terror' to attack Iraq.", " Both the Afghan and Iraq wars continue even now to haunt the economical undercurrents of American life like a hungry ghost contributing to our country's recession. What are the real costs of both wars and why were we led to believe otherwise? \"If we fail to learn from history we are doomed to repeat it\".", " Sun Tzu, the ancient philosopher of war, stressed the importance of \"Knowing Your Enemy\". This being critical to victory in the War on Terror, the book examines why al-Qaeda attacked the US on 9/11.", " Could those attacks have been prevented? What warnings from CIA and America's friends around the world preceded the terrorist attacks of 9/11 but ignored by the Bush administration, which then used them to support its agenda of taking out Osama bin Laden's natural enemy, Saddam Hussein, much to the chagrin of most of America's traditional allies around the world and to the benefit of both al-Qaeda and the government of Iran?", " Why were Mullah Omar,Osama bin Laden and Ayman al-Zawahiri allowed to escape? Most know Mark Owen's \"No Easy Day\" and how Osama bin Laden was killed in Pakistan in 2011, but only a few are familiar with the details of how the military bureaucracy under the Bush administration interfered with CIA doing its job.", " Why was al-Qaeda happy that the Bush Administration planned to invade Iraq? What was Osama bin Laden's strategic long-term plan for harming the USA and what role did George W. Bush play in helping it succeed? How did the Iraq war of 2003 unwound principally to the benefit of al-Qaeda and the Shia fundamentalists of Iran?", " How did the War in Afghanistan, so successful in its opening weeks, become 'The Long War'? What are the most effective methods for fighting terrorism?", " How did Saddam Hussein acquire his WMDs and how long, in the face of serious consequences for doing so, did he hold on to them?", " America was prosperous working toward paying off its debts during the 1990's. What exactly would take now to undo the initial mistakes on the \"War on Terror\"?", " Based on the theory of conservatism, were the neo-conservatives of the Bush administration real conservatives? This analysis alone is a must-read for those Republicans at-heart concerned over how their once party has strayed from its main-street principles with which it once resonated.", "Its first few chapters focus on the opening months of the Afghanistan War and Osama bin Laden's escape in Tora Bora, then segue into the invasion of Iraq, telling how the Iraq War of 2003 unwound largely to the benefit of al-Qaeda and the fundamentalist government of Iran. The compelling narrative of 'Iraq War 2003: What Really Happened Behind The Political Scenes' is written almost in the manner of a novel that unpacks in an engaging and logical sequence detailed and documented information about a difficult time in modern American history.", "The book ties together a considerable amount of information and provides a hopeful analysis by reminding us of where we have been. Patriotic concern - like the imprisoned lightning to which it subtly alludes - threads its way through the pages of this book, reminding its readers of the people, ideas, and inspirations that called for America to be its best."], "author": "Charles Edmund Coyote", "num_pages": "323", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-19 00:00:00", "ISBN": "B00BIL0BW2"},
{"url": "https://www.goodreads.com/book/show/825439.O_Jerusalem_", "num_ratings": "2,708", "num_reviews": "246", "avg_ratings": 4.29, "genres": ["History", "Nonfiction", "Cultural", "Israel", "Literature", "Jewish"], "title": "O Jerusalem!", "description": ["Now a major motion picture, this remarkable classic recounts, moment by moment, the spellbinding process that gave birth to the state of Israel.", "Collins and Lapierre weave a brilliant tapestry of shattered hopes, fierce pride, and breathtaking valor as the Arabs, Jews, and British collide in their fight for control of Jerusalem. ", " meticulously re-creates this his", "Now a major motion picture, this remarkable classic recounts, moment by moment, the spellbinding process that gave birth to the state of Israel.", "Collins and Lapierre weave a brilliant tapestry of shattered hopes, fierce pride, and breathtaking valor as the Arabs, Jews, and British collide in their fight for control of Jerusalem. ", " meticulously re-creates this historic struggle. Collins and Lapierre penetrate the battle from the inside, exploring each party's interests, intentions, and concessions as the city of all of their dreams teeters on the brink of destruction. From the Jewish fighters and their heroic commanders to the charismatic Arab chieftain whose death in battle doomed his cause but inspired a generation of Palestinians, ", " tells the three-dimensional story of this high-stakes, emotional conflict. Now with a new introduction by Dominique Lapierre, ", " remains, as ever, a towering testament to the fiery dawn of Israel and an unforgettable tale of faith and violence, of betrayal and indomitable courage."], "author": "Larry Collins", "num_pages": "640", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-05-15 00:00:00", "ISBN": "0671662414"},
{"url": "https://www.goodreads.com/book/show/751881.The_Ottoman_Empire", "num_ratings": "547", "num_reviews": "32", "avg_ratings": 4.17, "genres": ["History", "Nonfiction"], "title": "The Ottoman Empire: The Classical Age 1300-1600", "description": ["A preeminent scholar of Turkish history vividly portrays 300 years of this distinctively Eastern culture as it grew from a military principality to the world's most powerful Islamic state. He paints a striking picture of the prominence of religion and warfare in everyday life, as well as the traditions of statecraft, administration, social values, financial, and land polic", "A preeminent scholar of Turkish history vividly portrays 300 years of this distinctively Eastern culture as it grew from a military principality to the world's most powerful Islamic state. He paints a striking picture of the prominence of religion and warfare in everyday life, as well as the traditions of statecraft, administration, social values, financial, and land policies. \"...masterly...Halil Inalcik is one of the foremost living students of Ottoman history...Read this book...\"--Times Literary Supplement."], "author": "Halil İnalcık", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-12-31 00:00:00", "ISBN": "1842124420"},
{"url": "https://www.goodreads.com/book/show/177335.Dreams_of_Trespass", "num_ratings": "3,549", "num_reviews": "409", "avg_ratings": 3.84, "genres": ["Nonfiction", "Autobiography", "Memoir", "Northern Africa", "Morocco", "Feminism", "Cultural", "Africa", "Biography"], "title": "Dreams of Trespass: Tales of a Harem Girlhood", "description": ["”I was born in a harem in 1940 in Fez, Morocco...” So begins Fatima Mernissi in this exotic and rich narrative of a childhood behind the iron gates of a domestic harem. In ", ", Mernissi weaves her own memories with the dreams and memories of the women who surrounded her in the courtyard of her youth—women who, deprived of access to the world outside, recreat", "”I was born in a harem in 1940 in Fez, Morocco...” So begins Fatima Mernissi in this exotic and rich narrative of a childhood behind the iron gates of a domestic harem. In ", ", Mernissi weaves her own memories with the dreams and memories of the women who surrounded her in the courtyard of her youth—women who, deprived of access to the world outside, recreated it from sheer imagination. ", " is the provocative story of a girl confronting the mysteries of time and place, gender and sex in the recent Muslim world."], "author": "Fatema Mernissi", "num_pages": "242", "awards": [], "places": ["Morocco"], "character_names": [], "language": "English", "publish_date": "1995-09-04 00:00:00", "ISBN": "0201489376"},
{"url": "https://www.goodreads.com/book/show/27507.Plan_of_Attack", "num_ratings": "4,666", "num_reviews": "137", "avg_ratings": 3.67, "genres": ["History", "Politics", "Nonfiction", "War", "War", "Military Fiction"], "title": "Plan of Attack", "description": [" is the definitive account of how and why President George W. Bush, his war council, and allies launched a preemptive attack to topple Saddam Hussein and occupy Iraq. Bob Woodward's latest landmark account of Washington decision making provides an original, authoritative narrative of behind-the-scenes maneuvering over two years, examining the causes and conse", " is the definitive account of how and why President George W. Bush, his war council, and allies launched a preemptive attack to topple Saddam Hussein and occupy Iraq. Bob Woodward's latest landmark account of Washington decision making provides an original, authoritative narrative of behind-the-scenes maneuvering over two years, examining the causes and consequences of the most controversial war since Vietnam. ", " Based on interviews with 75 key participants and more than three and a half hours of exclusive interviews with President Bush, ", " is part presidential history charting the decisions made during 16 critical months; part military history revealing precise details and the evolution of the Top Secret war planning under the restricted codeword Polo Step; and part a harrowing spy story as the CIA dispatches a covert paramilitary team into northern Iraq six months before the start of the war. This team recruited 87 Iraqi spies designated with the cryptonym DB/ROCKSTARS, one of whom turned over the personnel files of all 6,000 men in Saddam Hussein's personal security organization. ", " What emerges are astonishingly intimate portraits: President Bush in war cabinet meetings in the White House Situation Room and the Oval Office, and in private conversation; Dick Cheney, the focused and driven vice president; Colin Powell, the conflicted and cautious secretary of state; Donald Rumsfeld, the controlling war technocrat; George Tenet, the activist CIA director; Tommy Franks, the profane and demanding general; Condoleezza Rice, the ever-present referee and national security adviser; Karl Rove, the hands-on political strategist; other key members of the White House staff and congressional leadership; and foreign leaders ranging from British Prime Minister Blair to Russian President Putin. ", " provides new details on the intelligence assessments of Iraq's alleged weapons of mass destruction and the planning for the war's aftermath."], "author": "Bob Woodward", "num_pages": "480", "awards": [], "places": ["United States of America"], "character_names": ["Colin Powell", "George W. Bush", "Karl Rove", "Condoleezza Rice", "Donald Rumsfeld", "George Tenet", "Tommy Franks"], "language": "English", "publish_date": "2004-10-11 00:00:00", "ISBN": "0743255488"},
{"url": "https://www.goodreads.com/book/show/3236297-war-journal", "num_ratings": "326", "num_reviews": "73", "avg_ratings": 4.25, "genres": ["Nonfiction", "War", "History", "Autobiography", "Memoir", "Writing", "Journalism", "War", "Military Fiction"], "title": "War Journal: My Five Years In Iraq", "description": ["Book by Engel, Richard"], "author": "Richard Engel", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-03 00:00:00", "ISBN": "1416563040"},
{"url": "https://www.goodreads.com/book/show/2081812.Intimate_Outsiders", "num_ratings": "18", "num_reviews": "1", "avg_ratings": 4.0, "genres": ["History", "Nonfiction"], "title": "Intimate Outsiders: The Harem in Ottoman and Orientalist Art and Travel Literature", "description": ["Until now, the notion of a cross-cultural dialogue has not figured in the analysis of harem paintings, largely because the Western fantasy of the harem has been seen as the archetype for Western appropriation of the Orient. In ", ", the art historian Mary Roberts brings to light a body of harem imagery that was created through a dynamic process of cultural ex", "Until now, the notion of a cross-cultural dialogue has not figured in the analysis of harem paintings, largely because the Western fantasy of the harem has been seen as the archetype for Western appropriation of the Orient. In ", ", the art historian Mary Roberts brings to light a body of harem imagery that was created through a dynamic process of cultural exchange. Roberts focuses on images produced by nineteenth-century European artists and writers who were granted access to harems in the urban centers of Istanbul and Cairo. As invited guests, these Europeans were “intimate outsiders” within the women’s quarters of elite Ottoman households. At the same time, elite Ottoman women were offered intimate access to European culture through their contact with these foreign travelers.Roberts draws on a range of sources, including paintings, photographs, and travelogues discovered in archives in Britain, Turkey, Egypt, and Denmark. She rethinks the influential harem works of the realist painter John Frederick Lewis, a British artist living in Cairo during the 1840s, whose works were granted an authoritative status by his British public despite the actual limits of his insider knowledge. Unlike Lewis, British women were able to visit Ottoman harems, and from the mid-nineteenth century on they did so in droves. Writing about their experiences in published travelogues, they undermined the idea that harems were the subject only of male fantasies. The elite Ottoman women who orchestrated these visits often challenged their guests’ misapprehensions about harem life, and a number of them exercised power as patrons, commissioning portraits from European artists. Their roles as art patrons defy the Western idea of the harem woman as passive odalisque."], "author": "Mary Roberts", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-12-10 00:00:00", "ISBN": "0822339676"},
{"url": "https://www.goodreads.com/book/show/737154.Medieval_Persia_1040_1797", "num_ratings": "31", "num_reviews": "2", "avg_ratings": 3.94, "genres": ["History", "Cultural", "Iran", "Historical", "Medieval", "Historical"], "title": "Medieval Persia 1040-1797", "description": ["The medieval period of Persia's remarkably continuous, history began with its conquest by the Muslim Arabs in the seventh century AD and gave way to the modern period at the end of the eighteenth century when the influence of the West became pervasive. Without an understanding of the confused legacy of these centuries, no-one can hope to understand the complexities and dyn", "The medieval period of Persia's remarkably continuous, history began with its conquest by the Muslim Arabs in the seventh century AD and gave way to the modern period at the end of the eighteenth century when the influence of the West became pervasive. Without an understanding of the confused legacy of these centuries, no-one can hope to understand the complexities and dynamism of modern Iran. Concise, clear and colourful, David Morgan's book is the best and most up-to-date short account of its subject in the English language."], "author": "David Morgan", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1988-03-14 00:00:00", "ISBN": "0582493242"},
{"url": "https://www.goodreads.com/book/show/6107.The_Middle_Sea", "num_ratings": "747", "num_reviews": "73", "avg_ratings": 3.87, "genres": ["History", "Nonfiction", "History", "European History", "Cultural", "Italy", "History", "Ancient History"], "title": "The Middle Sea: A History of the Mediterranean", "description": ["A one-volume narrative history of the Mediterranean from Ancient Egypt to 1919. Written in the racy, readable prose for which the author is famous, this is colourful, character-driven history at its most enjoyable.", "This magnificent undertaking tackles a vast subject — vast in time (from the oldest surviving pyramid to the First World War); vast in geography (from Gibraltar", "A one-volume narrative history of the Mediterranean from Ancient Egypt to 1919. Written in the racy, readable prose for which the author is famous, this is colourful, character-driven history at its most enjoyable.", "This magnificent undertaking tackles a vast subject — vast in time (from the oldest surviving pyramid to the First World War); vast in geography (from Gibraltar to Jerusalem); and vast in culture, including as it does the civilizations of the Phoenicians, the Ancient Egyptians, Greece, Carthage, Rome, Byzantium, as well as the Borgias and the Medicis, Mohammed and El Cid, Napoleon and Nelson, Moslems, Jews and Christians.", " is not a dry record of facts; it is a rackety read about historical figures — dissolute Popes and wily Emperors, noble-hearted Generals and beautiful Princesses. But his greatest strength is naval and military history: from the Crusades to the expulsion of the Moors from Spain; from Trafalgar to Gallipoli. Towns are besieged and sacked, Kingdoms are won and lost. The narrative covers the glories of Constantinople and Venice, and the stirring history of the islands of the Mediterranean — Malta, Sicily, Crete and Cyprus.", " is the culmination of John Julius Norwich’s long and distinguished career as one of the greatest enthusiasts for anecdotal history, and the highways and byways of scholarship."], "author": "John Julius Norwich", "num_pages": "588", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-31 00:00:00", "ISBN": "0701176083"},
{"url": "https://www.goodreads.com/book/show/361184.The_Code_of_Hammurabi_King_of_Babylon", "num_ratings": "692", "num_reviews": "59", "avg_ratings": 3.45, "genres": ["History", "Classics", "Nonfiction", "Philosophy", "Law"], "title": "The Code of Hammurabi King of Babylon", "description": ["This book on the legal Code of Hammurabi was published only three years after the monument on which it was engraved was discovered. ", "This book on the legal Code of Hammurabi was published only three years after the monument on which it was engraved was discovered. "], "author": "Hammurabi", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-01 00:00:00", "ISBN": "1410201023"},
{"url": "https://www.goodreads.com/book/show/733453.1967", "num_ratings": "303", "num_reviews": "34", "avg_ratings": 3.93, "genres": ["History", "Cultural", "Israel", "Nonfiction", "Politics"], "title": "1967: Israel, the War, and the Year that Transformed the Middle East", "description": [" ", "Tom Segev's acclaimed works One Palestine, Complete and The Seventh Million overturned accepted views of the history of Israel. Now, in ", "--a number-one bestseller in Hebrew--he brings his masterful skills to the watershed year when six", " ", "Tom Segev's acclaimed works One Palestine, Complete and The Seventh Million overturned accepted views of the history of Israel. Now, in ", "--a number-one bestseller in Hebrew--he brings his masterful skills to the watershed year when six days of war reshaped the country and the entire region.", "Going far beyond a military account, Segev re-creates the crisis in Israel before 1967, showing how economic recession, a full grasp of the Holocaust's horrors, and the dire threats made by neighbor states combined to produce a climate of apocalypse. He depicts the country's bravado after its victory, the mood revealed in a popular joke in which one soldier says to his friend, \"Let's take over Cairo\"; the friend replies, \"Then what shall we do in the afternoon?\"", "Drawing on unpublished letters and diaries, as well as government memos and military records, Segev reconstructs an era of new possibilities and tragic missteps. He introduces the legendary figures--Moshe Dayan, Golda Meir, Gamal Abdul Nasser, and Lyndon Johnson--and an epic cast of soldiers, lobbyists, refugees, and settlers. He reveals as never before Israel's intimacy with the White House as well as the political rivalries that sabotaged any chance of peace. Above all, he challenges the view that the war was inevitable, showing that a series of disastrous miscalculations lie behind the bloodshed.", "A vibrant and original history, ", " is sure to stand as the definitive account of that pivotal year.", " "], "author": "Tom Segev", "num_pages": "688", "awards": ["Jewish Quarterly-Wingate Prize Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-29 00:00:00", "ISBN": "0805070575"},
{"url": "https://www.goodreads.com/book/show/2320562.1948", "num_ratings": "516", "num_reviews": "51", "avg_ratings": 4.11, "genres": ["History", "Cultural", "Israel", "Nonfiction", "War", "Politics"], "title": "1948: The First Arab-Israeli War", "description": ["This history of the foundational war in the Arab-Israeli conflict is groundbreaking, objective, and deeply revisionist. A riveting account of the military engagements, it also focuses on the war's political dimensions. Benny Morris probes the motives and aims of the protagonists on the basis of newly opened Israeli and Western documentation. The Arab side—where the archive", "This history of the foundational war in the Arab-Israeli conflict is groundbreaking, objective, and deeply revisionist. A riveting account of the military engagements, it also focuses on the war's political dimensions. Benny Morris probes the motives and aims of the protagonists on the basis of newly opened Israeli and Western documentation. The Arab side—where the archives are still closed—is illuminated with the help of intelligence and diplomatic materials.", "Morris stresses the ", " character of the two-stage Arab assault on the Jewish community in Palestine. Throughout, he examines the dialectic between the war's military and political developments and highlights the military impetus in the creation of the refugee problem, which was a by-product of the disintegration of Palestinian Arab society. The book thoroughly investigates the role of the Great Powers—Britain, the United States, and the Soviet Union—in shaping the conflict and its tentative termination in 1949. Morris looks both at high politics and general staff decision-making processes and at the nitty-gritty of combat in the successive battles that resulted in the emergence of the State of Israel and the humiliation of the Arab world, a humiliation that underlies the continued Arab antagonism toward Israel.", " "], "author": "Benny Morris", "num_pages": "524", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "0300126964"},
{"url": "https://www.goodreads.com/book/show/12121296-a-line-in-the-sand", "num_ratings": "1,199", "num_reviews": "111", "avg_ratings": 4.07, "genres": ["History", "Nonfiction", "Politics", "War", "Cultural", "France", "History", "European History", "Historical", "War", "World War I", "European Literature", "British Literature", "War", "Military Fiction"], "title": "A Line in the Sand: Britain, France and the Struggle for the Mastery of the Middle East", "description": ["Through a stellar cast of politicians, diplomats, spies and soldiers - including T.E. Lawrence, Winston Churchill and Charles de Gaulle - 'A Line in the Sand' tells the story of the short but crucial era when Britain and France ruled the Middle East."], "author": "James   Barr", "num_pages": "454", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-15 00:00:00", "ISBN": "1847374530"},
{"url": "https://www.goodreads.com/book/show/569407.The_Middle_East", "num_ratings": "1,650", "num_reviews": "118", "avg_ratings": 3.76, "genres": ["History", "Nonfiction", "Politics", "Religion"], "title": "The Middle East", "description": ["In a sweeping and vivid survey, renowned historian Bernard Lewis charts the history of the Middle East over the last 2,000 years, from the birth of Christianity through the modern era, focusing on the successive transformations that have shaped it.", "Drawing on material from a multitude of sources, including the work of archaeologists and scholars, Lewis chronologically trace", "In a sweeping and vivid survey, renowned historian Bernard Lewis charts the history of the Middle East over the last 2,000 years, from the birth of Christianity through the modern era, focusing on the successive transformations that have shaped it.", "Drawing on material from a multitude of sources, including the work of archaeologists and scholars, Lewis chronologically traces the political, economical, social, and cultural development of the Middle East, from Hellenization in antiquity to the impact of westernization on Islamic culture. Meticulously researched, this enlightening narrative explores the patterns of history that have repeated themselves in the Middle East.", "From the ancient conflicts to the current geographical and religious disputes between the Arabs and the Israelis, Lewis examines the ability of this region to unite and solve its problems and asks if, in the future, these unresolved conflicts will ultimately lead to the ethnic and cultural factionalism that tore apart the former Yugoslavia.", "Elegantly written, scholarly yet accessible, ", "is the most comprehensive single volume history of the region ever written from the world’s foremost authority on the Middle East."], "author": "Bernard Lewis", "num_pages": "448", "awards": ["National Book Critics Circle Award Nominee for General Nonfiction (1996)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-08-07 00:00:00", "ISBN": "0684832801"},
{"url": "https://www.goodreads.com/book/show/13623874-mossad", "num_ratings": "6,394", "num_reviews": "533", "avg_ratings": 4.15, "genres": ["Nonfiction", "History", "Spy Thriller", "Espionage", "Politics", "Cultural", "Israel", "War", "Military Fiction"], "title": "Mossad: The Greatest Missions of the Israeli Secret Service", "description": ["The Mossad is widely recognized today as the best intelligence service in the world. It is also the most enigmatic, shrouded in secrecy. Mossad: The Greatest Missions of the Israeli Secret Service unveils the defi ning and most dangerous operations that have shaped Israel and the world at large from the agency's more than sixty-year history, among them: the capture of Adol", "The Mossad is widely recognized today as the best intelligence service in the world. It is also the most enigmatic, shrouded in secrecy. Mossad: The Greatest Missions of the Israeli Secret Service unveils the defi ning and most dangerous operations that have shaped Israel and the world at large from the agency's more than sixty-year history, among them: the capture of Adolf Eichmann, the eradication of Black September, the destruction of the Syrian nuclear facility, and the elimination of key Iranian nuclear scientists.", "Through intensive research and exclusive interviews with Israeli leaders and Mossad agents, authors Michael Bar-Zohar and Nissim Mishal re-create these missions in riveting detail, vividly bringing to life the heroic operatives who risked everything in the face of unimaginable danger. In the words of Shimon Peres, president of Israel, this gripping, white-knuckle read \"tells what should have been known and isn't--that Israel's hidden force is as formidable as its recognized physical strength.\""], "author": "Michael Bar-Zohar", "num_pages": "388", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-06 00:00:00", "ISBN": "0062123408"},
{"url": "https://www.goodreads.com/book/show/89481.A_History_of_the_Middle_East", "num_ratings": "751", "num_reviews": "85", "avg_ratings": 3.8, "genres": ["History", "Nonfiction", "Politics"], "title": "A History of the Middle East", "description": ["Over the centuries, the Middle East has confounded the dreams of conquerors and peacemakers alike. In this classic work, Peter Mansfield follows the historic struggle of the region over the last two hundred years. This new edition updates recent developments in the Middle East, including the turbulent events in Afghanistan, the troubled relationship between the U.S. and Ir", "Over the centuries, the Middle East has confounded the dreams of conquerors and peacemakers alike. In this classic work, Peter Mansfield follows the historic struggle of the region over the last two hundred years. This new edition updates recent developments in the Middle East, including the turbulent events in Afghanistan, the troubled relationship between the U.S. and Iraq, the continuing Arab-Israeli conflict, and the rise of Islamic Jihad. Incisive and illuminating, ", " is essential reading for anyone wishing to understand what is perhaps the most crucial and volatile nerve center of the modern world."], "author": "Peter Mansfield", "num_pages": "429", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-10-26 00:00:00", "ISBN": "0143034332"},
{"url": "https://www.goodreads.com/book/show/530114._Believing_Women_in_Islam", "num_ratings": "962", "num_reviews": "34", "avg_ratings": 4.23, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Feminism", "Gender", "History", "Womens", "Philosophy", "Spirituality", "Politics"], "title": "\"Believing Women\" in Islam: Unreading Patriarchal Interpretations of the Qur'an", "description": ["Does Islam call for the oppression of women? Non-Muslims point to the subjugation of women that occurs in many Muslim countries, especially those that claim to be \"Islamic,\" while many Muslims read the Qur'an in ways that seem to justify sexual oppression, inequality, and patriarchy. Taking a wholly different view, Asma Barlas develops a believer's reading of the Qur'an th", "Does Islam call for the oppression of women? Non-Muslims point to the subjugation of women that occurs in many Muslim countries, especially those that claim to be \"Islamic,\" while many Muslims read the Qur'an in ways that seem to justify sexual oppression, inequality, and patriarchy. Taking a wholly different view, Asma Barlas develops a believer's reading of the Qur'an that demonstrates the radically egalitarian and antipatriarchal nature of its teachings.", "Beginning with a historical analysis of religious authority and knowledge, Barlas shows how Muslims came to read inequality and patriarchy into the Qur'an to justify existing religious and social structures and demonstrates that the patriarchal meanings ascribed to the Qur'an are a function of who has read it, how, and in what contexts. She goes on to reread the Qur'an's position on a variety of issues in order to argue that its teachings do not support patriarchy. To the contrary, Barlas convincingly asserts that the Qur'an affirms the complete equality of the sexes, thereby offering an opportunity to theorize radical sexual equality from within the framework of its teachings. This new view takes readers into the heart of Islamic teachings on women, gender, and patriarchy, allowing them to understand Islam through its most sacred scripture, rather than through Muslim cultural practices or Western media stereotypes."], "author": "Asma Barlas", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-06-01 00:00:00", "ISBN": "0292709048"},
{"url": "https://www.goodreads.com/book/show/32620356-daring-to-drive", "num_ratings": "3,030", "num_reviews": "486", "avg_ratings": 4.32, "genres": ["Nonfiction", "Autobiography", "Memoir", "Feminism", "Biography", "Biography Memoir"], "title": "Daring to Drive: A Saudi Woman's Awakening", "description": ["A ferociously intimate memoir by a devout woman from a modest family in Saudi Arabia who became the unexpected leader of a courageous movement to support women’s right to drive.", "Manal al-Sharif grew up in Mecca the second daughter of a taxi driver, born the year fundamentalism took hold. In her adolescence, she was a religious radical, melting her brother’s boy band cassett", "A ferociously intimate memoir by a devout woman from a modest family in Saudi Arabia who became the unexpected leader of a courageous movement to support women’s right to drive.", "Manal al-Sharif grew up in Mecca the second daughter of a taxi driver, born the year fundamentalism took hold. In her adolescence, she was a religious radical, melting her brother’s boy band cassettes in the oven because music was ", ": forbidden by Islamic law. But what a difference an education can make. By her twenties she was a computer security engineer, one of few women working in a desert compound that resembled suburban America. That’s when the Saudi kingdom’s contradictions became too much to bear: she was labeled a slut for chatting with male colleagues, her teenage brother chaperoned her on a business trip, and while she kept a car in her garage, she was forbidden from driving down city streets behind the wheel.", " is the fiercely intimate memoir of an accidental activist, a powerfully vivid story of a young Muslim woman who stood up to a kingdom of men—and won. Writing on the cusp of history, Manal offers a rare glimpse into the lives of women in Saudi Arabia today. Her memoir is a remarkable celebration of resilience in the face of tyranny, the extraordinary power of education and female solidarity, and the difficulties, absurdities, and joys of making your voice heard."], "author": "Manal Al-Sharif", "num_pages": "289", "awards": ["Goodreads Choice Award Nominee for Memoir & Autobiography (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-13 00:00:00", "ISBN": "1476793026"},
{"url": "https://www.goodreads.com/book/show/122977.An_Enduring_Love", "num_ratings": "1,053", "num_reviews": "145", "avg_ratings": 3.71, "genres": ["Biography", "Cultural", "Iran", "Nonfiction", "Autobiography", "Memoir", "History"], "title": "An Enduring Love: My Life with the Shah", "description": ["At the age of twenty-one, Farah Diba married the Shah of Iran, Mohammed Reza Shah Pahlavi. A loving marriage, the raising of four children, and a devotion to social and cultural causes marked her early years as queen, although there were already signs of grave national diversions on the horizon.", "Twenty years l", "At the age of twenty-one, Farah Diba married the Shah of Iran, Mohammed Reza Shah Pahlavi. A loving marriage, the raising of four children, and a devotion to social and cultural causes marked her early years as queen, although there were already signs of grave national diversions on the horizon.", "Twenty years later the dream had turned into a nightmare: demonstrations and riots shook the country, and Farah and the Shah decided to leave in order to avoid bloodshed. With the hardcover publication of ", ", a ", " bestseller (extended list) in 2004, Farah Diba, wife of the last emperor of Iran, broke her silence and told the wrenching story of her love for a man and his country. Her compelling memoir offers an intimate view of a time of upheaval, but stands above all as a powerful human document from one whose life was caught up in an epic and tragic national struggle."], "author": "Farah Pahlavi", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-06 00:00:00", "ISBN": "1401359612"},
{"url": "https://www.goodreads.com/book/show/18490563-headscarves-and-hymens", "num_ratings": "2,143", "num_reviews": "343", "avg_ratings": 4.13, "genres": ["Nonfiction", "Feminism", "Politics", "Religion", "Religion", "Islam"], "title": "Headscarves and Hymens: Why the Middle East Needs a Sexual Revolution", "description": ["A passionate manifesto decrying misogyny in the Arab world, by an Egyptian American journalist and activist When the Egyptian journalist Mona Eltahawy published an article in Foreign Policy magazine in 2012 titled Why Do They Hate Us it provoked a firestorm of controversy. The response it generated, with more than four thousand posts on the website, broke all records for t", "A passionate manifesto decrying misogyny in the Arab world, by an Egyptian American journalist and activist When the Egyptian journalist Mona Eltahawy published an article in Foreign Policy magazine in 2012 titled Why Do They Hate Us it provoked a firestorm of controversy. The response it generated, with more than four thousand posts on the website, broke all records for the magazine, prompted dozens of follow-up interviews on radio and television, and made it clear that misogyny in the Arab world is an explosive issue, one that engages and often enrages the public. In Headscarves and Hymens, Eltahawy takes her argument further. Drawing on her years as a campaigner and commentator on womens issues in the Middle East, she explains that since the Arab Spring began, women in the Arab world have had two revolutions to undertake one fought with men against oppressive regimes, and another fought against an entire political and economic system that treats women in countries from Yemen and Saudi Arabia to Egypt, Tunisia, and Libya as second-class citizens. Eltahawy has traveled across the Middle East and North Africa, meeting with women and listening to their stories. Her book is a plea for outrage and action on their behalf, confronting the toxic mix of culture and religion that few seem willing or able to disentangle lest they blaspheme or offend. A manifesto motivated by hope and fury in equal measure, Headscarves and Hymens is as illuminating as it is incendiary."], "author": "Mona Eltahawy", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-21 00:00:00", "ISBN": "0865478031"},
{"url": "https://www.goodreads.com/book/show/57540.The_Ethnic_Cleansing_of_Palestine", "num_ratings": "1,762", "num_reviews": "187", "avg_ratings": 4.39, "genres": ["History", "Nonfiction", "Politics"], "title": "The Ethnic Cleansing of Palestine", "description": ["Since the Holocaust, it has been almost impossible to hide large-scale crimes against humanity. In our communicative world, few modern catastrophes are concealed from the public eye. And yet, Ilan Pappe unveils, one such crime has been erased from the global public memory: the ethnic cleansing of the Palestinians in 1948. But why is it denied, and by whom? The Ethnic Clean", "Since the Holocaust, it has been almost impossible to hide large-scale crimes against humanity. In our communicative world, few modern catastrophes are concealed from the public eye. And yet, Ilan Pappe unveils, one such crime has been erased from the global public memory: the ethnic cleansing of the Palestinians in 1948. But why is it denied, and by whom? The Ethnic Cleansing of Palestine offers an investigation of this mystery."], "author": "Ilan Pappé", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-02 00:00:00", "ISBN": "1851684670"},
{"url": "https://www.goodreads.com/book/show/516902.Meena_Heroine_of_Afghanistan", "num_ratings": "318", "num_reviews": "39", "avg_ratings": 4.13, "genres": ["Nonfiction", "Biography", "Feminism", "Politics", "History", "Womens"], "title": "Meena, Heroine of Afghanistan: The Martyr Who Founded RAWA, the Revolutionary Association of the Women of Afghanistan", "description": ["The unforgettable story of how one woman dared to start a revolution. Meena founded RAWA in 1977 as a twenty-year-old Kabul University student. She was assassinated in 1987 at age thirty but lives on in the hearts of all progressive Muslim women. Her voice, speaking for freedom, has never been silenced. The compelling story of Meena's struggle for democracy and women's rig", "The unforgettable story of how one woman dared to start a revolution. Meena founded RAWA in 1977 as a twenty-year-old Kabul University student. She was assassinated in 1987 at age thirty but lives on in the hearts of all progressive Muslim women. Her voice, speaking for freedom, has never been silenced. The compelling story of Meena's struggle for democracy and women's rights in Afghanistan will inspire young women the world over."], "author": "Melody Ermachild Chavis", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-10-01 00:00:00", "ISBN": "0312306903"},
{"url": "https://www.goodreads.com/book/show/177343.Forgotten_Queens_of_Islam", "num_ratings": "370", "num_reviews": "38", "avg_ratings": 3.78, "genres": ["Religion", "Islam", "History", "Nonfiction", "Feminism", "Religion"], "title": "Forgotten Queens of Islam", "description": ["Mernissi recounts the extraordinary stories of fifteen queens and reflects on the implications for the ways in which politics is practiced in Islam today, a world in which women are largely excluded form the political domain."], "author": "Fatema Mernissi", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-07-30 00:00:00", "ISBN": "0816624399"},
{"url": "https://www.goodreads.com/book/show/4100352-the-arabs", "num_ratings": "2,176", "num_reviews": "243", "avg_ratings": 4.29, "genres": ["History", "Nonfiction", "Politics", "Religion", "Islam", "Religion", "History", "World History", "War", "Historical", "Audiobook", "Cultural", "Asia"], "title": "The Arabs: A History", "description": ["To American observers, the Arab world often seems little more than a distant battleground characterized by religious zealotry and political chaos. Years of tone-deaf US policies have left the region powerless to control its own destiny—playing into a longstanding sense of shame and impotence for a once-mighty people. In this definitive account, preeminent historian Eugene", "To American observers, the Arab world often seems little more than a distant battleground characterized by religious zealotry and political chaos. Years of tone-deaf US policies have left the region powerless to control its own destiny—playing into a longstanding sense of shame and impotence for a once-mighty people. In this definitive account, preeminent historian Eugene Rogan traces five centuries of Arab history, from the Ottoman conquests through the British and French colonial periods and up to the present age of unipolar American hegemony. The Arab world is now more acutely aware than ever of its own vulnerability, and this sense of subjection carries with it vast geopolitical consequences.", "Drawing from Arab sources little known to Western readers, Rogan's ", " will transform our understanding of the past, present, and future of one of the world's most tumultuous regions."], "author": "Eugene Rogan", "num_pages": "513", "awards": [], "places": ["Middle East"], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "0465071007"},
{"url": "https://www.goodreads.com/book/show/128939.The_Persian_Puzzle", "num_ratings": "439", "num_reviews": "36", "avg_ratings": 3.82, "genres": ["Cultural", "Iran", "History", "Nonfiction", "Politics", "Political Science", "International Relations"], "title": "The Persian Puzzle: The Conflict Between Iran and America", "description": ["In his highly influential book ", ", bestselling author Kenneth Pollack both informed and defined the national debate about Iraq. Now, in ", ", published to coincide with the twenty-fifth anniversary of the Iran hostage crisis, he examines the behind-the-scenes story of the tumultuous relationship between Iran and the United States, and weigh", "In his highly influential book ", ", bestselling author Kenneth Pollack both informed and defined the national debate about Iraq. Now, in ", ", published to coincide with the twenty-fifth anniversary of the Iran hostage crisis, he examines the behind-the-scenes story of the tumultuous relationship between Iran and the United States, and weighs options for the future.", "Here Pollack, a former CIA analyst and National Security Council official, brings his keen analysis and insider perspective to the long and ongoing clash between the United States and Iran, beginning with the fall of the shah and the seizure of the American embassy in Tehran in 1979. Pollack examines all the major events in U.S.-Iran relations–including the hostage crisis, the U.S. tilt toward Iraq during the Iran-Iraq war, the Iran-Contra scandal, American-Iranian military tensions in 1987 and 1988, the covert Iranian war against U.S. interests in the Persian Gulf that culminated in the 1996 Khobar Towers terrorist attack in Saudi Arabia, and recent U.S.-Iran skirmishes over Afghanistan and Iraq. ", "He explains the strategies and motives from American and Iranian perspectives and tells how each crisis colored the thinking of both countries’ leadership as they shaped and reshaped their policies over time. Pollack also describes efforts by moderates of various stripes to try to find some way past animosities to create a new dynamic in Iranian-American relations, only to find that when one side was ready for such a step, the other side fell short.", "With balanced tone and insight, Pollack explains how the United States and Iran reached this impasse; why this relationship is critical to regional, global, and U.S. interests; and what basic political choices are available as we deal with this important but deeply troubled country."], "author": "Kenneth M. Pollack", "num_pages": "576", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-09 00:00:00", "ISBN": "0812973364"},
{"url": "https://www.goodreads.com/book/show/128112.Cobra_II", "num_ratings": "1,671", "num_reviews": "116", "avg_ratings": 3.93, "genres": ["History", "Nonfiction", "War", "Military Fiction", "Military", "Military History", "War", "Politics"], "title": "Cobra II: The Inside Story of the Invasion and Occupation of Iraq", "description": ["Written by the chief military correspondent of the ", "and a prominent retired Marine general, this is the definitive account of the invasion of Iraq.A stunning work of investigative journalism, ", "describes in riveting detail how the American rush to Baghdad provided the opportunity for the virulent insurgency that followed. As Gordon and Trainor show, th", "Written by the chief military correspondent of the ", "and a prominent retired Marine general, this is the definitive account of the invasion of Iraq.A stunning work of investigative journalism, ", "describes in riveting detail how the American rush to Baghdad provided the opportunity for the virulent insurgency that followed. As Gordon and Trainor show, the brutal aftermath was not inevitable and was a surprise to the generals on both sides. Based on access to unseen documents and exclusive interviews with the men and women at the heart of the war, ", " provides firsthand accounts of the fighting on the ground and the high-level planning behind the scenes. Now with a new afterword that addresses what transpired after the fateful events of the summer of 2003, this is a peerless re-creation and analysis of the central event of our times."], "author": "Michael R. Gordon", "num_pages": "640", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-03-14 00:00:00", "ISBN": "0375422625"},
{"url": "https://www.goodreads.com/book/show/2385463.Daughter_of_Persia", "num_ratings": "1,447", "num_reviews": "178", "avg_ratings": 4.06, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "History", "Cultural", "Iran"], "title": "Daughter of Persia: A Woman's Journey From Her Father's Harem Through the Islamic Revolution", "description": ["An intimate and honest chronicle of the everyday life of Iranian women over the past century", "“A lesson about the value of personal freedom and what happens to a nation when its people are denied the right to direct their own destiny. This is a book Americans should read.” —", "The fifteenth of thirty-six children, Sattareh Farman Farmaian was born in Iran in 1921", "An intimate and honest chronicle of the everyday life of Iranian women over the past century", "“A lesson about the value of personal freedom and what happens to a nation when its people are denied the right to direct their own destiny. This is a book Americans should read.” —", "The fifteenth of thirty-six children, Sattareh Farman Farmaian was born in Iran in 1921 to a wealthy and powerful shazdeh, or prince, and spent a happy childhood in her father’s Tehran harem. Inspired and empowered by his ardent belief in education, she defied tradition by traveling alone at the age of twenty-three to the United States to study at the University of Southern California. Ten years later, she returned to Tehran and founded the first school of social work in Iran.", "Intertwined with Sattareh’s personal story is her unique perspective on the Iranian political and social upheaval that have rocked Iran throughout the twentieth century, from the 1953 American-backed coup that toppled democratic premier Mossadegh to the brutal regime of the Shah and Ayatollah Khomeini’s fanatic and anti-Western Islamic Republic. In 1979, after two decades of tirelessly serving Iran’s neediest, Sattareh was arrested as a counterrevolutionary and branded an imperialist by Ayatollah Khomeini’s radical students.", " is the remarkable story of a woman and a nation in the grip of profound change."], "author": "Sattareh Farman Farmaian", "num_pages": "432", "awards": [], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": [], "language": "English", "publish_date": "2006-06-27 00:00:00", "ISBN": "0385468660"},
{"url": "https://www.goodreads.com/book/show/6106.A_Short_History_of_Byzantium", "num_ratings": "1,772", "num_reviews": "153", "avg_ratings": 4.09, "genres": ["History", "Nonfiction", "History", "Medieval History", "Historical", "Medieval"], "title": "A Short History of Byzantium", "description": ["\"Norwich is always on the lookout for the small but revealing details. . . . All of this he recounts in a style that consistently entertains.\" ", "--", "In this magisterial adaptation of his epic three-volume history of Byzantium, John Julius Norwich chronicles the world's longest-lived Christian empire. Beginning with Constantine the Great, who in a", "\"Norwich is always on the lookout for the small but revealing details. . . . All of this he recounts in a style that consistently entertains.\" ", "--", "In this magisterial adaptation of his epic three-volume history of Byzantium, John Julius Norwich chronicles the world's longest-lived Christian empire. Beginning with Constantine the Great, who in a.d. 330 made Christianity the religion of his realm and then transferred its capital to the city that would bear his name, Norwich follows the course of eleven centuries of Byzantine statecraft and warfare, politics and theology, manners and art.", "In the pages of ", " we encounter mystics and philosophers, eunuchs and barbarians, and rulers of fantastic erudition, piety, and degeneracy. We enter the life of an empire that could create some of the world's most transcendent religious art and then destroy it in the convulsions of fanaticism. Stylishly written and overflowing with drama, pathos, and wit, here is a matchless account of a lost civilization and its magnificent cultural legacy.", "\"Strange and fascinating . . . filled with drollery and horror.\"                          ", "--"], "author": "John Julius Norwich", "num_pages": "496", "awards": [], "places": ["Byzantium"], "character_names": [], "language": "English", "publish_date": "1998-12-29 00:00:00", "ISBN": "0679772693"},
{"url": "https://www.goodreads.com/book/show/77083.Longitudes_and_Attitudes", "num_ratings": "2,215", "num_reviews": "156", "avg_ratings": 3.63, "genres": ["Nonfiction", "Politics", "History"], "title": "Longitudes and Attitudes: Exploring the World After September 11", "description": ["As the Foreign Affairs columnist for the ", ", Thomas L. Friedman is in a unique position to interpret the world for American readers. Twice a week, Friedman's celebrated commentary provides the most trenchant, pithy,and illuminating", "As the Foreign Affairs columnist for the ", ", Thomas L. Friedman is in a unique position to interpret the world for American readers. Twice a week, Friedman's celebrated commentary provides the most trenchant, pithy,and illuminating perspective in journalism.", " contains the columns Friedman has published about the most momentous news story of our time, as well as a diary of his experiences and reactions during this period of crisis. As the author writes, the book is \"not meant to be a comprehensive study of September 11 and all the factors that went into it. Rather, my hope is that it will constitute a 'word album' that captures and preserves the raw, unpolished, emotional and analytical responses that illustrate how I, and others, felt as we tried to grapple with September and its aftermath, as they were unfolding.\"", "Readers have repeatedly said that Friedman has expressed the essence of their own feelings, helping them not only by explaining who \"they\" are, but also by reassuring us about who \"we\" are. More than any other journalist writing, Friedman gives voice to America's awakening sense of its role in a changed world."], "author": "Thomas L. Friedman", "num_pages": "224", "awards": ["Dorothy Lee Award for Outstanding Scholarship in the Ecology of Culture (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-09-11 00:00:00", "ISBN": "0374190666"},
{"url": "https://www.goodreads.com/book/show/64536.The_First_Crusade", "num_ratings": "1,109", "num_reviews": "94", "avg_ratings": 4.11, "genres": ["History", "Nonfiction", "Religion", "Historical", "Medieval", "History", "Medieval History"], "title": "The First Crusade: A New History", "description": ["On the last Tuesday of November 1095, Pope Urban II delivered an electrifying speech that launched the First Crusade. His words set Christendom afire. Some 100,000 men, from knights to paupers, took up the call--the largest mobilization of manpower since the fall of the Roman Empire.", " Now, in ", ", Thomas Asbridge offers a gripping account of a titanic three-ye", "On the last Tuesday of November 1095, Pope Urban II delivered an electrifying speech that launched the First Crusade. His words set Christendom afire. Some 100,000 men, from knights to paupers, took up the call--the largest mobilization of manpower since the fall of the Roman Empire.", " Now, in ", ", Thomas Asbridge offers a gripping account of a titanic three-year adventure filled with miraculous victories, greedy princes and barbarity on a vast scale. Readers follow the crusaders from their mobilization in Europe (where great waves of anti-Semitism resulted in the deaths of thousands of Jews), to their arrival in Constantinople, an exotic, opulent city--ten times the size of any city in Europe--that bedazzled the Europeans. Featured in vivid detail are the siege of Nicaea and the pivotal battle for Antioch, the single most important military engagement of the entire expedition, where the crusaders, in desperate straits, routed a larger and better-equipped Muslim army. Through all this, the crusaders were driven on by intense religious devotion, convinced that their struggle would earn them the reward of eternal paradise in Heaven. But when a hardened core finally reached Jerusalem in 1099 they unleashed an unholy wave of brutality, slaughtering thousands of Muslims--men, women, and children--all in the name of Christianity.", " The First Crusade marked a watershed in relations between Islam and the West, a conflict that set these two world religions on a course toward deep-seated animosity and enduring enmity. The chilling reverberations of this earth-shattering clash still echo in the world today."], "author": "Thomas Asbridge", "num_pages": "408", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-29 00:00:00", "ISBN": "0195189051"},
{"url": "https://www.goodreads.com/book/show/675.Sailing_from_Byzantium", "num_ratings": "643", "num_reviews": "92", "avg_ratings": 3.86, "genres": ["History", "Nonfiction", "Historical", "Medieval", "History", "Ancient History", "History", "Medieval History", "Cultural", "Russia", "Religion", "Islam", "Travel", "Literature", "Audiobook"], "title": "Sailing from Byzantium: How a Lost Empire Shaped the World", "description": ["A gripping intellectual adventure story, Sailing from Byzantium sweeps you from the deserts of Arabia to the dark forests of northern Russia, from the colorful towns of Renaissance Italy to the final moments of a millennial city under siege.... ", "Byzantium: the successor of Greece and Rome, this magnificent empire bridged the ancient and modern worlds for more than a thousan", "A gripping intellectual adventure story, Sailing from Byzantium sweeps you from the deserts of Arabia to the dark forests of northern Russia, from the colorful towns of Renaissance Italy to the final moments of a millennial city under siege.... ", "Byzantium: the successor of Greece and Rome, this magnificent empire bridged the ancient and modern worlds for more than a thousand years. Without Byzantium, the works of Homer and Herodotus, Plato and Aristotle, Sophocles and Aeschylus, would never have survived. Yet very few of us have any idea of the enormous debt we owe them. ", "The story of Byzantium is a real-life adventure of electrifying ideas, high drama, colorful characters, and inspiring feats of daring. In Sailing from Byzantium, Colin Wells tells of the missionaries, mystics, philosophers, and artists who against great odds and often at peril of their own lives spread Greek ideas to the Italians, the Arabs, and the Slavs. ", "Their heroic efforts inspired the Renaissance, the golden age of Islamic learning, and Russian Orthodox Christianity, which came complete with a new alphabet, architecture, and one of the world's greatest artistic traditions. ", "The story's central reference point is an arcane squabble called the Hesychast controversy that pitted humanist scholars led by the brilliant, acerbic intellectual Barlaam against the powerful monks of Mount Athos led by the stern Gregory Palamas, who denounced \"pagan\" rationalism in favor of Christian mysticism. ", "Within a few decades, the light of Byzantium would be extinguished forever by the invading Turks, but not before the humanists found a safe haven for Greek literature. The controversy of rationalism versus faith would continue to be argued by some of history's greatest minds. ", "Fast-paced, compulsively readable, and filled with fascinating insights, Sailing from Byzantium is one of the great historical dramas-the gripping story of how the flame of civilization was saved and passed on."], "author": "Colin  Wells", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-25 00:00:00", "ISBN": "0553803816"},
{"url": "https://www.goodreads.com/book/show/43378.A_Long_Short_War", "num_ratings": "382", "num_reviews": "23", "avg_ratings": 3.71, "genres": ["Politics", "History", "Nonfiction", "War", "Writing", "Essays"], "title": "A Long Short War: The Postponed Liberation of Iraq", "description": ["One of our most respected and controversial liberal thinkers makes the case for war in Iraq. Written in his trademark contrarian voice, Untitled on Iraq is comprised of Hitchens' essays on the justification for war in Iraq and other related issues written for Slate.com, The Wall Street Journal, The Nation, and more, as well as 25% new material on the war"], "author": "Christopher Hitchens", "num_pages": "112", "awards": [], "places": ["Baghdad", "Basra", "Dearborn, Michigan", "Iraqi Kurdistan", "Kosovo", "Kuwait City", "Safwan", "Al-Shifa pharmaceutical factory"], "character_names": ["Bill Clinton", "George W. Bush", "Paul Wolfowitz", "Osama Bin Laden", "Jimmy Carter", "Tony Blair", "Henry Kissinger", "Idi Amin", "Al Gore", "Christopher Hitchens", "Saddam Hussein", "Graydon Carter", "Kim Jong-il", "Jacques Chirac", "Scott Ritter", "Barham Salih", "Hans Blix", "Abu Nidal", "Ahmed Chalabi"], "language": "English", "publish_date": "2003-06-03 00:00:00", "ISBN": "0452284988"},
{"url": "https://www.goodreads.com/book/show/6535361-from-veils-to-thongs", "num_ratings": "12", "num_reviews": "0", "avg_ratings": 3.75, "genres": [], "title": "From Veils to Thongs: An Arab Chick's Survival Guide to Balancing One's Ethnic Identity in America", "description": ["Arabic women deal with very serious issues that they often feel powerless to change. Western women are raised to be extremely assertive and even fight for her rights. One who is both Arab and American is very often, very confused. Her one foot is planted firmly in a traditional world whose cultural rules haven't changed in over 2,000 years. Her other foot is skidding on a", "Arabic women deal with very serious issues that they often feel powerless to change. Western women are raised to be extremely assertive and even fight for her rights. One who is both Arab and American is very often, very confused. Her one foot is planted firmly in a traditional world whose cultural rules haven't changed in over 2,000 years. Her other foot is skidding on a thin piece of ice, the mega-liberal free-for-all, called America. And she is trying to balance walking on both. This hilarious, lighthearted survival guide explains how to retain one's sanity in the battle of the ultimate culture clash, and offers hilarious explanations as to why we have absurd cultural rules such as arranged marriages.", "Best of all, Westerners not only finally have a practical tool in which to better understand us and our wacky ways, but they too, can find answers. Like us, many Americans are struggling in this escalating socio-political cultural war. They are torn between conservatism and liberalism, tradition and progression, fidelity and fun, flats and pumps", "It's hard to balance it all. It really is.", "Contrasting Eastern traditions with Western ideas, V2T explains how to function when one's conservative ethnic side is at war with their liberal Western side."], "author": "Dalel B. Khalil", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-12-30 00:00:00", "ISBN": "059548168X"},
{"url": "https://www.goodreads.com/book/show/6403648-things-i-ve-been-silent-about", "num_ratings": "3,366", "num_reviews": "486", "avg_ratings": 3.65, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Iran", "Biography", "Biography Memoir"], "title": "Things I've Been Silent About: Memories of a Prodigal Daughter", "description": ["In this stunning personal story of growing up in Iran, Azar Nafisi shares her memories of living in thrall to a powerful and complex mother against the backdrop of a country’s political revolution. A girl’s pain over family secrets, a young woman’s discovery of the power of sensuality in literature, the price a family pays for freedom in a country beset by upheaval—these a", "In this stunning personal story of growing up in Iran, Azar Nafisi shares her memories of living in thrall to a powerful and complex mother against the backdrop of a country’s political revolution. A girl’s pain over family secrets, a young woman’s discovery of the power of sensuality in literature, the price a family pays for freedom in a country beset by upheaval—these and other threads are woven together in this beautiful memoir as a gifted storyteller once again transforms the way we see the world and “reminds us of why we read in the first place” (Newsday)."], "author": "Azar Nafisi", "num_pages": "368", "awards": [], "places": ["Iran, Islamic Republic of", "Tehran"], "character_names": [], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "0812973909"},
{"url": "https://www.goodreads.com/book/show/6818019-i-am-nujood-age-10-and-divorced", "num_ratings": "16,401", "num_reviews": "2,415", "avg_ratings": 3.8, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Feminism"], "title": "I Am Nujood, Age 10 and Divorced", "description": [" ", "Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's han", " ", "Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's hands and of her daring escape. With the help of local advocates and the press, Nujood obtained her freedom—an extraordinary achievement in Yemen, where almost half of all girls are married under the legal age. Nujood's courageous defiance of both Yemeni customs and her own family has inspired other young girls in the Middle East to challenge their marriages. Hers is an unforgettable story of tragedy, triumph, and courage."], "author": "Nujood Ali", "num_pages": "188", "awards": [], "places": ["Yemen"], "character_names": [], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "0307589676"},
{"url": "https://www.goodreads.com/book/show/8683060-people-like-us", "num_ratings": "3,370", "num_reviews": "154", "avg_ratings": 4.12, "genres": ["Nonfiction", "Writing", "Journalism", "Politics", "History"], "title": "People Like Us: Misrepresenting the Middle East", "description": ["Originally published in the Netherlands in 2006 (", "), Luyendijk reports on his experiences as a news correspondent in the Middle East. This book quickly became a bestseller in the Netherlands and has been translated into many languages (see Luyendijk's website for details: ", "). ", "English translation copyright 2009.", "UK-English editio", "Originally published in the Netherlands in 2006 (", "), Luyendijk reports on his experiences as a news correspondent in the Middle East. This book quickly became a bestseller in the Netherlands and has been translated into many languages (see Luyendijk's website for details: ", "). ", "English translation copyright 2009.", "UK-English edition: ", " (Profile)", "US-English edition: ", " (Soft Skull Press)", "Australian-English edition: ", " (Scribe)", "Luyendijk tells the story of his five years as a correspondent in the Middle East. He chronicles first-hand experiences of dictatorship, occupation, terror, and war. His stories cast light on a number of major crises, from the Iraq War to the Israeli-Palestinian conflict, along with less-reported issues such as underage orphan trash-collectors in Cairo. The more he witnessed, the less he understood, and he became increasingly aware of the yawning gap between what he saw on the ground and what was later reported in the media."], "author": "Joris Luyendijk", "awards": ["Publieksprijs voor het Nederlandse Boek (2007)", "Dick Scherpenzeel Persprijs (2006)"], "places": [], "character_names": [], "language": null, "publish_date": "2009-09-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2517439.The_Forever_War", "num_ratings": "8,410", "num_reviews": "839", "avg_ratings": 4.11, "genres": ["Nonfiction", "History", "War", "Politics", "War", "Military Fiction"], "title": "The Forever War", "description": ["The Forever War"], "author": "Dexter Filkins", "num_pages": "342", "awards": ["Colby Award (2009)", "Julia Ward Howe Prize (2009)", "Arthur Ross Book Award Nominee (2009)", "National Book Critics Circle Award for General Nonfiction (2008)", "Cornelius Ryan Award (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-16 00:00:00", "ISBN": "0307266397"},
{"url": "https://www.goodreads.com/book/show/1215758.King_Hussein_of_Jordan", "num_ratings": "29", "num_reviews": "7", "avg_ratings": 4.07, "genres": ["History", "Politics", "Political Science", "War"], "title": "King Hussein of Jordan: A Political Life", "description": ["A towering figure in the history of Jordan, King Hussein reigned for nearly half a century, from his grandfather’s assassination in 1953 to his own death in 1999. In this fascinating biography, Nigel Ashton recounts the eventful life of the king who not only survived but flourished amidst crisis after crisis as ruler of a poor desert nation surrounded by powerful and hosti", "A towering figure in the history of Jordan, King Hussein reigned for nearly half a century, from his grandfather’s assassination in 1953 to his own death in 1999. In this fascinating biography, Nigel Ashton recounts the eventful life of the king who not only survived but flourished amidst crisis after crisis as ruler of a poor desert nation surrounded by powerful and hostile neighbors. Hussein skillfully navigated complicated relationships with the British, his fellow Arab leaders, the new bordering state of Israel, masses of dispossessed Palestinians within his kingdom, every U.S. president from Eisenhower to Clinton, and every British prime minister from Churchill to Blair. This book illuminates the private man, his key relationships, and his achievements and disappointments as a central player in the tough world of Middle Eastern politics.", "Ashton has had unique access to King Hussein’s private papers, including his secret correspondence with U.S., British, and Israeli leaders, and he has also conducted numerous interviews with members of Hussein’s circle and immediate family. The resulting book brings new depth to our understanding of the popular and canny king while also providing new information about the wars of 1967 and 1973, President Reagan’s role in the Iran-Contra affair, the evolution of the Middle East peace process, and much more."], "author": "Nigel John Ashton", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-16 00:00:00", "ISBN": "0300091672"},
{"url": "https://www.goodreads.com/book/show/398073.Sumer_and_the_Sumerians", "num_ratings": "50", "num_reviews": "11", "avg_ratings": 3.5, "genres": ["History", "History", "Ancient History", "Nonfiction", "History", "Archaeology"], "title": "Sumer and the Sumerians", "description": ["Mesopotamia produced one of the best-known ancient civilizations, with a literate, urban culture and highly-developed political institutions. Harriet Crawford reviews the extraordinary social and technological developments in the region over a period of two millennia (from 3800 to 2000 BC) in this fully revised and expanded edition of her classic text. Drawing on the most", "Mesopotamia produced one of the best-known ancient civilizations, with a literate, urban culture and highly-developed political institutions. Harriet Crawford reviews the extraordinary social and technological developments in the region over a period of two millennia (from 3800 to 2000 BC) in this fully revised and expanded edition of her classic text. Drawing on the most up-to-date historical and archaeological sources, she describes the physical environment and covers architecture, trade and industry, the development of writing, and changes in social and political structures. First Edition Hb (1991): 0-521-38175-4 First Edition Pb (1991): 0-521-38850-3"], "author": "Harriet E.W. Crawford", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-08 00:00:00", "ISBN": "0521825962"},
{"url": "https://www.goodreads.com/book/show/1090020.Return_to_Babylon", "num_ratings": "25", "num_reviews": "2", "avg_ratings": 4.12, "genres": ["History", "Nonfiction", "History", "Archaeology", "Cultural", "Asia"], "title": "Return to Babylon: Travelers, Archaeologists, and Monuments in Mesopotamia", "description": ["Tells the story of archaeological travel and excavation in Iraq - then Mesopotamia - from the time of the great Arab geographers to the 2003 devastation of the Iraq National Museum. This title chronicles the development of scientific archaeology in Mesopotamia, and the growing Iraqi involvement in archaeology."], "author": "Brian M. Fagan", "num_pages": "386", "awards": [], "places": ["Iraq"], "character_names": [], "language": "English", "publish_date": "2007-04-30 00:00:00", "ISBN": "0870818678"},
{"url": "https://www.goodreads.com/book/show/86342.Fiasco", "num_ratings": "5,613", "num_reviews": "413", "avg_ratings": 4.1, "genres": ["History", "Nonfiction", "Politics", "War", "Military Fiction", "War"], "title": "Fiasco: The American Military Adventure in Iraq", "description": ["This is the Story of The American Military Adventure in Iraq. The Heart of the story Fiasco has to tell, which has never been told before, is that of a Military occupation whose leaders failed to see a blooming insurgency for what it was and as a result lead their soldiers in such a way that the insurgency became inevitable."], "author": "Thomas E. Ricks", "num_pages": "482", "awards": ["Pulitzer Prize Nominee for General Nonfiction (2007)", "Lionel Gelber Prize Nominee (2007)", "Ambassador Book Award for Current Affairs (2007)", "PEN/John Kenneth Galbraith Award for Nonfiction Nominee (2007)", "Arthur Ross Book Award for Honorable Mention (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-25 00:00:00", "ISBN": "159420103X"},
{"url": "https://www.goodreads.com/book/show/281572.Prisoner_of_Tehran", "num_ratings": "9,550", "num_reviews": "1,249", "avg_ratings": 4.18, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Cultural", "Iran"], "title": "Prisoner of Tehran", "description": ["Marina Nemat's peaceful childhood in Tehran was shattered when the Iranian Revolution of 1979 ushered in a new era of Islamic rule. After complaining to her teachers about lessons being replaced by Koran study, Marina was arrested late one evening. She was taken to the notorious prison, Evin, where she was interrogated and tortured. Aged sixteen, she was sentenced to death", "Marina Nemat's peaceful childhood in Tehran was shattered when the Iranian Revolution of 1979 ushered in a new era of Islamic rule. After complaining to her teachers about lessons being replaced by Koran study, Marina was arrested late one evening. She was taken to the notorious prison, Evin, where she was interrogated and tortured. Aged sixteen, she was sentenced to death. ", " is the astonishing account of one woman's remarkable courage in the face of terror and her quest for freedom."], "author": "Marina Nemat", "num_pages": "306", "awards": [], "places": ["Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "1416537422"},
{"url": "https://www.goodreads.com/book/show/174722.Our_Oriental_Heritage", "num_ratings": "1,822", "num_reviews": "198", "avg_ratings": 4.28, "genres": ["History", "Nonfiction", "Philosophy", "History", "Ancient History", "History", "World History"], "title": "Our Oriental Heritage", "description": ["This is the ", " reference on world history, recognized as the most comprehensive general history ever written, the result of four decades of work by Will and Ariel Durant -- a set that The New York Times called \"a splendid, broad panorama of hereditary culture in words and images that the layman can fully understand.\" This series began as an effort to write a history o", "This is the ", " reference on world history, recognized as the most comprehensive general history ever written, the result of four decades of work by Will and Ariel Durant -- a set that The New York Times called \"a splendid, broad panorama of hereditary culture in words and images that the layman can fully understand.\" This series began as an effort to write a history on the nineteenth century, an undertaking that Will Durant realized could only be understood in terms of what had come before. So the Durants embarked on an encyclopedic survey of all civilization, ancient and modern, Occidental and Oriental. "], "author": "Will Durant", "num_pages": "1047", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-16 00:00:00", "ISBN": "1567310125"},
{"url": "https://www.goodreads.com/book/show/139269.Prisoners", "num_ratings": "226", "num_reviews": "44", "avg_ratings": 4.09, "genres": ["Nonfiction", "Cultural", "Israel", "History", "Autobiography", "Memoir", "Politics"], "title": "Prisoners: A Muslim and a Jew Across the Middle East Divide", "description": ["During the first Palestinian uprising in 1990, Jeffrey Goldberg – an American Jew – served as a guard at the largest prison camp in Israel. One of his prisoners was Rafiq, a rising leader in the PLO. Overcoming their fears and prejudices, the two men began a dialogue that, over more than a decade, grew into a remarkable friendship. Now an award-winning journalist, Goldberg", "During the first Palestinian uprising in 1990, Jeffrey Goldberg – an American Jew – served as a guard at the largest prison camp in Israel. One of his prisoners was Rafiq, a rising leader in the PLO. Overcoming their fears and prejudices, the two men began a dialogue that, over more than a decade, grew into a remarkable friendship. Now an award-winning journalist, Goldberg describes their relationship and their confrontations over religious, cultural, and political differences; through these discussions, he attempts to make sense of the conflicts in this embattled region, revealing the truths that lie buried within the animosities of the Middle East."], "author": "Jeffrey Goldberg", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-03 00:00:00", "ISBN": "0375412344"},
{"url": "https://www.goodreads.com/book/show/610844.The_Golden_Age_of_Persia", "num_ratings": "40", "num_reviews": "3", "avg_ratings": 4.03, "genres": ["History", "Cultural", "Iran", "Nonfiction"], "title": "The Golden Age of Persia", "description": ["The definitive history of the birth and development of the great age of Iranian civilization by the world authority on ancient Persian culture. \"This book is excellently written and well-organized to present a sound but reflectively new study of Islam's penetration...into Iran.\"--\"Peter Avery, The Middle East Journal.\" "], "author": "Richard Nelson Frye", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-12-31 00:00:00", "ISBN": "1842120115"},
{"url": "https://www.goodreads.com/book/show/1173411.The_Man_in_the_White_Sharkskin_Suit", "num_ratings": "3,560", "num_reviews": "467", "avg_ratings": 3.97, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Northern Africa", "Egypt", "History", "Literature", "Jewish"], "title": "The Man in the White Sharkskin Suit: My Family's Exodus from Old Cairo to the New World", "description": ["In vivid and graceful prose, Lucette Lagnado re-creates the majesty and cosmopolitan glamour of Cairo in the years between World War II and Gamal Abdel Nasser's rise to power. Her father, Leon, was a boulevardier who conducted business on the elegant terrace of Shepheard's Hotel, and later, in the cozy, dark bar of the Nile Hilton, dressed in his signature white sharkskin", "In vivid and graceful prose, Lucette Lagnado re-creates the majesty and cosmopolitan glamour of Cairo in the years between World War II and Gamal Abdel Nasser's rise to power. Her father, Leon, was a boulevardier who conducted business on the elegant terrace of Shepheard's Hotel, and later, in the cozy, dark bar of the Nile Hilton, dressed in his signature white sharkskin suit. But with the fall of King Farouk and Nasser's nationalization of Egyptian industry, Leon and his family lose everything. As streets are renamed, neighborhoods of their fellow Jews disbanded, and the city purged of all foreign influence, the Lagnados, too, must make their escape. With all of their belongings packed into twenty-six suitcases, their jewels and gold coins hidden in sealed tins of marmalade, Leon and his family depart for any land that will take them. The poverty and hardships they encounter in their flight from Cairo to Paris to New York are strikingly juxta-posed against the beauty and comforts of the lives they left behind.", "An inversion of the American dream set against the stunning portraits of three world cities, Lucette Lagnado's memoir offers a grand and sweeping story of faith, tradition, tragedy, and triumph.", "Winner of the Sami Rohr Prize for Jewish Literature and hailed by the ", " as a \"brilliant, crushing book\" and the ", " as a memoir of ruin \"told without melodrama by its youngest survivor,\" The Man in the White Sharkskin Suit recounts the exile of the author's Jewish Egyptian family from Cairo in 1963 and her father's heroic and tragic struggle to survive his \"riches to rags\" trajectory."], "author": "Lucette Lagnado", "num_pages": "340", "awards": ["Sami Rohr Prize for Jewish Literature (2008)"], "places": ["Cairo", "Paris", "Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2007-06-26 00:00:00", "ISBN": "0060822120"},
{"url": "https://www.goodreads.com/book/show/40619.While_Europe_Slept", "num_ratings": "800", "num_reviews": "113", "avg_ratings": 3.92, "genres": ["Nonfiction", "Politics", "Religion", "Islam", "Religion", "War", "Terrorism", "History"], "title": "While Europe Slept: How Radical Islam is Destroying the West from Within", "description": ["The struggle for the soul of Europe today is every bit as dire and consequential as it was in the 1930s. Then, in Weimar, Germany, the center did not hold, and the light of civilization nearly went out. Today, the continent has entered yet another “Weimar moment.” Will Europeans rise to the challenge posed by radical Islam, or will they cave in once again to the extremists", "The struggle for the soul of Europe today is every bit as dire and consequential as it was in the 1930s. Then, in Weimar, Germany, the center did not hold, and the light of civilization nearly went out. Today, the continent has entered yet another “Weimar moment.” Will Europeans rise to the challenge posed by radical Islam, or will they cave in once again to the extremists?", "As an American living in Europe since 1998, Bruce Bawer has seen this problem up close. Across the continent—in Amsterdam, Oslo, Copenhagen, Paris, Berlin, Madrid, and Stockholm—he encountered large, rapidly expanding Muslim enclaves in which women were oppressed and abused, homosexuals persecuted and killed, “infidels” threatened and vilified, Jews demonized and attacked, barbaric traditions (such as honor killing and forced marriage) widely practiced, and freedom of speech and religion firmly repudiated.", "The European political and media establishment turned a blind eye to all this, selling out women, Jews, gays, and democratic principles generally—even criminalizing free speech—in order to pacify the radical Islamists and preserve the illusion of multicultural harmony. The few heroic figures who dared to criticize Muslim extremists and speak up for true liberal values were systematically slandered as fascist bigots. Witnessing the disgraceful reaction of Europe’s elites to 9/11, to the terrorist attacks on Madrid, Beslan, and London, and to the wars in Afghanistan and Iraq, Bawer concluded that Europe was heading inexorably down a path to cultural suicide.", "Europe's Muslim communities are powder kegs, brimming with an alienation born of the immigrants’ deep antagonism toward an infidel society that rejects them and compounded by misguided immigration policies that enforce their segregation and empower the extremists in their midst. The mounting crisis produced by these deeply perverse and irresponsible policies finally burst onto our television screens in October 2005, as Paris and other European cities erupted in flames.", " is the story of one American’s experience in Europe before and after 9/11, and of his many arguments with Europeans about the dangers of militant Islam and America’s role in combating it. This brave and invaluable book—with its riveting combination of eye-opening reportage and blunt, incisive analysis—is essential reading for anyone concerned about the fate of Europe and what it portends for the United States."], "author": "Bruce Bawer", "num_pages": "256", "awards": ["National Book Critics Circle Award Nominee for Criticism (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-21 00:00:00", "ISBN": "0385514727"},
{"url": "https://www.goodreads.com/book/show/6452760-stones-into-schools", "num_ratings": "15,451", "num_reviews": "1,807", "avg_ratings": 3.86, "genres": ["Nonfiction", "Education", "Autobiography", "Memoir", "Biography"], "title": "Stones Into Schools: Promoting Peace With Books, Not Bombs, in Afghanistan and Pakistan", "description": ["From the author of the #1 bestseller ", ", the continuing story of this determined humanitarian's efforts to promote peace through education.", " In this dramatic first-person narrative, Greg Mortenson picks up where ", " left off in 2003, recounting his relentless, ongoing efforts to establish schools for girls in Afghanistan; his extensive work in A", "From the author of the #1 bestseller ", ", the continuing story of this determined humanitarian's efforts to promote peace through education.", " In this dramatic first-person narrative, Greg Mortenson picks up where ", " left off in 2003, recounting his relentless, ongoing efforts to establish schools for girls in Afghanistan; his extensive work in Azad Kashmir and Pakistan after a massive earthquake hit the region in 2005; and the unique ways he has built relationships with Islamic clerics, militia commanders, and tribal leaders. He shares for the first time his broader vision to promote peace through education and literacy, as well as touching on military matters, Islam, and women-all woven together with the many rich personal stories of the people who have been involved in this remarkable two-decade humanitarian effort. ", " Since the 2006 publication of ", ", Mortenson has traveled across the U.S. and the world to share his vision with hundreds of thousands of people. He has met with heads of state, top military officials, and leading politicians who all seek his advice and insight. The continued phenomenal success of ", " proves that there is an eager and committed audience for Mortenson's work and message."], "author": "Greg Mortenson", "num_pages": "420", "awards": ["Nautilus Book Award for Audio Books & Spoken Word (2010)", "Dayton Literary Peace Prize Nominee for NonFiction (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-12-01 00:00:00", "ISBN": "0670021156"},
{"url": "https://www.goodreads.com/book/show/504040.Peace_Be_upon_You", "num_ratings": "143", "num_reviews": "27", "avg_ratings": 3.85, "genres": ["History", "Religion", "Religion", "Islam", "Nonfiction", "Politics", "Religion", "Christianity", "Literature", "Jewish", "History", "World History", "Religion", "Judaism", "Spirituality"], "title": "Peace Be upon You: The Story of Muslim, Christian, and Jewish Coexistence", "description": ["The story of conflict and confrontation between Islam and the West has become daily news, but throughout the ages Muslims, Christians, and Jews have shared more than enmity and war: there is also a rich and textured history of coexistence that has all but disappeared from our collective memory. In this timely and revealing book, Zachary Karabell traces the legacy of tolera", "The story of conflict and confrontation between Islam and the West has become daily news, but throughout the ages Muslims, Christians, and Jews have shared more than enmity and war: there is also a rich and textured history of coexistence that has all but disappeared from our collective memory. In this timely and revealing book, Zachary Karabell traces the legacy of tolerance and cooperation from the advent of Islam to the present day.", "In an extraordinary narrative spanning fourteen centuries, Karabell introduces us to the court of the caliphs in Baghdad, where scholars of various faiths engaged in spirited debate. He evokes the wonders of medieval Spain, where Jewish sages, Muslim philosophers, and Christian monks together deciphered the meaning of God and the universe. He offers a portrait of the Crusades that goes beyond the rivalry of Saladin and Richard the Lionheart, and shows how Christians and Muslims lived side by side. And he paints a vivid picture of religious autonomy in the Ottoman Empire. ", "As he explores the growing tensions of the modern era, Karabell traces the rise of Arab nationalism, the redrawing of the Middle East map in the wake of World War I, and the increased hostilities following the creation of the state of Israel. Through it all, he reminds us that dialogue and friendship have always punctuated times of war and discord. Today, while some Muslims, Christians, and Jews engage in confrontation, others—in Dubai, in Turkey, and around the globe—find common ground. Remembering the legacy of coexistence and recognizing its prevalence even today is a vital ingredient to a more stable, secure world."], "author": "Zachary Karabell", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-27 00:00:00", "ISBN": "1400043689"},
{"url": "https://www.goodreads.com/book/show/17851885-i-am-malala", "num_ratings": "291,136", "num_reviews": "16,826", "avg_ratings": 4.09, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Feminism"], "title": "I Am Malala: The Story of the Girl Who Stood Up for Education and Was Shot by the Taliban", "description": ["When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at p", "When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at point-blank range while riding the bus home from school, and few expected her to survive. ", "Instead, Malala's miraculous recovery has taken her on an extraordinary journey from a remote valley in northern Pakistan to the halls of the United Nations in New York. At sixteen, she has become a global symbol of peaceful protest and the youngest-ever Nobel Peace Prize laureate.", " is the remarkable tale of a family uprooted by global terrorism, of the fight for girls' education, of a father who, himself a school owner, championed and encouraged his daughter to write and attend school, and of brave parents who have a fierce love for their daughter in a society that prizes sons."], "author": "Malala Yousafzai", "num_pages": "327", "awards": ["Lincoln Award Nominee (2017)", "Goodreads Choice Award for Memoir & Autobiography (2013)"], "places": ["Lembah Swat"], "character_names": ["Malala Yousafzai"], "language": "English", "publish_date": "2013-10-08 00:00:00", "ISBN": "0316322407"},
{"url": "https://www.goodreads.com/book/show/27310.Muhammad", "num_ratings": "4,947", "num_reviews": "295", "avg_ratings": 4.14, "genres": ["Religion", "Religion", "Islam", "History", "Biography", "Nonfiction"], "title": "Muhammad: A Biography of the Prophet", "description": ["A fresh, evenhanded biography of the founder of Islam by the author of \"A History of God.\" \"Portrays Muhammad as a passionate, complex, fallible human being.\"-- \"Publishers Weekly\""], "author": "Karen Armstrong", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-09-10 00:00:00", "ISBN": "0062508865"},
{"url": "https://www.goodreads.com/book/show/6796708-footnotes-in-gaza", "num_ratings": "3,975", "num_reviews": "290", "avg_ratings": 4.28, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "History"], "title": "Footnotes in Gaza", "description": [" ", " "], "author": "Joe Sacco", "num_pages": "432", "awards": ["Ridenhour Book Prize (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-12-22 00:00:00", "ISBN": "0805073477"},
{"url": "https://www.goodreads.com/book/show/22135.Culture_and_Imperialism", "num_ratings": "4,026", "num_reviews": "140", "avg_ratings": 4.14, "genres": ["Nonfiction", "History", "Politics", "Philosophy", "Philosophy", "Theory", "Cultural"], "title": "Culture and Imperialism", "description": ["A landmark work from the intellectually auspicious author of Orientalism that explores the long-overlooked connections between the Western imperial endeavor and the culture that both reflected and reinforced it. \"Said is a brilliant . . . scholar, aesthete and political activist.\"--Washington Post Book World."], "author": "Edward W. Said", "num_pages": "380", "awards": ["Lionel Trilling Book Award (1994)"], "places": [], "character_names": [], "language": "English", "publish_date": "1994-05-31 00:00:00", "ISBN": "0679750541"},
{"url": "https://www.goodreads.com/book/show/613283.Princess", "num_ratings": "26,133", "num_reviews": "2,322", "avg_ratings": 4.01, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir"], "title": "Princess: A True Story of Life Behind the Veil in Saudi Arabia", "description": ["Sultana is a Saudi Arabian princess, a woman born to fabulous, uncountable wealth. She has four mansions on three continents, her own private jet, glittering jewels, designer dresses galore. But in reality she lives in a gilded cage. She has no freedom, no control over her own life, no value but as a bearer of sons. Hidden behind her black floor-length veil, she is a priso", "Sultana is a Saudi Arabian princess, a woman born to fabulous, uncountable wealth. She has four mansions on three continents, her own private jet, glittering jewels, designer dresses galore. But in reality she lives in a gilded cage. She has no freedom, no control over her own life, no value but as a bearer of sons. Hidden behind her black floor-length veil, she is a prisoner, jailed by her father, her husband, her sons, and her country.Sultana is a member of the Saudi royal family, closely related to the king. For the sake of her daughters, she has decided to take the risk of speaking out about the life of women in her country, regardless of their rank. She must hide her identity for fear that the religious leaders in her country would call for her death to punish her honesty. Only a woman in her position could possibly hope to escape from being revealed and punished, despite her cloak and anonymity. Sultana tells of her own life, from her turbulent childhood to her arranged marriage--a happy one until her husband decided to displace her by taking a second wife--and of the lives of her sisters, her friends and her servants. Although they share affection, confidences and an easy camaraderie within the confines of the women's quarters, they also share a history of appalling oppression's, everyday occurrences that in any other culture would be seen as shocking human rights violations; thirteen-year-old girls forced to marry men five times their age, young women killed by drowning, stoning, or isolation in the women's room, a padded, windowless cell where women are confined with neither light nor conversation until death claims them.By speaking out, Sultana risks bringing the wrath of the Saudi establishment upon her head and the heads of her children. But by telling her story to Jean Sasson, Sultana has allowed us to see beyond the veils of this secret society, to the heart of a nation where sex, money, and power reign supreme."], "author": "Jean Sasson", "num_pages": "286", "awards": [], "places": ["Arabian Peninsula"], "character_names": [], "language": "English", "publish_date": "2010-01-01 00:00:00", "ISBN": "0967673747"},
{"url": "https://www.goodreads.com/book/show/854790.A_History_of_the_Arab_Peoples", "num_ratings": "3,175", "num_reviews": "209", "avg_ratings": 3.83, "genres": ["History", "Nonfiction", "Religion", "Islam", "Religion"], "title": "A History of the Arab Peoples", "description": ["Encyclopedic and panoramic in its scope, this fascinating work chronicles the rich spiritual, political, and cultural institutions of Arab history through 13 centuries.", "No region in the world today is more important than the Middle East: no people more misunderstood than the Arabs. In this definitive masterwork, distinguished Oxford historian Albert Hourani offers the most", "Encyclopedic and panoramic in its scope, this fascinating work chronicles the rich spiritual, political, and cultural institutions of Arab history through 13 centuries.", "No region in the world today is more important than the Middle East: no people more misunderstood than the Arabs. In this definitive masterwork, distinguished Oxford historian Albert Hourani offers the most lucid, enlightening history ever written on the subject. From the rise of Island to the Palestinian issue, from the Prophet Mohammed to Mu'ammar al-Qadhafi. A History of the Arab Peoples chronicles the rich spiritual, political and cultural institutions of this civilization through thirteen centuries of war, peace, literature and religion. Lauded by authorities, encyclopedic and panoramic in its scope, here is a remarkable window on today's conflicts and on the future of a glorious and troubled land."], "author": "Albert Hourani", "num_pages": "551", "awards": [], "places": [], "character_names": ["T.E. Lawrence", "Mehmed II", "Avicenna", "Saddam Hussein", "Muhammad", "Anwar Sadat", "Gamal Abdel Nasser"], "language": "English", "publish_date": "1992-04-01 00:00:00", "ISBN": "0446393924"},
{"url": "https://www.goodreads.com/book/show/45386.Persian_Girls", "num_ratings": "3,000", "num_reviews": "524", "avg_ratings": 3.88, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Iran", "Biography"], "title": "Persian Girls", "description": ["For many years, heartache prevented Nahid Rachlin from turning her sharp novelist's eye inward: to tell the story of how her own life diverged from that of her closest confidante and beloved sister, Pari. Growing up in Iran, both refused to accept traditional Muslim mores, and dreamed of careers in literature and on the stage. Their lives changed abruptly when Pari was coe", "For many years, heartache prevented Nahid Rachlin from turning her sharp novelist's eye inward: to tell the story of how her own life diverged from that of her closest confidante and beloved sister, Pari. Growing up in Iran, both refused to accept traditional Muslim mores, and dreamed of careers in literature and on the stage. Their lives changed abruptly when Pari was coerced by their father into marrying a wealthy and cruel suitor. Nahid narrowly avoided a similar fate, and instead negotiated with him to pursue her studies in America.", " When Nahid received the unsettling and mysterious news that Pari had died after falling down a flight of stairs, she traveled back to Iran-now under the Islamic regime-to find out what happened to her truest friend, confront her past, and evaluate what the future holds for the heartbroken in a tale of crushing sorrow, sisterhood, and ultimately, hope."], "author": "Nahid Rachlin", "num_pages": "304", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2006-10-05 00:00:00", "ISBN": "1585425206"},
{"url": "https://www.goodreads.com/book/show/5587.Power_Faith_and_Fantasy", "num_ratings": "1,594", "num_reviews": "247", "avg_ratings": 3.97, "genres": ["History", "Nonfiction", "Politics", "North American Hi...", "American History", "Religion"], "title": "Power, Faith, and Fantasy: America in the Middle East 1776 to the Present", "description": ["This best-selling history is the first fully comprehensive history of America’s involvement in the Middle East from George Washington to George W. Bush. As Niall Ferguson writes, “If you think America’s entanglement in the Middle East began with Roosevelt and Truman, Michael Oren’s deeply researched and brilliantly written history will be a revelation to you, as it was to", "This best-selling history is the first fully comprehensive history of America’s involvement in the Middle East from George Washington to George W. Bush. As Niall Ferguson writes, “If you think America’s entanglement in the Middle East began with Roosevelt and Truman, Michael Oren’s deeply researched and brilliantly written history will be a revelation to you, as it was to me. With its cast of fascinating characters—earnest missionaries, maverick converts, wide-eyed tourists, and even a nineteenth-century George Bush—", " is not only a terrific read, it is also proof that you don’t really understand an issue until you know its history.”"], "author": "Michael B. Oren", "num_pages": "832", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-16 00:00:00", "ISBN": "0393058263"},
{"url": "https://www.goodreads.com/book/show/9516.Persepolis", "num_ratings": "131,716", "num_reviews": "7,505", "avg_ratings": 4.24, "genres": ["Sequential Art", "Graphic Novels", "Nonfiction", "Autobiography", "Memoir", "Sequential Art", "Comics", "Biography"], "title": "Persepolis: The Story of a Childhood", "description": ["A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, ye", "A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, years that saw the overthrow of the Shah’s regime, the triumph of the Islamic Revolution, and the devastating effects of war with Iraq. The intelligent and outspoken only child of committed Marxists and the great-granddaughter of one of Iran’s last emperors, Marjane bears witness to a childhood uniquely entwined with the history of her country.", " paints an unforgettable portrait of daily life in Iran and of the bewildering contradictions between home life and public life. Marjane’s child’s-eye view of dethroned emperors, state-sanctioned whippings, and heroes of the revolution allows us to learn as she does the history of this fascinating country and of her own extraordinary family. Intensely personal, profoundly political, and wholly original, ", " is at once a story of growing up and a reminder of the human cost of war and political repression. It shows how we carry on, with laughter and tears, in the face of absurdity. And, finally, it introduces us to an irresistible little girl with whom we cannot help but fall in love."], "author": "Marjane Satrapi", "num_pages": "153", "awards": ["Harvey Awards for Best US Edition of Foreign Material (2004)", "ALA Alex Award (2004)", "Prix du Festival d'Angoulême for Alph-art du coup de coeur (2001)"], "places": ["Iran, Islamic Republic of", "Tehran", "Persia"], "character_names": [], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "037571457X"},
{"url": "https://www.goodreads.com/book/show/6715481-destiny-disrupted", "num_ratings": "5,569", "num_reviews": "710", "avg_ratings": 4.36, "genres": ["Religion", "History", "Nonfiction", "Religion", "Islam", "History", "World History"], "title": "Destiny Disrupted: A History of the World Through Islamic Eyes", "description": ["We in the west share a common narrative of world history. But our story largely omits a whole civilization whose citizens shared an entirely different narrative for a thousand years.In ", ", Tamim Ansary tells the rich story of world history as the Islamic world saw it, from the time of Mohammed to the fall of the Ottoman Empire and beyond. He clarifies why ou", "We in the west share a common narrative of world history. But our story largely omits a whole civilization whose citizens shared an entirely different narrative for a thousand years.In ", ", Tamim Ansary tells the rich story of world history as the Islamic world saw it, from the time of Mohammed to the fall of the Ottoman Empire and beyond. He clarifies why our civilizations grew up oblivious to each other, what happened when they intersected, and how the Islamic world was affected by its slow recognition that Europe—a place it long perceived as primitive and disorganized—had somehow hijacked destiny."], "author": "Tamim Ansary", "num_pages": "390", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "1586488139"},
{"url": "https://www.goodreads.com/book/show/52142.The_Great_War_for_Civilisation", "num_ratings": "3,700", "num_reviews": "377", "avg_ratings": 4.39, "genres": ["History", "Nonfiction", "Politics", "War"], "title": "The Great War for Civilisation: The Conquest of the Middle East", "description": ["A sweeping and dramatic history of the last half century of conflict in the Middle East from an award-winning journalist who has covered the region for over thirty years, The Great War for Civilisation unflinchingly chronicles the tragedy of the region from the Algerian Civil War to the Iranian Revolution; from the American hostage crisis in Beirut to the Iran-Iraq War; fr", "A sweeping and dramatic history of the last half century of conflict in the Middle East from an award-winning journalist who has covered the region for over thirty years, The Great War for Civilisation unflinchingly chronicles the tragedy of the region from the Algerian Civil War to the Iranian Revolution; from the American hostage crisis in Beirut to the Iran-Iraq War; from the 1991 Gulf War to the American invasion of Iraq in 2003. A book of searing drama as well as lucid, incisive analysis, The Great War for Civilisation is a work of major importance for today's world."], "author": "Robert Fisk", "num_pages": "1136", "awards": ["National Book Critics Circle Award Nominee for General Nonfiction (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-13 00:00:00", "ISBN": "1400075173"},
{"url": "https://www.goodreads.com/book/show/11690.Istanbul", "num_ratings": "13,412", "num_reviews": "1,308", "avg_ratings": 3.78, "genres": ["Nonfiction", "Travel", "Autobiography", "Memoir", "Biography", "History"], "title": "Istanbul: Memories and the City", "description": ["A shimmering evocation, by turns intimate and panoramic, of one of the world’s great cities, by its foremost writer. Orhan Pamuk was born in Istanbul and still lives in the family apartment building where his mother first held him in her arms. His portrait of his city is thus also a self-portrait, refracted by memory and the melancholy–or ", "ü", "ü", " that all ", " share:", "A shimmering evocation, by turns intimate and panoramic, of one of the world’s great cities, by its foremost writer. Orhan Pamuk was born in Istanbul and still lives in the family apartment building where his mother first held him in her arms. His portrait of his city is thus also a self-portrait, refracted by memory and the melancholy–or ", "ü", "ü", " that all ", " share: the sadness that comes of living amid the ruins of a lost empire.With cinematic fluidity, Pamuk moves from his glamorous, unhappy parents to the gorgeous, decrepit mansions overlooking the Bosphorus; from the dawning of his self-consciousness to the writers and painters–both Turkish and foreign–who would shape his consciousness of his city. Like Joyce’s Dublin and Borges’ Buenos Aires, Pamuk’s ", "is a triumphant encounter of place and sensibility, beautifully written and immensely moving."], "author": "Orhan Pamuk", "num_pages": "356", "awards": ["National Book Critics Circle Award Nominee for Autobiography/Memoir (2005)", "Samuel Johnson Prize for Non-Fiction Nominee (2005)"], "places": ["Istanbul"], "character_names": [], "language": "English", "publish_date": "2006-07-11 00:00:00", "ISBN": "1400033888"},
{"url": "https://www.goodreads.com/book/show/78107.A_Peace_to_End_All_Peace", "num_ratings": "5,393", "num_reviews": "458", "avg_ratings": 4.17, "genres": ["History", "Nonfiction", "Politics"], "title": "A Peace to End All Peace: The Fall Of The Ottoman Empire And The Creation Of The Modern Middle East", "description": ["The critically acclaimed ", " bestselling account of how the modern Middle East came into being after World War I, and why it is in upheaval today", "In our time the Middle East has proven a battleground of rival religions, ideologies, nationalisms, and dynasties. All of these conflicts, including the hostilities between Arabs and Israelis that have flared yet again,", "The critically acclaimed ", " bestselling account of how the modern Middle East came into being after World War I, and why it is in upheaval today", "In our time the Middle East has proven a battleground of rival religions, ideologies, nationalisms, and dynasties. All of these conflicts, including the hostilities between Arabs and Israelis that have flared yet again, come down, in a sense, to the extent to which the Middle East will continue to live with its political inheritance: the arrangements, unities, and divisions imposed upon the region by the Allies after the First World War.", "In ", ", David Fromkin reveals how and why the Allies came to remake the geography and politics of the Middle East, drawing lines on an empty map that eventually became the new countries of Iraq, Israel, Jordan, and Lebanon. Focusing on the formative years of 1914 to 1922, when all-even an alliance between Arab nationalism and Zionism-seemed possible he raises questions about what might have been done differently, and answers questions about why things were done as they were. The current battle for a Palestinian homeland has its roots in these events of 85 years ago."], "author": "David Fromkin", "num_pages": "635", "awards": ["Pulitzer Prize Nominee for General Nonfiction (1990)", "National Book Critics Circle Award Nominee for General Nonfiction (1989)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-09-01 00:00:00", "ISBN": "0805068848"},
{"url": "https://www.goodreads.com/book/show/846490.The_Prophet", "num_ratings": "180,594", "num_reviews": "7,125", "avg_ratings": 4.23, "genres": ["Poetry", "Philosophy", "Classics", "Fiction", "Spirituality", "Religion"], "title": "The Prophet", "description": ["A-brilliant-mans-philosophy-on-love-marriage-joy-and-sorrow-time-friendship-and-much-more-Originally-published-in-1923-translated-into-more-than-20-languages"], "author": "Kahlil Gibran", "num_pages": "60", "awards": [], "places": ["Orphalese"], "character_names": ["Al Mustafa", "Al Mitra"], "language": "English", "publish_date": "1996-08-16 00:00:00", "ISBN": "1853264857"},
{"url": "https://www.goodreads.com/book/show/225897.Six_Days_of_War", "num_ratings": "3,644", "num_reviews": "280", "avg_ratings": 4.14, "genres": ["History", "Nonfiction", "Cultural", "Israel", "Military", "Military History", "War", "Politics"], "title": "Six Days of War: June 1967 and the Making of the Modern Middle East", "description": ["Though it lasted for only six tense days in June, the 1967 Arab-Israeli war never really ended. Every crisis that has ripped through this region in the ensuing decades, from the Yom Kippur War of 1973 to the ongoing ", ", is a direct consequence of those six days of fighting. Michael B. Oren’s magnificent ", ", an internationally acclaimed bestseller, is the", "Though it lasted for only six tense days in June, the 1967 Arab-Israeli war never really ended. Every crisis that has ripped through this region in the ensuing decades, from the Yom Kippur War of 1973 to the ongoing ", ", is a direct consequence of those six days of fighting. Michael B. Oren’s magnificent ", ", an internationally acclaimed bestseller, is the first comprehensive account of this epoch-making event. ", "Writing with a novelist’s command of narrative and a historian’s grasp of fact and motive, Oren reconstructs both the lightning-fast action on the battlefields and the political shocks that electrified the world. Extraordinary personalities—Moshe Dayan and Gamal Abdul Nasser, Lyndon Johnson and Alexei Kosygin—rose and toppled from power as a result of this war; borders were redrawn; daring strategies brilliantly succeeded or disastrously failed in a matter of hours. And the balance of power changed—in the Middle East and in the world. A towering work of history and an enthralling human narrative, ", " is the most important book on the Middle East conflict to appear in a generation."], "author": "Michael B. Oren", "num_pages": "460", "awards": ["Los Angeles Times Book Prize for History (2002)"], "places": [], "character_names": [], "language": null, "publish_date": "2003-06-03 00:00:00", "ISBN": "0345461924"},
{"url": "https://www.goodreads.com/book/show/337615.Nine_Parts_of_Desire", "num_ratings": "11,797", "num_reviews": "1,186", "avg_ratings": 4.04, "genres": ["Nonfiction", "Religion", "Islam", "Religion", "History", "Feminism"], "title": "Nine Parts of Desire: The Hidden World of Islamic Women", "description": ["As a prizewinning foreign correspondent for ", ", Geraldine Brooks spent six years covering the Middle East through wars, insurrections, and the volcanic upheaval of resurgent fundamentalism. Yet for her, headline events were only the backdrop to a less obvious but more enduring drama: the daily life of Muslim women. ", "As a prizewinning foreign correspondent for ", ", Geraldine Brooks spent six years covering the Middle East through wars, insurrections, and the volcanic upheaval of resurgent fundamentalism. Yet for her, headline events were only the backdrop to a less obvious but more enduring drama: the daily life of Muslim women. ", "is the story of Brooks' intrepid journey toward an understanding of the women behind the veils, and of the often contradictory political, religious, and cultural forces that shape their lives. Defying our stereotypes about the Muslim world, Brooks' acute analysis of the world's fastest growing religion deftly illustrates how Islam's holiest texts have been misused to justify repression of women, and how male pride and power have warped the original message of a once liberating faith."], "author": "Geraldine Brooks", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1995-12-01 00:00:00", "ISBN": "0385475772"},
{"url": "https://www.goodreads.com/book/show/7779696-son-of-hamas", "num_ratings": "7,348", "num_reviews": "948", "avg_ratings": 4.13, "genres": ["Nonfiction", "Biography", "History", "Politics", "Autobiography", "Memoir"], "title": "Son of Hamas", "description": ["Since he was a small boy, Mosab Hassan Yousef has had an inside view of the deadly terrorist group Hamas. The oldest son of Sheikh Hassan Yousef, a founding member of Hamas and its most popular leader, young Mosab assisted his father for years in his political activities while being groomed to assume his legacy, politics, status . . . and power. But everything changed when", "Since he was a small boy, Mosab Hassan Yousef has had an inside view of the deadly terrorist group Hamas. The oldest son of Sheikh Hassan Yousef, a founding member of Hamas and its most popular leader, young Mosab assisted his father for years in his political activities while being groomed to assume his legacy, politics, status . . . and power. But everything changed when Mosab turned away from terror and violence, and embraced instead the teachings of another famous Middle East leader. In ", ", Mosab Yousef—now called “Joseph”—reveals new information about the world’s most dangerous terrorist organization and unveils the truth about his own role, his agonizing separation from family and homeland, the dangerous decision to make his newfound faith public, and his belief that the Christian mandate to “love your enemies” is the only way to peace in the Middle East."], "author": "Mosab Hassan Yousef", "num_pages": "265", "awards": ["Goodreads Choice Award Nominee for Memoir and Autobiography (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "1414333072"},
{"url": "https://www.goodreads.com/book/show/846564.I_Saw_Ramallah", "num_ratings": "11,666", "num_reviews": "2,170", "avg_ratings": 4.15, "genres": ["Nonfiction"], "title": "I Saw Ramallah", "description": ["Winner of the prestigious Naguib Mahfouz Medal, this fierce and moving work is an unparalleled rendering of the human aspects of the Palestinian predicament.", "Barred from his homeland after 1967’s Six-Day War, the poet Mourid Barghouti spent thirty years in exile—shuttling among the world’s cities, yet secure in none of them; separated from his family for years at a time; ne", "Winner of the prestigious Naguib Mahfouz Medal, this fierce and moving work is an unparalleled rendering of the human aspects of the Palestinian predicament.", "Barred from his homeland after 1967’s Six-Day War, the poet Mourid Barghouti spent thirty years in exile—shuttling among the world’s cities, yet secure in none of them; separated from his family for years at a time; never certain whether he was a visitor, a refugee, a citizen, or a guest. As he returns home for the first time since the Israeli occupation, Barghouti crosses a wooden bridge over the Jordan River into Ramallah and is unable to recognize the city of his youth. Sifting through memories of the old Palestine as they come up against what he now encounters in this mere “idea of Palestine,” he discovers what it means to be deprived not only of a homeland but of “the habitual place and status of a person.” A tour de force of memory and reflection, lamentation and resilience, ", "is a deeply humane book, essential to any balanced understanding of today’s Middle East."], "author": "Mourid Barghouti", "num_pages": "208", "awards": ["جائزة نجيب محفوظ للأدب (1997)"], "places": ["Egypt"], "character_names": [], "language": "English", "publish_date": "2003-05-13 00:00:00", "ISBN": "1400032660"},
{"url": "https://www.goodreads.com/book/show/9838.The_Bookseller_of_Kabul", "num_ratings": "36,527", "num_reviews": "2,843", "avg_ratings": 3.76, "genres": ["Autobiography", "Memoir", "Biography", "Travel", "History", "Cultural", "Asia"], "title": "The Bookseller of Kabul", "description": ["In spring 2002, following the fall of the Taliban, Åsne Seierstad spent four months living with a bookseller and his family in Kabul.", "For more than twenty years Sultan Khan defied the authorities—be they communist or Taliban—to supply books to the people of Kabul. He was arrested, interrogated and imprisoned by the communists, and watched illiterate Taliban soldiers burn pi", "In spring 2002, following the fall of the Taliban, Åsne Seierstad spent four months living with a bookseller and his family in Kabul.", "For more than twenty years Sultan Khan defied the authorities—be they communist or Taliban—to supply books to the people of Kabul. He was arrested, interrogated and imprisoned by the communists, and watched illiterate Taliban soldiers burn piles of his books in the street. He even resorted to hiding most of his stock—almost ten thousand books—in attics all over Kabul.", "But while Khan is passionate in his love of books and his hatred of censorship, he also has strict views on family life and the role of women. As an outsider, Åsne Seierstad found herself in a unique position, able to move freely between the private, restricted sphere of the women—including Khan’s two wives—and the freer, more public lives of the men.", "It is an experience that Seierstad finds both fascinating and frustrating. As she steps back from the page and allows the Khans to speak for themselves, we learn of proposals and marriages, hope and fear, crime and punishment. The result is a genuinely gripping and moving portrait of a family, and a clear-eyed assessment of a country struggling to free itself from history.' to 'This mesmerizing portrait of a proud man who, through three decades and successive repressive regimes, heroically braved persecution to bring books to the people of Kabul has elicited extraordinary praise throughout the world and become a phenomenal international bestseller. ", " is startling in its intimacy and its details—a revelation of the plight of Afghan women and a window into the surprising realities of daily life in today’s Afghanistan.'"], "author": "Åsne Seierstad", "num_pages": "288", "awards": [], "places": ["Kabul"], "character_names": [], "language": "English", "publish_date": "2004-10-26 00:00:00", "ISBN": "0316159417"},
{"url": "https://www.goodreads.com/book/show/110890.The_Looming_Tower", "num_ratings": "17,632", "num_reviews": "1,921", "avg_ratings": 4.39, "genres": ["Nonfiction", "History", "Politics", "War", "Terrorism", "War"], "title": "The Looming Tower: Al-Qaeda and the Road to 9/11", "description": ["A sweeping narrative history of the events leading to 9/11, a groundbreaking look at the people and ideas, the terrorist plans and the Western intelligence failures that culminated in the assault on America. Lawrence Wright's remarkable book is based on five years of research and hundreds of interviews that he conducted in Egypt, Saudi Arabia, Pakistan, Afghanistan, Sudan,", "A sweeping narrative history of the events leading to 9/11, a groundbreaking look at the people and ideas, the terrorist plans and the Western intelligence failures that culminated in the assault on America. Lawrence Wright's remarkable book is based on five years of research and hundreds of interviews that he conducted in Egypt, Saudi Arabia, Pakistan, Afghanistan, Sudan, England, France, Germany, Spain, and the United States.", " achieves an unprecedented level of intimacy and insight by telling the story through the interweaving lives of four men: the two leaders of al-Qaeda, Osama bin Laden and Ayman al-Zawahiri; the FBI's counterterrorism chief, John O'Neill; and the former head of Saudi intelligence, Prince Turki al-Faisal.", "As these lives unfold, we see revealed: the crosscurrents of modern Islam that helped to radicalize Zawahiri and bin Laden . . . the birth of al-Qaeda and its unsteady development into an organization capable of the American embassy bombings in Kenya and Tanzania and the attack on the USS", " . . . O'Neill's heroic efforts to track al-Qaeda before 9/11, and his tragic death in the World Trade towers . . . Prince Turki's transformation from bin Laden's ally to his enemy . . . the failures of the FBI, CIA, and NSA to share intelligence that might have prevented the 9/11 attacks.", " broadens and deepens our knowledge of these signal events by taking us behind the scenes. Here is Sayyid Qutb, founder of the modern Islamist movement, lonely and despairing as he meets Western culture up close in 1940s America; the privileged childhoods of bin Laden and Zawahiri; family life in the al-Qaeda compounds of Sudan and Afghanistan; O'Neill's high-wire act in balancing his all-consuming career with his equally entangling personal life--he was living with three women, each of them unaware of the others' existence--and the nitty-gritty of turf battles among U.S. intelligence agencies.", "Brilliantly conceived and written, ", " draws all elements of the story into a galvanizing narrative that adds immeasurably to our understanding of how we arrived at September 11, 2001. The richness of its new information, and the depth of its perceptions, can help us deal more wisely and effectively with the continuing terrorist threat."], "author": "Lawrence Wright", "num_pages": "469", "awards": ["Pulitzer Prize for General Nonfiction (2007)", "J. Anthony Lukas Book Prize (2007)", "Lionel Gelber Prize (2007)", "Helen Bernstein Book Award for Excellence in Journalism (2007)", "Los Angeles Times Book Prize for History (2006)", "Arthur Ross Book Award (2007)", "National Book Award Finalist for Nonfiction (2006)", "IRE AWard (2006)", "PEN Center USA Literary Award (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-08 00:00:00", "ISBN": "037541486X"},
{"url": "https://www.goodreads.com/book/show/355190.Orientalism", "num_ratings": "13,249", "num_reviews": "747", "avg_ratings": 4.08, "genres": ["Nonfiction", "History", "Philosophy", "Politics", "Philosophy", "Theory"], "title": "Orientalism", "description": ["In this highly acclaimed work, Edward Said surveys the history and nature of Western attitudes towards the East, considering Orientalism as a powerful European ideological creation – a way for writers, philosophers and colonial administrators to deal with the ‘otherness’ of Eastern culture, customs and beliefs. He traces this view through t", "In this highly acclaimed work, Edward Said surveys the history and nature of Western attitudes towards the East, considering Orientalism as a powerful European ideological creation – a way for writers, philosophers and colonial administrators to deal with the ‘otherness’ of Eastern culture, customs and beliefs. He traces this view through the writings of Homer, Nerval and Flaubert, Disraeli and Kipling, whose imaginative depictions have greatly contributed to the West’s romantic and exotic picture of the Orient. In his new preface, Said examines the effect of continuing Western imperialism after recent events in Palestine, Afghanistan and Iraq."], "author": "Edward W. Said", "num_pages": "395", "awards": ["National Book Critics Circle Award Nominee for Criticism (1978)"], "places": [], "character_names": [], "language": "English", "publish_date": "1979-10-12 00:00:00", "ISBN": "039474067X"},
{"url": "https://www.goodreads.com/book/show/3559.From_Beirut_to_Jerusalem", "num_ratings": "9,169", "num_reviews": "733", "avg_ratings": 4.11, "genres": ["History", "Nonfiction", "Politics", "Cultural", "Israel"], "title": "From Beirut to Jerusalem", "description": ["This is a book that must be read by all who are concerned about the present and future of a part of our world to which Western civilization has always been and will continue to be, vitally connected..."], "author": "Thomas L. Friedman", "num_pages": "608", "awards": ["National Book Award for Nonfiction (1989)", "ASJA Outstanding Book Award (1990)", "Helen Bernstein Book Award for Excellence in Journalism (1990)", "Cornelius Ryan Award (1989)"], "places": [], "character_names": [], "language": "English", "publish_date": "1990-07-15 00:00:00", "ISBN": "0385413726"},
{"url": "https://www.goodreads.com/book/show/991197.The_Complete_Persepolis", "num_ratings": "89,753", "num_reviews": "6,206", "avg_ratings": 4.38, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "The Complete Persepolis", "description": ["Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.", " is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years", "Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.", " is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years in Vienna facing the trials of adolescence far from her family; of her homecoming--both sweet and terrible; and, finally, of her self-imposed exile from her beloved homeland. It is the chronicle of a girlhood and adolescence at once outrageous and familiar, a young life entwined with the history of her country yet filled with the universal trials and joys of growing up.", "Edgy, searingly observant, and candid, often heartbreaking but threaded throughout with raw humor and hard-earned wisdom--", " is a stunning work from one of the most highly regarded, singularly talented graphic artists at work today."], "author": "Marjane Satrapi", "num_pages": "341", "awards": [], "places": ["Vienna", "Iran", "Tehran"], "character_names": ["Rezā Shāh", "Marjane Satrapi", "Taji Chaltchi Satrapi", "Ebi Satrapi", "Grandma Chaltchi", "Anoosh Satrapi", "Taher Chaltchi", "Siamak Jari", "Mohsen Shakjiba", "Laly Jari", "Ahmadi", "Fereydoon Satrapi", "Kaveh", "Entezami", "Mali (Persepolis)", "Mehri", "Hossein (Bee Gees)", "Mrs. Nasrine", "Peyman", "Shahab", "Tinoosh", "Dr. Fathi", "Khosro (Persepolis)", "Niloufar", "Mardana", "Neda Baba-Levy", "Sherrie", "Zozo (Persepolis)"], "language": "English", "publish_date": "2007-10-30 00:00:00", "ISBN": "0375714839"},
{"url": "https://www.goodreads.com/book/show/7603.Reading_Lolita_in_Tehran", "num_ratings": "104,230", "num_reviews": "6,981", "avg_ratings": 3.59, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Reading Lolita in Tehran: A Memoir in Books", "author": "Azar Nafisi", "num_pages": "356", "awards": ["Book Sense Book of the Year Award for Adult Nonfiction (2004)", "Prix du Meilleur Livre Étranger for Essai (2004)"], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Azar Nafisi"], "language": "English", "publish_date": "2003-12-30 00:00:00", "ISBN": "081297106X"}
]