[
{"url": "https://www.goodreads.com/book/show/7763.The_Joy_Luck_Club", "num_ratings": "548,448", "num_reviews": "7,390", "avg_ratings": 3.91, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Cultural", "China", "Contemporary"], "title": "The Joy Luck Club", "description": ["In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her se", "In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her secrets, trying to unravel the truth about her life, the strings become more tangled, more entwined..."], "author": "Amy Tan", "num_pages": "288", "awards": ["California Book Award for Fiction (Gold) (1989)", "Los Angeles Times Book Prize Nominee for Fiction (1989)", "Northern California Book Awards for Fiction (1989)", "National Book Critics Circle Award Nominee for Fiction (1989)", "National Book Award Finalist for Fiction (1989)"], "places": ["San Francisco, California", "China"], "character_names": ["Suyuan Woo", "June Woo", "Lindo Jong", "Waverly Jong", "An-Mei Hsu", "Rose Hsu Jordan", "Ying-Ying St. Clair", "Lena St. Clair"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038095"},
{"url": "https://www.goodreads.com/book/show/140963.O_Pioneers_", "num_ratings": "39,355", "num_reviews": "2,587", "avg_ratings": 3.85, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "O Pioneers!", "description": [" (1913) was Willa Cather's first great novel, and to many it remains her unchallenged masterpiece. No other work of fiction so faithfully conveys both the sharp physical realities and the mythic sweep of the transformation of the American frontier—and the transformation of the people who settled it. Cather's heroine is Alexandra Bergson, who arrives on the wind-", " (1913) was Willa Cather's first great novel, and to many it remains her unchallenged masterpiece. No other work of fiction so faithfully conveys both the sharp physical realities and the mythic sweep of the transformation of the American frontier—and the transformation of the people who settled it. Cather's heroine is Alexandra Bergson, who arrives on the wind-blasted prairie of Hanover, Nebraska, as a girl and grows up to make it a prosperous farm. But this archetypal success story is darkened by loss, and Alexandra's devotion to the land may come at the cost of love itself.", "At once a sophisticated pastoral and a prototype for later feminist novels, ", " is a work in which triumph is inextricably enmeshed with tragedy, a story of people who do not claim a land so much as they submit to it and, in the process, become greater than they were."], "author": "Willa Cather", "num_pages": "159", "awards": [], "places": ["Nebraska"], "character_names": ["Alexandra Bergson"], "language": "English", "publish_date": "1992-08-16 00:00:00", "ISBN": "0679743626"},
{"url": "https://www.goodreads.com/book/show/4078927-little-bee", "num_ratings": "208,384", "num_reviews": "20,272", "avg_ratings": 3.71, "genres": ["Historical", "Historical Fiction", "Fiction", "Adult Fiction", "Contemporary", "Adult", "Book Club"], "title": "Little Bee", "description": ["This is the story of two women. Their lives collide one fateful day, and one of them has to make a terrible choice, the kind of choice we hope you never have to face. Two years later, they meet again - the story starts there ..."], "author": "Chris Cleave", "num_pages": "288", "awards": ["Costa Book Award Nominee for Novel (2008)", "Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Kingston-upon-Thames, London, England"], "character_names": ["Sarah O'Rourke", "Pequena Abelha", "Andrew O'Rourke", "Little Bee"], "language": "English", "publish_date": "2009-02-10 00:00:00", "ISBN": "038566530X"},
{"url": "https://www.goodreads.com/book/show/920607.The_Arrival", "num_ratings": "39,973", "num_reviews": "3,811", "avg_ratings": 4.32, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Fantasy", "Childrens", "Picture Books", "Fiction", "Young Adult"], "title": "The Arrival", "description": ["In a heartbreaking parting, a man gives his wife and daughter a last kiss and boards a steamship to cross the ocean. He's embarking on the most painful yet important journey of his life- he's leaving home to build a better future for his family.", "Shaun Tan evokes universal aspects of an immigrant's experience through a singular work of the imagination. He does so using brill", "In a heartbreaking parting, a man gives his wife and daughter a last kiss and boards a steamship to cross the ocean. He's embarking on the most painful yet important journey of his life- he's leaving home to build a better future for his family.", "Shaun Tan evokes universal aspects of an immigrant's experience through a singular work of the imagination. He does so using brilliantly clear and mesmerizing images. Because the main character can't communicate in words, the book forgoes them too. But while the reader experiences the main character's isolation, he also shares his ultimate joy."], "author": "Shaun Tan", "num_pages": "132", "awards": ["Hugo Award Nominee for Best Related Book (2008)", "Locus Award for Best Art Book (2008)", "New South Wales Premier's Literary Award for Book of the Year & Community Relations Commission Award (2007)", "Western Australian Premier's Book Award for Overall Winner & Childrens Book (2006)", "Children's Book Council of Australia Award for Picture Book of the Year (2007)", "Moonbeam Children's Book Award (2007)", "Aurealis Award for Best Young Adult Short Story & Golden Aurealis for Best Short Story (2006)", "Deutscher Jugendliteraturpreis Nominee for Bilderbuch (2009)", "Boston Globe-Horn Book Award for Special Citation (2008)", "Australian Book Industry Award (ABIA) for Older Children (2007)", "Literaturpreis der Jury der jungen Leser for Sonderpreis (2009)", "Plano Nacional de Leitura for (Portugal) (0)", "The Inky Awards Shortlist for Gold Inky (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-12 00:00:00", "ISBN": "0734406940"},
{"url": "https://www.goodreads.com/book/show/6419614-hotel-on-the-corner-of-bitter-and-sweet", "num_ratings": "229,102", "num_reviews": "19,017", "avg_ratings": 3.99, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Book Club", "Romance", "War", "World War II"], "title": "Hotel on the Corner of Bitter and Sweet", "description": ["In 1986, Henry Lee joins a crowd outside the Panama Hotel, once the gateway to Seattle's Japantown. It has been boarded up for decades, but now the new owner has discovered the belongings of Japanese families who were sent to internment camps during World War II. As the owner displays and unfurls a Japanese parasol, Henry, a Chinese American, remembers a young Japanese Ame", "In 1986, Henry Lee joins a crowd outside the Panama Hotel, once the gateway to Seattle's Japantown. It has been boarded up for decades, but now the new owner has discovered the belongings of Japanese families who were sent to internment camps during World War II. As the owner displays and unfurls a Japanese parasol, Henry, a Chinese American, remembers a young Japanese American girl from his childhood in the 1940s--Keiko Okabe, with whom he forged a bond of friendship and innocent love that transcended the prejudices of their Old World ancestors. After Keiko and her family were evacuated to the internment camps, she and Henry could only hope that their promise to each other would be kept. Now, forty years later, Henry explores the hotel's basement for the Okabe family's belongings and for a long-lost object whose value he cannot even begin to measure. His search will take him on a journey to revisit the sacrifices he has made for family, for love, for country."], "author": "Jamie Ford", "num_pages": "285", "awards": ["Montana Book Award (2009)", "Goodreads Choice Award Nominee for Fiction (2009)", "David J. Langum Sr. Prize Nominee for American Historical Fiction  (Director's Mention) (2009)", "Asian/Pacific American Award for Literature for Adult Fiction (2009)"], "places": ["Seattle, Washington", "Puyallup, Washington", "Minidoka, Idaho", "Washington (the state)"], "character_names": ["Henry Lee", "Keiko Okabe"], "language": "English", "publish_date": "2009-10-06 00:00:00", "ISBN": "0345505344"},
{"url": "https://www.goodreads.com/book/show/12557.The_Kitchen_God_s_Wife", "num_ratings": "65,931", "num_reviews": "1,908", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia", "Contemporary"], "title": "The Kitchen God's Wife", "description": ["Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside", "Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside Shanghai in the 1920s, and other places in China during World War II, and traces the happy and desperate events that led to Winnie's coming to America in 1949."], "author": "Amy Tan", "num_pages": "416", "awards": [], "places": ["United States of America"], "character_names": ["Winnie", "Auntie Helen", "Pearl Bright", "Mary", "Frank Russell", "Roger \"Bao Bao\"", "Doug Cheu", "Phil Brandt", "Tessa Russo", "Cleo", "Mimi Wong", "Loy Fong", "Edna Fong", "New Aunt", "Old Aunt", "Wen Fu", "Huazheng \"Peanut\"", "Uncle Henry"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038109"},
{"url": "https://www.goodreads.com/book/show/4588.Extremely_Loud_and_Incredibly_Close", "num_ratings": "344,079", "num_reviews": "22,022", "avg_ratings": 3.97, "genres": ["Fiction", "Contemporary", "Historical", "Historical Fiction"], "title": "Extremely Loud and Incredibly Close", "description": ["Nine-year-old Oskar Schell is an inventor, amateur entomologist, Francophile, letter writer, pacifist, natural historian, percussionist, romantic, Great Explorer, jeweller, detective, vegan, and collector of butterflies. When his father is killed in the September 11th attacks on the World Trade Centre, Oskar sets out to solve the mystery of a key he discovers in his father", "Nine-year-old Oskar Schell is an inventor, amateur entomologist, Francophile, letter writer, pacifist, natural historian, percussionist, romantic, Great Explorer, jeweller, detective, vegan, and collector of butterflies. When his father is killed in the September 11th attacks on the World Trade Centre, Oskar sets out to solve the mystery of a key he discovers in his father's closet. It is a search which leads him into the lives of strangers, through the five boroughs of New York, into history, to the bombings of Dresden and Hiroshima, and on an inward journey which brings him ever closer to some kind of peace."], "author": "Jonathan Safran Foer", "num_pages": "326", "awards": ["Prix des libraires du Québec for Lauréats hors Québec (2007)", "Luisterboek Award (2009)"], "places": ["New York City, New York", "Dresden"], "character_names": ["Oskar Schell"], "language": "English", "publish_date": "2006-04-04 00:00:00", "ISBN": "0618711651"},
{"url": "https://www.goodreads.com/book/show/15796700-americanah", "num_ratings": "169,639", "num_reviews": "16,436", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Feminism", "Literary Fiction"], "title": "Americanah", "description": ["Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a d", "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London. Fifteen years later, they reunite in a newly democratic Nigeria, and reignite their passion—for each other and for their homeland.", "Source: chimamanda.com"], "author": "Chimamanda Ngozi Adichie", "num_pages": "477", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0307271080"},
{"url": "https://www.goodreads.com/book/show/690866.The_Hundred_Secret_Senses", "num_ratings": "37,116", "num_reviews": "1,544", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia"], "title": "The Hundred Secret Senses", "description": [" is an exultant novel about China and America, love and loyalty, the identities we invent and the true selves we discover along the way. Olivia Laguni is half-Chinese, but typically American in her uneasiness with her patchwork family. And no one in Olivia's family is more embarrassing to her than her half-sister, Kwan Li. For Kwan speaks mangled E", " is an exultant novel about China and America, love and loyalty, the identities we invent and the true selves we discover along the way. Olivia Laguni is half-Chinese, but typically American in her uneasiness with her patchwork family. And no one in Olivia's family is more embarrassing to her than her half-sister, Kwan Li. For Kwan speaks mangled English, is cheerfully deaf to Olivia's sarcasm, and sees the dead with her \"yin eyes.\"", "Even as Olivia details the particulars of her decades-long grudge against her sister (who, among other things, is a source of infuriatingly good advice), Kwan Li is telling her own story, one that sweeps us into the splendor, squalor, and violence of Manchu China. And out of the friction between her narrators, Amy Tan creates a work that illuminates both the present and the past sweetly, sadly, hilariously, with searing and vivid prose."], "author": "Amy Tan", "num_pages": "406", "awards": ["Orange Prize Nominee for Fiction Shortlist (1996)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-10-30 00:00:00", "ISBN": "080411109X"},
{"url": "https://www.goodreads.com/book/show/12555.The_Bonesetter_s_Daughter", "num_ratings": "108,747", "num_reviews": "3,108", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia"], "title": "The Bonesetter's Daughter", "description": ["Ruth Young and her widowed mother, LuLing, have always had a tumultuous relationship. Now, before she succumbs to forgetfulness, LuLing gives Ruth some of her writings, which reveal a side of LuLing that Ruth has never known. . . .", "In a remote mountain village where ghosts and tradition rule, LuLing grows up in the care of her mute Precious Auntie as the family endures a cu", "Ruth Young and her widowed mother, LuLing, have always had a tumultuous relationship. Now, before she succumbs to forgetfulness, LuLing gives Ruth some of her writings, which reveal a side of LuLing that Ruth has never known. . . .", "In a remote mountain village where ghosts and tradition rule, LuLing grows up in the care of her mute Precious Auntie as the family endures a curse laid upon a relative known as the bonesetter. When headstrong LuLing rejects the marriage proposal of the coffinmaker, a shocking series of events are set in motion–all of which lead back to Ruth and LuLing in modern San Francisco. The truth that Ruth learns from her mother’s past will forever change her perception of family, love, and forgiveness."], "author": "Amy Tan", "num_pages": "368", "awards": ["Orange Prize Nominee for Fiction Longlist (2001)"], "places": ["China", "San Francisco, California"], "character_names": ["Ruth Young", "LuLing", "Bibi Tersayang", "GaoLing"], "language": "English", "publish_date": "2003-02-04 00:00:00", "ISBN": "0345457374"},
{"url": "https://www.goodreads.com/book/show/18723.Brick_Lane", "num_ratings": "25,079", "num_reviews": "1,681", "avg_ratings": 3.4, "genres": ["Fiction", "Cultural", "India"], "title": "Brick Lane", "description": ["A captivating read from a debut novelist, ", " brings the immigrant milieu of East London to vibrant life. With great poignancy, Ali illuminates a foreign world; her well-developed characters pull readers along on a deeply psychological, almost spiritual journey. Through the eyes of two Bangladeshi sisters—the plain Nazneen and the prettier Hasina—we see the divergen", "A captivating read from a debut novelist, ", " brings the immigrant milieu of East London to vibrant life. With great poignancy, Ali illuminates a foreign world; her well-developed characters pull readers along on a deeply psychological, almost spiritual journey. Through the eyes of two Bangladeshi sisters—the plain Nazneen and the prettier Hasina—we see the divergent paths of the contemporary descendants of an ancient culture. Hasina elopes to a \"love marriage,\" and young Nazneen, in an arranged marriage, is pledged to a much older man living in London. ", "Ali's skillful narrative focuses on Nazneen's stifling life with her ineffectual husband, who keeps her imprisoned in a city housing project filled with immigrants in varying degrees of assimilation. But Ali reveals a bittersweet tension between the \"two kinds of love\" Nazneen and her sister experience—that which begins full and overflowing, only to slowly dissipate, and another which emerges like a surprise, growing unexpectedly over years of faithful commitment. Both of these loves have their own pitfalls: Hasina's passionate romance crumbles into domestic violence, and Nazneen's marriage never quite reaches a state of wedded bliss.", "Though comparisons have drawn between Ali and Zadie Smith, a better comparison might be made between this talented newcomer and the work of Amy Tan, who so deftly portrays the immigrant experience with empathy and joy."], "author": "Monica Ali", "num_pages": "432", "awards": ["Man Booker Prize Nominee (2003)", "Orange Prize Nominee for Fiction Longlist (2004)", "Guardian First Book Award Nominee (2003)", "Orwell Prize Nominee (2004)", "Audie Award for Fiction, Abridged (2004)", "Kiriyama Prize Nominee for Fiction (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-02 00:00:00", "ISBN": "0743243315"},
{"url": "https://www.goodreads.com/book/show/41681.The_Jungle", "num_ratings": "116,156", "num_reviews": "5,072", "avg_ratings": 3.73, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature", "Politics", "Academic", "School", "Novels", "Historical", "Classics", "Classic Literature", "Literature", "American"], "title": "The Jungle", "description": ["For nearly a century, the original version of Upton Sinclair's classic novel has remained almost entirely unknown. ", "When it was published in serial form in 1905, it was a full third longer than the censored, commercial edition published in book form the following year. That expurgated commercial edition edited out much of the ethnic flavor of the original, as well as some o", "For nearly a century, the original version of Upton Sinclair's classic novel has remained almost entirely unknown. ", "When it was published in serial form in 1905, it was a full third longer than the censored, commercial edition published in book form the following year. That expurgated commercial edition edited out much of the ethnic flavor of the original, as well as some of the goriest descriptions of the meat-packing industry and much of Sinclair's most pointed social and political commentary. ", "The text of this new edition is as it appeared in the original uncensored edition of 1905. ", "It contains the full 36 chapters as originally published, rather than the 31 of the expurgated edition. ", "A new foreword describes the discovery in the 1980s of the original edition and its subsequent suppression, and a new introduction places the novel in historical context by explaining the pattern of censorship in the shorter commercial edition."], "author": "Upton Sinclair", "num_pages": "335", "awards": [], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Jurgis", "Ona Lukoszaite", "Teta Elzbieta Lukoszaite"], "language": "English", "publish_date": "2003-04-01 00:00:00", "ISBN": "1884365302"},
{"url": "https://www.goodreads.com/book/show/85301.Unaccustomed_Earth", "num_ratings": "71,434", "num_reviews": "7,310", "avg_ratings": 4.12, "genres": ["Fiction", "Short Stories", "Cultural", "India", "Contemporary"], "title": "Unaccustomed Earth", "description": ["Eight stories—longer and more emotionally complex than any Lahiri has yet written—that take us from Cambridge and Seattle to India and Thailand as they enter the lives of sisters and brothers, fathers and mothers, daughters and sons, friends and lovers.", "From the internationally best-selling, Pulitzer Prize–winning author, a superbly crafted new work of fiction: eight storie", "Eight stories—longer and more emotionally complex than any Lahiri has yet written—that take us from Cambridge and Seattle to India and Thailand as they enter the lives of sisters and brothers, fathers and mothers, daughters and sons, friends and lovers.", "From the internationally best-selling, Pulitzer Prize–winning author, a superbly crafted new work of fiction: eight stories—longer and more emotionally complex than any she has yet written—that take us from Cambridge and Seattle to India and Thailand as they enter the lives of sisters and brothers, fathers and mothers, daughters and sons, friends and lovers.", "In the stunning title story, Ruma, a young mother in a new city, is visited by her father, who carefully tends the earth of her garden, where he and his grandson form a special bond. But he’s harboring a secret from his daughter, a love affair he’s keeping all to himself. In “A Choice of Accommodations,” a husband’s attempt to turn an old friend’s wedding into a romantic getaway weekend with his wife takes a dark, revealing turn as the party lasts deep into the night. In “Only Goodness,” a sister eager to give her younger brother the perfect childhood she never had is overwhelmed by guilt, anguish, and anger when his alcoholism threatens her family. And in “Hema and Kaushik,” a trio of linked stories—a luminous, intensely compelling elegy of life, death, love, and fate—we follow the lives of a girl and boy who, one winter, share a house in Massachusetts. They travel from innocence to experience on separate, sometimes painful paths, until destiny brings them together again years later in Rome. ", "Unaccustomed Earth is rich with Jhumpa Lahiri’s signature gifts: exquisite prose, emotional wisdom, and subtle renderings of the most intricate workings of the heart and mind. It is a masterful, dazzling work of a writer at the peak of her powers."], "author": "Jhumpa Lahiri", "num_pages": "352", "awards": ["Frank O'Connor International Short Story Award (2008)", "The Story Prize Nominee (2008)", "Commonwealth Writers' Prize for Best Book in South Asia and Europe (2009)", "Asian/Pacific American Award for Literature for Adult Fiction (2008)"], "places": [], "character_names": ["Ruma"], "language": "English", "publish_date": "2008-08-16 00:00:00", "ISBN": "0676979343"},
{"url": "https://www.goodreads.com/book/show/7362158-girl-in-translation", "num_ratings": "40,363", "num_reviews": "5,036", "avg_ratings": 3.97, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Contemporary", "Cultural", "China", "Adult Fiction"], "title": "Girl in Translation", "description": ["When Kimberly Chang and her mother emigrate from Hong Kong to Brooklyn squalor, she quickly begins a secret double life: exceptional schoolgirl during the day, Chinatown sweatshop worker in the evenings. Disguising the more di", "When Kimberly Chang and her mother emigrate from Hong Kong to Brooklyn squalor, she quickly begins a secret double life: exceptional schoolgirl during the day, Chinatown sweatshop worker in the evenings. Disguising the more difficult truths of her life like the staggering degree of her poverty, the weight of her family’s future resting on her shoulders, or her secret love for a factory boy who shares none of her talent or ambition. Kimberly learns to constantly translate not just her language but herself back and forth between the worlds she straddles.", "Through Kimberly’s story, author Jean Kwok, who also emigrated from Hong Kong as a young girl, brings to the page the lives of countless immigrants who are caught between the pressure to succeed in America, their duty to their family, and their own personal desires, exposing a world that we rarely hear about. ", "Written in an indelible voice that dramatizes the tensions of an immigrant girl growing up between two cultures, surrounded by a language and world only half understood, ", " is an unforgettable and classic novel of an American immigrant-a moving tale of hardship and triumph, heartbreak and love, and all that gets lost in translation."], "author": "Jean Kwok", "num_pages": "290", "awards": ["ALA Alex Award (2011)", "Lincoln Award Nominee (2016)", "Suburban Mosaic Book of the Year (2011)", "Chinese Library Association Best Book (2010)", "John Gardner Book Award Nominee for Fiction (2011)", "Goodreads Choice Award Nominee for Fiction, Debut Author (2010)"], "places": ["Brooklyn, New York City, New York"], "character_names": ["Kimberly Chang", "Aunt Paula", "Uncle Bob", "Matt Wu", "Annette Avery", "Curt"], "language": "English", "publish_date": "2010-04-29 00:00:00", "ISBN": "1594487561"},
{"url": "https://www.goodreads.com/book/show/12609.The_Spirit_Catches_You_and_You_Fall_Down", "num_ratings": "55,990", "num_reviews": "4,110", "avg_ratings": 4.15, "genres": ["Nonfiction", "Health", "Medicine", "Anthropology", "Medical", "Science"], "title": "The Spirit Catches You and You Fall Down: A Hmong Child, Her American Doctors, and the Collision of Two Cultures", "description": ["Lia Lee was born in 1981 to a family of recent Hmong immigrants, and soon developed symptoms of epilepsy. By 1988 she was living at home but was brain dead after a tragic cycle of misunderstanding, over-medication, and culture clash: \"What the doctors viewed as clinical efficiency the Hmong viewed as frosty arrogance.\" ", " is a tragedy", "Lia Lee was born in 1981 to a family of recent Hmong immigrants, and soon developed symptoms of epilepsy. By 1988 she was living at home but was brain dead after a tragic cycle of misunderstanding, over-medication, and culture clash: \"What the doctors viewed as clinical efficiency the Hmong viewed as frosty arrogance.\" ", " is a tragedy of Shakespearean dimensions, written with the deepest of human feeling. Sherwin Nuland said of the account, \"There are no villains in Fadiman's tale, just as there are no heroes. People are presented as she saw them, in their humility and their frailty--and their nobility.\""], "author": "Anne Fadiman", "num_pages": "341", "awards": ["Los Angeles Times Book Prize for Current Interest (1997)", "National Book Critics Circle Award for General Nonfiction (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1998-09-30 00:00:00", "ISBN": "0374525641"},
{"url": "https://www.goodreads.com/book/show/3591262-cutting-for-stone", "num_ratings": "304,871", "num_reviews": "23,928", "avg_ratings": 4.28, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Book Club", "Eastern Africa", "Ethiopia", "Health", "Medicine"], "title": "Cutting for Stone", "description": ["An unforgettable journey into one man's remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others set in 1960s & 1970s Ethiopia and 1980s America.", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon at a mission hospital in Addis Ababa. Orphaned by", "An unforgettable journey into one man's remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others set in 1960s & 1970s Ethiopia and 1980s America.", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon at a mission hospital in Addis Ababa. Orphaned by their mother’s death in childbirth and their father’s disappearance, bound together by a preternatural connection and a shared fascination with medicine, the twins come of age as Ethiopia hovers on the brink of revolution. Yet it will be love, not politics—their passion for the same woman—that will tear them apart and force Marion, fresh out of medical school, to flee his homeland. He makes his way to America, finding refuge in his work as an intern at an underfunded, overcrowded New York City hospital. When the past catches up to him—nearly destroying him—Marion must entrust his life to the two men he thought he trusted least in the world: the surgeon father who abandoned him and the brother who betrayed him. ", "An unforgettable journey into one man’s remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others."], "author": "Abraham Verghese", "num_pages": "541", "awards": ["PEN/Hemingway Foundation Award Nominee (2010)", "Exclusive Books Boeke Prize Nominee (2011)", "Indies Choice Book Award for Adult Fiction (2010)", "Dayton Literary Peace Prize Nominee for Fiction (2010)", "Wellcome Book Prize Nominee for Shortlist (2009)", "Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Addis Ababa"], "character_names": ["Thomas Stone", "Sister Mary Joseph Praise", "Marion Stone", "Shiva Stone"], "language": "English", "publish_date": "2009-02-03 00:00:00", "ISBN": "0375414495"},
{"url": "https://www.goodreads.com/book/show/44086.Maps_for_Lost_Lovers", "num_ratings": "2,463", "num_reviews": "335", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "Pakistan", "Cultural", "India", "European Literature", "British Literature", "Contemporary", "Literature"], "title": "Maps for Lost Lovers", "description": ["If Gabriel García Márquez had chosen to write about Pakistani immigrants in England, he might have produced a novel as beautiful and devastating as ", " ", "Jugnu and Chanda have disappeared. Like thousands of people all over England, they were lovers and living together out of wedlock. To Chanda’s family, however, the disgrace was unforgivable. Perhaps enough", "If Gabriel García Márquez had chosen to write about Pakistani immigrants in England, he might have produced a novel as beautiful and devastating as ", " ", "Jugnu and Chanda have disappeared. Like thousands of people all over England, they were lovers and living together out of wedlock. To Chanda’s family, however, the disgrace was unforgivable. Perhaps enough so as to warrant murder.As he explores the disappearance and its aftermath through the eyes of Jugnu’s worldly older brother, Shamas, and his devout wife, Kaukab, Nadeem Aslam creates a closely observed and affecting portrait of people whose traditions threaten to bury them alive. The result is a tour de force, intimate, affecting, tragic and suspenseful."], "author": "Nadeem Aslam", "num_pages": "400", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Kiriyama Prize for Fiction (2005)", "International DUBLIN Literary Award Nominee (2006)", "RSL Encore Award (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-09 00:00:00", "ISBN": "1400076978"},
{"url": "https://www.goodreads.com/book/show/2410616.Brother_I_m_Dying", "num_ratings": "4,742", "num_reviews": "704", "avg_ratings": 4.09, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Brother, I'm Dying", "description": ["This is the story of two brothers—and of a daughter's great love for them both.", "From the age of four, award-winning writer Edwidge Danticat came to think of her uncle Joseph as her “second father,” when she was placed in his care after her parents left Haiti for America. And so she was both elated and saddened when, at twelve, she joined her parents and younger brothers in", "This is the story of two brothers—and of a daughter's great love for them both.", "From the age of four, award-winning writer Edwidge Danticat came to think of her uncle Joseph as her “second father,” when she was placed in his care after her parents left Haiti for America. And so she was both elated and saddened when, at twelve, she joined her parents and younger brothers in New York City. As Edwidge adjusted to life in a new country, she and her family continued to fear for the safety of those still in Haiti as the political situation deteriorated.", "In 2004, they entered into a terrifying tale of good people caught up in events beyond their control. Their story made headlines around the world. ", " is an astonishing true-life epic, told on an intimate scale by one of our finest writers."], "author": "Edwidge Danticat", "num_pages": "272", "awards": ["Dayton Literary Peace Prize for Nonfiction (2008)", "National Book Critics Circle Award for Autobiography (2007)", "Hurston/Wright Legacy Award for Nonfiction (2008)", "National Book Award Finalist for Nonfiction (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-09 00:00:00", "ISBN": "1400034302"},
{"url": "https://www.goodreads.com/book/show/4952.What_Is_the_What", "num_ratings": "68,029", "num_reviews": "6,934", "avg_ratings": 4.16, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction"], "title": "What Is the What", "description": ["From the bestselling author of ", ", ", " is the epic novel based on the life of Valentino Achak Deng who, along with thousands of other children —the so-called Lost Boys—was forced to leave his village in Sudan at the age of seven and trek hundreds of miles by foot, pursued by militias, government bombers, and wild animals,", "From the bestselling author of ", ", ", " is the epic novel based on the life of Valentino Achak Deng who, along with thousands of other children —the so-called Lost Boys—was forced to leave his village in Sudan at the age of seven and trek hundreds of miles by foot, pursued by militias, government bombers, and wild animals, crossing the deserts of three countries to find freedom. When he finally is resettled in the United States, he finds a life full of promise, but also heartache and myriad new challenges. Moving, suspenseful, and unexpectedly funny, ", " is an astonishing novel that illuminates the lives of millions through one extraordinary man.", "-back cover"], "author": "Dave Eggers", "num_pages": "475", "awards": ["Independent Publisher Book Award (IPPY) for Literary Fiction (2007)", "Prix Médicis Etranger (2009)", "National Book Critics Circle Award Nominee for Fiction (2006)"], "places": ["Sudan", "Ethiopia", "Kakuma", "Marial Bai"], "character_names": [], "language": "English", "publish_date": "2006-10-18 00:00:00", "ISBN": "1932416641"},
{"url": "https://www.goodreads.com/book/show/764073.When_the_Emperor_Was_Divine", "num_ratings": "14,831", "num_reviews": "2,283", "avg_ratings": 3.72, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Japan", "Historical", "War", "World War II"], "title": "When the Emperor Was Divine", "description": ["Julie Otsuka's commanding debut novel paints a portrait of the Japanese internment camps unlike any we have ever seen. With crystalline intensity and precision, Otsuka uses a single family to evoke the deracination \"both physical and emotional\" of a generation of Japanese Americans. In five chapters, each flawlessly executed from a different point of view \"the mother recei", "Julie Otsuka's commanding debut novel paints a portrait of the Japanese internment camps unlike any we have ever seen. With crystalline intensity and precision, Otsuka uses a single family to evoke the deracination \"both physical and emotional\" of a generation of Japanese Americans. In five chapters, each flawlessly executed from a different point of view \"the mother receiving the order to evacuate; the daughter on the long train ride to the camp; the son in the desert encampment; the family's return to their home; and the bitter release of the father after more than four years in captivity\" she has created a small tour de force, a novel of unrelenting economy and suppressed emotion. Spare, intimate, arrestingly understated, ", " is a haunting evocation of a family in wartime and an unmistakably resonant lesson for our times. It heralds the arrival of a singularly gifted new novelist."], "author": "Julie Otsuka", "num_pages": "144", "awards": ["Orange Prize Nominee for Fiction Longlist (2003)", "ALA Alex Award (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-10-14 00:00:00", "ISBN": "0385721811"},
{"url": "https://www.goodreads.com/book/show/17241339-white-shanghai", "num_ratings": "97", "num_reviews": "21", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Cultural", "China", "Fiction", "Cultural", "Russia", "Cultural", "Asia"], "title": "White Shanghai: A Novel of the Roaring Twenties in China", "description": ["Some called the city the \"Splendor of the East\"; others the \"Whore of Asia\". A melting pot of different nations, fused by war and commerce, this was the Shanghai of the 1920s.", "The Great Powers are greedily exploiting China for its cheap labor and reaping the cruel rewards of the opium trade. However, as a flotilla of ships carrying the remnants of the defeated White Army en", "Some called the city the \"Splendor of the East\"; others the \"Whore of Asia\". A melting pot of different nations, fused by war and commerce, this was the Shanghai of the 1920s.", "The Great Powers are greedily exploiting China for its cheap labor and reaping the cruel rewards of the opium trade. However, as a flotilla of ships carrying the remnants of the defeated White Army enters Shanghai, the uneasy balance of this frenetic international marketplace comes under threat.", "Among the refugees is Klim Rogov, a journalist whose life and marriage have been destroyed by the Russian revolution - all he has left are his quick wits and a keen worldliness that will serve him well in navigating the lawless jungle of Shanghai. He finds work as a reporter in a British-run newspaper, rubbing shoulders with international gangsters while defying the intrigues of sinister communist agents, clinging all the time to the hope that someday he'll be reunited with his beloved wife, Nina."], "author": "Elvira Baryakina", "num_pages": "546", "awards": [], "places": ["Shanghai", "Шанхай", "Vladivostok", "Beijing", "Canton", "Guangzhou", "Nanjing"], "character_names": [], "language": "English", "publish_date": "2013-01-10 00:00:00", "ISBN": "1782670343"},
{"url": "https://www.goodreads.com/book/show/570540.A_Coal_Miner_s_Bride", "num_ratings": "4,347", "num_reviews": "214", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Historical"], "title": "A Coal Miner's Bride: The Diary of Anetka Kaminska, Lattimer, Pennsylvania, 1896", "description": ["A diary account of thirteen-year-old Anetka's life in Poland in 1896, immigration to America, marriage to a coal miner, widowhood, and happiness in finally finding her true love."], "author": "Susan Campbell Bartoletti", "num_pages": "219", "awards": [], "places": ["Lattimer, Pennsylvania"], "character_names": [], "language": null, "publish_date": "2000-08-16 00:00:00", "ISBN": "0439445612"},
{"url": "https://www.goodreads.com/book/show/3637.Bread_Givers", "num_ratings": "4,309", "num_reviews": "395", "avg_ratings": 3.69, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Literature", "Jewish", "Academic", "School", "Historical"], "title": "Bread Givers", "description": ["This masterwork of American immigrant literature is set in the 1920s on the Lower East Side of Manhattan and tells the story of Sara Smolinsky, the youngest daughter of an Orthodox rabbi, who rebels against her father's rigid conception of Jewish womanhood. Sarah's struggle towards independence and self-fulfillment resonates with a passion all can share. Beautifully redesi", "This masterwork of American immigrant literature is set in the 1920s on the Lower East Side of Manhattan and tells the story of Sara Smolinsky, the youngest daughter of an Orthodox rabbi, who rebels against her father's rigid conception of Jewish womanhood. Sarah's struggle towards independence and self-fulfillment resonates with a passion all can share. Beautifully redesigned page for page with the previous editions, ", " is an essential historical work with enduring relevance."], "author": "Anzia Yezierska", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-01 00:00:00", "ISBN": "0892552905"},
{"url": "https://www.goodreads.com/book/show/53969.The_Feast_of_the_Goat", "num_ratings": "19,222", "num_reviews": "1,561", "avg_ratings": 4.23, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "European Literature", "Spanish Literature", "Cultural", "Latin American"], "title": "The Feast of the Goat", "description": ["Haunted all her life by feelings of terror and emptiness, forty-nine-year-old Urania Cabral returns to her native Dominican Republic - and finds herself reliving the events of 1961, when the capital was still called Trujillo City and one old man terrorized a nation of three million. Rafael Trujillo, the depraved ailing dictator whom Dominicans call the Goat, controls his i", "Haunted all her life by feelings of terror and emptiness, forty-nine-year-old Urania Cabral returns to her native Dominican Republic - and finds herself reliving the events of 1961, when the capital was still called Trujillo City and one old man terrorized a nation of three million. Rafael Trujillo, the depraved ailing dictator whom Dominicans call the Goat, controls his inner circle with a combination of violence and blackmail. In Trujillo's gaudy palace, treachery and cowardice have become a way of life. But Trujillo's grasp is slipping. There is a conspiracy against him, and a Machiavellian revolution already underway that will have bloody consequences of its own. In this 'masterpiece of Latin American and world literature, and one of the finest political novels ever written' (\"Bookforum\"), Mario Vargas Llosa recounts the end of a regime and the birth of a terrible democracy, giving voice to the historical Trujillo and the victims, both innocent and complicit, drawn into his deadly orbit."], "author": "Mario Vargas Llosa", "num_pages": "475", "awards": ["Independent Foreign Fiction Prize Nominee for Shortlist (2003)"], "places": ["Dominican Republic"], "character_names": ["Urania Cabral", "Agustín Cabral", "Rafael Trujillo", "Johnny Abbes García", "Ramfis Trujillo", "Joaquín Balaguer", "Antonio Imbert Barrera", "Antonio de la Maza"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0571207766"},
{"url": "https://www.goodreads.com/book/show/292408.Angle_of_Repose", "num_ratings": "45,532", "num_reviews": "3,830", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Literature"], "title": "Angle of Repose", "description": ["Wallace Stegner's Pultizer Prize-winning novel is a story of discovery—personal, historical, and geographical. Confined to a wheelchair, retired historian Lyman Ward sets out to write his grandparents' remarkable story, chronicling their days spent carving civilization into the surface of America's western frontier. But his research reveals even more about his own life tha", "Wallace Stegner's Pultizer Prize-winning novel is a story of discovery—personal, historical, and geographical. Confined to a wheelchair, retired historian Lyman Ward sets out to write his grandparents' remarkable story, chronicling their days spent carving civilization into the surface of America's western frontier. But his research reveals even more about his own life than he's willing to admit. What emerges is an enthralling portrait of four generations in the life of an American family."], "author": "Wallace Stegner", "num_pages": "569", "awards": ["Pulitzer Prize for Fiction (1972)"], "places": ["American West", "California", "Idaho"], "character_names": ["Lyman Ward", "Susan Burling Ward", "Oliver Ward", "Rodman Ward", "Frank Sargent", "Ada Topham", "Shelly Rasmussen", "Ellen Ward"], "language": "English", "publish_date": "1992-05-28 00:00:00", "ISBN": "0140169300"},
{"url": "https://www.goodreads.com/book/show/294081.The_Mambo_Kings_Play_Songs_of_Love", "num_ratings": "10,634", "num_reviews": "452", "avg_ratings": 3.69, "genres": ["Fiction", "Music"], "title": "The Mambo Kings Play Songs of Love", "description": ["A Pulitzer Prize winning, bestselling sensation, Hijuelos captures in vivid and elegant prose the passion and poignancy of a world where the pulsing and rhythmic beat of the mambo imbues and fulfills dreams."], "author": "Oscar Hijuelos", "num_pages": "407", "awards": ["Pulitzer Prize for Fiction (1990)", "National Book Critics Circle Award Nominee for Fiction (1989)", "National Book Award Finalist for Fiction (1989)"], "places": ["New York City, New York", "Manhattan, New York City, New York"], "character_names": [], "language": "English", "publish_date": "1990-08-16 00:00:00", "ISBN": "0140143912"},
{"url": "https://www.goodreads.com/book/show/4370.Catfish_and_Mandala", "num_ratings": "4,621", "num_reviews": "504", "avg_ratings": 3.94, "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Cultural", "Asia"], "title": "Catfish and Mandala: A Two-Wheeled Voyage Through the Landscape and Memory of Vietnam", "description": [" is the story of an American odyssey—a solo bicycle voyage around the Pacific Rim to Vietnam—made by a young Vietnamese-American man in pursuit of both his adopted homeland and his forsaken fatherland. ", "Andrew X. Pham was born in Vietnam and raised in California. His father had been a POW of the Vietcong; his family came to America as \"boat people.\" Follo", " is the story of an American odyssey—a solo bicycle voyage around the Pacific Rim to Vietnam—made by a young Vietnamese-American man in pursuit of both his adopted homeland and his forsaken fatherland. ", "Andrew X. Pham was born in Vietnam and raised in California. His father had been a POW of the Vietcong; his family came to America as \"boat people.\" Following the suicide of his sister, Pham quit his job, sold all of his possessions, and embarked on a year-long bicycle journey that took him through the Mexican desert, around a thousand-mile loop from Narita to Kyoto in Japan; and, after five months and 2,357 miles, to Saigon, where he finds \"nothing familiar in the bombed-out darkness.\" In Vietnam, he's taken for Japanese or Korean by his countrymen, except, of course, by his relatives, who doubt that as a Vietnamese he has the stamina to complete his journey (\"Only Westerners can do it\"); and in the United States he's considered anything but American. A vibrant, picaresque memoir written with narrative flair and an eye-opening sense of adventure, ", " is an unforgettable search for cultural identity."], "author": "Andrew X. Pham", "num_pages": "344", "awards": ["Guardian First Book Award Nominee (2000)", "Oregon Book Award Nominee for Nonfiction (Finalist) (2000)", "Kiriyama Prize for Nonfiction (1999)"], "places": ["San Jose, California", "San Francisco, California", "Tokyo", "Phan Thiet", "Saigon", "Vung Tau", "Jakarta", "Rach Gia", "Mui Ne", "Hanoi", "Ninh Binh", "Hue", "Hoi An", "Qui Nhan", "Nha Trang"], "character_names": [], "language": "English", "publish_date": "2000-09-02 00:00:00", "ISBN": "0312267177"},
{"url": "https://www.goodreads.com/book/show/118944.American_Born_Chinese", "num_ratings": "57,628", "num_reviews": "6,641", "avg_ratings": 3.88, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Fiction", "Fantasy"], "title": "American Born Chinese", "description": ["All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...", "Born to rule over all the monkeys in the world, the story of the Monkey K", "All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...", "Born to rule over all the monkeys in the world, the story of the Monkey King is one of the oldest and greatest Chinese fables. Adored by his subjects, master of the arts of kung-fu, he is the most powerful monkey on earth. But the Monkey King doesn't want to be a monkey. He wants to be hailed as a god...", "Chin-Kee is the ultimate negative Chinese stereotype, and he's ruining his cousin Danny's life. Danny's a popular kid at school, but every year Chin-Kee comes to visit, and every year Danny has to transfer to a new school to escape the shame. This year, though, things quickly go from bad to worse...", "These three apparently unrelated tales come together with an unexpected twist, in a modern fable that is hilarious, poignant and action-packed. ", " is an amazing rise, all the way up to the astonishing climax--and confirms what a growing number of readers already know: Gene Yang is a major talent."], "author": "Gene Luen Yang", "num_pages": "240", "awards": ["Michael L. Printz Award (2007)", "James Cook Book Award Nominee (2007)", "Will Eisner Comic Industry Awards for Best Graphic Album - New (2007)", "National Book Award Finalist for Young People's Literature (2006)", "One Book One San Diego for Young Adult (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "1596431520"},
{"url": "https://www.goodreads.com/book/show/57586.Giants_in_the_Earth", "num_ratings": "4,541", "num_reviews": "456", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Literature"], "title": "Giants in the Earth", "description": [" (Norwegian: ", ") is a novel by Norwegian-American author Ole Edvart Rølvaag. First published in Norwegian as two books in 1924 and 1925, the English edition was translated by the author and Lincoln Colcord, each of whom also wrote prefatory matter.", "Part of a trilogy, the novel follows a Norwegian pioneer family's struggles with the land and the", " (Norwegian: ", ") is a novel by Norwegian-American author Ole Edvart Rølvaag. First published in Norwegian as two books in 1924 and 1925, the English edition was translated by the author and Lincoln Colcord, each of whom also wrote prefatory matter.", "Part of a trilogy, the novel follows a Norwegian pioneer family's struggles with the land and the elements of the Dakota Territory as they try to make a new life in America. The book is based partly on Rølvaag's personal experiences as a settler, and on the experiences of his wife’s family who had been immigrant homesteaders. The novel depicts snow storms, locusts, poverty, hunger, loneliness, homesickness, the difficulty of fitting into a new culture, and the estrangement of immigrant children who grow up in a new land.", " was turned into an opera by Douglas Moore and Arnold Sundgaard; it won the Pulitzer Prize for Music in 1951."], "author": "O.E. Rølvaag", "num_pages": "531", "awards": [], "places": ["Dakota Territory"], "character_names": [], "language": "English", "publish_date": "1999-08-04 00:00:00", "ISBN": "0060931930"},
{"url": "https://www.goodreads.com/book/show/18858850-the-many-loves-of-mila", "num_ratings": "33", "num_reviews": "12", "avg_ratings": 4.12, "genres": [], "title": "The Many Loves of Mila", "description": ["Mila Simon is having a meltdown. Newly separated from her investment banker husband, she chain-smokes in her Jewish immigrant parents’ backyard in a New Jersey suburb while she plots her return to the Manhattan social scene. Ignoring the advice of therapists and well-meaning married friends, Mila embarks heart-first on a dangerous dating binge with a cell phone in one hand", "Mila Simon is having a meltdown. Newly separated from her investment banker husband, she chain-smokes in her Jewish immigrant parents’ backyard in a New Jersey suburb while she plots her return to the Manhattan social scene. Ignoring the advice of therapists and well-meaning married friends, Mila embarks heart-first on a dangerous dating binge with a cell phone in one hand and a mojito in the other. Teetering on the edge the whole time, with only an opinionated Mama to rein her in, Mila is on a whirlwind quest for love and stability in the urban jungle."], "author": "Inna Swinton", "num_pages": "281", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/302998.The_Buddha_of_Suburbia", "num_ratings": "12,066", "num_reviews": "676", "avg_ratings": 3.72, "genres": ["Fiction", "Contemporary", "European Literature", "British Literature"], "title": "The Buddha of Suburbia", "description": ["Karim Amir lives with his English mother and Indian father in the routine comfort of suburban London, enduring his teenage years with good humor, always on the lookout for adventure and sexual possibilities. Life gets more interesting, however, when his father becomes the Buddha of Suburbia, beguiling a circle of would-be mystics. And when the Buddha falls in love with one", "Karim Amir lives with his English mother and Indian father in the routine comfort of suburban London, enduring his teenage years with good humor, always on the lookout for adventure and sexual possibilities. Life gets more interesting, however, when his father becomes the Buddha of Suburbia, beguiling a circle of would-be mystics. And when the Buddha falls in love with one of his disciples, the beautiful and brazen Eva, Karim is introduced to a world of renegade theater directors, punk rock stars, fancy parties, and all the sex a young man could desire. A love story for at least two generations, a high-spirited comedy of sexual manners and social turmoil, ", " is one of the most enchanting, provocative, and original books to appear in years."], "author": "Hanif Kureishi", "num_pages": "288", "awards": ["Whitbread Award for First Novel (1990)"], "places": ["United Kingdom"], "character_names": [], "language": "English", "publish_date": "1991-05-01 00:00:00", "ISBN": "014013168X"},
{"url": "https://www.goodreads.com/book/show/5941033-let-the-great-world-spin", "num_ratings": "83,495", "num_reviews": "8,566", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "New York", "Book Club"], "title": "Let the Great World Spin", "description": ["In the dawning light of a late-summer morning, the people of lower Manhattan stand hushed, staring up in disbelief at the Twin Towers. It is August 1974, and a mysterious tightrope walker is running, dancing, leaping between the towers, suspended a quarter mile above the ground. In the streets below, a slew of ordinary lives become extraordinary in bestselling novelist Col", "In the dawning light of a late-summer morning, the people of lower Manhattan stand hushed, staring up in disbelief at the Twin Towers. It is August 1974, and a mysterious tightrope walker is running, dancing, leaping between the towers, suspended a quarter mile above the ground. In the streets below, a slew of ordinary lives become extraordinary in bestselling novelist Colum McCann’s stunningly intricate portrait of a city and its people.", " is the critically acclaimed author’s most ambitious novel yet: a dazzlingly rich vision of the pain, loveliness, mystery, and promise of New York City in the 1970s.", "Corrigan, a radical young Irish monk, struggles with his own demons as he lives among the prostitutes in the middle of the burning Bronx. A group of mothers gather in a Park Avenue apartment to mourn their sons who died in Vietnam, only to discover just how much divides them even in grief. A young artist finds herself at the scene of a hit-and-run that sends her own life careening sideways. Tillie, a thirty-eight-year-old grandmother, turns tricks alongside her teenage daughter, determined not only to take care of her family but to prove her own worth.", "Elegantly weaving together these and other seemingly disparate lives, McCann’s powerful allegory comes alive in the unforgettable voices of the city’s people, unexpectedly drawn together by hope, beauty, and the “artistic crime of the century.” A sweeping and radical social novel, ", " captures the spirit of America in a time of transition, extraordinary promise, and, in hindsight, heartbreaking innocence. Hailed as a “fiercely original talent” (San Francisco Chronicle), award-winning novelist McCann has delivered a triumphantly American masterpiece that awakens in us a sense of what the novel can achieve, confront, and even heal."], "author": "Colum McCann", "num_pages": "351", "awards": ["National Book Award for Fiction (2009)", "Ambassador Book Award for Fiction (2010)", "NAIBA Book of the Year for Fiction (2010)", "Goodreads Choice Award Nominee for Fiction (2009)", "International DUBLIN Literary Award (2011)"], "places": ["New York City, New York", "Bronx, New York City, New York"], "character_names": ["Philippe Petit"], "language": "English", "publish_date": "2009-06-23 00:00:00", "ISBN": "1400063736"},
{"url": "https://www.goodreads.com/book/show/69719.Lucy", "num_ratings": "5,777", "num_reviews": "356", "avg_ratings": 3.75, "genres": ["Fiction", "Feminism", "Novels", "Young Adult", "Coming Of Age"], "title": "Lucy", "author": "Jamaica Kincaid", "num_pages": "163", "awards": [], "places": [], "character_names": [], "language": "French", "publish_date": "2002-11-06 00:00:00", "ISBN": "2253153818"},
{"url": "https://www.goodreads.com/book/show/316496.Oscar_and_Lucinda", "num_ratings": "17,807", "num_reviews": "785", "avg_ratings": 3.72, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Australia"], "title": "Oscar and Lucinda", "description": ["Peter Carey's Booker Prize winning novel imagines Australia's youth, before its dynamic passions became dangerous habits. It is also a startling and unusual love story. ", "Oscar is a young English clergyman who has broken with his past and developed a disturbing talent for gambling. A country girl of singular ambition, Lucinda moves to Sydney, driven by dreams of self-relianc", "Peter Carey's Booker Prize winning novel imagines Australia's youth, before its dynamic passions became dangerous habits. It is also a startling and unusual love story. ", "Oscar is a young English clergyman who has broken with his past and developed a disturbing talent for gambling. A country girl of singular ambition, Lucinda moves to Sydney, driven by dreams of self-reliance and the building of an industrial Utopia. Together this unlikely pair create and are created by the spectacle of mid-nineteenth century Australia. ", "Peter Carey's visionary brilliance, and his capacity to delight and surprise, propel this story to its stunning conclusion."], "author": "Peter Carey", "num_pages": "515", "awards": ["Man Booker Prize (1988)", "Miles Franklin Literary Award (1989)", "National Book Council Banjo Award for Fiction (1989)", "Colin Roderick Award (1988)", "The Best of the Booker Nominee (2008)"], "places": ["Sydney, New South Wales", "England"], "character_names": ["Oscar Hopkins", "Lucinda Leplastrier", "Reverend Dennis Hasset", "Hugh Stratton"], "language": "English", "publish_date": "1998-01-29 00:00:00", "ISBN": "0702229784"},
{"url": "https://www.goodreads.com/book/show/165035.The_Emigrants", "num_ratings": "3,773", "num_reviews": "254", "avg_ratings": 4.17, "genres": ["Historical", "Historical Fiction", "Classics", "Fiction", "European Literature", "Swedish Literature", "Cultural", "Sweden", "European Literature", "Scandinavian Literature"], "title": "The Emigrants", "description": ["Considered one of Sweden's greatest 20th-century writers, Vilhelm Moberg created Karl Oskar and Kristina Nilsson to portray the joys and tragedies of daily life for early Swedish pioneers in America. His consistently faithful depiction of these humble people's lives is a major strength of the Emigrant Novels.", "Moberg's extensive research in the papers of Swedish emigrants in", "Considered one of Sweden's greatest 20th-century writers, Vilhelm Moberg created Karl Oskar and Kristina Nilsson to portray the joys and tragedies of daily life for early Swedish pioneers in America. His consistently faithful depiction of these humble people's lives is a major strength of the Emigrant Novels.", "Moberg's extensive research in the papers of Swedish emigrants in archival collections, including the Minnesota Historical Society, enabled him to incorporate many details of pioneer life. First published between 1949 and 1959 in Swedish, these four books were considered a single work by Moberg, who intended that they be read as documentary novels. These editions contain introductions written by Roger McKnight, Gustavus Adolphus College, and restore Moberg's bibliography not included in earlier English editions.", "Book 1 introduces Karl Oskar and Kristina Nilsson, their three young children, and eleven others who make up a resolute party of Swedes fleeing the poverty, religious persecution, and social oppression of Smaland in 1850.", "\"It's important to have Moberg's Emigrant Novels available for another generation of readers.\" --Bruce Karstadt, American Swedish Institute"], "author": "Vilhelm Moberg", "num_pages": "366", "awards": [], "places": ["Småland", "Sweden"], "character_names": [], "language": "English", "publish_date": "1995-09-01 00:00:00", "ISBN": "0873513193"},
{"url": "https://www.goodreads.com/book/show/5942.Anil_s_Ghost", "num_ratings": "13,591", "num_reviews": "1,118", "avg_ratings": 3.55, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction", "Literature"], "title": "Anil's Ghost", "description": ["An alternate cover edition of this ISBN can be found ", ".", "With his first novel since the internationally acclaimed ", ", Booker Prize-winning author Michael Ondaatje gives us a work displaying all the richness of imagery and language and the piercing emotional truth that we have come to know as the hallmarks of his writing.", " transports us to Sri L", "An alternate cover edition of this ISBN can be found ", ".", "With his first novel since the internationally acclaimed ", ", Booker Prize-winning author Michael Ondaatje gives us a work displaying all the richness of imagery and language and the piercing emotional truth that we have come to know as the hallmarks of his writing.", " transports us to Sri Lanka, a country steeped in centuries of tradition, now forced into the late twentieth century by the ravages of civil war. Into this maelstrom steps Anil Tissera, a young woman born in Sri Lanka, educated in England and America, who returns to her homeland as a forensic anthropologist sent by an international human rights group to discover the source of the organized campaigns of murder engulfing the island. What follows is a story about love, about family, about identity, about the unknown enemy, about the quest to unlock the hidden past–a story propelled by a riveting mystery. Unfolding against the deeply evocative background of Sri Lanka’s landscape and ancient civilization, ", " is a literary spellbinder–Michael Ondaatje’s most powerful novel yet."], "author": "Michael Ondaatje", "num_pages": "311", "awards": ["Scotiabank Giller Prize (2000)", "Irish Times International Fiction Prize (2001)", "Prix Médicis Etranger (2000)", "Kiriyama Prize for Fiction (2000)"], "places": ["Sri Lanka"], "character_names": [], "language": "English", "publish_date": "2001-04-24 00:00:00", "ISBN": "0375724370"},
{"url": "https://www.goodreads.com/book/show/77034.Mama_s_Bank_Account", "num_ratings": "2,369", "num_reviews": "279", "avg_ratings": 4.2, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics"], "title": "Mama's Bank Account", "description": ["Mama's Bank Account (Harvest/HBJ Book)", "The charming adventures of the Mama of an immigrant Norwegian family living in San Francisco. This bestselling book inspired the play, motion picture, and television series I Remember Mama."], "author": "Kathryn Forbes", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1968-03-20 00:00:00", "ISBN": "0156563770"},
{"url": "https://www.goodreads.com/book/show/24468.On_Gold_Mountain", "num_ratings": "8,064", "num_reviews": "631", "avg_ratings": 3.93, "genres": ["Nonfiction", "Cultural", "China", "History", "Biography", "Autobiography", "Memoir"], "title": "On Gold Mountain: The One-Hundred-Year Odyssey of My Chinese-American Family", "description": ["When she was a girl, Lisa See spent summers in the cool, dark recesses of her family's antiques store in Los Angeles's Chinatown. There, her grand-mother and great-aunt told her intriguing, colorful stories about their family's past - stories of missionaries, concubines, tong wars, glamorous nightclubs, and the determined struggle to triumph over racist laws and discrimina", "When she was a girl, Lisa See spent summers in the cool, dark recesses of her family's antiques store in Los Angeles's Chinatown. There, her grand-mother and great-aunt told her intriguing, colorful stories about their family's past - stories of missionaries, concubines, tong wars, glamorous nightclubs, and the determined struggle to triumph over racist laws and discrimination. They spoke of how Lisa's great-great-grandfather emigrated from his Chinese village to the United States; how his son followed him, married a Caucasian woman, and despite great odds, went on to become one of the most prominent Chinese on \"Gold Mountain\" (the Chinese name for the United States). As an adult, See spent five years collecting the details of her family's remarkable history. She interviewed nearly one hundred relatives - both Chinese and Caucasian, rich and poor - and pored over documents at the National Archives, the immigration office, and in countless attics, basements, and closets for the intimate nuances of her ancestors' lives."], "author": "Lisa See", "num_pages": "394", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-08-27 00:00:00", "ISBN": "0679768521"},
{"url": "https://www.goodreads.com/book/show/32957.Caramelo", "num_ratings": "9,148", "num_reviews": "736", "avg_ratings": 3.88, "genres": ["Fiction", "Novels", "Historical", "Historical Fiction"], "title": "Caramelo", "description": ["Every year, Ceyala \"Lala\" Reyes' family--aunts, uncles, mothers, fathers, and Lala's six older brothers--packs up three cars and, in a wild ride, drive from Chicago to the Little Grandfather and Awful Grandmother's house in Mexico City for the summer. Struggling to find a voice above the boom of her brothers and to understand her place on this side of the border and that,", "Every year, Ceyala \"Lala\" Reyes' family--aunts, uncles, mothers, fathers, and Lala's six older brothers--packs up three cars and, in a wild ride, drive from Chicago to the Little Grandfather and Awful Grandmother's house in Mexico City for the summer. Struggling to find a voice above the boom of her brothers and to understand her place on this side of the border and that, Lala is a shrewd observer of family life. But when she starts telling the Awful Grandmother's life story, seeking clues to how she got to be so awful, grandmother accuses Lala of exaggerating. Soon, a multigenerational family narrative turns into a whirlwind exploration of storytelling, lies, and life. Like the cherished ", ", or shawl, that has been passed down through generations of Reyes women,", " is alive with the vibrations of history, family, and love."], "author": "Sandra Cisneros", "num_pages": "441", "awards": ["Orange Prize Nominee for Fiction Longlist (2003)", "International DUBLIN Literary Award Nominee (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-09-09 00:00:00", "ISBN": "0679742581"},
{"url": "https://www.goodreads.com/book/show/78728.Ignorance", "num_ratings": "14,339", "num_reviews": "977", "avg_ratings": 3.77, "genres": ["Fiction", "Novels", "Literature", "European Literature", "Czech Literature"], "title": "Ignorance", "author": "Milan Kundera", "num_pages": "195", "awards": ["Scott Moncrieff Prize for Linda Asher (2003)"], "places": ["Prague (Praha)"], "character_names": ["Josef", "Irena"], "language": "French", "publish_date": "2003-09-30 00:00:00", "ISBN": "0060002107"},
{"url": "https://www.goodreads.com/book/show/22136.Out_of_Place", "num_ratings": "1,948", "num_reviews": "210", "avg_ratings": 3.97, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir"], "title": "Out of Place", "description": ["Out of Place"], "author": "Edward W. Said", "num_pages": "295", "awards": ["Anisfield-Wolf Book Award (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-08-16 00:00:00", "ISBN": "1862073708"},
{"url": "https://www.goodreads.com/book/show/16923109-grace-s-pictures", "num_ratings": "458", "num_reviews": "104", "avg_ratings": 3.65, "genres": ["Christian Fiction", "Historical", "Historical Fiction", "Christian", "Historical", "Fiction", "Romance", "Christian Romance", "Romance"], "title": "Grace's Pictures", "description": ["Grace McCaffery hopes that the bustling streets of New York hold all the promise that the lush hills of Ireland did not. As her efforts to earn enough money to bring her mother to America fail, she wonders if her new Brownie camera could be the answer. But a casual stroll through a beautiful New York City park turns into a hostile run-in with local gangsters, who are convi", "Grace McCaffery hopes that the bustling streets of New York hold all the promise that the lush hills of Ireland did not. As her efforts to earn enough money to bring her mother to America fail, she wonders if her new Brownie camera could be the answer. But a casual stroll through a beautiful New York City park turns into a hostile run-in with local gangsters, who are convinced her camera holds the first and only photos of their elusive leader. A policeman with a personal commitment to help those less fortunate finds Grace attractive and longs to help her, but Grace believes such men cannot be trusted. Spread thin between her quest to rescue her mother, do well in a new nanny job, and avoid the gang intent on intimidating her. Grace must put her faith in unlikely sources to learn the true meaning of courage and forgiveness."], "author": "Cindy Thomson", "num_pages": "392", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2013-06-16 00:00:00", "ISBN": "1414368437"},
{"url": "https://www.goodreads.com/book/show/15852479-we-need-new-names", "num_ratings": "14,827", "num_reviews": "2,013", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "We Need New Names", "description": ["An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by", "An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by paramilitary policemen, before the school closed, before the fathers left for dangerous jobs abroad.", "But Darling has a chance to escape: she has an aunt in America. She travels to this new land in search of America's famous abundance only to find that her options as an immigrant are perilously few. NoViolet Bulawayo's debut calls to mind the great storytellers of displacement and arrival who have come before her--from Junot Diaz to Zadie Smith to J.M. Coetzee--while she tells a vivid, raw story all her own."], "author": "NoViolet Bulawayo", "num_pages": "298", "awards": ["Man Booker Prize Nominee (2013)", "Guardian First Book Award Nominee (2013)", "PEN/Hemingway Foundation Award (2014)", "Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee (2015)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)", "Betty Trask Award (2014)"], "places": ["Tsholotsho", "Detroit, Michigan", "bulawayo"], "character_names": [], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "0316230812"},
{"url": "https://www.goodreads.com/book/show/3679.On_Beauty", "num_ratings": "55,097", "num_reviews": "4,221", "avg_ratings": 3.71, "genres": ["Fiction", "Contemporary", "Novels"], "title": "On Beauty", "description": ["Howard Belsey, a Rembrandt scholar who doesn't like Rembrandt, is an Englishman abroad and a long-suffering professor at Wellington, a liberal New England arts college. He has been married for thirty years to Kiki, an American woman who no longer resembles the sexy activist she once was. Their three children passionately pursue their own paths: Levi quests after authentic", "Howard Belsey, a Rembrandt scholar who doesn't like Rembrandt, is an Englishman abroad and a long-suffering professor at Wellington, a liberal New England arts college. He has been married for thirty years to Kiki, an American woman who no longer resembles the sexy activist she once was. Their three children passionately pursue their own paths: Levi quests after authentic blackness, Zora believes that intellectuals can redeem everybody, and Jerome struggles to be a believer in a family of strict atheists. Faced with the oppressive enthusiasms of his children, Howard feels that the first two acts of his life are over and he has no clear plans for the finale. Or the encore.", "Then Jerome, Howard's older son, falls for Victoria, the stunning daughter of the right-wing icon Monty Kipps, and the two families find themselves thrown together in a beautiful corner of America, enacting a cultural and personal war against the background of real wars that they barely register. An infidelity, a death, and a legacy set in motion a chain of events that sees all parties forced to examine the unarticulated assumptions which underpin their lives. How do you choose the work on which to spend your life? Why do you love the people you love? Do you really believe what you claim to? And what is the beautiful thing, and how far will you go to get it?", "Set on both sides of the Atlantic, Zadie Smith's third novel is a brilliant analysis of family life, the institution of marriage, intersections of the personal and political, and an honest look at people's deceptions. It is also, as you might expect, very funny indeed."], "author": "Zadie Smith", "num_pages": "445", "awards": ["Man Booker Prize Nominee (2005)", "Orange Prize for Fiction (2006)", "Somerset Maugham Award (2006)", "Anisfield-Wolf Book Award (2006)", "Bollinger Everyman Wodehouse Prize Nominee for Comic Fiction (2006)", "Commonwealth Writers' Prize for Best Book in South Asia and Europe (2006)"], "places": [], "character_names": ["Howard Belsey", "Kiki Belsey", "Victoria Kipps", "Jerome Belsey"], "language": "English", "publish_date": "2006-08-29 00:00:00", "ISBN": "0143037749"},
{"url": "https://www.goodreads.com/book/show/818534.Molly_s_Pilgrim", "num_ratings": "851", "num_reviews": "123", "avg_ratings": 4.06, "genres": ["Historical", "Historical Fiction", "Childrens", "Picture Books", "Childrens", "Literature", "Jewish", "Fiction"], "title": "Molly's Pilgrim", "description": ["As Molly nears her first Thanksgiving in the New World, she doesn't find much to be thankful for. Her classmates giggle at her Yiddish accent and make fun of her unfamiliarity with American ways.", "Molly's embaras", "As Molly nears her first Thanksgiving in the New World, she doesn't find much to be thankful for. Her classmates giggle at her Yiddish accent and make fun of her unfamiliarity with American ways.", "Molly's embarassed when her mother helps with a class Thanksgiving project by making a little doll that looks more like a Russian refugee than a New England Pilgrim. But the tiny modern-day pilgrim just might help Molly to find a place for herself in America.", "The touching story tells how recent immigrant Molly leads her third-grade class to discover that it takes all kinds of pilgrims to make a Thanksgiving. Originally published in 1983, ", " inspired the 1986 Academy Award-winning live-action short film."], "author": "Barbara Cohen", "num_pages": "32", "awards": ["California Young Readers Medal Nominee for Primary (1988)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-26 00:00:00", "ISBN": "0688162800"},
{"url": "https://www.goodreads.com/book/show/18988165-annie-s-stories", "num_ratings": "153", "num_reviews": "73", "avg_ratings": 4.04, "genres": ["Christian Fiction", "Historical", "Historical Fiction", "Historical", "New York", "Fiction", "Christian Fiction", "Christian Historical Fiction", "Christian"], "title": "Annie’s Stories", "description": ["The year is 1901, the literary sensation The Wonderful Wizard of Oz is taking New York City by storm, and everyone wonders where the next great book will come from. But to Annie Gallagher, stories are more than entertainment—they’re a sweet reminder of her storyteller father. After his death, Annie fled Ireland for the land of dreams, finding work at Hawkins House.", "But when", "The year is 1901, the literary sensation The Wonderful Wizard of Oz is taking New York City by storm, and everyone wonders where the next great book will come from. But to Annie Gallagher, stories are more than entertainment—they’re a sweet reminder of her storyteller father. After his death, Annie fled Ireland for the land of dreams, finding work at Hawkins House.", "But when a fellow boarder with something to hide is accused of misconduct and authorities threaten to shut down the boardinghouse, Annie fears she may lose her new friends, her housekeeping job . . . and her means of funding her dream: a memorial library to honor her father. Furthermore, the friendly postman shows a little too much interest in Annie—and in her father’s unpublished stories. In fact, he suspects these tales may hold a grand secret.", "Though the postman’s intentions seem pure, Annie wants to share her father’s stories on her own terms. Determined to prove herself, Annie must forge her own path to aid her friend and create the future she’s always envisioned . . . where dreams really do come true."], "author": "Cindy Thomson", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-07-01 00:00:00", "ISBN": "1414368453"},
{"url": "https://www.goodreads.com/book/show/18329840-zeitoun", "num_ratings": "63,313", "num_reviews": "7,362", "avg_ratings": 4.08, "genres": ["Nonfiction", "Biography", "History", "Autobiography", "Memoir"], "title": "Zeitoun", "description": ["The true story of one family, caught between America’s two biggest policy disasters: the war on terror and the response to Hurricane Katrina.", "Abdulrahman and Kathy Zeitoun run a house-painting business in New Orleans. In August of 2005, as Hurricane Katrina approaches, Kathy evacuates with their four", "The true story of one family, caught between America’s two biggest policy disasters: the war on terror and the response to Hurricane Katrina.", "Abdulrahman and Kathy Zeitoun run a house-painting business in New Orleans. In August of 2005, as Hurricane Katrina approaches, Kathy evacuates with their four young children, leaving Zeitoun to watch over the business. In the days following the storm he travels the city by canoe, feeding abandoned animals and helping elderly neighbors. Then, on September 6th, police officers armed with M-16s arrest Zeitoun in his home. Told with eloquence and compassion, ", " is a riveting account of one family’s unthinkable struggle with forces beyond wind and water."], "author": "Dave Eggers", "num_pages": "351", "awards": ["American Book Award (2010)", "Los Angeles Times Book Prize for Current Interest (2009)", "Dayton Literary Peace Prize for Nonfiction (2010)", "Goodreads Choice Award Nominee for Nonfiction (2009)"], "places": ["New Orleans, Louisiana"], "character_names": [], "language": "English", "publish_date": "2009-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5587960-the-thing-around-your-neck", "num_ratings": "18,423", "num_reviews": "1,814", "avg_ratings": 4.21, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Contemporary", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "The Thing Around Your Neck", "description": ["Searing and profound, suffused with beauty, sorrow, and longing, the stories in The Thing Around Your Neck map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them.", "Chimamanda Ngozi Adichie burst onto the literary scene with her remarkable debut novel, Purple Hibiscus, which critics hailed as \"one of the b", "Searing and profound, suffused with beauty, sorrow, and longing, the stories in The Thing Around Your Neck map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them.", "Chimamanda Ngozi Adichie burst onto the literary scene with her remarkable debut novel, Purple Hibiscus, which critics hailed as \"one of the best novels to come out of Africa in years\" (Baltimore Sun), with \"prose as lush as the Nigerian landscape that it powerfully evokes\" (The Boston Globe); The Washington Post called her \"the twenty-first-century daughter of Chinua Achebe.\" Her award-winning Half of a Yellow Sun became an instant classic upon its publication three years later, once again putting her tremendous gifts - graceful storytelling, knowing compassion, and fierce insight into her characters' hearts - on display. Now, in her most intimate and seamlessly crafted work to date, Adichie turns her penetrating eye on not only Nigeria but America, in twelve dazzling stories that explore the ties that bind men and women, parents and children, Africa and the United States.", "In \"A Private Experience,\" a medical student hides from a violent riot with a poor Muslim woman whose dignity and faith force her to confront the realities and fears she's been pushing away. In \"Tomorrow is Too Far,\" a woman unlocks the devastating secret that surrounds her brother's death. The young mother at the center of \"Imitation\" finds her comfortable life in Philadelphia threatened when she learns that her husband has moved his mistress into their Lagos home. And the title story depicts the choking loneliness of a Nigerian girl who moves to an America that turns out to be nothing like the country she expected; though falling in love brings her desires nearly within reach, a death in her homeland forces her to reexamine them.", "Searing and profound, suffused with beauty, sorrow, and longing, these stories map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them. The Thing Around Your Neck is a resounding confirmation of the prodigious literary powers of one of our most essential writers."], "author": "Chimamanda Ngozi Adichie", "num_pages": "218", "awards": ["John Llewellyn Rhys Prize Nominee (2009)", "O. Henry Award for 'The American Embassy' (2003)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-16 00:00:00", "ISBN": "0307271072"},
{"url": "https://www.goodreads.com/book/show/18465852-the-book-of-unknown-americans", "num_ratings": "28,948", "num_reviews": "3,730", "avg_ratings": 3.87, "genres": ["Fiction", "Contemporary", "Audiobook"], "title": "The Book of Unknown Americans", "description": ["A dazzling, heartbreaking page-turner destined for breakout status: a novel that gives voice to millions of Americans as it tells the story of the love between a Panamanian boy and a Mexican girl: teenagers living in an apartment block of immigrant families like their own.", "After their daughter Maribel suffers a near-fatal accident, the Riveras leave México and come to Ameri", "A dazzling, heartbreaking page-turner destined for breakout status: a novel that gives voice to millions of Americans as it tells the story of the love between a Panamanian boy and a Mexican girl: teenagers living in an apartment block of immigrant families like their own.", "After their daughter Maribel suffers a near-fatal accident, the Riveras leave México and come to America. But upon settling at Redwood Apartments, a two-story cinderblock complex just off a highway in Delaware, they discover that Maribel's recovery--the piece of the American Dream on which they've pinned all their hopes--will not be easy. Every task seems to confront them with language, racial, and cultural obstacles.", "At Redwood also lives Mayor Toro, a high school sophomore whose family arrived from Panamá fifteen years ago. Mayor sees in Maribel something others do not: that beyond her lovely face, and beneath the damage she's sustained, is a gentle, funny, and wise spirit. But as the two grow closer, violence casts a shadow over all their futures in America.", "Peopled with deeply sympathetic characters, this poignant yet unsentimental tale of young love tells a riveting story of unflinching honesty and humanity that offers a resonant new definition of what it means to be an American. An instant classic is born."], "author": "Cristina Henriquez", "num_pages": "286", "awards": ["Andrew Carnegie Medal Nominee for Fiction (2015)", "Goodreads Choice Award Nominee for Fiction (2014)"], "places": [], "character_names": ["Arturo", "Mayor", "Maribel"], "language": "English", "publish_date": "2014-06-03 00:00:00", "ISBN": "0385350848"},
{"url": "https://www.goodreads.com/book/show/94669.The_Mistress_of_Spices", "num_ratings": "11,258", "num_reviews": "872", "avg_ratings": 3.48, "genres": ["Fiction", "Magical Realism", "Cultural", "India", "Fantasy", "Romance", "Asian Literature", "Indian Literature"], "title": "The Mistress of Spices", "description": ["Magical, tantalizing, and sensual, ", " is the story of Tilo, a young woman born in another time, in a faraway place, who is trained in the ancient art of spices and ordained as a mistress charged with special powers.  Once fully initiated in a rite of fire, the now immortal Tilo--in the gnarled and arthritic body of an old woman--travels through time to", "Magical, tantalizing, and sensual, ", " is the story of Tilo, a young woman born in another time, in a faraway place, who is trained in the ancient art of spices and ordained as a mistress charged with special powers.  Once fully initiated in a rite of fire, the now immortal Tilo--in the gnarled and arthritic body of an old woman--travels through time to Oakland, California, where she opens a shop from which she administers spices as curatives to her customers.  An unexpected romance with a handsome stranger eventually forces her to choose between the supernatural life of an immortal and the vicissitudes of modern life.  Spellbinding and hypnotizing, ", " is a tale of joy and sorrow and one special woman's magical powers."], "author": "Chitra Banerjee Divakaruni", "num_pages": "338", "awards": ["Orange Prize Nominee for Fiction Longlist (1997)", "IAFA William L. Crawford Fantasy Award (1998)"], "places": ["Oakland, California"], "character_names": [], "language": "English", "publish_date": "1998-02-17 00:00:00", "ISBN": "0385482388"},
{"url": "https://www.goodreads.com/book/show/30861.Woman_Hollering_Creek_and_Other_Stories", "num_ratings": "7,821", "num_reviews": "386", "avg_ratings": 4.03, "genres": ["Short Stories", "Fiction", "Feminism", "Poetry", "Literature"], "title": "Woman Hollering Creek and Other Stories", "description": ["From the author of the widely acclaimed The House on Mango Street comes a story collection of breathtaking range and authority, whose characters give voice to the vibrant and varied life on both sides of the Mexican border. The women in these stories offer tales of pure discovery, filled with moments of infinite and intimate wisdom."], "author": "Sandra Cisneros", "num_pages": "192", "awards": ["Anisfield-Wolf Book Award (1993)"], "places": [], "character_names": [], "language": "English", "publish_date": "1992-03-03 00:00:00", "ISBN": "0679738568"},
{"url": "https://www.goodreads.com/book/show/113143.Teacher_Man", "num_ratings": "27,656", "num_reviews": "2,186", "avg_ratings": 3.74, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Education", "Biography", "Autobiography"], "title": "Teacher Man: A Memoir", "description": ["Nearly a decade ago Frank McCourt became an unlikely star when, at the age of sixty-six, he burst onto the literary scene with ", " the Pulitzer Prize -- winning memoir of his childhood in Limerick, Ireland. Then came ", " his glorious account of his early years in New York.", "Now, here at last, is McCourt's long-awaited book about how his thirty-year teaching car", "Nearly a decade ago Frank McCourt became an unlikely star when, at the age of sixty-six, he burst onto the literary scene with ", " the Pulitzer Prize -- winning memoir of his childhood in Limerick, Ireland. Then came ", " his glorious account of his early years in New York.", "Now, here at last, is McCourt's long-awaited book about how his thirty-year teaching career shaped his second act as a writer. ", " is also an urgent tribute to teachers everywhere. In bold and spirited prose featuring his irreverent wit and heartbreaking honesty, McCourt records the trials, triumphs and surprises he faces in public high schools around New York City. His methods anything but conventional, McCourt creates a lasting impact on his students through imaginative assignments (he instructs one class to write \"An Excuse Note from Adam or Eve to God\"), singalongs (featuring recipe ingredients as lyrics), and field trips (imagine taking twenty-nine rowdy girls to a movie in Times Square!).", "McCourt struggles to find his way in the classroom and spends his evenings drinking with writers and dreaming of one day putting his own story to paper. ", " shows McCourt developing his unparalleled ability to tell a great story as, five days a week, five periods per day, he works to gain the attention and respect of unruly, hormonally charged or indifferent adolescents. McCourt's rocky marriage, his failed attempt to get a Ph.D. at Trinity College, Dublin, and his repeated firings due to his propensity to talk back to his superiors ironically lead him to New York's most prestigious school, Stuyvesant High School, where he finally finds a place and a voice. \"Doggedness,\" he says, is \"not as glamorous as ambition or talent or intellect or charm, but still the one thing that got me through the days and nights.\"", "For McCourt, storytelling itself is the source of salvation, and in ", " the journey to redemption -- and literary fame -- is an exhilarating adventure."], "author": "Frank McCourt", "num_pages": "258", "awards": ["Audie Award for Biography/Memoir (2007)"], "places": ["United States of America"], "character_names": ["Frank McCourt"], "language": "English", "publish_date": "2005-11-15 00:00:00", "ISBN": "0743243773"},
{"url": "https://www.goodreads.com/book/show/1271104.The_Road_Home", "num_ratings": "7,300", "num_reviews": "691", "avg_ratings": 3.85, "genres": ["Fiction", "Contemporary", "European Literature", "British Literature"], "title": "The Road Home", "description": ["Lev is on his way to Britain to seek work, so that he can send money back to eastern Europe to support his mother and little daughter. He struggles with the mysterious rituals of 'Englishness', and the fashions and fads of the London scene. We see the road Lev travels through his eyes, and we share his dilemmas."], "author": "Rose Tremain", "num_pages": "365", "awards": ["Orange Prize for Fiction (2008)", "Costa Book Award Nominee for Novel (2007)"], "places": ["London, England"], "character_names": ["Christy", "Rudi", "Ina", "GK Ashe", "Lidia", "Lev", "Maia"], "language": "English", "publish_date": "2007-08-28 00:00:00", "ISBN": "0701177934"},
{"url": "https://www.goodreads.com/book/show/4618728-honolulu", "num_ratings": "18,588", "num_reviews": "2,112", "avg_ratings": 4.03, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "Honolulu", "description": ["The story of a young immigrant bride in a ramshackle town that becomes a great modern city ", "The story of a young immigrant bride in a ramshackle town that becomes a great modern city "], "author": "Alan Brennert", "num_pages": "360", "awards": [], "places": ["Honolulu, Hawaii", "Hawaii"], "character_names": [], "language": "English", "publish_date": "2009-03-03 00:00:00", "ISBN": "0312360401"},
{"url": "https://www.goodreads.com/book/show/22034.The_Godfather", "num_ratings": "286,432", "num_reviews": "6,670", "avg_ratings": 4.37, "genres": ["Fiction", "Classics", "Mystery", "Crime", "Thriller", "Historical", "Historical Fiction"], "title": "The Godfather", "description": ["The Godfather—the epic tale of crime and betrayal that became a global phenomenon.", "Almost fifty years ago, a classic was born. A searing portrayal of the Mafia underworld, The Godfather introduced readers to the first family of American crime fiction, the Corleones, and their powerful legacy of tradition, blood, and honor. The seduction of power, the pitfalls of greed, and", "The Godfather—the epic tale of crime and betrayal that became a global phenomenon.", "Almost fifty years ago, a classic was born. A searing portrayal of the Mafia underworld, The Godfather introduced readers to the first family of American crime fiction, the Corleones, and their powerful legacy of tradition, blood, and honor. The seduction of power, the pitfalls of greed, and the allegiance to family—these are the themes that have resonated with millions of readers around the world and made The Godfather the definitive novel of the violent subculture that, steeped in intrigue and controversy, remains indelibly etched in our collective consciousness.", "~penguin.com"], "author": "Mario Puzo", "num_pages": "448", "awards": [], "places": ["United States of America", "New York (the state)", "Sicily"], "character_names": ["Don Vito Corleone", "Michael \"Mike\" Corleone", "Santino \"Sonny\" Corleone", "Constanzia \"Connie\" Corleone", "Fredo \"Freddie\" Corleone", "Tom Hagen", "Johnny Fontane", "Peter \"Pete\" Clemenza", "Al Neri", "Rocco Lampone", "Luca Brasi"], "language": "English", "publish_date": "2002-03-01 00:00:00", "ISBN": "0451205766"},
{"url": "https://www.goodreads.com/book/show/9516.Persepolis", "num_ratings": "131,716", "num_reviews": "7,505", "avg_ratings": 4.24, "genres": ["Sequential Art", "Graphic Novels", "Nonfiction", "Autobiography", "Memoir", "Sequential Art", "Comics", "Biography"], "title": "Persepolis: The Story of a Childhood", "description": ["A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, ye", "A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, years that saw the overthrow of the Shah’s regime, the triumph of the Islamic Revolution, and the devastating effects of war with Iraq. The intelligent and outspoken only child of committed Marxists and the great-granddaughter of one of Iran’s last emperors, Marjane bears witness to a childhood uniquely entwined with the history of her country.", " paints an unforgettable portrait of daily life in Iran and of the bewildering contradictions between home life and public life. Marjane’s child’s-eye view of dethroned emperors, state-sanctioned whippings, and heroes of the revolution allows us to learn as she does the history of this fascinating country and of her own extraordinary family. Intensely personal, profoundly political, and wholly original, ", " is at once a story of growing up and a reminder of the human cost of war and political repression. It shows how we carry on, with laughter and tears, in the face of absurdity. And, finally, it introduces us to an irresistible little girl with whom we cannot help but fall in love."], "author": "Marjane Satrapi", "num_pages": "153", "awards": ["Harvey Awards for Best US Edition of Foreign Material (2004)", "ALA Alex Award (2004)", "Prix du Festival d'Angoulême for Alph-art du coup de coeur (2001)"], "places": ["Iran, Islamic Republic of", "Tehran", "Persia"], "character_names": [], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "037571457X"},
{"url": "https://www.goodreads.com/book/show/187181.The_Chosen", "num_ratings": "76,973", "num_reviews": "3,761", "avg_ratings": 4.04, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Young Adult", "Literature", "Jewish", "Religion", "Literature"], "title": "The Chosen", "description": ["It is the now-classic story of two fathers and two sons and the pressures on all of them to pursue the religion they share in the way that is best suited to each. And as the boys grow into young men, they discover in the other a lost spiritual brother, and a link to an unexplored world that neither had ever considered before. In effect, they exchange places, and find the p", "It is the now-classic story of two fathers and two sons and the pressures on all of them to pursue the religion they share in the way that is best suited to each. And as the boys grow into young men, they discover in the other a lost spiritual brother, and a link to an unexplored world that neither had ever considered before. In effect, they exchange places, and find the peace that neither will ever retreat from again. . . ."], "author": "Chaim Potok", "num_pages": "304", "awards": ["Edward Lewis Wallant Award (1967)", "National Book Award Finalist for Fiction (1968)"], "places": ["Brooklyn, New York City, New York", "Williamsburg, Brooklyn, New York"], "character_names": ["Reuven Malter", "Danny Saunders"], "language": "English", "publish_date": "1987-04-12 00:00:00", "ISBN": "0449213447"},
{"url": "https://www.goodreads.com/book/show/23745495-milena", "num_ratings": "50", "num_reviews": "5", "avg_ratings": 4.24, "genres": ["Fiction"], "title": "Milena: & Other Social Reforms", "description": ["Now available in English, in this bestselling political thriller-drama, MILENA is a young woman, who thinks she has it all when she lands a job as the President's interpreter. Bright, beautiful, willing to take a chance, she is the embodiment of the new Eastern Europe. But a bold new future comes at a cost. As her country suffers the growing pains of greed, Milena is caugh", "Now available in English, in this bestselling political thriller-drama, MILENA is a young woman, who thinks she has it all when she lands a job as the President's interpreter. Bright, beautiful, willing to take a chance, she is the embodiment of the new Eastern Europe. But a bold new future comes at a cost. As her country suffers the growing pains of greed, Milena is caught up in the machinery of crime, corruption and human trafficking. Will love buy her a way out, or will she, like so many flowers of Montenegro, be lost in the profits of her enemies? 'Knezevic's fiction is so tremendously powerful, perhaps also because it is based in truth,' J. Pogacnik, Jutarnji List."], "author": "Olja Knezevic", "num_pages": "258", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-13 00:00:00", "ISBN": "1503218155"},
{"url": "https://www.goodreads.com/book/show/5324960-i-love-yous-are-for-white-people", "num_ratings": "6,807", "num_reviews": "247", "avg_ratings": 3.47, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Literature", "Asian Literature", "Cultural", "Asia", "Biography Memoir", "Adult", "Race", "History", "Young Adult", "Coming Of Age"], "title": "I Love Yous Are for White People", "description": ["As a young child, Lac Su made a harrowing escape from the Communists in Vietnam. With a price on his father's head, Lac, with his family, was forced to immigrate in 1979 to seedy West Los Angeles where squalid living conditions and a cultural fabric that refused to thread them in effectively squashed their American Dream. Lac's search for love and acceptance amid poverty—n", "As a young child, Lac Su made a harrowing escape from the Communists in Vietnam. With a price on his father's head, Lac, with his family, was forced to immigrate in 1979 to seedy West Los Angeles where squalid living conditions and a cultural fabric that refused to thread them in effectively squashed their American Dream. Lac's search for love and acceptance amid poverty—not to mention the psychological turmoil created by a harsh and unrelenting father—turned his young life into a comedy of errors and led him to a dangerous gang experience that threatened to tear his life apart.", " ", "Heart-wrenching, irreverent, and ultimately uplifting, ", " is memoir at its most affecting, depicting the struggles that countless individuals have faced in their quest to belong and that even more have endured in pursuit of a father's fleeting affection."], "author": "Lac Su", "num_pages": "272", "awards": ["San Diego Theodor S. Geisel Award (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-12 00:00:00", "ISBN": "0061543667"},
{"url": "https://www.goodreads.com/book/show/3698.The_Quiet_American", "num_ratings": "37,990", "num_reviews": "2,451", "avg_ratings": 3.96, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "War", "Literature"], "title": "The Quiet American", "description": ["\"I never knew a man who had better motives for all the trouble he caused,\" Graham Greene's narrator Fowler remarks of Alden Pyle, the eponymous \"Quiet American\" of what is perhaps the most controversial novel of his career. Pyle is the brash young idealist sent out by Washington on a mysterious", "\"I never knew a man who had better motives for all the trouble he caused,\" Graham Greene's narrator Fowler remarks of Alden Pyle, the eponymous \"Quiet American\" of what is perhaps the most controversial novel of his career. Pyle is the brash young idealist sent out by Washington on a mysterious mission to Saigon, where the French Army struggles against the Vietminh guerrillas. As young Pyle's well-intentioned policies blunder into bloodshed, Fowler, a seasoned and cynical British reporter, finds it impossible to stand safely aside as an observer. But Fowler's motives for intervening are suspect, both to the police and himself, for Pyle has stolen Fowler's beautiful Vietnamese mistress.", "Originally published in 1956 and twice adapted to film, ", " remains a terrifiying and prescient portrait of innocence at large. This Graham Greene Centennial Edition includes a new introductory essay by Robert Stone."], "author": "Graham Greene", "num_pages": "180", "awards": [], "places": ["Vietnam"], "character_names": ["Thomas Fowler", "Alden Pyle", "Phuong", "Vigot"], "language": "English", "publish_date": "2004-08-31 00:00:00", "ISBN": "0143039024"},
{"url": "https://www.goodreads.com/book/show/42697.Exodus", "num_ratings": "83,518", "num_reviews": "1,566", "avg_ratings": 4.34, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Historical", "Cultural", "Israel", "Literature", "Jewish"], "title": "Exodus", "description": [" is an international publishing phenomenon--the towering novel of the twentieth century's most dramatic geopolitical event. Leon Uris magnificently portrays the birth of a new nation in the midst of enemies--the beginning of an earthshaking struggle for power. Here is the tale that swept the world with its fury: the story of an American nurse, an Israeli freedom figh", " is an international publishing phenomenon--the towering novel of the twentieth century's most dramatic geopolitical event. Leon Uris magnificently portrays the birth of a new nation in the midst of enemies--the beginning of an earthshaking struggle for power. Here is the tale that swept the world with its fury: the story of an American nurse, an Israeli freedom fighter caught up in a glorious, heartbreaking, triumphant era."], "author": "Leon Uris", "num_pages": "608", "awards": ["National Jewish Book Award for Fiction (1959)"], "places": ["Israel", "Cyprus"], "character_names": [], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0553258478"},
{"url": "https://www.goodreads.com/book/show/28920.A_Pale_View_of_Hills", "num_ratings": "13,953", "num_reviews": "1,321", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Japan", "Historical", "Historical Fiction", "Asian Literature", "Japanese Literature"], "title": "A Pale View of Hills", "description": ["In his highly acclaimed debut, A Pale View of Hills, Kazuo Ishiguro tells the story of Etsuko, a Japanese woman now living alone in England, dwelling on the recent suicide of her daughter. Retreating into the past, she finds herself reliving one particular hot summer in Nagasaki, when she and her friends struggled to rebuild their lives after the war. But then as she recal", "In his highly acclaimed debut, A Pale View of Hills, Kazuo Ishiguro tells the story of Etsuko, a Japanese woman now living alone in England, dwelling on the recent suicide of her daughter. Retreating into the past, she finds herself reliving one particular hot summer in Nagasaki, when she and her friends struggled to rebuild their lives after the war. But then as she recalls her strange friendship with Sachiko - a wealthy woman reduced to vagrancy - the memories take on a disturbing cast."], "author": "Kazuo Ishiguro", "num_pages": "183", "awards": ["Winifred Holtby Memorial Prize (1982)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-03 00:00:00", "ISBN": "0571225373"},
{"url": "https://www.goodreads.com/book/show/531989.Drown", "num_ratings": "28,128", "num_reviews": "2,234", "avg_ratings": 4.05, "genres": ["Short Stories", "Fiction", "Contemporary", "Literature"], "title": "Drown", "description": ["With ten stories that move from the barrios of the Dominican Republic to the struggling urban communities of New Jersey, Junot Diaz makes his remarkable debut. Diaz's work is unflinching and strong, and these stories crackle with an electric sense of discovery. Diaz evokes a world in which fathers are gone, mothers fight with grim determination for their families and thems", "With ten stories that move from the barrios of the Dominican Republic to the struggling urban communities of New Jersey, Junot Diaz makes his remarkable debut. Diaz's work is unflinching and strong, and these stories crackle with an electric sense of discovery. Diaz evokes a world in which fathers are gone, mothers fight with grim determination for their families and themselves, and the next generation inherits the casual cruelty, devastating ambivalence, and knowing humor of lives circumscribed by poverty and uncertainty. In ", ", Diaz has harnessed the rhythms of anger and release, frustration and joy, to indelible effect."], "author": "Junot Díaz", "num_pages": "208", "awards": [], "places": ["Dominican Republic", "New Jersey"], "character_names": ["Yunior de Las Casas"], "language": "English", "publish_date": "1997-07-01 00:00:00", "ISBN": "1573226068"},
{"url": "https://www.goodreads.com/book/show/49465.Those_Who_Save_Us", "num_ratings": "83,629", "num_reviews": "6,199", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Fiction", "World War II", "Holocaust", "War", "World War II", "Historical"], "title": "Those Who Save Us", "description": ["For fifty years, Anna Schlemmer has refused to talk about her life in Germany during World War II. Her daughter, Trudy, was only three when she and her mother were liberated by an American soldier and went to live with him in Minnesota. Trudy's sole evidence of the past is an old photograph: a family portrait showing Anna, Trudy, and a Nazi officer, the Obersturmfuhrer of", "For fifty years, Anna Schlemmer has refused to talk about her life in Germany during World War II. Her daughter, Trudy, was only three when she and her mother were liberated by an American soldier and went to live with him in Minnesota. Trudy's sole evidence of the past is an old photograph: a family portrait showing Anna, Trudy, and a Nazi officer, the Obersturmfuhrer of Buchenwald.", "Driven by the guilt of her heritage, Trudy, now a professor of German history, begins investigating the past and finally unearths the dramatic and heartbreaking truth of her mother's life.", "Combining a passionate, doomed love story, a vivid evocation of life during the war, and a poignant mother/daughter drama, ", " is a profound exploration of what we endure to survive and the legacy of shame."], "author": "Jenna Blum", "num_pages": "479", "awards": [], "places": ["Minneapolis, Minnesota", "Weimar"], "character_names": ["Anna Schlemmer"], "language": "English", "publish_date": "2005-05-02 00:00:00", "ISBN": "0156031663"},
{"url": "https://www.goodreads.com/book/show/25419.When_I_Was_Puerto_Rican", "num_ratings": "8,960", "num_reviews": "590", "avg_ratings": 4.0, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography"], "title": "When I Was Puerto Rican", "description": ["Esmeralda Santiago's story begins in rural Puerto Rico, where her childhood was full of both tenderness and domestic strife, tropical sounds and sights as well as poverty. Growing up, she learned the proper way to eat a guava, the sound of tree frogs in the mango groves at night, the taste of the delectable sausage called morcilla, and the formula for ushering a dead baby'", "Esmeralda Santiago's story begins in rural Puerto Rico, where her childhood was full of both tenderness and domestic strife, tropical sounds and sights as well as poverty. Growing up, she learned the proper way to eat a guava, the sound of tree frogs in the mango groves at night, the taste of the delectable sausage called morcilla, and the formula for ushering a dead baby's soul to heaven. As she enters school we see the clash, both hilarious and fierce, of Puerto Rican and Yankee culture. When her mother, Mami, a force of nature, takes off to New York with her seven, soon to be eleven children, Esmeralda, the oldest, must learn new rules, a new language, and eventually take on a new identity. In this first volume of her much-praised, bestselling trilogy, Santiago brilliantly recreates the idyllic landscape and tumultuous family life of her earliest years and her tremendous journey from the barrio to Brooklyn, from translating for her mother at the welfare office to high honors at Harvard."], "author": "Esmeralda Santiago", "num_pages": "274", "awards": [], "places": ["Santurce, San Juan", "New York (the state)"], "character_names": [], "language": "English", "publish_date": "1994-10-11 00:00:00", "ISBN": "0679756760"},
{"url": "https://www.goodreads.com/book/show/828387.A_Short_History_of_Tractors_in_Ukrainian", "num_ratings": "23,056", "num_reviews": "2,398", "avg_ratings": 3.38, "genres": ["Fiction", "Contemporary", "Humor"], "title": "A Short History of Tractors in Ukrainian", "description": [" was bestselling author Marina Lewycka's bestselling debut novel which has sold over one million copies worldwide. Lewycka tells the side-splittingly funny story of two feuding sisters, Vera and Nadezhda, who join forces against their father's new, gold-digging girlfriend.", " was bestselling author Marina Lewycka's bestselling debut novel which has sold over one million copies worldwide. Lewycka tells the side-splittingly funny story of two feuding sisters, Vera and Nadezhda, who join forces against their father's new, gold-digging girlfriend.", "Sisters Vera and Nadezhda must aside a lifetime of feuding to save their émigré engineer father from voluptuous gold-digger Valentina. With her proclivity for green satin underwear and boil-in-the-bag cuisine, she will stop at nothing in her pursuit of Western wealth.", "But the sisters' campaign to oust Valentina unearths family secrets, uncovers fifty years of Europe's darkest history and sends them back to roots they'd much rather forget . . . ."], "author": "Marina Lewycka", "num_pages": "326", "awards": ["Man Booker Prize Nominee for Longlist (2005)", "Orange Prize Nominee for Fiction Shortlist (2005)", "Bollinger Everyman Wodehouse Prize for Comic Fiction (2005)", "Saga Award (2005)"], "places": [], "character_names": ["Nikolai Mayevskyj", "Vera", "Mike", "Nadezhda", "Valentina"], "language": "English", "publish_date": "2006-08-28 00:00:00", "ISBN": "0141020520"},
{"url": "https://www.goodreads.com/book/show/781820.Bless_Me_Ultima", "num_ratings": "22,687", "num_reviews": "1,952", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "Young Adult", "Magical Realism", "Academic", "School"], "title": "Bless Me, Ultima", "description": ["Antonio Marez is six years old when Ultima comes to stay with his family in New Mexico. She is a curandera, one who cures with herbs and magic. Under her wise wing, Tony will probe the family tie", "Antonio Marez is six years old when Ultima comes to stay with his family in New Mexico. She is a curandera, one who cures with herbs and magic. Under her wise wing, Tony will probe the family ties that bind and rend him, and he will discover himself in the magical secrets of the pagan past--a mythic legacy as palpable as the Catholicism of Latin America. And at each life turn there is Ultima, who delivered Tony into the world...and will nurture the birth of his soul.", "The winner of the 2015 National Humanities Medal, Rudolfo Anaya is acclaimed as the father of Chicano literature in English and for his rich and compassionate writing about the Mexican-American experience. "], "author": "Rudolfo Anaya", "num_pages": "272", "awards": ["Premio Quinto Sol"], "places": ["United States of America", "New Mexico"], "character_names": ["Antonio Marez", "Ultima, la Grande", "Tenorio", "Narciso"], "language": "English", "publish_date": "1994-04-01 00:00:00", "ISBN": "0446600253"},
{"url": "https://www.goodreads.com/book/show/14891.A_Tree_Grows_in_Brooklyn", "num_ratings": "330,044", "num_reviews": "17,299", "avg_ratings": 4.25, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Young Adult"], "title": "A Tree Grows in Brooklyn", "description": ["The beloved American classic about a young girl's coming-of-age at the turn of the century, Betty Smith's ", " is a poignant and moving tale filled with compassion and cruelty, laughter and heartache, crowded with life and people and incident. The story of young, sensitive, and idealistic Francie Nolan and her bittersweet formative years in the slums of", "The beloved American classic about a young girl's coming-of-age at the turn of the century, Betty Smith's ", " is a poignant and moving tale filled with compassion and cruelty, laughter and heartache, crowded with life and people and incident. The story of young, sensitive, and idealistic Francie Nolan and her bittersweet formative years in the slums of Williamsburg has enchanted and inspired millions of readers for more than sixty years. By turns overwhelming, sublime, heartbreaking, and uplifting, the daily experiences of the unforgettable Nolans are raw with honesty and tenderly threaded with family connectedness -- in a work of literary art that brilliantly captures a unique time and place as well as incredibly rich moments of universal experience."], "author": "Betty  Smith", "num_pages": "496", "awards": ["Audie Award for Classic (2002)"], "places": ["Brooklyn, New York City, New York", "Williamsburg, Brooklyn, New York"], "character_names": ["Francie Nolan", "Neeley Nolan", "Katie Nolan", "Johnny Nolan", "Mary Rommely", "Sissy Rommely", "Eva \"Evy\" Rommely Flittman", "Thomas Rommely"], "language": "English", "publish_date": "2006-05-30 00:00:00", "ISBN": "0061120073"},
{"url": "https://www.goodreads.com/book/show/44001.Small_Island", "num_ratings": "21,607", "num_reviews": "1,345", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical"], "title": "Small Island", "description": ["Hortense Joseph arrives in London from Jamaica in 1948 with her life in her suitcase, her heart broken, her resolve intact. Her husband, Gilbert Joseph, returns from the war expecting to be received as a hero, but finds his status as a black man in Britain to be second class. His white landlady, Queenie, raised as a farmer's daughter, befriends Gilbert, and later Hortense,", "Hortense Joseph arrives in London from Jamaica in 1948 with her life in her suitcase, her heart broken, her resolve intact. Her husband, Gilbert Joseph, returns from the war expecting to be received as a hero, but finds his status as a black man in Britain to be second class. His white landlady, Queenie, raised as a farmer's daughter, befriends Gilbert, and later Hortense, with innocence and courage, until the unexpected arrival of her husband, Bernard, who returns from combat with issues of his own to resolve. ", "Told in these four voices, ", "is a courageous novel of tender emotion and sparkling wit, of crossings taken and passages lost, of shattering compassion and of reckless optimism in the face of insurmountable barriers---in short, an encapsulation of the immigrant's life."], "author": "Andrea Levy", "num_pages": "441", "awards": ["Orange Prize for Fiction (2004)", "Whitbread Award for Novel and Book of the Year (2004)", "Commonwealth Writers' Prize for Best Book Overall (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-01 00:00:00", "ISBN": "0312424671"},
{"url": "https://www.goodreads.com/book/show/46349.Funny_in_Farsi", "num_ratings": "15,863", "num_reviews": "2,280", "avg_ratings": 3.78, "genres": ["Autobiography", "Memoir", "Nonfiction", "Humor", "Biography"], "title": "Funny in Farsi: A Memoir of Growing Up Iranian in America", "description": ["In 1972, when she was seven, Firoozeh Dumas and her family moved from Iran to Southern California, arriving with no firsthand knowledge of this country beyond her father's glowing memories of his graduate school years here. More family soon followed, and the clan has been here ever since. ", " chronicles the American journey of Dumas's wonderfully engaging family", "In 1972, when she was seven, Firoozeh Dumas and her family moved from Iran to Southern California, arriving with no firsthand knowledge of this country beyond her father's glowing memories of his graduate school years here. More family soon followed, and the clan has been here ever since. ", " chronicles the American journey of Dumas's wonderfully engaging family: her engineer father, a sweetly quixotic dreamer who first sought riches on ", " and in Las Vegas, and later lost his job during the Iranian revolution; her elegant mother, who never fully mastered English (nor cared to); her uncle, who combated the effects of American fast food with an army of miraculous American weight-loss gadgets; and Firoozeh herself, who as a girl changed her name to Julie, and who encountered a second wave of culture shock when she met and married a Frenchman, becoming part of a one-couple melting pot."], "author": "Firoozeh Dumas", "num_pages": "240", "awards": ["Thurber Prize Nominee for American Humor (2005)"], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2004-01-13 00:00:00", "ISBN": "0812968379"},
{"url": "https://www.goodreads.com/book/show/7504179-how-to-be-an-american-housewife", "num_ratings": "11,680", "num_reviews": "1,332", "avg_ratings": 3.62, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Japan", "Literature", "Asian Literature", "Historical"], "title": "How to Be an American Housewife", "author": "Margaret Dilloway", "num_pages": "277", "awards": ["John Gardner Book Award Nominee for Fiction (2011)"], "places": ["San Diego, California", "Japan"], "character_names": [], "language": "English", "publish_date": "2010-08-05 00:00:00", "ISBN": "0399156372"},
{"url": "https://www.goodreads.com/book/show/25367434-managing-bubbie", "num_ratings": "357", "num_reviews": "196", "avg_ratings": 4.4, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "History"], "title": "Managing Bubbie", "description": [" is the heartrending, hilarious family memoir by Russel Lazega that recounts the frequently hectic, ever-exhausting trials of one Jewish family in Miami Beach as they try to oversee the care of the elderly, unmanageable Lea Lazega. As they scramble for an acceptable assisted living facility and struggle to get her medication in line, they discover the difficulties of controlling a woman who time and again eluded catastrophe by refusing to be told what to do. ", "A tapestry of an American family in the 1980s, ", " also revisits the Holocaust period to mine the love, hope, and humor that emerged from the deepest despair. Anyone who savors a soft heart with a sharp funny bone will laugh, cry, and commiserate with the confounded family who must manage their beloved, impossible Bubbie."], "author": "Russel Lazega", "num_pages": "237", "awards": ["New York Book Festival Nominee for General Nonfiction (2015)", "Paris Book Festival Nominee (2016)", "Next Generation Indie Book Awards Nominee for Memoirs (Other) (2016)", "Writer's Digest Self-Published Book Competition Nominee (2015)", "Hollywood Book Festival Awards Nominee for Biography/Autobiography (Honorable Mention) (2015)", "Readers' Favorite Book Award (2015)", "Feathered Quill Book Award for Best Humor (1st) & Best Memoir (3rd) (2016)", "Florida Book Festival Nominee (2015)", "National Indie Excellence Awards for Aging (2016)", "IAN Book of the Year Awards Nominee for Non-Fiction (Religion / Spiritual / Inspirational) + Non-Fiction (Memoir / Biopgraphy / Autobiography) (2015)", "The Wishing Shelf Book Awards (2015)", "Foreword INDIES Book of the Year Award Nominee for Women's Studies (2015)", "Florida Authors and Publishers Association (FAPA) President's Award for Adult Non-Fiction (Gold Medal); Humor (Silver Medal); Autobiography/Memoir (Bronze Medal) (2016)"], "places": ["Miami Beach, Florida", "Brussels", "Lodz", "Paris", "Barcelona, Catalonia", "Marseille (Marseilles)"], "character_names": [], "language": "English", "publish_date": "2015-02-05 00:00:00", "ISBN": "1499126298"},
{"url": "https://www.goodreads.com/book/show/7604.Lolita", "num_ratings": "558,730", "num_reviews": "20,099", "avg_ratings": 3.89, "genres": ["Classics", "Fiction", "Literature"], "title": "Lolita", "description": ["Humbert Humbert - scholar, aesthete and romantic - has fallen completely and utterly in love with Lolita Haze, his landlady's gum-snapping, silky skinned twelve-year-old daughter. Reluctantly agreeing to marry Mrs Haze just to be close to Lolita, Humbert suffers greatly in the pursuit of romance; but when Lo herself starts looking for attention elsewhere, he will carry her", "Humbert Humbert - scholar, aesthete and romantic - has fallen completely and utterly in love with Lolita Haze, his landlady's gum-snapping, silky skinned twelve-year-old daughter. Reluctantly agreeing to marry Mrs Haze just to be close to Lolita, Humbert suffers greatly in the pursuit of romance; but when Lo herself starts looking for attention elsewhere, he will carry her off on a desperate cross-country misadventure, all in the name of Love. Hilarious, flamboyant, heart-breaking and full of ingenious word play, Lolita is an immaculate, unforgettable masterpiece of obsession, delusion and lust."], "author": "Vladimir Nabokov", "num_pages": "331", "awards": ["National Book Award Finalist for Fiction (1959)"], "places": [], "character_names": ["Humbert Humbert", "Lolita", "Charlotte Haze", "Clare Quilty"], "language": "English", "publish_date": "1995-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/698.Digging_to_America", "num_ratings": "18,208", "num_reviews": "2,075", "avg_ratings": 3.54, "genres": ["Fiction", "Parenting", "Adoption", "Contemporary"], "title": "Digging to America", "description": ["In what is perhaps her richest and most deeply searching novel, Anne Tyler gives us a story about what it is to be an American, and about Maryam Yazdan, who after thirty-five years in this country must finally come to terms with her “outsiderness.”", "Two families, who would otherwise never have come together, meet by chance at the Baltimore airport—the Donaldsons, a very Amer", "In what is perhaps her richest and most deeply searching novel, Anne Tyler gives us a story about what it is to be an American, and about Maryam Yazdan, who after thirty-five years in this country must finally come to terms with her “outsiderness.”", "Two families, who would otherwise never have come together, meet by chance at the Baltimore airport—the Donaldsons, a very American couple, and the Yazdans, Maryam’s fully assimilated son and his attractive Iranian American wife. Each couple is awaiting the arrival of an adopted infant daughter from Korea. After the babies from distant Asia are delivered, Bitsy Donaldson impulsively invites the Yazdans to celebrate with an “arrival party,” an event that is repeated every year as the two families become more deeply intertwined.", "Even independent-minded Maryam is drawn in. But only up to a point. When she finds herself being courted by one of the Donaldson clan, a good-hearted man of her vintage, recently widowed and still recovering from his wife’s death, suddenly all the values she cherishes—her traditions, her privacy, her otherness—are threatened. Somehow this big American takes up so much space that the orderly boundaries of her life feel invaded.", "A luminous novel brimming with subtle, funny, and tender observations that cast a penetrating light on the American way as seen from two perspectives, those who are born here and those who are still struggling to fit in."], "author": "Anne Tyler", "num_pages": "277", "awards": ["Orange Prize Nominee for Fiction Shortlist (2007)", "International DUBLIN Literary Award Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-02 00:00:00", "ISBN": "0307263940"},
{"url": "https://www.goodreads.com/book/show/4912._Tis_A_Memoir", "num_ratings": "49,268", "num_reviews": "2,034", "avg_ratings": 3.67, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "'Tis A Memoir", "description": ["The sequel to Frank McCourt's memoir of his Irish Catholic boyhood, ", ", picks up the story in October 1949, upon his arrival in America. Though he was born in New York, the family had returned to Ireland due to poor prospects in the United States. Now back on American soil, this awkward 19-year-old, with his \"pimply face, sore eyes, and bad teeth,\" has little i", "The sequel to Frank McCourt's memoir of his Irish Catholic boyhood, ", ", picks up the story in October 1949, upon his arrival in America. Though he was born in New York, the family had returned to Ireland due to poor prospects in the United States. Now back on American soil, this awkward 19-year-old, with his \"pimply face, sore eyes, and bad teeth,\" has little in common with the healthy, self-assured college students he sees on the subway and dreams of joining in the classroom. Initially, his American experience is as harrowing as his impoverished youth in Ireland, including two of the grimmest Christmases ever described in literature. McCourt views the U.S. through the same sharp eye and with the same dark humor that distinguished his first memoir: race prejudice, casual cruelty, and dead-end jobs weigh on his spirits as he searches for a way out. A glimpse of hope comes from the army, where he acquires some white-collar skills, and from New York University, which admits him without a high school diploma. But the journey toward his position teaching creative writing at Stuyvesant High School is neither quick nor easy. Fortunately, McCourt's openness to every variety of human emotion and longing remains exceptional; even the most damaged, difficult people he encounters are richly rendered individuals with whom the reader can't help but feel uncomfortable kinship. The magical prose, with its singing Irish cadences, brings grandeur and beauty to the most sorrowful events, including the final scene, set in a Limerick graveyard. "], "author": "Frank McCourt", "num_pages": "495", "awards": ["Audie Award for Nonfiction, Unabridged (2000)", "New York City Book Award for Memoir (1999)"], "places": [], "character_names": ["Frank McCourt"], "language": "English", "publish_date": "1999-08-16 00:00:00", "ISBN": "0006551815"},
{"url": "https://www.goodreads.com/book/show/7570311-starting-over", "num_ratings": "12", "num_reviews": "6", "avg_ratings": 4.0, "genres": ["Historical", "Historical Fiction", "Literature"], "title": "Starting Over", "description": ["Though she does not understand exactly why, Maria is not content with her lot. The prospect of exchanging dependence on her family for dependence on a husband does not sit well with this young woman growing up in late 19th Century Germany. Three generations later, on the other side of the Atlantic, Eva struggles with a similar restlessness; she is generally happy but never", "Though she does not understand exactly why, Maria is not content with her lot. The prospect of exchanging dependence on her family for dependence on a husband does not sit well with this young woman growing up in late 19th Century Germany. Three generations later, on the other side of the Atlantic, Eva struggles with a similar restlessness; she is generally happy but never quite satisfied. This book follows Maria and her great-granddaughter Eva as they face surprisingly similar choices in dramatically different decades: how to keep a roof over your head, when to abandon independence and commit to a lover, where to draw a line in the sand. The choices they make take them to new countries, open them up to heartache and leave them wondering what is enough."], "author": "Laura Rittenhouse", "num_pages": "452", "awards": [], "places": ["Germany", "United States of America", "Australia"], "character_names": [], "language": "English", "publish_date": "2009-10-16 00:00:00", "ISBN": "1597056316"},
{"url": "https://www.goodreads.com/book/show/20922728-the-immigrant-and-the-golden-coin", "num_ratings": "74", "num_reviews": "21", "avg_ratings": 4.86, "genres": ["Nonfiction"], "title": "The Immigrant and the Golden Coin", "description": ["Each book in the series stands alone. In book 3, Det. Lt. Mike McBride, Jr. popular hero of two best selling novels, returns for more thrilling adventures. Arch villian, John Jacobs, aka Joseph the Rat, meets extreme justice. an exquisite and priceless golden coin--a one of a kind relic from an ancient civilization--leads to intrigue, kidnapping, extortion and murder. Afte", "Each book in the series stands alone. In book 3, Det. Lt. Mike McBride, Jr. popular hero of two best selling novels, returns for more thrilling adventures. Arch villian, John Jacobs, aka Joseph the Rat, meets extreme justice. an exquisite and priceless golden coin--a one of a kind relic from an ancient civilization--leads to intrigue, kidnapping, extortion and murder. After surviving a harrowing journey across Mexico, an immigrant makes a fatal mistake. Mike becomes involved in the smuggling rivalries along the US border with Mexico. Just the right amount of romance is the custom in the McBride books. There may be a wedding; we're not telling who."], "author": "Dorothy May Mercer", "num_pages": "294", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/95186.The_Inheritance_of_Loss", "num_ratings": "42,972", "num_reviews": "3,609", "avg_ratings": 3.42, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction"], "title": "The Inheritance of Loss", "description": ["In a crumbling, isolated house at the foot of Mount Kanchenjunga in the Himalayas lives an embittered judge who wants only to retire in peace, when his orphaned granddaughter, Sai, arrives on his doorstep. The judge’s cook watches over her distractedly, for his thoughts are often on his son, Biju, who is hopscotching from one gritty New York restaurant to another. Kiran De", "In a crumbling, isolated house at the foot of Mount Kanchenjunga in the Himalayas lives an embittered judge who wants only to retire in peace, when his orphaned granddaughter, Sai, arrives on his doorstep. The judge’s cook watches over her distractedly, for his thoughts are often on his son, Biju, who is hopscotching from one gritty New York restaurant to another. Kiran Desai’s brilliant novel, published to huge acclaim, is a story of joy and despair. Her characters face numerous choices that majestically illuminate the consequences of colonialism as it collides with the modern world."], "author": "Kiran Desai", "num_pages": "357", "awards": ["Man Booker Prize (2006)", "Orange Prize Nominee for Fiction Shortlist (2007)", "National Book Critics Circle Award for Fiction (2006)", "Kiriyama Prize Nominee for Fiction (2007)", "Crossword Book Award for Popular (2006)", "Βραβείο Λογοτεχνικής Μετάφρασης ΕΚΕΜΕΛ Nominee for Αγγλόφωνη Λογοτεχνία (2008)", "International DUBLIN Literary Award Nominee (2008)"], "places": ["Kalimpong"], "character_names": ["Jemubhai Patel"], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0802142818"},
{"url": "https://www.goodreads.com/book/show/81227.Infidel", "num_ratings": "67,436", "num_reviews": "5,944", "avg_ratings": 4.2, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Religion", "Cultural", "Africa"], "title": "Infidel", "description": ["One of today’s most admired and controversial political figures, Ayaan Hirsi Ali burst into international headlines following the murder of Theo van Gogh by an Islamist who threatened that she would be next. She made headlines again when she was stripped of her citizenship and resigned from the Dutch Parliament.", " shows the coming of age of this distinguished politica", "One of today’s most admired and controversial political figures, Ayaan Hirsi Ali burst into international headlines following the murder of Theo van Gogh by an Islamist who threatened that she would be next. She made headlines again when she was stripped of her citizenship and resigned from the Dutch Parliament.", " shows the coming of age of this distinguished political superstar and champion of free speech as well as the development of her beliefs, iron will, and extraordinary determination to fight injustice. Raised in a strict Muslim family, Hirsi Ali survived civil war, female mutilation, brutal beatings, adolescence as a devout believer during the rise of the Muslim Brotherhood, and life in four troubled, unstable countries ruled largely by despots. She escaped from a forced marriage and sought asylum in the Netherlands, where she earned a college degree in political science, tried to help her tragically depressed sister adjust to the West, and fought for the rights of Muslim women and the reform of Islam as a member of Parliament. Under constant threat, demonized by reactionary Islamists and politicians, disowned by her father, and expelled from family and clan, she refuses to be silenced.", "Ultimately a celebration of triumph over adversity, Hirsi Ali’s story tells how a bright little girl evolves out of dutiful obedience to become an outspoken, pioneering freedom fighter. As Western governments struggle to balance democratic ideals with religious pressures, no other book could be more timely or more significant."], "author": "Ayaan Hirsi Ali", "num_pages": "353", "awards": ["Anisfield-Wolf Book Award (2008)", "Hurston/Wright Legacy Award Nominee for Nonfiction (2008)"], "places": [], "character_names": ["Rita Verdonk", "Ayaan Hirsi Ali"], "language": "English", "publish_date": "2007-02-01 00:00:00", "ISBN": "0743289684"},
{"url": "https://www.goodreads.com/book/show/5186.Breath_Eyes_Memory", "num_ratings": "24,402", "num_reviews": "1,198", "avg_ratings": 3.87, "genres": ["Fiction", "Historical", "Historical Fiction"], "title": "Breath, Eyes, Memory", "description": ["At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new novelists, a writer who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.  ", "At the age of twelve, Sophie Caco is sent from her imp", "At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new novelists, a writer who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.  ", "At the age of twelve, Sophie Caco is sent from her impoverished village of Croix-des-Rosets to New York, to be reunited with a mother she barely remembers. There she discovers secrets that no child should ever know, and a legacy of shame that can be healed only when she returns to Haiti--to the women who first reared her. What ensues is a passionate journey through a landscape charged with the supernatural and scarred by political violence, in a novel that bears witness to the traditions, suffering, and wisdom of an entire people."], "author": "Edwidge Danticat", "num_pages": "234", "awards": [], "places": ["Haiti", "New York (the state)"], "character_names": [], "language": "English", "publish_date": "1998-05-18 00:00:00", "ISBN": "037570504X"},
{"url": "https://www.goodreads.com/book/show/88815.The_Reluctant_Fundamentalist", "num_ratings": "47,164", "num_reviews": "5,233", "avg_ratings": 3.69, "genres": ["Fiction", "Cultural", "Pakistan", "Contemporary"], "title": "The Reluctant Fundamentalist", "description": ["At a café table in Lahore, a bearded Pakistani man converses with an uneasy American stranger. As dusk deepens to night, he begins the tale that has brought them to this fateful encounter…", "Changez is living an immigrant's dream of America. At the top of his class at Princeton, he is snapped up by an elite valuation firm. He thrives on the energy of New York, and his budding", "At a café table in Lahore, a bearded Pakistani man converses with an uneasy American stranger. As dusk deepens to night, he begins the tale that has brought them to this fateful encounter…", "Changez is living an immigrant's dream of America. At the top of his class at Princeton, he is snapped up by an elite valuation firm. He thrives on the energy of New York, and his budding romance with elegant, beautiful Erica promises entry into Manhattan society at the same exalted level once occupied by his own family back in Lahore.", "But in the wake of September 11, Changez finds his position in his adopted city suddenly overturned, and his relationship with Erica shifting. And Changez's own identity is in seismic shift as well, unearthing allegiances more fundamental than money, power, and maybe even love. ", "\"Extreme times call for extreme reactions, extreme writing. Hamid has done something extraordinary with this novel.\" —Washington Post", "\"One of those achingly assured novels that makes you happy to be a reader.\" —Junot Diaz ", "\"Brief, charming, and quietly furious . . . a resounding success.\" —Village Voice ", "A Washington Post and San Francisco Chronicle Best Book of the Year ", "A New York Times Notable Book"], "author": "Mohsin Hamid", "num_pages": "184", "awards": ["Man Booker Prize Nominee (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2007)", "Anisfield-Wolf Book Award (2008)", "Ambassador Book Award for Fiction (2008)"], "places": [], "character_names": ["Changez", "Érica"], "language": "English", "publish_date": "2007-04-03 00:00:00", "ISBN": "0151013047"},
{"url": "https://www.goodreads.com/book/show/10464963-the-buddha-in-the-attic", "num_ratings": "36,158", "num_reviews": "5,764", "avg_ratings": 3.61, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Japan", "Historical", "Cultural", "Asia"], "title": "The Buddha in the Attic", "description": ["Julie Otsuka’s long-awaited follow-up to ", " is a tour de force of economy and precision, a novel that tells the story of a group of young women brought from Japan to San Francisco as “picture brides” nearly a century ago.", "In eight incantatory sections, ", " traces the picture brides’ extraordinary lives, from their arduous journey", "Julie Otsuka’s long-awaited follow-up to ", " is a tour de force of economy and precision, a novel that tells the story of a group of young women brought from Japan to San Francisco as “picture brides” nearly a century ago.", "In eight incantatory sections, ", " traces the picture brides’ extraordinary lives, from their arduous journey by boat, where they exchange photographs of their husbands, imagining uncertain futures in an unknown land; to their arrival in San Francisco and their tremulous first nights as new wives; to their backbreaking work picking fruit in the fields and scrubbing the floors of white women; to their struggles to master a new language and a new culture; to their experiences in childbirth, and then as mothers, raising children who will ultimately reject their heritage and their history; to the deracinating arrival of war."], "author": "Julie Otsuka", "num_pages": "129", "awards": ["PEN/Faulkner Award for Fiction (2012)", "Prix Femina for Étranger (2012)", "National Book Award Finalist for Fiction (2011)", "David J. Langum Sr. Prize for American Historical Fiction (2011)", "International DUBLIN Literary Award Nominee for Shortlist (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-23 00:00:00", "ISBN": "0307700003"},
{"url": "https://www.goodreads.com/book/show/16527.Daughter_of_Fortune", "num_ratings": "101,828", "num_reviews": "3,424", "avg_ratings": 3.89, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance"], "title": "Daughter of Fortune", "description": ["Orphaned at birth, Eliza Sommers is raised in the British colony of Valparaíso, Chile, by the well-intentioned Victorian spinster Miss Rose and her more rigid brother Jeremy. Just as she meets and falls in love with the wildly inappropriate Joaquín Andieta, a lowly clerk who works for Jeremy, gold is discovered in the hills of northern California. By 1849, Chileans of ever", "Orphaned at birth, Eliza Sommers is raised in the British colony of Valparaíso, Chile, by the well-intentioned Victorian spinster Miss Rose and her more rigid brother Jeremy. Just as she meets and falls in love with the wildly inappropriate Joaquín Andieta, a lowly clerk who works for Jeremy, gold is discovered in the hills of northern California. By 1849, Chileans of every stripe have fallen prey to feverish dreams of wealth. Joaquín takes off for San Francisco to seek his fortune, and Eliza, pregnant with his child, decides to follow him.", "As we follow her spirited heroine on a perilous journey north in the hold of a ship to the rough-and-tumble world of San Francisco and northern California, we enter a world whose newly arrived inhabitants are driven mad by gold fever. A society of single men and prostitutes among whom Eliza moves--with the help of her good friend and savior, the Chinese doctor Tao Chien--California opens the door to a new life of freedom and independence for the young Chilean. Her search for the elusive Joaquín gradually turns into another kind of journey that transforms her over time, and what began as a search for love ends up as the conquest of personal freedom."], "author": "Isabel Allende", "num_pages": "432", "awards": ["Premio de traducción literaria Valle Inclán Nominee for Margaret Sayers Peden (2000)"], "places": ["California", "Valparaíso"], "character_names": ["Eliza Sommers", "Rose Sommers", "Joaquín Andieta", "Jacob Todd", "Tao Chi'en"], "language": "English", "publish_date": "2006-05-02 00:00:00", "ISBN": "0061120251"},
{"url": "https://www.goodreads.com/book/show/3412.The_Thorn_Birds", "num_ratings": "283,625", "num_reviews": "4,989", "avg_ratings": 4.23, "genres": ["Fiction", "Historical", "Historical Fiction", "Romance", "Classics", "Cultural", "Australia", "Historical"], "title": "The Thorn Birds", "description": ["Powered by the dreams and struggles of three generations, ", " is the epic saga of a family rooted in the Australian sheep country. At the story's heart is the love of Meggie Cleary, who can never possess the man she desperately adores, and Ralph de Bricassart, who rises from parish priest to the inner circles of the Vatican...but whose passion for Meggie will f", "Powered by the dreams and struggles of three generations, ", " is the epic saga of a family rooted in the Australian sheep country. At the story's heart is the love of Meggie Cleary, who can never possess the man she desperately adores, and Ralph de Bricassart, who rises from parish priest to the inner circles of the Vatican...but whose passion for Meggie will follow him all the days of his life."], "author": "Colleen McCullough", "num_pages": "692", "awards": [], "places": ["Australia"], "character_names": ["Ralph de Bricassart", "Meghann Cleary", "Luke O'Neill", "Fiona Cleary", "Padraic Cleary", "Francis Cleary", "Dane O'Neill", "Justine O'Neill"], "language": "English", "publish_date": "1978-06-16 00:00:00", "ISBN": "0380018179"},
{"url": "https://www.goodreads.com/book/show/24731.The_Tortilla_Curtain", "num_ratings": "24,430", "num_reviews": "2,898", "avg_ratings": 3.65, "genres": ["Fiction", "Contemporary", "Book Club"], "title": "The Tortilla Curtain", "description": ["Topanga Canyon is home to two couples on a collision course. Los Angeles liberals Delaney and Kyra Mossbacher lead an ordered sushi-and-recycling existence in a newly gated hilltop community: he a sensitive nature writer, she an obsessive realtor. Mexican illegals Cándido and América Rincón desperately cling to their vision of the American Dream as they fight off starvatio", "Topanga Canyon is home to two couples on a collision course. Los Angeles liberals Delaney and Kyra Mossbacher lead an ordered sushi-and-recycling existence in a newly gated hilltop community: he a sensitive nature writer, she an obsessive realtor. Mexican illegals Cándido and América Rincón desperately cling to their vision of the American Dream as they fight off starvation in a makeshift camp deep in the ravine. And from the moment a freak accident brings Cándido and Delaney into intimate contact, these four and their opposing worlds gradually intersect in what becomes a tragicomedy of error and misunderstanding."], "author": "T.C. Boyle", "num_pages": "355", "awards": ["Audie Award for Narration by the Author or Authors (2007)", "Prix Médicis Etranger (1997)"], "places": ["California", "Los Angeles, California"], "character_names": ["Delany Mossbacher", "Candido Rincon", "America Rincon"], "language": "English", "publish_date": "1995-08-16 00:00:00", "ISBN": "014023828X"},
{"url": "https://www.goodreads.com/book/show/11208.How_the_Garc_a_Girls_Lost_Their_Accents", "num_ratings": "20,423", "num_reviews": "1,405", "avg_ratings": 3.63, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult"], "title": "How the García Girls Lost Their Accents", "description": ["Uprooted from their family home in the Dominican Republic, the four Garcia sisters - Carla, Sandra, Yolanda, and Sofia - arrive in New York City in 1960 to find a life far different from the genteel existence of maids, manicures, and extended family they left behind. What they have lost - and what they find - is revealed in the fifteen interconnected stories that make up t", "Uprooted from their family home in the Dominican Republic, the four Garcia sisters - Carla, Sandra, Yolanda, and Sofia - arrive in New York City in 1960 to find a life far different from the genteel existence of maids, manicures, and extended family they left behind. What they have lost - and what they find - is revealed in the fifteen interconnected stories that make up this exquisite novel from one of the premier novelists of our time."], "author": "Julia Alvarez", "num_pages": "304", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2005-10-04 00:00:00", "ISBN": "0452287073"},
{"url": "https://www.goodreads.com/book/show/30852.The_Woman_Warrior", "num_ratings": "21,087", "num_reviews": "1,217", "avg_ratings": 3.73, "genres": ["Autobiography", "Memoir", "Nonfiction", "Feminism", "Cultural", "China", "Classics"], "title": "The Woman Warrior", "description": ["A Chinese American woman tells of the Chinese myths, family stories and events of her California childhood that have shaped her identity. It is a sensitive account of growing up female and Chinese-American in a California laundry."], "author": "Maxine Hong Kingston", "num_pages": "204", "awards": ["Anisfield-Wolf Book Award (1978)", "National Book Critics Circle Award for General Nonfiction (1976)"], "places": [], "character_names": [], "language": "English", "publish_date": "1989-04-23 00:00:00", "ISBN": "0679721886"},
{"url": "https://www.goodreads.com/book/show/89763.Esperanza_Rising", "num_ratings": "56,269", "num_reviews": "5,255", "avg_ratings": 3.94, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Middle Grade", "Childrens", "Cultural"], "title": "Esperanza Rising", "description": ["Esperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance", "Esperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance she now faces. When their new life is threatened, Esperanza must find a way to rise above her difficult circumstances--Mama's life, and her own, depend on it."], "author": "Pam Muñoz Ryan", "num_pages": "304", "awards": ["Jane Addams Children's Book Award for Older Children (2001)", "California Young Readers Medal Nominee for Middle School/Junior High (2003)", "Judy Lopez Memorial Award for Children's Literature (2001)", "Pura Belpré Award for Narrative (2002)"], "places": ["Aguascalientes", "California"], "character_names": [], "language": "English", "publish_date": "2002-09-27 00:00:00", "ISBN": "043912042X"},
{"url": "https://www.goodreads.com/book/show/869210.Roots", "num_ratings": "130,415", "num_reviews": "2,870", "avg_ratings": 4.42, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Historical"], "title": "Roots: The Saga of an American Family (Modern Classics)", "description": ["One of the most beloved bestsellers of all time that touched the hearts of readers across the globe, Roots is now available in the Modern Classic Edition marking the 25th anniversary of its first printing."], "author": "Alex Haley", "num_pages": "704", "awards": ["ASJA Outstanding Book Award (1978)", "Audie Award for Nonfiction (2008)", "Premio Bancarella (1978)", "National Book Critics Circle Award Nominee for General Nonfiction (1976)", "Lillian Smith Book Award (1977)"], "places": ["United States of America", "Gambia"], "character_names": ["George Lincoln Rockwell", "Alex Haley", "Kunta Kinte"], "language": "English", "publish_date": "2000-09-05 00:00:00", "ISBN": "0517208601"},
{"url": "https://www.goodreads.com/book/show/5960325-shanghai-girls", "num_ratings": "122,448", "num_reviews": "9,051", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "China", "Historical", "Cultural", "Asia"], "title": "Shanghai Girls", "description": ["Pearl and May are sisters, living carefree lives in Shanghai, the Paris of Asia. But when Japanese bombs fall on their beloved city, they set out on the journey of a lifetime, one that will take them through the Chinese countryside, in and out of the clutch of brutal soldiers, and across the Pacific to the shores of America.", "In 1937, Shanghai is the Paris of Asia, a city of", "Pearl and May are sisters, living carefree lives in Shanghai, the Paris of Asia. But when Japanese bombs fall on their beloved city, they set out on the journey of a lifetime, one that will take them through the Chinese countryside, in and out of the clutch of brutal soldiers, and across the Pacific to the shores of America.", "In 1937, Shanghai is the Paris of Asia, a city of great wealth and glamour, the home of millionaires and beggars, gangsters and gamblers, patriots and revolutionaries, artists and warlords. Thanks to the financial security and material comforts provided by their father’s prosperous rickshaw business, twenty-one-year-old Pearl Chin and her younger sister, May, are having the time of their lives. Though both sisters wave off authority and tradition, they couldn’t be more different: Pearl is a Dragon sign, strong and stubborn, while May is a true Sheep, adorable and placid. Both are beautiful, modern, and carefree . . . until the day their father tells them that he has gambled away their wealth and that in order to repay his debts he must sell the girls as wives to suitors who have traveled from California to find Chinese brides. ", "As Japanese bombs fall on their beloved city, Pearl and May set out on the journey of a lifetime, one that will take them through the Chinese countryside, in and out of the clutch of brutal soldiers, and across the Pacific to the shores of America. In Los Angeles they begin a fresh chapter, trying to find love with the strangers they have married, brushing against the seduction of Hollywood, and striving to embrace American life even as they fight against discrimination, brave Communist witch hunts, and find themselves hemmed in by Chinatown’s old ways and rules."], "author": "Lisa See", "num_pages": "309", "awards": ["Goodreads Choice Award Nominee for Fiction (2009)", "Asian/Pacific American Award for Literature for Adult Fiction Honor (2009)"], "places": ["Shanghai", "Los Angeles, California"], "character_names": ["Pearl Chin", "May Chin", "Sam Louie"], "language": "English", "publish_date": "2009-05-26 00:00:00", "ISBN": "1400067111"},
{"url": "https://www.goodreads.com/book/show/3711.White_Teeth", "num_ratings": "100,338", "num_reviews": "6,009", "avg_ratings": 3.76, "genres": ["Fiction", "Contemporary", "Novels", "European Literature", "British Literature"], "title": "White Teeth", "description": ["One of the most talked about fictional debuts ever, White Teeth is a funny, generous, big-hearted novel, adored by critics and readers alike. Dealing - among many other things - with friendship, love, war, three cultures and three families over three generations, one brown mouse, and the tricky way the past has of coming back and biting you on the ankle, it is a life-affir", "One of the most talked about fictional debuts ever, White Teeth is a funny, generous, big-hearted novel, adored by critics and readers alike. Dealing - among many other things - with friendship, love, war, three cultures and three families over three generations, one brown mouse, and the tricky way the past has of coming back and biting you on the ankle, it is a life-affirming, riotous must-read of a book."], "author": "Zadie Smith", "num_pages": "448", "awards": ["Orange Prize Nominee for Fiction Shortlist (2000)", "Guardian First Book Award (2000)", "James Tait Black Memorial Prize for Fiction (2000)", "Whitbread Award for First Novel (2000)", "John Llewellyn Rhys Prize Nominee (2000)", "Puddly Award for Debut Novel (2001)", "National Book Critics Circle Award Nominee for Fiction (2000)", "Commonwealth Writers' Prize for Best First Book Overall (2001)", "Sunday Times/Peters Fraser + Dunlop Young Writer of the Year Award (2001)", "Betty Trask Award (2001)"], "places": [], "character_names": ["Alfred Archibald Jones", "Samad Miah Iqbal", "Clara Jones", "Alsana Begum", "Irie Ambrosia Jones", "Millat Zulfikar Iqbal"], "language": "English", "publish_date": "2001-06-12 00:00:00", "ISBN": "0375703861"},
{"url": "https://www.goodreads.com/book/show/297673.The_Brief_Wondrous_Life_of_Oscar_Wao", "num_ratings": "200,112", "num_reviews": "17,901", "avg_ratings": 3.9, "genres": ["Fiction", "Contemporary", "Magical Realism", "Novels"], "title": "The Brief Wondrous Life of Oscar Wao", "description": ["Things have never been easy for Oscar, a sweet but disastrously overweight, lovesick Dominican ghetto nerd. From his home in New Jersey, where he lives with his old-world mother and rebellious sister, Oscar dreams of becoming the Dominican J. R. R. Tolkien and, most of all, of finding love. But he may never get what he wants, thanks to the Fukœ—the curse that has haunted t", "Things have never been easy for Oscar, a sweet but disastrously overweight, lovesick Dominican ghetto nerd. From his home in New Jersey, where he lives with his old-world mother and rebellious sister, Oscar dreams of becoming the Dominican J. R. R. Tolkien and, most of all, of finding love. But he may never get what he wants, thanks to the Fukœ—the curse that has haunted the Oscar's family for generations, dooming them to prison, torture, tragic accidents, and, above all, ill-starred love. Oscar, still waiting for his first kiss, is just its most recent victim. ", "Diaz immerses us in the tumultuous life of Oscar and the history of the family at large, rendering with genuine warmth and dazzling energy, humor, and insight the Dominican-American experience, and, ultimately, the endless human capacity to persevere in the face of heartbreak and loss. A true literary triumph, ", " confirms Junot Diaz as one of the best and most exciting voices of our time."], "author": "Junot Díaz", "num_pages": "335", "awards": ["Pulitzer Prize for Fiction (2008)", "Anisfield-Wolf Book Award (2008)", "Massachusetts Book Award for Fiction (2008)", "Dayton Literary Peace Prize for Fiction (2008)", "National Book Critics Circle Award for Fiction (2007)", "Hurston/Wright Legacy Award for Fiction (2008)", "The Rooster - The Morning News Tournament of Books (2008)", "The Center for Fiction First Novel Prize (2007)"], "places": ["Dominican Republic", "Washington Heights, New York", "Paterson, New Jersey"], "character_names": ["Oscar de León", "Lola de León", "Hypatía Belicia \"Beli\" Cabral de León", "La Inca", "Yunior de Las Casas", "Ybón Pimentel", "Dr Abelard Luis Cabral"], "language": "English", "publish_date": "2007-09-06 00:00:00", "ISBN": "1594489580"},
{"url": "https://www.goodreads.com/book/show/2187.Middlesex", "num_ratings": "535,757", "num_reviews": "21,768", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "Middlesex", "description": [" tells the breathtaking story of Calliope Stephanides, and three generations of the Greek-American Stephanides family, who travel from a tiny village overlooking Mount Olympus in Asia Minor to Prohibition-era Detroit, witnessing its glory days as the Motor City and the race riots of 1967 before moving out to the tree-lined streets of suburban Grosse Pointe, Michig", " tells the breathtaking story of Calliope Stephanides, and three generations of the Greek-American Stephanides family, who travel from a tiny village overlooking Mount Olympus in Asia Minor to Prohibition-era Detroit, witnessing its glory days as the Motor City and the race riots of 1967 before moving out to the tree-lined streets of suburban Grosse Pointe, Michigan. To understand why Calliope is not like other girls, she has to uncover a guilty family secret, and the astonishing genetic history that turns Callie into Cal, one of the most audacious and wondrous narrators in contemporary fiction. Lyrical and thrilling, ", " is an exhilarating reinvention of the American epic."], "author": "Jeffrey Eugenides", "num_pages": "529", "awards": ["Pulitzer Prize for Fiction (2003)", "James Tait Black Memorial Prize Nominee for Fiction (2003)", "Ambassador Book Award for Fiction (2003)", "Audie Award for Fiction, Unabridged (2003)"], "places": ["Bursa", "Izmir", "Detroit, Michigan", "Berlin"], "character_names": ["Calliope Stephanides", "Eleutherios Stephanides", "Desdemona Stephanides", "Sourmelina Zizmo", "Miltiades Stephanides", "Theodora Stephanides", "Chapter Eleven", "The Obscure Object", "James Zizmo", "Michael Antoniou"], "language": "English", "publish_date": "2003-09-16 00:00:00", "ISBN": "0312422156"},
{"url": "https://www.goodreads.com/book/show/17150.My_ntonia", "num_ratings": "107,726", "num_reviews": "6,375", "avg_ratings": 3.77, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "My Ántonia", "description": ["Through Jim Burden's endearing, smitten voice, we revisit the remarkable vicissitudes of immigrant life in the Nebraska heartland, with all its insistent bonds. Guiding the way are some of literature's most beguiling characters: the Russian brothers plagued by memories of a fateful sleigh ride, Antonia's desperately homesick father and self-indulgent mother, and the coy Le", "Through Jim Burden's endearing, smitten voice, we revisit the remarkable vicissitudes of immigrant life in the Nebraska heartland, with all its insistent bonds. Guiding the way are some of literature's most beguiling characters: the Russian brothers plagued by memories of a fateful sleigh ride, Antonia's desperately homesick father and self-indulgent mother, and the coy Lena Lingard. Holding the pastoral society's heart, of course, is the bewitching, free-spirited Antonia."], "author": "Willa Cather", "num_pages": "232", "awards": [], "places": ["Nebraska"], "character_names": ["Ántonia Shimerda", "Jim Burden", "Josiah Burden", "Emmaline Burden", "Ambrosch Shimerda", "Lena Lingard", "Otto Fuchs", "Jake Marpole", "Mr. Shimerda", "Mrs. Shimerda"], "language": "English", "publish_date": "2000-02-20 00:00:00", "ISBN": "1583485090"},
{"url": "https://www.goodreads.com/book/show/252577.Angela_s_Ashes", "num_ratings": "461,100", "num_reviews": "10,485", "avg_ratings": 4.09, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Angela's Ashes", "description": ["Imbued on every page with Frank McCourt's astounding humor and compassion. This is a glorious book that bears all the marks of a classic.", "\"When I look back on my childhood I wonder how I managed to survive at all. It was, of course, a miserable childhood: the happy childhood is hardly worth your while. Worse than the ordinary miserable childhood is the miserable Irish child", "Imbued on every page with Frank McCourt's astounding humor and compassion. This is a glorious book that bears all the marks of a classic.", "\"When I look back on my childhood I wonder how I managed to survive at all. It was, of course, a miserable childhood: the happy childhood is hardly worth your while. Worse than the ordinary miserable childhood is the miserable Irish childhood, and worse yet is the miserable Irish Catholic childhood.\" ", "So begins the Pulitzer Prize winning memoir of Frank McCourt, born in Depression-era Brooklyn to recent Irish immigrants and raised in the slums of Limerick, Ireland. Frank's mother, Angela, has no money to feed the children since Frank's father, Malachy, rarely works, and when he does he drinks his wages. Yet Malachy-- exasperating, irresponsible and beguiling-- does nurture in Frank an appetite for the one thing he can provide: a story. Frank lives for his father's tales of Cuchulain, who saved Ireland, and of the Angel on the Seventh Step, who brings his mother babies. ", "Perhaps it is story that accounts for Frank's survival. Wearing rags for diapers, begging a pig's head for Christmas dinner and gathering coal from the roadside to light a fire, Frank endures poverty, near-starvation and the casual cruelty of relatives and neighbors--yet lives to tell his tale with eloquence, exuberance and remarkable forgiveness. ", "Angela's Ashes, imbued on every page with Frank McCourt's astounding humor and compassion, is a glorious book that bears all the marks of a classic."], "author": "Frank McCourt", "num_pages": "452", "awards": ["Pulitzer Prize for Biography or Autobiography (1997)", "American Booksellers Book Of The Year  Award for Adult Trade (1997)", "Audie Award for Nonfiction, Abridged (1997)", "Los Angeles Times Book Prize for Biography (1996)", "Exclusive Books Boeke Prize (1997)", "National Book Critics Circle Award for Biography/Autobiography (1996)"], "places": ["Limerick", "New York (the state)"], "character_names": ["Frank McCourt"], "language": "English", "publish_date": "2005-10-03 00:00:00", "ISBN": "0007205236"},
{"url": "https://www.goodreads.com/book/show/29776246-an-ishmael-of-syria", "num_ratings": "561", "num_reviews": "83", "avg_ratings": 3.89, "genres": ["Fiction", "Historical", "Historical Fiction", "Literary Fiction", "War", "Terrorism"], "title": "An Ishmael of Syria", "description": ["Adam is a tortured soul. Exiled from his homeland, forced to watch the horrors unfold from afar. His family, still living – or surviving – in war-torn Syria struggle daily to feed, clothe, and educate their children.", "Adam tries to be a ‘global citizen’ and become a part of his new community in Malaysia, but is constantly faced with intolerance, bigotry, and plain old racism", "Adam is a tortured soul. Exiled from his homeland, forced to watch the horrors unfold from afar. His family, still living – or surviving – in war-torn Syria struggle daily to feed, clothe, and educate their children.", "Adam tries to be a ‘global citizen’ and become a part of his new community in Malaysia, but is constantly faced with intolerance, bigotry, and plain old racism. Opportunities are few and Adam finds himself working long hours for poor pay so that he can help his family.", "The increasingly distressing news bulletins, along with Adam’s haunting childhood memories, compel him to examine his own beliefs; in God, in humanity, in himself and his integrity as a reluctant bystander in the worst human catastrophe of the twenty-first century."], "author": "Asaad Almohammad", "num_pages": "370", "awards": ["Goodreads Choice Award Nominee for Fiction (2016)"], "places": ["Syria", "Lebanon", "Malaysia", "Korea", "Sierra Leone", "South Korea"], "character_names": [], "language": "English", "publish_date": "2016-04-05 00:00:00", "ISBN": "0997481501"},
{"url": "https://www.goodreads.com/book/show/5439.Interpreter_of_Maladies", "num_ratings": "138,492", "num_reviews": "9,035", "avg_ratings": 4.13, "genres": ["Short Stories", "Fiction", "Cultural", "India"], "title": "Interpreter of Maladies", "description": ["Navigating between the Indian traditions they've inherited and the baffling new world, the characters in Jhumpa Lahiri's elegant, touching stories seek love beyond the barriers of culture and generations. In \"A Temporary Matter,\" published in ", ", a young Indian-American couple faces the heartbreak of a stillborn birth while their Boston neighborhood copes with", "Navigating between the Indian traditions they've inherited and the baffling new world, the characters in Jhumpa Lahiri's elegant, touching stories seek love beyond the barriers of culture and generations. In \"A Temporary Matter,\" published in ", ", a young Indian-American couple faces the heartbreak of a stillborn birth while their Boston neighborhood copes with a nightly blackout. In the title story, an interpreter guides an American family through the India of their ancestors and hears an astonishing confession. Lahiri writes with deft cultural insight reminiscent of Anita Desai and a nuanced depth that recalls Mavis Gallant."], "author": "Jhumpa Lahiri", "num_pages": "198", "awards": ["Pulitzer Prize for Fiction (2000)", "PEN/Hemingway Foundation Award (2000)", "Puddly Award for Short Stories (2001)"], "places": ["Boston, Massachusetts", "Kolkata", "Odisha", "Connecticut"], "character_names": ["Dev", "Elliot", "Miranda", "Shobha", "Lilia", "Shukumar", "Mr. Pirzada", "Mr. Das", "Mrs. Das", "Mr. Kapasi", "Boori Maa", "Mrs. Dalal", "Laxmi", "Mrs. Sen", "Sanjeev", "Twinkle"], "language": "English", "publish_date": "2000-05-22 00:00:00", "ISBN": "0618101365"},
{"url": "https://www.goodreads.com/book/show/139253.The_House_on_Mango_Street", "num_ratings": "98,014", "num_reviews": "8,146", "avg_ratings": 3.6, "genres": ["Fiction", "Young Adult", "Classics", "Short Stories", "Academic", "School"], "title": "The House on Mango Street", "description": ["Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up", "Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up in Chicago, inventing for herself who and what she will become. Few other books in our time have touched so many readers."], "author": "Sandra Cisneros", "num_pages": "110", "awards": ["American Book Award (1985)", "George C. Stone Center for Children's Books Recognition of Merit Award (1994)"], "places": ["Chicago, Illinois"], "character_names": ["Esperanza", "Nenny"], "language": "English", "publish_date": "2009-04-03 00:00:00", "ISBN": "0679734775"},
{"url": "https://www.goodreads.com/book/show/33917.The_Namesake", "num_ratings": "204,492", "num_reviews": "10,551", "avg_ratings": 3.97, "genres": ["Fiction", "Cultural", "India", "Contemporary", "Novels", "Literary Fiction", "Book Club", "Literature", "Asian Literature", "Indian Literature", "Adult Fiction", "Adult"], "title": "The Namesake", "description": ["Jhumpa Lahiri's ", " established this young writer as one the most brilliant of her generation. Her stories are one of the very few debut works -- and only a handful of collections -- to have won the Pulitzer Prize for fiction. Among the many other awards and honors it received were the New Yorker Debut of the Year award, the PEN/Hemingway Award, and the", "Jhumpa Lahiri's ", " established this young writer as one the most brilliant of her generation. Her stories are one of the very few debut works -- and only a handful of collections -- to have won the Pulitzer Prize for fiction. Among the many other awards and honors it received were the New Yorker Debut of the Year award, the PEN/Hemingway Award, and the highest critical praise for its grace, acuity, and compassion in detailing lives transported from India to America.", "In ", ", Lahiri enriches the themes that made her collection an international bestseller: the immigrant experience, the clash of cultures, the conflicts of assimilation, and, most poignantly, the tangled ties between generations. Here again Lahiri displays her deft touch for the perfect detail — the fleeting moment, the turn of phrase — that opens whole worlds of emotion.", " takes the Ganguli family from their tradition-bound life in Calcutta through their fraught transformation into Americans. On the heels of their arranged wedding, Ashoke and Ashima Ganguli settle together in Cambridge, Massachusetts. An engineer by training, Ashoke adapts far less warily than his wife, who resists all things American and pines for her family. When their son is born, the task of naming him betrays the vexed results of bringing old ways to the new world. Named for a Russian writer by his Indian parents in memory of a catastrophe years before, Gogol Ganguli knows only that he suffers the burden of his heritage as well as his odd, antic name. ", "Lahiri brings great empathy to Gogol as he stumbles along the first-generation path, strewn with conflicting loyalties, comic detours, and wrenching love affairs. With penetrating insight, she reveals not only the defining power of the names and expectations bestowed upon us by our parents, but also the means by which we slowly, sometimes painfully, come to define ourselves."], "author": "Jhumpa Lahiri", "num_pages": "291", "awards": ["Orange Prize Nominee for Fiction Longlist (2004)"], "places": [], "character_names": ["Ashoke Ganguli", "Ashima Ganguli", "Gogol/Nikhil Ganguli", "Sonia/Sonali Ganguli", "Maxine", "Moushumi Mazoomdar"], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "0618485228"},
{"url": "https://www.goodreads.com/book/show/77203.The_Kite_Runner", "num_ratings": "2,054,984", "num_reviews": "63,991", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "The Kite Runner", "description": ["Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amid", "Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amidst the increasing ethnic, religious, and political tensions of the dying years of the Afghan monarchy, wrenching them far apart. But so strong is the bond between the two boys that Amir journeys back to a distant world, to try to right past wrongs against the only true friend he ever had.", "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, ", " is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.", "A sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, ", " is an unusual and powerful novel that has become a beloved, one-of-a-kind classic."], "author": "Khaled Hosseini", "num_pages": "371", "awards": ["Borders Original Voices Award for Fiction (2003)", "Humo's Gouden Bladwijzer (2008)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Puddly Award for Fiction (2006)", "Lincoln Award Nominee (2006)", "Prix des libraires du Québec for Lauréats hors Québec (2006)"], "places": ["Kabul", "Fremont, California", "Afghanistan", "Peshawar"], "character_names": ["Amir", "Hassan", "Assef", "Bába", "Sohrab", "Soraya", "Rahim Khan"], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "1594480001"}
]