[
{"url": "https://www.goodreads.com/book/show/34966353-the-storm-runner", "num_ratings": "86", "num_reviews": "52", "avg_ratings": 4.14, "genres": ["Childrens", "Middle Grade", "Fantasy", "Fantasy", "Mythology"], "title": "The Storm Runner", "description": ["Zane has always enjoyed exploring the dormant volcano near his home in New Mexico, even though hiking it is challenging. He'd much rather hang out there with his dog, Rosie, than go to middle school, where kids call him Sir Limps a Lot, McGimpster, or Uno—for his one good leg. What Zane doesn't kno", "Zane has always enjoyed exploring the dormant volcano near his home in New Mexico, even though hiking it is challenging. He'd much rather hang out there with his dog, Rosie, than go to middle school, where kids call him Sir Limps a Lot, McGimpster, or Uno—for his one good leg. What Zane doesn't know is that the volcano is a gateway to another world and he is at the center of a powerful prophecy. A new girl at school, Brooks, informs him that he's destined to release an evil god from the ancient Maya relic he is imprisoned in—unless she can find and remove it first. Together they return to the volcano, where all kinds of crazy happens. Brooks turns into a hawk, a demon attacks them in a cave, and Rosie gives her all while trying to protect Zane. When Zane decides to save his dog no matter the cost, he is thrust into an adventure full of surprising discoveries, dangerous secrets, and an all-out war between the gods, one of whom happens to be his father. To survive, Zane will have to become the Storm Runner. But how can he run when he can't even walk well without a cane?", "Feisty heroes, tricky gods, murderous demons, and spirited giants are just some of the pleasures that await in this fresh and funny take on Maya mythology, as rich and delicious as a mug of authentic hot chocolate."], "author": "J.C. Cervantes", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1368016340"},
{"url": "https://www.goodreads.com/book/show/34380219-america-vol-1", "num_ratings": "921", "num_reviews": "195", "avg_ratings": 3.47, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Superheroes", "Marvel", "Comics", "Superheroes", "Lgbt", "Young Adult"], "title": "America, Vol. 1: The Life and Times of America Chavez", "description": ["At last! Everyone's favorite no-nonsense powerhouse, America Chavez, gets her own series! Critically acclaimed young-adult novelist Gabby Rivera and all-star artist Joe Quinones unite to shine a solo spotlight on America's high-octane and hard-hitting adventures! She was a Young Avenger. She leads the Ultimates. And now she officially claims her place as the preeminent but", "At last! Everyone's favorite no-nonsense powerhouse, America Chavez, gets her own series! Critically acclaimed young-adult novelist Gabby Rivera and all-star artist Joe Quinones unite to shine a solo spotlight on America's high-octane and hard-hitting adventures! She was a Young Avenger. She leads the Ultimates. And now she officially claims her place as the preeminent butt-kicker of the entire Marvel Universe! But what's a super-powered teenager to do when she's looking for a little personal fulfi llment? She goes to college! America just has to stop an interdimensional monster or two first and shut down a pesky alien cult that's begun worshipping her exploits before work can begin. Then she can get on with her first assignment: a field trip to the front lines of World War II - with Captain America as her wingman!", " AMERICA 1-6"], "author": "Gabby Rivera", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-31 00:00:00", "ISBN": "1302908812"},
{"url": "https://www.goodreads.com/book/show/17571252-ambassador", "num_ratings": "191", "num_reviews": "58", "avg_ratings": 3.72, "genres": ["Science Fiction", "Childrens", "Middle Grade", "Fiction", "Adventure", "Science Fiction", "Aliens", "Fantasy"], "title": "Ambassador", "description": ["Gabe Fuentes is reading under the covers one summer night when he is interrupted by a creature who looks like a purple sock puppet. The sock puppet introduces himself as the Envoy and asks", "Gabe Fuentes is reading under the covers one summer night when he is interrupted by a creature who looks like a purple sock puppet. The sock puppet introduces himself as the Envoy and asks if Gabe wants to be Earth’s ambassador to the galaxy. What sane twelve-year-old could refuse?", "Some ingenious tinkering with the washing machine sends Gabe’s “entangled” self out to the center of the galaxy. There he finds that Earth is in the path of a destructive alien force—and Gabe himself is the target of an assassination plot. Exactly who wants him out of the way? And why?", "Back home, Gabe discovers that his undocumented parents are in danger of being deported. Can Gabe survive long enough to solve two sets of “alien” problems? He runs for his life, and through Minneapolis and outer space, in this fast-paced adventure from a National Book Award–winning author."], "author": "William  Alexander", "num_pages": "240", "awards": ["Minnesota Book Award Nominee for Young People’s Literature (2015)"], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-23 00:00:00", "ISBN": "1442497661"},
{"url": "https://www.goodreads.com/book/show/18339901-afterlife-with-archie-vol-1", "num_ratings": "5,779", "num_reviews": "689", "avg_ratings": 4.09, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Horror", "Horror", "Zombies", "Young Adult", "Graphic Novels Comics"], "title": "Afterlife with Archie, Vol. 1: Escape from Riverdale", "description": ["When Jughead's beloved pet Hot Dog is killed in a hit and run, Jughead turns to the only person he knows who can help bring back his canine companion—Sabrina the Teenage Witch. Using dark, forbidden magic, Sabrina is successful and Hot Dog returns to the land of the living. But he's not the same... and soon, the darkness he brings back with him from beyond the grave begins", "When Jughead's beloved pet Hot Dog is killed in a hit and run, Jughead turns to the only person he knows who can help bring back his canine companion—Sabrina the Teenage Witch. Using dark, forbidden magic, Sabrina is successful and Hot Dog returns to the land of the living. But he's not the same... and soon, the darkness he brings back with him from beyond the grave begins to spread, forcing Archie and the gang to try to escape Riverdale! Collects issues 1-5 featuring the first storyline \"Escape from Riverdale\" from the new ongoing TEEN+ comic book horror series Afterlife with Archie."], "author": "Roberto Aguirre-Sacasa", "num_pages": "160", "awards": ["Harvey Awards Nominee for Best New Series (2014)", "Will Eisner Comic Industry Awards Nominee for Best Lettering (for Jack Morelli), Best Cover Artist (for Fransesco Francavilla) (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-10 00:00:00", "ISBN": "1619889080"},
{"url": "https://www.goodreads.com/book/show/14362.Bless_Me_Ultima", "num_ratings": "22,681", "num_reviews": "1,952", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "Young Adult", "Magical Realism", "Academic", "School"], "title": "Bless Me, Ultima", "description": ["Antonio Marez is six years old when Ultima enters his life. She is a curandera, one who heals with herbs and magic. 'We cannot let her live her last days in loneliness,' says Antonio's mother. 'It is not the way of our people,' agrees his father. And so Ultima comes to live with Antonio's family in New Mexico. Soon Tony will journey to the threshold of manhood. Always, Ult", "Antonio Marez is six years old when Ultima enters his life. She is a curandera, one who heals with herbs and magic. 'We cannot let her live her last days in loneliness,' says Antonio's mother. 'It is not the way of our people,' agrees his father. And so Ultima comes to live with Antonio's family in New Mexico. Soon Tony will journey to the threshold of manhood. Always, Ultima watches over him. She graces him with the courage to face childhood bigotry, diabolical possession, the moral collapse of his brother, and too many violent deaths. Under her wise guidance, Tony will probe the family ties that bind him, and he will find in himself the magical secrets of the pagan past—a mythic legacy equally as palpable as the Catholicism of Latin America in which he has been schooled. At each turn in his life there is Ultima who will nurture the birth of his soul."], "author": "Rudolfo Anaya", "num_pages": "290", "awards": ["Premio Quinto Sol"], "places": ["United States of America", "New Mexico"], "character_names": ["Antonio Marez", "Ultima, la Grande", "Tenorio", "Narciso"], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "0446675369"},
{"url": "https://www.goodreads.com/book/show/5931169-santa-olivia", "num_ratings": "7,738", "num_reviews": "798", "avg_ratings": 3.83, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Lgbt", "Science Fiction", "Fiction", "Science Fiction", "Dystopia"], "title": "Santa Olivia", "description": ["Lushly written with rich and vivid characters, SANTA OLIVIA is Jacqueline Carey's take on comic book superheroes and the classic werewolf myth.", " Loup Garron was born and raised in Santa Olivia, an isolated, disenfranchised town next to a US military base inside a DMZ buffer zone between Texas and Mexico. A fugitive \"Wolf-Man\" who had a love affair with a local woman, Loup's", "Lushly written with rich and vivid characters, SANTA OLIVIA is Jacqueline Carey's take on comic book superheroes and the classic werewolf myth.", " Loup Garron was born and raised in Santa Olivia, an isolated, disenfranchised town next to a US military base inside a DMZ buffer zone between Texas and Mexico. A fugitive \"Wolf-Man\" who had a love affair with a local woman, Loup's father was one of a group of men genetically-manipulated and used by the US government as a weapon. The \"Wolf-Men\" were engineered to have superhuman strength, speed, sensory capability, stamina, and a total lack of fear, and Loup, named for and sharing her father's wolf-like qualities, is marked as an outsider.", " After her mother dies, Loup goes to live among the misfit orphans at the parish church, where they seethe from the injustices visited upon the locals by the soldiers. Eventually, the orphans find an outlet for their frustrations: They form a vigilante group to support Loup Garron who, costumed as their patron saint, Santa Olivia, uses her special abilities to avenge the town.", " Aware that she could lose her freedom, and possibly her life, Loup is determined to fight to redress the wrongs her community has suffered. And like the reincarnation of their patron saint, she will bring hope to all of Santa Olivia."], "author": "Jacqueline Carey", "num_pages": "341", "awards": [], "places": [], "character_names": ["Loup Garron"], "language": "English", "publish_date": "2009-05-29 00:00:00", "ISBN": "044619817X"},
{"url": "https://www.goodreads.com/book/show/12989106-on-fire", "num_ratings": "1,250", "num_reviews": "179", "avg_ratings": 3.78, "genres": ["Fantasy", "Shapeshifters", "Werewolves", "Young Adult", "Fantasy", "Supernatural", "Fiction"], "title": "On Fire: A Teen Wolf Novel", "description": ["Scott was just a regular guy until one bite changed his life. Now he struggles to understand who he is and what he might become. Is he more wolf than human—or is it the other way around? Whichever it is, it’s not going to be easy. Scott tries to control his urges, but", "Scott was just a regular guy until one bite changed his life. Now he struggles to understand who he is and what he might become. Is he more wolf than human—or is it the other way around? Whichever it is, it’s not going to be easy. Scott tries to control his urges, but mostly he’s scared that it’s his urges that could end up controlling him.", "is the story of what happens when you to walk the line between what you want and what you can’t help from wanting. Will the bite end up being a gift? Or will it be a curse? And what will it all mean for Scott’s relationship with Allison—the girl he can’t get enough of? Only time will tell if he should embrace his newfound powers, or if he should fear them."], "author": "Nancy Holder", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-17 00:00:00", "ISBN": "1451674473"},
{"url": "https://www.goodreads.com/book/show/35209788-clockwork-curandera", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Science Fiction", "Steampunk", "Retellings"], "title": "Clockwork Curandera", "description": ["A YA steampunk graphic novel reimagining of Frankenstein set in an alternate colonial Mexico."], "author": "David  Bowles", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/28220785-certain-dark-things", "num_ratings": "1,571", "num_reviews": "449", "avg_ratings": 3.66, "genres": ["Fantasy", "Horror", "Paranormal", "Vampires", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Fiction", "Adult", "Young Adult"], "title": "Certain Dark Things", "description": ["Welcome to Mexico City… An Oasis In A Sea Of Vampires…", "Domingo, a lonely garbage-collecting street kid, is busy eking out a living when a jaded vampire on the run swoops into his life.", "Atl, the descendant of Aztec blood drinkers, must feast on the young to survive and Domingo looks especially tasty. Smart, beautiful, and dangerous, Atl needs to escape to South America, far f", "Welcome to Mexico City… An Oasis In A Sea Of Vampires…", "Domingo, a lonely garbage-collecting street kid, is busy eking out a living when a jaded vampire on the run swoops into his life.", "Atl, the descendant of Aztec blood drinkers, must feast on the young to survive and Domingo looks especially tasty. Smart, beautiful, and dangerous, Atl needs to escape to South America, far from the rival narco-vampire clan pursuing her. Domingo is smitten.", "Her plan doesn’t include developing any real attachment to Domingo. Hell, the only living creature she loves is her trusty Doberman. Little by little, Atl finds herself warming up to the scrappy young man and his effervescent charm.", "And then there’s Ana, a cop who suddenly finds herself following a trail of corpses and winds up smack in the middle of vampire gang rivalries.", "Vampires, humans, cops, and gangsters collide in the dark streets of Mexico City. Do Atl and Domingo even stand a chance of making it out alive?"], "author": "Silvia Moreno-Garcia", "num_pages": "336", "awards": ["Locus Award Nominee for Best Horror Novel (2017)", "Sunburst Award Nominee for Novel (2017)"], "places": ["Mexico City (México City)"], "character_names": [], "language": "English", "publish_date": "2016-10-25 00:00:00", "ISBN": "1250099080"},
{"url": "https://www.goodreads.com/book/show/28484604-a-kingdom-beneath-the-waves", "num_ratings": "10", "num_reviews": "4", "avg_ratings": 4.8, "genres": ["Fantasy"], "title": "A Kingdom Beneath the Waves", "description": ["The Garza family’s Christmas vacation in Mexico is cut short by the appearance of Pingo, one of the elfish tzapame. The news is grim: a rogue prince from an ancient undersea kingdom is seeking the Shadow Stone, a device he will use to flood the world and wipe out humanity. Now Carol and Johnny must join a group of merfolk and travel into the deepest chasms of the Pacific O", "The Garza family’s Christmas vacation in Mexico is cut short by the appearance of Pingo, one of the elfish tzapame. The news is grim: a rogue prince from an ancient undersea kingdom is seeking the Shadow Stone, a device he will use to flood the world and wipe out humanity. Now Carol and Johnny must join a group of merfolk and travel into the deepest chasms of the Pacific Ocean to stop the prince and his monstrous army with their savage magic."], "author": "David  Bowles", "num_pages": "254", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-19 00:00:00", "ISBN": "1925148939"},
{"url": "https://www.goodreads.com/book/show/34051373-shadowhouse-fall", "num_ratings": "716", "num_reviews": "182", "avg_ratings": 4.28, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Paranormal"], "title": "Shadowhouse Fall", "description": ["Sierra and her friends love their new lives as shadowshapers, making art and creating change with the spirits of Brooklyn. Then Sierra receives a strange card depicting a beast called the Hound of Light—an image from the enigmatic, influential Deck of Worlds. The Deck tracks the players and powers of all the magical houses in the city, and when the ", " H", "Sierra and her friends love their new lives as shadowshapers, making art and creating change with the spirits of Brooklyn. Then Sierra receives a strange card depicting a beast called the Hound of Light—an image from the enigmatic, influential Deck of Worlds. The Deck tracks the players and powers of all the magical houses in the city, and when the ", " Hound begins to stalk Sierra through the streets, the shadowshapers know their next battle has arrived.", "Sierra and Shadowhouse have been thrust into an ancient struggle with enemies old and new—a struggle they didn’t want, but are determined to win. Revolution is brewing in the real world as well, as the shadowshapers lead the fight against systems that oppress their community. To protect her family and friends in every sphere, Sierra must take down the Hound and master the Deck of Worlds…or else she could lose all the things that matter most."], "author": "Daniel José Older", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-12 00:00:00", "ISBN": "0545952824"},
{"url": "https://www.goodreads.com/book/show/27245910-the-shadow-hour", "num_ratings": "1,837", "num_reviews": "318", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic"], "title": "The Shadow Hour", "description": ["Everything in Echo’s life changed in a blinding flash when she learned the startling truth: she is the firebird, the creature of light that is said to bring peace.", "The firebird has come into the world, but it has not come alone. Every action has an equal and opposite reaction, and Echo can feel a great and terrible dark", "Everything in Echo’s life changed in a blinding flash when she learned the startling truth: she is the firebird, the creature of light that is said to bring peace.", "The firebird has come into the world, but it has not come alone. Every action has an equal and opposite reaction, and Echo can feel a great and terrible darkness rising in the distance. Cosmic forces threaten to tear the world apart.", "Echo has already lost her home, her family, and her boyfriend. Now, as the firebird, her path is filled with even greater dangers than the ones she’s already overcome.", "She knows the Dragon Prince will not fall without a fight.", "Echo must decide: can she wield the power of her true nature—or will it prove too strong for her, and burn what’s left of her world to the ground?", "Welcome to the shadow hour."], "author": "Melissa Grey", "num_pages": "421", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-07-12 00:00:00", "ISBN": "0385744676"},
{"url": "https://www.goodreads.com/book/show/36390949-coco-middle-grade-novel", "num_ratings": "131", "num_reviews": "35", "avg_ratings": 4.55, "genres": ["Childrens", "Fiction", "Fantasy", "Paranormal", "Ghosts"], "title": "Coco Middle Grade Novel", "description": ["Inspired by Pixar Animation Studios' latest film, Coco, this middle grade novel retells the story of Miguel's daring adventure, and features exciting new scenes about his family."], "author": "Diana López", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-10-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/33158561-wild-beauty", "num_ratings": "3,526", "num_reviews": "1,042", "avg_ratings": 3.64, "genres": ["Fantasy", "Young Adult", "Magical Realism", "Lgbt"], "title": "Wild Beauty", "description": ["For nearly a century, the Nomeolvides women have tended the grounds of La Pradera, the lush estate gardens that enchant guests from around the world. They’ve also hidden a tragic legacy: if they fall in love too deeply, their lovers vanish. But then, after generations of vanishings, a strange boy appears in the gardens.", "The boy is a mystery to", "For nearly a century, the Nomeolvides women have tended the grounds of La Pradera, the lush estate gardens that enchant guests from around the world. They’ve also hidden a tragic legacy: if they fall in love too deeply, their lovers vanish. But then, after generations of vanishings, a strange boy appears in the gardens.", "The boy is a mystery to Estrella, the Nomeolvides girl who finds him, and to her family, but he’s even more a mystery to himself; he knows nothing more about who he is or where he came from than his first name. As Estrella tries to help Fel piece together his unknown past, La Pradera leads them to secrets as dangerous as they are magical in this stunning exploration of love, loss, and family."], "author": "Anna-Marie McLemore", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-03 00:00:00", "ISBN": "1250124557"},
{"url": "https://www.goodreads.com/book/show/31179006-sweet-black-waves", "num_ratings": "462", "num_reviews": "189", "avg_ratings": 3.89, "genres": ["Fantasy", "Young Adult", "Retellings", "Romance"], "title": "Sweet Black Waves", "description": ["Two proud kingdoms stand on opposite shores, with only a bloody history between them. ", "As best friend and lady-in-waiting to the princess, Branwen is guided by two principles: devotion to her homeland and hatred for the raiders who killed her parents. When she unknowingly saves the life of her enemy, he awakens her ancient healing magi", "Two proud kingdoms stand on opposite shores, with only a bloody history between them. ", "As best friend and lady-in-waiting to the princess, Branwen is guided by two principles: devotion to her homeland and hatred for the raiders who killed her parents. When she unknowingly saves the life of her enemy, he awakens her ancient healing magic and opens her heart. Branwen begins to dream of peace, but the princess she serves is not so easily convinced. Fighting for what's right, even as her powers grow beyond her control, will set Branwen against both her best friend and the only man she's ever loved. ", "Inspired by the star-crossed tale of Tristan and Eseult, this is the story of the legend’s true heroine: Branwen. For fans of ", " and ", ", this is the first book of a lush fantasy trilogy about warring countries, family secrets, and forbidden romance."], "author": "Kristina Pérez", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-06-05 00:00:00", "ISBN": "1250132851"},
{"url": "https://www.goodreads.com/book/show/20980944-lowriders-in-space", "num_ratings": "1,478", "num_reviews": "324", "avg_ratings": 3.7, "genres": ["Sequential Art", "Graphic Novels", "Childrens", "Middle Grade", "Fantasy", "Sequential Art", "Comics", "Adventure", "Fiction"], "title": "Lowriders in Space", "description": ["Lupe Impala, El Chavo Flapjack, and Elirio Malaria love working with cars. You name it, they can fix it. But the team's favorite cars of all are lowriders—cars that hip and hop, dip and drop, go low and slow, bajito y suavecito. The stars align when a contest for the best car around offers a prize of a trunkful of cash—just what the team needs to open their own shop! ¡Ay c", "Lupe Impala, El Chavo Flapjack, and Elirio Malaria love working with cars. You name it, they can fix it. But the team's favorite cars of all are lowriders—cars that hip and hop, dip and drop, go low and slow, bajito y suavecito. The stars align when a contest for the best car around offers a prize of a trunkful of cash—just what the team needs to open their own shop! ¡Ay chihuahua! What will it take to transform a junker into the best car in the universe? ", "Striking, unparalleled art from debut illustrator Raul the Third recalls ballpoint-pen-and-Sharpie desk-drawn doodles, while the story is sketched with Spanish, inked with science facts, and colored with true friendship. With a glossary at the back to provide definitions for Spanish and science terms, this delightful book will educate and entertain in equal measure."], "author": "Cathy Camper", "num_pages": "112", "awards": ["Oregon Spirit Book Award Nominee for Graphic Novel (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-04 00:00:00", "ISBN": "1452128693"},
{"url": "https://www.goodreads.com/book/show/36952596-blanca-roja", "num_ratings": "62", "num_reviews": "48", "avg_ratings": 4.4, "genres": ["Magical Realism", "Fantasy", "Young Adult", "Retellings", "Lgbt"], "title": "Blanca & Roja", "description": ["The biggest lie of all is the story you think you already know.", "The del Cisne girls have never just been sisters; they’re also rivals, Blanca as obedient and graceful as Roja is vicious and manipulative. They know that, because of a generations-old spell, their family is bound to a bevy of swans deep in the woods. They know that, one day, the swans will pull them into a dan", "The biggest lie of all is the story you think you already know.", "The del Cisne girls have never just been sisters; they’re also rivals, Blanca as obedient and graceful as Roja is vicious and manipulative. They know that, because of a generations-old spell, their family is bound to a bevy of swans deep in the woods. They know that, one day, the swans will pull them into a dangerous game that will leave one of them a girl, and trap the other in the body of a swan.", "But when two local boys become drawn into the game, the swans’ spell intertwines with the strange and unpredictable magic lacing the woods, and all four of their fates depend on facing truths that could either save or destroy them. Blanca & Roja is the captivating story of sisters, friendship, love, hatred, and the price we pay to protect our hearts."], "author": "Anna-Marie McLemore", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": null, "ISBN": "1250162718"},
{"url": "https://www.goodreads.com/book/show/27414411-pitch-dark", "num_ratings": "425", "num_reviews": "112", "avg_ratings": 3.98, "genres": ["Young Adult", "Horror", "Science Fiction"], "title": "Pitch Dark", "description": ["Set against a future of marauding space scavengers and deadly aliens who kill with sound, here is a frightening, fast-paced YA adventure from the author of the acclaimed horror novel, ", ".", "Tuck has been in stasis on the ", ", a ship that houses Earth’s most valued artifacts—its natural resources. Parks and mountains are preserved in space. ", "Laura belongs to a sh", "Set against a future of marauding space scavengers and deadly aliens who kill with sound, here is a frightening, fast-paced YA adventure from the author of the acclaimed horror novel, ", ".", "Tuck has been in stasis on the ", ", a ship that houses Earth’s most valued artifacts—its natural resources. Parks and mountains are preserved in space. ", "Laura belongs to a shipraiding family, who are funded by a group used to getting what they want. And they want what’s on the ", ". ", "Tuck and Laura didn’t bargain on working together, or battling mutant aliens who use sound to kill. But their plan is the only hope for their crews, their families, and themselves. ", "In space, nobody can hear you scream . . . but on the ", ", the screams are the last thing you'll hear."], "author": "Courtney Alameda", "num_pages": "378", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-02-20 00:00:00", "ISBN": "1250085896"},
{"url": "https://www.goodreads.com/book/show/33918887-bruja-born", "num_ratings": "639", "num_reviews": "257", "avg_ratings": 4.15, "genres": ["Fantasy", "Young Adult"], "title": "Bruja Born", "description": ["Lula Mortiz feels like an outsider. Her sister's newfound Encantrix powers have wounded her in ways that Lula's bruja healing powers can't fix, and she longs for the comfort her family once brought her. Thank the Deos for Maks, her sweet, steady boyfriend who sees the beauty within her and brings light to her life.", "Then a bus crash t", "Lula Mortiz feels like an outsider. Her sister's newfound Encantrix powers have wounded her in ways that Lula's bruja healing powers can't fix, and she longs for the comfort her family once brought her. Thank the Deos for Maks, her sweet, steady boyfriend who sees the beauty within her and brings light to her life.", "Then a bus crash turns Lula's world upside down. Her classmates are all dead, including Maks. But Lula was born to heal, to fix. She can bring Maks back, even if it means seeking help from her sisters and defying Death herself. But magic that defies the laws of the deos is dangerous. Unpredictable. And when the dust settles, Maks isn't the only one who's been brought back..."], "author": "Zoraida Córdova", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-06-05 00:00:00", "ISBN": "149265065X"},
{"url": "https://www.goodreads.com/book/show/35297488-dealing-in-dreams", "num_ratings": "2", "num_reviews": "4", "avg_ratings": 4.5, "genres": ["Young Adult", "Science Fiction", "Dystopia"], "title": "Dealing in Dreams", "description": ["Nalah leads the fiercest all-girl crew in Mega City. That roles brings with it violent throw downs and access to the hottest boydega clubs, but the sixteen-year-old grows weary of the life. Her dream is to get off the streets and make a home in the exclusive Mega Towers, in which only a chosen few get to live. To make it to the M", "Nalah leads the fiercest all-girl crew in Mega City. That roles brings with it violent throw downs and access to the hottest boydega clubs, but the sixteen-year-old grows weary of the life. Her dream is to get off the streets and make a home in the exclusive Mega Towers, in which only a chosen few get to live. To make it to the Mega towers, Nalah must prove her loyalty to the city's benevolent founder and cross the border in a search for a mysterious gang the Ashé Ryders. Led by a reluctant guide, Nalah battles other crews and her own doubts, but the closer she gets to her goal, the more she loses sight of everything—and everyone— she cares about.", "Nalah must do the unspeakable to get what she wants—a place to call home. But is a home just where you live? Or who you choose to protect?"], "author": "Lilliam Rivera", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1481472143"},
{"url": "https://www.goodreads.com/book/show/36595887-sal-and-gabi-break-the-universe", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 4.5, "genres": ["Childrens", "Middle Grade", "Fantasy", "Science Fiction"], "title": "Sal and Gabi Break the Universe", "description": ["How did a raw chicken get inside Yasmany's locker? When Sal Vidon meets Gabi Real for the first time, it isn't under the best of circumstances. Sal is in the principal's office for the third time in three days, and it's still the first week of school. Gabi, student council president and editor of the school paper, is there to support her friend Yasmany, who just picked a f", "How did a raw chicken get inside Yasmany's locker? When Sal Vidon meets Gabi Real for the first time, it isn't under the best of circumstances. Sal is in the principal's office for the third time in three days, and it's still the first week of school. Gabi, student council president and editor of the school paper, is there to support her friend Yasmany, who just picked a fight with Sal. She is determined to prove that somehow, Sal planted a raw chicken in Yasmany's locker, even though nobody saw him do it and the bloody poultry has since mysteriously disappeared. Sal prides himself on being an excellent magician, but for this sleight of hand, he relied on a talent no one would guess . . . except maybe Gabi, whose sharp eyes never miss a trick. When Gabi learns that he's capable of conjuring things much bigger than a chicken--including his dead mother--and she takes it all in stride, Sal knows that she is someone he can work with. There's only one slight problem: their manipulation of time and space could put the entire universe at risk. A sassy entropy sweeper, a documentary about wedgies, a principal who wears a Venetian bauta mask, and heaping platefuls of Cuban food are just some of the delights that await in his mind-blowing novel gift-wrapped in love and laughter."], "author": "Carlos  Hernández", "awards": [], "places": [], "character_names": [], "language": "English"},
{"url": "https://www.goodreads.com/book/show/34929695-university-of-doom", "num_ratings": "11", "num_reviews": "3", "avg_ratings": 4.55, "genres": [], "title": "University of Doom", "description": ["Monsters, robots, a sinister villain... And a boy who's about to discover that the only way to defeat EVIL is with GENIUS.", "Thirteen-year-old Alfonso is top of his class at the University of Doom, the super-secret Center of Evil Genius Academia and Mad Science. He longs to be a mad scientist like his father, Dr. Eugenio Frankenstein. But when family nemesis Professor James M", "Monsters, robots, a sinister villain... And a boy who's about to discover that the only way to defeat EVIL is with GENIUS.", "Thirteen-year-old Alfonso is top of his class at the University of Doom, the super-secret Center of Evil Genius Academia and Mad Science. He longs to be a mad scientist like his father, Dr. Eugenio Frankenstein. But when family nemesis Professor James Moriarty falsely accuses the Frankenstein family of going too far at playing God, they're exiled to an ordinary suburban neighborhood, where they must hide their past to fit in.", "Despite his father's wishes, Alfonso returns to the University of Doom with his new friend, Sarah Barker, to battle Professor Moriarty and his army of monsters and robots to become the greatest evil genius who ever lived."], "author": "Mario Acevedo", "num_pages": "372", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-07-11 00:00:00", "ISBN": "0996403981"},
{"url": "https://www.goodreads.com/book/show/31371485-avenged", "num_ratings": "3,163", "num_reviews": "459", "avg_ratings": 4.0, "genres": ["Fantasy", "Young Adult", "Romance"], "title": "Avenged", "description": ["Emelina Flores has come home to Ruina. After rescuing her sister, Olivia, from imprisonment in rival kingdom Lera, Em and Olivia together vow to rebuild Ruina to its former glory. ", "But just because Em and Olivia are out of Lera doesn’t mean they are safe. Their actions over the past year have had consequences, and they", "Emelina Flores has come home to Ruina. After rescuing her sister, Olivia, from imprisonment in rival kingdom Lera, Em and Olivia together vow to rebuild Ruina to its former glory. ", "But just because Em and Olivia are out of Lera doesn’t mean they are safe. Their actions over the past year have had consequences, and they are now targets of retaliation. Olivia will destroy everyone who acts against Ruina. Em isn’t as sure. ", "Ever since Em posed as Prince Casimir’s betrothed in Lera, she’s started to see another side to this war. Lera may have destroyed the Ruined for decades, but Em knows that Cas is different. And now that he’s taken the throne, Em believes a truce is within reach. But Olivia suspects that Em’s romantic feelings for Cas are just coloring her judgement.", "Em is determined to bring peace to her home. But when winning the war could mean betraying her family, she faces an impossible choice between loyalty and love. Em must stay one step ahead of her enemies—and her blood—before she’s the next victim in this battle for sovereignty."], "author": "Amy Tintera", "num_pages": "412", "awards": [], "places": [], "character_names": ["Emelina Flores", "Casimir Gallegos", "Olivia Flores"], "language": "English", "publish_date": "2017-05-02 00:00:00", "ISBN": "0062396633"},
{"url": "https://www.goodreads.com/book/show/26074185-ruined", "num_ratings": "10,078", "num_reviews": "1,613", "avg_ratings": 3.89, "genres": ["Fantasy", "Young Adult", "Romance"], "title": "Ruined", "description": ["Emelina Flores has nothing. Her home in Ruina has been ravaged by war. She lacks the powers of her fellow Ruined. Worst of all, she witnessed her parents’ brutal murders and watched helplessly as her sister, Olivia, was kidnapped.", "But because Em has nothing, she has nothing to lose. Driven by a blind desire for reve", "Emelina Flores has nothing. Her home in Ruina has been ravaged by war. She lacks the powers of her fellow Ruined. Worst of all, she witnessed her parents’ brutal murders and watched helplessly as her sister, Olivia, was kidnapped.", "But because Em has nothing, she has nothing to lose. Driven by a blind desire for revenge, Em sets off on a dangerous journey to the enemy kingdom of Lera. Somewhere within Lera’s borders, Em hopes to find Olivia. But in order to find her, Em must infiltrate the royal family.", "In a brilliant, elaborate plan of deception and murder, Em marries Prince Casimir, next in line to take Lera’s throne. If anyone in Lera discovers Em is not Casimir’s true betrothed, Em will be executed on the spot. But it’s the only way to salvage Em’s kingdom and what is left of her family.", "Em is determined to succeed, but the closer she gets to the prince, the more she questions her mission. Em’s rage-filled heart begins to soften. But with her life—and her family—on the line, love could be Em’s deadliest mistake."], "author": "Amy Tintera", "num_pages": "355", "awards": [], "places": [], "character_names": ["Emelina Flores", "Casimir Gallegos"], "language": "English", "publish_date": "2016-05-03 00:00:00", "ISBN": "0062396609"},
{"url": "https://www.goodreads.com/book/show/13517455-reboot", "num_ratings": "28,073", "num_reviews": "3,324", "avg_ratings": 3.91, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction"], "title": "Reboot", "description": ["Five years ago, Wren Connolly was shot three times in the chest. After 178 minutes she came back as a Reboot: stronger, faster, able to heal, and less emotional. The longer Reboots are dead, the less human they are when they return. Wren 178 is the deadliest Reboot in the Republic of Texas. Now seventeen years old, she serves as a soldier for HARC (Human Advancement and Re", "Five years ago, Wren Connolly was shot three times in the chest. After 178 minutes she came back as a Reboot: stronger, faster, able to heal, and less emotional. The longer Reboots are dead, the less human they are when they return. Wren 178 is the deadliest Reboot in the Republic of Texas. Now seventeen years old, she serves as a soldier for HARC (Human Advancement and Repopulation Corporation).", "Wren’s favorite part of the job is training new Reboots, but her latest newbie is the worst she’s ever seen. As a 22, Callum Reyes is practically human. His reflexes are too slow, he’s always asking questions, and his ever-present smile is freaking her out. Yet there’s something about him she can’t ignore. When Callum refuses to follow an order, Wren is given one last chance to get him in line—or she’ll have to eliminate him. Wren has never disobeyed before and knows if she does, she’ll be eliminated, too. But she has also never felt as alive as she does around Callum.", "The perfect soldier is done taking orders."], "author": "Amy Tintera", "num_pages": "365", "awards": [], "places": ["Republic of Texas"], "character_names": ["Wren Connolly", "Callum Reyes"], "language": "English", "publish_date": "2013-05-07 00:00:00", "ISBN": "0062217070"},
{"url": "https://www.goodreads.com/book/show/15769788-rebel", "num_ratings": "9,903", "num_reviews": "1,099", "avg_ratings": 4.04, "genres": ["Science Fiction", "Dystopia", "Young Adult", "Science Fiction"], "title": "Rebel", "description": ["Wren Connolly thought she'd left her human side behind when she dies five years ago and came back 178 minutes later as a Reboot. With her new abilities of strength, speed, and healing—along with a lack of emotions—Wren 178 became the perfect soldier for HARC (Human Advancement and Repopulation Corporation). Then Callum 22 came along and changed everything.", "Now that they've", "Wren Connolly thought she'd left her human side behind when she dies five years ago and came back 178 minutes later as a Reboot. With her new abilities of strength, speed, and healing—along with a lack of emotions—Wren 178 became the perfect soldier for HARC (Human Advancement and Repopulation Corporation). Then Callum 22 came along and changed everything.", "Now that they've both escaped, they're ready to start a new life in peace on the Reboot reservation. But Micah 163, the Reboot running the reservation, has darker plans in mind: to wipe out the humans. ", ". Micah has been building a Reboot army for years and is now ready to launch his attack on the cities. Callum wants to stick around and protect the humans. Wren wants nothing more than to leave all the fighting behind them.", "With Micah on one side, HARC on the other, and Wren and Callum at odds in the middle, there's only one option left..."], "author": "Amy Tintera", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-13 00:00:00", "ISBN": "0062217100"},
{"url": "https://www.goodreads.com/book/show/25810644-a-fierce-and-subtle-poison", "num_ratings": "1,655", "num_reviews": "437", "avg_ratings": 3.21, "genres": ["Young Adult", "Fantasy", "Magical Realism", "Mystery", "Fiction"], "title": "A Fierce and Subtle Poison", "description": ["Everyone knows the legends about the cursed girl--Isabel, the one the señoras whisper about. They say she has green skin and grass for hair, and she feeds on the poisonous plants that fill her family’s Caribbean island garden. Some say she can grant wishes; some say her touch can kill.", "Seventeen-year-old Lucas lives on the mainland most of the year but spends summers with h", "Everyone knows the legends about the cursed girl--Isabel, the one the señoras whisper about. They say she has green skin and grass for hair, and she feeds on the poisonous plants that fill her family’s Caribbean island garden. Some say she can grant wishes; some say her touch can kill.", "Seventeen-year-old Lucas lives on the mainland most of the year but spends summers with his hotel-developer father in Puerto Rico. He’s grown up hearing stories about the cursed girl, and he wants to believe in Isabel and her magic. When letters from Isabel begin mysteriously appearing in his room the same day his new girlfriend disappears, Lucas turns to Isabel for answers--and finds himself lured into her strange and enchanted world. But time is running out for the girl filled with poison, and the more entangled Lucas becomes with Isabel, the less certain he is of escaping with his own life."], "author": "Samantha Mabry", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-04-12 00:00:00", "ISBN": "1616205210"},
{"url": "https://www.goodreads.com/book/show/25691913-the-circle-of-lies", "num_ratings": "42", "num_reviews": "10", "avg_ratings": 4.21, "genres": ["Fantasy", "Fantasy", "Mythology", "Childrens", "Middle Grade", "Fantasy", "Magic"], "title": "The Circle of Lies", "description": ["Four girls at a southwestern boarding school discover they have amazing feline powers and must unite to stop an ancient evil in the second riveting adventure of the Hunters of Chaos series.", "Ana’s life changed dramatically when she accepted a position at an exclusive boarding school in New Mexico. She found three great new friends—Shani, Doli, and Lin—and together, they disc", "Four girls at a southwestern boarding school discover they have amazing feline powers and must unite to stop an ancient evil in the second riveting adventure of the Hunters of Chaos series.", "Ana’s life changed dramatically when she accepted a position at an exclusive boarding school in New Mexico. She found three great new friends—Shani, Doli, and Lin—and together, they discovered that they each had the power to turn into a wildcat. Their new friendship and powers were put to the test in a battle against the god Anubis and his newly resurrected Brotherhood of Chaos.", "After defeating the Brotherhood, Ana learns that her aunt and uncle have gone missing. Her friends are ready to help her find them, but then Shani is accused of vandalizing school property and expelled. While Ana and the others head to Mexico to search for her family, Shani travels to Mumbai to stay with her father. But strange things are happening in the Indian city. Has she stumbled upon another sinister plot?", "Meanwhile, Ana, Doli, and Lin have gone to Mexico to try and track down Ana’s family, and in the heart of Chichen Itxa, they find new dangers—and more proof of the Brotherhood’s growing power. With the four wildcats separated by thousands of miles, is this Anubis’s chance to rise again?"], "author": "Crystal Velásquez", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-02-16 00:00:00", "ISBN": "1481424556"},
{"url": "https://www.goodreads.com/book/show/23899848-hostage", "num_ratings": "220", "num_reviews": "42", "avg_ratings": 4.26, "genres": ["Fantasy", "Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Apocalyptic", "Post Apocalyptic", "Lgbt"], "title": "Hostage", "description": ["Welcome back to Las Anclas, a frontier town in the post-apocalyptic Wild West. In Las Anclas, the skull-faced sheriff possesses superhuman strength, the doctor can speed up time, and the squirrels can teleport sandwiches out of your hands.", "In book one, ", " teenage prospector Ross Juarez stumbled into town half-dead, bringing with him a precious artifact, a power no on", "Welcome back to Las Anclas, a frontier town in the post-apocalyptic Wild West. In Las Anclas, the skull-faced sheriff possesses superhuman strength, the doctor can speed up time, and the squirrels can teleport sandwiches out of your hands.", "In book one, ", " teenage prospector Ross Juarez stumbled into town half-dead, bringing with him a precious artifact, a power no one has ever had before, and a whole lot of trouble— including an invasion by Voske, the king of Gold Point. The town defeated Voske’s army, with the deciding blow struck by Ross, but at a great cost. ", "In ", " a team sent by King Voske captures Ross and takes him to Gold Point. There he meets Kerry, Voske’s teenage daughter, who has been trained to be as ruthless as her father. While his friends in Las Anclas desperately try to rescue him, Ross is forced to engage in a battle of wills with the king himself."], "author": "Rachel Manija Brown", "num_pages": "321", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16034526-stranger", "num_ratings": "809", "num_reviews": "158", "avg_ratings": 3.89, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Science Fiction", "Dystopia", "Lgbt"], "title": "Stranger", "description": ["Many generations ago, a mysterious cataclysm struck the world. Governments collapsed and people scattered, to rebuild where they could. A mutation, \"the Change,” arose, granting some people unique powers. Though the area once called Los Angeles retains its cultural diversity, its technological marvels have faded into legend. \"Las Anclas\" now resembles a Wild West frontier", "Many generations ago, a mysterious cataclysm struck the world. Governments collapsed and people scattered, to rebuild where they could. A mutation, \"the Change,” arose, granting some people unique powers. Though the area once called Los Angeles retains its cultural diversity, its technological marvels have faded into legend. \"Las Anclas\" now resembles a Wild West frontier town… where the Sheriff possesses superhuman strength, the doctor can warp time to heal his patients, and the distant ruins of an ancient city bristle with deadly crystalline trees that take their jewel-like colors from the clothes of the people they killed.", "Teenage prospector Ross Juarez’s best find ever – an ancient book he doesn’t know how to read – nearly costs him his life when a bounty hunter is set on him to kill him and steal the book. Ross barely makes it to Las Anclas, bringing with him a precious artifact, a power no one has ever had before, and a whole lot of trouble."], "author": "Rachel Manija Brown", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-11-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22428866-the-head-of-the-saint", "num_ratings": "564", "num_reviews": "108", "avg_ratings": 3.87, "genres": ["Young Adult", "Magical Realism", "Cultural", "Brazil", "Fiction", "Realistic Fiction"], "title": "The Head of the Saint", "description": ["After walking for days across the harsh Brazilian landscape only to be rejected by his last living relative, Samuel finds his options for survival are dwindling fast - until he comes to the hollow head of a statue, perfect for a boy to crawl into and hide...", "Whilst sheltering, Samuel realises that he can hear the villagers' whispered prayers to Saint Anthony - confessing lo", "After walking for days across the harsh Brazilian landscape only to be rejected by his last living relative, Samuel finds his options for survival are dwindling fast - until he comes to the hollow head of a statue, perfect for a boy to crawl into and hide...", "Whilst sheltering, Samuel realises that he can hear the villagers' whispered prayers to Saint Anthony - confessing lost loves, hopes and fears - and he begins to wonder if he ought to help them out a little. When Samuel's advice hits the mark he becomes famous, and people flock to the town to hear about their future loves. But with all the fame comes some problems, and soon Samuel has more than just the lovelorn to deal with. A completely charming and magically told Brazilian tale, sure to capture your heart."], "author": "Socorro Acioli", "num_pages": "208", "awards": ["Los Angeles Times Book Prize Nominee for Young Adult Literature (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22749539-echo", "num_ratings": "21,173", "num_reviews": "4,564", "avg_ratings": 4.37, "genres": ["Historical", "Historical Fiction", "Childrens", "Middle Grade", "Fantasy", "Young Adult", "Fiction", "Audiobook"], "title": "Echo", "description": ["Lost and alone in a forbidden forest, Otto meets three mysterious sisters and suddenly finds himself entwined in a puzzling quest involving a prophecy, a promise, and a harmonica.", "  ", " Decades later, Friedrich in Germany, Mike in Pennsylvania, and Ivy in California each, in turn, become interwoven when the very same harmonica lands in their lives. All the children face daunti", "Lost and alone in a forbidden forest, Otto meets three mysterious sisters and suddenly finds himself entwined in a puzzling quest involving a prophecy, a promise, and a harmonica.", "  ", " Decades later, Friedrich in Germany, Mike in Pennsylvania, and Ivy in California each, in turn, become interwoven when the very same harmonica lands in their lives. All the children face daunting challenges: rescuing a father, protecting a brother, holding a family together. And ultimately, pulled by the invisible thread of destiny, their solo stories converge in an orchestral crescendo."], "author": "Pam Muñoz Ryan", "num_pages": "587", "awards": ["Newbery Medal Nominee (2016)", "Odyssey Award Nominee (2016)", "Audie Award for Middle Grade (2016)", "Dorothy Canfield Fisher Children's Book Award Nominee (2017)", "Américas Award (2016)", "Children's Literature Council of Southern California Award for Outstanding Work of Fiction (2016)", "Kirkus Prize for Young Readers' Literature (2015)", "Goodreads Choice Award Nominee for Middle Grade & Children's (2015)", "Rebecca Caudill Young Readers' Book Award Nominee (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-24 00:00:00", "ISBN": "0439874025"},
{"url": "https://www.goodreads.com/book/show/353900.What_the_Moon_Saw", "num_ratings": "750", "num_reviews": "153", "avg_ratings": 4.18, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Childrens", "Middle Grade", "Cultural", "Family"], "title": "What the Moon Saw", "description": ["Clara Luna's name means \"clear moon\" in Spanish. But lately, her head has felt anything but clear. One day a letter comes from Mexico, written in Spanish: ", ". ", "Fourteen-year-old Clara has never met her father's parents", "Clara Luna's name means \"clear moon\" in Spanish. But lately, her head has felt anything but clear. One day a letter comes from Mexico, written in Spanish: ", ". ", "Fourteen-year-old Clara has never met her father's parents. She knows he snuck over the border from Mexico as a teenager, but beyond that, she knows almost nothing about his childhood. When she agrees to go, she's stunned by her grandparents' life: they live in simple shacks in the mountains of southern Mexico, where most people speak not only Spanish, but an indigenous language, Mixteco.", "The village of Yucuyoo holds other surprises, too-- like the spirit waterfall, which is heard but never seen. And Pedro, an intriguing young goatherder who wants to help Clara find the waterfall. Hearing her grandmother’s adventurous tales of growing up as a healer awakens Clara to the magic in Yucuyoo, and in her own soul. ", " is an enchanting story of discovering your true self in the most unexpected place."], "author": "Laura Resau", "num_pages": "272", "awards": ["Arizona YA Book Award", "Colorado Book Award for Young Adult (2007)", "Américas Award", "Colorado Authors’ League (CAL) Writing Awards for Middle Grade/Young Adult (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "0385733437"},
{"url": "https://www.goodreads.com/book/show/37868569-we-set-the-dark-on-fire", "num_ratings": "29", "num_reviews": "28", "avg_ratings": 3.93, "genres": ["Young Adult", "Lgbt"], "title": "We Set the Dark on Fire", "description": ["At the Medio School for Girls, distinguished young women are trained for one of two roles in their polarized society. Depending on her specialization, a graduate will one day run a husband’s household or raise his children, but both are promised a life of comfort and luxury, far from the frequent political uprisings of the lower class. Daniela Vargas is the school’s top st", "At the Medio School for Girls, distinguished young women are trained for one of two roles in their polarized society. Depending on her specialization, a graduate will one day run a husband’s household or raise his children, but both are promised a life of comfort and luxury, far from the frequent political uprisings of the lower class. Daniela Vargas is the school’s top student, but her bright future depends upon no one discovering her darkest secret—that her pedigree is a lie. Her parents sacrificed everything to obtain forged identification papers so Dani could rise above her station. Now that her marriage to an important politico’s son is fast approaching, she must keep the truth hidden or be sent back to the fringes of society, where famine and poverty rule supreme.", "On her graduation night, Dani seems to be in the clear, despite the surprises that unfold. But nothing prepares her for all the difficult choices she must make, especially when she is asked to spy for a resistance group desperately fighting to bring equality to Medio. Will Dani cling to the privilege her parents fought to win for her, or to give up everything she’s strived for in pursuit of a free Medio—and a chance at a forbidden love?", "The first in a sizzling fantasy duology from debut author Tehlor Kay Mejia, ", " is a boldly feminist look at freedom, family, and fighting the power."], "author": "Tehlor Kay Mejia", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": null, "ISBN": "0062691333"},
{"url": "https://www.goodreads.com/book/show/341946.Tortuga", "num_ratings": "434", "num_reviews": "36", "avg_ratings": 3.94, "genres": ["Fiction", "Literature", "Magical Realism", "Literary Fiction", "Novels", "Speculative Fiction"], "title": "Tortuga", "description": ["Rudolfo Anaya's personal journey to ", " began one desert-hot day when, as an adolescent, he and some friends were swimming in irrigation ditches. He dove in, sustaining an injury that put him in the hospital for an arduous period of time.", " is set in a hospital for crippled children and is based on Anaya's swimming accident. He explores the significance of pain an", "Rudolfo Anaya's personal journey to ", " began one desert-hot day when, as an adolescent, he and some friends were swimming in irrigation ditches. He dove in, sustaining an injury that put him in the hospital for an arduous period of time.", " is set in a hospital for crippled children and is based on Anaya's swimming accident. He explores the significance of pain and suffering in a young boy's life and the importance of spiritual recovery as well as medical. Tortuga, or Turtle, is the name of the oddly shaped mountain near the hospital, but \"Tortuga\" also points toward the rigid cast that encases the young hero's body.", "In celebration of the twenty-five years since the first edition of ", " was published, Rudolfo Anaya has provided an Afterword to share his memories of those days in the hospital and how they impacted the remainder of his life."], "author": "Rudolfo Anaya", "num_pages": "206", "awards": ["American Book Award (1980)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-08-30 00:00:00", "ISBN": "0826336248"},
{"url": "https://www.goodreads.com/book/show/341943.Heart_of_Aztlan", "num_ratings": "249", "num_reviews": "18", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Historical"], "title": "Heart of Aztlan", "description": ["The Albuquerque barrio portrayed in this vivid novel of postwar New Mexico is a place where urban and rural, political and religious realities coexist, collide, and combine. The magic realism for which Anaya is well known combines with an emphatic portrayal of the plight of workers dispossessed of their heritage and struggling to survive in an alien culture."], "author": "Rudolfo Anaya", "num_pages": "215", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-03-01 00:00:00", "ISBN": "0826310540"},
{"url": "https://www.goodreads.com/book/show/1872539.Lord_of_the_Dawn", "num_ratings": "23", "num_reviews": "4", "avg_ratings": 3.83, "genres": ["Historical", "Occult"], "title": "Lord of the Dawn: The Legend of Quetzalcoatl", "author": "Rudolfo Anaya", "num_pages": "159", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-10-01 00:00:00", "ISBN": "082631001X"},
{"url": "https://www.goodreads.com/book/show/341996.The_Legend_of_La_Llorona", "num_ratings": "49", "num_reviews": "3", "avg_ratings": 3.8, "genres": [], "title": "The Legend of La Llorona: A Short Novel", "author": "Rudolfo Anaya", "num_pages": "95", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-12-12 00:00:00", "ISBN": "0892290153"},
{"url": "https://www.goodreads.com/book/show/26777751-the-donkey-lady-fights-la-llorona-and-other-stories-la-senora-asno-se", "num_ratings": "15", "num_reviews": "9", "avg_ratings": 3.6, "genres": ["Short Stories", "Paranormal", "Ghosts", "Horror", "Childrens", "Middle Grade", "Teaching"], "title": "The Donkey Lady Fights La Llorona and Other Stories / La Senora Asno Se Enfrenta a la Llorona y Otros Cuentos", "description": ["This bilingual collection of short stories featuring creepy supernatural characters from Mexican-American folklore is sure to bewitch a whole new generation of young people. Accompanied by the author's dramatic black and white illustrations, these tales of Latin American lore will appeal to even the most reluctant readers."], "author": "Xavier Garza", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-10-31 00:00:00", "ISBN": "1558858164"},
{"url": "https://www.goodreads.com/book/show/54387.The_Afterlife", "num_ratings": "1,479", "num_reviews": "308", "avg_ratings": 3.44, "genres": ["Young Adult", "Fantasy", "Fiction", "Realistic Fiction", "Paranormal", "Ghosts"], "title": "The Afterlife", "description": ["You'd think a knife in the ribs would be the end of things, but for Chuy, that's when his life at last gets interesting. He finally sees that people love him, faces the consequences of his actions, finds in himself compassion and bravery . . . and even stumbles on what may be true love.", "A funny, touching, and wholly original story by one of the finest authors writing for yo", "You'd think a knife in the ribs would be the end of things, but for Chuy, that's when his life at last gets interesting. He finally sees that people love him, faces the consequences of his actions, finds in himself compassion and bravery . . . and even stumbles on what may be true love.", "A funny, touching, and wholly original story by one of the finest authors writing for young readers today."], "author": "Gary Soto", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-01 00:00:00", "ISBN": "0152052208"},
{"url": "https://www.goodreads.com/book/show/16637827-the-huaca", "num_ratings": "42", "num_reviews": "20", "avg_ratings": 3.74, "genres": ["Young Adult", "Mystery", "Fiction", "Fantasy", "Paranormal", "Fantasy"], "title": "The Huaca", "description": ["Seventeen-year-old Ellie Cummings just wants to be a regular teenager, but after her mother’s mysterious murder, she isn’t sure if she’ll ever be normal again. Her mother’s death has left Ellie and her father worlds apart. And when her best friend abandons her, Ellie has no one else to turn to—except for the strange boy who says he can help.", "Gabe de la Cruz seems to know wa", "Seventeen-year-old Ellie Cummings just wants to be a regular teenager, but after her mother’s mysterious murder, she isn’t sure if she’ll ever be normal again. Her mother’s death has left Ellie and her father worlds apart. And when her best friend abandons her, Ellie has no one else to turn to—except for the strange boy who says he can help.", "Gabe de la Cruz seems to know way too much about everything,", "and her instincts tell Ellie to stay far away. But when he claims that he can communicate with the dead through an ancient Incan artifact, Ellie can’t resist the temptation of seeing her mother again. In the hanan pacha—the Incan afterworld—Ellie’s mother sends a message to help Ellie understand what happened the night of the murder—a message that may be better kept a secret . . ."], "author": "Marcia  Mickelson", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "1462111904"},
{"url": "https://www.goodreads.com/book/show/26166230-the-dead-club", "num_ratings": "8", "num_reviews": "3", "avg_ratings": 4.5, "genres": ["Science Fiction"], "title": "The Dead Club", "description": ["\"The Dead Club\" is a paranormal action-adventure about Grey Gomez, an eleven-year-old boy who is having a bizarre week. First he dies, then wakes up in the afterlife with a tomboy, a baseball player, a beauty queen and a science geek. They learn that Purgatory is broken and are soon thrust into a frantic search through the Underworld to find out why. ", "With the help of an Or", "\"The Dead Club\" is a paranormal action-adventure about Grey Gomez, an eleven-year-old boy who is having a bizarre week. First he dies, then wakes up in the afterlife with a tomboy, a baseball player, a beauty queen and a science geek. They learn that Purgatory is broken and are soon thrust into a frantic search through the Underworld to find out why. ", "With the help of an Oracle and the Grim Reaper himself, Grey and his new friends develop extraordinary abilities that aid them on their quest to discover the truth."], "author": "Manuel Ruiz3", "num_pages": "164", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-06 00:00:00", "ISBN": "0692488758"},
{"url": "https://www.goodreads.com/book/show/20734002-the-weight-of-feathers", "num_ratings": "3,753", "num_reviews": "889", "avg_ratings": 3.8, "genres": ["Young Adult", "Fantasy", "Magical Realism", "Romance", "Contemporary", "Fiction"], "title": "The Weight of Feathers", "description": ["For twenty years, the Palomas and the Corbeaus have been rivals and enemies, locked in an escalating feud for over a generation. Both families make their living as traveling performers in competing shows—the Palomas swimming in mermaid exhibitions, the Corbeaus, former tightrope walkers, performing in the tallest trees they can find. ", "Lace Paloma may be new to her family’s", "For twenty years, the Palomas and the Corbeaus have been rivals and enemies, locked in an escalating feud for over a generation. Both families make their living as traveling performers in competing shows—the Palomas swimming in mermaid exhibitions, the Corbeaus, former tightrope walkers, performing in the tallest trees they can find. ", "Lace Paloma may be new to her family’s show, but she knows as well as anyone that the Corbeaus are pure magia negra, black magic from the devil himself. Simply touching one could mean death, and she's been taught from birth to keep away. But when disaster strikes the small town where both families are performing, it’s a Corbeau boy, Cluck, who saves Lace’s life. And his touch immerses her in the world of the Corbeaus, where falling for him could turn his own family against him, and one misstep can be just as dangerous on the ground as it is in the trees. ", "Beautifully written, and richly imaginative, ", " is an utterly captivating young adult novel by a talented new voice."], "author": "Anna-Marie McLemore", "num_pages": "320", "awards": ["William C. Morris YA Debut Award Nominee (2016)"], "places": [], "character_names": ["Lace Paloma", "Cluck Corbeau"], "language": null, "publish_date": "2015-09-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/34207629-lobo-coronado-and-the-legacy-of-the-wolf", "num_ratings": "9", "num_reviews": "2", "avg_ratings": 3.89, "genres": ["Speculative Fiction", "Childrens"], "title": "Lobo Coronado and the Legacy of the Wolf", "description": ["Lobo Coronado is about to have the most exciting day of his mundane life. Kidnapped by night shadows and introduced to his long-lost grandfather, he is transported to another realm where he meets a queen, a vampire scribe and a little angel with a big attitude problem. Lobo learns that an unknown enemy with a demon army and ties to his late father is endangering multiple w", "Lobo Coronado is about to have the most exciting day of his mundane life. Kidnapped by night shadows and introduced to his long-lost grandfather, he is transported to another realm where he meets a queen, a vampire scribe and a little angel with a big attitude problem. Lobo learns that an unknown enemy with a demon army and ties to his late father is endangering multiple worlds. Is Lobo the key to unlocking the truth? Teamed with his new companions, this Freaksome Threesome must work together to unleash the full potential of Lobo’s famous bloodline and prevent the annihilation of Earth and the Celestial Realms."], "author": "Manuel Ruiz", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-09 00:00:00", "ISBN": "0998448605"},
{"url": "https://www.goodreads.com/book/show/169838.How_Tia_Lola_Came_to_Visit_Stay", "num_ratings": "1,375", "num_reviews": "195", "avg_ratings": 3.67, "genres": ["Fiction", "Childrens", "Middle Grade", "Young Adult", "Realistic Fiction", "Cultural", "Childrens", "Family", "Childrens", "Juvenile", "European Literature", "Spanish Literature", "Childrens", "Chapter Books"], "title": "How Tia Lola Came to (Visit) Stay", "description": ["Moving to Vermont after his parents split, Miguel has plenty to worry about! Tía Lola, his quirky, ", ", and maybe magical aunt makes his life even more unpredictable when she arrives from the Dominican Republic to help out his Mami. Like her stories for adults, Julia Alvar", "Moving to Vermont after his parents split, Miguel has plenty to worry about! Tía Lola, his quirky, ", ", and maybe magical aunt makes his life even more unpredictable when she arrives from the Dominican Republic to help out his Mami. Like her stories for adults, Julia Alvarez’s first middle-grade book sparkles with magic as it illuminates a child’s experiences living in two cultures."], "author": "Julia Alvarez", "num_pages": "147", "awards": [], "places": ["Pennsylvania", "Vermont"], "character_names": [], "language": "English", "publish_date": "2002-08-13 00:00:00", "ISBN": "0440418704"},
{"url": "https://www.goodreads.com/book/show/29918993-a-dash-of-trouble", "num_ratings": "605", "num_reviews": "206", "avg_ratings": 4.17, "genres": ["Childrens", "Middle Grade", "Fantasy", "Fantasy", "Magic", "Childrens", "Fiction", "Paranormal", "Witches"], "title": "A Dash of Trouble", "description": ["Leonora Logroño’s family owns the most beloved bakery in Rose Hill, Texas, spending their days conjuring delicious cookies and cakes for any occasion. And no occasion is more important than the annual Dia de los Muertos festival.", "Leo hopes that this might be the year that she gets to help prepare for the big celebration—but, once again, she is told she’s too young. Sneaking", "Leonora Logroño’s family owns the most beloved bakery in Rose Hill, Texas, spending their days conjuring delicious cookies and cakes for any occasion. And no occasion is more important than the annual Dia de los Muertos festival.", "Leo hopes that this might be the year that she gets to help prepare for the big celebration—but, once again, she is told she’s too young. Sneaking out of school and down to the bakery, she discovers that her mother, aunt, and four older sisters have in fact been keeping a big secret: they’re brujas—witches of Mexican ancestry—who pour a little bit of sweet magic into everything that they bake. ", "Leo knows that she has magical ability as well and is more determined than ever to join the family business—even if she can’t let her mama and hermanas know about it yet.", "And when her best friend, Caroline, has a problem that needs solving, Leo has the perfect opportunity to try out her craft. It’s just one little spell, after all…what could possibly go wrong?"], "author": "Anna Meriano", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-01-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/33276882-morning-star-horse", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 4.67, "genres": ["Cultural"], "title": "Morning Star Horse", "description": ["Award winning author Margarita Engle brings a tale of history mixed with a touch of fantasy.", "\"When Mamacita chose to call me Estrellita, / it was her way of imagining a little bit / of starlight, deep down in that cavern / where only rare streaks of day or night / could reach--now, Lucero and I will be / Morning Star and Little Star, / a lit-from-within racing team!\"", "A young", "Award winning author Margarita Engle brings a tale of history mixed with a touch of fantasy.", "\"When Mamacita chose to call me Estrellita, / it was her way of imagining a little bit / of starlight, deep down in that cavern / where only rare streaks of day or night / could reach--now, Lucero and I will be / Morning Star and Little Star, / a lit-from-within racing team!\"", "A young girl stricken with rickets and her mother face the aftermath of the Spanish-American War, the challenges of a new century and innovative teachers.", "Dreams realized and dreams crushed exploring the freedoms only a magical horse can offer."], "author": "Margarita Engle", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-01-30 00:00:00", "ISBN": "1943050228"},
{"url": "https://www.goodreads.com/book/show/36349389-the-last-8", "num_ratings": "18", "num_reviews": "14", "avg_ratings": 4.44, "genres": ["Science Fiction", "Young Adult", "Lgbt"], "title": "The Last 8", "description": ["Clover Martinez has always been a survivor, which is the only reason she isn't among the dead when aliens invade and destroy Earth as she knows it. ", "When Clover hears an inexplicable radio message, she's shocked to learn there are other survivors—and that they're", "Clover Martinez has always been a survivor, which is the only reason she isn't among the dead when aliens invade and destroy Earth as she knows it. ", "When Clover hears an inexplicable radio message, she's shocked to learn there are other survivors—and that they're all at the former Area 51. When she arrives, she's greeted by a band of misfits who call themselves The Last Teenagers on Earth.", "Only they aren't the ragtag group of heroes Clover was expecting. The group seems more interested in hiding than fighting back, and Clover starts to wonder if she was better off alone. But then she finds a hidden spaceship, and she doesn't know what to believe…or who to trust."], "author": "Laura Pohl", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "149266989X"},
{"url": "https://www.goodreads.com/book/show/21529626-the-hunted", "num_ratings": "926", "num_reviews": "196", "avg_ratings": 3.82, "genres": ["Young Adult", "Science Fiction", "Adventure", "Science Fiction", "Dystopia", "Adventure", "Survival", "Young Adult", "Teen"], "title": "The Hunted", "description": ["When the Big One hit, Shy was at sea in style. The Paradise Cruise luxury liner he worked on was a hulking specimen of the best money could buy. And now it's at the bottom of the Pacific Ocean, along with almost all of its passengers.", "Shy wasn't the only one to survive, though. Addie, the rich blond daughter of a mysterious businessman, was on the dinghy he pulled himself i", "When the Big One hit, Shy was at sea in style. The Paradise Cruise luxury liner he worked on was a hulking specimen of the best money could buy. And now it's at the bottom of the Pacific Ocean, along with almost all of its passengers.", "Shy wasn't the only one to survive, though. Addie, the rich blond daughter of a mysterious businessman, was on the dinghy he pulled himself into. But as soon as they found the rest of the survivors, she disappeared.", "The only thing that filled the strange void of losing her was finding Carmen, his hot coworker, and discovering a way to get back home. But Shy's luck hasn't turned. Not yet.", "Back on the dinghy, Addie told him a secret. It's a secret that people would kill for-have killed for-and she has the piece that could turn everything on its ear. The problem? Shy has no idea where Addie is. Back home in California seems logical, but there are more ways to die back home then Shy could ever have guessed.", "And thanks to what Shy now knows, he's a moving target."], "author": "Matt de la Pena", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-12 00:00:00", "ISBN": "0385741227"},
{"url": "https://www.goodreads.com/book/show/23202520-hollywood-witch-hunter", "num_ratings": "280", "num_reviews": "113", "avg_ratings": 3.18, "genres": ["Young Adult", "Fantasy", "Fantasy", "Paranormal", "Fantasy", "Magic", "Did Not Finish", "Paranormal", "Witches"], "title": "Hollywood Witch Hunter", "description": ["Now, at sixteen, Iris is the lone girl on the Witch Hunters Special Ops Team.", "But when Iris meets a boy named Arlo, he might just be the key to preventing an evil uprising in Southern California.", "Together they're ready to protect the human race at all costs. Because that's what witc", "Now, at sixteen, Iris is the lone girl on the Witch Hunters Special Ops Team.", "But when Iris meets a boy named Arlo, he might just be the key to preventing an evil uprising in Southern California.", "Together they're ready to protect the human race at all costs. Because that's what witch hunters do.", "Welcome to Hollywood."], "author": "Valerie Tejeda", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24885848-nomad", "num_ratings": "42", "num_reviews": "11", "avg_ratings": 3.79, "genres": ["Science Fiction", "Childrens", "Middle Grade", "Adventure", "Childrens", "Juvenile", "Fiction"], "title": "Nomad", "description": ["Gabe Fuentes is in a race against time—and aliens—in this intergalactic sequel to ", ", which ", "called “an exciting sci-fi adventure, perceptively exploring what it means to be alien,” from National Book Award winner William Alexander.", "When we last left Earth’s Ambassador, Gabe Fuentes, he was stranded on the moon. And when he’s rescued by Kaen, another Ambassa", "Gabe Fuentes is in a race against time—and aliens—in this intergalactic sequel to ", ", which ", "called “an exciting sci-fi adventure, perceptively exploring what it means to be alien,” from National Book Award winner William Alexander.", "When we last left Earth’s Ambassador, Gabe Fuentes, he was stranded on the moon. And when he’s rescued by Kaen, another Ambassador, things don’t get better: It turns out that the Outlast— a race of aliens that has been systematically wiping out all other creatures—are coming. And they’ve set their sights on Earth.", "Enter Nadia. She was Earth’s Ambassador before Gabe, but left her post in order to stop the Outlast. Nadia has discovered that the Outlast can conquer worlds by travelling fast through lanes created by the mysterious Machinae. No one has communicated with the Machinae in centuries, but Nadia is determined to try, and Gabe and Kaen want to help her. But the three Ambassadors don’t know that the Outlast have discovered what they are doing, and have sent assassins to track them down.", "As Nadia heads deeper into space to find the Machinae, Gabe and Kaen return to Earth, where Gabe is trying to find another type of alien—his father, who was deported to Mexico, and who Gabe is desperate to bring home. From a detention center in the center of the Arizona desert to the Embassy in the center of the galaxy, the three Ambassadors race against time to save their worlds in this exciting, funny, mind-bending adventure."], "author": "William  Alexander", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-09-22 00:00:00", "ISBN": "144249767X"},
{"url": "https://www.goodreads.com/book/show/16529.Kingdom_of_the_Golden_Dragon", "num_ratings": "11,519", "num_reviews": "402", "avg_ratings": 3.83, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure"], "title": "Kingdom of the Golden Dragon", "description": ["Alexander Cold and his best friend, Nadia, the heroes of Allende's ", ", are reunited in a new adventure. This time, Alexander's fearless grandmother and ", " are taking them to another remote niche of the world -- a forbidden kingdom tucked into the frosty peaks of the Himalayas. Their task: to locate its fabled Golden Dragon, a sacred st", "Alexander Cold and his best friend, Nadia, the heroes of Allende's ", ", are reunited in a new adventure. This time, Alexander's fearless grandmother and ", " are taking them to another remote niche of the world -- a forbidden kingdom tucked into the frosty peaks of the Himalayas. Their task: to locate its fabled Golden Dragon, a sacred statue and priceless oracle, before it is destroyed by the greed of an outsider.", "With the aid of a sage Buddhist monk, his young royal disciple, and a fierce tribe of Yeti warriors, and armed with the power of their totemic animal spirits, Alexander and Nadia fight to protect the holy rule of the Golden Dragon."], "author": "Isabel Allende", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-05-10 00:00:00", "ISBN": "0060589442"},
{"url": "https://www.goodreads.com/book/show/7553811-the-skyscraper-that-flew-and-other-stories", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 3.67, "genres": [], "title": "The Skyscraper That Flew And Other Stories", "description": ["This whimsical collection of interrelated, magically real stories from acclaimed filmmaker Jesus Salvador Trevino brims with quirky characters and offbeat events."], "author": "Jesús Salvador Treviño", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-01 00:00:00", "ISBN": "1558854444"},
{"url": "https://www.goodreads.com/book/show/830298.The_Fabulous_Sinkhole_and_Other_Stories", "num_ratings": "11", "num_reviews": "1", "avg_ratings": 3.73, "genres": [], "title": "The Fabulous Sinkhole and Other Stories", "description": ["In this collection of short stories by noted film director and writer Jesus Trevino, the author gives us an off-beat, magically real and at times raucous vision of life in the barrios of Arroyo Grande, Texas. The rich texture of the narrative and the rich diversity of Hispanic characters all come to a romping, feverish end in the book with a fantasy that features an army o", "In this collection of short stories by noted film director and writer Jesus Trevino, the author gives us an off-beat, magically real and at times raucous vision of life in the barrios of Arroyo Grande, Texas. The rich texture of the narrative and the rich diversity of Hispanic characters all come to a romping, feverish end in the book with a fantasy that features an army of movie stereotypes of Hispanics who have returned as zombies bent on avenging themselves on Hollywood directors and screenwriters."], "author": "Jesús Salvador Treviño", "num_pages": "175", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-01-01 00:00:00", "ISBN": "1558851291"},
{"url": "https://www.goodreads.com/book/show/3304.City_of_the_Beasts", "num_ratings": "24,461", "num_reviews": "1,279", "avg_ratings": 3.7, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure"], "title": "City of the Beasts", "description": ["Fifteen-year-old Alexander Cold is about to join his fearless grandmother on the trip of a lifetime. An International Geographic expedition is headed to the dangerous, remote wilds of South America, on a mission to document the legendary Yeti of the Amazon known as the Beast.", "But there are many secrets hidden in the unexplored wilderness, as Alex and his new friend Nadia so", "Fifteen-year-old Alexander Cold is about to join his fearless grandmother on the trip of a lifetime. An International Geographic expedition is headed to the dangerous, remote wilds of South America, on a mission to document the legendary Yeti of the Amazon known as the Beast.", "But there are many secrets hidden in the unexplored wilderness, as Alex and his new friend Nadia soon discover. Drawing on the strength of their spirit guides, both young people are led on a thrilling and unforgettable journey to the ultimate discovery. . . ."], "author": "Isabel Allende", "num_pages": "408", "awards": ["Missouri Gateway Readers Award Nominee (2005)"], "places": ["Amazon Rainforest"], "character_names": ["Alexander Cold", "Kate Cold", "Nadia Santos", "Omayra Torres", "Cesar Santos", "Timothy Bruce", "Ludovic Leblanc", "Karakawe", "Walimai", "Iyomi", "Mokarita"], "language": "English", "publish_date": "2004-04-27 00:00:00", "ISBN": "0060535032"},
{"url": "https://www.goodreads.com/book/show/33385229-they-both-die-at-the-end", "num_ratings": "30,299", "num_reviews": "6,842", "avg_ratings": 4.15, "genres": ["Young Adult", "Contemporary", "Lgbt", "Fiction"], "title": "They Both Die at the End", "description": ["On September 5, a little after midnight, Death-Cast calls Mateo Torrez and Rufus Emeterio to give them some bad news: They’re going to die today.", "Mateo and Rufus are total str", "On September 5, a little after midnight, Death-Cast calls Mateo Torrez and Rufus Emeterio to give them some bad news: They’re going to die today.", "Mateo and Rufus are total strangers, but, for different reasons, they’re both looking to make a new friend on their End Day. The good news: There’s an app for that. It’s called the Last Friend, and through it, Rufus and Mateo are about to meet up for one last great adventure—to live a lifetime in a single day."], "author": "Adam Silvera", "num_pages": "368", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2017)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2017-09-05 00:00:00", "ISBN": "0062457799"},
{"url": "https://www.goodreads.com/book/show/22908836-omg-am-i-a-witch", "num_ratings": "24", "num_reviews": "12", "avg_ratings": 4.29, "genres": ["Fantasy", "Paranormal", "Paranormal", "Witches", "Childrens"], "title": "OMG... Am I A Witch?!", "description": ["April Appleton is so annoyed at her older brother that she searches the Internet for a spell to turn him into a dog. When the spell works, April realizes she has more powers than she ever dreamed of! Now she has to figure out how to turn him back to normal before her parents find out.", "She has little time, but with help from her friends Grace and Eve she finds a book of magi", "April Appleton is so annoyed at her older brother that she searches the Internet for a spell to turn him into a dog. When the spell works, April realizes she has more powers than she ever dreamed of! Now she has to figure out how to turn him back to normal before her parents find out.", "She has little time, but with help from her friends Grace and Eve she finds a book of magic that will hopefully reverse the spell. Will it work, and will April’s newfound magic save the day?"], "author": "Talia Aikens-Nunez", "num_pages": "150", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-07 00:00:00", "ISBN": "1771680253"},
{"url": "https://www.goodreads.com/book/show/34649841-wings-unseen", "num_ratings": "79", "num_reviews": "59", "avg_ratings": 3.16, "genres": ["Fantasy", "Young Adult", "Did Not Finish", "Fantasy", "Magic"], "title": "Wings Unseen", "description": ["To end a civil war, Lansera's King Turyn relinquished a quarter of his kingdom to create Medua, exiling all who would honor greed over valor to this new realm on the other side of the mountains. The Meduans and Lanserim have maintained an uneasy truce for two generations, but their ways of life are as compatible as oil and water.", "When Vesperi, a Meduan noblewoman, kills a L", "To end a civil war, Lansera's King Turyn relinquished a quarter of his kingdom to create Medua, exiling all who would honor greed over valor to this new realm on the other side of the mountains. The Meduans and Lanserim have maintained an uneasy truce for two generations, but their ways of life are as compatible as oil and water.", "When Vesperi, a Meduan noblewoman, kills a Lanserim spy with a lick of her silver flame, she hopes the powerful display of magic will convince her father to name her as his heir. She doesn't know the act will draw the eye of the tyrannical Guj, Medua's leader, or that the spy was the brother of Serrafina Gavenstone, the fiancee of Turyn's grandson, Prince Janto. As Janto sets out for an annual competition on the mysterious island of Braven, Serra accepts an invitation to study with the religious Brotherhood, hoping for somewhere to grieve her brother's murder in peace. What she finds instead is a horror that threatens both countries, devouring all living things and leaving husks of skin in its wake.", "To defeat it, Janto and Serra must learn to work together with the only person who possesses the magic that can: the beautiful Vesperi, whom no one knows murdered Serra's brother. An ultimate rejection plunges Vesperi forward toward their shared destiny, with the powerful Guj on her heels and the menacing beating of unseen wings all about.", "Readers of all ages will enjoy ", ", Rebecca Gomez Farrell's first full-length novel. It is a fully-imagined epic fantasy with an unforgettable cast of characters."], "author": "Rebecca Gomez Farrell", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-22 00:00:00", "ISBN": "1946154008"},
{"url": "https://www.goodreads.com/book/show/20345202-the-girl-at-midnight", "num_ratings": "7,926", "num_reviews": "1,696", "avg_ratings": 3.73, "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal"], "title": "The Girl at Midnight", "description": ["Beneath the streets of New York City live the Avicen, an ancient race of people with feathers for hair and magic running through their veins. Age-old enchantments keep them hidden from humans. All but one. Echo is a runaway pickpocket who survives by selling stolen treasures on the black market, and the Avicen are the only family she’s ev", "Beneath the streets of New York City live the Avicen, an ancient race of people with feathers for hair and magic running through their veins. Age-old enchantments keep them hidden from humans. All but one. Echo is a runaway pickpocket who survives by selling stolen treasures on the black market, and the Avicen are the only family she’s ever known.", "Echo is clever and daring, and at times she can be brash, but above all else she’s fiercely loyal. So when a centuries-old war crests on the borders of her home, she decides it’s time to act.", "Legend has it that there is a way to end the conflict once and for all: find the firebird, a mythical entity believed to possess power the likes of which the world has never seen. It will be no easy task, though if life as a thief has taught Echo anything, it’s how to hunt down what she wants…and how to take it.", "But some jobs aren’t as straightforward as they seem. And this one might just set the world on fire."], "author": "Melissa Grey", "num_pages": "357", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-28 00:00:00", "ISBN": "038574465X"},
{"url": "https://www.goodreads.com/book/show/13515320-the-living", "num_ratings": "4,120", "num_reviews": "991", "avg_ratings": 3.73, "genres": ["Young Adult", "Adventure", "Adventure", "Survival", "Fiction", "Science Fiction", "Mystery", "Young Adult", "Teen"], "title": "The Living", "description": ["Shy took the summer job to make some money. In a few months on a luxury cruise liner, he'll rake in the tips and be able to help his mom and sister out with the bills. And how bad can it be? Bikinis, free food, maybe even a girl or two—every cruise has different passengers, after all.", "But everything changes when the Big One hits. Shy's only weeks out at sea when an earthqua", "Shy took the summer job to make some money. In a few months on a luxury cruise liner, he'll rake in the tips and be able to help his mom and sister out with the bills. And how bad can it be? Bikinis, free food, maybe even a girl or two—every cruise has different passengers, after all.", "But everything changes when the Big One hits. Shy's only weeks out at sea when an earthquake more massive than ever before recorded hits California, and his life is forever changed.", "The earthquake is only the first disaster. Suddenly it's a fight to survive for those left living."], "author": "Matt de la Pena", "num_pages": "336", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2015)", "Pura Belpré Award Nominee for Narrative (2014)", "Green Mountain Book Award Nominee (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/28872472-the-savage-dawn", "num_ratings": "796", "num_reviews": "163", "avg_ratings": 3.72, "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic", "Romance", "Fantasy", "Urban Fantasy"], "title": "The Savage Dawn", "description": ["After awakening the firebird, Echo is now the only one with the power to face the darkness she unwittingly unleashed upon the world…right into the waiting hands of Tanith, the new Dragon Prince. Tanith has one goal in mind: destroy her enemies, raze their lands, and reign suprem", "After awakening the firebird, Echo is now the only one with the power to face the darkness she unwittingly unleashed upon the world…right into the waiting hands of Tanith, the new Dragon Prince. Tanith has one goal in mind: destroy her enemies, raze their lands, and reign supreme in a new era where the Drakharin are almighty and the Avicen are nothing but a memory.", "The war that has been brewing for centuries is finally imminent. But the scales are tipped. Echo might hold the power to face the darkness within the Dragon Prince, but she has far to go to master it. And now she’s plagued by uncertainty. Is she strong enough to stare into the face of evil and not lose herself in its depths?", "The war has begun, and there is no looking back. There are only two outcomes possible: triumph or death."], "author": "Melissa Grey", "num_pages": "496", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-07-11 00:00:00", "ISBN": "0385744692"},
{"url": "https://www.goodreads.com/book/show/33390983-ghost-girl-in-the-corner", "num_ratings": "348", "num_reviews": "78", "avg_ratings": 4.33, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Short Stories", "Fantasy", "Paranormal"], "title": "Ghost Girl in the Corner", "description": ["As far as Tee is concerned, the mysterious ghost girl couldn’t have shown up at a worse time—Tee has a local newspaper to run and she’s having relationship drama with her girlfriend, Izzy. But the ghost girl has a secret, and the only thing Tee can figure it out is that someone needs her help and needs it now. Soon, Tee and Izzy will have to harness all the power of their", "As far as Tee is concerned, the mysterious ghost girl couldn’t have shown up at a worse time—Tee has a local newspaper to run and she’s having relationship drama with her girlfriend, Izzy. But the ghost girl has a secret, and the only thing Tee can figure it out is that someone needs her help and needs it now. Soon, Tee and Izzy will have to harness all the power of their community and shadowshaping friends to get to the bottom of a decade-old mystery and prevent a brand new tragedy from taking place. ", "This novella follows Daniel José Older’s New York Times bestselling YA debut Shadowshaper."], "author": "Daniel José Older", "num_pages": "103", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-12-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/32793053-miles-morales", "num_ratings": "2,430", "num_reviews": "645", "avg_ratings": 3.92, "genres": ["Young Adult", "Fantasy", "Comics", "Superheroes", "Fiction", "Childrens", "Middle Grade", "Science Fiction"], "title": "Miles Morales", "description": [" ", "Miles Morales is just your average teenager. Dinner every Sunday with his parents, chilling out playing old-school video games with his best friend, Ganke, crushing on brainy, beautiful poet Alicia. He's even got a scholarship spot at the presti", " ", "Miles Morales is just your average teenager. Dinner every Sunday with his parents, chilling out playing old-school video games with his best friend, Ganke, crushing on brainy, beautiful poet Alicia. He's even got a scholarship spot at the prestigious Brooklyn Visions Academy. Oh yeah, and he's Spider Man.", "But lately, Miles's spidey-sense has been on the fritz. When a misunderstanding leads to his suspension from school, Miles begins to question his abilities. After all, his dad and uncle were Brooklyn jack-boys with criminal records. Maybe kids like Miles aren't meant to be superheroes. Maybe Miles should take his dad's advice and focus on saving himself.", "As Miles tries to get his school life back on track, he can't shake the vivid nightmares that continue to haunt him. Nor can he avoid the relentless buzz of his spidey-sense every day in history class, amidst his teacher's lectures on the historical \"benefits\" of slavery and the modern-day prison system. But after his scholarship is threatened, Miles uncovers a chilling plot, one that puts his friends, his neighborhood, and himself at risk.", "It's time for Miles to suit up."], "author": "Jason Reynolds", "num_pages": "261", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-08-01 00:00:00", "ISBN": "148478748X"},
{"url": "https://www.goodreads.com/book/show/25861939-lowriders-to-the-center-of-the-earth", "num_ratings": "413", "num_reviews": "128", "avg_ratings": 3.87, "genres": ["Sequential Art", "Graphic Novels", "Fantasy", "Childrens", "Middle Grade", "Adventure", "Humor", "Sequential Art", "Comics", "Fiction"], "title": "Lowriders to the Center of the Earth", "description": ["The trio from ", " are back! Lupe Impala, Elirio Malaria, and El Chavo Octopus are living their dream at last. They're the proud owners of their very own garage. But when their beloved cat Genie goes missing, they need to do everything they can to find him. Little do they know the trail will lead them to the realm of Mictlantecuhtli, the Aztec god of the Unde", "The trio from ", " are back! Lupe Impala, Elirio Malaria, and El Chavo Octopus are living their dream at last. They're the proud owners of their very own garage. But when their beloved cat Genie goes missing, they need to do everything they can to find him. Little do they know the trail will lead them to the realm of Mictlantecuhtli, the Aztec god of the Underworld, who is keeping Genie prisoner!"], "author": "Cathy Camper", "num_pages": "128", "awards": ["Pura Belpré Award for Illustrator (2017)", "Américas Award Commended Title (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-07-05 00:00:00", "ISBN": "1452138362"},
{"url": "https://www.goodreads.com/book/show/14342632-summer-of-the-mariposas", "num_ratings": "568", "num_reviews": "135", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Magical Realism", "Fantasy", "Mythology", "Fiction", "Cultural", "Childrens", "Middle Grade"], "title": "Summer of the Mariposas", "description": ["When Odilia and her four sisters find a dead body in the swimming hole, they embark on a hero’s journey to return the dead man to his family in Mexico. But returning home to Texas turns into an odyssey that would rival Homer’s original tale.", "With the supernatural aid of ghostly La Llorona via a magical earring, Odilia and her little sisters travel a road of tribulation to t", "When Odilia and her four sisters find a dead body in the swimming hole, they embark on a hero’s journey to return the dead man to his family in Mexico. But returning home to Texas turns into an odyssey that would rival Homer’s original tale.", "With the supernatural aid of ghostly La Llorona via a magical earring, Odilia and her little sisters travel a road of tribulation to their long-lost grandmother’s house. Along the way, they must outsmart a witch and her Evil Trinity: a wily warlock, a coven of vicious half-human barn owls, and a bloodthirsty livestock-hunting chupacabras. Can these fantastic trials prepare Odilia and her sisters for what happens when they face their final test, returning home to the real world, where goddesses and ghosts can no longer help them? ", " is not just a magical Mexican American retelling of The Odyssey, it is a celebration of sisterhood and maternal love."], "author": "Guadalupe Garcia McCall", "num_pages": "355", "awards": ["Andre Norton Award Nominee (2012)"], "places": ["Texas"], "character_names": [], "language": "English", "publish_date": "2012-10-20 00:00:00", "ISBN": "1600609007"},
{"url": "https://www.goodreads.com/book/show/19542841-more-happy-than-not", "num_ratings": "24,119", "num_reviews": "4,970", "avg_ratings": 4.07, "genres": ["Young Adult", "Lgbt", "Contemporary", "Fiction"], "title": "More Happy Than Not", "description": ["Part Eternal Sunshine of the Spotless Mind, part Aristotle and Dante Discover the Secrets of the Universe, Adam Silvera's extraordinary debut confronts race, class, and sexuality during one charged near-future summer in the Bronx. ", "Sixteen-year-old Aaron Soto is struggling to find happiness after a family tragedy leaves him reeling. He's slowly remembering what happiness mi", "Part Eternal Sunshine of the Spotless Mind, part Aristotle and Dante Discover the Secrets of the Universe, Adam Silvera's extraordinary debut confronts race, class, and sexuality during one charged near-future summer in the Bronx. ", "Sixteen-year-old Aaron Soto is struggling to find happiness after a family tragedy leaves him reeling. He's slowly remembering what happiness might feel like this summer with the support of his girlfriend Genevieve, but it's his new best friend, Thomas, who really gets Aaron to open up about his past and confront his future.", "As Thomas and Aaron get closer, Aaron discovers things about himself that threaten to shatter his newfound contentment. A revolutionary memory-alteration procedure, courtesy of the Leteo Institute, might be the way to straighten himself out. But what if it means forgetting who he truly is?"], "author": "Adam Silvera", "num_pages": "295", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2015)"], "places": ["Bronx, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-02 00:00:00", "ISBN": "1616955600"},
{"url": "https://www.goodreads.com/book/show/33151756-ghost-girl-in-the-corner", "num_ratings": "348", "num_reviews": "78", "avg_ratings": 4.33, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Short Stories", "Fantasy", "Paranormal"], "title": "Ghost Girl in the Corner", "description": ["Trying to shake off the strange malaise that separates her from even her girlfriend Izzy, Tee decides to take over the ", " for the summer. But then she finds an alluring violet dress in the newspaper office, and a cute ghost girl no one else can see. Who is she? What does she want? And why is she revealing herself to Tee? ", "Izzy can tell Tee's dr", "Trying to shake off the strange malaise that separates her from even her girlfriend Izzy, Tee decides to take over the ", " for the summer. But then she finds an alluring violet dress in the newspaper office, and a cute ghost girl no one else can see. Who is she? What does she want? And why is she revealing herself to Tee? ", "Izzy can tell Tee's drifting away from her -- she misses Izzy's shows and skips shadowshaper practice to spend time alone at the newspaper -- and she won't stand for it. Yet when a girl goes missing in Bed-Stuy, Izzy needs Tee to get the word out and help investigate. Can they break through their distance and reconnect before someone else dies? ", "Set between the ", "-bestselling ", " and its upcoming sequel ", ", this beautiful novella of mystery, love and loss will draw you deep into Daniel José Older's magical Brooklyn."], "author": "Daniel José Older", "num_pages": "109", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/28220826-when-the-moon-was-ours", "num_ratings": "4,306", "num_reviews": "1,215", "avg_ratings": 3.96, "genres": ["Young Adult", "Fantasy", "Magical Realism", "Lgbt"], "title": "When the Moon Was Ours", "description": ["To everyone who knows them, best friends Miel and Sam are as strange as they are inseparable. Roses grow out of Miel’s wrist, and rumors say that she spilled out of a water tower when she was five. Sam is known for the moons he paints and hangs in the trees, and for how little anyone knows about his life before he and his mother moved to town. But as odd as everyone consid", "To everyone who knows them, best friends Miel and Sam are as strange as they are inseparable. Roses grow out of Miel’s wrist, and rumors say that she spilled out of a water tower when she was five. Sam is known for the moons he paints and hangs in the trees, and for how little anyone knows about his life before he and his mother moved to town. But as odd as everyone considers Miel and Sam, even they stay away from the Bonner girls, four beautiful sisters rumored to be witches. Now they want the roses that grow from Miel’s skin, convinced that their scent can make anyone fall in love. And they’re willing to use every secret Miel has fought to protect to make sure she gives them up."], "author": "Anna-Marie McLemore", "num_pages": "288", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2017)", "James Tiptree Jr. Award (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-04 00:00:00", "ISBN": "125005866X"},
{"url": "https://www.goodreads.com/book/show/30408280-labyrinth-lost", "num_ratings": "6,363", "num_reviews": "1,687", "avg_ratings": 3.76, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fantasy", "Paranormal", "Fiction"], "title": "Labyrinth Lost", "description": ["Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whose intentio", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whose intentions are as dark as the strange marks on his skin.", "The only way to get her family back is to travel with Nova to Los Lagos, a land in-between, as dark as Limbo and as strange as Wonderland..."], "author": "Zoraida Córdova", "num_pages": "336", "awards": [], "places": ["Los Lagos realm, Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2016-09-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/27969087-labyrinth-lost", "num_ratings": "6,363", "num_reviews": "1,687", "avg_ratings": 3.76, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fantasy", "Paranormal", "Fiction"], "title": "Labyrinth Lost", "description": ["Alex is a bruja, the most powerful witch in a generation…and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo she can’t trust, but who may be Alex’s only chance at saving her family", "Alex is a bruja, the most powerful witch in a generation…and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo she can’t trust, but who may be Alex’s only chance at saving her family."], "author": "Zoraida Córdova", "num_pages": "324", "awards": [], "places": ["Los Lagos realm, Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2017-08-01 00:00:00", "ISBN": "1492623164"},
{"url": "https://www.goodreads.com/book/show/7175992-tortilla-sun", "num_ratings": "410", "num_reviews": "93", "avg_ratings": 3.88, "genres": ["Childrens", "Middle Grade", "Fiction", "Magical Realism", "Young Adult", "Childrens", "Cultural", "Fantasy", "Young Adult", "Coming Of Age", "Kids", "Academic", "Read For School"], "title": "Tortilla Sun", "description": ["When twelve-year-old Izzy discovers a beat-up baseball marked with the words \"Becausemagic\" while unpacking in yet another new apartment, she is determined to figure out what it means. What secrets does this old ball have to tell? Her mom certainly isn't sharing anyespecially when it comes to Izzy's father, who died before Izzy was born. But when she spends the summer in h", "When twelve-year-old Izzy discovers a beat-up baseball marked with the words \"Becausemagic\" while unpacking in yet another new apartment, she is determined to figure out what it means. What secrets does this old ball have to tell? Her mom certainly isn't sharing anyespecially when it comes to Izzy's father, who died before Izzy was born. But when she spends the summer in her Nana's remote New Mexico village, Izzy discovers long-buried secrets that come alive in an enchanted landscape of watermelon mountains, whispering winds, and tortilla suns. Infused with the flavor of the southwest and sprinkled with just a pinch of magic, this heartfelt middle grade debut is as rich and satisfying as Nana's homemade enchiladas."], "author": "Jennifer Cervantes", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-05-05 00:00:00", "ISBN": "0811870154"},
{"url": "https://www.goodreads.com/book/show/36601937-ghost-squad", "num_ratings": "16", "num_reviews": "2", "avg_ratings": 5.0, "genres": ["Childrens", "Middle Grade", "Fantasy", "Fantasy", "Paranormal"], "title": "Ghost Squad", "description": ["Coco meets Stranger Things in Claribel Ortega's middle grade debut, based on Dominican folklore in which 12-year-old girl Lucely Luna must save the ghosts of her lost loved ones, living as fireflies, with the help of her best friend Syd and her witch grandmother Babette, before evil spirits haunting St. Augustine destroy them and the only home she's ever known."], "author": "Claribel A. Ortega", "awards": [], "places": [], "character_names": [], "language": "English"},
{"url": "https://www.goodreads.com/book/show/22295304-shadowshaper", "num_ratings": "7,047", "num_reviews": "1,668", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Paranormal"], "title": "Shadowshaper", "description": ["Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York may", "Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York mayhem is going on.", "Sierra soon discovers a supernatural order called the Shadowshapers, who connect with spirits via paintings, music, and stories. Her grandfather once shared the order's secrets with an anthropologist, Dr. Jonathan Wick, who turned the Caribbean magic to his own foul ends. Now Wick wants to become the ultimate Shadowshaper by killing all the others, one by one. With the help of her friends and the hot graffiti artist Robbie, Sierra must dodge Wick's supernatural creations, harness her own Shadowshaping abilities, and save her family's past, present, and future."], "author": "Daniel José Older", "num_pages": "297", "awards": ["Locus Award Nominee for Best Young Adult Book (2016)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2016)", "Lincoln Award Nominee (2018)", "Andre Norton Award Nominee (2015)", "Kirkus Prize Nominee for Young Readers' Literature (Finalist) (2015)"], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-30 00:00:00", "ISBN": "0545591619"}
]