[
{"url": "https://www.goodreads.com/book/show/440777.Moth_Smoke", "num_ratings": "7,764", "num_reviews": "644", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Pakistan", "Cultural", "Asia", "Novels", "Contemporary"], "title": "Moth Smoke", "description": ["When Daru Shezad is fired from his banking job in Lahore, he begins a decline that plummets the length of this sharply drawn, subversive tale. Before long, he can't pay his bills, and he loses his toehold among Pakistan's cell-phone-toting elite. Daru descends into drugs and dissolution, and, for good measure, he falls in love with the wife of his childhood friend and riva", "When Daru Shezad is fired from his banking job in Lahore, he begins a decline that plummets the length of this sharply drawn, subversive tale. Before long, he can't pay his bills, and he loses his toehold among Pakistan's cell-phone-toting elite. Daru descends into drugs and dissolution, and, for good measure, he falls in love with the wife of his childhood friend and rival, Ozi—the beautiful, restless Mumtaz.", "Desperate to reverse his fortunes, Daru embarks on a career in crime, taking as his partner Murad Badshah, the notorious rickshaw driver, populist, and pirate. When a long-planned heist goes awry, Daru finds himself on trial for a murder he may or may not have committed. The uncertainty of his fate mirrors that of Pakistan itself, hyped on the prospect of becoming a nuclear player even as corruption drains its political will.", "Fast-paced and unexpected, ", " portrays a contemporary Pakistan as far more vivid and disturbing than the exoticized images of South Asia familiar to most of the West. This debut novel establishes Mohsin Hamid as a writer of substance and imagination."], "author": "Mohsin Hamid", "num_pages": "256", "awards": ["PEN/Hemingway Foundation Award Nominee (2001)", "Betty Trask Award (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-03 00:00:00", "ISBN": "0312273231"},
{"url": "https://www.goodreads.com/book/show/89133.Water", "num_ratings": "943", "num_reviews": "79", "avg_ratings": 3.96, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Cultural", "Asia", "Drama", "Novels"], "title": "Water", "description": ["The renowned author Bapsi Sidhwa and the equally renowned filmmaker Deepa Mehta share a unique artistic relationship: Mehta adapted Sidhwa’s novel ", " for her brilliant film ", " and here, Sidhwa adapts Mehta’s controversial film ", " to the printed page.", "Set in 1938, against the backdrop of Gandhi’s rise to power, ", " follows the life of eight-year-old Chuy", "The renowned author Bapsi Sidhwa and the equally renowned filmmaker Deepa Mehta share a unique artistic relationship: Mehta adapted Sidhwa’s novel ", " for her brilliant film ", " and here, Sidhwa adapts Mehta’s controversial film ", " to the printed page.", "Set in 1938, against the backdrop of Gandhi’s rise to power, ", " follows the life of eight-year-old Chuyia, abandoned at a widow’s ashram after the death of her elderly husband. There, she must live in penitence until her death. Unwilling to accept her fate, she becomes a catalyst for change in the widows’s lives. When her friend Kalyani, a beautiful widow-prostitute, falls in love with a young, upper-class Gandhian idealist, the forbidden affair boldly defies Hindu tradition and threatens to undermine the ashram’s delicate balance of power. This riveting look at the lives of widows in colonial India is ultimately a haunting and lyrical story of love, faith, and redemption."], "author": "Bapsi Sidhwa", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-03-29 00:00:00", "ISBN": "1571310568"},
{"url": "https://www.goodreads.com/book/show/755687.Imran", "num_ratings": "154", "num_reviews": "5", "avg_ratings": 4.12, "genres": ["Biography", "Nonfiction"], "title": "Imran: The Autobiography Of Imran Khan", "description": ["Early career cricket autobiography in which the Sussex and Pakistan all-rounder discusses his privileged background in Lahore, three years at Oxford, progress into the Sussex and Pakistan teams, and rise to world-class all-rounder. 8vo. 163pp. 24 pages of photographs. Dust-wrapper, very good. Signed by Imran Khan on the titlepage."], "author": "Imran Khan", "num_pages": "163", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1983-08-16 00:00:00", "ISBN": "0720714893"},
{"url": "https://www.goodreads.com/book/show/12716203-controversially-yours", "num_ratings": "495", "num_reviews": "51", "avg_ratings": 3.63, "genres": ["Nonfiction", "Biography", "Autobiography", "Sports and Games", "Sports", "Biography"], "title": "Controversially Yours: An Autobiography", "description": ["Shoaib Akhtar has been one of the most colorful characters in the history of cricket. He is the fastest bowler in the world, who set an official world record by achieving the fastest delivery when he clocked in at 161.3 km/ph (100.2 mph) twice in the same match. Having taken more than 400 wickets in international cricket, he is a phenomenal cricketer too.", "Tagged as being un", "Shoaib Akhtar has been one of the most colorful characters in the history of cricket. He is the fastest bowler in the world, who set an official world record by achieving the fastest delivery when he clocked in at 161.3 km/ph (100.2 mph) twice in the same match. Having taken more than 400 wickets in international cricket, he is a phenomenal cricketer too.", "Tagged as being undisciplined, Akhtar’s career has been plagued by injuries, controversies and accusations of poor attitude. Here he tells his side of the story. The early years of deprivation, the relentless self-imposed discipline, the way he played both on the cricket grounds and outside. His is also the inside story of Pakistan cricket, no holds barred: the strange ways of the cricket board, the hierarchies and manipulations and, above all, the magic of the game itself."], "author": "Shoaib Akhtar", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-25 00:00:00", "ISBN": "9350291282"},
{"url": "https://www.goodreads.com/book/show/1632156.Cutting_Edge", "num_ratings": "44", "num_reviews": "7", "avg_ratings": 3.59, "genres": ["Sports and Games", "Sports", "Nonfiction", "Biography", "Autobiography", "Autobiography", "Memoir"], "title": "Cutting Edge: My Autobiography", "description": ["From the street of Karachi to the great Test centres of the world, the enigmatic Pakistani cricket hero Javad Miandad takes readers on a riveting journey through his many accomplishments as a player as well as a coach and not mincing words about his disappointments. Former England captain Tony Greig has written the foreword."], "author": "Javed Miandad", "num_pages": "394", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-01-16 00:00:00", "ISBN": "0195799186"},
{"url": "https://www.goodreads.com/book/show/141550.In_the_Line_of_Fire", "num_ratings": "1,286", "num_reviews": "105", "avg_ratings": 3.19, "genres": ["Biography", "Nonfiction", "Cultural", "Pakistan", "History", "Politics", "Biography", "Autobiography"], "title": "In the Line of Fire", "description": ["According to \"Time\" magazine, Pakistan's President Pervez Musharraf holds \"the world's most dangerous job.\" He has twice come within inches of assassination. His forces have caught more than 670 members of al Qaeda in the mountains and cities, yet many others remain at large and active, including Osama bin Laden and Ayman Al Zawahiri. Long locked in a deadly embrace with i", "According to \"Time\" magazine, Pakistan's President Pervez Musharraf holds \"the world's most dangerous job.\" He has twice come within inches of assassination. His forces have caught more than 670 members of al Qaeda in the mountains and cities, yet many others remain at large and active, including Osama bin Laden and Ayman Al Zawahiri. Long locked in a deadly embrace with its nuclear neighbor India, Pakistan has come close to full-scale war on two occasions since it first exploded a nuclear bomb in 1998. As President Musharraf struggles for the security and political future of his nation, the stakes could not be higher for the world at large.It is unprecedented for a sitting head of state to write a memoir as revelatory, detailed, and gripping as\" In the Line of Fire. \"Here, for the first time, readers can get a firsthand view of the war on terror in its central theater. President Musharraf details the manhunts for Osama and Zawahiri and their top lieutenants, complete with harrowing cat-and-mouse games, informants, interceptions, and bloody firefights. He tells the stories of the near-miss assassination attempts, not only against himself but against Shaukut Aziz (later elected prime minister) and one of his top army officers (later the vice chief of army staff), and of the abduction and beheading of Daniel Pearl -- as well as the forensic and shoe-leather investigations that uncovered the perpetrators. He details the army's mountain operations that have swept several valleys clean, and he talks about the areas of North Waziristan where al Qaeda is still operating.", "Yet the war on terror is just one of the many headline-making subjects in \"In the Line of Fire.\" The full story of theevents that brought President Musharraf to power in 1999 is told for the first time. He reveals new details of the 1999 confrontation with India in Kashmir (the Kargil conflict) and offers a proposal for resolving the Kashmir dispute.", "He offers a portrait of Mullah Omar, with stories of Pakistan's attempts to negotiate with him. Concerning A. Q. Khan and his proliferation network, he explains what the government knew and when it knew it, and he reveals fascinating details of Khan's operations and the investigations into them.", "In addition, President Musharraf takes many stances that will make news. He calls for the Muslim world to recognize Israel once a viable Palestinian state is created. He urges the repeal of Pakistan's 1979 Hudood law. He calls for the emancipation of women and for their full political equality with men. He tells the sad story of Pakistan's experience with democracy and what he has done to make it workable."], "author": "Pervez Musharraf", "num_pages": "354", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-25 00:00:00", "ISBN": "0743283449"},
{"url": "https://www.goodreads.com/book/show/2794815-shahabnama", "num_ratings": "1,523", "num_reviews": "104", "avg_ratings": 4.34, "genres": ["Biography", "Cultural", "Pakistan", "History"], "title": "Shahabnama / شہاب نامہ", "author": "Qudratullah Shahab", "num_pages": "1247", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "1999-08-16 00:00:00", "ISBN": "9693500253"},
{"url": "https://www.goodreads.com/book/show/2649760-the-geometry-of-god", "num_ratings": "205", "num_reviews": "35", "avg_ratings": 3.77, "genres": ["Fiction", "Cultural", "Pakistan", "Religion", "Islam", "Novels"], "title": "The Geometry of God", "description": [": the practical sister who digs up the “diamond key” that unlocks the mystery of Pakicetus, a whale-dog creature who once swam the ancient seas that are now Pakistan.", ": the blind younger sister, who moves with the sun and music inside her and thinks in “cup lits not fully legal.”", ": their heretical grandfather, a scientist who loves variation and “vim zee” an", ": the practical sister who digs up the “diamond key” that unlocks the mystery of Pakicetus, a whale-dog creature who once swam the ancient seas that are now Pakistan.", ": the blind younger sister, who moves with the sun and music inside her and thinks in “cup lits not fully legal.”", ": their heretical grandfather, a scientist who loves variation and “vim zee” and his two granddaughters most of all.", ": the young man who steps into a lecture hall, decides “their triangle needs a fourth point,” and changes all their lives.", "These are the four shifting chambers who make the heart of ", ", the new novel from lauded Pakistani writer Uzma Aslam Khan. Through these vivid, contradictory, and original characters, Khan celebrates the complexities of familial and erotic love, the tug of curiosity and duty, the intersections of faith and longing. Her exuberant language draws from Urdu and Punjabi and invents one of its own for Mehwish, whose fractured English divides and slows and reveals.", " is a novel one can read greedily, following these characters as their lives unfold against the backdrop of General Zia’s Pakistan, where religious fundamentalism gains ground and the mujaheddin is funded by gem sales and the Americans. Or one can savor, as the sisters show us: digging as Amal does toward the novel’s deepest questions about love and knowledge and faith, moving as Mehwish does to the rhythms of an abundant and original language."], "author": "Uzma Aslam Khan", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7178991-alipur-ka-ailee", "num_ratings": "751", "num_reviews": "45", "avg_ratings": 4.22, "genres": ["Cultural", "Pakistan", "Fiction", "Classics", "Novels"], "title": "Alipur ka Ailee / علی پور کا ایلی", "description": [" is Mumtaz Mufti's semi-autobiographical novel describing the trials and tribulations of the early phase of its protagonist's life. The story continues in ", " which makes up the second part of the long novel.", "علی پور کا ایلی 1961ء میں پہلی بار ایک ناول کی حیثیت سے شائع ہوئی اور آدم جی ادبی ایوارڈ کے حوالے سے اسے کافی شہرت حاصل ہوئی۔ بقول ابن انشا یہ", " is Mumtaz Mufti's semi-autobiographical novel describing the trials and tribulations of the early phase of its protagonist's life. The story continues in ", " which makes up the second part of the long novel.", "علی پور کا ایلی 1961ء میں پہلی بار ایک ناول کی حیثیت سے شائع ہوئی اور آدم جی ادبی ایوارڈ کے حوالے سے اسے کافی شہرت حاصل ہوئی۔ بقول ابن انشا یہ کتاب اس لئے مشہور ہوئی کہ اسے آدم جی ایوارڈ نہ مل سکا لیکن اس کے باوجود اسے ادبی حلقوں میں بہت پذیرائی حاصل ہوئی اور ممتاز مفتی کی ادبی حیثیت پہلے سے کہیں زیادہ مستحکم ہو گئی۔", "بعد کے ایڈیشنز میں ممتاز مفتی نے اعتراف کیا کہ یہ بچپن سے 1947 تک ان کی اپنی زندگی کی کہانی ہے اور اس داستان کے بیشتر واقعات حقیقت پر مبنی ہیں۔"], "author": "Mumtaz Mufti", "num_pages": "984", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2008-08-16 00:00:00", "ISBN": "9695035205"},
{"url": "https://www.goodreads.com/book/show/17280214-how-it-happened", "num_ratings": "611", "num_reviews": "94", "avg_ratings": 3.8, "genres": ["Fiction", "Humor", "Cultural", "Pakistan", "Contemporary"], "title": "How It Happened", "description": ["Dadi, the imperious matriarch of the Bandian family in Karachi, swears by the virtues of arranged marriage. All her ancestors – including a dentally and optically challenged aunt – have been perfectly well-served by such arrangements. But her grandchildren are harder to please.", "Haroon, the apple of her eye, has to suffer half a dozen candidates until he finds the perfect Sh", "Dadi, the imperious matriarch of the Bandian family in Karachi, swears by the virtues of arranged marriage. All her ancestors – including a dentally and optically challenged aunt – have been perfectly well-served by such arrangements. But her grandchildren are harder to please.", "Haroon, the apple of her eye, has to suffer half a dozen candidates until he finds the perfect Shia-Syed girl of his dreams. But it is Zeba, his sister, who has the tougher time, as she is accosted by a bevy of suitors, including a potbellied cousin and a banker who reeks of sesame oil.", "Told by the witty, hawk-eyed Saleha, the precocious youngest sibling, this is a romantic, amusing and utterly delightful story about how marriages are made and unmade---not in heaven, but in the drawing room and over the phone."], "author": "Shazaf Fatima Haider", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-26 00:00:00", "ISBN": "0670086460"},
{"url": "https://www.goodreads.com/book/show/94739.An_American_Brat", "num_ratings": "765", "num_reviews": "48", "avg_ratings": 3.28, "genres": ["Fiction", "Young Adult", "Drama", "Cultural", "India"], "title": "An American Brat", "description": ["Feroza Ginwalla, a pampered, protected 16-year-old Pakistani girl, is sent to America by her parents, who are alarmed by the fundamentalism overtaking Pakistan — and their daughter. Hoping that a few months with her uncle, an MIT grad student, will soften the girl’s rigid thinking, they get more than they bargained for: Feroza, enthralled by American culture and her new fr", "Feroza Ginwalla, a pampered, protected 16-year-old Pakistani girl, is sent to America by her parents, who are alarmed by the fundamentalism overtaking Pakistan — and their daughter. Hoping that a few months with her uncle, an MIT grad student, will soften the girl’s rigid thinking, they get more than they bargained for: Feroza, enthralled by American culture and her new freedom, insists on staying. A bargain is struck, allowing Feroza to attend college with the understanding that she will return home and marry well. As a student in a small western town, Feroza’s perceptions of America, her homeland, and herself begin to alter. When she falls in love with and wants to marry a Jewish American, her family is aghast. Feroza realizes just how far she has come — and wonders how much further she can go. This delightful coming-of-age novel is both remarkably funny and a remarkably acute portrayal of America as seen through the eyes of a perceptive young immigrant."], "author": "Bapsi Sidhwa", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-24 00:00:00", "ISBN": "1571310495"},
{"url": "https://www.goodreads.com/book/show/4101648-burnt-shadows", "num_ratings": "4,585", "num_reviews": "653", "avg_ratings": 3.89, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Japan", "Cultural", "Pakistan", "Cultural", "India", "War", "Cultural", "Asia"], "title": "Burnt Shadows", "description": ["Beginning on August 9, 1945, in Nagasaki, and ending in a prison cell in the US in 2002, as a man is waiting to be sent to Guantanamo Bay, Burnt Shadows is an epic narrative of love and betrayal.", "Hiroko Tanaka is twenty-one and in love with the man she is to marry, Konrad Weiss. As she steps onto her veranda, wrapped in a kimono with three black cranes swooping across the b", "Beginning on August 9, 1945, in Nagasaki, and ending in a prison cell in the US in 2002, as a man is waiting to be sent to Guantanamo Bay, Burnt Shadows is an epic narrative of love and betrayal.", "Hiroko Tanaka is twenty-one and in love with the man she is to marry, Konrad Weiss. As she steps onto her veranda, wrapped in a kimono with three black cranes swooping across the back, her world is suddenly and irrevocably altered. In the numbing aftermath of the atomic bomb that obliterates everything she has known, all that remains are the bird-shaped burns on her back, an indelible reminder of the world she has lost. In search of new beginnings, two years later, Hiroko travels to Delhi. It is there that her life will become intertwined with that of Konrad's half sister, Elizabeth, her husband, James Burton, and their employee Sajjad Ashraf, from whom she starts to learn Urdu. ", "With the partition of India, and the creation of Pakistan, Hiroko will find herself displaced once again, in a world where old wars are replaced by new conflicts. But the shadows of history--personal and political--are cast over the interrelated worlds of the Burtons, the Ashrafs, and the Tanakas as they are transported from Pakistan to New York and, in the novel's astonishing climax, to Afghanistan in the immediate wake of 9/11. The ties that have bound these families together over decades and generations are tested to the extreme, with unforeseeable consequences."], "author": "Kamila Shamsie", "num_pages": "384", "awards": ["Orange Prize Nominee for Fiction Shortlist (2009)", "Anisfield-Wolf Book Award (2010)"], "places": [], "character_names": ["Konrad", "Henry", "Liz", "Abdullah", "Kim", "Hiroko", "Sajjad", "Raza", "Mr. Burton"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0385666950"},
{"url": "https://www.goodreads.com/book/show/608368.My_Feudal_Lord", "num_ratings": "3,218", "num_reviews": "257", "avg_ratings": 3.64, "genres": ["Nonfiction", "Cultural", "Pakistan", "Biography", "Autobiography", "Memoir"], "title": "My Feudal Lord", "description": ["Born into one of Pakistan's most influential families, Tehmina Durrani was raised in the privileged milieu of Lahore high society. Like all women of her rank, she was expected to marry a prosperous Muslim from a respectable family, bear him many children and lead a sheltered life of leisure. ", "Her marriage to Mustafa Khar, one of Pakistan's most eminent political figures, so", "Born into one of Pakistan's most influential families, Tehmina Durrani was raised in the privileged milieu of Lahore high society. Like all women of her rank, she was expected to marry a prosperous Muslim from a respectable family, bear him many children and lead a sheltered life of leisure. ", "Her marriage to Mustafa Khar, one of Pakistan's most eminent political figures, soon turned into a nightmare. Violently possessive and pathologically jealous, Mustafa Khar succeeded in cutting her off from the outside world. For fourteen years, Tehmina suffered alone, in silence. ", "When she decided to rebel, the price she paid was extremely high: as a Muslim woman seeking a divorce, she signed away all financial support, lost the custody of her four children, and found herself alienated from her friends and disowned by her parents. ", "When this book was first published it shook Pakistani society to its foundations. Here at last was someone who had succeded in reconciling her faith in Islam with her ardent belief in women's rights. Tehmina Durrani's story provided extraordinary insights into the vulnerable position of women caught in the complex web of Muslim society."], "author": "Tehmina Durrani", "num_pages": "382", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-08-16 00:00:00", "ISBN": "0552142395"},
{"url": "https://www.goodreads.com/book/show/8545788-sikander", "num_ratings": "231", "num_reviews": "42", "avg_ratings": 3.85, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Pakistan", "War"], "title": "Sikander", "description": ["It's 1986 and Ronald Reagan's commitment to the anti-Soviet mujahideen of Afghanistan is resolute. Meanwhile, 17 year-old Pakistani student, Sikander, yearns for the freedom of his tribal brethren in neighboring Afghanistan, and that leads him to admire everything American but more directly, to want to study and live in America. ", "When a heated quarrel stemming from a naive", "It's 1986 and Ronald Reagan's commitment to the anti-Soviet mujahideen of Afghanistan is resolute. Meanwhile, 17 year-old Pakistani student, Sikander, yearns for the freedom of his tribal brethren in neighboring Afghanistan, and that leads him to admire everything American but more directly, to want to study and live in America. ", "When a heated quarrel stemming from a naive indiscretion about his parents' financial woes provokes Sikander into leaving the comfort of his upper-middle class home, events lead to his being thrust into the very heart of the Afghan resistance. ", "Between fighting the Russians and living among the mujahideen villagers, Sikander meets Rabia, the independent, uneducated, but sharp-witted niece of his Afghan mentor and he begins to have feelings her. After two years, aided by long-awaited American Stinger missiles, Sikander and the mujahideen prevail. Amid the euphoria of victory and the prospects for peace Sikander and Rabia cement their love in marriage.", "With the war over, Sikander decides its time he and his new bride head back to Pakistan for a reconciliation with his family. To their delight he is welcomed back as a long missed, war hero and the couple settle in with his now financially recovered family. ", "Years pass, and Sikander prospers in the family business, while feeling though never fulfilling his desire to move to America. But then a bitter civil war rages in neighboring Afghanistan that results in the rise of the Taliban and with it, an unraveling of Rabia's family. Things get far worse when the tragedy of 9/11 strikes, and aided by Rabia's pleadings Sikander feels compelled to make the perilous journey across the border to persuade her family to come back with hm and away from the conflict. He manages to find them and lead them to the relative safety of Pakistan but not without himself being placed on collision course with the country of his dreams - America.", "Learn more about this remarkable story at "], "author": "M. Salahuddin Khan", "num_pages": "588", "awards": ["New York Book Festival Nominee for Fiction (2011)", "Paris Book Festival for Grand Prize and General Fiction (2011)", "CAIR-Chicago Book Award (2012)", "Hollywood Book Festival Awards for Fiction (2011)", "National Indie Excellence Awards for Muticultural Fiction (2011)"], "places": ["Peshawar", "Laghar Juy", "Applecross, Scotland", "Arghandab Valley", "Henderson, North Carolina", "Guantanamo Bay detention camp"], "character_names": [], "language": "English", "publish_date": "2010-07-28 00:00:00", "ISBN": "0578052881"},
{"url": "https://www.goodreads.com/book/show/11328946-charagh-talay", "num_ratings": "348", "num_reviews": "18", "avg_ratings": 4.3, "genres": ["Humor"], "title": "Charagh Talay / چراغ تلے", "description": ["مشتاق احمد یوسفی نے اردو مزاح کو ایک نئے مزاج سے آشنا کیا ہے۔ یہ مزاج اس کا اپنا مزاج ہے۔", "اس رنگا رنگ مجموعے میں ایسے رچے ہوئے مزاج کی جھلکیاں نظر آتی ہیں، جو چوٹ کھا کر بدمزہ نہیں ہوتا۔ طرزِ تپاکِ اہلِ دنیا دیکھ کر اس کی پیشانی پر بل نہیں پڑتے بلکہ سوچ کی گہری لکیریں ابھر آتی ہیں، جو دیکھتے دیکھتے تبسم زیرِ لب میں تحلیل ہو جاتی ہیں۔ وہ ہنسی ہنسی میں کام کی بات کہہ جاتا ہے۔", "مشتاق احمد یوسفی نے اردو مزاح کو ایک نئے مزاج سے آشنا کیا ہے۔ یہ مزاج اس کا اپنا مزاج ہے۔", "اس رنگا رنگ مجموعے میں ایسے رچے ہوئے مزاج کی جھلکیاں نظر‌ آتی ہیں، جو چوٹ کھا کر بدمزہ نہیں ہوتا۔ طرزِ تپاکِ اہلِ دنیا دیکھ کر اس کی پیشانی پر بل نہیں پڑتے بلکہ سوچ کی گہری لکیریں ابھر آتی ہیں، جو دیکھتے دیکھتے تبسم زیرِ لب میں تحلیل ہو جاتی ہیں۔ وہ ہنسی ہنسی میں کام کی بات کہہ جاتا ہے۔ دوسروں پر ہنسنے سے پہلے اس نے اپنے ہی داغوں کی بہار دکھا کر دوسروں کو ہنسایا ہے اور پھر خود بھی اس ہنسی میں شریک ہو گیا ہے۔ یوسفی کا مزاح شگفتہ و شاداب ہے، اور اس کا طنز کڑی کمان کا تیر، ان مضامین میں تفکر و تفنن کا ایک خوبصورت امتزاج ملتا ہے۔ اور تحریر کا تیکھا اور رسیلا اسلوب، مشاہدے کی وسعت اور طبیعت کے نکھار کا پتا دیتا ہے۔ وہ لہجے کے اتار چڑھاؤ کی نزاکتوں سے واقف ہے اور الفاظ کا مزاج پہچانتا ہے۔", "یہی چیز ایک ایک لفظ کو تلوار اور ہر ایک مضمون کو خندۂ تیغِ اصیل بنا دیتی ہے۔"], "author": "Mushtaq Ahmad Yusufi", "num_pages": "182", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2001-08-16 00:00:00", "ISBN": "9694190185"},
{"url": "https://www.goodreads.com/book/show/271753.Meatless_Days", "num_ratings": "391", "num_reviews": "57", "avg_ratings": 3.55, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Pakistan", "Biography", "Did Not Finish"], "title": "Meatless Days", "description": ["In this finely wrought memoir of life in postcolonial Pakistan, Suleri intertwines the violent history of Pakistan's independence with her own most intimate memories—of her Welsh mother; of her Pakistani father, prominent political journalist Z.A. Suleri; of her tenacious grandmother Dadi and five siblings; and of her own passage to the West.", "\"Nine autobiographical tales th", "In this finely wrought memoir of life in postcolonial Pakistan, Suleri intertwines the violent history of Pakistan's independence with her own most intimate memories—of her Welsh mother; of her Pakistani father, prominent political journalist Z.A. Suleri; of her tenacious grandmother Dadi and five siblings; and of her own passage to the West.", "\"Nine autobiographical tales that move easily back and forth among Pakistan, Britain, and the United States. . . . She forays lightly into Pakistani history, and deeply", "into the history of her family and friends. . . . The Suleri women at home in Pakistan make this book sing.\"—Daniel Wolfe, ", "\"A jewel of insight and beauty. . . . Suleri's voice has the same authority when she speaks about Pakistani politics as it does in her literary interludes.\"—Rone Tempest, ", "\"The author has a gift for rendering her family with a few, deft strokes, turning them out as whole and complete as eggs.\"—Anita Desai, ", "\"", " takes the reader through a Third World that will surprise and confound him even as it records the author's similar perplexities while coming to terms with the West. Those voyages Suleri narrates in great strings of words and images so rich that they left this reader . . . hungering for more.\"—Ron Grossman, ", "\"Dazzling. . . . Suleri is a postcolonial Proust to Rushdie's phantasmagorical Pynchon.\"—Henry Louise Gates, Jr., "], "author": "Sara Suleri", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-06-11 00:00:00", "ISBN": "0226779815"},
{"url": "https://www.goodreads.com/book/show/17608549-clifton-bridge", "num_ratings": "35", "num_reviews": "9", "avg_ratings": 3.23, "genres": ["Cultural", "Pakistan", "Short Stories", "Own", "Cultural"], "title": "Clifton Bridge: Stories of Innocence and Experience from Pakistan", "description": ["A collection of intriguing, illuminating tales about contemporary Pakistan and the people who inhabit the country", "A Talibanized mujahideen’s love child with his Christian lover is being brought up by a Hindu vegetable vendor. A globe-trotting professor and a mushaira-loving Urdu editor cope with cultural and ideological barriers in a tale of star-crossed lovers. The first a", "A collection of intriguing, illuminating tales about contemporary Pakistan and the people who inhabit the country", "A Talibanized mujahideen’s love child with his Christian lover is being brought up by a Hindu vegetable vendor. A globe-trotting professor and a mushaira-loving Urdu editor cope with cultural and ideological barriers in a tale of star-crossed lovers. The first and second wives of a businessman hatch a diabolic plot to prevent their husband from taking a new wife. A painter’s unusual bond with his dead mother plays havoc with his personal life. ", "In Irshad Kadir’s début collection of stories, these and other tales, set in modern Pakistan, represent the diversified social cluster of the country and puncture the unidimensional idea of it in the non-Pakistani imagination. These tales explore themes of ambition, iniquity and individual yearnings. The characters range from feudal landowners and conscience-stricken Taliban to metropolitan beggars, frustrated housewives and women defiantly striking out on their own. Violence in pastoral surroundings, a providential encounter on the Net or in a Victorian market, the vagaries of an unequal love bond or a rare moment in a Karachi slum – Clifton Bridge: Stories of Innocence and Experience from Pakistan offers a fascinating glimpse into contemporary Pakistani society and of the people who inhabit it."], "author": "Irshad AbdulKadir", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-15 00:00:00", "ISBN": "9350296187"},
{"url": "https://www.goodreads.com/book/show/18690744", "num_ratings": "15", "num_reviews": "4", "avg_ratings": 4.4, "genres": [], "title": "افسانے: پہلی صف اور دوسری کہانیاں", "author": "Omer Ahmed Bangash", "num_pages": "60", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2013-10-18 00:00:00", "ISBN": "1304547434"},
{"url": "https://www.goodreads.com/book/show/18002038-ghulam-bagh", "num_ratings": "76", "num_reviews": "8", "avg_ratings": 4.41, "genres": ["Novels", "Cultural", "Pakistan"], "title": "Ghulam Bagh / غلام باغ", "author": "Mirza Athar Baig", "num_pages": "878", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2007-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18138094-seasons-of-silence", "num_ratings": "10", "num_reviews": "1", "avg_ratings": 3.2, "genres": [], "title": "Seasons of Silence", "description": ["Nadeem is trapped in Karachi and is in self-destruct mode. His heart is in New York, the city of his dreams, where he left behind the innocence of his youth and the woman he loved more than life. Love, respect and trust have long since disappeared from his marriage. He hates his job, his wife and most of all, himself.", "Bitter and depressed, he has dragged his past into his p", "Nadeem is trapped in Karachi and is in self-destruct mode. His heart is in New York, the city of his dreams, where he left behind the innocence of his youth and the woman he loved more than life. Love, respect and trust have long since disappeared from his marriage. He hates his job, his wife and most of all, himself.", "Bitter and depressed, he has dragged his past into his present and once again he is at a crossroads. This time the choice is between the woman he still loves and has lost, and the woman he once loved and is about to lose.", "Can Nadeem break the silence and redeem himself, or is it already too late?"], "author": "Mamun Adil", "num_pages": "98", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-12 00:00:00", "ISBN": "0991960092"},
{"url": "https://www.goodreads.com/book/show/22706487-antidote-to-suicide", "num_ratings": "6", "num_reviews": "0", "avg_ratings": 4.0, "genres": ["Cultural", "Pakistan", "Psychology"], "title": "Antidote to Suicide", "author": "Muhammad Ilyas 'Attar Qadri Razavi", "num_pages": "61", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/433015.Beyond_the_Cayenne_Wall", "num_ratings": "21", "num_reviews": "4", "avg_ratings": 3.38, "genres": ["Short Stories", "Cultural", "Pakistan"], "title": "Beyond the Cayenne Wall: Collection of Short Stories", "description": ["'Abdullah takes us into the hearts and minds, realities and yearnings, and daily existence of women young and aged in and from South Asia. Her stunningly beautiful prose and elegant iridescent descriptions of the land that these women love is juxtaposed with the brutality and coarseness of their everyday existence.\" -Dr. Shirley Hord, author of \"Implementing Change\" \"Beyon", "'Abdullah takes us into the hearts and minds, realities and yearnings, and daily existence of women young and aged in and from South Asia. Her stunningly beautiful prose and elegant iridescent descriptions of the land that these women love is juxtaposed with the brutality and coarseness of their everyday existence.\" -Dr. Shirley Hord, author of \"Implementing Change\" \"Beyond the Cayenne Wall\" captures the cultural chasm-and sometimes the collision between the East and the West-as the characters struggle to find their individualities despite the barriers imposed by society. Tannu refuses to give up her firstborn to the caretakers of the shrine of Shah Daullah as tradition dictates. Dhool is a defiant, spirited woman who confronts the five mistakes in her life and ventures out among the wolves in human clothing to make ends meet. In a striking account of alienation and the clash of two worlds, Mansi faces some tough choices when she brings her widowed mother back with her to live in the United States. In these and several other stories, Abdullah weaves together a collection of events that spin around betrayals, confessions, acceptance, and denial, shaken in with exotic spices and flavor, a potpourri for the senses."], "author": "Shaila M. Abdullah", "num_pages": "116", "awards": ["DIY Book Festival"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-17 00:00:00", "ISBN": "0595370098"},
{"url": "https://www.goodreads.com/book/show/18002243-sifar-se-aik-tak", "num_ratings": "13", "num_reviews": "1", "avg_ratings": 4.08, "genres": [], "title": "Sifar Se Aik Tak: Cyberspace Ke Munshi Ki Sargazasht", "author": "Mirza Athar Baig", "num_pages": "393", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2009-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13498516-yaadon-ki-baraat", "num_ratings": "97", "num_reviews": "3", "avg_ratings": 3.91, "genres": ["Poetry"], "title": "Yaadon ki Baraat / یادوں کی بارات", "description": ["یادوں کی برات ایک عظیم شاعر کی آپ بیتی اور ایک تاریخ ساز عہد کی تہذیبی زندگی کا دلکش مرقع ہے۔ اس مرقعے میں آپ کو وادیِ گنگ و جمن اور سرزمینِ دکن کے قدیم و جدید معاشرے کی خوشنما جھلکیاں نظر آئیں گی۔ مصنف نے اپنے ایامِ طفلی و جوانی کے خوشحال طبقوں کی سماجی قدروں پر، ان طبقوں کے سوچنے اور محسوس کرنے کے انداز پر، ان کے عقیدوں اور وہموں پر، ان کے شوق اور مشغلوں پر، ان کے تیوہار", "یادوں کی برات ایک عظیم شاعر کی آپ بیتی اور ایک تاریخ ساز عہد کی تہذیبی زندگی کا دلکش مرقع ہے۔ اس مرقعے میں آپ کو وادیِ گنگ و جمن اور سرزمینِ دکن کے قدیم و جدید معاشرے کی خوشنما جھلکیاں نظر آئیں گی۔ مصنف نے اپنے ایامِ طفلی و جوانی کے خوشحال طبقوں کی سماجی قدروں پر، ان طبقوں کے سوچنے اور محسوس کرنے کے انداز پر، ان کے عقیدوں اور وہموں پر، ان کے شوق اور مشغلوں پر، ان کے تیوہاروں اور تقریبوں پر، ان کے رہن سہن اور رسوم و رواج پر روزمرہ کے واقعات کے حوالے سے بڑے دلچسپ تبصرے کیے ہیں۔", "یادوں کی برات جوش ملیح آبادی کے ستر سال کے تجربوں اور مشاہدوں کی برات ہے۔ اس برات میں فکر و نشاط کی شہنائیاں بجتی ہیں۔ جنون و حکمت کے زمزمے گونجتے ہیں۔ رامش و رنگ کی محفلیں سجتی ہیں۔ لالہ رخوں کے لب و عارض کی دل نشیں حکایتیں بیان ہوتی ہیں۔ یارانِ میکدہ کی محبتوں اور بے مہریوں کے قصے سنائے جاتے ہیں اور اربابِ ثروت و سیاست کی تنگ حوصلگیوں کے تذکرے چھڑتے ہیں۔ شاعرِ امروز و فردا کی یادوں کا یہ قافلہ کبھی کہکشاں سے ہو کر گزرتا ہے اور کبھی بحرِ ظلمات سے، لیکن مسرت کی خیرہ سامانیوں سے اُن کے ایمان و یقین میں کوئی فرق نہیں آتا اور نہ طوفانِ حوادث کی تیرگیوں سے اُن کے پائے صداقت ڈگمگاتے ہیں۔ اُن کا کاروانِ حیات خرد کی مشعل لیے اور انسان دوستی کے رجز پڑھتا آگے بڑھتا جاتا ہے۔"], "author": "Josh Malihabadi", "num_pages": "780", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "1975-05-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18138027-no-such-thing-as-love", "num_ratings": "15", "num_reviews": "2", "avg_ratings": 4.07, "genres": [], "title": "No Such Thing as Love", "description": ["A secret love nurtured and cherished for years. A secret love mournfully laid to rest in favor of propriety and duty. Hidden motives, clever facades and fierce players. Passionate hearts and the calling of love. What will a young girl do? ", "Zermina is a talented artist who tries hard to please the people in her life.", "Sikandar is the perfect fiancé: rich, educated and good loo", "A secret love nurtured and cherished for years. A secret love mournfully laid to rest in favor of propriety and duty. Hidden motives, clever facades and fierce players. Passionate hearts and the calling of love. What will a young girl do? ", "Zermina is a talented artist who tries hard to please the people in her life.", "Sikandar is the perfect fiancé: rich, educated and good looking. ", "Everything in life seems to be going according to plan when she bumps into her first love… ", "Squadron Leader Ahd Aziz is a Pilot and a Polo player. ", "Returning to town after a gap of ten years, he can’t help but get attracted to his high school crush.", "A chance encounter rekindles an old flame and enlivens emotions long buried. What does Zermina realize in the days that follow? What does she do with all the emotions that bloom in heart? All within weeks of her marriage.", "From the electrifying frenzy of a polo ground to the solitude of a painter’s refuge, the novella takes its readers on a rollercoaster ride of emotions."], "author": "Naina Kamal", "num_pages": "113", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-12 00:00:00", "ISBN": "0991960009"},
{"url": "https://www.goodreads.com/book/show/21524803-the-gatekeeper-s-wife", "num_ratings": "23", "num_reviews": "3", "avg_ratings": 3.0, "genres": ["Cultural", "Pakistan", "Short Stories"], "title": "The Gatekeeper's Wife", "description": ["Rukhsana Ahmad has been writing short stories since the mid 1980s, and had a loyal readership at home and abroad long before the current boom in Pakistani fiction. Though she is perhaps best known for her plays and her pioneering translations, there s a lingering suspicion among her admirers that fiction --- and particularly short fiction --- is her first love. Varied in s", "Rukhsana Ahmad has been writing short stories since the mid 1980s, and had a loyal readership at home and abroad long before the current boom in Pakistani fiction. Though she is perhaps best known for her plays and her pioneering translations, there s a lingering suspicion among her admirers that fiction --- and particularly short fiction --- is her first love. Varied in setting, style and length, ranging in genre from the intimacy of domestic realism to the bizarre, experimental and fantastic, these stories bear witness to our changing times. This first and generous collection is worth the long wait. --- AAMER HUSSEIN What a find Ahmad is! She writes about women s legacy of grief without self-pity and if there is anger, it surfaces as wit. FAY WELDON, Mail on Sunday Rukhsana Ahmad is a magnificent writer...I adored her short stories... Bapsi Sidhwa"], "author": "Rukhsana Ahmad", "num_pages": "188", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/107964.Noor", "num_ratings": "101", "num_reviews": "23", "avg_ratings": 4.09, "genres": ["Fiction", "Literature", "Cultural", "Pakistan", "Female Authors"], "title": "Noor", "description": ["Sorayya Khan's debut novel is a powerful and poignant story of memory, family, tragedy, and forgiveness. Set in modern-day Islambad, Pakistan, the book depicts an extraordinary child who enables her mother, Sajida, and her grandfather, Ali, to confront the pasts they have chosen to suppress. Through Noor's artwork, her family members are transported through their haunted m", "Sorayya Khan's debut novel is a powerful and poignant story of memory, family, tragedy, and forgiveness. Set in modern-day Islambad, Pakistan, the book depicts an extraordinary child who enables her mother, Sajida, and her grandfather, Ali, to confront the pasts they have chosen to suppress. Through Noor's artwork, her family members are transported through their haunted memories of the 1970 cyclone that claimed the lives of a million people and the violent atrocities of the 1971 conflict between East and West Pakistan that eventually created the independent country of Bangladesh. As Noor's drawings bring to life sights, sounds, smells, and sensations from the past, her family is forced to admit of the betrayals and disillusionments that they thought had been buried with time. Moving, heartbreaking, and unsettling by turns, Noor is a novel about the horrors of war, the power of forgiveness, and, most important, the strength of the human spirit."], "author": "Sorayya Khan", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-01 00:00:00", "ISBN": "0971930872"},
{"url": "https://www.goodreads.com/book/show/21068096-la-hasil-hollow-pursuits", "num_ratings": "1,309", "num_reviews": "56", "avg_ratings": 4.06, "genres": ["Cultural", "Pakistan"], "title": "La Hasil-Hollow Pursuits (English Translation)", "description": ["La Hasil is a tale of pursuits for all that is hollow, empty and void. It is a story of a man, who in the blind pursuit of chastity, gave up his loyal and pious wife. It is a story of a prostitute, who was rescued by her newfound faith in Islam. It is a story of a son who never met his mother but was a reincarnation of all the goodness in her. It is a story of a daughter,", "La Hasil is a tale of pursuits for all that is hollow, empty and void. It is a story of a man, who in the blind pursuit of chastity, gave up his loyal and pious wife. It is a story of a prostitute, who was rescued by her newfound faith in Islam. It is a story of a son who never met his mother but was a reincarnation of all the goodness in her. It is a story of a daughter, who rejected the humbling surroundings her virtuous but poor mother could provide for her, and left in the pursuit of luxury, wealth and fame - no matter what the cost. But when the truth is revealed, no life will remain the same, and Allah will tell each soul what they had bargained for."], "author": "Umera Ahmed", "num_pages": "318", "awards": [], "places": [], "character_names": ["Umme Mariam"], "language": "English", "publish_date": "2013-12-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20642794-thanda-gosht", "num_ratings": "133", "num_reviews": "12", "avg_ratings": 4.19, "genres": ["Short Stories", "Classics"], "title": "Thanda Gosht / ٹھنڈا گوشت", "description": ["The story is about the communal violence of 1947. Ishwar Singh, a Sikh fails to make love to his mistress. She suspects him of infidelity and In a fit of jealousy she stabs her husband with his own dagger. While dying, Ishwar Singh admits his crime of attempted rape with an unconscious Muslim girl, who was actually dead.Hence the title \"Cold Flesh\"."], "author": "سعادت حسن منٹو", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2008-08-16 00:00:00", "ISBN": "969352098X"},
{"url": "https://www.goodreads.com/book/show/4108195-aangan", "num_ratings": "148", "num_reviews": "11", "avg_ratings": 3.82, "genres": ["Novels"], "title": "Aangan / آنگن", "author": "Khadija Mastoor", "num_pages": "318", "awards": ["Adamjee Literary Award (0)"], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2012-08-16 00:00:00", "ISBN": "9693505611"},
{"url": "https://www.goodreads.com/book/show/2743788-a-choice-of-hashmi-s-verse", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "A Choice of Hashmi's Verse", "description": ["This text is a selection of the poet's work taken from nine volumes of poetry already published in England, the US and Pakistan, and also from an unpublished volume."], "author": "Alamgir Hashmi", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-01 00:00:00", "ISBN": "0195778138"},
{"url": "https://www.goodreads.com/book/show/1623925.The_Ramazan_Libation", "num_ratings": "4", "num_reviews": "2", "avg_ratings": 4.25, "genres": [], "title": "The Ramazan Libation (International Poetry)", "author": "Aurandzeb Alamgir Hashmi", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-11-23 00:00:00", "ISBN": "1900072106"},
{"url": "https://www.goodreads.com/book/show/549937.Aik_Mohabbat_Sau_Afsanay_", "num_ratings": "394", "num_reviews": "16", "avg_ratings": 4.19, "genres": [], "title": "Aik Mohabbat Sau Afsanay / ایک محبت سو افسافے", "description": ["Short stories from an eminent Urdu writer that chronicle human tragedy with a soft pen. Ashfaq Ahmed is a consummate master of words."], "author": "Ashfaq Ahmed", "awards": [], "places": ["Pakistan"], "character_names": [], "language": "Urdu", "publish_date": "1998-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12885820-raat", "num_ratings": "31", "num_reviews": "1", "avg_ratings": 3.65, "genres": ["Novels"], "title": "Raat / رات", "author": "Abdullah Hussein", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2010-08-16 00:00:00", "ISBN": "9693507495"},
{"url": "https://www.goodreads.com/book/show/12885750-qaid", "num_ratings": "76", "num_reviews": "8", "avg_ratings": 3.89, "genres": [], "title": "Qaid / قید", "author": "Abdullah Hussein", "num_pages": "119", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2008-08-16 00:00:00", "ISBN": "9693500725"},
{"url": "https://www.goodreads.com/book/show/11329009-mairay-bhe-hain-kuch-khwab", "num_ratings": "16", "num_reviews": "0", "avg_ratings": 3.94, "genres": [], "title": "Mairay bhe hain kuch khwab", "author": "Amjad Islam Amjad", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/6288711-bitter-fruit", "num_ratings": "486", "num_reviews": "34", "avg_ratings": 4.37, "genres": ["Short Stories", "Cultural", "India", "Fiction", "Classics", "Cultural", "Pakistan"], "title": "Bitter Fruit: The Very Best of Saadat Hasan Manto", "description": ["Widely renowned as the best short story writer in Urdu, Manto s stories were mostly written against the milieu of the Partition. Bitter Fruit presents the best collection of Manto s writings, from his short stories, plays and sketches, to portraits of cinema artists, a few pieces on himself, and his letters to Uncle Sam which have references to communism, Russia, politics", "Widely renowned as the best short story writer in Urdu, Manto s stories were mostly written against the milieu of the Partition. Bitter Fruit presents the best collection of Manto s writings, from his short stories, plays and sketches, to portraits of cinema artists, a few pieces on himself, and his letters to Uncle Sam which have references to communism, Russia, politics after the Partition and his own financial condition. The concluding section of the book has acknowledgements and reminiscences from Saadat s friends and relatives. Bitter Fruit includes stories like A Wet Afternoon, The Return, A Believer s Version, Toba Tek Singh, Colder Than Ice, The Assignment, Odour, By The Roadside, Bribing The Almighty, The Kingdom s End, The Woman In The Red Raincoat, The Room With The Bright Light, The Great Divide, The Angel, Siraj, An Old Fashioned Man, The Price Of Freedom, It Happened In 1919, The Girl From Delhi, A Man Of God, Free For All, and A Tale Of 1947. There is a collection of sketches too. Manto used to write radio plays and this book has one of the dramas he penned, called In This Vortex. His short stories bring out the most delicate nuances of human nature."], "author": "Saadat Hasan Manto", "num_pages": "700", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2009-08-05 00:00:00", "ISBN": "0143102176"},
{"url": "https://www.goodreads.com/book/show/18111728-kai-chand-thay-sar-e-aasman", "num_ratings": "63", "num_reviews": "9", "avg_ratings": 4.13, "genres": [], "title": "Kai Chand Thay Sar-e-Aasman / کئی چاند تھے سر آسماں", "description": ["18th and 19th sadi ke hind-islami tehzeeb adbi samaj khaaskar dilli ke samaj ka aaina dikhati kitab.18th century ke rajputane se shuru hone vaali aur ek sadi se kuch zada samay baad dilli ke Lal Qille mein khatam hone vaali yeh daastan hindustani funkaar ki ruh ki gehrayion mein utarne ki koshish karne ke alawa hind-islami tehzeeb , adbi samaj , angrezi siyasat aur uski va", "18th and 19th sadi ke hind-islami tehzeeb adbi samaj khaaskar dilli ke samaj ka aaina dikhati kitab.18th century ke rajputane se shuru hone vaali aur ek sadi se kuch zada samay baad dilli ke Lal Qille mein khatam hone vaali yeh daastan hindustani funkaar ki ruh ki gehrayion mein utarne ki koshish karne ke alawa hind-islami tehzeeb , adbi samaj , angrezi siyasat aur uski vajah se tehzeeb aur tareekh ke badlalte hue paikar hamare saamne pesh karti . Dehli ki mitti hui baadshah ke saaye mein falne-fulne vaali iss tehzeeb ka manjarnama Ghalib ,Zauk,daag, GhanShyam Lal Aasi, ImamBhaksha Sehbai, Hakim Ehsanullah Khan ke saath-saath Bahadurshah Zafar, Mallika Zeenatmahal aur Nawab Shasmuudin Ahmed Khan jaisa bahut se hakiki kirdaaron se bhi jagmaga raha hai."], "author": "Shamsur Rahman Faruqi", "num_pages": "830", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2011-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9584109-the-sweetness-of-tears", "num_ratings": "1,245", "num_reviews": "203", "avg_ratings": 3.99, "genres": ["Fiction", "Cultural", "Pakistan", "Religion", "Cultural"], "title": "The Sweetness of Tears", "description": ["From Nafisa Haji, author of the critically acclaimed novel, ", " comes ", ", an emotional, deeply layered story that explores the far reaching effects of cultural prejudice, forbidden love, and hidden histories on a young woman and her family. A paperback original from a superb writer whose first novel was enthusiastically praised b", "From Nafisa Haji, author of the critically acclaimed novel, ", " comes ", ", an emotional, deeply layered story that explores the far reaching effects of cultural prejudice, forbidden love, and hidden histories on a young woman and her family. A paperback original from a superb writer whose first novel was enthusiastically praised by Khaled Hosseini, bestselling author of The ", " and ", ", Haji, an American of Indo-Pakistani descent, writes with grace, heart, and wisdom about the collisions of culture and religion, tradition and modernity played out through individual lives."], "author": "Nafisa Haji", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-05-17 00:00:00", "ISBN": "0061780103"},
{"url": "https://www.goodreads.com/book/show/18259549-faizan-e-sunnat", "num_ratings": "24", "num_reviews": "2", "avg_ratings": 4.5, "genres": ["Religion", "Islam", "Religion"], "title": "Faizan e Sunnat: Blessings of Sunnah (Vol.1)", "description": ["The author has made his books freely available on the official url."], "author": "Muhammad Ilyas 'Attar Qadri Razavi", "num_pages": "1000", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/473848.Season_of_the_Rainbirds", "num_ratings": "406", "num_reviews": "61", "avg_ratings": 3.27, "genres": ["Fiction", "Cultural", "Pakistan", "Literary Fiction", "Novels", "Cultural", "India", "Literature", "Asian Literature", "Cultural"], "title": "Season of the Rainbirds", "description": ["Set during a monsoon season in the 1980s in a small town in Pakistan, Season of the Rainbirds is centred on the mysterious reappearance of a sack of letters lost in a train crash nineteen years previously. Could the letters have any bearing on Judge Anwar’s murder? The letters and the judge’s death trigger a series of tragic events and as the murder investigation progresse", "Set during a monsoon season in the 1980s in a small town in Pakistan, Season of the Rainbirds is centred on the mysterious reappearance of a sack of letters lost in a train crash nineteen years previously. Could the letters have any bearing on Judge Anwar’s murder? The letters and the judge’s death trigger a series of tragic events and as the murder investigation progresses, dark tales of passion and betrayal unfold and long-buried secrets come to light.", "The narrative segues between several characters—the judge’s family, a cleric troubled by local inhabitants’ lapses, a Muslim deputy commissioner defiantly involved with a Christian woman, a feudal landlord and a crusading journalist reporting on the delivery of the mail packet—and comes to a head when the journalist disappears and the country lurches between fear and uncertainty following an assassination attempt on the president. ", "One of the most exquisite fictional debuts, Season of the Rainbirds is a compelling portrayal of a society in strife, of a timeless world where daily rituals are played out against an ominous landscape of oppression, decadence, bigotry and power."], "author": "Nadeem Aslam", "num_pages": "208", "awards": ["Betty Trask Award (1994)", "Authors' Club Best First Novel Award (1993)"], "places": ["Pakistan"], "character_names": [], "language": "English", "publish_date": "2005-07-07 00:00:00", "ISBN": "0571224792"},
{"url": "https://www.goodreads.com/book/show/18108066-the-shadow-of-the-crescent-moon", "num_ratings": "1,069", "num_reviews": "216", "avg_ratings": 3.36, "genres": ["Fiction", "Cultural", "Asia", "Contemporary", "Drama", "Cultural", "Pakistan"], "title": "The Shadow of the Crescent Moon", "description": ["Fatima Bhutto's stunning debut begins and ends one rain swept Friday morning in Mir Ali, a small town in Pakistan's Tribal Areas close to the Afghan border. This land is also home to a three-dimensional chessboard of seemingly endless war — American drones killing the Taliban; Sunni Muslims bombing Shia Muslims; and an underground, generations-old fight for independence fr", "Fatima Bhutto's stunning debut begins and ends one rain swept Friday morning in Mir Ali, a small town in Pakistan's Tribal Areas close to the Afghan border. This land is also home to a three-dimensional chessboard of seemingly endless war — American drones killing the Taliban; Sunni Muslims bombing Shia Muslims; and an underground, generations-old fight for independence from the central government.", "Three brothers, who adopt the different ways of life from each other after their father's death, meet for breakfast. Soon after, the eldest, Aman Erum, recently returned from America, hails a taxi to the local mosque. The second, Sikandar, a doctor, goes to check in at his hospital. His troubled wife, does not join the family that morning. No one knows where Mina goes these days. And the youngest, the idealist, Hayat, leaves for town on a motorbike. Seated behind him is a beautiful, fragile girl, whose life and thoughts are overwhelmed by the war that has enveloped the place of her birth.", "Three hours later their day will end in devastating circumstances.", " chronicles the lives of five young people trying to live and love in a world on fire. Individuals are pushed to make terrible choices. And, as the events of this single morning unfold, one woman is at the centre of it all."], "author": "Fatima Bhutto", "num_pages": "240", "awards": ["Women's Prize for Fiction Nominee for Longlist (2014)"], "places": [], "character_names": ["Aman Erum, Sikandar, Hayat, Samarra, Mina"], "language": "English", "publish_date": "2013-11-28 00:00:00", "ISBN": "0670922986"},
{"url": "https://www.goodreads.com/book/show/16047563-thinner-than-skin", "num_ratings": "118", "num_reviews": "21", "avg_ratings": 3.51, "genres": ["Cultural", "Pakistan", "Fiction", "Contemporary"], "title": "Thinner Than Skin", "description": ["In the wilds of Northern Pakistan, where glaciers are born of mating ice, two young lovers shatter the tenuous peace of a nomadic community", "Thinner than Skin is a riveting novel about identity and belonging. It's also a love story: between a young Pakistani man trying to make his way as photographer in America, and the daughter of a Pakistani father and German mother brough", "In the wilds of Northern Pakistan, where glaciers are born of mating ice, two young lovers shatter the tenuous peace of a nomadic community", "Thinner than Skin is a riveting novel about identity and belonging. It's also a love story: between a young Pakistani man trying to make his way as photographer in America, and the daughter of a Pakistani father and German mother brought up in the US, who wants to return to a country she's never seen. Together they make the trip to Pakistan, where a chance meeting with a young nomad changes their lives, and the lives of those around them, forever. The novel is also a love letter to the wilds of Northern Pakistan, to glaciers, to the old Silk Road, and to the nomadic life of the indigenous people in the Northern territories, where China encroaches and Pakistanis, Uzbeks, Russians, Chinese, and Afghans all come together to trade."], "author": "Uzma Aslam Khan", "num_pages": "352", "awards": ["Man Asian Literary Prize Nominee (2012)", "DSC Prize Nominee for South Asian Literature  for Longlist (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/471289.Black_Margins", "num_ratings": "153", "num_reviews": "11", "avg_ratings": 4.31, "genres": ["Short Stories", "Cultural", "India", "Cultural", "Pakistan", "Fiction"], "title": "Black Margins", "description": ["Manto wrote stories not only of a couple of pages but also of a couple of lines. Imagine the craftsmanship to explain an idea in one line. These stories that encompass a line or a paragraph are called Siyah Hashiye."], "author": "Saadat Hasan Manto", "num_pages": "308", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-02-01 00:00:00", "ISBN": "8187649402"},
{"url": "https://www.goodreads.com/book/show/12885815-baagh", "num_ratings": "58", "num_reviews": "6", "avg_ratings": 3.78, "genres": ["Novels", "Literature"], "title": "Baagh / باگھ", "author": "Abdullah Hussein", "num_pages": "341", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2012-08-16 00:00:00", "ISBN": "9693508823"},
{"url": "https://www.goodreads.com/book/show/15701387-anarkali", "num_ratings": "107", "num_reviews": "6", "avg_ratings": 3.68, "genres": [], "title": "Anarkali / انار کلی", "description": ["تاریخی اہمیت سے قطع نظر، ڈرامہ \"انار کلی\" امتیاز علی تاج کے فنی عروج اور اردو زبان کی دلفریب ادبیت کاخوبصورت امتزاج ہے۔ خوبی زبان، بندش الفاظ، چست مکالمات اور برجستگی جیسے ڈرامائی لوازمات نے اس تخلیق میں ایک شان، ایک وقار اور سربلندی پیدا کی ہے۔", "خود امتیاز علی تاج کہتے ہیں: ", "\"میرے ڈرامے کا تعلق محض روایات سے ہے۔ بچپن سے انار کلی کی کہانی کے سنتے رہنے سے حسن و عشق، ناکامی و ن", "تاریخی اہمیت سے قطع نظر، ڈرامہ \"انار کلی\" امتیاز علی تاج کے فنی عروج اور اردو زبان کی دلفریب ادبیت کاخوبصورت امتزاج ہے۔ خوبی زبان، بندش الفاظ، چست مکالمات اور برجستگی جیسے ڈرامائی لوازمات نے اس تخلیق میں ایک شان، ایک وقار اور سربلندی پیدا کی ہے۔", "خود امتیاز علی تاج کہتے ہیں: ", "\"میرے ڈرامے کا تعلق محض روایات سے ہے۔ بچپن سے انار کلی کی کہانی کے سنتے رہنے سے حسن و عشق، ناکامی و نامرادی کا جو ڈراما میرے تخیل نے مغلیہ حرم کے شان و شوکت میں دیکھا، یہ اس کا اظہار ہے\"۔"], "author": "Imtiaz Ali Taj", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2012-08-16 00:00:00", "ISBN": "9693502574"},
{"url": "https://www.goodreads.com/book/show/19283880-the-prisoner", "num_ratings": "501", "num_reviews": "94", "avg_ratings": 4.01, "genres": ["Fiction", "Cultural", "Pakistan", "Thriller"], "title": "The Prisoner", "description": ["On an unusually cold December evening in Karachi, American journalist Jon Friedland is kidnapped from one of the city's poshest neighbourhoods. His captors plan to post a video of his execution on Christmas Day. The kidnapping has come at a bad time, embarrassing the Pakistani government in front of their US allies. The clock is ticking. Will the police and Intelligence Ag", "On an unusually cold December evening in Karachi, American journalist Jon Friedland is kidnapped from one of the city's poshest neighbourhoods. His captors plan to post a video of his execution on Christmas Day. The kidnapping has come at a bad time, embarrassing the Pakistani government in front of their US allies. The clock is ticking. Will the police and Intelligence Agencies recover Friedman alive?", "The story careens through the streets of Karachi, taking the reader into an all too real world of jihadis, corrupt police officers, and bloodthirsty political henchmen – all placed together in a city where no one is quite what they seem."], "author": "Omar Shahid Hamid", "num_pages": "352", "awards": ["DSC Prize Nominee for South Asian Literature  for Longlist (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-15 00:00:00", "ISBN": "9382616144"},
{"url": "https://www.goodreads.com/book/show/20587018-agency-rules---never-an-easy-day-at-the-office", "num_ratings": "340", "num_reviews": "89", "avg_ratings": 4.24, "genres": ["Thriller", "Mystery", "Adventure", "Action", "Suspense", "Novels", "Contemporary"], "title": "Agency Rules - Never an Easy Day at the Office", "description": ["Celebrated as a ragtag force that defeated and broke the Soviet Union, no one predicted the Mujahideen would bring with them a plague that would spread like wildfire through Pakistan in the years to follow. When the battle-worn fighters returned with no enemy or war to fight, they turned their sights on the country that had been t", "Celebrated as a ragtag force that defeated and broke the Soviet Union, no one predicted the Mujahideen would bring with them a plague that would spread like wildfire through Pakistan in the years to follow. When the battle-worn fighters returned with no enemy or war to fight, they turned their sights on the country that had been their creator and benefactor.", "From the same battlegrounds that birthed the Mujahideen, a young Kamal Khan emerges as a different breed of warrior. Discarding his wealthy family comforts, Kamal becomes a precision sniper, an invincible commando and a clandestine operative bringing intimidation, dominance and death with him to the battlefield. Ending the plague is his prime directive.", "Shrouded in political expediency, hampered by internal power struggles, international espionage and doublespeak that makes Washington’s spin doctors proud, Kamal’s mission is a nightmare of rampant militant fundamentalism that threatens to choke and take Pakistan hostage. For him, the fight is not just for freedom, but the survival of a nation."], "author": "Khalid Muhammad", "num_pages": "273", "awards": [], "places": ["Karachi", "Peshawar", "Islamabad"], "character_names": [], "language": "English", "publish_date": "2014-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22673665-namal", "num_ratings": "319", "num_reviews": "39", "avg_ratings": 4.57, "genres": ["Spirituality"], "title": "Namal / نمل", "author": "Nimra Ahmed", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2014-07-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18335897-aag-ka-darya", "num_ratings": "354", "num_reviews": "33", "avg_ratings": 4.18, "genres": ["Cultural", "India", "Fiction", "Asian Literature", "Indian Literature", "Cultural", "Pakistan", "Literature", "Novels", "Historical", "Historical Fiction", "Classics", "Cultural", "Asia", "Literary Fiction"], "title": "आग का दरिया [Aag Ka Darya]", "description": ["The most important novel of twentieth-century Urdu fiction. ", "First published in 1959, Aag ka Darya encompasses the fates of four recurring characters over two and a half millennia: Gautam, Champa, Kamal, and Cyril—Buddhist, Hindu, Muslim, and Christian. In different eras different relations form and reform among the four: romance and war, possession and dispossession. Inter", "The most important novel of twentieth-century Urdu fiction. ", "First published in 1959, Aag ka Darya encompasses the fates of four recurring characters over two and a half millennia: Gautam, Champa, Kamal, and Cyril—Buddhist, Hindu, Muslim, and Christian. In different eras different relations form and reform among the four: romance and war, possession and dispossession. Interweaving parables, legends, dreams, diaries, and letters, Hyder's prose is lyrical and witty. And she argues for a culture that is inclusive: Aag ka Darya is a book that questions the relevance of religion in defining Indian identity.", "Reviews for the English translation:", "A glorious tapestry of India's history....Brilliant and thought-provoking...this book is fascinating! -- India Edghill, Historical Novels Review, February 2004", "A rich and ancient tapestry, interweaving the tiny threads of individual human experience into a panoramic spread of cultural diversity. -- Linda B. Osborne, WorldView, November/December 2004", "An Urdu classic with a breathtakingly vast canvas. -- Outlook", "Hyder is a wonderful writer. Hers is one of the most important Indian voices of the twentieth century. -- Amitov Ghosh", "To Urdu fiction what A Hundred Years of Solitude is to Hispanic Literature. -- Times Literary Supplement"], "author": "Qurratulain Hyder", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "Hindi", "publish_date": "2008-08-16 00:00:00", "ISBN": "8122501648"},
{"url": "https://www.goodreads.com/book/show/30688435-exit-west", "num_ratings": "61,697", "num_reviews": "8,579", "avg_ratings": 3.82, "genres": ["Fiction", "Magical Realism", "Fantasy", "Contemporary", "Literary Fiction"], "title": "Exit West", "description": ["In a country teetering on the brink of civil war, two young people meet—sensual, fiercely independent Nadia and gentle, restrained Saeed. They embark on a furtive love affair and are soon cloistered in a premature intimacy by the unrest roiling their city. When it explodes, turning familiar streets into a patchwork of checkpoints and bomb blasts, they begin to hear whisper", "In a country teetering on the brink of civil war, two young people meet—sensual, fiercely independent Nadia and gentle, restrained Saeed. They embark on a furtive love affair and are soon cloistered in a premature intimacy by the unrest roiling their city. When it explodes, turning familiar streets into a patchwork of checkpoints and bomb blasts, they begin to hear whispers about doors—doors that can whisk people far away, if perilously and for a price. As the violence escalates, Nadia and Saeed decide that they no longer have a choice. Leaving their homeland and their old lives behind, they find a door and step through. ", " follows these characters as they emerge into an alien and uncertain future, struggling to hold on to each other, to their past, to the very sense of who they are. Profoundly intimate and powerfully inventive, it tells an unforgettable story of love, loyalty, and courage that is both completely of our time and for all time."], "author": "Mohsin Hamid", "num_pages": "231", "awards": ["Man Booker Prize Nominee (2017)", "Los Angeles Times Book Prize Nominee for Fiction (2017)", "National Book Critics Circle Award Nominee for Fiction (2017)", "Andrew Carnegie Medal Nominee for Fiction (2018)", "Folio Prize Nominee (2018)", "Kirkus Prize Nominee for Fiction (2017)", "Goodreads Choice Award Nominee for Fiction (2017)", "Brooklyn Public Library Literary Prize Nominee for Fiction (2017)"], "places": ["San Diego, California", "La Jolla, San Diego, California", "Marrakesh", "Mykonos, Cyclades"], "character_names": [], "language": "English", "publish_date": "2017-03-07 00:00:00", "ISBN": "0735212171"},
{"url": "https://www.goodreads.com/book/show/6365973-nadaar-log", "num_ratings": "89", "num_reviews": "10", "avg_ratings": 4.04, "genres": [], "title": "Nadaar Log / نادار لوگ", "description": ["Published first in 1996 this novel by Abdullah Hussain is considered as a sequel to his famous Udaas Naslain. The story of this novel takes place during 1897 to 1974. This is the story of a generation that has no urge to protect and fight for its rights, people who have accepted everything as fate and have left themselves to the flow of time. The story really gets a takeof", "Published first in 1996 this novel by Abdullah Hussain is considered as a sequel to his famous Udaas Naslain. The story of this novel takes place during 1897 to 1974. This is the story of a generation that has no urge to protect and fight for its rights, people who have accepted everything as fate and have left themselves to the flow of time. The story really gets a takeoff after 1947 when Pakistan gets independence and the people who fought for certain ideals are pushed to wall by those who happen to be in corridors of power. The novel describes those years of indifference, difficulties and turbulence which first germinate the seeds of undemocratic governments and then it leads to secession of the country in 1971. The novel suggests that this was the period where if truth was upheld the history and the geography of Pakistan would have been different but since people kept silence which tantamount to a sin, so they have to reap the wages of this in shape of disintegrating the federation and losing their brothers. Nadar Loog is the story of a people who had great ideals but were found wanting in action when it mattered to stand and assert. This is the story about poverty of action and deeds that leads a nation and people to a state of flux."], "author": "Abdullah Hussein", "num_pages": "807", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12885741-nashaib", "num_ratings": "39", "num_reviews": "2", "avg_ratings": 4.03, "genres": [], "title": "Nashaib / نشیب", "author": "Abdullah Hussein", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2011-09-20 00:00:00", "ISBN": "9693515463"},
{"url": "https://www.goodreads.com/book/show/5989307-saffron-dreams", "num_ratings": "285", "num_reviews": "70", "avg_ratings": 3.62, "genres": ["Fiction", "Romance", "Womens", "Modern", "The United States Of America"], "title": "Saffron Dreams", "description": ["\"Saffron Dreams\" is a tale of love, tragedy, and redemption from the award-winning author of \"Beyond the Cayenne Wall.\".. ", " You don't know you're a misfit until you are marked as an outcast. ", " From the darkest hour of American history emerges a mesmerizing tale of tender love, a life interrupted, and faith recovered. Arissa Illahi, a Muslim artist and writer, discovers in a", "\"Saffron Dreams\" is a tale of love, tragedy, and redemption from the award-winning author of \"Beyond the Cayenne Wall.\".. ", " You don't know you're a misfit until you are marked as an outcast. ", " From the darkest hour of American history emerges a mesmerizing tale of tender love, a life interrupted, and faith recovered. Arissa Illahi, a Muslim artist and writer, discovers in a single moment that no matter how carefully you map your life, it is life itself that chooses your destiny. After her husband's death in the collapse of the World Trade Center, the discovery of his manuscript marks Arissa's reconnection to life. Her unborn son and the unfinished novel fuse in her mind into one life-defining project that becomes, at once, the struggle for her emotional survival and the redemption of her race. \"Saffron Dreams\" is a novel about our ever evolving identities and the events and places that shape them. It reminds us that in the midst of tragedy, our dreams can become a lasting legacy."], "author": "Shaila M. Abdullah", "num_pages": "248", "awards": ["Reader Views Literary Award for Novel (1st Place) (2009)", "Next Generation Indie Book Awards Nominee for Multicultural Fiction (2009)", "North Texas Book Festival Award Nominee for General Trade Book, Fiction (2010)", "Kick Start Guy Book of the Year Award (2009)", "American Author's Association Golden Quill Award for Fiction - Multicultural (2009)", "Written Arts Awards"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2009-01-12 00:00:00", "ISBN": "1932690727"},
{"url": "https://www.goodreads.com/book/show/86938.Terrorism", "num_ratings": "103", "num_reviews": "12", "avg_ratings": 4.11, "genres": ["Politics", "Nonfiction", "History", "War", "Terrorism", "Cultural", "Pakistan", "War", "Political Science", "International Relations"], "title": "Terrorism: Theirs & Ours", "description": ["In 1985, President Ronald Reagan received a group of bearded turban-wearing men who looked like they came from another century. After receiving them in the White House, Reagan spoke to the press, referring to his foreign guests as \"freedom fighters.\" These were the Afghan mujahideen. In August 1998, another American president ordered missile strikes from the American navy", "In 1985, President Ronald Reagan received a group of bearded turban-wearing men who looked like they came from another century. After receiving them in the White House, Reagan spoke to the press, referring to his foreign guests as \"freedom fighters.\" These were the Afghan mujahideen. In August 1998, another American president ordered missile strikes from the American navy based in the Indian Ocean to kill Osama bin Laden and his men in the camps in Afghanistan. The terrorist of yesterday is the hero of today, and the hero of yesterday becomes the terrorist of today. In Terrorism: Theirs and Ours, Eqbal Ahmad holds up the concepts of \"terrorist\" and \"freedom fighter\" to U.S. foreign policy. What do these terms mean? Where do they apply? How can the roots of political violence be stemmed? An invaluable primer."], "author": "Eqbal Ahmad", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-12-04 00:00:00", "ISBN": "1583224904"},
{"url": "https://www.goodreads.com/book/show/7713541-the-reluctant-mullah", "num_ratings": "108", "num_reviews": "25", "avg_ratings": 3.48, "genres": ["Cultural", "Pakistan", "Fiction", "Religion", "Islam", "Literature", "English Literature"], "title": "The Reluctant Mullah", "description": ["In a moment of idle curiosity, Musa tries on the modest garb of a Muslim woman to experience for himself what it's like to be veiled. While this cause much mirht among his fellow students at the Madrasah, the elders are not amused, viewing Musa's experimentation as a prank too far.", "Back at home he must conform to family life and face the prospect of an arranged marriage. Cl", "In a moment of idle curiosity, Musa tries on the modest garb of a Muslim woman to experience for himself what it's like to be veiled. While this cause much mirht among his fellow students at the Madrasah, the elders are not amused, viewing Musa's experimentation as a prank too far.", "Back at home he must conform to family life and face the prospect of an arranged marriage. Cleverly, the family patriarch, Dadaji, offers him a deal: a month of days to find himself a bride or else Musa must accept Dadaji's own choice.", "And so the race is on for Musa, a devout Muslim and gentle idealist, who dreams of a perfect companion but despairs of ever finding her. When his siblings and friends step in to help, their efforts lead both to hilarity and outrage but soon the dark side of tradition rears its ugly head..."], "author": "Sagheer Afzal", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "190555916X"},
{"url": "https://www.goodreads.com/book/show/3640913-crossed-swords", "num_ratings": "181", "num_reviews": "22", "avg_ratings": 3.95, "genres": ["Cultural", "Pakistan", "Nonfiction", "History", "Politics"], "title": "Crossed Swords: Pakistan, Its Army, and the Wars Within", "description": ["Based on 30 years of research and analysis, this definitive book is a profound, multi-layered, and historical analysis of the nature and role of the Pakistan army in the country's polity as well as its turbulent relationship with the United States. Shuja Nawaz examines the army and Pakistan in both peace and war. Using many hitherto unpublished materials from the archives", "Based on 30 years of research and analysis, this definitive book is a profound, multi-layered, and historical analysis of the nature and role of the Pakistan army in the country's polity as well as its turbulent relationship with the United States. Shuja Nawaz examines the army and Pakistan in both peace and war. Using many hitherto unpublished materials from the archives of the United States, the United Kingdom, and the General Headquarters of the Pakistan Army, as well as interviews with key military and political figures in Pakistan and the United States, he sheds light not only on the Pakistan Army and its US connections but also on Pakistan as a key Muslim country in one of the world's toughest neighborhoods. In doing so, he lays bare key facts about Pakistan's numerous wars with India and its many rounds of political musical chairs, as well as the Kargil conflict of 1999. He then draws lessons from this history that may help Pakistan end its wars within and create a stabler political entity."], "author": "Shuja Nawaz", "num_pages": "655", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-15 00:00:00", "ISBN": "0195476603"},
{"url": "https://www.goodreads.com/book/show/94731.City_of_Sin_and_Splendour", "num_ratings": "150", "num_reviews": "10", "avg_ratings": 3.92, "genres": ["Cultural", "Pakistan", "Nonfiction", "History", "Travel", "Cultural", "India"], "title": "City of Sin and Splendour: Writings on Lahore", "description": ["'The ancient whore, the handmaiden of dimly remembered Hindu kings, the courtesan of Mughal emperors’, the ‘Paris of the East’, Lahore is more than the grandeur of Mughal forts and gardens, mosques and mausoleums; the jewel colours of everlasting spring. It is also the city of poets, the city of love, longing, sin and splendour. This anthology brings together verse and pro", "'The ancient whore, the handmaiden of dimly remembered Hindu kings, the courtesan of Mughal emperors’, the ‘Paris of the East’, Lahore is more than the grandeur of Mughal forts and gardens, mosques and mausoleums; the jewel colours of everlasting spring. It is also the city of poets, the city of love, longing, sin and splendour. This anthology brings together verse and prose: essays, stories, chronicles and profiles by people who have shared a relationship with Lahore. From the mystical poems of Madho Lal Hussain and Bulleh Shah to Iqbal’s ode and Faiz’s lament, from Maclagan and Aijazuddin’s historical treatises and Kipling’s ‘chronicles’ to Samina Quraeshi’s intricate portraits of the Old City and Irfan Husain’s delightful account of Lahori cuisine, City of Sin and Splendour is a marriage of the sacred and profane.", "While Pran Nevile paints a vivid sketch of Lahore’s Hira Mandi, Shahnaz Kureshy brings alive the legend of Anarkali and Khalid Hasan pays a tribute to the late ‘melody queen’ Nur Jehan. Mohsin Hamid’s essay on exile, Bina Shah’s account of the Karachi vs Lahore debate and Emma Duncan’s piece on elections are essential to the understanding of modern-day Lahore.", "But the city is also about Lahore remembered. Ved Mehta and Krishen Khanna write about ‘going back’ as Khushwant Singh writes about his pre-Partition years in Lahore. Sara Suleri’s memories of her hometown, the landscapes of Bapsi Sidhwa’s fiction, Khaled Ahmed’s homage to Intezar Hussain and Urvashi Butalia’s Ranamama are tributes to memory as much as they are tributes to remarkable lives and unforgettable places.", "Including fiction old and new—from Manto and Chughtai to Ashfaq Ahmed and Zulfikar Ghose; Saad Ashraf and Sorayya Khan to Mohsin Hamid and Rukhsana Ahmad, ", " is a sumptuous collection that reflects the city it celebrates."], "author": "Bapsi Sidhwa", "num_pages": "392", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-30 00:00:00", "ISBN": "014303166X"},
{"url": "https://www.goodreads.com/book/show/11328968-aab-e-gum", "num_ratings": "287", "num_reviews": "22", "avg_ratings": 4.41, "genres": ["Cultural", "Pakistan", "Humor", "Fiction"], "title": "Aab e Gum / آبِ گم", "description": ["\"اس مجموعے کے بیشتر کردار ماضی پرست، ماضی زدہ اور مردم گزیدہ ہیں۔ ان کا اصل مرض ناسٹلجیا ہے۔ جب انسان کو ماضی، حال سے زیادہ پرکشش نظر آنے لگے اور مستقبل نظر آنا ہی بند ہو جائے تو باور کرنا چاہیے کہ وہ بوڑھا ہو گیا ہے۔ یہ بھی یاد رہے کہ بڑھاپے کا جوانی لیوا حملہ کسی بھی عمر میں - بالخصوص بھری جوانی میں - ہو سکتا ہے۔۔۔ غور سے دیکھا جائے تو ایشیائی ڈرامے کا اصل ولن ماضی ہے۔۔۔", "\"اس مجموعے کے بیشتر کردار ماضی پرست، ماضی زدہ اور مردم گزیدہ ہیں۔ ان کا اصل مرض ناسٹلجیا ہے۔ جب انسان کو ماضی، حال سے زیادہ پرکشش نظر آنے لگے اور مستقبل نظر آنا ہی بند ہو جائے تو باور کرنا چاہیے کہ وہ بوڑھا ہو گیا ہے۔ یہ بھی یاد رہے کہ بڑھاپے کا جوانی لیوا حملہ کسی بھی عمر میں - بالخصوص بھری جوانی میں - ہو سکتا ہے۔۔۔ غور سے دیکھا جائے تو ایشیائی ڈرامے کا اصل ولن ماضی ہے۔۔۔ پاستان طرازی کے پس منظر میں مجروح انا کا طاؤسی رقص دیدنی ہوتا ہے کہ مور فقط اپنا ناچ ہی نہیں، اپنا جنگل بھی خود ہی پیدا کرتا ہے۔ ناچتے ناچتے ایک طلسماتی لمحہ ایسا آتا ہے کہ سارا جنگل ناچنے لگتا ہے اور مور خاموش کھڑا دیکھتا رہ جاتا ہے۔ ناسٹل جیا اسی لمحۂ منمجمد کی داستان ہے۔", "نشۂ ماضی میں سرمست ایک مفلوک الحال مگر مغلوب الغضب از کار و از خود رفتہ دکاندار۔ ایک مفلوج اور دل گرفتہ ضعیف آدامی اور اس سے بھی زیادہ گھائل اس کا تنہا ساتھی ۔۔۔ ایک زخمی اور دکھی گوڑا مغل بادشاہوں کے ہم نام ننگ دھڑنگ بچوں کے ساتھ جھگی میں رہنے والا منشی۔ حجت اور محبت کرنے والا دیو ہیکل پٹھان آڑھتی اور ہر فن مست مولا حجام۔ چھوٹے سے کمرے میں پچھتر سال گزار دینے اور کبوتروں اور چڑیوں کو دسراتھ اور بدھ کی مورتیوں میں نروان ڈھوندنے والا سنکی۔ اپنے سنہری دور ماتحتی کی یاد میں گم ایک ضعیف چپراسی۔۔۔ میں نے زندگی کو، اور اپنے آپ کو، ایسے ہی افراد و حوادث کے حوالے سے جانا پہچانا اور چاہا ہے۔ یہ ایسے ہی عام اور درماندہ لوگوں کا تذکرہ ہے جو اپنی ساخت، ترکیب اور دانستہ و آراستہ بے ترتیبی کے اعتبار سے مونتاژ اور پھیلاؤ اور فضا بندی کے لحاظ سے ناول سے زیادہ قریب ہے۔\""], "author": "Mushtaq Ahmad Yusufi", "num_pages": "404", "awards": ["BTBA Best Translated Book Award Nominee for Fiction Longlist (2016)"], "places": [], "character_names": [], "language": "Urdu", "publish_date": "1999-05-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/518300.Mottled_Dawn", "num_ratings": "450", "num_reviews": "44", "avg_ratings": 4.34, "genres": ["Short Stories", "Fiction", "Cultural", "Pakistan", "Cultural", "India", "Literature"], "title": "Mottled Dawn: Fifty Sketches and Stories of Partition", "description": ["This is a collection of Saadat Hasan Mantos most powerful pieces on the Partition of the subcontinent into India and Pakistan in 1947. The book includes unforgettable stories like \"Toba Tek Singh\", \"The Return\", \"The Assignment\", \"Colder Than Ice\" and many more, bringing alive the most tragic event in the history of the Indian subcontinent."], "author": "Saadat Hasan Manto", "num_pages": "214", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-01 00:00:00", "ISBN": "0140272127"},
{"url": "https://www.goodreads.com/book/show/2153793.A_Case_of_Exploding_Mangoes", "num_ratings": "7,946", "num_reviews": "844", "avg_ratings": 3.73, "genres": ["Fiction", "Cultural", "Pakistan", "Historical", "Historical Fiction", "Humor"], "title": "A Case of Exploding Mangoes", "description": ["Intrigue and subterfuge combine with bad luck and good in this darkly comic debut about love, betrayal, tyranny, family, and a conspiracy trying its damnedest to happen.", "Ali Shigri, Pakistan Air Force pilot and Silent Drill Commander of the Fury Squadron, is on a mission to avenge his father's suspicious death, which the government calls a suicide. Ali's target is none othe", "Intrigue and subterfuge combine with bad luck and good in this darkly comic debut about love, betrayal, tyranny, family, and a conspiracy trying its damnedest to happen.", "Ali Shigri, Pakistan Air Force pilot and Silent Drill Commander of the Fury Squadron, is on a mission to avenge his father's suspicious death, which the government calls a suicide. Ali's target is none other than General Zia ul-Haq, dictator of Pakistan. Enlisting a rag-tag group of conspirators, including his cologne-bathed roommate, a hash-smoking American lieutenant, and a mango-besotted crow, Ali sets his elaborate plan in motion. There's only one problem: the line of would-be Zia assassins is longer than he could have possibly known."], "author": "Mohammed Hanif", "num_pages": "323", "awards": ["Man Booker Prize Nominee for Longlist (2008)", "Guardian First Book Award Nominee (2008)", "James Tait Black Memorial Prize Nominee for Fiction (2008)", "Commonwealth Writers' Prize for Best First Book Overall (2009)", "Shakti Bhatt First Book Prize (2008)", "Corine Internationaler Buchpreis for Belletristik (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-05-20 00:00:00", "ISBN": "0307268071"},
{"url": "https://www.goodreads.com/book/show/4494257-the-writing-on-my-forehead", "num_ratings": "1,941", "num_reviews": "278", "avg_ratings": 3.83, "genres": ["Fiction", "Cultural", "India", "Cultural", "Pakistan", "Womens Fiction", "Chick Lit", "Cultural"], "title": "The Writing on My Forehead", "description": ["Saira Qader es la hija rebelde de una pareja de indo-paquistaníes musulmanes que viven en Los Ángeles. Al contrario que su hermana Amina, Saira lucha por preservar su independencia y hallar un equilibrio entre su voluntad y la de sus progenitores. A medida que narra su propia historia, Saira revela historias de su familia, como la de la infidelidad escandalosa de su abuelo", "Saira Qader es la hija rebelde de una pareja de indo-paquistaníes musulmanes que viven en Los Ángeles. Al contrario que su hermana Amina, Saira lucha por preservar su independencia y hallar un equilibrio entre su voluntad y la de sus progenitores. A medida que narra su propia historia, Saira revela historias de su familia, como la de la infidelidad escandalosa de su abuelo, la participación de éste en la lucha por la independencia de India, o las vivencias de su tía abuela, profesora de inglés en Pakistán. Descubre así los avatares de una familia dividida tanto por los acontecimientos históricos como por los secretos y mentiras de sus miembros. Su mano sobre mi frente narra el fascinante viaje hacia el pasado de Saira y su proceso de reconciliación con la vida."], "author": "Nafisa Haji", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-03 00:00:00", "ISBN": "0061493856"},
{"url": "https://www.goodreads.com/book/show/16299254-akhir-e-shab-kay-hamsafar", "num_ratings": "98", "num_reviews": "7", "avg_ratings": 4.2, "genres": ["Fiction"], "title": "Akhir-e-Shab Kay Hamsafar / آخر شب کے ہمسفر", "author": "Qurratulain Hyder", "awards": ["Jnanpith Award"], "places": [], "character_names": [], "language": "Urdu", "publish_date": "1979-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11080141-american-dervish", "num_ratings": "7,185", "num_reviews": "1,097", "avg_ratings": 3.67, "genres": ["Fiction", "Young Adult", "Coming Of Age", "Religion", "Contemporary"], "title": "American Dervish", "description": [" is a brilliantly written, nuanced, and emotionally forceful look inside the interplay of religion and modern life.", "Hayat Shah is a young American in love for the first time. His normal life of school, baseball, and video games had previously been distinguished only by his Pakistani heritage and by the frequent chill between his parents, who fight over thing", " is a brilliantly written, nuanced, and emotionally forceful look inside the interplay of religion and modern life.", "Hayat Shah is a young American in love for the first time. His normal life of school, baseball, and video games had previously been distinguished only by his Pakistani heritage and by the frequent chill between his parents, who fight over things he is too young to understand. Then Mina arrives, and everything changes.", "Mina is Hayat's mother's oldest friend from Pakistan. She is independent, beautiful and intelligent, and arrives on the Shah's doorstep when her disastrous marriage in Pakistan disintegrates. Even Hayat's skeptical father can't deny the liveliness and happiness that accompanies Mina into their home. Her deep spirituality brings the family's Muslim faith to life in a way that resonates with Hayat as nothing has before. Studying the Quran by Mina's side and basking in the glow of her attention, he feels an entirely new purpose mingled with a growing infatuation for his teacher.", "When Mina meets and begins dating a man, Hayat is confused by his feelings of betrayal. His growing passions, both spiritual and romantic, force him to question all that he has come to believe is true. Just as Mina finds happiness, Hayat is compelled to act -- with devastating consequences for all those he loves most.", " is a brilliantly written, nuanced, and emotionally forceful look inside the interplay of religion and modern life. Ayad Akhtar was raised in the Midwest himself, and through Hayat Shah he shows readers vividly the powerful forces at work on young men and women growing up Muslim in America. This is an intimate, personal first novel that will stay with readers long after they turn the last page."], "author": "Ayad Akhtar", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-09 00:00:00", "ISBN": "0316183318"},
{"url": "https://www.goodreads.com/book/show/18781341-the-scatter-here-is-too-great", "num_ratings": "547", "num_reviews": "105", "avg_ratings": 3.34, "genres": ["Fiction", "Cultural", "Pakistan", "Short Stories", "Literary Fiction", "Contemporary"], "title": "The Scatter Here Is Too Great", "description": ["A vivid and intricate novel-in-stories, ", " explores the complicated lives of ordinary people whose fates unexpectedly converge after a deadly bomb blast at the Karachi train station: an old communist poet; his wealthy, middle-aged son; a young man caught in an unpleasant, dead-end job; a girl who spins engaging tales to conceal her heartbreak; an", "A vivid and intricate novel-in-stories, ", " explores the complicated lives of ordinary people whose fates unexpectedly converge after a deadly bomb blast at the Karachi train station: an old communist poet; his wealthy, middle-aged son; a young man caught in an unpleasant, dead-end job; a girl who spins engaging tales to conceal her heartbreak; and a grief-stricken writer, who struggles to make sense of this devastating tragedy.", "Bilal Tanweer reveals the pain, loneliness, and longing of these characters and celebrates the power of the written word to heal lives and communities plagued by violence. Elegantly weaving together different voices into a striking portrait of a city and its people, ", " is a tale as vibrant and varied in its characters, passions, and idiosyncrasies as the city itself."], "author": "Bilal Tanweer", "num_pages": "208", "awards": ["Shakti Bhatt First Book Prize (2014)", "DSC Prize Nominee for South Asian Literature (2015)"], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-05 00:00:00", "ISBN": "0062304410"},
{"url": "https://www.goodreads.com/book/show/18117935-udaas-naslain", "num_ratings": "529", "num_reviews": "41", "avg_ratings": 4.11, "genres": ["Novels"], "title": "Udaas Naslain / اُداس نسلیں", "description": ["This novel narrates about the different aspects of a generation. The novel is so exciting that the reader will love to read it more than once. Feudal system of undivided India, British, Hindu & Muslims are main characters of this novel."], "author": "Abdullah Hussein", "num_pages": "558", "awards": ["Adamjee Literary Award (0)"], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2010-08-16 00:00:00", "ISBN": "9693500733"},
{"url": "https://www.goodreads.com/book/show/17384455-babu-nagar", "num_ratings": "18", "num_reviews": "3", "avg_ratings": 4.72, "genres": [], "title": "Babu Nagar / بابو نگر", "description": ["A satire."], "author": "Hussain Ahmad Sherazi", "num_pages": "608", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2013-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/823810.God_s_Own_Land", "num_ratings": "100", "num_reviews": "7", "avg_ratings": 4.31, "genres": ["Cultural", "Pakistan", "Literature", "Asian Literature"], "title": "God's Own Land", "author": "Shaukat Siddiqui", "num_pages": "245", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-10-01 00:00:00", "ISBN": "0836458141"},
{"url": "https://www.goodreads.com/book/show/17851885-i-am-malala", "num_ratings": "291,136", "num_reviews": "16,826", "avg_ratings": 4.09, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Feminism"], "title": "I Am Malala: The Story of the Girl Who Stood Up for Education and Was Shot by the Taliban", "description": ["When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at p", "When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at point-blank range while riding the bus home from school, and few expected her to survive. ", "Instead, Malala's miraculous recovery has taken her on an extraordinary journey from a remote valley in northern Pakistan to the halls of the United Nations in New York. At sixteen, she has become a global symbol of peaceful protest and the youngest-ever Nobel Peace Prize laureate.", " is the remarkable tale of a family uprooted by global terrorism, of the fight for girls' education, of a father who, himself a school owner, championed and encouraged his daughter to write and attend school, and of brave parents who have a fierce love for their daughter in a society that prizes sons."], "author": "Malala Yousafzai", "num_pages": "327", "awards": ["Lincoln Award Nominee (2017)", "Goodreads Choice Award for Memoir & Autobiography (2013)"], "places": ["Lembah Swat"], "character_names": ["Malala Yousafzai"], "language": "English", "publish_date": "2013-10-08 00:00:00", "ISBN": "0316322407"},
{"url": "https://www.goodreads.com/book/show/17856468-romance-quartet", "num_ratings": "20", "num_reviews": "4", "avg_ratings": 4.2, "genres": ["Fiction", "Cultural", "Pakistan"], "title": "Romance Quartet", "description": ["Balzeeb, the ultimate emblem of beauty and wisdom, is the object of love for two doctors, friends both: Haroon and Latif. While in deep mourning at the death of her third husband, in a Khanaspur cemetery, Balzeeb meets Haroon. Latif and Haroon simultaneously grow closer and apart as they share their pursuit of “The Princess,” as she is known. The spools of mystery surround", "Balzeeb, the ultimate emblem of beauty and wisdom, is the object of love for two doctors, friends both: Haroon and Latif. While in deep mourning at the death of her third husband, in a Khanaspur cemetery, Balzeeb meets Haroon. Latif and Haroon simultaneously grow closer and apart as they share their pursuit of “The Princess,” as she is known. The spools of mystery surrounding Balzeeb are woven majestically around the myth of the serpent, tragically unaware of her true nature.", "Romance Quartet is a weaver's dream, exploring its depths ranging from paranormal to metaphysical and unfolding during the War of Independence which split the continent of Hind into India and Pakistan. Transcending all religions and impaling the heart, this story’s message is eternal, endearing and not one you will soon forget."], "author": "Farzana Moon", "num_pages": "204", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-11 00:00:00", "ISBN": "1939897017"},
{"url": "https://www.goodreads.com/book/show/1202874.Black_Wings", "num_ratings": "21", "num_reviews": "0", "avg_ratings": 3.29, "genres": ["Cultural", "Pakistan", "Fiction", "Womens Fiction", "Own", "Historical", "Historical Fiction", "Literature", "Asian Literature"], "title": "Black Wings", "author": "Sehba Sarwar", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2004-08-16 00:00:00", "ISBN": "9695161472"},
{"url": "https://www.goodreads.com/book/show/17238107-basti", "num_ratings": "316", "num_reviews": "46", "avg_ratings": 3.66, "genres": ["Cultural", "Pakistan", "Fiction", "Novels", "Cultural", "Asia", "Historical", "Historical Fiction", "Literature", "20th Century", "Literary Fiction", "Literature", "Cultural", "India", "Contemporary"], "title": "Basti / بستی", "description": [" is the great Pakistani novel, a beautifully written, brilliantly inventive reckoning with the violent history of a country whose turbulence, ambitions, and uncertainties increasingly concern the whole world. In Urdu, ", " means any space, from the most intimate to the most universal, in which groups of people come together to try to live together, and the universal", " is the great Pakistani novel, a beautifully written, brilliantly inventive reckoning with the violent history of a country whose turbulence, ambitions, and uncertainties increasingly concern the whole world. In Urdu, ", " means any space, from the most intimate to the most universal, in which groups of people come together to try to live together, and the universal question at the heart of the book is how to constitute a common world. What brings people together? What tears them apart? “When the world was still all new, when the sky was fresh and the earth not yet soiled, when trees breathed through centuries and ages spoke around in the voices of birds, how astonished he was that everything was so new and yet looked so old”—so the book begins, with a mythic, even mystic, vision of harmony, as the hero, Zakir, looks back on his childhood in a subcontinent that had not yet been divided between Muslims and Hindus. But Zakir is abruptly evicted from this paradise—real or imagined—into the maelstrom of history. The new country of Pakistan is born, separating him once and for all from the woman he loves, and in a jagged and jarring sequence of scenes we witness a nation and a psyche torn into existence only to be torn apart again and again by political, religious, economic, linguistic, personal, and sexual conflicts—in effect, a world of loneliness. Zakir, whose name means “remember,” serves as the historian of this troubled place, while the ties he maintains across the years with old friends—friends who run into one another in cafés and on corners and the odd other places where history takes a time-out—suggest that the possibility of reconciliation is not simply a dream. The characters wait for a sign that minds and hearts may still meet. In the meantime, the dazzling artistry of ", " itself gives us reason to hope against hope."], "author": "Intizar Hussain", "num_pages": "256", "awards": ["BTBA Best Translated Book Award Nominee for Fiction Longlist (2013)", "Adamjee Literary Award"], "places": [], "character_names": [], "language": "Urdu", "publish_date": "1983-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18138113-the-contract", "num_ratings": "449", "num_reviews": "75", "avg_ratings": 3.64, "genres": ["Romance", "Contemporary", "Novella", "Cultural", "Pakistan", "Romance", "Contemporary Romance"], "title": "The Contract", "description": ["Shahira, a young, divorced mother of a seven-year-old son, wants nothing to do with men ever again. But circumstances have forced her hand, and Huss", "Shahira, a young, divorced mother of a seven-year-old son, wants nothing to do with men ever again. But circumstances have forced her hand, and Hussain’s unusual proposition leaves her secretly relieved. As per their contract, she’ll have his name, will be paid to look after his ailing mother and motherless daughter and will be left well alone by him. Perfect!", "Until her new husband decides to stop playing by the rules.", "Hussain is suave and rich. He is nobody’s fool…and is not about to be bested by the ex-schoolteacher he is married to. He has Shahira in his sights and she has to have all her wits about her in order to hold him at arm’s length."], "author": "Zeenat Mahal", "num_pages": "108", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-12 00:00:00", "ISBN": "1927826152"},
{"url": "https://www.goodreads.com/book/show/25907598-ibil", "num_ratings": "28", "num_reviews": "3", "avg_ratings": 4.04, "genres": ["Horror", "War", "Terrorism", "Cultural", "Pakistan", "Thriller", "Thriller", "Spy Thriller"], "title": "Ibil", "description": ["Ibil is a fast paced biopunk action thriller that raises the critical issue of terrorism and explores the sentimental and environmental forces which trap an individual in this abyss. The novel revolves around the epidemics of MERS and Ebola viruses and brings to light their ancient roots. It grapples with the factors that lead to different types of terrorists - from foot s", "Ibil is a fast paced biopunk action thriller that raises the critical issue of terrorism and explores the sentimental and environmental forces which trap an individual in this abyss. The novel revolves around the epidemics of MERS and Ebola viruses and brings to light their ancient roots. It grapples with the factors that lead to different types of terrorists - from foot soldiers to lone wolves. This novel also discusses the contributing factors to the recent surge in terrorism for which corrupt regimes play a central role.", "Ibil is set in the backdrop of Afghan and Iraq Wars. The Islamic State or Iraq and Syria (ISIS) succeeds in starting a novel virus epidemic in the Middle East and many countries have to work together to stop the virus from spreading throughout the globe."], "author": "Adeerus Ghayan", "num_pages": "167", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/94732.The_Crow_Eaters", "num_ratings": "967", "num_reviews": "70", "avg_ratings": 3.77, "genres": ["Fiction", "Cultural", "Pakistan", "Historical", "Historical Fiction", "Cultural", "India", "Cultural", "Asia"], "title": "The Crow Eaters", "description": ["At the dawn of the 20th century in Pakistan, Freddy Junglewalla moves his family — pregnant wife, baby daughter, and Jerbanoo, his rotund mother-in-law — from their ancestral forest home to cosmopolitan Lahore. He opens a store, and as his fortunes grow, so does the animosity between Freddy and his mother-in-law. While Freddy prospers under British rule, life with the domi", "At the dawn of the 20th century in Pakistan, Freddy Junglewalla moves his family — pregnant wife, baby daughter, and Jerbanoo, his rotund mother-in-law — from their ancestral forest home to cosmopolitan Lahore. He opens a store, and as his fortunes grow, so does the animosity between Freddy and his mother-in-law. While Freddy prospers under British rule, life with the domineering Jerbanoo is another matter entirely. This exuberant novel, full of rollicking humor, paints a vivid picture of life in the Parsee community."], "author": "Bapsi Sidhwa", "num_pages": "268", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-24 00:00:00", "ISBN": "1571310509"},
{"url": "https://www.goodreads.com/book/show/9033146-zarguzasht", "num_ratings": "257", "num_reviews": "8", "avg_ratings": 4.39, "genres": ["Humor"], "title": "Zarguzasht / زرگزشت", "author": "Mushtaq Ahmad Yusufi", "num_pages": "332", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2005-08-16 00:00:00", "ISBN": "9694190142"},
{"url": "https://www.goodreads.com/book/show/290382.Salt_and_Saffron", "num_ratings": "1,221", "num_reviews": "103", "avg_ratings": 3.45, "genres": ["Fiction", "Cultural", "Pakistan", "Historical", "Historical Fiction", "Cultural", "Asia"], "title": "Salt and Saffron", "author": "Kamila Shamsie", "num_pages": "256", "awards": [], "places": [], "character_names": ["Samia Savage", "Aliya", "Khaleel", "Mariam Apa"], "language": "English", "publish_date": "2002-05-15 00:00:00", "ISBN": "158234261X"},
{"url": "https://www.goodreads.com/book/show/18137948-haveli", "num_ratings": "362", "num_reviews": "73", "avg_ratings": 3.71, "genres": ["Romance", "Cultural", "Pakistan", "Historical", "Historical Fiction", "Historical"], "title": "Haveli", "description": ["It’s the 1970′s in Jalalabad, an erstwhile princely state in Pakistan. Chandni is a self-proclaimed cynic and prefers to be called C. An orphan brought up by her domineering grandmother, a.k.a. The Broad, C is rebellious, quick-witted and stunningly beautiful.", "When Taimur, a.k.a. Alpha Male, enters the closed universe of the haveli, he is smitten, but he’ll never admit it.", "It’s the 1970′s in Jalalabad, an erstwhile princely state in Pakistan. Chandni is a self-proclaimed cynic and prefers to be called C. An orphan brought up by her domineering grandmother, a.k.a. The Broad, C is rebellious, quick-witted and stunningly beautiful.", "When Taimur, a.k.a. Alpha Male, enters the closed universe of the haveli, he is smitten, but he’ll never admit it. ", "The stakes get higher when the father, who had so cruelly abandoned her at birth, returns and C’s dream of reuniting with him becomes a reality. But now she has to choose between her father and his hand-picked groom on the one side, and Alpha Male and The Broad on the other."], "author": "Zeenat Mahal", "num_pages": "93", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-12 00:00:00", "ISBN": "1927826020"},
{"url": "https://www.goodreads.com/book/show/3260388", "num_ratings": "4,344", "num_reviews": "381", "avg_ratings": 4.52, "genres": ["Fiction"], "title": "پیر کامل", "description": [" (English: The Perfect Mentor) is a story focusing on a deviational sect which violates the finality of our Prophet (P.B.U.H) meanwhile, narrating a heart wrenching journey of two unhappy souls; Salaar Sikandar, a genius with an outstanding I.Q who has complicated queries about life and Imama Hashim, an ordinary girl with a stable family. Both are poles apart i", " (English: The Perfect Mentor) is a story focusing on a deviational sect which violates the finality of our Prophet (P.B.U.H) meanwhile, narrating a heart wrenching journey of two unhappy souls; Salaar Sikandar, a genius with an outstanding I.Q who has complicated queries about life and Imama Hashim, an ordinary girl with a stable family. Both are poles apart in terms of spiritual awakening. Destiny maneuvers their lives to cross each other’s paths, until Salaar falls in love with Imama after facing a horrifying experience that totally changes the course of his life.", "It was published in Shuaa Digest from July 2003 to February 2004."], "author": "Umera Ahmed", "num_pages": "525", "awards": [], "places": ["Islamabad", "United States of America"], "character_names": ["Imama Hashim - A girl who converts to Muslim from Ahmadiyya.", "Salar Sikander - A rich boy, neighbor of Imama, who has an IQ level above 150.", "Waseem - Imama's brother.", "Jalal - A doctor and older brother of Zainab.", "Hashim Mubeen - Father of Imama and Waseem.", "Sikander Usman - Salar's father.", "Tayyaba - Salar's mother and Sikander Usman's wife.", "Saad Zafar - A friend of Salar in New Haven.", "Dr Furqan - A devoted Muslim and doctor.", "Dr Sibt-e-Ali - An Islamic scholar in Lahore.", "Saeeda Amma - First cousin of Sibt-e-Ali."], "language": "Urdu", "publish_date": "2004-08-16 00:00:00", "ISBN": "9690018868"},
{"url": "https://www.goodreads.com/book/show/564093.Zaviya_", "num_ratings": "1,226", "num_reviews": "51", "avg_ratings": 4.46, "genres": ["Nonfiction", "Philosophy", "Literature", "Cultural", "Pakistan"], "title": "Zaviya / زاویہ", "description": ["nice book to read"], "author": "Ashfaq Ahmed", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "1998-08-16 00:00:00", "ISBN": "9693515870"},
{"url": "https://www.goodreads.com/book/show/11787752-our-lady-of-alice-bhatti", "num_ratings": "1,984", "num_reviews": "249", "avg_ratings": 3.36, "genres": ["Fiction", "Cultural", "Pakistan", "Cultural", "Asia", "Contemporary", "Novels", "Literary Fiction"], "title": "Our Lady of Alice Bhatti", "description": ["The patients of the Sacred Heart Hospital for All Ailments are looking for a miracle, and Alice Bhatti is looking for a job. ", "Alice is a candidate for the position of junior nurse, grade 4. It is only a few weeks since her release from Borstal. She has returned to her childhood home in the French Colony, where her father, recently retired from his position as chief janitor,", "The patients of the Sacred Heart Hospital for All Ailments are looking for a miracle, and Alice Bhatti is looking for a job. ", "Alice is a candidate for the position of junior nurse, grade 4. It is only a few weeks since her release from Borstal. She has returned to her childhood home in the French Colony, where her father, recently retired from his position as chief janitor, continues as part-time healer, and full-time headache for the local church. It seems she has inherited some of his gift.With guidance from the working nurse’s manual, and some tricks she picked up in prison, Alice brings succour to the thousands of patients littering the hospital’s corridors and concrete courtyard. In the process she attracts the attention of a lovesick patient, Teddy Bunt, apprentice to the nefarious ‘Gentleman Squad’ of the Karachi police. They fall in love; Teddy with sudden violence, Alice with cautious optimism.Their love is unexpected, but the consequences are not.", "Alice soon finds that her new life is built on foundations as unstable as those of her home. A Catholic snubbed by other Catholics, who are in turn hated by everyone around them, she is also put at risk by her husband, who does two things that no member of the Gentlemen Squad has ever done – fall in love with a working girl, and allow a potentially dangerous suspect to get away. Can Teddy and Alice ever live in peace? Can two people make a life together without destroying the very thing that united them? It seems unlikely, but then Alice Bhatti is no ordinary nurse...", "Filled with wit, colour and pathos, ", " is a glorious story of second chances, thwarted ambitions and love in unlikely places, set in the febrile streets of downtown Karachi. It is the remarkable new novel from the author of ", "."], "author": "Mohammed Hanif", "num_pages": "240", "awards": ["Wellcome Book Prize Nominee for Shortlist (2012)", "DSC Prize Nominee for South Asian Literature (2013)", "RSL Encore Award Nominee (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-06 00:00:00", "ISBN": "0224082051"},
{"url": "https://www.goodreads.com/book/show/19475532-butterfly-season", "num_ratings": "125", "num_reviews": "77", "avg_ratings": 3.83, "genres": ["Romance", "Contemporary", "Fiction", "Cultural", "India", "Cultural", "Pakistan"], "title": "Butterfly Season", "description": ["On her first holiday in six years, Rumi is expecting to relax and unwind. But when she is set up by her long-time friend, she doesn’t shy away from the possibilities. Ahad, a charming, independent, self-made man, captures her imagination, drawing her away from her disapproving sister, Juveria.", "Faced with sizzling chemistry and a meeting of the minds, Ahad and Rumi find them", "On her first holiday in six years, Rumi is expecting to relax and unwind. But when she is set up by her long-time friend, she doesn’t shy away from the possibilities. Ahad, a charming, independent, self-made man, captures her imagination, drawing her away from her disapproving sister, Juveria.", "Faced with sizzling chemistry and a meeting of the minds, Ahad and Rumi find themselves deep in a relationship that moves forward with growing intensity. But as her desire for the self-assured Ahad grows, Rumi struggles with a decision that will impact the rest of her life.", "Confronted by her scandalized sister, a forbidding uncle and a society that frowns on pre-marital intimacy, Rumi has to decide whether to shed her middle-class sensibilities, turning her back on her family, or return to her secluded existence as an unmarried woman in Pakistan.", "We follow Rumi from rainy London to a sweltering Karachi, as she tries to take control of her own destiny."], "author": "Natasha Ahmed", "num_pages": "169", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/290389.Broken_Verses", "num_ratings": "1,482", "num_reviews": "181", "avg_ratings": 3.58, "genres": ["Fiction", "Cultural", "Pakistan", "Cultural", "Asia", "Literary Fiction", "Contemporary"], "title": "Broken Verses", "description": ["Fourteen years ago, famous Pakistani activist Samina Akram disappeared. Two years earlier, her lover, Pakistan's greatest poet, was beaten to death by government thugs. In present-day Karachi, her daughter Aasmaani has just discovered a letter in the couple's private code—a letter that could only have been written recently.", " Aasmaani is thirty, single, drifting from job to", "Fourteen years ago, famous Pakistani activist Samina Akram disappeared. Two years earlier, her lover, Pakistan's greatest poet, was beaten to death by government thugs. In present-day Karachi, her daughter Aasmaani has just discovered a letter in the couple's private code—a letter that could only have been written recently.", " Aasmaani is thirty, single, drifting from job to job. Always left behind whenever Samina followed the Poet into exile, she had assumed that her mother's disappearance was simply another abandonment. Then, while working at Pakistan's first independent TV station, Aasmaani runs into an old friend of Samina's who gives her the first letter, then many more. Where could the letters have come from? And will they lead her to her mother?", " Merging the personal with the political, Broken Verses is at once a sharp, thrilling journey through modern-day Pakistan, a carefully coded mystery, and an intimate mother-daughter story that asks how we forgive a mother who leaves.", "  "], "author": "Kamila Shamsie", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-01 00:00:00", "ISBN": "0156030535"},
{"url": "https://www.goodreads.com/book/show/94733.The_Pakistani_Bride", "num_ratings": "974", "num_reviews": "81", "avg_ratings": 3.45, "genres": ["Cultural", "Pakistan", "Fiction", "Historical", "Historical Fiction", "Contemporary", "Historical"], "title": "The Pakistani Bride", "description": ["A novel by the author of Ice-Candy-Man Zaitoon, a new bride, is desperately unhappy in her marriage and is contemplating the ultimate escape??\"the one from which there is no return. Zaitoon, an orphan, is adopted by Qasim, who has left the isolated hill town where he was born and made a home for the two of them in the glittering, decadent city of Lahore. As the years pass,", "A novel by the author of Ice-Candy-Man Zaitoon, a new bride, is desperately unhappy in her marriage and is contemplating the ultimate escape??\"the one from which there is no return. Zaitoon, an orphan, is adopted by Qasim, who has left the isolated hill town where he was born and made a home for the two of them in the glittering, decadent city of Lahore. As the years pass, Qasim makes a fortune but grows increasingly nostalgic about his life in the mountains. Impulsively, he promises Zaitoon in marriage to a man of his tribe. But for Zaitoon, giving up the civilized city life she remembers to become the bride of this hard, inscrutable husband proves traumatic to the point where she decides to run away, though she knows that by the tribal code the punishment for such an act is death. ???Sidhwa shows a marvellous feel for imagery??\"at a breathless pace she weaves her exotic cliffhanger from passion, power, lust, sensuality, cruelty and murder.' ??\"Financial Times"], "author": "Bapsi Sidhwa", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-10-14 00:00:00", "ISBN": "0140148116"},
{"url": "https://www.goodreads.com/book/show/23357939-the-scriptwriter", "num_ratings": "22", "num_reviews": "3", "avg_ratings": 4.5, "genres": ["Cultural", "Pakistan", "War", "Terrorism", "Politics", "Thriller", "Spy Thriller", "Thriller"], "title": "The Scriptwriter", "description": ["The Scriptwriter is a politico-military thriller set in Pakistan amidst political turmoil in the second half of 2014. Novel's theme is based on the international espionage net that covers South Asian and Middle Eastern region. Caught in this net is the elected Government of Pakistan which is accused by the opposition of having come in power via fraudulent elections. The pl", "The Scriptwriter is a politico-military thriller set in Pakistan amidst political turmoil in the second half of 2014. Novel's theme is based on the international espionage net that covers South Asian and Middle Eastern region. Caught in this net is the elected Government of Pakistan which is accused by the opposition of having come in power via fraudulent elections. The plot is centered upon the US preparations for attack on the Islamic State of Iraq and Levant/Syria and its involvement in Pakistani politics.", "It will be available for free download from 11 to 13 Oct 2014 on Amazon Kindle."], "author": "Adeerus Ghayan", "num_pages": "242", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4657432-in-other-rooms-other-wonders", "num_ratings": "5,233", "num_reviews": "726", "avg_ratings": 3.74, "genres": ["Short Stories", "Fiction", "Cultural", "Pakistan", "Cultural", "Asia"], "title": "In Other Rooms, Other Wonders", "description": ["A major literary debut that explores class, culture, power, and desire among the ruling and servant classes of Pakistan.", "In the spirit of Joyce's Dubliners and Turgenev's A Sportsman's Sketches, Daniyal Mueenuddin's collection of linked stories illuminates a place and a people through an examination of the entwined lives of landowners and their retainers on the Gurmani fami", "A major literary debut that explores class, culture, power, and desire among the ruling and servant classes of Pakistan.", "In the spirit of Joyce's Dubliners and Turgenev's A Sportsman's Sketches, Daniyal Mueenuddin's collection of linked stories illuminates a place and a people through an examination of the entwined lives of landowners and their retainers on the Gurmani family farm in the countryside outside of Lahore, Pakistan. An aging feudal landlord's household staff, the villagers who depend on his favor, and a network of relations near and far who have sought their fortune in the cities confront the advantages and constraints of station, the dissolution of old ways, and the shock of change. ", "Mueenuddin bares—at times humorously, at times tragically—the complexities of Pakistani class and culture and presents a vivid picture of a time and a place, of the old powers and the new, as the Pakistani feudal order is undermined and transformed."], "author": "Daniyal Mueenuddin", "num_pages": "247", "awards": ["Pulitzer Prize Nominee for Fiction (2010)", "O. Henry Award for 'A Spoiled Man' (2010)", "Rosenthal Family Foundation Award (2010)", "The Story Prize (2009)", "The Royal Society of Literature Ondaatje Prize Nominee (2010)", "Commonwealth Writers' Prize for Best First Book in South Asia and Europe (2010)", "National Book Award Finalist for Fiction (2009)", "DSC Prize Nominee for South Asian Literature  for Longlist (2011)"], "places": ["Pakistan"], "character_names": [], "language": "English", "publish_date": "2009-01-05 00:00:00", "ISBN": "0393068005"},
{"url": "https://www.goodreads.com/book/show/9632002-raja-gidh", "num_ratings": "1,778", "num_reviews": "125", "avg_ratings": 4.2, "genres": ["Cultural", "Pakistan", "Philosophy", "Fiction"], "title": "Raja Gidh / راجه گدھ", "description": ["Raja Gidh (Urdu: راجه گدھ) by Bano Qudsia is one of the most widely read and acclaimed Urdu novels. Gidh is the Urdu word for a vulture and Raja is a Hindi synonym for king. The name anticipates the kingdom of vultures. In fact, parallel to the main plot of the novel, an allegorical story of such a kingdom is narrated. The metaphor of the vulture as an animal feeding mostl", "Raja Gidh (Urdu: راجه گدھ) by Bano Qudsia is one of the most widely read and acclaimed Urdu novels. Gidh is the Urdu word for a vulture and Raja is a Hindi synonym for king. The name anticipates the kingdom of vultures. In fact, parallel to the main plot of the novel, an allegorical story of such a kingdom is narrated. The metaphor of the vulture as an animal feeding mostly on the carcasses of dead animals is employed to portray the trespassing of ethical limits imposed by the society or by the religion.", "Bano Qudsia has written this novel drawing on the religious concept of Haraam and Halaal. Many readers tend to interpret Raja Gidh as a sermon, in which Bano Qudsia puts forth her theory of hereditary transmission of Haraam genes. Naturally the plot is woven to support the thesis. In the opinion of many readers and critics she manages to convince them that the pursuance of Haraam, be it financial, moral or emotional, results in the deterioration of a person's normality in some sense. She seems to suggest that the abnormality is transferred genetically to the next generation.", "Apart from the above implication the novel has many social, emotional and psychological aspects. The nostalgic narration of the historical Government College Lahore and of the Lawrence Garden Lahore lights upon the days of seventies and eighties.", "Bano Qudsia is among those Urdu writers who would think ten times before writing a sentence. But she does not sacrifice the flow of the narrative anywhere in this novel. Her characters are not black and white ones as some of the critics would like to suggest. Every sensitive reader who has attended a college or a university in a Pakistani setting is bound to find some similarities between themselves and one of the characters.", "Plot: Seemin Shah, hailing from an upper middle class family, falls in love with her handsome class fellow Aftab in the MA Sociology class at Government College Lahore. Seemin is a modern and attractive urban girl and attracts most of her male class fellows, including the narrator (abdul)Qayyum and the young liberal professor Suhail. Aftab belongs to a Kashmiri business family. Though he also loves her, he can not rise above his family values and succumbs to his parent's pressure to marry someone against his wishes and leave for London to look after his family business. Now the long story of separation begins."], "author": "Bano Qudsia", "num_pages": "564", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2015-08-16 00:00:00", "ISBN": "969350514X"},
{"url": "https://www.goodreads.com/book/show/40238.Cracking_India", "num_ratings": "3,898", "num_reviews": "234", "avg_ratings": 3.83, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Cultural", "Pakistan"], "title": "Cracking India", "description": ["The 1947 Partition of India is the backdrop for this powerful novel, narrated by a precocious child who describes the brutal transition with chilling veracity. Young Lenny Sethi is kept out of school because she suffers from polio. She spends her days with Ayah, her beautiful nanny, visiting with the large group of admirers that Ayah draws. It is in the company of these wo", "The 1947 Partition of India is the backdrop for this powerful novel, narrated by a precocious child who describes the brutal transition with chilling veracity. Young Lenny Sethi is kept out of school because she suffers from polio. She spends her days with Ayah, her beautiful nanny, visiting with the large group of admirers that Ayah draws. It is in the company of these working class characters that Lenny learns about religious differences, religious intolerance, and the blossoming genocidal strife on the eve of Partition. As she matures, Lenny begins to identify the differences between the Hindus, Moslems, and Sikhs engaging in political arguments all around her. Lenny enjoys a happy, privileged life in Lahore, but the kidnapping of her beloved Ayah signals a dramatic change. Soon Lenny’s world erupts in religious, ethnic, and racial violence. By turns hilarious and heartbreaking, the domestic drama serves as a microcosm for a profound political upheaval."], "author": "Bapsi Sidhwa", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-23 00:00:00", "ISBN": "1571310487"},
{"url": "https://www.goodreads.com/book/show/22814735-bullets-and-train", "num_ratings": "20", "num_reviews": "5", "avg_ratings": 4.5, "genres": ["Cultural", "Pakistan", "Thriller", "War", "Terrorism", "Thriller", "Spy Thriller"], "title": "Bullets and Train", "description": ["Bullets and Train is a fast paced action thriller that raises the critical issue of terrorism and explores the sentimental and environmental forces which trap an individual in this abyss. The novel grapples with the message that drone attacks give rise to anger, revenge and hate. And anything that fuels any of these emotions cannot really tackle terrorism. This novel also", "Bullets and Train is a fast paced action thriller that raises the critical issue of terrorism and explores the sentimental and environmental forces which trap an individual in this abyss. The novel grapples with the message that drone attacks give rise to anger, revenge and hate. And anything that fuels any of these emotions cannot really tackle terrorism. This novel also discusses the contributing factors to the recent surge in terrorism which continue to be illiteracy, joblessness and oppressive and corrupt regimes. ", "Bullets and Train is set in the backdrop of Afghan War. The Taliban and Al-Qaeda steal a tactical nuclear bomb and agencies of four countries have to work together to track it before it is used in a terrorist plot. A US soldier is kidnaped by the Taliban from Afghanistan and held captive in Pakistan. In the meanwhile a train is hijacked in Singapore as part of a mega-terrorist plot. ", "---------------------------********************--------------------------- ", "Review: ", "Pros: 1) Excellent Pace; 2) Wonderful Story; and 3) Told from a perspective based on ground realities ", "Cons: 1) English; and 2) English"], "author": "Adeerus Ghayan", "num_pages": "151", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/290384.Kartography", "num_ratings": "2,481", "num_reviews": "216", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Pakistan", "Historical", "Historical Fiction", "Romance", "Cultural", "Asia"], "title": "Kartography", "description": ["Raheen and her best friend, Karim, share an idyllic childhood in upper-class Karachi. Their parents were even once engaged to each others' partners until they rematched in what they call \"the fiancée swap.\" But as adolescence distances the friends, Karim takes refuge in maps while Raheen searches for the secret behind her parents' exchange. What she uncovers reveals not ju", "Raheen and her best friend, Karim, share an idyllic childhood in upper-class Karachi. Their parents were even once engaged to each others' partners until they rematched in what they call \"the fiancée swap.\" But as adolescence distances the friends, Karim takes refuge in maps while Raheen searches for the secret behind her parents' exchange. What she uncovers reveals not just a family's but a country's turbulent history-and a grown-up Raheen and Karim are caught between strained friendship and fated love. ", "A love story with a family mystery at its heart, Kartography is a dazzling novel by a young writer of astonishing maturity and exhilarating style. Shamsie transports us to a world we have not often seen in fiction-vibrant, dangerous, sensuous Pakistan. But even as she takes us far from the familiar, her story of passion and family secrets rings universally true. "], "author": "Kamila Shamsie", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-07 00:00:00", "ISBN": "0156029731"},
{"url": "https://www.goodreads.com/book/show/88815.The_Reluctant_Fundamentalist", "num_ratings": "47,164", "num_reviews": "5,233", "avg_ratings": 3.69, "genres": ["Fiction", "Cultural", "Pakistan", "Contemporary"], "title": "The Reluctant Fundamentalist", "description": ["At a café table in Lahore, a bearded Pakistani man converses with an uneasy American stranger. As dusk deepens to night, he begins the tale that has brought them to this fateful encounter…", "Changez is living an immigrant's dream of America. At the top of his class at Princeton, he is snapped up by an elite valuation firm. He thrives on the energy of New York, and his budding", "At a café table in Lahore, a bearded Pakistani man converses with an uneasy American stranger. As dusk deepens to night, he begins the tale that has brought them to this fateful encounter…", "Changez is living an immigrant's dream of America. At the top of his class at Princeton, he is snapped up by an elite valuation firm. He thrives on the energy of New York, and his budding romance with elegant, beautiful Erica promises entry into Manhattan society at the same exalted level once occupied by his own family back in Lahore.", "But in the wake of September 11, Changez finds his position in his adopted city suddenly overturned, and his relationship with Erica shifting. And Changez's own identity is in seismic shift as well, unearthing allegiances more fundamental than money, power, and maybe even love. ", "\"Extreme times call for extreme reactions, extreme writing. Hamid has done something extraordinary with this novel.\" —Washington Post", "\"One of those achingly assured novels that makes you happy to be a reader.\" —Junot Diaz ", "\"Brief, charming, and quietly furious . . . a resounding success.\" —Village Voice ", "A Washington Post and San Francisco Chronicle Best Book of the Year ", "A New York Times Notable Book"], "author": "Mohsin Hamid", "num_pages": "184", "awards": ["Man Booker Prize Nominee (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2007)", "Anisfield-Wolf Book Award (2008)", "Ambassador Book Award for Fiction (2008)"], "places": [], "character_names": ["Changez", "Érica"], "language": "English", "publish_date": "2007-04-03 00:00:00", "ISBN": "0151013047"},
{"url": "https://www.goodreads.com/book/show/5997064-a-case-of-exploding-mangoes", "num_ratings": "7,947", "num_reviews": "844", "avg_ratings": 3.73, "genres": ["Fiction", "Cultural", "Pakistan", "Historical", "Historical Fiction", "Humor"], "title": "A Case of Exploding Mangoes", "description": ["A military dictator reads the Quran every morning as if it was his daily horoscope.", "Under Officer Ali Shigri carries a deadly message on the tip of his sword.", "His friend Obaid answers all life’s questions with a splash of eau de cologne and a quote from Rilke.", "A crow has crossed the Pakistani border illegally.", "As young Shigri moves from a mosque hall to his military barracks b", "A military dictator reads the Quran every morning as if it was his daily horoscope.", "Under Officer Ali Shigri carries a deadly message on the tip of his sword.", "His friend Obaid answers all life’s questions with a splash of eau de cologne and a quote from Rilke.", "A crow has crossed the Pakistani border illegally.", "As young Shigri moves from a mosque hall to his military barracks before ending up in aMughal dungeon, there are questions that haunt him: What does it mean to betray someone and still love them? How many names does Allah really have? Who killed his father, Colonel Shigri? Who will kill his killers? And where the hell has Obaid disappeared to?", "Teasing, provocative, and very funny, Mohammed Hanif’s debut novel takes one of the subcontinent’s enduring mysteries and out if it spins a tale as rich and colourful as a beggar’s dream."], "author": "Mohammed Hanif", "num_pages": "297", "awards": ["Man Booker Prize Nominee for Longlist (2008)", "Guardian First Book Award Nominee (2008)", "James Tait Black Memorial Prize Nominee for Fiction (2008)", "Commonwealth Writers' Prize for Best First Book Overall (2009)", "Shakti Bhatt First Book Prize (2008)", "Corine Internationaler Buchpreis for Belletristik (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-16 00:00:00", "ISBN": "8184000382"}
]