[
{"url": "https://www.goodreads.com/book/show/27969087-labyrinth-lost", "num_ratings": "6,327", "num_reviews": "1,683", "avg_ratings": 3.76, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fantasy", "Paranormal", "Fiction"], "title": "Labyrinth Lost", "description": ["Alex is a bruja, the most powerful witch in a generation…and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo she can’t trust, but who may be Alex’s only chance at saving her family", "Alex is a bruja, the most powerful witch in a generation…and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo she can’t trust, but who may be Alex’s only chance at saving her family."], "author": "Zoraida Córdova", "num_pages": "324", "awards": [], "places": ["Los Lagos realm, Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2017-08-01 00:00:00", "ISBN": "1492623164"},
{"url": "https://www.goodreads.com/book/show/36142487-anger-is-a-gift", "num_ratings": "739", "num_reviews": "301", "avg_ratings": 4.19, "genres": ["Young Adult", "Contemporary", "Lgbt", "Fiction"], "title": "Anger Is a Gift", "description": ["Six years ago, Moss Jefferies' father was murdered by an Oakland police officer. Along with losing a parent, the media's vilification of his father and lack of accountability has left Moss with near c", "Six years ago, Moss Jefferies' father was murdered by an Oakland police officer. Along with losing a parent, the media's vilification of his father and lack of accountability has left Moss with near crippling panic attacks.", "Now, in his sophomore year of high school, Moss and his fellow classmates find themselves increasingly treated like criminals by their own school. New rules. Random locker searches. Constant intimidation and Oakland Police Department stationed in their halls. Despite their youth, the students decide to organize and push back against the administration.", "When tensions hit a fever pitch and tragedy strikes, Moss must face a difficult choice: give in to fear and hate or realize that anger can actually be a gift."], "author": "Mark Oshiro", "num_pages": "463", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-05-22 00:00:00", "ISBN": "1250167027"},
{"url": "https://www.goodreads.com/book/show/35711156-let-s-talk-about-love", "num_ratings": "2,399", "num_reviews": "853", "avg_ratings": 3.93, "genres": ["Young Adult", "Contemporary", "Romance", "Lgbt"], "title": "Let's Talk About Love", "description": ["Alice had her whole summer planned. Nonstop all-you-can-eat buffets while marathoning her favorite TV shows (best friends totally included) with the smallest dash of adulting—working at the library to pay her share of the rent. The only thing missing from her perfect plan? Her girlfriend (who ended things when Alice confessed she's asexual). Alice is done with dating—no th", "Alice had her whole summer planned. Nonstop all-you-can-eat buffets while marathoning her favorite TV shows (best friends totally included) with the smallest dash of adulting—working at the library to pay her share of the rent. The only thing missing from her perfect plan? Her girlfriend (who ended things when Alice confessed she's asexual). Alice is done with dating—no thank you, do not pass go, stick a fork in her, done.", "But then Alice meets Takumi and she can’t stop thinking about him or the rom com-grade romance feels she did not ask for (uncertainty, butterflies, and swoons, oh my!).", "When her blissful summer takes an unexpected turn and Takumi becomes her knight with a shiny library-employee badge (close enough), Alice has to decide if she’s willing to risk their friendship for a love that might not be reciprocated—or understood."], "author": "Claire Kann", "num_pages": "284", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-01-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/29904219-not-your-sidekick", "num_ratings": "3,111", "num_reviews": "706", "avg_ratings": 3.93, "genres": ["Young Adult", "Lgbt", "Fantasy", "Science Fiction"], "title": "Not Your Sidekick", "description": ["Welcome to Andover… where superpowers are common, but internships are complicated. Just ask high school nobody, Jessica Tran. Despite her heroic lineage, Jess is resigned to a life without superpowers and is merely looking to beef-up her college applications when she stumbles upon the perfect (paid!) internship—only it turns out to be for the town’s most heinous supervilla", "Welcome to Andover… where superpowers are common, but internships are complicated. Just ask high school nobody, Jessica Tran. Despite her heroic lineage, Jess is resigned to a life without superpowers and is merely looking to beef-up her college applications when she stumbles upon the perfect (paid!) internship—only it turns out to be for the town’s most heinous supervillain. On the upside, she gets to work with her longtime secret crush, Abby, who Jess thinks may have a secret of her own. Then there’s the budding attraction to her fellow intern, the mysterious “M,” who never seems to be in the same place as Abby. But what starts as a fun way to spite her superhero parents takes a sudden and dangerous turn when she uncovers a plot larger than heroes and villains altogether."], "author": "C.B. Lee", "num_pages": "283", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-08 00:00:00", "ISBN": "1945053038"},
{"url": "https://www.goodreads.com/book/show/37569318-empress-of-all-seasons", "num_ratings": "78", "num_reviews": "58", "avg_ratings": 4.23, "genres": ["Fantasy", "Young Adult"], "title": "Empress of All Seasons", "description": ["Each generation, a competition is held to find the next empress of Honoku. The rules are simple. Survive the palace’s enchanted seasonal rooms. Conquer Winter, Spring, Summer, and Fall. Marry the prince. All are eligible to compete—all except yōkai, supernatural monsters and spirits whom the human emperor is determined to", "Each generation, a competition is held to find the next empress of Honoku. The rules are simple. Survive the palace’s enchanted seasonal rooms. Conquer Winter, Spring, Summer, and Fall. Marry the prince. All are eligible to compete—all except yōkai, supernatural monsters and spirits whom the human emperor is determined to enslave and destroy. ", "Mari has spent a lifetime training to become empress. Winning should be easy. And it would be, if she weren't hiding a dangerous secret. Mari is a yōkai with the ability to transform into a terrifying monster. If discovered, her life will be forfeit. As she struggles to keep her true identity hidden, Mari’s fate collides with that of Taro, the prince who has no desire to inherit the imperial throne, and Akira, a half-human, half-yōkai outcast.", "Torn between duty and love, loyalty and betrayal, vengeance and forgiveness, the choices of Mari, Taro, and Akira will decide the fate of Honoku in this beautifully written, edge-of-your-seat YA fantasy."], "author": "Emiko Jean", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": null, "ISBN": "0544530942"},
{"url": "https://www.goodreads.com/book/show/32718027-the-city-of-brass", "num_ratings": "11,009", "num_reviews": "2,434", "avg_ratings": 4.2, "genres": ["Fantasy", "Historical", "Historical Fiction", "Young Adult", "Historical"], "title": "The City of Brass", "description": ["Nahri has never believed in magic. Certainly, she has power; on the streets of 18th century Cairo, she’s a con woman of unsurpassed talent. But she knows better than anyone that the trade she uses to get by—palm readings, zars, healings—are all tricks, sleights of hand, learned skills; a means to the delightful end of swindling Ottoman nobles. ", "But when Nahri accidentally s", "Nahri has never believed in magic. Certainly, she has power; on the streets of 18th century Cairo, she’s a con woman of unsurpassed talent. But she knows better than anyone that the trade she uses to get by—palm readings, zars, healings—are all tricks, sleights of hand, learned skills; a means to the delightful end of swindling Ottoman nobles. ", "But when Nahri accidentally summons an equally sly, darkly mysterious djinn warrior to her side during one of her cons, she’s forced to accept that the magical world she thought only existed in childhood stories is real. For the warrior tells her a new tale: across hot, windswept sands teeming with creatures of fire, and rivers where the mythical marid sleep; past ruins of once-magnificent human metropolises, and mountains where the circling hawks are not what they seem, lies Daevabad, the legendary city of brass, a city to which Nahri is irrevocably bound. ", "In that city, behind gilded brass walls laced with enchantments, behind the six gates of the six djinn tribes, old resentments are simmering. And when Nahri decides to enter this world, she learns that true power is fierce and brutal. That magic cannot shield her from the dangerous web of court politics. That even the cleverest of schemes can have deadly consequences. ", "After all, there is a reason they say be careful what you wish for..."], "author": "S.A. Chakraborty", "num_pages": "533", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-11-14 00:00:00", "ISBN": "0062678108"},
{"url": "https://www.goodreads.com/book/show/30223025-dread-nation", "num_ratings": "5,139", "num_reviews": "1,455", "avg_ratings": 4.23, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fantasy", "Horror", "Horror", "Zombies", "Historical"], "title": "Dread Nation", "description": ["Jane McKeene was born two days before the dead began to walk the battlefields of Gettysburg and Chancellorsville—derailing the War Between the States and changing America forever. In this new nation, safety for all depends on the work of a few, and laws like the Native and Negro Reeducation Act require certain children attend combat schools to learn to put down the dead. B", "Jane McKeene was born two days before the dead began to walk the battlefields of Gettysburg and Chancellorsville—derailing the War Between the States and changing America forever. In this new nation, safety for all depends on the work of a few, and laws like the Native and Negro Reeducation Act require certain children attend combat schools to learn to put down the dead. But there are also opportunities—and Jane is studying to become an Attendant, trained in both weaponry and etiquette to protect the well-to-do. It’s a chance for a better life for Negro girls like Jane. After all, not even being the daughter of a wealthy white Southern woman could save her from society’s expectations.", "But that’s not a life Jane wants. Almost finished with her education at Miss Preston’s School of Combat in Baltimore, Jane is set on returning to her Kentucky home and doesn’t pay much mind to the politics of the eastern cities, with their talk of returning America to the glory of its days before the dead rose. But when families around Baltimore County begin to go missing, Jane is caught in the middle of a conspiracy, one that finds her in a desperate fight for her life against some powerful enemies. And the restless dead, it would seem, are the least of her problems."], "author": "Justina Ireland", "num_pages": "455", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-04-03 00:00:00", "ISBN": "0062570609"},
{"url": "https://www.goodreads.com/book/show/37771077-warcross", "num_ratings": "38,061", "num_reviews": "8,400", "avg_ratings": 4.21, "genres": ["Young Adult", "Science Fiction", "Fantasy"], "title": "Warcross", "description": ["When a game called Warcross takes the world by storm, one girl hacks her way into its dangerous depths. For the millions who log in every day, Warcross isn't just a game—it's a way of life. Struggling to make ends meet, teenage hacker Emika Chen works as a bounty hunter, tracking down players who bet on the game illegally. When Emika hacks into the game illegally, she's co", "When a game called Warcross takes the world by storm, one girl hacks her way into its dangerous depths. For the millions who log in every day, Warcross isn't just a game—it's a way of life. Struggling to make ends meet, teenage hacker Emika Chen works as a bounty hunter, tracking down players who bet on the game illegally. When Emika hacks into the game illegally, she's convinced she'll be arrested, and is shocked when she gets a call from the game's creator, the elusive young billionaire Hideo Tanaka, with an irresistible offer. He needs a spy on the inside of this year's tournament in order to uncover a security problem ... and he wants Emika for the job. In this sci-fi thriller, #1 ", " bestselling author Marie Lu conjures an immersive, exhilarating world where choosing who to trust may be the biggest gamble of all."], "author": "Marie Lu", "num_pages": "402", "awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2017)"], "places": [], "character_names": ["Emika Chen", "Hideo Tanaka", "Zero"], "language": "English", "ISBN": "0241321441"},
{"url": "https://www.goodreads.com/book/show/25798596-coal", "num_ratings": "222", "num_reviews": "51", "avg_ratings": 3.88, "genres": ["Fantasy", "Young Adult", "Paranormal", "Fairies"], "title": "Coal", "description": ["Coal has lived most of his life in the fey realm with his elven best friend, but when a human child he promised to protect unintentionally breaks a law in front of the fey elite, he will have to choose between betraying his best friend or saving the child’s life."], "author": "Constance Burris", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-11 00:00:00", "ISBN": "1508912645"},
{"url": "https://www.goodreads.com/book/show/13453104-the-summer-prince", "num_ratings": "4,253", "num_reviews": "840", "avg_ratings": 3.59, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fantasy", "Romance"], "title": "The Summer Prince", "description": ["The lush city of Palmares Tres shimmers with tech and tradition, with screaming gossip casters and practiced politicians. In the midst of this vibrant metropolis, June Costa creates art that's sure to make her legendary. But her dreams of fame become something more when she meets Enki, the bold new Summer King. The whole city falls in love with him including June's best fr", "The lush city of Palmares Tres shimmers with tech and tradition, with screaming gossip casters and practiced politicians. In the midst of this vibrant metropolis, June Costa creates art that's sure to make her legendary. But her dreams of fame become something more when she meets Enki, the bold new Summer King. The whole city falls in love with him including June's best friend, Gil. But June sees more to Enki than amber eyes and a lethal samba. She sees a fellow artist.", "Together, June and Enki will stage explosive, dramatic projects that Palmares Tres will never forget. They will add fuel to a growing rebellion against the governments strict limits on new tech. And June will fall deeply, unfortunately in love with Enki. Because like all Summer Kings before him, Enki is destined to die."], "author": "Alaya Dawn Johnson", "num_pages": "289", "awards": ["National Book Award Nominee for Young People’s Literature (2013)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2013)", "Cybils Award for Young Adult Speculative Fiction (2013)", "James Tiptree Jr. Award Honor List (2013)"], "places": ["Palmares Três", "Brazil"], "character_names": ["June Costa"], "language": "English", "publish_date": "2013-03-01 00:00:00", "ISBN": "0545417791"},
{"url": "https://www.goodreads.com/book/show/22609306-signal-to-noise", "num_ratings": "1,643", "num_reviews": "402", "avg_ratings": 3.71, "genres": ["Fantasy", "Fiction", "Magical Realism", "Young Adult", "Music", "Fantasy", "Urban Fantasy"], "title": "Signal to Noise", "description": ["A literary fantasy about love, music and sorcery, set against the background of Mexico City.", "Mexico City, 1988: Long before iTunes or MP3s, you said “I love you” with a mixtape. Meche, awkward and fifteen, has two equally unhip friends -- Sebastian and Daniela -- and a whole lot of vinyl records to keep her compa", "A literary fantasy about love, music and sorcery, set against the background of Mexico City.", "Mexico City, 1988: Long before iTunes or MP3s, you said “I love you” with a mixtape. Meche, awkward and fifteen, has two equally unhip friends -- Sebastian and Daniela -- and a whole lot of vinyl records to keep her company. When she discovers how to cast spells using music, the future looks brighter for the trio. With help from this newfound magic, the three friends will piece together their broken families, change their status as non-entities, and maybe even find love... ", " Mexico City, 2009: Two decades after abandoning the metropolis, Meche returns for her estranged father’s funeral. It’s hard enough to cope with her family, but then she runs into Sebastian, and it revives memories from her childhood she thought she buried a long time ago. What really happened back then? What precipitated the bitter falling out with her father? And, is there any magic left?"], "author": "Silvia Moreno-Garcia", "num_pages": "272", "awards": ["Locus Award Nominee for Best First Novel (2016)", "Sunburst Award Nominee for Novel (2016)", "British Fantasy Award Nominee for Novel (2016)", "Prix Aurora Award Nominee for Novel (2016)", "Copper Cylinder Award (2016)"], "places": ["Mexico City (México City)"], "character_names": [], "language": "English", "publish_date": "2015-02-10 00:00:00", "ISBN": "1781082995"},
{"url": "https://www.goodreads.com/book/show/28220785-certain-dark-things", "num_ratings": "1,564", "num_reviews": "447", "avg_ratings": 3.67, "genres": ["Fantasy", "Horror", "Paranormal", "Vampires", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Fiction", "Adult", "Young Adult"], "title": "Certain Dark Things", "description": ["Welcome to Mexico City… An Oasis In A Sea Of Vampires…", "Domingo, a lonely garbage-collecting street kid, is busy eking out a living when a jaded vampire on the run swoops into his life.", "Atl, the descendant of Aztec blood drinkers, must feast on the young to survive and Domingo looks especially tasty. Smart, beautiful, and dangerous, Atl needs to escape to South America, far f", "Welcome to Mexico City… An Oasis In A Sea Of Vampires…", "Domingo, a lonely garbage-collecting street kid, is busy eking out a living when a jaded vampire on the run swoops into his life.", "Atl, the descendant of Aztec blood drinkers, must feast on the young to survive and Domingo looks especially tasty. Smart, beautiful, and dangerous, Atl needs to escape to South America, far from the rival narco-vampire clan pursuing her. Domingo is smitten.", "Her plan doesn’t include developing any real attachment to Domingo. Hell, the only living creature she loves is her trusty Doberman. Little by little, Atl finds herself warming up to the scrappy young man and his effervescent charm.", "And then there’s Ana, a cop who suddenly finds herself following a trail of corpses and winds up smack in the middle of vampire gang rivalries.", "Vampires, humans, cops, and gangsters collide in the dark streets of Mexico City. Do Atl and Domingo even stand a chance of making it out alive?"], "author": "Silvia Moreno-Garcia", "num_pages": "336", "awards": ["Locus Award Nominee for Best Horror Novel (2017)", "Sunburst Award Nominee for Novel (2017)"], "places": ["Mexico City (México City)"], "character_names": [], "language": "English", "publish_date": "2016-10-25 00:00:00", "ISBN": "1250099080"},
{"url": "https://www.goodreads.com/book/show/17697565-the-memory-key", "num_ratings": "584", "num_reviews": "119", "avg_ratings": 3.26, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia"], "title": "The Memory Key", "description": ["In a five-minutes-into-the-future world, a bereaved daughter must choose between losing memories of her mother to the haze of time and the reality-distorting, visceral pain of complete, perfect recall.", "Lora Mint is determined not to forget.", "Though her mother’s been dead for five years, Lora struggles to remember every detail about her—most importantly, the specific events th", "In a five-minutes-into-the-future world, a bereaved daughter must choose between losing memories of her mother to the haze of time and the reality-distorting, visceral pain of complete, perfect recall.", "Lora Mint is determined not to forget.", "Though her mother’s been dead for five years, Lora struggles to remember every detail about her—most importantly, the specific events that occurred the night she sped off in her car, never to return.", "But in a world ravaged by Vergets disease, a viral form of Alzheimer’s, that isn’t easy. Usually Lora is aided by her memory key, a standard-issue chip embedded in her brain that preserves memories just the way a human brain would. Then a minor accident damages Lora’s key, and her memories go haywire. Suddenly Lora remembers a moment from the night of her mother’s disappearance that indicates her death was no accident. Can she trust these formerly forgotten memories? Or is her ability to remember every painful part of her past driving her slowly mad—burying the truth forever? Lora’s longing for her lost mother and journey to patch up her broken memories is filled with authentic and poignant emotion. Her race to uncover the truth is a twisty ride. ", "In the end, Liana Liu’s story will spark topical conversations about memory and privacy in a world that is reliant on increasingly invasive forms of technology."], "author": "Liana Liu", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-03 00:00:00", "ISBN": "0062306642"},
{"url": "https://www.goodreads.com/book/show/3021244-rogelia-s-house-of-magic", "num_ratings": "69", "num_reviews": "20", "avg_ratings": 3.51, "genres": ["Fantasy", "Young Adult", "Paranormal", "Witches", "Young Adult", "Teen"], "title": "Rogelia's House of Magic", "description": ["IN ", "three different 15-year-old girls find friendship and special powers as they are trained in the ways of the curandera by a wise old woman.", "When Rogelia becomes a maid at Marina Peralta’s home, it’s obvious to Marina and her friend Fern that they have a real mystic on their hands. Soon Rogelia agrees to teach the girls the magic of their ancestor", "IN ", "three different 15-year-old girls find friendship and special powers as they are trained in the ways of the curandera by a wise old woman.", "When Rogelia becomes a maid at Marina Peralta’s home, it’s obvious to Marina and her friend Fern that they have a real mystic on their hands. Soon Rogelia agrees to teach the girls the magic of their ancestors, much as she taught her granddaughters, Xochitl and Gracielia. Even though Marina and Fern are thrilled to have this chance to understand and use their powers, Xochitl isn’t happy about sharing such a sacred thing with anyone but her sister, who perished in a car accident. Besides, magic has let Xochitl down before. Why wouldn’t it now? But, as the girls will eventually discover, at Rogelia’s House of Magic anything is possible."], "author": "Jamie Martinez Wood", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-10 00:00:00", "ISBN": "0385734778"},
{"url": "https://www.goodreads.com/book/show/1190695.The_Night_Wanderer", "num_ratings": "354", "num_reviews": "81", "avg_ratings": 3.44, "genres": ["Fantasy", "Young Adult", "Paranormal", "Vampires", "Fiction", "Horror", "Cultural", "Canada"], "title": "The Night Wanderer", "description": ["Nothing ever happens on the Otter Lake reservation. But when 16-year-old Tiffany discovers her father is renting out her room, she’s deeply upset. Sure, their guest is polite and keeps to himself, but he’s also a little creepy. Little do Tiffany, her father, or even her astute Granny Ruth suspect the truth. The mysterious Pierre L’Errant is actually a vampire, returning to", "Nothing ever happens on the Otter Lake reservation. But when 16-year-old Tiffany discovers her father is renting out her room, she’s deeply upset. Sure, their guest is polite and keeps to himself, but he’s also a little creepy. Little do Tiffany, her father, or even her astute Granny Ruth suspect the truth. The mysterious Pierre L’Errant is actually a vampire, returning to his tribal home after centuries spent in Europe. But Tiffany has other things on her mind: her new boyfriend is acting weird, disputes with her father are escalating, and her estranged mother is starting a new life with somebody else. Fed up and heartsick, Tiffany threatens drastic measures and flees into the bush. There, in the midnight woods, a chilling encounter with L’Errant changes everything ... for both of them. A mesmerizing blend of Gothic thriller and modern coming-of-age novel, The Night Wanderer is unlike any other vampire story."], "author": "Drew Hayden Taylor", "num_pages": "215", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1554510996"},
{"url": "https://www.goodreads.com/book/show/6400940-city-of-fire", "num_ratings": "353", "num_reviews": "65", "avg_ratings": 3.56, "genres": ["Fantasy", "Young Adult", "Fantasy", "Dragons", "Childrens", "Middle Grade", "Adventure", "Fantasy", "Mythology", "Fiction", "Science Fiction", "Alternate History"], "title": "City of Fire", "description": ["Sure to appeal to fans of Rick Riordan and Eoin Colfer, this action-packed tale takes readers on an unforgettable journey through an alternate version of our world in 1941—a world filled with magical beings such as dragons in human form, tiny “lap griffins,” reincarnation", "Sure to appeal to fans of Rick Riordan and Eoin Colfer, this action-packed tale takes readers on an unforgettable journey through an alternate version of our world in 1941—a world filled with magical beings such as dragons in human form, tiny “lap griffins,” reincarnations of legendary Chinese warriors, Japanese folk creatures, and goddesses in disguise.", "When her older sister dies trying to prevent the theft of one of her people’s great treasures, twelve-year-old Scirye sets out to avenge her and recover the precious item. Helping her are Bayang, a dragon disguised as a Pinkerton agent; Leech, a boy with powers he has not yet discovered; and Leech’s loyal companion Koko, who has a secret of his own. All have a grudge against the thieves who stole the treasure: the evil dragon Badik and the mysterious Mr. Roland.", "Scirye and her companions pursue the thieves to Houlani, a new Hawaiian island being created by magic. There, they befriend Pele, the volatile and mercurial goddess of volcanoes. But even with Pele on their side, they may not be able to stop Mr. Roland from gaining what he seeks: the Five Lost Treasures of Emperor Yu. Together, the treasures will give him the power to alter the very fabric of the universe."], "author": "Laurence Yep", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0765319241"},
{"url": "https://www.goodreads.com/book/show/11737310-the-girl-with-borrowed-wings", "num_ratings": "919", "num_reviews": "170", "avg_ratings": 4.06, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Paranormal", "Fiction", "Paranormal", "Angels"], "title": "The Girl with Borrowed Wings", "description": ["A stunningly written tale of an isolated girl and the shape-shifting boy who shows her what freedom could be--if only she has the courage to take it ", "Controlled by her father and bound by desert, Frenenqer Paje’s life is tediously the same, until a small act of rebellion explodes her world and she meets a boy, but not just a boy--a Free person, a winged person, a shape-shif", "A stunningly written tale of an isolated girl and the shape-shifting boy who shows her what freedom could be--if only she has the courage to take it ", "Controlled by her father and bound by desert, Frenenqer Paje’s life is tediously the same, until a small act of rebellion explodes her world and she meets a boy, but not just a boy--a Free person, a winged person, a shape-shifter. He has everything Frenenqer doesn’t. No family, no attachments, no rules. At night, he flies them to the far-flung places of their childhoods to retrace their pasts. But when the delicate balance of their friendship threatens to rupture into something more, Frenenqer must confront her isolation, her father, and her very sense of identity, breaking all the rules of her life to become free."], "author": "Rinsai  Rossetti", "num_pages": "290", "awards": ["Monica Hughes Award for Science Fiction and Fantasy Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-19 00:00:00", "ISBN": "0803735669"},
{"url": "https://www.goodreads.com/book/show/7118768-ninth-ward", "num_ratings": "5,204", "num_reviews": "850", "avg_ratings": 3.98, "genres": ["Historical", "Historical Fiction", "Childrens", "Middle Grade", "Young Adult", "Cultural", "African American", "Realistic Fiction", "Fiction", "Childrens"], "title": "Ninth Ward", "description": [" Twelve-year-old Lanesha lives in a tight-knit community in New Orleans' Ninth Ward. She doesn't have a fancy house like her uptown family or lots of friends like the other kids on her street. But what she does", " Twelve-year-old Lanesha lives in a tight-knit community in New Orleans' Ninth Ward. She doesn't have a fancy house like her uptown family or lots of friends like the other kids on her street. But what she does have is Mama Ya-Ya, her fiercely loving caretaker, wise in the ways of the world and able to predict the future. So when Mama Ya-Ya's visions show a powerful hurricane--Katrina--fast approaching, it's up to Lanesha to call upon the hope and strength Mama Ya-Ya has given her to help them both survive the storm.", "From the ", "bestselling author of ", "and ", ",", " is a deeply emotional story about transformation and a celebration of resilience, friendship, and family--as only love can define it."], "author": "Jewell Parker Rhodes", "num_pages": "217", "awards": ["Jane Addams Children's Book Award Nominee for Older Children (2011)", "Dorothy Canfield Fisher Children's Book Award Nominee (2012)", "Coretta Scott King Award for Author Honor (2011)", "Judy Lopez Memorial Award for Children's Literature Nominee (2011)", "Goodreads Choice Award Nominee (2010)", "Rebecca Caudill Young Readers' Book Award Nominee (2013)"], "places": ["New Orleans, Louisiana"], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "0316043079"},
{"url": "https://www.goodreads.com/book/show/12363795-living-violet", "num_ratings": "1,274", "num_reviews": "223", "avg_ratings": 3.93, "genres": ["Young Adult", "Fantasy", "Paranormal", "Romance", "Fantasy", "Romance", "Paranormal Romance", "Paranormal", "Demons"], "title": "Living Violet", "description": ["He's persuasive, charming, and way too mysterious. And for Samara Marshall, her co-worker is everything she wants most--and everything she most fears. . .", "Samara Marshall is determined to make the summer before her senior year the best ever. Her plan: enjoy downtime with friends and work to save up cash for her dream car. Summer romance is not on her to-do list, but uncover", "He's persuasive, charming, and way too mysterious. And for Samara Marshall, her co-worker is everything she wants most--and everything she most fears. . .", "Samara Marshall is determined to make the summer before her senior year the best ever. Her plan: enjoy downtime with friends and work to save up cash for her dream car. Summer romance is not on her to-do list, but uncovering the truth about her flirtatious co-worker, Caleb Baker, is. From the peculiar glow to his eyes to the unfortunate events that befall the girls who pine after him, Samara is the only one to sense danger behind his smile.", "But Caleb's secrets are drawing Samara into a world where the laws of attraction are a means of survival. And as a sinister power closes in on those she loves, Samara must take a risk that will change her life forever. . .or consume it."], "author": "Jaime Reed", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-27 00:00:00", "ISBN": "0758269242"},
{"url": "https://www.goodreads.com/book/show/2238575.Invisible_Touch", "num_ratings": "184", "num_reviews": "42", "avg_ratings": 4.03, "genres": ["Young Adult", "Mystery", "Fantasy", "Paranormal", "Fantasy", "Young Adult", "High School", "Young Adult", "Teen", "Fiction", "Romance"], "title": "Invisible Touch", "description": ["Kara Martinez has been trying to be \"normal\" ever since the accident that took her father's life when she was eleven years old. She's buried the caliente side of her Mexican heritage with her father and tried to be the girl her rigid mother wants her to be -- compliant and dressed in pink, and certainly not acting out like her older brother Jason. Not even Danielle, her be", "Kara Martinez has been trying to be \"normal\" ever since the accident that took her father's life when she was eleven years old. She's buried the caliente side of her Mexican heritage with her father and tried to be the girl her rigid mother wants her to be -- compliant and dressed in pink, and certainly not acting out like her older brother Jason. Not even Danielle, her best friend at Valdez High, has seen the real Kara; only those who read her anonymous blog know the deepest secrets of the Sign Seer. "], "author": "Kelly Parra", "num_pages": "288", "awards": [], "places": ["United States of America"], "character_names": ["Kara Martinez", "Anthony Garcia"], "language": "English", "publish_date": "2008-10-14 00:00:00", "ISBN": "1416563377"},
{"url": "https://www.goodreads.com/book/show/182269.The_Legend_of_Tarik", "num_ratings": "109", "num_reviews": "11", "avg_ratings": 3.56, "genres": ["Fantasy", "Young Adult", "Fiction"], "title": "The Legend of Tarik", "description": ["After witnessing the annihilation of his people by El Muerte's legions, young Tarik undergoes the training which will enable him to destroy this fierce leader."], "author": "Walter Dean Myers", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-12-12 00:00:00", "ISBN": "0590444263"},
{"url": "https://www.goodreads.com/book/show/64380.47", "num_ratings": "1,451", "num_reviews": "293", "avg_ratings": 3.71, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fantasy", "Fiction", "Historical", "Cultural", "African American"], "title": "47", "description": ["Mosley deftly weaves historical and speculative fiction into a powerful narrative about the nature of freedom.", "A gripping Young Adult fiction debut by bestselling author Walter Mosley.", "Walter Mosley is one of the best known writers in America. In his first book for young adults, Mosley deftly weaves historical and speculative fiction into a powerful narrative about the natur", "Mosley deftly weaves historical and speculative fiction into a powerful narrative about the nature of freedom.", "A gripping Young Adult fiction debut by bestselling author Walter Mosley.", "Walter Mosley is one of the best known writers in America. In his first book for young adults, Mosley deftly weaves historical and speculative fiction into a powerful narrative about the nature of freedom. 47 is a young slave boy living under the watchful eye of a brutal slave master. His life seems doomed until he meets a mysterious run-away slave, Tall John. Then 47 finds himself swept up in a struggle for his own liberation."], "author": "Walter Mosley", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "0316016357"},
{"url": "https://www.goodreads.com/book/show/11831627-the-chaos", "num_ratings": "525", "num_reviews": "123", "avg_ratings": 3.09, "genres": ["Fantasy", "Young Adult", "Science Fiction", "Fiction", "Lgbt", "Fantasy", "Urban Fantasy"], "title": "The Chaos", "description": ["Sixteen-year-old Scotch struggles to fit in—at home she’s the perfect daughter, at school she’s provocatively sassy, and thanks to her mixed heritage, she doesn’t feel she belongs with the Caribbeans, whites, ", " blacks. And even more", "Sixteen-year-old Scotch struggles to fit in—at home she’s the perfect daughter, at school she’s provocatively sassy, and thanks to her mixed heritage, she doesn’t feel she belongs with the Caribbeans, whites, ", " blacks. And even more troubling, lately her skin is becoming covered in a sticky black substance that can’t be removed. While trying to cope with this creepiness, she goes out with her brother—and he disappears. A mysterious bubble of light just swallows him up, and Scotch has no idea how to find him. Soon, the Chaos that has claimed her brother affects the city at large, until it seems like everyone is turning into crazy creatures. Scotch needs to get to the bottom of this supernatural situation ASAP before the Chaos consumes everything she’s ever known—and she knows that the black shadowy entity that’s begun trailing her every move is probably not going to help.", "A blend of fantasy and Caribbean folklore, at its heart this tale is about identity and self acceptance—because only by acknowledging her imperfections can Scotch hope to save her brother."], "author": "Nalo Hopkinson", "num_pages": "256", "awards": ["Copper Cylinder Award for Adult (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-17 00:00:00", "ISBN": "1416954880"},
{"url": "https://www.goodreads.com/book/show/13345567-into-the-wise-dark", "num_ratings": "14", "num_reviews": "6", "avg_ratings": 3.86, "genres": ["Fantasy", "Young Adult", "Speculative Fiction"], "title": "Into the Wise Dark", "description": ["Time traveling Parminder--a.k.a. Pammi--must stop a power-hungry Able from the future from destroying the ancient city she visits, where Ables like her live freely. If she is unable to stop him, the city of Zanum vanishes forever, taking Pammi and all other Ables with it."], "author": "Neesha Meminger", "num_pages": "308", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-12 00:00:00", "ISBN": "0983158320"},
{"url": "https://www.goodreads.com/book/show/741524.Justice_and_Her_Brothers", "num_ratings": "174", "num_reviews": "13", "avg_ratings": 3.27, "genres": ["Fantasy", "Science Fiction", "Young Adult", "Fiction"], "title": "Justice and Her Brothers", "description": ["An eleven-year-old and her older twin brothers struggle to understand their supersensory powers."], "author": "Virginia Hamilton", "num_pages": "282", "awards": ["Coretta Scott King Award for Author Honor (1979)"], "places": [], "character_names": [], "language": "English", "publish_date": "1998-01-01 00:00:00", "ISBN": "0590362143"},
{"url": "https://www.goodreads.com/book/show/6319176-devil-s-kiss", "num_ratings": "4,640", "num_reviews": "566", "avg_ratings": 3.59, "genres": ["Young Adult", "Fantasy", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Paranormal", "Angels"], "title": "Devil's Kiss", "description": ["Billi SanGreal is facing her Ordeal. The last test before her initiation. But she hadn't expected this. Not killing a little kid. Billi is destined to follow her father into The Order and protect the masses from the Unholy. From the thousands of evil, tortured souls that prey on humanity."], "author": "Sarwat Chadda", "num_pages": "278", "awards": [], "places": ["London, England"], "character_names": [], "language": "English", "publish_date": "2009-05-01 00:00:00", "ISBN": "0141325879"},
{"url": "https://www.goodreads.com/book/show/17333258-adaptation", "num_ratings": "6,337", "num_reviews": "921", "avg_ratings": 3.62, "genres": ["Young Adult", "Science Fiction", "Lgbt", "Fiction", "Glbt", "Queer"], "title": "Adaptation", "description": ["Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of travelers are stranded.", "Among them are Reese and her debate team partner and longtime crush David, who are in Arizona when the disaster occurs. On their drive ho", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of travelers are stranded.", "Among them are Reese and her debate team partner and longtime crush David, who are in Arizona when the disaster occurs. On their drive home to San Francisco, along a stretch of empty highway in the middle of the Nevada night, a bird flies into their headlights. The car flips over. When they wake up in a military hospital, the doctor won't tell them what happened, where they are--or how they've been miraculously healed.", "Things become even stranger when Reese returns home. San Francisco feels like a different place with police enforcing curfew, hazmat teams collecting dead birds, and a strange presence that seems to be following her. When Reese unexpectedly collides with the beautiful Amber Gray, her search for the truth is forced in an entirely new direction-and threatens to expose a vast global conspiracy that the government has worked for decades to keep secret.", " is a bold contemporary science-fiction thriller from the acclaimed author of ", "."], "author": "Malinda Lo", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-03 00:00:00", "ISBN": "031619798X"},
{"url": "https://www.goodreads.com/book/show/30095464-the-bone-witch", "num_ratings": "7,730", "num_reviews": "2,262", "avg_ratings": 3.65, "genres": ["Fantasy", "Young Adult", "Did Not Finish", "Fantasy", "Paranormal", "Paranormal", "Witches", "Fantasy", "Magic", "Fiction", "Young Adult", "Young Adult Fantasy", "Audiobook", "Romance"], "title": "The Bone Witch", "description": ["When Tea accidentally resurrects her brother from the dead, she learns she is different from the other witches in her family. Her gift for necromancy means that she's a bone witch, a title that makes her feared and ostracized by her community. But Tea finds solace and guidance with an older, wiser bone witch, who takes Tea and her brother to another land for training.", "In her new home, Tea puts all her energy into becoming an asha-one who can wield elemental magic. But dark forces are approaching quickly, and in the face of danger, Tea will have to overcome her obstacles...and make a powerful choice."], "author": "Rin Chupeco", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-03-07 00:00:00", "ISBN": "1492635820"},
{"url": "https://www.goodreads.com/book/show/11345765-wolf-mark", "num_ratings": "406", "num_reviews": "79", "avg_ratings": 3.64, "genres": ["Fantasy", "Paranormal", "Young Adult", "Fantasy", "Young Adult", "Teen", "Shapeshifters", "Werewolves", "Fiction", "Science Fiction", "Fantasy", "Urban Fantasy", "Adventure", "Action"], "title": "Wolf Mark", "description": ["Luke King knows a lot of things. Like four different ways to disarm an enemy before the attacker can take a breath. Like every detail of every book he’s ever read. And Luke knows enough—just enough—about what his father does as a black ops infiltrator to know which questions not to ask. Like why does his family move around so much?", "Luke just hopes that this time his family", "Luke King knows a lot of things. Like four different ways to disarm an enemy before the attacker can take a breath. Like every detail of every book he’s ever read. And Luke knows enough—just enough—about what his father does as a black ops infiltrator to know which questions not to ask. Like why does his family move around so much?", "Luke just hopes that this time his family is settled for a while. He’ll finally be able to have a normal life. He’ll be able to ask the girl he likes to take a ride with him on his motorcycle. He’ll hang out with his friends. He’ll be invisible—just as he wants.", "But when his dad goes missing, Luke realizes that life will always be different for him. Suddenly he must avoid the kidnappers looking to use him as leverage against his father, while at the same time evading the attention of the school’s mysterious elite clique of Russian hipsters, who seem much too interested in Luke’s own personal secret. Faced with multiple challenges and his emerging paranormal identity, Luke must decide who to trust as he creates his own destiny."], "author": "Joseph Bruchac", "num_pages": "377", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-01 00:00:00", "ISBN": "160060661X"},
{"url": "https://www.goodreads.com/book/show/9766063-ico", "num_ratings": "805", "num_reviews": "70", "avg_ratings": 3.66, "genres": ["Fantasy", "Fiction", "Young Adult", "Asian Literature", "Japanese Literature", "Games", "Video Games", "Novels", "Light Novel"], "title": "Ico: Castle in the Mist", "description": ["When a boy named Ico grows long curved horns overnight, his fate has been sealed-he is to be sacrificed in the Castle in the Mist. But in the castle, Ico meets a young girl named Yorda imprisoned in its halls. Alone they will die, but together Ico and Yorda might just be able to defy their destinies and escape the magic of the castle.", "Based on the video game filmmaker Guill", "When a boy named Ico grows long curved horns overnight, his fate has been sealed-he is to be sacrificed in the Castle in the Mist. But in the castle, Ico meets a young girl named Yorda imprisoned in its halls. Alone they will die, but together Ico and Yorda might just be able to defy their destinies and escape the magic of the castle.", "Based on the video game filmmaker Guillemo del Toro (", ", ", ") called a \"masterpiece\", Japan's leading fantasist Miyuki Miyabe has crafted a tale of magic, loss, and love that will never be forgotten."], "author": "Miyuki Miyabe", "num_pages": "370", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-16 00:00:00", "ISBN": "1421540630"},
{"url": "https://www.goodreads.com/book/show/6440653-the-book-of-heroes", "num_ratings": "538", "num_reviews": "62", "avg_ratings": 3.75, "genres": ["Fantasy", "Young Adult", "Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature"], "title": "The Book of Heroes", "description": ["A young girl travels into a magical world to save her brother from real-world bullies.", "When her brother Hiroki disappears after a violent altercation with school bullies, the young Yuriko finds a magical book in his room. The book leads her to another world where she learns that Hiroki has been possessed by a spirit from the Book of Heroes. She visits the magical Nameless L", "A young girl travels into a magical world to save her brother from real-world bullies.", "When her brother Hiroki disappears after a violent altercation with school bullies, the young Yuriko finds a magical book in his room. The book leads her to another world where she learns that Hiroki has been possessed by a spirit from the Book of Heroes. She visits the magical Nameless Land, where she is told how to save her brother, and is sent back to Earth with a young monk named Sora and the magical book, now a mouse named Azu. Yuri has to piece together the mystery of Horiko, and has a library of powerful magic books at her disposal to do so!"], "author": "Miyuki Miyabe", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-19 00:00:00", "ISBN": "1421527758"},
{"url": "https://www.goodreads.com/book/show/34377167-iron-cast", "num_ratings": "1,657", "num_reviews": "452", "avg_ratings": 3.79, "genres": ["Fantasy", "Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Historical Fiction", "Historical Fantasy"], "title": "Iron Cast", "description": ["It’s Boston, 1919, and the Cast Iron club is packed. On stage, hemopaths—whose “afflicted” blood gives them the ability to create illusions through art—Corinne and Ada have been best friends ever since infamous gangster Johnny Dervish recruited them into his circle. By night they perform for Johnny’s crowds, and by day they con Boston’s elite. When a job goes wrong and Ada", "It’s Boston, 1919, and the Cast Iron club is packed. On stage, hemopaths—whose “afflicted” blood gives them the ability to create illusions through art—Corinne and Ada have been best friends ever since infamous gangster Johnny Dervish recruited them into his circle. By night they perform for Johnny’s crowds, and by day they con Boston’s elite. When a job goes wrong and Ada is imprisoned, she realizes how precarious their position is. After she escapes, two of the Cast Iron’s hires are shot, and Johnny disappears. With the law closing in, Corinne and Ada are forced to hunt for answers, even as betrayal faces them at every turn. An ideal next read for fans of Libba Bray’s ", "."], "author": "Destiny Soria", "num_pages": "384", "awards": [], "places": ["Boston, Massachusetts"], "character_names": ["Corinne Wells", "Ada Navarra", "John Dervish", "Gordon Calloway", "Gabriel Stone", "Charlie Lewis", "Guy Jackson", "Sebastian \"Saint\" Temple", "Dr. Knox", "James Gretsky", "Nyah Navarra", "Madeline Gretsky"], "language": "English", "publish_date": "2016-10-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/28095076-the-starriest-summer", "num_ratings": "67", "num_reviews": "46", "avg_ratings": 3.67, "genres": ["Young Adult", "Fantasy", "Romance", "Adventure", "Did Not Finish"], "title": "The Starriest Summer", "description": ["Fifteen-year-old Michelle saves the world on a daily basis…with her trusty video game controller, of course! Naturally, she jumps at the chance to play an experimental virtual reality game. ", "The beautiful fantasy world of Starrs? Check. The power to mold matter? Check. No reset button? Wait, she didn’t sign up for this! ", "Turns out Starrs is really real, and to make matters w", "Fifteen-year-old Michelle saves the world on a daily basis…with her trusty video game controller, of course! Naturally, she jumps at the chance to play an experimental virtual reality game. ", "The beautiful fantasy world of Starrs? Check. The power to mold matter? Check. No reset button? Wait, she didn’t sign up for this! ", "Turns out Starrs is really real, and to make matters worse, Michelle’s interference awakens the Cycle of the Six Moons, a series of devastating trials that will devour the universe. ", "Fighting the apocalypse was way easier when danger stayed on the other side of the screen, but Michelle finds a secret weapon in her new-found powers. She uses them to rescue the crown prince of a powerful magic kingdom from their sworn enemies, a technologically-advanced cult that strives to eradicate magical blood. ", "Michelle starts to fall for Prince Jayse, the only one who believes Michelle to be a savior rather than a curse. But not even video games could prepare her for what the cult has in store for them…"], "author": "Adelle Yeung", "num_pages": "376", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-22 00:00:00", "ISBN": "0692539883"},
{"url": "https://www.goodreads.com/book/show/17984141-the-young-elites", "num_ratings": "84,834", "num_reviews": "11,475", "avg_ratings": 3.92, "genres": ["Fantasy", "Young Adult", "Science Fiction", "Dystopia"], "title": "The Young Elites", "description": [" A decade ago, the deadly illness swept through her nation. Most of the infected perished, while many of the children who survived were left with strange markings. Adelina’s black hair turned silver, her lashes went pale, and now she has only a jagged scar where her left eye on", " A decade ago, the deadly illness swept through her nation. Most of the infected perished, while many of the children who survived were left with strange markings. Adelina’s black hair turned silver, her lashes went pale, and now she has only a jagged scar where her left eye once was. Her cruel father believes she is a malfetto, an abomination, ruining their family’s good name and standing in the way of their fortune. But some of the fever’s survivors are rumored to possess more than just scars—they are believed to have mysterious and powerful gifts, and though their identities remain secret, they have come to be called the Young Elites.", " As Leader of the Inquisition Axis, it is his job to seek out the Young Elites, to destroy them before they destroy the nation. He believes the Young Elites to be dangerous and vengeful, but it’s Teren who may possess the darkest secret of all.", " This secret sect of Young Elites seeks out others like them before the Inquisition Axis can. But when the Daggers find Adelina, they discover someone with powers like they’ve never seen.", "Adelina wants to believe Enzo is on her side, and that Teren is the true enemy. But the lives of these three will collide in unexpected ways, as each fights a very different and personal battle. But of one thing they are all certain: Adelina has abilities that shouldn’t belong in this world. A vengeful blackness in her heart. And a desire to destroy all who dare to cross her."], "author": "Marie Lu", "num_pages": "336", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2014)"], "places": ["Kenettra"], "character_names": ["Adelina Amouteru", "Enzo Valenciano", "Teren Santoro"], "language": "English", "publish_date": "2014-10-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/14342606-diverse-energies", "num_ratings": "390", "num_reviews": "107", "avg_ratings": 3.65, "genres": ["Short Stories", "Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Anthologies", "Fantasy"], "title": "Diverse Energies", "description": ["—President John F. Kennedy, from a speech at University of California, March", "—President John F. Kennedy, from a speech at University of California, March 23, 1962", "In a world gone wrong, heroes and villains are not always easy to distinguish and every individual has the ability to contribute something powerful.", "In this stunning collection of original and rediscovered stories of tragedy and hope, the stars are a diverse group of students, street kids, good girls, kidnappers, and child laborers pitted against their environments, their governments, differing cultures, and sometimes one another as they seek answers in their dystopian worlds. Take a journey through time from a nuclear nightmare of the past to society’s far future beyond Earth with these eleven stories by masters of speculative fiction. Includes stories by Paolo Bacigalupi, Ursula K. Le Guin, Malinda Lo, Cindy Pon, Daniel H. Wilson, and more."], "author": "Tobias S. Buckell", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-20 00:00:00", "ISBN": "1600608884"},
{"url": "https://www.goodreads.com/book/show/15721624-orleans", "num_ratings": "3,184", "num_reviews": "646", "avg_ratings": 3.74, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Fiction", "Apocalyptic", "Post Apocalyptic"], "title": "Orleans", "description": ["After a string of devastating hurricanes and a severe outbreak of Delta Fever, the Gulf Coast has been quarantined. Years later, residents of the Outer States are under the assumption that life in the Delta is all but extinct… but in reality, a new primitive society has been born.", "Fen de la Guerre is living with the O-P", "After a string of devastating hurricanes and a severe outbreak of Delta Fever, the Gulf Coast has been quarantined. Years later, residents of the Outer States are under the assumption that life in the Delta is all but extinct… but in reality, a new primitive society has been born.", "Fen de la Guerre is living with the O-Positive blood tribe in the Delta when they are ambushed. Left with her tribe leader’s newborn, Fen is determined to get the baby to a better life over the wall before her blood becomes tainted. Fen meets Daniel, a scientist from the Outer States who has snuck into the Delta illegally. Brought together by chance, kept together by danger, Fen and Daniel navigate the wasteland of Orleans. In the end, they are each other’s last hope for survival.", "Sherri L. Smith delivers an expertly crafted story about a fierce heroine whose powerful voice and firm determination will stay with you long after you’ve turned the last page."], "author": "Sherri L. Smith", "num_pages": "324", "awards": ["Milwaukee County Teen Book Award Nominee (2014)"], "places": ["New Orleans, Louisiana"], "character_names": ["Fen de la Guerre"], "language": "English", "publish_date": "2013-03-07 00:00:00", "ISBN": "0399252940"},
{"url": "https://www.goodreads.com/book/show/1963399.Wind_Follower", "num_ratings": "72", "num_reviews": "19", "avg_ratings": 3.82, "genres": ["Fantasy", "Fiction"], "title": "Wind Follower", "description": ["Although it is not entirely to her liking, grief-stricken Satha, a dark-skinned woman from a poor Theseni clan weds young Loic, the wealthy Doreni son of the king's First Captain. Loic, graced with ability to see into the hearts and minds of others, begins to help Satha overcome her sorrows. Despite coming from different tribes, they begin to forge a life together. But whe", "Although it is not entirely to her liking, grief-stricken Satha, a dark-skinned woman from a poor Theseni clan weds young Loic, the wealthy Doreni son of the king's First Captain. Loic, graced with ability to see into the hearts and minds of others, begins to help Satha overcome her sorrows. Despite coming from different tribes, they begin to forge a life together. But when Satha's own compassion is used against her and a treacherous enemy contrives to dishonor her in Loic's absence, Loic's love turns to anger and disgust. Embittered, Loic must still avenge his honor and Satha's and he sets out on a journey that brings despair as well as spiritual discovery. Battling him are the Arkhai, the spirits of the land who know his quest will lead him toward the God whom they have usurped. After his departure, Satha is kidnapped, sold into slavery and learns, first hand, how cruel the pioneering Angleni tribe can be. Both face great hardship, danger and anguish apart, but with the Creator's aid there remains hope they will be reunited and heal the love the world has torn asunder."], "author": "Carole  McDonnell", "num_pages": "382", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-24 00:00:00", "ISBN": "0809557797"},
{"url": "https://www.goodreads.com/book/show/34433755-girls-of-paper-and-fire", "num_ratings": "214", "num_reviews": "144", "avg_ratings": 4.25, "genres": ["Fantasy", "Young Adult", "Lgbt"], "title": "Girls of Paper and Fire", "description": ["In this lush fantasy, Lei is a member of the Paper caste, the lowest and most oppressed class in Ikhara. She lives in a remote village with her father, whe", "In this lush fantasy, Lei is a member of the Paper caste, the lowest and most oppressed class in Ikhara. She lives in a remote village with her father, where the decade-old trauma of watching her mother snatched by royal guards still haunts her. Now, the guards are back, and this time it's Lei they're after--the girl whose golden eyes have piqued the king's interest.", "Over weeks of training in the opulent but stifling palace, Lei and eight other girls learn the skills and charm that befit being a king's consort. But Lei isn't content to watch her fate consume her. Instead, she does the unthinkable--she falls in love. Her forbidden romance becomes enmeshed with an explosive plot that threatens the very foundation of Ikhara, and Lei, still the wide-eyed country girl at heart, must decide just how far she's willing to go for justice and revenge.", "TW: violence and sexual abuse."], "author": "Natasha Ngan", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0316561363"},
{"url": "https://www.goodreads.com/book/show/15803761-the-immortal-rules", "num_ratings": "59,687", "num_reviews": "5,903", "avg_ratings": 4.1, "genres": ["Paranormal", "Vampires", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Science Fiction", "Dystopia"], "title": "The Immortal Rules", "description": ["Allison Sekemoto survives in the Fringe, the outermost circle of a walled-in city. By day, she and her crew scavenge for food. By night, any one of them could be eaten. Some days, all that drives Allie is her hatred of", "—the vampires who keep humans as blood cattle. Until the night Allie herself dies and becomes", "Allison Sekemoto survives in the Fringe, the outermost circle of a walled-in city. By day, she and her crew scavenge for food. By night, any one of them could be eaten. Some days, all that drives Allie is her hatred of", "—the vampires who keep humans as blood cattle. Until the night Allie herself dies and becomes one of the monsters.", "Forced to flee her city, Allie must pass for human as she joins a ragged group of pilgrims seeking a legend—a place that might have a cure for the disease that killed off most of civilization and created the rabids, the bloodthirsty creatures who threaten human and vampire alike. And soon Allie will have to decide what and who is worth dying for\u0085again.", "Enter Julie Kagawa's dark and twisted world as an unforgettable journey begins."], "author": "Julie Kagawa", "num_pages": "443", "awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)"], "places": [], "character_names": ["Allison Sekemoto", "Stick", "Kanin", "Jackal", "Zeke Crosse"], "language": "English", "publish_date": "2013-03-26 00:00:00", "ISBN": "0373210809"},
{"url": "https://www.goodreads.com/book/show/25203675-the-star-touched-queen", "num_ratings": "17,102", "num_reviews": "3,974", "avg_ratings": 3.57, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Mythology"], "title": "The Star-Touched Queen", "description": ["Maya is cursed. With a horoscope that promises a marriage of death and destruction, she has earned only the scorn and fear of her father’s kingdom. Content to follow more scholarly pursuits, her whole world is torn apart when her father, the Raja, arranges a weddi", "Maya is cursed. With a horoscope that promises a marriage of death and destruction, she has earned only the scorn and fear of her father’s kingdom. Content to follow more scholarly pursuits, her whole world is torn apart when her father, the Raja, arranges a wedding of political convenience to quell outside rebellions. Soon Maya becomes the queen of Akaran and wife of Amar. Neither roles are what she expected: As Akaran’s queen, she finds her voice and power. As Amar’s wife, she finds something else entirely: Compassion. Protection. Desire…", "But Akaran has its own secrets—thousands of locked doors, gardens of glass, and a tree that bears memories instead of fruit. Soon, Maya suspects her life is in danger. Yet who, besides her husband, can she trust? With the fate of the human and Otherworldly realms hanging in the balance, Maya must unravel an ancient mystery that spans reincarnated lives to save those she loves the most…including herself."], "author": "Roshani Chokshi", "num_pages": "342", "awards": ["Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2016)", "Goodreads Choice Award Nominee for Debut Goodreads Author (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-26 00:00:00", "ISBN": "1250085470"},
{"url": "https://www.goodreads.com/book/show/37004954-shadow-of-the-fox", "num_ratings": "187", "num_reviews": "161", "avg_ratings": 4.26, "genres": ["Fantasy", "Young Adult"], "title": "Shadow of the Fox", "description": ["Now, for whoever holds the Scroll of a Thousand Prayers, a new wish will be granted. A new age is about to dawn.", "Raised by monks in the isolated Silent Winds temple, Yumeko has trained all her life to hide her yokai", "Now, for whoever holds the Scroll of a Thousand Prayers, a new wish will be granted. A new age is about to dawn.", "Raised by monks in the isolated Silent Winds temple, Yumeko has trained all her life to hide her yokai nature. Half kitsune, half human, her skill with illusion is matched only by her penchant for mischief. Until the day her home is burned to the ground, her adoptive family is brutally slain and she is forced to flee for her life with the temple’s greatest treasure—one part of the ancient scroll.", "There are many who would claim the dragon’s wish for their own. Kage Tatsumi, a mysterious samurai of the Shadow Clan, is one such hunter, under orders to retrieve the scroll…at any cost. Fate brings Kage and Yumeko together. With a promise to lead him to the scroll, an uneasy alliance is formed, offering Yumeko her best hope for survival. But he seeks what she has hidden away, and her deception could ultimately tear them both apart.", "With an army of demons at her heels and the unlikeliest of allies at her side, Yumeko’s secrets are more than a matter of life or death. They are the key to the fate of the world itself.", "“One of my all-time favorite fantasy novels!”", "—Ellen Oh, author of the Prophecy and Spirit Hunters series"], "author": "Julie Kagawa", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": null, "ISBN": "1335145168"},
{"url": "https://www.goodreads.com/book/show/444338.Dragon_of_the_Lost_Sea", "num_ratings": "954", "num_reviews": "52", "avg_ratings": 3.9, "genres": ["Fantasy", "Fantasy", "Dragons", "Young Adult", "Fiction", "Adventure", "Childrens"], "title": "Dragon of the Lost Sea", "description": ["Centuries of wandering have taught the exiled dragon princess Shimmer that humans are beneath her notice. But she allows young Thorn to join her in the search for the evil witch Civet--and the quest to restore her dragon clan's lost home."], "author": "Laurence Yep", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-06-30 00:00:00", "ISBN": "0064402274"},
{"url": "https://www.goodreads.com/book/show/18692431-everything-everything", "num_ratings": "237,307", "num_reviews": "31,157", "avg_ratings": 4.09, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "Everything, Everything", "description": ["My disease is as rare as it is famous. Basically, I’m allergic to the world. I don’t leave my house, have not left my house in seventeen years. The only people I ever see are my mom and my nurse, Carla.", "But then one day, a moving truck arrives next door. I look out my window, and I see him. He’s tall, lean and wearing all black—black T-shirt, black jeans, black sneakers, an", "My disease is as rare as it is famous. Basically, I’m allergic to the world. I don’t leave my house, have not left my house in seventeen years. The only people I ever see are my mom and my nurse, Carla.", "But then one day, a moving truck arrives next door. I look out my window, and I see him. He’s tall, lean and wearing all black—black T-shirt, black jeans, black sneakers, and a black knit cap that covers his hair completely. He catches me looking and stares at me. I stare right back. His name is Olly.", "Maybe we can’t predict the future, but we can predict some things. For example, I am certainly going to fall in love with Olly. It’s almost certainly going to be a disaster."], "author": "Nicola Yoon", "num_pages": "307", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Soaring Eagle Book Award (2016)", "Milwaukee County Teen Book Award Nominee (2017)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2016)", "Goodreads Choice Award Nominee for Debut Goodreads Author, and for Young Adult Fiction (2015)", "Missouri Gateway Readers Award Nominee (2017)"], "places": ["Los Angeles, California", "Maui, Hawaii"], "character_names": ["Madeline \"Maddy\" Furukawa Whittier", "Oliver \"Olly\" Bright", "Pauline Furukawa Whittier", "Carla Flores"], "language": "English", "publish_date": "2015-09-01 00:00:00", "ISBN": "0553496646"},
{"url": "https://www.goodreads.com/book/show/17869212-promise-of-shadows", "num_ratings": "1,398", "num_reviews": "259", "avg_ratings": 3.6, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Fantasy", "Paranormal", "Romance", "Fantasy", "Urban Fantasy"], "title": "Promise of Shadows", "description": ["Zephyr Mourning has never been very good at being a Harpy. She’d rather watch reality TV than learn forty-seven ways to kill a man, and she pretty much sucks at wielding magic. Zephyr was ready for a future pretending to be a normal human instead of a half-god assassin. But all that changes when her sister is murdered—and she uses a forbidden dark power to save herself fro", "Zephyr Mourning has never been very good at being a Harpy. She’d rather watch reality TV than learn forty-seven ways to kill a man, and she pretty much sucks at wielding magic. Zephyr was ready for a future pretending to be a normal human instead of a half-god assassin. But all that changes when her sister is murdered—and she uses a forbidden dark power to save herself from the same fate.", "Zephyr is on the run from a punishment worse than death when an unexpected reunion with a childhood friend (a surprisingly HOT friend) changes everything. Because it seems like Zephyr might just be the Nyx, a dark goddess made flesh that is prophesied to change the power balance. For hundreds of years the half-gods have lived in fear, and Zephyr is supposed to change that.", "But how is she supposed to save everyone when she can’t even save herself?"], "author": "Justina Ireland", "num_pages": "371", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-11 00:00:00", "ISBN": "1442444649"},
{"url": "https://www.goodreads.com/book/show/25064648-the-reader", "num_ratings": "5,887", "num_reviews": "1,466", "avg_ratings": 3.79, "genres": ["Young Adult", "Fantasy", "Adventure", "Fiction", "Young Adult", "Young Adult Fantasy"], "title": "The Reader", "description": ["Sefia lives her life on the run. After her father is viciously murdered, she flees to the forest with her aunt Nin, the only person left she can trust. They survive in the wilderness together, hunting and stealing what they need, forever looking over their shoulders for new threats. But when Ni", "Sefia lives her life on the run. After her father is viciously murdered, she flees to the forest with her aunt Nin, the only person left she can trust. They survive in the wilderness together, hunting and stealing what they need, forever looking over their shoulders for new threats. But when Nin is kidnapped, Sefia is suddenly on her own, with no way to know who’s taken Nin or where she is. Her only clue is a strange rectangular object that once belonged to her father left behind, something she comes to realize is a book.", "Though reading is unheard of in Sefia’s world, she slowly learns, unearthing the book’s closely guarded secrets, which may be the key to Nin’s disappearance and discovering what really happened the day her father was killed. With no time to lose, and the unexpected help of swashbuckling pirates and an enigmatic stranger, Sefia sets out on a dangerous journey to rescue her aunt, using the book as her guide. In the end, she discovers what the book had been trying to tell her all along: Nothing is as it seems, and the end of her story is only the beginning."], "author": "Traci Chee", "num_pages": "442", "awards": ["Kirkus Prize Nominee for Young Readers' Literature (2016)", "Goodreads Choice Award Nominee for Debut Goodreads Author (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-13 00:00:00", "ISBN": "0399176772"},
{"url": "https://www.goodreads.com/book/show/6973671-ivy-s-ever-after", "num_ratings": "811", "num_reviews": "104", "avg_ratings": 3.9, "genres": ["Fantasy", "Fantasy", "Dragons", "Adventure", "Fantasy", "Fairy Tales", "Childrens", "Middle Grade", "Fantasy", "Magic"], "title": "Ivy's Ever After", "description": ["Filled with humor and high adventure, this fractured fairy tale tells how a spirited, nonconformist princess and an undersized, nonthreatening dragon join forces to foil an evil prince's dastardly plot to destroy their kingdom."], "author": "Dawn Lairamore", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-05-01 00:00:00", "ISBN": "0823422615"},
{"url": "https://www.goodreads.com/book/show/33848535-the-sun-is-also-a-star", "num_ratings": "82,800", "num_reviews": "13,673", "avg_ratings": 4.11, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "The Sun Is Also a Star", "description": ["Natasha: I’m a girl who believes in science and facts. Not fate. Not destiny. Or dreams that will never come true. I’m definitely not the kind of girl who meets a cute boy on a crowded New York City street and falls in love with him. Not when my family is twelve hours away from being deported to Jamaica. Falling in love with him won’t be my story.", "Daniel: I’ve always been t", "Natasha: I’m a girl who believes in science and facts. Not fate. Not destiny. Or dreams that will never come true. I’m definitely not the kind of girl who meets a cute boy on a crowded New York City street and falls in love with him. Not when my family is twelve hours away from being deported to Jamaica. Falling in love with him won’t be my story.", "Daniel: I’ve always been the good son, the good student, living up to my parents’ high expectations. Never the poet. Or the dreamer. But when I see her, I forget about all that. Something about Natasha makes me think that fate has something much more extraordinary in store—for both of us.", "The Universe: Every moment in our lives has brought us to this single moment. A million futures lie before us. Which one will come true?"], "author": "Nicola Yoon", "num_pages": "348", "awards": ["California Book Award for Young Adult (Gold) (2016)", "Michael L. Printz Award Nominee (2017)", "John Steptoe New Talent Author Award (2017)", "Goodreads Choice Award Nominee for Young Adult Fiction (2016)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2016-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/33151756-ghost-girl-in-the-corner", "num_ratings": "347", "num_reviews": "78", "avg_ratings": 4.33, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Short Stories", "Fantasy", "Paranormal"], "title": "Ghost Girl in the Corner", "description": ["Trying to shake off the strange malaise that separates her from even her girlfriend Izzy, Tee decides to take over the ", " for the summer. But then she finds an alluring violet dress in the newspaper office, and a cute ghost girl no one else can see. Who is she? What does she want? And why is she revealing herself to Tee? ", "Izzy can tell Tee's dr", "Trying to shake off the strange malaise that separates her from even her girlfriend Izzy, Tee decides to take over the ", " for the summer. But then she finds an alluring violet dress in the newspaper office, and a cute ghost girl no one else can see. Who is she? What does she want? And why is she revealing herself to Tee? ", "Izzy can tell Tee's drifting away from her -- she misses Izzy's shows and skips shadowshaper practice to spend time alone at the newspaper -- and she won't stand for it. Yet when a girl goes missing in Bed-Stuy, Izzy needs Tee to get the word out and help investigate. Can they break through their distance and reconnect before someone else dies? ", "Set between the ", "-bestselling ", " and its upcoming sequel ", ", this beautiful novella of mystery, love and loss will draw you deep into Daniel José Older's magical Brooklyn."], "author": "Daniel José Older", "num_pages": "109", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30653668-yellow-brick-war", "num_ratings": "11,997", "num_reviews": "1,458", "avg_ratings": 3.82, "genres": ["Fantasy", "Young Adult", "Retellings"], "title": "Yellow Brick War", "description": ["In this action-packed third book in the ", " bestselling Dorothy Must Die series, new girl from Kansas Amy Gumm is caught between her home—and Oz. Perfect for fans of Marissa Meyer’s Lunar Chronicles and Gregory Maguire’s ", ", Danielle Paige delivers a dark, high-octane reimagining of L. Frank Baum’s ", " ", ".", "My name is Amy Gumm. Tornadoes mu", "In this action-packed third book in the ", " bestselling Dorothy Must Die series, new girl from Kansas Amy Gumm is caught between her home—and Oz. Perfect for fans of Marissa Meyer’s Lunar Chronicles and Gregory Maguire’s ", ", Danielle Paige delivers a dark, high-octane reimagining of L. Frank Baum’s ", " ", ".", "My name is Amy Gumm. Tornadoes must have a thing about girls from Kansas, because—just like Dorothy—I got swept away on one too. I landed in Oz, where Good is Wicked, Wicked is Good, and the Wicked Witches clued me in to my true calling: Assassin.", "The only way to stop Dorothy from destroying Oz—and Kansas—is to kill her. But I failed. Others died for my mistakes. Because of me, the portal between the worlds has been opened. And if I don’t find a way to close it?", "Dorothy will make sure I never go home again.", "Now it’s up to me to: join the Witches, fight for Oz, save Kansas, and stop Dorothy once and for all."], "author": "Danielle  Paige", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-03-14 00:00:00", "ISBN": "0062280740"},
{"url": "https://www.goodreads.com/book/show/11594414-the-book-of-wonders", "num_ratings": "1,145", "num_reviews": "129", "avg_ratings": 3.97, "genres": ["Fantasy", "Childrens", "Middle Grade", "Adventure", "Fantasy", "Magic", "Fiction", "Young Adult", "Childrens"], "title": "The Book of Wonders", "description": ["Magic, Djinn, Ogres, and Sorcerers. Thirteen-year-old Zardi loves to hear stories about fantastical beings, long banned from the kingdom of Arribitha. But anyone caught whispering of their powers will feel the rage of the sultan—a terrifying usurper who, even with his eyes closed, can see all. ", "When her own beloved sister is captured by the evil ruler, Zardi knows that she", "Magic, Djinn, Ogres, and Sorcerers. Thirteen-year-old Zardi loves to hear stories about fantastical beings, long banned from the kingdom of Arribitha. But anyone caught whispering of their powers will feel the rage of the sultan—a terrifying usurper who, even with his eyes closed, can see all. ", "When her own beloved sister is captured by the evil ruler, Zardi knows that she must go to any lengths to rescue her. Along with her best friend, Ridhan—a silver-haired, violet-eyed boy of mysterious origins—and an unlikely crew of sailors led by the infamous Captain Sinbad, Zardi ventures forth into strange and wondrous territory with a seemingly impossible mission: to bring magic back to Arribitha and defeat the sultan once and for all."], "author": "Jasmine Richards", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-17 00:00:00", "ISBN": "0062010077"},
{"url": "https://www.goodreads.com/book/show/123557.Brave_Story", "num_ratings": "2,325", "num_reviews": "305", "avg_ratings": 4.17, "genres": ["Fantasy", "Young Adult", "Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature"], "title": "Brave Story", "description": ["Young Wataru Mitani's life is a mess. His family has problems they never told him about, a new student at school upsets everything he knows about the world, and a girl's voice rings in his mind all hours of the night. Desperately he searches for some way to change his life; a way to alter his fate.", "To achieve his goal, he must navigate the magical world of Vision, a land fi", "Young Wataru Mitani's life is a mess. His family has problems they never told him about, a new student at school upsets everything he knows about the world, and a girl's voice rings in his mind all hours of the night. Desperately he searches for some way to change his life; a way to alter his fate.", "To achieve his goal, he must navigate the magical world of Vision, a land filled with creatures both fierce and friendly. And to complicate matters, he must outwit a merciless rival from the real world. ", "Wataru's ultimate destination is the Tower of Destiny where a Goddess of fate awaits. Only when he has finished his journey and collected five elusive gemstones will he possess the Demon's Bane; the key that will unlock his future. ", "Charity, bravery, faith, grace and the power of darkness and light: these are the provinces of each gemstone. Brought together, they have the immeasurable power to change Wataru's life."], "author": "Miyuki Miyabe", "num_pages": "816", "awards": ["Batchelder Award (2008)"], "places": ["Japan", "Vision"], "character_names": ["Meena", "Kee Keema", "Wataru Mitani", "Mitsuru Ashikawa", "Kutz", "Suaty", "the Goddess of Destiny"], "language": "English", "publish_date": "2007-08-14 00:00:00", "ISBN": "1421511967"},
{"url": "https://www.goodreads.com/book/show/25816879-the-wicked-will-rise", "num_ratings": "22,228", "num_reviews": "2,591", "avg_ratings": 3.81, "genres": ["Fantasy", "Young Adult", "Retellings"], "title": "The Wicked Will Rise", "description": ["In this ", " bestselling sequel to ", ", who is good—and who is actually Wicked? ", " is perfect for fans of richly reimagined fairy tales and classic tales like Marissa Meyer’s Lunar Chronicles and Gregory Maguire’s ", ".", "My name is Amy Gumm—and I’m the ", " girl from Kansas. After a tornado swept through my trailer park, I ended up", "In this ", " bestselling sequel to ", ", who is good—and who is actually Wicked? ", " is perfect for fans of richly reimagined fairy tales and classic tales like Marissa Meyer’s Lunar Chronicles and Gregory Maguire’s ", ".", "My name is Amy Gumm—and I’m the ", " girl from Kansas. After a tornado swept through my trailer park, I ended up in Oz. But it wasn’t like the Oz I knew from books and movies. Dorothy had returned, but she was now a ruthless dictator. Glinda could no longer be called the Good Witch. And the Wicked Witches who were left? They’d joined forces as the Revolutionary Order of the Wicked, and they wanted to recruit me.", "My mission? Kill Dorothy. Except my job as assassin didn’t work out as planned. Dorothy is still alive. The Order has vanished. And the home I couldn’t wait to leave behind might be in danger.", "Somehow, across a twisted and divided land, I have to find the Order, protect the true ruler of Oz, take Dorothy and her henchmen down—and try to figure out what I’m really doing here."], "author": "Danielle  Paige", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-03-15 00:00:00", "ISBN": "0062280716"},
{"url": "https://www.goodreads.com/book/show/30653764-the-end-of-oz", "num_ratings": "5,706", "num_reviews": "780", "avg_ratings": 3.84, "genres": ["Fantasy", "Young Adult", "Retellings"], "title": "The End of Oz", "description": ["At the end of Yellow Brick War, Amy had finally defeated Dorothy. Just when she and the rest of the surviving members of the Revolutionary Order of the Wicked thought it was safe to start rebuilding the damaged land of Oz, they realized they’ve been betrayed—by one of their own. And Dorothy might not have been so easily defeated after all.", "In the fourth installment of the N", "At the end of Yellow Brick War, Amy had finally defeated Dorothy. Just when she and the rest of the surviving members of the Revolutionary Order of the Wicked thought it was safe to start rebuilding the damaged land of Oz, they realized they’ve been betrayed—by one of their own. And Dorothy might not have been so easily defeated after all.", "In the fourth installment of the New York Times bestselling Dorothy Must Die series, the magical Road of Yellow Brick has come to the rescue, and whisked Amy away—but to where? Does the Road itself know where she needs to go to find the help that she needs?", "Welcome to the other side of the rainbow. Here there’s danger around every corner, and magic shoes won’t be able to save you."], "author": "Danielle  Paige", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-03-14 00:00:00", "ISBN": "0062660233"},
{"url": "https://www.goodreads.com/book/show/5983694-where-the-mountain-meets-the-moon", "num_ratings": "29,256", "num_reviews": "3,775", "avg_ratings": 4.25, "genres": ["Fantasy", "Childrens", "Middle Grade", "Fiction", "Childrens", "Adventure", "Young Adult", "Fantasy", "Dragons", "Cultural", "China", "Childrens", "Juvenile", "Cultural"], "title": "Where the Mountain Meets the Moon", "description": ["In the valley of Fruitless Mountain, a young girl named Minli spends her days working hard in the fields and her nights listening to her father spin fantastic tales about the Jade Dragon and the Old Man of the Moon. Minli's mother, tired of their poor life, chides him for filling her head with nonsense. But Minli believes these enchanting stories and embarks on an extraord", "In the valley of Fruitless Mountain, a young girl named Minli spends her days working hard in the fields and her nights listening to her father spin fantastic tales about the Jade Dragon and the Old Man of the Moon. Minli's mother, tired of their poor life, chides him for filling her head with nonsense. But Minli believes these enchanting stories and embarks on an extraordinary journey to find the Old Man of the Moon and ask him how her family can change their fortune. She encounters an assorted cast of characters and magical creatures along the way, including a dragon who accompanies her on her quest. ", "Source: Jacket flap"], "author": "Grace Lin", "num_pages": "282", "awards": ["Newbery Medal Nominee (2010)", "Mythopoeic Fantasy Award for Children's Literature (2010)", "Josette Frank Award (2010)", "Dorothy Canfield Fisher Children's Book Award Nominee (2011)", "Iowa Children's Choice Award Nominee (2013)", "California Young Readers Medal Nominee for Intermediate (2013)", "Cybils Award Nominee for Middle Grade Fantasy & Science Fiction (2009)", "Bluestem Book Award Nominee (2018)", "Goodreads Choice Award Nominee for Children's Book (2009)", "Rebecca Caudill Young Readers' Book Award Nominee (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-12 00:00:00", "ISBN": "0316114278"},
{"url": "https://www.goodreads.com/book/show/52872.Flight", "num_ratings": "13,602", "num_reviews": "2,021", "avg_ratings": 3.89, "genres": ["Fiction", "Young Adult", "Fantasy", "Historical", "Historical Fiction", "Science Fiction", "Time Travel"], "title": "Flight", "description": ["Sherman Alexie is one of our most gifted and accomplished storytellers and a treasured writer of huge national stature. His first novel in ten years is the hilarious and tragic portrait of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful and swift, prose, ", " follows this troubled foster teenager--a", "Sherman Alexie is one of our most gifted and accomplished storytellers and a treasured writer of huge national stature. His first novel in ten years is the hilarious and tragic portrait of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful and swift, prose, ", " follows this troubled foster teenager--a boy who is not a \"legal\" Indian because he was never claimed by his father--as he learns that violence is not the answer.", "The journey for ", "'s young hero begins as he's about to commit a massive act o violence. At the moment of decision, he finds himself shot back through time to resurface in the body of an FBI agent during the civil rights era, where he sees why \"Hell is Re driver, Idaho, in the 1970s.\" Red River is only the first stop in an eye-opening trip through moments in American history. He will continue traveling back to inhabit the body of an Indian child during the battle at Little Bighorn and then ride with an Indian tracker in the nineteenth century before materializing as an airline pilot jetting through the skies today. During these furious travels through time, his refrain grows: \"Who's to judge?\" and \"I don't understand humans.\" When finally, blessedly, our young warrior comes to rest again in his own life, he is mightily transformed by all he has seen.", "This is Sherman Alexie at his most brilliant--making us laugh while he's breaking our hearts. ", " has said that \"Alexie, like his characters, is on a modern-day vision quest,\" and in ", " he seeks nothing less than an understanding of why human beings hate. ", " is irrepressible, fearless, and groundbreaking Alexie."], "author": "Sherman Alexie", "num_pages": "181", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0802170374"},
{"url": "https://www.goodreads.com/book/show/17946249-killer-of-enemies", "num_ratings": "595", "num_reviews": "169", "avg_ratings": 3.75, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Fantasy", "Apocalyptic", "Post Apocalyptic"], "title": "Killer of Enemies", "description": ["Years ago, seventeen-year-old Apache hunter Lozen and her family lived in a world of haves and have-nots. There were the Ones -- people so augmented with technology and genetic enhancements that they were barely human -- and there was everyone else who served them. Then the Cloud came, and every", "Years ago, seventeen-year-old Apache hunter Lozen and her family lived in a world of haves and have-nots. There were the Ones -- people so augmented with technology and genetic enhancements that they were barely human -- and there was everyone else who served them. Then the Cloud came, and everything changed. Tech stopped working. The world plunged back into a new steam age. The Ones' pets -- genetically engineered monsters -- turned on them and are now loose on the world.", "Lozen was not one of the lucky ones pre-C, but fate has given her a unique set of survival skills and magical abilities. She hunts monsters for the Ones who survived the apocalyptic events of the Cloud, which ensures the safety of her kidnapped family. But with every monster she takes down, Lozen's powers grow, and she connects those powers to an ancient legend of her people. It soon becomes clear to Lozen that she is not just a hired gun. As the legendary Killer of Enemies was in the ancient days of the Apache people, Lozen is meant to be a more than a hunter. Lozen is meant to be a hero."], "author": "Joseph Bruchac", "num_pages": "400", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2014)", "American Indian Youth Literature Award for Best Young Adult Book (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-17 00:00:00", "ISBN": "1620141434"},
{"url": "https://www.goodreads.com/book/show/3304.City_of_the_Beasts", "num_ratings": "24,427", "num_reviews": "1,273", "avg_ratings": 3.7, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure"], "title": "City of the Beasts", "description": ["Fifteen-year-old Alexander Cold is about to join his fearless grandmother on the trip of a lifetime. An International Geographic expedition is headed to the dangerous, remote wilds of South America, on a mission to document the legendary Yeti of the Amazon known as the Beast.", "But there are many secrets hidden in the unexplored wilderness, as Alex and his new friend Nadia so", "Fifteen-year-old Alexander Cold is about to join his fearless grandmother on the trip of a lifetime. An International Geographic expedition is headed to the dangerous, remote wilds of South America, on a mission to document the legendary Yeti of the Amazon known as the Beast.", "But there are many secrets hidden in the unexplored wilderness, as Alex and his new friend Nadia soon discover. Drawing on the strength of their spirit guides, both young people are led on a thrilling and unforgettable journey to the ultimate discovery. . . ."], "author": "Isabel Allende", "num_pages": "408", "awards": ["Missouri Gateway Readers Award Nominee (2005)"], "places": ["Amazon Rainforest"], "character_names": ["Alexander Cold", "Kate Cold", "Nadia Santos", "Omayra Torres", "Cesar Santos", "Timothy Bruce", "Ludovic Leblanc", "Karakawe", "Walimai", "Iyomi", "Mokarita"], "language": "English", "publish_date": "2004-04-27 00:00:00", "ISBN": "0060535032"},
{"url": "https://www.goodreads.com/book/show/22693203-dorothy-must-die", "num_ratings": "56,192", "num_reviews": "8,807", "avg_ratings": 3.83, "genres": ["Young Adult", "Retellings", "Fiction"], "title": "Dorothy Must Die", "description": ["The ", " bestselling first book in a dark new series that reimagines the Oz saga, from debut author Danielle Paige.", "I didn't ask for any of this. I didn't ask to be some kind of hero. But when your whole life gets swept up by a tornado—taking you with it—you have no choice but to go along, you know?", "Sure, I've read the books. I've seen the movies. I know the song a", "The ", " bestselling first book in a dark new series that reimagines the Oz saga, from debut author Danielle Paige.", "I didn't ask for any of this. I didn't ask to be some kind of hero. But when your whole life gets swept up by a tornado—taking you with it—you have no choice but to go along, you know?", "Sure, I've read the books. I've seen the movies. I know the song about the rainbow and the happy little blue birds. But I never expected Oz to look like this. To be a place where Good Witches can't be trusted, Wicked Witches may just be the good guys, and winged monkeys can be executed for acts of rebellion. There's still a road of yellow brick—but even that's crumbling.", "What happened? Dorothy. They say she found a way to come back to Oz. They say she seized power and the power went to her head. And now no one is safe.", "My name is Amy Gumm—and I'm the other girl from Kansas. I've been recruited by the Revolutionary Order of the Wicked. I've been trained to fight. And I have a mission: Remove the Tin Woodman's heart. Steal the Scarecrow's brain. Take the Lion's courage. And—Dorothy must die."], "author": "Danielle  Paige", "num_pages": "480", "awards": ["Goodreads Choice Award Nominee for Debut Goodreads Author (2014)"], "places": ["Oz"], "character_names": [], "language": "English", "publish_date": "2015-03-31 00:00:00", "ISBN": "0062280686"},
{"url": "https://www.goodreads.com/book/show/6289599-half-world", "num_ratings": "1,287", "num_reviews": "247", "avg_ratings": 3.63, "genres": ["Fantasy", "Young Adult", "Fiction", "Horror", "Cultural", "Canada"], "title": "Half World", "description": ["Melanie Tamaki is human—but her parents aren’t. They are from Half World, a Limbo between our world and the afterlife, and her father is still there. When her mother disappears, Melanie must follow her to Half World—and neither of them may return alive."], "author": "Hiromi Goto", "num_pages": "233", "awards": ["Sunburst Award for Young Adult (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-01-30 00:00:00", "ISBN": "0670069655"},
{"url": "https://www.goodreads.com/book/show/34051373-shadowhouse-fall", "num_ratings": "709", "num_reviews": "181", "avg_ratings": 4.28, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Paranormal"], "title": "Shadowhouse Fall", "description": ["Sierra and her friends love their new lives as shadowshapers, making art and creating change with the spirits of Brooklyn. Then Sierra receives a strange card depicting a beast called the Hound of Light—an image from the enigmatic, influential Deck of Worlds. The Deck tracks the players and powers of all the magical houses in the city, and when the ", " H", "Sierra and her friends love their new lives as shadowshapers, making art and creating change with the spirits of Brooklyn. Then Sierra receives a strange card depicting a beast called the Hound of Light—an image from the enigmatic, influential Deck of Worlds. The Deck tracks the players and powers of all the magical houses in the city, and when the ", " Hound begins to stalk Sierra through the streets, the shadowshapers know their next battle has arrived.", "Sierra and Shadowhouse have been thrust into an ancient struggle with enemies old and new—a struggle they didn’t want, but are determined to win. Revolution is brewing in the real world as well, as the shadowshapers lead the fight against systems that oppress their community. To protect her family and friends in every sphere, Sierra must take down the Hound and master the Deck of Worlds…or else she could lose all the things that matter most."], "author": "Daniel José Older", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-12 00:00:00", "ISBN": "0545952824"},
{"url": "https://www.goodreads.com/book/show/36444649-trazer", "num_ratings": "23", "num_reviews": "16", "avg_ratings": 3.96, "genres": ["Young Adult", "Science Fiction", "Young Adult", "Young Adult Science Fiction", "Did Not Finish"], "title": "Trazer: Kids of Stolen Tomorrow", "description": ["It’s the year 93 O.O. and Dara Adeleye is a student with a bright future and her life figured out. That is, until a chance encounter with a mysterious child changes everything.", "Dara lives in a world shaped by the Miracle of Elegua, an intervention by the gods in the fate of an", "It’s the year 93 O.O. and Dara Adeleye is a student with a bright future and her life figured out. That is, until a chance encounter with a mysterious child changes everything.", "Dara lives in a world shaped by the Miracle of Elegua, an intervention by the gods in the fate of an Earth on the brink of collapse decades before she was born. Exceptionally gifted as an artist, her day-to-day attentions are on excelling in school in order to rise above her lower-class upbringing and raise her friends and family out of the dreaded red vanes. But Earth is headed towards the brink again and it may just be the gift she doesn't know she has that can save it...", "Kristano Arvelo is a trazer--the term used for the graffiti writers of Dara's time, a once-slang that originated in her home town of Todirb Wall. The aimless leader of a local group of trazers, he may hold a key to unlocking Dara's hidden gifts. But it will come at the cost of the destiny she believed was hers."], "author": "Joseph Olumide Adegboyega-Edun", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-10-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6472451-ash", "num_ratings": "27,386", "num_reviews": "3,015", "avg_ratings": 3.62, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Fiction"], "title": "Ash", "description": ["In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she bel", "In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she believes that her wish may be granted.", "The day that Ash meets Kaisa, the King's Huntress, her heart begins to change. Instead of chasing fairies, Ash learns to hunt with Kaisa. Though their friendship is as delicate as a new bloom, it reawakens Ash's capacity for love-and her desire to live. But Sidhean has already claimed Ash for his own, and she must make a choice between fairy tale dreams and true love.", "Entrancing, empowering, and romantic, ", " is about the connection between life and love, and solitude and death, where transformation can come from even the deepest grief."], "author": "Malinda Lo", "num_pages": "264", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2010)", "Gaylactic Spectrum Award Nominee for Best Novel (2010)", "William C. Morris YA Debut Award Nominee (2010)", "James Tiptree Jr. Award Nominee for Longlist (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Andre Norton Award Nominee (2009)"], "places": [], "character_names": ["Aisling", "Kaisa", "Sidhean"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0316040096"},
{"url": "https://www.goodreads.com/book/show/16129174-long-division", "num_ratings": "2,184", "num_reviews": "414", "avg_ratings": 3.78, "genres": ["Fiction", "Science Fiction", "Time Travel", "Science Fiction"], "title": "Long Division", "description": ["Kiese Laymon’s debut novel is a Twain-esque exploration of celebrity, authorship, violence, religion, and coming of age in Post-Katrina Mississippi, written in a voice that’s alternately funny, lacerating, and wise. The book contains two interwoven stories. In the first, it’s 2013: after an on-stage meltdown during a nationally televised quiz contest, 14-year-old Citoyen \"", "Kiese Laymon’s debut novel is a Twain-esque exploration of celebrity, authorship, violence, religion, and coming of age in Post-Katrina Mississippi, written in a voice that’s alternately funny, lacerating, and wise. The book contains two interwoven stories. In the first, it’s 2013: after an on-stage meltdown during a nationally televised quiz contest, 14-year-old Citoyen \"City\" Coldson becomes an overnight YouTube celebrity. The next day, he’s sent to stay with his grandmother in the small coastal community of Melahatchie, where a young girl named Baize Shephard has recently disappeared.", "Before leaving, City is given a strange book without an author called ", " He learns that one of the book’s main characters is also named City Coldson--but ", " is set in 1985. This 1985 City, along with his friend and love-object, Shalaya Crump, discovers a way to travel into the future, and steals a laptop and cellphone from an orphaned teenage rapper called...Baize Shephard. They ultimately take these with them all the way back to 1964, to help another time-traveler they meet protect his family from the Klan.", "City’s two stories ultimately converge in the mysterious work shed behind his grandmother’s, where he discovers the key to Baize’s disappearance."], "author": "Kiese Laymon", "num_pages": "276", "awards": ["William Saroyan International Prize for Writing for Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-11 00:00:00", "ISBN": "1932841725"},
{"url": "https://www.goodreads.com/book/show/38896417-book-of-the-anointed", "num_ratings": "4", "num_reviews": "1", "avg_ratings": 3.75, "genres": ["Fantasy", "Urban Fantasy"], "title": "Book of the Anointed", "description": ["Dark Epic Thrilling", "If its chills and thrills you want, Book of the Anointed has them by the score.", "When sixteen-year-old Jaden Davis heads out to the mall one day, he hardly expects to hear the voice of The Creator commanding him to save a baby from a man possessed by a demon. And he’s shocked to discover that he can expel that demon with just his mind. Suddenly Jaden is in", "Dark Epic Thrilling", "If its chills and thrills you want, Book of the Anointed has them by the score.", "When sixteen-year-old Jaden Davis heads out to the mall one day, he hardly expects to hear the voice of The Creator commanding him to save a baby from a man possessed by a demon. And he’s shocked to discover that he can expel that demon with just his mind. Suddenly Jaden is introduced the secret order of the Anointed, warriors chosen by The Creator to hunt monsters that haunt us at night; such as vampires, demons, shape shifting assassins, and all devouring Locusts. Jaden is introduced with a vengeance when this demon returns to kill his mother. Now with the guidance of his new Shepherd, the friendship of three other Anointed, and protection of a guardian angel, he seeks to vanquish the malevolent force that destroyed his family.", "Perfect for fans of Buffy the Vampire Slayer, Teen Wolf, and Supernatural. If you love paranormal romances, urban fantasy, witty characters, Vampires, Shifters, Demons, Archangels, and tea sipping supernatural creatures, then Book of the Anointed is perfect for you."], "author": "J. Moon", "num_pages": "380", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-04-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13633978-final-life", "num_ratings": "261", "num_reviews": "118", "avg_ratings": 4.07, "genres": ["Fantasy", "Paranormal", "Young Adult", "Fantasy", "Romance"], "title": "Final Life", "description": ["For seventeen-year-old Dominique, nothing sucks more than being forced to move across the country during senior year. Angry and feeling alone, she thinks things can’t get any worse until her new neighbor pressures her into playing a psychic card game. When she touches the cards, she has a vision of a red desert where a malignant presence hints at past lives and threatens t", "For seventeen-year-old Dominique, nothing sucks more than being forced to move across the country during senior year. Angry and feeling alone, she thinks things can’t get any worse until her new neighbor pressures her into playing a psychic card game. When she touches the cards, she has a vision of a red desert where a malignant presence hints at past lives and threatens to kill her...again. ", "Convinced she’s gone crazy, Dominique struggles to forget the experience, but the vision follows her and intensifies with each repetition. Adding to her problems are two gorgeous guys she desperately tries to avoid. If Dominique is to put an end to the evil pursuing her, she must push through her fears and discover the secrets of her past. If she doesn’t, she’ll be dead. For real."], "author": "Rose Garcia", "awards": [], "places": ["Houston, Texas"], "character_names": [], "language": "English", "publish_date": "2012-05-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/38207146-catching-teller-crow", "num_ratings": "12", "num_reviews": "3", "avg_ratings": 4.08, "genres": ["Young Adult", "Paranormal", "Ghosts", "Cultural", "Australia", "Mystery", "Mystery", "Crime"], "title": "Catching Teller Crow", "description": ["Nothing's been the same for Beth Teller since she died. Her dad, a detective, is the only one who can see and hear her - and he's drowning in grief. But now they have a mystery to solve together. Who is Isobel Catching, and what's her connection to the fire that killed a man? What happened to the people who haven't been seen since the fire? As Beth unravels the mystery, sh", "Nothing's been the same for Beth Teller since she died. Her dad, a detective, is the only one who can see and hear her - and he's drowning in grief. But now they have a mystery to solve together. Who is Isobel Catching, and what's her connection to the fire that killed a man? What happened to the people who haven't been seen since the fire? As Beth unravels the mystery, she finds a shocking story lurking beneath the surface of a small town, and a friendship that lasts beyond one life and into another. ", "Told in two unforgettable voices, this gripping novel weaves together themes of grief, colonial history, violence, love and family."], "author": "Ambelin Kwaymullina", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/22752445-supermutant-magic-academy", "num_ratings": "5,348", "num_reviews": "791", "avg_ratings": 3.99, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Fantasy", "Young Adult", "Fiction", "Humor"], "title": "SuperMutant Magic Academy", "description": ["The ", " and ", " illustrator Jillian Tamaki is best known for co-creating the award-winning young adult graphic novels ", " and ", "—moody and atmospheric bestsellers. ", ", which she has been serializing online for the past four", "The ", " and ", " illustrator Jillian Tamaki is best known for co-creating the award-winning young adult graphic novels ", " and ", "—moody and atmospheric bestsellers. ", ", which she has been serializing online for the past four years, paints a teenaged world filled with just as much ennui and uncertainty, but also with a sharp dose of humor and irreverence. Tamaki deftly plays superhero and high-school Hollywood tropes against what adolescence is really like: The SuperMutant Magic Academy is a prep school for mutants and witches, but their paranormal abilities take a backseat to everyday teen concerns.", "Science experiments go awry, bake sales are upstaged, and the new kid at school is a cat who will determine the course of human destiny. In one strip, lizard-headed Trixie frets about her nonexistent modeling career; in another, the immortal Everlasting Boy tries to escape this mortal coil to no avail. Throughout it all, closeted Marsha obsesses about her unrequited crush, the cat-eared Wendy. Whether the magic is mundane or miraculous, Tamaki’s jokes are precise and devastating.", " has won two Ignatz Awards. This volume combines the most popular content from the webcomic with a selection of all-new, never-before-seen strips that conclude Tamaki’s account of life at the academy."], "author": "Jillian Tamaki", "num_pages": "276", "awards": ["Will Eisner Comic Industry Awards for Best Publication for Teens (ages 13-17) (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-28 00:00:00", "ISBN": "1770461981"},
{"url": "https://www.goodreads.com/book/show/23197837-the-belles", "num_ratings": "8,040", "num_reviews": "2,493", "avg_ratings": 3.9, "genres": ["Fantasy", "Young Adult", "Young Adult", "Young Adult Fantasy", "Fiction"], "title": "The Belles", "description": ["Camellia Beauregard is a Belle. In the opulent world of Orléans, Belles are revered, for they control Beauty, and Beauty is a commodity coveted above all else. In Orléans, the people are born gray, they are born damned, and only with the help of a Belle and her talents can they transform and be made beautiful.", "But it’s not enough for Camellia to be just a Belle. She wants t", "Camellia Beauregard is a Belle. In the opulent world of Orléans, Belles are revered, for they control Beauty, and Beauty is a commodity coveted above all else. In Orléans, the people are born gray, they are born damned, and only with the help of a Belle and her talents can they transform and be made beautiful.", "But it’s not enough for Camellia to be just a Belle. She wants to be the favorite—the Belle chosen by the Queen of Orléans to live in the royal palace, to tend to the royal family and their court, to be recognized as the most talented Belle in the land. But once Camellia and her Belle sisters arrive at court, it becomes clear that being the favorite is not everything she always dreamed it would be. Behind the gilded palace walls live dark secrets, and Camellia soon learns that the very essence of her existence is a lie—that her powers are far greater, and could be more dangerous, than she ever imagined. And when the queen asks Camellia to risk her own life and help the ailing princess by using Belle powers in unintended ways, Camellia now faces an impossible decision. ", "With the future of Orléans and its people at stake, Camellia must decide—save herself and her sisters and the way of the Belles—or resuscitate the princess, risk her own life, and change the ways of her world forever."], "author": "Dhonielle Clayton", "num_pages": "440", "awards": [], "places": [], "character_names": ["Camellia Beauregard"], "language": "English", "publish_date": "2018-02-06 00:00:00", "ISBN": "1484728491"},
{"url": "https://www.goodreads.com/book/show/10345255-quantum-coin", "num_ratings": "237", "num_reviews": "43", "avg_ratings": 3.77, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Fiction", "Science Fiction", "Time Travel"], "title": "Quantum Coin", "description": ["Ephraim thought his universe-hopping days were over. He's done wishing for magic solutions to his problems; his quantum coin has been powerless for almost a year, and he's settled into a normal life with his girlfriend, Jena. But then an old friend crashes their senior prom: Jena's identical twin from a parallel world, Zoe.", "Zoe's timing couldn't be worse. It turns out that", "Ephraim thought his universe-hopping days were over. He's done wishing for magic solutions to his problems; his quantum coin has been powerless for almost a year, and he's settled into a normal life with his girlfriend, Jena. But then an old friend crashes their senior prom: Jena's identical twin from a parallel world, Zoe.", "Zoe's timing couldn't be worse. It turns out that Ephraim's problems have just begun, and they're much more complicated than his love life: The multiverse is at stake—and it might just be Ephraim's fault.", "Ephraim, Jena, and Zoe embark on a mission across multiple worlds to learn what's going wrong and how to stop it. They will have to draw on every resource available and trust in alternate versions of themselves and their friends, before it's too late for all of them.", "If Ephraim and his companions can put their many differences aside and learn to work together, they might have a chance to save the multiverse. But ultimately, the solution may depend on how much they're willing to sacrifice for the sake of humanity...and each other."], "author": "E.C. Myers", "num_pages": "340", "awards": ["Chesley Award Nominee for Hardback cover (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-23 00:00:00", "ISBN": "1616146826"},
{"url": "https://www.goodreads.com/book/show/10744752-adaptation", "num_ratings": "6,337", "num_reviews": "921", "avg_ratings": 3.62, "genres": ["Young Adult", "Science Fiction", "Lgbt", "Fiction", "Glbt", "Queer"], "title": "Adaptation", "description": ["Reese can’t remember anything from the time between the accident and the day she woke up almost a month later. She only knows one thing: She’s different now.", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of tra", "Reese can’t remember anything from the time between the accident and the day she woke up almost a month later. She only knows one thing: She’s different now.", "Across North America, flocks of birds hurl themselves into airplanes, causing at least a dozen to crash. Thousands of people die. Fearing terrorism, the United States government grounds all flights, and millions of travelers are stranded.", "Reese and her debate team partner and longtime crush David are in Arizona when it happens. Everyone knows the world will never be the same. On their drive home to San Francisco, along a stretch of empty highway at night in the middle of Nevada, a bird flies into their headlights. The car flips over. When they wake up in a military hospital, the doctor won’t tell them what happened, where they are—or how they’ve been miraculously healed.", "Things become even stranger when Reese returns home. San Francisco feels like a different place with police enforcing curfew, hazmat teams collecting dead birds, and a strange presence that seems to be following her. When Reese unexpectedly collides with the beautiful Amber Gray, her search for the truth is forced in an entirely new direction—and threatens to expose a vast global conspiracy that the government has worked for decades to keep secret."], "author": "Malinda Lo", "num_pages": "386", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-18 00:00:00", "ISBN": "0316197963"},
{"url": "https://www.goodreads.com/book/show/18949036-me-squared", "num_ratings": "21", "num_reviews": "9", "avg_ratings": 3.29, "genres": ["Science Fiction", "Literature", "American"], "title": "Me Squared", "description": ["Hildan Hegennerry was an ordinary kid- he had good parents, a great best friend, and a clone. Well, that part's not so ordinary, is it? ", "Join Hildan on an action-packed adventure as he unveils dark secrets and discovers what it's like to have a brother. ", "Me Squared is more than an adventure- it also tackles some very important issues regarding bioethics and human cloning- wh", "Hildan Hegennerry was an ordinary kid- he had good parents, a great best friend, and a clone. Well, that part's not so ordinary, is it? ", "Join Hildan on an action-packed adventure as he unveils dark secrets and discovers what it's like to have a brother. ", "Me Squared is more than an adventure- it also tackles some very important issues regarding bioethics and human cloning- whether anybody likes it or not, the future is coming, and with it come questions without obvious answers. Me Squared dares you to begin thinking about those questions right now."], "author": "Jourdan Cameron", "num_pages": "154", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20765150-final-stand", "num_ratings": "100", "num_reviews": "54", "avg_ratings": 4.61, "genres": ["Young Adult", "Fantasy", "Paranormal", "Science Fiction", "Time Travel", "Fantasy"], "title": "Final Stand", "description": ["Dominique is still alive after killing Tavion, the Tainted who's hunted her for lifetimes. Yet her protectors still fear for her life. They force her to flee Houston and abandon the friends she loves. But they can't protect her from herself. When Dominique starts hearing Tavion's voice in her head, she realizes that her personal connection to the Tainted still exists. And", "Dominique is still alive after killing Tavion, the Tainted who's hunted her for lifetimes. Yet her protectors still fear for her life. They force her to flee Houston and abandon the friends she loves. But they can't protect her from herself. When Dominique starts hearing Tavion's voice in her head, she realizes that her personal connection to the Tainted still exists. And when her car is ambushed, she discovers another frightening truth—someone close to her is a traitor.", "Desperate for answers, Dominique seeks the aid of first lifers Trent and Infiniti. With their help, she hopes to find her new enemy. But things get complicated with Trent because of her emotional pull toward Farrell, and even more complicated when the whispers in her head threaten her loved ones. Determined to live, Dominique decides to make a final stand against the forces that want to end her. For good."], "author": "Rose Garcia", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/34322019-paper-wishes", "num_ratings": "28", "num_reviews": "14", "avg_ratings": 4.54, "genres": ["Young Adult", "Romance", "Fantasy", "Contemporary"], "title": "Paper Wishes", "description": ["Alternate Cover Edition: 1523805080 (ISBN13: 9781523805082) ", "There is a belief that with each origami star folded, a falling star is saved. After folding 365 stars while mourning the loss of her mother, Vilvian makes a wish that will change her life forever. ", "Enter Nox Bright, the handsome and mysterious guy who has been haunting Vilvian's dreams. She can barely believe it w", "Alternate Cover Edition: 1523805080 (ISBN13: 9781523805082) ", "There is a belief that with each origami star folded, a falling star is saved. After folding 365 stars while mourning the loss of her mother, Vilvian makes a wish that will change her life forever. ", "Enter Nox Bright, the handsome and mysterious guy who has been haunting Vilvian's dreams. She can barely believe it when he walks into her homeroom near the end of the school year. Has she gone crazy or is it possible that wishes really do come true?"], "author": "Spencer Hoshino", "num_pages": "212", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24911687-final-death", "num_ratings": "62", "num_reviews": "37", "avg_ratings": 4.65, "genres": ["Young Adult", "Science Fiction", "Time Travel", "Fantasy", "Paranormal", "Science Fiction"], "title": "Final Death", "description": ["Dominique has conquered the evil within her, only to find her one true love now has to kill her. Desperate to save her friends and loved ones from sharing her fate, Dominique ditches her companions in an effort to protect them. With Trent left for dead in the past, she has no idea that Infiniti and Fleet have banded together, facing their own adversity as they struggle to", "Dominique has conquered the evil within her, only to find her one true love now has to kill her. Desperate to save her friends and loved ones from sharing her fate, Dominique ditches her companions in an effort to protect them. With Trent left for dead in the past, she has no idea that Infiniti and Fleet have banded together, facing their own adversity as they struggle to find her.", "Sure of nothing, and trusting someone from her first life who promises to be on her side, Dominique decides to set out on her own mission: kill before being killed. With time running out and her friends in hot pursuit, Dominique is hell bent on finishing what was started nine lives ago. Or finally face her final death."], "author": "Rose Garcia", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/38620899-the-hate-u-give", "num_ratings": "168,987", "num_reviews": "28,492", "avg_ratings": 4.56, "genres": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "title": "The Hate U Give", "description": ["A National Book Award Longlist and Morris Award Finalist title with eight starred reviews! #1 New York Times Bestseller!", "This must-have collector’s edition includes a letter from the author; the meanings behind the names in The Hate U Give; an excerpt from the stories that inspired the novel; a map of Garden Heights; gorgeous fan art; and a sneak peek at On the Come Up, Ang", "A National Book Award Longlist and Morris Award Finalist title with eight starred reviews! #1 New York Times Bestseller!", "This must-have collector’s edition includes a letter from the author; the meanings behind the names in The Hate U Give; an excerpt from the stories that inspired the novel; a map of Garden Heights; gorgeous fan art; and a sneak peek at On the Come Up, Angie Thomas’s next novel.", "Sixteen-year-old Starr Carter moves between two worlds: the poor neighborhood where she lives and the fancy suburban prep school she attends. The uneasy balance between these worlds is shattered when Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Khalil was unarmed."], "author": "Angie Thomas", "num_pages": "464", "awards": ["National Book Award Nominee for Young People's Literature (2017)", "Odyssey Award (2018)", "Los Angeles Times Book Prize Nominee for Young Adult Literature (2017)", "Edgar Award Nominee for Best Young Adult (2018)", "Coretta Scott King Award Nominee for Author Honor (2018)", "Boston Globe-Horn Book Award for Fiction (2017)", "Lincoln Award Nominee (2019)", "Kirkus Prize Nominee for Young Readers' Literature (2017)", "Goodreads Choice Award for Young Adult Fiction & for Debut Goodreads Author (2017)", "Carnegie Medal Nominee (2018)", "NAACP Image Award Nominee for Youth/Teens (2018)", "Michael L. Printz Honor Award (2018)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2018-02-27 00:00:00", "ISBN": "0062853333"},
{"url": "https://www.goodreads.com/book/show/714902.Noughts_Crosses", "num_ratings": "37,652", "num_reviews": "2,732", "avg_ratings": 4.23, "genres": ["Young Adult", "Romance", "Science Fiction", "Dystopia", "Fiction"], "title": "Noughts & Crosses", "description": ["Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.", "Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their", "Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.", "Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their world, Noughts and Crosses simply don’t mix. Against a background of prejudice and distrust, intensely highlighted by violent terrorist activity, a romance builds between Sephy and Callum -- a romance that is to lead both of them into terrible danger. Can they possibly find a way to be together?"], "author": "Malorie Blackman", "num_pages": "490", "awards": ["FCBG Children’s Book Award (2002)", "Sheffields Children's Book of the Year (2002)", "Wirral Children’s Paperback of the Year Award (2003)", "Lancashire Children’s Book of the Year Award (2002)", "North East Teenage Book Award Nominee (2002)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2009)"], "places": [], "character_names": ["Callum McGregor", "Persephone 'Sephy' Hadley"], "language": "English", "publish_date": "2006-08-08 00:00:00", "ISBN": "0552555703"},
{"url": "https://www.goodreads.com/book/show/10129062-prophecy", "num_ratings": "3,385", "num_reviews": "535", "avg_ratings": 3.45, "genres": ["Fantasy", "Young Adult", "Fantasy", "Dragons", "Fantasy", "Magic", "Paranormal", "Demons"], "title": "Prophecy", "description": ["Kira’s the only female in the king’s army, and the prince’s bodyguard. She’s a demon slayer and an outcast, hated by nearly everyone in her home city of Hansong. And, she’s their only hope...", "Murdered kings and discovered traitors point to a demon invasion, sending Kira on the run with the young", "Kira’s the only female in the king’s army, and the prince’s bodyguard. She’s a demon slayer and an outcast, hated by nearly everyone in her home city of Hansong. And, she’s their only hope...", "Murdered kings and discovered traitors point to a demon invasion, sending Kira on the run with the young prince. He may be the savior predicted in the Dragon King Prophecy, but the missing treasure of myth may be the true key. With only the guidance of the cryptic prophecy, Kira must battle demon soldiers, evil shaman, and the Demon Lord himself to find what was once lost and raise a prince into a king.", "Intrigue and mystery, ancient lore and action-packed fantasy come together in this heart-stopping first book in a trilogy."], "author": "Ellen Oh", "num_pages": "316", "awards": [], "places": [], "character_names": ["Kang Kira", "Prince Kim Taejo", "Kim Jaewon", "Kang Kwan", "Brother Woojin", "Seung", "Shin Bo Hyun"], "language": "English", "publish_date": "2013-01-02 00:00:00", "ISBN": "0062091093"},
{"url": "https://www.goodreads.com/book/show/9378297-anna-dressed-in-blood", "num_ratings": "84,394", "num_reviews": "9,179", "avg_ratings": 3.95, "genres": ["Young Adult", "Horror", "Fantasy", "Paranormal", "Fantasy", "Paranormal", "Ghosts", "Romance"], "title": "Anna Dressed in Blood", "description": ["Cas Lowood has inherited an unusual vocation: He kills the dead.", "So did his father before him, until he was gruesomely murdered by a ghost he sought to kill. Now, armed with his father's mysterious and deadly athame, Cas travels the country with his kitchen-witch mother and their spirit-sniffing cat. They follow legends and local lore, destroy the murderous dead, and keep p", "Cas Lowood has inherited an unusual vocation: He kills the dead.", "So did his father before him, until he was gruesomely murdered by a ghost he sought to kill. Now, armed with his father's mysterious and deadly athame, Cas travels the country with his kitchen-witch mother and their spirit-sniffing cat. They follow legends and local lore, destroy the murderous dead, and keep pesky things like the future and friends at bay.", "Searching for a ghost the locals call Anna Dressed in Blood, Cas expects the usual: track, hunt, kill. What he finds instead is a girl entangled in curses and rage, a ghost like he's never faced before. She still wears the dress she wore on the day of her brutal murder in 1958: once white, now stained red and dripping with blood. Since her death, Anna has killed any and every person who has dared to step into the deserted Victorian she used to call home.", "Yet she spares Cas's life."], "author": "Kendare Blake", "num_pages": "316", "awards": ["Lincoln Award Nominee (2015)", "Endeavour Award Nominee (2012)", "Cybils Award Nominee for Fantasy & Science Fiction (Young Adult) (2011)", "Missouri Gateway Readers Award Nominee (2014)"], "places": ["Thunder Bay, Ontario"], "character_names": ["Cas Lowood", "Anna Korlov"], "language": "English", "publish_date": "2011-10-17 00:00:00", "ISBN": "0765328658"},
{"url": "https://www.goodreads.com/book/show/6076675-the-melancholy-of-haruhi-suzumiya", "num_ratings": "3,644", "num_reviews": "264", "avg_ratings": 3.94, "genres": ["Novels", "Light Novel", "Fantasy", "Sequential Art", "Manga", "Young Adult", "Fiction", "Science Fiction"], "title": "The Melancholy of Haruhi Suzumiya", "description": ["Meet Haruhi—a cute, determined girl, starting high school in a city where nothing exciting happens and absolutely no one understands her.", "Meet Kyon—the sarcastic guy who sits behind Haruhi in homeroom and the only boy Haruhi has ever opened up to. His fate is now tied to hers.", "Meet the S.O.", "Meet Haruhi—a cute, determined girl, starting high school in a city where nothing exciting happens and absolutely no one understands her.", "Meet Kyon—the sarcastic guy who sits behind Haruhi in homeroom and the only boy Haruhi has ever opened up to. His fate is now tied to hers.", "Meet the S.O.S. Brigade—an after-school club organized by Haruhi with a mission to seek out the extraordinary. Oh, and their second mission? Keeping Haruhi happy—because even though she doesn't know it, Haruhi has the power to destroy the universe. Seriously."], "author": "Nagaru Tanigawa", "num_pages": "202", "awards": ["Nihon SF Taishō Award 日本SF大賞"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-12 00:00:00", "ISBN": "0316039020"},
{"url": "https://www.goodreads.com/book/show/9580832-the-boy-at-the-end-of-the-world", "num_ratings": "926", "num_reviews": "211", "avg_ratings": 3.83, "genres": ["Science Fiction", "Childrens", "Middle Grade", "Young Adult", "Adventure", "Fiction", "Science Fiction", "Dystopia"], "title": "The Boy at the End of the World", "description": ["Fisher is the last boy on earth-and things are not looking good for the human race. Only Fisher made it out alive after the carefully crafted survival bunker where Fisher and dozens of other humans had been sleeping was destroyed.", "Luckily, Fisher is not totally alone. He meets a broken robot he names Click, whose programmed purpose-to help Fisher \"continue existing\"-makes i", "Fisher is the last boy on earth-and things are not looking good for the human race. Only Fisher made it out alive after the carefully crafted survival bunker where Fisher and dozens of other humans had been sleeping was destroyed.", "Luckily, Fisher is not totally alone. He meets a broken robot he names Click, whose programmed purpose-to help Fisher \"continue existing\"-makes it act an awful lot like an overprotective parent. Together, Fisher and Click uncover evidence that there may be a second survival bunker far to the west. In prose that skips from hilarious to touching and back in a heartbeat, Greg van Eekhout brings us a thrilling story of survival that becomes a journey to a new hope-if Fisher can continue existing long enough to get there."], "author": "Greg Van Eekhout", "num_pages": "224", "awards": ["Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)", "Washington State Sasquatch Award Nominee (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-06-21 00:00:00", "ISBN": "1599905248"},
{"url": "https://www.goodreads.com/book/show/6475623-a-wish-after-midnight", "num_ratings": "394", "num_reviews": "85", "avg_ratings": 3.62, "genres": ["Young Adult", "Fantasy", "Historical", "Historical Fiction", "Science Fiction", "Time Travel", "Historical", "Fiction"], "title": "A Wish After Midnight", "description": ["Genna Colon desperately wants to escape from a drug-infested world of poverty, and every day she wishes for a different life. One day Genna's wish is granted and she is instantly transported back to Civil War-era Brooklyn."], "author": "Zetta Elliott", "num_pages": "244", "awards": [], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": null, "publish_date": "2009-08-12 00:00:00", "ISBN": "1441474242"},
{"url": "https://www.goodreads.com/book/show/7326859-rocket-girls", "num_ratings": "91", "num_reviews": "20", "avg_ratings": 3.3, "genres": ["Science Fiction", "Young Adult", "Space", "Novels", "Light Novel", "Cultural", "Japan"], "title": "Rocket Girls", "description": ["Yukari Morita is a high school girl on a quest to find her missing father. While searching for him on the Solomon Islands, she receives the offer of a lifetime—she'll get the help she needs to find her father, and all she need do in return is become the world's youngest, lightest astronaut. Yukari and her teen friends, all petite, are the perfect crew and cargo for the Sol", "Yukari Morita is a high school girl on a quest to find her missing father. While searching for him on the Solomon Islands, she receives the offer of a lifetime—she'll get the help she needs to find her father, and all she need do in return is become the world's youngest, lightest astronaut. Yukari and her teen friends, all petite, are the perfect crew and cargo for the Solomon Space Association's launches, or will be once they complete their rigorous and sometimes dangerous training."], "author": "Housuke Nojiri", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-21 00:00:00", "ISBN": "1421536420"},
{"url": "https://www.goodreads.com/book/show/626339.Nausica_of_the_Valley_of_the_Wind_Vol_1", "num_ratings": "6,062", "num_reviews": "246", "avg_ratings": 4.45, "genres": ["Sequential Art", "Manga", "Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Fantasy", "Science Fiction"], "title": "Nausicaä of the Valley of the Wind, Vol. 1", "description": ["In a long-ago war, humankind set off a devastating ecological disaster. Thriving industrial societies disappeared. The earth is slowly submerging beneath the expanding Sea of Corruption, an enormous toxic forest that creates mutant insects and releases a miasma of poisonous spores into the air. ", "At the periphery of the sea, tiny kingdoms are scattered on tiny parcels of lan", "In a long-ago war, humankind set off a devastating ecological disaster. Thriving industrial societies disappeared. The earth is slowly submerging beneath the expanding Sea of Corruption, an enormous toxic forest that creates mutant insects and releases a miasma of poisonous spores into the air. ", "At the periphery of the sea, tiny kingdoms are scattered on tiny parcels of land. Here lies the Valley of the Wind, a kingdom of barely 500 citizens; a nation given fragile protection from the decaying sea's poisons by the ocean breezes; and home to Nausicaä .", "Nausicaä, a young princess, has an emphatic bond with the giant Ohmu insects and animals of every creed. She fights to create tolerance, understanding and patience among empires that are fighting over the world's remaining precious natural resources."], "author": "Hayao Miyazaki", "num_pages": "130", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-03-10 00:00:00", "ISBN": "1591164087"},
{"url": "https://www.goodreads.com/book/show/27969081-labyrinth-lost", "num_ratings": "6,327", "num_reviews": "1,683", "avg_ratings": 3.76, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fantasy", "Paranormal", "Fiction"], "title": "Labyrinth Lost", "description": ["▶ ", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whos", "▶ ", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whose intentions are as dark as the strange marks on his skin.", "The only way to get her family back is to travel with Nova to Los Lagos, a land in-between, as dark as Limbo and as strange as Wonderland..."], "author": "Zoraida Córdova", "num_pages": "324", "awards": [], "places": ["Los Lagos realm, Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2016-09-06 00:00:00", "ISBN": "1492620947"},
{"url": "https://www.goodreads.com/book/show/11043618-what-s-left-of-me", "num_ratings": "14,528", "num_reviews": "2,009", "avg_ratings": 3.79, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Fantasy"], "title": "What's Left of Me", "description": ["Eva and Addie started out the same way as everyone else—two souls woven together in one body, taking turns controlling their movements as they learned how to walk, how to sing, how to dance. But as they grew, so did the worried whispers. Why aren’t they settling? Why isn’t one of them fading? The doctors ran tests, the neighbors shied away, and", "Eva and Addie started out the same way as everyone else—two souls woven together in one body, taking turns controlling their movements as they learned how to walk, how to sing, how to dance. But as they grew, so did the worried whispers. Why aren’t they settling? Why isn’t one of them fading? The doctors ran tests, the neighbors shied away, and their parents begged for more time. Finally Addie was pronounced healthy and Eva was declared gone. Except, she wasn’t . . .", "For the past three years, Eva has clung to the remnants of her life. Only Addie knows she’s still there, trapped inside their body. Then one day, they discover there may be a way for Eva to move again. The risks are unimaginable-hybrids are considered a threat to society, so if they are caught, Addie and Eva will be locked away with the others. And yet . . . for a chance to smile, to twirl, to speak, Eva will do anything."], "author": "Kat Zhang", "num_pages": "343", "awards": [], "places": ["Americas"], "character_names": ["Eva Tamsyn", "Addie Tamsyn", "Ryan Mullan", "Hally Mullan"], "language": "English", "publish_date": "2012-09-18 00:00:00", "ISBN": "0062114875"},
{"url": "https://www.goodreads.com/book/show/20558124-thorn", "num_ratings": "4,500", "num_reviews": "722", "avg_ratings": 4.01, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Fairy Tales", "Retellings"], "title": "Thorn", "description": ["Princess Alyrra has never enjoyed the security or power of her rank. Between her family's cruelty and the court's contempt, she has spent her life in the shadows. Forced to marry a powerful foreign prince, Alyrra embarks on a journey to meet her betrothed with little hope for a better future.", "B", "Princess Alyrra has never enjoyed the security or power of her rank. Between her family's cruelty and the court's contempt, she has spent her life in the shadows. Forced to marry a powerful foreign prince, Alyrra embarks on a journey to meet her betrothed with little hope for a better future.", "But powerful men have powerful enemies--and now, so does Alyrra. Betrayed during a magical attack, her identity is switched with another woman's, giving Alyrra the first choice she's ever had: to start a new life for herself or fight for a prince she's never met. But Alyrra soon finds that Prince Kestrin is not at all what she expected. While walking away will cost Kestrin his life, returning to the court may cost Alyrra her own. As Alyrra is coming to realize, sometime the hardest choice means learning to trust herself.", " will be re-released by HarperTeen in Winter 2019."], "author": "Intisar Khanani", "num_pages": "246", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1257586.Zahrah_the_Windseeker", "num_ratings": "1,667", "num_reviews": "289", "avg_ratings": 4.12, "genres": ["Fantasy", "Young Adult", "Fiction", "Science Fiction", "Cultural", "Africa", "Childrens", "Middle Grade"], "title": "Zahrah the Windseeker", "description": ["In the northern Ooni Kingdom, fear of the unknown runs deep, and children born dada are rumored to have special powers. Thirteen-year-old Zahrah Tsami feels like a normal girl -- she grows her own flora computer, has mirrors sewn onto her clothes, and stays clear of the Forbidden Greeny Jungle. But unlike other kids in the village of Kirki, Zahrah was born with the telling", "In the northern Ooni Kingdom, fear of the unknown runs deep, and children born dada are rumored to have special powers. Thirteen-year-old Zahrah Tsami feels like a normal girl -- she grows her own flora computer, has mirrors sewn onto her clothes, and stays clear of the Forbidden Greeny Jungle. But unlike other kids in the village of Kirki, Zahrah was born with the telling dadalocks. Only her best friend, Dari, isn't afraid of her, even when something unusual begins happening -- something that definitely makes Zahrah different. The two friends investigate, edging closer and closer to danger. When Dari's life is threatened. Zahrah must face her worst fears alone, including the very thing that makes her different.", "In this exciting debut novel by Nnedi Okorafor-Mbachu, things aren't always what they seem -- monkeys tell fortunes, plants offer wisdom, and a teenage girl is the only one who stands a chance at saving her best friend's life.", "-from the Hardcover edition"], "author": "Nnedi Okorafor", "num_pages": "308", "awards": ["Wole Soyinka Prize for Literature in Africa  (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-26 00:00:00", "ISBN": "0618340904"},
{"url": "https://www.goodreads.com/book/show/9415946-huntress", "num_ratings": "9,275", "num_reviews": "981", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Glbt", "Queer"], "title": "Huntress", "description": ["Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, th", "Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, the city of the Fairy Queen. Taisin is a sage, thrumming with magic, and Kaede is of the earth, without a speck of the otherworldly. And yet the two girls' destinies are drawn together during the mission. As members of their party succumb to unearthly attacks and fairy tricks, the two come to rely on each other and even begin to fall in love. But the Kingdom needs only one huntress to save it, and what it takes could tear Kaede and Taisin apart forever.", "The exciting adventure prequel to Malinda Lo's highly acclaimed novel ", "is overflowing with lush Chinese influences and details inspired by the ", ", and is filled with action and romance."], "author": "Malinda Lo", "num_pages": "371", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2012)", "James Tiptree Jr. Award Nominee for Longlist (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "031604007X"},
{"url": "https://www.goodreads.com/book/show/18798983-the-wrath-and-the-dawn", "num_ratings": "82,790", "num_reviews": "14,010", "avg_ratings": 4.17, "genres": ["Fantasy", "Young Adult", "Romance", "Retellings"], "title": "The Wrath and the Dawn", "description": ["In a land ruled by a murderous boy-king, each dawn brings heartache to a new family. Khalid, the eighteen-year-old Caliph of Khorasan, is a monster. Each night he takes a new bride only to have a silk cord wrapped around her throat come morning. When sixteen-year-old Shahrzad's dearest friend falls victim to Khalid, Shahrzad vows vengeance and voluntee", "In a land ruled by a murderous boy-king, each dawn brings heartache to a new family. Khalid, the eighteen-year-old Caliph of Khorasan, is a monster. Each night he takes a new bride only to have a silk cord wrapped around her throat come morning. When sixteen-year-old Shahrzad's dearest friend falls victim to Khalid, Shahrzad vows vengeance and volunteers to be his next bride. Shahrzad is determined not only to stay alive, but to end the caliph's reign of terror once and for all.", "Night after night, Shahrzad beguiles Khalid, weaving stories that enchant, ensuring her survival, though she knows each dawn could be her last. But something she never expected begins to happen: Khalid is nothing like what she'd imagined him to be. This monster is a boy with a tormented heart. Incredibly, Shahrzad finds herself falling in love. How is this possible? It's an unforgivable betrayal. Still, Shahrzad has come to understand all is not as it seems in this palace of marble and stone. She resolves to uncover whatever secrets lurk and, despite her love, be ready to take Khalid's life as retribution for the many lives he's stolen. Can their love survive this world of stories and secrets?"], "author": "Renee Ahdieh", "num_pages": "404", "awards": ["Milwaukee County Teen Book Award Nominee (2016)", "Lincoln Award Nominee (2018)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-12 00:00:00", "ISBN": "0399171614"},
{"url": "https://www.goodreads.com/book/show/18509623-the-girl-from-the-well", "num_ratings": "5,515", "num_reviews": "1,147", "avg_ratings": 3.77, "genres": ["Horror", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Paranormal", "Ghosts", "Mystery"], "title": "The Girl from the Well", "description": [" ", "A dead girl walks the streets.", "She hunts murderers. Child killers, much like the man who threw her body down a well three hundred years ago.", "And when a s", " ", "A dead girl walks the streets.", "She hunts murderers. Child killers, much like the man who threw her body down a well three hundred years ago.", "And when a strange boy bearing stranger tattoos moves into the neighborhood so, she discovers, does something else. And soon both will be drawn into the world of eerie doll rituals and dark Shinto exorcisms that will take them from American suburbia to the remote valleys and shrines of Aomori, Japan.", "Because the boy has a terrifying secret - one that would just ", " to get out. ", " is A YA Horror novel pitched as \"Dexter\" meets \"The Grudge\", based on a well-loved Japanese ghost story."], "author": "Rin Chupeco", "num_pages": "267", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-05 00:00:00", "ISBN": "140229218X"},
{"url": "https://www.goodreads.com/book/show/13552764-the-interrogation-of-ashala-wolf", "num_ratings": "1,711", "num_reviews": "341", "avg_ratings": 3.84, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Dystopia", "Science Fiction"], "title": "The Interrogation of Ashala Wolf", "description": ["Ashala Wolf has been captured by Chief Administrator Neville Rose. A man", "Ashala Wolf has been captured by Chief Administrator Neville Rose. A man who is intent on destroying Ashala’s Tribe — the runaway Illegals hiding in the Firstwood. Injured and vulnerable and with her Sleepwalker ability blocked, Ashala is forced to succumb to the machine that will pull secrets from her mind. ", "And right beside her is Justin Connor, her betrayer, watching her every move. ", "Will the Tribe survive the interrogation of Ashala Wolf?"], "author": "Ambelin Kwaymullina", "num_pages": "395", "awards": ["Aurealis Award Nominee for Science Fiction & Young Adult Novel (2012)", "The Inky Awards Nominee for Gold Inky (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-12 00:00:00", "ISBN": "1921720085"},
{"url": "https://www.goodreads.com/book/show/13062488-the-lost-girl", "num_ratings": "5,748", "num_reviews": "829", "avg_ratings": 3.88, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fantasy"], "title": "The Lost Girl", "description": ["Eva’s life is not her own. She is a creation, an abomination—an echo. Made by the Weavers as a copy of someone else, she is expected to replace a girl named Amarra, her “other”, if she ever died. Eva studies what Amarra does, what she eats, what it’s like to kiss her boyfriend, Ray. So when Amarra is killed in a car crash, Eva should be ready.", "But fifteen years of studying", "Eva’s life is not her own. She is a creation, an abomination—an echo. Made by the Weavers as a copy of someone else, she is expected to replace a girl named Amarra, her “other”, if she ever died. Eva studies what Amarra does, what she eats, what it’s like to kiss her boyfriend, Ray. So when Amarra is killed in a car crash, Eva should be ready.", "But fifteen years of studying never prepared her for this.", "Now she must abandon everything she’s ever known—the guardians who raised her, the boy she’s forbidden to love—to move to India and convince the world that Amarra is still alive.", "What Eva finds is a grief-stricken family; parents unsure how to handle this echo they thought they wanted; and Ray, who knew every detail, every contour of Amarra. And when Eva is unexpectedly dealt a fatal blow that will change her existence forever, she is forced to choose: Stay and live out her years as a copy or leave and risk it all for the freedom to be an original. To be Eva.", "From debut novelist Sangu Mandanna comes the dazzling story of a girl who was always told what she had to be—until she found the strength to decide for herself."], "author": "Sangu Mandanna", "num_pages": "432", "awards": [], "places": ["Windermere, Cumbria, England", "Bangalore"], "character_names": [], "language": "English", "publish_date": "2012-08-28 00:00:00", "ISBN": "0062082310"},
{"url": "https://www.goodreads.com/book/show/10151730-fair-coin", "num_ratings": "1,223", "num_reviews": "262", "avg_ratings": 3.47, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Fiction", "Science Fiction", "Time Travel"], "title": "Fair Coin", "description": ["Epraim is horrified when he comes home from school one day to find his mother unconscious at the kitchen table, clutching a bottle of pills. Even more disturbing than her suicide attempt is the reason for it: the dead boy she identified at the hospital that afternoon--a boy who looks exactly like him. While examining his dead double's belongings, Ephraim discovers a strang", "Epraim is horrified when he comes home from school one day to find his mother unconscious at the kitchen table, clutching a bottle of pills. Even more disturbing than her suicide attempt is the reason for it: the dead boy she identified at the hospital that afternoon--a boy who looks exactly like him. While examining his dead double's belongings, Ephraim discovers a strange coin that makes his wishes come true each time he flips it. Before long, he's wished his alcoholic mother into a model parent, and the girl he's liked since second grade suddenly notices him. ", "But Ephraim soon realizes that the coin comes with consequences --several wishes go disastrously wrong, his best friend Nathan becomes obsessed with the coin, and the world begins to change in unexpected ways. As Ephraim learns the coin's secrets and how to control its power, he must find a way to keep it from Nathan and return to the world he remembers. (For ages 12 & up)"], "author": "E.C. Myers", "num_pages": "250", "awards": ["Compton Crook Award Nominee (2013)", "Sydney J. Bounds Award Nominee for Best New Writer Finalist (2013)", "Andre Norton Award for Young Adult Science Fiction and Fantasy (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-27 00:00:00", "ISBN": "1616146095"},
{"url": "https://www.goodreads.com/book/show/18465601-the-shadow-hero", "num_ratings": "7,167", "num_reviews": "757", "avg_ratings": 3.89, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Young Adult", "Fantasy", "Comics", "Superheroes", "Fiction", "Historical", "Historical Fiction"], "title": "The Shadow Hero", "description": ["A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. ", " is based on golden-age comic series ", ", whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American su", "A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. ", " is based on golden-age comic series ", ", whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American superhero.", "Now, exactly seventy years later, ", "-bestselling author Gene Luen Yang has revived this nearly forgotten, pioneering character in a new graphic novel that creates an origin story for the golden-age Green Turtle. ", "With artwork by the unmatched Sonny Liew, this hilarious and insightful graphic novel about heroism and heritage is also a loving tribute to the long, rich tradition of American superhero comics."], "author": "Gene Luen Yang", "num_pages": "176", "awards": ["Will Eisner Comic Industry Awards for Best Writer (for Gene Luen Yang) AND nominated for Best Publication for Teens (ages 13-17) (2015)", "Goodreads Choice Award Nominee for Graphic Novels & Comics (2014)", "Asian/Pacific American Award for Literature for Young Adult Honor (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-15 00:00:00", "ISBN": "1596436972"},
{"url": "https://www.goodreads.com/book/show/57891.Battle_Royale", "num_ratings": "44,846", "num_reviews": "4,278", "avg_ratings": 4.25, "genres": ["Fiction", "Science Fiction", "Dystopia", "Horror", "Science Fiction", "Young Adult", "Thriller"], "title": "Battle Royale", "description": ["Koushun Takami's notorious high-octane thriller is based on an irresistible premise: a class of junior high school students is taken to a deserted island where, as part of a ruthless authoritarian program, they are provided arms and forced to kill one another until only one survivor is left standing. Criticized as violent exploitation when first published in Japan - where", "Koushun Takami's notorious high-octane thriller is based on an irresistible premise: a class of junior high school students is taken to a deserted island where, as part of a ruthless authoritarian program, they are provided arms and forced to kill one another until only one survivor is left standing. Criticized as violent exploitation when first published in Japan - where it then proceeded to become a runaway bestseller - Battle Royale is a Lord of the Flies for the 21st century, a potent allegory of what it means to be young and (barely) alive in a dog-eat-dog world. Made into a controversial hit movie of the same name, Battle Royale is already a contemporary Japanese pulp classic, now available for the first time in the English language."], "author": "Koushun Takami", "num_pages": "617", "awards": [], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "2003-02-26 00:00:00", "ISBN": "156931778X"},
{"url": "https://www.goodreads.com/book/show/25733270-the-girl-from-everywhere", "num_ratings": "10,495", "num_reviews": "2,148", "avg_ratings": 3.71, "genres": ["Fantasy", "Young Adult", "Science Fiction", "Time Travel", "Historical", "Historical Fiction", "Fiction", "Science Fiction"], "title": "The Girl from Everywhere", "author": "Heidi Heilig", "num_pages": "469", "awards": ["Goodreads Choice Award Nominee for Debut Goodreads Author (2016)"], "places": ["Honolulu, Hawaii"], "character_names": ["Nix", "Kashmir"], "language": "English", "publish_date": "2016-02-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2887211-moribito", "num_ratings": "2,156", "num_reviews": "343", "avg_ratings": 3.99, "genres": ["Fantasy", "Young Adult", "Adventure", "Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature"], "title": "Moribito: Guardian of the Spirit", "description": ["You've never read a fantasy novel like this one! The deep well of Japanese myth merges with the Western fantasy tradition for a novel that's as rich in place and culture as it is hard to put down.", "Balsa was a wanderer and warrior for hire. Then she rescued a boy flung into a raging river -- and at that moment, her destiny changed. Now Balsa must protect the boy -- the Princ", "You've never read a fantasy novel like this one! The deep well of Japanese myth merges with the Western fantasy tradition for a novel that's as rich in place and culture as it is hard to put down.", "Balsa was a wanderer and warrior for hire. Then she rescued a boy flung into a raging river -- and at that moment, her destiny changed. Now Balsa must protect the boy -- the Prince Chagum -- on his quest to deliver the great egg of the water spirit to its source in the sea. As they travel across the land of Yogo and discover the truth about the spirit, they find themselves hunted by two deadly enemies: the egg-eating monster Rarunga . . . and the prince's own father. "], "author": "Nahoko Uehashi", "num_pages": "248", "awards": ["Batchelder Award (2009)", "Sankei Children's Book Award (1997)", "Beacon of Freedom Award (2009)"], "places": ["New Yogo"], "character_names": ["Balsa", "Chagum", "Tanda", "Torogai", "Shuga"], "language": "English", "publish_date": "2008-06-01 00:00:00", "ISBN": "0545005426"},
{"url": "https://www.goodreads.com/book/show/30077795-theonite", "num_ratings": "63", "num_reviews": "20", "avg_ratings": 4.37, "genres": ["Fantasy", "Fiction", "Science Fiction", "Adventure", "Young Adult"], "title": "Theonite: Planet Adyn", "description": ["Joan Messi has spent thirteen lonely years hiding her supernatural abilities from her parents, her classmates, and everyone in her quiet suburban community. However, her little world of secrets is shattered when a pair of strangers drop in from a parallel dimension on the hunt for a nameless criminal. Joan has spent her entire life wondering how she got her powers, but wit", "Joan Messi has spent thirteen lonely years hiding her supernatural abilities from her parents, her classmates, and everyone in her quiet suburban community. However, her little world of secrets is shattered when a pair of strangers drop in from a parallel dimension on the hunt for a nameless criminal. Joan has spent her entire life wondering how she got her powers, but with these inter-dimensional travelers and their mysterious quarry, she may have found the beginnings of an answer."], "author": "M.L.  Wang", "num_pages": "285", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1110224.Dragon_Sword_and_Wind_Child", "num_ratings": "904", "num_reviews": "107", "avg_ratings": 4.1, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Mythology", "Cultural", "Japan", "Asian Literature", "Japanese Literature"], "title": "Dragon Sword and Wind Child", "description": ["In the land of Toyoashihara, the forces of the God of Light and the Goddess of Darkness have waged war for generations. But for 15-year old Saya, the war is far away and unimportant--until the day she discovers she is the reincarnation of the Water Maiden and a princess of the Children of the Dark. Raised to love the Light and detest the Dark, Saya must come to terms with", "In the land of Toyoashihara, the forces of the God of Light and the Goddess of Darkness have waged war for generations. But for 15-year old Saya, the war is far away and unimportant--until the day she discovers she is the reincarnation of the Water Maiden and a princess of the Children of the Dark. Raised to love the Light and detest the Dark, Saya must come to terms with her heritage even as she is tumbled into the very heart of the conflict that is destroying her country. Both the army of the Light and Dark seek to claim her, for she is the only mortal who can awaken the legendary Dragon Sword, the weapon destined to end the war. Can Saya make the dreadful choice between the Light and Dark, or is she doomed like all the Water Maidens who have come before her?"], "author": "Noriko Ogiwara", "num_pages": "286", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-16 00:00:00", "ISBN": "1421515016"},
{"url": "https://www.goodreads.com/book/show/5577995-silver-phoenix", "num_ratings": "3,252", "num_reviews": "524", "avg_ratings": 3.57, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Romance"], "title": "Silver Phoenix", "description": ["No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that", "No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that her journey to the Palace of Fragrant Dreams isn't only a quest to find her beloved father but a venture with stakes larger than she could have imagined. ", " Bravery, intelligence, the will to fight and fight hard . . . she will need all of these things. Just as she will need the new and mysterious power growing within her. She will also need help. ", " It is Chen Yong who finds her partly submerged and barely breathing at the edge of a deep lake. There is something of unspeakable evil trying to drag her under. On a quest of his own, Chen Yong offers that help . . . and perhaps more."], "author": "Cindy Pon", "num_pages": "340", "awards": [], "places": [], "character_names": ["Ai Ling"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0061730211"},
{"url": "https://www.goodreads.com/book/show/33958230-forest-of-a-thousand-lanterns", "num_ratings": "4,061", "num_reviews": "1,221", "avg_ratings": 3.79, "genres": ["Fantasy", "Young Adult", "Retellings"], "title": "Forest of a Thousand Lanterns", "description": ["Eighteen-year-old Xifeng is beautiful. The stars say she is destined for greatness, that she is meant to be Empress of Feng Lu. But only if she embraces the darkness within her. Growing up as a peasant in a fo", "Eighteen-year-old Xifeng is beautiful. The stars say she is destined for greatness, that she is meant to be Empress of Feng Lu. But only if she embraces the darkness within her. Growing up as a peasant in a forgotten village on the edge of the map, Xifeng longs to fulfill the destiny promised to her by her cruel aunt, the witch Guma, who has read the cards and seen glimmers of Xifeng's majestic future. But is the price of the throne too high?", "Because in order to achieve greatness, she must spurn the young man who loves her and exploit the callous magic that runs through her veins--sorcery fueled by eating the hearts of the recently killed. For the god who has sent her on this journey will not be satisfied until his power is absolute."], "author": "Julie C. Dao", "num_pages": "363", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-10 00:00:00", "ISBN": "1524738298"},
{"url": "https://www.goodreads.com/book/show/15863832-angelfall", "num_ratings": "140,875", "num_reviews": "14,599", "avg_ratings": 4.17, "genres": ["Fantasy", "Young Adult", "Paranormal", "Angels", "Science Fiction", "Dystopia", "Fantasy", "Paranormal"], "title": "Angelfall", "description": ["It's been six weeks since angels of the apocalypse descended to demolish the modern world. Street gangs rule the day while fear and superstition rule the night. When warrior angels fly away with a helpless little girl, her seventeen-year-old sister Penryn will do anything to get her back.", "Anything, including making a deal with an enemy angel.", "Raffe is a warrior who lies brok", "It's been six weeks since angels of the apocalypse descended to demolish the modern world. Street gangs rule the day while fear and superstition rule the night. When warrior angels fly away with a helpless little girl, her seventeen-year-old sister Penryn will do anything to get her back.", "Anything, including making a deal with an enemy angel.", "Raffe is a warrior who lies broken and wingless on the street. After eons of fighting his own battles, he finds himself being rescued from a desperate situation by a half-starved teenage girl.", "Traveling through a dark and twisted Northern California, they have only each other to rely on for survival. Together, they journey toward the angels' stronghold in San Francisco where she'll risk everything to rescue her sister and he'll put himself at the mercy of his greatest enemies for the chance to be made whole again."], "author": "Susan Ee", "num_pages": "288", "awards": ["Cybils Award Nominee for Fantasy & Science Fiction (Young Adult) (2011)"], "places": ["San Francisco, California"], "character_names": ["Penryn Young", "Raffe", "Obadiah West", "Dee-Dum", "Paige Young", "Belial"], "language": "English", "publish_date": "2012-08-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4835.Haroun_and_the_Sea_of_Stories", "num_ratings": "25,585", "num_reviews": "2,102", "avg_ratings": 4.01, "genres": ["Fantasy", "Fiction", "Magical Realism", "Young Adult"], "title": "Haroun and the Sea of Stories", "description": ["Set in an exotic Eastern landscape peopled by magicians and fantastic talking animals, Salman Rushdie's classic children's novel ", " inhabits the same imaginative space as ", ", ", ", and ", "Set in an exotic Eastern landscape peopled by magicians and fantastic talking animals, Salman Rushdie's classic children's novel ", " inhabits the same imaginative space as ", ", ", ", and ", ". In this captivating work of fantasy from the author of ", " and ", ", Haroun sets out on an adventure to restore the poisoned source of the sea of stories. On the way, he encounters many foes, all intent on draining the sea of all its storytelling powers.  "], "author": "Salman Rushdie", "num_pages": "224", "awards": ["Mythopoeic Fantasy Award for Children's Literature (1992)"], "places": [], "character_names": ["Haroun"], "language": "English", "publish_date": "1999-08-27 00:00:00", "ISBN": "0670886580"},
{"url": "https://www.goodreads.com/book/show/7507944-akata-witch", "num_ratings": "9,545", "num_reviews": "1,928", "avg_ratings": 4.09, "genres": ["Fantasy", "Young Adult", "Fiction", "Cultural", "Africa", "Childrens", "Middle Grade", "Fantasy", "Magic", "Young Adult", "Young Adult Fantasy", "Western Africa", "Nigeria", "Fantasy", "Urban Fantasy", "Paranormal", "Witches"], "title": "Akata Witch", "description": [" transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befr", " transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befriends Orlu and Chichi, Sunny is plunged in to the world of the Leopard People, where your worst defect becomes your greatest asset. Together, Sunny, Orlu, Chichi and Sasha form the youngest ever Oha Coven. Their mission is to track down Black Hat Otokoto, the man responsible for kidnapping and maiming children. Will Sunny be able to overcome the killer with powers stronger than her own, or will the future she saw in the flames become reality?"], "author": "Nnedi Okorafor", "num_pages": "349", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2011)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)"], "places": ["Nigeria"], "character_names": ["Sunny Nwazue"], "language": "English", "publish_date": "2011-04-14 00:00:00", "ISBN": "0670011967"},
{"url": "https://www.goodreads.com/book/show/34728667-children-of-blood-and-bone", "num_ratings": "33,938", "num_reviews": "8,246", "avg_ratings": 4.3, "genres": ["Fantasy", "Young Adult", "Fiction"], "title": "Children of Blood and Bone", "description": ["They killed my mother.", "They took our magic.", "They tried to bury us.", "Now we rise.", "Zélie Adebola remembers when the soil of Orïsha hummed with magic. Burners ignited flames, Tiders beckoned waves, and Zélie’s Reaper mother summoned forth souls.", "But everything changed the night magic disappeared. Under the orders of a ruthless king, maji were killed, leaving Zélie without a mother", "They killed my mother.", "They took our magic.", "They tried to bury us.", "Now we rise.", "Zélie Adebola remembers when the soil of Orïsha hummed with magic. Burners ignited flames, Tiders beckoned waves, and Zélie’s Reaper mother summoned forth souls.", "But everything changed the night magic disappeared. Under the orders of a ruthless king, maji were killed, leaving Zélie without a mother and her people without hope.", "Now Zélie has one chance to bring back magic and strike against the monarchy. With the help of a rogue princess, Zélie must outwit and outrun the crown prince, who is hell-bent on eradicating magic for good.", "Danger lurks in Orïsha, where snow leoponaires prowl and vengeful spirits wait in the waters. Yet the greatest danger may be Zélie herself as she struggles to control her powers and her growing feelings for an enemy."], "author": "Tomi Adeyemi", "num_pages": "525", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-03-06 00:00:00", "ISBN": "1250170974"},
{"url": "https://www.goodreads.com/book/show/22295304-shadowshaper", "num_ratings": "7,031", "num_reviews": "1,666", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Paranormal"], "title": "Shadowshaper", "description": ["Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York may", "Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York mayhem is going on.", "Sierra soon discovers a supernatural order called the Shadowshapers, who connect with spirits via paintings, music, and stories. Her grandfather once shared the order's secrets with an anthropologist, Dr. Jonathan Wick, who turned the Caribbean magic to his own foul ends. Now Wick wants to become the ultimate Shadowshaper by killing all the others, one by one. With the help of her friends and the hot graffiti artist Robbie, Sierra must dodge Wick's supernatural creations, harness her own Shadowshaping abilities, and save her family's past, present, and future."], "author": "Daniel José Older", "num_pages": "297", "awards": ["Locus Award Nominee for Best Young Adult Book (2016)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2016)", "Lincoln Award Nominee (2018)", "Andre Norton Award Nominee (2015)", "Kirkus Prize Nominee for Young Readers' Literature (Finalist) (2015)"], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-30 00:00:00", "ISBN": "0545591619"},
{"url": "https://www.goodreads.com/book/show/9275658-legend", "num_ratings": "353,961", "num_reviews": "25,448", "avg_ratings": 4.18, "genres": ["Young Adult", "Romance", "Fantasy", "Science Fiction", "Fiction"], "title": "Legend", "description": ["What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal.", "What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal. But his motives may not be as malicious as they seem.", "From very different worlds, June and Day have no reason to cross paths—until the day June's brother, Metias, is murdered and Day becomes the prime suspect. Caught in the ultimate game of cat and mouse, Day is in a race for his family's survival, while June seeks to avenge Metias's death. But in a shocking turn of events, the two uncover the truth of what has really brought them together, and the sinister lengths their country will go to keep its secrets."], "author": "Marie Lu", "num_pages": "305", "awards": ["Milwaukee County Teen Book Award Nominee (2013)", "The Inky Awards Nominee for Silver Inky (2012)", "California Young Readers Medal Nominee for Young Adult (2015)", "Lincoln Award Nominee (2014)", "Missouri Truman Readers Award (2014)", "Goodreads Choice Award Nominee for Young Adult Fantasy and Science Fiction (2012)", "Rebecca Caudill Young Readers' Book Award (2015)"], "places": ["Los Angeles, The Republic of America"], "character_names": ["June Iparis", "Daniel Altan Wing", "Metias Iparis", "Commander Jameson", "Thomas Bryant", "Tess", "Kaede"], "language": "English", "publish_date": "2011-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/27774758-an-ember-in-the-ashes", "num_ratings": "122,531", "num_reviews": "17,574", "avg_ratings": 4.32, "genres": ["Fantasy", "Young Adult", "Romance", "Science Fiction", "Dystopia"], "title": "An Ember in the Ashes", "description": ["▶ ", "Laia is a slave. Elias is a soldier. Neither is free.", "  ", " Under the Martial Empire, defiance is met with death. Those who do not vow their blood and bodies to the Emperor risk the execution of their loved ones and the destruction of all they hold dear.", "  ", " It is in this brutal world, inspired by ancient Rome, that Laia lives with her grandparent", "▶ ", "Laia is a slave. Elias is a soldier. Neither is free.", "  ", " Under the Martial Empire, defiance is met with death. Those who do not vow their blood and bodies to the Emperor risk the execution of their loved ones and the destruction of all they hold dear.", "  ", " It is in this brutal world, inspired by ancient Rome, that Laia lives with her grandparents and older brother. The family ekes out an existence in the Empire’s impoverished backstreets. They do not challenge the Empire. They’ve seen what happens to those who do.", "  ", " But when Laia’s brother is arrested for treason, Laia is forced to make a decision. In exchange for help from rebels who promise to rescue her brother, she will risk her life to spy for them from within the Empire’s greatest military academy.", "  ", " There, Laia meets Elias, the school’s finest soldier—and secretly, its most unwilling. Elias wants only to be free of the tyranny he’s being trained to enforce. He and Laia will soon realize that their destinies are intertwined—and that their choices will change the fate of the Empire itself."], "author": "Sabaa Tahir", "num_pages": "446", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Milwaukee County Teen Book Award Nominee (2016)", "Dioraphte Jongerenliteratuurprijs Nominee for Vertaald boek (2016)", "Lincoln Award Nominee (2018)", "Goodreads Choice Award Nominee for Debut Goodreads Author, and for Young Adult Fantasy & Science Fiction (2015)", "The Magnolia Award Nominee for 9-12 (2018)", "Missouri Gateway Readers Award Nominee (2017)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2015)"], "places": [], "character_names": ["Laia", "Elias Veturius", "Helene Aquilla", "Marcus Farrar", "Keris Veturia"], "language": "English", "publish_date": "2016-02-09 00:00:00"}
]