[
{"url": "https://www.goodreads.com/book/show/239092.Almost_Like_Being_in_Love", "num_ratings": "3,391", "num_reviews": "489", "avg_ratings": 4.06, "genres": ["Romance", "M M Romance", "Lgbt", "Romance", "Fiction", "Contemporary"], "title": "Almost Like Being in Love", "description": ["A high school jock and nerd fall in love senior year, only to part after an amazing summer of discovery to attend their respective colleges. They keep in touch at first, but then slowly drift apart.", "Flash forward twenty years.", "Travis and Craig both have great lives, careers, and loves. But something is missing .... Travis is the first to figure it out. He's still in love wit", "A high school jock and nerd fall in love senior year, only to part after an amazing summer of discovery to attend their respective colleges. They keep in touch at first, but then slowly drift apart.", "Flash forward twenty years.", "Travis and Craig both have great lives, careers, and loves. But something is missing .... Travis is the first to figure it out. He's still in love with Craig, and come what may, he's going after the boy who captured his heart, even if it means forsaking his job, making a fool of himself, and entering the great unknown. ", "Told in narrative, letters, checklists, and more, this is the must-read novel for anyone who's wondered what ever happened to that first great love."], "author": "Steve Kluger", "num_pages": "354", "awards": ["Lambda Literary Award for Romance (2004)"], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2004-05-11 00:00:00", "ISBN": "0060595833"},
{"url": "https://www.goodreads.com/book/show/1251032.Hero", "num_ratings": "16,062", "num_reviews": "1,478", "avg_ratings": 3.87, "genres": ["Young Adult", "Lgbt", "Fantasy", "Comics", "Superheroes", "Fiction"], "title": "Hero", "description": ["The last thing in the world Thom Creed wants is to add to his father's pain, so he keeps secrets. Like that he has special powers. And that he's been asked to join the League - the very organization of superheroes that spurned his dad. But the most painful secret of all is one Thom can barely face himself: he's gay.", "But becoming a member of the League opens up a new world t", "The last thing in the world Thom Creed wants is to add to his father's pain, so he keeps secrets. Like that he has special powers. And that he's been asked to join the League - the very organization of superheroes that spurned his dad. But the most painful secret of all is one Thom can barely face himself: he's gay.", "But becoming a member of the League opens up a new world to Thom. There, he connects with a misfit group of aspiring heroes, including Scarlett, who can control fire but not her anger; Typhoid Larry, who can make anyone sick with his touch; and Ruth, a wise old broad who can see the future. Like Thom, these heroes have things to hide; but they will have to learn to trust one another when they uncover a deadly conspiracy within the League.", "To survive, Thom will face challenges he never imagined. To find happiness, he'll have to come to terms with his father's past and discover the kind of hero he really wants to be."], "author": "Perry Moore", "num_pages": "428", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2008)", "Lambda Literary Award for LGBT Children’s/Young Adult (2007)", "The Inky Awards Nominee for Silver Inky (2008)"], "places": [], "character_names": ["Ruth Jansen", "Thom Creed", "Scarlett", "Typhoid Larry", "Goran"], "language": "English", "publish_date": "2007-08-28 00:00:00", "ISBN": "1423101952"},
{"url": "https://www.goodreads.com/book/show/16115078-the-other-guy", "num_ratings": "1,468", "num_reviews": "218", "avg_ratings": 3.87, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Lgbt", "Glbt", "Gay"], "title": "The Other Guy", "description": ["Emory James is, by his own admission, not the type of person the adjective ", " would ever deign to touch with a ten-foot pole. ", ", ", " and ", ", however, all crowd around him like best friends. Still, he gets by -- or at least he gets by up until his fiancée dumps him at the altar. Out of spite, he takes a solo honeymoon to Thailand, where he can pretend t", "Emory James is, by his own admission, not the type of person the adjective ", " would ever deign to touch with a ten-foot pole. ", ", ", " and ", ", however, all crowd around him like best friends. Still, he gets by -- or at least he gets by up until his fiancée dumps him at the altar. Out of spite, he takes a solo honeymoon to Thailand, where he can pretend to be someone better than himself for a little while. In meeting Nate, a fellow traveler, Emory slowly discovers how to stop pretending."], "author": "Cary Attwell", "num_pages": "233", "awards": [], "places": ["Thailand", "Illinois", "Chicago, Illinois"], "character_names": [], "language": "English", "publish_date": "2012-10-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16149703-too-stupid-to-live", "num_ratings": "3,245", "num_reviews": "480", "avg_ratings": 3.96, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor", "Funny"], "title": "Too Stupid to Live", "description": ["Sam’s a new man. Yes, he’s still too tall, too skinny, too dorky, too gay, and has that unfortunate addiction to romance novels, but he’s wised up. His One True Love is certainly still out there, but he knows now that real life is nothing like fiction. He’s cultivated the necessary fortitude to say “no” to the next Mr. Wrong, no m", "Sam’s a new man. Yes, he’s still too tall, too skinny, too dorky, too gay, and has that unfortunate addiction to romance novels, but he’s wised up. His One True Love is certainly still out there, but he knows now that real life is nothing like fiction. He’s cultivated the necessary fortitude to say “no” to the next Mr. Wrong, no matter how hot, exciting, and/or erotic-novel-worthy he may be.", "Until he meets Ian.", "Ian’s a new man. He’s pain-free, has escaped the job he hated and the family who stifled him, and is now—possibly—ready to dip his toe into the sea of relationships. He’s going to be cautious, though, maybe start with someone who knows the score and isn’t looking for anything too complicated. Someone with experience and simple needs that largely revolve around the bedroom.", "Until he meets Sam.", "Sam’s convinced that Ian is no one’s Mr. Right. Ian’s sure that Sam isn’t his type. They can’t both be wrong . . . can they?"], "author": "Anne Tenino", "num_pages": "315", "awards": [], "places": ["Whitetail Rock"], "character_names": ["Nikhil \"Nik\" Larson", "Jurgen Dammerung", "Sam (Whitetail Rock)", "Ian Cully (Whitetail Rock)"], "language": "English", "publish_date": "2013-01-14 00:00:00", "ISBN": "1937551849"},
{"url": "https://www.goodreads.com/book/show/9664716-life-in-fusion", "num_ratings": "1,290", "num_reviews": "191", "avg_ratings": 4.13, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor", "Funny"], "title": "Life in Fusion", "description": ["The Sno Ho Sequel", "Aspiring author, Boone Daniels, always figured love would be as easy as he was. Fresh off the whirlwind winter-vacation romance with ski-god and would-be boyfriend, Wade Walker -- Boone was certain that saying goodbye would be the hardest part.", "He'd survived the unconventional way in which they came together, proven himself somewhat worthy to Wade's hometow", "The Sno Ho Sequel", "Aspiring author, Boone Daniels, always figured love would be as easy as he was. Fresh off the whirlwind winter-vacation romance with ski-god and would-be boyfriend, Wade Walker -- Boone was certain that saying goodbye would be the hardest part.", "He'd survived the unconventional way in which they came together, proven himself somewhat worthy to Wade's hometown of Summit City, and felt certain the self-imposed, six month boy-buffer would prove one thing - their fate was to be forever entwined.", "Once real life settles in, Boone suffers the realization that no one ever actually said love was easy and that even after you fall, you can still break. As their two worlds collide, he begins to understand that if he can navigate the landscape of life in fusion, he just might get that happily-ever-after -- after all."], "author": "Ethan Day", "num_pages": "252", "awards": [], "places": ["Colorado", "New Mexico"], "character_names": [], "language": "English", "publish_date": "2010-11-30 00:00:00", "ISBN": "1608202372"},
{"url": "https://www.goodreads.com/book/show/17277854-the-student-prince", "num_ratings": "3,606", "num_reviews": "500", "avg_ratings": 4.33, "genres": ["Romance", "M M Romance", "Fantasy", "Romance", "Fan Fiction", "Fantasy", "Magic"], "title": "The Student Prince", "description": ["A modern day (BBC) Merlin AU set at the University of St Andrews, featuring teetotal kickboxers, secret wizards, magnificent bodyguards of various genders, irate fairies, imprisoned dragons, crumbling gothic architecture, arrogant princes, adorable engineering students, stolen gold, magical doorways, attempted assassination, drunken students, shaving foam fights, embarrass", "A modern day (BBC) Merlin AU set at the University of St Andrews, featuring teetotal kickboxers, secret wizards, magnificent bodyguards of various genders, irate fairies, imprisoned dragons, crumbling gothic architecture, arrogant princes, adorable engineering students, stolen gold, magical doorways, attempted assassination, drunken students, shaving foam fights, embarrassing mornings after, The Hammer Dance, duty, responsibility, friendship and true love...", "145,248 Words Complete"], "author": "FayJay", "num_pages": "333", "awards": [], "places": ["St. Andrews, Fife, Scotland"], "character_names": ["Merlin"], "language": "English", "publish_date": "2010-07-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/109520.I_Am_Not_Myself_These_Days", "num_ratings": "11,359", "num_reviews": "896", "avg_ratings": 3.96, "genres": ["Autobiography", "Memoir", "Nonfiction", "Lgbt", "Humor", "Biography"], "title": "I Am Not Myself These Days", "description": ["The ", " bestselling, darkly funny memoir of a young New Yorker's daring dual life—advertising art director by day, glitter-dripping drag queen and nightclub beauty-pageant hopeful by night—was a smash literary debut for Josh Kilmer-Purcell, now known for his popular Planet Green television series ", ". His story begins here—before the homema", "The ", " bestselling, darkly funny memoir of a young New Yorker's daring dual life—advertising art director by day, glitter-dripping drag queen and nightclub beauty-pageant hopeful by night—was a smash literary debut for Josh Kilmer-Purcell, now known for his popular Planet Green television series ", ". His story begins here—before the homemade goat milk soaps and hand-gathered honeys, before his memoir of the city mouse’s move to the country, ", "—in ", ",  with “plenty of dishy anecdotes and moments of tragi-camp delight” (", ")."], "author": "Josh Kilmer-Purcell", "num_pages": "305", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2006-02-07 00:00:00", "ISBN": "0060817321"},
{"url": "https://www.goodreads.com/book/show/7869634-the-marrying-kind", "num_ratings": "198", "num_reviews": "70", "avg_ratings": 3.95, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor", "Lgbt", "Fiction"], "title": "The Marrying Kind", "description": ["Wedding planner Adam More has an epiphany: He has devoted all his life’s energy to creating events that he and his partner Steven are forbidden by federal law for having for themselves. So Adam decides to make a change. Organizing a boycott of the wedding industry, Steven and Adam call on gay organists, hairdressers, cater-waiters, priests, and hairdressers everywhere to g", "Wedding planner Adam More has an epiphany: He has devoted all his life’s energy to creating events that he and his partner Steven are forbidden by federal law for having for themselves. So Adam decides to make a change. Organizing a boycott of the wedding industry, Steven and Adam call on gay organists, hairdressers, cater-waiters, priests, and hairdressers everywhere to get out of the business and to stop going to weddings, too. In this screwball, romantic comedy both the movement they’ve begun and their relationship are put in jeopardy when Steven’s brother proposes to Adam’s sister and they must decide whether they’re attending or sending regrets."], "author": "Ken  O'Neill", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-19 00:00:00", "ISBN": "1602826706"},
{"url": "https://www.goodreads.com/book/show/16145400-sixty-five-hours", "num_ratings": "4,432", "num_reviews": "741", "avg_ratings": 4.2, "genres": ["Lgbt", "Humor", "Funny", "Romance", "M M Romance"], "title": "Sixty Five Hours", "description": ["Cameron Fletcher and Lucas Hensley are advertising executives who have Sixty Five Hours to pull together the campaign of their careers. ", "Sixty Five Hours to get along. Sixty Five Hours to not kill each other. Sixty Five Hours to fall in love.", " This is a re-written fanfiction. ", " pay to download. Download it from the author's website or here on Goodreads. ", "Also", "Cameron Fletcher and Lucas Hensley are advertising executives who have Sixty Five Hours to pull together the campaign of their careers. ", "Sixty Five Hours to get along. Sixty Five Hours to not kill each other. Sixty Five Hours to fall in love.", " This is a re-written fanfiction. ", " pay to download. Download it from the author's website or here on Goodreads. ", "Also, as stated on the author's blog, this book has not been professionally edited."], "author": "N.R. Walker", "num_pages": "174", "awards": [], "places": ["Chicago, Illinois", "Dallas, Texas", "Illinois"], "character_names": ["Cameron Fletcher", "Lucas Hensley"], "language": "English", "publish_date": "2012-11-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13549109-hard-tail", "num_ratings": "2,311", "num_reviews": "294", "avg_ratings": 3.76, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Sociology", "Abuse", "Glbt", "Gay", "Sports and Games", "Sports"], "title": "Hard Tail", "description": ["\"Finding love can be a bumpy ride. \"", "His job: downsized out of existence. His marriage: on the rocks. It doesn t take a lot of arm twisting for Tim Knight to agree to get out of London and take over his injured brother s mountain bike shop for a while. A few weeks in Southampton is a welcome break from the wreck his life has become, even though he feels like a fish out of w", "\"Finding love can be a bumpy ride. \"", "His job: downsized out of existence. His marriage: on the rocks. It doesn t take a lot of arm twisting for Tim Knight to agree to get out of London and take over his injured brother s mountain bike shop for a while. A few weeks in Southampton is a welcome break from the wreck his life has become, even though he feels like a fish out of water in this brave new world of outdoor sports and unfamiliar technical jargon.", "The young man who falls literally through the door of the shop brings everything into sharp, unexpected focus. Tim barely accepts he s even \"in\" the closet until his attraction to Matt Berridge pulls him close enough to touch the doorknob.", "There s only one problem with the loveable klutz: his bullying boyfriend. Tim is convinced Steve is the cause of the bruises that Matt blows off as part of his risky sport. But rising to the defense of the man he s beginning to love means coming to terms with who he is in public in a battle not even his black belt prepared him to fight. Until now.", "Warning: Contains an out-and-proud klutz, a closeted, karate-loving accountant and a cat who thinks it s all about him. Watch for a cameo appearance from the \"Pricks and Pragmatism\" lovers. May inspire yearnings for fresh air, exercise, and a fit, tanned bike mechanic of your very own. \""], "author": "J.L. Merrow", "num_pages": "248", "awards": [], "places": ["Southampton, England"], "character_names": [], "language": "English", "publish_date": "2012-05-08 00:00:00", "ISBN": "1619210398"},
{"url": "https://www.goodreads.com/book/show/9732810-the-perils-of-praline", "num_ratings": "177", "num_reviews": "60", "avg_ratings": 3.69, "genres": ["Romance", "M M Romance", "Contemporary", "Humor", "Romance", "Humor", "Funny"], "title": "The Perils of Praline", "description": ["When he falls in love with a contestant on a reality TV show, Peter \"Praline\" Palmetier decides to leave his home in rural Georgia and, failing to realize this might be considered stalking, travels to Hollywood to find his soul mate, Dave G. Once in tinsel-town he meets a collection of startling, and often horny, characters in his quest. They include a studly steward, a co", "When he falls in love with a contestant on a reality TV show, Peter \"Praline\" Palmetier decides to leave his home in rural Georgia and, failing to realize this might be considered stalking, travels to Hollywood to find his soul mate, Dave G. Once in tinsel-town he meets a collection of startling, and often horny, characters in his quest. They include a studly steward, a conservative talk show host, the Godfather of the Gay Mafia, and casting assistant Jason Friedman, who always manages to be there in time to save Praline from total disaster. Will Praline find love with the illusive Dave G., or will he recognize the charms of appealing but untelegenic Jason?"], "author": "Marshall Thornton", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-01 00:00:00", "ISBN": "160820233X"},
{"url": "https://www.goodreads.com/book/show/17727137-glitterland", "num_ratings": "3,565", "num_reviews": "864", "avg_ratings": 4.17, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Lgbt"], "title": "Glitterland", "description": ["Once the golden boy of the English literary scene, now a clinically depressed writer of pulp crime fiction, Ash Winters has given up on love, hope, happiness, and—most of all—himself. He lives his life between the cycles of his illness, haunted by the ghosts of other people’s expectations.", "Then a chance encounter a", "Once the golden boy of the English literary scene, now a clinically depressed writer of pulp crime fiction, Ash Winters has given up on love, hope, happiness, and—most of all—himself. He lives his life between the cycles of his illness, haunted by the ghosts of other people’s expectations.", "Then a chance encounter at a stag party throws him into the arms of Essex boy Darian Taylor, an aspiring model who lives in a world of hair gel, fake tans, and fashion shows. By his own admission, Darian isn’t the crispest lettuce in the fridge, but he cooks a mean cottage pie and makes Ash laugh, reminding him of what it’s like to step beyond the boundaries of anxiety.", "But Ash has been living in his own shadow for so long that he can’t see past the glitter to the light. Can a man who doesn’t trust himself ever trust in happiness? And how can a man who doesn’t believe in happiness ever fight for his own?"], "author": "Alexis  Hall", "num_pages": "248", "awards": ["Lambda Literary Award Nominee for Gay Romance (2014)", "Rainbow Award for Best Gay Debut 4th Place (2013)"], "places": ["London, England", "Essex, England"], "character_names": ["Alasdair \"Ash\" Ashley Winters", "Darian Taylor"], "language": "English", "publish_date": "2013-08-26 00:00:00", "ISBN": "1626490244"},
{"url": "https://www.goodreads.com/book/show/22052456-beauty-and-the-bookworm", "num_ratings": "2,032", "num_reviews": "534", "avg_ratings": 3.73, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Humor", "Funny"], "title": "Beauty And The Bookworm", "description": ["Mason Leery is a bookworm and he thinks he might just be able to get through life simply by reading about it instead of living it.", "Until he meets Shane Beaumont. Shane is the opposite of Mason in every way, he's beautiful, athletic, and lives his life to the fullest.", "Sparks fly when the polar opposites come together, but it will be up to the bookworm to shut down his e-reade", "Mason Leery is a bookworm and he thinks he might just be able to get through life simply by reading about it instead of living it.", "Until he meets Shane Beaumont. Shane is the opposite of Mason in every way, he's beautiful, athletic, and lives his life to the fullest.", "Sparks fly when the polar opposites come together, but it will be up to the bookworm to shut down his e-reader and go after the beauty if he wants to love someone outside the pages of a book."], "author": "Nick Pageant", "num_pages": "107", "awards": [], "places": ["Portland, Oregon", "Oregon"], "character_names": ["Mason Leery", "Shane Beaumont"], "language": "English", "publish_date": "2014-05-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13154192-perking-the-pansies---jack-and-liam-move-to-turkey", "num_ratings": "119", "num_reviews": "39", "avg_ratings": 4.13, "genres": ["Travel", "Lgbt"], "title": "Perking the Pansies - Jack and Liam move to Turkey", "description": ["Jack and Liam, fed up with kiss-my-arse bosses and nose-to-nipple commutes, quit their jobs and move to a small town in Turkey. Join the culture-curious gay couple on their bumpy rite of passage in a Muslim country. Meet the oddballs, VOMITs, vetpats, emigreys, semigreys, debauched waiters and middle England miseries.When bigotry and ignorance emerge from the crude underbe", "Jack and Liam, fed up with kiss-my-arse bosses and nose-to-nipple commutes, quit their jobs and move to a small town in Turkey. Join the culture-curious gay couple on their bumpy rite of passage in a Muslim country. Meet the oddballs, VOMITs, vetpats, emigreys, semigreys, debauched waiters and middle England miseries.When bigotry and ignorance emerge from the crude underbelly of Turkey's expat life, Jack and Liam waver. Determined to stay the course, the happy hedonistas hitch up their skirts, move to the heart of liberal Bodrum and fall in love with their intoxicating foster land. Enter Jack's irreverent world for a right royal dose of misery and joy, bigotry and enlightenment, betrayal and loyalty, friendship, love, earthquakes, birth, adoption and a senseless murder. Perking the Pansies will make you laugh out loud one minute and sob into your crumpled tissue the next.\"Scott pulls no punches. A good read and hopefully the first of many by new boy on the block.\" Jane Akatay, journalist\"An insightful tale of life abroad - with a twist - from the pen of a serial people watcher. Expat Jack lays his characters bare along with his heart and soul, ''Kym Ciftci, On the Ege Magazine, Ontheege.com\"Jack and Liam bring a certain je ne sais quoi to the souks and heap a plate of dry British wit to their Ottoman misadventures,\"Charles Ayres, author, Impossibly Glamorous Impossiblyglamorous.com..\". hilarious, saucy, witty, heartwarming and incredibly moving, Perking the Pansies is chock full of odd characters and odder situations. Jack Scott has a way with words and proves that it is the relationships we surround ourselves with that matter most,\"Linda A Janssens, Writer and Co-Author, Turning Points, Adventuresinexpatland.com"], "author": "Jack  Scott", "num_pages": "252", "awards": ["Rainbow Award", "Polari First Book Prize"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-22 00:00:00", "ISBN": "1904881645"},
{"url": "https://www.goodreads.com/book/show/6430659-tigers-and-devils", "num_ratings": "6,878", "num_reviews": "703", "avg_ratings": 4.09, "genres": ["Romance", "M M Romance", "Sports and Games", "Sports", "Romance", "Contemporary"], "title": "Tigers and Devils", "description": ["The most important things in Simon Murray’s life are football, friends, and film—in that order. His friends despair of him ever meeting someone, but despite his loneliness, Simon is cautious about looking for more. Then his best friends drag him to a party, where he barges into a football conversation and ends up defending the honour of star forward Declan Tyler—unaware th", "The most important things in Simon Murray’s life are football, friends, and film—in that order. His friends despair of him ever meeting someone, but despite his loneliness, Simon is cautious about looking for more. Then his best friends drag him to a party, where he barges into a football conversation and ends up defending the honour of star forward Declan Tyler—unaware that the athlete is present. In that first awkward meeting, neither man has any idea they will change each other's lives forever.", "Like his entire family, Simon revels in living in Melbourne, the home of Australian Rules football and mecca for serious fans. There, players are treated like gods—until they do something to fall out of public favour. This year, the public is taking Declan to task for suffering injuries outside his control, so Simon's support is a bright spot.", "But as Simon and Declan fumble toward a relationship, keeping Declan's homosexuality a secret from well-meaning friends and an increasingly suspicious media becomes difficult. Nothing can stay hidden forever. Soon Declan will have to choose between the career he loves and the man he wants, and Simon has never been known to make things easy—for himself or for others."], "author": "Sean Kennedy", "num_pages": "376", "awards": [], "places": ["Melbourne, Victoria"], "character_names": ["Simon Murray", "Declan Tyler"], "language": "English", "publish_date": "2012-08-31 00:00:00", "ISBN": "1935192450"},
{"url": "https://www.goodreads.com/book/show/17256863-special-needs", "num_ratings": "318", "num_reviews": "61", "avg_ratings": 3.5, "genres": ["Romance", "M M Romance", "Disability", "Romance", "Erotica", "Bdsm", "Contemporary", "Did Not Finish"], "title": "Special Needs", "description": ["Liam slept with his boss. ", ". And lost his job because of it. ", ". Set on changing his ways and tired of sleeping in his car, he applies for a job as a live-in caretaker, even though he has no experience in it whatsoever. He has a lot of practice in lying his way out of any situation though. Only problem is, his new boss - whe", "Liam slept with his boss. ", ". And lost his job because of it. ", ". Set on changing his ways and tired of sleeping in his car, he applies for a job as a live-in caretaker, even though he has no experience in it whatsoever. He has a lot of practice in lying his way out of any situation though. Only problem is, his new boss - wheelchair bound owner of a sex hotel - is gay, cute, funny and oh, so fuckable! There is only one logical solution to Liam’s dilemma - pretending he’s straight. Brilliant!", "When Ryan inherited his aunt’s B&B, he thought he’d hit the jackpot by changing it into a fetish sex hotel. Things didn’t go as planned though, all of his marketing efforts seem to fail, and the debt is mounting up. Being a wheelchair user doesn’t help in actively promoting his hotel, but his luck starts to change when he hires a new caretaker. Liam is open-minded, helpful and caring. All that Ryan needs from a caretaker to kickstart his business, but things would all be a lot simpler if he didn’t start crushing on his new employee. And even if, in some other dimension, Liam did return his feelings, how long can Ryan keep his fetish a secret?", "The web of lies they weave around each other is more bondage than any of them enjoy.", " contemporary erotic m/m romance, dramedy", " ~113,000 words", "***SPOILERS AHEAD!***", " disability, deception, alternative lifestyles, stalking, tattoos, self-image issues, financial trouble, boss/employee", " explicit m/m sexual scenes (including role play)"], "author": "K.A. Merikan", "num_pages": "360", "awards": [], "places": [], "character_names": ["Liam Novitzky", "Ryan Richards"], "language": "English", "publish_date": "2013-06-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26063611-the-queen-the-homo-jock-king", "num_ratings": "2,481", "num_reviews": "498", "avg_ratings": 4.44, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor", "Funny"], "title": "The Queen & the Homo Jock King", "description": ["Do you believe in love at first sight?", "Sanford Stewart sure doesn't. In fact, he pretty much believes in the exact opposite, thanks to the Homo Jock King. It seems Darren Mayne lives for nothing more than to create chaos in Sandy’s perfectly ordered life, just for the hell of it. Sandy despises him, and nothing will ever change his mind.", "Or so he tells himself.", "It's not until", "Do you believe in love at first sight?", "Sanford Stewart sure doesn't. In fact, he pretty much believes in the exact opposite, thanks to the Homo Jock King. It seems Darren Mayne lives for nothing more than to create chaos in Sandy’s perfectly ordered life, just for the hell of it. Sandy despises him, and nothing will ever change his mind.", "Or so he tells himself.", "It's not until the owner of Jack It—the club where Sandy performs as drag queen Helena Handbasket—comes to him with a desperate proposition that Sandy realizes he might have to put his feelings about Darren aside. Because Jack It will close unless someone can convince Andrew Taylor, the mayor of Tucson, to keep it open.", "Someone like Darren, the mayor’s illegitimate son.", "The foolproof plan is this: seduce Darren and push him to convince his father to renew Jack It’s contract with the city.", "Simple, right?", "Wrong."], "author": "T.J. Klune", "num_pages": "350", "awards": [], "places": ["Arizona"], "character_names": [], "language": "English", "publish_date": "2016-02-29 00:00:00", "ISBN": "1634768027"},
{"url": "https://www.goodreads.com/book/show/25002110-clandestine-liaisons", "num_ratings": "23", "num_reviews": "4", "avg_ratings": 4.87, "genres": [], "title": "Clandestine Liaisons", "description": ["Amatore's Restaurant: ", "The international cast of the Recreative Theatre Company meet for their end-of-season dinner at Ristorante Amatore. As the evening progresses, each guest recalls a past liaison, an encounter which has made an impression in their life: narratives of love and tales of deceit. Will Prudence ever discover the identity of the elusive stranger she meets on", "Amatore's Restaurant: ", "The international cast of the Recreative Theatre Company meet for their end-of-season dinner at Ristorante Amatore. As the evening progresses, each guest recalls a past liaison, an encounter which has made an impression in their life: narratives of love and tales of deceit. Will Prudence ever discover the identity of the elusive stranger she meets on a train? Just how much of a con-man is Monsieur Raul? Has Cordelia's unconventional approach to men proved to be a success? A common theme begins to unfold: hidden truths behind the motives for seduction. As the evening draws to a close emotions rise to the surface, declarations of love are expressed, jealousies and resentments run deep. Who will think back to the evening as a success and who will regard it as nothing more than a disaster? Intriguing, erotic, insightful and perceptive. This novel explores the relationship between characters with a refreshing approach to the theme of seduction. ", "Part Three: Clandestine Liaisons ", "The final nine chapters from Amatore's Restaurant. Secrets abound in this complex set of stories. The past is re-visited and many unanswered questions are raised. The truth remains hidden and may never be known. Characters are not always what they seem to be, but who will let their mask slip and reveal their true feelings? ", "WARNING: Adult content; there are passages which describe sex explicitly."], "author": "James Sillwood", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-29 00:00:00", "ISBN": "150769489X"},
{"url": "https://www.goodreads.com/book/show/449297.Fool_s_Errand", "num_ratings": "124", "num_reviews": "18", "avg_ratings": 3.81, "genres": ["Fiction", "Lgbt", "Romance", "M M Romance", "Romance", "Queer", "Queer Lit", "Contemporary"], "title": "Fool's Errand", "description": ["In searching for the man of his dreams, Patrick Beaton crosses paths with other searchers, in an inventive debut novel that is reminiscent of Armistead Maupin's Tales of the City."], "author": "Louis Bayard", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-06-01 00:00:00", "ISBN": "1555834949"},
{"url": "https://www.goodreads.com/book/show/110677.The_Best_Little_Boy_in_the_World", "num_ratings": "1,307", "num_reviews": "56", "avg_ratings": 3.87, "genres": ["Glbt", "Gay", "Nonfiction", "Biography", "Lgbt", "Autobiography", "Memoir", "Glbt", "Queer"], "title": "The Best Little Boy in the World (Modern Library)", "description": ["When ", " was first published in 1973, Andrew Tobias could write about what it had felt like to begin to accept his homosexuality, but he couldn't bring himself to sign his own name to the book, for fear of embarrassing his parents. And so it was \"John Reid\" who became a hero to the thousands of gay males who found in this memoir a mirror for th", "When ", " was first published in 1973, Andrew Tobias could write about what it had felt like to begin to accept his homosexuality, but he couldn't bring himself to sign his own name to the book, for fear of embarrassing his parents. And so it was \"John Reid\" who became a hero to the thousands of gay males who found in this memoir a mirror for their own experiences."], "author": "Andrew Tobias", "num_pages": "247", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-08-25 00:00:00", "ISBN": "067960314X"},
{"url": "https://www.goodreads.com/book/show/25002020-sensual-desires", "num_ratings": "24", "num_reviews": "6", "avg_ratings": 4.88, "genres": [], "title": "Sensual Desires", "description": ["Amatore's Restaurant: ", "The international cast of the Recreative Theatre Company meet for their end-of-season dinner at Ristorante Amatore. As the evening progresses, each guest recalls a past liaison, an encounter which has made an impression in their life: narratives of love and tales of deceit. Will Prudence ever discover the identity of the elusive stranger she meets on", "Amatore's Restaurant: ", "The international cast of the Recreative Theatre Company meet for their end-of-season dinner at Ristorante Amatore. As the evening progresses, each guest recalls a past liaison, an encounter which has made an impression in their life: narratives of love and tales of deceit. Will Prudence ever discover the identity of the elusive stranger she meets on a train? Just how much of a con-man is Monsieur Raul? Has Cordelia's unconventional approach to men proved to be a success? A common theme begins to unfold: hidden truths behind the motives for seduction. As the evening draws to a close emotions rise to the surface, declarations of love are expressed, jealousies and resentments run deep. Who will think back to the evening as a success and who will regard it as nothing more than a disaster? Intriguing, erotic, insightful and perceptive. This novel explores the relationship between characters with a refreshing approach to the theme of seduction. ", "Part Two: Sensual Desires ", "Another seven episodes from Amatore's Restaurant. New characters come into play: The imaginative wife Samantha, the mysterious Frau Eisler and the psychopathic Nicole, each manipulating the situation to suit their own purpose. From the stormy atmosphere of Spain to the exotic forests of Brazil and the rolling countryside of Brittany; evocative settings which provide a perfect background for these engrossing characters.", "WARNING: Adult content; there are passages which describe sex explicitly."], "author": "James Sillwood", "num_pages": "196", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-29 00:00:00", "ISBN": "1507693397"},
{"url": "https://www.goodreads.com/book/show/13649253-countdown-to-daddies", "num_ratings": "253", "num_reviews": "67", "avg_ratings": 3.74, "genres": ["Romance", "M M Romance", "Contemporary", "Short Stories", "Humor", "Funny", "Family", "Childrens"], "title": "Countdown to Daddies", "description": ["Matteo and Gabe have everything they could ever want out of life, except for a family all their own. When Gabe's twin sister offers to be their surrogate, it’s a dream come true until she insists they be completely involved in the pregnancy. The new dads quickly realize they may have bitten off more than they can chew."], "author": "K-lee Klein", "num_pages": "49", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2012-06-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12565322-miracle-of-the-bellskis", "num_ratings": "382", "num_reviews": "62", "avg_ratings": 4.04, "genres": ["Romance", "M M Romance", "Contemporary", "Holiday", "Romance", "Holiday", "Christmas"], "title": "Miracle of the Bellskis", "description": [".", "It's been three years since Seth Bellski forced his boyfriend and ex-boss Lars Varga out of the closet. Since then, Seth has passed the bar and become an attorney, and Lars has started his own firm. Their sex life has gotten steamier, and everything seems perfect between them. Until the holidays arrive.", "It's bad enough that Seth's mother a", ".", "It's been three years since Seth Bellski forced his boyfriend and ex-boss Lars Varga out of the closet. Since then, Seth has passed the bar and become an attorney, and Lars has started his own firm. Their sex life has gotten steamier, and everything seems perfect between them. Until the holidays arrive.", "It's bad enough that Seth's mother and father want them over every single night of Hanukkah. And that Lars's less-than-tolerant parents are sleeping in the room next door for the duration of Christmas, putting the kibosh on their kink. They also end up attorneys representing opposing sides in a divorce case, one which quickly proves to be much more than it seems. ", "Amidst Hanukkah candles, Christmas lights, burned dinners and delayed court appointments, can Lars and Seth's relationship survive the ultimate holiday challenge: too much family?"], "author": "Astrid Amara", "num_pages": "110", "awards": [], "places": ["Seattle, Washington"], "character_names": [], "language": "English", "publish_date": "2011-12-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/94072.Geography_Club", "num_ratings": "13,610", "num_reviews": "742", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Fiction", "Glbt", "Queer", "Glbt", "Gay"], "title": "Geography Club", "description": ["I knew that any wrong action, however slight, could reveal my true identity...", "Russel is still going on dates with girls. Kevin would do anything to prevent his teammates on the baseball team from finding out. Min and Terese tell everyone they're really just good friends. But after a while, the truth's too hard to hide - at least from each other - so they form the \"Geograph", "I knew that any wrong action, however slight, could reveal my true identity...", "Russel is still going on dates with girls. Kevin would do anything to prevent his teammates on the baseball team from finding out. Min and Terese tell everyone they're really just good friends. But after a while, the truth's too hard to hide - at least from each other - so they form the \"Geography Club.\" Nobody else will come. Why would they want to? Their secret should be safe."], "author": "Brent Hartinger", "num_pages": "226", "awards": [], "places": [], "character_names": ["Russel Middlebrook"], "language": "English", "publish_date": "2004-02-17 00:00:00", "ISBN": "0060012234"},
{"url": "https://www.goodreads.com/book/show/242006.Running_with_Scissors", "num_ratings": "320,984", "num_reviews": "11,936", "avg_ratings": 3.71, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Humor"], "title": "Running with Scissors", "description": ["The true story of an outlaw childhood where rules were unheard of, the Christmas tree stayed up all year round, Valium was consumed like candy, and if things got dull an electroshock-therapy machine could provide entertainment.", "Running with Scissors is the true story of a boy whose mother (a poet with delusions of Anne Sexton) gave him away to be raised by her unorthodox ps", "The true story of an outlaw childhood where rules were unheard of, the Christmas tree stayed up all year round, Valium was consumed like candy, and if things got dull an electroshock-therapy machine could provide entertainment.", "Running with Scissors is the true story of a boy whose mother (a poet with delusions of Anne Sexton) gave him away to be raised by her unorthodox psychiatrist who bore a striking resemblance to Santa Claus. So at the age of twelve, Burroughs found himself amidst Victorian squalor living with the doctor’s bizarre family, and befriending a pedophile who resided in the backyard shed. The story of an outlaw childhood where rules were unheard of, and the Christmas tree stayed up all year round, where Valium was consumed like candy, and if things got dull an electroshock- therapy machine could provide entertainment. The funny, harrowing and bestselling account of an ordinary boy’s survival under the most extraordinary circumstances."], "author": "Augusten Burroughs", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-06-01 00:00:00", "ISBN": "031242227X"},
{"url": "https://www.goodreads.com/book/show/30250833-femme", "num_ratings": "645", "num_reviews": "213", "avg_ratings": 4.05, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor"], "title": "Femme", "description": ["Queeny cocktail waiter, Lionel, wakes up to find himself in bed with Dog, a straight-acting softball player and the two embark on a rocky road to romance. A journey that requires coming out of the closet, going into the closet, a pair of red high heels, many pairs of red high heels, a failed intervention, a couple of aborted dates, and homemade pom-poms. Mostly, Lionel and", "Queeny cocktail waiter, Lionel, wakes up to find himself in bed with Dog, a straight-acting softball player and the two embark on a rocky road to romance. A journey that requires coming out of the closet, going into the closet, a pair of red high heels, many pairs of red high heels, a failed intervention, a couple of aborted dates, and homemade pom-poms. Mostly, Lionel and Dog learn what it means to be a man."], "author": "Marshall Thornton", "num_pages": "222", "awards": ["Lambda Literary Award Nominee for Gay Romance (2017)", "Rainbow Award for Gay Romantic Comedy (2nd) (2016)"], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2016-07-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18776908-blame-it-on-the-mistletoe", "num_ratings": "5,234", "num_reviews": "806", "avg_ratings": 4.01, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Holiday", "Christmas", "Academic", "College"], "title": "Blame It on the Mistletoe", "description": ["When physics grad student Fielding Monroe and skirt-chaser and football player Mick Colman become college housemates, they’re both in for a whole new education. Mick looks out for the absent-minded genius, and he helps Fielding clean up his appearance and discover all the silly pleasures his strict upbringing as a child prodigy denied him. They become best friends.", "It’s all", "When physics grad student Fielding Monroe and skirt-chaser and football player Mick Colman become college housemates, they’re both in for a whole new education. Mick looks out for the absent-minded genius, and he helps Fielding clean up his appearance and discover all the silly pleasures his strict upbringing as a child prodigy denied him. They become best friends.", "It’s all well and good until they run into a cheerleader who calls Mick the ‘best kisser on campus.’ Fielding has never been kissed, and he decides Mick and only Mick can teach him how it’s done. After all, the physics department’s Christmas party is coming up with its dreaded mistletoe. Fielding wants to impress his peers and look cool for once in his life. The thing about Fielding is, once he locks onto an idea, it’s almost impossible to get him to change his mind. And he just doesn't understand why his straight best friend would have a problem providing a little demonstration.", "Mick knows kissing is a dangerous game. If he gives in, it would take a miracle for the thing not to turn into a disaster. Then again, if the kissing lessons get out of hand they can always blame it on the mistletoe."], "author": "Eli Easton", "num_pages": "99", "awards": [], "places": ["Ithaca, New York", "Lebanon, Pennsylvania"], "character_names": ["Fielding Monroe", "Mick Colman"], "language": "English", "publish_date": "2013-11-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22851364-skye-blue", "num_ratings": "1,189", "num_reviews": "110", "avg_ratings": 4.26, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Sociology", "Abuse"], "title": "Skye Blue", "description": ["Sometimes, the road to happily ever after takes you where you least expect it.", "Skye was only interested in finally losing his virginity, but he might have found much more than that. Two guys both feel so right to the twenty-one-year old art student, but maybe that means they cancel each other out. After all, if either was the one, Skye wouldn’t have feelings for both of the", "Sometimes, the road to happily ever after takes you where you least expect it.", "Skye was only interested in finally losing his virginity, but he might have found much more than that. Two guys both feel so right to the twenty-one-year old art student, but maybe that means they cancel each other out. After all, if either was the one, Skye wouldn’t have feelings for both of them. Would he?", "But what if he really did just meet the love of his life?", " This male/male erotic romance includes explicit language and graphic sex. For ", " "], "author": "Alexa Land", "num_pages": "279", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2014-08-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10178379-the-last-supper", "num_ratings": "226", "num_reviews": "31", "avg_ratings": 3.98, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Short Stories"], "title": "The Last Supper", "description": ["Luc Tessier finally has all the ingredients of a perfect future assembled. His beautiful English fiancé, Daniel, on his arm, five hundred wedding guests on the way, and the honeymoon suite reserved.", "Now if only he can get Daniel to stop obsessing over last-minute details. So what if the date is set for Friday the thirteenth? After all they’ve been through to get to this poi", "Luc Tessier finally has all the ingredients of a perfect future assembled. His beautiful English fiancé, Daniel, on his arm, five hundred wedding guests on the way, and the honeymoon suite reserved.", "Now if only he can get Daniel to stop obsessing over last-minute details. So what if the date is set for Friday the thirteenth? After all they’ve been through to get to this point, what else is left to go wrong?", "Plenty, starting with Daniel’s sudden determination to “save” himself for marriage. How does a healthy, hot-blooded Frenchman fend off a bachelor party stripper with one arm while trying to beckon his lover closer with the other—and not go insane?", "Daniel wishes he had it as easy as Luc, who’s already finished preparing the extravagant menu. Between contending with a jealous best man, a spiteful mother-in-law, a bad haircut and Luc’s frustrated libido, Daniel’s ready to have a nervous breakdown of failed-pressure-cooker proportions.", "Forget making it to the church on time. If they make it through the thirteenth without someone ending up face-first in the wedding cake, it’ll be a miracle…"], "author": "Scarlet Blackwell", "num_pages": "82", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/28561501-strong-signal", "num_ratings": "5,250", "num_reviews": "1,066", "avg_ratings": 4.08, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "War", "Military Fiction"], "title": "Strong Signal", "description": ["I was counting down the months until the end of my deployment. My days were spent working on military vehicles, and I spent my nights playing video games that would distract me until I could leave Staff Sergeant Garrett Reid behind. That was when I met him: Kai Bannon, a fellow gamer with a famous stream channel. I never expected to become fixated on someone who'd initiall", "I was counting down the months until the end of my deployment. My days were spent working on military vehicles, and I spent my nights playing video games that would distract me until I could leave Staff Sergeant Garrett Reid behind. That was when I met him: Kai Bannon, a fellow gamer with a famous stream channel. I never expected to become fixated on someone who'd initially been a rival. And I'd never expected someone who oozed charm to notice me - a guy known for his brutal honesty and scowl. I hadn't planned for our online friendship to turn into something that kept me up at night - hours of chatting evolving into filthy webcam sessions. But it did. And now I can't stop thinking about him. In my mind, our real life meeting is perfect. We kiss, we fall into bed, and it's love at first sight. Except, like most things in my life, it doesn't go as planned."], "author": "Megan Erickson", "num_pages": "229", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-02-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12415198-pretty-monsters", "num_ratings": "485", "num_reviews": "114", "avg_ratings": 3.63, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Horror", "Zombies", "Fantasy", "Short Stories", "Fantasy", "Urban Fantasy"], "title": "Pretty Monsters", "description": ["Josh knew the night shift at the Quik-Mart would be full of freaks and geeks—and that was ", " the hell portal opened in the parking lot. Still, he likes to think he can roll with things. Sure, the zombies make a mess sometimes, but at least they never reach for anything more threatening than frozen burritos.", "Besides, it’s not all lizard-monsters and the walking dead. The", "Josh knew the night shift at the Quik-Mart would be full of freaks and geeks—and that was ", " the hell portal opened in the parking lot. Still, he likes to think he can roll with things. Sure, the zombies make a mess sometimes, but at least they never reach for anything more threatening than frozen burritos.", "Besides, it’s not all lizard-monsters and the walking dead. There’s also the mysterious hottie with the sly red lips and a taste for sweets. ", "Josh has had the hots for Hot Guy since the moment he laid eyes on him, and it seems Hot Guy might be sweet on Josh too. Now if only Josh could figure out whether that’s a good thing, a bad thing, or something in between. After all, with a hell vortex just a stone’s throw away, Josh has learned to take nothing at face value—even if it’s a very, very pretty face."], "author": "Andrea Speed", "num_pages": "15", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-30 00:00:00", "ISBN": "1937551032"},
{"url": "https://www.goodreads.com/book/show/12957949-the-tea-demon", "num_ratings": "119", "num_reviews": "31", "avg_ratings": 3.36, "genres": ["Romance", "M M Romance", "Science Fiction", "Steampunk", "Fantasy", "Romance", "Short Stories", "Lgbt"], "title": "The Tea Demon", "description": ["Thief Eric Devon wishes one thing: for people to leave him bloody well alone. And maybe for more whiskey. Until a mysterious stranger offers him a job so dangerous that no one has ever attempted it and survived to tell the tale: recover a priceless object from the Turtle Merchants’ impregnable palace. Intrigued by the man and the challenge, Eric accepts—but the stranger is", "Thief Eric Devon wishes one thing: for people to leave him bloody well alone. And maybe for more whiskey. Until a mysterious stranger offers him a job so dangerous that no one has ever attempted it and survived to tell the tale: recover a priceless object from the Turtle Merchants’ impregnable palace. Intrigued by the man and the challenge, Eric accepts—but the stranger is none other than the legendary airship captain known as the Tea Demon, terror of the Sea of Clouds. Eric must come up with the best plan in history if he wants to complete his job... and survive it too."], "author": "Cornelia Grey", "num_pages": "52", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-11-23 00:00:00", "ISBN": "1613722206"},
{"url": "https://www.goodreads.com/book/show/18332363-dirty-pirate", "num_ratings": "198", "num_reviews": "65", "avg_ratings": 3.86, "genres": ["Romance", "M M Romance", "Short Stories", "Contemporary", "Humor", "Funny", "Romance"], "title": "Dirty Pirate", "description": ["This cute and quirky story requires suspension of all belief. It’s a silly little story written based off these prompts:", " Haunted shower curtain, a pink stuffed parrot, a magic wand, bucket of chicken, a burnt Pop-Tart, and Batman. ", "One loves chicken, it is all he talks about. Other character wears an eyepatch because he thinks he’s a pirate."], "author": "Kyle Adams", "num_pages": "20", "awards": [], "places": [], "character_names": ["Crispy Salsa", "Eric (from Dirty Pirate)", "Quinton (Dirty Pirate)"], "language": "English", "publish_date": "2013-08-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9796473-remembrance-of-things-i-forgot", "num_ratings": "449", "num_reviews": "102", "avg_ratings": 3.5, "genres": ["Glbt", "Gay", "Fiction", "Lgbt", "Science Fiction", "Science Fiction", "Time Travel", "Humor"], "title": "Remembrance of Things I Forgot", "description": ["“It’s safe to say your relationship is in trouble if the only way you can imagine solving your problems is by borrowing a time machine.”", "            In 2006 comic book dealer John Sherkston has decided to break up with his physicist boyfriend, Taylor Esgard, on the very day Taylor announces he’s finally perfected a time machine for the U.S government. John travels back to 1", "“It’s safe to say your relationship is in trouble if the only way you can imagine solving your problems is by borrowing a time machine.”", "            In 2006 comic book dealer John Sherkston has decided to break up with his physicist boyfriend, Taylor Esgard, on the very day Taylor announces he’s finally perfected a time machine for the U.S government. John travels back to 1986, where he encounters “Junior,” his younger, more innocent self. When Junior starts to flirt, John wonders how to reveal his identity: “I’m you, only with less hair and problems you can’t imagine.” He also meets up with the younger Taylor, and this unlikely trio teams up to plot a course around their future relationship troubles, prevent John’s sister from making a tragic decision, and stop George W. Bush from becoming president.", "            In this wickedly comic, cross-country, time-bending journey, John confronts his own—and the nation’s—blunders, learning that a second chance at changing things for the better also brings new opportunities to screw them up. Through edgy humor, time travel, and droll one-liners, Bob Smith examines family dysfunction, suicide, New York City, and recent American history while effortlessly blending domestic comedy with science fiction. Part acidic political satire, part wild comedy, and part poignant social scrutiny, ", "is an uproarious adventure filled with sharp observations about our recent past.", " InSight Out Book Club, featured selection", "Bob Smith named one of Instinct magazine’s Leading Men 2011", "Winner, Barbara Gittings Literature Award/Stonewall Book Awards, American Library Association", "Finalist, Over the Rainbow Selection, American Library Association", "Finalist, Green Carnation Prize, international prize for LGBT Literature", "Amazon Top Ten Gay & Lesbian Books of 2011", "Best Books for General Audiences, selected by the American Association of School Librarians ", "Best Books for General Audiences, selected by the Public Library Reviewers", " "], "author": "Bob   Smith", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-06-09 00:00:00", "ISBN": "0299283402"},
{"url": "https://www.goodreads.com/book/show/25548442-how-to-be-a-normal-person", "num_ratings": "2,676", "num_reviews": "607", "avg_ratings": 4.37, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Lgbt", "Humor", "Funny", "Humor"], "title": "How To Be A Normal Person", "description": ["Gustavo Tiberius is not normal. He knows this. Everyone in his small town of Abby, Oregon, knows this. He reads encyclopedias every night before bed. He has a pet ferret called Harry S. Truman. He owns a video rental store that no one goes to. His closest friends are a lady named Lottie with drag queen hair and a trio of elderly Vespa riders known as the We Three Queens.", "Gu", "Gustavo Tiberius is not normal. He knows this. Everyone in his small town of Abby, Oregon, knows this. He reads encyclopedias every night before bed. He has a pet ferret called Harry S. Truman. He owns a video rental store that no one goes to. His closest friends are a lady named Lottie with drag queen hair and a trio of elderly Vespa riders known as the We Three Queens.", "Gus is not normal. And he's fine with that. All he wants is to be left alone.", "Until Casey, an asexual stoner hipster and the newest employee at Lottie’s Lattes, enters his life. For some reason, Casey thinks Gus is the greatest thing ever. And maybe Gus is starting to think the same thing about Casey, even if Casey is obsessive about Instagramming his food.", "But Gus isn’t normal and Casey deserves someone who can be. Suddenly wanting to be that someone, Gus steps out of his comfort zone and plans to become the most normal person ever.", "After all, what could possibly go wrong?"], "author": "T.J. Klune", "num_pages": "290", "awards": [], "places": ["Oregon"], "character_names": [], "language": "English", "publish_date": "2015-10-16 00:00:00", "ISBN": "1634765796"},
{"url": "https://www.goodreads.com/book/show/30370036-a-destiny-of-dragons", "num_ratings": "2,177", "num_reviews": "398", "avg_ratings": 4.48, "genres": ["Fantasy", "Romance", "M M Romance", "Romance", "Fantasy", "Magic", "Fantasy", "Dragons"], "title": "A Destiny of Dragons", "description": ["Once upon a time, the wizard’s apprentice Sam of Wilds got his happily ever after in the arms of his cornerstone, Knight Commander Ryan Foxheart. A year has passed, and while Sam’s been captured five or six more times since then, things are pretty great. His parents are happy, Gary and Tiggy still eat sass for breakfast, Randall is somehow alive despite being older than th", "Once upon a time, the wizard’s apprentice Sam of Wilds got his happily ever after in the arms of his cornerstone, Knight Commander Ryan Foxheart. A year has passed, and while Sam’s been captured five or six more times since then, things are pretty great. His parents are happy, Gary and Tiggy still eat sass for breakfast, Randall is somehow alive despite being older than the gods, the King rules with a gentle hand, Kevin the dragon is as gross as ever, Morgan sighs a lot, Ryan continues to be dashing and immaculate, and Sam is close to convincing Prince Justin they will be best friends forever.", "Life is good.", "Until it’s not.", "Because Vadoma, the leader of the Gypsy clan and Sam’s grandmother, has come to the City of Lockes with a dire prophecy written in the stars: a man of shadows is rising and will consume the world unless Sam faces his destiny and gathers the five dragons of Verania at his side.", "And she brings along her second-in-command, a man named Ruv.", "Ruv, who Vadoma says is Sam’s true cornerstone."], "author": "T.J. Klune", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16073518-birthday-burglar", "num_ratings": "174", "num_reviews": "36", "avg_ratings": 3.02, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Short Stories"], "title": "Birthday Burglar", "description": ["Jamie was the captain of his high school's football team. Neil was the weird goth transfer student. And yet, they fell in love and have been together ever since. Three years later, their relationship is strong as ever, but living together made the couple's love life somewhat predictable.", "Today, it's Neil's birthday and Jamie's determined to make it unforgettable. And what c", "Jamie was the captain of his high school's football team. Neil was the weird goth transfer student. And yet, they fell in love and have been together ever since. Three years later, their relationship is strong as ever, but living together made the couple's love life somewhat predictable.", "Today, it's Neil's birthday and Jamie's determined to make it unforgettable. And what could make his boyfriend happier than an unexpected sexual role play? Probably only a Bull in the closet.", "WARNING: Contains graphic m/m sex scenes, failed role play and a chocolate orgasm.", "~6000 words"], "author": "K.A. Merikan", "num_pages": "31", "awards": [], "places": ["London, England"], "character_names": ["Jamie (Birthday Burglar)", "Neil (Birthday Burglar)"], "language": "English", "publish_date": "2012-10-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30370031-until-you", "num_ratings": "1,332", "num_reviews": "281", "avg_ratings": 4.46, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Humor", "Funny"], "title": "Until You", "description": ["Together with their families and friends, Paul Auster and Vincent Taylor request the honor of your company at the celebration of their marriage. ", "Paul Auster and Vince Taylor just want to have a simple wedding. Really, is that too much to ask?", "As the big day approaches, they struggle to keep everything from spiraling out of control. From meddling friends and intrusive family", "Together with their families and friends, Paul Auster and Vincent Taylor request the honor of your company at the celebration of their marriage. ", "Paul Auster and Vince Taylor just want to have a simple wedding. Really, is that too much to ask?", "As the big day approaches, they struggle to keep everything from spiraling out of control. From meddling friends and intrusive family, to a certain drag queen's idea as to what constitutes a normal bachelor party, Paul and Vince have their work cut out for them."], "author": "T.J. Klune", "num_pages": "149", "awards": [], "places": ["Arizona"], "character_names": [], "language": "English", "publish_date": "2017-02-27 00:00:00", "ISBN": "1635333369"},
{"url": "https://www.goodreads.com/book/show/15749166-the-condor", "num_ratings": "375", "num_reviews": "90", "avg_ratings": 3.91, "genres": ["Romance", "M M Romance", "Erotica", "Bdsm", "Contemporary", "Romance", "Adult Fiction", "Erotica"], "title": "The Condor", "description": ["Nobody ever said running a gay escort agency was going to be easy. Harry takes on more than he can chew when he recruits a new boy who might be straight, might just be confused, or might be interested in servicing someone other than the clients. Then there's a client whose specific kinks mean for the first time in years Harry will have to handle a job himself. ", "Long-time bo", "Nobody ever said running a gay escort agency was going to be easy. Harry takes on more than he can chew when he recruits a new boy who might be straight, might just be confused, or might be interested in servicing someone other than the clients. Then there's a client whose specific kinks mean for the first time in years Harry will have to handle a job himself. ", "Long-time boyfriend Liam may be losing patience with having his life so influenced by hookers and emergency phone calls. Looks like he might become ex-boyfriend Liam... but is that such a bad thing? What should be done about the pushy bottom who won't go away until Harry agrees to dominate him? Is the new boy cut out for this business? There are vultures in the city. Harry is just a big, sparkly, gay one.", "Words: 110,555"], "author": "Isa K.", "num_pages": "327", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15841201-tigerland", "num_ratings": "2,578", "num_reviews": "342", "avg_ratings": 4.21, "genres": ["Romance", "M M Romance", "Sports and Games", "Sports", "Glbt", "Gay", "Romance", "Contemporary Romance"], "title": "Tigerland", "description": ["After an eventful and sometimes uncomfortably public courtship, Simon Murray and Declan Tyler settled into a comfortable life together. Now retired from the AFL, Declan works as a football commentator; Simon develops programs with queer content for a community television station. ", "Despite their public professional lives, Simon and Declan manage to keep their private life ou", "After an eventful and sometimes uncomfortably public courtship, Simon Murray and Declan Tyler settled into a comfortable life together. Now retired from the AFL, Declan works as a football commentator; Simon develops programs with queer content for a community television station. ", "Despite their public professional lives, Simon and Declan manage to keep their private life out of the spotlight. Their major concerns revolve around supporting their friends through infertility and relationship problems—until Greg Heyward, Declan’s ex-partner, outs himself in a transparent bid for attention. ", "Though Simon and Declan are furious with Greg and his media antics, they can’t agree on what to do about it. Declan insists they should maintain a dignified silence, but both he and Simon keep getting drawn into Heyward’s games. Simon and Declan will once again have to ride out the media storm before they can return their attention to what really matters: each other."], "author": "Sean Kennedy", "num_pages": "306", "awards": [], "places": ["Australia", "Melbourne, Victoria"], "character_names": ["Simon Murray", "Declan Tyler"], "language": "English", "publish_date": "2012-10-15 00:00:00", "ISBN": "1623800293"},
{"url": "https://www.goodreads.com/book/show/8659832-caged", "num_ratings": "544", "num_reviews": "141", "avg_ratings": 3.67, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Paranormal", "Shapeshifters", "Romance", "Short Stories"], "title": "Caged", "description": ["Marcin finds himself in a bind when he’s trapped in his shifter form and sold to a pet store. His frustration at the situation is palpable, but when he's taken home by good-looking Hamilton, his plan is to win over his new owner and make his escape? However, after a few weeks with Hamilton, does he want to make a complete escape, or just stop being caged? ", "If you like foul-", "Marcin finds himself in a bind when he’s trapped in his shifter form and sold to a pet store. His frustration at the situation is palpable, but when he's taken home by good-looking Hamilton, his plan is to win over his new owner and make his escape? However, after a few weeks with Hamilton, does he want to make a complete escape, or just stop being caged? ", "If you like foul-mouthed tiny shifters whose surly attitudes are many times bigger than their physical presence, then this may be the book for you."], "author": "Tam Ames", "num_pages": "19", "awards": [], "places": ["Phoenix, Arizona", "Arizona"], "character_names": ["Hamilton", "Marcin/Marek"], "language": "English", "publish_date": "2010-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7823352-take-my-picture", "num_ratings": "2,898", "num_reviews": "400", "avg_ratings": 4.01, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor", "Funny"], "title": "Take My Picture", "description": ["Aaron has no idea what he's walking into when he shows up to pose for a famous—and famously bad-tempered—photographer. He certainly doesn't expect to end up working as Jake's assistant for five frustrating, thrilling, and crazy years instead of in front of the camera.", "It all works until Jake realizes Aaron has become the focus of his life, a life that's threatened when Aaro", "Aaron has no idea what he's walking into when he shows up to pose for a famous—and famously bad-tempered—photographer. He certainly doesn't expect to end up working as Jake's assistant for five frustrating, thrilling, and crazy years instead of in front of the camera.", "It all works until Jake realizes Aaron has become the focus of his life, a life that's threatened when Aaron actually leaves him to start a relationship with someone else. Though it breaks his heart, Jake realizes he has to set his beloved muse free to have any chance of winning Aaron back.", " Size Still Matters."], "author": "Giselle Ellis", "num_pages": "154", "awards": [], "places": ["New York City, New York"], "character_names": ["Aaron Bennet", "Jake Wyzchek"], "language": "English", "publish_date": "2010-02-24 00:00:00", "ISBN": "1615813969"},
{"url": "https://www.goodreads.com/book/show/18619542-bone-rider", "num_ratings": "1,512", "num_reviews": "367", "avg_ratings": 4.26, "genres": ["Romance", "M M Romance", "Science Fiction", "Romance", "War", "Military Fiction", "Science Fiction", "Aliens", "Contemporary", "Fantasy", "Adventure", "Lgbt", "Humor"], "title": "Bone Rider", "description": ["Riley Cooper is on the run. Misha Tokarev, the love of his life, turned out to be an assassin for the Russian mob, and when it comes to character flaws, Riley draws the line at premeditated murder. Alien armor system McClane is also on the run, for reasons that include accidentally crashing a space ship into Earth and evading U.S. military custody. A failed prototype, McCl", "Riley Cooper is on the run. Misha Tokarev, the love of his life, turned out to be an assassin for the Russian mob, and when it comes to character flaws, Riley draws the line at premeditated murder. Alien armor system McClane is also on the run, for reasons that include accidentally crashing a space ship into Earth and evading U.S. military custody. A failed prototype, McClane was scheduled for destruction. Sabotaging the ship put an end to that, but McClane is dubbed a bone rider for good reason—he can’t live without a host body. That’s why he first stows away in Riley's truck and then in Riley himself. Their reluctant partnership soon evolves into something much more powerful—and personal—than either of them could have imagined.", "Together, they embark on a road trip from hell, made all the more exciting by the government troops and mob enforcers hot on their trail. Misha is determined to win Riley back and willing to do whatever it takes to keep him safe. When hitman and alien join forces, they discover their impressive combined potential for death and destruction. It will take everything Riley has to steer them through the mess they create."], "author": "J. Fally", "num_pages": "310", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-28 00:00:00", "ISBN": "1627982108"},
{"url": "https://www.goodreads.com/book/show/14760219-lightning-rod", "num_ratings": "289", "num_reviews": "49", "avg_ratings": 3.98, "genres": ["Romance", "M M Romance", "Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Fantasy", "Magic", "Romance"], "title": "Lightning Rod", "description": ["Sorcerers ha", "Sorcerers have always been feared in the City, their origins as unknown as the nature and extent of their power. When James Black, a young man fleeing an abusive lover, becomes a sorcerer, his old life is erased from existence, and his new life is indebted to powerful entities.", "Escaping the man who abused him was supposed to be the end, but the very magic that freed him has put him on a collision course with the gods and the Sorcerer King himself.", "And only one of them can survive."], "author": "Vaughn R. Demont", "num_pages": "312", "awards": [], "places": [], "character_names": ["James Black", "Spencer Crain"], "language": "English", "publish_date": "2012-10-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8494625-at-piper-s-point", "num_ratings": "1,221", "num_reviews": "194", "avg_ratings": 4.0, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor"], "title": "At Piper's Point", "description": ["Ten years and many boyfriends later, Cassidy Winters finally returns to the ancestral home of his grandmother, Sadie Hart, despite the best efforts of his father to prevent it. Cassidy's plans of a quiet, seaside ceremony to wish a final farewell to Sadie quickly unravel as interruptions run roughshod beginning with Neil who walks out of the ocean and straight into Cassidy", "Ten years and many boyfriends later, Cassidy Winters finally returns to the ancestral home of his grandmother, Sadie Hart, despite the best efforts of his father to prevent it. Cassidy's plans of a quiet, seaside ceremony to wish a final farewell to Sadie quickly unravel as interruptions run roughshod beginning with Neil who walks out of the ocean and straight into Cassidy’s bed. The dominos topple one by one when the little dog he rescues from the hounds of hell brings him to Ben, the hunky vet who rescues Cassidy right back. News of his arrival spreads faster than Cassidy’s legs, bringing his boyhood friend and first love Nate Sommers to his doorstep – leaving Cassidy spiraling into a multi-layered love snafu. As if the island wasn’t getting crowded enough for Cassidy’s good taste and bad decisions, best friends Ollie and Spencer arrive in time to witness the uninvited return of Cassidy’s most recent ex, Teddy, who’s refusing to stay dumped. ", "Fists fly and all hell breaks loose amid mojitos and martinis as Cassidy finds himself planning a huge party to celebrate Sadie's life. Accusations are aimed as arguments and libidos boil over, but even through the chaos Cassidy knows exactly what he wants. While he's certainly willing, he isn’t sure if he's ready or able for love and life... ", "At Pipers Point.", "Copyright 2010 Ethan Day. All Rights Reserved."], "author": "Ethan Day", "num_pages": "210", "awards": [], "places": ["Hart's Island, North Carolina"], "character_names": ["Cassidy Winters", "Nate Sommers"], "language": "English", "publish_date": "2010-07-27 00:00:00", "ISBN": "1607378167"},
{"url": "https://www.goodreads.com/book/show/16128083-shy", "num_ratings": "1,057", "num_reviews": "211", "avg_ratings": 3.78, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor", "Funny", "Humor"], "title": "Shy", "description": ["Dating is hard enough. Throw in an incontinent Chihuahua, an unrequited love affair, a severe case of social anxiety disorder, a dying father, and a man-eating hog and it becomes darned near impossible. Still, it takes two to tango—and when Tom Morgan, a mild-mannered assistant bank manager with a debilitating case of shyness, meets Frank Wells, who is straight off the far", "Dating is hard enough. Throw in an incontinent Chihuahua, an unrequited love affair, a severe case of social anxiety disorder, a dying father, and a man-eating hog and it becomes darned near impossible. Still, it takes two to tango—and when Tom Morgan, a mild-mannered assistant bank manager with a debilitating case of shyness, meets Frank Wells, who is straight off the farm and even shyer than he is, sparks start flying.", "Just when Tom and Frank’s burgeoning love affair is rolling along nicely, Frank must return to Indiana to oversee the farm while his father battles cancer. Tom tags along to help Frank out and finds himself slopping hogs and milking cows and wondering what the hell happened to his orderly citified existence. And what’s with all the chickens? Tom ", " chickens!", "With Frank’s help, Tom grits his teeth and muddles through. Funny what a couple of guys can accomplish when they’re crazy about each other. Not even nine hundred chickens can stand in the way of true love."], "author": "John Inman", "num_pages": "256", "awards": [], "places": ["San Diego, California", "Indiana"], "character_names": ["Thomas Morgan", "Frank Wells", "Pedro, the chihuahua"], "language": "English", "publish_date": "2012-11-30 00:00:00", "ISBN": "1623801486"},
{"url": "https://www.goodreads.com/book/show/30244714-adulting-101", "num_ratings": "1,713", "num_reviews": "464", "avg_ratings": 4.08, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "New Adult"], "title": "Adulting 101", "description": ["Nick Stahlnecker is eighteen and not ready to grow up yet. He has a summer job, a case of existential panic, and a hopeless crush on the unattainable Jai Hazenbrook. Except how do you know that your coworker’s unattainable unless you ask to blow him in the porta-potty?", "That’s probably not what Dad meant when he said Nick should act more like an adult.", "Tw", "Nick Stahlnecker is eighteen and not ready to grow up yet. He has a summer job, a case of existential panic, and a hopeless crush on the unattainable Jai Hazenbrook. Except how do you know that your coworker’s unattainable unless you ask to blow him in the porta-potty?", "That’s probably not what Dad meant when he said Nick should act more like an adult.", "Twenty-five-year-old Jai is back in his hometown of Franklin, Ohio, just long enough to earn the money to get the hell out again. His long-term goal of seeing more of the world is worth the short-term pain of living in his mother’s basement, but only barely.", "Meeting Nick doesn’t fit in with Jai’s plans at all, but, as Jai soon learns, you don’t have to travel halfway around the world to have the adventure of a lifetime.", "This is not a summer romance. This is a summer friendship-with-benefits. It’s got pizza with disgusting toppings, Netflix and chill, and accidental exhibitionism. That’s all. There are no feelings here. None. Shut up."], "author": "Lisa Henry", "num_pages": "231", "awards": ["Lambda Literary Award Nominee for Gay Romance (2017)"], "places": ["Ohio"], "character_names": [], "language": "English", "publish_date": "2016-08-15 00:00:00", "ISBN": "1626494495"},
{"url": "https://www.goodreads.com/book/show/20663610-the-ghost-slept-over", "num_ratings": "337", "num_reviews": "106", "avg_ratings": 3.88, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Romance", "Contemporary", "Paranormal", "Ghosts", "Humor", "Humor", "Funny"], "title": "The Ghost Slept Over", "description": ["When failed actor Cal Parsons travels to rural New York to claim the estate of his famous and estranged ex-partner, he discovers something he wasn't expecting...the ghost of his ex! And worse, his ex invites Cal to join him for all eternity. As Cal attempts to rid himself of the ghost by any means, he begins to fall for the attractive attorney representing the estate. Will", "When failed actor Cal Parsons travels to rural New York to claim the estate of his famous and estranged ex-partner, he discovers something he wasn't expecting...the ghost of his ex! And worse, his ex invites Cal to join him for all eternity. As Cal attempts to rid himself of the ghost by any means, he begins to fall for the attractive attorney representing the estate. Will Cal be able to begin a new relationship or will he be seduced into the ever after?"], "author": "Marshall Thornton", "num_pages": "199", "awards": [], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2014-01-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4143.Barrel_Fever", "num_ratings": "47,528", "num_reviews": "1,585", "avg_ratings": 3.78, "genres": ["Humor", "Nonfiction", "Writing", "Essays", "Short Stories", "Autobiography", "Memoir", "Humor", "Comedy"], "title": "Barrel Fever: Stories and Essays", "description": ["In David Sedaris’s world, no one is safe and no cow is sacred. A manic cross between Mark Leyner, Fran Lebowitz, and the ", ", Sedaris’s collection of essays is a rollicking tour through the national Zeitgeist: a do-it-yourself suburban dad saves money by performing home surgery; a man who is loved too much flees the heavyweight champion of the world; a teenag", "In David Sedaris’s world, no one is safe and no cow is sacred. A manic cross between Mark Leyner, Fran Lebowitz, and the ", ", Sedaris’s collection of essays is a rollicking tour through the national Zeitgeist: a do-it-yourself suburban dad saves money by performing home surgery; a man who is loved too much flees the heavyweight champion of the world; a teenage suicide tries to incite a lynch mob at her funeral; a bitter Santa abuses the elves.", "David Sedaris made his debut on NPR’s ", " with “SantaLand Diaries”, recounting his strange-but-true experiences as an elf at Macy’s, and soon became one of the show’s most popular commentators. With a perfect eye and a voice infused with as much empathy as wit, Sedaris writes stories and essays that target the soulful ridiculousness of our behavior. ", " is like a blind date with modern life, and anything can happen."], "author": "David Sedaris", "num_pages": "196", "awards": ["Lambda Literary Award Nominee for Humor (1995)"], "places": [], "character_names": [], "language": "English", "publish_date": "1995-06-01 00:00:00", "ISBN": "0316779423"},
{"url": "https://www.goodreads.com/book/show/13568317-dick", "num_ratings": "12", "num_reviews": "3", "avg_ratings": 3.25, "genres": ["Contemporary"], "title": "Dick", "description": ["He's young, he's hung and he's discovered he loves the one thing all gay men and hetero women love, the big 'D'. Follow his exploits as he learns his craft around the cruising areas and cottages of the city. This darkly comedic erotica is not for the faint hearted.", "Short story circa 8,600 words", "Genre: Gay erotica/humour"], "author": "Daniel deLoite", "num_pages": "22", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25447212-the-giddy-death-of-the-gays-the-strange-demise-of-straights", "num_ratings": "83", "num_reviews": "26", "avg_ratings": 3.99, "genres": ["Lgbt", "Glbt", "Queer", "Polyamory", "Lgbt", "Bisexual"], "title": "The Giddy Death of the Gays & the Strange Demise of Straights", "description": ["Caroline and her Dom live out their normal lives amongst the poverty, alcoholics, and street preachers of Swansea, Wales. But when Dom and his straight roommate fall in love--a passionate, secret, non-sexual love--their lives are transformed into a queer chaos of cross-dressing, gender bending and free love. Will Dom hold on to his relationship? Can religious fundamentalis", "Caroline and her Dom live out their normal lives amongst the poverty, alcoholics, and street preachers of Swansea, Wales. But when Dom and his straight roommate fall in love--a passionate, secret, non-sexual love--their lives are transformed into a queer chaos of cross-dressing, gender bending and free love. Will Dom hold on to his relationship? Can religious fundamentalists be adopted as pets? And just what are The Lesbians up to? The battle between preachers and drag queens, skinheads and sex workers, boyfriend and girlfriend, is set to change the city forever."], "author": "Redfern Jon Barrett", "num_pages": "194", "awards": ["Bisexual Book Award Nominee for Fiction (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-01 00:00:00", "ISBN": "1590213157"},
{"url": "https://www.goodreads.com/book/show/1044355.When_You_Are_Engulfed_in_Flames", "num_ratings": "165,694", "num_reviews": "9,248", "avg_ratings": 4.05, "genres": ["Humor", "Nonfiction", "Autobiography", "Memoir", "Writing", "Essays", "Short Stories", "Humor", "Comedy", "Audiobook", "Humor", "Funny", "Biography", "Biography Memoir"], "title": "When You Are Engulfed in Flames", "description": ["It's early autumn 1964. Two straight-A students head off to school, and when only one of them returns home Chesney Yelverton is coaxed from retirement and assigned to what proves to be the most difficult and deadly - case of his career. From the shining notorious East Side, ", " confirms once again that David Sedaris is a master of mystery and su", "It's early autumn 1964. Two straight-A students head off to school, and when only one of them returns home Chesney Yelverton is coaxed from retirement and assigned to what proves to be the most difficult and deadly - case of his career. From the shining notorious East Side, ", " confirms once again that David Sedaris is a master of mystery and suspense.", "Or how about...", "when set on fire, most of us either fumble for our wallets or waste valuable time feeling sorry for ourselves. David Sedaris has studied this phenomenon, and his resulting insights may very well save your life. Author of the national bestsellers ", " and ", ", David Sedaris, with ", ", is clearly at the top of his game.", "Oh, all right...", "David Sedaris has written yet another book of essays (his sixth). Subjects include a parasitic worm that once lived in his mother-in-law's leg, an encounter with a dingo, and the recreational use of an external catheter. Also recounted is the buying of a human skeleton and the author's attempt to quit smoking In Tokyo.", "Master of nothing, at the dead center of his game, Sedaris proves that when you play with matches, you sometimes light the whole pack on fire."], "author": "David Sedaris", "num_pages": "323", "awards": ["Audie Award for Narration by the Author or Authors (2009)", "Grammy Award Nominee for Best Spoken Word Album (2009)"], "places": [], "character_names": ["David Sedaris"], "language": "English", "publish_date": "2008-06-03 00:00:00", "ISBN": "0316143472"},
{"url": "https://www.goodreads.com/book/show/14760824-louder-than-sirens-louder-than-bells", "num_ratings": "1,280", "num_reviews": "245", "avg_ratings": 4.02, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Academic", "College"], "title": "Louder Than Sirens, Louder Than Bells", "description": [" ", ": Two young men stare at each other through a chain-link fence. They are holding hands through it; one has nail polish and lip gloss.", "This story was written as a part of the M/M Romance Group's ", " event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.", "Read it ", " or find it in ", ".", "__________", " contemporary", " first love; college; coming out; gay-for-you; enemies to lovers", " none", " 68,123"], "author": "K.D. Sarge", "num_pages": "188", "awards": [], "places": ["Connecticut", "Pennsylvania"], "character_names": ["Alan Lumina Lacroix", "Lukas Walker Blake"], "language": "English", "publish_date": "2012-06-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/31997446-the-weight-of-it-all", "num_ratings": "3,709", "num_reviews": "705", "avg_ratings": 4.37, "genres": ["Romance", "M M Romance", "Romance", "Contemporary"], "title": "The Weight of It All", "description": ["After being dumped by his long-term boyfriend for being overweight, Henry Beckett decides to make some drastic changes. In a vain attempt at getting his boyfriend back, Henry does the most absurdly frightening thing he can think of.", "He joins a gym.", "Reed Henske is a personal trainer who isn’t sure he’ll ever be ready to date again. He’s sick of guys who are only interested in", "After being dumped by his long-term boyfriend for being overweight, Henry Beckett decides to make some drastic changes. In a vain attempt at getting his boyfriend back, Henry does the most absurdly frightening thing he can think of.", "He joins a gym.", "Reed Henske is a personal trainer who isn’t sure he’ll ever be ready to date again. He’s sick of guys who are only interested in the perfect body image, never seeing him for who he really is.", "As Reed tortures Henry with things like diet and exercise, Henry enamours Reed with recipes and laughter. As the friendship lines start to blur, Henry is convinced there’s no way Thor-like Reed could ever be interested in a guy like him.", "Reed just has to convince Henry that life isn’t about reaching your ideal bodyweight. It’s about finding your perfect counterweight."], "author": "N.R. Walker", "num_pages": "244", "awards": [], "places": ["Australia"], "character_names": ["Henry Beckett", "Reed Henske"], "language": "English", "publish_date": "2016-09-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8520270-stirring-up-trouble", "num_ratings": "886", "num_reviews": "76", "avg_ratings": 3.73, "genres": ["Contemporary", "Romance", "Romance", "M M Romance", "Glbt", "Gay", "Lgbt"], "title": "Stirring Up Trouble", "description": ["Toby Andrews is cooking up more than a little trouble for Evan Blankenship. Because of pranks, indiscretions, and plain bad timing, his ability to work in New York's temples of haute cuisine is a thing of the past. When Toby's sister tells him he should look up an acquaintance whose restaurant -- Le Potiron --is failing, he doesn't have much choice.", "Pretty soon he's in bed,", "Toby Andrews is cooking up more than a little trouble for Evan Blankenship. Because of pranks, indiscretions, and plain bad timing, his ability to work in New York's temples of haute cuisine is a thing of the past. When Toby's sister tells him he should look up an acquaintance whose restaurant -- Le Potiron --is failing, he doesn't have much choice.", "Pretty soon he's in bed, literally, with a cook who hates people, trying to save a restaurant that only the neighborhood mothers seem to love, and on the verge of another --possibly painful -- lesson or two about what it means to be successful.", "Evan hates everyone but Toby. Toby likes to stir things up. See what's on the menu at Le Potiron, in Stirring Up Trouble."], "author": "Z.A. Maxfield", "num_pages": "176", "awards": [], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2010-07-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17622440-loving-hector", "num_ratings": "381", "num_reviews": "82", "avg_ratings": 3.8, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor", "Humor", "Funny"], "title": "Loving Hector", "description": ["Dillard Brown has a mother who's determined he's straight, a writing career that’s going nowhere, and at thirty, he’s never been in love in his life. But thanks to a ten-pound ball of fluff and energy named Chester, one of Dill's circumstances is about to change. Maybe even all three. ", "Who would've thought one little stray dog could change Dill's world—and not by accident e", "Dillard Brown has a mother who's determined he's straight, a writing career that’s going nowhere, and at thirty, he’s never been in love in his life. But thanks to a ten-pound ball of fluff and energy named Chester, one of Dill's circumstances is about to change. Maybe even all three. ", "Who would've thought one little stray dog could change Dill's world—and not by accident either. The damn dog has it planned. If not for Chester wandering into Dill's life and into his heart, Dill would never have met Hector Peña—and tumbled headlong into love at last! ", "But for all Chester's efforts, happiness for Dill and Hector is still not assured. Hector's evil ex, Valdemaro, is dead set on holding on—even if it means kidnapping Hector to keep him from Dill forever! Now Dill has to pull an army together to rescue Hector, and just where the hell is he supposed to find an army? Gads, if only Dill could write books this interesting!"], "author": "John Inman", "num_pages": "224", "awards": [], "places": ["California", "San Diego, California"], "character_names": [], "language": "English", "publish_date": "2013-04-12 00:00:00", "ISBN": "1623804671"},
{"url": "https://www.goodreads.com/book/show/178357.SantaLand_Diaries", "num_ratings": "40,747", "num_reviews": "437", "avg_ratings": 4.33, "genres": ["Humor", "Nonfiction", "Autobiography", "Memoir", "Short Stories", "Writing", "Essays"], "title": "SantaLand Diaries", "description": ["'Santaland Diaries' contains six of David Sedaris' most profound Christmas stories, from Dinah, the Christmas Whore to Season's Greetings to our Friends and Family."], "author": "David Sedaris", "num_pages": "138", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0349119759"},
{"url": "https://www.goodreads.com/book/show/18144453-iron-velvet", "num_ratings": "1,160", "num_reviews": "230", "avg_ratings": 3.79, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Mystery", "Lgbt", "Romance", "Paranormal", "Vampires"], "title": "Iron & Velvet", "description": ["My name’s Kate Kane, and when an eight-hundred-year-old vampire prince came to me with a case, I should have told her no. But I’ve always been a sucker for a femme fatale.", "It always goes the same way. You move too fast, you get in too deep, and before you know it, someone winds up dead. Last time it was my par", "My name’s Kate Kane, and when an eight-hundred-year-old vampire prince came to me with a case, I should have told her no. But I’ve always been a sucker for a femme fatale.", "It always goes the same way. You move too fast, you get in too deep, and before you know it, someone winds up dead. Last time it was my partner. This time it could be me. Yesterday a werewolf was murdered outside the Velvet, the night-time playground of one of the most powerful vampires in England. Now half the monsters in London are at each other’s throats, and the other half are trying to get in my pants. The Witch Queen will protect her own, the wolves are out for vengeance, and the vampires are out for, y’know, blood.", "I’ve got a killer on the loose, a war on the horizon, and a scotch on the rocks. It’s going to be an interesting day."], "author": "Alexis  Hall", "num_pages": "277", "awards": [], "places": ["London, England"], "character_names": ["Kate Kane (Paranormal Investigator)"], "language": "English", "publish_date": "2013-12-16 00:00:00", "ISBN": "1626490481"},
{"url": "https://www.goodreads.com/book/show/8476029-like-a-sparrow-through-the-heart", "num_ratings": "1,381", "num_reviews": "194", "avg_ratings": 3.87, "genres": ["Romance", "M M Romance", "Fantasy", "Romance", "Paranormal", "Shapeshifters"], "title": "Like a Sparrow Through the Heart", "description": ["Talon the griffin is broken-hearted - so, can you really blame him for not-quite-accidentally trying to kill a guy? Flit the sparrow sure can. Now the sparrow has taken over Talon's life, and Talon hates it. But maybe things will turn out all right. If only Flit would stop decorating the place.", "Length: epic (~57,000 words) Complete ", "Ebook formats by The Fluff - Free Download", "Talon the griffin is broken-hearted - so, can you really blame him for not-quite-accidentally trying to kill a guy? Flit the sparrow sure can. Now the sparrow has taken over Talon's life, and Talon hates it. But maybe things will turn out all right. If only Flit would stop decorating the place.", "Length: epic (~57,000 words) Complete ", "Ebook formats by The Fluff - Free Download via Goodreads"], "author": "Aggy Bird", "num_pages": "171", "awards": [], "places": [], "character_names": ["Zip", "Talon", "Flit"], "language": "English", "publish_date": "2009-04-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15834395-el-presidio-rides-north", "num_ratings": "634", "num_reviews": "167", "avg_ratings": 3.97, "genres": ["Romance", "M M Romance", "Horror", "Zombies", "Fantasy", "Paranormal", "Short Stories", "Science Fiction", "Dystopia"], "title": "El Presidio Rides North", "description": ["In a post-zombie apocalypse world, an almost-madman named Mercury and his newfound companion, Gaga, seek refuge in a RV-turned-mobile-fortress.", "----------", " 19,413 Complete"], "author": "Domashita Romero", "num_pages": "78", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23876652-imogene-in-new-orleans", "num_ratings": "432", "num_reviews": "93", "avg_ratings": 3.33, "genres": ["Mystery", "Humor", "Fiction", "Mystery", "Cozy Mystery", "Humor", "Funny", "Lgbt"], "title": "Imogene in New Orleans", "description": ["At the ripe age of 73, Imogene Deal McGregor has a penchant for following her own instincts, as well as more grit and spunk than her hypochondriac son, Billy McGregor, and Billy's impulsive partner Jackson Miller can handle. The boys take Imogene to New Orleans with their devilishly handsome English bulldog Goose, hoping to visit friends and attend a second line parade, bu", "At the ripe age of 73, Imogene Deal McGregor has a penchant for following her own instincts, as well as more grit and spunk than her hypochondriac son, Billy McGregor, and Billy's impulsive partner Jackson Miller can handle. The boys take Imogene to New Orleans with their devilishly handsome English bulldog Goose, hoping to visit friends and attend a second line parade, but moments after arriving in the French Quarter, they find their friend Glenway Gilbert murdered in his art gallery. Immediately, Imogene and the boys run into a temperamental and ethically-challenged lieutenant who appears hell-bent on neglecting the crime, compelling them to seek answers themselves. As they delve into Glenway Gilbert's murder, Imogene and the boys realize the deceased artist was surrounded by suspicious friends and lovers. With Goose the bulldog by their side, Jackson and Billy seek answers among old friends and new enemies, while Imogene follows her own ideas on the case. But the sooner they solve the murder, the sooner they can get back to catching beads and eating pralines."], "author": "Hunter Murphy", "num_pages": "294", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-12-01 00:00:00", "ISBN": "0990979202"},
{"url": "https://www.goodreads.com/book/show/1189878.My_Most_Excellent_Year", "num_ratings": "7,233", "num_reviews": "1,063", "avg_ratings": 4.04, "genres": ["Young Adult", "Fiction", "Romance", "Lgbt", "Contemporary", "Realistic Fiction"], "title": "My Most Excellent Year", "author": "Steve Kluger", "num_pages": "403", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2011)", "Amelia Elizabeth Walden Award (2009)", "Peggy Miller Award (2009)"], "places": [], "character_names": ["T.C. Keller", "Ale Perez", "Andy Wexler", "Augie Hwong"], "language": "English", "publish_date": "2008-03-13 00:00:00", "ISBN": "0803732279"},
{"url": "https://www.goodreads.com/book/show/23228.Boy_Meets_Boy", "num_ratings": "56,913", "num_reviews": "3,492", "avg_ratings": 3.85, "genres": ["Young Adult", "Lgbt", "Romance", "Contemporary", "Fiction"], "title": "Boy Meets Boy", "description": ["This is the story of Paul, a sophomore at a high school like no other: The cheerleaders ride Harleys, the homecoming queen used to be a guy named Daryl (she now prefers Infinite Darlene and is also the star quarterback), and the gay-straight alliance was formed to help the straight kids learn how to dance.", "When Paul meets Noah, he thinks he’s found the one his heart is made", "This is the story of Paul, a sophomore at a high school like no other: The cheerleaders ride Harleys, the homecoming queen used to be a guy named Daryl (she now prefers Infinite Darlene and is also the star quarterback), and the gay-straight alliance was formed to help the straight kids learn how to dance.", "When Paul meets Noah, he thinks he’s found the one his heart is made for. Until he blows it. The school bookie says the odds are 12-to-1 against him getting Noah back, but Paul’s not giving up without playing his love really loud. His best friend Joni might be drifting away, his other best friend Tony might be dealing with ultra-religious parents, and his ex-boyfriend Kyle might not be going away anytime soon, but sometimes everything needs to fall apart before it can really fit together right.", "This is a happy-meaningful romantic comedy about finding love, losing love, and doing what it takes to get love back in a crazy-wonderful world."], "author": "David Levithan", "num_pages": "185", "awards": ["Lambda Literary Award (2003)", "Lincoln Award Nominee (2008)"], "places": ["New Jersey"], "character_names": [], "language": "English", "publish_date": "2005-05-10 00:00:00", "ISBN": "0375832998"},
{"url": "https://www.goodreads.com/book/show/4136.Holidays_on_Ice", "num_ratings": "96,645", "num_reviews": "4,923", "avg_ratings": 3.94, "genres": ["Humor", "Nonfiction", "Short Stories", "Autobiography", "Memoir", "Writing", "Essays"], "title": "Holidays on Ice", "description": ["David Sedaris's beloved holiday collection is new again with six more pieces, including a never before published story. Along with such favorites as the diaries of a Macy's elf and the annals of two very competitive families, are Sedaris's tales of tardy trick-or-treaters (", "); the difficulties of explaining the Easter Bunny to the French (", "); what to d", "David Sedaris's beloved holiday collection is new again with six more pieces, including a never before published story. Along with such favorites as the diaries of a Macy's elf and the annals of two very competitive families, are Sedaris's tales of tardy trick-or-treaters (", "); the difficulties of explaining the Easter Bunny to the French (", "); what to do when you've been locked out in a snowstorm (", "); the puzzling Christmas traditions of other nations (", "); what Halloween at the medical examiner's looks like (", "); and a barnyard secret Santa scheme gone awry (", ")."], "author": "David Sedaris", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-12-28 00:00:00", "ISBN": "0316191299"},
{"url": "https://www.goodreads.com/book/show/16036332-not-microwave-safe", "num_ratings": "146", "num_reviews": "56", "avg_ratings": 3.23, "genres": ["Romance", "M M Romance", "Holiday", "Contemporary", "Horror", "Short Stories"], "title": "Not Microwave Safe: A Halloween Story", "description": ["Kent has always hated Halloween and anything else that's scary. But when his boyfriend, Uriah, wants to take him to a haunted house, he can't say no.", "Uriah can't contain his excitement and loves creepy surprises. However, as the evening progresses and everything seems wrong, can he convince Kent to see the night through?", "For Kent and Uriah, Halloween starts with a pop and en", "Kent has always hated Halloween and anything else that's scary. But when his boyfriend, Uriah, wants to take him to a haunted house, he can't say no.", "Uriah can't contain his excitement and loves creepy surprises. However, as the evening progresses and everything seems wrong, can he convince Kent to see the night through?", "For Kent and Uriah, Halloween starts with a pop and ends with a bang, and life will never be the same again."], "author": "Kyle Adams", "num_pages": "29", "awards": [], "places": ["Delaware"], "character_names": [], "language": "English", "publish_date": "2012-10-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/508098.Blue_Heaven", "num_ratings": "746", "num_reviews": "89", "avg_ratings": 4.16, "genres": ["Fiction", "Glbt", "Gay", "Humor", "Humor", "Comedy", "Lgbt", "Glbt", "Queer"], "title": "Blue Heaven", "description": ["Meet Gilbert and Moira - the strangest couple to ever marry for each other's money. Living in New York in 1991 is Gilbert Selwyn, a young man possessed of boundless charm and an allergy to employment, who has devised a plan to wring a nice pile of loot from his mother's newest (and obscenely wealthy) husband.", "The scheme, simply put, is to get married for the gifts. But Gilb", "Meet Gilbert and Moira - the strangest couple to ever marry for each other's money. Living in New York in 1991 is Gilbert Selwyn, a young man possessed of boundless charm and an allergy to employment, who has devised a plan to wring a nice pile of loot from his mother's newest (and obscenely wealthy) husband.", "The scheme, simply put, is to get married for the gifts. But Gilbert, who's gay, needs a fiancée... Enter Moira Finch, a demonically conniving young woman whose own mother, having recently married the Duke of Dorsetshire, will contribute richly to the couple's receipts. Enter, too, Philip Cavanagh, Gilbert's longtime friend, former lover, and highly strung Best Man. And enter, finally, the Cellinis, Gilbert's huge internecine stepfamily, whose fortune has not been amassed as innocently as Gilbert first thought, and who conform rather more closely to Italian-American stereotypes than Gilbert would like to believe. As Gilbert, Moira, and Philip struggle to keep their plot under wraps, the scams get bigger and more perilous, deceit multiplies, and a wonderfully calamitous trail leads us towards what could be the wedding of the season."], "author": "Joe Keenan", "awards": ["Lambda Literary Award Nominee for Gay Men's Debut Fiction (1989)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-04-04 00:00:00", "ISBN": "0099435047"},
{"url": "https://www.goodreads.com/book/show/250542.My_Lucky_Star", "num_ratings": "533", "num_reviews": "74", "avg_ratings": 3.83, "genres": ["Fiction", "Glbt", "Gay", "Humor", "Lgbt", "Glbt", "Queer"], "title": "My Lucky Star", "description": ["In this hilarious, laser-sharp comedy, the Emmy-winning writer and producer of \"Frasier\" sends up Hollywood pretense higher than it's ever been sent before."], "author": "Joe Keenan", "num_pages": "384", "awards": ["Thurber Prize for American Humor (2007)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "0316013358"},
{"url": "https://www.goodreads.com/book/show/12004996-coyote-s-creed", "num_ratings": "658", "num_reviews": "134", "avg_ratings": 3.82, "genres": ["Romance", "M M Romance", "Fantasy", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Romance", "Paranormal", "Shapeshifters", "Lgbt"], "title": "Coyote's Creed", "description": ["If con games were taught in high school, Spencer Crain would be on the honor roll. As it is, he’ll be riding the edge of failure to graduation next month. Then Spence gets the news that his long-gone father is not only dead, but was a Coyote, one of three clans of tricksters in the City.", "With a near-catatonic mother on", "If con games were taught in high school, Spencer Crain would be on the honor roll. As it is, he’ll be riding the edge of failure to graduation next month. Then Spence gets the news that his long-gone father is not only dead, but was a Coyote, one of three clans of tricksters in the City.", "With a near-catatonic mother on his hands, Spence couldn’t care less about the Coyotes’ ongoing feud with the Phouka and the Kitsune—until it lands on his doorstep. Suddenly he’s thrown headfirst into a dangerous world he knows next-to-nothing about. His only guide is Rourke, dashing King of the Phouka, plus a growing pack of half-siblings, a god, and Fate herself.", "As Spence embarks on a journey to learn the Coyote’s creed, the truth about his heritage, and how to handle his growing attraction to Rourke, he wonders when his life turned from TV sitcom to real-life danger zone. And what price must he pay to survive the next roll of the dice…"], "author": "Vaughn R. Demont", "num_pages": "273", "awards": ["Rainbow Award for Best Gay Paranormal/Horror (2012)"], "places": [], "character_names": ["James Black", "Spencer Crain"], "language": "English", "publish_date": "2011-10-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12507957-clear-water", "num_ratings": "3,929", "num_reviews": "527", "avg_ratings": 4.08, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Disability"], "title": "Clear Water", "description": ["Meet Patrick Cleary: party boy, loser, and spaz. Patrick’s been trying desperately to transform himself, and the results have been so spectacular, they’ve almost killed him. Meet Wes “Whiskey” Keenan: he’s a field biologist wondering if it’s time to settle down. When the worst day of Patrick’s life ends with Whiskey saving it, Patrick and Whiskey find themselves sharing co", "Meet Patrick Cleary: party boy, loser, and spaz. Patrick’s been trying desperately to transform himself, and the results have been so spectacular, they’ve almost killed him. Meet Wes “Whiskey” Keenan: he’s a field biologist wondering if it’s time to settle down. When the worst day of Patrick’s life ends with Whiskey saving it, Patrick and Whiskey find themselves sharing company and an impossibly small berth on the world’s tackiest houseboat. ", "Patrick needs to get his life together—and Whiskey wants to help—but Patrick is not entirely convinced it’s doable. He’s pretty sure he’s a freak of nature. But Whiskey, who works with real freaks of nature, thinks all Patrick needs is a little help to see the absolute beauty inside his spastic self, and Whiskey is all about volunteering. Between anomalous frogs, a homicidal ex-boyfriend, and Patrick’s own hangups, Whiskey’s going to need all of his patience and Patrick’s going to need to find the best of himself before these two men ever see clear water."], "author": "Amy Lane", "num_pages": "230", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2011-09-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16124430-sock-it-to-me-santa", "num_ratings": "2,493", "num_reviews": "491", "avg_ratings": 4.04, "genres": ["Romance", "M M Romance", "Young Adult", "Contemporary", "Romance", "Holiday", "Christmas", "Lgbt"], "title": "Sock it to Me, Santa!", "description": ["Ryan is assigned to Jamie Peterson for his class's secret gift exchange. If word gets out that he has to make a handcrafted gift for flamboyant and openly gay Jamie, Ryan will be the laughing stock of the school. It's a good thing no self-respecting boy would be caught dead in a craft store, because otherwise he'd be at risk of being spotted when his mom drags him to her w", "Ryan is assigned to Jamie Peterson for his class's secret gift exchange. If word gets out that he has to make a handcrafted gift for flamboyant and openly gay Jamie, Ryan will be the laughing stock of the school. It's a good thing no self-respecting boy would be caught dead in a craft store, because otherwise he'd be at risk of being spotted when his mom drags him to her weekly craft workshops. He hopes Jamie will appreciate all the trouble he's going to for this assignment. Finding the perfect gift is gonna be tricky. Jamie deserves something good, though, after all the crap he has to put up with at school. At least, Ryan tells himself that's the reason he's putting so much thought into the gift. It couldn't be that he has feelings for Jamie, could it?"], "author": "Madison  Parker", "num_pages": "55", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9797527-christmas-with-danny-fit", "num_ratings": "1,302", "num_reviews": "170", "avg_ratings": 3.89, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Holiday", "Holiday", "Christmas"], "title": "Christmas with Danny Fit", "description": ["In a perfect moment of cold November sunshine, pudgy accountant Kit Allen realizes Jesse, his new office assistant, is everything he's ever dreamed about in a man. Feeling supremely unworthy and desperate to get a life—even an imaginary one—Kit embarks on a self-improvement campaign featuring DVD fitness guru,", "In a perfect moment of cold November sunshine, pudgy accountant Kit Allen realizes Jesse, his new office assistant, is everything he's ever dreamed about in a man. Feeling supremely unworthy and desperate to get a life—even an imaginary one—Kit embarks on a self-improvement campaign featuring DVD fitness guru, Danny Fit. ", "In the meantime, Jesse has begun a subtle campaign of his own, one designed to bring Kit out of his DVD dream world and into Jesse's arms. Jesse isn't perfect—he's no Danny Fit—but he hopes that the kind, funny man who has been looking at him so soulfully since his first day at work has what it takes to be everything Jesse has always wanted."], "author": "Amy Lane", "num_pages": "96", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2010-12-01 00:00:00", "ISBN": "1615817522"},
{"url": "https://www.goodreads.com/book/show/25072476-sebastian", "num_ratings": "2,425", "num_reviews": "359", "avg_ratings": 4.02, "genres": ["Fantasy", "Romance", "M M Romance", "Romance", "Fantasy", "Magic", "Lgbt"], "title": "Sebastian", "description": ["Sebastian Orwell did the only thing a smart wizard could do when he stumbled upon the wounded Crown Prince: he healed him and dumped him in a tavern where he could continue not being Sebastian's problem. Unfortunately, the prince isn’t content with being alive, and he hunts Sebastian down to thank him personally. Not only is Sebastian stuck with the prince's unwanted affec", "Sebastian Orwell did the only thing a smart wizard could do when he stumbled upon the wounded Crown Prince: he healed him and dumped him in a tavern where he could continue not being Sebastian's problem. Unfortunately, the prince isn’t content with being alive, and he hunts Sebastian down to thank him personally. Not only is Sebastian stuck with the prince's unwanted affections, he's also confronted by growing evidence linking the assassination attempt to someone from his father's past.", "Lord Orwell is a lot of things: thief, liar, drunk, and all around horrible father, but Sebastian knows he's no murderer. In order to prove it, Sebastian has to keep the prince alive long enough to discover the truth—a task made considerably harder because the idiot prince prefers wooing Sebastian over securing his own survival. On top of everything, Sebastian needs to save the day without revealing his magical powers and the real reason he hides his appearance.", "Sebastian had no intention of playing the hero, but whoever is stirring up shit in his country will pay for destroying his quiet life."], "author": "Sam Argent", "num_pages": "324", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-18 00:00:00", "ISBN": "163216681X"},
{"url": "https://www.goodreads.com/book/show/1436198.Putting_on_the_Ritz", "num_ratings": "435", "num_reviews": "35", "avg_ratings": 4.11, "genres": ["Fiction", "Humor", "Glbt", "Gay", "Lgbt", "Glbt", "Queer", "Humor", "Funny"], "title": "Putting on the Ritz", "description": ["Putting on the Ritz"], "author": "Joe Keenan", "num_pages": "336", "awards": ["Lambda Literary Award for Humor (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-01 00:00:00", "ISBN": "0140149899"},
{"url": "https://www.goodreads.com/book/show/9574343-trust-me-if-you-dare", "num_ratings": "1,478", "num_reviews": "158", "avg_ratings": 4.15, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance", "Humor", "Funny"], "title": "Trust Me If You Dare", "description": ["Feisty New Yorker Caesar Romano has a knack for getting into a jam, and this week is no exception. When his pregnancy-hormone-buzzed business partner sweet talks him into working a solo gig for his famous ex, Caesar attracts the worst kind of attention.", "It’s only the beginning. Hit on by a lusty German, stalked by the paparazzi, victim of an un", "Feisty New Yorker Caesar Romano has a knack for getting into a jam, and this week is no exception. When his pregnancy-hormone-buzzed business partner sweet talks him into working a solo gig for his famous ex, Caesar attracts the worst kind of attention.", "It’s only the beginning. Hit on by a lusty German, stalked by the paparazzi, victim of an unexpected airbag attack—and desperate for some part-time help—Ce’s running out of time, staff and patience. But what’s really got him poised to run? A looming brunch with his sexy lover’s esteemed family.", "PI Dan Albright is a man of many gifts: investigation, security, sex talk and driving Caesar nuts in and out of the bedroom. Hired to protect an outrageous soap star from a deranged personal assistant, Dan’s got his hands full refereeing rival actors, locating one four-foot-eleven woman…and convincing Ce that he’s playing for keeps.", "Hey, nobody ever said taking a relationship to the next level was a waltz in the park."], "author": "L.B. Gregg", "num_pages": "158", "awards": [], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2010-12-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/123448.How_I_Paid_for_College", "num_ratings": "3,668", "num_reviews": "436", "avg_ratings": 3.84, "genres": ["Fiction", "Young Adult", "Humor", "Lgbt", "Glbt", "Gay"], "title": "How I Paid for College: A Novel of Sex, Theft, Friendship & Musical Theater", "description": ["A deliciously funny romp of a novel about one overly theatrical and sexually confused New Jersey teenager’s larcenous quest for his acting school tuition", "It’s 1983 in Wallingford, New Jersey, a sleepy bedroom community outside of Manhattan. Seventeen-year-old Edward Zanni, a feckless Ferris Bueller–type, is Peter Panning his way through a carefree summer of magic and misch", "A deliciously funny romp of a novel about one overly theatrical and sexually confused New Jersey teenager’s larcenous quest for his acting school tuition", "It’s 1983 in Wallingford, New Jersey, a sleepy bedroom community outside of Manhattan. Seventeen-year-old Edward Zanni, a feckless Ferris Bueller–type, is Peter Panning his way through a carefree summer of magic and mischief. The fun comes to a halt, however, when Edward’s father remarries and refuses to pay for Edward to study acting at Juilliard.", "Edward’s truly in a bind. He’s ineligible for scholarships because his father earns too much. He’s unable to contact his mother because she’s somewhere in Peru trying to commune with Incan spirits. And, as a sure sign he’s destined for a life in the arts, Edward’s incapable of holding down a job. So he turns to his loyal (but immoral) misfit friends to help him steal the tuition money from his father, all the while practicing for his high school performance of ", ". Disguising themselves as nuns and priests, they merrily scheme their way through embezzlement, money laundering, identity theft, forgery, and blackmail. But, along the way, Edward also learns the value of friendship, hard work, and how you’re not really a man until you can beat up your father—metaphorically, that is.", " is a farcical coming-of-age story that combines the first-person tone of David Sedaris with the byzantine plot twists of Armistead Maupin. It is a novel for anyone who has ever had a dream or a scheme, and it marks the introduction to an original and audacious talent."], "author": "Marc Acito", "num_pages": "288", "awards": ["Oregon Book Award for the Novel (2005)"], "places": ["New Jersey"], "character_names": [], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "0767918541"},
{"url": "https://www.goodreads.com/book/show/11103340-the-epic-love-story-of-doug-and-stephen", "num_ratings": "615", "num_reviews": "137", "avg_ratings": 3.75, "genres": ["Romance", "M M Romance", "Contemporary", "Humor", "Funny", "Romance", "Humor"], "title": "The Epic Love Story of Doug and Stephen", "description": ["A comedy about a bisexual mechanic turned model who aims to get the man of his dreams and save the world as soon as he finishes smoking this joint. R for language and implied sex. No DRM."], "author": "Valerie Z. Lewis", "num_pages": "219", "awards": [], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2011-04-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15705835-pressure-head", "num_ratings": "3,789", "num_reviews": "531", "avg_ratings": 3.9, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Fantasy", "Paranormal", "Contemporary"], "title": "Pressure Head", "description": ["To most of the world, Tom Paretski is just a plumber with a cheeky attitude and a dodgy hip, souvenir of a schoolboy accident. The local police keep his number on file for a different reason—his sixth sense for finding hidden things.", "When he’s called in to help locate the body of a missing woman up on Nomansland Common, he unexpectedly en", "To most of the world, Tom Paretski is just a plumber with a cheeky attitude and a dodgy hip, souvenir of a schoolboy accident. The local police keep his number on file for a different reason—his sixth sense for finding hidden things.", "When he’s called in to help locate the body of a missing woman up on Nomansland Common, he unexpectedly encounters someone who resurrects a host of complicated emotions. Phil Morrison, Tom’s old school crush, now a private investigator working the same case. And the former bully partly responsible for Tom’s injury.", "The shocks keep coming. Phil is now openly gay, and shows unmistakable signs of interest. Tom’s attraction to the big, blond investigator hasn’t changed—in fact, he’s even more desirable all grown up. But is Phil’s interest genuine, or does he only want to use Tom’s talent?", "As the pile of complicated evidence surrounding the woman’s murder grows higher, so does the heat between Tom and Phil. But opening himself to this degree exposes Tom’s heart in a way he’s not sure he’s ready for…while the murderer’s trigger finger is getting increasingly twitchy."], "author": "J.L. Merrow", "num_pages": "279", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-18 00:00:00", "ISBN": "1619212587"},
{"url": "https://www.goodreads.com/book/show/25001951-secret-deceptions", "num_ratings": "40", "num_reviews": "11", "avg_ratings": 4.5, "genres": ["Romance"], "title": "Secret Deceptions", "description": ["Amatore's Restaurant: ", "The international cast of the Recreative Theatre Company meet for their end-of-season dinner at Ristorante Amatore. As the evening progresses, each guest recalls a past liaison, an encounter which has made an impression in their life: narratives of love and tales of deceit. Will Prudence ever discover the identity of the elusive stranger she meets on", "Amatore's Restaurant: ", "The international cast of the Recreative Theatre Company meet for their end-of-season dinner at Ristorante Amatore. As the evening progresses, each guest recalls a past liaison, an encounter which has made an impression in their life: narratives of love and tales of deceit. Will Prudence ever discover the identity of the elusive stranger she meets on a train? Just how much of a con-man is Monsieur Raul? Has Cordelia's unconventional approach to men proved to be a success? A common theme begins to unfold: hidden truths behind the motives for seduction. As the evening draws to a close emotions rise to the surface, declarations of love are expressed, jealousies and resentments run deep. Who will think back to the evening as a success and who will regard it as nothing more than a disaster? Intriguing, erotic, insightful and perceptive. This novel explores the relationship between characters with a refreshing approach to the theme of seduction. ", "WARNING: Adult content; there are passages which describe sex explicitly.", "Part One: Secret Deceptions", "The first seven chapters from Amatore's Restaurant. This book takes the reader on an atmospheric journey from Berlin to Venice, Marseilles and Amsterdam cleverly interweaving themes of seduction and deception. What are the characters' true motives? Are their feelings genuine or are they just playing games? It soon becomes clear that nothing is as it seems."], "author": "James Sillwood", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-29 00:00:00", "ISBN": "1507686021"},
{"url": "https://www.goodreads.com/book/show/16102490-how-to-repair-a-mechanical-heart", "num_ratings": "2,588", "num_reviews": "459", "avg_ratings": 3.96, "genres": ["Lgbt", "Young Adult", "Romance", "M M Romance", "Contemporary", "Romance"], "title": "How to Repair a Mechanical Heart", "description": ["Eighteen-year-old Castaway Planet fans Brandon and Abel hate bad fan fiction—especially when it pairs their number-one TV crushes of all time, dashing space captain Cadmus and dapper android Sim. As co-runners of the Internet’s third most popular Castaway Planet vlog, they love to spar with the “Cadsim” fangirls who think Cadmus will melt Sim’s mechanical heart by the Seas", "Eighteen-year-old Castaway Planet fans Brandon and Abel hate bad fan fiction—especially when it pairs their number-one TV crushes of all time, dashing space captain Cadmus and dapper android Sim. As co-runners of the Internet’s third most popular Castaway Planet vlog, they love to spar with the “Cadsim” fangirls who think Cadmus will melt Sim’s mechanical heart by the Season 5 finale. This summer, Brandon and Abel have a mission: hit the road in an RV to follow the traveling Castaway Planet convention, interview the actors and showrunner, and uncover proof that a legit Cadsim romance will NEVER, EVER HAPPEN.", "A Brandon and Abel romance: also not happening. Brandon’s sick of his struggle to make “gay and Catholic” compute, so it’s safer to love a TV android. Plus Abel’s got a hot new boyfriend with a phoenix tattoo, and how can Brandon compete with that? But when mysterious messages about them start popping up in the fan community, they make a shocking discovery that slowly forces their real feelings to the surface. Before they get to the last Castaway Planet convention, Brandon’s going to find out the truth: can a mechanical heart be reprogrammed, or will his first shot at love be a full system failure?"], "author": "J.C. Lillis", "num_pages": "255", "awards": [], "places": ["California", "Georgia", "Maryland", "Ohio"], "character_names": [], "language": "English", "publish_date": "2012-09-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22820335-amatore-s-restaurant", "num_ratings": "82", "num_reviews": "40", "avg_ratings": 4.27, "genres": ["Fiction", "Romance", "Short Stories", "Lgbt", "Adult Fiction", "Erotica"], "title": "Amatore's Restaurant", "description": ["It is the end of another successful year for the Recreative Theatre Company and the cast have arranged to meet at Ristorante Amatore for their end-of-season dinner.", "As the evening progresses, each guest recalls a past sexual liaison. In these recollections we are transported to a variety of locations; the rolling countryside of Brittany to the brown cafés of Amsterdam, from", "It is the end of another successful year for the Recreative Theatre Company and the cast have arranged to meet at Ristorante Amatore for their end-of-season dinner.", "As the evening progresses, each guest recalls a past sexual liaison. In these recollections we are transported to a variety of locations; the rolling countryside of Brittany to the brown cafés of Amsterdam, from the grandeur of Venice to the slums of Marseilles. ", "The stories describe various situations: Prudence relates her encounters on a train journey and Colin makes a surprising discovery when he settles down to watch his favourite film. Some characters are driven by self-interest: the sociopath Nicole with her reckless behaviour towards her trusting nephew, and Colette who takes advantage of her unsuspecting tenant. ", "A common theme unfolds: the hidden truths behind the motives for seduction. As the evening comes to a close, old alliances are re-kindled, new attachments are formed, while others are broken. Frustrations rise to the surface as truths are revealed. For some the evening is a great success, for others a disaster.", "WARNING: Adult content; there are passages which describe sex explicitly."], "author": "James Sillwood", "num_pages": "344", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10176.Dress_Your_Family_in_Corduroy_and_Denim", "num_ratings": "218,218", "num_reviews": "5,991", "avg_ratings": 4.09, "genres": ["Humor", "Nonfiction", "Autobiography", "Memoir", "Writing", "Essays", "Short Stories"], "title": "Dress Your Family in Corduroy and Denim", "description": ["David Sedaris plays in the snow with his sisters. He goes on vacation with his family. He gets a job selling drinks. He attends his brother's wedding. He mops his sister's floor. He gives directions to a lost traveler. He eats a hamburger. He has his blood sugar tested. It all sounds so normal, doesn't it? In this collection of essays, Sedaris lifts the corner of ordinary", "David Sedaris plays in the snow with his sisters. He goes on vacation with his family. He gets a job selling drinks. He attends his brother's wedding. He mops his sister's floor. He gives directions to a lost traveler. He eats a hamburger. He has his blood sugar tested. It all sounds so normal, doesn't it? In this collection of essays, Sedaris lifts the corner of ordinary life, revealing the absurdity teeming below its surface. His world is alive with obscure desires and hidden motives--a world where forgiveness is automatic and an argument can be the highest form of love. Dress Your Family in Corduroy and Denim is another unforgettable collection from one of the wittiest and most original writers at work today."], "author": "David Sedaris", "num_pages": "272", "awards": ["Audie Award for Humor (2005)", "Grammy Award Nominee for Best Spoken Word Album (2005)"], "places": [], "character_names": ["David Sedaris"], "language": "English", "publish_date": "2004-01-01 00:00:00", "ISBN": "0965904830"},
{"url": "https://www.goodreads.com/book/show/6802083-as-you-are", "num_ratings": "1,938", "num_reviews": "233", "avg_ratings": 3.81, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Lgbt"], "title": "As You Are", "description": ["Operation Danny… that's all bartender and recent college graduate, Julian Hallowell has had on his mind the past year. Julian may have no idea what he wants to do with his life, but he definitely knows he's in love with the boy next door: the one in the next room to be exact, his roommate Danny Wallace. ", "Danny owns a used text book store just off campus and while Julian has", "Operation Danny… that's all bartender and recent college graduate, Julian Hallowell has had on his mind the past year. Julian may have no idea what he wants to do with his life, but he definitely knows he's in love with the boy next door: the one in the next room to be exact, his roommate Danny Wallace. ", "Danny owns a used text book store just off campus and while Julian has done his level best to make Danny fall for him, all his hard work appears to have been in vain. Danny doesn't seem to view Julian as anything other than that… a roommate and friend. So when new guy in town Andy Baker asks him out on a date, Julian can't seem to think of a good reason to say no.", "Julian has already instituted a Reverse Operation Danny plan, which he's positive will purge all thoughts of love and lust for his roomie out of his head. He's ready to move on and start looking for his next Mr. Right, and Andy just might fit the bill. But has he given up too soon?"], "author": "Ethan Day", "num_pages": "193", "awards": [], "places": ["Missouri", "Louisiana"], "character_names": ["Julian Hallowell", "Danny Wallace"], "language": "English", "publish_date": "2009-09-29 00:00:00", "ISBN": "1607374404"},
{"url": "https://www.goodreads.com/book/show/13484085-frat-boy-and-toppy", "num_ratings": "4,293", "num_reviews": "620", "avg_ratings": 3.76, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Academic", "College", "Adult Fiction", "Erotica"], "title": "Frat Boy and Toppy", "description": ["Brad is great at meeting other people’s expectations. But his own? Not so much. Take the gay thing. Okay, so yeah. It took a morning meeting with a frat brother’s hairy, naked ass for him to admit it, but he knows the truth about himself now. Let the gay life commence.", "Unfortunately, it’s not that easy. He hasn’t quite determined how to come out to anyone, even Sebastian, t", "Brad is great at meeting other people’s expectations. But his own? Not so much. Take the gay thing. Okay, so yeah. It took a morning meeting with a frat brother’s hairy, naked ass for him to admit it, but he knows the truth about himself now. Let the gay life commence.", "Unfortunately, it’s not that easy. He hasn’t quite determined how to come out to anyone, even Sebastian, the geeky-hot TA in his history class. Sebastian is everything Brad is not. Intellectual, suave, hairy. Out. And he doesn’t seem interested in Brad, even when Brad makes a fool of himself trying to catch his notice.", "Score one for foolery: Sebastian does more than notice Brad; he takes him to bed. Brad’s been with plenty of girls, but with Sebastian, the sex is something else entirely—hot, mind-blowing, affirming, and a little domineering in a way that drives him wild. But when great sex turns into something more—dare he admit the “L” word?—Brad must face the crushing realization that Sebastian doesn’t feel the same. Unless, of course, he does. After all, even grad students can be idiots about matters of the heart."], "author": "Anne Tenino", "num_pages": "174", "awards": [], "places": ["Pacific Northwest", "Oregon"], "character_names": ["Brad Feller", "Sebastian DeWitt"], "language": "English", "publish_date": "2012-03-26 00:00:00", "ISBN": "193755127X"},
{"url": "https://www.goodreads.com/book/show/24468673-the-lightning-struck-heart", "num_ratings": "5,769", "num_reviews": "1,265", "avg_ratings": 4.49, "genres": ["Fantasy", "Romance", "M M Romance", "Romance", "Fantasy", "Magic", "Lgbt", "Humor", "Funny"], "title": "The Lightning-Struck Heart", "description": ["Once upon a time, in an alleyway in the slums of the City of Lockes, a young and somewhat lonely boy named Sam Haversford turns a group of teenage douchebags into stone completely by accident.", "Of course, this catches the attention of a higher power, and Sam's pulled from the only world he knows to become an apprentice to the King's Wizard, Morgan of Shadows.", "When Sam is four", "Once upon a time, in an alleyway in the slums of the City of Lockes, a young and somewhat lonely boy named Sam Haversford turns a group of teenage douchebags into stone completely by accident.", "Of course, this catches the attention of a higher power, and Sam's pulled from the only world he knows to become an apprentice to the King's Wizard, Morgan of Shadows.", "When Sam is fourteen, he enters the Dark Woods and returns with Gary, the hornless gay unicorn, and a half-giant named Tiggy, earning the moniker Sam of Wilds.", "At fifteen, Sam learns what love truly is when a new knight arrives at the castle. Sir Ryan Foxheart, the dreamiest dream to have ever been dreamed.", "Naturally, it all goes to hell through the years when Ryan dates the reprehensible Prince Justin, Sam can't control his magic, a sexually aggressive dragon kidnaps the prince, and the King sends them on an epic quest to save Ryan's boyfriend, all while Sam falls more in love with someone he can never have.", "Or so he thinks."], "author": "T.J. Klune", "num_pages": "400", "awards": [], "places": ["Verania"], "character_names": ["Sam Haversford", "Ryan Foxheart", "Gary", "Tiggy", "Morgan of Shadows", "Prince Justin", "Pete"], "language": "English", "publish_date": "2015-07-20 00:00:00", "ISBN": "163476367X"},
{"url": "https://www.goodreads.com/book/show/15871302-conversations-with-s-teri-o-type", "num_ratings": "57", "num_reviews": "18", "avg_ratings": 3.86, "genres": ["Romance", "M M Romance", "Humor", "Contemporary", "Lgbt", "Humor", "Funny", "Romance"], "title": "Conversations with S. Teri O'Type (a Satire)", "description": ["Curt Child is a man who just can't seem to get gay, so he's enlisted the help of his oldest--and gayest--friend S. Teri O'Type to drag him a few inches down The Road of Greater Gayness.", "Also available on Kindle. "], "author": "Christopher  Allen", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-28 00:00:00", "ISBN": "1479160253"},
{"url": "https://www.goodreads.com/book/show/13579947-who-we-are", "num_ratings": "5,310", "num_reviews": "603", "avg_ratings": 4.46, "genres": ["Romance", "M M Romance", "Romance", "Contemporary"], "title": "Who We Are", "description": ["Bear, Otter, and the Kid survived last summer with their hearts and souls intact. They’ve moved into the Green Monstrosity, and Bear is finally able to admit his love for the man who saved him from himself. ", "But that's not the end of their story. How could it be? ", "The boys find that life doesn’t stop just because they got their happi", "Bear, Otter, and the Kid survived last summer with their hearts and souls intact. They’ve moved into the Green Monstrosity, and Bear is finally able to admit his love for the man who saved him from himself. ", "But that's not the end of their story. How could it be? ", "The boys find that life doesn’t stop just because they got their happily ever after. There’s still the custody battle for the Kid. The return of Otter’s parents. A first trip to a gay bar. The Kid goes to therapy, and Mrs. Paquinn decides that Bigfoot is real. Anna and Creed do… well, whatever it is Anna and Creed do. There are newfound jealousies, the return of old enemies, bad poetry, and misanthropic seagulls. And through it all, Bear struggles to understand his mother’s abandonment of him and his brother, only to delve deeper into their shared past. What he finds there will alter their lives forever and help him realize what it'll take to become who they're supposed to be. ", "Family is not always defined by blood. It’s defined by those who make us whole—those who make us who we are."], "author": "T.J. Klune", "num_pages": "329", "awards": [], "places": ["Seafare, Oregon"], "character_names": ["Tyson \"Kid\" James Thompson", "Derrick \"Bear\" McKenna", "Oliver \"Otter\" Thompson"], "language": "English", "publish_date": "2012-04-27 00:00:00", "ISBN": "1613724608"},
{"url": "https://www.goodreads.com/book/show/9580375-sno-ho", "num_ratings": "2,426", "num_reviews": "317", "avg_ratings": 3.9, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Humor", "Funny"], "title": "Sno Ho", "description": ["Boone Daniels seems to have trouble finishing things. Along with the half dozen or so novels he's started, only to abandon mid-way through, his love life could be best described as a series of drive-bys. ", "Boone has spent the past week staying at a ski lodge in the tiny mountain town of Summit City. He's been using his time alone to write while waiting for his boyfriend to j", "Boone Daniels seems to have trouble finishing things. Along with the half dozen or so novels he's started, only to abandon mid-way through, his love life could be best described as a series of drive-bys. ", "Boone has spent the past week staying at a ski lodge in the tiny mountain town of Summit City. He's been using his time alone to write while waiting for his boyfriend to join him for their anniversary. ", "What happens to Boone when he winds up dumped on the eve of his one-year anniversary and ends up at a bar having one too many cocktails? Wade Walker."], "author": "Ethan Day", "num_pages": "106", "awards": [], "places": ["New Mexico", "Summit City, Colorado"], "character_names": ["Boone Daniels", "Wade Walker"], "language": "English", "publish_date": "2010-10-26 00:00:00", "ISBN": "1608202488"},
{"url": "https://www.goodreads.com/book/show/11045338-muscling-through", "num_ratings": "4,987", "num_reviews": "776", "avg_ratings": 3.95, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Romance", "Contemporary Romance"], "title": "Muscling Through", "description": ["Cambridge art professor Larry Morton takes one, alcohol-glazed look at the huge, tattooed man looming in a dark alley, and assumes he’s done for. Moments later he finds himself disarmed—literally and figuratively. And, the next morning, he can’t rest until he offers an apology to the man who turned out to be more gentle", "Cambridge art professor Larry Morton takes one, alcohol-glazed look at the huge, tattooed man looming in a dark alley, and assumes he’s done for. Moments later he finds himself disarmed—literally and figuratively. And, the next morning, he can’t rest until he offers an apology to the man who turned out to be more gentle than giant. ", "Larry's intrigued to find there's more to Al Fletcher than meets the eye; he possesses a natural artistic talent that shines through untutored technique. Unfortunately, no one else seems to see the sensitive soul beneath Al’s imposing, scarred, undeniably sexy exterior. Least of all Larry's class-conscious family, who would like nothing better than to split up this mismatched pair. ", "Is it physical? Oh, yes, it’s deliciously physical, and so much more—which makes Larry’s next task so daunting. Not just convincing his colleagues, friends and family that their relationship is more than skin deep. It’s convincing Al. ", "Contains comic misunderstandings, misuse of art materials, and unexpected poignancy."], "author": "J.L. Merrow", "num_pages": "116", "awards": [], "places": ["Cambridge, England", "England"], "character_names": [], "language": "English", "publish_date": "2011-07-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13614864-know-not-why", "num_ratings": "3,039", "num_reviews": "466", "avg_ratings": 4.04, "genres": ["Romance", "M M Romance", "Lgbt", "Romance", "Contemporary", "Young Adult"], "title": "Know Not Why", "description": ["Howie gets a job at Artie Kraft's Arts 'N Crafts hoping to score with his lady coworkers. After all, girls love a sensitive guy, and what's more sensitive than dedicating your life to selling yarn and ... stuff? (Okay, so maybe it'd be a good idea to actually learn what one sells at an arts 'n crafts store.) But things don't go exactly according to plan. Coworker #1 is Cor", "Howie gets a job at Artie Kraft's Arts 'N Crafts hoping to score with his lady coworkers. After all, girls love a sensitive guy, and what's more sensitive than dedicating your life to selling yarn and ... stuff? (Okay, so maybe it'd be a good idea to actually learn what one sells at an arts 'n crafts store.) But things don't go exactly according to plan. Coworker #1 is Cora: tiny, much-pierced, and way too fierce to screw with in any sense. Coworker #2 is Kristy: blonde, bubbly, unattainable perfection. And Coworker #3 is, well, Arthur. It goes without saying that he’s not an option. Right?", "… Right?", "Yeah, Howie’s life just got straight up confusing.", "Pun intended."], "author": "Hannah  Johnson", "num_pages": "317", "awards": [], "places": [], "character_names": ["Howard 'Howie' Jenkins", "Arthur Kraft Jr.", "Cora Caldwell", "Kristy Quincy", "Amber Clark", "Mitchell Ballard"], "language": "English", "publish_date": "2012-04-23 00:00:00", "ISBN": "1476149038"},
{"url": "https://www.goodreads.com/book/show/6567017-will-grayson-will-grayson", "num_ratings": "287,794", "num_reviews": "16,861", "avg_ratings": 3.82, "genres": ["Young Adult", "Contemporary", "Lgbt", "Fiction"], "title": "Will Grayson, Will Grayson", "description": ["Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.", "It's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the sa", "Will Grayson meets Will Grayson. One cold night, in a most unlikely corner of Chicago, two strangers are about to cross paths. From that moment on, their world will collide and lives intertwine.", "It's not that far from Evanston to Naperville, but Chicago suburbanites Will Grayson and Will Grayson might as well live on different planets. When fate delivers them both to the same surprising crossroads, the Will Graysons find their lives overlapping and hurtling in new and unexpected directions. With a push from friends new and old - including the massive, and massively fabulous, Tiny Cooper, offensive lineman and musical theater auteur extraordinaire - Will and Will begin building toward respective romantic turns-of-heart and the epic production of history's most awesome high school musical."], "author": "John Green", "num_pages": "310", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2011)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Novel (2010)", "Odyssey Award Nominee (2011)", "Milwaukee County Teen Book Award (2011)", "Children's Choice Book Award for Teen Choice Book of the Year (2011)", "The Inky Awards Nominee for Silver Inky (2010)", "Lincoln Award Nominee (2013)", "Goodreads Choice Award Nominee for Young Adult Fiction (2010)", "The Inky Awards Shortlist for Silver Inky (2010)"], "places": ["Illinois"], "character_names": ["Will Grayson", "Tiny Cooper", "Jane Turner", "Maura"], "language": "English", "publish_date": "2010-04-06 00:00:00", "ISBN": "0525421580"},
{"url": "https://www.goodreads.com/book/show/4137.Me_Talk_Pretty_One_Day", "num_ratings": "548,885", "num_reviews": "15,798", "avg_ratings": 3.97, "genres": ["Nonfiction", "Humor", "Autobiography", "Memoir", "Writing", "Essays", "Short Stories"], "title": "Me Talk Pretty One Day", "description": ["David Sedaris' move to Paris from New York inspired these hilarious pieces, including the title essay, about his attempts to learn French from a sadistic teacher who declares that every day spent with you is like having a caesarean section. His family is another inspiration. You Can't Kill the Rooster is a portrait of his brother, who talks incessant hip-hop slang to his b", "David Sedaris' move to Paris from New York inspired these hilarious pieces, including the title essay, about his attempts to learn French from a sadistic teacher who declares that every day spent with you is like having a caesarean section. His family is another inspiration. You Can't Kill the Rooster is a portrait of his brother, who talks incessant hip-hop slang to his bewildered father. And no one hones a finer fury in response to such modern annoyances as restaurant meals presented in ludicrous towers of food and cashiers with six-inch fingernails."], "author": "David Sedaris", "num_pages": "272", "awards": ["Lambda Literary Award for Humor (2001)", "Puddly Award for Humor (2001)", "Thurber Prize for American Humor (2001)"], "places": ["Paris", "Raleigh, North Carolina", "New York City, New York"], "character_names": ["David Sedaris"], "language": "English", "publish_date": "2001-08-16 00:00:00", "ISBN": "0349113912"},
{"url": "https://www.goodreads.com/book/show/17909430-life-is-a-circus-run-by-a-platypus", "num_ratings": "254", "num_reviews": "68", "avg_ratings": 3.9, "genres": ["Humor", "Nonfiction", "Short Stories", "Autobiography", "Memoir", "Biography"], "title": "Life is a Circus Run by a Platypus", "description": ["Has being late to work due to dancing clowns ever been a problem for you? Have you ever had to defend yourself against a giant iguana? Does the overture to The Music Man make you violently twitch? In Life is a Circus Run by a Platypus readers are immersed into what it would be like to live every day as if a herd of ballerinas were chasing you, without the inconvenience of", "Has being late to work due to dancing clowns ever been a problem for you? Have you ever had to defend yourself against a giant iguana? Does the overture to The Music Man make you violently twitch? In Life is a Circus Run by a Platypus readers are immersed into what it would be like to live every day as if a herd of ballerinas were chasing you, without the inconvenience of actually having to run. This collection of truly bizarre short stories taken from the author, Allison Hawn’s, life takes one across the world and into the strangest crevices of civilization. The lessons learned through her adventures might very well save the reader if they too ever have to face birthing a cow, calming distraught technical support or death by furniture."], "author": "Allison Hawn", "num_pages": "142", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-06 00:00:00", "ISBN": "0615810950"},
{"url": "https://www.goodreads.com/book/show/6897264-i-ll-be-your-drill-soldier", "num_ratings": "4,681", "num_reviews": "647", "avg_ratings": 4.11, "genres": ["Romance", "M M Romance", "War", "Military Fiction", "Romance", "Contemporary"], "title": "I'll Be Your Drill, Soldier", "description": ["Ryan Gracin had a good life until he told his parents he was gay. Since they yanked their support for college he had to find a way to pay for it. Little did he know that joining the Army was going to change his life forever. Especially when he was introduced to a Drill Sergeant who was nicknamed 'Big Daddy'.", "Phillip Grabowski had joined the Army to follow in his father's fo", "Ryan Gracin had a good life until he told his parents he was gay. Since they yanked their support for college he had to find a way to pay for it. Little did he know that joining the Army was going to change his life forever. Especially when he was introduced to a Drill Sergeant who was nicknamed 'Big Daddy'.", "Phillip Grabowski had joined the Army to follow in his father's footsteps; by the time Ryan entered, he had already made a name for himself. He was a soldier's soldier, but Ryan was making it really hard for him to remember that.", "69,653 words."], "author": "Crystal Rose", "num_pages": "186", "awards": [], "places": ["Missouri", "Texas"], "character_names": [], "language": "English", "publish_date": "2009-07-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6597858-one-of-those-days", "num_ratings": "1,857", "num_reviews": "260", "avg_ratings": 3.75, "genres": ["Romance", "M M Romance", "Contemporary", "Short Stories", "Romance", "Humor", "Funny", "Humor", "Lgbt", "Romance", "Contemporary Romance", "Adult Fiction", "Erotica", "Glbt", "Gay"], "title": "One of Those Days", "description": ["When Alex wakes up one morning, and everything starts to go wrong, he knows it’s going to be one of those days. Things get worse when his high school bully, captain of the football team and meathead extraordinaire, Ric Saunders, shows up for an appointment at the chiropractic clinic where Alex work", "When Alex wakes up one morning, and everything starts to go wrong, he knows it’s going to be one of those days. Things get worse when his high school bully, captain of the football team and meathead extraordinaire, Ric Saunders, shows up for an appointment at the chiropractic clinic where Alex works. ", "Things go from bad to worse in a comedy of errors that leaves Alex's head spinning. Has Ric turned into a crazed stalker, ready to pick up the bullying where he left off eight years before? Or has Ric got something else in mind this time?"], "author": "Zathyn Priest", "num_pages": "24", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15850229-if-it-s-a-choice-my-zygote-chose-balls", "num_ratings": "74", "num_reviews": "10", "avg_ratings": 4.41, "genres": ["Lgbt", "Politics", "Nonfiction", "Glbt", "Queer", "Glbt", "Gay"], "title": "If It's A Choice, My Zygote Chose Balls: Making Sense of Senseless Controversy", "description": ["Jeremy Hooper's Good As You website (", ") is known for blending passion and wit, making the case for LGBT equality worldwide. In If It’s a Choice, My Zygote Chose Balls: Making Sense of Senseless Controversy, Jeremy continues that style, blending a unique mix of memoir and social commentary that argues for equal rights based on relatable human principles.", "Hoop", "Jeremy Hooper's Good As You website (", ") is known for blending passion and wit, making the case for LGBT equality worldwide. In If It’s a Choice, My Zygote Chose Balls: Making Sense of Senseless Controversy, Jeremy continues that style, blending a unique mix of memoir and social commentary that argues for equal rights based on relatable human principles.", "Hooper leads readers through his own life story, revealing the positive and unnecessarily encumbered aspects of growing up gay in contemporary society. The noted author and activist writes in a sometimes humorous, sometimes serious, but always sharply informed style, opening a window into the realities of family rejection and acceptance. Whether offering direct guidance for would-be straight allies or sharing the inner monologue of a boy who knew who he was long before early adulthood would allow him to own it, Hooper provides a wealth of insight and argument to push the equality conversation forward.", "“From constant talk about marriage to the popular parlor game ‘Which celebrity is gay?’ our world is, in many ways, obsessed with LGBT topics,” says Hooper. “However, there is serious neglect in terms of actually tackling the issues at hand. I want to address the weighty topics head on, but in a relatable way.”", "As someone who spends ten to twelve daily hours slogging through the \"culture war\" for his celebrated website, Jeremy Hooper knows better than anyone how far the LGBT community still has to go in order to obtain full equality. At the same time, his focused lens had led him to believe that some of the usual LGBT activism has isolated the fight and stories, leaving much of the continued struggle to go unrealized by the population at large. So Hooper's answer is to present relatable tales that are just as proactive in changing hearts and minds as any textbook gay rights treatment, but doing so in a package that pops with universal heart and wit. Hooper calls out the B.S. for what it is, while keeping an equal focus on uniting folks from all walks of life for the common causes of peace, equality, acceptance, and, ironically enough–family values. All of this while remembering to keep his tongue in or around the cheek region.", "Written to engage and entertain, as well as inspire further discussion and action, the book is aimed at a wide range of readers interested and open to learning."], "author": "Jeremy Hooper", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12156759-bear-otter-and-the-kid", "num_ratings": "8,929", "num_reviews": "1,212", "avg_ratings": 4.2, "genres": ["Romance", "M M Romance", "Romance", "Contemporary"], "title": "Bear, Otter, and the Kid", "description": ["Three years ago, Bear McKenna’s mother took off for parts unknown with her new boyfriend, leaving Bear to raise his six-year-old brother Tyson, aka the Kid. Somehow they’ve muddled through, but since he’s totally devoted to the Kid, Bear isn’t actually doing much living. With a few exceptions, he’s retreated from the world, and he’s mostly okay with that - until Otter come", "Three years ago, Bear McKenna’s mother took off for parts unknown with her new boyfriend, leaving Bear to raise his six-year-old brother Tyson, aka the Kid. Somehow they’ve muddled through, but since he’s totally devoted to the Kid, Bear isn’t actually doing much living. With a few exceptions, he’s retreated from the world, and he’s mostly okay with that - until Otter comes home.", "Otter is Bear’s best friend’s older brother, and as they’ve done for their whole lives, Bear and Otter crash and collide in ways neither expect. This time, though, there’s nowhere to run from the depth of emotion between them. Bear still believes his place is as the Kid’s guardian, but he can’t help thinking there could be something more for him in the world ... something or someone."], "author": "T.J. Klune", "num_pages": "350", "awards": [], "places": ["Seafare, Oregon", "Oregon"], "character_names": ["Tyson \"Kid\" James Thompson", "Derrick \"Bear\" McKenna", "Oliver \"Otter\" Thompson"], "language": "English", "publish_date": "2011-08-12 00:00:00", "ISBN": "1613720874"},
{"url": "https://www.goodreads.com/book/show/17194490-tell-me-it-s-real", "num_ratings": "5,261", "num_reviews": "1,021", "avg_ratings": 4.28, "genres": ["Romance", "M M Romance", "Romance", "Humor", "Funny", "Humor"], "title": "Tell Me It's Real", "description": ["Do you believe in love at first sight?", "Paul Auster doesn't. Paul doesn't believe in much at all. He’s thirty, slightly overweight, and his best features are his acerbic wit and the color commentary he provides as life passes him by. His closest friends are a two-legged dog named Wheels and a quasibipolar drag queen named Helena Handbasket. He works a dead-end job in a soul-", "Do you believe in love at first sight?", "Paul Auster doesn't. Paul doesn't believe in much at all. He’s thirty, slightly overweight, and his best features are his acerbic wit and the color commentary he provides as life passes him by. His closest friends are a two-legged dog named Wheels and a quasibipolar drag queen named Helena Handbasket. He works a dead-end job in a soul-sucking cubicle, and if his grandmother's homophobic parrot insults him one more time, Paul is going to wring its stupid neck.", "Enter Vince Taylor.", "Vince is everything Paul isn’t: sexy, confident, and dumber than the proverbial box of rocks. And for some reason, Vince pursues Paul relentlessly. Vince must be messing with him, because there is no way Vince could want someone like Paul.", "But when Paul hits Vince with his car—in a completely unintentional if-he-died-it'd-only-be-manslaughter kind of way—he's forced to see Vince in a whole new light. The only thing stopping Paul from believing in Vince is himself—and that is one obstacle Paul can’t quite seem to overcome. But when tragedy strikes Vince's family, Paul must put aside any notions he has about himself and stand next to the man who thinks he's perfect the way he is."], "author": "T.J. Klune", "num_pages": "350", "awards": [], "places": ["Tucson, Arizona", "Arizona"], "character_names": ["Paul James Auster", "Vince Melody Taylor", "Sanford \"Sandy\" Stewart"], "language": "English", "publish_date": "2013-02-15 00:00:00", "ISBN": "1623803535"},
{"url": "https://www.goodreads.com/book/show/4138.Naked", "num_ratings": "215,174", "num_reviews": "5,309", "avg_ratings": 4.09, "genres": ["Humor", "Nonfiction", "Autobiography", "Memoir", "Writing", "Essays", "Short Stories"], "title": "Naked", "description": ["Welcome to the hilarious, strange, elegiac, outrageous world of David Sedaris. In ", ", Sedaris turns the mania for memoir on its proverbial ear, mining the exceedingly rich terrain of his life, his family, and his unique worldview—a sensibility at once take-no-prisoners sharp and deeply charitable. A tart-tongued mother does dead-on imitations of her young son's nervous", "Welcome to the hilarious, strange, elegiac, outrageous world of David Sedaris. In ", ", Sedaris turns the mania for memoir on its proverbial ear, mining the exceedingly rich terrain of his life, his family, and his unique worldview—a sensibility at once take-no-prisoners sharp and deeply charitable. A tart-tongued mother does dead-on imitations of her young son's nervous tics, to the great amusement of his teachers; a stint of Kerouackian wandering is undertaken (of course!) with a quadriplegic companion; a family gathers for a wedding in the face of imminent death. Through it all is Sedaris's unmistakable voice, without doubt one of the freshest in American writing."], "author": "David Sedaris", "num_pages": "304", "awards": ["Randy Shilts Award for Gay Nonfiction (1998)", "Thurber Prize Nominee for American Humor (1997)"], "places": [], "character_names": ["David Sedaris"], "language": "English", "publish_date": "1998-08-16 00:00:00", "ISBN": "0316777730"},
{"url": "https://www.goodreads.com/book/show/13420351-shattered-glass", "num_ratings": "8,120", "num_reviews": "1,178", "avg_ratings": 4.1, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Shattered Glass", "description": ["A male prostitute, a mangy cat, a murder and a maniacal mix-up that threatens his career, his impending marriage and his life. Nothing is going as planned for Austin Glass.", "Austin—seems to have it all. At least on the surface. A loving fiancee. A future with the FBI and a healthy sized trust fund. He also has a grin and a wisecrack for every situation. But the smile he pres", "A male prostitute, a mangy cat, a murder and a maniacal mix-up that threatens his career, his impending marriage and his life. Nothing is going as planned for Austin Glass.", "Austin—seems to have it all. At least on the surface. A loving fiancee. A future with the FBI and a healthy sized trust fund. He also has a grin and a wisecrack for every situation. But the smile he presents to everyone hides a painful past he’s buried too deeply to remember. And his quips mask bitterness and insecurity. Austin has himself and most of the whole world fooled. Until he meets someone who immediately sees him better than he sees himself.", "As events unfold and Austin’s world unravels, he finds himself pushed into making quick life-changing decisions. But can he trust Peter or what’s happening between them when each meeting seems to be just a series of volatile reactions?"], "author": "Dani Alexander", "num_pages": "360", "awards": [], "places": ["Denver, Colorado"], "character_names": ["Austin Glass", "Peter \"Rabbit\" Dyachenko", "Nikolaj Strakosha", "Darryl Boerner", "Luis Martinez", "Dave Buchanan"], "language": "English", "publish_date": "2012-01-31 00:00:00", "ISBN": "1465850090"}
]