[
{"url": "https://www.goodreads.com/book/show/17302571-if-you-could-be-mine", "num_ratings": "6,666", "num_reviews": "1,018", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Romance", "Fiction", "Contemporary", "Glbt", "Queer"], "title": "If You Could Be Mine", "description": ["Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged f", "Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged for her marriage. Nasrin tries to persuade Sahar that they can go on as they have been, only now with new comforts provided by the decent, well-to-do doctor Nasrin will marry. But Sahar dreams of loving Nasrin exclusively—and openly.", "Then Sahar discovers what seems like the perfect solution. In Iran, homosexuality may be a crime, but to be a man trapped in a woman’s body is seen as nature’s mistake, and sex reassignment is legal and accessible. As a man, Sahar could be the one to marry Nasrin. Sahar will never be able to love the one she wants, in the body she wants to be loved in, without risking her life. Is saving her love worth sacrificing her true self?"], "author": "Sara Farizan", "num_pages": "256", "awards": ["Edmund White Award for Debut Fiction (2014)", "Ferro-Grumley Award for LGBT Fiction (2014)", "Lambda Literary Award for Debut Lesbian Fiction (2014)", "Lincoln Award Nominee (2016)"], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "1616202513"},
{"url": "https://www.goodreads.com/book/show/2755870-the-winter-war", "num_ratings": "204", "num_reviews": "45", "avg_ratings": 3.87, "genres": ["Historical", "Historical Fiction", "Fiction", "Adventure", "Young Adult", "Adventure", "Survival", "War", "Military Fiction", "War", "Historical"], "title": "The Winter War", "description": ["When the Soviet Union invades its tiny neighbor Finland in November 1939, Marko volunteers to help the war effort. Even though his leg was weakened by polio, he can ski well, and he becomes a messenger on the front line, skiing in white camouflage through the forests at night. The dark forest is terrifying, and so are the odds against the Finns: the Russians have 4 times a", "When the Soviet Union invades its tiny neighbor Finland in November 1939, Marko volunteers to help the war effort. Even though his leg was weakened by polio, he can ski well, and he becomes a messenger on the front line, skiing in white camouflage through the forests at night. The dark forest is terrifying, and so are the odds against the Finns: the Russians have 4 times as many soldiers and 30 times as many planes. They have 3000 tanks, while the Finns have 30. But a tank is no help in the snowy forest–a boy on skis is. And the Russians don’t know winter the way the Finns do, or what tough guerrilla warriors the Finns are. Marko teams up with another messenger, Karl. Gradually Marko learns that Karl’s whole family was killed by the Russians. And Karl has a secret–he’s really Kaari, a girl who joined up to get revenge for her family’s deaths."], "author": "William Durbin", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-02-12 00:00:00", "ISBN": "0385746520"},
{"url": "https://www.goodreads.com/book/show/1562663.Malka", "num_ratings": "705", "num_reviews": "51", "avg_ratings": 3.77, "genres": ["Historical", "Historical Fiction", "World War II", "Holocaust", "Young Adult", "War", "World War II", "Fiction"], "title": "Malka", "description": ["When the roundups start, Malka's mother knows she must get her daughters-seven- year-old Malka and sixteen-year-old Minna-across the Hungarian border to safety, a place where they hope Jews can live in peace. But escape proves harder than they could have imagined, with bleeding feet, bad weather, and homesickness, and little Malka falls ill. Left behind to be brought acros", "When the roundups start, Malka's mother knows she must get her daughters-seven- year-old Malka and sixteen-year-old Minna-across the Hungarian border to safety, a place where they hope Jews can live in peace. But escape proves harder than they could have imagined, with bleeding feet, bad weather, and homesickness, and little Malka falls ill. Left behind to be brought across when the threat has passed, Malka finds herself in a terrifying world full of strangers, starvation, and constant fear of Nazi roundups. As time passes, it becomes more and more apparent that the threat is far from over. Completely alone, Malka struggles to stay hidden, unaware that miles away, a brokenhearted mother is searching frantically for her lost little girl."], "author": "Mirjam Pressler", "num_pages": "288", "awards": ["Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2002)", "Deutscher Bücherpreis for Kinder- und Jugendbuch (2002)", "Goldener Lufti (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-17 00:00:00", "ISBN": "0142402699"},
{"url": "https://www.goodreads.com/book/show/2006669.The_Darkest_Evening", "num_ratings": "71", "num_reviews": "27", "avg_ratings": 3.72, "genres": ["Historical", "Historical Fiction", "Young Adult", "Adventure", "Fiction", "Russian History", "Soviet Union"], "title": "The Darkest Evening", "description": ["A thrilling novel of a young boy's devastation when his father uproots him and moves their family to Russia, where a society of Finnish-Socialists attempt to found a workers' paradise.", "Jake's life is turned upside down when his father gets caught up in the Socialist fervor washing over their Finnish mining community in Minnesota. His father decides to move their family to a", "A thrilling novel of a young boy's devastation when his father uproots him and moves their family to Russia, where a society of Finnish-Socialists attempt to found a workers' paradise.", "Jake's life is turned upside down when his father gets caught up in the Socialist fervor washing over their Finnish mining community in Minnesota. His father decides to move their family to a new, Finnish state inside the Soviet Union, a change that fills Jake with dread. Where his father dreams of creating a worker's paradise, Jake and his family find disappointment and hardship. The story culminates with a thrilling escape--on skis--from Russia to Finland."], "author": "William Durbin", "num_pages": "240", "awards": ["Minnesota Book Award for Children’s Fiction and Poetry (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "0439373077"},
{"url": "https://www.goodreads.com/book/show/6266984-panama", "num_ratings": "77", "num_reviews": "29", "avg_ratings": 2.69, "genres": ["Historical", "Historical Fiction", "Romance", "Historical", "Young Adult", "Young Adult", "Young Adult Romance", "Young Adult", "Teen"], "title": "Panama", "description": ["At fifteen, a girl moves from a small town in Ohio to Panama while her father takes part in building the Panama Canal. This trip comes just at the right time for her. She yearns to see more of the world than her small mid-western town has to offer. She wants to meet new people. Visit exciting places. Panama with its lush rainforests and myriad of people is the perfect plac", "At fifteen, a girl moves from a small town in Ohio to Panama while her father takes part in building the Panama Canal. This trip comes just at the right time for her. She yearns to see more of the world than her small mid-western town has to offer. She wants to meet new people. Visit exciting places. Panama with its lush rainforests and myriad of people is the perfect place for her desires to be fulfilled. Then she meets Frederico, a Spanish aristocrat who is working as a digger, one of the masses who toils daily in the heat and the dust and the danger of the canal. He embodies everything she's looking for: he's exotic, exciting, intelligent and pushes her beyond the limits her sequestered life has set for her. ", "Shelby Hiatt got the idea to write about the Panama Canal after visiting it and getting to know many Zoners, descendants of the people who lived and worked on the canal."], "author": "Shelby Hiatt", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-28 00:00:00", "ISBN": "0547196008"},
{"url": "https://www.goodreads.com/book/show/484143.Soldier_X", "num_ratings": "2,779", "num_reviews": "363", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "War", "World War II", "War", "Historical"], "title": "Soldier X", "description": ["Sixteen-year-old Erik Brandt barely knows what Germany is fighting for when he is drafted into Hitler's army in 1944. Sent to the killing fields of the Eastern Front, he is surrounded by unimaginable sights, more horrific than he ever thought possible. It's kill or be killed, and it seems clear that Erik's days are numbered. Until, covered in blood and seriously injured, h", "Sixteen-year-old Erik Brandt barely knows what Germany is fighting for when he is drafted into Hitler's army in 1944. Sent to the killing fields of the Eastern Front, he is surrounded by unimaginable sights, more horrific than he ever thought possible. It's kill or be killed, and it seems clear that Erik's days are numbered. Until, covered in blood and seriously injured, he conceives of another way to survive. Filled with gritty and visceral detail, ", " will change the way every reader thinks about the reality of war."], "author": "Don L. Wulffson", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-07-14 00:00:00", "ISBN": "0142500739"},
{"url": "https://www.goodreads.com/book/show/6574560-a-golden-web", "num_ratings": "670", "num_reviews": "120", "avg_ratings": 3.46, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Romance", "Cultural", "Italy", "Historical", "Medieval"], "title": "A Golden Web", "description": ["Alessandra is desperate to escape.", "Desperate to escape her stepmother, who's locked her away for a year; to escape the cloister that awaits her and the marriage plans that have been made for her; to escape the expectations that limit her and every other girl in fourteenth-century Italy. There's no tolerance in her quiet village for Alessandra and her keen intelligence and u", "Alessandra is desperate to escape.", "Desperate to escape her stepmother, who's locked her away for a year; to escape the cloister that awaits her and the marriage plans that have been made for her; to escape the expectations that limit her and every other girl in fourteenth-century Italy. There's no tolerance in her quiet village for Alessandra and her keen intelligence and unconventional ideas.", "In defiant pursuit of her dreams, Alessandra undertakes an audacious quest, her bravery equaled only by the dangers she faces. Disguised and alone in a city of spies and scholars, Alessandra will find a love she could not foresee -- and an enduring fame.", "In this exquisite imagining of the centuries-old story of Alessandra Giliani, the world's first female anatomist, acclaimed novelist Barbara Quick gives readers the drama, romance, and rich historical detail for which she is known as she shines a light on an unforgotten -- and unforgettable -- heroine."], "author": "Barbara Quick", "num_pages": "266", "awards": [], "places": ["Italy"], "character_names": ["Alessandra Giliani"], "language": "English", "publish_date": "2010-04-06 00:00:00", "ISBN": "0061448877"},
{"url": "https://www.goodreads.com/book/show/18782849-like-water-on-stone", "num_ratings": "505", "num_reviews": "136", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Young Adult", "Poetry", "Historical", "Fiction", "War"], "title": "Like Water on Stone", "description": ["Blending magical realism and lyrical free verse, this is an intense survival story of three siblings caught up in the horrific events of the Armenian genocide of 1915.", "It is 1914, and the Ottoman Empire is crumbling into violence.", "Beyond Anatolia, in the Armenian Highlands, Shahen Donabedian dreams of going to New York. Sosi, his twin sister, never wants to leave her home, e", "Blending magical realism and lyrical free verse, this is an intense survival story of three siblings caught up in the horrific events of the Armenian genocide of 1915.", "It is 1914, and the Ottoman Empire is crumbling into violence.", "Beyond Anatolia, in the Armenian Highlands, Shahen Donabedian dreams of going to New York. Sosi, his twin sister, never wants to leave her home, especially now that she is in love. At first, only Papa, who counts Turks and Kurds among his closest friends, stands in Shahen's way. But when the Ottoman pashas set their plans to eliminate all Armenians in motion, neither twin has a choice.", "After a horrifying attack leaves them orphaned, Shahen and Sosi flee into the mountains, carrying their little sister, Mariam. Shahen keeps their parents' fate a secret from his sisters. But the children are not alone. An eagle named Ardziv watches over them as they run at night and hide each day, making their way across mountain ridges and rivers red with blood."], "author": "Dana Walrath", "num_pages": "368", "awards": [], "places": ["Armenia"], "character_names": [], "language": null, "publish_date": "2014-11-11 00:00:00", "ISBN": "0375991425"},
{"url": "https://www.goodreads.com/book/show/6558237-a-faraway-island", "num_ratings": "1,852", "num_reviews": "217", "avg_ratings": 3.92, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "World War II", "Holocaust", "European Literature", "Swedish Literature", "War", "World War II"], "title": "A Faraway Island", "description": ["It's the summer of 1939. Two Jewish sisters from Vienna—12-year-old Stephie Steiner and 8-year-old Nellie—are sent to Sweden to escape the Nazis. They expect to stay there six months, until their parents can flee to Amsterdam; then all four will go to America. But as the world war intensifies, the girls rem", "It's the summer of 1939. Two Jewish sisters from Vienna—12-year-old Stephie Steiner and 8-year-old Nellie—are sent to Sweden to escape the Nazis. They expect to stay there six months, until their parents can flee to Amsterdam; then all four will go to America. But as the world war intensifies, the girls remain, each with her own host family, on a rugged island off the western coast of Sweden.", "Nellie quickly settles in to her new surroundings. She’s happy with her foster family and soon favors the Swedish language over her native German. Not so for Stephie, who finds it hard to adapt; she feels stranded at the end of the world, with a foster mother who’s as cold and unforgiving as the island itself. Her main worry, though, is her parents—and whether she will ever see them again.", "  Format: Hardcover \n   Publication Date: 11/10/2009 \n   Pages: 256 \n   Reading Level: Age 9 and Up \n "], "author": "Annika Thor", "num_pages": "249", "awards": ["Batchelder Award (2010)", "Augustpriset Nominee for Fiction (1996)", "Deutscher Jugendliteraturpreis for Kinderbuch (1999)"], "places": ["Sweden"], "character_names": ["Steffi", "Nelli"], "language": "English", "publish_date": "2009-11-10 00:00:00", "ISBN": "0385736177"},
{"url": "https://www.goodreads.com/book/show/10338850-the-lily-pond", "num_ratings": "947", "num_reviews": "80", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "World War II", "Holocaust", "War", "European Literature", "Swedish Literature", "Cultural", "Sweden"], "title": "The Lily Pond", "description": ["A year after Stephie Steiner and her younger sister, Nellie, left Nazi-occupied Vienna, Stephie has finally adapted to life on the rugged Swedish island where she now lives. But", "A year after Stephie Steiner and her younger sister, Nellie, left Nazi-occupied Vienna, Stephie has finally adapted to life on the rugged Swedish island where she now lives. But more change awaits Stephie: her foster parents have allowed her to enroll in school on the mainland, in Goteberg. Stephie is eager to go. Not only will she be pursuing her studies, she'll be living in a cultured city again—under the same roof as Sven, the son of the lodgers who rented her foster parents' cottage for the summer.", "Five years her senior, Sven dazzles Stephie with his charm, his talk of equality, and his anti-Hitler sentiments. Stephie can't help herself—she's falling in love. As she navigates a sea of new emotions, she also grapples with what it means to be beholden to others, with her constant worry about what her parents are enduring back in Vienna, and with the menacing spread of Nazi ideology, even in Sweden. In these troubled times, her true friends, Stephie discovers, are the ones she least expected."], "author": "Annika Thor", "num_pages": "217", "awards": ["Batchelder Award Nominee (2012)"], "places": ["Sweden", "Gothenburg"], "character_names": ["Steffi", "Nelli"], "language": "English", "publish_date": "2011-10-11 00:00:00", "ISBN": "0385740395"},
{"url": "https://www.goodreads.com/book/show/411412.Taste_of_Salt", "num_ratings": "278", "num_reviews": "42", "avg_ratings": 3.55, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Historical", "Young Adult", "Teen", "Realistic Fiction"], "title": "Taste of Salt: A Story of Modern Haiti", "description": ["Every Life", " Makes a Story", "Djo has a story: Once he was one of \"Titid's boys,\" a vital member of Father Jean-Bertrand Aristide's election team, fighting to overthrow military dictatorship in Haiti. Now he is barely alive, the victim of a political firebombing.", "Jeremie has a story: Convent-educated Jeremie can climb out of the slums of Port-au-Prince. But she is torn between he", "Every Life", " Makes a Story", "Djo has a story: Once he was one of \"Titid's boys,\" a vital member of Father Jean-Bertrand Aristide's election team, fighting to overthrow military dictatorship in Haiti. Now he is barely alive, the victim of a political firebombing.", "Jeremie has a story: Convent-educated Jeremie can climb out of the slums of Port-au-Prince. But she is torn between her mother's hopes and her own wishes for herself ... and for Haiti.", "Father Jean-Bertrand Aristide has a story: A dream of a new Haiti, one in which every person would have a decent life ... a house with a roof ... clean water to drink ... a good plate of rice and beans every day ... a field to work in.", "At Aristide's request, Djo tells his story to Jeremie -- for Titid believes in the power of all of their stories to make change. As Jeremie listens to Djo, and to her own heart, she knows that they will begin a new story, one that is all their own, together."], "author": "Frances Temple", "num_pages": "192", "awards": ["Jane Addams Children's Book Award for Older Children (1993)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-12-28 00:00:00", "ISBN": "0064471365"},
{"url": "https://www.goodreads.com/book/show/21965111-deep-sea", "num_ratings": "619", "num_reviews": "25", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "War", "Fiction", "European Literature", "Swedish Literature", "World War II", "Holocaust"], "title": "Deep Sea", "description": ["Three years ago, Stephie and her younger sister, Nellie, escaped the Nazis in Vienna and fled to an island in Sweden, where they were taken in by different families. Now sixteen-yea", "Three years ago, Stephie and her younger sister, Nellie, escaped the Nazis in Vienna and fled to an island in Sweden, where they were taken in by different families. Now sixteen-year-old Stephie is going to school on the mainland. Stephie enjoys her studies, and rooming with her school friend, May. But life is only getting more complicated as she gets older.", "Stephie might lose the grant money that is funding her education. Her old friend Verra is growing up too fast. And back on the island, Nellie wants to be adopted by her foster family. Stephie, on the other hand, can't stop thinking about her parents, who are in a Nazi camp in Austria. If only the war would end….", "Like the deep sea, Stephie's life is filled with danger and darkness, but also with beauty and hope as she learns to stand up for her beliefs and be true to herself."], "author": "Annika Thor", "num_pages": "229", "awards": ["Nils Holgersson-plaketten (1999)"], "places": ["Gothenburg"], "character_names": ["Steffi", "Nelli"], "language": null, "publish_date": "2015-01-06 00:00:00", "ISBN": "0385743858"},
{"url": "https://www.goodreads.com/book/show/2856645-bog-child", "num_ratings": "3,385", "num_reviews": "512", "avg_ratings": 3.79, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Cultural", "Ireland", "Mystery", "Historical"], "title": "Bog Child", "description": ["DIGGING FOR PEAT in the mountain with his Uncle Tally, Fergus finds the body of a child, and it looks like she’s been murdered. As Fergus tries to make sense of the mad world around him—his brother on hunger-strike in prison, his growing feelings for Cora, his parents arguing over the Troubles, and him in it up to the neck, blackmailed into acting as courier to God knows w", "DIGGING FOR PEAT in the mountain with his Uncle Tally, Fergus finds the body of a child, and it looks like she’s been murdered. As Fergus tries to make sense of the mad world around him—his brother on hunger-strike in prison, his growing feelings for Cora, his parents arguing over the Troubles, and him in it up to the neck, blackmailed into acting as courier to God knows what—a little voice comes to him in his dreams, and the mystery of the bog child unfurls.", "Bog Child is an astonishing novel exploring the sacrifices made in the name of peace, and the unflinching strength of the human spirit."], "author": "Siobhan Dowd", "num_pages": "321", "awards": ["Manchester Book Award  Nominee for Longlist (2009)", "Edgar Award Nominee for Best Young Adult (2009)", "Carnegie Medal (2009)"], "places": ["Near the north south border"], "character_names": [], "language": "English", "publish_date": "2008-09-09 00:00:00", "ISBN": "0385751699"},
{"url": "https://www.goodreads.com/book/show/216408.The_True_Story_of_Hansel_and_Gretel", "num_ratings": "10,058", "num_reviews": "1,464", "avg_ratings": 4.03, "genres": ["Historical", "Historical Fiction", "Fiction", "World War II", "Holocaust", "War", "World War II", "Historical", "War"], "title": "The True Story of Hansel and Gretel", "description": ["In the last months of the Nazi occupation of Poland, two children are left by their father and stepmother to find safety in a dense forest. Because their real names will reveal their Jewishness, they are renamed \"Hansel\" and \"Gretel.\" They wander in the woods until they are taken in by Mag", "In the last months of the Nazi occupation of Poland, two children are left by their father and stepmother to find safety in a dense forest. Because their real names will reveal their Jewishness, they are renamed \"Hansel\" and \"Gretel.\" They wander in the woods until they are taken in by Magda, an eccentric and stubborn old woman called \"witch\" by the nearby villagers. Magda is determined to save them, even as a German officer arrives in the village with his own plans for the children. Louise Murphy's haunting novel of journey and survival, of redemption and memory, powerfully depicts how war is experienced by families and especially by children.", "\"Lyrical, haunting, unforgettable.\" --", "\"No reader who picks up this inspiring novel will put it down until the final pages, in which redemption is not a fairy tale ending but a heartening message of hope.\" --"], "author": "Louise Murphy", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-07-29 00:00:00", "ISBN": "0142003077"},
{"url": "https://www.goodreads.com/book/show/437974.A_Swift_Pure_Cry", "num_ratings": "2,106", "num_reviews": "267", "avg_ratings": 3.75, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Cultural", "Ireland", "Realistic Fiction", "Young Adult", "Teen"], "title": "A Swift Pure Cry", "description": ["Ireland 1984.", "After Shell's mother dies, her obsessively religious father descends into alcoholic mourning and Shell is left to care for her younger brother and sister. Her only release from the harshness of everyday life comes from her budding spiritual friendship with a naive young priest, and most importantly, her developing relationship with childhood friend, Declan, wh", "Ireland 1984.", "After Shell's mother dies, her obsessively religious father descends into alcoholic mourning and Shell is left to care for her younger brother and sister. Her only release from the harshness of everyday life comes from her budding spiritual friendship with a naive young priest, and most importantly, her developing relationship with childhood friend, Declan, who is charming, eloquent, and persuasive. But when Declan suddenly leaves Ireland to seek his fortune in America, Shell finds herself pregnant and the center of a scandal that rocks the small community in which she lives, with repercussions across the whole country. The lives of those immediately around her will never be the same again.", "This is a story of love and loss, religious belief and spirituality—it will move the hearts of any who read it."], "author": "Siobhan Dowd", "num_pages": "320", "awards": ["Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2007)", "Branford Boase Award (2007)"], "places": ["Ireland"], "character_names": [], "language": "English", "publish_date": "2007-04-10 00:00:00", "ISBN": "0385751087"},
{"url": "https://www.goodreads.com/book/show/2224718.The_Girl_Who_Saw_Lions", "num_ratings": "285", "num_reviews": "55", "avg_ratings": 3.92, "genres": ["Cultural", "Africa", "Young Adult", "Fiction", "Parenting", "Adoption", "Family"], "title": "The Girl Who Saw Lions", "description": ["\"BE STRONG MY ABELA.\"  Orphaned by AIDS in Africa, Abela has a long journey ahead.", "When Abela’s mother dies of Aids in their African village, she is left to face the lions of the world. Lions like her Uncle Thomas who has plans to sell her in Europe. Lions like his bitter white wife, whom he abandons with Abela. Abela is forced to stay indoors in a sunless London apartment,", "\"BE STRONG MY ABELA.\"  Orphaned by AIDS in Africa, Abela has a long journey ahead.", "When Abela’s mother dies of Aids in their African village, she is left to face the lions of the world. Lions like her Uncle Thomas who has plans to sell her in Europe. Lions like his bitter white wife, whom he abandons with Abela. Abela is forced to stay indoors in a sunless London apartment, cooking and cleaning, and hopelessly dreaming of her African homeland. Meanwhile, in a London suburb, Rosa is distraught when her mother tells her she wants to adopt a child. Rosa doesn’t want a sister or brother. Things were so good, why did they have to change?", "Berlie Doherty tells parallel stories, each separate and compelling in their own right, but stories that eventually tangle together bringing a message of hope and what it means to be a family."], "author": "Berlie Doherty", "num_pages": "256", "awards": ["Manchester Book Award  Nominee for Longlist (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "1596433779"},
{"url": "https://www.goodreads.com/book/show/710186.Go_and_Come_Back", "num_ratings": "376", "num_reviews": "49", "avg_ratings": 3.56, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Anthropology", "Cultural"], "title": "Go and Come Back", "description": ["When the two old white ladies come to live in the Peruvian jungle village of Poincushmana, everyone makes a fuss--everyone but Alicia, who is baffled by the reaction of her tribe, the Isabo. But as the days pass, she too is drawn in--because the ladies (who are really in their twenties, and anthropologists) are stingy, stupid, and fun to watch. They don't understand the Is", "When the two old white ladies come to live in the Peruvian jungle village of Poincushmana, everyone makes a fuss--everyone but Alicia, who is baffled by the reaction of her tribe, the Isabo. But as the days pass, she too is drawn in--because the ladies (who are really in their twenties, and anthropologists) are stingy, stupid, and fun to watch. They don't understand the Isabo. Someone needs to set them straight. And that someone, surprisingly, is Alicia."], "author": "Joan Abelove", "num_pages": "192", "awards": [], "places": ["Amazon Rainforest"], "character_names": [], "language": "English", "publish_date": "2000-07-01 00:00:00", "ISBN": "0141306947"},
{"url": "https://www.goodreads.com/book/show/201114.Sold", "num_ratings": "42,306", "num_reviews": "5,282", "avg_ratings": 4.2, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Poetry", "Sociology", "Abuse"], "title": "Sold", "description": ["Although Lakshmi's family is desperately poor her life still contains simple pleasures; but, when the harsh Himalayan monsoons wash away all the family’s crops, Lakshmi’s stepfather sends her away to take a job to support her family. When she arrives at “Happiness House”, full of hope, she learns the unthinkable truth: she has been sold into prostitution. An exceptional no", "Although Lakshmi's family is desperately poor her life still contains simple pleasures; but, when the harsh Himalayan monsoons wash away all the family’s crops, Lakshmi’s stepfather sends her away to take a job to support her family. When she arrives at “Happiness House”, full of hope, she learns the unthinkable truth: she has been sold into prostitution. An exceptional novel suitable for teens and adults.", "Lakshmi is a thirteen-year-old girl who lives with her family in a small hut in the mountains of Nepal. Her family is desperately poor, but her life is full of simple pleasures, like raising her black-and-white speckled goat, and having her mother brush her hair by the light of an oil lamp. But when the harsh Himalayan monsoons wash away all that remains of the family’s crops, Lakshmi’s stepfather says she must leave home and take a job to support her family. ", "He introduces her to a glamorous stranger who tells her she will find her a job as a maid working for a wealthy woman in the city. Glad to be able to help, Lakshmi undertakes the long journey to India and arrives at “Happiness House” full of hope. But she soon learns the unthinkable truth: she has been sold into prostitution. ", "An old woman named Mumtaz rules the brothel with cruelty and cunning. She tells Lakshmi that she is trapped there until she can pay off her family’s debt – then cheats Lakshmi of her meager earnings so that she can never leave. ", "Lakshmi’s life becomes a nightmare from which she cannot escape. Still, she lives by her mother’s words – “Simply to endure is to triumph” – and gradually, she forms friendships with the other girls that enable her to survive in this terrifying new world. Then the day comes when she must make a decision – will she risk everything for a chance to reclaim her life? ", "Written in spare and evocative vignettes, this powerful novel renders a world that is as unimaginable as it is real, and a girl who not only survives but triumphs. ", "To research Sold, Patricia McCormick traveled to India and Nepal where she interviewed the women of Calcutta’s red-light district and girls who have been rescued from the sex trade. She is the author of the acclaimed novels Cut and My Brother’s Keeper."], "author": "Patricia McCormick", "num_pages": "268", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2009)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2009)", "California Young Readers Medal for Young Adult (2009)", "Lincoln Award Nominee (2009)", "James Cook Book Award Nominee (2007)", "National Book Award Finalist for Young People's Literature (2006)", "Missouri Gateway Readers Award Nominee (2009)"], "places": ["Nepal"], "character_names": [], "language": "English", "publish_date": "2006-09-15 00:00:00", "ISBN": "0786851716"},
{"url": "https://www.goodreads.com/book/show/595405.Heart_s_Delight", "num_ratings": "986", "num_reviews": "62", "avg_ratings": 3.55, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction", "European Literature", "Swedish Literature"], "title": "Heart's Delight", "description": [" he thinks.", "When he first saw Ann-Katrin on the bus, he was mesmerized, captivated, consumed.", "Now he sits alone in his room, a sixteen-year-old boy, waiting for her to call. Wishing for her to tell him it was real. It was as perfect as he imagined. ", "The boy", " he thinks.", "When he first saw Ann-Katrin on the bus, he was mesmerized, captivated, consumed.", "Now he sits alone in his room, a sixteen-year-old boy, waiting for her to call. Wishing for her to tell him it was real. It was as perfect as he imagined. ", "The boy continues to wait, systematically destroying all of the objects from their short-lived relationship. He rips up the bus pass from their first meeting.", "He throws the pot of lemon balm she gave him over the edge of the balcony.", "He tosses the black Frisbee and the Swiss Army knife over too.", "As he plays their relationship over in his mind like a movie, he wonders: What if his heart's delight doesn't call? Will life be worth living then?"], "author": "Per Nilsson", "num_pages": "192", "awards": ["Zilveren Zoen (1999)", "Deutscher Jugendliteraturpreis for Jugendbuch (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-05-31 00:00:00", "ISBN": "0689876777"},
{"url": "https://www.goodreads.com/book/show/17643.Before_We_Were_Free", "num_ratings": "4,850", "num_reviews": "813", "avg_ratings": 3.85, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Cultural"], "title": "Before We Were Free", "description": ["Anita de la Torre is a twelve-year-old girl living in the Dominican Republic in 1960. Most of her relatives have emigrated to the United States, her Tío Toni has disappeared, Papi has been getting mysterious phone calls about butterflies and someone named Mr. S", "Anita de la Torre is a twelve-year-old girl living in the Dominican Republic in 1960. Most of her relatives have emigrated to the United States, her Tío Toni has disappeared, Papi has been getting mysterious phone calls about butterflies and someone named Mr. Smith, and the secret police have started terrorizing her family for their suspected opposition to the country’s dictator. While Anita deals with a frightening series of events, she also struggles with her adolescence and her own personal fight to be free."], "author": "Julia Alvarez", "num_pages": "192", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (2004)", "Américas Award (2002)", "Pura Belpré Award for Narrative (2004)"], "places": ["Dominican Republic"], "character_names": [], "language": "English", "publish_date": "2004-04-13 00:00:00", "ISBN": "044023784X"},
{"url": "https://www.goodreads.com/book/show/563483.Sofi_Mendoza_s_Guide_to_Getting_Lost_in_Mexico", "num_ratings": "288", "num_reviews": "66", "avg_ratings": 3.68, "genres": ["Young Adult", "Romance", "Contemporary", "Fiction", "Realistic Fiction", "Travel"], "title": "Sofi Mendoza's Guide to Getting Lost in Mexico", "description": ["\"Do you guys have Internet?..\".\"How about TiVo?..\".\"You do get American TV?\" The house was dark. \"Wait a minute -- do they even have electricity?\"Even though Sofi Mendoza was born in Mexico, she's spent most of her life in California -- the closest she gets to a south-of-the-border experience is eating at Taco Bell. But when Sofi and her friends sneak off for a weekend in", "\"Do you guys have Internet?..\".\"How about TiVo?..\".\"You do get American TV?\" The house was dark. \"Wait a minute -- do they even have electricity?\"Even though Sofi Mendoza was born in Mexico, she's spent most of her life in California -- the closest she gets to a south-of-the-border experience is eating at Taco Bell. But when Sofi and her friends sneak off for a weekend in Tijuana, she gets in real trouble. To Sofi's shock, the border patrol says that her green card is counterfeit. Until her parents can sort out the paperwork and legal issues, Sofi is stuck in Mexico.", "In the meantime, Sofi's parents arrange for her to stay with long-lost relatives in rural Baja. It's bad enough that Sofi has to miss senior prom and even graduation, but her aunt, uncle, and cousins live on a ranch with no indoor plumbing! As the weeks pass, though, she finds herself adapting to her surroundings. Sofi starts helping out on the ranch, getting along with her bratty cousins, and she even meets a guy with more potential than anyone from school. Through the unexpected crash course in her heritage, Sofi comes to appreciate that she has a home on both sides of the border."], "author": "Malin Alegria", "num_pages": "291", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "0689878117"},
{"url": "https://www.goodreads.com/book/show/124245.The_Black_Pearl", "num_ratings": "5,306", "num_reviews": "306", "avg_ratings": 3.47, "genres": ["Fiction", "Young Adult", "Historical", "Historical Fiction", "Childrens", "Classics"], "title": "The Black Pearl", "description": ["Ramon cannot believe what he has just found in an oyster he's brought up from an underwater cave where the Manta Diablo, the monster devilfish, lurks. Ramon is holding a pearl. Not just any pearl, but the most fabulous gem he or anyone else has ever seen.But neither sixteen-year-old Ramon nor his father foresees the trouble that such a pearl can bring. It will be young Ram", "Ramon cannot believe what he has just found in an oyster he's brought up from an underwater cave where the Manta Diablo, the monster devilfish, lurks. Ramon is holding a pearl. Not just any pearl, but the most fabulous gem he or anyone else has ever seen.But neither sixteen-year-old Ramon nor his father foresees the trouble that such a pearl can bring. It will be young Ramon who must stop the monster he has unleashed."], "author": "Scott O'Dell", "num_pages": "112", "awards": ["Newbery Medal Nominee (1968)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-05-11 00:00:00", "ISBN": "0440228867"},
{"url": "https://www.goodreads.com/book/show/344766.The_Kings_Are_Already_Here", "num_ratings": "146", "num_reviews": "17", "avg_ratings": 3.52, "genres": ["Young Adult", "Fiction", "Young Adult", "Teen", "Realistic Fiction", "Games", "Chess"], "title": "The Kings Are Already Here", "description": ["Phebe Knight has always wanted to be a ballerina. But now, one year away from joining the Company, her mind begins to wander. To clear her head, she decides to visit her father, who lives in Switzerland. There, she meets Nikolai Kotalev, a teenage chess champion, who is looking for the legendary Stas Vlajnik, the teacher who will show him how to be a grand master capable o", "Phebe Knight has always wanted to be a ballerina. But now, one year away from joining the Company, her mind begins to wander. To clear her head, she decides to visit her father, who lives in Switzerland. There, she meets Nikolai Kotalev, a teenage chess champion, who is looking for the legendary Stas Vlajnik, the teacher who will show him how to be a grand master capable of both grace and speed. Phebe organizes a search across Europe to help Nikolai find the elusive Stas. And all the while, Phebe and Nikolai study each others' obsessions to find the lives they want. What are they each willing to pay for perfection and beauty?"], "author": "Garret Weyr, also Freymann-Weyr", "num_pages": "160", "awards": [], "places": ["Switzerland"], "character_names": [], "language": "English", "publish_date": "2004-10-21 00:00:00", "ISBN": "0142402079"},
{"url": "https://www.goodreads.com/book/show/762179.Dawn_and_Dusk", "num_ratings": "39", "num_reviews": "4", "avg_ratings": 3.31, "genres": ["Fiction"], "title": "Dawn and Dusk", "description": ["For as long as thirteen-year-old Azad can remember, the Islamic Republic of Iran, where he lives in the predominantly Kurdish town of Sardasht, has been at war with Saddam Hussein's Iraq, and his country has been a harsh society full of spies, secrets, and \"disappearances.\" Still, most of the time Azad manages to live a normal life, hanging out at the bakery next door, goi", "For as long as thirteen-year-old Azad can remember, the Islamic Republic of Iran, where he lives in the predominantly Kurdish town of Sardasht, has been at war with Saddam Hussein's Iraq, and his country has been a harsh society full of spies, secrets, and \"disappearances.\" Still, most of the time Azad manages to live a normal life, hanging out at the bakery next door, going to school with his friend Hiwa, playing sports, and taking care of his parrot. Then Azad learns that his town may soon become a target for Saddam's weapons of mass destruction. Now more than ever, Azad feels torn between his divorced parents and his conflicting desires to remain in his home or escape. His father is somehow connected to the police and is rooted in the town. His mother may be part of the insurgency, yet is ready to flee. How can Azad make the choice?", " ", "The story of how one boy's world was turned upside down in 1987 Iran is a timely and memorable introduction to the conflicts in the Middle East."], "author": "Alice Mead", "num_pages": "160", "awards": [], "places": ["Iran", "Iraq"], "character_names": [], "language": "English", "publish_date": "2007-02-20 00:00:00", "ISBN": "0374317089"},
{"url": "https://www.goodreads.com/book/show/580160.In_the_Name_of_God", "num_ratings": "188", "num_reviews": "46", "avg_ratings": 3.45, "genres": ["Young Adult", "Religion", "Fiction", "Historical", "Historical Fiction", "Young Adult", "Teen"], "title": "In the Name of God", "description": ["Seventeen year-old Nadia is an excellent student, daughter and sister, and above all wants to be the best Muslim she can be. But she's conflicted about her Westernized peers, the economic, social and political struggles of her country, and the war raging in Iraq. When her cousin is arrested by the authorities for speaking out, Nadia finds herself drawn into the world of Is", "Seventeen year-old Nadia is an excellent student, daughter and sister, and above all wants to be the best Muslim she can be. But she's conflicted about her Westernized peers, the economic, social and political struggles of her country, and the war raging in Iraq. When her cousin is arrested by the authorities for speaking out, Nadia finds herself drawn into the world of Islamic fundamentalism, contemplating making the ultimate sacrifice to take a stand for her people and her religion. A striking debut, IN THE NAME OF GOD is an enlightening and nuanced story about life in the Middle East."], "author": "Paula Jolin", "num_pages": "208", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-03 00:00:00", "ISBN": "159643211X"},
{"url": "https://www.goodreads.com/book/show/2296567.Say_You_re_One_of_Them", "num_ratings": "13,292", "num_reviews": "2,280", "avg_ratings": 3.51, "genres": ["Fiction", "Cultural", "Africa", "Short Stories"], "title": "Say You're One of Them", "description": ["Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds,", "Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds, his dream can't be granted. Food comes first. His family lives in a street shanty in Nairobi, Kenya, but their way of both loving and taking advantage of each other strikes a universal chord. ", "In the second of his stories published in a New Yorker special fiction issue, Akpan takes us far beyond what we thought we knew about the tribal conflict in Rwanda. The story is told by a young girl, who, with her little brother, witnesses the worst possible scenario between parents. They are asked to do the previously unimaginable in order to protect their children. This singular collection will also take the reader inside Nigeria, Benin, and Ethiopia, revealing in beautiful prose the harsh consequences for children of life in Africa. ", "Akpan's voice is a literary miracle, rendering lives of almost unimaginable deprivation and terror into stories that are nothing short of transcendent."], "author": "Uwem Akpan", "num_pages": "358", "awards": ["Guardian First Book Award Nominee for Longlist (2008)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2009)", "PEN Open Book Award (2009)", "Paris Book Festival for Compilation/Anthology (2010)", "Hurston/Wright Legacy Award for Fiction (2009)", "Commonwealth Writers' Prize for Best First Book in Africa (2009)"], "places": ["Benin", "Kenya", "Ethiopia", "Rwanda", "Nigeria", "Africa"], "character_names": [], "language": "English", "publish_date": "2009-09-18 00:00:00", "ISBN": "0316113786"},
{"url": "https://www.goodreads.com/book/show/715579.Broken_Moon", "num_ratings": "146", "num_reviews": "27", "avg_ratings": 3.75, "genres": ["Young Adult", "Fiction", "Cultural", "Realistic Fiction", "Young Adult", "Teen"], "title": "Broken Moon", "description": [" ", " Nadira is spoiled goods. Scars from a beating she received for a crime that her older brother allegedly committed tell the world that she is worth less than nothing -- except to her little brother, Umar, who sees beauty in her scar", " ", " Nadira is spoiled goods. Scars from a beating she received for a crime that her older brother allegedly committed tell the world that she is worth less than nothing -- except to her little brother, Umar, who sees beauty in her scars and value in her. ", " But Umar is gone -- perhaps kidnapped or maybe sold. All Nadira knows is that Umar has been taken into the desert to ride camels for rich sheiks. He could be lost to her forever. ", " For Umar, Nadira will risk everything. So she disguises herself as a boy and searches out the men who took him. They are not hard to find, and soon she, too, is headed to the desert to be a camel jockey. ", " Life in the desert is more brutal than Nadira imagined. All she has to protect her and the boys she meets are a bit of chai tea, some stories, and the hope that she has enough of both to keep going until she finds Umar. "], "author": "Kim Antieau", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-27 00:00:00", "ISBN": "1416917675"},
{"url": "https://www.goodreads.com/book/show/3195325-a-map-of-home", "num_ratings": "1,158", "num_reviews": "201", "avg_ratings": 3.68, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Lgbt", "Glbt", "Queer", "Religion", "Islam", "Contemporary", "Novels", "Historical", "Young Adult", "Coming Of Age"], "title": "A Map of Home", "description": ["Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where s", "Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where she and her family fled the 1990 Iraqi invasion), and her family’s last flight to Texas. Nidali mixes humor with a sharp, loving portrait of an eccentric middle-class family, and this perspective keeps her buoyant through the hardships she encounters: the humiliation of going through a checkpoint on a visit to her father’s home in the West Bank; the fights with her father, who wants her to become a famous professor and stay away from boys; the end of her childhood as Iraq invades Kuwait on her thirteenth birthday; and the scare she gives her family when she runs away from home. ", "Funny, charming, and heartbreaking, A Map of Home is the kind of book Tristram Shandy or Huck Finn would have narrated had they been born Egyptian-Palestinian and female in the 1970s."], "author": "Randa Jarrar", "num_pages": "304", "awards": ["Hopwood Award", "Arab American Book Award for Fiction (2009)", "Million Writers Award", "Geoffrey James Gosling Prize"], "places": ["Kuwait"], "character_names": [], "language": "English", "publish_date": "2008-09-02 00:00:00", "ISBN": "1590512723"},
{"url": "https://www.goodreads.com/book/show/427805.Koyal_Dark_Mango_Sweet", "num_ratings": "655", "num_reviews": "82", "avg_ratings": 3.77, "genres": ["Young Adult", "Cultural", "India", "Fiction", "Romance", "Young Adult", "Teen", "Realistic Fiction"], "title": "Koyal Dark, Mango Sweet", "description": ["Jeetas family is caught up in the whirlwind of arranging marriages for her two older sisters, but the drama and excitement leave Jeeta cold. She knows that tradition demands the parade of suitors, the marriage negotiations, the elaborate displays, the expensive wedding parties but where is the love and romance that the movies promise? She dreads her turn on the matrimonial", "Jeetas family is caught up in the whirlwind of arranging marriages for her two older sisters, but the drama and excitement leave Jeeta cold. She knows that tradition demands the parade of suitors, the marriage negotiations, the elaborate displays, the expensive wedding parties but where is the love and romance that the movies promise? She dreads her turn on the matrimonial circuit, especially since Mummy is always complaining about how difficult it will be to find Jeeta a good husband, with her dark skin and sharp tongue. As Jeeta spends more time with her new friend from school, Sarina, and Sarinas educated, liberal parents, she begins to question her tradition-bound familys expectations. And when she falls in love with Sarinas cousin Neel, Jeeta realizes that she must strike a balance between independence and duty and follow her own path. With its gentle humor and a rich sense of place, Koyal Dark, Mango Sweet is an engaging coming-of-age novel set in contemporary Mumbai, India."], "author": "Kashmira Sheth", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0786838574"},
{"url": "https://www.goodreads.com/book/show/1443203.Swimming_in_the_Monsoon_Sea", "num_ratings": "763", "num_reviews": "64", "avg_ratings": 3.75, "genres": ["Young Adult", "Lgbt", "Fiction", "Glbt", "Queer", "Glbt", "Gay"], "title": "Swimming in the Monsoon Sea", "description": ["The setting is Sri Lanka, 1980, and it is the season of monsoons. Fourteen-year-old Amrith is caught up in the life of the cheerful, well-to-do household in which he is being raised by his vibrant Auntie Bundle and kindly Uncle Lucky. He tries not to think of his life “before,” when his", "The setting is Sri Lanka, 1980, and it is the season of monsoons. Fourteen-year-old Amrith is caught up in the life of the cheerful, well-to-do household in which he is being raised by his vibrant Auntie Bundle and kindly Uncle Lucky. He tries not to think of his life “before,” when his doting mother was still alive. Amrith’s holiday plans seem unpromising: he wants to appear in his school’s production of ", " and he is learning to type at Uncle Lucky’s tropical fish business. Then, like an unexpected monsoon, his cousin arrives from Canada and Amrith’s ordered life is storm-tossed. He finds himself falling in love with the Canadian boy. ", " with its powerful theme of disastrous jealousy, is the backdrop to the drama in which Amrith finds himself immersed.", "Shyam Selvadurai’s brilliant novels, ", " and ", " have garnered him international acclaim. In this, his first young adult novel, he explores first love with clarity, humor, ", "and compassion."], "author": "Shyam Selvadurai", "num_pages": "274", "awards": ["Canadian Library Association Young Adult Book Award (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-08-14 00:00:00", "ISBN": "0887768342"},
{"url": "https://www.goodreads.com/book/show/215693.Habibi", "num_ratings": "2,138", "num_reviews": "354", "avg_ratings": 3.6, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Realistic Fiction", "Cultural"], "title": "Habibi", "description": ["The day after Liyana got her first real kiss, her life changed forever. Not because of the kiss, but because it was the day her father announced that the family was moving from St. Louis all the way to Palestine. Though her father grew up there, Liyana knows very little about her family's Arab heritage. Her grandmother and the rest of her relatives who live in the West Ban", "The day after Liyana got her first real kiss, her life changed forever. Not because of the kiss, but because it was the day her father announced that the family was moving from St. Louis all the way to Palestine. Though her father grew up there, Liyana knows very little about her family's Arab heritage. Her grandmother and the rest of her relatives who live in the West Bank are strangers, and speak a language she can't understand. It isn't until she meets Omer that her homesickness fades. But Omer is Jewish, and their friendship is silently forbidden in this land. How can they make their families understand? And how can Liyana ever learn to call this place home?"], "author": "Naomi Shihab Nye", "num_pages": "272", "awards": ["Jane Addams Children's Book Award for Older Children (1998)", "Dorothy Canfield Fisher Children's Book Award Nominee (1999)", "Phoenix Award (Children's Literature Association) Nominee (2017)", "Judy Lopez Memorial Award for Children's Literature (1998)", "NSK Neustadt Prize for Children's Literature (2013)"], "places": ["Palestine"], "character_names": [], "language": "English", "publish_date": "1999-06-01 00:00:00", "ISBN": "0689825234"},
{"url": "https://www.goodreads.com/book/show/1909404.Chanda_s_Wars", "num_ratings": "547", "num_reviews": "73", "avg_ratings": 4.01, "genres": ["Young Adult", "Cultural", "Africa", "Historical", "Historical Fiction", "Fiction", "War"], "title": "Chanda's Wars", "author": "Allan Stratton", "num_pages": "400", "awards": ["Canadian Library Association Young Adult Book Award (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-11 00:00:00", "ISBN": "0060872624"},
{"url": "https://www.goodreads.com/book/show/782384.Chanda_s_Secrets", "num_ratings": "2,037", "num_reviews": "262", "avg_ratings": 3.84, "genres": ["Young Adult", "Cultural", "Africa", "Fiction", "Realistic Fiction", "Young Adult", "Teen"], "title": "Chanda's Secrets", "description": ["Chanda's Secrets os a suspense-filled novel about a teenager who fights to rescue the people she loves. Through his dramatic storytelling, Allan Stratton captures the enduring strength of loyalty, the profound impact of loss, and a fearlessness that is powered by the heart. Above all, this is a story about living with truth."], "author": "Allan Stratton", "num_pages": "193", "awards": ["Michael L. Printz Award Nominee (2005)", "Snow Willow Award (2005)"], "places": ["Bonang"], "character_names": [], "language": "English", "publish_date": "2004-02-01 00:00:00", "ISBN": "1550378341"},
{"url": "https://www.goodreads.com/book/show/126381.Purple_Hibiscus", "num_ratings": "44,044", "num_reviews": "4,215", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her bro", "Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her brother away to stay with their aunt, a University professor, whose house is noisy and full of laughter. There, Kambili and her brother discover a life and love beyond the confines of their father’s authority. The visit will lift the silence from their world and, in time, give rise to devotion and defiance that reveal themselves in profound and unexpected ways. ", "This is a book about the promise of freedom; about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new."], "author": "Chimamanda Ngozi Adichie", "num_pages": "307", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2005-08-12 00:00:00", "ISBN": "0007189885"},
{"url": "https://www.goodreads.com/book/show/143438.Shizuko_s_Daughter", "num_ratings": "739", "num_reviews": "107", "avg_ratings": 3.71, "genres": ["Young Adult", "Fiction", "Cultural", "Japan", "Realistic Fiction", "Literature", "Asian Literature"], "title": "Shizuko's Daughter", "description": ["\"Lyrical...A beautifully written book about a bitterly painful coming of age.\"", "THE KIRKUS REVIEWS", "Yuki Okuda knows her mother would be proud of her grades and her achievements in sports if she were alive. But she committed suicide. And Yuki has to learn how to live with a father who doesn't seem to love her and a stepmother who treats her badly. Most important, she has to le", "\"Lyrical...A beautifully written book about a bitterly painful coming of age.\"", "THE KIRKUS REVIEWS", "Yuki Okuda knows her mother would be proud of her grades and her achievements in sports if she were alive. But she committed suicide. And Yuki has to learn how to live with a father who doesn't seem to love her and a stepmother who treats her badly. Most important, she has to learn how to live with herself: a twelve-year-old Japanese girl growing up alone, trying to make sense of a tragedy that makes no sense at all...."], "author": "Kyoko Mori", "num_pages": "214", "awards": ["Elizabeth Burr / Worzalla Award (1994)"], "places": [], "character_names": [], "language": "English", "publish_date": "1994-05-01 00:00:00", "ISBN": "0449704335"},
{"url": "https://www.goodreads.com/book/show/875447.Samir_and_Yonatan", "num_ratings": "308", "num_reviews": "63", "avg_ratings": 3.41, "genres": ["Fiction", "Young Adult", "Realistic Fiction", "Cultural", "Cultural", "International", "Childrens", "Contemporary", "Cultural", "Israel", "Childrens", "Chapter Books", "Academic", "School"], "title": "Samir and Yonatan", "description": ["Winner of the Mildred Batchelder Award, this very human novel of the Israeli/Palestinian conflict is both touching and timely", "Nothing could be more frightening to Samir, a Palestinian boy, than to be where he is now: an Israeli hospital ward, trapped among the very people he blames for his brother's death. Amid this explosive atmosphere, Samir begins to learn about the Isra", "Winner of the Mildred Batchelder Award, this very human novel of the Israeli/Palestinian conflict is both touching and timely", "Nothing could be more frightening to Samir, a Palestinian boy, than to be where he is now: an Israeli hospital ward, trapped among the very people he blames for his brother's death. Amid this explosive atmosphere, Samir begins to learn about the Israeli kids around him. He discovers their hurts and conflicts - and hesitantly begins to share his own. ", " This is a story of violence and healing - the story of a boy facing the enemy he has been taught to fear."], "author": "Daniella Carmi", "num_pages": "192", "awards": ["Batchelder Award (2001)"], "places": ["Israel"], "character_names": [], "language": "English", "publish_date": "2002-11-01 00:00:00", "ISBN": "0439135230"},
{"url": "https://www.goodreads.com/book/show/4569952-i-need-you-more-than-i-love-you-and-i-love-you-to-bits", "num_ratings": "810", "num_reviews": "74", "avg_ratings": 3.66, "genres": ["Young Adult", "Poetry", "European Literature", "Swedish Literature", "Romance"], "title": "I Need You More Than I Love You and I Love You to Bits", "description": ["When Morris meets Betty, love is unavoidable. In short prose passages, we follow the course of their passionate first love. A confident debut written in a surprising form, which gives the story intelligence and depth. ", "Morris feels like Betty can see everything he's thinking. Betty believes Morris understands her like no one ever before. She tells him everything, even about", "When Morris meets Betty, love is unavoidable. In short prose passages, we follow the course of their passionate first love. A confident debut written in a surprising form, which gives the story intelligence and depth. ", "Morris feels like Betty can see everything he's thinking. Betty believes Morris understands her like no one ever before. She tells him everything, even about the dried-up worm that she saw on the sidewalk on the way to school. But sometimes the darkness closes in on Morris. His father is manic-depressive and his mother is always talking about dreams and poetry and her new boyfriend. Morris begins to wonder if crazy people are drawn to each other. Betty points out that he is like his father. As their love grows, it almost consumes them. Soon it's as if they are always trying to escape themselves until they ask, \"How do you know when it's over?\""], "author": "Gunnar Ardelius", "num_pages": "118", "awards": ["Slangbellan (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-11-01 00:00:00", "ISBN": "1590784723"},
{"url": "https://www.goodreads.com/book/show/666976.Notes_for_a_War_Story", "num_ratings": "868", "num_reviews": "89", "avg_ratings": 3.85, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "War", "Fiction", "Young Adult"], "title": "Notes for a War Story", "description": ["\"The war arrived in our village on the 18th of January. Obviously there were other wars going on, but they didn't have anything to do with us. There were wars for blacks. Wars for Arabs. Wars for Slavs. Our war started on the 18th of January, and in a few days, everything had changed.\"", "So recounts Giuliano, a loner among outsiders, one of three young drifters caught up in t", "\"The war arrived in our village on the 18th of January. Obviously there were other wars going on, but they didn't have anything to do with us. There were wars for blacks. Wars for Arabs. Wars for Slavs. Our war started on the 18th of January, and in a few days, everything had changed.\"", "So recounts Giuliano, a loner among outsiders, one of three young drifters caught up in the whirlwind of a war in the Balkans. The three boys are like passing shadows; they live in abandoned houses, dodge the occasional bomb, and steal car parts for money. Meeting Felix—a powerful, fast-talking mercenary—changes everything for them. Felix is an expert manipulator; he speaks to their ambition and to their desires for power, wealth, and purpose. They're instantly hooked, especially the trio's unofficial leader, Stefano, and they soon escalate from petty crime to working on behalf of a mafia-style militia, bullying and extorting money in Felix's name. But as Giuliano comes to realize, they don't know what they're fighting for—if they're even fighting for anything.", " is an astonishing look at life in a lawless, war-torn nation, heightened by the harsh, moving, pencil and watercolor artwork of Italy's best graphic novel author."], "author": "Gipi", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-08-07 00:00:00", "ISBN": "1596432616"},
{"url": "https://www.goodreads.com/book/show/4162471-a-girl-made-of-dust", "num_ratings": "432", "num_reviews": "79", "avg_ratings": 3.45, "genres": ["Fiction", "Cultural", "Lebanon", "Historical", "Historical Fiction", "War"], "title": "A Girl Made of Dust", "description": ["Ten-year-old Ruba lives in a village outside Beirut. From her family home, she can see the buildings shimmering on the horizon and the sea stretched out beside them. She can also hear the rumble of the shelling - this is Lebanon in the 1980s and civil war is tearing the country apart."], "author": "Nathalie Abi-Ezzi", "num_pages": "236", "awards": ["Desmond Elliott Prize Nominee (2009)"], "places": ["Beirut"], "character_names": [], "language": "English", "publish_date": "2008-12-01 00:00:00", "ISBN": "0007259034"},
{"url": "https://www.goodreads.com/book/show/2791008-child-of-dandelions", "num_ratings": "397", "num_reviews": "88", "avg_ratings": 3.77, "genres": ["Historical", "Historical Fiction", "Young Adult", "Cultural", "Africa", "Fiction", "Cultural", "Historical", "Eastern Africa", "Uganda"], "title": "Child of Dandelions", "description": ["A breathtaking account of one girl's determination to triumph over a devastating historical event. In Uganda in 1972, President Idi Amin, also known as the Last King of Scotland, announces that foreign Indians must be \"weeded\" out of Uganda in ninety days. Fifteen-year-old Sabine's life is changed forever. The president's message, broadcast on the radio every day, becomes", "A breathtaking account of one girl's determination to triumph over a devastating historical event. In Uganda in 1972, President Idi Amin, also known as the Last King of Scotland, announces that foreign Indians must be \"weeded\" out of Uganda in ninety days. Fifteen-year-old Sabine's life is changed forever. The president's message, broadcast on the radio every day, becomes Sabine's \"countdown monster,\" and it follows her through days of terror. Sabine's father is convinced that, as Ugandan citizens, their family will be unaffected, but her mother insists it's too dangerous to stay. When her beloved uncle disappears and her best friend abandons her, Sabine begins to understand her mother's fears. She becomes desperate to leave, but Bapa, her grandfather, refuses to accompany her. How can she leave him, and where will her family go to begin a new life?"], "author": "Shenaaz Nanji", "num_pages": "213", "awards": ["Geoffrey Bilson Award for Historical Fiction for Young People Nominee (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-01 00:00:00", "ISBN": "1932425934"},
{"url": "https://www.goodreads.com/book/show/6647312-nothing", "num_ratings": "16,764", "num_reviews": "2,564", "avg_ratings": 3.75, "genres": ["Young Adult", "Fiction", "Contemporary", "Young Adult", "Teen", "Realistic Fiction", "Philosophy"], "title": "Nothing", "description": ["When Pierre-Anthon realizes there is no meaning to life, the seventh-grader leaves his classroom, climbs a tree, and stays there. His classmates cannot make him come down, not even by pelting him with rocks. So to prove to Pierre-Anthon that life has meaning, the children decide to give up things of importance. The pile starts with the superficial—a fishing rod, a new pair", "When Pierre-Anthon realizes there is no meaning to life, the seventh-grader leaves his classroom, climbs a tree, and stays there. His classmates cannot make him come down, not even by pelting him with rocks. So to prove to Pierre-Anthon that life has meaning, the children decide to give up things of importance. The pile starts with the superficial—a fishing rod, a new pair of shoes. But as the sacrifices become more extreme, the students grow increasingly desperate to get Pierre-Anthon down, to justify their belief in meaning. Sure to prompt intense thought and discussion, ", "—already a treasured work overseas—is not to be missed."], "author": "Janne Teller", "num_pages": "227", "awards": ["Batchelder Award Nominee (2011)", "Michael L. Printz Award Nominee (2011)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2011)", "Publishers Weekly's Best Children's Books of the Year for Fiction (2010)"], "places": ["Tæring"], "character_names": ["Agnes", "Elise", "Pierre-Anthon", "Sofie", "Ole"], "language": "English", "publish_date": "2010-02-09 00:00:00", "ISBN": "1416985794"},
{"url": "https://www.goodreads.com/book/show/106133.Rule_of_the_Bone", "num_ratings": "7,552", "num_reviews": "706", "avg_ratings": 3.87, "genres": ["Fiction", "Young Adult", "Contemporary", "Novels", "Young Adult", "Coming Of Age"], "title": "Rule of the Bone", "description": ["In the tradition ", "and ", ", Russell Banks’s quintessential novel of a disaffected homeless youth living on the edge of society “redefines the young modern anti-hero. . . . ", " has its own culture and language, and Bone is sure to become a beloved character for generations” (", "). With a compelling, off-beat", "In the tradition ", "and ", ", Russell Banks’s quintessential novel of a disaffected homeless youth living on the edge of society “redefines the young modern anti-hero. . . . ", " has its own culture and language, and Bone is sure to become a beloved character for generations” (", "). With a compelling, off-beat protagonist evocative of Holden Caulfield and Quentin Coldwater, and a narrative voice that masterfully and naturally captures the nuances of a modern vernacular, Banks’s haunting and powerful novel is an indisputable—and unforgettable—modern classic."], "author": "Russell Banks", "num_pages": "390", "awards": [], "places": ["New York (the state)", "Jamaica"], "character_names": ["Chapman Dorset (a.k.a. Chappie, Bone)", "I-Man"], "language": "English", "publish_date": "1996-03-26 00:00:00", "ISBN": "0060927240"},
{"url": "https://www.goodreads.com/book/show/3300990-red-palms", "num_ratings": "39", "num_reviews": "8", "avg_ratings": 3.54, "genres": ["Young Adult", "Young Adult Historical Fiction"], "title": "Red Palms", "description": ["When 14-year-old Benita’s Papa is wiped out by the Depression, he moves the family from Guayaquil, Ecuador, to the primitive island of Puna with a wild scheme to start a coconut plantation. Benita moves from a grand house to camping out in a shack on the beach; from going to school to working in the fields. But Papa’s no farmer, and he makes trouble with the islanders. The", "When 14-year-old Benita’s Papa is wiped out by the Depression, he moves the family from Guayaquil, Ecuador, to the primitive island of Puna with a wild scheme to start a coconut plantation. Benita moves from a grand house to camping out in a shack on the beach; from going to school to working in the fields. But Papa’s no farmer, and he makes trouble with the islanders. The only good thing about Puna is Raul, the handsome young man who dazzles Benita. When he asks her to leave her family to live in the wilderness, Benita runs off with him. The jungle is beautiful, dangerous, and full of secrets, and they must struggle for their survival as they try to build a relationship with each other."], "author": "Cara Haycak", "num_pages": "336", "awards": [], "places": ["Puna Island"], "character_names": [], "language": "English", "publish_date": "2006-03-14 00:00:00", "ISBN": "0553494120"},
{"url": "https://www.goodreads.com/book/show/635606.Kampung_Boy", "num_ratings": "1,275", "num_reviews": "188", "avg_ratings": 3.95, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Young Adult"], "title": "Kampung Boy", "description": ["is a favorite of millions of readers in Southeast Asia. With masterful economy worthy of Charles Schultz, Lat recounts the life of Mat, a Muslim boy growing up in rural Malaysia in the 1950s: his adventures and mischief-making, fishing trips, religious study, and work on his family's rubber plantation. Meanwhile", "the traditional way of life in his village (or ", "is a favorite of millions of readers in Southeast Asia. With masterful economy worthy of Charles Schultz, Lat recounts the life of Mat, a Muslim boy growing up in rural Malaysia in the 1950s: his adventures and mischief-making, fishing trips, religious study, and work on his family's rubber plantation. Meanwhile", "the traditional way of life in his village (or ", ") is steadily disappearing, with tin mines and factory jobs gradually replacing family farms and rubber small-holders. When Mat himself leaves for boarding school, he can only hope that his familiar ", " will still be there when he returns. ", " is hilarious and affectionate, with brilliant, super-expressive artwork that opens a window into a world that has now nearly vanished."], "author": "LAT (Mohammad Nor Khalid)", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "1596431210"},
{"url": "https://www.goodreads.com/book/show/9414177-tiny-sunbirds-far-away", "num_ratings": "3,712", "num_reviews": "524", "avg_ratings": 4.07, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Contemporary"], "title": "Tiny Sunbirds, Far Away", "description": ["Set in the Niger Delta, Tiny Sunbirds, Far Away is the witty and beautifully written story of one family’s attempt to survive a new life they could never have imagined, struggling to find a deeper sense of identity along the way.", "When their mother catches their father with another woman, twelve year-old Blessing and her fourteen-year-old brother, Ezikiel, are forced to leav", "Set in the Niger Delta, Tiny Sunbirds, Far Away is the witty and beautifully written story of one family’s attempt to survive a new life they could never have imagined, struggling to find a deeper sense of identity along the way.", "When their mother catches their father with another woman, twelve year-old Blessing and her fourteen-year-old brother, Ezikiel, are forced to leave their comfortable home in Lagos for a village in the Niger Delta, to live with their mother's family. ", "Without running water or electricity, Warri is at first a nightmare for Blessing. Her mother is gone all day and works suspiciously late into the night to pay the children's school fees. Her brother, once a promising student, seems to be falling increasingly under the influence of the local group of violent teenage boys calling themselves Freedom Fighters. Her grandfather, a kind if misguided man, is trying on Islam as his new religion of choice, and is even considering the possibility of bringing in a second wife.", "But Blessing's grandmother, wise and practical, soon becomes a beloved mentor, teaching Blessing the ways of the midwife in rural Nigeria. Blessing is exposed to the horrors of genital mutilation and the devastation wrought on the environment by British and American oil companies. As Warri comes to feel like home, Blessing becomes increasingly aware of the threats to its safety, both from its unshakable but dangerous traditions and the relentless carelessness of the modern world. Tiny Sunbirds, Far Away is the witty and beautifully written story of one family's attempt to survive a new life they could never have imagined, struggling to find a deeper sense of identity along the way."], "author": "Christie Watson", "num_pages": "438", "awards": ["Costa Book Award for First Novel (2011)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2011-05-10 00:00:00", "ISBN": "1590514661"},
{"url": "https://www.goodreads.com/book/show/11052800-outlaw", "num_ratings": "378", "num_reviews": "80", "avg_ratings": 3.78, "genres": ["Young Adult", "Adventure", "Cultural", "Africa", "Action", "Western Africa", "Burkina Faso", "Adventure", "Survival", "Realistic Fiction"], "title": "Outlaw", "description": ["Fifteen-year-old Jake Knight is an explorer and adventurer at heart but this often gets him into trouble. When a stuffy English boarding school suspends him for rule-breaking, Jake flies out to Burkina Faso where his parents are living. He is expecting a long, adventure-filled vacation under a smiling African sun. But what awaits him there is kidnapping, terrorism and Yaku", "Fifteen-year-old Jake Knight is an explorer and adventurer at heart but this often gets him into trouble. When a stuffy English boarding school suspends him for rule-breaking, Jake flies out to Burkina Faso where his parents are living. He is expecting a long, adventure-filled vacation under a smiling African sun. But what awaits him there is kidnapping, terrorism and Yakuuba Sor - the most wanted outlaw in the Sahara desert."], "author": "Stephen     Davies", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-05-05 00:00:00", "ISBN": "1849390886"},
{"url": "https://www.goodreads.com/book/show/2964736-sobibor", "num_ratings": "467", "num_reviews": "41", "avg_ratings": 3.87, "genres": ["Historical", "Historical Fiction", "Young Adult", "Cultural", "France", "Academic", "School", "Fiction"], "title": "Sobibor", "description": ["A sus 17 años, Emma se siente una extraña en el mundo. Está distanciada de sus padres, pero cerca de su abuela. Cuando ésta muere, Emma encuentra entre sus cosas el diario de un soldado nazi asignado a Sobibor, un campo de exterminio en Polonia. Al leerlo, la chica descubre la relación entre su abuela y el soldado. Esto la llevará a develar el terrible secreto que su famil", "A sus 17 años, Emma se siente una extraña en el mundo. Está distanciada de sus padres, pero cerca de su abuela. Cuando ésta muere, Emma encuentra entre sus cosas el diario de un soldado nazi asignado a Sobibor, un campo de exterminio en Polonia. Al leerlo, la chica descubre la relación entre su abuela y el soldado. Esto la llevará a develar el terrible secreto que su familia ha callado durante décadas."], "author": "Jean Molla", "num_pages": "190", "awards": ["Jewish Quarterly-Wingate Prize Nominee (2006)"], "places": ["Sobibor"], "character_names": [], "language": "Spanish", "publish_date": "2006-12-30 00:00:00", "ISBN": "9702008573"},
{"url": "https://www.goodreads.com/book/show/421334.The_Killer_s_Tears", "num_ratings": "997", "num_reviews": "168", "avg_ratings": 3.91, "genres": ["Young Adult", "Fiction", "Mystery", "Crime", "Realistic Fiction"], "title": "The Killer's Tears", "description": ["Angel Allegria arrives at the Poloverdos’ farmhouse. He kills the farmer and his wife, but he spares their child, Paolo. Together the killer and the boy begin a new life on this remote and rugged stretch of land in Chile.", "On the afternoon when Angel Allegria arrives at the Poloverdos’ farmhouse, he kills the farmer and his wife. But he spares their child, Paolo – a young bo", "Angel Allegria arrives at the Poloverdos’ farmhouse. He kills the farmer and his wife, but he spares their child, Paolo. Together the killer and the boy begin a new life on this remote and rugged stretch of land in Chile.", "On the afternoon when Angel Allegria arrives at the Poloverdos’ farmhouse, he kills the farmer and his wife. But he spares their child, Paolo – a young boy who will claim this as the day on which he was born. Together the killer and the boy begin a new life on this remote and rugged stretch of land in Chile.", "Then Luis Secunda, a well-to-do and educated fellow from the city descends upon them. Paolo is caught in the paternal rivalry between the two men. But life resumes its course . . . until circumstances force the three to leave the farm. In doing so, Angel and Luis confront their pasts as well as their inevitable destinies – destinies that profoundly shape Paolo’s own future."], "author": "Anne-Laure Bondoux", "num_pages": "176", "awards": ["Batchelder Award Nominee (2007)", "Prix Sorcières (2004)", "Prix Ados Rennes Ille-et-Vilaine (2005)"], "places": ["Chile"], "character_names": [], "language": "English", "publish_date": "2007-05-08 00:00:00", "ISBN": "0385733844"},
{"url": "https://www.goodreads.com/book/show/1137146.I_Am_a_Taxi", "num_ratings": "1,035", "num_reviews": "151", "avg_ratings": 3.82, "genres": ["Realistic Fiction", "Young Adult", "Fiction", "Childrens", "Chapter Books", "Family", "Cultural", "Bolivia"], "title": "I Am a Taxi", "description": ["For twelve-year-old Diego and his family, home is the San Sebastian Women’s Prison in Cochabamba, Bolivia. His parents farmed coca, a traditional Bolivian medicinal plant, until they got caught in the middle of the government’s war on drugs. Diego’s adjusted to his new life. His parents are locked up, but he can come and go: to school, to the market to sell his mother’s ha", "For twelve-year-old Diego and his family, home is the San Sebastian Women’s Prison in Cochabamba, Bolivia. His parents farmed coca, a traditional Bolivian medicinal plant, until they got caught in the middle of the government’s war on drugs. Diego’s adjusted to his new life. His parents are locked up, but he can come and go: to school, to the market to sell his mother’s hand-knitted goods, and to work as a “taxi”, running errands for other prisoners. But then his little sister runs away, earning his mother a heavy fine. The debt and dawning realization of his hopeless situation make him vulnerable to his friend Mando’s plan to make big money, fast. Soon, Diego is deep in the jungle, working as a virtual slave in an illegal cocaine operation. As his situation becomes more and more dangerous, he knows he must take a terrible risk if he ever wants to see his family again."], "author": "Deborah Ellis", "num_pages": "208", "awards": ["Ruth and Sylvia Schwartz Children's Book Award for Adult Middle Reader (2007)"], "places": ["Bolivia"], "character_names": [], "language": "English", "publish_date": "2006-09-01 00:00:00", "ISBN": "0888997353"},
{"url": "https://www.goodreads.com/book/show/3141899-the-book-of-jude", "num_ratings": "46", "num_reviews": "18", "avg_ratings": 2.91, "genres": ["Young Adult", "Historical", "Historical Fiction", "Realistic Fiction", "Christian"], "title": "The Book of Jude", "description": ["In 1989, when fifteen-year-old Jude's mother wins a Fulbright fellowship to study art in Czechoslovakia, the family postpones a planned move to Utah to join her, but the political situation and the move itself are too much for Jude, who is overwhelmed by a previously undiagnosed psychological disorder."], "author": "Kimberley Heuston", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "1932425268"},
{"url": "https://www.goodreads.com/book/show/3172622-brothers-of-the-sea", "num_ratings": "21", "num_reviews": "3", "avg_ratings": 3.67, "genres": ["Cultural", "Africa", "Fiction", "Adventure"], "title": "Brothers of the Sea", "description": ["Story of a teenage boy and a dolphin set against the background of the Seychelles. In this tropical island \"paradise\" the boy Paul and his father live in imminent danger of eviction and starvation. When in an extraordinary underwater adventure the boy meets a dolphin, he discovers that the fortunes of his father, his girl friend and himself now all depend on his beloved \"b", "Story of a teenage boy and a dolphin set against the background of the Seychelles. In this tropical island \"paradise\" the boy Paul and his father live in imminent danger of eviction and starvation. When in an extraordinary underwater adventure the boy meets a dolphin, he discovers that the fortunes of his father, his girl friend and himself now all depend on his beloved \"brother of the sea."], "author": "D.R. Sherman", "num_pages": "227", "awards": [], "places": ["Seychelles"], "character_names": [], "language": "English", "publish_date": "1966-06-01 00:00:00", "ISBN": "0316785423"},
{"url": "https://www.goodreads.com/book/show/77203.The_Kite_Runner", "num_ratings": "2,052,762", "num_reviews": "63,849", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "The Kite Runner", "description": ["Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amid", "Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amidst the increasing ethnic, religious, and political tensions of the dying years of the Afghan monarchy, wrenching them far apart. But so strong is the bond between the two boys that Amir journeys back to a distant world, to try to right past wrongs against the only true friend he ever had.", "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, ", " is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.", "A sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, ", " is an unusual and powerful novel that has become a beloved, one-of-a-kind classic."], "author": "Khaled Hosseini", "num_pages": "371", "awards": ["Borders Original Voices Award for Fiction (2003)", "Humo's Gouden Bladwijzer (2008)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Puddly Award for Fiction (2006)", "Lincoln Award Nominee (2006)", "Prix des libraires du Québec for Lauréats hors Québec (2006)"], "places": ["Kabul", "Fremont, California", "Afghanistan", "Peshawar"], "character_names": ["Amir", "Hassan", "Assef", "Bába", "Sohrab", "Soraya", "Rahim Khan"], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "1594480001"},
{"url": "https://www.goodreads.com/book/show/16270141-the-boy-on-the-bridge", "num_ratings": "839", "num_reviews": "229", "avg_ratings": 3.26, "genres": ["Young Adult", "Historical", "Historical Fiction", "Romance", "Historical", "Cultural", "Russia", "Fiction", "Travel"], "title": "The Boy on the Bridge", "description": ["A new breathtaking novel from Natalie Standiford about love and trust during the Cold War.", "Laura Reid goes to Leningrad for a semester abroad as Cold War paranoia is peaking in 1982. She meets a young Russian artist named Alexei and soon, with Alexei as her guide, Laura immerses herself in the real Russia--a crazy world of wild parties, black-market books and music, and smu", "A new breathtaking novel from Natalie Standiford about love and trust during the Cold War.", "Laura Reid goes to Leningrad for a semester abroad as Cold War paranoia is peaking in 1982. She meets a young Russian artist named Alexei and soon, with Alexei as her guide, Laura immerses herself in the real Russia--a crazy world of wild parties, black-market books and music, and smuggled letters to dissidents. She must keep the relationship secret; associating with Americans is dangerous for Alexei, and if caught, Laura could be sent home and Alexei put under surveillance or worse. At the same time, she's been warned that Soviets often latch onto Americans in hopes of marrying them and thus escaping to the United States. But she knows Alexei loves her. Right?", "As June approaches--when Laura must return to the United States--Alexei asks Laura to marry him. She's only nineteen and doesn't think she's ready to settle down. But what if Alexei is the love of her life? How can she leave him behind? If she has a chance to change his life, to rescue him from misery, shouldn't she take it?"], "author": "Natalie Standiford", "num_pages": "256", "awards": [], "places": ["Leningrad, USSR"], "character_names": ["Laura Reid"], "language": "English", "publish_date": "2013-07-30 00:00:00", "ISBN": "0545334810"},
{"url": "https://www.goodreads.com/book/show/308424.Aya", "num_ratings": "4,390", "num_reviews": "456", "avg_ratings": 3.74, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Cultural", "Africa", "Fiction", "Young Adult", "Sequential Art", "Bande Dessinée", "Graphic Novels Comics", "Historical", "Historical Fiction"], "title": "Aya", "description": ["Ivory Coast, 1978. Family and friends gather at Aya's house every evening to watch the country's first television ad campaign promoting the fortifying effects of Solibra, \"the strong man's", "Ivory Coast, 1978. Family and friends gather at Aya's house every evening to watch the country's first television ad campaign promoting the fortifying effects of Solibra, \"the strong man's beer.\" It's a golden time, and the nation, too--an oasis of affluence and stability in West Africa--seems fueled by something wondrous.", "Who's to know that the Ivorian miracle is nearing its end? In the sun-warmed streets of working-class Yopougon, aka Yop City, holidays are around the corner, the open-air bars and discos are starting to fill up, and trouble of a different kind is about to raise eyebrows. At night, an empty table in the market square under the stars is all the privacy young lovers can hope for, and what happens there is soon everybody's business.", " tells the story of its nineteen-year-old heroine, the studious and clear-sighted Aya, her easygoing friends Adjoua and Bintou, and their meddling relatives and neighbors. It's a breezy and wryly funny account of the desire for joy and freedom, and of the simple pleasures and private troubles of everyday life in Yop City. An unpretentious and gently humorous story of an Africa we rarely see-spirited, hopeful, and resilient--", " won the 2006 award for Best First Album at the Angoulême International Comics Festival. Clément Oubrerie's warm colors and energetic, playful lines connect expressively with Marguerite Abouet's vibrant writing."], "author": "Marguerite Abouet", "num_pages": "112", "awards": ["Prix du Festival d'Angoulême for Prix du premier album (2006)"], "places": ["Abidjan"], "character_names": [], "language": "English", "publish_date": "2007-02-20 00:00:00", "ISBN": "1894937902"},
{"url": "https://www.goodreads.com/book/show/227730.Everything_Good_Will_Come", "num_ratings": "800", "num_reviews": "83", "avg_ratings": 3.83, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Literature", "African Literature", "Womens"], "title": "Everything Good Will Come", "description": [" introduces an important new voice in contemporary fiction. It is 1971, a year after the Biafran War, and Nigeria is under military rule—though the politics of the state matter less than those of her home to Enitan Taiwo, an eleven-year-old girl tired of waiting for school to start. Will her mother, who has become deeply religious since the death o", " introduces an important new voice in contemporary fiction. It is 1971, a year after the Biafran War, and Nigeria is under military rule—though the politics of the state matter less than those of her home to Enitan Taiwo, an eleven-year-old girl tired of waiting for school to start. Will her mother, who has become deeply religious since the death of Taiwo's brother, allow her friendship with the new girl next door, the brash and beautiful Sheri Bakare? ", " charts the fate of these two African girls, one born of privilege and the other, a lower class \"half-caste\"; one who is prepared to manipulate the traditional system while the other attempts to defy it.", "Written in the voice of Enitan, the novel traces this unusual friendship into their adult lives, against the backdrop of tragedy, family strife, and a war-torn Nigeria. In the end, ", " is Enitan's story; one of a fiercely intelligent, strong young woman coming of age in a culture that still insists on feminine submission. Enitan bucks the familial and political systems until she is confronted with the one desire too precious to forfeit in the name of personal freedom: her desire for a child. ", " evokes the sights and smells of Africa while imparting a wise and universal story of love, friendship, prejudice, survival, politics, and the cost of divided loyalties."], "author": "Sefi Atta", "num_pages": "336", "awards": ["Wole Soyinka Prize for Literature in Africa  (2006)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2005-01-13 00:00:00", "ISBN": "1844370569"},
{"url": "https://www.goodreads.com/book/show/6487723-spud", "num_ratings": "1,758", "num_reviews": "87", "avg_ratings": 3.96, "genres": ["Fiction", "Young Adult", "Humor"], "title": "Spud: Learning to Fly", "description": ["As Spud Milton continues his diabolical stagger through adolescence, he learns one of life's most important lessons: when dealing with women and cretins, nothing is ever quite as it seems. In this third instalment, Spud, now 16 and growing up, takes on one of Shakespeare's most popular comedies, 'A Midsummer Night's Dream'."], "author": "John van de Ruit", "num_pages": "420", "awards": [], "places": [], "character_names": ["John 'Spud' Milton"], "language": "English", "publish_date": "2009-06-10 00:00:00", "ISBN": "0143025953"},
{"url": "https://www.goodreads.com/book/show/1413104.Spud", "num_ratings": "2,573", "num_reviews": "134", "avg_ratings": 3.98, "genres": ["Fiction", "Humor", "Young Adult", "Humor", "Comedy"], "title": "Spud: The Madness Continues", "description": ["It's 1991, and John \"Spud\" Milton's journey to manhood is still creeping along at a snail's pace. Nearly fifteen, Spud's starting his second year at boarding school and, to his utter mortification, he's still a spud ", "It's 1991, and John \"Spud\" Milton's journey to manhood is still creeping along at a snail's pace. Nearly fifteen, Spud's starting his second year at boarding school and, to his utter mortification, he's still a spud "], "author": "John van de Ruit", "num_pages": "352", "awards": [], "places": [], "character_names": ["John 'Spud' Milton"], "language": "English", "publish_date": "2008-10-16 00:00:00", "ISBN": "0143025201"},
{"url": "https://www.goodreads.com/book/show/701937.Spud", "num_ratings": "5,262", "num_reviews": "516", "avg_ratings": 4.06, "genres": ["Young Adult", "Fiction", "Humor", "Cultural", "Africa", "Southern Africa", "South Africa"], "title": "Spud", "description": ["It’s 1990. Apartheid is crumbling. Nelson Mandela has just been released from prison. And Spud Milton—thirteen-year-old, prepubescent choirboy extraordinaire—is about to start his first year at an elite boys-only boarding school in South Africa. Cursed with embarrassingly dysfunctional parents, a senile granny named Wombat, and a wild obsession for Julia Roberts, Spud has", "It’s 1990. Apartheid is crumbling. Nelson Mandela has just been released from prison. And Spud Milton—thirteen-year-old, prepubescent choirboy extraordinaire—is about to start his first year at an elite boys-only boarding school in South Africa. Cursed with embarrassingly dysfunctional parents, a senile granny named Wombat, and a wild obsession for Julia Roberts, Spud has his hands full trying to adapt to his new home."], "author": "John van de Ruit", "num_pages": "352", "awards": [], "places": ["KwaZulu-Natal"], "character_names": ["John 'Spud' Milton"], "language": "English", "publish_date": "2007-10-04 00:00:00", "ISBN": "1595141707"},
{"url": "https://www.goodreads.com/book/show/6801561-broken-memory", "num_ratings": "340", "num_reviews": "73", "avg_ratings": 3.52, "genres": ["Eastern Africa", "Rwanda", "Young Adult", "Historical", "Historical Fiction", "Cultural", "Africa", "War", "Fiction", "Realistic Fiction", "Cultural", "Historical", "Academic", "School"], "title": "Broken Memory: A Story of Rwanda", "description": ["Hiding behind a chair, five-year-old Emma can’t see her mother being murdered, but she hears everything. When the assassins finally leave, the terrified girl stumbles away from the scene, motivated only by the memory of her mother’s last words: \"You must not die, Emma!\" Eventually, Emma is taken in by an old Hutu woman who risks her own life to hide the child. A quiet bond", "Hiding behind a chair, five-year-old Emma can’t see her mother being murdered, but she hears everything. When the assassins finally leave, the terrified girl stumbles away from the scene, motivated only by the memory of her mother’s last words: \"You must not die, Emma!\" Eventually, Emma is taken in by an old Hutu woman who risks her own life to hide the child. A quiet bond grows between the two, but long after the war ends, Emma is still haunted by nightmares. When the country establishes ", " courts to allow victims to face their tormentors, Emma is uneasy and afraid. But through her growing friendship with a young torture victim and the encouragement of an old man charged with helping child survivors, Emma finds the courage to begin the long journey to healing. Moments of grace and tenderness illuminate this spare, sensitive novel, which tells the story of the 1994 attacks in an age-appropriate manner."], "author": "Elisabeth Combres", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "0888998929"},
{"url": "https://www.goodreads.com/book/show/178143.Over_a_Thousand_Hills_I_Walk_with_You", "num_ratings": "446", "num_reviews": "87", "avg_ratings": 3.86, "genres": ["Cultural", "Africa", "Young Adult", "Historical", "Historical Fiction", "Eastern Africa", "Rwanda", "War"], "title": "Over a Thousand Hills I Walk with You", "description": ["Before that fateful April day, Jeanne lived the life of a typical Rwandan girl. She bickered with her little sister, went to school, teased her brother. Then, in one horrifying night, everything changed. Political troubles unleashed a torrent of violence upon the Tutsi ethnic group. Jeanne's family, all Tutsis, fled their home and tried desperately to reach safety.", "They did", "Before that fateful April day, Jeanne lived the life of a typical Rwandan girl. She bickered with her little sister, went to school, teased her brother. Then, in one horrifying night, everything changed. Political troubles unleashed a torrent of violence upon the Tutsi ethnic group. Jeanne's family, all Tutsis, fled their home and tried desperately to reach safety.", "They did not succeed. As the only survivor of her family's massacre, Jeanne witnessed unspeakable acts. This haunting story was told to Jeanne's adoptive mother, and here she makes unforgettably real the events of the 1994 Rwandan genocide.", "Originally published in German: Stuttgard, Germany: Thienemann Verlag, 2002."], "author": "Hanna Jansen", "num_pages": "342", "awards": ["Buxtehuder Bulle (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "1575059274"},
{"url": "https://www.goodreads.com/book/show/18166941-boy-on-the-edge", "num_ratings": "139", "num_reviews": "32", "avg_ratings": 3.65, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Young Adult", "Teen"], "title": "Boy on the Edge", "description": ["Henry has a clubfoot and he is the target of relentless bullying. One day, in a violent fit of anger, Henry lashes out at the only family he has — his mother. Sent to live with other troubled boys at the Home of Lesser Brethren, an isolated fa", "Henry has a clubfoot and he is the target of relentless bullying. One day, in a violent fit of anger, Henry lashes out at the only family he has — his mother. Sent to live with other troubled boys at the Home of Lesser Brethren, an isolated farm perched in the craggy lava fields along the unforgiving Icelandic coast, Henry finds a precarious contentment among the cows. But it is the people, including the manic preacher who runs the home, who fuel Henry’s frustration and sometimes rage as he yearns for a life and a home. Author Fridrik Erlings offers a young adult novel that explores cruelty and desperation, tenderness and remorse, but most importantly, kindness and friendship."], "author": "Fridrik Erlings", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-25 00:00:00", "ISBN": "0763666807"},
{"url": "https://www.goodreads.com/book/show/10576349-the-wild", "num_ratings": "7", "num_reviews": "2", "avg_ratings": 3.0, "genres": ["Drama"], "title": "The Wild", "description": ["A poignant and original story of the bond between two brothers, torn apart by mental illness and destitution...Alexi and his little brother Misha have grown up in the shadow of the nuclear arms race - indeed they make a living from it. Living in a bleak and increasingly destitute town next to the old Aral Sea in Kazahkstan, the boys and their 'crew' are the first to spot t", "A poignant and original story of the bond between two brothers, torn apart by mental illness and destitution...Alexi and his little brother Misha have grown up in the shadow of the nuclear arms race - indeed they make a living from it. Living in a bleak and increasingly destitute town next to the old Aral Sea in Kazahkstan, the boys and their 'crew' are the first to spot the rocket and missile testing out in the nearby desert, and first to scavenge for nuclear debris, from which they can make a good living on the black market. But when Misha starts to suffer seizures of a sinister and familiar kind, the local medical centre tell Alexi that his only hope of saving Misha's life is to take him to the nearest city where he can receive proper treatment. Taking Misha away means the brothers leave behind their family and their liveliehood, and when the boys arrive in Moscow - a city that held so much hope from a distance - they are hit by plummeting temperatures and ruthless beaurocracy."], "author": "Matt Whyman", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-07-01 00:00:00", "ISBN": "0340884533"},
{"url": "https://www.goodreads.com/book/show/119800.Boy_Kills_Man", "num_ratings": "187", "num_reviews": "37", "avg_ratings": 3.57, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Thriller"], "title": "Boy Kills Man", "description": ["In the South American town of Medellin, where drug dealers rule and hope is scarce, young assassins are in large supply. Take Shorty and Alberto: two hardened best friends from poor homes whose biggest dream is to see a live soccer match. These boys understand that the one true power they will ever possess comes in the form of a fully loaded Smith & Wesson. Pulling the", "In the South American town of Medellin, where drug dealers rule and hope is scarce, young assassins are in large supply. Take Shorty and Alberto: two hardened best friends from poor homes whose biggest dream is to see a live soccer match. These boys understand that the one true power they will ever possess comes in the form of a fully loaded Smith & Wesson. Pulling the trigger may not be a way out . . . but it's the only way to the top."], "author": "Matt Whyman", "num_pages": "160", "awards": ["Booktrust Teenage Prize Nominee (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-01 00:00:00", "ISBN": "0060746653"},
{"url": "https://www.goodreads.com/book/show/18404397-the-winter-horses", "num_ratings": "1,050", "num_reviews": "214", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Animals", "Horses", "Animals", "Fiction", "War"], "title": "The Winter Horses", "description": ["From New York Times bestselling author Philip Kerr comes a breathtaking journey of survival by one girl and two horses in the dark days of WWII.", "It will soon be another cold winter in the Ukraine. But it's 1941, and things are different this year. Max, the devoted caretaker of an animal preserve, must learn to live with the Nazis who have overtaken this precious land. He mu", "From New York Times bestselling author Philip Kerr comes a breathtaking journey of survival by one girl and two horses in the dark days of WWII.", "It will soon be another cold winter in the Ukraine. But it's 1941, and things are different this year. Max, the devoted caretaker of an animal preserve, must learn to live with the Nazis who have overtaken this precious land. He must also learn to keep secrets-for there is a girl, Kalinka, who is hiding in the park.", "Kalinka has lost her home, her family, her belongings-everything but her life. Still, she has gained one small, precious gift: a relationship with the rare wild and wily Przewalski's horses that wander the preserve. Aside from Max, these endangered animals are her only friends-until a Nazi campaign of extermination nearly wipes them out for good.", "Now Kalinka must set out on a treacherous journey across the frozen Ukrainian forest to save the only two surviving horses-and herself.", "This sensitive, inspiring tale captures the power of sacrifice and the endurance of the human spirit."], "author": "Philip Kerr", "num_pages": "288", "awards": [], "places": ["Ukraine"], "character_names": [], "language": null, "publish_date": "2014-03-25 00:00:00", "ISBN": "0385755430"},
{"url": "https://www.goodreads.com/book/show/707972.God_and_I_Broke_Up", "num_ratings": "333", "num_reviews": "32", "avg_ratings": 3.35, "genres": ["Young Adult", "Contemporary", "Fiction", "European Literature", "Swedish Literature"], "title": "God and I Broke Up", "description": ["For all of her 16 years, Linnea has been a thinker. She thinks about everything from boys to zits to why parents get divorced to whether or not God really exists and what happens when you die. When she and Pia become best friends, Linnea becomes a talker. Whether the subject is guys, school, the afterlife, or politics, Pia is someone she can talk to about everything. They'", "For all of her 16 years, Linnea has been a thinker. She thinks about everything from boys to zits to why parents get divorced to whether or not God really exists and what happens when you die. When she and Pia become best friends, Linnea becomes a talker. Whether the subject is guys, school, the afterlife, or politics, Pia is someone she can talk to about everything. They're so close they’re like twin souls. So why did Pia have to go and kill herself? With self-deprecating candor, Linnea recounts the year following her friend’s suicide as she struggles to heal her grief. Alternately hilarious and profoundly sad, Linnea’s voice illuminates both her inner and outer selves, vividly portraying the difficulty of appearing to be a smart, savvy teen while inwardly feeling crushed by the loss of her soul mate. Her dilemma, told with honesty, grace, and often-unsettling wit, is sure to resonate with young readers."], "author": "Katarina Mazetti", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-20 00:00:00", "ISBN": "0888996179"},
{"url": "https://www.goodreads.com/book/show/23011496-escaping-the-tiger", "num_ratings": "82", "num_reviews": "28", "avg_ratings": 3.99, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Historical", "Adventure", "Survival"], "title": "Escaping the Tiger", "description": ["When you're so skinny people call you Skeleton Boy, how do you find strength for the fight of your life?", "Vonlai knows that soldiers who guard the Mekong River shoot at anything that moves, but in oppressive Communist Laos, there's nothing left for him, his spirited sister, Dalah, and his desperate parents. Their only hope is a refugee camp in Thailand—on the other side of t", "When you're so skinny people call you Skeleton Boy, how do you find strength for the fight of your life?", "Vonlai knows that soldiers who guard the Mekong River shoot at anything that moves, but in oppressive Communist Laos, there's nothing left for him, his spirited sister, Dalah, and his desperate parents. Their only hope is a refugee camp in Thailand—on the other side of the river.", "When they reach the camp, their struggles are far from over. Na Pho is a forgotten place where life consists of squalid huts, stifling heat, and rationed food. Still, Vonlai tries to carry on as if everything is normal. He pays attention in school, a dusty barrack overcrowded with kids too hungry to learn. And, to forget his empty stomach, he plays soccer in a field full of rocks. But when someone inside the camp threatens his family, Vonlai calls on a forbidden skill to protect their future—a future he's sure is full of promise, if only they can make it out of Na Pho alive.", "In her compelling debut, Laura Manivong has written an evocative story that is vividly real, strongly affecting, and, at its heart, about hope that resonates in even the darkest moments."], "author": "Laura Manivong", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19161835-confessions", "num_ratings": "6,308", "num_reviews": "1,239", "avg_ratings": 4.06, "genres": ["Mystery", "Fiction", "Thriller", "Cultural", "Japan", "Mystery", "Crime", "Asian Literature", "Japanese Literature", "Thriller", "Mystery Thriller"], "title": "Confessions", "description": ["After an engagement that ended in tragedy, all Yuko Moriguchi had to live for was her four-year-old child, Manami. Now, after a heartbreaking accident on the grounds of the middle school where she teaches, Yuko has given up and tendered her resignation. ", "But first, she has one last lecture to deliver. She tells", "After an engagement that ended in tragedy, all Yuko Moriguchi had to live for was her four-year-old child, Manami. Now, after a heartbreaking accident on the grounds of the middle school where she teaches, Yuko has given up and tendered her resignation. ", "But first, she has one last lecture to deliver. She tells a story that will upend everything her students ever thought they knew about two of their peers, and sets in motion a maniacal plot for revenge. ", "Narrated in alternating voices, with twists you'll never see coming, ", " probes the limits of punishment, despair, and tragic love, culminating in a harrowing confrontation between teacher and student that will place the occupants of an entire school in harm's way. You'll never look at a classroom the same way again."], "author": "Kanae Minato", "num_pages": "235", "awards": ["Shirley Jackson Award Nominee for Novel (2014)", "Strand Critics Award  Nominee for Best First Novel (2014)", "ALA Alex Award (2015)", "本屋大賞 for 1st place (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-19 00:00:00", "ISBN": "0316200921"},
{"url": "https://www.goodreads.com/book/show/26782972-moon-at-nine", "num_ratings": "734", "num_reviews": "167", "avg_ratings": 3.83, "genres": ["Young Adult", "Lgbt", "Historical", "Historical Fiction", "Fiction", "Romance"], "title": "Moon at Nine", "description": ["Based on interviews with a young woman forced to flee Iran because of her sexual orientation, Moon at Nine is a tense and riveting novel that shines a light on an issue of social injustice that continues to this day. Fifteen-year-old Farrin has grown up with secrets: ten years after the overthrow of the Shah, her aristocratic mother is still working against Iran's conserva", "Based on interviews with a young woman forced to flee Iran because of her sexual orientation, Moon at Nine is a tense and riveting novel that shines a light on an issue of social injustice that continues to this day. Fifteen-year-old Farrin has grown up with secrets: ten years after the overthrow of the Shah, her aristocratic mother is still working against Iran's conservative revolutionary government. But when Farrin befriends Sadira, the intriguing and outgoing new student at her school for gifted girls, her own new secret is even more dangerous. Because the girls discover their relationship is more than just a friendship--and in Iran, being gay is punishable by death."], "author": "Deborah Ellis", "num_pages": "224", "awards": ["Ruth and Sylvia Schwartz Children's Book Award Nominee (2015)", "Canadian Library Association Young Adult Book Award (2015)", "Snow Willow Award Nominee (2015)", "Manitoba Young Readers' Choice Award Nominee (2015)", "Quill & Quire Book of the Year (2014)", "BC Teen Readers' Choice Stellar Award Nominee (2016)"], "places": ["Tehran"], "character_names": [], "language": null, "publish_date": "2016-04-01 00:00:00", "ISBN": "1927485975"},
{"url": "https://www.goodreads.com/book/show/26086300-music-from-standing-waves", "num_ratings": "77", "num_reviews": "45", "avg_ratings": 4.34, "genres": ["Music", "Cultural", "Australia", "Literary Fiction"], "title": "Music From Standing Waves", "description": ["It’s 1994 and, growing up in a forgotten top corner of Australia, Abby’s life consists of backyard cricket, Nintendo and underwater wrestles with her best friend, Justin. But when she hears a recording of a Dvorak violin concerto, Abby becomes determined to one day perform the piece in the concert halls. Suddenly, music is everything and not even her blossoming relationshi", "It’s 1994 and, growing up in a forgotten top corner of Australia, Abby’s life consists of backyard cricket, Nintendo and underwater wrestles with her best friend, Justin. But when she hears a recording of a Dvorak violin concerto, Abby becomes determined to one day perform the piece in the concert halls. Suddenly, music is everything and not even her blossoming relationship with Justin can pull Abby away from her goals. ", "At eighteen, she is given a chance at her dream: a place at the Melbourne Conservatorium. But when she falls for charismatic composer Matt, Abby discovers love for a person can be as consuming as love for music. Their passionate relationship has her questioning everything she thought she ever wanted. Abby realises that to face the future, she must first confront the past; uncovering some uncomfortable truths about herself, her family and the passion that has shaped her life. "], "author": "Johanna Craven", "num_pages": "318", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22493749-moletown", "num_ratings": "439", "num_reviews": "127", "avg_ratings": 3.76, "genres": ["Childrens", "Picture Books", "Childrens", "Animals", "Fantasy"], "title": "Moletown", "description": ["Torben Kulhmann's stunningly illustrated, nearly wordless tale offers a fascinating window into an imaginary, yet hauntingly familiar world under our feet, where a mole suddenly recognizes the precarious balance between progress and preservation. But is it too late?", "Kulhmann's open ended text encourages thoughtful exploration into possible solutions, and his delightful endp", "Torben Kulhmann's stunningly illustrated, nearly wordless tale offers a fascinating window into an imaginary, yet hauntingly familiar world under our feet, where a mole suddenly recognizes the precarious balance between progress and preservation. But is it too late?", "Kulhmann's open ended text encourages thoughtful exploration into possible solutions, and his delightful endpapers depict a montage of solutions that could very well save the moles' world and ours."], "author": "Torben Kuhlmann", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-01 00:00:00", "ISBN": "0735842086"},
{"url": "https://www.goodreads.com/book/show/15772730-spud", "num_ratings": "1,132", "num_reviews": "82", "avg_ratings": 4.21, "genres": ["Young Adult", "Fiction"], "title": "Spud: Exit, Pursued by a Bear", "description": ["After an unexpected and diabolical farewell breakfast conversation with his father, Spud Milton returns to boarding school for his 1993 Matric year, his last as a schoolboy. Armed with a prefects’ tie and a raging libido, Spud soon discovers that being a large(ish) fish in a small pond has its fair share of challenges. ", "He finds himself embroiled in fighting for his own roo", "After an unexpected and diabolical farewell breakfast conversation with his father, Spud Milton returns to boarding school for his 1993 Matric year, his last as a schoolboy. Armed with a prefects’ tie and a raging libido, Spud soon discovers that being a large(ish) fish in a small pond has its fair share of challenges. ", "He finds himself embroiled in fighting for his own room, directing a house play where both lead actors refuse to learn their lines, and assisting in Vern Blackadder’s dramatic return from the dead with nothing more than a drip cord and a pair of oven gloves. ", "Amidst mounting pressure in the classroom and on the cricket field, Spud prepares to face down the most feared and dreaded challenge of them all – finding a date for the Matric dance. ", "In this hilarious final instalment of the Spud series John van de Ruit brings to a close his savagely funny blow by blow account of the agonies of growing up. The embarrassments, the thrills, the defeats, and the sheer -absurdity of daily life are wittily recorded in Spud’s unique voice as he prepares to make his own exit, pursued by a bear."], "author": "John van de Ruit", "num_pages": "416", "awards": [], "places": ["KwaZulu-Natal"], "character_names": ["John 'Spud' Milton"], "language": "English", "publish_date": "2012-08-04 00:00:00", "ISBN": "0143530240"},
{"url": "https://www.goodreads.com/book/show/8938994-a-time-of-miracles", "num_ratings": "928", "num_reviews": "178", "avg_ratings": 3.91, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Realistic Fiction", "Historical", "War", "Cultural"], "title": "A Time of Miracles", "description": ["Blaise Fortune, also known as Koumaïl, loves hearing the story of how he came to live with Gloria in the Republic of Georgia: Gloria was picking peaches in her father’s orchard when she heard a train derail. After running to the site of the accident, she found a", "Blaise Fortune, also known as Koumaïl, loves hearing the story of how he came to live with Gloria in the Republic of Georgia: Gloria was picking peaches in her father’s orchard when she heard a train derail. After running to the site of the accident, she found an injured woman who asked Gloria to take her baby. The woman, Gloria claims, was French, and the baby was Blaise.", " ", "When Blaise turns seven years old, the Soviet Union collapses and Gloria decides that she and Blaise must flee the political troubles and civil unrest in Georgia. The two make their way westward on foot, heading toward France, where Gloria says they will find safe haven. But what exactly is the truth about Blaise’s past?", "Bits and pieces are revealed as he and Gloria endure a five-year journey across the Caucasus and Europe, weathering hardships and welcoming unforgettable encounters with other refugees searching for a better life. During this time Blaise grows from a boy into an adolescent; but only later, as a young man, can he finally attempt to untangle his identity.", " ", "Bondoux’s heartbreaking tale of exile, sacrifice, hope, and survival is a story of ultimate love."], "author": "Anne-Laure Bondoux", "num_pages": "194", "awards": ["Batchelder Award (2011)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2012)", "Katholischer Kinder- und Jugendbuchpreis (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-11-09 00:00:00"}
]