[
{"url": "https://www.goodreads.com/book/show/1301625.La_Tahzan", "num_ratings": "26,385", "num_reviews": "2,138", "avg_ratings": 4.14, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Self Help"], "title": "Lā Tahzan: Jangan Bersedih!", "description": ["Sebagai salah satu buku kategori pencerahan hati (an-nafsu al-muthma`innah), Lâ Tahzan menawarkan terapi yang lebih dekat dengan al-Qur`an dan Sunah, ketimbang renungan-renungan reflektif semata. Lâ Tahzan menjadi buku terlaris di Timur Tengah karena sejak cetakan pertamanya (th 2001), buku ini telah terjual lebih dari 1 juta eksemplar.", "Buku ini telah melambungkan nama penu", "Sebagai salah satu buku kategori pencerahan hati (an-nafsu al-muthma`innah), Lâ Tahzan menawarkan terapi yang lebih dekat dengan al-Qur`an dan Sunah, ketimbang renungan-renungan reflektif semata. Lâ Tahzan menjadi buku terlaris di Timur Tengah karena sejak cetakan pertamanya (th 2001), buku ini telah terjual lebih dari 1 juta eksemplar.", "Buku ini telah melambungkan nama penulisnya, Dr. `Aidh al-Qarni, seorang doktor dalam bidang hadis yang hafiz Qur`an, ribuan hadis, dan juga ribuan bait syair Arab kuno hingga modern. Dalam usianya yang masih sangat muda, ia telah menjadi penulis paling produktif di Saudi Arabia saat ini.", "Di Indonesia, buku yang Anda pegang ini mendapat sambutan luar biasa dan telah terjual puluhan ribu eksemplar."], "author": "عائض القرني", "num_pages": "544", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2004-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11740777-ranah-3-warna", "num_ratings": "6,431", "num_reviews": "502", "avg_ratings": 4.12, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature"], "title": "Ranah 3 Warna", "description": ["Alif baru sahaja tamat belajar di Pondok Madani. Dia bahkan sampai bermimpi dalam bahasa Arab dan Inggeris. Impiannya? Tinggi betul. Mahu belajar teknologi tinggi seperti Habibie, lalu merantau sampai ke Amerika.", "Terinspirasi semangat pasukan Denmark, Alif mendobrak rintangan berat. Baru sahaja dia tersenyum, badai lain menggempurnya silih berganti tanpa ampun. Alif letih d", "Alif baru sahaja tamat belajar di Pondok Madani. Dia bahkan sampai bermimpi dalam bahasa Arab dan Inggeris. Impiannya? Tinggi betul. Mahu belajar teknologi tinggi seperti Habibie, lalu merantau sampai ke Amerika.", "Terinspirasi semangat pasukan Denmark, Alif mendobrak rintangan berat. Baru sahaja dia tersenyum, badai lain menggempurnya silih berganti tanpa ampun. Alif letih dan mulai bertanya-tanya, \"Sampai bilakah aku perlu teguh bersabar menghadapi semua dugaan hidup?\" Dia hampir-hampir menyerah.", "Rupa-rupanya mantera man jadda wajada sahaja tidak cukup sakti dalam memenangkan hidup. Alif teringat mantera kedua yang diajarkan di Pondok Madani. Man shabara zhafira. Sesiapa yang bersabar akan beruntung. Berbekalkan kedua-dua mantera itu, Alif menyongsong badai hidup satu persatu. Dapatkah dia memenangkan semua impiannya?", "Ranah 3 Warna adalah hikayat tentang bagaimana impian tetap wajib dibela habis-habisan walau hidup digelung nestapa tidak berkesudahan. Tuhan sungguh bersama orang yang sabar."], "author": "Ahmad Fuadi", "awards": ["Anugerah Pembaca Indonesia for Sampul Buku Fiksi Terfavorit (2011)"], "places": [], "character_names": ["Alif, Randai, Raisa, Rusdi, Kiai Rais, Ayah, Amak, Bang Togar, Shahibul Menara"], "language": "Malay", "publish_date": "2011-04-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4266215-islam", "num_ratings": "146", "num_reviews": "33", "avg_ratings": 3.64, "genres": ["Religion", "Islam", "Religion", "History", "Nonfiction"], "title": "Islam: The Religion and the People", "description": [" \"For newcomers to the subject[el]Bernard Lewis is the man.\" ", " \"The doyen of Middle Eastern studies.\" ", " \"No one writes about Muslim history with greater authority, or intelligence, or literary charm.\" ", " \"Bernard Lewis has no living rival in his field.\" ", " (the most in", " \"For newcomers to the subject[el]Bernard Lewis is the man.\" ", " \"The doyen of Middle Eastern studies.\" ", " \"No one writes about Muslim history with greater authority, or intelligence, or literary charm.\" ", " \"Bernard Lewis has no living rival in his field.\" ", " (the most influential Arab world newspaper) \"When it comes to Islamic studies, Bernard Lewis is the father of us all. With brilliance, integrity, and extraordinary mastery of languages and sources, he has led the way for[el]investigators seeking to understand the Muslim world.\" ", " \"Bernard Lewis combines profound depth of scholarship with encyclopedic knowledge of the Middle East and, above all, readability.\" ", " \"Lewis speaks with authority in prose marked by lucidity, elegance, wit and force.\" ", " \"Lewis' style is lucid, his approach, objective.\" ", " \"Lewis writes with unsurpassed erudition and grace.\" ", " ", " ", " ", " ", " For many people, Islam remains a mystery. Here Bernard Lewis and Buntzie Ellis Churchill examine Islam: what its adherents believe and how their religion has shaped them, their rich and diverse cultures, and their politics over more than 14 centuries. Considered one of the West's leading experts on Islam, Lewis, with Churchill, has written an illuminating introduction for those who want to understand the faith and the global challenges it confronts and presents. Whatever your political, personal, or religious views, this book will help you understand Islam's reality. Lewis and Churchill answer questions such as... - How does Islam differ from Judaism and Christianity? - What are the pillars of the Islamic faith? - What does Islam really say about peace and jihad? - How does the faith regard non-Muslims? - What are the differences between Sunni and Shi'a? - What does Islam teach about the position of women in society? - What does Islam say about free enterprise and profit? - What caused the rise of radical Islam? - What are the problems facing Muslims in the U.S. and Europe and what are the challenges posed by those minorities?"], "author": "Bernard Lewis", "num_pages": "237", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "0132230852"},
{"url": "https://www.goodreads.com/book/show/9772764-ihya-ulumiddin-jilid-ii", "num_ratings": "60", "num_reviews": "11", "avg_ratings": 4.55, "genres": ["Religion"], "title": "Ihya' Ulumiddin Jilid II", "description": ["Rahasia Zakat, RAhasia Puasa, Haji, ADab Membaca Al-Qur'an, Dzikir dan Doa-Doa"], "author": "Abu Hamid al-Ghazali", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "1990-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8793130-cinta-sang-sufi", "num_ratings": "14", "num_reviews": "5", "avg_ratings": 3.5, "genres": [], "title": "Cinta Sang Sufi (Salamatul Qos)", "description": ["Seorang sufi yang alim dan luas pengetahuannya, jatuh hati pada seorang budak wanita. Kisah percintaan mereka jadi bahan gunjingan masyarakat, apalagi budak itu adalah seorang penyanyi, yang dinilai sebagai pekerjaan hina.", "Pantaskah seorang alim mencintai seorang penyanyi wanita? Pantaskah tokoh yang disegani masyarakat karena ketakwaannya, terus menerus memuji kecantikan s", "Seorang sufi yang alim dan luas pengetahuannya, jatuh hati pada seorang budak wanita. Kisah percintaan mereka jadi bahan gunjingan masyarakat, apalagi budak itu adalah seorang penyanyi, yang dinilai sebagai pekerjaan hina.", "Pantaskah seorang alim mencintai seorang penyanyi wanita? Pantaskah tokoh yang disegani masyarakat karena ketakwaannya, terus menerus memuji kecantikan seorang wanita, dan meratap sedih karena kehilangan? Apakah dengan demikian ketakwaannya kepada Tuhan menjadi luntur?", "Novel ini menarik untuk disimak dari huruf ke huruf, baris ke baris. Bisa jadi novel ini memberi jawaban seputar makna cinta. Karena salah satu cara untuk mencintai Tuhan adalah dengan mencintai makhluk-Nya. Dengan mencintai sesama makhluk, hati akan lebih terbuka dan menyerap pesan-pesan Ilahiah. Dan cinta sejati, tak akan sirna walau jiwa tak bersatu.", "(catatan sampul)"], "author": "Ali Ahmad Baktsir", "num_pages": "208", "awards": [], "places": ["Mekkah"], "character_names": [], "language": "Indonesian", "publish_date": "2004-09-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2259281.Terpesona_Di_Sidratul_Muntaha", "num_ratings": "213", "num_reviews": "24", "avg_ratings": 4.15, "genres": ["Religion", "Islam", "Spirituality"], "title": "Terpesona Di Sidratul Muntaha", "description": ["Benarkah Rasulullah saw melakukan perjalanan malam itu dengan naik buraq: kuda bersayap? Bagaimana Sains modern melihat peristiwa dahsyat itu? Bagaimana badan Rasulullah bisa berubah menjadi cahaya, dan melintasi dimensi-dimensi langit sampai di dekat surga? Agus Mustofa mengajak Anda untuk terpesona di Sidratul Muntaha"], "author": "Agus Mustofa", "num_pages": "268", "awards": [], "places": ["Indonesia"], "character_names": [], "language": "Indonesian", "publish_date": "2007-08-16 00:00:00", "ISBN": "9799833728"},
{"url": "https://www.goodreads.com/book/show/8460524-padang-bulan", "num_ratings": "4,626", "num_reviews": "382", "avg_ratings": 3.82, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature", "Romance", "Literature", "Drama", "Love", "Realistic Fiction", "Slice Of Life", "Anthologies", "Collections", "Humor"], "title": "Padang Bulan", "description": ["Melalui pergolakan nasib seorang perempuan dan huru-hara kecemburuan, Andrea Hirata kembali memilih sudut yang tidak terduga untuk menampilkan kisah yang inspiratif tentang kegigihan karakter-karakter di dalam novelnya. Novel ", " bermula dari kisah seorang gadis kecil berusia 14 tahun, Enong namanya, yang sangat gemar pada pelajaran bahasa Inggris, namun secara me", "Melalui pergolakan nasib seorang perempuan dan huru-hara kecemburuan, Andrea Hirata kembali memilih sudut yang tidak terduga untuk menampilkan kisah yang inspiratif tentang kegigihan karakter-karakter di dalam novelnya. Novel ", " bermula dari kisah seorang gadis kecil berusia 14 tahun, Enong namanya, yang sangat gemar pada pelajaran bahasa Inggris, namun secara mendadak terpaksa harus berhenti sekolah dan mengambil alih seluruh tanggung jawab keluarga. Tersambung pada sekuel novel ini, ", " perjalanan nasib anak perempuan kecil itu, melalui gaya khasnya: menertawakan kepedihan, memarodikan tragedi, mengkritik tanpa menjadi sarkastik, kisah Enong menjadi seperti panggung di dalam lembaran-lembaran kertas. Membaca novel ini seperti melihat sebuah gambar. ", "Dengan menceritakan kisah Enong seperti sebuah epos, Andrea berhasil memperlihatkan kepada pembaca kekuatan-kekuatan besar yang tersembunyi di dalam diri manusia, kekuatan yang sering tidak disadari seseorang berada di dalam dirinya. Enong jatuh, bangun, jatuh lagi, dan bangun lagi. Kisah Enong tidak sekadar kisah sebuah keluarga yang sederhana, namun tentang impian seorang anak kecil, tentang keberanian menjalani hidup, dan tentang seorang lelaki yang menjadi berantakan karena tragedi cinta pertama. ", "\"Cemburu adalah perahu Nabi Nuh yang tergenang di dalam hati yang karam. Lalu, naiklah ke geladak perahu itu, binatang yang berpasang-pasangan: perasaan tak berdaya-ingin mengalahkan, rencana jahat-penyesalan, kesedihan-gengsi....,\" kata lelaki itu.", "Salman Faridi"], "author": "Andrea Hirata", "num_pages": "254", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2010-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7948706-muhammad", "num_ratings": "2,956", "num_reviews": "236", "avg_ratings": 4.34, "genres": ["Novels", "Asian Literature", "Indonesian Literature", "Religion", "Islam", "Religion", "Fiction", "Historical", "Historical Fiction", "Fantasy", "Adventure"], "title": "Muhammad: Lelaki Penggenggam Hujan", "description": ["Kashva pergi dari Suriah, meninggalkan Khosrou, sang penguasa Persia tempatnya mengabdikan hidup demi menemukan lelaki itu: Muhammad. Al-Amin yang kelahirannya akan membawa rahmat bagi semesta alam, pembela kaum papa, penguasa yang adil kepada rakyatnya.", "Kehidupan Kashva setelah itu berubah menjadi pelarian penuh kesakitan dan pencarian yang tiada henti terhadap sosok yang", "Kashva pergi dari Suriah, meninggalkan Khosrou, sang penguasa Persia tempatnya mengabdikan hidup demi menemukan lelaki itu: Muhammad. Al-Amin yang kelahirannya akan membawa rahmat bagi semesta alam, pembela kaum papa, penguasa yang adil kepada rakyatnya.", "Kehidupan Kashva setelah itu berubah menjadi pelarian penuh kesakitan dan pencarian yang tiada henti terhadap sosok yang dijanjikan. Seorang Pangeran Kedamaian yang dijanjikan oleh semua kitab suci yang dia cari dari setiap ungkapan ayat-ayat Zardusht sampai puncak-puncak salju di perbatasan India, Pegunungan Tibet, biara di Suriah, Istana Heraklius, dan berakhir di Yatsrib, sang Kota Cahaya.", "Hasrat dalam diri Kashva sudah tak terbendung lagi. Keinginannya untuk bisa bertemu dengan Muhammad demikian besar hingga tak ada sesuatu pun yang membuatnya jerih. Bahkan maut yang mengintai dari ujung pedang tentara Khosrou tak juga menyurutkan kerinduannya bertemu Muhammad.", "Kisah pencarian Kashva yang syahdu dalam novel ini akan membawa kita menelusur Jazirah Arab, India, Barrus, hinga Tibet."], "author": "Tasaro G.K.", "num_pages": "546", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2010-03-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/432539.The_Sealed_Nectar_Biography_of_Prophet_Muhammad", "num_ratings": "14,650", "num_reviews": "1,258", "avg_ratings": 4.57, "genres": ["Religion", "Islam", "Religion", "History", "Biography"], "title": "The Sealed Nectar | Biography of Prophet Muhammad (SAW)", "description": ["A complete authoritative book on the life of Prophet Muhammad (S) by Sheikh Safiur-Rahman al-Mubarkpuri. It was honored by the World Muslim League as first prize winner book. ", "Whoever wants to know the whole life style of the Prophet in detail must read this book."], "author": "Safiy al-Rahman al-Mubarakfuri", "num_pages": "656", "awards": ["Muslim World League at worldwide competition on the 'Biography of the Prophet'"], "places": [], "character_names": [], "language": "Arabic", "publish_date": "2011-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11555459-rasulullah-is-my-doctor", "num_ratings": "402", "num_reviews": "28", "avg_ratings": 4.33, "genres": ["Health", "Religion", "Islam", "Nonfiction"], "title": "Rasulullah is My Doctor", "description": [" (Pengobatan ala Nabi Muhammad saw) ini seharusnya melekat erat dalam hati setiap Muslim dalam kehidupan sehari-hari karena contoh terbaik dan dokter terbaik bagi umat Islam adalah Firman Allah SWT melalui lisan Muhammad saw. dan buku yang ditulis saudara Jerry ini membuktikannya! (dr. ZAIDUL AKBAR, ", ")", "Subhanallah", " (Pengobatan ala Nabi Muhammad saw) ini seharusnya melekat erat dalam hati setiap Muslim dalam kehidupan sehari-hari karena contoh terbaik dan dokter terbaik bagi umat Islam adalah Firman Allah SWT melalui lisan Muhammad saw. dan buku yang ditulis saudara Jerry ini membuktikannya! (dr. ZAIDUL AKBAR, ", ")", "Subhanallah! Buku ini luar biasa bagus, semoga bisa menjadi pelajaran dan inspirasi bagi kalangan medis dan masyarakat umum khususnya umat Muslim bahwa apa yang tertulis dalam Al-Qur'an dan Hadits adalah benar adanya. (dr. AGUS RAHMADI, ", ")"], "author": "Jerry D. Gray", "num_pages": "270", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2010-10-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11682749-wajah-peradaban-barat", "num_ratings": "110", "num_reviews": "10", "avg_ratings": 4.23, "genres": ["Religion", "Islam", "Nonfiction"], "title": "Wajah Peradaban Barat: dari Hegemoni Kristen ke Dominasi Sekuler-Liberal", "description": ["\"Buku terbaru dari cendekiawan muda ini, seperti karya-karyanya yang lain yang sempat saya baca dengan penuh minat, ditulis dengan rasa keprihatinan atau ", " yang amat mendalam tentang pelbagai ", " (tantangan) yang dihadapi umat Islam, khususnya di negara Islam terbesar, Indonesia... Dalam bahasa Melayu--baik di Malaysia, Brunei, Singapura, dan Indonesia--hampir ti", "\"Buku terbaru dari cendekiawan muda ini, seperti karya-karyanya yang lain yang sempat saya baca dengan penuh minat, ditulis dengan rasa keprihatinan atau ", " yang amat mendalam tentang pelbagai ", " (tantangan) yang dihadapi umat Islam, khususnya di negara Islam terbesar, Indonesia... Dalam bahasa Melayu--baik di Malaysia, Brunei, Singapura, dan Indonesia--hampir tidak terdapat karya asli yang menayangkan begitu banyak fakta dari pelbagai sumber yang serius dan yang popular, seperti yang diusahakan oleh Adian Husaini.\"", ", ", " (Guru Besar Tamu) Institut Alam dan Tamadun Melayu (ATMA), Universiti Kebangsaan Malaysia", "\"Dalam beberapa tahun terakhir dunia internasional diwarnai oleh berbagai pergolakan yang sebagian besar jika tak bisa dibilang semuanya bersumber pada kekerasan politik dan politik kekerasan yang dikembangkan pemerintahan Amerika Serikat di bawah kepemimpinan Presiden George W. Bush. Sejatinya, ketegangan AS--Dunia Islam lebih banyak disebabkan karena kebijakan rezim Bush yang selalu mengidentikkan Islam dengan terorisme. Buku yang ditulis Adian Husaini, salah seorang penulis muda Islam yang sangat produktif ini, membeberkan dengan sangat jelas dan rinci perihal akar-akar ideologis permusuhan terhadap Islam, yang dalam beberapa tahun terakhir dikembangkan oleh rezim Bush di AS.\""], "author": "Adian Husaini", "num_pages": "416", "awards": ["Indonesia Islamic Book Fair Award for Non Fiksi Dewasa (2006)"], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2005-04-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7101705-burlian", "num_ratings": "3,025", "num_reviews": "203", "avg_ratings": 4.16, "genres": ["Novels", "Fiction", "Family"], "title": "Burlian", "description": ["Burlian, anak kampung dengan segala keriangan keluarganya. Bercita-cita ingin naik kapal besar keliling dunia. Buku 2, dari Serial Anak2 Mamak. Buku 3, PUKAT terbit Februari 2010, Buku 4, Eliana direncanakan terbit Oktober 2010, Buku 1, Amelia direncanakan terbit Februari 2011."], "author": "Tere Liye", "num_pages": "343", "awards": [], "places": [], "character_names": ["Burlian"], "language": "Indonesian", "publish_date": "2009-11-04 00:00:00", "ISBN": "9791102686"},
{"url": "https://www.goodreads.com/book/show/5975582-betapa-allah-mencintaimu", "num_ratings": "27", "num_reviews": "7", "avg_ratings": 3.93, "genres": [], "title": "Betapa Allah Mencintaimu", "author": "Ratna Dewi Idrus", "num_pages": "140", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2007-09-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3971237-bidadari-bidadari-surga", "num_ratings": "6,644", "num_reviews": "533", "avg_ratings": 4.28, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature", "Family"], "title": "Bidadari Bidadari Surga", "description": ["Bidadari-Bidadari Surga bercerita tentang pengorbanan seorang kakak (Laisa) untuk adik-adiknya (Dalimunte, Ikanuri, Wibisana dan Yashinta) di Lembah Lahambay agar adik-adiknya dapat melanjutkan pendidikan mereka, meski ia harus bekerja di terik matahari setiap hari, mengolah gula aren setiap jam 4 pagi serta dimalam hari menganyam rotan, meski pada dasarnya keempat adik-ad", "Bidadari-Bidadari Surga bercerita tentang pengorbanan seorang kakak (Laisa) untuk adik-adiknya (Dalimunte, Ikanuri, Wibisana dan Yashinta) di Lembah Lahambay agar adik-adiknya dapat melanjutkan pendidikan mereka, meski ia harus bekerja di terik matahari setiap hari, mengolah gula aren setiap jam 4 pagi serta dimalam hari menganyam rotan, meski pada dasarnya keempat adik-adiknya tersebut berasal dari darah yang berbeda dengan dirinya.", "Satu sisi Laisa digambarkan sebagai kakak yang galak dan tegas, mengejar-ngejar adiknya yang bolos sekolah dengan rotan dan ranting kayu. Di sisi lain, kontradiktif dengan fisiknya yang gempal, gendut, berkulit hitam, wajah yang tidak proporsional ditambah dengan rambut gimbal serta ukuran tubuhnya yang tidak normal, lebih pendek, Laisa sesungguhnya tipe kakak yang mendukung adik-adiknya, rela mengorbankan diri untuk keselamatan ‘dua anak nakal’ Ikanuri dan Wibisana dari siluman Gunung Kendeng, serta mati-matian mencari obat bagi kesembuhan adiknya Yashinta yang diserang demam panas hingga kejang pada suatu malam."], "author": "Tere Liye", "num_pages": "365", "awards": [], "places": ["Indonesia"], "character_names": [], "language": "Indonesian", "publish_date": "2008-06-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7737606-pukat", "num_ratings": "2,498", "num_reviews": "173", "avg_ratings": 4.18, "genres": ["Novels", "Fiction", "Family", "Childrens", "Asian Literature", "Indonesian Literature", "Drama", "Realistic Fiction", "Slice Of Life", "Inspirational"], "title": "Pukat", "description": ["\"Jangan pernah membenci Mamak kau, jangan sekali-kali. Karena jika kau tahu sedikit saja apa yang telah ia lakukan demi kau, Amelia, Burlian dan Ayuk Eli, maka yang kau tahu itu sejatinya bahkan belum sepersepuluh dari pengorbanan, rasa cinta serta rasa sayangnya kepada kalian...\"", "Meski dibesarkan dalam kesederhanaan, keterbatasan, berbaur dengan kepolosan dan kenakalan. Ma", "\"Jangan pernah membenci Mamak kau, jangan sekali-kali. Karena jika kau tahu sedikit saja apa yang telah ia lakukan demi kau, Amelia, Burlian dan Ayuk Eli, maka yang kau tahu itu sejatinya bahkan belum sepersepuluh dari pengorbanan, rasa cinta serta rasa sayangnya kepada kalian...\"", "Meski dibesarkan dalam kesederhanaan, keterbatasan, berbaur dengan kepolosan dan kenakalan. Mamak selalu menanamkan arti kerja-keras, kejujuran, harga diri serta perangai tidak tercela. Dan di sini, kasih sayang keluarga adalah segalanya. Selamat datang di dunia anak-anak yang tidak pernah kalian bayangkan."], "author": "Tere Liye", "num_pages": "351", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2010-03-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/358980.The_Arabs_in_History", "num_ratings": "292", "num_reviews": "28", "avg_ratings": 3.7, "genres": ["History", "Nonfiction", "Religion", "Politics", "Religion", "Islam"], "title": "The Arabs in History", "description": ["Now brought completely up to date, this classic study by one of the world's premier historians of the Middle East considers the achievement of the Arab peoples and their place in world history, from pre-Islamic times to the present-day. In a concise and readable account, Lewis examines the awakening that accompanied the advent of Islam and the political, religious, and soc", "Now brought completely up to date, this classic study by one of the world's premier historians of the Middle East considers the achievement of the Arab peoples and their place in world history, from pre-Islamic times to the present-day. In a concise and readable account, Lewis examines the awakening that accompanied the advent of Islam and the political, religious, and social developments that transformed the Arab kingdom into an Islamic empire. He brings the edition up-to-the-minute with an account of recent events in the Middle East and analyzes the forces, internal and external, that have shaped the modern Arab world. Lewis shows how Western inventions and institutions have shattered the old structures and the traditional way of life, affecting every Arab, and causing a still unsatisfied demand for social, political, and cultural renewal.", "Incisive and intriguing, this highly regarded and timely work--previously translated into Arabic, as well as many other European, Asian, and Middle Eastern languages--is sure to advance a greater understanding of the Arab past and present."], "author": "Bernard Lewis", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-05-23 00:00:00", "ISBN": "0192803107"},
{"url": "https://www.goodreads.com/book/show/25386135-getting-the-barakah", "num_ratings": "38", "num_reviews": "8", "avg_ratings": 4.18, "genres": ["Religion", "Islam"], "title": "Getting the Barakah: An Islamic Guide to Time Management", "description": ["This eBook is now available here: ", "\"Across the globe, Muslims complain about not having any Barakah in their time. Many Muslims are constantly late for appointments, and rushing around without being able to accomplish much. Yet, if we move beyond blame and complaint, we can discover many ways through which we can manage our time well", "This eBook is now available here: ", "\"Across the globe, Muslims complain about not having any Barakah in their time. Many Muslims are constantly late for appointments, and rushing around without being able to accomplish much. Yet, if we move beyond blame and complaint, we can discover many ways through which we can manage our time well enough to accomplish everything we need to do and more. ", "Islam is a religion which emphasizes self-discipline and accountability. A deeper understanding of Islam would lead to us being able to optimize the usage of our time. In this book, you will learn important tools for time management, merging them with Islamic concepts like Dua, Sabr, Tawakul, and the benefits of having a strong connection with one’s Creator. ", "The tools and tips covered are well-researched and based on the author’s personal experiences. Each section includes Islamic quotations, tools, tips, personal experiences and action points making this a practical, yet uniquely spiritual guide to Time Management.\" ", "Get more details here: "], "author": "Abu Muawiyah Ismail Kamdar", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-25 00:00:00", "ISBN": "1482806223"},
{"url": "https://www.goodreads.com/book/show/26947746-spanish-islam", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 2.33, "genres": [], "title": "Spanish Islam: A Concise History", "description": ["There are many books of history that fill you with garbage, let this one be the opposite and fill your heart with light and a clearer understanding of the misconceptions in relation to Al-Andalus that is one of the most extraordinary portions of our great Islamic history and is the greatest European expression of Islam. Many of the traits on which modern Europe prides itse", "There are many books of history that fill you with garbage, let this one be the opposite and fill your heart with light and a clearer understanding of the misconceptions in relation to Al-Andalus that is one of the most extraordinary portions of our great Islamic history and is the greatest European expression of Islam. Many of the traits on which modern Europe prides itself came to it from Muslim Spain. Diplomacy, free trade, open borders, the techniques of academic research, of anthropology, etiquette, fashion, various types of medicine and hospitals, all came from the great city of cities; Cordoba. The age that paved the way for the European renaissance was known as the Islamic Golden Age and a renaissance took place under the influence of the Arabs and Moorish revival of culture. Re-visiting the Islamic Golden Age is crucial to understanding the nature of a renaissance. Muslims were created to be leaders and to lead humanity to what is good and forbid what is evil."], "author": "Omar Ali Zafar", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18869166-hadith-terminology-and-classification", "num_ratings": "6", "num_reviews": "2", "avg_ratings": 4.67, "genres": ["Religion", "Islam"], "title": "Hadith Terminology and Classification: A Handbook", "description": ["Hadith Terminology and Classification is a concise handbook that aims to facilitate independent seekers of knowledge and students of Hadith Science. It seeks to acquaint them with the commendable endeavours of the early Muslim scholars in sifting through the immense treasure of hadiths and recognising the authentic gems that form the words and acts of the Prophet(blessings", "Hadith Terminology and Classification is a concise handbook that aims to facilitate independent seekers of knowledge and students of Hadith Science. It seeks to acquaint them with the commendable endeavours of the early Muslim scholars in sifting through the immense treasure of hadiths and recognising the authentic gems that form the words and acts of the Prophet(blessings and peace be upon him).", "This is a complete guide that introduces the origin, provenance and development of the science of Hadith. It also provides taxonomy of hadiths according to different criteria, including the number of its narrators, authenticity of reports and efficacy in law. Furthermore, it classifies weak hadiths and details the means of eliminating their effect.", "This handbook is an excellent, in-depth study that significantly elaborates hadith terminology and criticism, making it easier for the reader to understand the regulations that authenticate a hadith."], "author": "Muhammad S. ar-Rahâwan", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22057533-khusyuk-dalam-shalat", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "Khusyuk Dalam Shalat: Menurut Al-Qur'an dan As-Sunnah", "description": ["Mampu mengerjakan ibadah dengan sebaik-baiknya adalah dambaan setiap hamba Allah, terlebih dalam masalah shalat (baca: khusyuk). Mengapa? Karena Rasulullah Saw pernah menegaskan dalam sabdanya, “Perkara yang pertama kali dihisab dari seorang hamba pada Hari Kiamat adalah shalat.", "Apabila shalatnya baik, maka seluruh amalnya pun baik. Apabila shalatnya buruk, maka seluruh ama", "Mampu mengerjakan ibadah dengan sebaik-baiknya adalah dambaan setiap hamba Allah, terlebih dalam masalah shalat (baca: khusyuk). Mengapa? Karena Rasulullah Saw pernah menegaskan dalam sabdanya, “Perkara yang pertama kali dihisab dari seorang hamba pada Hari Kiamat adalah shalat.", "Apabila shalatnya baik, maka seluruh amalnya pun baik. Apabila shalatnya buruk, maka seluruh amalnya pun akan buruk.” (H.r. Thabrani dari sahabat Anas bin Malik)", "Khusyuk bukan berarti lupa segala-galanya karena Rasulullah Saw pernah memulai shalat dengan niat memanjangkannya. Namun, ketika mendengar tangis bayi, beliau memendekkannya. Beliau juga pernah shalat fardhu sambil menggendong Umamah binti Abil Ash. Apabila berdiri, beliau menggendongnya; apabila rukuk atau sujud, beliau meletakkannya. Juga tak berarti lalai karena beliau Saw meski memperhatikan kondisi para jamaah dan lainnya, beliau tetap berkonsentrasi penuh, mendekatkan diri kepada Allah dan fokus di hadapan-Nya.", "Tidak mudah, bukan? Karena itulah, buku ini hadir. Tampil untuk menjawab kegundahan umat agar kekhusyukan yang kita usahakan sesuai dengan yang Allah Swt syariatkan dan Rasulullah Saw tuntunkan. Tak hanya itu, dalam buku ini juga diketengahkan bagaimana Nabiyullah Muhammad Saw, sahabat-sahabat beliau r.a., dan para tabi’in mengerjakan shalat dengan penuh kekhusyukan. Wallâhu A’lam bish-shawab"], "author": "سعيد بن علي بن وهف القحطاني", "num_pages": "435", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20580117-a-series-of-very-unfortunate-monsters-santa-clause-his-elves-and-a-too", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 2.33, "genres": [], "title": "A Series of Very Unfortunate Monsters; Santa Clause, His Elves and A Tooth Fairy Too!", "description": ["Starving Santa searches and entices with all his devilish tricks to entice Salar and Taimyyah away from their belief in Allah’s Tawhid and final religion of Islam. He shows his goodies, threatens with his back biting and slander and then bring in re-inforcements including the tooth fairy. This scary and funny story is an allegory depicting Iblis and devil types showing the", "Starving Santa searches and entices with all his devilish tricks to entice Salar and Taimyyah away from their belief in Allah’s Tawhid and final religion of Islam. He shows his goodies, threatens with his back biting and slander and then bring in re-inforcements including the tooth fairy. This scary and funny story is an allegory depicting Iblis and devil types showing their anti-Islamic arsenal of disbelief and fitnah trying to lure children from Allah, Quran, Sunnah and Islam.", "The children learn the Islamic belief for when being confronted with kufr and shirk, Shariah prescribed Ruqyah to make jinn and evils go away and the importance in belief of Jannah.", "About the Author: Halimah bint David authored, illustrated, published and marketed several children’s books for Muslim Kindle for kids in Islam and Sharia Ruqyah for exorcisms in adults. Halimah founded a few popular blogs at SurvivorsAreUs.WordPress.Com, HighwayToHeaven.WordPress.Com, ChristinaMacQuarrie.Wordpress.Com and is currently researching and implementing new copy writing skills."], "author": "Halimah Bint David", "num_pages": "29", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/569407.The_Middle_East", "num_ratings": "1,650", "num_reviews": "118", "avg_ratings": 3.76, "genres": ["History", "Nonfiction", "Politics", "Religion"], "title": "The Middle East", "description": ["In a sweeping and vivid survey, renowned historian Bernard Lewis charts the history of the Middle East over the last 2,000 years, from the birth of Christianity through the modern era, focusing on the successive transformations that have shaped it.", "Drawing on material from a multitude of sources, including the work of archaeologists and scholars, Lewis chronologically trace", "In a sweeping and vivid survey, renowned historian Bernard Lewis charts the history of the Middle East over the last 2,000 years, from the birth of Christianity through the modern era, focusing on the successive transformations that have shaped it.", "Drawing on material from a multitude of sources, including the work of archaeologists and scholars, Lewis chronologically traces the political, economical, social, and cultural development of the Middle East, from Hellenization in antiquity to the impact of westernization on Islamic culture. Meticulously researched, this enlightening narrative explores the patterns of history that have repeated themselves in the Middle East.", "From the ancient conflicts to the current geographical and religious disputes between the Arabs and the Israelis, Lewis examines the ability of this region to unite and solve its problems and asks if, in the future, these unresolved conflicts will ultimately lead to the ethnic and cultural factionalism that tore apart the former Yugoslavia.", "Elegantly written, scholarly yet accessible, ", "is the most comprehensive single volume history of the region ever written from the world’s foremost authority on the Middle East."], "author": "Bernard Lewis", "num_pages": "448", "awards": ["National Book Critics Circle Award Nominee for General Nonfiction (1996)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-08-07 00:00:00", "ISBN": "0684832801"},
{"url": "https://www.goodreads.com/book/show/16074148-buku-pintar-keuangan-syariah", "num_ratings": "26", "num_reviews": "3", "avg_ratings": 4.12, "genres": ["Religion", "Islam", "Economics", "Finance"], "title": "Buku Pintar Keuangan Syariah: Cara Mudah Memahami Prinsip, Praktik, Prospek, dan Keunggulan Keuangan Islam di Zaman Kita", "description": ["Krisis global yang kini menghantam Amerika Serikat dan menjalar ke Uni Eropa tak pelak mengguncang pemikiran dunia tentang sistem ekonomi konvensional. Warga dunia pun mencari-cari sistem ekonomi alternatif yang diharapkan bisa memperbaiki sistem ekonomi lama yang dianggap mapan itu.", "Perekonomian syariah lantas menyeruak sebagai jawaban.", "Krisis global yang kini menghantam Amerika Serikat dan menjalar ke Uni Eropa tak pelak mengguncang pemikiran dunia tentang sistem ekonomi konvensional. Warga dunia pun mencari-cari sistem ekonomi alternatif yang diharapkan bisa memperbaiki sistem ekonomi lama yang dianggap mapan itu.", "Perekonomian syariah lantas menyeruak sebagai jawaban. Dengan popularitas yang sebelumnya menanjak karena tiga krisis—krisis minyak 1973, krisis 11 September 2011, dan krisis subprima AS 2008—perekonomian syariah kini kian menjadi primadona ekonomi. Sebab, faktanya tidak ada bank syariah yang bangkrut karena krisis.", "Buku ini memandu kita memahami perekonomian syariah secara lebih gamblang. Disusun dua pakar kompeten, ia mengulas prinsip dan praktik keuangan syariah dan keunggulannya di kancah ekonomi dunia. Juga, mengupas tuntas kontroversi seputar sejumlah produk syariah, seperti kartu kredit dan derivatif syariah.", "Selamat menguasai alat ampuh untuk mengantisipasi krisis ekonomi yang kini sudah menjadi norma baru (new normalcy) di dunia.", "Mudah dicerna pembaca awam—muslim maupun nonmuslim—dan menginspirasi para ahli, karena buku ini berhasil menjelaskan:", "- cara kerja keuangan syariah dari sudut pandang konsumen.", "- perbandingan memadai antara keuangan konvensional dan ke­uangan syariah.", "- ragam transaksi keuangan yang kerap diterima begitu saja tanpa dipahami dengan baik, seperti hipotik, investasi, asuransi, dan pembiayaan dagang. Versi syariah dari transaksi-transaksi tersebut pun dikupas secara lugas.", "- prinsip paling hakiki keuangan syariah: keadilan—dalam segala interaksi dengan orang, keluarga, mitra bisnis, nonmuslim, dan masyarakat.", "Sarat dengan ilustrasi, tabel, contoh nyata, dan golden tips yang memudahkan dan mencerahkan."], "author": "Daud Vicary Abdullah", "num_pages": "376", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2012-03-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/32719682-ada-pelangi-di-balik-hujan", "num_ratings": "5", "num_reviews": "3", "avg_ratings": 4.2, "genres": [], "title": "Ada Pelangi di Balik Hujan", "description": ["Sudah menjadi sunnatullah, kesulitan selalu beserta kemudahan. Yang sulit terus, tidak ada. Yang mudah terus, tidak ada! Dalam susah berisi senang, dalam senang berisi susah. Dalam susah ada mudahnya, dalam sempit ada lapangnya. Itulah perjuangan!", "Buku ini terinspirasi dari surah Al-Insyirah. Bahwa selama ada iman di dalam dada, jangan pernah gentar menghadapi kesukaran. Se", "Sudah menjadi sunnatullah, kesulitan selalu beserta kemudahan. Yang sulit terus, tidak ada. Yang mudah terus, tidak ada! Dalam susah berisi senang, dalam senang berisi susah. Dalam susah ada mudahnya, dalam sempit ada lapangnya. Itulah perjuangan!", "Buku ini terinspirasi dari surah Al-Insyirah. Bahwa selama ada iman di dalam dada, jangan pernah gentar menghadapi kesukaran. Selalu ada solusi, selalu ada jalan, dan selalu ada harapan bagi siapa saja yang mau berusaha. Tidak ada masalah yang tidak ada solusinya. Tidak ada gunung yang terlalu tinggi untuk didaki. Tidak ada samudera yang terlalu luas untuk disebrangi.", "Beberapa tema menarik dalam buku ini:", "- Nikmati Prosesnya, Tahan Rasa Sakitnya", "- Ketika Masalah di Luar Kemampuan Kita", "- Pelaut Tanggih Tidak Lahir di Air yang Tenang", "- Istighfar Pembuka Jalan", "- Minta Tolonglah dengan Shalat dan Sabar", "Diperkaya dengan berbagai tips praktis:", "- Tips mengatasi kesulitan bangun pagi", "- Tips mengatasi kesulitan biaya sekolah", "- Tips mengatasi kesulitan biaya berobat yang mahal", "- Tips mengatasi kesulitan untuk move on", "- Tips mengatasi kesulitan berbicara di depan umum", "- Tips mengatasi kesulitan mengubah kebiasaaan"], "author": "Satria Nova", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2016-10-16 00:00:00", "ISBN": "6024180799"},
{"url": "https://www.goodreads.com/book/show/15775556-having-fun-the-halal-way", "num_ratings": "53", "num_reviews": "9", "avg_ratings": 4.3, "genres": ["Religion", "Islam", "Religion", "Nonfiction"], "title": "Having Fun the Halal Way: Entertainment in Islam", "description": ["With the advent of technology, the entertainment industry has flourished and become immensely popular. Combine this with the exponential advances in technology, and the result is an increasing number of ways to amuse ourselves.", "As a result of such advances, Muslim react in a variety of manners towards entertainment. Some label entertainment as completely forbidden. This som", "With the advent of technology, the entertainment industry has flourished and become immensely popular. Combine this with the exponential advances in technology, and the result is an increasing number of ways to amuse ourselves.", "As a result of such advances, Muslim react in a variety of manners towards entertainment. Some label entertainment as completely forbidden. This sometimes includes parents who say no to almost everything that their young ones deem to be ‘fun’, without providing them with suitable alternatives. Others, who do not want to take this extreme approach, fall into the trap of excessive use of – and even addiction to – various sources of entertainment, without any limits.", "In ", " Ismail Kamdar explores the teachings of Islam regarding entertainment. Drawing upon the Quran, the Sunnah and the understanding of the righteous scholars of Islam, he provides a detailed and balanced analysis of the topic. He not only explains the detriments of the current entertainment industry, but also suggests alternative means to have a good time with friends and family members."], "author": "Abu Muawiyah Ismail Kamdar", "num_pages": "109", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1376124.Rembulan_Tenggelam_Di_Wajahmu", "num_ratings": "7,675", "num_reviews": "748", "avg_ratings": 4.27, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature", "Romance"], "title": "Rembulan Tenggelam Di Wajahmu", "description": ["Tutup mata kita. Tutup pikiran kita dari carut- marut kehidupan. Mari berpikir takjim sejenak. Bayangkan saat ini ada satu malaikat bersayap indah datang kepada kita, lantas lembut berkata: Aku memberikan kau kesempatan hebat. Lima kesempatan untuk bertanya tentang rahasia kehidupan, dan aku akan menjawabnya langsung sekarang. Lima Pertanyaan. Lima jawaban. Apakah pertanya", "Tutup mata kita. Tutup pikiran kita dari carut- marut kehidupan. Mari berpikir takjim sejenak. Bayangkan saat ini ada satu malaikat bersayap indah datang kepada kita, lantas lembut berkata: Aku memberikan kau kesempatan hebat. Lima kesempatan untuk bertanya tentang rahasia kehidupan, dan aku akan menjawabnya langsung sekarang. Lima Pertanyaan. Lima jawaban. Apakah pertanyaan pertamamu? ", "Maka apakah kita akan bertanya: Apakah cinta itu? Apakah hidup ini adil? Apakah kaya adalah segalanya? Apakah kita memilki pilihan dalam hidup? Apakah makna kehilangan?", "Ray (tokoh utama dalam kisah ini), ternyata memiliki kecamuk pertanyaan sendiri. Lima pertanyaan sebelum akhirnya dia mengerti makna hidup dan kehidupannya.", "Siapkan energi Anda untuk memasuki dunia Fantasi Tere-Liye tentang perjalanan hidup. Di sini hanya ada satu rumus: semua urusan adalah sederhana. Maka mulailah membaca dengan menghela nafas lega"], "author": "Tere Liye", "awards": [], "places": [], "character_names": ["Ray", "Rehan", "Gigi Kelinci"], "language": "Indonesian", "publish_date": "2009-02-28 00:00:00", "ISBN": "9793858133"},
{"url": "https://www.goodreads.com/book/show/22095983-5-khalifah-kebanggaan-islam", "num_ratings": "55", "num_reviews": "2", "avg_ratings": 4.45, "genres": [], "title": "5 Khalifah Kebanggaan Islam", "description": ["Islam memiliki 5 khalifah (pemimpin) terbaik yang dibanggakan sejarah dari masa ke masa. Kehadiran mereka adalah untuk meneruskan kembali ajaran Nabi SAW. Mereka adalah Abu Bakar ash-Shiddiq, Umar bin Khattab, Utsman bin Affan, Ali bin Abi Thalib dan Umar bin Abdul Aziz. Mereka berlima adalah pelayan umat manusia sekaligus umat islam. Mereka berkorban demi kemajuan Islam t", "Islam memiliki 5 khalifah (pemimpin) terbaik yang dibanggakan sejarah dari masa ke masa. Kehadiran mereka adalah untuk meneruskan kembali ajaran Nabi SAW. Mereka adalah Abu Bakar ash-Shiddiq, Umar bin Khattab, Utsman bin Affan, Ali bin Abi Thalib dan Umar bin Abdul Aziz. Mereka berlima adalah pelayan umat manusia sekaligus umat islam. Mereka berkorban demi kemajuan Islam tanpa berharap materi apapun dari perjuangan mereka, karena bagi mereka balasan sebenarnya hanya dari sisi Allah di akhirat kelak.", "Buku \"Best of The Best\" ini tidak hanya mengupas lengkap biografi kehidupan mereka berlima, namun lebih dari itu mengupas dalam-dalam sisi-sisi kemanusiaan mereka yang agung. Yang takkan Anda temukan pada diri pemimpin-pemimpin lain selain mereka dari masa ke masa. Selamat Membaca..!!!!"], "author": "Khalid Muhammad Khalid", "num_pages": "394", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2011-04-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6962880-muhammad", "num_ratings": "8,153", "num_reviews": "354", "avg_ratings": 4.56, "genres": ["Religion", "Islam", "Religion", "Biography", "History", "Nonfiction"], "title": "Muhammad: Kisah Hidup Nabi Berdasarkan Sumber Klasik", "description": ["Muhammad betul-betul unik. Didasarkan pada sumber-sumber berbahasa Arab dari abad ke-8 dan ke-9, buku ini mendekati dan mereportase kata-kata dari orang-orang lelaki maupun perempuan yang mendengar langsung Nabi Muhammad berbicara dan menyaksikan sendiri peristiwa-peristiwa dalam hidupnya. ", "Martin Lings mampu menghadirkan kesederhanaan maupun keagungan cerita. Karena itu, M", "Muhammad betul-betul unik. Didasarkan pada sumber-sumber berbahasa Arab dari abad ke-8 dan ke-9, buku ini mendekati dan mereportase kata-kata dari orang-orang lelaki maupun perempuan yang mendengar langsung Nabi Muhammad berbicara dan menyaksikan sendiri peristiwa-peristiwa dalam hidupnya. ", "Martin Lings mampu menghadirkan kesederhanaan maupun keagungan cerita. Karena itu, Muhammad dapat dibaca dengan sama nikmatnya baik oleh mereka yang sudah akrab dengan biografi Nabi maupun para \"pendatang baru\" yang membacanya untuk pertama kali. ", "Buku ini terpilih sebagai biografi Nabi terbaik dalam bahasa Inggris pada konferensi Sirah Nasional di Islamabad tahun 1983. Sejak itu karya ini telah dipublikasikan dalam bahasa Prancis, Italia, Spanyol, Turki, Belanda, Tamil, Arab, Jerman, Urdu, dan sekarang, Indonesia. Pada 1990, setelah buku ini berhasil mencuri perhatian Universitas al-Azhar Kairo, penulisnya menerima bintang kehormatan dari Presiden Hosni Mubarak."], "author": "Martin Lings", "num_pages": "653", "awards": ["Siret Ödülü"], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2007-04-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20580511-mayor-maynott-have-devil-inside", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 3.0, "genres": [], "title": "Mayor Maynott Have Devil Inside", "description": ["Several interesting stories are portrayed as the importance in correct belief in Tawhid and the pillars of faith are discussed. The reality of jinn and the reason for their hatred against mankind is explored from the Quran and Sunnah.", "Complete ruqyah recipes (amal) are offered in a few different variations throughout the book, encouraging the reader to pray for their freedo", "Several interesting stories are portrayed as the importance in correct belief in Tawhid and the pillars of faith are discussed. The reality of jinn and the reason for their hatred against mankind is explored from the Quran and Sunnah.", "Complete ruqyah recipes (amal) are offered in a few different variations throughout the book, encouraging the reader to pray for their freedom from jinn possession and oppression.", "These treatments are based on Quran, Sunnah, and the works of many", "Islamic scholars. Some Islamic Sharah Ruqyah Books that have been referenced include: By: Ibn Taimyyah Diseases of the Hearts and their Cures By: Ibn Qayyim al-Jawziyyah Zad al-Ma'ad (Provision of the hereafter) By: Abu Ameenah Bilal Philips The Exorcist Tradition In Islam By: Ibn Baz The Authentic Creed and the Invalidators of Islam.", "The book provides Islamic guidance on the treatment of all such ailments including physical and psychological conditions.Only Quranic verses and Dua from Hadith that Islamic scholars have used are in the treatments of various diseases and spiritual ailments."], "author": "Halimah Bint David", "num_pages": "81", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8280739-the-book-of-major-sins", "num_ratings": "27", "num_reviews": "3", "avg_ratings": 4.59, "genres": ["Religion", "Islam"], "title": "The Book Of Major Sins", "description": ["Some of the major tribulations of human existence come about as a result of committing sins and spreading evil in the world. Islam recognizes that the human being is imperfect, fallible, and prone to committing sins. This is part of the human’s innately weak nature as a mortal creature, and Allah forgives all sins, if He wills. However, if we have the ability to find out w", "Some of the major tribulations of human existence come about as a result of committing sins and spreading evil in the world. Islam recognizes that the human being is imperfect, fallible, and prone to committing sins. This is part of the human’s innately weak nature as a mortal creature, and Allah forgives all sins, if He wills. However, if we have the ability to find out what the major sins are, and we have the knowledge and the wherewithal to avoid committing them, then we are held accountable. ", " is a useful handbook for every Muslim who wishes to please Allah and to avoid His wrath by learning what Allah has proscribed for him or her and making every effort to keep away from major sins."], "author": "Muhammad ibn Sulaymân at-Tamimi", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-01-01 00:00:00", "ISBN": "9960955044"},
{"url": "https://www.goodreads.com/book/show/66485.The_Crisis_of_Islam", "num_ratings": "2,606", "num_reviews": "231", "avg_ratings": 3.71, "genres": ["History", "Nonfiction", "Religion", "Religion", "Islam", "Politics", "War", "Terrorism"], "title": "The Crisis of Islam: Holy War and Unholy Terror", "description": ["In his first book since ", "Bernard Lewis examines the historical roots of the resentments that dominate the Islamic world today and that are increasingly being expressed in acts of terrorism. He looks at the theological origins of political Islam and takes us through the rise of militant Islam in Iran, Egypt, and Saudi Arabia, examining the impact of radical", "In his first book since ", "Bernard Lewis examines the historical roots of the resentments that dominate the Islamic world today and that are increasingly being expressed in acts of terrorism. He looks at the theological origins of political Islam and takes us through the rise of militant Islam in Iran, Egypt, and Saudi Arabia, examining the impact of radical Wahhabi proselytizing, and Saudi oil money, on the rest of the Islamic world. ", " ranges widely through thirteen centuries of history, but in particular it charts the key events of the twentieth century leading up to the violent confrontations of today: the creation of the state of Israel, the Cold War, the Iranian Revolution, the Soviet defeat in Afghanistan, the Gulf War, and the September 11th attacks on the United States.", "While hostility toward the West has a long and varied history in the lands of Islam, its current concentration on America is new. So too is the cult of the suicide bomber. Brilliantly disentangling the crosscurrents of Middle Eastern history from the rhetoric of its manipulators, Bernard Lewis helps us understand the reasons for the increasingly dogmatic rejection of modernity by many in the Muslim world in favor of a return to a sacred past. Based on his George Polk Award–winning article for ", ", ", "is essential reading for anyone who wants to know what Usama bin Ladin represents and why his murderous message resonates so widely in the Islamic world."], "author": "Bernard Lewis", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-03-02 00:00:00", "ISBN": "0812967852"},
{"url": "https://www.goodreads.com/book/show/6594963-if-i-should-speak", "num_ratings": "702", "num_reviews": "90", "avg_ratings": 4.13, "genres": ["Religion", "Islam", "Fiction", "Religion", "Novels"], "title": "If I Should Speak: Novel Catatan Nurani Mualaf Amerika", "description": ["\"Saya tak bisa berhenti membacanya sebelum selesai. Plot dan gaya penulisannya sungguh brilian!\" --Dr. Robert D. Crane, mantan penasihat presiden Amerika Serikat. ", "“Manusia memiliki sesuatu yang disebut fitrah. Fitrah ini menjamin kita bisa mengetahui kebenaran ketika ia datang. Dan apakah kebenaran itu? Itulah Islam.” ", "Pernyataan itu menohok hati Tamika. Benarkah dirinya me", "\"Saya tak bisa berhenti membacanya sebelum selesai. Plot dan gaya penulisannya sungguh brilian!\" --Dr. Robert D. Crane, mantan penasihat presiden Amerika Serikat. ", "“Manusia memiliki sesuatu yang disebut fitrah. Fitrah ini menjamin kita bisa mengetahui kebenaran ketika ia datang. Dan apakah kebenaran itu? Itulah Islam.” ", "Pernyataan itu menohok hati Tamika. Benarkah dirinya memiliki fitrah itu? Dan benarkah kebenaran yang selama ini ia cari adalah Islam? ", "Tamika Douglass, seorang mahasiswi Amerika yang cerdas dan berbakat seni, telah lama dihantui pertanyaan-pertanyaan tentang Tuhan sebagaimana yang diyakini agamanya. Ibu dan sahabat-sahabatnya memberitahunya untuk tidak banyak mempertanyakan Tuhan, agama tidak perlu masuk akal dan ia harus percaya saja. Namun, Tamika tak bisa mengingkari kata hatinya. ", "Persahabatan dengan dua sahabat Muslim, Aminah dan Durrah “Dee” Gonzalez, membuka jalan baginya untuk mengenal Islam. Tamika merasa ajaran-ajaran Islam bisa menjawab pertanyaan-pertanyaannya. Mungkinkah yang berbicara itu adalah fitrahnya? Namun, apakah Islam yang selama ini ia cari? Beranikah ia mengambil langkah berani menjadi Muslim? Bukankah Islam adalah agama yang menindas perempuan, agama bangsa-bangsa tertinggal di dunia? ", "Inilah sebuah novel pencarian spiritual yang mendapat sambutan luar biasa di berbagai negara dan dianggap membawa pembaruan pada genre novel spiritual. Dikaji di kelas-kelas dan klub-klub buku, telah banyak pembaca mengakui pengaruh novel ini pada hidup mereka. ", "Penggambaran realitas dalam novel ini sangat meyakinkan. -- Ayesta Chung, The American Muslim Magazine. ", "Novel ini layak menjadi bahan kajian akademis yang serius. --Prof. K. Bryant, Howard University."], "author": "Umm Zakiyyah", "num_pages": "380", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2009-06-16 00:00:00", "ISBN": "6028236411"},
{"url": "https://www.goodreads.com/book/show/19003623-bedside-techniques-methods-of-clinical-xamination", "num_ratings": "183", "num_reviews": "13", "avg_ratings": 4.0, "genres": ["Health", "Medicine", "Medical"], "title": "Bedside Techniques Methods of Clinical xamination", "description": ["A book for medical students and doctors."], "author": "Muhammad Inayatullah", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-16 00:00:00", "ISBN": "9789694949"},
{"url": "https://www.goodreads.com/book/show/25832452-islamic-poems", "num_ratings": "13", "num_reviews": "0", "avg_ratings": 4.46, "genres": ["Religion", "Poetry", "Love", "Religion", "Islam"], "title": "Islamic Poems: Nourishment for the Soul.", "description": ["The greatest gift a person could receive is the belief in Allah (God); because it is only through His Rope (Al-Habl) and His Light (Al-Nur); one will find the strength to survive through one's darkest days and nights. My only hope for this book is that it may provide some Nourishment for your Soul (Ruh) and Inspiration for your Faith (Iman), through the beauty of Islam - t", "The greatest gift a person could receive is the belief in Allah (God); because it is only through His Rope (Al-Habl) and His Light (Al-Nur); one will find the strength to survive through one's darkest days and nights. My only hope for this book is that it may provide some Nourishment for your Soul (Ruh) and Inspiration for your Faith (Iman), through the beauty of Islam - the Religion of Love."], "author": "K.A. Hosein", "num_pages": "76", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-26 00:00:00", "ISBN": "1514657821"},
{"url": "https://www.goodreads.com/book/show/25686850-best-of-creation", "num_ratings": "17", "num_reviews": "2", "avg_ratings": 4.24, "genres": ["Religion", "Islam"], "title": "Best Of Creation: An Islamic Guide to Self-Confidence", "description": ["Get the eBook here: ", "A long time ago, the world's most powerful empire was the Muslim empire. It was a nation full of scholars, doctors, scientists, ethical businessmen, and genius inventors. The early Muslim nation was founded by confident individuals, who trusted the Divine plan, using their God-given talents to make this world a be", "Get the eBook here: ", "A long time ago, the world's most powerful empire was the Muslim empire. It was a nation full of scholars, doctors, scientists, ethical businessmen, and genius inventors. The early Muslim nation was founded by confident individuals, who trusted the Divine plan, using their God-given talents to make this world a better place. But somewhere down the line, things changed. The Muslim Nation declined until it became a shell of its former self. And then it broke into many fragmented pieces. This was followed by a generation of followers and imitators, low in confidence and self-esteem, feeling inferior to others, following and never daring to lead. The Muslim nation lost its confidence, but we can get it back by returning to our roots and going back to that which made the early generations so successful.", "Available here: "], "author": "Abu Muawiyah Ismail Kamdar", "num_pages": "198", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-01 00:00:00", "ISBN": "1482807149"},
{"url": "https://www.goodreads.com/book/show/20635142-enjoy-your-life", "num_ratings": "12,399", "num_reviews": "1,136", "avg_ratings": 4.19, "genres": ["Religion", "Religion", "Islam"], "title": "Enjoy Your Life: The Art of Interpersonal Relations as Exemplified in the Prophet's Biography", "description": ["This is an exquisite collection of incidents from the life of the Prophet صلی الله علیه وآله وسلم, stories from our Islamic Heritage, and thought-provoking anecdotes from the life of the author. The aim of the book is to train the reader to enjoy living his life by practicing various self-development and inter-personal skills. What is so compelling and inspiring about this", "This is an exquisite collection of incidents from the life of the Prophet صلی الله علیه وآله وسلم, stories from our Islamic Heritage, and thought-provoking anecdotes from the life of the author. The aim of the book is to train the reader to enjoy living his life by practicing various self-development and inter-personal skills. What is so compelling and inspiring about this book is that, in order to highlight the benefit of using social skills, the author draws from the lives of the Prophet صلی الله علیه وآله وسلم and his Companions.", "This book is both a practical systematic guide to self-improvement and a treasure trove of historical incidents. It increases self-awareness, whilst nurturing the soul and strengthening the spirit.", "The book's author is a prominent figure in the field of Islamic Da'wah and has authored more than twenty published works - Dr. Muhammad Adb Al-Rahman Al-Arifi."], "author": "محمد عبد الرحمن العريفي", "num_pages": "391", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22467006-sand", "num_ratings": "21", "num_reviews": "13", "avg_ratings": 4.52, "genres": [], "title": "Sand", "description": ["Sand", "Originally published as \"Sandstorm\" in The Riyadh Daily in 1987-8 as a serialized novel, this frightening novel is an eclectic work combining surreal events and naturalistic description. Heavily censored by Saudi officials when it first appeared, it is here published uncensored in its original form for the first time.", "A neo-Gothic novel written in the tradition of the m", "Sand", "Originally published as \"Sandstorm\" in The Riyadh Daily in 1987-8 as a serialized novel, this frightening novel is an eclectic work combining surreal events and naturalistic description. Heavily censored by Saudi officials when it first appeared, it is here published uncensored in its original form for the first time.", "A neo-Gothic novel written in the tradition of the modern Arabesque and psychological Grotesque genres, \"Sand\" is a direct appeal to the reader's ethical judgment.", "A possible threat to the wife of an American oil magnate brings an incognito investigator from the Institute for the Promotion of Virtue and Prevention of Vice to the InterHo hotel. At the Institute, he is secretly involved with a jihadist brotherhood that includes Osama bin Laden. At the same time, “the Author” observes and comments on the story as a character at the hotel. Sand is a snapshot album of Riyadh in the late 1980s."], "author": "Paul  Majkut", "num_pages": "470", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20872202-semulia-akhlak-nabi", "num_ratings": "12", "num_reviews": "1", "avg_ratings": 4.42, "genres": [], "title": "Semulia Akhlak Nabi", "author": "Amru Khalid", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2002-08-16 00:00:00", "ISBN": "9793653175"},
{"url": "https://www.goodreads.com/book/show/439920.PROPHET_OF_DOOM", "num_ratings": "15", "num_reviews": "4", "avg_ratings": 4.07, "genres": ["Religion", "Islam"], "title": "PROPHET OF DOOM: ISLAM'S TERRORIST DOGMA IN MUHAMMAD'S OWN WORDS", "description": ["Islam is a caustic blend of regurgitated paganism and twisted Bible stories. Muhammad, its lone prophet, conceived his religion solely to satiate his lust for power, sex, and money. He was a terrorist. And if you think these conclusions are shocking, wait until you see the evidence."], "author": "Craig Winn", "num_pages": "702", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-25 00:00:00", "ISBN": "0971448124"},
{"url": "https://www.goodreads.com/book/show/20580082-a-series-of-very-unfortunate-monsters-oh-the-places-they-ll-go", "num_ratings": "8", "num_reviews": "1", "avg_ratings": 3.5, "genres": [], "title": "A Series of Very Unfortunate Monsters; Oh The Places They'll Go", "description": ["General Farts-A-Lot and his son Maynard Omelet have travelled out of their world for the first time. Will they succeed with their plans to make humans love them, more than Allah?"], "author": "Halimah Bint David", "num_pages": "53", "awards": [], "places": ["Other Editions (1)", "\n", "All Editions"], "character_names": [], "language": "English", "publish_date": "2013-12-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12747214-hayy-bin-yaqdzon", "num_ratings": "2,777", "num_reviews": "510", "avg_ratings": 3.79, "genres": ["Philosophy", "Fiction", "Novels", "Literature"], "title": "Hayy bin Yaqdzon: Manusia dalam Asuhan Rusa", "description": ["Seorang anak ditinggalkan sendirian di suatu pulau. Seekor rusa menemukan anak itu, merawat dan membesarkan - menggantikan anaknya yang hilang. Bersejajar dengan usianya yang esmakin dewasa, timbul keinginannya yang luar biasa untuk mengetahui dan menyelidiki suatu yang tidak dimengertinya. Dari sinilah pencarian kebenaran sang anak terus berlangsung. Sampai akhirnya rusa", "Seorang anak ditinggalkan sendirian di suatu pulau. Seekor rusa menemukan anak itu, merawat dan membesarkan - menggantikan anaknya yang hilang. Bersejajar dengan usianya yang esmakin dewasa, timbul keinginannya yang luar biasa untuk mengetahui dan menyelidiki suatu yang tidak dimengertinya. Dari sinilah pencarian kebenaran sang anak terus berlangsung. Sampai akhirnya rusa yang merawatnya mati. Sanggupkah ia melanjutkan hidup setelah rusa itu tiada?", "Novel ini menyuguhkan intisari kehidupan manusia. Sebagai bagian dari alam semesta, manusia terus menerus mencari hakikat hidupnya hingga kebenaran yang tak tergoyahkan bisa didapatkan.", "Novel karya Ibn tufail ini telah diterjemahkan ke dalam berbagai bahasa seperti bahasa Latin, Yahudi, Inggris, Belanda, Spanyol, Jerman, Perancis, dan Rusia. sebagai novel filosofis, novel ini telah menggoncangkan dunia Barat pada Abad Pertengahan. Pemikir Ibn Ibn Tufail pun kemudian banyak dioper oleh filsuf-filsuf Barat. Oleh kerana itu, di tengah dunia yang tengah gegar ini, karya klasik Ibn Tufail ini sangat layak untuk dibaca."], "author": "Ibn Tufayl", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2010-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17044976-the-dhikr-of-authenticity", "num_ratings": "5", "num_reviews": "0", "avg_ratings": 3.2, "genres": ["Philosophy"], "title": "The Dhikr of Authenticity: A Treatise from the Next Wave; Black American Muslims at the Intersection of Destiny and Opportunity", "description": ["The Dhikr of Authenticity is a Treatise from The Next Wave; Black American Muslims at the Intersection of Destiny and Opportunity. Using the Holy Qur?an, Sunnah of the Prophet Muhammad (PBUH), personal experiences and inspiration from notable figures from Black history such as W.E.B. DuBois, Booker T. Washington, Harriet Tubman, Frederick Douglas, Malcolm X and Martin Luth", "The Dhikr of Authenticity is a Treatise from The Next Wave; Black American Muslims at the Intersection of Destiny and Opportunity. Using the Holy Qur?an, Sunnah of the Prophet Muhammad (PBUH), personal experiences and inspiration from notable figures from Black history such as W.E.B. DuBois, Booker T. Washington, Harriet Tubman, Frederick Douglas, Malcolm X and Martin Luther King Jr., Dawud Abdur-Rahman makes the case that in the continued conversation on the next step of Black American Muslim development, there will emerge a Next Wave of Black American Muslims that with love, faith, humility and certainty will affirm that they stand at an intersection of destiny and opportunity as they influence the conversation around the development of Al-Islam first in the Black American community and then in the larger Muslim community."], "author": "Dawud Abdur-Rahman", "num_pages": "142", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2012-10-31 00:00:00", "ISBN": "1480103683"},
{"url": "https://www.goodreads.com/book/show/520206.Shamail_Tirmidhi", "num_ratings": "494", "num_reviews": "59", "avg_ratings": 4.58, "genres": ["Religion", "Islam", "Religion", "Biography"], "title": "Shamail Tirmidhi", "description": ["كتاب من أجمع الكتب ف شمائل النبي محمد صلى الله عليه وسلمن بوبه الإمام الترمذي على 56 بابًا، وذكر فيه زهاء أربعمائة حديث لم يتكرر منها إلا القليل جدًا، أحاديث معدودات."], "author": "Muhammad al-Tirmidhi", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1994-08-28 00:00:00", "ISBN": "0933511531"},
{"url": "https://www.goodreads.com/book/show/188290.Al_Ghazali_on_the_Ninety_nine_Beautiful_Names_of_God", "num_ratings": "296", "num_reviews": "21", "avg_ratings": 4.48, "genres": ["Religion", "Islam", "Religion", "Nonfiction"], "title": "Al-Ghazali on the Ninety-nine Beautiful Names of God", "description": ["In this work, here presented in a complete English edition for the first time, the problem of knowing God is confronted in an original and stimulating way. Taking up the Prophet's teaching that 'Ninety-nine Beautiful Names' are truly predicated of God, the author explores the meaning and resonance of each of these divine names, and reveals the functions they perform both i", "In this work, here presented in a complete English edition for the first time, the problem of knowing God is confronted in an original and stimulating way. Taking up the Prophet's teaching that 'Ninety-nine Beautiful Names' are truly predicated of God, the author explores the meaning and resonance of each of these divine names, and reveals the functions they perform both in the cosmos and in the soul of the spiritual adept. Although some of the book is rigorously analytical, the author never fails to attract the reader with his profound mystical and ethical insights, which, conveyed in his sincere and straightforward idiom, have made of this book one of the perennial classics of Muslim thought, popular among Muslims to this day."], "author": "Abu Hamid al-Ghazali", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-12-01 00:00:00", "ISBN": "0946621314"},
{"url": "https://www.goodreads.com/book/show/2795660-60-sirah-sahabat-rasulullah-saw", "num_ratings": "824", "num_reviews": "58", "avg_ratings": 4.45, "genres": ["Religion", "Islam"], "title": "60 Sirah Sahabat Rasulullah SAW", "description": ["Sepasang sejarah manusia,kesetian,kejujuran dan kesungguhan dalam mencapai tujuan hidup yang tinggi dan luhur belum pernah dapat disaksikan kembali sebagaimana yang telah diabadikan oleh sejarah Islam dan tokoh-tokohnya pada kurun waktu yang lalu.Siapa pun yang menelurusi jejak perjalanan hidup para sahabat akan melihat sosok-sosok manusia dengan prestasi luar biasa.Manusi", "Sepasang sejarah manusia,kesetian,kejujuran dan kesungguhan dalam mencapai tujuan hidup yang tinggi dan luhur belum pernah dapat disaksikan kembali sebagaimana yang telah diabadikan oleh sejarah Islam dan tokoh-tokohnya pada kurun waktu yang lalu.Siapa pun yang menelurusi jejak perjalanan hidup para sahabat akan melihat sosok-sosok manusia dengan prestasi luar biasa.Manusia yang mampu membangkitkan semangat juang dijalan Allah dan menyempurnakan kesabaran mempertahankan keislaman mereka saat ujian dan fitnah mendera bertubi-tubi.Kepribadian mereka yang agung dapat menghidupkan hati setiap orang yang membaca kisah mereka.Tidak ada satu pun di antara mereka, kecuali telah melukiskan sejarah keharuman pribadi-pribadi yang mesti dijadikan teladan.", "Kisah yang terdapat dalam buku ini bukan kisah fiktif.Kisah ini adalah nyata,dilukiskan dan diabadikan oleh tinta emas sejarah tentang sekelompok manusia agung yang berusaha mencapai kesempurnaannya.Manusia-manusia yang telah lahir di dunia akidah dan keimanan. Manusia-manusia yang telah menunjukkan keistimewaan mereka sebagai generasi pertama umat islam."], "author": "Khalid Muhammad Khalid", "num_pages": "488", "awards": [], "places": ["Indonesia"], "character_names": ["Islam Books"], "language": "Indonesian", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3426706-the-jewel-of-medina", "num_ratings": "1,400", "num_reviews": "206", "avg_ratings": 3.53, "genres": ["Historical", "Historical Fiction", "Fiction", "Religion", "Historical"], "title": "The Jewel of Medina", "description": ["A'isha bint Abi Bakr is the daughter of a rich merchant from Mecca in the harsh, exotic world of seventh-century Arabia at the time of the foundation of Islam. When she is married to the Prophet Muhammad at the age of nine, she must rely on her wits, her courage, and even her sword in a struggle to control her own destiny and carve out a place for herself in the community,", "A'isha bint Abi Bakr is the daughter of a rich merchant from Mecca in the harsh, exotic world of seventh-century Arabia at the time of the foundation of Islam. When she is married to the Prophet Muhammad at the age of nine, she must rely on her wits, her courage, and even her sword in a struggle to control her own destiny and carve out a place for herself in the community, fighting religious persecution, jealous sister-wives, political rivals, and her own temptations. As she grows to love her kind, generous husband, her ingenuity and devotion make her an indispensable advisor to Muhammad. Ultimately, she becomes one of the most important women in Islam, and a fierce protector of her husband's words and legacy.Extensively researched, The Jewel of Medina evokes the beauty and harsh realities of life in an age long past. At once a love story, a history lesson, and a coming-of-age tale, it introduces readers to the turmoil that surrounded the birth of the Islamic faith through the eyes of an unforgettable heroine."], "author": "Sherry Jones", "num_pages": "358", "awards": [], "places": ["Medina", "Saudi Arabia", "Mecca"], "character_names": ["Muhammad", "A'isha bint Abi Bakr"], "language": "English", "publish_date": "2008-10-06 00:00:00", "ISBN": "0825305187"},
{"url": "https://www.goodreads.com/book/show/1572434.Fiqih_Puasa", "num_ratings": "141", "num_reviews": "12", "avg_ratings": 4.04, "genres": ["Religion", "Islam"], "title": "Fiqih Puasa", "description": ["Karena terlambat bangun, di suatu dini hari bulan Ramadhan, Anda tergesa-gesa mengambil santap sahur. Namun begitu hendak memasukkan suap pertama ke mulut, tiba-tiba mushala dekat rumah Anda mengumandangkan adzan subuh. Anda lalu dengan sangat terpaksa membatalkan makan sahur, dan membayangkan betapa puasa hari ini menjadi terasa lebih berat dari kemarin. ", "Hanya saja, ketik", "Karena terlambat bangun, di suatu dini hari bulan Ramadhan, Anda tergesa-gesa mengambil santap sahur. Namun begitu hendak memasukkan suap pertama ke mulut, tiba-tiba mushala dekat rumah Anda mengumandangkan adzan subuh. Anda lalu dengan sangat terpaksa membatalkan makan sahur, dan membayangkan betapa puasa hari ini menjadi terasa lebih berat dari kemarin. ", "Hanya saja, ketika adzan di tempat Anda sudah selesai, ada mushala lain yang baru memulai mengumandangkan adzan. Anda jadi berpikir, seandainya mushala yang jauh itu yang menjadi pedoman, niscaya bisa menyantap sahur secukupnya, dan puasa hari ini akan terasa lebih ringan. Bayangkan bahwa kasus ini terjadi –dan ini sering benar-benar terjadi- dan itu jelas merugikan Anda, manakah yang keliru; mushala pertama, mushala kedua, jadwal yang tidak jelas, jarum jam yang berbeda-beda, ataukah jangan-jangan sikap Anda sendiri?", "Bagaimana mensikapi dan memahami kejadian seperti ini? Apakah Anda memang harus berhenti begitu mendengar adzan padahal belum sesuap pun makanan masuk ke perut, hingga seteguk air pun haram untuk Anda minum? Buku ini hadir, selain berbicara tentang hakikat puasa dan berbagai persoalan hukum di seputarnya, membahas tentang beberapa tradisi pengamalan ibadah puasa di tengah masyarakat. Karena buku ini ditulis sebagai buku rujukan hukum, masalah ini pun –di samping masalah yang lain- dikritisi dengan panduan dalil yang ketat; apa kata Quran, apa kata hadits Nabi, dan bagaimana praktek Rasulullah beserta para sahabatnya menjalankan ibadah puasa. Semua dikupas secara tuntas.", "Buku ini sangat bermanfaat dan perlu dikaji secara mendalam karena memberikan panduan yang jelas, tegas, dan argumentatif tentang puasa dan hal-hal lain yang menyertainya. Dengan sentuhan ilmiah khas Dr. Yusuf Qardhawi, penulis buku ini, buku Fiqih Puasa ini terasa ringan dan enak dibaca."], "author": "Yusuf Al-Qaradawi", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2006-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7747794-risalah-menuju-jannah", "num_ratings": "5", "num_reviews": "1", "avg_ratings": 4.8, "genres": ["Asian Literature", "Indonesian Literature", "Inspirational", "Religion", "Islam"], "title": "Risalah Menuju Jannah", "description": ["Hakikat hidup manusia adalah kesadaran menuju Tuhan. Dalam zaman yang bergerak begitu cepat, terlalu bising, dan riuh, kesadaran semacam itu silap. Terselip dalam berbagai lipatan keriuhan hidup. Terselip dalam tumpukkan pekerjaan. Terlipat dalam lekukan masalah keduniaan yang fana. Tertutup oleh kamuflase keindahan sementara yang terus berjejal memenuhi kepala.", "Perjalanan", "Hakikat hidup manusia adalah kesadaran menuju Tuhan. Dalam zaman yang bergerak begitu cepat, terlalu bising, dan riuh, kesadaran semacam itu silap. Terselip dalam berbagai lipatan keriuhan hidup. Terselip dalam tumpukkan pekerjaan. Terlipat dalam lekukan masalah keduniaan yang fana. Tertutup oleh kamuflase keindahan sementara yang terus berjejal memenuhi kepala.", "Perjalanan menuju hakikat, menjadi perjalanan sepi. Karena di jalan ini, seseorang harus melangkah dengan penuh ketundukan dan kepasrahan akan takdir dirinya. Sensitifitas rasa syukur akan karunia Allah yang melimpah-ruahi diri, dipertanggungjawabkan detail. Maka, hanya hamba terpilih menempuh jalan ini. Saat yang lain, memilih berjalan mendongak dengan dada membusung.", "Sebuah rangkaian perenungan yang menggetarkan keimanan. Wawasan dan daya tutur penulisnya mampu membawa kembali juga mengantarkan pembaca, pada sebuah kesadaran hakiki. Betapa tak mudahnya perjalanan mencapai jannah.", "\"Ada beberapa artikel dalam buku ini yang tak sangup saya selesaikan. Karena membacanya, saya merasa seperti ditelanjangi dan ditampar-tampar. Risalah Menuju Jannah, adalah catatan Ustad Ihsan Tandjung yang mengingatkan kita pada misi besar penciptaan.\" (Herry Nurdi, Pemred Sabili)"], "author": "M. Ihsan Tandjung", "num_pages": "350", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2009-07-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1456628.Ketika_Cinta_Bertasbih", "num_ratings": "6,280", "num_reviews": "481", "avg_ratings": 3.69, "genres": ["Novels", "Fiction", "Romance", "Asian Literature", "Indonesian Literature", "Religion", "Islam"], "title": "Ketika Cinta Bertasbih", "description": ["Entah kenapa tiba-tiba ia merasa berdosa. Ia merasa berdosa dan jijik pada dirinya sendiri yang begitu rapuh, mudah terperdaya oleh tampilan luar yang menipu. Ia jijik pada dirinya sendiri yang ia rasa terlalu cair pada lawan jenis yang belum halal baginya. Ia hairan sendiri kenapa jati dirinya seolah pudar saat berhadapan atau berdekatan dengan Eliana. Apakah telah sedemi", "Entah kenapa tiba-tiba ia merasa berdosa. Ia merasa berdosa dan jijik pada dirinya sendiri yang begitu rapuh, mudah terperdaya oleh tampilan luar yang menipu. Ia jijik pada dirinya sendiri yang ia rasa terlalu cair pada lawan jenis yang belum halal baginya. Ia hairan sendiri kenapa jati dirinya seolah pudar saat berhadapan atau berdekatan dengan Eliana. Apakah telah sedemikian lemah imannya sehingga kecantikan jasadi telah sedemikian mudah menyihir dirinya. la beristighfar dalam hatinya. Berkali-kali ia meminta ampun pada Dzat yang menguasai hatinya.", "Azzam meratapi kekhilafannya dan memarahi dirinya sendiri. Dalam hati ia bersumpah akan lebih menjaga diri, dan hal yang menistakan seperti itu tidak boleh terjadi lagi. la juga bersumpah untuk segera menemukan orang yang tidak kalah hebatnya dengan Eliana, tapi bertudung litup, solehah, boleh berbahasa Arab dan berbahasa Inggeris dengan fasih. Kalau terpaksa gadis itu orang Mesir tidak mengapa. Yang jelas rasa terhinanya harus ia simakan.", "la harus menemukan kembali kehormatannya sebagai seorang Azzam yang memiliki harga diri. Meskipun masyarakat Indonesia di Mesir mengenalinya hanya sebagai tukang masak atau penjual tempe, tapi harga diri dan kesucian diri tidak boleh diremehkan oleh siapapun juga. la yakin akan memperolehi isteri yang lebih jelita dari Eliana, dan lebih balk darinya. Ia yakin itu tekadnya. Ia ulang-ulang tekad itu dalam hatinya. Ia rajut dengan doa. Ia bawa tekad itu ke dalam tidurnya. Ke dalam mimpinya. Dan ke dalam alam bawah sedarnya."], "author": "Habiburrahman El-Shirazy", "num_pages": "477", "awards": [], "places": ["Egypt"], "character_names": ["Khairul Azzam", "Eliana", "Furqan", "Anna Althafunnisa"], "language": "Indonesian", "publish_date": "2007-08-16 00:00:00", "ISBN": "9789793210"},
{"url": "https://www.goodreads.com/book/show/2267679.Ketika_Cinta_Bertasbih", "num_ratings": "5,203", "num_reviews": "294", "avg_ratings": 3.72, "genres": ["Novels", "Fiction", "Romance", "Asian Literature", "Indonesian Literature", "Religion", "Islam"], "title": "Ketika Cinta Bertasbih: Episode 2", "author": "Habiburrahman El-Shirazy", "num_pages": "412", "awards": [], "places": ["Indonesia"], "character_names": [], "language": "Indonesian", "publish_date": "2007-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16005373-rinai", "num_ratings": "82", "num_reviews": "26", "avg_ratings": 4.02, "genres": ["Novels"], "title": "Rinai", "description": ["Ia menolehkan kepala ke arah mereka yang duduk diam. Menjelaskan secara runut peristiwa penyerangan Israel yang selalu dilakukan tiba-tiba, menyebabkan sebagian warga Palestina eksodus atau tewas.", "Rinai tak begitu memperhatikan struktur kalimat. Mengamati kedip mata berikut perubahan raut muka, jauh lebih menegangkan, memberi informasi. Wajah Montaser tetap ramah, penjelasa", "Ia menolehkan kepala ke arah mereka yang duduk diam. Menjelaskan secara runut peristiwa penyerangan Israel yang selalu dilakukan tiba-tiba, menyebabkan sebagian warga Palestina eksodus atau tewas.", "Rinai tak begitu memperhatikan struktur kalimat. Mengamati kedip mata berikut perubahan raut muka, jauh lebih menegangkan, memberi informasi. Wajah Montaser tetap ramah, penjelasannya tenang. Rinai mengumpulkan warna-warni yang dikenalnya untuk menjelaskan retina Montaser. Hitam jelaga, coklat tanah, karamel, biru Laut Mediterrania. Terkesiap tiba-tiba. Apa ia melihat sekilas percik api di matanya? ", "Aaah, lelaki pemilik sepasang mata bersayap bagai Toyor al Jannah itu membuat dunia ini seakan berhenti berputar. Matahari mengalami musim salju, angin berayun berirama. Rinai menggigit bibir dalam-dalam, mencoba menenangkan diri. Superego berusaha memandu agar tak satupun tindakan bodoh dilakukan. Pemuda Gaza ini memberinya rasa menggigil, serupa ia terpaksa melaju kencang di atas sepeda motor, menembus derasnya hujan.", "Sebuah novel menggugah jiwa tentang bagaimana perjalanan sebuah tim relawan menembus Gaza Palestina. Tentang intrik-intrik di internal tim relawan, rahasia anak-anak dan warga Gaza, juga tentang bunga-bunga cinta yang tumbuh mekar. Cinta yang tak harus memiliki, tapi terus harum mewangi.", "Novel di tangan Sinta Yudisia tidak sekadar rekaan cerita, tetapi juga alat negosiasi efektif bagi peradaban tandingan atas peradaban yang ada. Melalui konflik kontekstual Palestina, kali ini Sinta mengahdirkan upaya negosiasinya dalam setiap lapis struktur cerita….Selamat dan salut atas energi dan upaya yang terus menyala.", "(Irfan Hidayatullahi – Dosen Sastra Unpad, penulis Sang Pemusar Gelombang)", "Kami sangat merindukanmu dan terus mengingat Anda; mengingatkan Anda untuk mengunjungi kami di Gaza Palestina.", "Selamat atas upaya dalam penyusunan buku ini.", "Kami akan bekerja sama dengan Anda, insya Allah, saya akan mengirim link untuk buku ini ke Menteri dan budaya Palestina, Muhammad Madhoun.", "Dan kita akan tetap berhubungan.", "(Mrs. Ittimad et Tharshawi – Ministry of Women Affairs, Gaza - Palestina)", "“RINAI bukan hanya menjadi bukti kepiawaian Sinta meramu- leburkan solidaritas global ke dalam konflik ideologi dan bersenyawa, tapi juga menawarkan sudut pandang yang seksi : metamorfosa seseorang ke arah kebaikan – menemukan jati diri, memahami nasionalisme, dan spiritualitas sosial—justru tidak berproses dalam kepompong yang bernama Tanah Air, namun terjadi di tanah para anbiya sana : Palestina!”", "(Benny Arnas – Sastrawan Muda, penulis Jatuh dari Cinta)"], "author": "Sinta Yudisia", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2012-09-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2801592-saksikan-bahwa-aku-seorang-muslim", "num_ratings": "1,554", "num_reviews": "114", "avg_ratings": 4.25, "genres": ["Religion", "Islam", "Religion"], "title": "Saksikan Bahwa Aku Seorang Muslim", "description": ["Menjadi muslim adalah menjadi kain putih. Lalu Allah mencelupnya menjadi warna ketegasan, kesejukan, keceriaan, dan cinta; rahmat bagi semesta alam. Aku jadi rindu pada pelangi itu, pelangi yang memancarkan celupan warna Ilahi. Telah tiba saatnya, derai berkilau Islam tak lagi terpisahkan dari pendar menawan seorang muslim."], "author": "Salim Akhukum Fillah", "num_pages": "392", "awards": [], "places": ["Indonesia"], "character_names": [], "language": "Indonesian", "publish_date": "2007-08-16 00:00:00", "ISBN": "9791061033"},
{"url": "https://www.goodreads.com/book/show/3933045-serial-cinta", "num_ratings": "382", "num_reviews": "32", "avg_ratings": 4.2, "genres": ["Religion", "Love", "Religion", "Islam", "Asian Literature", "Indonesian Literature"], "title": "Serial Cinta", "description": ["Seperti angin membadai. Kau tak melihatnya. Kau merasakannya. Merasakan kerjanya saat ia memindahkan gunung pasir di tengah gurun. Atau merangsang amuk gelombang di laut lepas. Atau meluluhlantakkan bangunan-bangunan angkuh di pusat kota metropolitan. Begitulah cinta. Ia ditakdirkan jadi kata tanpa benda. Tak terlihat. Hanya terasa. Tapi dahsyat.", "Seperti banjir menderas. Ka", "Seperti angin membadai. Kau tak melihatnya. Kau merasakannya. Merasakan kerjanya saat ia memindahkan gunung pasir di tengah gurun. Atau merangsang amuk gelombang di laut lepas. Atau meluluhlantakkan bangunan-bangunan angkuh di pusat kota metropolitan. Begitulah cinta. Ia ditakdirkan jadi kata tanpa benda. Tak terlihat. Hanya terasa. Tapi dahsyat.", "Seperti banjir menderas. Kau tak kuasa mencegahnya. Kau hanya bisa ternganga ketika ia meluapi sungai-sungai, menjamah seluruh permukaan bumi, menyeret semua benda angkuh yang bertahan di hadapannya. Dalam sekejap ia menguasai bumi dan merengkuhnya dalam kelembutannya. Setelah itu ia kembali tenanng. Demikianlah cinta. Ia ditakdirkan jadi makna paling santun yang menyimpan kekuatan besar.", "Seperti api menyala-nyala. Kau tak kuat melawannya. Kau hanya bisa menari di sekitarnya saat ia mengunnggun. Atau berteduh saat matahari membakar kulit bumi. Atau meraung saat lidahnya melahap rumah-rumah, kota-kota, hutan-hutan. Dan seketika semua jadi abu. Semua jadi tiada. Seperti itulah cinta.", "Bukun ini memuat kumpulan tulisan Anis Matta pada rubrik serial cinta yang pernah dimuat di majalah Tarbawi."], "author": "Muhammad Anis Matta", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2008-07-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15980925-sang-pemusar-gelombang", "num_ratings": "50", "num_reviews": "17", "avg_ratings": 3.56, "genres": [], "title": "Sang Pemusar Gelombang", "description": ["\"Akulah petualangan yang mencari kebenaran. Akulah manusia yang mencari makna dan hakikat kemanusiannya di tengah manusia. Akulah patriot yang berjuang menegakkan kehormatan, kebebasan, ketenangan, dan kehidupan yang baik bagi tanah air di bawah naungan Islam yang hanif.\" (Hasan Al-Banna)", "Sosok dan teladan Syaikh Hasan Al-Banna telah menciptakan pusaran gelombang pemikiran", "\"Akulah petualangan yang mencari kebenaran. Akulah manusia yang mencari makna dan hakikat kemanusiannya di tengah manusia. Akulah patriot yang berjuang menegakkan kehormatan, kebebasan, ketenangan, dan kehidupan yang baik bagi tanah air di bawah naungan Islam yang hanif.\" (Hasan Al-Banna)", "Sosok dan teladan Syaikh Hasan Al-Banna telah menciptakan pusaran gelombang pemikiran dan perubahan yang mampu menginspirasi generasi demi generasi. Pusaran gelombang itu pula yang memengaruhi tokoh-tokoh utama dalam novel ini: Hasan si pemuda yang gegar identitas; Randy si aktivis dakwah militan; dan Cikal, seleb superstar yang terjebak dalam kubangan hedonisme. Di tengah romantika hidup mereka masing-masing, figur sang teladan dan pemikiran-pemikirannya menjadi jalan cahaya sekaligus mempertemukan mereka.", "Dilatari intrik multidimensi yang dibumbui konspirasi, pergolakan batin, hingga asmara, novel ini akan membawa Anda pada gelombang perubahan yang dipusarkan oleh sosok Imam Syahid, Hasan Al-Banna.", "\"Tepat sekali kehadiran novel ini di tengah manusia negeri ini yang sedang galau. Lewat novel ini, Irfan mengajak kita untuk bekerja menghadapi realitas, bukan mengeluh dan melarikan diri darinya.\"", "- H. M. Anis Matta, Lc"], "author": "Muhammad Irfan Hidayatullah", "num_pages": "500", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2012-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2019487.Kumpulan_Risalah_Dakwah_Jilid_1", "num_ratings": "63", "num_reviews": "6", "avg_ratings": 4.33, "genres": ["Religion", "History"], "title": "Kumpulan Risalah Dakwah Jilid 1", "description": ["Majmu'atur Rasail adalah karya monumental Imam Hasan Al-Banna yang menjadi rujukan penting bagi pergerakan Ikhwanul Muslimin. Dan, Ikhwanul Muslimin adalah pergerakan yang memberikan inspirasi bagi kebangkitan kaum muslimin di berbagai negara. Karena itu para aktivis Islam perlu mengkajinya, agar mendapatkan gambaran dan contoh konkrit dalam mengusung Kebangkitan Islam Kon", "Majmu'atur Rasail adalah karya monumental Imam Hasan Al-Banna yang menjadi rujukan penting bagi pergerakan Ikhwanul Muslimin. Dan, Ikhwanul Muslimin adalah pergerakan yang memberikan inspirasi bagi kebangkitan kaum muslimin di berbagai negara. Karena itu para aktivis Islam perlu mengkajinya, agar mendapatkan gambaran dan contoh konkrit dalam mengusung Kebangkitan Islam Kontemporer."], "author": "Hassan al-Banna", "num_pages": "442", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2007-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3781629-the-choice", "num_ratings": "724", "num_reviews": "55", "avg_ratings": 4.32, "genres": ["Religion", "Islam", "Religion", "Nonfiction"], "title": "The Choice: Dialog Islam - Kristen", "description": ["Ahmed Deedat merupakan da'i dan kristolog terkemuka dunia, yang dari tangannyalah sudah ribuan orang yang menjadi Muslim karenanya. Bagi tokoh-tokoh Nasrani Internasional, baik yang suka maupun yang membencinya,begitu herannya akan kemampuan Ahmad Deedat dalam menangkap pesan-pesan ajaran Islam dan Kristen. Bahkan kemampuan memahami Bibel jauh di atas pendeta sekalipun. Ti", "Ahmed Deedat merupakan da'i dan kristolog terkemuka dunia, yang dari tangannyalah sudah ribuan orang yang menjadi Muslim karenanya. Bagi tokoh-tokoh Nasrani Internasional, baik yang suka maupun yang membencinya,begitu herannya akan kemampuan Ahmad Deedat dalam menangkap pesan-pesan ajaran Islam dan Kristen. Bahkan kemampuan memahami Bibel jauh di atas pendeta sekalipun. Tidak heran di pentas perdebatan teologi Islam dan Kristen, nama Ahmad Deedat, menjadi paling terkemuka. Padahal asalnya Deedat, hanya imigran miskin dari India, yang kemudian jadi warga kelas dua di negeri Afrika Selatan yang kala itu masih rasialis. ", "Dalam karya terbesarnya ini, The CHOICE, Ahmad Deedat berhasil memperoleh penghargaan dari King Faishal Award, semacam hadiah Nobel dari Pemerintah Saudi Arabia. Buku ini pula telah sukses dan beredar luas diperbagai benua dan telah dicetak puluhan kali dengan oplah ratusan ribu hingga jutaan eksemplar."], "author": "Ahmed Deedat", "num_pages": "542", "awards": ["King Faishal Award (0)"], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "1999-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16154308-stories-of-the-prophets", "num_ratings": "4,585", "num_reviews": "167", "avg_ratings": 4.47, "genres": ["Religion", "Islam", "Religion", "History"], "title": "Stories of the Prophets", "description": ["Every prophet and messenger sent to humankind had the same basic message. All of them invited people to the worship of Allah alone. In the current age of individualism, one’s wishes and desires are considered above everything, sometimes even above the command of Allah, the Exalted. In this context, when an aver", "Every prophet and messenger sent to humankind had the same basic message. All of them invited people to the worship of Allah alone. In the current age of individualism, one’s wishes and desires are considered above everything, sometimes even above the command of Allah, the Exalted. In this context, when an average individual reads about the prophets, he/she goes through their messages and incidents rather cursorily. There seems to be a veil of sorts, wherein the reader feels rather disconnected from these incidents and does not understand their relevance to his/her day-to-day life.", "This is where Ibn Katheer’s comprehensive work, ", " comes in. One of the most widely-read books of this highly acclaimed scholar, it details the lives of those prophets who have been mentioned in the Qur’an – either by name or by reference.", "Along with the related Qur’anic verses and hadiths, each chapter brings to light the very human aspect of all the prophets, making them come alive for the reader. The minute details ensure that you, as a reader, are inspired from their personalities, understand the underlying meaning of their message and regard them as role models in your personal lives.", "This new and completely revised edition is made more helpful to the modern-day reader by the inclusion of an appendix listing useful websites that provide reliable information on Allah’s prophets. Whether you are a student learning more about the prophets, a researcher looking for authentic references or simply an individual looking for a 'light read', this book is for you."], "author": "Ibn Kathir", "num_pages": "576", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9828242-menjaring-pahala-saat-hamil-dan-menyusui", "num_ratings": "6", "num_reviews": "2", "avg_ratings": 3.83, "genres": [], "title": "Menjaring Pahala Saat Hamil dan Menyusui", "description": ["Masa hamil dan menyusui memang berat untuk dijalani. Mulai dari mengandung yang kian berat dari waktu ke waktu, dilanjutkan dengan melahirkan yang menuntut pertaruhan nyawa, diteruskan dengan menyusui dan mengasuh sang buah hati hingga dua tahun lamanya, sampai memelihara dan membiayai hidupnya hingga masa baligh.", "Memang pengendali utamanya—setelah bersabar—adalah berusaha", "Masa hamil dan menyusui memang berat untuk dijalani. Mulai dari mengandung yang kian berat dari waktu ke waktu, dilanjutkan dengan melahirkan yang menuntut pertaruhan nyawa, diteruskan dengan menyusui dan mengasuh sang buah hati hingga dua tahun lamanya, sampai memelihara dan membiayai hidupnya hingga masa baligh.", "Memang pengendali utamanya—setelah bersabar—adalah berusaha memahami dan merenungkannya hingga muncul rasa syukur. Pemahaman yang mendalam akan melahirkan kesadaran yang berbuah kenyamanan dan kenikmatan dalam menjalaninya.", "Ya, saat wanita hamil dan menyusui, sesungguhnya ia berada di gurun intan permata pahala. Ia tinggal memunguti, menjaring dan mengambilnya. Ia akan menjadi wanita kaya pahala sekeluarnya dari gurun itu. Ia bahkan bisa mendapatkan tiket masuk surga di sana, yang pada saatnya kelak akan ia perlukan.", "Tidak sekadar mengungkap peluang limpahan pahala bagi wanita-wanita hamil dan menyusui serta orang-orang di sekitarnya, lebih jauh buku ini mengajak semua pihak untuk melihat ayat-ayat Allah pada kedua fenomena itu, merenungkan, mensyukurinya. Buku yang menggugah kembali semangat membina generasi ke arah yang lebih baik."], "author": "Irfan Supandi", "num_pages": "134", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2009-08-16 00:00:00", "ISBN": "9791273561"},
{"url": "https://www.goodreads.com/book/show/16154371-the-prophet-s-methods-of-correcting-people-s-mistakes", "num_ratings": "130", "num_reviews": "14", "avg_ratings": 4.12, "genres": ["Religion"], "title": "The Prophet’s Methods of Correcting People’s Mistakes", "description": ["There are many teaching methods with different means and aids. Correcting mistakes is one that educationalists call the ‘remedial method’. Correcting people’s mistakes is essential if teaching people is the aim. Correcting mistakes is a divine method the Prophet (blessings and peace be upon him) practiced, as some verses of the Qur’an were revealed to correct certain mista", "There are many teaching methods with different means and aids. Correcting mistakes is one that educationalists call the ‘remedial method’. Correcting people’s mistakes is essential if teaching people is the aim. Correcting mistakes is a divine method the Prophet (blessings and peace be upon him) practiced, as some verses of the Qur’an were revealed to correct certain mistakes made by his eminent Companions. ", "The Prophet (peace be upon him) was divinely guided in correcting people’s mistakes, so his methods are the best of all. Following the example of the Prophet (peace be upon him) is therefore the best approach if one is really keen to teach Islamic knowledge and any of the other branches of knowledge. Shaykh Muhammad Sâlih al-Munajjid describes with clear examples from the Sunnah the various methods of the Prophet for teaching people and correcting their mistakes. This book is indispensable for everyone concerned with education in general and Islamic knowledge in particular. It is an excellent reference in educational methodology."], "author": "محمد صالح المنجد", "num_pages": "152", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6041537-the-road-to-the-empire", "num_ratings": "276", "num_reviews": "43", "avg_ratings": 4.12, "genres": ["Novels", "Historical", "Historical Fiction", "Fiction", "Asian Literature", "Indonesian Literature"], "title": "The Road to the Empire: Kisah Takudar Khan, Pangeran Muslim Pewaris Mongol", "description": ["Takudar, Arghun, Buzun, adalah tiga putra Tuqluq Timur Khan, penguasa kekaisaran Mongolia, keturunan Jenghiz Khan. Setelah pembunuhan terhadap Kaisar dan permaisurinya, Takudar, Pangeran Kesatu yang juga pewaris sah tahta kekaisaran, menghilang. Arghun Khan, Pangeran Kedua naik menjadi Kaisar dengan konspirasi dan bantuan Albuqa Khan, orang kepercayaannya. Sementara Buzun,", "Takudar, Arghun, Buzun, adalah tiga putra Tuqluq Timur Khan, penguasa kekaisaran Mongolia, keturunan Jenghiz Khan. Setelah pembunuhan terhadap Kaisar dan permaisurinya, Takudar, Pangeran Kesatu yang juga pewaris sah tahta kekaisaran, menghilang. Arghun Khan, Pangeran Kedua naik menjadi Kaisar dengan konspirasi dan bantuan Albuqa Khan, orang kepercayaannya. Sementara Buzun, Pangeran Ketiga, tetap mengabdi di kekaisaran, tapi dengan rasa rindu dan penasaran terhadap hilangnya sang kakak, Takudar.", "Arghun Khan menjadi Kaisar dengan semangat ekspansi untuk menguasai dunia, melanjutkan kebesaran leluhurnya, Jenghiz Khan. Ia bahkan berambisi menaklukkan Jerusalem. Namun, dalam gerakan penaklukan dan usaha meluaskan wilayah kekuasaan dengan ambisi yang begitu besar, selalu rakyat yang menjadi korban. Termasuk di dalamnya masyarakat Muslim, yang sejak Khalifah Rasyidin telah menyatu dengan bangsa Mongolia sebagai warga minoritas. ", "Bagi masyarakat Muslim Mongol, membiarkan gerakan ekspansi berarti juga menyiapkan kuburan massal. Tak ada pilihan, perlawanan harus dilakukan. Pada saat bersamaan, Pangeran Kesatu yang dalam pelariannya diselamatkan oleh orang-orang Muslim, telah kembali. Meski tersisih, menggelandang, dan tak punya kekuatan pasukan, menegakkan kembali kebenaran sejarah adalah sebuah hal yang niscaya. Bersama orang-orang Muslim, Baruji alias Takudar Muhammad Khan merencanakan perlawanan untuk merebut tahta. Buzun, Pangeran Ketiga pun berada dalam dilema. Haruskah ia memihak salah satu kakaknya? ", "Di sisi lain, perempuan-perempuan yang ada di sekeliling Arghun, Takudar, maupun Buzun, memainkan peran masing-masing. Almamuchi alias Uchatadara, gadis dari suku Tar Muleng yang selama ini setia menjadi pelayan Takudar. Urghana, putri Albuqa Khan yang mencintai Buzun, tapi harus menghadapi kekerasan hati Arghun, yang juga mencintainya. Selir Albuqa Khan, Han Shiang, yang licik. Juga Karadiza, gadis Muslim lugas dan pemberani.", "Maka, intrik dan konspirasi politik pun bertabur dalam novel ini. Berbalut kisah heroisme dengan bumbu romantisme yang tak berlebihan."], "author": "Sinta Yudisia", "num_pages": "573", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2008-12-16 00:00:00", "ISBN": "9791367590"},
{"url": "https://www.goodreads.com/book/show/13391097-muhammad-saw-mengapa-begitu-agung", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 3.33, "genres": [], "title": "Muhammad saw, Mengapa Begitu Agung?", "description": ["“Muhammad adalah manusia paling agung yang pernah menginjakkan kakinya di bumi.” Sir George Shaw, The Genuine Islam“Pilihan saya untuk menempatkan Muhammad pada urutan teratas –dari tokoh-tokoh dunia—mungkin mengejutkan semua pihak, tapi dialah satu-satunya tokoh yang sukses; baik dalam tataran sekuler maupun agama.”Michael H. Hart, The 100: A Ranking of The Most Influenti", "“Muhammad adalah manusia paling agung yang pernah menginjakkan kakinya di bumi.” Sir George Shaw, The Genuine Islam“Pilihan saya untuk menempatkan Muhammad pada urutan teratas –dari tokoh-tokoh dunia—mungkin mengejutkan semua pihak, tapi dialah satu-satunya tokoh yang sukses; baik dalam tataran sekuler maupun agama.”Michael H. Hart, The 100: A Ranking of The Most Influential Persons in HistoryMuhammad saw memang sosok pribadi yang paling agung. Tetapi tahukah Anda apa sebab keagungannya yang begitu besar itu? Apakah keagungan itu tumbuh dari kedudukannya sebagai Nabi yang dipenuhi dengan mukjizat-mukjizat Ilahi yang sangat dahsyat? Atau karena beliau sebagai manusia biasa yang diutus Allah untuk menjadi teladan agar kita dapat meneladaninya?Buku yang ada di tangan Anda ini membahas tiga aspek keagungan Rasulullah saw: - Perencana Terjitu- Guru Terhebat- Negosiator Terulung"], "author": "Shalih Ibrahim", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2009-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/254523.Al_Ghazali_s_Letter_to_a_Disciple", "num_ratings": "1,953", "num_reviews": "385", "avg_ratings": 4.29, "genres": ["Religion", "Islam", "Religion"], "title": "Al-Ghazali's Letter to a Disciple", "description": ["'Work for your terrestrial life in proportion to your location in it, and work for your afterlife in proportion to your eternity in it.' This is part of the advice that the great theologian and mystic Abu Hamid al-Ghazali (1058-1111 AD) put down in his ", ". An old disciple of al-Ghazali had studied the Islamic sciences, including the many works of his mast", "'Work for your terrestrial life in proportion to your location in it, and work for your afterlife in proportion to your eternity in it.' This is part of the advice that the great theologian and mystic Abu Hamid al-Ghazali (1058-1111 AD) put down in his ", ". An old disciple of al-Ghazali had studied the Islamic sciences, including the many works of his master, for most of his life. Faced with the proximity of death, he turns again to his master this time asking for a summary of all his teachings. ", " is al-Ghazali's response. The emphasis in this short treatise is on religious and spiritual action and on putting into practice the knowledge that one has acquired. ", " can be considered as the last testament of he who is regarded as Hujjat al-Islam, the 'Proof of Islam'. This new translation is presented here as a bilingual, English-Arabic, edition."], "author": "Abu Hamid al-Ghazali", "num_pages": "130", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-01 00:00:00", "ISBN": "0946621632"},
{"url": "https://www.goodreads.com/book/show/22735741-lapis-lapis-keberkahan", "num_ratings": "539", "num_reviews": "64", "avg_ratings": 4.46, "genres": ["Nonfiction", "Religion", "Islam", "Religion"], "title": "Lapis-Lapis Keberkahan", "description": ["Memburu berkah amatlah berat. Tapi justru di dalamnyalah ada banyak rasa nikmat.", "Bahagia adalah kata paling menyihir dalam hidup manusia. ", "Semua jiwa merinduinya. Semua akal mengharapinya. Semua raga mengejarnya. Tapi kebahagiaan adalah goda yang tega. Ia bayangan yang melipir jika difikir, lari jika dicari, tak tentu jika diburu, melesat jika ditangkap, menghilang jika diha", "Memburu berkah amatlah berat. Tapi justru di dalamnyalah ada banyak rasa nikmat.", "Bahagia adalah kata paling menyihir dalam hidup manusia. ", "Semua jiwa merinduinya. Semua akal mengharapinya. Semua raga mengejarnya. Tapi kebahagiaan adalah goda yang tega. Ia bayangan yang melipir jika difikir, lari jika dicari, tak tentu jika diburu, melesat jika ditangkap, menghilang jika dihadang.", "Dalam nanar mata yang tak menjumpa bahagia; insan lain tampak lebih cerah. Dalam denging telinga yang tak menyimak bahagia; insan lain terdengar lebih ceria. Dalam gerisik hati yang tak merasa bahagia; insan lain berkilau bercahaya.", "Buku ini disusun dengan keinsyafan kecil, bahwa jika bahagia dijadikan tujuan, kita akan luput menikmatinya di sepanjang perjalanan. Bahwa jika bahagia dijadikan cita, kita akan kehilangan ia sebagai rasa. Bahwa jika bahagia djadikan tugas jiwa, kita akan melalaikan kewajiban sebagai hamba. Bahwa jika bahagia dijadikan tema besar kehidupan, kita bisa kehilangan ia setelah kematian.", "Bahagia adalah kata yang tak cukup untuk mewakili segenap kebaikan. Maka buku ini diberi tajuk ‘Lapis-lapis Keberkahan’.", "Hidup kita umpama buah beraneka aroma, bentuk, warna, serta rasa; yang diiris-iris dan ditumpuk berlapis-lapis. Tiap irisan itu, punya wangi maupun anyirnya, teratur maupun acaknya, cerah maupun kelamnya, lembut maupun kasarnya, manis maupun pahitnya, masam maupun asinnya. Tapi kepastian dariNya dalam segala yang terindra itu adalah; ada gizi yang bermanfaat bagi ruh, akal, dan jasad kita.", "Ialah lapis-lapis keberkahan.", "Bukan nikmat atau musibahnya; tapi syukur dan sabarnya. Bukan kaya atau miskinnya; tapi shadaqah dan doanya. Bukan sakit atau sehatnya; tapi dzikir dan tafakkurnya. Bukan sedikit atau banyaknya; tapi ridha dan qana’ahnya. Bukan tinggi atau rendahnya; tapi tazkiyah dan tawadhu’nya. Bukan kuat atau lemahnya; tapi adab dan akhlaqnya. Bukan sempit atau lapangnya; tapi zuhud dan wara’nya. Bukan sukar atau mudahnya; tapi ‘amal dan jihadnya. Bukan berat atau ringannya; tapi ikhlas dan tawakkalnya.", "Selamat datang di lapis-lapis keberkahan. Biarlah bahagia menjadi makmum bagi islam, iman, dan ihsan kita; membuntutinya hingga ke surga."], "author": "Salim Akhukum Fillah", "num_pages": "514", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2014-07-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7818297-al-hikam", "num_ratings": "141", "num_reviews": "11", "avg_ratings": 4.5, "genres": ["Religion", "Islam", "Religion"], "title": "Al-Hikam: Untaian Hikmah Ibn 'Atha'illah", "description": ["Al-Hikam merupakan mutiara-mutiara cemerlang untuk meningkatkan kesadaran spiritual, tidak hanya bagi para salik dan murid-murid tasawuf, tapi juga untuk umumnya para peminat olah batin. Untaian mutiaranya telah memesona jutaan hamba pencari keindahan Sang Maha Indah. ", "K.H. A. Mustofa Bisri", "Hidup akan diliputi kegamangan bila kita tak tahu apa tujuan hidup kita. Dalam buku i", "Al-Hikam merupakan mutiara-mutiara cemerlang untuk meningkatkan kesadaran spiritual, tidak hanya bagi para salik dan murid-murid tasawuf, tapi juga untuk umumnya para peminat olah batin. Untaian mutiaranya telah memesona jutaan hamba pencari keindahan Sang Maha Indah. ", "K.H. A. Mustofa Bisri", "Hidup akan diliputi kegamangan bila kita tak tahu apa tujuan hidup kita. Dalam buku ini, Anda diajak menyelami al-Hikam—hikmah-hikmah Ibnu Athaillah—agar hidup Anda tidak saja terarah dan bermakna, tapi juga tenteram dan indah!", "Al-Hikam menyediakan arahan kepada kaum beriman untuk berjalan menuju Allah, lengkap dengan rambu-rambu, peringatan, dorongan, dan penggambaran keadaan, tahapan, serta kedudukan rohani. ", "Al-Hikam dipandang sebagai kitab kelas berat bukan saja karena struktur kalimatnya yang bersastra tinggi, melainkan juga kedalaman makrifat yang dituturkan lewat kalimat-kalimatnya yang singkat. Ia menjadi kitab yang bahasanya luar biasa indah—kata dan makna saling mendukung, melahirkan ungkapan-ungkapan yang menggetarkan."], "author": "Ibn 'Atha'illah", "num_pages": "299", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2010-02-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/828449.The_Jews_of_Islam", "num_ratings": "97", "num_reviews": "5", "avg_ratings": 3.8, "genres": ["History", "Religion", "Islam", "Literature", "Jewish", "Religion", "Religion", "Judaism", "Nonfiction", "Judaism", "Judaica"], "title": "The Jews of Islam", "description": ["Probing the Muslims' attitude toward Judaism as a special case of their view of other religious minorities in Islamic countries, Bernard Lewis demolishes two competing stereotypes: the fanatical warrior, sword in one hand and Qur' an in the other, and the Muslim designer of an interfaith utopia. Available for the first time in paperback, his portrayal of the Judaeo-Islamic", "Probing the Muslims' attitude toward Judaism as a special case of their view of other religious minorities in Islamic countries, Bernard Lewis demolishes two competing stereotypes: the fanatical warrior, sword in one hand and Qur' an in the other, and the Muslim designer of an interfaith utopia. Available for the first time in paperback, his portrayal of the Judaeo-Islamic tradition is set against a vivid background of Jewish and Islamic history."], "author": "Bernard Lewis", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-06-21 00:00:00", "ISBN": "0691008078"},
{"url": "https://www.goodreads.com/book/show/6096463-spiritual-kitchen", "num_ratings": "1", "num_reviews": "1", "avg_ratings": 3.0, "genres": [], "title": "Spiritual Kitchen", "author": "Ummufani", "num_pages": "177", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2005-10-16 00:00:00", "ISBN": "9798394240"},
{"url": "https://www.goodreads.com/book/show/20657281-muhammad-the-messenger-of-guidance", "num_ratings": "10", "num_reviews": "0", "avg_ratings": 4.4, "genres": [], "title": "Muhammad the Messenger of Guidance: A Concise Introduction to His Life and Islam", "description": ["This book succinctly summarises the life of Prophet Muhammad (peace be upon him) painting a beautiful portrait of his qualities and characteristics. The author examines the pillars of faith and worship in Islam, and discusses some relevant contemporary issues. Then, he presents prophetic narrations on a variety of topics.", "This is an excellent resource for both Muslims and n", "This book succinctly summarises the life of Prophet Muhammad (peace be upon him) painting a beautiful portrait of his qualities and characteristics. The author examines the pillars of faith and worship in Islam, and discusses some relevant contemporary issues. Then, he presents prophetic narrations on a variety of topics.", "This is an excellent resource for both Muslims and non-Muslims. In Part One, the author succinctly summarises the life of Prophet Muhammad (), using authentic reports from his Companions to paint a beautiful portrait of his qualities and characteristics. In addition, he examines and explains the basic pillars of faith and worship in Islam, and then goes on to discuss issues that are relevant to the Muslim nation today. Part Two brings together a wide selection of sound hadiths, or sayings of the Prophet (). The author has carefully chosen these to cover a broad variety of topics, thus creating a useful reference that is easy to follow and comprehend. ", "This book provides the reader with an academic perspective on Islam, which is supported by modern, eloquent translations of the original textual sources: the Qur’an and the Sunnah of the Prophet (). It is an excellent resource for both the casual and the academic reader."], "author": "Ahmad M. Halimah", "num_pages": "392", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18259549-faizan-e-sunnat", "num_ratings": "24", "num_reviews": "2", "avg_ratings": 4.5, "genres": ["Religion", "Islam", "Religion"], "title": "Faizan e Sunnat: Blessings of Sunnah (Vol.1)", "description": ["The author has made his books freely available on the official url."], "author": "Muhammad Ilyas 'Attar Qadri Razavi", "num_pages": "1000", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/506965.The_Political_Language_of_Islam", "num_ratings": "85", "num_reviews": "8", "avg_ratings": 3.71, "genres": ["Religion", "Islam", "History", "Politics", "Religion", "Politics", "Political Science", "Nonfiction"], "title": "The Political Language of Islam", "description": ["What does ", " really mean? What is the Muslim conception of law? What is Islam's stance toward unbelievers? Probing literary and historical sources, Bernard Lewis traces the development of Islamic political language from the time of the Prophet to the present. His analysis of documents written in Arabic, Persian, and Turkish illuminates differences between Muslim politic", "What does ", " really mean? What is the Muslim conception of law? What is Islam's stance toward unbelievers? Probing literary and historical sources, Bernard Lewis traces the development of Islamic political language from the time of the Prophet to the present. His analysis of documents written in Arabic, Persian, and Turkish illuminates differences between Muslim political thinking and Western political theory, and clarifies the perception, discussion, and practices of politics in the Islamic world.", "\"Lewis's own style, combining erudition with a simple elegance and subtle humor, continues to inspire. In an era of specialization and narrowing academic vision, he stands alone as one who deserves, without qualification, the title of historian of Islam.\"—Martin Kramer, ", "\"A superb effort at synthesis that presents all the relevant facts of Middle Eastern history in an eminently lucid form. . . . It is a book that should prove both rewarding and congenial to the Muslim reader.\"—S. Parvez Manzor, ", "\"By bringing his thoughts together in this clear, concise and readable account, [Lewis] has placed in his debt scholars and all who seek to understand the Muslim world.\"—Ann K. S. Lambton, ", "\"[Lewis] constructs a fascinating account of the ways in which Muslims have conceived of the relations between ruler and ruled, rights and duties, legitimacy and illegitimacy, obedience and rebellion, justice and oppression. And he shows how changes in political attitudes and concepts can be traced through changes in the political vocabulary.\"—Shaul Bakhash, "], "author": "Bernard Lewis", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-06-11 00:00:00", "ISBN": "0226476936"},
{"url": "https://www.goodreads.com/book/show/10135719-ranah-3-warna", "num_ratings": "6,431", "num_reviews": "502", "avg_ratings": 4.12, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature"], "title": "Ranah 3 Warna", "description": ["Alif baru saja tamat dari Pondok Madani. Dia bahkan sudah bisa bermimpi dalam bahasa Arab dan Inggris. Impiannya? Tinggi betul. Ingin belajar teknologi tinggi di Bandung seperti Habibie, lalu merantau sampai ke Amerika.", "Dengan semangat menggelegak dia pulang ke Maninjau dan tak sabar ingin segera kuliah. Namun kawan karibnya, Randai, meragukan dia mampu lulus UMPTN. Lalu di", "Alif baru saja tamat dari Pondok Madani. Dia bahkan sudah bisa bermimpi dalam bahasa Arab dan Inggris. Impiannya? Tinggi betul. Ingin belajar teknologi tinggi di Bandung seperti Habibie, lalu merantau sampai ke Amerika.", "Dengan semangat menggelegak dia pulang ke Maninjau dan tak sabar ingin segera kuliah. Namun kawan karibnya, Randai, meragukan dia mampu lulus UMPTN. Lalu dia sadar, ada satu hal penting yang dia tidak punya. Ijazah SMA. Bagaimana mungkin mengejar semua cita-cita tinggi tadi tanpa ijazah?", "Terinspirasi semangat tim dinamit Denmark, dia mendobrak rintangan berat. Baru saja dia bisa tersenyum, badai masalah menggempurnya silih berganti tanpa ampun. Alif letih dan mulai bertanya-tanya: \"Sampai kapan aku harus teguh bersabar menghadapi semua cobaan hidup ini?\" Hampir saja dia menyerah.", "Rupanya \"mantra\" man jadda wajada saja tidak cukup sakti dalam memenangkan hidup. Alif teringat \"mantra\" kedua yang diajarkan di Pondok Madani: man shabara zhafira. Siapa yang bersabar akan beruntung. Berbekal kedua mantra itu dia songsong badai hidup satu persatu. Bisakah dia memenangkan semua impiannya?", "Ke mana nasib membawa Alif? Apa saja 3 ranah berbeda warna itu? Siapakah Raisa? Bagaimana persaingannya dengan Randai? Apa kabar Sahibul Menara? Kenapa sampai muncul Obelix, orang Indian dan Michael Jordan dan Kesatria Berpantun? Apa hadiah Tuhan buat sebuah kesabaran yang kukuh?", "Ranah 3 Warna adalah hikayat bagaimana impian tetap wajib dibela habis-habisan walau hidup terus digelung nestapa tak berkesudahan. Tuhan sungguh bersama orang yang sabar."], "author": "Ahmad Fuadi", "num_pages": "473", "awards": ["Anugerah Pembaca Indonesia for Sampul Buku Fiksi Terfavorit (2011)"], "places": [], "character_names": ["Alif, Randai, Raisa, Rusdi, Kiai Rais, Ayah, Amak, Bang Togar, Shahibul Menara"], "language": "Indonesian", "publish_date": "2011-01-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1362193.Laskar_Pelangi", "num_ratings": "22,314", "num_reviews": "2,763", "avg_ratings": 4.16, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature"], "title": "Laskar Pelangi", "description": ["Begitu banyak hal menakjubkan yang terjadi dalam masa kecil para anggota Laskar Pelangi. Sebelas orang anak Melayu Belitong yang luar biasa ini tak menyerah walau keadaan tak bersimpati pada mereka. Tengoklah Lintang, seorang kuli kopra cilik yang genius dan dengan senang hati bersepeda 80 kilometer pulang pergi untuk memuaskan dahaganya akan ilmu—bahkan terkadang hanya un", "Begitu banyak hal menakjubkan yang terjadi dalam masa kecil para anggota Laskar Pelangi. Sebelas orang anak Melayu Belitong yang luar biasa ini tak menyerah walau keadaan tak bersimpati pada mereka. Tengoklah Lintang, seorang kuli kopra cilik yang genius dan dengan senang hati bersepeda 80 kilometer pulang pergi untuk memuaskan dahaganya akan ilmu—bahkan terkadang hanya untuk menyanyikan Padamu Negeri di akhir jam sekolah. Atau Mahar, seorang pesuruh tukang parut kelapa sekaligus seniman dadakan yang imajinatif, tak logis, kreatif, dan sering diremehkan sahabat-sahabatnya, namun berhasil mengangkat derajat sekolah kampung mereka dalam karnaval 17 Agustus. Dan juga sembilan orang Laskar Pelangi lain yang begitu bersemangat dalam menjalani hidup dan berjuang meraih cita-cita. Selami ironisnya kehidupan mereka, kejujuran pemikiran mereka, indahnya petualangan mereka, dan temukan diri Anda tertawa, menangis, dan tersentuh saat membaca setiap lembarnya. Buku ini dipersembahkan buat mereka yang meyakini the magic of childhood memories, dan khususnya juga buat siapa saja yang masih meyakini adanya pintu keajaiban lain untuk mengubah dunia: pendidikan."], "author": "Andrea Hirata", "num_pages": "534", "awards": [], "places": ["Belitung"], "character_names": ["Lintang", "Ikal", "Muslimah Hafsari", "Harfan Effendy Noor", "Floriana", "Mahar", "A Ling"], "language": "Indonesian", "publish_date": "2008-08-16 00:00:00", "ISBN": "9793062797"},
{"url": "https://www.goodreads.com/book/show/8460546-cinta-di-dalam-gelas", "num_ratings": "4,772", "num_reviews": "290", "avg_ratings": 3.95, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature"], "title": "Cinta di Dalam Gelas", "description": ["CINTA DI DALAM GELAS bertutur tentang tugas berat di pundak Ikal. Dia harus membantu Maryamah memenangkan pertandingan catur saat 17 Agustus nanti. Maryamah, yang menyentuh bidak catur saja belum pernah, harus mengalahkan juara catur selama dua tahun berturut-turut yang sekaligus juga mantan suaminya. Namun, lebih dari itu, jenis kelamin Maryamah menjadi tantangan berat un", "CINTA DI DALAM GELAS bertutur tentang tugas berat di pundak Ikal. Dia harus membantu Maryamah memenangkan pertandingan catur saat 17 Agustus nanti. Maryamah, yang menyentuh bidak catur saja belum pernah, harus mengalahkan juara catur selama dua tahun berturut-turut yang sekaligus juga mantan suaminya. Namun, lebih dari itu, jenis kelamin Maryamah menjadi tantangan berat untuk bisa mencebur ke dalam pertandingan penuh harkat bagi kaum lelaki ini.", "Bagi penonton yang pro maupun kontra, usaha Maryamah jelas sebuah suguhan yang sangat menarik. Begitu pulakah dengan Maryamah?"], "author": "Andrea Hirata", "num_pages": "270", "awards": [], "places": [], "character_names": ["Ikal", "A Ling", "Enong", "Zamzami", "Detektif M. Nur"], "language": "Indonesian", "publish_date": "2010-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10116769-eliana", "num_ratings": "2,192", "num_reviews": "173", "avg_ratings": 4.22, "genres": ["Novels", "Fiction", "Family"], "title": "Eliana", "description": ["Selamat datang di dunia yang tidak pernah kalian bayangkan. Di mana rasa ingin tahu, proses belajar, menyatu dengan kepolosan, kenakalan, hingga isengnya dunia anak-anak. Selamat datang di sebuah petualangan hebat, ketika persahabatan, pengorbanan, dan pemahaman yang baik atas kehidupan tumbuh dari wajah-wajah ceria terus melekat hingga mereka tumbuh dewasa.", "Adalah Eliana,", "Selamat datang di dunia yang tidak pernah kalian bayangkan. Di mana rasa ingin tahu, proses belajar, menyatu dengan kepolosan, kenakalan, hingga isengnya dunia anak-anak. Selamat datang di sebuah petualangan hebat, ketika persahabatan, pengorbanan, dan pemahaman yang baik atas kehidupan tumbuh dari wajah-wajah ceria terus melekat hingga mereka tumbuh dewasa.", "Adalah Eliana, anak sulung Mamak yang pemberani, bersama tiga rekannya, membentuk geng dengan sebutan 'empat buntal'. Berempat mereka kompak, bahu-membahu melewati hari-hari seru, kejadian suka-duka, pantang menyerah. Bahkan, melawan kerakusan di kampung kecil dengan sabuk sungai, dikelilingi hutan, dan dibentengi bukit-bukit hijau. Adalah Mamak yang membesarkan anak-anak dengan disiplin tinggi, tegas, akhlak tidak tercela, serta tanpa kompromi. Dan adalah Bapak yang selalu riang, memberikan teladan dari perbuatan, serta selalu bijak menyikapi masalah.", "Eliana buku ke-4 dari Serial Anak-anak Mamak, setelah Burlian (buku ke-2), Pukat (buku ke-3), dan berikutnya Amelia (buku ke-1 yang terbit 2011). Inilah serial terbaik untuk memahami kasih-sayang keluarga, kesederhanaan, serta keteguhan tekad berbuat baik. Selamat datang di dunia yang semoga kita temukan dalam kehidupan keluarga masa depan yang lebih baik.", "\"Jangan pernah membenci Mamak kau, Eliana. Karena kalau kau tahu sedikit saja apa yang telah seorang Ibu lakukan untukmu, maka yang kau tahu itu sejatinya bahkan belum sepersepuluh dari pengorbanan, rasa cinta, serta rasa sayangnya kepada kalian"], "author": "Tere Liye", "num_pages": "519", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2011-01-04 00:00:00", "ISBN": "6028987042"},
{"url": "https://www.goodreads.com/book/show/2249400.Cahaya_di_atas_Cahaya_", "num_ratings": "123", "num_reviews": "8", "avg_ratings": 3.46, "genres": ["Fiction", "Asian Literature", "Indonesian Literature", "Novels"], "title": "Cahaya di atas Cahaya : Kumpulan Cerpen Terbaik", "description": ["Menjadi perempuan bagi saya adalah karunia sekaligus perenungan. Sebab warna dunianya lebih bergradasi dibanding dunia laki-laki. Konflik-konflik dalam menjalani peran kodratinya lebih variatif dan unik. Ujian kehidupannya pun lebih berwarna dan ia senantiasa harus memilih...", "(Izzatul Jannah)", "Lewat kumpulan cerpennya ini Izzatul Jannah mengangkat beberapa segi kehidupan pere", "Menjadi perempuan bagi saya adalah karunia sekaligus perenungan. Sebab warna dunianya lebih bergradasi dibanding dunia laki-laki. Konflik-konflik dalam menjalani peran kodratinya lebih variatif dan unik. Ujian kehidupannya pun lebih berwarna dan ia senantiasa harus memilih...", "(Izzatul Jannah)", "Lewat kumpulan cerpennya ini Izzatul Jannah mengangkat beberapa segi kehidupan perempuan yang patut dicermati, plus epik-epiknya yang bersemangat..."], "author": "Izzatul Jannah", "num_pages": "143", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2000-08-16 00:00:00", "ISBN": "9799594278"},
{"url": "https://www.goodreads.com/book/show/8489.Muhammad", "num_ratings": "2,021", "num_reviews": "236", "avg_ratings": 4.01, "genres": ["Religion", "Religion", "Islam", "Nonfiction", "History", "Biography"], "title": "Muhammad: A Prophet for Our Time", "description": ["Muhammad was born in 570 CE, and over the following sixty years built a thriving spiritual community, laying the foundations of a religion that changed the course of world history. There is more historical data on his life than on that of the founder of any other major faith, and yet his story is little known. Karen Armstrong's immaculately researched new biography of Muha", "Muhammad was born in 570 CE, and over the following sixty years built a thriving spiritual community, laying the foundations of a religion that changed the course of world history. There is more historical data on his life than on that of the founder of any other major faith, and yet his story is little known. Karen Armstrong's immaculately researched new biography of Muhammad will enable readers to understand the true origins and spirituality of a faith that is all too often misrepresented as cruel, intolerant, and inherently violent. An acclaimed authority on religious and spiritual issues, Armstrong offers a balanced, in-depth portrait, revealing the man at the heart of Islam by dismantling centuries of misconceptions. Armstrong demonstrates that Muhammad's life--a pivot point in history--has genuine relevance to the global crises we face today.", "Download"], "author": "Karen Armstrong", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-17 00:00:00", "ISBN": "0060598972"},
{"url": "https://www.goodreads.com/book/show/2160305.Aduh_Pusiiing_", "num_ratings": "99", "num_reviews": "4", "avg_ratings": 3.24, "genres": ["Asian Literature", "Indonesian Literature", "Novels"], "title": "Aduh Pusiiing!", "description": ["NOMIK (Novel-Komik) adalah buku fiksi yang memadukan novel dengan komik dalam satu buku. Dengan kata lain, komik yang ditampilkan bukan sekadar komik biasa, melainkan bagian dari alur cerita.", "Nomik kedua ini (nomik pertama berjudul ", "), menceritakan tentang persahabatan Olin, Kristin, dan Lia yang tergoda kehadiran seorang cowok bunglon bernama Roy.", "Di mata Kri", "NOMIK (Novel-Komik) adalah buku fiksi yang memadukan novel dengan komik dalam satu buku. Dengan kata lain, komik yang ditampilkan bukan sekadar komik biasa, melainkan bagian dari alur cerita.", "Nomik kedua ini (nomik pertama berjudul ", "), menceritakan tentang persahabatan Olin, Kristin, dan Lia yang tergoda kehadiran seorang cowok bunglon bernama Roy.", "Di mata Kristin, Roy adalah seorang penjahat, tetapi di mata Lia, Roy adalah dewa penolong. Sedang di mata Olin, Roy tidak lebih hanya cowok tak berdaya, yang perlu dihasihani. Ini sungguh membuat mereka pusing.", "Siapa sebetulnya cowok bunglon itu? Apa membuat persahabatan mereka retak atau sebaliknya? Lantas bagaimana dengan dugaan Olin, Kristin, dan Lia? Aduh pusiiing!"], "author": "Ali Muakhir", "num_pages": "163", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2007-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1407874.Sang_Pemimpi", "num_ratings": "14,178", "num_reviews": "1,167", "avg_ratings": 4.11, "genres": ["Novels", "Asian Literature", "Indonesian Literature", "Fiction"], "title": "Sang Pemimpi", "description": ["Sang Pemimpi adalah sebuah lantunan kisah kehidupan yang memesona dan akan membuat Anda percaya akan tenaga cinta, percaya pada kekuatan mimpi dan pengorbanan, lebih dari itu, akan membuat Anda percaya kepada Tuhan. Andrea akan membawa Anda berkelana menerobos sudut-sudut pemikiran di mana Anda akan menemukan pandangan yang berbeda tentang nasib, tantangan intelektualitas,", "Sang Pemimpi adalah sebuah lantunan kisah kehidupan yang memesona dan akan membuat Anda percaya akan tenaga cinta, percaya pada kekuatan mimpi dan pengorbanan, lebih dari itu, akan membuat Anda percaya kepada Tuhan. Andrea akan membawa Anda berkelana menerobos sudut-sudut pemikiran di mana Anda akan menemukan pandangan yang berbeda tentang nasib, tantangan intelektualitas, dan kegembiraan yang meluap-luap, sekaligus kesedihan yang mengharu biru. ", "Tampak komikal pada awalnya, selayaknya kenakalan remaja biasa, tapi kemudian tanpa Anda sadari, kisah dan karakter-karakter dalam buku ini lambat laun menguasai Anda. Karena potret-potret kecil yang menawan akan menghentakkan Anda pada rasa humor yang halus namun memiliki efek filosofis yang meresonansi. Karena arti perjuangan hidup dalam kemiskinan yang membelit dan cita-cita yang gagah berani dalam kisah dua orang tokoh utama buku ini: Arai dan Ikal akan menuntun Anda dengan semacam keanggunan dan daya tarik agar Anda dapat melihat ke dalam diri sendiri dengan penuh pengharapan, agar Anda menolak semua keputusasaan dan ketakberdayaan Anda sendiri. ", "“Kita tak kan pernah mendahului nasib!” teriak Arai.", "“Kita akan sekolah ke Prancis, menjelajahi Eropa sampai ke Afrika! Apa pun yang terjadi!”"], "author": "Andrea Hirata", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2006-08-16 00:00:00", "ISBN": "9793062924"},
{"url": "https://www.goodreads.com/book/show/18747605-muhammad-al-fatih-1453", "num_ratings": "2,006", "num_reviews": "160", "avg_ratings": 4.44, "genres": ["Religion", "Islam", "History", "Religion", "Nonfiction", "Biography"], "title": "Muhammad Al-Fatih 1453", "description": ["\"Ada cara yang menyenangkan untuk mengubah kepribadian Anda agar menjadi selevel para ksatria Islam yang terpisah zaman dan waktu, bacalah sejarah\"", "Ini adalah kisah ketika dunia hanya mengenal dua wilayah, Barat dan Timur. Ini adalah persaingan antara dua negara; Imperium Romawi dan Khilafah Islam. Ini adalah cerita saat dunia terpolarisasi menjadi dua bagian; Kristen dan I", "\"Ada cara yang menyenangkan untuk mengubah kepribadian Anda agar menjadi selevel para ksatria Islam yang terpisah zaman dan waktu, bacalah sejarah\"", "Ini adalah kisah ketika dunia hanya mengenal dua wilayah, Barat dan Timur. Ini adalah persaingan antara dua negara; Imperium Romawi dan Khilafah Islam. Ini adalah cerita saat dunia terpolarisasi menjadi dua bagian; Kristen dan Islam. Ini adalah epik antara dua kekuasaan; Byzantium dan Utsmani.", "Pada suatu masa ketika dunia hanya terbagi menjadi dua bagian, sudah menjadi kewajaran bagi Barat untuk menaklukkan Timur. Namun ada satu pemuda yang membalik semuanya dan menaklukkan sebagian besar Barat.", "Pemuda yang mengukir namanya dalam sejarah emas dunia,dengan prestasi dan pencapaian yang tidak pernah ada pada masanya ataupun sebelumnya, prestasi yang jauh melebihi masanya.", "Ini adalah salah satu pertempuran paling penting dalam sejarah Islam dan sejarah dunia. Pertempuran yang sangat berpengaruh pada relasi Kristen dan Islam. Serta panglima terbaik yang telah diramalkan oleh Rasulullah saw."], "author": "Felix Y. Siauw", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2013-05-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1446506.Moga_Bunda_Disayang_Allah", "num_ratings": "4,943", "num_reviews": "387", "avg_ratings": 4.08, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature"], "title": "Moga Bunda Disayang Allah", "description": ["Diangkat dari salah satu kisah nyata paling mengharukan, ditulis kembali dari salah satu film terbaik sepanjang masa."], "author": "Tere Liye", "num_pages": "308", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2007-08-16 00:00:00", "ISBN": "9793210796"},
{"url": "https://www.goodreads.com/book/show/1549876.Nikmatnya_Pacaran_Setelah_Pernikahan", "num_ratings": "921", "num_reviews": "89", "avg_ratings": 4.02, "genres": ["Religion", "Islam", "Romance", "Religion"], "title": "Nikmatnya Pacaran Setelah Pernikahan", "description": ["Alangkah seringnya", "Mentergesai kenikmatan tanpa ikatan", "Membuat detik-detik di depan terasa hambar", "Belajar dari ahli puasa", "Ada dua kebahagiaan baginya", "Saat berbuka", "Dan saat Allah menyapa lembut memberikan pahala", "Inilah puasa panjang syahwatku", "Kekuatan ada pada menahan", "Dan rasa nikmat itu terasa, di waktu buka yang penuh kejutan", "Coba saja", "Kalau Allah yang menghalalkan", "Setitis cicipan su", "Alangkah seringnya", "Mentergesai kenikmatan tanpa ikatan", "Membuat detik-detik di depan terasa hambar", "Belajar dari ahli puasa", "Ada dua kebahagiaan baginya", "Saat berbuka", "Dan saat Allah menyapa lembut memberikan pahala", "Inilah puasa panjang syahwatku", "Kekuatan ada pada menahan", "Dan rasa nikmat itu terasa, di waktu buka yang penuh kejutan", "Coba saja", "Kalau Allah yang menghalalkan", "Setitis cicipan surga", "Kan menjadi shadaqah berpahala", "Buku ini dipersembahkan untuk mereka yang lagi jatuh hati atau sedang pacaran bersama doi yang dipenuhi hasrat nikah dini tapi belum bernyali yang sedang menjalani proses penuh liku dan yang ingin melanggengkan masa-masa indah pernikahannya."], "author": "Salim Akhukum Fillah", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2004-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6688121-negeri-5-menara", "num_ratings": "10,940", "num_reviews": "1,097", "avg_ratings": 4.06, "genres": ["Novels", "Fiction", "Asian Literature", "Indonesian Literature", "Inspirational", "Religion", "Islam", "Religion", "Drama", "Unfinished", "True Story", "Adventure"], "title": "Negeri 5 Menara", "description": ["Alif lahir di pinggir Danau Maninjau dan tidak pernah menginjak tanah di luar ranah Minangkabau. Masa kecilnya adalah berburu durian runtuh di rimba Bukit Barisan, bermain bola di sawah berlumpur dan tentu mandi berkecipak di air biru Danau Maninjau.", "Tiba-tiba saja dia harus naik bus tiga hari tiga malam melintasi punggung Sumatera dan Jawa menuju sebuah desa di pelosok Jaw", "Alif lahir di pinggir Danau Maninjau dan tidak pernah menginjak tanah di luar ranah Minangkabau. Masa kecilnya adalah berburu durian runtuh di rimba Bukit Barisan, bermain bola di sawah berlumpur dan tentu mandi berkecipak di air biru Danau Maninjau.", "Tiba-tiba saja dia harus naik bus tiga hari tiga malam melintasi punggung Sumatera dan Jawa menuju sebuah desa di pelosok Jawa Timur. Ibunya ingin dia menjadi Buya Hamka walau Alif ingin menjadi Habibie. Dengan setengah hati dia mengikuti perintah Ibunya: belajar di pondok.", "Di kelas hari pertamanya di Pondok Madani (PM), Alif terkesima dengan “mantera” sakti man jadda wajada. Siapa yang bersungguh-sungguh pasti sukses.", "Dia terheran-heran mendengar komentator sepakbola berbahasa Arab, anak menggigau dalam bahasa Inggris, merinding mendengar ribuan orang melagukan Syair Abu Nawas dan terkesan melihat pondoknya setiap pagi seperti melayang di udara.", "Dipersatukan oleh hukuman jewer berantai, Alif berteman dekat dengan Raja dari Medan, Said dari Surabaya, Dulmajid dari Sumenep, Atang dari Bandung dan Baso dari Gowa. Di bawah menara masjid yang menjulang, mereka berenam kerap menunggu maghrib sambil menatap awan lembayung yang berarak pulang ke ufuk. Di mata belia mereka, awan-awan itu menjelma menjadi negara dan benua impian masing-masing. Kemana impian jiwa muda ini membawa mereka? Mereka tidak tahu. Yang mereka tahu adalah: Jangan pernah remehkan impian, walau setinggi apa pun. Tuhan sungguh Maha Mendengar.", "Bagaimana perjalanan mereka ke ujung dunia ini dimulai? Siapa horor nomor satu mereka? Apa pengalaman mendebarkan di tengah malam buta di sebelah sungai tempat jin buang anak? Bagaimana sampai ada yang kasak-kusuk menjadi mata-mata misterius? Siapa Princess of Madani yang mereka kejar-kejar? Kenapa mereka harus botak berkilat-kilat? Bagaimana sampai Icuk Sugiarto, Arnold Schwarzenegger, Ibnu Rusyd, bahkan Maradona sampai akhirnya ikut campur? Ikuti perjalanan hidup yang inspiratif ini langsung dari mata para pelakunya. Negeri Lima Menara adalah buku pertama dari sebuah trilogi."], "author": "Ahmad Fuadi", "num_pages": "432", "awards": ["Kusala Sastra Khatulistiwa Nominee for Fiksi - longlist (2010)", "Penulis dan Buku Fiksi Terfavorit", "Anugerah Pembaca Indonesia for Buku dan Penulis Fiksi Terfavorit (2010)"], "places": [], "character_names": ["Alif, Raja, Atang, Said, Dulmajid, Baso, Randai, Sarah", "Amak, Kiai Rais, Ustad Salman, Tyson"], "language": "Indonesian", "publish_date": "2009-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10862975-perjalanan-meminang-bidadari", "num_ratings": "29", "num_reviews": "5", "avg_ratings": 4.24, "genres": ["Religion", "Islam"], "title": "Perjalanan Meminang Bidadari", "description": ["Segala sesuatu selalu memiliki dua sisi. Entah benda, apalagi manusia dan pikirannya. Seseorang bisa dianggap sebagai pahlawan di satu sisi, tapi bisa juga sebagai penjahat di sisi lain. Dianggap kawan bagi sekelempok orang, tapi musuh bagi sekelompok yang lain.", "Dua sisi tersebut berlaku juga untuk 10 tokoh dalam buku ini. Kisah sepuluh lelaki yang menolak menyerah kepada p", "Segala sesuatu selalu memiliki dua sisi. Entah benda, apalagi manusia dan pikirannya. Seseorang bisa dianggap sebagai pahlawan di satu sisi, tapi bisa juga sebagai penjahat di sisi lain. Dianggap kawan bagi sekelempok orang, tapi musuh bagi sekelompok yang lain.", "Dua sisi tersebut berlaku juga untuk 10 tokoh dalam buku ini. Kisah sepuluh lelaki yang menolak menyerah kepada penguasa lalim. Menolak tunduk pada penjajahan manusia atas manusia. Dan menolak menjadi manusia yang kerdil dan penakut. Mereka lahir dari daerah yang berbeda, bahasa yang tak sama, dan kebudayaan yang tak serupa, tapi mereka memiliki ide dan pemikiran yang satu: memperjuangkan kemuliaan dien Allah.", "Mereka adalah Omar Mukhtar, Hasan Al Banna, Sayyid Quthb, Yahya Ayyash, Syeikh Ahmad Yassin, Abdul Aziz Rantissi, Abdullah Azzam, Dzokhar Musayevich Dudayev, Ibnul Khattab, dan Abdallah Syamil Salmanovich Basayev.", "Dengan lihai penulis meramu kisah para tokoh tersebut menjadi kisah yang penuh semangat menggugah. Buku ini dipersembahkan untuk para pencari ridha Allah di mana pun mereka berada."], "author": "Herry Nurdi", "num_pages": "212", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2011-03-16 00:00:00", "ISBN": "6028851138"},
{"url": "https://www.goodreads.com/book/show/8013459-muhammad-the-messenger", "num_ratings": "91", "num_reviews": "16", "avg_ratings": 4.12, "genres": ["Religion", "Islam", "History", "Biography"], "title": "Muhammad The Messenger", "description": ["SOSOK MUHAMMAD SEBAGAI MANUSIA BIASA", "Sudah ratusan bahkan ribuan jilid buku yang ditulis tentang Rasulullah Muhammad SAW. Namun, umumnya buku-buku tesebut lebih banyak membicarakan Muhammad sebagai seorang Nabi dan Rasul terakhir yang diutus oleh Allah SWT kepada umat manusia untuk mengibarkan panji-panji Islam. Sebagian besar buku sejarah Islam hanya berputar-putar di seki", "SOSOK MUHAMMAD SEBAGAI MANUSIA BIASA", "Sudah ratusan bahkan ribuan jilid buku yang ditulis tentang Rasulullah Muhammad SAW. Namun, umumnya buku-buku tesebut lebih banyak membicarakan Muhammad sebagai seorang Nabi dan Rasul terakhir yang diutus oleh Allah SWT kepada umat manusia untuk mengibarkan panji-panji Islam. Sebagian besar buku sejarah Islam hanya berputar-putar di sekitar kenabian, smukjizat, kerasulan, bukan tentang seorang manusia pembebas. ", "Masih relatif sedikit buku yang mengupas sosok Muhammad sebagai manusia biasa, bukan sebagai nabi. Di antara buku yang langka tersebut, buku karya Abdurrahman Asy Syarqawi ini merupakan salah satunya. Buku novel sejarah ini merupakan rekam jejak penuh kemuliaan Rasulullah SAW. Buku yang tampil dalam kemasan klasik ini akan membawa kita mengenal lebih jauh. Muhammad sebagai sosok langit yang tetap membumi: berjalan-jalan di pasar, makan,tertawa, menangis, dan menjadi pembebas kaum tertindas. Seperti ditegaskan oleh penulis pada mukadimahnya, \"... saya tetap berharap bahwa buku yang saya tulis ini akan menambah realitas yang baru dalam karya tulis sejarah.\"", "Ia menambahkan, dalam buku ini ia ingin mengungkap kisah seorang anak manusia yang memiliki kejernihan hati dan keluasan pikiran untuk menampung problematika kehidupan. Dia membawa ajaran yang mampu melahirkan peradaban laksana bunga yang berkembang dengan subur sehingga menjadi peradaban dunia yang mampu bertahan sepanjang abad. Tidak hanya itu, ajarannya memberikan dorongan untuk senantiasa mengaraahkan manusia pada kemajuan serta membuka wawasan mengenai kehidupan manusia.", "Penulis membuka bukunya dengan mengangkat kehidupan Mekah abad VII yang penuh dengan keboborakan dan kemaksiatan. Kemudain penulis bicara tentang Abdullah: ayah Rasulullah, disusul dengan pembahasan Muhammad sebagai penggembala. Bab-bab berikutnya bercerita tentang romantika Muhammad dan pernikahannya dengan Khadijah, para pencari kebenaran (Abu Bakar, Muhammad dan lain-lain), Muhammad diangakat menjadi Nabi, luluhnya hati Sang Singa (Umar bin Khatthab), masa kesedihan (cobaan-cobaan yang menimpa Rasulullah dan kaum Muslimin), mencari bumi tempat berpijak dan hijrah. Bab-bab berikutnya memaparkan tentang perang demi perang yang dilalui oleh Rasulullah dan kaum Muslimin, hingga penaklukan Mekah dan Thaif, Akhir cerita ini sampai kepada pereistiwa kematian Rasulullah SAW yang sangat mengharukan.", "Buku ini sangat perlu dibaca oleh setiap Muslimin agar dapat mengenal lebih dalam dan utuh sosok sang Nabi terakhir, Muhammad Rasulullah SAW. Sosok manusia yang ajaran langitnya menggema hingga belasan abad setelah wafatnya. Miliaran penduduk bumi mengkuti jalannya, dan namanya diucuapkan umatnya setiap hari.", "Bahkan buku ini pun perlu dibaca oleh kalangan non-Muslim, agar dapat memahami sosok manusia bernama Muhammad secara tepat dan jauh dari prasangka. Seperti ditegaskan oleh penulis, \" Kita benar-benar membutuhkan beratus-ratus literatur yang dapat dibaca oleh seluruh umat manusia, baik mereka yang beriman kepada kenabian Muhammad maupun yang mengingkarinya\"."], "author": "Abdurrahman Asy Syarqawi", "num_pages": "596", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2010-02-16 00:00:00", "ISBN": "9789790550"},
{"url": "https://www.goodreads.com/book/show/18231846-yuk-berhijab", "num_ratings": "1,109", "num_reviews": "102", "avg_ratings": 4.33, "genres": ["Religion", "Islam", "Nonfiction", "Religion", "Asian Literature", "Indonesian Literature"], "title": "Yuk, Berhijab!", "description": ["Kebanyakan kaum Muslim, walau agama mereka Islam, memang awam dengan penampakan penutup aurat yang syar'i, yang benar menurut pandangan dalil-dalil Islam. Karena itu, sedikit sekali yang memperhatikan masalah menutup aurat ini.", "Adapun yang sudah mengetahui, rupanya belum sempurna dalam memahami dalil, merancukan antara jilbab dan kerudung, bahkan menyamakan keduanya. Atau m", "Kebanyakan kaum Muslim, walau agama mereka Islam, memang awam dengan penampakan penutup aurat yang syar'i, yang benar menurut pandangan dalil-dalil Islam. Karena itu, sedikit sekali yang memperhatikan masalah menutup aurat ini.", "Adapun yang sudah mengetahui, rupanya belum sempurna dalam memahami dalil, merancukan antara jilbab dan kerudung, bahkan menyamakan keduanya. Atau mengenakan penutup aurat, namun belumlah sempurna.", "Buku Yuk Berhijab! akan mengupas tentang penutup aurat, khususnya bagi Muslimah. Dalam Al-Quran ada dua pakaian yang disyariatkan sebagai penutup aurat yaitu kerudung (Khimar) dan Jilbab. Penutup aurat bagi muslim inilah yang disebut Hijab."], "author": "Felix Y. Siauw", "num_pages": "140", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2013-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1448818.Hari_Ini_Aku_Makin_Cantik", "num_ratings": "87", "num_reviews": "11", "avg_ratings": 3.7, "genres": ["Religion", "Islam", "Nonfiction", "Asian Literature", "Indonesian Literature"], "title": "Hari Ini Aku Makin Cantik", "description": ["Kumpulan kisah yang mengandung banyak hikmah."], "author": "Azimah Rahayu", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2005-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12044163-ketika-mas-gagah-pergi-dan-kembali", "num_ratings": "1,036", "num_reviews": "95", "avg_ratings": 4.04, "genres": ["Novels", "Religion", "Islam"], "title": "Ketika Mas Gagah Pergi... dan Kembali", "description": ["Copy editor : ", "Gita selalu bangga pada abangnya yang ia panggil Mas Gagah. Namun suatu hari Mas Gagah berubah! Berubah pula semua kehidupan Gita. Dan ketika kemudian Mas Gagah pergi, apa yang terjadi dengan Gita? Siapa Nadia Hayuningtyas dan lelaki berkemeja kotak-kotak yang selalu Gita lihat di dalam bus, kereta api dan di berbagai tempat itu? Dan mengapa le", "Copy editor : ", "Gita selalu bangga pada abangnya yang ia panggil Mas Gagah. Namun suatu hari Mas Gagah berubah! Berubah pula semua kehidupan Gita. Dan ketika kemudian Mas Gagah pergi, apa yang terjadi dengan Gita? Siapa Nadia Hayuningtyas dan lelaki berkemeja kotak-kotak yang selalu Gita lihat di dalam bus, kereta api dan di berbagai tempat itu? Dan mengapa lelaki itu mengingatkannya pada Mas Gagah?", "Dikembangkan dari sebuah karya legendaris, yang sangat menggetarkan dan membangkitkan semangat belajar Islam para remaja Indonesia sejak pertamakali diterbitkan di Majalah Annida 1993, hingga sekarang (Asma Nadia)"], "author": "Helvy Tiana Rosa", "num_pages": "245", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2011-08-16 00:00:00", "ISBN": "9786029672"},
{"url": "https://www.goodreads.com/book/show/3348630-la-tahzan-for-smart-muslimah", "num_ratings": "1,107", "num_reviews": "143", "avg_ratings": 4.06, "genres": ["Religion", "Islam", "Nonfiction", "Psychology"], "title": "La Tahzan For Smart Muslimah: Kiat Menjadi Wanita Teladan Dunia-Akhirat", "description": ["Menjadi wanita teladan tentu dambaan setiap muslimah. Lihatlah teladan-teladan Muslimah dimasa lalu; Fatimah Az zahra, Aisyah, Khadijah, dan para istri sahabat Rosulullah serta pejuang wanita dimasa awal islam. ", "Mereka semua menjadi teladan bersikap, bermasyarakat, dan rujukan hidup sepanjang masa dalam mengarungi kehidupan dunia yang fana ini untuk bekal kehidupan yang aba", "Menjadi wanita teladan tentu dambaan setiap muslimah. Lihatlah teladan-teladan Muslimah dimasa lalu; Fatimah Az zahra, Aisyah, Khadijah, dan para istri sahabat Rosulullah serta pejuang wanita dimasa awal islam. ", "Mereka semua menjadi teladan bersikap, bermasyarakat, dan rujukan hidup sepanjang masa dalam mengarungi kehidupan dunia yang fana ini untuk bekal kehidupan yang abadi kelak diakhirat.", "Buku ini mengajak kaum wanita untuk berbahagia dengan agamanya, bergembira dengan karunia Allah dan bersuka Cita dengan anugrah Allah yang telah dilimpahkan kepadanya. ", "Ibaratnya buku ini bagai senyuman cita, semilar asa, Kabar gembira bagi yang tengah terekan batinnya, bertubi-Tubi deritanya dan bertambah tebal awan kemurunganya. ", "Buku ini juga menyeru wanita agar bersabar menanti turunnya kemudahan setiap kali usai mengalami kesulitan. Karya ini akan berbicara kepada akalnya yang jernih, hatinya yang bersih, serta jiwanya yang suci."], "author": "عائض القرني", "num_pages": "316", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2008-08-16 00:00:00", "ISBN": "9793858303"},
{"url": "https://www.goodreads.com/book/show/1376220.Hafalan_Shalat_Delisa", "num_ratings": "8,455", "num_reviews": "727", "avg_ratings": 4.22, "genres": ["Novels", "Asian Literature", "Indonesian Literature", "Fiction", "Religion", "Islam", "Drama", "Family", "Religion", "Childrens", "Young Adult", "Childrens", "Middle Grade"], "title": "Hafalan Shalat Delisa", "description": ["Delisa anak perempuan yang bermata hijau, bening dan umurnya baru mencecah lima tahun. Dia hidup dalam keluarganya yang sebegitu, dia cuba menghafal bacaan dalam solat dengan bantuan ibu dan kakaknya.", "Namun Tuhan lebih tahu apa yang lebih baik untuk hamba-Nya. Tsunami datang melumatka senyuman pada wajah Delisa. Tsunami mengambil segala-galanya, keluarga juga kaki kecilnya.", "Delisa anak perempuan yang bermata hijau, bening dan umurnya baru mencecah lima tahun. Dia hidup dalam keluarganya yang sebegitu, dia cuba menghafal bacaan dalam solat dengan bantuan ibu dan kakaknya.", "Namun Tuhan lebih tahu apa yang lebih baik untuk hamba-Nya. Tsunami datang melumatka senyuman pada wajah Delisa. Tsunami mengambil segala-galanya, keluarga juga kaki kecilnya. Yang tersisa, hanya dia dan ayahnya, dan dalam keadaan sebegitu apakah Delisa mampu tetap tersenyum seperti dahulu dan menyudahkan hafalannya?"], "author": "Tere Liye", "num_pages": "248", "awards": [], "places": ["Lhok Nga"], "character_names": ["Delisa", "Aisyah", "Zahra", "Fatimah"], "language": "Indonesian", "publish_date": "2007-08-16 00:00:00", "ISBN": "9793210605"},
{"url": "https://www.goodreads.com/book/show/13414402-kau-aku-sepucuk-angpau-merah", "num_ratings": "5,834", "num_reviews": "561", "avg_ratings": 4.14, "genres": ["Novels", "Romance", "Fiction", "Asian Literature", "Indonesian Literature", "Love", "Contemporary", "Family", "Did Not Finish", "Womens Fiction", "Chick Lit", "Realistic Fiction", "Slice Of Life"], "title": "Kau, Aku & Sepucuk Angpau Merah", "description": ["Ada tujuh miliar penduduk bumi saat ini. Jika separuh saja dari mereka pernah jatuh cinta, maka setidaknya akan ada satu miliar lebih cerita cinta. Akan ada setidaknya 5 kali dalam setiap detik, 300 kali dalam semenit, 18.000 kali dalam setiap jam, dan nyaris setengah juta sehari-semalam, seseorang entah di belahan dunia mana, berbinar, harap-harap cemas, gemetar, malu-mal", "Ada tujuh miliar penduduk bumi saat ini. Jika separuh saja dari mereka pernah jatuh cinta, maka setidaknya akan ada satu miliar lebih cerita cinta. Akan ada setidaknya 5 kali dalam setiap detik, 300 kali dalam semenit, 18.000 kali dalam setiap jam, dan nyaris setengah juta sehari-semalam, seseorang entah di belahan dunia mana, berbinar, harap-harap cemas, gemetar, malu-malu menyatakan perasaanya. ", "Apakah Kau, Aku, dan Sepucuk Angpau Merah ini sama spesialnya dengan miliaran cerita cinta lain? Sama istimewanya dengan kisah cinta kita? Ah, kita tidak memerlukan sinopsis untuk memulai membaca cerita ini. Juga tidak memerlukan komentar dari orang-orang terkenal. Cukup dari teman, kerabat, tetangga sebelah rumah. Nah, setelah tiba di halaman terakhir, sampaikan, sampaikan ke mana-mana seberapa spesial kisah cinta ini. Ceritakan kepada mereka. ", "Seperti biasa, Tere Liye selalu bisa mencungkil hal-hal istimewa dari kehidupan yang tidak menarik perhatian. Belinda, calon dokter gigi", "Tentang cinta pertama yang begitu memukau, mengajari tetapi tidak menggurui. Ayu Aditya Saputri, calon guru SLB ", "Jika selama ini kita sering dijejali cerita cinta termehek-mehek, maka Borno dan Mei adalah orisinal cerita cinta tentang pengorbanan yang tidak akan membuat kita menjadi mellow. Ariza, guru TK ", "Novel yang berbeda. Mengangkat profesi yang tidak pernah ada di novel mana pun. Kisah cinta yang sederhana, indah, dan klasik. Umi Futikhah, guru", "Saya berdoa semoga saya bisa menjadikan anak lelaki saya “bujang berhati paling lurus” seperti Borno. Amin. Putri, buruh pabrik"], "author": "Tere Liye", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2012-01-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4962379-jalan-cinta-para-pejuang", "num_ratings": "1,310", "num_reviews": "117", "avg_ratings": 4.27, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Self Help"], "title": "Jalan Cinta Para Pejuang", "description": ["di sana, ada cita dan tujuan", "yang membuatmu menatap jauh ke depan", "di kala malam begitu pekat", "dan mata sebaiknya dipejam saja", "cintamu masih lincah melesat", "jauh melampaui ruang dan masa", "kelananya menjejakkan mimpi-mimpi", "lalu disengaja malam terakhir", "engkau terjaga, sadar, dan memilih menyalakan lampu", "melanjutkan mimpi indah yang belum selesai", "dengan cita yang besar, tinggi, dan bening", "di sana, ada cita dan tujuan", "yang membuatmu menatap jauh ke depan", "di kala malam begitu pekat", "dan mata sebaiknya dipejam saja", "cintamu masih lincah melesat", "jauh melampaui ruang dan masa", "kelananya menjejakkan mimpi-mimpi", "lalu disengaja malam terakhir", "engkau terjaga, sadar, dan memilih menyalakan lampu", "melanjutkan mimpi indah yang belum selesai", "dengan cita yang besar, tinggi, dan bening", "dengan gairah untuk menerjemahkan cinta sebagai kerja", "dengan nurani, tempatmu berkaca tiap kali", "dan cinta yang selalu mendengarkan suara hati", "teruslah melanglang di jalan cinta para pejuang", "menebar kebajikan, menghentikan kebiaaban, menyeru pada iman", "walau duri merantaskan kaki,", "walau kerikil mencacah telapak", "sampai engkau lelah, sampai engkau payah", "sampai keringat dan darah tumpah", "tetapi yakinlah, bidadarimu akan tetap tersenyum", "di jalan cinta para pejuang", "Salim A. Fillah"], "author": "Salim Akhukum Fillah", "num_pages": "344", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2008-08-16 00:00:00", "ISBN": "9791273081"},
{"url": "https://www.goodreads.com/book/show/17375790-udah-putusin-aja", "num_ratings": "2,631", "num_reviews": "283", "avg_ratings": 4.28, "genres": ["Religion", "Islam", "Nonfiction", "Religion", "Romance"], "title": "Udah Putusin Aja!", "description": ["Islam tidak pernah mengharamkan cinta. Islam mengarahkan cinta agar ia berjalan pada koridornya. Bila bicara cinta di antara lawan jenis, satu-satunya jalan adalah dengan pernikahan, yang dengannya cinta menjadi halal dan penuh keberkahan. Sebaliknya, Islam melarang keras segala jenis interaksi cinta yang tiada halal. Bukan karena apa pun, tapi karena Islam adalah agama ya", "Islam tidak pernah mengharamkan cinta. Islam mengarahkan cinta agar ia berjalan pada koridornya. Bila bicara cinta di antara lawan jenis, satu-satunya jalan adalah dengan pernikahan, yang dengannya cinta menjadi halal dan penuh keberkahan. Sebaliknya, Islam melarang keras segala jenis interaksi cinta yang tiada halal. Bukan karena apa pun, tapi karena Islam adalah agama yang memuliakan manusia dan mencegah kerusakan-kerusakan yang akan terjadi pada diri manusia itu sendiri.", "Sialnya, kaum Muslim kini hidup dalam kungkungan masyarakat yang sebagian besar salah kaprah dalam cinta. Karenanya tidak dikenal lagi kesakralan pernikahan dan kesucian diri, apalagi kehormatan dan kemuliaan jiwa. Semua sudah terganti dengan pergaulan bebas, ada yang menyebutnya pacaran, teman tapi mesra, dibalut dalam alasan kakak-adik, teman dekat, ataupun yang lainnya.", "#UdahPutusinAja, sebab apa pun namanya, kelak akan bersaksi seluruh bagian tubuh di depan Allah. Karenanya, sedari dini mari mendidik cinta, mengajarinya agar ia bersemi dalam taat, bukan direndahkan oleh maksiat. Ajarkan cinta agar ia benar hingga membuat pemiliknya terhormat, bukan nista yang ditanggung karena terbuai cinta yang terlaknat."], "author": "Felix Y. Siauw", "num_pages": "180", "awards": ["Anugerah Pembaca Indonesia Nominee for Penulis dan Buku Non-Fiksi Terfavorit - Shortlist & Sampul Buku Non-Fiksi Terfavorit - Shortlist (2013)"], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2013-02-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/646462.Qur_an_", "num_ratings": "48,707", "num_reviews": "2,771", "avg_ratings": 4.34, "genres": ["Religion", "Religion", "Islam", "Nonfiction", "Classics", "Philosophy", "Spirituality", "Reference", "History", "Religion", "Theology", "Fantasy", "Mythology"], "title": "Qurʾan / القرآن الكريم", "description": ["The Quran (English pronunciation: /kɔrˈɑːn/; Arabic: القرآن al-qurʾān, IPA: [qurˈʔaːn], literally meaning \"the recitation\"), also transliterated Qur'an, Koran, Al-Coran, Coran, Kuran, and Al-Qur'an, is the central religious text of Islam, which Muslims believe to be the verbatim word of God (Arabic: الله, Allah). ", "The Quran is composed of verses (Ayat) that make up 114 chap", "The Quran (English pronunciation: /kɔrˈɑːn/; Arabic: القرآن‎ al-qurʾān, IPA: [qurˈʔaːn], literally meaning \"the recitation\"), also transliterated Qur'an, Koran, Al-Coran, Coran, Kuran, and Al-Qur'an, is the central religious text of Islam, which Muslims believe to be the verbatim word of God (Arabic: الله‎, Allah). ", "The Quran is composed of verses (Ayat) that make up 114 chapters (suras) of unequal length which are classified either as Meccan (المكية) or Medinan (المدنية) depending upon the place and time of their claimed revelation. Muslims believe the Quran to be verbally revealed through the angel Jibrīl (Gabriel) from God to Muhammad gradually over a period of approximately 23 years beginning on 22 December 609 CE, when Muhammad was 40, and concluding in 632 CE, the year of his death.", "Muslims regard the Quran as the main miracle of Muhammad, the proof of his prophethood and the culmination of a series of divine messages that started with the messages revealed to Adam, regarded in Islam as the first prophet, and continued with Suhuf Ibrahim (Scrolls of Abraham), the Tawrat (Torah or Pentateuch) of Moses, the Zabur (Tehillim or Book of Psalms) of David, and the Injil (Gospel) of Jesus. The Quran assumes familiarity with major narratives recounted in Jewish and Christian scriptures, summarizing some, dwelling at length on others and in some cases presenting alternative accounts and interpretations of events. The Quran describes itself as a book of guidance, sometimes offering detailed accounts of specific historical events, and often emphasizing the moral significance of an event over its narrative sequence."], "author": "Anonymous", "num_pages": "604", "awards": [], "places": [], "character_names": ["Moses (jewish leader)", "Abraham (patriarch of 3 religions)", "Adam (Bible)", "Jesus", "Mary (mother of Jesus)"], "language": "Arabic", "publish_date": "0650-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8245199-dalam-dekapan-ukhuwah", "num_ratings": "1,753", "num_reviews": "127", "avg_ratings": 4.36, "genres": ["Religion", "Islam", "Self Help", "Religion", "Nonfiction"], "title": "Dalam Dekapan Ukhuwah", "description": ["Di buku ini, Dalam Dekapan Ukhuwah, kita ingin meninggalkan bayang-bayang Narcissus. Kita ingin kecintaan pada diri berhijrah menjadi cinta sesama yang melahirkan peradaban cinta. Dari Narcissus yang dongeng, kita menuju Muhammad yang menyejarah. Pribadi semacam Sang Nabi ini yang akan menjadi telisik pembelajaran kita. Inilah pribadi pencipta ukhuwah, pribadi perajut pers", "Di buku ini, Dalam Dekapan Ukhuwah, kita ingin meninggalkan bayang-bayang Narcissus. Kita ingin kecintaan pada diri berhijrah menjadi cinta sesama yang melahirkan peradaban cinta. Dari Narcissus yang dongeng, kita menuju Muhammad yang menyejarah. Pribadi semacam Sang Nabi ini yang akan menjadi telisik pembelajaran kita. Inilah pribadi pencipta ukhuwah, pribadi perajut persaudaraan, pembawa kedamaian, dan beserta itu semua; pribadi penyampai kebenaran.", "Tak ayal, kita harus memulainya dari satu kata. Iman. Karena ada tertulis, yang mukmin lah yang bisa bersaudara dengan ukhuwah sejati. Iman itu pembenaran dalam hati, ikrar dengan lisan, dan amal dengan perbuatan. Kita faham bahwa yang di hati tersembunyi, lisan bisa berdusta, dan amal bisa dipura-pura. Maka Allah dan RasulNya telah meletakkan banyak ukuran iman dalam kualitas hubungan kita dengan sesama. Setidaknya, terjaganya mereka dari gangguan lisan dan tangan kita. Dan itulah batas terrendah dalam dekapan ukhuwah.", "Dalam dekapan ukhuwah kita menghayati pesan Sang Nabi. “Jangan kalian saling membenci”, begitu beliau bersabda seperti dicatat Al Bukhari dalam Shahihnya, “Jangan kalian saling mendengki, dan jangan saling membelakangi karena permusuhan dalam hati.. Tetapi jadilah hamba-hamba Allah yang bersaudara..”", "Dalam dekapan ukhuwah kita mendaki menuju puncak segala hubungan, yakni taqwa. Sebab, firmanNya tentang penciptaan insan yang berbangsa dan bersuku-suku untuk saling mengenal ditutup dengan penegasan bahwa kemuliaan terletak pada ketaqwaan. Dan ada tertulis, para kekasih di akhirat kelak akan menjadi seteru satu sama lain, kecuali mereka yang bertaqwa.", "Dalam dekapan ukhuwah, kita mengambil cinta dari langit. Lalu menebarkannya di bumi. Sungguh di surga, menara-menara cahaya menjulang untuk hati yang saling mencinta. Mari membangunnya dari sini, dalam dekapan ukhuwah. Jadilah ia persaudaraan kita; sebening prasangka, sepeka nurani, sehangat semangat, senikmat berbagi, dan sekokoh janji.", "Dalam dekapan ukhuwah, kita akan mengeja makna-makna itu, menjadikannya bekal untuk menjadi pribadi pencipta ukhuwah, pribadi perajut persaudaraan, pembawa kedamaian, dan beserta itu semua; pribadi penyampai kebenaran. Dalam dekapan ukhuwah, kita tinggalkan Narcissus yang dongeng menuju Muhammad yang mulia dan nyata. Namanya terpuji di langit dan bumi."], "author": "Salim Akhukum Fillah", "num_pages": "472", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2010-08-16 00:00:00", "ISBN": "9791273669"},
{"url": "https://www.goodreads.com/book/show/1840887.Khadijah", "num_ratings": "885", "num_reviews": "96", "avg_ratings": 4.2, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Biography", "Love", "True Story", "History"], "title": "Khadijah: The True Love Story of Muhammad SAW", "description": ["Tak dapat dimungkiri, Khadijah, istri Rasulullah merupakan sosok yang fenomenal. Integritas, kesucian diri, keimanan, dan komitmennya untuk terus menyokong lalu berkorban demi dakwah memang luar biasa. Sisi-sisi kehidupan Khadijah dikupas oleh Abdul Mun'im Muhammad melalui kisah-kisah perjalanannya mendampingi Rasulullah. Sejak awal pertemuan, detik-detik kegelisahan Khadi", "Tak dapat dimungkiri, Khadijah, istri Rasulullah merupakan sosok yang fenomenal. Integritas, kesucian diri, keimanan, dan komitmennya untuk terus menyokong lalu berkorban demi dakwah memang luar biasa. Sisi-sisi kehidupan Khadijah dikupas oleh Abdul Mun'im Muhammad melalui kisah-kisah perjalanannya mendampingi Rasulullah. Sejak awal pertemuan, detik-detik kegelisahan Khadijah ketika tak kunjung hamil, semangat juangnya dalam membela Nabi, hingga masa akhir kehidupannya. Inilah kisah Khadijah, cinta sejati Rasulullah. "], "author": "Abdul Mun'im Muhammad", "num_pages": "374", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2006-08-16 00:00:00"}
]