[
{"url": "https://www.goodreads.com/book/show/693208.The_Absolutely_True_Diary_of_a_Part_Time_Indian", "num_ratings": "191,231", "num_reviews": "21,153", "avg_ratings": 4.12, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Contemporary", "Humor"], "title": "The Absolutely True Diary of a Part-Time Indian", "description": ["Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolut", "Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolutely True Diary of a Part-Time Indian, which is based on the author's own experiences, coupled with poignant drawings by Ellen Forney that reflect the character's art, chronicles the contemporary adolescence of one Native American boy as he attempts to break away from the life he was destined to live.", "With a forward by Markus Zusak, interviews with Sherman Alexie and Ellen Forney, and four-color interior art throughout, this edition is perfect for fans and collectors alike. "], "author": "Sherman Alexie", "num_pages": "230", "awards": ["National Book Award for Young People's Literature (2007)", "Odyssey Award (2009)", "American Indian Library Association Award", "South Carolina Book Award Nominee for Young Adult Book Award (2010)", "Michigan Library Association Thumbs Up! Award Nominee (2008)", "Florida Teens Read Nominee (2009)", "American Indian Youth Literature Award for Best Young Adult Book (Award Retroactively Rescinded in 2018) (2008)", "Boston Globe-Horn Book Award for Fiction (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2010)", "Lincoln Award Nominee (2011)", "James Cook Book Award Nominee (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["United States of America", "Washington (the state)"], "character_names": ["Arnold \"Junior\" Spirit", "Coach", "Rowdy", "Mary \"Runs Away\" Spirit", "Mr. P", "Agnes Adams / Spirit", "Melinda", "Mr. Grant", "Penelope (divers)", "Micah", "Roger \"The Giant\"", "Grandma Spirit", "Eugene", "Dawn", "Mr. Dodge", "Gordy", "Dad Spirit", "Rowdy's Dad", "Mr. Sheridan", "Earl", "Gerald", "Ted", "Bobby"], "language": "English", "publish_date": "2007-09-12 00:00:00", "ISBN": "0316013684"},
{"url": "https://www.goodreads.com/book/show/106540.Tales_of_Burning_Love", "num_ratings": "2,193", "num_reviews": "143", "avg_ratings": 3.87, "genres": ["Fiction", "Novels", "Literary Fiction"], "title": "Tales of Burning Love", "description": ["In her boldest and most darkly humorous novel yet, award-winning, critically acclaimed and bestselling novelist Louise Erdrich tells the intimate and powerful stories of five Great Plains women whose lives are connected through one man. Stranded in a North Dakota blizzard, Jack Mauser's former wives huddle for warmth and pass the endless night by remembering the stories of", "In her boldest and most darkly humorous novel yet, award-winning, critically acclaimed and bestselling novelist Louise Erdrich tells the intimate and powerful stories of five Great Plains women whose lives are connected through one man. Stranded in a North Dakota blizzard, Jack Mauser's former wives huddle for warmth and pass the endless night by remembering the stories of how each came to love, marry and ultimately move beyond Jack. At times painful, at times heartbreaking and often times comic, their tales become the adhesive that holds them together in their love for Jack and in their lives as women.", "Erdrich, with her characteristic powers of observation and luminescent prose, brings these women's unforgettable stories to life with astonishing candor and warmth. Filled with keen perceptions about the apparatus for survival, the force of passion and the necessity of hope, \"Tales of Burning Love\" is a tour de force from one of the most formidable American writers at work today.\"Her most daring and perhaps her most compelling....A wise, wonderful, and wickedly funny novel.\" \"--Booklist\""], "author": "Louise Erdrich", "num_pages": "464", "awards": ["Minnesota Book Award for Novels (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-14 00:00:00", "ISBN": "0060928360"},
{"url": "https://www.goodreads.com/book/show/823411.Three_Day_Road", "num_ratings": "17,873", "num_reviews": "1,482", "avg_ratings": 4.31, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Canada", "War"], "title": "Three Day Road", "description": ["It is 1919, and Niska, the last Oji-Cree woman to live off the land, has received word that one of the two boys she saw off to the Great War has returned. Xavier Bird, her sole living relation, is gravely wounded and addicted to morphine. As Niska slowly paddles her canoe on the three-day journey to bring Xavier home, travelling through the stark but stunning landscape of", "It is 1919, and Niska, the last Oji-Cree woman to live off the land, has received word that one of the two boys she saw off to the Great War has returned. Xavier Bird, her sole living relation, is gravely wounded and addicted to morphine. As Niska slowly paddles her canoe on the three-day journey to bring Xavier home, travelling through the stark but stunning landscape of Northern Ontario, their respective stories emerge—stories of Niska’s life among her kin and of Xavier’s horrifying experiences in the killing fields of Ypres and the Somme."], "author": "Joseph Boyden", "num_pages": "384", "awards": ["Canadian Booksellers Association Libris Award for Fiction Book (2006)", "Canadian Authors Association Award for Fiction (2006)", "Rogers Writers' Trust Fiction Prize (2005)", "McNally Robinson Aboriginal Book of the Year Award", "Amazon.ca First Novel Award (2005)", "OLA Evergreen Award (2006)"], "places": [], "character_names": ["Xavier Bird", "Niska", "Elijah Whiskeyjack"], "language": "English", "publish_date": "2006-03-14 00:00:00", "ISBN": "0143017861"},
{"url": "https://www.goodreads.com/book/show/48093.The_Dark_Wind", "num_ratings": "6,485", "num_reviews": "218", "avg_ratings": 4.08, "genres": ["Mystery", "Fiction", "Thriller", "Mystery Thriller"], "title": "The Dark Wind", "description": ["A corpse whose palms and soles have been \"scalped\" is only the first in a series of disturbing clues: an airplane's mysterious crash in the nighttime desert, a bizarre attack on a windmill, a vanishing shipment of cocaine. Sgt. Jim Chee of the Navajo Tribal Police is trapped in the deadly web of a cunningly spun plot driven by Navajo sorcery and white man's greed."], "author": "Tony Hillerman", "num_pages": "290", "awards": [], "places": [], "character_names": ["Joe Leaphorn", "Jim Chee", "Cowboy Dashee", "Jake West", "Joe Musket"], "language": "English", "publish_date": "1990-01-25 00:00:00", "ISBN": "0061000035"},
{"url": "https://www.goodreads.com/book/show/425100.Dance_Hall_of_the_Dead", "num_ratings": "9,246", "num_reviews": "422", "avg_ratings": 4.01, "genres": ["Mystery", "Fiction", "Thriller", "Mystery Thriller", "Mystery", "Crime"], "title": "Dance Hall of the Dead", "description": ["Two Native-American boys have vanished into thin air, leaving a pool of blood behind them. Lieutenant Joe Leaphorn of the Navajo Tribal Police has no choice but to suspect the very worst, since the blood that stains the parched New Mexican ground once flowed through the veins of one of the missing, a young Zuñi. But his investigation into a terrible crime is being complica", "Two Native-American boys have vanished into thin air, leaving a pool of blood behind them. Lieutenant Joe Leaphorn of the Navajo Tribal Police has no choice but to suspect the very worst, since the blood that stains the parched New Mexican ground once flowed through the veins of one of the missing, a young Zuñi. But his investigation into a terrible crime is being complicated by an important archaeological dig . . . and a steel hypodermic needle. And the unique laws and sacred religious rites of the Zuñi people are throwing impassable roadblocks in Leaphorn's already twisted path, enabling a craven murderer to elude justice or, worse still, to kill again."], "author": "Tony Hillerman", "num_pages": "255", "awards": ["Grand Prix de Littérature Policière for Romans étrangers (1987)", "Edgar Award for Best Novel (1974)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Baker", "Suzanne Chambers", "Emma Leaphorn", "Halsey", "John O'Malley", "Cecil Bowlegs", "Chester Reynolds", "Ernesto Cata", "Father Ingles", "Shorty Bowlegs", "George Bowlegs", "Ted Isaacs"], "language": "English", "publish_date": "1990-04-04 00:00:00", "ISBN": "0061000027"},
{"url": "https://www.goodreads.com/book/show/46276.The_Grass_Dancer", "num_ratings": "2,268", "num_reviews": "131", "avg_ratings": 3.96, "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Magical Realism"], "title": "The Grass Dancer", "description": ["From the lore of her people, the Sioux, Susan Power presents an extraordinary debut novel rich in drama and infused with magic. Set on a North Dakota reservation, this book weaves the stories of the old and the young, broken families, romantic rivals, and men and women in love and at war."], "author": "Susan Power", "num_pages": "352", "awards": ["PEN/Hemingway Foundation Award (1995)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "1997-04-01 00:00:00", "ISBN": "0425159531"},
{"url": "https://www.goodreads.com/book/show/17174.A_Yellow_Raft_in_Blue_Water", "num_ratings": "15,884", "num_reviews": "910", "avg_ratings": 3.86, "genres": ["Fiction", "Classics", "Academic", "School"], "title": "A Yellow Raft in Blue Water", "description": ["Michael Dorris has crafted a fierce saga of three generations of Indian women, beset by hardships and torn by angry secrets, yet inextricably joined by the bonds of kinship. Starting in the present day and moving backward, the novel is told in the voices of the three women: fifteen-year-old part-black Rayona; her American Indian mother, Christine, consumed by tenderness an", "Michael Dorris has crafted a fierce saga of three generations of Indian women, beset by hardships and torn by angry secrets, yet inextricably joined by the bonds of kinship. Starting in the present day and moving backward, the novel is told in the voices of the three women: fifteen-year-old part-black Rayona; her American Indian mother, Christine, consumed by tenderness and resentment toward those she loves; and the fierce and mysterious Ida, mother and grandmother whose haunting secrets, betrayals, and dreams echo through the years, braiding together the strands of the shared past."], "author": "Michael Dorris", "num_pages": "372", "awards": [], "places": ["Montana"], "character_names": [], "language": "English", "publish_date": "2003-03-05 00:00:00", "ISBN": "0312421850"},
{"url": "https://www.goodreads.com/book/show/16205758-fallen-hopes-taken-dreams", "num_ratings": "63", "num_reviews": "19", "avg_ratings": 4.22, "genres": ["History", "Drama", "True Story"], "title": "Fallen Hopes, Taken Dreams", "description": ["It was the roaring twenties ... ", "Their only crime was being born Native American ...", "Still teenagers, their dreams were taken from them when they were wrongfully committed to our nation's only Indian insane asylum. Each had been dealt a life sentence in a place where hope was crushed and spirits destroyed. Once behind the barred windows and locked doors of the Canton Indian", "It was the roaring twenties ... ", "Their only crime was being born Native American ...", "Still teenagers, their dreams were taken from them when they were wrongfully committed to our nation's only Indian insane asylum. Each had been dealt a life sentence in a place where hope was crushed and spirits destroyed. Once behind the barred windows and locked doors of the Canton Indian Insane Asylum, they would endure unspeakable abuse and torture. Death was their only escape. There was no hope of release, until ...", "One would give them hope in this place that had no hope. One who would fire their spirits and breathe defiant life back into their souls.", "Some stories move our hearts; some stories move our minds--and some stories move our very souls. Fallen Hopes, Taken Dreams is the powerful, heart-wrenching story based on the records in the South Dakota State Archives for the Canton Indian Insane Asylum. ", "Much of what you will read is verifiable, but some has been fictionalized, along with characters and their names. Does this make the fiction untrue, or merely unverifiable? We can't know for certain what happened behind those walls. We only know what men were willing to document for history. The rest--along with their secrets--they decided to take to their graves."], "author": "J.M. Barlog", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2012-08-23 00:00:00", "ISBN": "1478353392"},
{"url": "https://www.goodreads.com/book/show/13364202-at-road-s-end", "num_ratings": "270", "num_reviews": "52", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Historical", "Fiction", "Romance"], "title": "At Road's End", "description": ["Tecpatl was born a warrior, one of the elite class of fighters, defending his great city, capturing vanquished foes to sacrifice for the honor of the gods.", "He never wished to follow the ancient road into the Southwestern desert; but he had no choice. ", "When he rescues a girl from a ransacked village, he thinks nothing of it. He just wishes to make the traders sell their goods", "Tecpatl was born a warrior, one of the elite class of fighters, defending his great city, capturing vanquished foes to sacrifice for the honor of the gods.", "He never wished to follow the ancient road into the Southwestern desert; but he had no choice. ", "When he rescues a girl from a ransacked village, he thinks nothing of it. He just wishes to make the traders sell their goods in a hurry, so he could return to his homeland. ", "But the fate had planned differently, for the warrior and for the girl alike."], "author": "Zoe Saadia", "num_pages": "150", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/127810.Two_Old_Women", "num_ratings": "6,113", "num_reviews": "1,041", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Adventure", "Survival"], "title": "Two Old Women: An Alaskan Legend of Betrayal, Courage and Survival", "description": ["Based on an Athabascan Indian legend passed along for many generations from mothers to daughters of the upper Yukon River Valley in Alaska, this is the suspenseful, shocking, ultimately inspirational tale of two old women abandoned by their tribe during a brutal winter famine.", "Though these women have been known to complain more than contribute, they now must either survive", "Based on an Athabascan Indian legend passed along for many generations from mothers to daughters of the upper Yukon River Valley in Alaska, this is the suspenseful, shocking, ultimately inspirational tale of two old women abandoned by their tribe during a brutal winter famine.", "Though these women have been known to complain more than contribute, they now must either survive on their own or die trying. In simple but vivid detail, Velma Wallis depicts a landscape and way of life that are at once merciless and starkly beautiful. In her old women, she has created two heroines of steely determination whose story of betrayal, friendship, community and forgiveness \"speaks straight to the heart with clarity, sweetness and wisdom\" (Ursula K. Le Guin)."], "author": "Velma Wallis", "num_pages": "140", "awards": ["Western States Book Award (1993)", "Pacific Northwest Booksellers Association Award (1994)"], "places": ["Alaska"], "character_names": ["Two old Athabaskan women", "Ch'idzigyaak", "Sa'"], "language": "English", "publish_date": "2004-06-29 00:00:00", "ISBN": "0060723521"},
{"url": "https://www.goodreads.com/book/show/24676287-the-foreigner", "num_ratings": "83", "num_reviews": "14", "avg_ratings": 4.52, "genres": ["History", "Historical Fiction", "Prehistoric"], "title": "The Foreigner", "description": ["Back in the Great League’s lands, trouble was brewing. The notorious Crooked Tongues from the other side of Lake Ontario, rumored to now be organized into a sort of an alliance, were posing a threat, more so than ever before. And yet, the War Chief, out of all people, was the one advocating negotiations, insisting on seeking a peaceful solution to the generations-long host", "Back in the Great League’s lands, trouble was brewing. The notorious Crooked Tongues from the other side of Lake Ontario, rumored to now be organized into a sort of an alliance, were posing a threat, more so than ever before. And yet, the War Chief, out of all people, was the one advocating negotiations, insisting on seeking a peaceful solution to the generations-long hostility and war. His followers were puzzled, the opposition outraged. ", "Meanwhile, Kentika has her own troubles to face. Was it ever easy for a foreigner to fit into a new life? For a girl who never even fit in among her own people, the challenge was becoming nearly impossible. But then, on top of it all, the political trouble hit. "], "author": "Zoe Saadia", "num_pages": "290", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/207569.The_Sign_of_the_Beaver", "num_ratings": "27,789", "num_reviews": "1,489", "avg_ratings": 3.78, "genres": ["Historical", "Historical Fiction", "Fiction", "Young Adult", "Childrens", "Classics"], "title": "The Sign of the Beaver", "description": ["Twelve-year-old Matt is left on his own in the Maine wilderness while his father leaves to bring the rest of the family to their new settlement. When he befriends Attean, an Indian chief's grandson, he is invited to join the Beaver tribe and move north. Should Matt abandon his hopes of ever seeing his family again and go on to a new life?"], "author": "Elizabeth George Speare", "num_pages": "135", "awards": ["Newbery Medal Nominee (1984)", "Scott O'Dell Award (1984)", "Christopher Award (1984)", "Young Hoosier Book Award Nominee (1983)", "Dorothy Canfield Fisher Children's Book Award Nominee (1985)", "Deutscher Jugendliteraturpreis Nominee (0)", "Boston Globe-Horn Book Award (1984)", "California Young Readers Medal Nominee for Intermediate (1987)", "Best Children's Books of the Year (Bank Street College of Education) (1983)"], "places": [], "character_names": [], "language": "English", "publish_date": "1993-04-01 00:00:00", "ISBN": "0440779030"},
{"url": "https://www.goodreads.com/book/show/57458.Fools_Crow", "num_ratings": "3,328", "num_reviews": "232", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Academic", "School", "Adult"], "title": "Fools Crow", "description": ["Set in Montana shortly after the Civil War, this novel tells of White Man's Dog (later known as Fools Crow so called after he killed the chief of the Crows during a raid), a young Blackfeet Indian on the verge of manhood, and his band, known as the Lone Eaters. The invasion of white society threatens to change their traditional way of life, and they must choose to fight or", "Set in Montana shortly after the Civil War, this novel tells of White Man's Dog (later known as Fools Crow so called after he killed the chief of the Crows during a raid), a young Blackfeet Indian on the verge of manhood, and his band, known as the Lone Eaters. The invasion of white society threatens to change their traditional way of life, and they must choose to fight or assimilate. ", "The story is a powerful portrait of a fading way of life. The story culminates with the historic Marias Massacre of 1870, in which the U.S. Cavalry mistakenly killed a friendly band of Blackfeet, consisting mostly of non-combatants.", "\"A major contribution to Native American literature.\" -- Wallace Stegner."], "author": "James Welch", "num_pages": "400", "awards": ["American Book Award (1987)", "Los Angeles Times Book Prize for Fiction (1987)"], "places": ["Montana"], "character_names": ["Siksika Indians", "Blackfeet Indians"], "language": "English", "publish_date": "1987-11-03 00:00:00", "ISBN": "0140089373"},
{"url": "https://www.goodreads.com/book/show/18527307-across-the-great-sparkling-water", "num_ratings": "174", "num_reviews": "26", "avg_ratings": 4.37, "genres": ["Historical", "Historical Fiction", "Historical"], "title": "Across the Great Sparkling Water", "description": ["To live in captivity, adopted by the enemies of her people, or to break the law and tradition by running away? ", "That question did not occur to Onheda until after she fled Little Falls on the spur of the moment, against any better judgment. If she was to die in the woods, making her way back to her people, accused, even by them, of breaking the ancient custom, it was still t", "To live in captivity, adopted by the enemies of her people, or to break the law and tradition by running away? ", "That question did not occur to Onheda until after she fled Little Falls on the spur of the moment, against any better judgment. If she was to die in the woods, making her way back to her people, accused, even by them, of breaking the ancient custom, it was still the better choice. She would not live among the enemies. Two moons of that had been more than enough.", "And yet, embarking upon her dangerous journey, she never expected to cross the path of the man who came to change the world of her people and their enemies alike. Who was he? A mysterious foreigner from across the Great Sparkling Water, a man with unusual ideas or the Messenger of the Great Spirits? And was he about to change her life, too?"], "author": "Zoe Saadia", "num_pages": "221", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/425098.A_Thief_of_Time", "num_ratings": "10,052", "num_reviews": "405", "avg_ratings": 4.06, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "A Thief of Time", "description": ["A noted anthropologist vanishes at a moonlit Indian ruin where \"thieves of time\" ravage sacred ground for profit. When two corpses appear amid stolen goods and bones at an ancient burial site, Navajo Tribal Policemen Lt. Joe Leaphorn and Officer Jim Chee must plunge into the past to unearth the astonishing truth behind a mystifying series of horrific murders."], "author": "Tony Hillerman", "num_pages": "352", "awards": ["Macavity Award for Best Mystery Novel (1989)", "Anthony Award Nominee for Best Novel (1989)", "Edgar Award Nominee for Best Novel (1989)"], "places": [], "character_names": ["Joe Leaphorn", "Jim Chee", "Eleanor Friedman-Bernal", "Maxie Davis", "Randy Elliott", "Slick Nakai", "Pete Etcitty", "Richard DuMont", "Harrison Houk", "Largo"], "language": "English", "publish_date": "1990-01-05 00:00:00", "ISBN": "0061000043"},
{"url": "https://www.goodreads.com/book/show/52879.Ten_Little_Indians", "num_ratings": "5,948", "num_reviews": "517", "avg_ratings": 4.08, "genres": ["Short Stories", "Fiction", "Contemporary"], "title": "Ten Little Indians", "description": ["Sherman Alexie offers nine poignant and emotionally resonant stories about Native Americans who find themselves at personal and cultural crossroads. In 'The Life and Times of Estelle Walks Above', an intellectual feminist Spokane Indian woman saves the lives of dozens of white women all around her, to the bewilderment of her only child. In 'Do You Know Where I Am?' two col", "Sherman Alexie offers nine poignant and emotionally resonant stories about Native Americans who find themselves at personal and cultural crossroads. In 'The Life and Times of Estelle Walks Above', an intellectual feminist Spokane Indian woman saves the lives of dozens of white women all around her, to the bewilderment of her only child. In 'Do You Know Where I Am?' two college sweethearts rescue a lost cat - a simple act that has profound moral consequences for the rest of their lives together. In 'What You Pawn I Will Redeem', a homeless Indian man must raise $1,000 in twenty-four hours to buy back the fancy dance outfit stolen from his grandmother fifty years earlier.", "Even as they often make us laugh, Sherman Alexie's stories are driven by a haunting lyricism and naked candour that cut to the heart of the human experience."], "author": "Sherman Alexie", "num_pages": "256", "awards": ["O. Henry Award for 'What You Pawn I Will Redeem' (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-06 00:00:00", "ISBN": "009946456X"},
{"url": "https://www.goodreads.com/book/show/48090.The_First_Eagle", "num_ratings": "5,120", "num_reviews": "217", "avg_ratings": 4.04, "genres": ["Mystery", "Fiction"], "title": "The First Eagle", "description": ["When Acting Lt. Jim Chee catches a Hopi poacher huddled over a butchered Navajo Tribal police officer, he has an open-and-shut case--until his former boss, Joe Leaphorn, blows it wide open. Now retired from the Navajo Tribal Police, Leaphorn has been hired to find a hot-headed female biologist hunting for the key to a virulent plague lurking in the Southwest. The scientist", "When Acting Lt. Jim Chee catches a Hopi poacher huddled over a butchered Navajo Tribal police officer, he has an open-and-shut case--until his former boss, Joe Leaphorn, blows it wide open. Now retired from the Navajo Tribal Police, Leaphorn has been hired to find a hot-headed female biologist hunting for the key to a virulent plague lurking in the Southwest. The scientist disappeared from the same area the same day the Navajo cop was murdered. Is she a suspect or another victim? And what about a report that a skinwalker--a Navajo witch--was seen at the same time and place too? For Leaphorn and Chee, the answers lie buried in a complicated knot of superstition and science, in a place where the worlds of native peoples and outside forces converge and collide."], "author": "Tony Hillerman", "num_pages": "319", "awards": [], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Jim Chee", "Janet Pete", "Cowboy Dashee", "Anderson Nez", "Louisa Bourbonette", "Robert Jano", "Benny Kinsman", "Catherine Pollard"], "language": "English", "publish_date": "1999-06-03 00:00:00", "ISBN": "0061097853"},
{"url": "https://www.goodreads.com/book/show/3128411-bone-crossed", "num_ratings": "85,016", "num_reviews": "2,585", "avg_ratings": 4.34, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Shapeshifters", "Werewolves"], "title": "Bone Crossed", "description": ["By day, Mercy is a car mechanic in the sprawling Tri-Cities of Eastern Washington. By night, she explores her preternatural side. As a shapeshifter with some unique talents, Mercy has often found herself having to maintain a tenuous harmony between the human and the not so human. This time she may get more than she bargained for.", "Marsilia, the local Vampire Queen, has learn", "By day, Mercy is a car mechanic in the sprawling Tri-Cities of Eastern Washington. By night, she explores her preternatural side. As a shapeshifter with some unique talents, Mercy has often found herself having to maintain a tenuous harmony between the human and the not so human. This time she may get more than she bargained for.", "Marsilia, the local Vampire Queen, has learned that Mercy crossed her by slaying a member of her clan—and she's out for blood. But since Mercy is protected from direct reprisal by the werewolf pack (and her close relationship with its sexy Alpha), it won't be Mercy's blood Marsilia is after.", "It'll be her friends'."], "author": "Patricia Briggs", "num_pages": "300", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Urban Fantasy (2009)", "P.E.A.R.L. (Paranormal Excellence Award for Romantic Literature) for Best Urban Fantasy Romance (2009)", "Goodreads Choice Award Nominee for Fantasy (2009)"], "places": ["United States of America", "Washington (the state)", "Tri-Cities, Washington", "Spokane, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Darryl Zao", "Warren", "Wulfe", "Kyle Brooks", "Stefan Uccello", "Marsilia", "Elizaveta Arkadyevna Vyshnevetskaya", "Uncle Mike", "Tony Montenegro", "Margi Thompson", "Ben (werewolf)"], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "1841496863"},
{"url": "https://www.goodreads.com/book/show/894111.People_of_the_Fire", "num_ratings": "8,332", "num_reviews": "95", "avg_ratings": 3.96, "genres": ["Fiction", "Historical", "Fantasy", "Historical Fiction", "Prehistoric"], "title": "People of the Fire", "author": "W. Michael Gear", "num_pages": "467", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-12-15 00:00:00", "ISBN": "0812521501"},
{"url": "https://www.goodreads.com/book/show/76987.The_Shaman_Sings", "num_ratings": "1,217", "num_reviews": "106", "avg_ratings": 3.88, "genres": ["Mystery", "Fiction", "Westerns", "Thriller", "Mystery Thriller"], "title": "The Shaman Sings", "description": ["The howling Coyote, messenger of the dwarf master pitukupf and dancing balls of fire, the bruja. These are the omens that appear to the aged Ute shaman Daisy Perika and her shepherd friend Nahum Yaciiti. Omens signaling the work of the Dark One among the matukach, the white people in this southwestern corner of Colorado. The brutal, late-night murder of graduate student Pr", "The howling Coyote, messenger of the dwarf master pitukupf and dancing balls of fire, the bruja. These are the omens that appear to the aged Ute shaman Daisy Perika and her shepherd friend Nahum Yaciiti. Omens signaling the work of the Dark One among the matukach, the white people in this southwestern corner of Colorado. The brutal, late-night murder of graduate student Priscilla Song in her physics laboratory is Chief Scott Parris's first homicide case since arriving from Chicago three years earlier. At first it looks open-and-shut, but loose ends quickly unravel to produce several possible suspects with equally pressing motives. With the help of lovely journalist Anne Foster and Daisy Perika, Parris just may be able to catch the killer before he selects another victim. First novelist James D. Doss juxtaposes two extremes of southwestern life to create a dramatic and moving story that is much more than simply a murder mystery. The people in these disparate worlds mingle with, give to, and take from one another. The reader is caught up in not only the discoveries of hard science, but what the old Shaman can see and effect when she sings."], "author": "James D. Doss", "num_pages": "256", "awards": [], "places": ["United States of America"], "character_names": ["Charlie Moon"], "language": "English", "publish_date": "1995-11-01 00:00:00", "ISBN": "0380724960"},
{"url": "https://www.goodreads.com/book/show/22719695-the-peacekeeper", "num_ratings": "97", "num_reviews": "13", "avg_ratings": 4.55, "genres": ["History", "Animals", "Adventure"], "title": "The Peacekeeper", "description": ["With the Great Peace established, new laws delivered, and important agreements reached, Two Rivers and Tekeni could now sit back and enjoy the fruits of their work, watching the union of Five Nations alive and kicking, functioning, maintaining the Peacemaker’s wonderful vision. Or so they thought… ", "Tekeni had never trusted the power-hungry Tadodaho, now the Head of the Grea", "With the Great Peace established, new laws delivered, and important agreements reached, Two Rivers and Tekeni could now sit back and enjoy the fruits of their work, watching the union of Five Nations alive and kicking, functioning, maintaining the Peacemaker’s wonderful vision. Or so they thought… ", "Tekeni had never trusted the power-hungry Tadodaho, now the Head of the Great Council. Yet, Two Rivers dismissed such warnings lightly, too lightly for Tekeni’s peace of mind. The devious man was up to something. Tekeni’s gut instincts screamed danger, but the Peacemaker kept waving his hand in dismissal, claiming that everything was under control. ", "And then, the Crooked Tongues entered the scene..."], "author": "Zoe Saadia", "num_pages": "329", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/297929.Urban_Shaman", "num_ratings": "13,398", "num_reviews": "765", "avg_ratings": 3.72, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Fantasy", "Magic", "Fiction", "Mystery"], "title": "Urban Shaman", "description": ["Joanne Walker has three days to learn to use her shamanic powers and save the world from the unleashed Wild Hunt.", "No worries. No pressure. Never mind the lack of sleep, the perplexing new talent for healing from fatal wounds, or the cryptic, talking coyote who appears in her dreams.", "And if all that's not bad enough, in the three years Joanne's been a cop, she's never seen a", "Joanne Walker has three days to learn to use her shamanic powers and save the world from the unleashed Wild Hunt.", "No worries. No pressure. Never mind the lack of sleep, the perplexing new talent for healing from fatal wounds, or the cryptic, talking coyote who appears in her dreams.", "And if all that's not bad enough, in the three years Joanne's been a cop, she's never seen a dead body -- but she's just come across her second in three days.", "It's been a bitch of a week. And it isn't over yet."], "author": "C.E. Murphy", "num_pages": "410", "awards": [], "places": ["United States of America"], "character_names": ["Joanne Walker", "Gary", "Coyote", "Cernunnos"], "language": "English", "publish_date": "2005-05-24 00:00:00", "ISBN": "0373802234"},
{"url": "https://www.goodreads.com/book/show/582143.People_of_the_Lightning", "num_ratings": "1,654", "num_reviews": "42", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy"], "title": "People of the Lightning", "description": ["People of the Lightning takes us to ancient Florida, to a village of fisher folk who must face their deepest fear: Pondwader, now a lanky boy of fifteen summers. He is the White Lightning Boy--the first of his kind to be born in tens of tens of summers. His white hair, pink eyes, and pale skin make him fearsome enough, but legends foretell that a Lightning Boy will make Si", "People of the Lightning takes us to ancient Florida, to a village of fisher folk who must face their deepest fear: Pondwader, now a lanky boy of fifteen summers. He is the White Lightning Boy--the first of his kind to be born in tens of tens of summers. His white hair, pink eyes, and pale skin make him fearsome enough, but legends foretell that a Lightning Boy will make Sister Moon bury her face in the clouds and weep falling stars--and the winds of destruction will be unleashed.", "The folk manage to trade him in marriage to Musselwhite, a woman warrior who does not really want him. She must face an old enemy who has captured her beloved husband, an enemy who is determined to destroy her. What good to her is this soft-hearted youth? She has yet to learn that Pondwader is a Lightning Boy. He can hear voices in the wind, telling of coming horror...."], "author": "Kathleen O'Neal Gear", "num_pages": "608", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-11-15 00:00:00", "ISBN": "0812515560"},
{"url": "https://www.goodreads.com/book/show/10363060-caleb-s-crossing", "num_ratings": "54,184", "num_reviews": "5,923", "avg_ratings": 3.82, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Audiobook"], "title": "Caleb's Crossing", "description": ["A richly imagined new novel from the author of the \"New York Times\" bestseller, \"People of the Book.\" ", " Once again, Geraldine Brooks takes a remarkable shard of history and brings it to vivid life. In 1665, a young man from Martha's Vineyard became the first Native American to graduate from Harvard College. Upon this slender factual scaffold, Brooks has created a luminous t", "A richly imagined new novel from the author of the \"New York Times\" bestseller, \"People of the Book.\" ", " Once again, Geraldine Brooks takes a remarkable shard of history and brings it to vivid life. In 1665, a young man from Martha's Vineyard became the first Native American to graduate from Harvard College. Upon this slender factual scaffold, Brooks has created a luminous tale of love and faith, magic and adventure. ", " The narrator of \"Caleb's Crossing\" is Bethia Mayfield, growing up in the tiny settlement of Great Harbor amid a small band of pioneers and Puritans. Restless and curious, she yearns after an education that is closed to her by her sex. As often as she can, she slips away to explore the island's glistening beaches and observe its native Wampanoag inhabitants. At twelve, she encounters Caleb, the young son of a chieftain, and the two forge a tentative secret friendship that draws each into the alien world of the other. Bethia's minister father tries to convert the Wampanoag, awakening the wrath of the tribe's shaman, against whose magic he must test his own beliefs. One of his projects becomes the education of Caleb, and a year later, Caleb is in Cambridge, studying Latin and Greek among the colonial elite. There, Bethia finds herself reluctantly indentured as a housekeeper and can closely observe Caleb's crossing of cultures. ", " Like Brooks's beloved narrator Anna in \"Year of Wonders,\" Bethia proves an emotionally irresistible guide to the wilds of Martha's Vineyard and the intimate spaces of the human heart. Evocative and utterly absorbing, \"Caleb's Crossing\" further establishes Brooks's place as one of our most acclaimed novelists."], "author": "Geraldine Brooks", "num_pages": "539", "awards": ["Queensland Premier's Literary Awards Nominee for Fiction (2011)", "Chautauqua Prize Nominee (2012)", "David J. Langum Sr. Prize Nominee for American Historical Fiction (Honorable Mention) (2011)", "One Book One San Diego (2013)"], "places": ["Martha's Vineyard, Massachusetts"], "character_names": ["Bethia Mayfield", "Caleb Cheeshahteaumuck", "Makepeace Mayfield", "Joel Iacoomis"], "language": "English", "publish_date": "2011-05-04 00:00:00", "ISBN": "1410437345"},
{"url": "https://www.goodreads.com/book/show/196429.Medicine_River", "num_ratings": "1,077", "num_reviews": "89", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Canada"], "title": "Medicine River", "description": ["When Will returns to Medicine River, he thinks he is simply attending his mother's funeral. He doesn't count on Harlen Bigbear and his unique brand of community planning. Harlen tries to sell Will on the idea of returning to Medicine River to open shop as the town's only Native photographer. Somehow, that's exactly what happens. Through Will's gentle and humorous narrative", "When Will returns to Medicine River, he thinks he is simply attending his mother's funeral. He doesn't count on Harlen Bigbear and his unique brand of community planning. Harlen tries to sell Will on the idea of returning to Medicine River to open shop as the town's only Native photographer. Somehow, that's exactly what happens. Through Will's gentle and humorous narrative, we come to know Medicine River, a small Albertan town bordering a Blackfoot reserve. And we meet its people: the basketball team; Louise Heavyman and her daughter, South Wing; Martha Oldcrow, the marriage doctor; Joe Bigbear, Harlen's world-travelling, storytelling brother; Bertha Morley, who has a short fling with a Calgary dating service; and David Plume, who went to Wounded Knee. At the centre of it all is Harlen, advising and pestering, annoying and entertaining, gossiping and benevolently interfering in the lives of his friends and neighbours."], "author": "Thomas King", "num_pages": "249", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-27 00:00:00", "ISBN": "014305435X"},
{"url": "https://www.goodreads.com/book/show/17621688-the-fall-of-the-empire", "num_ratings": "115", "num_reviews": "19", "avg_ratings": 4.4, "genres": ["Historical", "Historical Fiction", "Historical"], "title": "The Fall of the Empire", "description": ["Having just been advanced into the ranks of the first-class traders, Etl thought his life could not get any better. He was a trader of the Tepanec Empire, living in the Great Capital itself. Yes, there had been a war, an outright revolt by the united tributaries and other subdued nations of his beloved city-state, but those would be squashed easily. The Tepanecs were alway", "Having just been advanced into the ranks of the first-class traders, Etl thought his life could not get any better. He was a trader of the Tepanec Empire, living in the Great Capital itself. Yes, there had been a war, an outright revolt by the united tributaries and other subdued nations of his beloved city-state, but those would be squashed easily. The Tepanecs were always victorious.", "The only thing that made him worry was the decision of Tlalli, the girl from the marketplace he liked, to sell herself into the Palace’s services. He didn't want her to do that, having intended to take care of her himself, but the stubborn, pretty thing went on and did it all the same. Why? ", "Apparently, Tlalli was not just a simple market girl, but a young woman with a very unusual agenda. She had her own grudge to settle, and with no lesser person than the Emperor himself.", "But then the enemies struck…"], "author": "Zoe Saadia", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/285205.Blood_Bound", "num_ratings": "97,823", "num_reviews": "3,441", "avg_ratings": 4.31, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Shapeshifters", "Werewolves", "Romance", "Romance", "Paranormal Romance"], "title": "Blood Bound", "description": ["Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since", "Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since she can shapeshift at will, she agrees to act as some extra muscle when her vampire friend Stefan goes to deliver a message to another of his kind.", "But this new vampire is hardly ordinary-and neither is the demon inside of him."], "author": "Patricia Briggs", "num_pages": "292", "awards": [], "places": ["United States of America", "Washington (the state)", "Tri-Cities, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Charles Cornick", "Darryl Zao", "Warren", "Honey", "Wulfe", "Kyle Brooks", "Stefan Uccello", "Marsilia", "Uncle Mike", "Gabriel Sandoval", "Tony Montenegro", "Bran \"The Marrok\" Cornick", "Ben (werewolf)", "Andre (vampire)"], "language": "English", "publish_date": "2007-01-30 00:00:00", "ISBN": "0441014739"},
{"url": "https://www.goodreads.com/book/show/303917.Zia", "num_ratings": "3,748", "num_reviews": "203", "avg_ratings": 3.44, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens"], "title": "Zia", "author": "Scott O'Dell", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-06-08 00:00:00", "ISBN": "0440228174"},
{"url": "https://www.goodreads.com/book/show/16032513-the-highlander", "num_ratings": "697", "num_reviews": "113", "avg_ratings": 3.85, "genres": ["Historical", "Historical Fiction", "Historical", "Fiction"], "title": "The Highlander", "description": ["Born in the Highlands, Kuini thought his life was simple. You hunt and you fight, defending your towns against the raids of the Lowlanders and then raiding their lands in turn. His father was the Warriors’ Leader, and he wanted to be just like him.", "Yet, Texcoco, the mighty Capital of the Lowlands, seemed incredibly beautiful, sparkling, its pyramids magnificent. A friendshi", "Born in the Highlands, Kuini thought his life was simple. You hunt and you fight, defending your towns against the raids of the Lowlanders and then raiding their lands in turn. His father was the Warriors’ Leader, and he wanted to be just like him.", "Yet, Texcoco, the mighty Capital of the Lowlands, seemed incredibly beautiful, sparkling, its pyramids magnificent. A friendship with the Lowlander boy, the First Son of the Texcoco Emperor, seemed harmless in the beginning. They were just boys, and their clandestine meetings were always fun, providing great entertainment. ", "However, on the day Kuini agrees to finally enter the magnificent city, it would all change. He expected to get into trouble, but he could not foresee the extent of the trouble and, worst of all, he did not expect to uncover hidden secrets concerning his own family."], "author": "Zoe Saadia", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/484.Reinventing_the_Enemy_s_Language", "num_ratings": "252", "num_reviews": "13", "avg_ratings": 4.4, "genres": ["Poetry", "Fiction", "Anthologies", "Short Stories", "Feminism"], "title": "Reinventing the Enemy's Language: Contemporary Native Women's Writings of North America", "description": ["This long-awaited anthology celebrates the experience of Native American women and is at once an important contribution to our literature and an historical document. It is the most comprehensive anthology of its kind to collect poetry, fiction, prayer, and memoir from Native American women. Over eighty writers are represented from nearly fifty nations, including such natio", "This long-awaited anthology celebrates the experience of Native American women and is at once an important contribution to our literature and an historical document. It is the most comprehensive anthology of its kind to collect poetry, fiction, prayer, and memoir from Native American women. Over eighty writers are represented from nearly fifty nations, including such nationally known writers as Louise Erdrich, Linda Hogan, Leslie Marmon Silko, Lee Maracle, Janet Campbell Hale, and Luci Tapahonso; others — Wilma Mankiller, Winona LaDuke, and Bea Medicine — who are known primarily for their contributions to tribal communities; and some who are published here for the first time in this landmark volume."], "author": "Joy Harjo", "num_pages": "576", "awards": ["Gustavus Myers Outstanding Book Award"], "places": [], "character_names": [], "language": "English", "publish_date": "1998-09-17 00:00:00", "ISBN": "0393318281"},
{"url": "https://www.goodreads.com/book/show/48082.Skeleton_Man", "num_ratings": "5,759", "num_reviews": "301", "avg_ratings": 3.94, "genres": ["Mystery", "Fiction"], "title": "Skeleton Man", "description": ["Former Navajo Tribal Police Lieutenant Joe Leaphorn is coming out of retirement to h", "Former Navajo Tribal Police Lieutenant Joe Leaphorn is coming out of retirement to help exonerate a slow, simple kid accused of robbing a trade post. Billy Tuve claims he received the diamond he tried to pawn from a mysterious old man in the canyon, and his story has attracted the dangerous attention of strangers to the Navajo lands - one more interested in a severed limb than the fortune it was attached to; another willing to murder to keep lost secrets hidden. But nature herself may prove the deadliest adversary, as Leaphorn and Sergeant Jim Chee follow a puzzle - and a killer - down into the dark realm of Skeleton Man."], "author": "Tony Hillerman", "num_pages": "336", "awards": [], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Jim Chee"], "language": "English", "publish_date": "2006-01-31 00:00:00", "ISBN": "006056346X"},
{"url": "https://www.goodreads.com/book/show/734850.Last_Standing_Woman", "num_ratings": "306", "num_reviews": "29", "avg_ratings": 4.1, "genres": ["Fiction", "Historical", "Historical Fiction", "Race", "Native Americans"], "title": "Last Standing Woman", "description": ["A powerful and poignant novel tracing the lives of seven generations of Anishinaabe (O)bwe/Chippewa).'...an impressive fiction debut....skillfully intertwines social history. oral myth and character study....\" Publishers Weekly."], "author": "Winona LaDuke", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-11-26 00:00:00", "ISBN": "0896584526"},
{"url": "https://www.goodreads.com/book/show/12725.Sing_Down_the_Moon", "num_ratings": "6,510", "num_reviews": "362", "avg_ratings": 3.73, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Historical"], "title": "Sing Down the Moon", "description": ["The Spanish Slavers were an ever-present threat to the Navaho way of life. One lovely spring day, fourteen-year-old Bright Morning and her friend Running Bird took their sheep to pasture. The sky was clear blue against the red buttes of the Canyon de Schelly, and the fields and orchards of the Navahos promised a rich harvest. Bright Morning was happy as she gazed across th", "The Spanish Slavers were an ever-present threat to the Navaho way of life. One lovely spring day, fourteen-year-old Bright Morning and her friend Running Bird took their sheep to pasture. The sky was clear blue against the red buttes of the Canyon de Schelly, and the fields and orchards of the Navahos promised a rich harvest. Bright Morning was happy as she gazed across the beautiful valley that was the home of her tribe. She tumed when Black Dog barked, and it was then that she saw the Spanish slavers riding straight toward her."], "author": "Scott O'Dell", "num_pages": "121", "awards": ["Newbery Medal Nominee (1971)", "Dorothy Canfield Fisher Children's Book Award Nominee (1972)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-26 00:00:00", "ISBN": "0440979757"},
{"url": "https://www.goodreads.com/book/show/1160780.Laughing_Boy", "num_ratings": "2,788", "num_reviews": "176", "avg_ratings": 3.74, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics"], "title": "Laughing Boy: A Navajo Love Story", "description": ["Capturing the essence of the Southwest in 1915, Oliver La Farge's Pulitzer Prize-winning first novel is an enduring American classic. At a ceremonial dance, the young, earnest silversmith Laughing Boy falls in love with Slim Girl, a beautiful but elusive \"American\"-educated Navajo. As they experience all of the joys and uncertainties of first love, the couple must face a c", "Capturing the essence of the Southwest in 1915, Oliver La Farge's Pulitzer Prize-winning first novel is an enduring American classic. At a ceremonial dance, the young, earnest silversmith Laughing Boy falls in love with Slim Girl, a beautiful but elusive \"American\"-educated Navajo. As they experience all of the joys and uncertainties of first love, the couple must face a changing way of life and its tragic consequences."], "author": "Oliver La Farge", "num_pages": "193", "awards": ["Pulitzer Prize for Novel (1930)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-05 00:00:00", "ISBN": "0618446729"},
{"url": "https://www.goodreads.com/book/show/246245.The_Deerslayer", "num_ratings": "11,632", "num_reviews": "370", "avg_ratings": 3.68, "genres": ["Historical", "Historical Fiction", "Classics", "Literature", "Literature", "American", "Historical", "Literature", "19th Century", "Novels", "Classics", "Classic Literature", "Westerns", "Fiction"], "title": "The Deerslayer", "description": ["A restless white youth raised by Indians, Natty Bumppo is called Deerslayer for the daring that sets him apart from his peers. But he has yet to meet the test of human conflict. In a tale of violent action and superbly sustained suspense, the harsh realities of tribal warfare force him to kill his first foe, then face torture at the stake. Still yet another kind of initiat", "A restless white youth raised by Indians, Natty Bumppo is called Deerslayer for the daring that sets him apart from his peers. But he has yet to meet the test of human conflict. In a tale of violent action and superbly sustained suspense, the harsh realities of tribal warfare force him to kill his first foe, then face torture at the stake. Still yet another kind of initiation awaits him when he discovers not only the ruthlessness of \"civilized\" men, but also the special danger of a woman's will. His reckless spirit transformed into mature courage and moral certainty, the Deerslayer emerges to face life with nobility as pure and proud as the wilderness whose fierce beauty and freedom have claimed his heart."], "author": "James Fenimore Cooper", "num_pages": "576", "awards": ["Deutscher Jugendliteraturpreis for Sonderpreis Neubearbeitung klassischer Kinder- und Jugendbücher (1961)"], "places": ["Otsego Lake in territory lately known as state of New York, North America"], "character_names": ["Nathaniel Bumppo", "Chingachgook", "Harry Hurry", "Tom Hutter", "Judith Hutter", "Hetty Hutter", "Riven Oak", "Wah-ta-Wah"], "language": "English", "publish_date": "2004-07-06 00:00:00", "ISBN": "0451529391"},
{"url": "https://www.goodreads.com/book/show/530560.People_of_Darkness", "num_ratings": "5,685", "num_reviews": "225", "avg_ratings": 4.07, "genres": ["Mystery", "Fiction", "Thriller", "Mystery Thriller"], "title": "People of Darkness", "description": ["Who would murder a dying man? Why would someone steal a box of rocks? And why would a rich man's wife pay $3,000 to get them back? These questions haunt Sgt. Jim Chee of the Navajo Tribal Police as he journeys into the scorching Southwest. But there, out in the Bad Country, a lone assassin waits for Chee to come seeking answers, waits ready and willing to protect a vision", "Who would murder a dying man? Why would someone steal a box of rocks? And why would a rich man's wife pay $3,000 to get them back? These questions haunt Sgt. Jim Chee of the Navajo Tribal Police as he journeys into the scorching Southwest. But there, out in the Bad Country, a lone assassin waits for Chee to come seeking answers, waits ready and willing to protect a vision of death that for thirty years has been fed by greed and washed in blood."], "author": "Tony Hillerman", "num_pages": "304", "awards": [], "places": [], "character_names": ["Jim Chee", "Mary Landon", "B.J. Vines"], "language": "English", "publish_date": "1991-02-04 00:00:00", "ISBN": "0061099155"},
{"url": "https://www.goodreads.com/book/show/52383.Storyteller", "num_ratings": "1,608", "num_reviews": "52", "avg_ratings": 4.05, "genres": ["Poetry", "Fiction", "Short Stories"], "title": "Storyteller", "description": ["A collection of stories focuses on contemporary Native American concerns--white injustice, the fragmenting of the Indian community, and the loss of tribal identity--and recalls Indian legends and tribal stories."], "author": "Leslie Marmon Silko", "num_pages": "278", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-04-28 00:00:00", "ISBN": "155970005X"},
{"url": "https://www.goodreads.com/book/show/23267144-sanctuary", "num_ratings": "41", "num_reviews": "10", "avg_ratings": 4.02, "genres": ["Mystery"], "title": "Sanctuary", "description": ["The safest place they know is about to become the most dangerous… ", "Marcella’s husband, Quinn “Black Eagle” Hollister, severed ties to his family and friends on the Seneca reservation years ago. He rarely mentions his past—until his young cousin Kitty collapses on the couple’s doorstep in the dead of a rainswept night. ", "After two Seneca men break into their home with intent t", "The safest place they know is about to become the most dangerous… ", "Marcella’s husband, Quinn “Black Eagle” Hollister, severed ties to his family and friends on the Seneca reservation years ago. He rarely mentions his past—until his young cousin Kitty collapses on the couple’s doorstep in the dead of a rainswept night. ", "After two Seneca men break into their home with intent to kill, the Hollisters flee with the mute and injured girl to Tall Pines, their cabin in the Adirondacks. Marcella, unable to bear a child of her own, unleashes her motherly instincts caring for Kitty. As the girl slowly recovers, they start to piece together who wants them dead, and why. ", "But their pursuers are canny and relentless. The next attack drives the trio from the sanctuary of Tall Pines, deep into the mountain wilderness. ", "In spite of their best efforts, the unthinkable happens and Kitty is kidnapped. Marcella and Quinn track her back to Tall Pines--where they find themselves facing an army of murderous Seneca who'll stop at nothing to protect their dark secret. "], "author": "Aaron Paul Lazar", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/292706.Monkey_Beach", "num_ratings": "3,856", "num_reviews": "331", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "Canada"], "title": "Monkey Beach", "description": ["Five hundred miles north of Vancouver is Kitamaat, an Indian reservation in the homeland of the Haisla people. Growing up a tough, wild tomboy, swimming, fighting, and fishing in a remote village where the land slips into the green ocean on the edge of the world, Lisamarie has always been different. ", "Visited by ghosts and shapeshifters, tormented by premonitions, she can't", "Five hundred miles north of Vancouver is Kitamaat, an Indian reservation in the homeland of the Haisla people. Growing up a tough, wild tomboy, swimming, fighting, and fishing in a remote village where the land slips into the green ocean on the edge of the world, Lisamarie has always been different. ", "Visited by ghosts and shapeshifters, tormented by premonitions, she can't escape the sense that something terrible is waiting for her. She recounts her enchanted yet scarred life as she journeys in her speedboat up the frigid waters of the Douglas Channel. She is searching for her brother, dead by drowning, and in her own way running as fast as she can toward danger. Circling her brother's tragic death are the remarkable characters that make up her family: Lisamarie's parents, struggling to join their Haisla heritage with Western ways; Uncle Mick, a Native rights activist and devoted Elvis fan; and the headstrong Ma-ma-oo (Haisla for \"grandmother\"), a guardian of tradition. ", "Haunting, funny, and vividly poignant, ", " gives full scope to Robinson's startling ability to make bedfellows of comedy and the dark underside of life. Informed as much by its lush living wilderness as by the humanity of its colorful characters, ", " is a profoundly moving story about childhood and the pain of growing older--a multilayered tale of family grief and redemption."], "author": "Eden Robinson", "num_pages": "384", "awards": ["Scotiabank Giller Prize Nominee (2000)", "Ethel Wilson Fiction Prize (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-04-09 00:00:00", "ISBN": "0618219056"},
{"url": "https://www.goodreads.com/book/show/125404.The_Indian_in_the_Cupboard", "num_ratings": "86,835", "num_reviews": "1,977", "avg_ratings": 3.9, "genres": ["Fantasy", "Childrens", "Fiction", "Young Adult"], "title": "The Indian in the Cupboard", "description": ["At first, Omri is unimpressed with the plastic Indian toy he is given for his birthday. But when he puts it in his old cupboard and turns the key, something extraordinary happens that will change Omri's life for ever. ", "For Little Bull, the Iroquois Indian brave, comes to life..."], "author": "Lynne Reid Banks", "num_pages": "192", "awards": ["Grand Canyon Reader Award (1989)", "Pacific Northwest Library Association Young Reader's Choice Award (1984)", "California Young Readers Medal for Intermediate (1985)", "Virginia Reader's Choice for Elementary (1987)", "Rebecca Caudill Young Readers' Book Award (1988)"], "places": ["United Kingdom"], "character_names": ["Omri", "Little Bull", "Boone", "Bright Stars"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0007148984"},
{"url": "https://www.goodreads.com/book/show/234072.Solar_Storms", "num_ratings": "1,548", "num_reviews": "157", "avg_ratings": 4.09, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Contemporary"], "title": "Solar Storms", "description": ["From Pulitzer Prize finalist Linda Hogan,", "tells the moving, “luminous” (", ") story of Angela Jenson, a troubled Native American girl coming of age in the foster system in Oklahoma, who decides to reunite with her family.", "At seventeen, Angela returns to the place where she was raised—a stunning island town that lies at the border of Canada and Minn", "From Pulitzer Prize finalist Linda Hogan,", "tells the moving, “luminous” (", ") story of Angela Jenson, a troubled Native American girl coming of age in the foster system in Oklahoma, who decides to reunite with her family.", "At seventeen, Angela returns to the place where she was raised—a stunning island town that lies at the border of Canada and Minnesota—where she finds that an eager developer is planning a hydroelectric dam that will leave sacred land flooded and abandoned. Joining up with three other concerned residents, Angela fights the project, reconnecting with her ancestral roots as she does so.", "Harrowing, lyrical, and boldly incisive, ", "is a powerful examination of the clashes between cultures and traumatic repercussions that have shaped American history."], "author": "Linda Hogan", "num_pages": "352", "awards": ["Colorado Book Award for Fiction"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-02-26 00:00:00", "ISBN": "0684825392"},
{"url": "https://www.goodreads.com/book/show/33512.One_Thousand_White_Women", "num_ratings": "100,810", "num_reviews": "7,815", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Book Club"], "title": "One Thousand White Women: The Journals of May Dodd", "description": [" is the story of May Dodd and a colorful assembly of pioneer women who, under the auspices of the U.S. government, travel to the western prairies in 1875 to intermarry among the Cheyenne Indians. The covert and controversial \"Brides for Indians\" program, launched by the administration of Ulysses S. Grant, is intended to help assimilate the Indians i", " is the story of May Dodd and a colorful assembly of pioneer women who, under the auspices of the U.S. government, travel to the western prairies in 1875 to intermarry among the Cheyenne Indians. The covert and controversial \"Brides for Indians\" program, launched by the administration of Ulysses S. Grant, is intended to help assimilate the Indians into the white man's world. Toward that end May and her friends embark upon the adventure of their lifetime. Jim Fergus has so vividly depicted the American West that it is as if these diaries are a capsule in time."], "author": "Jim Fergus", "num_pages": "434", "awards": [], "places": ["United States of America"], "character_names": ["May Dodd", "Little Wolf", "Ulysses S. Grant"], "language": "English", "publish_date": "1999-02-15 00:00:00", "ISBN": "0312199430"},
{"url": "https://www.goodreads.com/book/show/18527201-the-great-law-of-peace", "num_ratings": "127", "num_reviews": "20", "avg_ratings": 4.52, "genres": ["North American Hi...", "American History", "History", "Animals", "Adventure"], "title": "The Great Law of Peace", "description": ["To survive the test of the falls was only the first step. Climbing the tree and letting them chop it down, falling straight into the worst of the rapids, gained him their attention, made them listen. But the main part of his work was still ahead of Two Rivers and his most loyal follower, Tekeni. The task of organizing the people as a whole, of making them talk to their hos", "To survive the test of the falls was only the first step. Climbing the tree and letting them chop it down, falling straight into the worst of the rapids, gained him their attention, made them listen. But the main part of his work was still ahead of Two Rivers and his most loyal follower, Tekeni. The task of organizing the people as a whole, of making them talk to their hostile, warlike neighbors, demanded time, too much time. ", "Their private desires had to wait as they traveled to more places, convened more gatherings, convinced more nations. The Great Peace demanded their full attention. ", "However, the women they loved had different ideas. Neither was prepared to sit and wait patiently. Taking action seemed like the better course to both, but each went about it in her own, very different, fashion."], "author": "Zoe Saadia", "num_pages": "259", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2870769-the-porcupine-year", "num_ratings": "793", "num_reviews": "145", "avg_ratings": 4.1, "genres": ["Historical", "Historical Fiction", "Fiction", "Childrens", "Historical", "Childrens", "Middle Grade"], "title": "The Porcupine Year", "description": ["When Omakayas is twelve winters old, she and her family set off on a harrowing journey. They travel by canoe westward from the shores of Lake Superior along the rivers of northe", "When Omakayas is twelve winters old, she and her family set off on a harrowing journey. They travel by canoe westward from the shores of Lake Superior along the rivers of northern Minnesota, in search of a new home. While the family has prepared well, unexpected danger, enemies, and hardships will push them to the brink of survival. Omakayas continues to learn from the land and the spirits around her, and she discovers that no matter where she is, or how she is living, she has the one thing she needs to carry her through.", "Richly imagined, full of laughter and sorrow, ", " continues Louise Erdrich's celebrated series, which began with ", ", a National Book Award finalist, and continued with ", ", winner of the Scott O'Dell Award for Historical Fiction."], "author": "Louise Erdrich", "num_pages": "182", "awards": ["Society of Midland Authors Award for Children's Fiction (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-02 00:00:00", "ISBN": "0060297875"},
{"url": "https://www.goodreads.com/book/show/1148401.Kiss_of_the_Fur_Queen", "num_ratings": "1,681", "num_reviews": "116", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Kiss of the Fur Queen", "description": ["Born into a magical Cree world in snowy northern Manitoba, Champion and Ooneemeetoo Okimasis are all too soon torn from their family and thrust into the hostile world of a Catholic residential school. Their language is forbidden, their names are changed to Jeremiah and Gabriel, and both boys are abused by priests.", "As young men, estranged from their own people and alienated", "Born into a magical Cree world in snowy northern Manitoba, Champion and Ooneemeetoo Okimasis are all too soon torn from their family and thrust into the hostile world of a Catholic residential school. Their language is forbidden, their names are changed to Jeremiah and Gabriel, and both boys are abused by priests.", "As young men, estranged from their own people and alienated from the culture imposed upon them, the Okimasis brothers fight to survive. Wherever they go, the Fur Queen--a wily, shape-shifting trickster--watches over them with a protective eye. For Jeremiah and Gabriel are destined to be artists. Through music and dance they soar."], "author": "Tomson Highway", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-09-14 00:00:00", "ISBN": "0385258801"},
{"url": "https://www.goodreads.com/book/show/348729.Waterlily", "num_ratings": "1,298", "num_reviews": "98", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Academic", "School", "Academic", "Read For School"], "title": "Waterlily", "description": ["This novel of the Dakota Sioux written by Sioux ethnologist Deloria takes protagonist Waterlily through the everyday and the extraordinary events of a Sioux woman's life."], "author": "Ella Cara Deloria", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-08-01 00:00:00", "ISBN": "0803265794"},
{"url": "https://www.goodreads.com/book/show/6387626-war-dances", "num_ratings": "5,945", "num_reviews": "839", "avg_ratings": 3.93, "genres": ["Short Stories", "Fiction", "Poetry", "Contemporary"], "title": "War Dances", "description": ["Fresh off his National Book Award win, Alexie delivers a heartbreaking, hilarious collection of stories that explores the precarious balance between self-preservation and external responsibility in art, family, and the world at large. With unparalleled insight into the minds of artists, laborers, fathers, husbands, and sons, Alexie populates his stories with ordinary men o", "Fresh off his National Book Award win, Alexie delivers a heartbreaking, hilarious collection of stories that explores the precarious balance between self-preservation and external responsibility in art, family, and the world at large. With unparalleled insight into the minds of artists, laborers, fathers, husbands, and sons, Alexie populates his stories with ordinary men on the brink of exceptional change. In a bicoastal journey through the consequences of both simple and monumental life choices, Alexie introduces us to personal worlds as they transform beyond return. In the title story, a famous writer must decide how to care for his distant father who is slowly dying a “natural Indian death” from alcohol and diabetes, just as he learns that he himself may have a brain tumor. Alexie dissects a vintage-clothing store owner’s failing marriage and his courtship of a married photographer in various airports across the country; what happens when a politician’s son commits a hate crime; and how a young boy discovers his self-worth while writing obituaries for his local newspaper. Brazen and wise, ", " takes us to the heart of what it means to be human. This provocative new work is Alexie at the height of his powers."], "author": "Sherman Alexie", "num_pages": "209", "awards": ["PEN/Faulkner Award for Fiction (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "0802119190"},
{"url": "https://www.goodreads.com/book/show/165446.Ride_the_Wind", "num_ratings": "4,662", "num_reviews": "440", "avg_ratings": 4.37, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Westerns", "Romance"], "title": "Ride the Wind", "description": ["In 1836, when she was nine years old, Cynthia Ann Parker was kidnapped by Comanche Indians. This is the story of how she grew up with them, mastered their ways, married one of their leaders, and became, in every way, a Comanche woman. It is also the story of a proud and innocent people whose lives pulsed with the very heartbeat of the land. It is the story of a way of life", "In 1836, when she was nine years old, Cynthia Ann Parker was kidnapped by Comanche Indians. This is the story of how she grew up with them, mastered their ways, married one of their leaders, and became, in every way, a Comanche woman. It is also the story of a proud and innocent people whose lives pulsed with the very heartbeat of the land. It is the story of a way of life that is gone forever...."], "author": "Lucia St. Clair Robson", "num_pages": "589", "awards": ["Spur Award for Best Historical Novel (1982)"], "places": ["United States of America", "Texas"], "character_names": ["Cynthia Parker"], "language": "English", "publish_date": "1985-11-12 00:00:00", "ISBN": "0345325222"},
{"url": "https://www.goodreads.com/book/show/71811.Moon_Called", "num_ratings": "148,700", "num_reviews": "7,107", "avg_ratings": 4.18, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Shapeshifters", "Werewolves", "Romance"], "title": "Moon Called", "description": ["Mercedes Thompson, aka Mercy, is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot li", "Mercedes Thompson, aka Mercy, is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot like ours but is populated by those things that go bump in the night. And Mercy's connection to those things is about to get her into some serious hot water..."], "author": "Patricia Briggs", "num_pages": "288", "awards": [], "places": ["Tri-Cities, Washington", "Washington (the state)", "United States of America"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Leah", "Charles Cornick", "Darryl Zao", "Warren", "Kyle Brooks", "Stefan Uccello", "Alan MacKenzie Frazier", "Marsilia", "Auriele Zao", "Elizaveta Arkadyevna Vyshnevetskaya", "Gabriel Sandoval", "Tony Montenegro", "David Christiansen", "Bran \"The Marrok\" Cornick", "Ben (werewolf)"], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "0441013813"},
{"url": "https://www.goodreads.com/book/show/1044575.Book_of_the_Hopi", "num_ratings": "769", "num_reviews": "44", "avg_ratings": 4.05, "genres": ["History", "Nonfiction", "Religion", "Anthropology", "Spirituality", "Fantasy", "Mythology"], "title": "Book of the Hopi", "author": "Frank Waters", "num_pages": "345", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1977-06-30 00:00:00", "ISBN": "0140045279"},
{"url": "https://www.goodreads.com/book/show/48118.The_Ghostway", "num_ratings": "7,929", "num_reviews": "174", "avg_ratings": 4.12, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "The Ghostway", "description": ["Old Joseph Joe sees it all. Two strangers spill blood at the Shiprock Wash-O-Mat. One dies. The other drives off into the dry lands of the Big Reservation, but not before he shows the old Navajo a photo of the man he seeks.", "This is all Tribal Policeman Jim Chee needs to set him off on an odyssey that moves from a trapped ghost in an Indian hogan to the seedy underbelly of L", "Old Joseph Joe sees it all. Two strangers spill blood at the Shiprock Wash-O-Mat. One dies. The other drives off into the dry lands of the Big Reservation, but not before he shows the old Navajo a photo of the man he seeks.", "This is all Tribal Policeman Jim Chee needs to set him off on an odyssey that moves from a trapped ghost in an Indian hogan to the seedy underbelly of L.A. to an ancient healing ceremony where death is the cure, and into the dark heart of murder and revenge."], "author": "Tony Hillerman", "num_pages": "301", "awards": [], "places": [], "character_names": ["Joe Leaphorn", "Jim Chee", "Albert Gorman", "Joseph Joe"], "language": "English", "publish_date": "1992-02-04 00:00:00", "ISBN": "006100345X"},
{"url": "https://www.goodreads.com/book/show/96052.The_Woman_Who_Fell_from_the_Sky", "num_ratings": "440", "num_reviews": "31", "avg_ratings": 4.22, "genres": ["Poetry", "Cultural", "Feminism"], "title": "The Woman Who Fell from the Sky: Poems", "description": ["Joy Harjo, one of this country's foremost Native American voices, combines elements of storytelling, prayer, and song, informed by her interest in jazz and by her North American tribal background, in this, her fourth volume of poetry.", "She draws from the Native American tradition of praising the land and the spirit, the realities of American culture, and the concept of femin", "Joy Harjo, one of this country's foremost Native American voices, combines elements of storytelling, prayer, and song, informed by her interest in jazz and by her North American tribal background, in this, her fourth volume of poetry.", "She draws from the Native American tradition of praising the land and the spirit, the realities of American culture, and the concept of feminine individuality."], "author": "Joy Harjo", "num_pages": "88", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-08-17 00:00:00", "ISBN": "039331362X"},
{"url": "https://www.goodreads.com/book/show/60892.Lakota_Woman", "num_ratings": "4,794", "num_reviews": "306", "avg_ratings": 3.96, "genres": ["Nonfiction", "Autobiography", "Memoir", "History", "Biography"], "title": "Lakota Woman", "description": ["Mary Brave Bird grew up fatherless in a one-room cabin, without running water or electricity, on the Rosebud Indian Reservation in South Dakota. Rebelling against the aimless drinking, punishing missionary school, narrow strictures for women, and violence and hopeless of reservation life, she joined the new movement of tribal pride sweeping Native American communities in t", "Mary Brave Bird grew up fatherless in a one-room cabin, without running water or electricity, on the Rosebud Indian Reservation in South Dakota. Rebelling against the aimless drinking, punishing missionary school, narrow strictures for women, and violence and hopeless of reservation life, she joined the new movement of tribal pride sweeping Native American communities in the sixties and seventies. Mary eventually married Leonard Crow Dog, the American Indian Movement's chief medicine man, who revived the sacred but outlawed Ghost Dance.", "Originally published in 1990, ", " was a national best seller and winner of the American Book Award. It is a unique document, unparalleled in American Indian literature, a story of death, of determination against all odds, of the cruelties perpetuated against American Indians, and of the Native American struggle for rights. Working with Richard Erdoes, one of the twentieth century's leading writers on Native American affairs, Brave Bird recounts her difficult upbringing and the path of her fascinating life."], "author": "Mary Crow Dog", "num_pages": "263", "awards": ["American Book Award (1991)"], "places": [], "character_names": [], "language": "English", "publish_date": "1991-03-28 00:00:00", "ISBN": "0060973897"},
{"url": "https://www.goodreads.com/book/show/6673172-shadow-tag", "num_ratings": "5,988", "num_reviews": "1,323", "avg_ratings": 3.38, "genres": ["Fiction", "Literary Fiction", "Contemporary", "Novels"], "title": "Shadow Tag", "description": ["“Erdrich is a true original… [and] one of our major writers.” —", ", the brilliant new novel by Louise Erdrich, is a stunning tour-de-force from the National Book Critics Circle Award–winning and ", "–bestselling author of ", " and Pulitzer-Prize-finalist ", ". In the vein of the novels of such contemporarie", "“Erdrich is a true original… [and] one of our major writers.” —", ", the brilliant new novel by Louise Erdrich, is a stunning tour-de-force from the National Book Critics Circle Award–winning and ", "–bestselling author of ", " and Pulitzer-Prize-finalist ", ". In the vein of the novels of such contemporaries as Zoe Heller and Susan Minot, ", " is an intense and heart-wrenching story of a troubled marriage and a family in disarray—and a radical departure from Erdrich’s previous acclaimed work."], "author": "Louise Erdrich", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-02-02 00:00:00", "ISBN": "0061536091"},
{"url": "https://www.goodreads.com/book/show/8087906-river-marked", "num_ratings": "67,395", "num_reviews": "3,349", "avg_ratings": 4.27, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Shapeshifters", "Werewolves", "Romance", "Paranormal", "Vampires", "Romance", "Paranormal Romance", "Paranormal", "Shapeshifters", "Fairies", "Fae", "Fantasy", "Magic"], "title": "River Marked", "description": ["Mercy Thompson is a shapeshifter, a talent she inherited from her long-gone father. And she's never known any others of her kind. Until now. As Mercy comes to terms with this new information, an evil is stirring in the depths of the Columbia River. Something deadly is coming, facts are thin on the ground and Mercy feels ill at ease."], "author": "Patricia Briggs", "num_pages": "326", "awards": ["Endeavour Award Nominee (2012)"], "places": ["Oregon", "Washington (the state)"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Darryl Zao", "Warren", "Kyle Brooks", "Stefan Uccello", "Coyote", "Auriele Zao", "Uncle Mike", "Margi Thompson", "Ben (werewolf)"], "language": "English", "publish_date": "2011-03-03 00:00:00", "ISBN": "1841497975"},
{"url": "https://www.goodreads.com/book/show/425099.Listening_Woman", "num_ratings": "9,819", "num_reviews": "290", "avg_ratings": 4.14, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Listening Woman", "description": ["Listening Woman by Tony Hillerman. HarperCollins Publishers,1978"], "author": "Tony Hillerman", "num_pages": "316", "awards": ["Edgar Award Nominee for Best Novel (1979)", "National Book Award Finalist for Mystery (Paperback) (1980)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn"], "language": "English", "publish_date": "1990-07-05 00:00:00", "ISBN": "0061000299"},
{"url": "https://www.goodreads.com/book/show/256008.Lonesome_Dove", "num_ratings": "126,129", "num_reviews": "5,942", "avg_ratings": 4.48, "genres": ["Fiction", "Historical", "Historical Fiction", "Westerns", "Classics", "Historical"], "title": "Lonesome Dove", "description": ["A love story, an adventure, and an epic of the frontier, Larry McMurtry’s Pulitzer Prize— winning classic, ", ", the third book in the ", " tetralogy, is the grandest novel ever written about the last defiant wilderness of America.", "Journey to the dusty little Texas town of Lonesome Dove and meet an unforgettable assortment of heroes and outlaws, whores and", "A love story, an adventure, and an epic of the frontier, Larry McMurtry’s Pulitzer Prize— winning classic, ", ", the third book in the ", " tetralogy, is the grandest novel ever written about the last defiant wilderness of America.", "Journey to the dusty little Texas town of Lonesome Dove and meet an unforgettable assortment of heroes and outlaws, whores and ladies, Indians and settlers. Richly authentic, beautifully written, always dramatic, ", " is a book to make us laugh, weep, dream, and remember.", "Series in order of publication:", "Lonesome Dove (1985)", "Streets of Laredo (1993)", "Dead Man's Walk (1995)", "Comanche Moon (1997)", "Series in order of internal chronology:", "Dead Man's Walk – set in the early 1840s", "Comanche Moon – set in the 1850–60s", "Lonesome Dove – set in mid-to-late 1870s", "Streets of Laredo – set in the early 1890s"], "author": "Larry McMurtry", "num_pages": "945", "awards": ["Pulitzer Prize for Fiction (1986)", "PEN/Faulkner Award for Fiction Nominee (1986)", "National Book Critics Circle Award Nominee for Fiction (1985)", "Spur Award for Best Western Novel (1985)"], "places": ["United States of America", "Texas"], "character_names": ["Captain Woodrow Call", "Augustus \"Gus\" McCrae", "Joshua Deets", "Newt Dobbs"], "language": "English", "publish_date": "1999-10-01 00:00:00", "ISBN": "067168390X"},
{"url": "https://www.goodreads.com/book/show/27016203-the-warpath", "num_ratings": "51", "num_reviews": "13", "avg_ratings": 4.41, "genres": ["History"], "title": "The Warpath", "description": ["All was not well in the lands of the Erie/Long Tails People, on the western shore of Lake Ontario and around Niagara Falls. Tucked between two growing unions, the mighty Great League and the newly formed alliance of the Wyandot to the north, the Long Tails tried to remain neutral, playing for time, doing little while earning no respect from their powerful neighbors on eith", "All was not well in the lands of the Erie/Long Tails People, on the western shore of Lake Ontario and around Niagara Falls. Tucked between two growing unions, the mighty Great League and the newly formed alliance of the Wyandot to the north, the Long Tails tried to remain neutral, playing for time, doing little while earning no respect from their powerful neighbors on either side. ", "However there were those whom such state of shameful neutrally hurt, even though Aingahon’s reasons for hating the Great League were personal, his desire to take the warpath originating in a thirst for revenge. Leading a serious faction of rebellious elements from his town and its surroundings, he was determined to make the enemies of his people pay; still he got nowhere, until Tsutahi, the mysterious girl from the woods, had crossed his path, changing his world in ways he could never have foreseen. ", "Back in the lands of the Great League, the generation of younger leaders, Ganayeda and Okwaho – not to mention Ogteah, the newcomer facing new troubles and challenges – sensed the winds of change as well. The relationship between the Five Nations, conducted just like the Great Peacemaker’s legacy prescribed, wasn’t enough, not anymore. A closer cooperation between the nations might be needed, a mutual help and support, even if it came to sending reinforcements and fighting in wars that were not strictly theirs. ", "The War Chief’s sons’ way of going about pushing their plans was as unconventional as it was forceful and decisive. To bend laws and customs was not the same as breaking them. ", "Or so they thought, heading toward the inevitable clash with the notorious Long Tails from the west, a clash of proportions neither side could have foreseen or foretell."], "author": "Zoe Saadia", "num_pages": "487", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/860979.People_of_the_Wolf", "num_ratings": "8,442", "num_reviews": "253", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy"], "title": "People of the Wolf", "description": ["In the dawn of history, a valiant people forged a pathway from an old world into a new one. Led by a dreamer who followed the spirit of the wolf, a handful of courageous men and women dared to cross the frozen wastes to find an untouched, unspoiled continent. Set in what is now Alaska, this is the magnificent saga of the vision-filled man who led his people to an awesome d", "In the dawn of history, a valiant people forged a pathway from an old world into a new one. Led by a dreamer who followed the spirit of the wolf, a handful of courageous men and women dared to cross the frozen wastes to find an untouched, unspoiled continent. Set in what is now Alaska, this is the magnificent saga of the vision-filled man who led his people to an awesome destiny, and the courageous woman whose love and bravery drove them on in pursuit of that dream.", "A sweeping epic of prehistory, People of the Wolf is another compelling novel in the majestic North America's Forgotten Past series from New York Times and USA Today bestselling authors W. Michael Gear and Kathleen O'Neal Gear"], "author": "W. Michael Gear", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-01-15 00:00:00", "ISBN": "0812521331"},
{"url": "https://www.goodreads.com/book/show/543339.Dances_with_Wolves", "num_ratings": "21,954", "num_reviews": "427", "avg_ratings": 4.2, "genres": ["Historical", "Historical Fiction", "Fiction", "Westerns", "Historical", "Classics"], "title": "Dances with Wolves", "description": ["Ordered to hold an abandoned army post, John Dunbar found himself alone, beyond the edge of civilization. Thievery and survival soon forced him into the Indian camp, where he began a dangerous adventure that changed his life forever. Relive the adventure and beauty of the incredible movie, DANCES WITH WOLVES."], "author": "Michael Blake", "num_pages": "304", "awards": ["Soaring Eagle Book Award (1992)"], "places": ["United States of America"], "character_names": ["Kicking Bird", "John Dunbar", "Wind In His Hair", "Stands With A Fist"], "language": "English", "publish_date": "1997-11-01 00:00:00", "ISBN": "0449000753"},
{"url": "https://www.goodreads.com/book/show/253191.Sacred_Clowns", "num_ratings": "6,759", "num_reviews": "211", "avg_ratings": 4.01, "genres": ["Mystery", "Fiction", "Thriller", "Mystery Thriller"], "title": "Sacred Clowns", "description": ["During a kachina ceremony at the Tano Pueblo, the antics of a dancing ", " fill the air with tension. Moments later, the clown is found bludgeoned to death, in the same manner a reservation schoolteacher was killed only days before.", "Officer Jim Chee and Lieutenant Joe Leaphorn believe that answers lie in the sacred clown's final cryptic message to the Tano people. But to", "During a kachina ceremony at the Tano Pueblo, the antics of a dancing ", " fill the air with tension. Moments later, the clown is found bludgeoned to death, in the same manner a reservation schoolteacher was killed only days before.", "Officer Jim Chee and Lieutenant Joe Leaphorn believe that answers lie in the sacred clown's final cryptic message to the Tano people. But to decipher it, the two Navajo policemen may have to delve into closely guarded tribal secrets—on a sinister trail of blood that links a runaway, a holy artifact, corrupt Indian traders, and a pair of dead bodies."], "author": "Tony Hillerman", "num_pages": "320", "awards": ["Anthony Award Nominee for Best Novel (1994)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Jim Chee", "Janet Pete"], "language": "English", "publish_date": "2003-02-04 00:00:00", "ISBN": "0060538058"},
{"url": "https://www.goodreads.com/book/show/48081.The_Shape_Shifter", "num_ratings": "6,994", "num_reviews": "386", "avg_ratings": 3.99, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "The Shape Shifter", "description": ["Since his retirement from the Navajo Tribal Police, Joe Leaphorn has occasionally been enticed to return to work by former colleagues who seek his help when they need to solve a particularly puzzling crime. They ask because Leaphorn, aided by officers Jim Chee and Bernie Manuelito, always delivers.", "But this time the problem is with an old case of Joe's--his \"last case,\" uns", "Since his retirement from the Navajo Tribal Police, Joe Leaphorn has occasionally been enticed to return to work by former colleagues who seek his help when they need to solve a particularly puzzling crime. They ask because Leaphorn, aided by officers Jim Chee and Bernie Manuelito, always delivers.", "But this time the problem is with an old case of Joe's--his \"last case,\" unsolved, is one that continues to haunt him. And with Chee and Bernie just back from their honeymoon, Leaphorn is pretty much on his own.", "The original case involved a priceless, one-of-a-kind Navajo rug supposedly destroyed in a fire. Suddenly, what looks like the same rug turns up in a magazine spread. And the man who brings the photo to Leaphorn's attention has gone missing. Leaphorn must pick up the threads of a crime he'd thought impossible to untangle. Not only has the passage of time obscured the details, but it also appears that there's a murderer still on the loose.", "New York Times bestselling author Tony Hillerman is at the top of his form in this atmospheric and riveting novel set amid the rugged beauty of his beloved Southwest."], "author": "Tony Hillerman", "num_pages": "276", "awards": ["Spur Award for Best Western Short Novel (2007)"], "places": [], "character_names": ["Joe Leaphorn", "Jim Chee", "Bernie Manuelito", "Mel Bork", "Shewnack and more"], "language": "English", "publish_date": "2006-11-21 00:00:00", "ISBN": "0060563451"},
{"url": "https://www.goodreads.com/book/show/35349.She_Who_Remembers", "num_ratings": "7,334", "num_reviews": "192", "avg_ratings": 4.02, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy", "Historical Fiction", "Prehistoric"], "title": "She Who Remembers", "description": ["Kwani. A beautiful woman born in the American southwest into the long extinct Anasazi tribe, long before Columbus...whose blue eyes marked her as a witch and set her apart from the Indian tribe that raised her.", "Following her path of destiny in a vanished world of great stone cities and trackless wilderness warring tribes and mysterious trabelers from other lands, Kwani foun", "Kwani. A beautiful woman born in the American southwest into the long extinct Anasazi tribe, long before Columbus...whose blue eyes marked her as a witch and set her apart from the Indian tribe that raised her.", "Following her path of destiny in a vanished world of great stone cities and trackless wilderness warring tribes and mysterious trabelers from other lands, Kwani found love with Kokopelli, the Toltec magician, who rescued her from death and took her to the Place of the Eagle Clan. There she was transformed from an outcast to the Chosen of the Gods, where she became She Who Remembers and taught young girls the ancient secrets only women know...secrets that provided her with inner power to overcome and triumph--and change her life forever."], "author": "Linda Lay Shuler", "num_pages": "496", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-05 00:00:00", "ISBN": "0451211448"},
{"url": "https://www.goodreads.com/book/show/116236.The_Education_of_Little_Tree", "num_ratings": "12,756", "num_reviews": "1,462", "avg_ratings": 4.1, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Classics"], "title": "The Education of Little Tree", "description": ["The Education of Little Tree tells of a boy orphaned very young, who is adopted by his Cherokee grandmother and half-Cherokee grandfather in the Appalachian mountains of Tennessee during the Great Depression. Little Tree as his grandparents call him is shown how to hunt and survive in the mountains, to respect nature in the Cherokee Way, taking only what is needed, leaving", "The Education of Little Tree tells of a boy orphaned very young, who is adopted by his Cherokee grandmother and half-Cherokee grandfather in the Appalachian mountains of Tennessee during the Great Depression. Little Tree as his grandparents call him is shown how to hunt and survive in the mountains, to respect nature in the Cherokee Way, taking only what is needed, leaving the rest for nature to run its course. Little Tree also learns the often callous ways of white businessmen and tax collectors, and how Granpa, in hilarious vignettes, scares them away from his illegal attempts to enter the cash economy. Granma teaches Little Tree the joys of reading and education. But when Little Tree is taken away by whites for schooling, we learn of the cruelty meted out to Indian children in an attempt to assimilate them and of Little Tree's perception of the Anglo world and how it differs from the Cherokee Way. A classic of its era, and an enduring book for all ages, The Education of Little Tree has now been redesigned for this twenty-fifth anniversary edition."], "author": "Forrest Carter", "num_pages": "228", "awards": ["American Booksellers Book Of The Year  Award (1991)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-08-31 00:00:00", "ISBN": "0826328091"},
{"url": "https://www.goodreads.com/book/show/264778.Sacajawea", "num_ratings": "14,431", "num_reviews": "424", "avg_ratings": 4.24, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "Sacajawea", "description": ["Clad ln a doeskin, alone and unafraid, she stood straight and proud before the onrushlng Forces of America’s destiny: Sacajawea. child of a Shoshoni chief, lone woman on Lewis and Clark‘s historic trek-beautiful spear of a dying nation.", "She knew many men, walked many miles. From the whispering prairies, across the Great Divide to the crystal-capped Rockies and on to the eme", "Clad ln a doeskin, alone and unafraid, she stood straight and proud before the onrushlng Forces of America’s destiny: Sacajawea. child of a Shoshoni chief, lone woman on Lewis and Clark‘s historic trek-beautiful spear of a dying nation.", "She knew many men, walked many miles. From the whispering prairies, across the Great Divide to the crystal-capped Rockies and on to the emerald promise of the Pacific Northwest, her story overflows with emotion and action ripped from the bursting fabric of a raw new land. ", "Ten years In the Writing, SACAJAWEA unfolds an immense canvas of people and events, and captures the eternal longings of a woman who always yearned for one great passion-and always it lay beyond the next mountain."], "author": "Anna Lee Waldo", "num_pages": "1424", "awards": [], "places": ["Carthage, United States"], "character_names": [], "language": "English", "publish_date": "1984-07-01 00:00:00", "ISBN": "0380842939"},
{"url": "https://www.goodreads.com/book/show/52385.Almanac_of_the_Dead", "num_ratings": "2,298", "num_reviews": "236", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Literature", "Novels"], "title": "Almanac of the Dead", "description": ["In its extraordinary range of character and culture, Almanac of the Dead is fiction on the grand scale. The acclaimed author of Ceremony has undertaken a weaving of ideas and lives, fate and history, passion and conquest in an attempt to re-create the moral history of the Americas, told from the point of view of the conquered, not the conquerors."], "author": "Leslie Marmon Silko", "num_pages": "768", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-11-01 00:00:00", "ISBN": "0140173196"},
{"url": "https://www.goodreads.com/book/show/156392.Winter_in_the_Blood", "num_ratings": "2,236", "num_reviews": "195", "avg_ratings": 3.85, "genres": ["Fiction", "Novels", "Classics", "Literary Fiction", "Literature"], "title": "Winter in the Blood", "description": ["The author of Fool's Crow and Indian Lawyer presents an extraordinary, evocative novel about a young Native American coming to terms with his heritage--and his dreams. \"A nearly flawless novel about human life\".--Reynolds Price, New York Times Book Review."], "author": "James Welch", "num_pages": "192", "awards": [], "places": ["Montana"], "character_names": [], "language": "English", "publish_date": "1986-03-04 00:00:00", "ISBN": "0140086447"},
{"url": "https://www.goodreads.com/book/show/159666.The_Birchbark_House", "num_ratings": "5,116", "num_reviews": "787", "avg_ratings": 3.94, "genres": ["Historical", "Historical Fiction", "Fiction", "Childrens", "Childrens", "Middle Grade", "Historical", "Young Adult"], "title": "The Birchbark House", "description": ["Nineteenth-century American pioneer life was introduced to thousands of young readers by Laura Ingalls Wilder's beloved Little House books. With ", ", award-winning author Louise Erdrich's first novel for young readers, this same slice of history is seen through the eyes of the spirited, 7-year-old Ojibwa girl Omakayas, or Little Frog, so named because her f", "Nineteenth-century American pioneer life was introduced to thousands of young readers by Laura Ingalls Wilder's beloved Little House books. With ", ", award-winning author Louise Erdrich's first novel for young readers, this same slice of history is seen through the eyes of the spirited, 7-year-old Ojibwa girl Omakayas, or Little Frog, so named because her first step was a hop. The sole survivor of a smallpox epidemic on Spirit Island, Omakayas, then only a baby girl, was rescued by a fearless woman named Tallow and welcomed into an Ojibwa family on Lake Superior's Madeline Island, the Island of the Golden-Breasted Woodpecker. We follow Omakayas and her adopted family through a cycle of four seasons in 1847, including the winter, when a historically documented outbreak of smallpox overtook the island. ", "Readers will be riveted by the daily life of this Native American family, in which tanning moose hides, picking berries, and scaring crows from the cornfield are as commonplace as encounters with bear cubs and fireside ghost stories. Erdrich--a member of the Turtle Mountain Band of Ojibwa--spoke to Ojibwa elders about the spirit and significance of Madeline Island, read letters from travelers, and even spent time with her own children on the island, observing their reactions to woods, stones, crayfish, bear, and deer. The author's softly hewn pencil drawings infuse life and authenticity to her poetic, exquisitely wrought narrative. Omakayas is an intense, strong, likable character to whom young readers will fully relate--from her mixed emotions about her siblings, to her discovery of her unique talents, to her devotion to her pet crow Andeg, to her budding understanding of death, life, and her role in the natural world. We look forward to reading more about this brave, intuitive girl--and wholeheartedly welcome Erdrich's future series to the canon of children's classics. (Ages 9 and older) --Karin Snelson"], "author": "Louise Erdrich", "num_pages": "244", "awards": ["Jane Addams Children's Book Award Nominee for Older Children (2000)", "Dorothy Canfield Fisher Children's Book Award Nominee (2001)", "American Indian Youth Literature Award for Best Middle School Book (2006)", "Chapman Award for Shared Reading Nominee for Fiction (2000)", "National Book Award Finalist for Young People's Literature (1999)", "National Cowboy Hall of Fame Western Heritage Award for Juvenile Book (2000)"], "places": [], "character_names": ["Omakayas"], "language": "English", "publish_date": "2002-05-13 00:00:00", "ISBN": "0786814543"},
{"url": "https://www.goodreads.com/book/show/48119.Coyote_Waits", "num_ratings": "7,733", "num_reviews": "224", "avg_ratings": 4.07, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Coyote Waits", "description": ["The car fire didn't kill Navajo Tribal Policeman Delbert Nez—a bullet did. And the old man in possession of the murder weapon is a whiskey-soaked shaman named Ashie Pinto. Officer Jim Chee is devastated by the slaying of his good friend Del, and confounded by the prime suspect's refusal to utter a single word of confession or denial.", "Lieutenant Joe Leaphorn believes there i", "The car fire didn't kill Navajo Tribal Policeman Delbert Nez—a bullet did. And the old man in possession of the murder weapon is a whiskey-soaked shaman named Ashie Pinto. Officer Jim Chee is devastated by the slaying of his good friend Del, and confounded by the prime suspect's refusal to utter a single word of confession or denial.", "Lieutenant Joe Leaphorn believes there is much more to this outrage than what appears on the surface, as he and Jim Chee set out to unravel a complex weave of greed and death that involves a historical find and a lost fortune. But the hungry and mythical trickster Coyote is waiting, as always, in the shadows to add a strange and deadly new twist."], "author": "Tony Hillerman", "num_pages": "352", "awards": ["Nero Award (1991)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Jim Chee", "Delbert Nez", "Ashie Pinto"], "language": "English", "publish_date": "1992-01-15 00:00:00", "ISBN": "0061099325"},
{"url": "https://www.goodreads.com/book/show/48162.Skinwalkers", "num_ratings": "10,112", "num_reviews": "349", "avg_ratings": 4.03, "genres": ["Mystery", "Fiction", "Thriller", "Mystery Thriller"], "title": "Skinwalkers", "description": ["Navajo Tribal Police Officer Jim Chee and Lieutenant Joe Leaphorn investigate murders that lead them into spine-tingling and mystical world of Navajo witchcraft. Three unsolved homicides and an attempt on Chee's life have left the Navajo Tribal Police baffled. Are the murders somehow connected, although they occurred 120 miles apart? Or are they random acts of violence? Ch", "Navajo Tribal Police Officer Jim Chee and Lieutenant Joe Leaphorn investigate murders that lead them into spine-tingling and mystical world of Navajo witchcraft. Three unsolved homicides and an attempt on Chee's life have left the Navajo Tribal Police baffled. Are the murders somehow connected, although they occurred 120 miles apart? Or are they random acts of violence? Chee and Leaphorn's efforts to solve the seemingly unrelated individual crimes leave them with clues that point toward one suspect, in this suspenseful mystery."], "author": "Tony Hillerman", "num_pages": "282", "awards": ["Anthony Award for Best Novel (1988)", "Spur Award for Best Western Novel (1987)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Jim Chee", "Janet Pete", "Emma Leaphorn", "Mary Landon", "Dr. Yellowhorse", "Kennedy", "Streib"], "language": "English", "publish_date": "1990-04-16 00:00:00", "ISBN": "0061000175"},
{"url": "https://www.goodreads.com/book/show/142900.The_Master_Butchers_Singing_Club", "num_ratings": "19,806", "num_reviews": "1,588", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Literary Fiction", "Book Club"], "title": "The Master Butchers Singing Club", "description": ["From National Book Award-winning, ", "-bestselling author Louise Erdrich, a profound and enchanting new novel: a richly imagined world “where butchers sing like angels.”", "Having survived World War I, Fidelis Waldvogel returns to his quiet German village and marries the pregnant widow of his best friend, killed in action. With a suitcase full of sausages and a maste", "From National Book Award-winning, ", "-bestselling author Louise Erdrich, a profound and enchanting new novel: a richly imagined world “where butchers sing like angels.”", "Having survived World War I, Fidelis Waldvogel returns to his quiet German village and marries the pregnant widow of his best friend, killed in action. With a suitcase full of sausages and a master butcher's precious knife set, Fidelis sets out for America. In Argus, North Dakota, he builds a business, a home for his family—which includes Eva and four sons—and a singing club consisting of the best voices in town. When the Old World meets the New—in the person of Delphine Watzka—the great adventure of Fidelis's life begins. Delphine meets Eva and is enchanted. She meets Fidelis, and the ground trembles. These momentous encounters will determine the course of Delphine's life, and the trajectory of this brilliant novel."], "author": "Louise Erdrich", "num_pages": "416", "awards": [], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2016-08-23 00:00:00", "ISBN": "0060837055"},
{"url": "https://www.goodreads.com/book/show/91437.Four_Souls", "num_ratings": "3,140", "num_reviews": "295", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Literary Fiction", "Novels"], "title": "Four Souls", "description": ["This small but incredibly rich chapter in Erdrich's ongoing Native American saga is a continuation of the story of the enigmatic Fleur Pillager, begun in ", " (1988).", " begins with Fleur Pillager's journey from North Dakota to Minneapolis, where she plans to avenge the loss of her family's land to a white man. After a dream vision that gives her a powerful new na", "This small but incredibly rich chapter in Erdrich's ongoing Native American saga is a continuation of the story of the enigmatic Fleur Pillager, begun in ", " (1988).", " begins with Fleur Pillager's journey from North Dakota to Minneapolis, where she plans to avenge the loss of her family's land to a white man. After a dream vision that gives her a powerful new name, Four Souls, she enters the household of John James Mauser. A man notorious for his wealth and his mansion on a hill, Mauser became rich by deceiving young Indian women and taking possession of their ancestral lands. What promises to be a straightforward tale of revenge, however, slowly metamorphoses into a more complex evocation of human nature. The story of anger and retribution that begins in ", " becomes a story of healing and love in ", "."], "author": "Louise Erdrich", "num_pages": "210", "awards": ["WILLA Literary Award Nominee for Historical Fiction (Finalist) (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-29 00:00:00", "ISBN": "0060935227"},
{"url": "https://www.goodreads.com/book/show/766567.Talking_God", "num_ratings": "6,696", "num_reviews": "216", "avg_ratings": 4.03, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Talking God", "description": ["A grave robber and a corpse reunite Navajo Tribal Police Lt. Joe Leaphorn and Officer Jim Chee. As Leaphorn seeks the identify of a murder victim, Chee is arresting Smithsonian conservator Henry Highhawk for ransacking the sacred bones of his anscestors. As the layers of each case are peeled away, it becomes shockingly clear that they are connected, that there are mysterio", "A grave robber and a corpse reunite Navajo Tribal Police Lt. Joe Leaphorn and Officer Jim Chee. As Leaphorn seeks the identify of a murder victim, Chee is arresting Smithsonian conservator Henry Highhawk for ransacking the sacred bones of his anscestors. As the layers of each case are peeled away, it becomes shockingly clear that they are connected, that there are mysterious others pursuing Highhawk, and that Leaphorn and Chee have entered into the dangerous arena of superstition, ancient ceremony, and living gods."], "author": "Tony Hillerman", "num_pages": "338", "awards": [], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Jim Chee", "Henry Highhawk"], "language": "English", "publish_date": "1990-12-01 00:00:00", "ISBN": "006109918X"},
{"url": "https://www.goodreads.com/book/show/50667.Little_Big_Man", "num_ratings": "5,928", "num_reviews": "363", "avg_ratings": 4.24, "genres": ["Historical", "Historical Fiction", "Fiction", "Westerns", "Classics", "Humor"], "title": "Little Big Man", "description": ["\"I am a white man and never forget it, but I was brought up by the Cheyenne Indians from the age of ten.\"", "So starts the story of Jack Crabb, the 111-year old narrator of Thomas Berger's masterpiece of American fiction. As a \"human being\", as the Cheyenne called their own, he won the name Little Big Man. He dressed in skins, feasted on dog, loved four wives and saw his peopl", "\"I am a white man and never forget it, but I was brought up by the Cheyenne Indians from the age of ten.\"", "So starts the story of Jack Crabb, the 111-year old narrator of Thomas Berger's masterpiece of American fiction. As a \"human being\", as the Cheyenne called their own, he won the name Little Big Man. He dressed in skins, feasted on dog, loved four wives and saw his people butchered by the horse soldiers of General Custer, the man he had sworn to kill.", "As a white man, Crabb hunted buffalo, tangled with Wyatt Earp, cheated Wild Bill Hickok and survived the Battle of Little Bighorn. Part-farcical, part-historical, the picaresque adventures of this witty, wily mythomaniac claimed the Wild West as the stuff of serious literature."], "author": "Thomas Berger", "num_pages": "422", "awards": ["Audie Award for Literary Fiction & Classics (2016)", "Rosenthal Family Foundation Award (1965)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1999-05-01 00:00:00", "ISBN": "1860466419"},
{"url": "https://www.goodreads.com/book/show/195326.The_Bingo_Palace", "num_ratings": "3,951", "num_reviews": "152", "avg_ratings": 3.87, "genres": ["Fiction", "Novels", "Literature"], "title": "The Bingo Palace", "description": ["At a crossroads in his life, Lipsha Morrissey is summoned by his grandmother to return to the reservation. There, he falls in love for the very first time--with the beautiful Shawnee Ray, who's already considering a marriage proposal from Lipsha's wealthy entrepreneurial boss, Lyman Lamartine. But when all efforts to win Shwawnee's affections go hopelessly awry, Lipsha see", "At a crossroads in his life, Lipsha Morrissey is summoned by his grandmother to return to the reservation. There, he falls in love for the very first time--with the beautiful Shawnee Ray, who's already considering a marriage proposal from Lipsha's wealthy entrepreneurial boss, Lyman Lamartine. But when all efforts to win Shwawnee's affections go hopelessly awry, Lipsha seeks out his great-grandmother for a magical solution to his romantic dilemma--on sacred ground where a federally sanctioned bingo palace is slated for construction.", "Louise Erdrich's luminous novel ", " is a tale of spiritual death and reawakening; of money, desperate love, and wild hope; and of the enduring power of cherished dreams. (Harper Perennial)"], "author": "Louise Erdrich", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-13 00:00:00", "ISBN": "0061129755"},
{"url": "https://www.goodreads.com/book/show/52528.The_Painted_Drum", "num_ratings": "6,378", "num_reviews": "794", "avg_ratings": 3.85, "genres": ["Fiction", "Historical", "Historical Fiction", "Audiobook", "Novels"], "title": "The Painted Drum", "description": ["When a woman named Faye Travers is called upon to appraise the estate of a family in her small New Hampshire town, she isn't surprised to discover a forgotten cache of valuable Native American artifacts. After all, the family descends from an Indian agent who worked on the North Dakota Ojibwe reservation that is home to her mother's family. However, she stops dead in her t", "When a woman named Faye Travers is called upon to appraise the estate of a family in her small New Hampshire town, she isn't surprised to discover a forgotten cache of valuable Native American artifacts. After all, the family descends from an Indian agent who worked on the North Dakota Ojibwe reservation that is home to her mother's family. However, she stops dead in her tracks when she finds in the collection a rare drum—a powerful yet delicate object, made from a massive moose skin stretched across a hollow of cedar, ornamented with symbols she doesn't recognize and dressed in red tassels and a beaded belt and skirt—especially since, without touching the instrument, she hears it sound. And so begins an illuminating journey both backward and forward in time, following the strange passage of a powerful yet delicate instrument, and revealing the extraordinary lives it has touched and defined.", "Compelling and unforgettable, bestselling author Louise Erdrich's ", " explores the often fraught relationship between mothers and daughters, the strength of family, and the intricate rhythms of grief with all the grace, wit, and startling beauty that characterizes this acclaimed author's finest work."], "author": "Louise Erdrich", "num_pages": "304", "awards": ["Chicago Tribune Heartland Prize for Fiction (2006)", "Minnesota Book Award for Novel & Short Story (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-22 00:00:00", "ISBN": "0060515112"},
{"url": "https://www.goodreads.com/book/show/867387.The_Blessing_Way", "num_ratings": "17,061", "num_reviews": "752", "avg_ratings": 4.06, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "The Blessing Way", "description": [".", "Homicide is always an abomination, but there is something exceptionally disturbing about the victim discovered in a high lonely place, a corpse with a mouth full of sand, abandoned at a crime scene seemingly devoid of tracks or useful clues. Though it goes against his better judgment, Navajo Tribal Police Lieutenant Joe Leaphorn ca", ".", "Homicide is always an abomination, but there is something exceptionally disturbing about the victim discovered in a high lonely place, a corpse with a mouth full of sand, abandoned at a crime scene seemingly devoid of tracks or useful clues. Though it goes against his better judgment, Navajo Tribal Police Lieutenant Joe Leaphorn cannot help but suspect the hand of a supernatural killer. There is palpable evil in the air, and Leaphorn's pursuit of a Wolf-Witch is leading him where even the bravest men fear, on a chilling trail that winds perilously between mysticism and murder."], "author": "Tony Hillerman", "num_pages": "320", "awards": ["Edgar Award Nominee for Best First Novel (1971)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Emma Leaphorn", "Bergen McKee", "Ellen Leon", "Jim Hall", "Jeremy Canfield", "Luis Horseman"], "language": "English", "publish_date": "1990-03-07 00:00:00", "ISBN": "0061000019"},
{"url": "https://www.goodreads.com/book/show/46277.Green_Grass_Running_Water", "num_ratings": "5,609", "num_reviews": "355", "avg_ratings": 4.02, "genres": ["Fiction", "Cultural", "Canada", "Fantasy", "Magical Realism"], "title": "Green Grass, Running Water", "description": ["Strong, Sassy women and hard-luck hardheaded men, all searching for the middle ground between Native American tradition and the modern world, perform an elaborate dance of approach and avoidance in this magical, rollicking tale by Cherokee author Thomas King. Alberta is a university professor who would like to trade her two boyfriends for a baby but no husband; Lionel is f", "Strong, Sassy women and hard-luck hardheaded men, all searching for the middle ground between Native American tradition and the modern world, perform an elaborate dance of approach and avoidance in this magical, rollicking tale by Cherokee author Thomas King. Alberta is a university professor who would like to trade her two boyfriends for a baby but no husband; Lionel is forty and still sells televisions for a patronizing boss; Eli and his log cabin stand in the way of a profitable dam project. These three—and others—are coming to the Blackfoot reservation for the Sun Dance and there they will encounter four Indian elders and their companion, the trickster Coyote—and nothing in the small town of Blossom will be the same again…"], "author": "Thomas King", "num_pages": "469", "awards": ["Canadian Authors Association Award for Fiction"], "places": ["Alberta"], "character_names": [], "language": "English", "publish_date": "1994-06-01 00:00:00", "ISBN": "0553373684"},
{"url": "https://www.goodreads.com/book/show/53496.Walk_Two_Moons", "num_ratings": "138,270", "num_reviews": "6,051", "avg_ratings": 3.96, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Childrens", "Childrens", "Middle Grade"], "title": "Walk Two Moons", "description": ["\"How about a story? Spin us a yarn.\"", "Instantly, Phoebe Winterbottom came to mind. \"I could tell you an extensively strange story,\" I warned.", "\"Oh, good!\" Gram said. \"Delicious!\"", "And that is how I happened to tell them about Phoebe, her disappearing mother, and the lunatic.", "As Sal entertains her grandparents with Phoebe's outrageous story, her own story begins to unfold — the st", "\"How about a story? Spin us a yarn.\"", "Instantly, Phoebe Winterbottom came to mind. \"I could tell you an extensively strange story,\" I warned.", "\"Oh, good!\" Gram said. \"Delicious!\"", "And that is how I happened to tell them about Phoebe, her disappearing mother, and the lunatic.", "As Sal entertains her grandparents with Phoebe's outrageous story, her own story begins to unfold — the story of a thirteen-year-old girl whose only wish is to be reunited with her missing mother.", "In her own award-winning style, Sharon Creech intricately weaves together two tales, one funny, one bittersweet, to create a heartwarming, compelling, and utterly moving story of love, loss, and the complexity of human emotion."], "author": "Sharon Creech", "num_pages": "280", "awards": ["Newbery Medal (1995)", "Dorothy Canfield Fisher Children's Book Award Nominee (1996)", "W.H. Smith's Mind-Boggling Books Award (1996)", "Oklahoma Sequoyah Award for YA (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-05-24 00:00:00", "ISBN": "0060739495"},
{"url": "https://www.goodreads.com/book/show/52877.The_Toughest_Indian_in_the_World", "num_ratings": "6,210", "num_reviews": "394", "avg_ratings": 4.08, "genres": ["Fiction", "Short Stories", "Literature", "Literature", "American"], "title": "The Toughest Indian in the World", "description": ["A beloved American writer whose books are championed by critics and readers alike, Sherman Alexie has been hailed by Time as \"one of the better new novelists, Indian or otherwise.\" ", "In these stories, we meet the kind of American Indians we rarely see in literature -- the kind who pay their bills, hold down jobs, fall in and out of love. ", "A Spokane Indian journalist transplan", "A beloved American writer whose books are championed by critics and readers alike, Sherman Alexie has been hailed by Time as \"one of the better new novelists, Indian or otherwise.\" ", "In these stories, we meet the kind of American Indians we rarely see in literature -- the kind who pay their bills, hold down jobs, fall in and out of love. ", "A Spokane Indian journalist transplanted from the reservation to the city picks up a hitchhiker, a Lummi boxer looking to take on the toughest Indian in the world. A Spokane son waits for his diabetic father to come home from the hospital, tossing out the Hershey Kisses the father has hidden all over the house. An estranged interracial couple, separated in the midst of a traffic accident, rediscover their love for each other. A white drifter holds up an International House of Pancakes, demanding a dollar per customer and someone to love, and emerges with $42 and an overweight Indian he dubs Salmon Boy. ", "Sherman Alexie's voice is one of remarkable passion, and these stories are love stories -- between parents and children, white people and Indians, movie stars and ordinary people. Witty, tender, and fierce, ", " is a virtuoso performance by one of the country's finest writers."], "author": "Sherman Alexie", "num_pages": "256", "awards": ["Kiriyama Prize Nominee for Fiction (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-01 00:00:00", "ISBN": "0802138004"},
{"url": "https://www.goodreads.com/book/show/22610866-dwellers-of-ahwahnee", "num_ratings": "123", "num_reviews": "33", "avg_ratings": 4.76, "genres": ["Fantasy", "Mythology", "Young Adult", "Paranormal", "Shapeshifters", "Romance", "Paranormal Romance", "Inspirational", "Fantasy", "Supernatural"], "title": "Dwellers of Ahwahnee (The Beyond Collection)", "description": ["The Dwellers of Ahwahnee (The Beyond Collection) is finally here! 3 Great paranormal books that follow the generation of shifters from the Ahwahneechee. These books are found on Goodreads lists and are #1 in many categories.", "Come to the Beyond for a supernatural unique read!", "BOOK 1: BEYOND BRIDALVEIL FALL", "Oria is celebrating her eighteenth birthday in Yosemite National Park w", "The Dwellers of Ahwahnee (The Beyond Collection) is finally here! 3 Great paranormal books that follow the generation of shifters from the Ahwahneechee. These books are found on Goodreads lists and are #1 in many categories.", "Come to the Beyond for a supernatural unique read!", "BOOK 1: BEYOND BRIDALVEIL FALL", "Oria is celebrating her eighteenth birthday in Yosemite National Park when she goes into the pool at the bottom of Bridalveil Fall, only to come out beyond it.", "In another world she learns she is The Golden Queen of the Ahwahneechee tribe, and that she is a shape shifter. Here the Dwellers of Ahwahnee fight the Evil that tries to get into the world of man. Will she find her soul mate in Grey Wolf or is he more than he appears to be? One thing is for sure, with all the magic and shape shifting happening, only the all knowing grandfather and her grandmother's wisdom can guide her through the Evil Beyond Bridalveil Fall.", "BOOK 2: BEYOND ORIA FALLS", "Oria is the Golden Queen of the Ahwahneechees and a Dweller of Ahwahnee. Together with her friends she travels back to find out why the Village of Lost Souls cannot find their way home to the West. The Ale is back in this second book full of action packed magic and shapeshifting. Will Oria finally find love and happiness with Grey Wolf or will a new evil threaten her magical world Beyond Oria Falls? Join the Dwellers as they try to keep evil out of the world of man.", "BOOK 3: BEYOND THE WORLD OF MAN", "This is the third installment in the Dwellers of Ahwahnee series and with the destruction of the world of man, the Dwellers traveled to other worlds and survived for twenty years.", "With Oria's magic the 'Beyond' has grown and they can now come home.", "There is a different kind of evil in the world now. Who will survive in the 'Beyond'? This generation", "of shapeshifters are different and will lead the Dwellers into a new age.", "Spirit Walker is rebellious and has often been called a Wildcat. She has been sheltered in The Village of Lost Souls for her entire life. Now she is to become the Golden Queen of the Ahwahneechees.", "Her choices for the future involve adult decisions and with only her mother's journal to guide her, she must rely on the magic within the pages."], "author": "Sheryl Seal", "num_pages": "502", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/106542.The_Antelope_Wife", "num_ratings": "3,058", "num_reviews": "278", "avg_ratings": 3.8, "genres": ["Fiction", "Fantasy", "Magical Realism", "Historical", "Historical Fiction"], "title": "The Antelope Wife", "description": ["One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life", "One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life the people who live in or around this midwestern city. And like a modern city itself, it portrays people of all backgrounds and is a mixture of vibrant cultures and ideas. But also like a modern city, it has an edge, troubled by violence.", "\"New York Times\" bestselling author Louise Erdrich has twice won the National Magazine Award and her work has been included in both the O. Henry and the Best American collections several times."], "author": "Louise Erdrich", "num_pages": "256", "awards": ["World Fantasy Award for Best Novel (1999)"], "places": ["Minneapolis, Minnesota"], "character_names": [], "language": "English", "publish_date": "1998-10-16 00:00:00", "ISBN": "0007136366"},
{"url": "https://www.goodreads.com/book/show/106931.I_Heard_the_Owl_Call_My_Name", "num_ratings": "5,138", "num_reviews": "603", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Classics", "Cultural", "Canada"], "title": "I Heard the Owl Call My Name", "description": ["In a world that knows too well the anguish inherent in the clash of old ways and new lifestyles, Margaret Craven's classic and timeless story of a young man's journey into the Pacific Northwest is as relevant today as ever.", "Here amid the grandeur of British Columbia stands the village of Kingcome, a place of salmon runs and ancient totems - a village so steeped in time that", "In a world that knows too well the anguish inherent in the clash of old ways and new lifestyles, Margaret Craven's classic and timeless story of a young man's journey into the Pacific Northwest is as relevant today as ever.", "Here amid the grandeur of British Columbia stands the village of Kingcome, a place of salmon runs and ancient totems - a village so steeped in time that, according to Kwakiutl legend, it was founded by two brothers left on earth after the great flood. Yet in this Eden of such natural beauty and richness, the old culture of totems and potlaches is under attack - slowly being replaced by a new culture of prefab houses and alcoholism. Into this world, where an entire generation of young people has become disenchanted and alienated from their heritage, Craven introduces Mark Brian, a young vicar sent to the small isolated parish by his church.", "This is Mark's journey of discovery - a journey that will teach him about life, death, and the transforming power of love. It is a journey that will resonate in the mind of readers long after the book is done."], "author": "Margaret Craven", "num_pages": "146", "awards": ["Great Lakes Colleges Association New Writers Award for Fiction (1974)", "California Young Readers Medal Nominee for Young Adult (1979)"], "places": ["British Columbia"], "character_names": [], "language": "English", "publish_date": "2005-01-10 00:00:00", "ISBN": "1550413392"},
{"url": "https://www.goodreads.com/book/show/91439.The_Beet_Queen", "num_ratings": "11,642", "num_reviews": "483", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "Literary Fiction", "Contemporary"], "title": "The Beet Queen", "description": ["On a spring morning in 1932, young Karl and Mary Adare arrive by boxcar in Argus, North Dakota. After being orphaned in a most peculiar way, they seek refuge in the butcher shop of their aunt and her husband. So begins an exhilarating forty-year saga brimming with colorful, unforgettable characters: ordinary Mary, who will cause a miracle; seductive Karl, who lacks his sis", "On a spring morning in 1932, young Karl and Mary Adare arrive by boxcar in Argus, North Dakota. After being orphaned in a most peculiar way, they seek refuge in the butcher shop of their aunt and her husband. So begins an exhilarating forty-year saga brimming with colorful, unforgettable characters: ordinary Mary, who will cause a miracle; seductive Karl, who lacks his sister's gift for survival; Sita, their lovely but disturbed cousin; and the half-Native American Celestine James, who will become Mary’s best friend. Theirs is a story grounded in the tenacity of relationships, the extraordinary magic of natural events, and the unending mystery of the human condition.", "Bestselling, National Book Award-winning author Louise Erdrich dazzles in this vibrant and heartfelt tale of abandonment and sexual obsession, jealousy and unstinting love that explores with empathy, humor, and power the eternal mystery of the human condition."], "author": "Louise Erdrich", "num_pages": "368", "awards": ["National Book Critics Circle Award Nominee for Fiction (1986)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2017-05-23 00:00:00", "ISBN": "0060835273"},
{"url": "https://www.goodreads.com/book/show/2227528.The_Plague_of_Doves", "num_ratings": "11,448", "num_reviews": "1,708", "avg_ratings": 3.76, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Novels"], "title": "The Plague of Doves", "author": "Louise Erdrich", "num_pages": "313", "awards": ["Pulitzer Prize Nominee for Fiction (2009)", "Anisfield-Wolf Book Award (2009)", "Dayton Literary Peace Prize Nominee for Fiction (2009)", "Minnesota Book Award for Novel & Short Story (2009)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2008-04-29 00:00:00", "ISBN": "0060515120"},
{"url": "https://www.goodreads.com/book/show/24150438-beyond-the-great-river", "num_ratings": "285", "num_reviews": "40", "avg_ratings": 4.1, "genres": ["Historical", "Historical Fiction", "Fiction", "Business", "Amazon", "Historical"], "title": "Beyond the Great River", "description": ["They felt she was too spirited, too forward, too boyish, not as feminine and as graceful as a young woman should be. Their frowns followed her like a cloud, but she didn't care. Other girls may have worked happily, danced beautifully, or sewn themselves pretty dresses, but they could not climb or run or swim as well as she did, the silly, giggly, empty-headed creatures tha", "They felt she was too spirited, too forward, too boyish, not as feminine and as graceful as a young woman should be. Their frowns followed her like a cloud, but she didn't care. Other girls may have worked happily, danced beautifully, or sewn themselves pretty dresses, but they could not climb or run or swim as well as she did, the silly, giggly, empty-headed creatures that they were. ", "The entire village may have been frowning at her, but when she spotted the enemy forces camping under the Sacred Hill, they had no choice but to listen. ", "Okwaho knew they were being watched. Whether by spirits or a wandering local, he could not ignore the feeling of the wary, frightened, hate-filled eyes staring out of the forest, burning his skin. But of course! Of course, the local woods distrusted them. He and his people were invaders, not coming to trade or engage in other peaceful dealings, but to raid these settlements. The enemies from the lands of the rising sun were bad, evil, impossible to understand. And yet… ", "And yet, when the urge to prove himself lent him enough words to convince the leader of their party to send him and his friend on the mission of scouting the suspected hill, he could not have imagined what consequences this deviation from the well-planned road would lead them all into, the attackers and defenders alike. "], "author": "Zoe Saadia", "num_pages": "310", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/52878.Indian_Killer", "num_ratings": "6,870", "num_reviews": "564", "avg_ratings": 3.78, "genres": ["Fiction", "Mystery", "Novels", "Contemporary", "Thriller"], "title": "Indian Killer", "description": ["A murderer is stalking and scalping white men in Seattle, his calling card a pair of feathers crossed on the victim's chest. While this so-called Indian Killer terrorises the city, its Native American population is thrown into turmoil. With each new murder, the city is gripped by fear, and as the killer searches for his latest victim, the novel builds to its unexpected and", "A murderer is stalking and scalping white men in Seattle, his calling card a pair of feathers crossed on the victim's chest. While this so-called Indian Killer terrorises the city, its Native American population is thrown into turmoil. With each new murder, the city is gripped by fear, and as the killer searches for his latest victim, the novel builds to its unexpected and terrifying climax."], "author": "Sherman Alexie", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-08-16 00:00:00", "ISBN": "009926823X"},
{"url": "https://www.goodreads.com/book/show/52872.Flight", "num_ratings": "13,615", "num_reviews": "2,021", "avg_ratings": 3.89, "genres": ["Fiction", "Young Adult", "Fantasy", "Historical", "Historical Fiction", "Science Fiction", "Time Travel", "Audiobook", "Magical Realism", "Science Fiction", "Novels", "Young Adult", "Coming Of Age"], "title": "Flight", "description": ["Sherman Alexie is one of our most gifted and accomplished storytellers and a treasured writer of huge national stature. His first novel in ten years is the hilarious and tragic portrait of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful and swift, prose, ", " follows this troubled foster teenager--a", "Sherman Alexie is one of our most gifted and accomplished storytellers and a treasured writer of huge national stature. His first novel in ten years is the hilarious and tragic portrait of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful and swift, prose, ", " follows this troubled foster teenager--a boy who is not a \"legal\" Indian because he was never claimed by his father--as he learns that violence is not the answer.", "The journey for ", "'s young hero begins as he's about to commit a massive act o violence. At the moment of decision, he finds himself shot back through time to resurface in the body of an FBI agent during the civil rights era, where he sees why \"Hell is Re driver, Idaho, in the 1970s.\" Red River is only the first stop in an eye-opening trip through moments in American history. He will continue traveling back to inhabit the body of an Indian child during the battle at Little Bighorn and then ride with an Indian tracker in the nineteenth century before materializing as an airline pilot jetting through the skies today. During these furious travels through time, his refrain grows: \"Who's to judge?\" and \"I don't understand humans.\" When finally, blessedly, our young warrior comes to rest again in his own life, he is mightily transformed by all he has seen.", "This is Sherman Alexie at his most brilliant--making us laugh while he's breaking our hearts. ", " has said that \"Alexie, like his characters, is on a modern-day vision quest,\" and in ", " he seeks nothing less than an understanding of why human beings hate. ", " is irrepressible, fearless, and groundbreaking Alexie."], "author": "Sherman Alexie", "num_pages": "181", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0802170374"},
{"url": "https://www.goodreads.com/book/show/13602426-the-round-house", "num_ratings": "83,152", "num_reviews": "8,628", "avg_ratings": 3.92, "genres": ["Fiction", "Mystery", "Historical", "Historical Fiction", "Young Adult", "Coming Of Age"], "title": "The Round House", "description": ["An exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family.", "One of the most revered novelists of our time - a brilliant chronicler of Native-American life - Louise Erdrich returns to the territory of her bestselling, Pulitzer Prize finalist The Plague of Doves wi", "An exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family.", "One of the most revered novelists of our time - a brilliant chronicler of Native-American life - Louise Erdrich returns to the territory of her bestselling, Pulitzer Prize finalist The Plague of Doves with The Round House, transporting readers to the Ojibwe reservation in North Dakota. It is an exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family. ", "Riveting and suspenseful, arguably the most accessible novel to date from the creator of Love Medicine, The Beet Queen, and The Bingo Palace, Erdrich’s The Round House is a page-turning masterpiece of literary fiction - at once a powerful coming-of-age story, a mystery, and a tender, moving novel of family, history, and culture."], "author": "Louise Erdrich", "num_pages": "323", "awards": ["National Book Award for Fiction (2012)", "American Book Award (2013)", "ALA Alex Award (2013)", "Indies Choice Book Award for Adult Fiction (2013)", "Dayton Literary Peace Prize Nominee for Fiction (2013)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2013)", "Minnesota Book Award for Novel & Short Story (2013)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2012-10-02 00:00:00", "ISBN": "0062065246"},
{"url": "https://www.goodreads.com/book/show/110996.House_Made_of_Dawn", "num_ratings": "5,693", "num_reviews": "377", "avg_ratings": 3.68, "genres": ["Fiction", "Classics", "Literature"], "title": "House Made of Dawn", "description": ["The magnificent Pulitzer Prize-winning novel of a proud stranger in his native land.", "He was a young American Indian named Abel, and he lived in two worlds. One was that of his father, wedding him to the rhythm of the seasons, the harsh beauty of the land, the ecstasy of the drug called peyote. The other was the world of the twentieth century, goading him into a compulsive c", "The magnificent Pulitzer Prize-winning novel of a proud stranger in his native land.", "He was a young American Indian named Abel, and he lived in two worlds. One was that of his father, wedding him to the rhythm of the seasons, the harsh beauty of the land, the ecstasy of the drug called peyote. The other was the world of the twentieth century, goading him into a compulsive cycle of sexual exploits, dissipation, and disgust. Home from a foreign war, he was a man being torn apart, a man descending into hell."], "author": "N. Scott Momaday", "num_pages": "198", "awards": ["Pulitzer Prize for Fiction (1969)"], "places": ["New Mexico"], "character_names": [], "language": "English", "publish_date": "2000-05-02 00:00:00", "ISBN": "0072434201"},
{"url": "https://www.goodreads.com/book/show/38296.The_Last_of_the_Mohicans", "num_ratings": "78,384", "num_reviews": "2,244", "avg_ratings": 3.7, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Adventure", "Literature"], "title": "The Last of the Mohicans", "description": ["The wild rush of action in this classic frontier adventure story has made", " the most popular of James Fenimore Cooper’s Leatherstocking Tales. Deep in the forests of upper New York State, the brave woodsman Hawkeye (Natty Bumppo) and his loyal Mohican friends Chingachgook and Uncas become embroiled in the bloody battles of the French and Indian War.", "The wild rush of action in this classic frontier adventure story has made", " the most popular of James Fenimore Cooper’s Leatherstocking Tales. Deep in the forests of upper New York State, the brave woodsman Hawkeye (Natty Bumppo) and his loyal Mohican friends Chingachgook and Uncas become embroiled in the bloody battles of the French and Indian War. The abduction of the beautiful Munro sisters by hostile savages, the treachery of the renegade brave Magua, the ambush of innocent settlers, and the thrilling events that lead to the final tragic confrontation between rival war parties create an unforgettable, spine-tingling picture of life on the frontier. And as the idyllic wilderness gives way to the forces of civilization, the novel presents a moving portrayal of a vanishing race and the end of its way of life in the great American forests."], "author": "James Fenimore Cooper", "num_pages": "410", "awards": [], "places": ["Upstate New York"], "character_names": ["Nathaniel Bumppo", "Chingachgook", "Magua", "Uncas", "Cora Munro", "Alice Munro", "Colonel George Munro", "Duncan Heyward", "David Gamut", "Tamenund", "General Marquis de Montcalm", "General Daniel Webb"], "language": "English", "publish_date": "1982-06-01 00:00:00", "ISBN": "0553213296"},
{"url": "https://www.goodreads.com/book/show/332613.One_Flew_Over_the_Cuckoo_s_Nest", "num_ratings": "540,366", "num_reviews": "8,768", "avg_ratings": 4.19, "genres": ["Classics", "Fiction", "Young Adult", "High School", "Academic", "Read For School"], "title": "One Flew Over the Cuckoo's Nest", "description": ["From the 1962 Jacket:", "Like George Orwell and Philip Wylie, Ken Kesey is concerned with man's battle to be himself in a world of increasing controls, the battle of joy and freedom against a society which fosters guilt and shame. His first novel, One Flew Over the Cuckoo's Nest, tells the story of a struggle between a man and a woman for the spirits and hearts of a group of p", "From the 1962 Jacket:", "Like George Orwell and Philip Wylie, Ken Kesey is concerned with man's battle to be himself in a world of increasing controls, the battle of joy and freedom against a society which fosters guilt and shame. His first novel, One Flew Over the Cuckoo's Nest, tells the story of a struggle between a man and a woman for the spirits and hearts of a group of people who have been defeated by the world.", "The setting for these defeated lives is a mental institution. The teller of the story, a half-Indian and a long-time inmate, has made the most complete retreat from life of all of them; he will not talk, and he has fooled the staff into thinking he is deaf and dumb. But through his self-imposed protective fog he is an acute observer. His vision of the life around him seems to have a truth which is beyond the definitions of sanity or insanity. To him the world is run by an all-powerful \"Combine.\" The hear of the war, the \"Big Nurse,\" is the chief instrument of evil. She wields her insidious power over the men to destroy their wills and freeze them into mindless obedience.", "Into this gray world comes McMurphy, a brawling, gambling man, full of spirit and a glorious lust for life. He is horrified by the docility with which the other men accept the rule of the Big Nurse and decides to fight her on her own terms. The battle begins, for him, as a lark - a way of winning the bets he has made with the men. And then, as he becomes more aware of the terrible dangers in it, and more committed to the others who have come to count on him for their own survival, his decision to go on is a heroic act of sacrifice and compassion."], "author": "Ken Kesey", "num_pages": "325", "awards": [], "places": ["Salem, Oregon"], "character_names": ["Chief Bromden", "Randle Patrick McMurphy", "Nurse Ratched", "William \"Billy\" Bibbit", "Charles Cheswick", "Dale Harding", "Doctor Spivey", "Bruce Fredrickson", "James \"Jim\" Sefelt", "Scanlon", "Martini"], "language": "English", "publish_date": "1963-02-01 00:00:00", "ISBN": "0451163966"},
{"url": "https://www.goodreads.com/book/show/30868.The_Bean_Trees", "num_ratings": "122,131", "num_reviews": "5,677", "avg_ratings": 3.96, "genres": ["Fiction", "Contemporary", "Novels"], "title": "The Bean Trees", "description": ["Clear-eyed and spirited, Taylor Greer grew up poor in rural Kentucky with the goals of avoiding pregnancy and getting away. But when she heads west with high hopes and a barely functional car, she meets the human condition head-on. By the time Taylor arrives in Tucson, Arizona, she has acquired a completely unexpected child, a three-year-old American Indian girl named Turt", "Clear-eyed and spirited, Taylor Greer grew up poor in rural Kentucky with the goals of avoiding pregnancy and getting away. But when she heads west with high hopes and a barely functional car, she meets the human condition head-on. By the time Taylor arrives in Tucson, Arizona, she has acquired a completely unexpected child, a three-year-old American Indian girl named Turtle, and must somehow come to terms with both motherhood and the necessity for putting down roots. Hers is a story about love and friendship, abandonment and belonging, and the discovery of surprising resources in apparently empty places."], "author": "Barbara Kingsolver", "num_pages": "232", "awards": [], "places": ["Tucson, Arizona"], "character_names": ["Taylor Greer", "Turtle Greer", "Lou Ann Ruiz", "Estevan", "Esperanza", "Mattie"], "language": "English", "publish_date": "1989-03-01 00:00:00", "ISBN": "0812474945"},
{"url": "https://www.goodreads.com/book/show/63837.The_Last_Report_on_the_Miracles_at_Little_No_Horse", "num_ratings": "8,649", "num_reviews": "999", "avg_ratings": 4.18, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Novels"], "title": "The Last Report on the Miracles at Little No Horse", "description": ["This is the story of Father Damien Modeste, priest to his beloved people, the Ojibwe. Modeste, nearing the end of his life, dreads the discovery of his physical identity -- for he is a woman who has lived as a man.", "For more than a half century, Father Damien Modeste has served his beloved people, the Ojibwe, on the remote reservation of Little No Horse. To complicate his fe", "This is the story of Father Damien Modeste, priest to his beloved people, the Ojibwe. Modeste, nearing the end of his life, dreads the discovery of his physical identity -- for he is a woman who has lived as a man.", "For more than a half century, Father Damien Modeste has served his beloved people, the Ojibwe, on the remote reservation of Little No Horse. To complicate his fears, his quiet life changes when a troubled colleague comes to the reservation to investigate the life of the perplexing, difficult, possibly false saint Sister Leopolda. Father Damien alone knows the strange truth of Sister Leopolda's piety and is faced with the most difficult decision of his life: Should he reveal all he knows and risk everything? Or should he manufacture a protective history though he believes Leopolda's wonder-working is motivated by evil?"], "author": "Louise Erdrich", "num_pages": "368", "awards": ["Minnesota Book Award for Novel & Short Story (2002)", "National Book Award Finalist for Fiction (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0007136358"},
{"url": "https://www.goodreads.com/book/show/233818.Island_of_the_Blue_Dolphins", "num_ratings": "258,053", "num_reviews": "7,260", "avg_ratings": 3.81, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Classics", "Childrens"], "title": "Island of the Blue Dolphins", "description": ["An alternate cover edition can be found ", "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.", "This is the story of Karana, the Indian girl", "An alternate cover edition can be found ", "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.", "This is the story of Karana, the Indian girl who lived alone for years on the Island of the Blue Dolphins. Year after year, she watched one season pass into another and waited for a ship to take her away. But while she waited, she kept herself alive by building shelter, making weapons, finding food, and fighting her enemies, the wild dogs. It is not only an unusual adventure of survival, but also a tale of natural beauty and personal discovery."], "author": "Scott O'Dell", "num_pages": "184", "awards": ["Newbery Medal (1961)", "Lewis Carroll Shelf Award (1961)", "Nene Award (1964)", "Dorothy Canfield Fisher Children's Book Award Nominee (1962)", "Deutscher Jugendliteraturpreis for Jugendbuch (1963)"], "places": ["Island of the Blue Dolphins", "California"], "character_names": ["Karana"], "language": "English", "publish_date": "1987-02-01 00:00:00", "ISBN": "0440439884"},
{"url": "https://www.goodreads.com/book/show/78887.Tracks", "num_ratings": "9,735", "num_reviews": "524", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Academic", "School"], "title": "Tracks", "description": ["Set earliest in time within the cycle of her prizewinning and bestselling books, Love Medicine and The Beet Queen, Tracks takes readers to North Dakota at a time when Indian tribes were struggling to keep what little remained of their land. Features many familiar characters."], "author": "Louise Erdrich", "num_pages": "226", "awards": [], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "1989-08-07 00:00:00", "ISBN": "0060972459"},
{"url": "https://www.goodreads.com/book/show/91440.Love_Medicine", "num_ratings": "18,507", "num_reviews": "1,266", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Short Stories", "Novels"], "title": "Love Medicine", "description": ["The first book in Louise Erdrich's highly acclaimed \"Native American\" trilogy that includes \"The Beet Queen,\" \"Tracks,\" and \"The Bingo Palace,\" re-sequenced and expanded to include never-before-published chapters.", "\"A dazzling series of family portraits.... This novel is simply about the power of love.\" --"], "author": "Louise Erdrich", "num_pages": "367", "awards": ["American Book Award (1985)", "Los Angeles Times Book Prize for Fiction (1985)", "Sue Kaufman Prize for First Fiction (1985)", "Great Lakes Colleges Association New Writers Award for Fiction (1985)", "National Book Critics Circle Award for Fiction (1984)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "0060786469"},
{"url": "https://www.goodreads.com/book/show/6159.Reservation_Blues", "num_ratings": "11,605", "num_reviews": "837", "avg_ratings": 3.98, "genres": ["Fiction", "Magical Realism", "Literature", "Novels"], "title": "Reservation Blues", "description": ["The life of Spokane Indian Thomas Builds-the-Fire irrevocably changes when blues legend Robert Johnson miraculously appears on his reservation and passes the misfit storyteller his enchanted guitar. Inspired by this gift, Thomas forms Coyote Springs, an all-Indian Catholic band who find themselves on a magical tour that leads from reservation bars to Seattle and New York--", "The life of Spokane Indian Thomas Builds-the-Fire irrevocably changes when blues legend Robert Johnson miraculously appears on his reservation and passes the misfit storyteller his enchanted guitar. Inspired by this gift, Thomas forms Coyote Springs, an all-Indian Catholic band who find themselves on a magical tour that leads from reservation bars to Seattle and New York--and deep within their own souls."], "author": "Sherman Alexie", "num_pages": "306", "awards": ["American Book Award (1996)", "International DUBLIN Literary Award Nominee (1997)"], "places": ["Wellpinit, Washington"], "character_names": [], "language": "English", "publish_date": "2005-02-07 00:00:00", "ISBN": "0802141900"},
{"url": "https://www.goodreads.com/book/show/588234.Ceremony", "num_ratings": "14,965", "num_reviews": "1,124", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Academic", "School"], "title": "Ceremony", "description": ["Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind o", "Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind of comfort and resolution. Tayo's quest leads him back to the Indian past and its traditions, to beliefs about witchcraft and evil, and to the ancient stories of his people. The search itself becomes a ritual, a curative ceremony that defeats the most virulent of afflictions—despair."], "author": "Leslie Marmon Silko", "num_pages": "262", "awards": ["American Book Award (1980)"], "places": [], "character_names": [], "language": "English", "publish_date": "1986-03-04 00:00:00", "ISBN": "0140086838"},
{"url": "https://www.goodreads.com/book/show/52873.The_Lone_Ranger_and_Tonto_Fistfight_in_Heaven", "num_ratings": "21,749", "num_reviews": "1,804", "avg_ratings": 4.09, "genres": ["Fiction", "Short Stories", "Literature", "Humor"], "title": "The Lone Ranger and Tonto Fistfight in Heaven", "description": ["In this darkly comic short story collection, Sherman Alexie, a Spokane/Coeur d'Alene Indian, brilliantly weaves memory, fantasy, and stark realism to paint a complex, grimly ironic portrait of life in and around the Spoke Indian Reservation. These 22 interlinked tales are narrated by characters raised on humiliation and government-issue cheese, and yet are filled with pass", "In this darkly comic short story collection, Sherman Alexie, a Spokane/Coeur d'Alene Indian, brilliantly weaves memory, fantasy, and stark realism to paint a complex, grimly ironic portrait of life in and around the Spoke Indian Reservation. These 22 interlinked tales are narrated by characters raised on humiliation and government-issue cheese, and yet are filled with passion and affection, myth and dream. There is Victor, who as a nine-year-old crawled between his unconscious parents hoping that the alcohol seeping through their skins might help him sleep. Thomas Builds-the-Fire, who tells his stories long after people stop listening, and Jimmy Many Horses, dying of cancer, who writes letters on stationary that reads \"From the Death Bed of James Many Horses III,\" even though he actually writes them on his kitchen table. Against a backdrop of alcohol, car accidents, laughter, and basketball, Alexie depicts the distances between Indians and whites, reservation Indians and urban Indians, men and women, and most poetically, between modern Indians and the traditions of the past."], "author": "Sherman Alexie", "num_pages": "242", "awards": ["PEN/Hemingway Foundation Award Nominee (1993)", "Washington State Book Award (1994)"], "places": ["Washington (the state)"], "character_names": [], "language": "English", "publish_date": "2005-02-08 00:00:00", "ISBN": "0802141676"}
]