[
{"url": "https://www.goodreads.com/book/show/16050911-beast", "num_ratings": "3,157", "num_reviews": "333", "avg_ratings": 4.22, "genres": ["Romance", "Romance", "Interracial Romance", "Contemporary", "Romance", "Contemporary Romance", "Fairy Tales", "Beauty and The Beast", "War", "Military Fiction"], "title": "Beast", "description": ["Pepper Pace's interracial fairytale is the story of Beast; a Marine with a destroyed face and a plus sized beauty who has identity issues. A lesson learned is that beauty is not what is on the outside...In this romance that is taken from the Beauty and the Beasts' fairytale, it will leave you questioning 'who is the beauty and who is the beast?'"], "author": "Pepper Pace", "num_pages": "401", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15768191-sweet-peril", "num_ratings": "42,549", "num_reviews": "2,847", "avg_ratings": 4.27, "genres": ["Young Adult", "Fantasy", "Fantasy", "Paranormal", "Romance", "Paranormal", "Angels"], "title": "Sweet Peril", "description": ["Anna Whitt, the daughter of a guardian angel and a demon, promised herself she’d never do the work of her father—polluting souls. She’d been naive to make such a vow. She’d been naive about a lot of things. ", "Haunted by demon whisperers, Anna does whatever she can to survive, even if it means embracing her dark side and earning an unwanted reputation as her school’s party gi", "Anna Whitt, the daughter of a guardian angel and a demon, promised herself she’d never do the work of her father—polluting souls. She’d been naive to make such a vow. She’d been naive about a lot of things. ", "Haunted by demon whisperers, Anna does whatever she can to survive, even if it means embracing her dark side and earning an unwanted reputation as her school’s party girl. Her life has never looked more bleak. And all the while there’s Kaidan Rowe, son of the Duke of Lust, plaguing her heart and mind.", "When an unexpected lost message from the angels surfaces, Anna finds herself traveling the globe with Kopano, son of Wrath, in an attempt to gain support of fellow Nephilim and give them hope for the first time. It soon becomes clear that whatever freedoms Anna and the rest of the Neph are hoping to win will not be gained without a fight. Until then, Anna and Kaidan must put aside the issues between them, overcome the steamiest of temptations yet, and face the ultimate question: is loving someone worth risking their life?"], "author": "Wendy Higgins", "num_pages": "371", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-30 00:00:00", "ISBN": "0062265946"},
{"url": "https://www.goodreads.com/book/show/18528249-reborn", "num_ratings": "119", "num_reviews": "16", "avg_ratings": 3.61, "genres": ["Fantasy", "Fantasy", "Paranormal"], "title": "Reborn", "description": ["Solomon Brandt is a man of mystery, even to himself.", "Is he the wicked Civil War plantation owner whose cruel streak once knew no bounds? Or, instead, could he be a tenderhearted gentleman reborn in the modern age?", "His name is hated by the locals of Savannah, GA, and especially the descendants of the slaves tortured long ago by someone bearing the same name. The ‘new’ Solomon", "Solomon Brandt is a man of mystery, even to himself.", "Is he the wicked Civil War plantation owner whose cruel streak once knew no bounds? Or, instead, could he be a tenderhearted gentleman reborn in the modern age?", "His name is hated by the locals of Savannah, GA, and especially the descendants of the slaves tortured long ago by someone bearing the same name. The ‘new’ Solomon has no recollection of his past, except haunting nightmares that tell him more than he cares to know, and often more than he can bear. The journey to find himself leads through the heart of Savannah and it’s storied history. Solomon is drawn to an ancient, and haunted, plantation home that bears his name, as well as to a Hoodoo practitioner who converses with spirits, and her gorgeous green-eyed niece to whom he quickly develops a budding desire for.", "Curses run deep, as good and evil continue the age-old battle for supremacy. Immersed in wickedness long ago, Solomon has been given a second chance to set things right. A chance to live the life he once took for granted, and a chance to save the heart of the women he cherishes most.", "And, if he’s lucky enough, he might save his very soul."], "author": "Aiden James", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-07-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22032768-sunday", "num_ratings": "643", "num_reviews": "112", "avg_ratings": 4.02, "genres": ["Romance", "Romance", "Interracial Romance", "Adult Fiction", "Erotica", "Academic", "College"], "title": "Sunday", "description": ["When good girl Gia and bad boy Flynn are forced to work on a project for their psychology class, they quickly learn that they share something in common – a mutual hatred that makes it almost impossible to be in the same room together. But all it takes is one explosive Sunday and an attraction that runs too deep to ignore to turn their worlds - and the way they see each oth", "When good girl Gia and bad boy Flynn are forced to work on a project for their psychology class, they quickly learn that they share something in common – a mutual hatred that makes it almost impossible to be in the same room together. But all it takes is one explosive Sunday and an attraction that runs too deep to ignore to turn their worlds - and the way they see each other - upside down.", "Author's Note: This book contains strong language and sexual content with dark elements, some of which readers may find uncomfortable."], "author": "Kaia Bennett", "num_pages": "315", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/14060046-obsession", "num_ratings": "21,718", "num_reviews": "2,286", "avg_ratings": 4.14, "genres": ["Fantasy", "Paranormal", "Romance", "Science Fiction", "Aliens", "New Adult", "Fantasy", "Romance", "Paranormal Romance", "Adult"], "title": "Obsession", "description": [" You do not need to read a Lux book to read Obsession and vice versa.", "He’s arrogant, domineering, and... To. Die. For.", "Hunter is a ruthless killer. And the Department of Defense has him firmly in their grasp, which usually doesn’t chafe too badly because he gets to kill bad guys. Most of the time he enjoy", " You do not need to read a Lux book to read Obsession and vice versa.", "He’s arrogant, domineering, and... To. Die. For.", "Hunter is a ruthless killer. And the Department of Defense has him firmly in their grasp, which usually doesn’t chafe too badly because he gets to kill bad guys. Most of the time he enjoys his job. That is, until he’s saddled with something he’s never had to do before: protect a human from his mortal enemy.", "Serena Cross didn’t believe her best friend when she claimed to have seen the son of a powerful senator turn into something... unnatural. Who would? But then she witnesses her friend’s murder at the hands of what can only be an alien, thrusting her into a world that will kill to protect their secret.", "Hunter stirs Serena’s temper and her lust despite their differences. Soon he’s doing the unthinkable—breaking the rules he’s lived by, going against the government to keep Serena safe. But are the aliens and the government the biggest threats to Serena’s life… or is it Hunter?"], "author": "Jennifer L. Armentrout", "num_pages": "249", "awards": [], "places": [], "character_names": ["Hunter", "Serena Cross"], "language": "English", "publish_date": "2013-05-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17567854-intermix-nation", "num_ratings": "190", "num_reviews": "41", "avg_ratings": 4.16, "genres": ["Science Fiction", "Dystopia", "New Adult", "Romance", "Fantasy", "Young Adult", "Science Fiction"], "title": "Intermix Nation", "description": ["Intermix: to mix together, blend", "North America, paragon of diversity, is gone. From its ashes, a new nation has arisen – Renatus – where the government segregates the surviving population into races, forbidding interracial marriage, mating, and love.", "Eighteen-year-old Nazirah Nation is a pariah, an intermix, born of people from different races. When her parents are murdered", "Intermix: to mix together, blend", "North America, paragon of diversity, is gone. From its ashes, a new nation has arisen – Renatus – where the government segregates the surviving population into races, forbidding interracial marriage, mating, and love.", "Eighteen-year-old Nazirah Nation is a pariah, an intermix, born of people from different races. When her parents are murdered in the name of justice, Nazirah grudgingly joins the growing rebellion fighting against the despotic government.", "Overwhelmed with grief, consumed by guilt, Nazirah craves vengeance as a substitute for absolution. But on her journey to find the girl she once was, Nazirah must learn the hard way that nothing … no one … is purely black or white. Like her, every human is intermix, shades and hues of complex emotions. And those who can take everything away are also the ones who can give everything back."], "author": "M.P. Attardo", "num_pages": "331", "awards": [], "places": [], "character_names": ["Nazirah Nation", "Adamek Morgen", "Cato Caal", "Aldrik", "Nikolaus Nation"], "language": "English", "publish_date": "2013-03-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18466954-roommate-wanted", "num_ratings": "318", "num_reviews": "31", "avg_ratings": 4.01, "genres": ["Romance", "Interracial Romance", "Romance", "Womens Fiction", "Chick Lit", "Romance", "Contemporary Romance", "Contemporary"], "title": "Roommate Wanted", "description": ["It’s official: Chloe Brooks is having the worst week ever.", "Her roommate has just moved out with no notice, leaving Chloe little time to find a replacement, the pressure is on at work as she vies for a big promotion, and she just caught her boyfriend in bed with another woman. She doesn’t need any more complications, but that’s exactly what Chloe gets when Patrick Murphy sho", "It’s official: Chloe Brooks is having the worst week ever.", "Her roommate has just moved out with no notice, leaving Chloe little time to find a replacement, the pressure is on at work as she vies for a big promotion, and she just caught her boyfriend in bed with another woman. She doesn’t need any more complications, but that’s exactly what Chloe gets when Patrick Murphy shows up on her doorstep.", "Life is good for Patrick Murphy.", "He has an agent who can help kickstart his acting career, his relationship with his best friends has never been tighter, and he’s saved up enough money to finally move into the city", "Now if he can just find a place to live…", "There are many reasons why they shouldn’t be together: They’re both focusing on their careers, Chloe is coming out of a nasty breakup, and is it ever a good idea to date your roommate?", "Roommate Wanted is the first book in the Sharing Space series, a contemporary romance about an interracial couple who ignore all the reasons why they shouldn’t be together to focus on the one reason they should: love.", "Roommate Wanted will be available for Kindle devices in September 2013. A new volume will be available every 2-3 weeks."], "author": "Nina Perez", "num_pages": "91", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1961701.The_Reinvention_of_Chastity", "num_ratings": "1,137", "num_reviews": "55", "avg_ratings": 3.81, "genres": ["Romance", "Interracial Romance", "Adult Fiction", "Erotica", "Romance", "Contemporary"], "title": "The Reinvention of Chastity", "author": "Eve Vaughn", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-12-01 00:00:00", "ISBN": "1599984261"},
{"url": "https://www.goodreads.com/book/show/18685467-shh-mine", "num_ratings": "386", "num_reviews": "42", "avg_ratings": 3.9, "genres": ["Romance", "Romance", "Interracial Romance"], "title": "Shh...Mine", "description": ["DOWNLOAD THE FIRST THREE CHAPTERS BELOW!", "When Danielle Rouge was sixteen years old, fate sent her the love of her life ... and the poor dear hadn't a clue. Now, twelve years later, she finds herself on the outside of the hotel room that her husband, Jon, and his mistress are currently occupying. More insulted than devastated (after all, who wouldn't want Danielle Rouge?), s", "DOWNLOAD THE FIRST THREE CHAPTERS BELOW!", "When Danielle Rouge was sixteen years old, fate sent her the love of her life ... and the poor dear hadn't a clue. Now, twelve years later, she finds herself on the outside of the hotel room that her husband, Jon, and his mistress are currently occupying. More insulted than devastated (after all, who wouldn't want Danielle Rouge?), she runs away, if a grown woman can run away, and happens upon Malcolm Blair. Hmm ... isn't he that attorney The Boston Globe keeps raving about? Gorgeous, wealthy and available. Goodbye, Jon. ", "Malcolm Blair's the smirking type, the politically connected type, the tap-your-phone-to-find-out-what-you're-up-to type. He's assisted fate in its quest to woo Danielle back to him and he believes he's done a brilliant job. That is, until someone begins stalking Danielle, threatening to drive away the one woman he's ever truly longed for. But no worries; he'll fix this. After all, that's what he does. He fixes things, no matter who has to suffer. He. Will. Fix. This.", "Jon knows that Malcolm Blair is a Boston heavy hitter who is hell-bent on stealing his wife away from him. Those mysterious flowers Danielle receives on the first day of spring, those unsigned birthday cards she's gotten for the past twelve years, all are from Malcolm Blair. The political powerhouse was aiming to seduce another man's wife. Jon can prove it. He can prove it, win Danielle back and destroy Malcolm all at the same time. Just watch him."], "author": "Shannon Dianne", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7852186-the-real-thing", "num_ratings": "707", "num_reviews": "76", "avg_ratings": 3.96, "genres": ["Romance", "Romance", "Interracial Romance", "Romance", "Contemporary Romance", "Contemporary"], "title": "The Real Thing", "description": ["Former boxing champion Dante \"Blood and Guts\" Lattanza is being featured in Personality magazine's \"Sexiest Men Alive\" issue, and reporter Christiana Artis has the scoop. There's just one hitch: she'll have to fly to her elusive subject's home in Canada. But once she lays eyes on Dante's chiseled physique and sultry Italian looks, she decides it was worth every mile. Too b", "Former boxing champion Dante \"Blood and Guts\" Lattanza is being featured in Personality magazine's \"Sexiest Men Alive\" issue, and reporter Christiana Artis has the scoop. There's just one hitch: she'll have to fly to her elusive subject's home in Canada. But once she lays eyes on Dante's chiseled physique and sultry Italian looks, she decides it was worth every mile. Too bad his icy demeanor doesn't match his hot body.", "Since he lost his last fight ten years ago, Dante has led a reclusive life--and he never gives interviews. But he's making a comeback, ready to prove to the world--and his ex-wife--that he can still win a championship. He gives Christiana an ultimatum: if she can perform five tasks, she can ask him five questions. And then she can be on her way. Yet Dante's always had a weakness for beautiful black women, and seeing Christiana everyday is enough to melt his defenses. Soon Christiana is an intimate part of the very story she came to write. But when the line between personal and professional gets blurred, it can be difficult to see when you've found the real thing..."], "author": "J.J. Murray", "num_pages": "352", "awards": [], "places": ["Canada"], "character_names": [], "language": "English", "publish_date": "2010-04-01 00:00:00", "ISBN": "0758228872"},
{"url": "https://www.goodreads.com/book/show/18308788-impossibly-love", "num_ratings": "207", "num_reviews": "65", "avg_ratings": 3.75, "genres": ["New Adult", "Romance", "Romance", "Contemporary Romance", "Romance", "Interracial Romance"], "title": "Impossibly Love", "description": ["All Moya Douglas wants to do is study hard, maintain her scholarship, and make her mother proud while attending college. She doesn't have time for a boyfriend or going on dates arranged by her best friend. Moya doesn't believe in love. And she has no intention of ever finding it. ", "Branden McCarthy is determined to change her views.", "A selfless romantic who's had his heart bro", "All Moya Douglas wants to do is study hard, maintain her scholarship, and make her mother proud while attending college. She doesn't have time for a boyfriend or going on dates arranged by her best friend. Moya doesn't believe in love. And she has no intention of ever finding it. ", "Branden McCarthy is determined to change her views.", "A selfless romantic who's had his heart broken in the past, Branden is fascinated with Moya's personality and hopes to develop something real with her—a connection so strong it'll open her heart. But just when things start to work between the two, Branden’s secret threatens to get in the way.", "Will Moya finally do the impossible and give love a chance with Branden, or will fear keep them apart?"], "author": "Shane K. Morgan", "num_pages": "252", "awards": [], "places": [], "character_names": ["Moya Douglas, Branden McCarthy, Vanessa, Marie, Debbie McCarthy, Scott McCarthy, Ashton McCarthy"], "language": "English", "publish_date": "2013-10-29 00:00:00", "ISBN": "0615895611"},
{"url": "https://www.goodreads.com/book/show/18781503-flirting-with-chaos", "num_ratings": "562", "num_reviews": "87", "avg_ratings": 4.0, "genres": ["New Adult", "Romance", "Romance", "Interracial Romance", "Dark", "Adult Fiction", "Erotica"], "title": "Flirting with Chaos", "description": ["Chaos never felt this good!", "Warning: Adult only! This novel is Dark, Twisted, and really Sexy! Absolutely not for the weak at heart.", "Blurb: Rain’s been washing blood off her hands for far too long. After five years, she accepts the fact that she’s still a little crazy but feels as if she’s finally gotten it all under control. ", "Parties, drugs, and sex flood Jude’s life, and mu", "Chaos never felt this good!", "Warning: Adult only! This novel is Dark, Twisted, and really Sexy! Absolutely not for the weak at heart.", "Blurb: Rain’s been washing blood off her hands for far too long. After five years, she accepts the fact that she’s still a little crazy but feels as if she’s finally gotten it all under control. ", "Parties, drugs, and sex flood Jude’s life, and music and scandal run through his veins. He’s the son of a rock god and grandson of a jazz legend. It's no surprise that his own star is on the rise, and with so many groupies vying for his attention, his childhood best friend Rain keeps him anchored in reality.", "She’s nothing like him—an art student with no idea of her own beauty, who would rather curl up with a sci-fi novel than party in the spotlight. Everything changes when she asks him for a unique favor: she wants him to take her virginity. He’s more than willing to oblige, but things get complicated when his pervy father gets involved. Meanwhile, intense feelings rise to the surface, ones neither Rain or Jude are prepared to deal with. ", "If their relationship has any chance for survival, she must finally confront the demons of her past, and he must face the addictions of the present. When the smoke clears, will they find that sex between best friends was a good idea, or will they discover they had been Flirting With Chaos the entire time?"], "author": "Kenya Wright", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-19 00:00:00", "ISBN": "1623420601"},
{"url": "https://www.goodreads.com/book/show/12368523-windows", "num_ratings": "1,209", "num_reviews": "70", "avg_ratings": 4.02, "genres": ["Romance", "Interracial Romance", "Romance", "Adult Fiction", "Erotica"], "title": "Windows", "description": ["Don't touch the hot Italian was a mantra Gina Robinson had spent the last ten years repeating to herself about her best friend, Nick Da Canaveze. She had to repeat it often, as Nick was hot beyond all reason. With a crazy-built body, a wicked sense of humour, and brains, he was the kind of man who could bring a woman pleasure with little more than a sideways glance. She ha", "Don't touch the hot Italian was a mantra Gina Robinson had spent the last ten years repeating to herself about her best friend, Nick Da Canaveze. She had to repeat it often, as Nick was hot beyond all reason. With a crazy-built body, a wicked sense of humour, and brains, he was the kind of man who could bring a woman pleasure with little more than a sideways glance. She had to give herself a slap on the wrist whenever she caught herself looking. And she looked...a lot. ", "Looking at Nick made her eyes feel good; being with Nick made her feel good. And she needed to feel good considering the state of her life. Her father had recently passed away, she was drowning in debt, and she was being hounded for money at every turn. It wasn’t the creditors who had her worried...it was those other guys. Deep down, she knew Nick could make everything better, but she wasn’t going to ruin their friendship. She really wanted to...but she couldn't. While she might playfully call him “Soprano,” Nick was her sweet dude. She could look...and fantasize...and drool discreetly, but she must not touch. ", "Everyone knew how Nick felt about Gina. Everyone except for Gina. Ten years was a long time to wait for the girl you love to get a clue, especially when it only took him a month to realise he wanted to worship at the altar of her body every day for the rest of his life. He’d dated other women, but all along he’d known Gina was the one for him. Gina wasn’t just good for him, she was perfect for him. She met all the requirements for the sort of woman his family would approve of: a) she could cook Italian better than his mother (don’t tell his mother) and b) she spoke Italian beautifully. The only problem was c) she wasn’t a nice Italian girl who would walk ten paces behind him, do everything he commanded and ask no questions. He knew C wasn’t going to happen in this lifetime, and he wouldn’t have it any other way.", "All she needed to do was meet his own two requirements: love sex and love him. While he wasn’t sure if she loved sex, he’d spent many nights imagining just how much she could do. Did her beautiful chocolate skin taste as good as it looked? Would she moan his name or scream it when he brought her to climax? ", "Best friends for a decade, they shared everything...except what his family really did for a living. Impatient at the best of times, Nick kept telling himself to wait for the right time to reveal the truth. Then an incident that put Gina in real danger made him realise he was done waiting around. It also made him admit what everyone else already knew: Gina was unequivocally his. No one else was going to sweep in and take what belonged to him. Da Canavezes never let anyone take from them, and only those who wanted to meet God sooner rather than later attempted such a thing. ", "Once he got around the whole Hi, Soprano!, Bye, Soprano!, Can you make me a cup of tea, Soprano? platonic-friendship nonsense that had up to now categorized their relationship, Nick vowed to get around to teaching her new phrases like Harder, Soprano!, Deeper, Soprano!, You're going to make me break the sound barrier when I scream out your name, Soprano! ", "Knowing just how independent Gina was, he decided he’d give her space to accept that being Mrs. Da Canaveze was what the future held. Of course, he’d keep giving her his intense lovemaking until he’d convinced her. After he’d “convinced” her, maybe then he'd mention what he and his family really did for a living. It might make a difference with everyone else, but he wouldn't let Gina use that to keep him away from her. He would explain it. She would definitely yell. He would put his foot down. She was his. End of story. And then all hell broke loose in the guise of his mother. ", "Nick finally found his hands full. He had a woman to try to keep hold of, an overbearing mother to calm down, and “business” to deal with. Gina might see the Da Canaveze name simply as the surname that would soon be hers, but that name was whispered with respect. Gina might think of him as her “dude” but those who’d crossed him populated more than a few unmarked graves. And he’d already reserved one for the man who’d dared to send his goons after his woman. ", "London is one hell of a big city, but is it big enough to contain the romance of Gina and Nick? Gina might want Nick, but the fiercely independent Londoner is going to make Nick earn her. Being a determined, sexy male, Nick is more than up for the challenge. He’s going to make Gina his wife, and no one is going to get in the way. Not even the future Mrs. De Canaveze."], "author": "Billy London", "num_pages": "406", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-02-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16106409-beautiful-disaster", "num_ratings": "3,848", "num_reviews": "300", "avg_ratings": 3.91, "genres": ["New Adult", "Romance", "Dark", "Sociology", "Abuse", "Young Adult", "High School", "Romance", "Contemporary Romance"], "title": "Beautiful Disaster", "description": ["They created the game but eighteen year old Nicholas Grayson mastered the rules.", "They are young and entitled and utterly bored with their lives, so they play games to entertain themselves. They call it the “bet” and new girl Ellie Holbrook is their latest target. Ellie is not the kind of girl Nicholas dates, but she is pretty enough to be his next conquest and so he sets ou", "They created the game but eighteen year old Nicholas Grayson mastered the rules.", "They are young and entitled and utterly bored with their lives, so they play games to entertain themselves. They call it the “bet” and new girl Ellie Holbrook is their latest target. Ellie is not the kind of girl Nicholas dates, but she is pretty enough to be his next conquest and so he sets out to seduce her and claim a nice little prize at the end. But her seduction proves difficult when she openly rejects his advances. In his dogged pursuit of her he slowly finds himself in her small circle of trusted friends and meets her two year old daughter, Sophie.", "Life takes a startling turn for Nicholas when he realizes his happiness now lies with the young mother and her daughter. Falling in love with Ellie isn’t something Nicholas ever thought could happen to him and he’s completely frightened at how fiercely she makes him feel. But before he can further examine those emotions and clearly process them, enemies from Nicholas’s personal circle of friends conspire to tear them apart and he must now decide whether their love is worth saving or allow his friends to take away the greatest thing that’s ever happened to him."], "author": "Francette Phal", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17826066-the-dividing-line", "num_ratings": "209", "num_reviews": "50", "avg_ratings": 4.19, "genres": ["Romance", "Romance", "Interracial Romance", "New Adult", "Did Not Finish"], "title": "The Dividing Line", "description": ["A new love and a new life.", "Drake left Chicago with little more than the clothes on his back to be with his girlfriend Lacey. Though he has no regrets, he sometimes wonders if his time spent in Paris has put his life on hold. He’s overworked and underpaid at his dead-end job, and his employer sees him as expendable. His bright light at the end of the day is Lacey, but he fin", "A new love and a new life.", "Drake left Chicago with little more than the clothes on his back to be with his girlfriend Lacey. Though he has no regrets, he sometimes wonders if his time spent in Paris has put his life on hold. He’s overworked and underpaid at his dead-end job, and his employer sees him as expendable. His bright light at the end of the day is Lacey, but he finds himself slowly falling into the shadow of her newly-acquired fame. The city of love has found their new starlet in Lacey, but Drake is simply the man by her side.", "With all good things there comes a price.", "Lacey has been living the dream. She arrived in Paris with nothing but heartache and loss. Now, she’s the rising star of the city’s newest opera and dating the man of her dreams. When her performance contract is extended, she must decide if her new life of glitz and glam is what’s best for a future with the man she loves—or if it’s just what’s best for her.", "Paris brought Drake and Lacey together. But when their hopes for the future begin taking them in different directions, they must a find common ground or risk a line dividing them that may prove to be insurmountable.", "The Dividing Line is the sequel to the new adult multicultural romance The Space Between."], "author": "Victoria H. Smith", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-14 00:00:00", "ISBN": "1494840979"},
{"url": "https://www.goodreads.com/book/show/16179899-the-chronicles-of-young-dmitry-medlov-5", "num_ratings": "130", "num_reviews": "12", "avg_ratings": 4.53, "genres": ["Romance", "Interracial Romance", "Romance", "Contemporary"], "title": "The Chronicles of Young Dmitry Medlov, #5", "description": ["After the explosive blow up in Prague, the Medlov men are burdened with the task of returning to business as usual. Dmitry heads to Angola, Africa to help fuel a civil war, and Ivan heads to London to murder the Irish gang, The Sulfux Boys. Only nothing can return back to the way it was before the boys faced Boss Smirnov. Dmitry accidentally unveils Elsa’s plot; Ivan and A", "After the explosive blow up in Prague, the Medlov men are burdened with the task of returning to business as usual. Dmitry heads to Angola, Africa to help fuel a civil war, and Ivan heads to London to murder the Irish gang, The Sulfux Boys. Only nothing can return back to the way it was before the boys faced Boss Smirnov. Dmitry accidentally unveils Elsa’s plot; Ivan and Arie do the unspeakable, and an old enemy becomes a new ally.", "Plots thicken and alliances form in the latest installation of The Chronicles of Young Dmitry Medlov: Volume 5 by national bestselling author Latrivia S. Nelson."], "author": "Latrivia S. Nelson", "num_pages": "135", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16181856-her-perfect-gift", "num_ratings": "1,038", "num_reviews": "70", "avg_ratings": 4.23, "genres": ["Romance", "Romance", "Interracial Romance", "Romance", "Contemporary Romance", "Contemporary"], "title": "Her Perfect Gift: 50 Loving States, Illinois", "description": ["Lacey Winters has sworn off love. She's kept her heart locked away for her own protection, and she's vowed never to fall under a dangerous man's spell again. But that was all before she met Suro Nakamura, a hit man who seems bound and determined to stomp all over her pesky vows. He's dangerous in more ways than one, but can Lacey resist this holiday temptation?", "A story to s", "Lacey Winters has sworn off love. She's kept her heart locked away for her own protection, and she's vowed never to fall under a dangerous man's spell again. But that was all before she met Suro Nakamura, a hit man who seems bound and determined to stomp all over her pesky vows. He's dangerous in more ways than one, but can Lacey resist this holiday temptation?", "A story to set your holidays on fire, this book features a woman with a past, a hit man determined to see her in his future, and red hot Christmas chemistry."], "author": "Theodora Taylor", "awards": [], "places": [], "character_names": ["Lacey Winters", "Suro Nakamura", "Eva St. James", "Alexei Rustanov"], "language": null, "publish_date": "2012-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16387676-when-you-come-to-me", "num_ratings": "513", "num_reviews": "57", "avg_ratings": 3.29, "genres": ["New Adult", "Romance", "Romance", "Interracial Romance", "Academic", "College"], "title": "When You Come To Me", "description": ["Young, sweet and totally southern, Natalie Savannah Chandler embarks upon her freshman year of college with only one thing on her mind: get her degree and become a doctor. Sure it seems simple in the grand scheme of things. After all, she's got her family supporting her, and family is all that matters. She is ostracized in her dorm for being just a little bit quiet and a l", "Young, sweet and totally southern, Natalie Savannah Chandler embarks upon her freshman year of college with only one thing on her mind: get her degree and become a doctor. Sure it seems simple in the grand scheme of things. After all, she's got her family supporting her, and family is all that matters. She is ostracized in her dorm for being just a little bit quiet and a little bit conservative. But that doesn't bother her…initially. Her roommate is loud and wild and white, drinks beer and has sex with her boyfriend. They are polar opposites in every sense of the word. But when Natalie decides to accompany her roommate to a house party off-campus in a cozy house of blue siding, her world is turned upside down the moment that she's knocked unconscious with a flying beer bottle. Yes, you read that correctly. When she comes to (in more ways than one) she is face to face with Brandon Greene, a preppy, oatmeal-skinned New Yorker, with a loud mouth, a grand smile and an open heart. Brandon makes his intentions clear from the beginning: he is hopelessly in love with his girlfriend, Sophia, but does not want to marry her. He does, however, want to be friends with Natalie.", "Neither Brandon nor her curiosity about him make sense to her at all, and her sense of complacency begins to tumble as she and Brandon grow closer. She's thrust into a love triangle that she wants no part of and suddenly, a streamlined future to success in the medical field is the last thing on her mind — all she sees now is a shade of gray. Brandon and Natalie have a powerful dynamic; but can it stand the weight that time, spatial disparity and color have placed on them? \"When You Come to Me\" is a sometimes humorous, sometimes dramatic take on the loss of innocence in its most colorful form."], "author": "Jade Alyse", "num_pages": "569", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-02-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15724654-the-mighty-storm", "num_ratings": "66,491", "num_reviews": "3,548", "avg_ratings": 4.18, "genres": ["Romance", "Contemporary", "Adult", "Adult Fiction", "Erotica", "Did Not Finish"], "title": "The Mighty Storm", "description": ["It's been twelve years since Tru Bennett last saw Jake Wethers, her former best friend and boy she once loved.", "Jake Wethers, sexy, tattooed and deliciously bad lead singer, and brains behind The Mighty Storm, one of the biggest bands in the world, left Tru with a broken heart when he moved from England to America with his family when they were both fourteen.", "Sent to intervie", "It's been twelve years since Tru Bennett last saw Jake Wethers, her former best friend and boy she once loved.", "Jake Wethers, sexy, tattooed and deliciously bad lead singer, and brains behind The Mighty Storm, one of the biggest bands in the world, left Tru with a broken heart when he moved from England to America with his family when they were both fourteen.", "Sent to interview Jake for her music column by the magazine she works for, they are both unprepared for the sparks that fly the instant they reconnect. Only, there’s a complication to their instant feelings for one another—Will, Tru’s boyfriend of two years. ", "Then Jake makes Tru a job offer she can't refuse—travelling the world with him and his band. But taking the job means leaving Will behind, and being on the road with the band means spending an inordinate amount of time with Jake. ", "Is Tru strong enough to resist the delectable bad boy who once held her heart so completely, or will she willingly risk it all for one night with the world's most notorious womanizer?"], "author": "Samantha Towle", "num_pages": "442", "awards": [], "places": [], "character_names": ["Jake Wethers", "Trudy Bennett"], "language": "English", "publish_date": "2012-08-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17727238-ember-x", "num_ratings": "4,221", "num_reviews": "312", "avg_ratings": 3.88, "genres": ["Fantasy", "Paranormal", "New Adult", "Romance", "Paranormal", "Angels", "Romance", "Paranormal Romance", "Fantasy"], "title": "Ember X", "description": ["(New adult paranormal version of my young adult book, Ember (Death Collectors, #1). It contains more violence and more sexual content.) ", "**Mature Content Advisory** ", "Recommended for readers 17+ due to sexual situations and language.", "For nineteen-year-old Ember, life has always been about death. With a simple touch, she can see when someone will die. It’s her curse and the rea", "(New adult paranormal version of my young adult book, Ember (Death Collectors, #1). It contains more violence and more sexual content.) ", "**Mature Content Advisory** ", "Recommended for readers 17+ due to sexual situations and language.", "For nineteen-year-old Ember, life has always been about death. With a simple touch, she can see when someone will die. It’s her curse and the reason she secludes herself from the world. The only person that knows her secret is her best friend Raven. ", "But that changes when she meets Asher Morgan. He’s gorgeous and mysterious and is the only person Ember can't sense death from. The silence he instills in her mind and body allows her to feel things she’s never been able to before, so despite her initial reservations, Ember lets Asher into her life and lets herself to get close to him. But the closer they get, the more Ember realizes that Asher is keeping secrets from her.", "When unexplained deaths begin to surface in her town, Ember questions why she can’t see Asher's death and what it is he’s hiding from her."], "author": "Jessica Sorensen", "num_pages": "364", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-19 00:00:00", "ISBN": "1484020162"},
{"url": "https://www.goodreads.com/book/show/13228168-the-chronicles-of-young-dmitry-medlov-4", "num_ratings": "139", "num_reviews": "5", "avg_ratings": 4.59, "genres": ["Romance"], "title": "The Chronicles of Young Dmitry Medlov, #4", "description": ["Now a widower, Dmitry Medlov’s life has completely changed. Wealthy beyond his wildest dreams, his aspirations quickly move from more money to more power. Only the power he seeks is held by the commanding and elusive Czar of the underworld, Boss Smirnov.", "When Dmitry successfully talks the underboss and the all-knowing eye of the underworld, Khalid, into arranging a meeting", "Now a widower, Dmitry Medlov’s life has completely changed. Wealthy beyond his wildest dreams, his aspirations quickly move from more money to more power. Only the power he seeks is held by the commanding and elusive Czar of the underworld, Boss Smirnov.", "When Dmitry successfully talks the underboss and the all-knowing eye of the underworld, Khalid, into arranging a meeting between he and Boss Smirnov, he has no idea what troubles he is about to face. There are secrets that will be exposed in Prague that will forever change his young life again, leading to a decision that will rock the underworld for good. ", "Meanwhile, back in London, the city is buzzing about the deaths of the entire board of directors of Dmitry’s newly acquired business, Hutton Industries, minus the company’s former front man, who was involved in a gruesome home invasion that left him blind, deaf, mute and paralyzed. ", "With no witnesses, leads or proof combined with the botched attempt on his own life during the horrid chain of events, Dmitry is looked over as a person of interest by Scotland Yard and is given carde blache to turn his new private company into his personal money laundering hub right under the public’s nose with the help of his Africa girlfriend, Oxford University senior and business genius, Elsa. And it’s just in time for his new secret alliance with the leaders of a powerful paramilitary sect led by Elsa’s father in Angola, Africa. ", "Dmitry’s new found power creates a checkmate for his ambitions to be boss but puts a target squarely on his back by not only organized crime heads around the world but also by his own brother, Ivan. Secret alliances are formed. Money is exchanged, and a definite war is looming. Only no one is willing to give up as much as Dmitry is to be king.", "Read the last volume of the first book, The Chronicles of Young Dmitry Medlov and witness the heart stopping rise of a giant and everything that he’s willing to do to become the world’s most powerful and deadly boss."], "author": "Latrivia S. Nelson", "num_pages": "111", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9897164-apollyon", "num_ratings": "37,408", "num_reviews": "2,438", "avg_ratings": 4.39, "genres": ["Young Adult", "Fantasy", "Fantasy", "Paranormal", "Fantasy", "Mythology", "Romance", "Romance", "Paranormal Romance"], "title": "Apollyon", "description": ["Fate isn't something to mess with and now, neither is Alex. ", "Alex has always feared two things: losing herself in the Awakening and being placed on the Elixir. But love has always been stronger than Fate, and Aiden St. Delphi is willing to make war on the gods—and Alex herself—to bring her back. ", "The gods have killed thousands and could destroy entire cities in their quest t", "Fate isn't something to mess with and now, neither is Alex. ", "Alex has always feared two things: losing herself in the Awakening and being placed on the Elixir. But love has always been stronger than Fate, and Aiden St. Delphi is willing to make war on the gods—and Alex herself—to bring her back. ", "The gods have killed thousands and could destroy entire cities in their quest to stop Seth from taking Alex's power and becoming the all-powerful God Killer. But breaking Alex's connection to Seth isn't the only problem. There are a few pesky little loopholes in the whole an Apollyon can't be killed theory, and the only person who might know how to stop the destruction has been dead for centuries. ", "Finding their way past the barriers that guard the Underworld, searching for one soul among countless millions, and then somehow returning will be hard enough. Alex might be able to keep Seth from becoming the God Killer or she might become the God Killer herself."], "author": "Jennifer L. Armentrout", "num_pages": "343", "awards": [], "places": [], "character_names": ["Aiden St. Delphi", "Alexandria \"Alex\" Andros", "Seth (Covenant Series)"], "language": "English", "publish_date": "2013-04-04 00:00:00", "ISBN": "1937053164"},
{"url": "https://www.goodreads.com/book/show/20494930-leap-of-faith", "num_ratings": "9", "num_reviews": "2", "avg_ratings": 3.78, "genres": ["Romance", "Interracial Romance", "Contemporary"], "title": "Leap of Faith", "description": ["Lisa Kelly is making her way through college, hanging on to a codependent relationship she no longer really wants to be in for the sake of its familiarity.", "Daniel is a fellow student—a stranger and nothing more than a blip on her radar until one day, she discovers something about him that makes him more than a blip, and she starts wondering what it would be like to be with", "Lisa Kelly is making her way through college, hanging on to a codependent relationship she no longer really wants to be in for the sake of its familiarity.", "Daniel is a fellow student—a stranger and nothing more than a blip on her radar until one day, she discovers something about him that makes him more than a blip, and she starts wondering what it would be like to be with him.", "She is terrified to even think about leaving her possessive boyfriend and losing all that comes with him: the easy companionship, their mutual friends, and her carefully constructed social life. But thoughts of Daniel consume her so much, that she writes a passionate poem about it to purge, hoping that putting her feelings and confusion out into the universe will help bring clarity.", "The morning after she writes her poem, however, she realizes something odd: she starts hearing things as if by telepathy—a voice seeming to come from Daniel, telling her how much he wants her and letting her know it’s safe to leave her boyfriend and try her luck with him.", "She wonders if Daniel is there just to remind her that there is life beyond her dead relationship, that possibilities abound in the real world.", "But what about the voice she has started hearing? Is her mind playing tricks on her? Has wanting Daniel made her fool herself into thinking what she wishes he would say is what he is actually thinking? Or is Daniel really the one, and the universe has found an odd way to get the message to her?", "A BWWM interracial romance, “Leap of Faith” is a novelette (short novella) of about 14,000 words.", "It is a light tale of budding romance with a dash of telepathy."], "author": "Rose Francis", "num_pages": "59", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12950018-black-butterfly", "num_ratings": "3,272", "num_reviews": "194", "avg_ratings": 3.64, "genres": ["Romance", "Romance", "Interracial Romance", "Adult Fiction", "Erotica", "Romance", "Contemporary Romance", "Contemporary"], "title": "Black Butterfly", "description": ["Sydney Allen has a dream. To dance one day on Broadway, and be a star. She's moved to New York, and with her best friends Portia and Trish at her side, her dream is destined to be a reality. That is until she meets the Executive Producer of her show--Nolen Adams. A Wall Street Investment banker who's playboy ways are notorious among the Big Apple's socialites. His lust and", "Sydney Allen has a dream. To dance one day on Broadway, and be a star. She's moved to New York, and with her best friends Portia and Trish at her side, her dream is destined to be a reality. That is until she meets the Executive Producer of her show--Nolen Adams. A Wall Street Investment banker who's playboy ways are notorious among the Big Apple's socialites. His lust and desires for Sydney are at first spurned. She will never be a casting couch bunny. But Nolen Adams doesn't take well to rejection. He's a man who always gets who and what he wants. Despite her efforts to achieve her chance at stardom through handwork and discipline, she is forced to address the admiration of her Producer. His pursuit of her sets Sydney and her friends on a collision path of pain, heartache, and self-discovery that will forever change their friendship. Every bond between friends and new lovers are put to the test when lies and deceit overshadow the best of intentions. And Sydney soon learns the price of fame can ultimately be the cost of one's heart.", "Publisher Warning: Strong language, Explicit Sexual Content, Autoerotic Asphyxiation, Mild Violence, Strong Adult Themes. If you want more of Sienna Mynx, please be sure to visit: thedivaspen.com."], "author": "Sienna Mynx", "num_pages": "0", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": null, "publish_date": "2011-10-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17671483-escaping-reality", "num_ratings": "12,483", "num_reviews": "1,622", "avg_ratings": 4.08, "genres": ["Romance", "New Adult", "Contemporary", "Adult Fiction", "Erotica"], "title": "Escaping Reality", "description": ["At the young age of eighteen, tragedy and a dark secret force Lara to flee all she has known and loves to start a new life. Now y", "At the young age of eighteen, tragedy and a dark secret force Lara to flee all she has known and loves to start a new life. Now years later, with a new identity as Amy, she’s finally dared to believe she is forgotten–even if she cannot forget. But just when she lets down her guard, the ghosts of her past are quick to punish her, forcing her back on the run. ", "On a plane, struggling to face the devastation of losing everything again and starting over, Amy meets Liam Stone, a darkly entrancing recluse billionaire, who is also a brilliant, and famous, prodigy architect. A man who knows what he wants and goes after it. And what he wants is Amy. Refusing to take “no” as an answer, he sweeps her into a passionate affair, pushing her to her erotic limits. He wants to possess her. He makes her want to be possessed. Liam demands everything from her, accepting nothing less. But what if she is too devastated by tragedy to know when he wants more than she should give? And what if there is more to Liam than meets the eyes?"], "author": "Lisa Renee Jones", "num_pages": "250", "awards": [], "places": ["Denver, Colorado"], "character_names": ["Amy Benson", "Lara", "Liam Stone"], "language": "English", "publish_date": "2013-07-22 00:00:00", "ISBN": "0985817089"},
{"url": "https://www.goodreads.com/book/show/17800668-infinity-chronicles---part-two", "num_ratings": "64", "num_reviews": "36", "avg_ratings": 3.84, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Shapeshifters", "Romance"], "title": "Infinity Chronicles - Part Two", "description": ["There’s only one shifter she's meant to be with…and he might be the only one she loses forever.", "As the war between supernatural beings is brewing, Infinity awakens in the midst of her kidnapping. Instead of facing her captor, she meets someone who takes her into the past where she learns secrets that change everything she’s always known. ", "After recently discovering that vamp", "There’s only one shifter she's meant to be with…and he might be the only one she loses forever.", "As the war between supernatural beings is brewing, Infinity awakens in the midst of her kidnapping. Instead of facing her captor, she meets someone who takes her into the past where she learns secrets that change everything she’s always known. ", "After recently discovering that vampires, wolves, tiger-shifters, Valkyries, and otherworldly entities exist around her, Infinity must quickly adapt to her new reality while facing the fact that she no longer knows who she can trust. ", "Each species wants her, but there’s only one person she is meant to be with…and he might be the only one she loses forever."], "author": "Sedona Venez", "awards": [], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2013-12-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20871425-monster", "num_ratings": "4,619", "num_reviews": "430", "avg_ratings": 3.78, "genres": ["Dark", "Romance", "Adult Fiction", "Erotica", "Sociology", "Abuse", "Erotica", "Bdsm", "Romance", "Contemporary Romance"], "title": "Monster", "description": ["Accidental Gold digger.", "Circumstance forced Eden Mercer to sell herself to Dominic Armstrong for half a million dollars and in return she is to play the dutiful wife in public and submit to him completely behind closed doors.", "The Tyrant.", "Dominic is Ruthless, manipulative and sadistic but Eden is determined not to break under his cruelty. But how does one persevere when in the", "Accidental Gold digger.", "Circumstance forced Eden Mercer to sell herself to Dominic Armstrong for half a million dollars and in return she is to play the dutiful wife in public and submit to him completely behind closed doors.", "The Tyrant.", "Dominic is Ruthless, manipulative and sadistic but Eden is determined not to break under his cruelty. But how does one persevere when in the clutches of a Monster?"], "author": "Francette Phal", "num_pages": "338", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/27836143-his-game", "num_ratings": "679", "num_reviews": "98", "avg_ratings": 4.35, "genres": ["Sports and Games", "Sports", "Romance", "Contemporary"], "title": "His Game", "description": [">For Him she was the one from the moment he saw her. He just didn’t know it would be so hard for her to see him, but when she does he takes his chance. He would never regret it, but what he would regret is walking away. Then she appears in his life again and he is floored by all he truly walked away from. It will never happen again, no matter what. ", "Football had been his", ">For Him she was the one from the moment he saw her. He just didn’t know it would be so hard for her to see him, but when she does he takes his chance. He would never regret it, but what he would regret is walking away. Then she appears in his life again and he is floored by all he truly walked away from. It will never happen again, no matter what. ", "Football had been his life, not anymore and if walking away from it all is what it takes to have her and all that comes with her so be it. He has left it all out on field, now it is time to leave it all at her feet. ", "Because Tamara is his for keeps!"], "author": "Blue Saffire", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18397899-precious-things", "num_ratings": "103", "num_reviews": "33", "avg_ratings": 3.61, "genres": ["New Adult", "Contemporary", "Music", "Romance", "Contemporary Romance"], "title": "Precious Things", "description": ["Isabelle Andrews isn’t supposed to be here. She isn’t supposed to be a freshman at Hartford Community College, she isn't supposed to be living at home and working at her dad’s failing bakery, and she definitely isn’t supposed to be taking Intro to Electronic Music Production, a class that will get her n", "Isabelle Andrews isn’t supposed to be here. She isn’t supposed to be a freshman at Hartford Community College, she isn't supposed to be living at home and working at her dad’s failing bakery, and she definitely isn’t supposed to be taking Intro to Electronic Music Production, a class that will get her nowhere toward her goal of an English Lit Ph.D. by age twenty-five. But when her dad’s latest business fiasco eats up her college fund, Hartford Community College is exactly where Isabelle finds herself—and thanks to her late enrollment, she doesn’t even get to choose her classes. Stuck with Electronic Music and way-too-easy English courses, Isabelle is determined to wallow in all the misery she feels entitled to.", "But community college brings some unexpected benefits…like the fact that a certain overworked, over-scheduled Electronic Music professor hands over most of his duties to his teaching assistant. His tall, green-eyed, absolutely gorgeous teaching assistant. When TA Evan Strauss discovers Isabelle’s apathy toward electronic music—and, well, all music—he makes it his mission to convert her. The music Evan composes stirs something inside Isabelle, but she can’t get involved—after all, she’ll be transferring out as soon as possible. ", "Still, no matter how tightly Isabelle holds on to her misery, she finds it slipping away in the wake of all Hartford Community offers: new friendships, a surprisingly cool poetry professor, and most of all, Evan. But Evan’s dream of owning his own music studio is as impractical as Isabelle’s dad’s bakery, and when Evan makes a terrible decision, everything Isabelle has gained threatens to unravel. Soon Isabelle discovers that some of the most important lessons take place outside the classroom…and that in life, as in Evan’s favorite Depeche Mode song, the most precious things can be the hardest to hold on to."], "author": "Stephanie Parent", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13351120-noah", "num_ratings": "13,066", "num_reviews": "921", "avg_ratings": 3.79, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "New Adult", "Sports and Games", "Sports"], "title": "Noah", "description": ["Veronica Cruz has been through hell and back. After disconnecting with the world two years ago to be at the side of her dying mother, she’s left alone, unemployed, overweight, and feeling a decade older than her twenty-eight years. When her best friend coaxes her into joining the local gym to ditch her depression and rejuvenate her life, she meets Noah. Assigned to help Ve", "Veronica Cruz has been through hell and back. After disconnecting with the world two years ago to be at the side of her dying mother, she’s left alone, unemployed, overweight, and feeling a decade older than her twenty-eight years. When her best friend coaxes her into joining the local gym to ditch her depression and rejuvenate her life, she meets Noah. Assigned to help Veronica lose weight, Noah is everything she expected a young trainer to be—perfectly chiseled, supportive and motivating. Add to that, he’s incredibly sexy. He’s everything she’s ever looked for in a man. What she least expected was for him to fall for her, but he has. There's just one glaring problem: Noah is eight years younger. ", "Noah Quintanilla has his eye on a boxing title—someday. Down for a few months with an injury, his maintenance-boy pay at 5th Street Gym won't cut it. He’s finally given the opportunity to train. The catch? His trainee is an out-of-shape woman with a free week pass. Taking on the challenge, Noah stumbles into one of the closest friendships he’s ever known, and before he knows it, he’s in love. But Veronica’s not having it—the age difference is too much. Their platonic relationship means having to watch her date other men—something that would make him crazy. Believing he's the man for her, Noah sets out to prove that age is but an illusion, and there's more to him than just a number. ", "Adult Contemporary"], "author": "Elizabeth Reyes", "num_pages": "341", "awards": [], "places": [], "character_names": ["Noah Quintanilla", "Veronica \"Roni\" Cruz", "Giovanni \"Gio\" Bravo"], "language": "English", "publish_date": "2012-03-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19120654-dutchman-timberbeast-saga", "num_ratings": "10", "num_reviews": "3", "avg_ratings": 3.8, "genres": [], "title": "DutchMan (TimberBeast Saga) (Volume 2)", "description": ["Coming to Buck Meadow and becoming a part of the forest family isn't the only thing that has changed in Kelsy Bowen's life. Since she is now single, she is free to follow her plan to increase her environmental skills and that includes getting closer to Fox in a more personal way. By gaining his trust she hopes he will share his secrets and that in turn will lead her to the", "Coming to Buck Meadow and becoming a part of the forest family isn't the only thing that has changed in Kelsy Bowen's life. Since she is now single, she is free to follow her plan to increase her environmental skills and that includes getting closer to Fox in a more personal way. By gaining his trust she hopes he will share his secrets and that in turn will lead her to the TimberBeast. With or without Fox, her plan is to wrap up her mission before winter sets in, but life in the forest is never predictable or safe, even when your friends are larger than life loggers. Ecoterrorists in the woods keep everyone on their toes. They ramp up their plans to stop the loggers and they don't care who gets hurt. Kelsy finds herself in a tangle of danger, possibilities and decisions. She expands her plans and spends more time with the loggers who bring new insights and doubts to her spying. But when Fox decides to focus his attention on more than friendship, Kelsy finds out that politics and the late summer weather aren't the only things heating up in the forest. Fox isn't shy about letting Kelsy know that he has more than her personal protection on his mind. He pushes her boundaries and teaches her about more than forest life. The truth she does not want to see, and the dangerous implications of knowing too much make her carefully laid plans spin out of control. Kelsy uses her new friends to find the TimberBeast so she can keep her winter deadline, but Fox has different ideas. Now that she has caught his attention, he is playing to win, and fair is not a part of his plan. ."], "author": "Jae Hall", "num_pages": "450", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-10 00:00:00", "ISBN": "1482002175"},
{"url": "https://www.goodreads.com/book/show/23118840-liliana", "num_ratings": "50", "num_reviews": "8", "avg_ratings": 3.74, "genres": ["Young Adult"], "title": "Liliana", "description": ["Book 1 of the Liliana series", "Boom!", "That deafening sound changed Liliana’s life forever.", "Her mother sits dead besides her, shot to death on the streets of Chicago.", "Within weeks, Liliana is sent to live with a father she doesn’t know in Colombia - a foreign land filled with challenges for Liliana. While working to pay off her father’s debt, she meets the love of her life, who fr", "Book 1 of the Liliana series", "Boom!", "That deafening sound changed Liliana’s life forever.", "Her mother sits dead besides her, shot to death on the streets of Chicago.", "Within weeks, Liliana is sent to live with a father she doesn’t know in Colombia - a foreign land filled with challenges for Liliana. While working to pay off her father’s debt, she meets the love of her life, who frees her from her father’s illusory home, only to bring her into a new world of twisted surprises, dangers, and deceit."], "author": "Neva Squires-Rodriguez", "num_pages": "119", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-18 00:00:00", "ISBN": "1311059164"},
{"url": "https://www.goodreads.com/book/show/35295478-a-butler-christmas", "num_ratings": "29", "num_reviews": "17", "avg_ratings": 4.69, "genres": ["Romance", "Holiday", "Holiday", "Christmas"], "title": "A Butler Christmas", "description": ["\"Brooks’s clunky first Naim Butler contemporary romantic thriller has strong characters...The well-developed relationships among the characters propel the story until the addition of suspense very late in the book...\"--Publishers Weekly", "Naim Butler, a rainmaker, has perfected the art of sentencing mitigation, as a partner with Manhattan power-firm, Baker and Keefe. He's the", "\"Brooks’s clunky first Naim Butler contemporary romantic thriller has strong characters...The well-developed relationships among the characters propel the story until the addition of suspense very late in the book...\"--Publishers Weekly", "Naim Butler, a rainmaker, has perfected the art of sentencing mitigation, as a partner with Manhattan power-firm, Baker and Keefe. He's the kind of captivating and accomplished man that therapists vent too. His bachelorhood is turned upside down when an old flame, Sinia Love, drops a seventeen-year-old son into his lap forcing him to balance this revelation and his budding romance with Brandy Scott. ", "Professionally, Naim's assigned to prove a man's innocence of murder is filthy work itself, but catastrophic when an envious lover of Sinia Love's sets out to kill him while hiding amongst the glitterati of Manhattan's upper crust."], "author": "Rahiem Brooks", "num_pages": "278", "awards": [], "places": ["New York City's Upper East Side"], "character_names": [], "language": "English", "publish_date": "2017-12-05 00:00:00", "ISBN": "1939665221"},
{"url": "https://www.goodreads.com/book/show/18171087-timberbeast", "num_ratings": "16", "num_reviews": "3", "avg_ratings": 3.5, "genres": [], "title": "TimberBeast (TimberBeast, #1)", "description": ["1991. Life in the forest is never what it appears to be. ", "Loggers, led by the TimberBeast, and eco-terrorists from several environmental organizations, are fighting for control of the Sierra forests in California. ", "Kelsy is engaged to Sandy as they climb the Los Angeles corporate ladder together. When life throws her a curve, she becomes an environmental spy to find the iden", "1991. Life in the forest is never what it appears to be. ", "Loggers, led by the TimberBeast, and eco-terrorists from several environmental organizations, are fighting for control of the Sierra forests in California. ", "Kelsy is engaged to Sandy as they climb the Los Angeles corporate ladder together. When life throws her a curve, she becomes an environmental spy to find the identity of the TimberBeast as she fights to secure her personal and financial future.", "Fox is a timber faller with a past. He's a loner by choice and has enough headaches just trying to keep his falling partners and job under control, but when Kelsy shows up in his forest he finds himself drawn to the blond research student and is soon leading her into the world of the Indian logger. ", "Kelsy plays the naïve student as she searches for ways to use Fox and find the TimberBeast, but her life takes a dangerous turn and she heads into unexpected romance on the way to success."], "author": "Jae Hall", "num_pages": "739", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-26 00:00:00", "ISBN": "1479278815"},
{"url": "https://www.goodreads.com/book/show/28152663-altered", "num_ratings": "84", "num_reviews": "58", "avg_ratings": 3.76, "genres": ["New Adult", "Romance"], "title": "Altered", "description": ["At first, I saw him as everyone else did.", "But then, I saw him for who he really was.", "Recognized the beauty beneath the pain.", "Loved the quirks disguising the insecurity.", "Embraced the man who hid behind the boy.", "But there was so much more…", "More I didn’t know.", "And once I did, I couldn’t let", "go…", "Of the boy.", "The man.", "The lover…", "…even if his past is threatening", "our future.", "Nothing will alter", "At first, I saw him as everyone else did.", "But then, I saw him for who he really was.", "Recognized the beauty beneath the pain.", "Loved the quirks disguising the insecurity.", "Embraced the man who hid behind the boy.", "But there was so much more…", "More I didn’t know.", "And once I did, I couldn’t let", "go…", "Of the boy.", "The man.", "The lover…", "…even if his past is threatening", "our future.", "Nothing will alter what we’ve built."], "author": "Kelly Cain", "num_pages": "233", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-02-02 00:00:00", "ISBN": "1940811449"},
{"url": "https://www.goodreads.com/book/show/16139694-hector", "num_ratings": "3,577", "num_reviews": "308", "avg_ratings": 4.11, "genres": ["New Adult", "Romance", "Romance", "Contemporary Romance", "Contemporary", "Sports and Games", "Sports"], "title": "Hector", "description": ["New Adult / Contemporary Romance", "Womanizer—check. ", "Cocky—check. ", "Dangerous—checkmate.", "Staying away from him was indisputably the sensible thing to do. The problem? She wasn’t just drawn to him; she was utterly mesmerized... ", "Charlotte Brennan is no stranger to heartache and mortification. Her past is full of both. So when amazing and incredibly intense Hector Ayala, literally j", "New Adult / Contemporary Romance", "Womanizer—check. ", "Cocky—check. ", "Dangerous—checkmate.", "Staying away from him was indisputably the sensible thing to do. The problem? She wasn’t just drawn to him; she was utterly mesmerized... ", "Charlotte Brennan is no stranger to heartache and mortification. Her past is full of both. So when amazing and incredibly intense Hector Ayala, literally jumps into Charlee’s life, her walls are immediately up. Letting her guard down and sharing her past and deepest secret is not happening. Charlee is not looking to get her heart crushed once again. However, her willpower proves to be no match for Hector’s mesmerizing pull.", "Guilt is a profound emotion to deal with and no one knows this better than Hector. So when he gets the chance to make up for a past indiscretion that’s been gnawing away at him for months, he takes it. Doing so means he’ll also have to pass up pursuing Charlee, the only girl he’s ever been so fascinated by. But his inability to explain why they could never be has him dealing with a new kind of", "guilt—the guilt of knowing he is unwillingly breaking her heart."], "author": "Elizabeth Reyes", "num_pages": "410", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18721533-slow-burn", "num_ratings": "156", "num_reviews": "11", "avg_ratings": 4.33, "genres": ["Romance", "Interracial Romance", "Romance"], "title": "Slow Burn", "description": ["Slow Burn is the third book in the six-part Sharing Space series. A new book will be available for Kindle download every three weeks. Each book is a short, fun, and sexy read that will leave you wanting more. ", "*** ", "Finally admitting what they share is more than just friendship, Chloe and Patrick begin to explore a romantic relationship. ", "As Patrick watches his childhood frien", "Slow Burn is the third book in the six-part Sharing Space series. A new book will be available for Kindle download every three weeks. Each book is a short, fun, and sexy read that will leave you wanting more. ", "*** ", "Finally admitting what they share is more than just friendship, Chloe and Patrick begin to explore a romantic relationship. ", "As Patrick watches his childhood friendships crumble, Chloe's arms prove to be his one place for comfort. Chloe struggles with her reasons for taking the romance slow. Does she have doubts about Patrick or is she still affected by her ex's betrayal? ", "One thing is for sure: Taking it slow may give their new love the best chance at lasting, but ignoring their passion is easier said than done. ", "*** ", "Book four in the Sharing Space series will be available just in time for Thanksgiving. Stay updated when a new book is available by following the author: ", " "], "author": "Nina Perez", "num_pages": "61", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18667099-family-ties", "num_ratings": "179", "num_reviews": "15", "avg_ratings": 4.18, "genres": ["Romance", "Interracial Romance"], "title": "Family Ties", "description": ["In Family Ties, Sharing Space Book Two: Just as Chloe and Patrick are getting accustomed to their new living arrangement, each is rocked by family secrets that will either break them or send them into each others' arms.", "Chloe finally has the opportunity to take her career to the next level when she’s tasked with managing an important promotion for a major client. While she’", "In Family Ties, Sharing Space Book Two: Just as Chloe and Patrick are getting accustomed to their new living arrangement, each is rocked by family secrets that will either break them or send them into each others' arms.", "Chloe finally has the opportunity to take her career to the next level when she’s tasked with managing an important promotion for a major client. While she’s taking advantage of her time to shine, she’s also having a hard time standing by and watching her cousin Crystal make the worst decision of her life.", "Patrick is feeling the pressure of being the only one in his family willing to recognize that his little sister, Charlotte, is spiraling out of control. He suspects that her problems are a lot bigger than failing grades and a controlling boyfriend. Will he take on the burden of trying to save her on his own?", "Each book in the Sharing Space series is a short, fun, and sexy read. A new book will be available for Kindle download every 3 weeks."], "author": "Nina Perez", "num_pages": "56", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20345578-swagger", "num_ratings": "29", "num_reviews": "15", "avg_ratings": 4.45, "genres": ["New Adult", "Romance", "Contemporary Romance", "Romance"], "title": "Swagger (Radioactive Tales of Love)", "description": ["Nine years, two lives, one love.", "We all have dreams. Mine were filled with college and the boy I loved, Cruz Montoya. But all that went up with smoke when he got sent to Juvenile Hall, my sister killed herself, and Dad up and left. My mother and I use that terminology loosely became a monster transferring her pains and disappointment and I became trapped.", "Honorably discharge", "Nine years, two lives, one love.", "We all have dreams. Mine were filled with college and the boy I loved, Cruz Montoya. But all that went up with smoke when he got sent to Juvenile Hall, my sister killed herself, and Dad up and left. My mother and I use that terminology loosely became a monster transferring her pains and disappointment and I became trapped.", "Honorably discharged I’m back in Arlington Heights, the small town that only remembers the black sheep persona of my youth. I could list a dozen reasons for my return, but the only one that matters is Roxanne Waters. I should probably leave her be. I’m not much of a catch with PTSD and the childhood memories rattling around in my brain. Yet, I can’t walk away. There’s a darkness that surrounds the death of her sister, a secrets that’s slowly killing her. I’m going to find out everything. This is the moment of truth to see if we can make it or if I’m nine years too late."], "author": "Nikki Prince", "num_pages": "157", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18994979-collaboration", "num_ratings": "2,538", "num_reviews": "288", "avg_ratings": 4.09, "genres": ["New Adult", "Romance", "Music", "Romance", "Contemporary Romance", "Contemporary"], "title": "Collaboration", "description": ["This is not your typical rock star romance. For one, the “rock star” is a rapper. And not just any rapper. Trace is the hottest ticket in the music industry right now, regardless of which definition of ‘hot’ you choose.", "Taryn Starr is not the girl-next-door who unknowingly meets a celebrity. Known as “America’s Sweetheart,” the reigning country music princess and world-reno", "This is not your typical rock star romance. For one, the “rock star” is a rapper. And not just any rapper. Trace is the hottest ticket in the music industry right now, regardless of which definition of ‘hot’ you choose.", "Taryn Starr is not the girl-next-door who unknowingly meets a celebrity. Known as “America’s Sweetheart,” the reigning country music princess and world-renowned superstar knows exactly who Trace is…or does she?", "Their worlds collide when the musicians whose paths were never destined to cross are forced by their joint record label to collaborate on a song. The sparks fly and ignite a fire that blazes hotter with every minute they spend together—for better or worse. One thing’s for certain, the two media magnets can’t deny their explosive chemistry, but will life in the spotlight ultimately bring Trace and Taryn together or force them apart?", "***This contemporary romance new adult novel is for mature audiences. The language alone would make a sailor blush (the guy’s a rapper, remember?) so 18+ only, please."], "author": "Michelle  Lynn", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-01-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17268753-the-karma-chronicles-vanessa-s-story", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 1.33, "genres": [], "title": "The Karma Chronicles Vanessa's Story", "description": ["Devastated after an emotional break-up, Vanessa decides to finish her fall semester and leave Bear Creek University and the town of Bear Creek forever, certain starting over in a new place will soothe her wounded heart. Her plans are derailed when her ex-lover returns wanting another chance. Despite the chemistry between them and their sensual history, should she risk her", "Devastated after an emotional break-up, Vanessa decides to finish her fall semester and leave Bear Creek University and the town of Bear Creek forever, certain starting over in a new place will soothe her wounded heart. Her plans are derailed when her ex-lover returns wanting another chance. Despite the chemistry between them and their sensual history, should she risk her heart again for a man who told her she wasn’t good enough for him or his tribe?", "Bowing to tribal pressure, Sean Yonah was forced to hurt his best friend and lover, the one woman he couldn’t get enough of. Now the Spirits say she may be his “other.” Sean knows what he did was deplorable, but if he doesn’t convince Vanessa to forgive him, he’ll lose a lot more than the love of his life."], "author": "Juliette Springs", "num_pages": "43", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20872652-committed-to-you", "num_ratings": "228", "num_reviews": "21", "avg_ratings": 3.89, "genres": ["Adult Fiction", "Erotica", "Erotica", "Menage", "New Adult", "Romance", "Academic", "College", "Romance", "Interracial Romance"], "title": "Committed To You", "description": ["Sometimes two halves still don't make you whole. And sometimes, what you see isn't the whole story.", "Evie entered an unlikely threesome, without being prepared for the reality of the situation, or the feelings it would unearth. But away from prying eyes and behind closed doors, love fills the space, and Evie allows herself to feel. ", "Out in the real world, eyes watch and judge", "Sometimes two halves still don't make you whole. And sometimes, what you see isn't the whole story.", "Evie entered an unlikely threesome, without being prepared for the reality of the situation, or the feelings it would unearth. But away from prying eyes and behind closed doors, love fills the space, and Evie allows herself to feel. ", "Out in the real world, eyes watch and judge. And when the media catches wind of their relationship, all Evie wants to do is run. And Jay? He's not having it. Evie's trapped, lured back by Jay's intoxicating love and her growing compassion for Cynthia, whose morbid confession of a twisted past makes it impossible for Evie to leave.", "Just when it seems all anyone could talk about was their complicated relationship, a death rocks their worlds. Evie, Jay and Cynthia head to Florida, united and ready to face whatever comes their way. While there, they find Pipe, getting into a little trouble of his own, and could really use his friends. ", "With chaos around them, all four find themselves in situations where they're left trying to discover their own identities and explore just how far their commitment to each other goes."], "author": "Kenya Wright", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7405450-rock-chick-rescue", "num_ratings": "31,850", "num_reviews": "1,970", "avg_ratings": 4.31, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Humor", "Funny"], "title": "Rock Chick Rescue", "description": ["Jet McAlister has a secret. Eddie Chavez has the hots for Jet (not to mention Eddie’s just plain hot). Jet has too many problems to realize that Eddie’s interested. Eddie loses patience when Jet ends her waitressing shift at a strip club with a knife at her throat. Since Eddie’s a cop, he figures he can help. Since Jet’s used to solving everyone’s problems she doesn’t want", "Jet McAlister has a secret. Eddie Chavez has the hots for Jet (not to mention Eddie’s just plain hot). Jet has too many problems to realize that Eddie’s interested. Eddie loses patience when Jet ends her waitressing shift at a strip club with a knife at her throat. Since Eddie’s a cop, he figures he can help. Since Jet’s used to solving everyone’s problems she doesn’t want Eddie’s help.", "Throw in a Dolly Parton look-alike, a gruff but lovable strip club owner, Jet’s ne’er do well father, his ne’er do well friend, Bear, Bear’s long-suffering, chain-smoking wife Lavonne and the crew from Rock Chick and you’ve got Rock Chick Rescue.", "Rock Chick Rescue takes you on a wild ride with Jet, Eddie and the gang as they wrestle bad guys in a bagel shop, hit Denver’s backstreet poker tables (with big hair), and help the strippers at Smithie’s take down a would-be murderer.", "Through this, Jet’s got to learn that even when life made you give up your dreams, you can still end up with the (hot) guy. Eddie’s got to rescue Jet from a bad man (so he can do better things with her) and teach her that some dreams can come true."], "author": "Kristen Ashley", "num_pages": "498", "awards": [], "places": ["Denver, Colorado"], "character_names": ["India \"Indy\" Savage", "Liam \"Lee\" Nightingale", "Allyson \"Ally\" Nightingale", "Henry \"Hank\" Nightingale", "Edward \"Eddie\" Chavez", "Henrietta \"Jet\" McAlister"], "language": "English", "publish_date": "2009-11-19 00:00:00", "ISBN": "1849234752"},
{"url": "https://www.goodreads.com/book/show/18365118-the-book-of-joshua-i---trust", "num_ratings": "241", "num_reviews": "30", "avg_ratings": 4.71, "genres": ["Romance", "Romance", "Romantic Suspense", "Romance", "African American Romance"], "title": "The Book of Joshua I - Trust", "description": ["CIA Operative Joshua Lassiter is always in the midst of danger. When an international incident requires his attention, the journey begins. In foreign territory with a ruthless King at the helm, Joshua finds himself rescuing royalty and a mysterious woman.", "Akande Ambree has a mission: kill the man who dishonored her family. Ready to give her life in honor of her country, it", "CIA Operative Joshua Lassiter is always in the midst of danger. When an international incident requires his attention, the journey begins. In foreign territory with a ruthless King at the helm, Joshua finds himself rescuing royalty and a mysterious woman.", "Akande Ambree has a mission: kill the man who dishonored her family. Ready to give her life in honor of her country, it is Joshua that crosses her path. Life takes on a different meaning under the tutelage of a Lassiter in more ways than one.", "Love for your country or the sweet love of a man.....", "The choice comes with trust."], "author": "Iris Bolling", "num_pages": "286", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12466116-nerds-are-freaks-too", "num_ratings": "832", "num_reviews": "67", "avg_ratings": 3.62, "genres": ["Romance", "Erotica", "Bdsm", "Romance", "Interracial Romance", "Adult Fiction", "Erotica", "Contemporary", "Romance", "Contemporary Romance"], "title": "Nerds Are Freaks Too", "description": ["Roxanne is stunned when her best friend, Leo, admits his feelings for her-she's so not going there. Lovers may come and go, but true friends are hard to find. Instead, she enlists his help to sign her up for an online fetish dating site. She immediately meets a man who can help her explore her kinky side, starting with a chat session that leads to the best orgasm of her li", "Roxanne is stunned when her best friend, Leo, admits his feelings for her-she's so not going there. Lovers may come and go, but true friends are hard to find. Instead, she enlists his help to sign her up for an online fetish dating site. She immediately meets a man who can help her explore her kinky side, starting with a chat session that leads to the best orgasm of her life. While her body's satisfied, her mind can't forget Leo's confession . . . ", "Leo, meanwhile, isn't giving up so easily. He knows Roxanne like the back of his hand, knows what she needs, and he's more than equipped to give it to her. Subtle touches, a sexy spanking, the most erotic dessert-eating session ever . . . Leo is successfully proving that computer nerds can be sexual freaks too-until Roxanne discovers his secret. One that could kill not only a potential relationship, but their longtime friendship as well."], "author": "Koko Brown", "num_pages": "109", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22850966-incarcerated", "num_ratings": "715", "num_reviews": "137", "avg_ratings": 3.93, "genres": ["Romance", "Romance", "Interracial Romance", "Contemporary", "Romance", "Contemporary Romance"], "title": "Incarcerated", "description": ["One of the few white kids in a rural Kentucky town, Logan Whyte always kept to his own kind out of self-preservation. He never considered himself racist, but that didn’t stop him from falling in with the wrong crowd that celebrated hate as much as he fought it - or from ending up in prison for eight years on an armed robbery charge.", "A successful and educated black woman, Ka", "One of the few white kids in a rural Kentucky town, Logan Whyte always kept to his own kind out of self-preservation. He never considered himself racist, but that didn’t stop him from falling in with the wrong crowd that celebrated hate as much as he fought it - or from ending up in prison for eight years on an armed robbery charge.", "A successful and educated black woman, Katie Andreassen is tired of being accused of betraying her own race. Her lonely isolation, coupled with her grief over losing her mother, inspire her to create a new pen pal program at Capshaw State Penitentiary, where her father is a warden.", "The program brings together the unlikely pair, but Logan and Katie soon find themselves forced to overcome past fears and prejudices. Their friendship doesn’t come easily - threatened by a crooked lawyer with a grudge and a best friend who betrays her promise to help.", "When faced with a world that forces them apart, Logan and Katie must show everyone else what they have discovered: that love is, in fact, colorblind."], "author": "Inger Iversen", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22817757-the-trouble-with-playing-cupid", "num_ratings": "61", "num_reviews": "11", "avg_ratings": 3.98, "genres": ["Romance", "Business", "Amazon"], "title": "The Trouble with Playing Cupid", "description": ["One New Year's Eve, shy singer, December Brown drunkenly texts her talk show host pal, Trace Randall, about her long time crush on the aloof actor, Tom Elmswood. Thinking the two celebrities would make a cute couple, he unwisely decides to play matchmaker... in front of a live studio audience. ", "Things start to go downhill when Tom admits he's never even heard of December be", "One New Year's Eve, shy singer, December Brown drunkenly texts her talk show host pal, Trace Randall, about her long time crush on the aloof actor, Tom Elmswood. Thinking the two celebrities would make a cute couple, he unwisely decides to play matchmaker... in front of a live studio audience. ", "Things start to go downhill when Tom admits he's never even heard of December before. Now what seemed like a sure fire hit quickly becomes a flop. Will these two lonely hearts ever make a love connection or has this cupid's arrow missed its mark?"], "author": "Tamara Philip", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15993374-charade", "num_ratings": "37,091", "num_reviews": "2,049", "avg_ratings": 3.98, "genres": ["New Adult", "Romance", "Contemporary", "Academic", "College", "Romance", "Contemporary Romance"], "title": "Charade", "description": ["Nineteen-year-old Cheyenne tries to portray the perfect life to mask the memories of her past. Walking in on her boyfriend with another woman her freshman year in college threatens that picture of perfection. ", "Twenty-one-year-old Colt never wanted college and never expected to amount to anything, but when his mom's dying wish is for him to get his degree, he has no choice b", "Nineteen-year-old Cheyenne tries to portray the perfect life to mask the memories of her past. Walking in on her boyfriend with another woman her freshman year in college threatens that picture of perfection. ", "Twenty-one-year-old Colt never wanted college and never expected to amount to anything, but when his mom's dying wish is for him to get his degree, he has no choice but to pretend it's what he wants too. ", "Cheyenne needs a fake boyfriend to get back at her ex and Colt needs cash to take care of his mom, so they strike a deal that helps them both. But what if Cheyenne’s past isn’t what she thought? Soon they’re trading one charade for another—losing themselves in each other to forget about their pain. The more they play their game, the more it becomes the only thing they have that feels real.", "Both Cheyenne and Colt know life is never easy, but neither of them expect the tragedy that threatens to end their charade and rip them apart forever."], "author": "Nyrae Dawn", "num_pages": "345", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16247792-gabriel-s-redemption", "num_ratings": "33,197", "num_reviews": "2,752", "avg_ratings": 4.22, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Adult", "New Adult", "Adult Fiction", "Erotica"], "title": "Gabriel's Redemption", "description": ["Professor Gabriel Emerson has left his position at the University of Toronto to embark on a new life with his beloved Julianne. Together, he’s confident that they can face any challenge. And he’s eager to become a father.", "But Julianne’s graduate program threatens Gabriel’s plans, as the pressures of being a student become all consuming. When she is given the honor of presen", "Professor Gabriel Emerson has left his position at the University of Toronto to embark on a new life with his beloved Julianne. Together, he’s confident that they can face any challenge. And he’s eager to become a father.", "But Julianne’s graduate program threatens Gabriel’s plans, as the pressures of being a student become all consuming. When she is given the honor of presenting an academic lecture at Oxford, Gabriel is forced to confront her about the subject of her presentation – research that conflicts with his own. And in Oxford, several individuals from their past appear, including an old nemesis intent on humiliating Julia and exposing one of Gabriel’s darkest secrets.", "In an effort to confront his remaining demons, Gabriel begins a quest to discover more about his biological parents, beginning a chain of events that has startling repercussions for himself, Julianne, and his hope of having a family."], "author": "Sylvain Reynard", "num_pages": "477", "awards": ["Goodreads Choice Award Nominee for Romance (2014)"], "places": [], "character_names": ["Gabriel Emerson", "Julianne Mitchell"], "language": "English", "publish_date": "2013-12-03 00:00:00", "ISBN": "0425266516"},
{"url": "https://www.goodreads.com/book/show/27181442-once-upon-a-lie", "num_ratings": "109", "num_reviews": "58", "avg_ratings": 4.29, "genres": [], "title": "Once Upon a Lie", "description": ["\"A simple cup of lemonade unites two lives, leading to a maze of adultery and murder that shatters Alex's youthful innocence and Jaleel's struggle to reshape his life. While the forces of the law try to unravel a mysterious death (or at least find a scapegoat) the two youths see the trajectories of their lives entwine, unravel, and come together again.\" -Midwest Book Revie", "\"A simple cup of lemonade unites two lives, leading to a maze of adultery and murder that shatters Alex's youthful innocence and Jaleel's struggle to reshape his life. While the forces of the law try to unravel a mysterious death (or at least find a scapegoat) the two youths see the trajectories of their lives entwine, unravel, and come together again.\" -Midwest Book Review", "Once Upon a Lie is about two strangers who become unlikely friends, only to unintentionally put each other's life in jeopardy. Jaleel Robeson, a gifted, eighteen year-old black man, falsely accused of murdering his father in a small Texas town, is on the run. He assumes a new identity in 1980s Los Angeles as a successful student on his way to college. Alexandra Baten, a restless sixteen year old white girl, lives in a privileged Toluca Lake family but feels trapped by her parents' values. One weekend, she rides her bike into a run down neighborhood, meeting a young black man selling lemonade. Thus begins a friendship between opposites, at least on the surface, but they learn they have more in common than they imagine. Told from each character's point of view in alternating chapters, we become involved in a gripping tale of two Americas where discontent and violence always lurk under the surface. When they erupt, no one is safe. Once Upon a Lie is both a family drama and a crime drama, as well as an exploration of interracial love, mother-daughter relationships, and redemption through courage."], "author": "Michael R. French", "num_pages": "388", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-15 00:00:00", "ISBN": "1938288653"},
{"url": "https://www.goodreads.com/book/show/20985510-secrets", "num_ratings": "476", "num_reviews": "58", "avg_ratings": 4.37, "genres": ["Romance", "Romance", "Interracial Romance", "Academic", "College", "Cultural"], "title": "Secrets", "description": ["She’s never loved the way she loves him.", "He’s consumed by an unquenchable need for her.", "Sam and AJ have faced so much together, survived so much together, but when secrets and mistrust rock the very foundation of their relationship, they must fight to keep it all from falling apart.", " ***************THIS BOOK CONTAINS EXPLICIT SEXUAL CONTENT AND SCENES OF VIOLENCE THAT SOME MA", "She’s never loved the way she loves him.", "He’s consumed by an unquenchable need for her.", "Sam and AJ have faced so much together, survived so much together, but when secrets and mistrust rock the very foundation of their relationship, they must fight to keep it all from falling apart.", " ***************THIS BOOK CONTAINS EXPLICIT SEXUAL CONTENT AND SCENES OF VIOLENCE THAT SOME MAY FIND OFFENSIVE; THEREFORE, THIS NOVEL IS NOT SUITABLE FOR PERSONS UNDER THE AGE OF 18 OR THOSE PARTICULARLY SENSITIVE TO VIOLENCE. *************"], "author": "Raven St. Pierre", "num_pages": "324", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20496986-lost-on-the-edge-of-forever", "num_ratings": "43", "num_reviews": "18", "avg_ratings": 3.37, "genres": ["New Adult", "Romance"], "title": "Lost on the Edge of Forever", "description": ["Leila, an ambitious and brilliant student, is murdered during her final semester at college, yet discovers she’s been reborn as a spirit resigned to haunt the school of her death. Alejandro, a listless and depressed freshman, arrives on campus eager to reinvent himself after eighteen years of awkwardness, as well as a devastating family tragedy, shake his sense of worth an", "Leila, an ambitious and brilliant student, is murdered during her final semester at college, yet discovers she’s been reborn as a spirit resigned to haunt the school of her death. Alejandro, a listless and depressed freshman, arrives on campus eager to reinvent himself after eighteen years of awkwardness, as well as a devastating family tragedy, shake his sense of worth and faith to their cores.", "The two lonely souls meet under the auspice of moonlit rain, and soon find themselves irrevocably, passionately attracted to each other. Leila discovers her spiritual body reawakening with sensations that make her feel alive again, and Alejandro discovers a kindred spirit who understands him like no one else. Intoxicated with each other, the impossible lovers begin to dream of finding a way to hold onto their own private miracle. Forever. ", "Yet how can Alejandro explain to skeptical friends and family that his soul-mate is dead? Why does Leila get the nagging suspicion that within their relationship lies the secret of her continued existence? An unexpected act of evil ignites these unavoidable questions, only to reveal in its aftermath the true purpose of Leila and Alejandro’s star-crossed romance. Will their love allow them to accept a profound destiny that surpasses time and perhaps even God, or is their love destined to die loud and young?"], "author": "Michael Haley", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18753025-theirs-to-play", "num_ratings": "695", "num_reviews": "102", "avg_ratings": 3.73, "genres": ["Adult Fiction", "Erotica", "Romance", "Romance", "Contemporary Romance", "Contemporary", "Romance", "Erotic Romance", "New Adult"], "title": "Theirs to Play", "description": ["Two billionaire brothers enjoy twisted games where women are the sport. They find a female, date her, and compete to see who can bed her first. ", "Too bad they picked the wrong one this time. Dawn's too smart for their verbal play and too quick to get trapped by clever ploys. ", "The more the brothers work to capture her heart, the more they discover she might not be theirs to pl", "Two billionaire brothers enjoy twisted games where women are the sport. They find a female, date her, and compete to see who can bed her first. ", "Too bad they picked the wrong one this time. Dawn's too smart for their verbal play and too quick to get trapped by clever ploys. ", "The more the brothers work to capture her heart, the more they discover she might not be theirs to play."], "author": "Kenya Wright", "num_pages": "191", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18243228-campus-prowl", "num_ratings": "126", "num_reviews": "14", "avg_ratings": 3.44, "genres": ["Fantasy", "Paranormal", "Romance", "Interracial Romance", "Romance", "Paranormal Romance"], "title": "Campus Prowl (Edson College Series)", "description": ["When Keisha Hawkins, an overachieving scholarship kid, is forced to tutor her crush, a privileged white boy, she thinks it’s the end of her. The man is way too sexy. Not to mention full of himself. He's the college’s star athlete. He’s as big as giant. And he enjoys provoking her to no end. How could she be expected to work under such circumstances?", "Rex Kellerton, a werewol", "When Keisha Hawkins, an overachieving scholarship kid, is forced to tutor her crush, a privileged white boy, she thinks it’s the end of her. The man is way too sexy. Not to mention full of himself. He's the college’s star athlete. He’s as big as giant. And he enjoys provoking her to no end. How could she be expected to work under such circumstances?", "Rex Kellerton, a werewolf, is relentless about pursuing Keisha, his better half. He’s waited four years to get close to her. He needs to get close to her! Sure, she thinks he is a player. Sure, she smashed her foot on his toe. And yeah, she keeps calling his wolf form “Rover” but that’s nothing he can’t handle. She is his and that’s that.", "With stereotypes, misconceptions, werewolves, composition papers and bullies coming between them—can these two unlikely lovers trust the love between them to earn a passing grade? Or will they bottom out their senior year?"], "author": "Kasey Moone", "num_pages": "114", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18976625-red-sun", "num_ratings": "219", "num_reviews": "29", "avg_ratings": 4.02, "genres": ["Romance", "Interracial Romance", "Romance", "Cultural"], "title": "Red Sun", "description": ["Solei soon realizes her stay just outside the nearby reservation will be nothing at all like she expected. The moment her path crosses that of two brothers from the local tribe, she finds herself amidst an intense love triangle that threatens the bonds of friendship and brotherhood. When left to decide between what her heart wants versus what her heart needs, will Solei ma", "Solei soon realizes her stay just outside the nearby reservation will be nothing at all like she expected. The moment her path crosses that of two brothers from the local tribe, she finds herself amidst an intense love triangle that threatens the bonds of friendship and brotherhood. When left to decide between what her heart wants versus what her heart needs, will Solei make the right decision?"], "author": "Raven St. Pierre", "num_pages": "444", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18130644-complicated-by-you", "num_ratings": "379", "num_reviews": "63", "avg_ratings": 3.63, "genres": ["New Adult", "Erotica", "Menage", "Romance", "Romance", "Interracial Romance", "Adult Fiction", "Erotica", "Academic", "College"], "title": "Complicated By You", "description": ["COMPLICATED BY YOU is a sexy New Adult love story about a girl who loves so deeply that it may cost her everything. ", "Evie's childhood friend Jay has always had her back. But college complicates things as Jay starts dating Evie's roommate Cynthia. Now, Evie spends her nights trying to sleep while Jay and Cynthia go at it like rabbits a few feet away! ", "Evie hates feeling like", "COMPLICATED BY YOU is a sexy New Adult love story about a girl who loves so deeply that it may cost her everything. ", "Evie's childhood friend Jay has always had her back. But college complicates things as Jay starts dating Evie's roommate Cynthia. Now, Evie spends her nights trying to sleep while Jay and Cynthia go at it like rabbits a few feet away! ", "Evie hates feeling like a third wheel and hates wishing it was her in Jay's arms even more. It doesn't help that Jay won't let Evie date or even hook up without interfering and making sure everyone on campus knows that she's off limits. ", "Something has to give. Evie can't continue pining away for Jay, and Jay can't continue to act like he owns her when he won't so much as touch her. And worse of all, Evie can barely look Cynthia in the eye for fear she will know just how she feels about Jay. ", "Then one night shifts Evie, Jay and Cynthia into an web of love and deceit, tangling their hearts and forcing one of them to come to a compromise that will change all their lives. ", "How far should someone go for love? ", "Until it’s no longer convenient, or until it’s tearing apart their soul? Evie soon realizes that love isn’t always easy and loving someone isn't as simple as it seems. Sometimes, it's COMPLICATED. ", "Look for Evie and Jay's story to continue in December 2013!"], "author": "Kenya Wright", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13568940-saving-anya", "num_ratings": "963", "num_reviews": "62", "avg_ratings": 4.41, "genres": ["Romance", "Interracial Romance", "Romance", "Contemporary"], "title": "Saving Anya", "description": ["What will a man do for his family? If you’re a Medlov, the answer is anything.", "Dmitry Medlov, former boss of the Medlov Crime Family, is finally happy with his life. His legacy has been passed on to his heir, Anatoly, and his family is flourishing with birth of his new twin sons. However, everything is shattered when his little girl is abducted from her school only days aft", "What will a man do for his family? If you’re a Medlov, the answer is anything.", "Dmitry Medlov, former boss of the Medlov Crime Family, is finally happy with his life. His legacy has been passed on to his heir, Anatoly, and his family is flourishing with birth of his new twin sons. However, everything is shattered when his little girl is abducted from her school only days after his sons’ births.", "The question with Dmitry having so many enemies is who has her? A supporter of Dorian, a follower of Ivan or family of the council members he slaughtered? No one knows.", "A ransom is put on the young girl in the amount of $500 million – a price Dmitry is more than ready to pay – but the fear in everyone’s heart is even if he pays, will she live?", "Everyone comes together and puts aside their differences to save her. Dmitry returns to the council, Anatoly steps aside and Gabriel takes his rightful place as a Vor.", "Anya is the key to the very foundation of the family and her father’s fleeting sanity. With her missing, Dmitry’s rage is unleashed unlike anyone has ever seen before.", "Gabriel used to serve the very government that he is about to defy as he learns what it means to be a true Medlov.", "And Anatoly is forced to grow up when he not only finds out that the little girl he’s loved her entire life has been stolen but also that he’s about to be a father himself.", "Read the last book of the Medlov Crime Family Series, guaranteed to top all others, as the men discover that the only thing more important than money and power is family"], "author": "Latrivia S. Nelson", "num_pages": "362", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/14430023-wheels-of-steel", "num_ratings": "90", "num_reviews": "4", "avg_ratings": 4.48, "genres": [], "title": "Wheels of Steel: Special Edition Book 1, 2, and 3", "description": ["Jason, better known as Top, is an up and coming DJ. He's a white guy that knows more about Hip Hop than most and he also has cerebral palsy. His group, Wheels of Steel is comprised of self-proclaimed misfits that are made cool by their talent. But despite his talent and popularity Jason is plagued by issues of trust and anger. Robin is a shy black girl that takes a job as", "Jason, better known as Top, is an up and coming DJ. He's a white guy that knows more about Hip Hop than most and he also has cerebral palsy. His group, Wheels of Steel is comprised of self-proclaimed misfits that are made cool by their talent. But despite his talent and popularity Jason is plagued by issues of trust and anger. Robin is a shy black girl that takes a job as his home healthcare aid. Her crippling shyness makes everything difficult for her, and not just her bad tempered client with cerebral palsy, but also his close knit friends, and even her mother with her best intentions. Their saga takes them along a musical journey of self-discovery and love. This three part interracial love story explores the spirit of love and acceptance between a person with an obvious disability-and someone whose disabilities are not always quite so obvious."], "author": "Pepper Pace", "num_pages": "688", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-01 00:00:00", "ISBN": "1475133650"},
{"url": "https://www.goodreads.com/book/show/18333729-heart-seoul", "num_ratings": "134", "num_reviews": "24", "avg_ratings": 4.33, "genres": ["Romance", "Short Stories", "Romance", "Interracial Romance", "Novella"], "title": "Heart & Seoul", "description": ["**Note to the reader: HEART & SEOUL is a bonus novella included in The Dividing Line**", "The time was 7:04 a.m. Seoul time, and he was almost home...", "Drake has been through a lot with his fiancée Lacey, but the biggest obstacle has yet to come.", "His journey into adulthood has been one constant struggle due to doors left open from his past. By definition, Drake was adopted in", "**Note to the reader: HEART & SEOUL is a bonus novella included in The Dividing Line**", "The time was 7:04 a.m. Seoul time, and he was almost home...", "Drake has been through a lot with his fiancée Lacey, but the biggest obstacle has yet to come.", "His journey into adulthood has been one constant struggle due to doors left open from his past. By definition, Drake was adopted into a good home, one of opulence and opportunity. But he wonders about his former life, and the country he was forced to leave behind.", "In search of closure, Drake heads to his home country of South Korea with Lacey by his side. He hopes seeking out his birth mother will give him peace, help him on his way to healing, before he begins his new life with his fiancée.", "Told from the voice of Lacey, Heart & Seoul is the story of one man's search for identity as seen through the eyes of the woman who loves him.", "Heart & Seoul is book 2.5 in The Space Between series. It is not a standalone and is a novella at 21,000 words."], "author": "Victoria H. Smith", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8529685-dmitry-s-royal-flush", "num_ratings": "1,269", "num_reviews": "71", "avg_ratings": 4.33, "genres": ["Romance", "Interracial Romance", "Romance", "Contemporary"], "title": "Dmitry’s Royal Flush: Rise of the Queen", "description": ["From the popular multicultural author, Latrivia S. Nelson, comes the highly anticipated second installment of the Medlov Crime Family Series, Dmitry's Royal Flush: Rise of the Queen.", "For Dmitry and Royal Medlov, money doesn’t equal happiness. Forced to leave Memphis, TN and flee to Prague after a brutal mafia war, the couple nestled into the countryside to raise their daugh", "From the popular multicultural author, Latrivia S. Nelson, comes the highly anticipated second installment of the Medlov Crime Family Series, Dmitry's Royal Flush: Rise of the Queen.", "For Dmitry and Royal Medlov, money doesn’t equal happiness. Forced to leave Memphis, TN and flee to Prague after a brutal mafia war, the couple nestled into the countryside to raise their daughter, Anya, and lead a safe, quiet life. But when Dmitry’s son, Anatoly, shows up with an offer he can’t refuse, Dmitry is forced to go back to the life he left as boss of the most feared criminal organization in world. Consequently, the deal could not only destroy the Medlov Crime Family but also Dmitry and Royal.", "Royal hasn’t been the same since she was attacked three years ago. Where she used to be a sweet, innocent girl, she’s now the jaded, bitter mistress of the Medlov Chateau. However, a reality check is in store for the pre-Madonna when Anya’s new teacher shows up with her sights set on stealing Dmitry, and Ivan’s old ally shows up with his sights on killing him. Can Royal save them all? Will she?", "With a family in such turmoil, the only way to survive is to stick together. Read the gripping tale of a marriage strong enough to stand the test of time as Dmitry realizes that he has the best cards in the house as long as he has a Royal Flush."], "author": "Latrivia S. Nelson", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2010-07-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17448960-falling-into-you", "num_ratings": "50,443", "num_reviews": "4,363", "avg_ratings": 4.04, "genres": ["Young Adult", "Romance", "Did Not Finish", "Academic", "College"], "title": "Falling into You", "description": ["I wasn't always in love with Colton Calloway; I was in love with his younger brother, Kyle, first. Kyle was my first one true love, my first in every way.", "Then, one stormy August night, he died, and the person I was died with him.", "Colton didn't teach me how to live. He didn't heal the pain. He didn't make it okay. He taught me how to hurt, how to not be okay, and, eventually", "I wasn't always in love with Colton Calloway; I was in love with his younger brother, Kyle, first. Kyle was my first one true love, my first in every way.", "Then, one stormy August night, he died, and the person I was died with him.", "Colton didn't teach me how to live. He didn't heal the pain. He didn't make it okay. He taught me how to hurt, how to not be okay, and, eventually, how to let go."], "author": "Jasinda Wilder", "num_pages": "240", "awards": [], "places": [], "character_names": ["Nell Hawthorne", "Colton Calloway", "Kyle Calloway"], "language": "English", "publish_date": "2013-03-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17888810-anytime-soon", "num_ratings": "44", "num_reviews": "8", "avg_ratings": 3.75, "genres": ["New Adult", "Fiction", "Academic", "College"], "title": "Anytime Soon", "description": ["Frenzied. Overburdened. Stressed. Overwhelmed. These are just a few ways to describe college senior Anaya Goode's life. Add to this no career prospects following a looming graduation, and Anaya quickly finds herself drowning in the chaos of her own life. Her family and friends demand much of Anaya, and she's struggling to balance herself in the mire. Facing an onslaught of", "Frenzied. Overburdened. Stressed. Overwhelmed. These are just a few ways to describe college senior Anaya Goode's life. Add to this no career prospects following a looming graduation, and Anaya quickly finds herself drowning in the chaos of her own life. Her family and friends demand much of Anaya, and she's struggling to balance herself in the mire. Facing an onslaught of grief, complex relationships, and a life that is full of deafening noise, Anaya must find herself, and maybe even true love and redemption, amid old traditions and new beginnings."], "author": "Tamika Christy", "num_pages": "278", "awards": ["Next Generation Indie Book Awards Nominee for African American (2014)"], "places": [], "character_names": [], "language": null, "publish_date": "2013-07-01 00:00:00", "ISBN": "1937084957"},
{"url": "https://www.goodreads.com/book/show/18134249-ruin", "num_ratings": "38,006", "num_reviews": "3,888", "avg_ratings": 4.18, "genres": ["New Adult", "Romance", "Academic", "College", "Contemporary", "Romance", "Contemporary Romance", "Young Adult"], "title": "Ruin", "description": ["I'm not your typical girl. I've been running away from the memories that haunt me for so long that depression has become my only comfort. I was content in the darkness...until Wes Michals offered to be my light.", "I didn't know that time wasn't my ally -- that every second that ticked past was one step closer to the end of something that was beginning to mean the end of mysel", "I'm not your typical girl. I've been running away from the memories that haunt me for so long that depression has become my only comfort. I was content in the darkness...until Wes Michals offered to be my light.", "I didn't know that time wasn't my ally -- that every second that ticked past was one step closer to the end of something that was beginning to mean the end of myself. He tried to warn me. He promised me all he was able to offer--each moment as it came--but it would never be enough.", "Sometimes when you think it's the end, it's only the beginning. Wes thought he could save me, but in giving me everything, he ruined me. Because after one kiss, one touch, I couldn't--I wouldn't ever be the same.", "And from that moment on, his heartbeat became my own."], "author": "Rachel Van Dyken", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18213128-sins-and-betrayals", "num_ratings": "129", "num_reviews": "21", "avg_ratings": 4.51, "genres": ["Romance", "African American Romance", "Romance"], "title": "SINS AND BETRAYALS", "description": ["Convicted of a crime he didn’t commit, Ian Bertrand was thrown into prison and ripped away from his family and the life he'd built with his pregnant wife, Triniti. She was the driving force behind him fighting his conviction with everything in him… until she filed for divorce.", "Part of a wealthy family where status was everything, Triniti is now engaged to be married to the", "Convicted of a crime he didn’t commit, Ian Bertrand was thrown into prison and ripped away from his family and the life he'd built with his pregnant wife, Triniti. She was the driving force behind him fighting his conviction with everything in him… until she filed for divorce.", "Part of a wealthy family where status was everything, Triniti is now engaged to be married to the pastor of one of the largest mega-churches in Louisiana. At one time, she'd loved Ian Bertrand with a fierceness that had consumed her very soul. After he was arrested for murder, doubt had set in and eaten away at the lining of her trust. After the judge sentenced him to life without the possibility of parole, Triniti felt as if she’d suffered a devastating loss – in more ways than one.", "Now, after serving six years of his sentence, Ian is back, free due to a technicality with the justice system. He’s returned to New Orleans, bound and determined to make the people who callously ruined his life pay.", "And he’s starting with his ex-wife, Triniti Montclaire."], "author": "S.K. Hardy", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18040318-a-tangled-web", "num_ratings": "85", "num_reviews": "12", "avg_ratings": 3.45, "genres": ["Romance", "Interracial Romance", "Romance", "Fat", "Fat Acceptance", "New Adult"], "title": "A Tangled Web", "description": ["Kimberly Jordan never meant to hurt anyone.", "But once a DNA test reveals her longtime boyfriend, Damien, is her half-brother, plus she finds out she's pregnant, she will go to any length to hide her horrible secret. ", "Unfortunately for Kent Davenport, he's the perfect fall guy for her plan having recently revealed his love for her. But unfortunately for Kimberly, dirty little", "Kimberly Jordan never meant to hurt anyone.", "But once a DNA test reveals her longtime boyfriend, Damien, is her half-brother, plus she finds out she's pregnant, she will go to any length to hide her horrible secret. ", "Unfortunately for Kent Davenport, he's the perfect fall guy for her plan having recently revealed his love for her. But unfortunately for Kimberly, dirty little secrets always come out.", "A Tangled Web is the first in the Dangerous Secrets series, a series of unrelated stories in which one or more of the main characters has a secret so big, it threatens to derail or even destroy their most important relationships, their personal character, or their entire lives.", "The secrets are ‘dirty.’ Scandalous. Taboo.", "Secrets anyone would be wise to remain tight-lipped on.", "But in these tales, one way or another, that horrible secret gets out.", "Let the fallout begin."], "author": "Rose Francis", "num_pages": "110", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12954666-my-best-friend", "num_ratings": "339", "num_reviews": "42", "avg_ratings": 3.9, "genres": ["Romance", "Romance", "Interracial Romance", "Romance", "Contemporary Romance"], "title": "My Best Friend", "description": ["What would you do if you realize that your best friend is the love of your life? Jason and Kay loved each other from the moment they met but obstacles kept getting in their way. An unexpected pregnancy brings them together.", "This book contains explicit sexual content.", "REVISED"], "author": "Ancelli", "num_pages": "117", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18160564-jack-diane", "num_ratings": "397", "num_reviews": "37", "avg_ratings": 3.77, "genres": ["Romance", "Romance", "Interracial Romance", "Romance", "Contemporary Romance"], "title": "Jack & Diane", "description": ["When Diane's car breaks down during a snowstorm on an empty highway, she's fearful of the driver of the pickup truck with the confederate flag vanity plate who stops to help.", "From the moment that Jack sees her warm brown eyes, he knows that his prayers have been answered. Now he just has to convince the beautiful damsel in distress of that too.", "Diane Clark is an African-Amer", "When Diane's car breaks down during a snowstorm on an empty highway, she's fearful of the driver of the pickup truck with the confederate flag vanity plate who stops to help.", "From the moment that Jack sees her warm brown eyes, he knows that his prayers have been answered. Now he just has to convince the beautiful damsel in distress of that too.", "Diane Clark is an African-American law student with dreams of big city corporate takeovers. Jack Sloan is a generational farmer with a love of country music and the simple life. Can they overcome their differences and her bad impression of their first meeting to find love?"], "author": "Lena Hampton", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13570725-wheels-of-steel", "num_ratings": "480", "num_reviews": "18", "avg_ratings": 4.29, "genres": ["Disability", "Romance", "Interracial Romance", "Romance"], "title": "Wheels of Steel: Book 2", "description": ["In book 1 you were introduced to Robin and Jason; a talented young man with cerebral palsy and his introverted caregiver. Their dawning love transcended their racial and social difference. Now in book 2 Jason and Robin along with the other member of Wheels of Steel find themselves spiraling away from each other. The ultimate question that each of them will face is; can the", "In book 1 you were introduced to Robin and Jason; a talented young man with cerebral palsy and his introverted caregiver. Their dawning love transcended their racial and social difference. Now in book 2 Jason and Robin along with the other member of Wheels of Steel find themselves spiraling away from each other. The ultimate question that each of them will face is; can there be forgiveness after betrayal?", "Wheels of Steel is 3 part saga that is more than just an interracial love story. It is a journey of music, love, betrayal and trust. This story contains graphic sex and language and is intended for mature readers only."], "author": "Pepper Pace", "num_pages": "497", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13570727-wheels-of-steel-book-3", "num_ratings": "448", "num_reviews": "28", "avg_ratings": 4.1, "genres": ["Disability", "Romance", "Interracial Romance", "Romance"], "title": "Wheels of Steel, Book 3", "description": ["Robin used to be the dependable friend and good girl, until Jason and his friends abused her trust. Now the once shy girl lives on the opposite end of the spectrum. Sordid nights filled with drug use and alcohol finds Robin now spiraling out of control.", "And Jason will stop at nothing to gain her trust and love, and hopefully to save her from herself. In book 3 of this award", "Robin used to be the dependable friend and good girl, until Jason and his friends abused her trust. Now the once shy girl lives on the opposite end of the spectrum. Sordid nights filled with drug use and alcohol finds Robin now spiraling out of control.", "And Jason will stop at nothing to gain her trust and love, and hopefully to save her from herself. In book 3 of this award nominated story, the tale of the Wheels of Steel gang continues with a new epilogue and ending never before seen in print.", "This three part interracial love story explores the spirit of love and acceptance between a person with an obvious disability—and someone whose disabilities are not always quite so obvious. This story contains graphic sex, language and drug use and is intended for mature readers only."], "author": "Pepper Pace", "num_pages": "178", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18284035-the-world-in-reverse", "num_ratings": "459", "num_reviews": "45", "avg_ratings": 4.49, "genres": ["Romance", "Romance", "Interracial Romance", "Romance", "Romantic Suspense"], "title": "The World in Reverse", "description": ["Italian heartthrob Nicola Agosto was Memphis’ most eligible bad boy seven years ago, but after falling in love with local college beauty queen, Ivy Winters, he settled down and started a beautiful family.", "Now as a father of four and a loving husband, he has ascended up the ranks of the Memphis Police Department and positioned himself as a dependable and trustworthy top cop.", "Italian heartthrob Nicola Agosto was Memphis’ most eligible bad boy seven years ago, but after falling in love with local college beauty queen, Ivy Winters, he settled down and started a beautiful family.", "Now as a father of four and a loving husband, he has ascended up the ranks of the Memphis Police Department and positioned himself as a dependable and trustworthy top cop. However, he is known for protecting his officers and not taking anything off criminals, a trait that will not bode well for him in the near future.", "When four children are found raped and murdered, Nicola is the first person assigned to the high profile case, tapped personally by the brass. Partnered with a new age bad boy, Luke Johnson, and determined to solve the case, he stumbles on a conspiracy so big until the men responsible have no choice but to set him up and get him out of the picture.", "Caught on camera beating a black suspect who threatens his family with the same fate as the four dead children, Nicola goes from Memphis’ most beloved police officer to public enemy number one. He’s accused of being a racist and charged with abusing his power. Put on suspension pending an investigation, he is faced with losing the only job that he’s ever known as well as his freedom.", "Realizing that even without a badge, Nicola could be a problem, The Three Wise Men, the conspirers behind the elaborate plot, now want more than Nicola’s badge; they also want his life. With nowhere to turn and bound by promises he refuses to break, Nicola turns to his sworn enemy, Russian crime boss Dmitry Medlov. And its just time to save him and his family from being brutally murdered. A favor for a favor grants Nicola the man and firepower he needs finally solve the case, but it also forces him to go against everything that he’s ever stood for."], "author": "Latrivia S. Nelson", "num_pages": "497", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-01 00:00:00", "ISBN": "0983981957"},
{"url": "https://www.goodreads.com/book/show/18304767-romancing-sal-gabrini-1", "num_ratings": "375", "num_reviews": "24", "avg_ratings": 4.39, "genres": ["Romance", "Interracial Romance", "Romance"], "title": "Romancing Sal Gabrini 1", "description": ["Gemma Jones once thought Sal Gabrini could be a keeper. He was, in truth, the man of her dreams. But after she didn’t hear from him when he had promised to stay in touch, she wasn’t thinking about him either. ", "Even when she travels to his turf, to Seattle, to attend a stuffy lawyer’s convention, she’s bound and determined not to give Sal a second thought. The fact that she", "Gemma Jones once thought Sal Gabrini could be a keeper. He was, in truth, the man of her dreams. But after she didn’t hear from him when he had promised to stay in touch, she wasn’t thinking about him either. ", "Even when she travels to his turf, to Seattle, to attend a stuffy lawyer’s convention, she’s bound and determined not to give Sal a second thought. The fact that she had refused his sexual advances probably had everything to do with why he didn’t follow up with her, and she understands that. But that understanding only makes her all the more determined to keep him at arm’s length. She might have been known for her slamming body, but that didn’t mean she wants the man of her dreams to only want her for that body.", "But the convention turns out to be so boring that Trina, her friend and business partner, encourages her to give the man a call. If nothing else he can show her the town and ramp down the boredom, her friend insists. So against her better judgment, Gemma phones him. When he doesn’t return her voice mail message later that night, she wants to kick herself for even bothering.", "Hunky businessman Sal Gabrini arrives back in town after a trip to Jersey. When he sees where the gorgeously exotic Gemma Jones has left him a message, he realizes how much he actually misses her. He shows up at her hotel, catching her off guard, and that one proactive move takes the pair of would-be lovers on the most tumultuous, yet sexually and emotionally gratifying rollercoaster ride of their lives.", "Sal has to decide if he is willing to risk it all for the love of a good woman, and Gemma has to decide if a player like Sal Gabrini can ever truly change and become the man she will need him to be. Their tempers flare, their personalities clash, but their love for each other becomes the cornerstone that could actually make their relationship work.", "In the first book by bestselling author Mallory Monroe that focuses on Tommy’s younger brother Sal, ROMANCING SAL GABRINI is an interracial romance that takes the readers on a compelling journey of love, sex, and tears."], "author": "Mallory Monroe", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17794447-exit-strategy", "num_ratings": "515", "num_reviews": "72", "avg_ratings": 4.11, "genres": ["Romance", "Interracial Romance", "Romance", "Adult Fiction", "Erotica", "Romance", "Contemporary Romance"], "title": "Exit Strategy", "description": ["The Highly Anticipated Follow-up to Fifty Shades of Jungle Fever!", "Ex•it Strat•e•gy (noun) 1. A preplanned means of extricating oneself from a situation that is likely to become difficult or unpleasant. 2. The method by which a venture capitalist or business owner intends to get out of an investment that he or she has made in the past.", "Will Keisha and Tristan exercise their e", "The Highly Anticipated Follow-up to Fifty Shades of Jungle Fever!", "Ex•it Strat•e•gy (noun) 1. A preplanned means of extricating oneself from a situation that is likely to become difficult or unpleasant. 2. The method by which a venture capitalist or business owner intends to get out of an investment that he or she has made in the past.", "Will Keisha and Tristan exercise their elaborate EXIT STRATEGY and end their unorthodox arrangement?", "Assailed by demons she thought she had conquered, Keisha Beale has uttered the words to end her tumultuous relationship with Tristan White. Separated, they grapple for a time with their personal demons. However, when their lives apart become unbearable, a credible threat brings them back together prematurely.", "As they seek to discover who is responsible for the threats, several seemingly unrelated incidents throw them into a tailspin. Will Keisha’s youthful indiscretions or Tristan’s un-reconciled feelings for a former sub derail their tenuous arrangement?", "In the meantime, trouble in Nathan and Jada’s paradise send dramatic ripples that hint of future difficulties in the idyllic pairing.", "Nothing Ventured…", "Tristan uses his vast wealth and connections to correct a gross miscarriage of justice, while Keisha makes herself utterly vulnerable to Tristan and fears he has chosen to exercise his own exit strategy.", "…Nothing Gained!", "Will this be the end of the indecent arrangement that became a fairy tale? Or will Keisha and Tristan reveal the trauma from their pasts so they may heal and completely embrace their relationship?", "Sensual, suspenseful, and still infused with the riotous levity of Triple-G and Fairy Hoochie Mama, the Ghetto Girl Romance Quadrilogy departs from full parody with a distinctive take on love, loyalty, sacrifice, redemption, and acceptance."], "author": "L.V. Lewis", "num_pages": "281", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11663898-at-last", "num_ratings": "360", "num_reviews": "25", "avg_ratings": 3.91, "genres": ["Romance", "Romance", "Interracial Romance", "Adult Fiction", "Erotica", "Did Not Finish"], "title": "At Last", "description": ["Courtney Phillips has always been the standby girl for Christopher Wilkinson, who thinks he's God's gift to women. He isn't. He's a tosser. Just think of one of those guys who sows his wild oats all over the damn shop, then comes home and marries a “good girl.” Courtney's supposed to be the “good girl.” ", "Imagining Chris has gone to South Africa to teach English to underpriv", "Courtney Phillips has always been the standby girl for Christopher Wilkinson, who thinks he's God's gift to women. He isn't. He's a tosser. Just think of one of those guys who sows his wild oats all over the damn shop, then comes home and marries a “good girl.” Courtney's supposed to be the “good girl.” ", "Imagining Chris has gone to South Africa to teach English to underprivileged kids to do something good for the world, Courtney is shocked to get an email from one of the teachers, Ryan Klark, who is sharing living quarters with Chris. They start a relationship via email which grows into something unexpected and romantic, then rather dirty. The story follows their emails, telephone conversations, their first meeting and how they fall in love. But things get complicated when Chris gets back, and the few details Ryan kept out of conversations are revealed—and threaten to ruin everything."], "author": "Billy London", "num_pages": "131", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18857453-gravity", "num_ratings": "923", "num_reviews": "103", "avg_ratings": 4.07, "genres": ["Romance", "Romance", "Interracial Romance", "New Adult"], "title": "Gravity", "description": ["A chance meeting reshapes the lives of two strangers who soon learn that we don't always choose who we fall in love with; sometimes life chooses for us.", "Samantha Kelley thinks she's got it all figured out until she literally collides with", "Anthony \"AJ\" Hahn one fateful day, forcing her to question whether she's been", "missing something all along... ", "Him."], "author": "Raven St. Pierre", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18130817-unexpected", "num_ratings": "150", "num_reviews": "23", "avg_ratings": 4.05, "genres": ["Romance", "Interracial Romance", "Roman"], "title": "Unexpected", "description": ["Noel Wright is stuck in Sin City, in a rut doing the same things and seeing the same people every day until a sexy stranger ordering dessert—and not just that on the menu—turns Noel’s predictable world upside down. Kai, a member of a popular Korean pop group lives a charmed and glamorous life, surrounded by everything he could ever want and yet he feels empty and stuck. A", "Noel Wright is stuck in Sin City, in a rut doing the same things and seeing the same people every day until a sexy stranger ordering dessert—and not just that on the menu—turns Noel’s predictable world upside down. Kai, a member of a popular Korean pop group lives a charmed and glamorous life, surrounded by everything he could ever want and yet he feels empty and stuck. A chance meeting at a local casino diner sets his ordered world careening happily out of control as a luscious, full-figured waitress sends his closed heart into a tailspin. When these two complete opposites meet, worlds collide and sparks fly and the world of K-Pop will never be the same again. But will a meddling uncle, an unforgiving public, a secret admirer, a jealous friend, and Kai’s unruly group mates bring the couple together or ultimately tear them apart?"], "author": "Sarah G.", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-25 00:00:00", "ISBN": "1600431267"},
{"url": "https://www.goodreads.com/book/show/7679583-dmitry-s-closet", "num_ratings": "2,286", "num_reviews": "183", "avg_ratings": 3.98, "genres": ["Romance", "Romance", "Interracial Romance", "Romance", "Contemporary Romance", "Contemporary", "Mystery", "Crime"], "title": "Dmitry's Closet", "description": ["From author Latrivia S. Nelson, author of the epic romance Ivy's Twisted Vine, comes a story about Memphis, TN, a deadly faction of the Russian mafia and an innocent woman who dismantles an empire. Orphaned virgin Royal Stone is looking for employment in one of the country's toughest recessions. What she finds is the seven-foot, blonde millionaire Dmitry Medlov, who offers", "From author Latrivia S. Nelson, author of the epic romance Ivy's Twisted Vine, comes a story about Memphis, TN, a deadly faction of the Russian mafia and an innocent woman who dismantles an empire. Orphaned virgin Royal Stone is looking for employment in one of the country's toughest recessions. What she finds is the seven-foot, blonde millionaire Dmitry Medlov, who offers her a job as the manager of his new boutique Dmitry's Closet. After she accepts his job offer, she soon accepts his gifts, his bed and his lifestyle. What she does not know is that her knight in shining armor is also the head of the Medlov Organized Crime Family, a faction of the elite Russian mafia Vory v Zakone. Falling in love with the clueless Royal makes Dmitry want to break the code, leave his empire and start a life far away from the perils of the Thieves-in-Law. Only, his brother Ivan comes to the Memphis from New York City bent on a murderous revenge. With the FBI and Memphis Police Department working hard to build a case against Dmitry and his brother trying to kill him, he is forced to tell Royal of his true identity, but Royal also is keeping a secret - one that changes everything. Who will win? Who will lose? Who will die? Watch all the skeletons as they tumble out of the urban literature sensation Dmitry's Closet."], "author": "Latrivia S. Nelson", "num_pages": "364", "awards": [], "places": ["Memphis, Tennessee"], "character_names": [], "language": "English", "publish_date": "2010-01-01 00:00:00", "ISBN": "1616587458"},
{"url": "https://www.goodreads.com/book/show/18905120-being-plumville", "num_ratings": "868", "num_reviews": "85", "avg_ratings": 4.31, "genres": ["Romance", "Romance", "Interracial Romance", "Historical", "Cultural", "African American"], "title": "Being Plumville", "description": ["Plumville, Georgia had an order to its way of life, and few ever upset it.", "Benjamin Drummond is heir to all Plumville had to offer—wealth, good looks, and a promising career as a future state judge. As a graduating senior at a local college, he’s poised for success, if only he can keep his grades up. With the distractions of playing football, being in a fraternity, and havi", "Plumville, Georgia had an order to its way of life, and few ever upset it.", "Benjamin Drummond is heir to all Plumville had to offer—wealth, good looks, and a promising career as a future state judge. As a graduating senior at a local college, he’s poised for success, if only he can keep his grades up. With the distractions of playing football, being in a fraternity, and having his pick of the women on campus, he has little incentive to study—until his assigned tutor turns out to be a black girl from his past who'd never left his mind...or heart.", "Coralee Simmons is determined to make it out of Plumville with a diploma in her hand and dignity in her stride, despite a social climate determined to stifle both. And with her family and friends supporting her each step of the way, Coralee knows she will go far. Yet when her mentor provides a tutoring opportunity to increase her edge, she’s suddenly reunited with the white boy who'd meant too much to her as a child...and still did even now.", "Set during the turbulent 1960s, Benjamin and Coralee experience change in a community unprepared and unwelcoming of it. Can a relationship rekindle and bloom under such adversity, or will it succumb in the battle for Plumville's status quo?"], "author": "Savannah J. Frierson", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9272979-game-set-match", "num_ratings": "6,019", "num_reviews": "399", "avg_ratings": 3.51, "genres": ["Romance", "Fiction", "Business", "Amazon", "Romance", "Contemporary Romance"], "title": "Game, Set, Match", "description": ["Off the court, tennis star Jason Cartwright's playboy image is taking a public beating. On the court, he's down forty-love. A knee injury is shutting down his game, and the paparazzi are splashing his love life on every magazine. A comeback is in order, but the makeover he needs to save his faltering career is in the hands of the woman he loved and left fifteen years ago.", "Off the court, tennis star Jason Cartwright's playboy image is taking a public beating. On the court, he's down forty-love. A knee injury is shutting down his game, and the paparazzi are splashing his love life on every magazine. A comeback is in order, but the makeover he needs to save his faltering career is in the hands of the woman he loved and left fifteen years ago. ", "While single-mom, Izzy Connors, sees people for who they really are through the lens of her camera, even without it, she knows Jason isn't the star he appears to be. Although his charm and good looks haven't dimmed since he broke her heart, all she sees is his wasted talent and playboy lifestyle.", "Can Izzy put the past behind her and help Jason get his game, and his image, back on track? Or will the click of her camera shatter his world as well as his heart?"], "author": "Nana Malone", "num_pages": "354", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-10 00:00:00", "ISBN": "160154815X"},
{"url": "https://www.goodreads.com/book/show/17700010-falling-into-us", "num_ratings": "17,342", "num_reviews": "1,294", "avg_ratings": 4.24, "genres": ["New Adult", "Romance", "Romance", "Contemporary Romance", "Contemporary"], "title": "Falling into Us", "description": ["THE STORY YOU THOUGHT YOU KNEW...", "When Kyle Calloway died, he took a part of Nell with him. She wasn’t the only one left to pick up the pieces, however; Kyle’s death left a gaping hole in the hearts and lives of his parents and his older brother Colton, and ultimately broke the will of the girl he loved.", "THE STORY YOU NEVER IMAGINED...", "Becca de Rosa is Nell’s best friend. Whe", "THE STORY YOU THOUGHT YOU KNEW...", "When Kyle Calloway died, he took a part of Nell with him. She wasn’t the only one left to pick up the pieces, however; Kyle’s death left a gaping hole in the hearts and lives of his parents and his older brother Colton, and ultimately broke the will of the girl he loved.", "THE STORY YOU NEVER IMAGINED...", "Becca de Rosa is Nell’s best friend. When Kyle died, Nell was so devastated that no one could reach her, not even her best friend Becca. As she tries to help Nell through her grief, Becca’s own life is thrust into turmoil, and everything she knows is changed.", "Jason Dorsey asked Nell out the week after her sixteenth birthday, but that date never happened. Instead, he ended up going out with Nell’s best friend, Becca. He had no way of knowing, then, how that one date would send him on a life-long journey with Becca. He had no way of knowing the tragedies and triumphs he would experience, or that in Becca, he might find the love of a lifetime.", "THE HEARTACHE YOU’LL NEVER FORGET..."], "author": "Jasinda Wilder", "num_pages": "515", "awards": [], "places": [], "character_names": ["Becca De Rosa", "Jason Dorsey"], "language": "English", "publish_date": "2013-06-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13570721-wheels-of-steel", "num_ratings": "647", "num_reviews": "37", "avg_ratings": 4.25, "genres": ["Romance", "Disability", "Romance", "Interracial Romance", "Contemporary"], "title": "Wheels of Steel: Book 1", "description": ["Jason, better known as Top, is an up and coming DJ. He’s a white guy that knows more about Hip Hop than most and he also has cerebral palsy. His group Wheels of Steel is comprised of self-proclaimed misfits that are made cool by their talent. But despite his talent and popularity, Jason is plagued by issues of trust and anger.", "Robin is a shy black girl that takes a job as h", "Jason, better known as Top, is an up and coming DJ. He’s a white guy that knows more about Hip Hop than most and he also has cerebral palsy. His group Wheels of Steel is comprised of self-proclaimed misfits that are made cool by their talent. But despite his talent and popularity, Jason is plagued by issues of trust and anger.", "Robin is a shy black girl that takes a job as his home healthcare aid. Her crippling nervous condition makes everything difficult for her, not just her bad tempered client with cerebral palsy, but also his close knit friends, and even her mother with her best intentions. Their saga takes them along a musical journey of self-discovery and love.", "This three part interracial love story explores the spirit of love and acceptance between a person with an obvious disability—and someone whose disabilities are not always quite so obvious."], "author": "Pepper Pace", "num_pages": "405", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13644052-origin", "num_ratings": "74,400", "num_reviews": "7,010", "avg_ratings": 4.42, "genres": ["Young Adult", "Fantasy", "Paranormal", "Romance", "Science Fiction", "Aliens", "Fantasy", "Science Fiction"], "title": "Origin", "description": ["After the successful but disastrous raid on Mount Weather, he’s facing the impossible. Katy is gone. Taken. Everything becomes about finding her. Taking out anyone who stands in his way? Done. Burning down the whole world to save her? Gladly. Exposing his alien race to the world? With pleasure.", "Surrounded b", "After the successful but disastrous raid on Mount Weather, he’s facing the impossible. Katy is gone. Taken. Everything becomes about finding her. Taking out anyone who stands in his way? Done. Burning down the whole world to save her? Gladly. Exposing his alien race to the world? With pleasure.", "Surrounded by enemies, the only way she can come out of this is to adapt. After all, there are sides of Daedalus that don’t seem entirely crazy, but the group’s goals are frightening and the truths they speak even more disturbing. Who are the real bad guys? Daedalus? Mankind? Or the Luxen?", " ", "But the most dangerous foe has been there all along, and when the truths are exposed and the lies come crumbling down, which side will Daemon and Katy be standing on? "], "author": "Jennifer L. Armentrout", "num_pages": "364", "awards": [], "places": ["Nevada"], "character_names": [], "language": "English", "publish_date": "2013-08-27 00:00:00", "ISBN": "1622660757"},
{"url": "https://www.goodreads.com/book/show/36244101-catching-london", "num_ratings": "177", "num_reviews": "93", "avg_ratings": 3.97, "genres": ["Romance", "Contemporary Romance", "Romance", "New Adult", "Music", "Musicians"], "title": "Catching London", "description": ["Arlo Jones is a badass millionaire rock star with the world at his feet. He lives the “sex, drugs and rock ‘n’ roll” lifestyle to the max, and believes in working hard and playing harder. He’s a man who always gets what he wants, especially when it comes to women. Until he meets London.", "A", "Arlo Jones is a badass millionaire rock star with the world at his feet. He lives the “sex, drugs and rock ‘n’ roll” lifestyle to the max, and believes in working hard and playing harder. He’s a man who always gets what he wants, especially when it comes to women. Until he meets London.", "All London Llwellyn wants is to rebuild her life following the tragic car accident that robbed her of her fiancé, and ended her career as a professional ballet dancer. She’s working two jobs to scrape together the cash to set up her own studio, and reinvent herself as a photographer. The last thing she wants is to get involved. ", "Arlo promises to always be there to catch her, but can London trust him enough to let herself fall?"], "author": "M.V. Ellis", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-02-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13158221-player-s-ultimatum", "num_ratings": "1,087", "num_reviews": "61", "avg_ratings": 3.8, "genres": ["Sports and Games", "Sports", "Romance", "Romance", "Interracial Romance", "Adult Fiction", "Erotica", "Contemporary", "Contemporary Romance", "Sports Romance", "Romance", "Contemporary Romance"], "title": "Player's Ultimatum", "description": ["Yvonne Floyd’s best friend and gay soccer player Robbie Gutierrez proposes the impossible-pose as his fiancée until he can ink a lucrative contract. Hounded day and night by the media’s constant speculation over his sexual orientation, Robbie doesn’t want to run the risk of losing his career over who he sleeps with. Although Yvonne feels Robbie has lost his marbles, she ta", "Yvonne Floyd’s best friend and gay soccer player Robbie Gutierrez proposes the impossible-pose as his fiancée until he can ink a lucrative contract. Hounded day and night by the media’s constant speculation over his sexual orientation, Robbie doesn’t want to run the risk of losing his career over who he sleeps with. Although Yvonne feels Robbie has lost his marbles, she takes one for the team.", "While Yvonne is initiated into the fast-paced world of international soccer, she’s ill-prepared for a mutual attraction to Robbie’s teammate, Paolo Saito. And when the Japanese Brazilian footballer discovers her secret and turns the tables on her, Yvonne loses sight of her goal and risks sacrificing more than just her heart."], "author": "Koko Brown", "num_pages": "285", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-11-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17200687-rule", "num_ratings": "87,407", "num_reviews": "5,577", "avg_ratings": 4.15, "genres": ["New Adult", "Romance", "Romance", "Contemporary Romance", "Academic", "College", "Did Not Finish", "Young Adult", "Womens Fiction", "Chick Lit", "Adult", "Adult Fiction", "Erotica", "Fiction"], "title": "Rule", "description": ["Shaw Landon loved Rule Archer from the moment she laid eyes on him. Rule is everything a straight-A pre-med student like Shaw shouldn’t want—and the only person she’s never tried to please. She isn’t afraid of his scary piercings and tattoos or his wild attitude. Though she knows that Rule is wrong for her, her heart", "Shaw Landon loved Rule Archer from the moment she laid eyes on him. Rule is everything a straight-A pre-med student like Shaw shouldn’t want—and the only person she’s never tried to please. She isn’t afraid of his scary piercings and tattoos or his wild attitude. Though she knows that Rule is wrong for her, her heart just won’t listen.", "To a rebel like Rule Archer, Shaw Landon is a stuck-up, perfect princess-and his dead twin brother’s girl. She lives by other people’s rules; he makes his own. He doesn’t have time for a good girl like Shaw-even if she’s the only one who can see the person he truly is.", "But a short skirt, too many birthday cocktails, and spilled secrets lead to a night neither can forget. Now, Shaw and Rule have to figure out how a girl like her and a guy like him are supposed to be together without destroying their love . . . or each other."], "author": "Jay Crownover", "num_pages": "369", "awards": [], "places": ["Denver, Colorado", "Colorado"], "character_names": ["Shaw Landon", "Rule Archer"], "language": "English", "publish_date": "2012-12-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16081136-fifty-shades-of-jungle-fever", "num_ratings": "1,044", "num_reviews": "180", "avg_ratings": 4.03, "genres": ["Erotica", "Bdsm", "Romance", "Interracial Romance", "Romance", "Adult Fiction", "Erotica", "Romance", "Contemporary Romance"], "title": "Fifty Shades of Jungle Fever", "description": ["The Best Parody of The #1 Bestseller In Its Genre", "Get your unique take on the fastest-selling book ever! ", "Keisha Beale, a street-wise Chicago south-sider two years out of DePaul University, is a quarter million dollars in start-up capital away from realizing her dream of owning a recording studio/record store. She takes the place of her more business-savvy partner in a meeti", "The Best Parody of The #1 Bestseller In Its Genre", "Get your unique take on the fastest-selling book ever! ", "Keisha Beale, a street-wise Chicago south-sider two years out of DePaul University, is a quarter million dollars in start-up capital away from realizing her dream of owning a recording studio/record store. She takes the place of her more business-savvy partner in a meeting with Tristan White himself, the venture capitalist they've targeted to fund their business.", "A bi-racial--African American and Brazilian--woman with a troubled past, Keisha has been so focused on her business pursuits that her love life has been non-existent. Tristan White is the devastatingly handsome, 32-year old CEO of White Enterprises, the firm he built using only the inheritance his mother left him to prove to his father he had the mettle to do it alone. He comes from a long line of wealth, and lives the life of a \"one-percenter\" on Chicago's Gold Coast. Tristan is accustomed to controlling every aspect of his life given his birth into a world of white privilege.", "50 Shades To The 2nd Power ...", "When Keisha and Tristan's worlds collide, sparks fly, and a fever is ignited in them both that they have never experienced before. It turns out they each have secrets, but together, in the unorthodox arrangement Tristan proposes, they discover passions they never knew they had.", "... Meets Keisha From The Block!", "The Ghetto Girl title is, in all truthfulness, a misnomer. Keisha Beale is a highly-educated young woman who just happens to have been born on the other side of the socio-economic tracks. She embraces all of who she is, and navigates almost effortlessly in both worlds.", "Erotic, amusing, and in places hilarious, the Ghetto Girl Romance Quadrilogy is a parody with a new take on a Fifty Shades type story that will take you even further into the BDSM world, and promises to make the vanilla original Fifty Shades more colorful.", "Grab your copy today!", "Top 100 Drama USA", "Top 100 IR/MC", "Top 100 African American"], "author": "L.V. Lewis", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-01 00:00:00", "ISBN": "1479332321"},
{"url": "https://www.goodreads.com/book/show/19022381-only-her-heart", "num_ratings": "61", "num_reviews": "5", "avg_ratings": 3.75, "genres": ["Romance", "Romance", "Interracial Romance"], "title": "Only Her Heart", "description": ["Holding the pieces of her drama riddled life, Jade decides to leave her disappointments in the past and move on. When her aunt opens up about a family secret, she realizes that everyone else seems to do what they please. Well, now so will she. Building life from the ground up isn’t easy, but with the right friends, she creates the life of her once forgotten dreams. ", "At the", "Holding the pieces of her drama riddled life, Jade decides to leave her disappointments in the past and move on. When her aunt opens up about a family secret, she realizes that everyone else seems to do what they please. Well, now so will she. Building life from the ground up isn’t easy, but with the right friends, she creates the life of her once forgotten dreams. ", "At the crux of an intense love tug-o-war, the one question she must answer is which man will play the lead role? Will Julian, the ‘bad boy’ who mysteriously walks back into her life manage to win her heart? Will she find forgiveness and a happy ending with John, Mr. “almost perfect’? Maybe there is someone new on the horizon that she can start fresh with. Life is never simple for Jade, but when she listens to her heart, she begins to open doors to a whole new world. ", "With new friends, and new exciting adventures, Jade is growing into a woman that she is proud of. The real question she needs to figure out is? What does she want her life to become?"], "author": "Olivia Linden", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17373212-jaded-hearts", "num_ratings": "107", "num_reviews": "21", "avg_ratings": 3.81, "genres": ["Adult Fiction", "Erotica", "Romance", "Romance", "Interracial Romance"], "title": "Jaded Hearts", "description": ["Book 1 of The Jaded Hearts Club: *This book contains content of a graphic nature. 18 and over suggested.*", "1. Jaded", "The end result of having a steady flow of negative experiences, disappointment, and unfulfillment, fed into a person where they get to the point where their anger circuits just sort of burn out and they accept disillusionment.", "************************************", "Book 1 of The Jaded Hearts Club: *This book contains content of a graphic nature. 18 and over suggested.*", "1. Jaded", "The end result of having a steady flow of negative experiences, disappointment, and unfulfillment, fed into a person where they get to the point where their anger circuits just sort of burn out and they accept disillusionment.", "****************************************************************************************************************************", "Jaded Hearts is not a typical love story. It's Jade's story, filled with moments of love, lust, heartache, and confusion. She has been jaded, by certain circumstances in her life, but she is determined to find her way. This is a tale of her coming of age. It may not always be pretty, but you won't want to look away! ", "*****************************************************************************", "24 year-old Jade Spencer is at a crossroads. She has spent her entire life living under the shadow of someone else's rule. First, her controlling grandmother, who unwillingly inherited the job of raising her and her brother Drew. Then, her fiance Evan, who was also controlling. Notice a theme? Now she is ready to live life by her own rules. She breaks it off with her shady fiance, and packs her bags for good. What better place to follow your dreams and desires than New York City? ", "With help from her Aunt Vivian; her cousin Jackie; a new place; new job, and new experiences waiting, she intends to live life to the fullest. But, things turn tricky when two fated encounters both lead to powerful emotions. Julian Garza is the most desirable, and haunting man Jade has ever met. He sets her on fire from their very first chance encounter. Jade finds him totally irresistible, and promptly falls under his spell. But there is a dark shadow attached to Julian that leaves Jade hesitant, and has her aunt telling her to run. John Benson is the perfect man. A handsome, successful lawyer; John provides a friendship like no other, and a love that Jade has never known. For the first time she feels truly loved, but we all know there is no such thing as perfect. ", "So you have a not so classic love triangle, with a hint of mystery. What could possibly be the problem? Jade doesn't believe in love, and lives by denial. Being abandoned by her mother at a young age has left her with a hard shell around her heart, an an even harder time letting her feelings show. As she tries to find herself through her new relationships, Jade learns the hard way that sometimes intentions mean everything, and nothing at all. Will she find love or will she leave a trail of jaded hearts? Love, secrets, and lies are all on the menu.", "****************************************************************************", "Join the Jaded Hearts Club on Facebook:"], "author": "Olivia Linden", "num_pages": "368", "awards": [], "places": ["New York City, New York"], "character_names": ["Drew \"The Bro\"", "Jackie “The Confidant”", "Julian “The Reformed Playboy”", "JOHN “NOT JUST THE FRIEND”"], "language": "English", "publish_date": "2013-02-10 00:00:00", "ISBN": "147932518X"},
{"url": "https://www.goodreads.com/book/show/18866047-maze", "num_ratings": "283", "num_reviews": "56", "avg_ratings": 4.17, "genres": ["Romance", "Interracial Romance", "New Adult", "Romance", "Contemporary", "Warfare", "Fighters"], "title": "Maze", "description": ["There are times in life when you have to make decisions that others will neither understand nor forgive. When that happens, then you make damn sure they never find out. But no matter what, you will do anything to protect those you love. Even if it means you forfeit your soul.", "He’s keeping something from me. And I’m not sure I want to know because it will forever chan", "There are times in life when you have to make decisions that others will neither understand nor forgive. When that happens, then you make damn sure they never find out. But no matter what, you will do anything to protect those you love. Even if it means you forfeit your soul.", "He’s keeping something from me. And I’m not sure I want to know because it will forever change us."], "author": "Ursula Sinclair", "num_pages": "150", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-27 00:00:00", "ISBN": "9780985964"},
{"url": "https://www.goodreads.com/book/show/16039376-taken-by-moonlight", "num_ratings": "1,040", "num_reviews": "93", "avg_ratings": 4.15, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance", "Paranormal", "Shapeshifters", "Shapeshifters", "Werewolves", "Fantasy"], "title": "Taken By Moonlight", "description": ["When she agreed to go camping with her twin to honor a birthday milestone, Vivienne Bordeaux imagined itchy mosquito bites, the possibility of West Nile, and perhaps foot-fungus, but she never anticipated just how much her life would change. After almost dying under the snapping jaws of a rabid wolf—go figure—Vivienne is saved by a gorgeous, dark-haired man, who may just b", "When she agreed to go camping with her twin to honor a birthday milestone, Vivienne Bordeaux imagined itchy mosquito bites, the possibility of West Nile, and perhaps foot-fungus, but she never anticipated just how much her life would change. After almost dying under the snapping jaws of a rabid wolf—go figure—Vivienne is saved by a gorgeous, dark-haired man, who may just belong to a cult. Her attraction to Conall is strong, and she’s unable to control it, especially when he’s touching her….", "Conall Athelwulf is no man. He’s a werewolf, the leader of the largest pack in New York, and he knows better than anyone that relationships between weres and humans are strictly forbidden. So why is he unable to get beautiful, but very human, Vivienne Bordeaux out of his system? Amidst fears he’ll hurt her, Conall soon realizes that laws be damned, he’s unwilling to let her go. Instinct tells him Vivienne is his in every sense of the word, and a smart wolf heeds his instincts. ", "When others threaten his claim, Conall is determined to teach them the hard way: fists or claws. But Vivienne isn’t as she seems, and both parties soon find themselves at the center of an epic war, where Vivienne may be key to the salvation of an entire race."], "author": "Violette Dubrinsky", "num_pages": "494", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16281159-the-space-between", "num_ratings": "1,118", "num_reviews": "191", "avg_ratings": 3.71, "genres": ["New Adult", "Romance", "Contemporary"], "title": "The Space Between", "description": ["When Drake started the night at his father’s campaign fundraiser, he never imagined he’d end it being conned into buying drugs on the West Side. Losing high-stakes poker has its consequences, but he’d repeatedly face them just to hear Lacey Douglas sing. Drake sees Lacey light up the stage, and he has to have her. But his intentions for being on her side of town turn out t", "When Drake started the night at his father’s campaign fundraiser, he never imagined he’d end it being conned into buying drugs on the West Side. Losing high-stakes poker has its consequences, but he’d repeatedly face them just to hear Lacey Douglas sing. Drake sees Lacey light up the stage, and he has to have her. But his intentions for being on her side of town turn out to be the reason he can’t. ", "Chicago native Lacey has dreams of the opera, but life has its obstacles. Lacey has come to know her hardships as part of living in the real world and accepts them fully. When Lacey meets the intense and invigorating Drake, a fire is lit inside her, unleashing those dreams again.", "Two paths that should have never crossed prove to create the exact pairing the other needs. But when their worlds take time to catch up, everything they have is tested. Finding the space between the two sides that challenge them will be hard, but it’s the only place that will keep them together.", "The Space Between is a new adult contemporary romance."], "author": "Victoria H. Smith", "num_pages": "324", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-13 00:00:00", "ISBN": "1482349175"},
{"url": "https://www.goodreads.com/book/show/18143032-the-ballerina-the-fighter", "num_ratings": "830", "num_reviews": "119", "avg_ratings": 3.69, "genres": ["New Adult", "Romance", "Warfare", "Fighters", "Contemporary", "Romance", "Interracial Romance", "Sports and Games", "Sports"], "title": "The Ballerina & the Fighter", "description": ["I travel through life dancing.", "All I ever wanted to do was dance, as did my best friend. We'd made so many plans together, but one night an explosion changed it all. Only one of us survived, and I promised myself I'd succeed for us both. And I did, until an accident almost ruined my career, but Maze came back into my life when I needed him most. He pulled me out of the dept", "I travel through life dancing.", "All I ever wanted to do was dance, as did my best friend. We'd made so many plans together, but one night an explosion changed it all. Only one of us survived, and I promised myself I'd succeed for us both. And I did, until an accident almost ruined my career, but Maze came back into my life when I needed him most. He pulled me out of the depths of my despair. But could I save him now?", "I travel through life fighting.", "It had always been Ivy; from the first moment I saw her leaping through the air like she had wings to lift her from the ground. But she was my dream, something I wanted more than anything else in my life. I promised myself I would stay away from her. Violence followed me everywhere and I tried to keep her far away from it. She was my point of illumination in the dark tumultuous world I lived in. But I could not stay away from her. Not when I knew she needed me. As much as I needed her. But could she accept me as I am?", "New Adult Contemporary 18+"], "author": "Ursula Sinclair", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-01 00:00:00", "ISBN": "0985964626"}
]