[
{"url": "https://www.goodreads.com/book/show/991197.The_Complete_Persepolis", "num_ratings": "89,753", "num_reviews": "6,206", "avg_ratings": 4.38, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "The Complete Persepolis", "description": ["Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.", " is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years", "Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.", " is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years in Vienna facing the trials of adolescence far from her family; of her homecoming--both sweet and terrible; and, finally, of her self-imposed exile from her beloved homeland. It is the chronicle of a girlhood and adolescence at once outrageous and familiar, a young life entwined with the history of her country yet filled with the universal trials and joys of growing up.", "Edgy, searingly observant, and candid, often heartbreaking but threaded throughout with raw humor and hard-earned wisdom--", " is a stunning work from one of the most highly regarded, singularly talented graphic artists at work today."], "author": "Marjane Satrapi", "num_pages": "341", "awards": [], "places": ["Vienna", "Iran", "Tehran"], "character_names": ["Rezā Shāh", "Marjane Satrapi", "Taji Chaltchi Satrapi", "Ebi Satrapi", "Grandma Chaltchi", "Anoosh Satrapi", "Taher Chaltchi", "Siamak Jari", "Mohsen Shakjiba", "Laly Jari", "Ahmadi", "Fereydoon Satrapi", "Kaveh", "Entezami", "Mali (Persepolis)", "Mehri", "Hossein (Bee Gees)", "Mrs. Nasrine", "Peyman", "Shahab", "Tinoosh", "Dr. Fathi", "Khosro (Persepolis)", "Niloufar", "Mardana", "Neda Baba-Levy", "Sherrie", "Zozo (Persepolis)"], "language": "English", "publish_date": "2007-10-30 00:00:00", "ISBN": "0375714839"},
{"url": "https://www.goodreads.com/book/show/290382.Salt_and_Saffron", "num_ratings": "1,221", "num_reviews": "103", "avg_ratings": 3.45, "genres": ["Fiction", "Cultural", "Pakistan", "Historical", "Historical Fiction", "Cultural", "Asia"], "title": "Salt and Saffron", "author": "Kamila Shamsie", "num_pages": "256", "awards": [], "places": [], "character_names": ["Samia Savage", "Aliya", "Khaleel", "Mariam Apa"], "language": "English", "publish_date": "2002-05-15 00:00:00", "ISBN": "158234261X"},
{"url": "https://www.goodreads.com/book/show/10996605-women-without-men", "num_ratings": "1,706", "num_reviews": "184", "avg_ratings": 3.58, "genres": ["Fiction", "Cultural", "Iran", "Feminism", "Magical Realism", "Novels", "Literature"], "title": "Women Without Men: A Novel of Modern Iran", "author": "Shahrnush Parsipur", "num_pages": "122", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-10 00:00:00", "ISBN": "1558617531"},
{"url": "https://www.goodreads.com/book/show/115033.The_Faith_Club", "num_ratings": "4,807", "num_reviews": "868", "avg_ratings": 3.76, "genres": ["Religion", "Nonfiction", "Autobiography", "Memoir", "Spirituality"], "title": "The Faith Club: A Muslim, A Christian, A Jew--Three Women Search for Understanding", "description": ["\"\"Welcome to the Faith Club. We're three mothers from three faiths -- Islam, Christianity, and Judaism -- who got together to write a picture book for our children that would highlight the connections between our religions. But no sooner had we started talking about our beliefs and how to explain them to our children than our differences led to misunderstandings. Our proje", "\"\"Welcome to the Faith Club. We're three mothers from three faiths -- Islam, Christianity, and Judaism -- who got together to write a picture book for our children that would highlight the connections between our religions. But no sooner had we started talking about our beliefs and how to explain them to our children than our differences led to misunderstandings. Our project nearly fell apart.\"\"After September 11th, Ranya Idliby, an American Muslim of Palestinian descent, faced constant questions about Islam, God, and death from her children, the only Muslims in their classrooms. Inspired by a story about Muhammad, Ranya reached out to two other mothers -- a Christian and a Jew -- to try to understand and answer these questions for her children. After just a few meetings, however, it became clear that the women themselves needed an honest and open environment where they could admit -- and discuss -- their concerns, stereotypes, and misunderstandings about one another. After hours of soul-searching about the issues that divided them, Ranya, Suzanne, and Priscilla grew close enough to discover and explore what united them.", "\"The Faith Club\" is a memoir of spiritual reflections in three voices that will make readers feel as if they are eavesdropping on the authors' private conversations, provocative discussions, and often controversial opinions and conclusions. The authors wrestle with the issues of anti-Semitism, prejudice against Muslims, and preconceptions of Christians at a time when fundamentalists dominate the public face of Christianity. They write beautifully and affectingly of their families, their losses and grief, their fears and hopes for themselves and their loved ones. And as the authors reveal their deepest beliefs, readers watch the blossoming of a profound interfaith friendship and the birth of a new way of relating to others.", "In a final chapter, they provide detailed advice on how to start a faith club: the questions to ask, the books to read, and most important, the open-minded attitude to maintain in order to come through the experience with an enriched personal faith and understanding of others.", "Pioneering, timely, and deeply thoughtful, \"The Faith Club\"'s caring message will resonate with people of all faiths.", "For more information or to start your own faith club visit "], "author": "Ranya Tabari Idliby", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-03 00:00:00", "ISBN": "074329047X"},
{"url": "https://www.goodreads.com/book/show/9525.Chicken_with_Plums", "num_ratings": "9,609", "num_reviews": "844", "avg_ratings": 3.84, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "Cultural", "Iran", "Autobiography", "Memoir", "Biography"], "title": "Chicken with Plums", "description": ["In November 1955, Nasser Ali Khan, one of Iran's most celebrated tar players, is in search of a new instrument. His beloved tar has been broken. But no matter what tar he tries, none of them sound right. Brokenhearted, Nasser Ali Khan decides that life is no longer worth living. He takes to his bed, renouncing the world and all of its pleasures. This is the story of the ei", "In November 1955, Nasser Ali Khan, one of Iran's most celebrated tar players, is in search of a new instrument. His beloved tar has been broken. But no matter what tar he tries, none of them sound right. Brokenhearted, Nasser Ali Khan decides that life is no longer worth living. He takes to his bed, renouncing the world and all of its pleasures. This is the story of the eight days he spends preparing to surrender his soul."], "author": "Marjane Satrapi", "num_pages": "84", "awards": ["Prix du Festival d'Angoulême for meilleur album (2005)"], "places": ["Iran"], "character_names": ["Nasser Ali"], "language": "English", "publish_date": "2006-10-03 00:00:00", "ISBN": "0375424156"},
{"url": "https://www.goodreads.com/book/show/358627.Women_of_Sand_and_Myrrh", "num_ratings": "892", "num_reviews": "121", "avg_ratings": 3.23, "genres": ["Fiction", "Feminism", "Literature", "Womens"], "title": "Women of Sand and Myrrh", "description": ["A powerful and moving novel, by the Arab world's leading woman novelist, about four women coping with the insular, oppressive society of an unnamed desert state."], "author": "Hanan Al-Shaykh", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-07-01 00:00:00", "ISBN": "0385423586"},
{"url": "https://www.goodreads.com/book/show/101025.Iran_Awakening", "num_ratings": "3,877", "num_reviews": "467", "avg_ratings": 4.13, "genres": ["Nonfiction", "Cultural", "Iran", "Autobiography", "Memoir", "Biography", "History"], "title": "Iran Awakening: From Prison to Peace Prize: One Woman's Struggle at the Crossroads of History", "description": ["The moving, inspiring memoir of one of the great women of our times, Shirin Ebadi, winner of the 2003 Nobel Peace Prize and advocate for the oppressed, whose spirit has remained strong in the face of political persecution and despite the challenges she has faced raising a family while pursuing her work. ", "Best known in this country as the lawyer working tirelessly on behalf", "The moving, inspiring memoir of one of the great women of our times, Shirin Ebadi, winner of the 2003 Nobel Peace Prize and advocate for the oppressed, whose spirit has remained strong in the face of political persecution and despite the challenges she has faced raising a family while pursuing her work. ", "Best known in this country as the lawyer working tirelessly on behalf of Canadian photojournalist, Zara Kazemi – raped, tortured and murdered in Iran – Dr. Ebadi offers us a vivid picture of the struggles of one woman against the system. The book movingly chronicles her childhood in a loving, untraditional family, her upbringing before the Revolution in 1979 that toppled the Shah, her marriage and her religious faith, as well as her life as a mother and lawyer battling an oppressive regime in the courts while bringing up her girls at home.", "Outspoken, controversial, Shirin Ebadi is one of the most fascinating women today. She rose quickly to become the first female judge in the country; but when the religious authorities declared women unfit to serve as judges she was demoted to clerk in the courtroom she had once presided over. She eventually fought her way back as a human rights lawyer, defending women and children in politically charged cases that most lawyers were afraid to represent. She has been arrested and been the target of assassination, but through it all has spoken out with quiet bravery on behalf of the victims of injustice and discrimination and become a powerful voice for change, almost universally embraced as a hero.", "Her memoir is a gripping story – a must-read for anyone interested in Zara Kazemi’s case, in the life of a remarkable woman, or in understanding the political and religious upheaval in our world."], "author": "Shirin Ebadi", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-10 00:00:00", "ISBN": "0676978037"},
{"url": "https://www.goodreads.com/book/show/7890152-denyut-kasih-medik", "num_ratings": "846", "num_reviews": "67", "avg_ratings": 4.14, "genres": ["Fiction", "Novels"], "title": "Denyut Kasih Medik", "description": ["Sebuah novel yang mengisahkan misi seorang doktor muda dalam memperjuangkan syariat Islam di hospital ketika bergelar doktor pelatih (houseman). Ia juga kisah masyarakat kerana menyentuh isu-isu perubatan dalam kehidupan masyarakat. Bukan itu sahaja, ia kisah seorang pemuda yang hidupnya sarat impian dan cita-cita. Lebih menarik, ia bukan hanya menyentuh fiqh perubatan bah", "Sebuah novel yang mengisahkan misi seorang doktor muda dalam memperjuangkan syariat Islam di hospital ketika bergelar doktor pelatih (houseman). Ia juga kisah masyarakat kerana menyentuh isu-isu perubatan dalam kehidupan masyarakat. Bukan itu sahaja, ia kisah seorang pemuda yang hidupnya sarat impian dan cita-cita. Lebih menarik, ia bukan hanya menyentuh fiqh perubatan bahkan turut menyelitkan fiqh wanita dan fiqh cinta. ...Nikmatilah satu kisah indah yang sungguh membina, Denyut Kasih Medik."], "author": "Farhan Hadi Mohd Taib", "num_pages": "390", "awards": [], "places": [], "character_names": [], "language": "Malay", "publish_date": "2010-02-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7013524-honeymoon-in-tehran", "num_ratings": "1,632", "num_reviews": "223", "avg_ratings": 3.79, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Iran", "Travel", "Biography Memoir", "Biography"], "title": "Honeymoon in Tehran: Two Years of Love and Danger in Iran", "description": ["Azadeh Moaveni, longtime Middle East correspondent for Time magazine, returns to Iran to cover the rise of President Mahmoud Ahmadinejad. Living and working in Tehran, she finds a nation that openly yearns for freedom and contact with the West but whose economic grievances and nationalist spirit find an outlet in Ahmadinejad’s strident pronouncements. And then the unexpect", "Azadeh Moaveni, longtime Middle East correspondent for Time magazine, returns to Iran to cover the rise of President Mahmoud Ahmadinejad. Living and working in Tehran, she finds a nation that openly yearns for freedom and contact with the West but whose economic grievances and nationalist spirit find an outlet in Ahmadinejad’s strident pronouncements. And then the unexpected happens: Azadeh falls in love with a young Iranian man and decides to get married and start a family in Tehran. Suddenly, she finds herself navigating an altogether different side of Iranian life. As women are arrested for “immodest dress” and the authorities unleash a campaign of intimidation against journalists, Azadeh is forced to make the hard decision that her family’s future lies outside Iran. Powerful and poignant, ", " is the harrowing story of a young woman’s tenuous life in a country she thought she could change."], "author": "Azadeh Moaveni", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "0812977904"},
{"url": "https://www.goodreads.com/book/show/432267.Pillars_of_Salt", "num_ratings": "416", "num_reviews": "49", "avg_ratings": 3.75, "genres": ["Fiction", "Historical", "Historical Fiction", "Literature"], "title": "Pillars of Salt", "description": [" is the story of two women confined in a mental hospital in Jordan during and after the British Mandate. After initial tensions they become friends and share their life stories."], "author": "Fadia Faqir", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-10-01 00:00:00", "ISBN": "1566562538"},
{"url": "https://www.goodreads.com/book/show/3070131-the-muslim-next-door", "num_ratings": "409", "num_reviews": "69", "avg_ratings": 3.68, "genres": ["Religion", "Nonfiction", "Religion", "Islam", "History"], "title": "The Muslim Next Door: The Qurʼan, the Media, and That Veil Thing", "description": ["- Bronze Medal Winner of the Independent Publishers Award 2009 -", "Since 9/11, stories about Muslims and the Islamic world have flooded headlines, politics, and water-cooler conversations all across the country. And, although Americans hear about Islam on a daily basis, there remains no clear explanation of Islam or its people. ", " offers easy-to-understand y", "- Bronze Medal Winner of the Independent Publishers Award 2009 -", "Since 9/11, stories about Muslims and the Islamic world have flooded headlines, politics, and water-cooler conversations all across the country. And, although Americans hear about Islam on a daily basis, there remains no clear explanation of Islam or its people. ", " offers easy-to-understand yet academically sound answers to these questions while also dispelling commonly held misconceptions. Written from the point of view of an American Muslim, the book addresses what readers in the Western world are most curious about, beginning with the basics of Islam and how Muslims practice their religion before easing into more complicated issues like jihad, Islamic fundamentalism, and the status of women in Islam. Author Sumbul Ali-Karamali’s vivid anecdotes about growing up Muslim and female in the West, along with her sensitive, scholarly overview of Islam, combine for a uniquely insightful look at the world’s fastest growing religion."], "author": "Sumbul Ali-Karamali", "num_pages": "287", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "0974524565"},
{"url": "https://www.goodreads.com/book/show/14531164-the-hijabi-club", "num_ratings": "14", "num_reviews": "2", "avg_ratings": 4.07, "genres": ["Religion", "Islam", "Islam", "Muslims"], "title": "The Hijabi Club", "description": ["Josephine and Yasmeen are Muslim American girls living in Orange County, California. Josephine is co-founder of the Interfaith Club at her school. She is an outgoing teenager who loves hosting slumber parties with her friends, working on community service projects, coming up with fun ideas, and trying to live the way God wants her to live. A Caucasian American, Josephine l", "Josephine and Yasmeen are Muslim American girls living in Orange County, California. Josephine is co-founder of the Interfaith Club at her school. She is an outgoing teenager who loves hosting slumber parties with her friends, working on community service projects, coming up with fun ideas, and trying to live the way God wants her to live. A Caucasian American, Josephine lives with her single mom.Yasmeen is Arab American and the oldest of five children. She wants to live the teenage dream before she graduates from high school. She does not agree with how her family has raised her, and thinks it is unfair that she doesn't get to experience the freedom other kids her age enjoy. She can't wait to graduate and move away from home. Her goal is to become a cosmetologist.This delightful novel is filled with fun, happiness and heartaches, trials and turmoil, and important life lessons that Josephine, Yasmeen, and their friends experience throughout their teenage years. Josephine and Yasmeen come from distinctly different backgrounds, but they join their girlfriends every Friday night for great times in The Hijabi Club!"], "author": "Shaylene Haswar", "num_pages": "444", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-31 00:00:00", "ISBN": "1600476473"},
{"url": "https://www.goodreads.com/book/show/9517.Persepolis_2", "num_ratings": "52,906", "num_reviews": "2,239", "avg_ratings": 4.24, "genres": ["Sequential Art", "Graphic Novels", "Nonfiction", "Sequential Art", "Comics", "Autobiography", "Memoir", "Biography"], "title": "Persepolis 2: The Story of a Return", "description": ["In", ", heralded by the ", " as \"one of the freshest and most original memoirs of our day,\" Marjane Satrapi dazzled us with her heartrending memoir-in-comic-strips about growing up in Iran during the Islamic Revolution. Here is the continuation of her fascinating story. In 1984, Marjane flees fundamentalism and the war with Iraq to begin a new life in V", "In", ", heralded by the ", " as \"one of the freshest and most original memoirs of our day,\" Marjane Satrapi dazzled us with her heartrending memoir-in-comic-strips about growing up in Iran during the Islamic Revolution. Here is the continuation of her fascinating story. In 1984, Marjane flees fundamentalism and the war with Iraq to begin a new life in Vienna. Once there, she faces the trials of adolescence far from her friends and family, and while she soon carves out a place for herself among a group of fellow outsiders, she continues to struggle for a sense of belonging.", "Finding that she misses her home more than she can stand, Marjane returns to Iran after graduation. Her difficult homecoming forces her to confront the changes both she and her country have undergone in her absence and her shame at what she perceives as her failure in Austria. Marjane allows her past to weigh heavily on her until she finds some like-minded friends, falls in love, and begins studying art at a university. However, the repression and state-sanctioned chauvinism eventually lead her to question whether she can have a future in Iran.", "As funny and poignant as its predecessor, ", " is another clear-eyed and searing condemnation of the human cost of fundamentalism. In its depiction of the struggles of growing up--here compounded by Marjane's status as an outsider both abroad and at home--it is raw, honest, and incredibly illuminating."], "author": "Marjane Satrapi", "num_pages": "187", "awards": ["Prix du Festival d'Angoulême for Alph-art du meilleur scenario (2002)"], "places": ["Tehran", "Vienna"], "character_names": [], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "0375714669"},
{"url": "https://www.goodreads.com/book/show/16066887-painted-hands", "num_ratings": "334", "num_reviews": "83", "avg_ratings": 3.96, "genres": ["Fiction", "Religion", "Womens Fiction", "Chick Lit", "Islam", "Muslims", "Romance", "Feminism"], "title": "Painted Hands", "description": ["Muslim bad girl Zainab Mir has just landed a job working for a post-feminist, Republican Senate candidate. Her best friend Amra Abbas is about to make partner at a top Boston law firm. Together they’ve thwarted proposal-slinging aunties, cultural expectations, and the occasional bigot to succeed in their careers. What they didn’t count on? Unlikely men and geopolitical fir", "Muslim bad girl Zainab Mir has just landed a job working for a post-feminist, Republican Senate candidate. Her best friend Amra Abbas is about to make partner at a top Boston law firm. Together they’ve thwarted proposal-slinging aunties, cultural expectations, and the occasional bigot to succeed in their careers. What they didn’t count on? Unlikely men and geopolitical firestorms.", "When a handsome childhood friend reappears, Amra makes choices that Zainab considers so 1950s—choices that involve the perfect ", "silk dress and a four-bedroom house in the suburbs. After hiding her long work hours during their courtship, Amra struggles to balance her demanding job and her unexpectedly traditional new husband.", "Zainab has her own problems. She generates controversy in the Muslim community with a suggestive magazine spread and friendship with a gay reporter. Her rising profile also inflames neocons like Chase Holland, the talk radio host who attacks her religion publicly but privately falls for her hard. When the political fallout from a terrorist attempt jeopardizes Zainab's job and protests surrounding a woman-led Muslim prayer service lead to violence, Amra and Zainab must decide what they’re willing to risk for their principles, their friendship, and love."], "author": "Jennifer Zobair", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-06-11 00:00:00", "ISBN": "1250027012"},
{"url": "https://www.goodreads.com/book/show/7024191-between-two-worlds", "num_ratings": "2,336", "num_reviews": "308", "avg_ratings": 4.19, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Between Two Worlds", "description": ["Zainab Salbi was eleven years old when her father was chosen to be Saddam Hussein's personal pilot and her family's life was grafted onto his. Her mother, the beautiful Alia, taught her daughter the skills she needed to survive. A plastic smile. Saying yes. Burying in boxes in her mind the horrors she glimpsed around her. \"Learn to erase your memories,\" she instructed. \"He", "Zainab Salbi was eleven years old when her father was chosen to be Saddam Hussein's personal pilot and her family's life was grafted onto his. Her mother, the beautiful Alia, taught her daughter the skills she needed to survive. A plastic smile. Saying yes. Burying in boxes in her mind the horrors she glimpsed around her. \"Learn to erase your memories,\" she instructed. \"He can read eyes.\" "], "author": "Zainab Salbi", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-17 00:00:00", "ISBN": "1436297249"},
{"url": "https://www.goodreads.com/book/show/28371545-hijabi-girl", "num_ratings": "9", "num_reviews": "6", "avg_ratings": 4.44, "genres": [], "title": "Hijabi Girl", "description": ["Junior chapter book for 8-ish readers.", "Melek is the imaginative problem-solver. ", "Unable to find a book character in a hijab for the Book Parade, Melek writes her own, with a bit of help from Tien.", "Melek always finds answers, some are under her super hijab. For others she needs the help of newcomer Tien who draws fantastic worlds as an escape , dress-ups-guru Lily or even socc", "Junior chapter book for 8-ish readers.", "Melek is the imaginative problem-solver. ", "Unable to find a book character in a hijab for the Book Parade, Melek writes her own, with a bit of help from Tien.", "Melek always finds answers, some are under her super hijab. For others she needs the help of newcomer Tien who draws fantastic worlds as an escape , dress-ups-guru Lily or even soccer-mad Zac who NEVER agrees with her. Melek wants to start her own Aussie Rules girls’ football team. ", "New girl Tien is a cartoonist and draws ’everything’ that happens at school, even the Book Parade. ", "Their classroom has Fab Science projects , a Rainbow Reading Chair and a Corridor of Cartoons. Plus Zac's Reading Rat.", "Melek solves all problems, even rescuing Zac in the pool. And luckily her fashionista mother designs club colour- coded hijabs for footy fans.", "So Melek’s next challenge is to arrange an Aussie Rules Girls’ football match.", " Discussion notes & activities which explain cultural links", "e-copy also available"], "author": "Hazel Edwards", "num_pages": "52", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-03-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25968204-it-s-that-time-again", "num_ratings": "9", "num_reviews": "4", "avg_ratings": 4.0, "genres": ["Religion", "Islam"], "title": "It's That Time Again: An Islamic Guide to Menstruation", "author": "Tuscany Bernier", "num_pages": "27", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25832452-islamic-poems", "num_ratings": "13", "num_reviews": "0", "avg_ratings": 4.46, "genres": ["Religion", "Poetry", "Love", "Religion", "Islam"], "title": "Islamic Poems: Nourishment for the Soul.", "description": ["The greatest gift a person could receive is the belief in Allah (God); because it is only through His Rope (Al-Habl) and His Light (Al-Nur); one will find the strength to survive through one's darkest days and nights. My only hope for this book is that it may provide some Nourishment for your Soul (Ruh) and Inspiration for your Faith (Iman), through the beauty of Islam - t", "The greatest gift a person could receive is the belief in Allah (God); because it is only through His Rope (Al-Habl) and His Light (Al-Nur); one will find the strength to survive through one's darkest days and nights. My only hope for this book is that it may provide some Nourishment for your Soul (Ruh) and Inspiration for your Faith (Iman), through the beauty of Islam - the Religion of Love."], "author": "K.A. Hosein", "num_pages": "76", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-26 00:00:00", "ISBN": "1514657821"},
{"url": "https://www.goodreads.com/book/show/24884364-just-a-coincidence", "num_ratings": "5", "num_reviews": "1", "avg_ratings": 3.0, "genres": [], "title": "Just a Coincidence", "description": ["This is the story of Jude, a girl in her late teens struggling in the field of marriage. She is not satisfied with the idea of falling in love and arranged marriage has not worked out for her. However, it does not feel quite good enough because she is pressured by her family and friends to \"start a new life.\" Everything changes when her car stops and a young man offers to", "This is the story of Jude, a girl in her late teens struggling in the field of marriage. She is not satisfied with the idea of falling in love and arranged marriage has not worked out for her. However, it does not feel quite good enough because she is pressured by her family and friends to \"start a new life.\" Everything changes when her car stops and a young man offers to help her. She finds herself constantly thinking about him, but her friend proves to her that he is just another player. Will he be the one who changes her ideas of marriage, or is their meeting just a coincidence?"], "author": "Fajer AlKhalifah", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9764473-bent-rib", "num_ratings": "49", "num_reviews": "9", "avg_ratings": 4.02, "genres": ["Religion", "Islam", "Womens", "Nonfiction", "Religion", "Gender"], "title": "Bent Rib: A Journey through Women's Issues in Islam", "description": ["This is a new, fully-revised edition of Huda Khattab’s discussion of important women’s issues in Islam. It examines several controversial topics such as domestic violence, female genital mutilation, polygyny and the failure to educate women and girls, and points out the divergence between Islamic teaching and actual culturally-influenced practice. In this 3rd edition of ", "This is a new, fully-revised edition of Huda Khattab’s discussion of important women’s issues in Islam. It examines several controversial topics such as domestic violence, female genital mutilation, polygyny and the failure to educate women and girls, and points out the divergence between Islamic teaching and actual culturally-influenced practice. In this 3rd edition of ", ", important information has been updated and new and interesting developments in these areas are discussed with regard to their impact on Muslim women and their society."], "author": "Huda Khattab", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "6035010342"},
{"url": "https://www.goodreads.com/book/show/22890781-the-governess", "num_ratings": "66", "num_reviews": "50", "avg_ratings": 3.17, "genres": ["Historical", "Historical Fiction", "Historical", "Victorian"], "title": "The Governess", "description": ["In early nineteenth century English countryside, a scandal-ridden woman is hired to take care of a grieving nobleman's children. This is a story of how she mends the family and regains her life. A moving introspective character analysis of lonely people living through emotional abuse, guilt and ageism."], "author": "Noorilhuda", "num_pages": "318", "awards": [], "places": ["Brookshire, England"], "character_names": [], "language": "English", "publish_date": "2014-08-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20419632-graffiti-hack", "num_ratings": "15", "num_reviews": "5", "avg_ratings": 3.93, "genres": [], "title": "Graffiti Hack", "description": ["Nelly Nasah arrives in Washington, D.C. with a critical mission--to make the internet beautiful. In her native country, letters are hand written in anthropomorphic shapes because straight lines are considered ugly and heart monitor machines are decorated with colorful mosaics so as not offend the artistic sensibilities of patients. Growing up in a culture obsessed with dec", "Nelly Nasah arrives in Washington, D.C. with a critical mission--to make the internet beautiful. In her native country, letters are hand written in anthropomorphic shapes because straight lines are considered ugly and heart monitor machines are decorated with colorful mosaics so as not offend the artistic sensibilities of patients. Growing up in a culture obsessed with decorating everything qualifies her for the quest....or so she believes. Nelly secures a job as a graphical designer in Georgetown, where she meets her aloof boss Jack, a talkative middle aged Ashley and Ralf who is convinced all women are attracted to him. Nelly tries to inspire the trio towards greater heights of exquisiteness with storytelling. Her modern fair tales backfire as they get misinterpreted, leading to hilarious results. Despite all her efforts, the only character Nelly forms a bond with is a rickety old elevator in a five story building whom she names Elvi. Nelly becomes convinced Elvi is communicating with her through the language of his gentle sways and flickering lights.", "A failed presentation at the office turns Nelly to exploring the dark world of hacking. Installing lavish designs on unsuspecting high profile websites, lights the internet abuzz with news of Nelly's latest hits. As the multitudes read political and social messages into her art/vandalism, Nelly fears that the adoration of her new fans is about to plunge her into deep trouble.", "Mixing the bite of Generation X by Douglas Coupland with the beauty of My Name is Red by Orhan Pamuk, Graffiti Hack is a jarring journey into the intersection of art, internet, obsession, immigration, fairy tales and loneliness."], "author": "Elen Ghulam", "num_pages": "282", "awards": ["Whistler Independent Book Awards Nominee for (Honorable Mention) (2016)"], "places": ["Washington, D.C.", "Seattle, Washington"], "character_names": [], "language": "English", "publish_date": "2014-01-01 00:00:00", "ISBN": "0978187210"},
{"url": "https://www.goodreads.com/book/show/3438000", "num_ratings": "32,584", "num_reviews": "6,029", "avg_ratings": 4.29, "genres": ["Novels"], "title": "ثلاثية غرناطة", "description": ["ثلاثية غرناطة هي ثلاثية روائية تتكون من ثلاث روايات للكاتبة المصرية رضوى عاشور و هم على التوالي: غرناطة - مريمة - الرحيل.", "وتدور الأحداث في مملكة غرناطة بعد سقوط جميع الممالك الإسلامية في الأندلس، و تبدأ أحداث الثلاثية في عام 1491م، وهو العام الذي سقطت فيه غرناطة بإعلان المعاهدة التي تنازل بمقتضاها (أبو عبد الله محمد الصغير) آخر ملوك غرناطة عن ملكه لملكي قشتالة وأراجون، وتنت", "ثلاثية غرناطة هي ثلاثية روائية تتكون من ثلاث روايات للكاتبة المصرية رضوى عاشور و هم على التوالي: غرناطة - مريمة - الرحيل.", "وتدور الأحداث في مملكة غرناطة بعد سقوط جميع الممالك الإسلامية في الأندلس، و تبدأ أحداث الثلاثية في عام 1491م، وهو العام الذي سقطت فيه غرناطة بإعلان المعاهدة التي تنازل بمقتضاها (أبو عبد الله محمد الصغير) آخر ملوك غرناطة عن ملكه لملكي قشتالة وأراجون، وتنتهى بمخالفة آخر أبطالها الأحياء (عليّ) لقرار ترحيل المسلمين حينما يكتشف أن الموت في الرحيل عن الأندلس و ليس في البقاء."], "author": "Radwa Ashour", "num_pages": "502", "awards": ["جائزة أحسن كتاب في مجال الرواية - معرض القاهرة الدولي للكتاب (1994)", "الجائزة الأولى - معرض كتاب المرأة العربية (1995)"], "places": ["الأندلس"], "character_names": ["علي", "أبو جعفر", "حسن", "سعد", "نعيم", "سليمة", "مريمة"], "language": "Arabic", "publish_date": "2009-08-16 00:00:00", "ISBN": "9770907375"},
{"url": "https://www.goodreads.com/book/show/20580117-a-series-of-very-unfortunate-monsters-santa-clause-his-elves-and-a-too", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 2.33, "genres": [], "title": "A Series of Very Unfortunate Monsters; Santa Clause, His Elves and A Tooth Fairy Too!", "description": ["Starving Santa searches and entices with all his devilish tricks to entice Salar and Taimyyah away from their belief in Allah’s Tawhid and final religion of Islam. He shows his goodies, threatens with his back biting and slander and then bring in re-inforcements including the tooth fairy. This scary and funny story is an allegory depicting Iblis and devil types showing the", "Starving Santa searches and entices with all his devilish tricks to entice Salar and Taimyyah away from their belief in Allah’s Tawhid and final religion of Islam. He shows his goodies, threatens with his back biting and slander and then bring in re-inforcements including the tooth fairy. This scary and funny story is an allegory depicting Iblis and devil types showing their anti-Islamic arsenal of disbelief and fitnah trying to lure children from Allah, Quran, Sunnah and Islam.", "The children learn the Islamic belief for when being confronted with kufr and shirk, Shariah prescribed Ruqyah to make jinn and evils go away and the importance in belief of Jannah.", "About the Author: Halimah bint David authored, illustrated, published and marketed several children’s books for Muslim Kindle for kids in Islam and Sharia Ruqyah for exorcisms in adults. Halimah founded a few popular blogs at SurvivorsAreUs.WordPress.Com, HighwayToHeaven.WordPress.Com, ChristinaMacQuarrie.Wordpress.Com and is currently researching and implementing new copy writing skills."], "author": "Halimah Bint David", "num_pages": "29", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17678418-the-woman-from-tantoura", "num_ratings": "17,867", "num_reviews": "3,299", "avg_ratings": 4.31, "genres": ["Novels"], "title": "The Woman from Tantoura", "description": ["Palestine. For most of us, the word brings to mind a series of confused images and disjointed associations-massacres, refugee camps, UN resolutions, settlements, terrorist attacks, war, occupation, checkered kouffiyehs and suicide bombers, a seemingly endless cycle of death and destruction. This novel does not shy away from such painful images, but it is first and foremost", "Palestine. For most of us, the word brings to mind a series of confused images and disjointed associations-massacres, refugee camps, UN resolutions, settlements, terrorist attacks, war, occupation, checkered kouffiyehs and suicide bombers, a seemingly endless cycle of death and destruction. This novel does not shy away from such painful images, but it is first and foremost a powerful human story, following the life of a young girl from her days in the village of al-Tantoura in Palestine up to the dawn of the new century. We participate in events as they unfold, seeing them through the uneducated but sharply intelligent mind of Ruqayya, as she tries to make sense of all that has happened to her and her family. With her, we live her love of her land and of her people; we feel the repeated pain of loss, of diaspora and of cross-generational misunderstanding; and above all, we come to know her indomitable human spirit. As we read we discover that we have become part of Ruqayya's family, and her voice will remain with us long after we have closed the book."], "author": "Radwa Ashour", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-15 00:00:00", "ISBN": "9774166159"},
{"url": "https://www.goodreads.com/book/show/16057275-cinnamon", "num_ratings": "586", "num_reviews": "124", "avg_ratings": 2.57, "genres": ["Fiction", "Lgbt"], "title": "Cinnamon", "description": ["After a bitter betrayal, Aliyah is banished from her mistress' villa at dawn and sent back to the dusty alleyways of her childhood. Exhausted, both maid and mistress seek refuge in sleep and dream of their troubled childhoods, loneliness, love, and their lives together. A darkly humorous tale, ", " portrays the inner world of two Damascene women and their search for se", "After a bitter betrayal, Aliyah is banished from her mistress' villa at dawn and sent back to the dusty alleyways of her childhood. Exhausted, both maid and mistress seek refuge in sleep and dream of their troubled childhoods, loneliness, love, and their lives together. A darkly humorous tale, ", " portrays the inner world of two Damascene women and their search for security and tenderness from two opposing ends of the social scale.", " is a journalist, novelist, and activist. Her diary of the Syrian revolution, ", ", was also published by Haus Publishing in July 2012."], "author": "Samar Yazbek", "num_pages": "124", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-02 00:00:00", "ISBN": "1906697434"},
{"url": "https://www.goodreads.com/book/show/12636944-humsafar", "num_ratings": "605", "num_reviews": "19", "avg_ratings": 4.06, "genres": ["Romance", "Cultural", "Pakistan"], "title": "Humsafar / ہمسفر", "description": ["Humsafar is a romantic novel written by Farhat Ishtiaq. The novel was first published in 7 parts in Khawateen Digest monthly from July 2007 to January 2008. It was later published as a complete novel by Ilm-o-Irfan Publishers. The story revolves around Ashar and Khirad's relationship with their daughter, Hareem, and how she unknowingly bridges the distances that exist betw", "Humsafar is a romantic novel written by Farhat Ishtiaq. The novel was first published in 7 parts in Khawateen Digest monthly from July 2007 to January 2008. It was later published as a complete novel by Ilm-o-Irfan Publishers. The story revolves around Ashar and Khirad's relationship with their daughter, Hareem, and how she unknowingly bridges the distances that exist between her parents. The novel is written in a retrospective manner and told mostly in flashbacks. The first half of the novel is based on mostly Ashar’s reflections and his point of view while the second part of the novel is told mainly from Khirad’s point of view.", "The story has been adapted into a drama serial (Humsafar), produced by Momina Duraid and directed by Sarmad Sultan Khoosat. The drama aired on Hum TV from September 2011 to February 2012."], "author": "Farhat Ishtiaq", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "Urdu", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13424647-the-true-secret", "num_ratings": "54", "num_reviews": "13", "avg_ratings": 4.54, "genres": ["Inspirational", "Religion", "Islam"], "title": "The True Secret", "description": ["As human beings, we all desire happiness, good health and peace of mind. As Muslims, we strive to live every aspect of our lives in accordance with our Islamic beliefs, in order to earn the pleasure of Allah and reach paradise in the next life. Just how do we go about accomplishing all this, though? How do we get from where we are to where we want to be?", " o", "As human beings, we all desire happiness, good health and peace of mind. As Muslims, we strive to live every aspect of our lives in accordance with our Islamic beliefs, in order to earn the pleasure of Allah and reach paradise in the next life. Just how do we go about accomplishing all this, though? How do we get from where we are to where we want to be?", " offers practical, step-by-step suggestions that anyone can use to evaluate his or her present situation and begin to make changes in beliefs and actions, working towards success in this life and the next. The examples, explanations and recommendations are in accordance with authentic Islamic teachings. We know that everything happens by the will of Allah, and this certainty gives us security and peace of mind, but we are still accountable for our own actions.", " (", ")", "Open your mind and your heart, make your intention to please Allah, then open this book and begin your journey towards unlocking your full potential. Inshallah you will be glad you did."], "author": "Amira Ayad", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-16 00:00:00", "ISBN": "6035011071"},
{"url": "https://www.goodreads.com/book/show/13549751-psychology-from-the-islamic-perspective", "num_ratings": "141", "num_reviews": "12", "avg_ratings": 4.04, "genres": ["Psychology", "Religion", "Islam", "Academic", "Religion"], "title": "Psychology from the Islamic Perspective", "description": ["Psychology is one of the most intriguing scientific disciplines as humans are inherently curious about their own nature. Ironically, there are a multitude of theories and explanations that mislead and confuse the very same creatures that they are meant to describe. Allah has blessed us with guidance in all facets of our lives, including that of our own souls and psyches. I", "Psychology is one of the most intriguing scientific disciplines as humans are inherently curious about their own nature. Ironically, there are a multitude of theories and explanations that mislead and confuse the very same creatures that they are meant to describe. Allah has blessed us with guidance in all facets of our lives, including that of our own souls and psyches. Islam offers an uncomplicated, comprehensive, and precise theory of our spiritual nature, our purpose and priorities in life, and how we can attain serenity and happiness in this life and the next.", "This book is a humble effort to expound upon the true conceptualization of human psychology based upon the Qur'an and Sunnah. Moreover, Dr. Utz includes specific references to scientific research that corresponds to, and builds upon, what is already known from revelation."], "author": "Aisha Utz", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17334214-once-upon-a-second-chance", "num_ratings": "26", "num_reviews": "9", "avg_ratings": 4.0, "genres": ["Romance", "Contemporary Romance"], "title": "Once Upon A Second Chance", "description": ["Leila Hassan Al-Nadir spent ten years in a forced, abusive marriage in the United Arab Emirates, before her husband divorced her...and another man stepped into his place to make her his wife. But before she can look at a future with this new man, he abandons her, dropping her off on the island of Mauritius in the care of his stepmother.", "Khalid Al-Nadir wants nothing more th", "Leila Hassan Al-Nadir spent ten years in a forced, abusive marriage in the United Arab Emirates, before her husband divorced her...and another man stepped into his place to make her his wife. But before she can look at a future with this new man, he abandons her, dropping her off on the island of Mauritius in the care of his stepmother.", "Khalid Al-Nadir wants nothing more than to be with Leila, his wife. But he hides a deep, dark secret—his intentions when he made her his weren’t noble. Despite falling in love with her in the end, he knows she will be better off without him.", "Leila craves answers; Khalid desires salvation. Fate, in the form of Khalid’s stepmother, intervenes and sets this estranged couple up for a one night stand date with Madame Eve’s agency.", "Can Leila and Khalid have a second chance, once they both face the truth that brought them together?", "Genre: Contemporary, interracial/multicultural, inspirational romance ", "Heat level: 3", "Word count – 12k"], "author": "Zee Monodee", "num_pages": "45", "awards": [], "places": ["Grand Baie", "Cap Malheureux"], "character_names": ["Leila Hassan Al-Nadir", "Khalid Al-Nadir"], "language": "English", "publish_date": "2013-02-05 00:00:00", "ISBN": "9781613334"},
{"url": "https://www.goodreads.com/book/show/13586594-jeegareh-ma", "num_ratings": "33", "num_reviews": "19", "avg_ratings": 4.39, "genres": ["Religion", "Islam", "Sociology"], "title": "Jeegareh Ma", "description": ["Based on a true story, ", " is a testament to the power of love in the face of struggle and hardship. Ghulam and Firishta, a wealthy couple, move to Kabul, Afghanistan, to begin a new chapter in their lives. Firishta is diagnosed with meningitis and passes away, leaving their six young children motherless. Moving back to Herat, Ghulam and his family discover that th", "Based on a true story, ", " is a testament to the power of love in the face of struggle and hardship. Ghulam and Firishta, a wealthy couple, move to Kabul, Afghanistan, to begin a new chapter in their lives. Firishta is diagnosed with meningitis and passes away, leaving their six young children motherless. Moving back to Herat, Ghulam and his family discover that their motherland is no longer the same: the Soviet Union has invaded, causing them to seek refuge in Iran. In Iran, Ali, an impoverished, dark-skinned, and plumpish man asks for Maryam's hand in marriage. As Afghans living in Iran, Ali and his family are denied identity, worth, and value. Ali's prayers are answered when he and his family are accepted by Canada as refugees. ", " is a story of courage where love, family, and God are put to the test."], "author": "Rahela Nayebzadah", "num_pages": "159", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-04 00:00:00", "ISBN": "1926780280"},
{"url": "https://www.goodreads.com/book/show/29852132-ayesha-dean-the-istanbul-intrigue", "num_ratings": "39", "num_reviews": "19", "avg_ratings": 4.23, "genres": ["Mystery", "Young Adult", "Thriller", "Mystery Thriller", "Mystery", "Crime", "Contemporary"], "title": "Ayesha Dean The Istanbul Intrigue", "description": ["Ayesha and her friends Sara and Jess jump at the chance of accompanying Ayesha's uncle on a trip from Australia to Istanbul. But when Ayesha discovers a mysterious note as a result of visiting an old bookshop, their relaxing holiday starts to get a whole lot more complicated! Ayesha finds herself trying to uncover a hundred-year-old Ibn Arabi mystery, while trying to avoid", "Ayesha and her friends Sara and Jess jump at the chance of accompanying Ayesha's uncle on a trip from Australia to Istanbul. But when Ayesha discovers a mysterious note as a result of visiting an old bookshop, their relaxing holiday starts to get a whole lot more complicated! Ayesha finds herself trying to uncover a hundred-year-old Ibn Arabi mystery, while trying to avoid creepy villains, and still making sure that she gets to eat the best doner kebab Istanbul has to offer. It's all in a day's sleuthing when you're Ayesha Dean. Lucky she can count on her best friends to always have her back!", "**Fans of Nancy Drew and The Hardy Boys will love this new heroine!**"], "author": "Melati Lum", "num_pages": "105", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19534367-why-do-they-leave-christianity-and-come-to-islam", "num_ratings": "6", "num_reviews": "2", "avg_ratings": 3.67, "genres": [], "title": "Why Do They Leave Christianity and Come to Islam?: A Scriptural Quest for the Truth", "description": ["If you have ever wondered how Islam and Christianity are similar and different, be ready to learn some of the most interesting facts in this well written and well researched book. Allow Aicha Zoubair to take you by the hand to teach you how Islam in its many pure forms is becoming more and more popular in the Western part of the world. With many leaving Christianity behind", "If you have ever wondered how Islam and Christianity are similar and different, be ready to learn some of the most interesting facts in this well written and well researched book. Allow Aicha Zoubair to take you by the hand to teach you how Islam in its many pure forms is becoming more and more popular in the Western part of the world. With many leaving Christianity behind, you might wonder what Islam has to offer what Christianity does not... Did Jesus really die while being crucified, as he was a submitter to God's will? Not only does the author's new book answer these questions, it is also objective research into the Muslim and Christian scriptures, to understand why Jesus was sent for and what his message was... If you are ready to learn why Islam is the religion of truth that God wants us to follow, or if you are currently interested in learning how Islam is different from what you learn and see on television, the author's new book is a must to read. You will not be disappointed, as you will learn a lot, and maybe even see an opportunity to further enhance your spiritual life!"], "author": "Aicha Zoubair", "num_pages": "284", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-12-13 00:00:00", "ISBN": "1491043954"},
{"url": "https://www.goodreads.com/book/show/256466.Ancestor_Stones", "num_ratings": "706", "num_reviews": "101", "avg_ratings": 3.74, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Western Africa", "Sierra Leone", "Literature", "African Literature"], "title": "Ancestor Stones", "description": ["A powerful, sensuously written novel that, through the lives of women, beautifully captures Africa’s past and present, and the legacy that her daughters take with them wherever they live.", "From the author of The Devil That Danced on the Water - a timeless portrait of the lives of a family of independent, spirited African women over the last century of dramatic cultural chang", "A powerful, sensuously written novel that, through the lives of women, beautifully captures Africa’s past and present, and the legacy that her daughters take with them wherever they live.", "From the author of The Devil That Danced on the Water - a timeless portrait of the lives of a family of independent, spirited African women over the last century of dramatic cultural change ", "Aminatta Forna’s The Devil That Danced on the Water was rapturously acclaimed, a moving and gorgeously written memoir that garnered inter­national attention. Now she has seamlessly turned her hand to fiction and delivers a novel that is lush and beautiful, a touching and intimate portrait of several generations of African women. ", "In Ancestor Stones, a young woman from West Africa, who has lived in England for many years and is married to a British man, returns to visit her family after years of civil war. Her four aunts have decided to leave her the family coffee plantation, as she is the last person in the family with the means to revive its fortunes. And on this trip home she is given an unprecedented look into the lives of the women in her family as her aunts Mary, Hawa, Asana, and Serah— women who were mysterious and a bit intimidating to her younger self—begin to tell her their stories. They are timeless tales of rivalrous co-wives, patriarchal society, and old religions challenged by Islamic and Christian incursions; they are modern stories of European-owned mining companies, the repressive influence of mission schools, corrupt elections, and the postcolonial African elite. Through their voices a family history interwoven with the history of a country emerges—one of a society both ancient and modern, of a family of strong women refusing to live as second-class citizens. ", "In her debut foray into fiction, Forna has created a powerful, sensuously written novel that, through the lives of women, beautifully captures Africa’s past and present, and the legacy that her daughters take with them wherever they live. It is a wonderful achievement that recalls The God of Small Things and The Joy Luck Club, and establishes Forna as a gifted novelist."], "author": "Aminatta Forna", "num_pages": "336", "awards": ["Hurston/Wright Legacy Award for Debut Fiction (2007)", "Frankfurt Book Fair LiBeraturpreis (2008)"], "places": ["West Africa"], "character_names": [], "language": "English", "publish_date": "2006-08-14 00:00:00", "ISBN": "0871139448"},
{"url": "https://www.goodreads.com/book/show/20898019-ms-marvel-vol-1", "num_ratings": "70,177", "num_reviews": "4,927", "avg_ratings": 4.12, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Young Adult", "Comics", "Superheroes", "Fiction"], "title": "Ms. Marvel, Vol. 1: No Normal", "description": [" ", "Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of", " ", "Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of her newfound powers, she unlocks a secret behind them, as well. Is Kamala ready to wield these immense new gifts? Or will the weight of the legacy before her be too much to bear? Kamala has no idea, either. But she's comin' for you, Jersey! ", "It's history in the making from acclaimed writer G. Willow Wilson (Air, Cairo) and beloved artist Adrian Alphona (RUNAWAYS)! Collecting MS. MARVEL (2014) #1-5 and material from ALL-NEW MARVEL NOW! POINT ONE #1."], "author": "G. Willow Wilson", "num_pages": "120", "awards": ["Hugo Award for Best Graphic Story (2015)", "Harvey Awards Nominee for Best New Series, Best Writer (for G. Willow Wilson) (2015)", "Lincoln Award Nominee (2019)", "Will Eisner Comic Industry Awards Nominee for Best New Series, Best Writer (for G. Willow Wilson), Best Penciller/Inker (for Adrian Alphona), Best Lettering (for Joe Caramagna), Best Cover Artist (for Jamie McKelvie & Matthew Wilson) (2015)", "Goodreads Choice Award Nominee for Graphic Novels & Comics (2014)"], "places": ["Jersey City, New Jersey"], "character_names": ["Steve Rogers", "Carol Danvers", "Kamala Khan", "Tony Stark", "Zoe Zimmer", "Chatty Bob", "Sheik Abdullah", "Doyle", "Thomas Edison (clone)", "Knox", "Bruno Carrelli", "Nakia Badahir", "Yusuf Khan", "Muneeba Khan", "Aamir Khan", "Vittorio \"Vick\" Carrelli", "Josh Richardson"], "language": "English", "publish_date": "2014-10-30 00:00:00", "ISBN": "078519021X"},
{"url": "https://www.goodreads.com/book/show/27213250-a-house-without-windows", "num_ratings": "6,177", "num_reviews": "722", "avg_ratings": 3.96, "genres": ["Fiction", "Contemporary", "Cultural"], "title": "A House Without Windows", "description": ["For two decades, Zeba was a loving wife, a patient mother, and a peaceful villager. But her quiet life is sha", "For two decades, Zeba was a loving wife, a patient mother, and a peaceful villager. But her quiet life is shattered when her husband, Kamal, is found brutally murdered with a hatchet in the courtyard of their home. Nearly catatonic with shock, Zeba is unable to account for her whereabouts at the time of his death. Her children swear their mother could not have committed such a heinous act. Kamal’s family is sure she did, and demands justice. Barely escaping a vengeful mob, Zeba is arrested and jailed.", "Awaiting trial, she meets a group of women whose own misfortunes have led them to these bleak cells: eighteen-year-old Nafisa, imprisoned to protect her from an “honor killing”; twenty-five-year-old Latifa, a teen runaway who stays because it is safe shelter; twenty-year-old Mezghan, pregnant and unmarried, waiting for a court order to force her lover’s hand. Is Zeba a cold-blooded killer, these young women wonder, or has she been imprisoned, like them, for breaking some social rule? For these women, the prison is both a haven and a punishment; removed from the harsh and unforgiving world outside, they form a lively and indelible sisterhood.", "Into this closed world comes Yusuf, Zeba’s Afghan-born, American-raised lawyer whose commitment to human rights and desire to help his homeland have brought him back. With the fate this seemingly ordinary housewife in his hands, Yusuf discovers that, like the Afghanistan itself, his client may not be at all what he imagines.", "A moving look at the lives of modern Afghan women, ", " is astonishing, frightening, and triumphant."], "author": "Nadia Hashimi", "num_pages": "415", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-16 00:00:00", "ISBN": "0062449680"},
{"url": "https://www.goodreads.com/book/show/594449.In_the_Name_of_Honour", "num_ratings": "1,800", "num_reviews": "163", "avg_ratings": 3.88, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Feminism", "Religion", "Islam"], "title": "In the Name of Honour: A Memoir", "description": ["In June 2002, Mukhtar Mai, a Pakistani woman from the impoverished village of Meerwala, was gang-raped by a local clan known as the Mastoi — punishment for indiscretions allegedly committed by the woman's brother. While certainly not the first account of a female body being negotiated for honor in a family, this time the survivor had bravely chosen to fight back. In doing", "In June 2002, Mukhtar Mai, a Pakistani woman from the impoverished village of Meerwala, was gang-raped by a local clan known as the Mastoi — punishment for indiscretions allegedly committed by the woman's brother. While certainly not the first account of a female body being negotiated for honor in a family, this time the survivor had bravely chosen to fight back. In doing so, Mai single-handedly changed the feminist movement in Pakistan, one of the world's most adverse climates for women. By July 2002, the Pakistani government awarded her the equivalent of 8,500 U.S. dollars in compensation money and sentenced her attackers to death — and Mukhtar Mai went on to open a school for girls so that future generations would not suffer, as she had, from illiteracy.", "In this rousing account, Mai describes her experience and how she has since become an agent for change and a beacon of hope for oppressed women around the world. Timely and topical, \"In the Name of Honor\" is the remarkable and inspirational memoir of a woman who fought and triumphed against exceptional odds."], "author": "Mukhtar Mai", "num_pages": "172", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "1844084094"},
{"url": "https://www.goodreads.com/book/show/9840.Jasmine_and_Stars", "num_ratings": "258", "num_reviews": "46", "avg_ratings": 3.63, "genres": ["Cultural", "Iran", "Nonfiction", "Autobiography", "Memoir", "Feminism", "Writing", "Books About Books"], "title": "Jasmine and Stars: Reading More Than Lolita in Tehran", "description": ["In a direct, frank, and intimate exploration of Iranian literature and society, scholar, teacher, and poet Fatemeh Keshavarz challenges popular perceptions of Iran as a society bereft of vitality and joy. Her fresh perspective on present-day Iran provides a rare insight into this rich culture alive with artistic expression but virtually unknown to most Americans. ", "Keshavarz", "In a direct, frank, and intimate exploration of Iranian literature and society, scholar, teacher, and poet Fatemeh Keshavarz challenges popular perceptions of Iran as a society bereft of vitality and joy. Her fresh perspective on present-day Iran provides a rare insight into this rich culture alive with artistic expression but virtually unknown to most Americans. ", "Keshavarz introduces readers to two modern Iranian women writers whose strong and articulate voices belie the stereotypical perception of Iranian women as voiceless victims in a country of villains. She follows with a lively critique of the recent best-seller ", ", which epitomizes what Keshavarz calls the \"New Orientalist narrative,\" a view marred by stereotype and prejudice more often tied to current geopolitical conflicts than to an understanding of Iran. ", "Blending in firsthand glimpses of her own life--from childhood memories in 1960s Shiraz to her present life as a professor in America--Keshavarz paints a portrait of Iran depicting both cultural depth and intellectual complexity. With a scholar's expertise and a poet's hand, she helps amplify the powerful voices of contemporary Iranians and leads readers toward a deeper understanding of the country's past and present.", "In a direct, frank, and intimate exploration of Iranian literature and society, scholar, teacher, and poet Fatemeh Keshavarz challenges popular perceptions of Iran as a society bereft of vitality and joy. Her fresh perspective on present day Iran provides a rare insight into this rich culture alive with artistic expression but virtually unknown to most Americans. She warns against the rise of what she calls the \"New Orientalist narrative,\" which thrives on stereotype and prejudice and is often tied to current geopolitical conflict rather than an understanding of Iran. Keshavarz offers a lively critique of the best-seller ", ", which she says epitomizes this New Orientalist attitude. Blending in firsthand glimpses of her own life, Keshavarz paints a portrait of Iran depicting both cultural depth and intellectual complexity."], "author": "Fatemeh Keshavarz", "num_pages": "174", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2007-03-05 00:00:00", "ISBN": "0807831093"},
{"url": "https://www.goodreads.com/book/show/108740.Qur_an_and_Woman", "num_ratings": "1,617", "num_reviews": "55", "avg_ratings": 4.23, "genres": ["Religion", "Islam", "Religion", "Feminism", "Nonfiction", "Gender", "Womens"], "title": "Qur'an and Woman: Rereading the Sacred Text from a Woman's Perspective", "description": ["A pro-faith attempt by a Muslim woman to present a comprehensive, female-inclusive reading of the Qur'an, the sacred Islamic text."], "author": "Amina Wadud", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-06-10 00:00:00", "ISBN": "0195128362"},
{"url": "https://www.goodreads.com/book/show/6818019-i-am-nujood-age-10-and-divorced", "num_ratings": "16,401", "num_reviews": "2,415", "avg_ratings": 3.8, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Feminism"], "title": "I Am Nujood, Age 10 and Divorced", "description": [" ", "Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's han", " ", "Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's hands and of her daring escape. With the help of local advocates and the press, Nujood obtained her freedom—an extraordinary achievement in Yemen, where almost half of all girls are married under the legal age. Nujood's courageous defiance of both Yemeni customs and her own family has inspired other young girls in the Middle East to challenge their marriages. Hers is an unforgettable story of tragedy, triumph, and courage."], "author": "Nujood Ali", "num_pages": "188", "awards": [], "places": ["Yemen"], "character_names": [], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "0307589676"},
{"url": "https://www.goodreads.com/book/show/16153873-traversing-the-highs-and-lows-of-muslim-marriage", "num_ratings": "11", "num_reviews": "2", "avg_ratings": 4.0, "genres": ["Nonfiction", "Religion", "Islam", "Family"], "title": "Traversing the Highs and Lows of Muslim Marriage", "description": ["Are you engaged to be married with preconceived notions about this blessed union? Or are you a newly-wed couple for whom the practical reality of marriage is gradually unfolding? Or is your marriage of many years on the rocks due to myriad factors that affect your relationship? Is the behavior of your in-laws or your spouse thwarting your efforts to maintain happiness in m", "Are you engaged to be married with preconceived notions about this blessed union? Or are you a newly-wed couple for whom the practical reality of marriage is gradually unfolding? Or is your marriage of many years on the rocks due to myriad factors that affect your relationship? Is the behavior of your in-laws or your spouse thwarting your efforts to maintain happiness in marriage? Is your privacy in this relationship being compromised?", " provides a comprehensive guide to overcome all the tribulations that serve as the stumbling blocks on the road to a happy, loving, supportive and deeply satisfying marital relationship. It provides clear guidelines on how to build a strong and long-lasting marital bond by dealing constructively with any problems along the way. It highlights how Islam emphasizes the need for a harmonious, steadfast and highly loving relationship between a husband and wife and how Islam safeguards their privacy.", "Transcending the cultural bounds that hinder the smooth transition of couples into married life and abolishing stereotypes, the book offers up-to-date, wide-ranging marital advice based on an impressive amount of carefully compiled and well-presented information based on the Qur’an and the Sunnah. It will prove to be your key towards making marriage a joyful and wonderful experience all the way!"], "author": "Sadaf Farooqi", "num_pages": "195", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/895743.From_My_Sisters_Lips", "num_ratings": "769", "num_reviews": "88", "avg_ratings": 4.04, "genres": ["Religion", "Islam", "Nonfiction", "Religion"], "title": "From My Sisters' Lips", "description": ["Covered from head to toe with only her eyes visible, the sight of a Muslim woman on a western city street rarely fails to provoke a strong reaction. Feelings of shock, horror, repulsion, pity or even fear are not uncommon. But have you ever wondered who it is behind the veil and what makes her tick? Ever wondered what her life is really like and whether her dreams, hopes a", "Covered from head to toe with only her eyes visible, the sight of a Muslim woman on a western city street rarely fails to provoke a strong reaction. Feelings of shock, horror, repulsion, pity or even fear are not uncommon. But have you ever wondered who it is behind the veil and what makes her tick? Ever wondered what her life is really like and whether her dreams, hopes and aspirations differ from yours? ", " offers a rare glimpse into the lives of a community of women, most of whom are converts to Islam, and invites you to share their joys, sorrows, convictions and faith. When Na'ima B Robert abandoned her western lifestyle and embraced Islam six years ago, it was not a decision taken lightly. Yet soon after she took her first tentative steps towards covering, she felt empowered; no longer judged on physical appearances alone, no longer seeking the approval to feel beautiful — or using her looks to wield power over men — the experience effected her greatly. Before long she grew in confidence and courage. As she says, \"Something just clicked.\" I thought, \"Good, don't look; don't compare me with your latest squeeze, don't try and guess my measurements - my body is my own business!\"' ", " offers a glimpse into the lives of just some of the extraordinary women who, like herself, have chosen to live behind the veil. What emerges is a vivid and intimate portrait of a sisterhood; as they speak candidly and with conviction on a diverse range of subjects ranging from marriage to motherhood, stereotypes, submission and self-image, we hear the strong, proud voices of those who are seldom heard."], "author": "Na'ima B. Robert", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-05-02 00:00:00", "ISBN": "0593054415"},
{"url": "https://www.goodreads.com/book/show/2385463.Daughter_of_Persia", "num_ratings": "1,447", "num_reviews": "178", "avg_ratings": 4.06, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "History", "Cultural", "Iran"], "title": "Daughter of Persia: A Woman's Journey From Her Father's Harem Through the Islamic Revolution", "description": ["An intimate and honest chronicle of the everyday life of Iranian women over the past century", "“A lesson about the value of personal freedom and what happens to a nation when its people are denied the right to direct their own destiny. This is a book Americans should read.” —", "The fifteenth of thirty-six children, Sattareh Farman Farmaian was born in Iran in 1921", "An intimate and honest chronicle of the everyday life of Iranian women over the past century", "“A lesson about the value of personal freedom and what happens to a nation when its people are denied the right to direct their own destiny. This is a book Americans should read.” —", "The fifteenth of thirty-six children, Sattareh Farman Farmaian was born in Iran in 1921 to a wealthy and powerful shazdeh, or prince, and spent a happy childhood in her father’s Tehran harem. Inspired and empowered by his ardent belief in education, she defied tradition by traveling alone at the age of twenty-three to the United States to study at the University of Southern California. Ten years later, she returned to Tehran and founded the first school of social work in Iran.", "Intertwined with Sattareh’s personal story is her unique perspective on the Iranian political and social upheaval that have rocked Iran throughout the twentieth century, from the 1953 American-backed coup that toppled democratic premier Mossadegh to the brutal regime of the Shah and Ayatollah Khomeini’s fanatic and anti-Western Islamic Republic. In 1979, after two decades of tirelessly serving Iran’s neediest, Sattareh was arrested as a counterrevolutionary and branded an imperialist by Ayatollah Khomeini’s radical students.", " is the remarkable story of a woman and a nation in the grip of profound change."], "author": "Sattareh Farman Farmaian", "num_pages": "432", "awards": [], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": [], "language": "English", "publish_date": "2006-06-27 00:00:00", "ISBN": "0385468660"},
{"url": "https://www.goodreads.com/book/show/7946098-songs-of-blood-and-sword", "num_ratings": "1,336", "num_reviews": "157", "avg_ratings": 3.8, "genres": ["Nonfiction", "Cultural", "Pakistan", "History", "Autobiography", "Memoir", "Biography", "Politics"], "title": "Songs of Blood and Sword: A Daughter's Memoir", "description": ["In September 1996, fourteen-year-old Fatima Bhutto hid in a windowless dressing room, shielding her baby brother, while shots rang out in the dark outside the family home in Karachi. This was the night her father Murtaza was murdered. It was the latest in a long line of tragedies for one of the world's best-known political dynasties.", " tells the story", "In September 1996, fourteen-year-old Fatima Bhutto hid in a windowless dressing room, shielding her baby brother, while shots rang out in the dark outside the family home in Karachi. This was the night her father Murtaza was murdered. It was the latest in a long line of tragedies for one of the world's best-known political dynasties.", " tells the story of a family of feudal landlords who became powerbrokers. It is an epic tale of intrigue, the making of modern Pakistan, and ultimately, tragedy. A searing testament to a troubled land, ", " reveals a daughter's love for her father and her search to uncover the truth of his life and death."], "author": "Fatima Bhutto", "num_pages": "470", "awards": ["Shakti Bhatt First Book Prize Nominee (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-28 00:00:00", "ISBN": "1568586329"},
{"url": "https://www.goodreads.com/book/show/7261463-powerful-time-management-skills-for-muslims", "num_ratings": "11", "num_reviews": "2", "avg_ratings": 4.36, "genres": ["Religion", "Islam"], "title": "Powerful Time Management Skills for Muslims", "description": ["This book will teach you powerful skills which will help you achieve your goals and meet your deadlines insha'Allaah.It will guide you from an Islamic perspective,and will teach you how Prophet Muhammad (PBUH) used to spend his time. Each chapter has an activity to follow up on to keep you charged up, which will help you implement what you just read- insha'Allaah. This boo", "This book will teach you powerful skills which will help you achieve your goals and meet your deadlines insha'Allaah.It will guide you from an Islamic perspective,and will teach you how Prophet Muhammad (PBUH) used to spend his time. Each chapter has an activity to follow up on to keep you charged up, which will help you implement what you just read- insha'Allaah. This book will help you address your weaknesses step-by-step, and help you convert them into your strengths insha'Allaah. ABOUT THE AUTHOR: Zohra Sarwari holds a Bachelor's degree in Psychology, a Masters degree in Business Administration, and is currently working towards a Bachelor's degree in Islamic Studies. She has inspired people of all ages as a speaker, author, business and life coach."], "author": "Zohra Sarwari", "num_pages": "84", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-04 00:00:00", "ISBN": "0982312539"},
{"url": "https://www.goodreads.com/book/show/6390356-the-locust-and-the-bird", "num_ratings": "784", "num_reviews": "126", "avg_ratings": 3.82, "genres": ["Nonfiction", "Biography", "Cultural", "Lebanon", "Autobiography", "Memoir"], "title": "The Locust and the Bird: My Mother's Story", "description": ["In a masterly act of literary transformation, celebrated novelist Hanan al-Shaykh re-creates the dramatic life and times of her mother, Kamila.", "Married at a young age against her will, Kamila soon fell head-over-heels in love with another man—and was thus forced to choose between her children and her lover. As the narrative unfolds through the years—from the bazaars, cinema", "In a masterly act of literary transformation, celebrated novelist Hanan al-Shaykh re-creates the dramatic life and times of her mother, Kamila.", "Married at a young age against her will, Kamila soon fell head-over-heels in love with another man—and was thus forced to choose between her children and her lover. As the narrative unfolds through the years—from the bazaars, cinemas and apartments of 1930s Beirut to its war-torn streets decades later—we follow this passionate woman as she survives the tragedies and celebrates the triumphs of a life lived to the very fullest."], "author": "Hanan Al-Shaykh", "num_pages": "302", "awards": [], "places": ["Beirut"], "character_names": [], "language": null, "publish_date": "2009-08-16 00:00:00", "ISBN": "1408800071"},
{"url": "https://www.goodreads.com/book/show/15730404-no-sex-in-the-city", "num_ratings": "411", "num_reviews": "99", "avg_ratings": 3.48, "genres": ["Womens Fiction", "Chick Lit", "Romance", "Fiction", "Contemporary", "Cultural"], "title": "No Sex in the City", "description": ["It is a truth universally acknowledged that a single man in possession of a student visa must be in want of an Australian wife.", "Twenty-eight-year old Esma has a masters in human resource management, never orders ", " a salad, is well-travelled, has excellent taste in music, watches the ABC news, has the ", " saved as an app on her iPhone, knows all the two-letter words", "It is a truth universally acknowledged that a single man in possession of a student visa must be in want of an Australian wife.", "Twenty-eight-year old Esma has a masters in human resource management, never orders ", " a salad, is well-travelled, has excellent taste in music, watches the ABC news, has the ", " saved as an app on her iPhone, knows all the two-letter words in Scrabble and can tell the difference between a Ford and a Holden. Armed with a check-list, she's on the hunt for Mr Right, who must be a Muslim.", "Tired of failed matchmaking, online dating sites and people calling her 'old fashioned', Esma forms a 'No Sex in the City' club with her friends Lisa, Ruby and Nirvana.", "Esma's quest for The One was never going to be easy but when family, friends and meddling employers are thrown into the equation, her path to true love suddenly takes a great big detour."], "author": "Randa Abdel-Fattah", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-01 00:00:00", "ISBN": "1742611370"},
{"url": "https://www.goodreads.com/book/show/6124722-the-proof-of-the-honey", "num_ratings": "1,515", "num_reviews": "364", "avg_ratings": 2.57, "genres": ["Adult Fiction", "Erotica", "Fiction", "Novels", "Literature"], "title": "The Proof of the Honey", "description": ["A bestseller throughout the Arab world, a tribute to sex, eroticism, language and liberty, ", " is a superb celebration of female pleasure. A Syrian scholar working in Paris is invited to contribute to a conference on the subject of classic erotic literature in Arabic. The invitation provides occasion for her to evoke memories from her own life, to exult", "A bestseller throughout the Arab world, a tribute to sex, eroticism, language and liberty, ", " is a superb celebration of female pleasure. A Syrian scholar working in Paris is invited to contribute to a conference on the subject of classic erotic literature in Arabic. The invitation provides occasion for her to evoke memories from her own life, to exult in her personal liberty, her lovers, her desires, and to revisit moments of shared intimacy with other women as they discuss life, love, and sexual desire.", " Far more than an erotic novel, ", " is a surprising and illuminating voyage into the history of Arabic literature. Borrowing inspiration from ", ", erudite asides are woven into the fabric of the protagonist's story and the stories of her lovers. Affirming that \"Arabic is the language of sex,\" and making desire the source of her own personal liberty, Al Neimi has written a stirring novel about the place afforded sex in modern Arabic society and its relationship to the long, rich tradition of Arabic erotica."], "author": "Salwa Al Neimi", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "1933372680"},
{"url": "https://www.goodreads.com/book/show/910679.Sultana_s_Dream", "num_ratings": "175", "num_reviews": "29", "avg_ratings": 3.86, "genres": ["Fiction", "Short Stories", "Feminism", "Cultural", "India", "Classics", "Womens", "Science Fiction"], "title": "Sultana's Dream: And Selections from The Secluded Ones", "description": ["Sultana’s Dream, first published in 1905 in a Madras English newspaper, is a witty feminist utopia—a tale of reverse purdah that posits a world in which men are confined indoors and women have taken over the public sphere, ending a war nonviolently and restoring health and beauty to the world.", "\"The Secluded Ones\" is a selection of short sketches, first published in Bengali", "Sultana’s Dream, first published in 1905 in a Madras English newspaper, is a witty feminist utopia—a tale of reverse purdah that posits a world in which men are confined indoors and women have taken over the public sphere, ending a war nonviolently and restoring health and beauty to the world.", "\"The Secluded Ones\" is a selection of short sketches, first published in Bengali newspapers, illuminating the cruel and comic realities of life in purdah.", "History", "Indian Literature", "South Asian Studies", "Utopian Fiction", "Women’s Studies", " (1880 - 1932) was a Bengali Muslim writer and feminist activist who founded the first Muslim girls’ school in Calcutta in 1911."], "author": "Rokeya Sakhawat Hossain", "num_pages": "104", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-01-01 00:00:00", "ISBN": "0935312838"},
{"url": "https://www.goodreads.com/book/show/11362269-nurturing-eeman-in-children", "num_ratings": "46", "num_reviews": "3", "avg_ratings": 4.7, "genres": ["Religion", "Islam", "Religion", "Parenting", "Womens"], "title": "Nurturing Eeman in Children", "description": ["A plethora of parenting books on the market these days covers every aspect of dealing with your children. From the terrible twos to the troublesome teens, you will have no problem finding multitudes of books claiming to point you in the right direction when it comes to raising your children. Whether you are aiming to raise a baby Eistein, or just looking for some hints on", "A plethora of parenting books on the market these days covers every aspect of dealing with your children. From the terrible twos to the troublesome teens, you will have no problem finding multitudes of books claiming to point you in the right direction when it comes to raising your children. Whether you are aiming to raise a baby Eistein, or just looking for some hints on how to handle an unruly tyke or teen, you will no doubt find plenty of advice.", " however, addresses an aspect of child-rearing that is vitally important, and is not touched upon in the mainstream selections that we are so familiar with. In the author's book, Dr Hamdan clearly and in no uncertain terms explain the importance of instilling in our children a strong connection to their Creator and a love for the religion that He has chosen for us and for them. From this book, you will learn the what, the why, and the how of raising a righteous Muslim child."], "author": "Aisha Utz", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/40207.The_Story_of_My_Life", "num_ratings": "1,706", "num_reviews": "293", "avg_ratings": 3.93, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Biography", "Autobiography"], "title": "The Story of My Life: An Afghan Girl on the Other Side of the Sky", "description": ["Farah Ahmedi has a happy life with her family in Afghanistan until war destroyed everything and she had to move to the United States for a better life. How did she adjust, and what did she have to do to build a new life?"], "author": "Farah Ahmedi", "num_pages": "256", "awards": [], "places": ["Afghanistan"], "character_names": [], "language": "English", "publish_date": "2005-04-22 00:00:00", "ISBN": "1416906703"},
{"url": "https://www.goodreads.com/book/show/290384.Kartography", "num_ratings": "2,481", "num_reviews": "216", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Pakistan", "Historical", "Historical Fiction", "Romance", "Cultural", "Asia"], "title": "Kartography", "description": ["Raheen and her best friend, Karim, share an idyllic childhood in upper-class Karachi. Their parents were even once engaged to each others' partners until they rematched in what they call \"the fiancée swap.\" But as adolescence distances the friends, Karim takes refuge in maps while Raheen searches for the secret behind her parents' exchange. What she uncovers reveals not ju", "Raheen and her best friend, Karim, share an idyllic childhood in upper-class Karachi. Their parents were even once engaged to each others' partners until they rematched in what they call \"the fiancée swap.\" But as adolescence distances the friends, Karim takes refuge in maps while Raheen searches for the secret behind her parents' exchange. What she uncovers reveals not just a family's but a country's turbulent history-and a grown-up Raheen and Karim are caught between strained friendship and fated love. ", "A love story with a family mystery at its heart, Kartography is a dazzling novel by a young writer of astonishing maturity and exhilarating style. Shamsie transports us to a world we have not often seen in fiction-vibrant, dangerous, sensuous Pakistan. But even as she takes us far from the familiar, her story of passion and family secrets rings universally true. "], "author": "Kamila Shamsie", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-07 00:00:00", "ISBN": "0156029731"},
{"url": "https://www.goodreads.com/book/show/977825.Turbulence", "num_ratings": "19", "num_reviews": "2", "avg_ratings": 4.0, "genres": ["Fiction"], "title": "Turbulence", "description": ["Brad Adams appears to have it all. A devoted wife. Two intelligent sons. A large house in the suburbs. And a successful career. But the death of his mother in a plane crash disturbs his tranquil existence. His brothers are able to mourn and get on with their lives, but Brad finds he cannot put his grief behind him. Instead he enters a world of panic and nightmares. A singl", "Brad Adams appears to have it all. A devoted wife. Two intelligent sons. A large house in the suburbs. And a successful career. But the death of his mother in a plane crash disturbs his tranquil existence. His brothers are able to mourn and get on with their lives, but Brad finds he cannot put his grief behind him. Instead he enters a world of panic and nightmares. A single incident of rage, brought on by the constant stress he is experiencing, destroys all he has worked so hard to build. The pain of his failure leads him to a path of destruction which becomes an odyssey as he searches for the peace he has never known."], "author": "Jamilah, Kolocotronis", "num_pages": "360", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-09 00:00:00", "ISBN": "0979357705"},
{"url": "https://www.goodreads.com/book/show/108700.Women_and_Gender_in_Islam", "num_ratings": "1,141", "num_reviews": "55", "avg_ratings": 4.06, "genres": ["Feminism", "Religion", "Islam", "Nonfiction", "History", "Religion", "Gender"], "title": "Women and Gender in Islam: Historical Roots of a Modern Debate", "description": ["Are Islamic societies inherently oppressive to women? Is the trend among Islamic women to appear once again in veils and other traditional clothing a symbol of regression or an effort to return to a “pure” Islam that was just and fair to both sexes? In this book Leila Ahmed adds a new perspective to the current debate about women and Islam by exploring its historical roots", "Are Islamic societies inherently oppressive to women? Is the trend among Islamic women to appear once again in veils and other traditional clothing a symbol of regression or an effort to return to a “pure” Islam that was just and fair to both sexes? In this book Leila Ahmed adds a new perspective to the current debate about women and Islam by exploring its historical roots, tracing the developments in Islamic discourses on women and gender from the ancient world to the present.", " ", "In order to distinguish what was distinctive about the earliest Islamic doctrine on women, Ahmed first describes the gender systems in place in the Middle East before the rise of Islam. She then focuses on those Arab societies that played a key role in elaborating the dominant Islamic discourses about women and gender: Arabia during the period in which Islam was founded; Iraq during the classical age, when the prescriptive core of legal and religious discourse on women was formulated; and Egypt during the nineteenth and twentieth centuries, when exposure to Western societies led to dramatic social change and to the emergence of new discourses on women. Throughout, Ahmed not only considers the Islamic texts in which central ideologies about women and gender developed or were debated but also places this discourse in its social and historical context. Her book is thus a fascinating survey of Islamic debates and ideologies about women and the historical circumstances of their position in society, the first such discussion using the analytic tools of contemporary gender studies."], "author": "Leila Ahmed", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-07-28 00:00:00", "ISBN": "0300055838"},
{"url": "https://www.goodreads.com/book/show/29930577-the-yard", "num_ratings": "40", "num_reviews": "26", "avg_ratings": 4.18, "genres": ["Fiction"], "title": "The Yard", "description": ["A story of love and redemption, set in Trinidad, that exposes the fault lines in Indo-Muslim culture. Behrooz is brought to a familial complex, The Yard, to live with a devout and extended family, where he struggles to belong. He forms a childish alliance with Maya, a wilful and rebellious girl, and his guardian’s daughter. After they share a night of adolescent tenderness", "A story of love and redemption, set in Trinidad, that exposes the fault lines in Indo-Muslim culture. Behrooz is brought to a familial complex, The Yard, to live with a devout and extended family, where he struggles to belong. He forms a childish alliance with Maya, a wilful and rebellious girl, and his guardian’s daughter. After they share a night of adolescent tenderness, Maya, fearing retribution, flees to London. Behrooz painstakingly rebuilds his life and marries another. When tragedy strikes, Maya returns to her childhood home. There, she and Behrooz must face up to old demons. Can their love endure? Even after Maya is dealt the most “righteous” blow of all?"], "author": "Aliyyah Eniath", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-04-10 00:00:00", "ISBN": "9385755080"},
{"url": "https://www.goodreads.com/book/show/29725377-blue-tide", "num_ratings": "99", "num_reviews": "34", "avg_ratings": 3.69, "genres": ["Adventure", "Pirates", "Fantasy", "Young Adult", "Romance", "Adventure"], "title": "Blue Tide", "description": ["Seventeen-year-old refugee Lux plots her escape from the island where her family is stranded, denying that her home was lost in the Floods. Lux is determined to get her old life back by any means possible. But before her feet even leave the sand, she's taken hostage by a vengeance-driven pirate nearly as young as she is.", "Captain Drave", "Seventeen-year-old refugee Lux plots her escape from the island where her family is stranded, denying that her home was lost in the Floods. Lux is determined to get her old life back by any means possible. But before her feet even leave the sand, she's taken hostage by a vengeance-driven pirate nearly as young as she is.", "Captain Draven’s scarf veils more than his face. Underneath, he struggles between morality and survival. When Lux sees deeper into his motivations, she’s torn. She can commit mutiny to escape to a home that may no longer exist, or she can try to help Draven escape the clutches of the person responsible for the deaths of half the world. Staying would mean entrusting her life to a pirate. Helping Draven would mean losing her heart to one."], "author": "Jenna-Lynne Duncan", "awards": ["RWA's Romancing the Lake"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-01-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/643719.Harem_Years", "num_ratings": "213", "num_reviews": "33", "avg_ratings": 3.53, "genres": ["History", "Biography", "Feminism", "Nonfiction", "Autobiography", "Memoir", "Gender"], "title": "Harem Years: The Memoirs of an Egyptian Feminist (1879-1924)", "description": ["The Women Writing Africa Series ", "The Women Writing Africa Series "], "author": "Huda Shaarawi", "num_pages": "158", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1986-08-16 00:00:00", "ISBN": "0860687384"},
{"url": "https://www.goodreads.com/book/show/2441475.Laughing_Without_an_Accent", "num_ratings": "2,773", "num_reviews": "419", "avg_ratings": 3.77, "genres": ["Nonfiction", "Autobiography", "Memoir", "Humor", "Cultural", "Iran", "Biography"], "title": "Laughing Without an Accent: Adventures of an Iranian American, at Home and Abroad", "description": ["In the bestselling memoir ", ", Firoozeh Dumas recounted her adventures growing up Iranian American in Southern California. Now she again mines her rich Persian heritage in ", ", sharing stories both tender and humorous on being a citizen of the world, on her well-meaning family, and on amusing cultural conundrums, all told with insights int", "In the bestselling memoir ", ", Firoozeh Dumas recounted her adventures growing up Iranian American in Southern California. Now she again mines her rich Persian heritage in ", ", sharing stories both tender and humorous on being a citizen of the world, on her well-meaning family, and on amusing cultural conundrums, all told with insights into the universality of the human condition. (Hint: It may have to do with brushing and flossing daily.)", "With dry wit and a bold spirit, Dumas puts her own unique mark on the themes of family, community, and tradition. She braves the uncommon palate of her French-born husband and learns the nuances of having her book translated for Persian audiences (the censors edit out all references to ham). And along the way, she reconciles her beloved Iranian customs with her Western ideals.", "Explaining crossover cultural food fare, Dumas says, “The weirdest American culinary marriage is yams with melted marshmallows. I don’t know who thought of this Thanksgiving tradition, but I’m guessing a hyperactive, toothless three-year-old.” On Iranian wedding anniversaries: “It just initially seemed odd to celebrate the day that ‘our families decided we should marry even though I had never met you, and frankly, it’s not working out so well.’” On trying to fit in with her American peers: “At the time, my father drove a Buick LeSabre, a fancy French word meaning ‘OPEC thanks you.’” ", "Dumas also documents her first year as a new mother, the familial chaos that ensues after she removes the television set from the house, the experience of taking fifty-one family members on a birthday cruise to Alaska, and a road trip to Iowa with an American once held hostage in Iran.", "Droll, moving, and relevant, Laughing ", " shows how our differences can unite us–and provides indelible proof that Firoozeh Dumas is a humorist of the highest order."], "author": "Firoozeh Dumas", "num_pages": "226", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-29 00:00:00", "ISBN": "0345499565"},
{"url": "https://www.goodreads.com/book/show/4688851-women-of-algiers-in-their-apartment", "num_ratings": "429", "num_reviews": "28", "avg_ratings": 3.64, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Northern Africa", "Algeria", "Feminism", "Cultural", "France", "Literature"], "title": "Women of Algiers in Their Apartment", "description": ["The cloth edition of Assia Djebar's Women of Algiers in Their Apartment, her first work to be published in English, was named by the American Literary Translators Association as an ALTA Outstanding Translation of the Year. Now available in paperback, this collection of three long stories, three short ones, and a theoretical postface by one of North Africa's leading writers", "The cloth edition of Assia Djebar's Women of Algiers in Their Apartment, her first work to be published in English, was named by the American Literary Translators Association as an ALTA Outstanding Translation of the Year. Now available in paperback, this collection of three long stories, three short ones, and a theoretical postface by one of North Africa's leading writers depicts the plight of urban Algerian women who have thrown off the shackles of colonialism only to face a postcolonial regime that denies and subjugates them even as it celebrates the liberation of men. Denounced in Algeria for its political criticism, Djebar's book quickly sold out its first printing of 15,000 copies in France and was hugely popular in Italy. Her stylistically innovative, lyrical stories address the cloistering of women, the implications of reticence, the connection of language to oppression, and the impact of war on both women and men. The Afterword by Clarisse Zimra includes an illuminating interview with Djebar."], "author": "Assia Djebar", "num_pages": "232", "awards": ["ALTA National Translation Award (1993)"], "places": ["Algiers"], "character_names": [], "language": "English", "publish_date": "1992-11-29 00:00:00", "ISBN": "0813914027"},
{"url": "https://www.goodreads.com/book/show/110106.My_Sister_Guard_Your_Veil_My_Brother_Guard_Your_Eyes", "num_ratings": "293", "num_reviews": "39", "avg_ratings": 3.8, "genres": ["Cultural", "Iran", "Nonfiction", "History", "Writing", "Essays", "Religion", "Islam", "Politics"], "title": "My Sister, Guard Your Veil; My Brother, Guard Your Eyes: Uncensored Iranian Voices", "description": ["In the first anthology of its kind, Lila Azam Zanganeh argues that although Iran looms large in the American imagination, it is grossly misunderstood-seen either as the third pillar of Bush's infamous \"axis of evil\" or as a nation teeming with youths clamoring for revolution.", "This collection showcases the real scope and complexity of Iran through the work of a stellar group", "In the first anthology of its kind, Lila Azam Zanganeh argues that although Iran looms large in the American imagination, it is grossly misunderstood-seen either as the third pillar of Bush's infamous \"axis of evil\" or as a nation teeming with youths clamoring for revolution.", "This collection showcases the real scope and complexity of Iran through the work of a stellar group of contributors-including Azar Nafisi and with original art by Marjane Satrapi. Their collective goal is to counter the many existing cultural and political clich�s about Iran. Some of the pieces concern feminism, sexuality, or eroticism under the Islamic Republic; others are unorthodox political testimonies or about race and religion. Almost all these contributors have broken artistic and cultural taboos in their work.", "Journalist Reza Aslan, author of ", " explains why Iran is not a theocracy but, rather, a \"mullahcracy.\" Mehrangiz Kar, a lawyer and human rights activist who was jailed in Iran and is currently a fellow at Harvard's Kennedy School of Government, argues that the Iranian Revolution actually engendered the birth of feminism in Iran. Journalist Azadeh Moaveni reveals the underground parties and sex culture in Tehran, while Gelareh Asayesh, author of ", " writes poignantly on why Iranians are not considered white in America, even though they think they are. Poet and writer Naghmeh Zarbafian expounds on the surreal experience of reading censored books in Iran, while Roya Hakakian, author of ", " recalls the happy days of Iranian Jews. With a sharp, incisive introduction by Lila Azam Zanganeh, this diverse collection will alter what you thought you knew about Iran.", "\"", " aims to corrode fixed ideas and turns cultural and political clich�s on their heads . . . Iranians themselves live in a complex and schizophrenic reality, at a surreal crossroads between political Islam and satellite television, massive national oil revenues, and searing social inequalities.\"--From the Introduction by Lila Azam Zanganeh", "Contributors include: Azar Nafisi, author of the best-selling ", ", Marjane Satrapi, author of ", ", Shirin Neshat, internationally acclaimed visual artist, Abbas Kiarostami, award-winning filmmaker of ", ", Shohreh Aghdashloo, Oscar nominee for ", ", Azadeh Moaveni, author of "], "author": "Lila Azam Zanganeh", "num_pages": "132", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0807004634"},
{"url": "https://www.goodreads.com/book/show/206228.Distant_View_of_a_Minaret_and_Other_Stories", "num_ratings": "468", "num_reviews": "59", "avg_ratings": 3.89, "genres": ["Short Stories", "Fiction", "Northern Africa", "Egypt", "Cultural", "Africa", "Feminism"], "title": "Distant View of a Minaret and Other Stories", "description": ["\"More convincingly than any other woman writing in Arabic today, Alifa Rifaat lifts the vil on what it means to be a women living within a traditional Muslim society.\" So states the translator's foreword to this collection of the Egyptian author's best short stories. Rifaat (1930-1996) did not go to university, spoke only Arabic, and seldom traveled abroad. This virtual im", "\"More convincingly than any other woman writing in Arabic today, Alifa Rifaat lifts the vil on what it means to be a women living within a traditional Muslim society.\" So states the translator's foreword to this collection of the Egyptian author's best short stories. Rifaat (1930-1996) did not go to university, spoke only Arabic, and seldom traveled abroad. This virtual immunity from Western influence lends a special authenticity to her direct yet sincere accounts of death, sexual fulfillment, the lives of women in purdah, and the frustrations of everyday life in a male-dominated Islamic environment.", "Translated from the Arabic by Denys Johnson-Davies, the collection admits the reader into a hidden private world, regulated by the call of the mosque, but often full of profound anguish and personal isolation. Badriyya's despariting anger at her deceitful husband, for example, or the hauntingly melancholy of \"At the Time of the Jasmine,\" are treated with a sensitivity to the discipline and order of Islam."], "author": "Alifa Rifaat", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-07-20 00:00:00", "ISBN": "0435909126"},
{"url": "https://www.goodreads.com/book/show/107824.The_Translator", "num_ratings": "1,350", "num_reviews": "226", "avg_ratings": 3.54, "genres": ["Fiction", "Cultural", "Africa", "Northern Africa", "Sudan", "Romance", "Novels", "Cultural", "Scotland"], "title": "The Translator", "description": ["American readers were introduced to the award-winning Sudanese author Leila Aboulela with ", ", a delicate tale of a privileged young African Muslim woman adjusting to her new life as a maid in London. Now, for the first time in North America, we step back to her extraordinarily assured debut about a widowed Muslim mother living in Aberdeen who falls in love with a Scot", "American readers were introduced to the award-winning Sudanese author Leila Aboulela with ", ", a delicate tale of a privileged young African Muslim woman adjusting to her new life as a maid in London. Now, for the first time in North America, we step back to her extraordinarily assured debut about a widowed Muslim mother living in Aberdeen who falls in love with a Scottish secular academic. Sammar is a Sudanese widow working as an Arabic translator at a Scottish university. Since the sudden death of her husband, her young son has gone to live with family in Khartoum, leaving Sammar alone in cold, gray Aberdeen, grieving and isolated. But when she begins to translate for Rae, a Scottish Islamic scholar, the two develop a deep friendship that awakens in Sammar all the longing for life she has repressed. As Rae and Sammar fall in love, she knows they will have to address his lack of faith in all that Sammar holds sacred. An exquisitely crafted meditation on love, both human and divine, ", " is ultimately the story of one woman’s courage to stay true to her beliefs, herself, and her newfound love."], "author": "Leila Aboulela", "num_pages": "208", "awards": ["Orange Prize Nominee for Fiction Longlist (2000)", "أمريكان بوكر (2000)", "Saltire Society Literary Award Nominee for Scottish First Book of the Year (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-14 00:00:00", "ISBN": "0802170269"},
{"url": "https://www.goodreads.com/book/show/5795512-where-the-streets-had-a-name", "num_ratings": "1,230", "num_reviews": "233", "avg_ratings": 3.76, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Contemporary"], "title": "Where the Streets Had a Name", "description": ["Thirteen-year-old Hayaat is on a mission. She believes a handful of soil from her grandmother's ancestral home in Jerusalem will save her beloved Sitti Zeynab's life. The only problem is the impenetrable wall that divides the West Bank, as well as the check points, the curfews, the permit system and Hayaat's best-friend Samy, who is mainly interested in football and the latest elimination on X-Factor, but always manages to attract trouble.", "But luck is on their side. Hayaat and Samy have a curfew-free day to travel to Jerusalem. However, while their journey may only be a few kilometres long, it may take a lifetime to complete."], "author": "Randa Abdel-Fattah", "num_pages": "286", "awards": ["The Inky Awards for Gold Inky (2009)", "The Inky Awards Shortlist for Gold Inky (2009)"], "places": ["Palestine", "West Bank"], "character_names": [], "language": "English", "publish_date": "2008-10-01 00:00:00", "ISBN": "0330424203"},
{"url": "https://www.goodreads.com/book/show/3873259-skunk-girl", "num_ratings": "461", "num_reviews": "93", "avg_ratings": 3.34, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Cultural", "Humor", "Contemporary"], "title": "Skunk Girl", "description": ["If Nina Khan were to rate herself on the unofficial Pakistani prestige point system – the one she's sure all the aunties and uncles use to determine the most attractive marriage prospects for their children – her scoring might go something like this: ", "for getting excellent grades ", "for failing to live up to expectations set by genius older sister ", "If Nina Khan were to rate herself on the unofficial Pakistani prestige point system – the one she's sure all the aunties and uncles use to determine the most attractive marriage prospects for their children – her scoring might go something like this: ", "for getting excellent grades ", "for failing to live up to expectations set by genius older sister ", "for dutifully obeying parents and never, ever going to parties, no matter how antisocial that makes her seem to everyone at Deer Hook High ", "for harboring secret jealousy of her best friends, who are allowed to date like normal teenagers ", "for never drinking an alcoholic beverage ", "for obsessing about Asher Richelli, who talks to Nina like she's not a freak at all, even though he knows that she has a disturbing line of hair running down her back", "In this wryly funny debut novel, the smart, sassy, and utterly lovable Nina Khan tackles friends, family, and love, and learns that it's possible to embrace two very different cultures – even if things can get a little bit, well, ", "."], "author": "Sheba Karim", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-31 00:00:00", "ISBN": "0374370117"},
{"url": "https://www.goodreads.com/book/show/948061.Sultana_s_Dream", "num_ratings": "699", "num_reviews": "115", "avg_ratings": 3.8, "genres": ["Feminism", "Fiction", "Short Stories", "Science Fiction", "Classics", "Fantasy"], "title": "Sultana's Dream", "description": ["The female narrator of ", " wanders into a dream city that shuns war and violence. In this utopian world, women rule and men are content with their places in the kitchen. The queen of this kingdom explains how women won and kept their peace against men and their war-like ways.", "This edition of a feminist utopian classic is a conversation across time; Durga Bai, a", "The female narrator of ", " wanders into a dream city that shuns war and violence. In this utopian world, women rule and men are content with their places in the kitchen. The queen of this kingdom explains how women won and kept their peace against men and their war-like ways.", "This edition of a feminist utopian classic is a conversation across time; Durga Bai, a contemporary tribal woman artist from Central India, brings her own vision to bear on a Muslim gentlewoman’s radical tale."], "author": "Rokeya Sakhawat Hossain", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-01 00:00:00", "ISBN": "8186211837"},
{"url": "https://www.goodreads.com/book/show/18505784-the-pearl-that-broke-its-shell", "num_ratings": "27,943", "num_reviews": "3,228", "avg_ratings": 4.13, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "The Pearl That Broke Its Shell", "description": ["Afghan-American Nadia Hashimi's literary debut novel, ", " is a searing tale of powerlessness, fate, and the freedom to control one's own fate that combines the cultural flavor and emotional resonance of the works of Khaled Hosseini, Jhumpa Lahiri, and Lisa See.", "In Kabul, 2007, with a drug-addicted father and no brothers, Rahima and her sisters can", "Afghan-American Nadia Hashimi's literary debut novel, ", " is a searing tale of powerlessness, fate, and the freedom to control one's own fate that combines the cultural flavor and emotional resonance of the works of Khaled Hosseini, Jhumpa Lahiri, and Lisa See.", "In Kabul, 2007, with a drug-addicted father and no brothers, Rahima and her sisters can only sporadically attend school, and can rarely leave the house. Their only hope lies in the ancient custom of bacha posh, which allows young Rahima to dress and be treated as a boy until she is of marriageable age. As a son, she can attend school, go to the market, and chaperone her older sisters.", "But Rahima is not the first in her family to adopt this unusual custom. A century earlier, her great-aunt, Shekiba, left orphaned by an epidemic, saved herself and built a new life the same way.", "Crisscrossing in time, ", " interweaves the tales of these two women separated by a century who share similar destinies. But what will happen once Rahima is of marriageable age? Will Shekiba always live as a man? And if Rahima cannot adapt to life as a bride, how will she survive?"], "author": "Nadia Hashimi", "num_pages": "452", "awards": ["Goodreads Choice Award Nominee for Fiction & for Debut Goodreads Author (2014)"], "places": ["Kabul"], "character_names": [], "language": "English", "publish_date": "2014-05-06 00:00:00", "ISBN": "0062244752"},
{"url": "https://www.goodreads.com/book/show/4101648-burnt-shadows", "num_ratings": "4,585", "num_reviews": "653", "avg_ratings": 3.89, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Japan", "Cultural", "Pakistan", "Cultural", "India", "War", "Cultural", "Asia"], "title": "Burnt Shadows", "description": ["Beginning on August 9, 1945, in Nagasaki, and ending in a prison cell in the US in 2002, as a man is waiting to be sent to Guantanamo Bay, Burnt Shadows is an epic narrative of love and betrayal.", "Hiroko Tanaka is twenty-one and in love with the man she is to marry, Konrad Weiss. As she steps onto her veranda, wrapped in a kimono with three black cranes swooping across the b", "Beginning on August 9, 1945, in Nagasaki, and ending in a prison cell in the US in 2002, as a man is waiting to be sent to Guantanamo Bay, Burnt Shadows is an epic narrative of love and betrayal.", "Hiroko Tanaka is twenty-one and in love with the man she is to marry, Konrad Weiss. As she steps onto her veranda, wrapped in a kimono with three black cranes swooping across the back, her world is suddenly and irrevocably altered. In the numbing aftermath of the atomic bomb that obliterates everything she has known, all that remains are the bird-shaped burns on her back, an indelible reminder of the world she has lost. In search of new beginnings, two years later, Hiroko travels to Delhi. It is there that her life will become intertwined with that of Konrad's half sister, Elizabeth, her husband, James Burton, and their employee Sajjad Ashraf, from whom she starts to learn Urdu. ", "With the partition of India, and the creation of Pakistan, Hiroko will find herself displaced once again, in a world where old wars are replaced by new conflicts. But the shadows of history--personal and political--are cast over the interrelated worlds of the Burtons, the Ashrafs, and the Tanakas as they are transported from Pakistan to New York and, in the novel's astonishing climax, to Afghanistan in the immediate wake of 9/11. The ties that have bound these families together over decades and generations are tested to the extreme, with unforeseeable consequences."], "author": "Kamila Shamsie", "num_pages": "384", "awards": ["Orange Prize Nominee for Fiction Shortlist (2009)", "Anisfield-Wolf Book Award (2010)"], "places": [], "character_names": ["Konrad", "Henry", "Liz", "Abdullah", "Kim", "Hiroko", "Sajjad", "Raza", "Mr. Burton"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0385666950"},
{"url": "https://www.goodreads.com/book/show/457864.Fantasia", "num_ratings": "757", "num_reviews": "76", "avg_ratings": 3.66, "genres": ["Fiction", "Cultural", "Africa", "Northern Africa", "Algeria", "Cultural", "France", "Historical", "Historical Fiction", "Literature"], "title": "Fantasia: An Algerian Cavalcade", "description": ["In this stunning novel, Assia Djebar intertwines the history of her native Algeria with episodes from the life of a young girl in a story stretching from the French conquest in 1830 to the War of Liberation of the 1950s. The girl, growing up in the old Roman coastal town of Cherchel, sees her life in contrast to that of a neighboring French family, and yearns for more than", "In this stunning novel, Assia Djebar intertwines the history of her native Algeria with episodes from the life of a young girl in a story stretching from the French conquest in 1830 to the War of Liberation of the 1950s. The girl, growing up in the old Roman coastal town of Cherchel, sees her life in contrast to that of a neighboring French family, and yearns for more than law and tradition allow her to experience. Headstrong and passionate, she escapes from the cloistered life of her family to join her brother in the maquis' fight against French domination. Djebar's exceptional descriptive powers bring to life the experiences of girls and women caught up in the dual struggle for independence - both their own and Algeria's."], "author": "Assia Djebar", "num_pages": "256", "awards": [], "places": ["Algeria"], "character_names": [], "language": "English", "publish_date": "1993-03-15 00:00:00", "ISBN": "0435086219"},
{"url": "https://www.goodreads.com/book/show/6642715-the-forty-rules-of-love", "num_ratings": "88,084", "num_reviews": "11,608", "avg_ratings": 4.16, "genres": ["Fiction", "Novels", "Historical", "Historical Fiction"], "title": "The Forty Rules of Love", "description": ["In this lyrical, exuberant follow-up to her 2007 novel, ", ", acclaimed Turkish author Elif Shafak unfolds two tantalizing parallel narratives—one contemporary and the other set in the thirteenth century, when Rumi encountered his spiritual mentor, the whirling dervish known as Shams of Tabriz—that together incarnate the poet's timeless message of love.", "In this lyrical, exuberant follow-up to her 2007 novel, ", ", acclaimed Turkish author Elif Shafak unfolds two tantalizing parallel narratives—one contemporary and the other set in the thirteenth century, when Rumi encountered his spiritual mentor, the whirling dervish known as Shams of Tabriz—that together incarnate the poet's timeless message of love.", " Ella Rubenstein is forty years old and unhappily married when she takes a job as a reader for a literary agent. Her first assignment is to read and report on ", ", a novel written by a man named Aziz Zahara. Ella is mesmerized by his tale of Shams's search for Rumi and the dervish's role in transforming the successful but unhappy cleric into a committed mystic, passionate poet, and advocate of love. She is also taken with Shams's lessons, or rules, that offer insight into an ancient philosophy based on the unity of all people and religions, and the presence of love in each and every one of us. As she reads on, she realizes that Rumi's story mir­rors her own and that Zahara—like Shams—has come to set her free."], "author": "Elif Shafak", "num_pages": "354", "awards": ["International DUBLIN Literary Award Nominee (2011)"], "places": [], "character_names": ["Rumi", "Shams-i Tabrizi"], "language": "English", "publish_date": "2010-02-18 00:00:00", "ISBN": "0670021458"},
{"url": "https://www.goodreads.com/book/show/1164291.The_Almond", "num_ratings": "1,273", "num_reviews": "133", "avg_ratings": 3.26, "genres": ["Fiction", "Adult Fiction", "Erotica", "Romance", "Cultural", "Africa"], "title": "The Almond", "description": ["Badra is a young Berber girl from a North African village who is married off to an old man, and brutally raped on her wedding night. She thinks sexual pleasure exists only for men, until she escapes from her cruel husband to the city. Then she meets a handsome doctor who i", "Badra is a young Berber girl from a North African village who is married off to an old man, and brutally raped on her wedding night. She thinks sexual pleasure exists only for men, until she escapes from her cruel husband to the city. Then she meets a handsome doctor who introduces her to a new world of sexual passion...", "L'Amande, written under a pseudonym by a North African woman living in France, reads like an erotic manifesto for modern women who want to break free from the bonds of cultural tradition and unashamedly demand their right to pleasure."], "author": "Nedjma", "awards": [], "places": ["Morocco"], "character_names": ["Badra", "Driss"], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0552772844"},
{"url": "https://www.goodreads.com/book/show/159604.Woman_at_Point_Zero", "num_ratings": "7,188", "num_reviews": "1,005", "avg_ratings": 3.99, "genres": ["Feminism", "Fiction", "Northern Africa", "Egypt", "Cultural", "Africa"], "title": "Woman at Point Zero", "description": ["From her prison cell, Firdaus, sentenced to die for having killed a pimp in a Cairo street, tells of her life from village childhood to city prostitute. Society's retribution for her act of defiance - death - she welcomes as the only way she can finally be free."], "author": "Nawal El-Saadawi", "num_pages": "112", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1997-09-15 00:00:00", "ISBN": "0862321107"},
{"url": "https://www.goodreads.com/book/show/89754.The_Girl_in_the_Tangerine_Scarf", "num_ratings": "1,187", "num_reviews": "204", "avg_ratings": 3.72, "genres": ["Fiction", "Religion", "Religion", "Islam", "Islam", "Muslims"], "title": "The Girl in the Tangerine Scarf", "description": ["Syrian immigrant Khadra Shamy is growing up in a devout, tightly knit Muslim family in 1970s Indiana, at the crossroads of bad polyester and Islamic dress codes. Along with her brother Eyad and her African-American friends, Hakim and Hanifa, she bikes the Indianapolis streets exploring the fault-lines between “Muslim” and “American.”", "When her picture-perfect marriage goes s", "Syrian immigrant Khadra Shamy is growing up in a devout, tightly knit Muslim family in 1970s Indiana, at the crossroads of bad polyester and Islamic dress codes. Along with her brother Eyad and her African-American friends, Hakim and Hanifa, she bikes the Indianapolis streets exploring the fault-lines between “Muslim” and “American.”", "When her picture-perfect marriage goes sour, Khadra flees to Syria and learns how to pray again. On returning to America she works in an eastern state — taking care to stay away from Indiana, where the murder of her friend Tayiba’s sister by Klan violence years before still haunts her. But when her job sends her to cover a national Islamic conference in Indianapolis, she’s back on familiar ground: Attending a concert by her brother’s interfaith band The Clash of Civilizations, dodging questions from the “aunties” and “uncles,” and running into the recently divorced Hakim everywhere.", "Beautifully written and featuring an exuberant cast of characters, ", " charts the spiritual and social landscape of Muslims in middle America, from five daily prayers to the Indy 500 car race. It is a riveting debut from an important new voice."], "author": "Mohja Kahf", "num_pages": "448", "awards": [], "places": ["Indiana", "Damascus"], "character_names": [], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "0786715197"},
{"url": "https://www.goodreads.com/book/show/13013007-love-inshallah", "num_ratings": "1,562", "num_reviews": "181", "avg_ratings": 3.83, "genres": ["Nonfiction", "Religion", "Islam", "Religion", "Autobiography", "Memoir", "Short Stories", "Feminism"], "title": "Love, InshAllah: The Secret Love Lives of American Muslim Women", "description": ["In this groundbreaking collection, American Muslim women writers sweep aside stereotypes to share their real-life tales of flirting, dating, longing, and sex. Their stories show just how varied the search for love can be—from singles' events and college flirtations to arranged marriages, all with a uniquely Muslim twist.", "These heartfelt tales are filled with passion and hop", "In this groundbreaking collection, American Muslim women writers sweep aside stereotypes to share their real-life tales of flirting, dating, longing, and sex. Their stories show just how varied the search for love can be—from singles' events and college flirtations to arranged marriages, all with a uniquely Muslim twist.", "These heartfelt tales are filled with passion and hope, loss and longing. One follows the quintessential single woman in the big city as she takes a chance on a Muslim speed-dating event. Another tells of a shy student from a liberal college town who falls in love online and must reveal her secret to her conservative family. A third recounts a Southern girl who surprises herself by agreeing to an arranged marriage, unexpectedly finding the love of her life.", "These compelling stories of love and romance create an irresistible balance of heart-warming and tantalizing, always revealing and deeply relatable."], "author": "Nura Maznavi", "num_pages": "290", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-02-17 00:00:00", "ISBN": "1593764286"},
{"url": "https://www.goodreads.com/book/show/68016.A_Border_Passage", "num_ratings": "826", "num_reviews": "72", "avg_ratings": 3.81, "genres": ["Nonfiction", "Autobiography", "Memoir", "Northern Africa", "Egypt", "Religion", "Islam", "Travel"], "title": "A Border Passage: From Cairo to America – A Woman's Journey", "description": ["A Border Passage: From Cairo to America--A Woman's Journey"], "author": "Leila Ahmed", "num_pages": "307", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-05 00:00:00", "ISBN": "0140291830"},
{"url": "https://www.goodreads.com/book/show/10429045-shatter-me", "num_ratings": "228,134", "num_reviews": "23,806", "avg_ratings": 3.99, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Romance", "Fantasy"], "title": "Shatter Me", "description": ["I have a gift", "I'm more than human", "My touch is power", "I will fight back", "Juliette hasn’t touched anyone in exactly 264 days.", "The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really car", "I have a gift", "I'm more than human", "My touch is power", "I will fight back", "Juliette hasn’t touched anyone in exactly 264 days.", "The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color.", "The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now.", "Juliette has to make a choice: Be a weapon. Or be a warrior."], "author": "Tahereh Mafi", "num_pages": "338", "awards": ["Arab American Book Award Nominee for Children's/Young Adult (2013)"], "places": [], "character_names": ["Adam Kent", "Juliette Ferrars", "Aaron Warner Anderson", "Kenji Kishimoto", "Castle"], "language": "English", "publish_date": "2011-11-15 00:00:00", "ISBN": "0062085484"},
{"url": "https://www.goodreads.com/book/show/400598.Leap_of_Faith_", "num_ratings": "8,435", "num_reviews": "722", "avg_ratings": 3.79, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir"], "title": "Leap of Faith : Memoirs of an Unexpected Life", "description": [" is the dramatic and inspiring story of an American woman's remarkable journey into the heart of a man and his nation. ", "Born into a distinguished Arab-American family and raised amid privilege, Lisa Halaby joined the first freshman class at Princeton to accept women, graduating in 1974 with a degree in architecture and urban planning. Two years later, while vis", " is the dramatic and inspiring story of an American woman's remarkable journey into the heart of a man and his nation. ", "Born into a distinguished Arab-American family and raised amid privilege, Lisa Halaby joined the first freshman class at Princeton to accept women, graduating in 1974 with a degree in architecture and urban planning. Two years later, while visiting her father in Jordan, she was casually introduced on the airport runway to King Hussein. Widely admired in the Arab world as a voice of moderation, and for his direct lineage to the prophet Muhammad, Hussein would soon become the world's most eligible bachelor after the tragic death of his wife. The next time they met, Hussein would fall headlong in love with the athletic, outspoken daughter of his longtime friend. After a whirlwind, secret courtship Lisa Halaby became Noor Al Hussein, Queen of Jordan.", "With eloquence and candor, Queen Noor speaks of the obstacles she faced as a naive young bride in the royal court, of rebelling against the smothering embrace of security guards and palace life, and of her own successful struggle to create a working role as a humanitarian activist in a court that simply expected Noor to keep her husband happy. As she gradually took on the mantle of a queen, Noor's joys and challenges grew. After a heartbreaking miscarriage, she gave birth to four children. Meshing the demands of motherhood with the commitments of her position often proved difficult, but she tried to keep her young children by her side, even while flying the world with her husband in his relentless quest for peace. This mission would reap satisfying rewards, including greater Arab unity and a peace treaty with Israel, and suffer such terrible setbacks as the Gulf War and the assassination of Prime Minister Rabin.", " is a remarkable document. It is the story of a young American woman who became wife and partner to an Arab monarch. It provides a compelling portrait of the late King Hussein and his lifelong effort to bring peace to his war-torn region, and an insider's view of the growing gulf between the United States and the Arab nations. It is also the refreshingly candid story of a mother coming to terms with the demands the king's role as a world statesman placed on her family's private life. But most of all it is a love story — the intimate account of a woman who lost her heart to a king, and to his people."], "author": "Noor Al-Hussein", "num_pages": "496", "awards": [], "places": [], "character_names": ["Noor of Jordan"], "language": "English", "publish_date": "2005-03-09 00:00:00", "ISBN": "1401359485"},
{"url": "https://www.goodreads.com/book/show/9516.Persepolis", "num_ratings": "131,716", "num_reviews": "7,505", "avg_ratings": 4.24, "genres": ["Sequential Art", "Graphic Novels", "Nonfiction", "Autobiography", "Memoir", "Sequential Art", "Comics", "Biography"], "title": "Persepolis: The Story of a Childhood", "description": ["A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, ye", "A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, years that saw the overthrow of the Shah’s regime, the triumph of the Islamic Revolution, and the devastating effects of war with Iraq. The intelligent and outspoken only child of committed Marxists and the great-granddaughter of one of Iran’s last emperors, Marjane bears witness to a childhood uniquely entwined with the history of her country.", " paints an unforgettable portrait of daily life in Iran and of the bewildering contradictions between home life and public life. Marjane’s child’s-eye view of dethroned emperors, state-sanctioned whippings, and heroes of the revolution allows us to learn as she does the history of this fascinating country and of her own extraordinary family. Intensely personal, profoundly political, and wholly original, ", " is at once a story of growing up and a reminder of the human cost of war and political repression. It shows how we carry on, with laughter and tears, in the face of absurdity. And, finally, it introduces us to an irresistible little girl with whom we cannot help but fall in love."], "author": "Marjane Satrapi", "num_pages": "153", "awards": ["Harvey Awards for Best US Edition of Foreign Material (2004)", "ALA Alex Award (2004)", "Prix du Festival d'Angoulême for Alph-art du coup de coeur (2001)"], "places": ["Iran, Islamic Republic of", "Tehran", "Persia"], "character_names": [], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "037571457X"},
{"url": "https://www.goodreads.com/book/show/206227.Minaret", "num_ratings": "1,969", "num_reviews": "254", "avg_ratings": 3.52, "genres": ["Fiction", "Northern Africa", "Sudan", "Religion", "Cultural", "Africa", "Religion", "Islam", "Islam", "Muslims", "Novels"], "title": "Minaret", "description": ["Leila Aboulela's American debut is a provocative, timely, and engaging novel about a young Muslim woman -- once privileged and secular in her native land and now impoverished in London -- gradually embracing her orthodox faith. ", "With her Muslim hijab and down-turned gaze, Najwa is invisible to most eyes, especially to the rich families whose houses she cleans in London. Twe", "Leila Aboulela's American debut is a provocative, timely, and engaging novel about a young Muslim woman -- once privileged and secular in her native land and now impoverished in London -- gradually embracing her orthodox faith. ", "With her Muslim hijab and down-turned gaze, Najwa is invisible to most eyes, especially to the rich families whose houses she cleans in London. Twenty years ago, Najwa, then at university in Khartoum, would never have imagined that one day she would be a maid. An upper-class Westernized Sudanese, her dreams were to marry well and raise a family. But a coup forces the young woman and her family into political exile in London. Soon orphaned, she finds solace and companionship within the Muslim community. Then Najwa meets Tamer, the intense, lonely younger brother of her employer. They find a common bond in faith and slowly, silently, begin to fall in love. ", "Written with directness and force, ", " is a lyric and insightful novel about Islam and an alluring glimpse into a culture Westerners are only just beginning to understand."], "author": "Leila Aboulela", "num_pages": "288", "awards": ["Orange Prize Nominee for Fiction Longlist (2006)"], "places": [], "character_names": ["Najwa"], "language": "English", "publish_date": "2005-08-19 00:00:00", "ISBN": "0802170145"},
{"url": "https://www.goodreads.com/book/show/28014409-jasmine-falling", "num_ratings": "39", "num_reviews": "16", "avg_ratings": 4.08, "genres": ["Fiction", "Did Not Finish"], "title": "Jasmine Falling", "description": ["When Jasmine’s mother dies inside their English mansion, hope comes in the form of her multi-million pound inheritance. But with her inheritance threatened, Jasmine is left to contemplate a future she does not know how to live. ", "Jasmine has only ten days to uncover the circumstances of her father’s decade long disappearance before her fortune is lost forever. Forced to retu", "When Jasmine’s mother dies inside their English mansion, hope comes in the form of her multi-million pound inheritance. But with her inheritance threatened, Jasmine is left to contemplate a future she does not know how to live. ", "Jasmine has only ten days to uncover the circumstances of her father’s decade long disappearance before her fortune is lost forever. Forced to return to his homeland in Palestine, she follows his footsteps through stories long ingrained in the local’s minds. She is helped on her journey by a mysterious stranger who guides her through the trails of the Holy Land to the scattered broken villages, each harbouring its own secrets. ", "Under the watchful eyes of the ever-encroaching Occupation, Jasmine must piece together her history in the broken land, before it destroys her future."], "author": "Shereen Malherbe", "num_pages": "158", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/151374.So_Long_a_Letter", "num_ratings": "5,441", "num_reviews": "453", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Senegal", "Literature", "African Literature", "Cultural", "France", "Feminism"], "title": "So Long a Letter", "description": ["This novel is in the form of a letter, written by the widowed Ramatoulaye and describing her struggle for survival. It is the winner of the Noma Award."], "author": "Mariama Bâ", "num_pages": "90", "awards": ["Noma Award for Publishing in Africa (1980)"], "places": ["Senegal"], "character_names": ["Ramatoulaye", "Aissatou", "Mawdo Ba", "Modou Fall", "Binetou"], "language": "English", "publish_date": "1989-06-28 00:00:00", "ISBN": "0435905554"},
{"url": "https://www.goodreads.com/book/show/530114._Believing_Women_in_Islam", "num_ratings": "962", "num_reviews": "34", "avg_ratings": 4.23, "genres": ["Religion", "Islam", "Religion", "Nonfiction", "Feminism", "Gender", "History", "Womens", "Philosophy", "Spirituality", "Politics"], "title": "\"Believing Women\" in Islam: Unreading Patriarchal Interpretations of the Qur'an", "description": ["Does Islam call for the oppression of women? Non-Muslims point to the subjugation of women that occurs in many Muslim countries, especially those that claim to be \"Islamic,\" while many Muslims read the Qur'an in ways that seem to justify sexual oppression, inequality, and patriarchy. Taking a wholly different view, Asma Barlas develops a believer's reading of the Qur'an th", "Does Islam call for the oppression of women? Non-Muslims point to the subjugation of women that occurs in many Muslim countries, especially those that claim to be \"Islamic,\" while many Muslims read the Qur'an in ways that seem to justify sexual oppression, inequality, and patriarchy. Taking a wholly different view, Asma Barlas develops a believer's reading of the Qur'an that demonstrates the radically egalitarian and antipatriarchal nature of its teachings.", "Beginning with a historical analysis of religious authority and knowledge, Barlas shows how Muslims came to read inequality and patriarchy into the Qur'an to justify existing religious and social structures and demonstrates that the patriarchal meanings ascribed to the Qur'an are a function of who has read it, how, and in what contexts. She goes on to reread the Qur'an's position on a variety of issues in order to argue that its teachings do not support patriarchy. To the contrary, Barlas convincingly asserts that the Qur'an affirms the complete equality of the sexes, thereby offering an opportunity to theorize radical sexual equality from within the framework of its teachings. This new view takes readers into the heart of Islamic teachings on women, gender, and patriarchy, allowing them to understand Islam through its most sacred scripture, rather than through Muslim cultural practices or Western media stereotypes."], "author": "Asma Barlas", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-06-01 00:00:00", "ISBN": "0292709048"},
{"url": "https://www.goodreads.com/book/show/177335.Dreams_of_Trespass", "num_ratings": "3,549", "num_reviews": "409", "avg_ratings": 3.84, "genres": ["Nonfiction", "Autobiography", "Memoir", "Northern Africa", "Morocco", "Feminism", "Cultural", "Africa", "Biography"], "title": "Dreams of Trespass: Tales of a Harem Girlhood", "description": ["”I was born in a harem in 1940 in Fez, Morocco...” So begins Fatima Mernissi in this exotic and rich narrative of a childhood behind the iron gates of a domestic harem. In ", ", Mernissi weaves her own memories with the dreams and memories of the women who surrounded her in the courtyard of her youth—women who, deprived of access to the world outside, recreat", "”I was born in a harem in 1940 in Fez, Morocco...” So begins Fatima Mernissi in this exotic and rich narrative of a childhood behind the iron gates of a domestic harem. In ", ", Mernissi weaves her own memories with the dreams and memories of the women who surrounded her in the courtyard of her youth—women who, deprived of access to the world outside, recreated it from sheer imagination. ", " is the provocative story of a girl confronting the mysteries of time and place, gender and sex in the recent Muslim world."], "author": "Fatema Mernissi", "num_pages": "242", "awards": [], "places": ["Morocco"], "character_names": [], "language": "English", "publish_date": "1995-09-04 00:00:00", "ISBN": "0201489376"},
{"url": "https://www.goodreads.com/book/show/3483356-in-the-land-of-invisible-women", "num_ratings": "6,076", "num_reviews": "819", "avg_ratings": 3.72, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Religion", "Religion", "Islam"], "title": "In the Land of Invisible Women: A Female Doctor's Journey in the Saudi Kingdom", "description": ["\"In this stunningly written book, a Western trained Muslim doctor brings alive what it means for a woman to live in the Saudi Kingdom. I've rarely experienced so vividly the shunning and shaming, racism and anti-Semitism, but the surprise is how Dr. Ahmed also finds tenderness at the tattered edges of extremism, and a life-changing pilgrimage back to her Muslim faith.\" - G", "\"In this stunningly written book, a Western trained Muslim doctor brings alive what it means for a woman to live in the Saudi Kingdom. I've rarely experienced so vividly the shunning and shaming, racism and anti-Semitism, but the surprise is how Dr. Ahmed also finds tenderness at the tattered edges of extremism, and a life-changing pilgrimage back to her Muslim faith.\" - Gail Sheehy ", "The decisions that change your life are often the most impulsive ones. ", "Unexpectedly denied a visa to remain in the United States, Qanta Ahmed, a young British Muslim doctor, becomes an outcast in motion. On a whim, she accepts an exciting position in Saudi Arabia. This is not just a new job; this is a chance at adventure in an exotic land she thinks she understands, a place she hopes she will belong. ", "What she discovers is vastly different. The Kingdom is a world apart, a land of unparralled contrast. She finds rejection and scorn in the places she believed would most embrace her, but also humor, honesty, loyalty and love. ", "And for Qanta, more than anything, it is a land of opportunity. A place where she discovers what it takes for one woman to recreate herself in the land of invisible women."], "author": "Qanta A. Ahmed", "num_pages": "454", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "1402210876"},
{"url": "https://www.goodreads.com/book/show/9526.Embroideries", "num_ratings": "15,984", "num_reviews": "1,458", "avg_ratings": 3.84, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "Autobiography", "Memoir", "Cultural", "Iran"], "title": "Embroideries", "description": ["From the best–selling author of ", " comes this gloriously entertaining and enlightening look into the sex lives of Iranian women. ", " gathers together Marjane’s tough–talking grandmother, stoic mother, glamorous and eccentric aunt and their friends and neighbors for an afternoon of tea drinking and talking. Naturally, the subject turns to love, sex and the", "From the best–selling author of ", " comes this gloriously entertaining and enlightening look into the sex lives of Iranian women. ", " gathers together Marjane’s tough–talking grandmother, stoic mother, glamorous and eccentric aunt and their friends and neighbors for an afternoon of tea drinking and talking. Naturally, the subject turns to love, sex and the vagaries of men.", "As the afternoon progresses, these vibrant women share their secrets, their regrets and their often outrageous stories about, among other things, how to fake one’s virginity, how to escape an arranged marriage, how to enjoy the miracles of plastic surgery and how to delight in being a mistress. By turns revealing and hilarious, these are stories about the lengths to which some women will go to find a man, keep a man or, most important, keep up appearances. ", "Full of surprises, this introduction to the private lives of some fascinating women, whose life stories and lovers will strike us as at once deeply familiar and profoundly different from our own, is sure to bring smiles of recognition to the faces of women everywhere—and to teach us all a thing or two."], "author": "Marjane Satrapi", "num_pages": "144", "awards": ["Urhunden Prize for Foreign Album (2007)"], "places": [], "character_names": ["Marjane Satrapi"], "language": "English", "publish_date": "2006-04-18 00:00:00", "ISBN": "0375714677"},
{"url": "https://www.goodreads.com/book/show/98920.The_Bastard_of_Istanbul", "num_ratings": "25,926", "num_reviews": "3,101", "avg_ratings": 3.8, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "Asian Literature", "Turkish Literature"], "title": "The Bastard of Istanbul", "description": ["From one of Turkey’s most acclaimed and outspoken writers, a novel about the tangled histories of two families.", "In her second novel written in English, Elif Shafak confronts her country’s violent past in a vivid and colorful tale set in both Turkey and the United States. At its center is the “bastard” of the title, Asya, a nineteen-year-old woman who loves Johnny Cash and t", "From one of Turkey’s most acclaimed and outspoken writers, a novel about the tangled histories of two families.", "In her second novel written in English, Elif Shafak confronts her country’s violent past in a vivid and colorful tale set in both Turkey and the United States. At its center is the “bastard” of the title, Asya, a nineteen-year-old woman who loves Johnny Cash and the French Existentialists, and the four sisters of the Kazanci family who all live together in an extended household in Istanbul: Zehila, the zestful, headstrong youngest sister who runs a tattoo parlor and is Asya’s mother; Banu, who has newly discovered herself as a clairvoyant; Cevriye, a widowed high school teacher; and Feride, a hypochondriac obsessed with impending disaster. Their one estranged brother lives in Arizona with his wife and her Armenian daughter, Armanoush. When Armanoush secretly flies to Istanbul in search of her identity, she finds the Kazanci sisters and becomes fast friends with Asya. A secret is uncovered that links the two families and ties them to the 1915 Armenian deportations and massacres. Full of vigorous, unforgettable female characters, The Bastard of Istanbul is a bold, powerful tale that will confirm Shafak as a rising star of international fiction."], "author": "Elif Shafak", "num_pages": "368", "awards": ["Orange Prize Nominee for Longlist (2008)"], "places": [], "character_names": ["Asya", "Armanoush"], "language": "English", "publish_date": "2007-01-18 00:00:00", "ISBN": "0670038342"},
{"url": "https://www.goodreads.com/book/show/7620760-the-butterfly-mosque", "num_ratings": "3,693", "num_reviews": "454", "avg_ratings": 4.06, "genres": ["Autobiography", "Memoir", "Nonfiction", "Religion", "Religion", "Islam"], "title": "The Butterfly Mosque", "description": ["The extraordinary story of a young North American's conversion to Islam and her ensuing romance with an Egyptian man, The Butterfly Mosque is a stunning articulation of a Westerner embracing the Muslim world ", "After graduating from university, Willow Wilson, a young American -- and newly converted Muslim -- impulsively accepts a teaching position in Cairo. There, she meets O", "The extraordinary story of a young North American's conversion to Islam and her ensuing romance with an Egyptian man, The Butterfly Mosque is a stunning articulation of a Westerner embracing the Muslim world ", "After graduating from university, Willow Wilson, a young American -- and newly converted Muslim -- impulsively accepts a teaching position in Cairo. There, she meets Omar, a passionate young nationalist with a degree in astrophysics. Omar introduces Willow to the bustling city, and through him she discovers a young, moderate nationalist movement, a movement that both wants to divest itself of western influence and regain cultural pride. When the two find themselves unexpectedly in love, despite their deep cultural differences, they decide that they will try to forge a third culture, a new landscape that will embrace some of each of their cultures, and give their fledgling romance some hope of survival. ", "Wilson weaves this engaging personal story with deep insights into faith in a fractured world, and gives westerners rare insight into an important young reform movement. Butterfly Mosque is an inspiring account of an unlikely cross-cultural love, and the moving story of two young people working within the boundaries of contemporary religion and culture to forge a life together against the odds."], "author": "G. Willow Wilson", "num_pages": "304", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "2010-06-01 00:00:00", "ISBN": "0771089341"},
{"url": "https://www.goodreads.com/book/show/16112413-reclaim-your-heart", "num_ratings": "5,047", "num_reviews": "814", "avg_ratings": 4.44, "genres": ["Religion", "Islam", "Nonfiction", "Self Help", "Religion"], "title": "Reclaim Your Heart: Personal Insights on Breaking Free from Life's Shackles", "description": ["Many of us live our lives entrapped by the same repeated patterns of heartbreak and disappointment. Often, we have no idea why this happens. Reclam Your Heart is about freeing the heart from this slavery. It is about the journey in and out of life's most deceptive traps."], "author": "Yasmin Mogahed", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-09 00:00:00", "ISBN": "0985751207"},
{"url": "https://www.goodreads.com/book/show/1476261.Girls_of_Riyadh", "num_ratings": "15,360", "num_reviews": "2,073", "avg_ratings": 3.19, "genres": ["Fiction", "Novels", "Romance"], "title": "Girls of Riyadh", "description": ["When Rajaa Alsanea boldly chose to open up the hidden world of Saudi women—their private lives and their conflicts with the traditions of their culture—she caused a sensation across the Arab world. ", "Now in English, Alsanea’s tale of the personal struggles of four young upper-class women offers Westerners an unprecedented glimpse into a society often veiled from view. Living", "When Rajaa Alsanea boldly chose to open up the hidden world of Saudi women—their private lives and their conflicts with the traditions of their culture—she caused a sensation across the Arab world. ", "Now in English, Alsanea’s tale of the personal struggles of four young upper-class women offers Westerners an unprecedented glimpse into a society often veiled from view. Living in restrictive Riyadh but traveling all over the globe, these modern Saudi women literally and figuratively shed traditional garb as they search for love, fulfillment, and their place somewhere in between Western society and their Islamic home."], "author": "Rajaa Alsanea", "num_pages": "320", "awards": [], "places": ["Riyadh"], "character_names": ["Qamrah", "Michelle", "Shedim", "Lumais", "Gamrah", "Sadeem", "Lamees"], "language": "English", "publish_date": "2007-07-05 00:00:00", "ISBN": "1905490208"},
{"url": "https://www.goodreads.com/book/show/13239822-alif-the-unseen", "num_ratings": "13,923", "num_reviews": "2,407", "avg_ratings": 3.84, "genres": ["Fantasy", "Fiction", "Science Fiction", "Fantasy", "Urban Fantasy"], "title": "Alif the Unseen", "description": ["In an unnamed Middle Eastern security state, a young Arab-Indian hacker shields his clients—dissidents, outlaws, Islamists, and other watched groups—from surveillance and tries to stay out of trouble. He goes by Alif—the first letter of the Arabic alphabet, and a convenient handle to hide behind. The aristocratic woman Alif loves has jilted him for a prince chosen by her p", "In an unnamed Middle Eastern security state, a young Arab-Indian hacker shields his clients—dissidents, outlaws, Islamists, and other watched groups—from surveillance and tries to stay out of trouble. He goes by Alif—the first letter of the Arabic alphabet, and a convenient handle to hide behind. The aristocratic woman Alif loves has jilted him for a prince chosen by her parents, and his computer has just been breached by the state’s electronic security force, putting his clients and his own neck on the line. Then it turns out his lover’s new fiancé is the \"Hand of God,\" as they call the head of state security, and his henchmen come after Alif, driving him underground. ", "When Alif discovers ", ", the secret book of the jinn, which both he and the Hand suspect may unleash a new level of information technology, the stakes are raised and Alif must struggle for life or death, aided by forces seen and unseen."], "author": "G. Willow Wilson", "num_pages": "433", "awards": ["Locus Award Nominee for Best First Novel (2013)", "World Fantasy Award for Best Novel (2013)", "Hammett Prize Nominee (2012)", "John W. Campbell Memorial Award Nominee (2013)", "Grand Prix de l'Imaginaire Nominee for Roman étranger (2014)", "Women's Prize for Fiction Nominee for Longlist (2013)", "The Center for Fiction First Novel Prize Nominee (2012)"], "places": ["Middle East"], "character_names": ["Dina", "Alif", "Vikram", "Abdullah", "Intisar", "Sheikh Bilal", "Princess Farukhauz", "The convert", "Prince Abu Talib Al Mukhtar ibn Hamza", "Abbas Al Shehab", "The marid"], "language": "English", "publish_date": "2012-06-19 00:00:00", "ISBN": "0802120202"},
{"url": "https://www.goodreads.com/book/show/9499393-love-in-a-headscarf", "num_ratings": "1,695", "num_reviews": "258", "avg_ratings": 3.68, "genres": ["Nonfiction", "Autobiography", "Memoir", "Religion", "Islam", "Religion", "Biography", "Romance"], "title": "Love in a Headscarf", "description": ["When Shelina Janmohamed, an Oxford-educated Muslim living in the bubbling ethnic mix of North London, opted for the traditional “arranged” route to finding a partner, she never suspected it would be the journey of her life.", "  ", " Through ten long years of matchmaking buxom aunties, countless mismatches, and outrageous dating disasters, Shelina discovers more about herself and", "When Shelina Janmohamed, an Oxford-educated Muslim living in the bubbling ethnic mix of North London, opted for the traditional “arranged” route to finding a partner, she never suspected it would be the journey of her life.", "  ", " Through ten long years of matchmaking buxom aunties, countless mismatches, and outrageous dating disasters, Shelina discovers more about herself and her faith. Along the way, she learns that sometimes being true to her religion means challenging tradition, while readers learn much about Islam that may surprise them. "], "author": "Shelina Zahra Janmohamed", "num_pages": "283", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-12 00:00:00", "ISBN": "0807000817"},
{"url": "https://www.goodreads.com/book/show/1035021.Ten_Things_I_Hate_About_Me", "num_ratings": "3,515", "num_reviews": "443", "avg_ratings": 3.6, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction", "Religion"], "title": "Ten Things I Hate About Me", "description": ["Randa Abdel-Fattah's new novel about finding your place in life . . . and learning to accept yourself and your culture.", "At school I'm Aussie-blonde Jamie -- one of the crowd. At home I'm Muslim Jamilah -- driven mad by my Stone Age dad. I should win an Oscar for my acting skills. But I can't keep it up for much longer...", "Jamie just wants to fit in. She doesn't want to be see", "Randa Abdel-Fattah's new novel about finding your place in life . . . and learning to accept yourself and your culture.", "At school I'm Aussie-blonde Jamie -- one of the crowd. At home I'm Muslim Jamilah -- driven mad by my Stone Age dad. I should win an Oscar for my acting skills. But I can't keep it up for much longer...", "Jamie just wants to fit in. She doesn't want to be seen as a stereotypical Muslim girl, so she does everything possible to hide that part of herself. Even if it means pushing her friends away because she's afraid to let them know her dad forbids her from hanging out with boys or that she secretly loves to play the darabuka (Arabic drums)."], "author": "Randa Abdel-Fattah", "num_pages": "320", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Novel (2009)"], "places": ["Australia"], "character_names": [], "language": "English", "publish_date": "2007-08-01 00:00:00", "ISBN": "043994371X"},
{"url": "https://www.goodreads.com/book/show/17851885-i-am-malala", "num_ratings": "291,136", "num_reviews": "16,826", "avg_ratings": 4.09, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Feminism"], "title": "I Am Malala: The Story of the Girl Who Stood Up for Education and Was Shot by the Taliban", "description": ["When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at p", "When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at point-blank range while riding the bus home from school, and few expected her to survive. ", "Instead, Malala's miraculous recovery has taken her on an extraordinary journey from a remote valley in northern Pakistan to the halls of the United Nations in New York. At sixteen, she has become a global symbol of peaceful protest and the youngest-ever Nobel Peace Prize laureate.", " is the remarkable tale of a family uprooted by global terrorism, of the fight for girls' education, of a father who, himself a school owner, championed and encouraged his daughter to write and attend school, and of brave parents who have a fierce love for their daughter in a society that prizes sons."], "author": "Malala Yousafzai", "num_pages": "327", "awards": ["Lincoln Award Nominee (2017)", "Goodreads Choice Award for Memoir & Autobiography (2013)"], "places": ["Lembah Swat"], "character_names": ["Malala Yousafzai"], "language": "English", "publish_date": "2013-10-08 00:00:00", "ISBN": "0316322407"},
{"url": "https://www.goodreads.com/book/show/7603.Reading_Lolita_in_Tehran", "num_ratings": "104,230", "num_reviews": "6,981", "avg_ratings": 3.59, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Reading Lolita in Tehran: A Memoir in Books", "author": "Azar Nafisi", "num_pages": "356", "awards": ["Book Sense Book of the Year Award for Adult Nonfiction (2004)", "Prix du Meilleur Livre Étranger for Essai (2004)"], "places": ["Iran, Islamic Republic of", "Persia"], "character_names": ["Azar Nafisi"], "language": "English", "publish_date": "2003-12-30 00:00:00", "ISBN": "081297106X"},
{"url": "https://www.goodreads.com/book/show/79876.Does_My_Head_Look_Big_in_This_", "num_ratings": "9,443", "num_reviews": "1,430", "avg_ratings": 3.65, "genres": ["Young Adult", "Fiction", "Contemporary", "Religion", "Realistic Fiction", "Young Adult", "Teen"], "title": "Does My Head Look Big in This?", "description": ["Sixteen-year-old Amal makes the decision to start wearing the hijab full-time and everyone has a reaction. Her parents, her teachers, her friends, people on the street. But she stands by her decision to embrace her faith and all that it is, even if it", "Sixteen-year-old Amal makes the decision to start wearing the hijab full-time and everyone has a reaction. Her parents, her teachers, her friends, people on the street. But she stands by her decision to embrace her faith and all that it is, even if it does make her a little different from everyone else.", "Can she handle the taunts of \"towel head,\" the prejudice of her classmates, and still attract the cutest boy in school? Brilliantly funny and poignant, Randa Abdel-Fattah's debut novel will strike a chord in all teenage readers, no matter what their beliefs."], "author": "Randa Abdel-Fattah", "num_pages": "360", "awards": ["Lincoln Award Nominee (2010)"], "places": ["Melbourne, Victoria"], "character_names": ["Amal"], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "0439919479"}
]