[
{"url": "https://www.goodreads.com/book/show/11235712-cinder", "num_ratings": "537,762", "num_reviews": "46,012", "avg_ratings": 4.15, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Science Fiction", "Dystopia"], "title": "Cinder", "description": ["Sixteen-year-old Cinder is considered a technological mistake by most of society and a burden by her stepmother. Being cyborg does have its benefits, though: Cinder's brain interference has given her an uncanny ability to fix things (robots, hovers, her own malfunctioning parts), making her the best mechanic in New Beijing. This reputation brings Prince Kai himself to her", "Sixteen-year-old Cinder is considered a technological mistake by most of society and a burden by her stepmother. Being cyborg does have its benefits, though: Cinder's brain interference has given her an uncanny ability to fix things (robots, hovers, her own malfunctioning parts), making her the best mechanic in New Beijing. This reputation brings Prince Kai himself to her weekly market booth, needing her to repair a broken android before the annual ball. He jokingly calls it \"a matter of national security,\" but Cinder suspects it's more serious than he's letting on.", "Although eager to impress the prince, Cinder's intentions are derailed when her younger stepsister, and only human friend, is infected with the fatal plague that's been devastating Earth for a decade. Blaming Cinder for her daughter's illness, Cinder's stepmother volunteers her body for plague research, an \"honor\" that no one has survived.", "But it doesn't take long for the scientists to discover something unusual about their new guinea pig. Something others would kill for."], "author": "Marissa Meyer", "num_pages": "390", "awards": ["Kalbacher Klapperschlange for Altersgruppe 7. - 9. Klasse (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2014)", "California Young Readers Medal for Young Adult (2016)", "Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2012)", "Rebecca Caudill Young Readers' Book Award Nominee (2016)"], "places": ["New Beijing"], "character_names": ["Linh Cinder", "Queen Levana", "Emperor Kai", "Iko", "Crescent Moon \"Cress\" Darnel", "Dr. Dmitri Erland", "Sybil Mira", "Linh Adri", "Linh Peony", "Linh Pearl"], "language": "English", "publish_date": "2012-01-03 00:00:00", "ISBN": "0312641893"},
{"url": "https://www.goodreads.com/book/show/32852217-the-hundredth-queen", "num_ratings": "18,909", "num_reviews": "1,352", "avg_ratings": 3.82, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction"], "title": "The Hundredth Queen", "description": ["As an orphan ward of the Sisterhood, eighteen-year-old Kalinda is destined for nothing more than a life of seclusion and prayer. Plagued by fevers, she’s an unlikely candidate for even a servant’s position, let alone a courtesan or wife. Her sole dream is to continue living in peace in the Sisterhood’s mountain temple.", "But a", "As an orphan ward of the Sisterhood, eighteen-year-old Kalinda is destined for nothing more than a life of seclusion and prayer. Plagued by fevers, she’s an unlikely candidate for even a servant’s position, let alone a courtesan or wife. Her sole dream is to continue living in peace in the Sisterhood’s mountain temple.", "But a visit from the tyrant Rajah Tarek disrupts Kalinda’s life. Within hours, she is ripped from the comfort of her home, set on a desert trek, and ordered to fight for her place among the rajah’s ninety-nine wives and numerous courtesans. Her only solace comes in the company of her guard, the stoic but kind Captain Deven Naik.", "Faced with the danger of a tournament to the death—and her growing affection for Deven—Kalinda has only one hope for escape, and it lies in an arcane, forbidden power buried within her."], "author": "Emily R. King", "num_pages": "287", "awards": [], "places": [], "character_names": ["Kalinda", "Deven Naik", "Natesa", "Jaya", "Rajah Tarek", "Brac Naik", "Brother Shaan", "Lakia", "Anjali", "Asha", "Hastin", "Yatin", "Gautam Naik", "Eshana", "Parisa", "Shyla", "Mathura", "Indira", "Manas", "Priestess Mita", "Falan", "Prita", "Sarita", "Healer Baka", "Hetal", "Bel", "Ehan", "Jeevan"], "language": "English", "publish_date": "2017-06-01 00:00:00", "ISBN": "1503943658"},
{"url": "https://www.goodreads.com/book/show/7113496-under-heaven", "num_ratings": "11,379", "num_reviews": "1,362", "avg_ratings": 4.13, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "China", "Historical Fiction", "Historical Fantasy"], "title": "Under Heaven", "description": ["Inspired by the glory of Tang Dynasty China in the eighth century, Guy Gavriel Kay melds history and the fantastic into something both powerful and emotionally compelling. ", " is a novel on the grandest narrative scale, encompassing the intimate details of individual lives in an unforgettable time and place. Shen Tai is the son of a general who led the forces of i", "Inspired by the glory of Tang Dynasty China in the eighth century, Guy Gavriel Kay melds history and the fantastic into something both powerful and emotionally compelling. ", " is a novel on the grandest narrative scale, encompassing the intimate details of individual lives in an unforgettable time and place. Shen Tai is the son of a general who led the forces of imperial Kitai in that empire's last war against their western enemies from Tagur, twenty years before. Forty thousand men on both sides were slain beside a remote mountain lake. General Shen Gao himself has died recently. To honour his father's memory, Tai has spent two years of official mourning alone at the battle site among the ghosts of the dead, laying to rest their unburied bones.", "One spring morning, he learns that others have taken note of his vigil. The White Jade Princess in Tagur is pleased to present him with two hundred and fifty Sardian horses, given, she writes, in recognition of his courage, and honour done to the dead.", " Two hundred and fifty is an unthinkable gift, a gift to overwhelm an emperor.", "Tai starts east towards the glittering, dangerous imperial capital and gathers his wits for a return from solitude by a mountain lake to his own forever-altered life."], "author": "Guy Gavriel Kay", "num_pages": "573", "awards": ["Locus Award Nominee for Best Fantasy Novel (2011)", "World Fantasy Award Nominee for Best Novel (2011)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2011)", "Sunburst Award for Adult (2011)", "Goodreads Choice Award Nominee for Fantasy (2010)", "Prix Elbakin.net for Meilleur roman fantasy traduit (2015)"], "places": ["China"], "character_names": [], "language": "English", "publish_date": "2010-03-30 00:00:00", "ISBN": "0670068098"},
{"url": "https://www.goodreads.com/book/show/631828.Paper_Mage", "num_ratings": "217", "num_reviews": "40", "avg_ratings": 3.43, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Young Adult", "Cultural", "China", "Did Not Finish", "Fantasy", "Magic", "Literature", "Asian Literature", "Novels"], "title": "Paper Mage", "description": ["In a small Chinese village during the Tang Dynasty, an unsure young woman has managed to elude the conventions of her society to become a gifted paper mage-one who creates magic with the ancient art of paper folding. Because her gifts are in demand for the protection they can offer, Xiao Yen must leave behind her beloved family and embark on a dangerous mission. Yet she ha", "In a small Chinese village during the Tang Dynasty, an unsure young woman has managed to elude the conventions of her society to become a gifted paper mage-one who creates magic with the ancient art of paper folding. Because her gifts are in demand for the protection they can offer, Xiao Yen must leave behind her beloved family and embark on a dangerous mission. Yet she has no idea that this looming adventure will shape the very woman she is to become."], "author": "Leah R. Cutter", "num_pages": "343", "awards": [], "places": ["China"], "character_names": [], "language": "English", "publish_date": "2003-03-04 00:00:00", "ISBN": "0451459172"},
{"url": "https://www.goodreads.com/book/show/21434857-planet-graxpiex", "num_ratings": "9", "num_reviews": "4", "avg_ratings": 3.78, "genres": [], "title": "Planet Graxpiex", "description": ["Novel fiksi ini menggambarkan bagaimana kehidupan yang terjadi di Planet Graxpiex. Kehidupan yang terjadi pada dua masa yaitu masa kehidupan Makhluk Zelosygos dan kehidupan sebelum mereka hidup. Dua masa ini saling terkait dan tidak bisa di pisahkan. Banyak pertempuran dan rahasia-rahasia zaman yang tidak di terungkap dan diketahui oleh Makhluk Zelosygos. Makhluk Zelosygos", "Novel fiksi ini menggambarkan bagaimana kehidupan yang terjadi di Planet Graxpiex. Kehidupan yang terjadi pada dua masa yaitu masa kehidupan Makhluk Zelosygos dan kehidupan sebelum mereka hidup. Dua masa ini saling terkait dan tidak bisa di pisahkan. Banyak pertempuran dan rahasia-rahasia zaman yang tidak di terungkap dan diketahui oleh Makhluk Zelosygos. Makhluk Zelosygos menganggap pertempuran dan rahasia zaman tersebut adalah suatu bentuk mitologi yang melegenda di kehidupan mereka."], "author": "Rudi Hilmanto", "num_pages": "467", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2014-02-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20518872-the-three-body-problem", "num_ratings": "69,047", "num_reviews": "8,352", "avg_ratings": 4.04, "genres": ["Science Fiction", "Fiction", "Cultural", "China"], "title": "The Three-Body Problem", "description": [" is the first chance for English-speaking readers to experience this multiple award winning phenomenon from China's most beloved science fiction author, Liu Cixin.", "\"Fans of hard SF will revel in this intricate and imaginative novel by one of China’s most celebrated genre writers. In 1967, physics professor Ye Zhetai is killed after he refuses to denoun", " is the first chance for English-speaking readers to experience this multiple award winning phenomenon from China's most beloved science fiction author, Liu Cixin.", "\"Fans of hard SF will revel in this intricate and imaginative novel by one of China’s most celebrated genre writers. In 1967, physics professor Ye Zhetai is killed after he refuses to denounce the theory of relativity. His daughter, Ye Wenjie, witnesses his gruesome death.", "\"Shortly after, she’s falsely charged with sedition for promoting the works of environmentalist Rachel Carson, and told she can avoid punishment by working at a defense research facility involved with the search for extraterrestrial intelligence. More than 40 years later, Ye’s work becomes linked to a string of physicist suicides and a complex role-playing game involving the classic physics problem of the title.", "\"Liu impressively succeeds in integrating complex topics—such as the field of frontier science, which attempts to define the limits of science’s ability to know nature—without slowing down the action or sacrificing characterization. His smooth handling of the disparate plot elements cleverly sets up the second volume of the trilogy.\" —"], "author": "Liu Cixin", "num_pages": "400", "awards": ["Hugo Award for Best Novel (2015)", "Nebula Award Nominee for Best Novel (2014)", "Locus Award Nominee for Best Science Fiction Novel (2015)", "John W. Campbell Memorial Award Nominee for Best Science Fiction Novel (2015)", "Prometheus Award Nominee for Best Novel (2015)"], "places": ["China", "Beijing", "Panama Canal"], "character_names": [], "language": "English", "publish_date": "2014-11-11 00:00:00", "ISBN": "0765377063"},
{"url": "https://www.goodreads.com/book/show/18952341-the-grace-of-kings", "num_ratings": "8,966", "num_reviews": "1,486", "avg_ratings": 3.74, "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy", "Did Not Finish", "Fantasy", "High Fantasy"], "title": "The Grace of Kings", "description": ["Two men rebel together against tyranny—and then become rivals—in this first sweeping book of an epic fantasy series from Ken Liu, recipient of Hugo, Nebula, and World Fantasy awards.", "Wily, charming Kuni Garu, a bandit, and stern, fearless Mata Zyndu, the son of a deposed duke, seem like polar opposites. Yet, in the uprising against the emperor, the two quickly become the be", "Two men rebel together against tyranny—and then become rivals—in this first sweeping book of an epic fantasy series from Ken Liu, recipient of Hugo, Nebula, and World Fantasy awards.", "Wily, charming Kuni Garu, a bandit, and stern, fearless Mata Zyndu, the son of a deposed duke, seem like polar opposites. Yet, in the uprising against the emperor, the two quickly become the best of friends after a series of adventures fighting against vast conscripted armies, silk-draped airships, and shapeshifting gods. Once the emperor has been overthrown, however, they each find themselves the leader of separate factions—two sides with very different ideas about how the world should be run and the meaning of justice.", "Fans of intrigue, intimate plots, and action will find a new series to embrace in the Dandelion Dynasty."], "author": "Ken Liu", "num_pages": "623", "awards": ["Nebula Award Nominee for Best Novel (2015)", "Locus Award for Best First Novel (2016)"], "places": [], "character_names": ["Kuni Garu", "Jia Matiza", "Mata Zyndu", "Luan Zya", "Gin Mazoti"], "language": "English", "publish_date": "2015-04-07 00:00:00", "ISBN": "1481424270"},
{"url": "https://www.goodreads.com/book/show/15755864-the-shadow-of-black-wings", "num_ratings": "375", "num_reviews": "64", "avg_ratings": 3.53, "genres": ["Fantasy", "Science Fiction", "Steampunk", "Fantasy", "Dragons", "Young Adult", "Science Fiction"], "title": "The Shadow of Black Wings", "description": ["The divination clock is broken. The Year of the Dragon is coming.", "In the midst of 19th century the world trembles before the might of the Dragon Throne’s ironclad navy and the dreaded Dragon Corps. A young dragon raider Bran joins a regiment of the Royal Marines, led by his estranged father, on a journey to the war-torn Orient.", "In the lands of Yamato, sealed behind the Divin", "The divination clock is broken. The Year of the Dragon is coming.", "In the midst of 19th century the world trembles before the might of the Dragon Throne’s ironclad navy and the dreaded Dragon Corps. A young dragon raider Bran joins a regiment of the Royal Marines, led by his estranged father, on a journey to the war-torn Orient.", "In the lands of Yamato, sealed behind the Divine Winds, conspiracy to overthrow its military dictator grows stronger. A timid shrine apprentice Nagomi is haunted by the visions of dark future. Her only friend Sato, a tomboy samurai, strives for the right to learn and teach the art of western magic.", "When Bran survives the sea disaster and gets separated from his bound-to–go-feral dragon, the paths of the East and West will cross in a way noone yet suspects..."], "author": "James Calbraith", "num_pages": "338", "awards": [], "places": [], "character_names": ["Bran ap Dylan gan Cantre'r Gwaelod", "Sato Takashima", "Nagomi Ito", "Dylan ab Ifor gan Cantre'r Gwaelod"], "language": "English", "publish_date": "2012-07-16 00:00:00", "ISBN": "8393552917"},
{"url": "https://www.goodreads.com/book/show/15177.Bridge_of_Birds", "num_ratings": "8,769", "num_reviews": "942", "avg_ratings": 4.29, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Humor", "Historical"], "title": "Bridge of Birds", "description": ["When the children of his village were struck with a mysterious illness, Number Ten Ox sought a wiseman to save them. He found master Li Kao, a scholar with a slight flaw in his character. Together, they set out to find the Great Root of Power, the only possible cure.", "The quest led them to a host of truly memorable characters, multiple wonders, incredible adventures—and stra", "When the children of his village were struck with a mysterious illness, Number Ten Ox sought a wiseman to save them. He found master Li Kao, a scholar with a slight flaw in his character. Together, they set out to find the Great Root of Power, the only possible cure.", "The quest led them to a host of truly memorable characters, multiple wonders, incredible adventures—and strange coincidences, which were really not coincidences at all. And it involved them in an ancient crime that still perturbed the serenity of Heaven. Simply and charmingly told, this is a wry tale, a sly tale, and a story of wisdom delightfully askew. Once read, its marvels and beauty will not easily fade from the mind.", "The author claims that this is a novel of an ancient China that never was. But, oh…it should have been!"], "author": "Barry Hughart", "num_pages": "278", "awards": ["World Fantasy Award for Best Novel (1985)", "Mythopoeic Fantasy Award (1986)"], "places": [], "character_names": [], "language": "English", "publish_date": "1985-04-12 00:00:00", "ISBN": "0345321383"},
{"url": "https://www.goodreads.com/book/show/6892626-toads-and-diamonds", "num_ratings": "2,626", "num_reviews": "315", "avg_ratings": 3.71, "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Retellings", "Fairy Tales", "Fairy Tale Retellings"], "title": "Toads and Diamonds", "description": ["Diribani has come to the village well to get water for her family's scant meal of curry and rice. She never expected to meet a goddess there. Yet she is granted a remarkable gift: Flowers and precious jewels drop from her lips whenever she speaks.", "It seems only right to Tana that the goddess judged her kind, lovely stepsister worthy of such riches. And when she encounters t", "Diribani has come to the village well to get water for her family's scant meal of curry and rice. She never expected to meet a goddess there. Yet she is granted a remarkable gift: Flowers and precious jewels drop from her lips whenever she speaks.", "It seems only right to Tana that the goddess judged her kind, lovely stepsister worthy of such riches. And when she encounters the goddess, she is not surprised to find herself speaking snakes and toads as a reward.", "Blessings and curses are never so clear as they might seem, however. Diribani's newfound wealth brings her a prince—and an attempt on her life. Tana is chased out of the village because the province's governor fears snakes, yet thousands are dying of a plague spread by rats. As the sisters' fates hang in the balance, each struggles to understand her gift. Will it bring her wisdom, good fortune, love . . . or death?", " is a 2011 Bank Street - Best Children's Book of the Year."], "author": "Heather Tomlinson", "num_pages": "288", "awards": ["Mythopoeic Fantasy Award Nominee for Children’s Literature (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-30 00:00:00", "ISBN": "0805089683"},
{"url": "https://www.goodreads.com/book/show/18760990-bald-new-world", "num_ratings": "223", "num_reviews": "97", "avg_ratings": 3.69, "genres": ["Science Fiction", "Science Fiction", "Dystopia", "Fiction", "Fantasy"], "title": "Bald New World", "description": ["Selected by Publishers Weekly as one of the Best Science Fiction Books of Summer 2014 and listed on Buzzfeed's 15 Highly Anticipated Books of 2014, Bald New World asks the question:", "What if everyone in the world lost their hair? ", "Nick Guan and his friend Larry Chao are a pair of eccentric filmmakers who choose to explore the existential angst of their balding world through c", "Selected by Publishers Weekly as one of the Best Science Fiction Books of Summer 2014 and listed on Buzzfeed's 15 Highly Anticipated Books of 2014, Bald New World asks the question:", "What if everyone in the world lost their hair? ", "Nick Guan and his friend Larry Chao are a pair of eccentric filmmakers who choose to explore the existential angst of their balding world through cinema. Larry is heir to one of the most lucrative wig companies in the world. Nick is a man who’s trying to make sense of the tatters of his American dream. Taking place throughout China and America, the pair set off on a series of misadventures involving North Korean spies, veterans of an African War, and digital cricket fighters. Their journey leads them to discover some of the darkest secrets behind wig-making and hair in a hairless world.", "\"After my heart gives out and I'm on the operating table for emergency surgery, I will have told my physicians and surgeons to replace my heart with Peter Tieryas Liu's Bald New World, or any of his books really, because that's what I think of when I think of Liu's writing--heart. Similar to the work of Philip K. Dick, this parodic dystopia is steeped in futuristic technology that further bridges the gap between man and machine. Still, whether watching the latest episode of the immensely popular reality show Jesus the General or sparring against an opponent in the blood-sport known as cricket fighting, the humanity of our narrator shines through. Although we humans are capable of doing and creating sad, funny, glorious, devious things, we also persevere and adapt, survive. I wonder what Huxley would think of this, but he's dead. You're not, so read this book, feel alive.\"", "-Jason Jordan, author of Pestilence, editor of decomP", "\"The boldly imaginative Bald New World follows Nicholas Guan, a military type tasked to digitally touch up scenes of carnage, in his misadventures from Korea to a futuristic California and in his frenzied dash from Gamble Town to China . The novel tells of beautifully flawed characters, the blurring distinction between reality and virtual environments, the comical yet chilling wave of religious fanaticism, and a world battling a strange malady called the Great Baldification, an ingenious symbol of human vanity. Peter Tieryas Liu’s Bald New World is vivid, exhilarating, and wildly entertaining.\" –Kristine Ong Muslim, author of We Bury the Landscape and Grim Series", "\"Bald New World is a hypnotic, surreal, and insightful novel, blending Blade Runner and The Wind-Up Bird Chronicle to create a dark, funny, and captivating story. One of the best books I've read this year.\"—Richard Thomas, Staring Into the Abyss"], "author": "Peter Tieryas", "num_pages": "214", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-16 00:00:00", "ISBN": "1782795081"},
{"url": "https://www.goodreads.com/book/show/7969452-fury-of-the-phoenix", "num_ratings": "934", "num_reviews": "158", "avg_ratings": 3.96, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction", "Adventure", "Young Adult", "Young Adult Fantasy"], "title": "Fury of the Phoenix", "description": ["The Gods have abandoned Ai Ling.", "Her mysterious power haunts her day and night, and she leaves home—with just the moon as her guide—overwhelmed by her memories and visions and an unbearable sense of dread. For Ai Ling knows that Chen Yong is vulnerable to corrupt enchantments from the under-world. How can she do nothing when she has the skill and power to fight at his side?", "The Gods have abandoned Ai Ling.", "Her mysterious power haunts her day and night, and she leaves home—with just the moon as her guide—overwhelmed by her memories and visions and an unbearable sense of dread. For Ai Ling knows that Chen Yong is vulnerable to corrupt enchantments from the under-world. How can she do nothing when she has the skill and power to fight at his side? A dream has told her where he is, the name of the ship he is traveling on, his destination. So she steals off and stows away on board.", "The ocean voyage brings with it brutal danger, haunting revelations, and new friendships, but also the premonition of a very real and terrifying threat. Zhong Ye—the powerful sorcerer whom Ai Ling believed she had vanquished in the Palace of Fragrant Dreams—is trapped in Hell, neither alive nor dead. Can he reach from beyond the grave to reunite with Silver Phoenix and destroy Chen Yong? And destroy whatever chance Ai Ling has at happiness, at love?", "In this sequel to the acclaimed novel ", ", four lives are woven together and four destinies become one, now and forever."], "author": "Cindy Pon", "num_pages": "362", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-29 00:00:00", "ISBN": "0061730254"},
{"url": "https://www.goodreads.com/book/show/30376044-a-mortal-song", "num_ratings": "534", "num_reviews": "208", "avg_ratings": 3.74, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Fiction"], "title": "A Mortal Song", "description": ["Sora's life was full of magic--until she discovered it was all a lie.", "Heir to Mt. Fuji's spirit kingdom, Sora yearns to finally take on the sacred kami duties. But just as she confronts her parents to make a plea, a ghostly army invades the mountain. Barely escaping with her life, Sora follows her mother's last instructions to a heart-wrenching discovery: she is a human cha", "Sora's life was full of magic--until she discovered it was all a lie.", "Heir to Mt. Fuji's spirit kingdom, Sora yearns to finally take on the sacred kami duties. But just as she confronts her parents to make a plea, a ghostly army invades the mountain. Barely escaping with her life, Sora follows her mother's last instructions to a heart-wrenching discovery: she is a human changeling, raised as a decoy while her parents' true daughter remained safe but unaware in modern-day Tokyo. Her powers were only borrowed, never her own. Now, with the world's natural cycles falling into chaos and the ghosts plotting an even more deadly assault, it falls on her to train the unprepared kami princess.", "As Sora struggles with her emerging human weaknesses and the draw of an unanticipated ally with secrets of his own, she vows to keep fighting for her loved ones and the world they once protected. But for one mortal girl to make a difference in this desperate war between the spirits, she may have to give up the only home she's ever known."], "author": "Megan Crewe", "num_pages": "382", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/37569318-empress-of-all-seasons", "num_ratings": "80", "num_reviews": "60", "avg_ratings": 4.19, "genres": ["Fantasy", "Young Adult"], "title": "Empress of All Seasons", "description": ["Each generation, a competition is held to find the next empress of Honoku. The rules are simple. Survive the palace’s enchanted seasonal rooms. Conquer Winter, Spring, Summer, and Fall. Marry the prince. All are eligible to compete—all except yōkai, supernatural monsters and spirits whom the human emperor is determined to", "Each generation, a competition is held to find the next empress of Honoku. The rules are simple. Survive the palace’s enchanted seasonal rooms. Conquer Winter, Spring, Summer, and Fall. Marry the prince. All are eligible to compete—all except yōkai, supernatural monsters and spirits whom the human emperor is determined to enslave and destroy. ", "Mari has spent a lifetime training to become empress. Winning should be easy. And it would be, if she weren't hiding a dangerous secret. Mari is a yōkai with the ability to transform into a terrifying monster. If discovered, her life will be forfeit. As she struggles to keep her true identity hidden, Mari’s fate collides with that of Taro, the prince who has no desire to inherit the imperial throne, and Akira, a half-human, half-yōkai outcast.", "Torn between duty and love, loyalty and betrayal, vengeance and forgiveness, the choices of Mari, Taro, and Akira will decide the fate of Honoku in this beautifully written, edge-of-your-seat YA fantasy."], "author": "Emiko Jean", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": null, "ISBN": "0544530942"},
{"url": "https://www.goodreads.com/book/show/34095402-of-faeries-and-demons", "num_ratings": "13", "num_reviews": "1", "avg_ratings": 4.38, "genres": ["Fantasy", "Thriller"], "title": "Of Faeries and Demons", "description": ["Jason Park has ambitions to create comic books about heroes. Little does he know that he might soon become one himself. It starts when he stumbles into the middle of a kidnapping plot and discovers that the strange book he inherited from his grandfather has magical properties. He ends up coming to the aid of Sora, an exiled fairy princess from the Korean Spirit World. Toge", "Jason Park has ambitions to create comic books about heroes. Little does he know that he might soon become one himself. It starts when he stumbles into the middle of a kidnapping plot and discovers that the strange book he inherited from his grandfather has magical properties. He ends up coming to the aid of Sora, an exiled fairy princess from the Korean Spirit World. Together they must save Sora's sister from the villains who kidnapped her. ", "Meanwhile, unbeknownst to either of them, a shape shifting nine-tailed fox spirit is hot on Jason's trail. She needs to recover the magical book for her employer in a bid to save her soul and become human. Deadly and wily, she will stop at nothing to get what she needs."], "author": "J. Young-Ju Harris", "num_pages": "68", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-01-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/774368.Tales_from_the_Thousand_and_One_Nights", "num_ratings": "1,225", "num_reviews": "65", "avg_ratings": 4.04, "genres": ["Classics", "Fiction", "Fantasy", "Short Stories"], "title": "Tales from the Thousand and One Nights", "author": "Anonymous", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1973-05-31 00:00:00", "ISBN": "0140442898"},
{"url": "https://www.goodreads.com/book/show/29213510-to-the-sky-kingdom", "num_ratings": "931", "num_reviews": "139", "avg_ratings": 3.9, "genres": ["Fantasy", "Romance", "Cultural", "China", "Cultural", "Asia"], "title": "To the Sky Kingdom", "description": ["When the immortal Bai Qian finally meets her intended husband, the heir to the Sky Throne, she considers herself in luck—until an old enemy returns to threaten everything she holds dear.…", "When a mortal woman enters the immortal world to be with her true love, she sparks a jealousy that ends in tragedy.…", "And when a war god depletes his spiritual energy, his devoted student su", "When the immortal Bai Qian finally meets her intended husband, the heir to the Sky Throne, she considers herself in luck—until an old enemy returns to threaten everything she holds dear.…", "When a mortal woman enters the immortal world to be with her true love, she sparks a jealousy that ends in tragedy.…", "And when a war god depletes his spiritual energy, his devoted student sustains his body with her own heart’s blood until the god’s scattered soul reassembles.…", "Spanning a thousand years of tangled lives, ", " is a story of epic battles, passion, evil, and magic. In its journey across worlds and time, it delves into the powerful forces that drive mortals and gods alike toward revenge, loyalty—and love."], "author": "Tang Qi", "num_pages": "458", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-23 00:00:00", "ISBN": "1503937429"},
{"url": "https://www.goodreads.com/book/show/1373315.Negima_Magister_Negi_Magi_Vol_1", "num_ratings": "3,915", "num_reviews": "101", "avg_ratings": 3.88, "genres": ["Sequential Art", "Manga", "Fantasy", "Sequential Art", "Graphic Novels", "Sequential Art", "Comics"], "title": "Negima! Magister Negi Magi, Vol. 1", "description": ["Ten-year-old prodigy Negi Springfield, has just graduated from magic academy. He dreams of becoming a master wizard. Instead he's sent to Japan to teach English . . . at an all-girls high school! All the students are delighted with their cute new teacher-except for Asuna, who resents Negi for replacing the teacher she secretly has a crush on. Although he is forbidden to di", "Ten-year-old prodigy Negi Springfield, has just graduated from magic academy. He dreams of becoming a master wizard. Instead he's sent to Japan to teach English . . . at an all-girls high school! All the students are delighted with their cute new teacher-except for Asuna, who resents Negi for replacing the teacher she secretly has a crush on. Although he is forbidden to display his magical powers, sometimes Negi can't resist. And when Asuna discovers Negi's secret, she vows to make his life as difficult as possible- just the thing to prepare Negi for the challenges of life as a master wizard!"], "author": "Ken Akamatsu", "num_pages": "190", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-27 00:00:00", "ISBN": "034547046X"},
{"url": "https://www.goodreads.com/book/show/26821631-ronin-games", "num_ratings": "567", "num_reviews": "28", "avg_ratings": 4.19, "genres": ["Comics", "Superheroes", "Fantasy", "Fiction", "Fantasy", "Urban Fantasy", "Science Fiction"], "title": "Ronin Games", "description": ["Astra has returned to Chicago and the everyday life of a cape: getting kittens out of trees, training, aiding the city’s emergency first-responders, training, doing public relations events, training, and the occasional superhero v. supervillain fight that threatens to level neighborhoods or at least set them on fire. ", "Then Astra takes a hard hit during a fight and very brie", "Astra has returned to Chicago and the everyday life of a cape: getting kittens out of trees, training, aiding the city’s emergency first-responders, training, doing public relations events, training, and the occasional superhero v. supervillain fight that threatens to level neighborhoods or at least set them on fire. ", "Then Astra takes a hard hit during a fight and very briefly finds herself somewhere else, somewhere she’s only been before in dreams and in the company of Kitsune, a shapeshifting trickster fox. Astra’s friends learn she is under the increasing influence of an otherworldy realm they know absolutely nothing about, and that she may even be drawn permanently into it. If they hope to stop it from happening, they must find Kitsune before it’s too late. ", "But to find Kitsune they must go to Japan, and Japan since doesn’t allow unsanctioned entry to foreign capes everything depends on secrecy. With no allies, few assets, and surprises at every turn, winning requires rewriting the rules and playing their own game. A ronin game. "], "author": "Marion G. Harmon", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-03 00:00:00", "ISBN": "1517503094"},
{"url": "https://www.goodreads.com/book/show/24816175-brazen", "num_ratings": "398", "num_reviews": "62", "avg_ratings": 3.89, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "Brazen", "description": ["Jae Hwa Lee spent her sixteenth year in Seoul, trying to destroy the evil immortals who had been torturing her family for centuries. The last thing she expected was to be forced to become their assassin. Trapped", "Jae Hwa Lee spent her sixteenth year in Seoul, trying to destroy the evil immortals who had been torturing her family for centuries. The last thing she expected was to be forced to become their assassin. Trapped in the darkest part of the Spirit World as a servant to the Korean god Kud, fighting to keep her humanity, and unable to contact her loved ones, Jae Hwa is slowly losing hope. Kud, god of darkness, will do anything to keep her as a pawn in his quest for power over all of Korea, her entire family thinks she’s dead, and Jae’s true love, Marc, believes she is lost to him forever.", "When Kud sends Jae to find and steal the powerful Black Turtle orb, Jae sees an opportunity to break free and defeat Kud once and for all…but first she needs to regain Marc’s trust and work with him to vanquish the darkness that threatens to overwhelm Korea. There’s much to lose as Jae struggles to save the land she’s come to call home."], "author": "Christina  Farley", "num_pages": "350", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-29 00:00:00", "ISBN": "1503945081"},
{"url": "https://www.goodreads.com/book/show/24535598-stepping-stones", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 5.0, "genres": [], "title": "Stepping Stones", "description": ["Stepping Stones picks up the story of Lek, her family and friends in the village of Baan Suay four years on from where The Lady in The Tree finished. ", "Lek and Ayr are still looking to expand, but especially Lek's career in the political arena, where she finds evidence of disturbing activity. ", "Craig is still trying to write a best seller and Soom has graduated from university", "Stepping Stones picks up the story of Lek, her family and friends in the village of Baan Suay four years on from where The Lady in The Tree finished. ", "Lek and Ayr are still looking to expand, but especially Lek's career in the political arena, where she finds evidence of disturbing activity. ", "Craig is still trying to write a best seller and Soom has graduated from university. ", "In Stepping Stones, we are introduced to the Champunot family from Bangkok, the members of which have a profound effect on Lek, Craig and Soom - one which none of them will ever be able to forget. ", "Stepping Stones reveals more in-depth details of life in a Thai family that has been affected by the inclusion of a falang like how they deal with the strange mixture of traditional and modern Thai life that that situation often creates. ", "'Behind The Smile' refers to the fact that Thailand is known the world over as 'The Land of Smiles'."], "author": "Owen  Jones", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24012150-the-acid-diary", "num_ratings": "21", "num_reviews": "4", "avg_ratings": 4.1, "genres": ["Fiction", "Cultural", "Japan"], "title": "The Acid Diary", "description": ["\"The Acid Diary: LSD, Thailand & The Heart of a Heartless World\"...", "Secluded on a Ko Pha Ngan beach and its loose hippy community, with no inland route in or out of the enclave, 25yr old English traveler \"Monkey Man\" seeks answers to the mysteries of existence, encountering hope and happiness, hypocrisy and hostility, love and loss, peace and discord, the quixotic, neur", "\"The Acid Diary: LSD, Thailand & The Heart of a Heartless World\"...", "Secluded on a Ko Pha Ngan beach and its loose hippy community, with no inland route in or out of the enclave, 25yr old English traveler \"Monkey Man\" seeks answers to the mysteries of existence, encountering hope and happiness, hypocrisy and hostility, love and loss, peace and discord, the quixotic, neurotic and psychotic alike along the way - aided and abetted by LSD, LSA, mescaline, MDMA, 25i-NBOMe, 2C-B, psilocybin mushrooms, cannabis, alcohol, tobacco and a whole host of the weird and wonderful, wacky and willing accomplices that gravitate to such places in Thailand and the tropics.", "A third novel by Daniel S. Fletcher, author of the well-received \"Jackboot Britain\"."], "author": "Daniel S. Fletcher", "num_pages": "428", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-14 00:00:00", "ISBN": "1502939096"},
{"url": "https://www.goodreads.com/book/show/24277073-das-schweigen-des-schnees", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "Das Schweigen des Schnees (Asa Monogatari, #1)", "description": ["DE: Abgeschieden vom Rest der Welt leben Yoru und seine Schwester Asa in den Nordbergen. Doch als Asa den Wolfsgeist Shiro aus einem Schneesturm rettet und fremde Krieger ihre Hütte angreifen, ahnt Yoru das Nahen einer Verschwörung, die sein Leben über den Haufen werfen wird. Ohne jegliche Skrupel versuchen Unbekannte, die sieben Siegel zu öffnen, die das Tor nach Yomi, zu", "DE: Abgeschieden vom Rest der Welt leben Yoru und seine Schwester Asa in den Nordbergen. Doch als Asa den Wolfsgeist Shiro aus einem Schneesturm rettet und fremde Krieger ihre Hütte angreifen, ahnt Yoru das Nahen einer Verschwörung, die sein Leben über den Haufen werfen wird. Ohne jegliche Skrupel versuchen Unbekannte, die sieben Siegel zu öffnen, die das Tor nach Yomi, zur Unterwelt, unter Verschluss halten. Es gibt nur noch einen, der die vollständige Öffnung des Tores und damit die Freisetzung von Susanoo, dem Gott der Stürme, und von Ashura, dem Chaos, verhindern kann; Yoru, den siebten Siegelträger. ", "E: Strangers try to break the seal that holde the gate to japanese underworld closed. There is only one hope in the fight against chaos and destruction: Yoru, carrier of the last seal.", "J: 不明な襲撃者は封じている黄泉の門の封印を開くつもりです。人間と妖怪の最後のチャンスである門を開くことや神々の戦争を止めりたい男。アレが月山(つきやま)の家長のヨル。父上を死んてしまった時から、ヨルは月山の七つ目の封印を相続してアサと言う妹とともに北の山間へ身を隠す。雪の嵐にアサはシロと言う狼を助けて、シロは彼女に忠誠を誓う。それ後、襲撃者はアサを拉致して、彼女を守るためにヨルとシロは一緒に威勢よく繰り出す。人間の男と狼はアサを救済することが出来るか。神々の戦争を止めれること出来るか。", "「雪の沈黙」は友達と冒険、愛、そして日本の神々についての物語。"], "author": "Bettina Bellmont", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "German", "publish_date": "2013-11-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7377087-shadow-magic", "num_ratings": "1,003", "num_reviews": "65", "avg_ratings": 3.85, "genres": ["Fantasy", "Science Fiction", "Steampunk", "Fiction", "Fantasy", "Dragons", "Lgbt", "Science Fiction Fantasy"], "title": "Shadow Magic", "description": ["Led to victory by its magic-fueled Dragon Corps, Volstov has sent a delegation to its conquered neighbors to work out the long-awaited terms of peace. Among those in the party are the decorated war hero General Alcibiades and the formerly exiled magician Caius Greylace. But even this mismatched pair can’t help but notice that their defeated enemies aren’t being very cooper", "Led to victory by its magic-fueled Dragon Corps, Volstov has sent a delegation to its conquered neighbors to work out the long-awaited terms of peace. Among those in the party are the decorated war hero General Alcibiades and the formerly exiled magician Caius Greylace. But even this mismatched pair can’t help but notice that their defeated enemies aren’t being very cooperative. The hidden truth is that the new emperor is harboring a treacherous secret—and once it is revealed, Alcibiades and Caius may be powerless to stop it. ", "With their only ally an exiled prince now fleeing his brother’s assassins, the countryside rife with terror, and Alcibiades and Caius all but prisoners, it will take the most powerful kind of magic to heal the rift between two strife-worn lands and unite two peoples against a common enemy: shadow magic."], "author": "Jaida Jones", "num_pages": "427", "awards": [], "places": [], "character_names": ["Caius Greylace"], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "055359138X"},
{"url": "https://www.goodreads.com/book/show/23119930-tales-from-an-israeli-storyteller", "num_ratings": "17", "num_reviews": "9", "avg_ratings": 4.47, "genres": ["Fantasy", "Cultural", "Israel"], "title": "Tales from an Israeli Storyteller", "description": ["Tales from an Israeli Storyteller is an illustrated cycle of 20 short stories and novellas born from exploring the most iconic locations in Israel. This is the story of the Israel you don’t hear about on the news – the Israel where an evil rabbi creates a smartass golem that comes back to haunt him during an unholy ceremony on Mount Meron, where talking animals search for", "Tales from an Israeli Storyteller is an illustrated cycle of 20 short stories and novellas born from exploring the most iconic locations in Israel. This is the story of the Israel you don’t hear about on the news – the Israel where an evil rabbi creates a smartass golem that comes back to haunt him during an unholy ceremony on Mount Meron, where talking animals search for justice among the demons and spirits of Ein Gedi, where a Bedouin hero confronts a reportedly evil book in the caves of Qumran, and where one clueless efreet keeps losing his wife in the Negev desert until a conscientious policeman comes to his rescue.", "While some of the characters are hard to meet, all the locations are real and very accessible, making this book a guide to some very cool places as well as a modern fantasy setting inspired by the folklore and mythology of one of the oldest (and youngest) countries in the world."], "author": "Uri Kurlianchik", "num_pages": "295", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20741911-amok", "num_ratings": "47", "num_reviews": "16", "avg_ratings": 3.7, "genres": ["Fantasy", "Short Stories", "Science Fiction", "Fiction", "Anthologies", "Speculative Fiction", "Cultural", "Asia", "Adult Fiction", "Science Fiction", "Dystopia"], "title": "Amok", "description": ["In an anthology that spans from India in the west to Hawai‘i in the east, and as far south as Australia and New Zealand, 24 authors bring you an exciting range of tales set in the past, present, and future.", "Discover characters like the Moon Rabbit from Chinese mythology, a kitsune from Japanese mythology, and the aswang from Filipino mythology.", "Find out what arises when a st", "In an anthology that spans from India in the west to Hawai‘i in the east, and as far south as Australia and New Zealand, 24 authors bring you an exciting range of tales set in the past, present, and future.", "Discover characters like the Moon Rabbit from Chinese mythology, a kitsune from Japanese mythology, and the aswang from Filipino mythology.", "Find out what arises when a struggling Malaysian student seeks help for her studies in Chinatown, and what happens when the garbage in the Pacific Ocean is seen as a valuable treasure.", "Futures imagined stretch from amazing advances in technology to depressing dystopias.", "Read these stories and so many more in Amok: An Anthology of Asia-Pacific Speculative Fiction.", "Featuring stories by:", "Brett Adams, Jo Wu, Kris Williamson, Recle Etino Vibal, Tabitha Sin, Ailia Hopkins, KZ Morano, TR Napper, Terence Toh, Kawika Guillermo, Barry Rosenberg, Eeleen Lee, Jax Goss, Jo Thomas, Daniel A. Kelin II, Fadzlishah Johanabas, Shenoa Carroll-Bradd, Dominica Malcolm, Aashika Nair, Celeste A. Peters, Agnes Ong, Rebecca Freeman, NJ Magas, and Tom Barlow"], "author": "Dominica Malcolm", "num_pages": "252", "awards": ["Aurealis Award Nominee for Best Anthology (Shortlist) (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-30 00:00:00", "ISBN": "0980508444"},
{"url": "https://www.goodreads.com/book/show/18325148-songs-in-the-year-of-the-cat", "num_ratings": "122", "num_reviews": "18", "avg_ratings": 4.43, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Fantasy", "Magic"], "title": "Songs in the Year of the Cat", "description": ["SONGS IN THE YEAR OF THE CAT is the Third in the Original Series by H. Leighton Dickson and picks up where TO WALK IN THE WAY OF LIONS leaves off. Ancestors are rising in the west and armies are moving from the North and the East. Captain Wynegarde-Grey has only just returned to the capital of the Upper Kingdom and he is immediately pulled into the conflict as cauldrons of", "SONGS IN THE YEAR OF THE CAT is the Third in the Original Series by H. Leighton Dickson and picks up where TO WALK IN THE WAY OF LIONS leaves off. Ancestors are rising in the west and armies are moving from the North and the East. Captain Wynegarde-Grey has only just returned to the capital of the Upper Kingdom and he is immediately pulled into the conflict as cauldrons of oil are burning all along the Great Wall and the drums of war force all soldiers back into duty. But a mysterious woman is changing things, manipulating behind the scenes as Sherah al Shiva, ninjaah and sorceress, slips back into his life with companions that could divide the known world. This is a sweeping post-apocalyptic tale of genetically altered lions and tigers, wolves and dragons in a world that has evolved in the wake of the fall of human civilization. Half feline, half human, their culture blends those of Dynastic China, Ancient India and Feudal Japan where humans are legend and kingdoms have risen in their stead. Fans of Tolkien, GAME OF THRONES, PLANET OF THE APES or Japanese anime will be entertained in these intelligent and beautifully written pages in a blend of science, fantasy and zoological speculation."], "author": "H. Leighton Dickson", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-04 00:00:00", "ISBN": "1491032758"},
{"url": "https://www.goodreads.com/book/show/17154783-the-guardians-of-karma", "num_ratings": "97", "num_reviews": "16", "avg_ratings": 3.54, "genres": ["Fantasy", "Historical", "Historical Fiction", "Cultural", "India", "Fiction"], "title": "The Guardians of Karma", "description": ["An intriguing science fiction fantasy set during prehistoric times beyond the mists of vedic India - the forgotten era of ‘first wave’ civilisations. This thought provoking story also reveals many fresh perspectives about the origins of Indian mythology and philosophy. ", "Is it possible that most of the land mass we live in today was under ice cover", "An intriguing science fiction fantasy set during prehistoric times beyond the mists of vedic India - the forgotten era of ‘first wave’ civilisations. This thought provoking story also reveals many fresh perspectives about the origins of Indian mythology and philosophy. ", "Is it possible that most of the land mass we live in today was under ice cover or permafrost during ice-age? On the other hand, could it be that much of the tropical land mass that could sustain abundant life during ice-age is actually under sea now? Could it be true that the SF like descriptions and philosophical discourses within Indian mythology are based on faint recollection of cultural memories regarding an advanced civilisation that flourished during ice-age but faded away during the global ice-melt or pralay? More at ", "Around 10500 BCE, planet Earth is still in the grip of the last ice age. With sea levels much lower than they are today, and mainland continents still largely covered with ice, the primary centres of Indian civilisation were dominated by two highly advanced tropical nation states – Dev Lok and Daityan Empire. Spiritually-inclined Devas lived in harmony with nature, whereas Daityas believed in brute force technologies for rapid prosperity and material gratification. Steady inundation of the tropical islands towards the end of ice-age created a crisis, particularly for Daityas. To fuel their hunger for material resources, the aggressive Daityas proceeded to invade other nations.", "Warrior monk Shiva becomes the sole hope of Dev Lok to prevent defeat and abject subjugation. However, before he can help them, Shiva must undertake the ultimate journey of spirituality to pass beyond the barrier of death itself and engage with the astral personae of Lord Rudra - one of three extra-terrestrial progenitors of humanity.", "This fast paced, action-packed mythological science fiction takes the readers through the exotic cities of Amaravati, Atalantpuri (Atlantis?), and traces the arduous journey to Mount Kailash through Sarparanya, within the backdrop of love, passion, greed, war, tragedy and spirituality that characterised those ancient times. Few chapters within the book also attempt to unfold the scientific concept and philosophy of Karma in the form of 'socratic dialogues'. ", "Will Shiva be able to check the Daityan aggression in time to correct the course of Karma? Will he be able to wield the viman ‘Pinaka’ against the central seat of Daityan power – the indestructible citadels of Tripura? Is he the one who will glorify the name of Lord Rudra as Tripurantaka – the mighty destroyer of Tripura?", "The paperback version of this book is now available at most online bookstores in India incl Flipkart."], "author": "M. Vizhakat", "num_pages": "328", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23168817-the-dark-forest", "num_ratings": "28,778", "num_reviews": "2,759", "avg_ratings": 4.4, "genres": ["Science Fiction", "Fiction"], "title": "The Dark Forest", "description": ["This is the second novel in \"Remembrance of Earth’s Past\", the near-future trilogy written by the China's multiple-award-winning science fiction author, Cixin Liu. ", "In ", ", Earth is reeling from the revelation of a coming alien invasion — four centuries in the future. The aliens' human collaborators have been defeated but the presence of the sophons, the subatom", "This is the second novel in \"Remembrance of Earth’s Past\", the near-future trilogy written by the China's multiple-award-winning science fiction author, Cixin Liu. ", "In ", ", Earth is reeling from the revelation of a coming alien invasion — four centuries in the future. The aliens' human collaborators have been defeated but the presence of the sophons, the subatomic particles that allow Trisolaris instant access to all human information, means that Earth's defense plans are exposed to the enemy. Only the human mind remains a secret. ", "This is the motivation for the Wallfacer Project, a daring plan that grants four men enormous resources to design secret strategies hidden through deceit and misdirection from Earth and Trisolaris alike. Three of the Wallfacers are influential statesmen and scientists but the fourth is a total unknown. Luo Ji, an unambitious Chinese astronomer and sociologist, is baffled by his new status. All he knows is that he's the one Wallfacer that Trisolaris wants dead."], "author": "Liu Cixin", "num_pages": "512", "awards": ["Goodreads Choice Award Nominee for Science Fiction (2015)"], "places": [], "character_names": ["Ye Wenjie", "Mike Evans", "Wu Yue", "Chang Weisi", "George Fitzroy", "Albert Ringier", "Zhang Yuanchao", "Yang Jinwen", "Miao Fuquan", "Shi Qiang", "Shi Xiaoming", "Kent", "Secretary General Say", "Frederick Tyler", "Manuel Rey Diaz", "Bill Hines", "Keiko Yamasuki", "Garanin", "Zhuang Yan", "Ben Jonathan", "Dongfang Yanxu", "Major Xizi", "ETO", "PDC", "SFJC", "Ding Yi", "Zhang Beihai", "Luo Ji"], "language": "English", "publish_date": "2015-08-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9814188-tag", "num_ratings": "220", "num_reviews": "49", "avg_ratings": 3.58, "genres": ["Science Fiction", "Thriller", "Fiction", "Mystery", "Thriller", "Mystery Thriller"], "title": "Tag", "description": ["In the wake of Arbitrator Jonah Oliver's interrogation of Jibril Muraz, a prisoner of UNPOL, his secure life disintegrates into one of lies, corruption, conspiracy and murder due to what he learns.", "Jonah is thrown into a race against the clock to stop a plot designed to eliminate two-thirds of the population. The odds are stacked against him. He soon finds his past is not w", "In the wake of Arbitrator Jonah Oliver's interrogation of Jibril Muraz, a prisoner of UNPOL, his secure life disintegrates into one of lies, corruption, conspiracy and murder due to what he learns.", "Jonah is thrown into a race against the clock to stop a plot designed to eliminate two-thirds of the population. The odds are stacked against him. He soon finds his past is not what he thought it was, those closest to him cannot be trusted, and what he’s learned could get him, or worse, his loved ones, killed. ", "On 15 March 2110, 6.3 billion people will die at the hand of one man.", "A man with a twisted vision, to make humans a better, more intelligent race.", "From a world where personal privacy has been forsaken comes a tale of conspiracy, love and murder – and the bond shared by brothers."], "author": "Simon Royle", "num_pages": "347", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-12-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/223379.The_Merchant_and_the_Alchemist_s_Gate", "num_ratings": "2,428", "num_reviews": "265", "avg_ratings": 4.27, "genres": ["Fantasy", "Science Fiction", "Short Stories", "Fiction", "Science Fiction", "Time Travel", "Historical", "Historical Fiction", "Science Fiction Fantasy", "Speculative Fiction", "Novella", "Science Fiction", "Steampunk"], "title": "The Merchant and the Alchemist's Gate", "description": ["In medieval Baghdad, a penniless man is brought before the most powerful man in the world, the caliph himself, to tell his story. It begins with a walk in the bazaar, but soon grows into a tale unlike any other told in the caliph's empire. It's a story that includes not just buried treasure and a band of thieves, but also men haunted by their past and others trapped by the", "In medieval Baghdad, a penniless man is brought before the most powerful man in the world, the caliph himself, to tell his story. It begins with a walk in the bazaar, but soon grows into a tale unlike any other told in the caliph's empire. It's a story that includes not just buried treasure and a band of thieves, but also men haunted by their past and others trapped by their future; it includes not just a beloved wife and a veiled seductress, but also long journeys taken by caravan and even longer ones taken with a single step. Above all, it's a story about recognizing the will of Allah and accepting it, no matter what form it takes."], "author": "Ted Chiang", "num_pages": "60", "awards": ["Hugo Award for Best Novelette (2008)", "Nebula Award for Best Novelette (2007)", "Seiun Award 星雲賞 for Best Foreign Story (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-07-01 00:00:00", "ISBN": "1596061006"},
{"url": "https://www.goodreads.com/book/show/13543172-the-dragon-men", "num_ratings": "196", "num_reviews": "22", "avg_ratings": 3.9, "genres": ["Science Fiction", "Steampunk", "Fantasy", "Romance", "Science Fiction Fantasy"], "title": "The Dragon Men", "description": ["As China prepares to become the ultimate power in an era of extraordinary invention and horror, Alice Michaels' fate lies inside the walls of the forbidden kingdom.... Gavin Ennock has everything a man could desire--except time. As the clockwork plague consumes his body and mind, it drives him increasingly mad and fractures his relationship with his fiancee, Alice, Lady Mi", "As China prepares to become the ultimate power in an era of extraordinary invention and horror, Alice Michaels' fate lies inside the walls of the forbidden kingdom.... Gavin Ennock has everything a man could desire--except time. As the clockwork plague consumes his body and mind, it drives him increasingly mad and fractures his relationship with his fiancee, Alice, Lady Michaels. Their only hope is that the Dragon Men of China can cure him. But a power-mad general has seized the Chinese throne in a determined offensive to conquer Asia, Britain--indeed, the entire world. He has closed the country's borders to all foreigners. The former ruling dynasty, however, is scheming to return the rightful heir to power. Their designs will draw Gavin and Alice down a treacherous path strewn with intrigue and power struggles. One wrong step will seal Gavin's fate...and determine the future of the world."], "author": "Steven Harper", "num_pages": "365", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-06 00:00:00", "ISBN": "0451464885"},
{"url": "https://www.goodreads.com/book/show/1244546.The_Dragon_s_Nine_Sons", "num_ratings": "118", "num_reviews": "31", "avg_ratings": 3.13, "genres": ["Science Fiction", "Science Fiction", "Alternate History", "Fiction", "Science Fiction Fantasy", "Space", "Space Opera"], "title": "The Dragon's Nine Sons", "description": ["A disgraced Chinese naval captain and a commando who knows secrets he should never have learned, are picked to lead a suicide mission. They must pilot a salvaged Mexica spacecraft to Xolotl, the asteroid stronghold of their enemies, armed with enough explosive to reduce the Mexica base to dust."], "author": "Chris Roberson", "num_pages": "429", "awards": ["Sidewise Award for Long Form (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-29 00:00:00", "ISBN": "1844165248"},
{"url": "https://www.goodreads.com/book/show/156787.Teranesia", "num_ratings": "1,066", "num_reviews": "67", "avg_ratings": 3.43, "genres": ["Science Fiction", "Fiction", "Speculative Fiction"], "title": "Teranesia", "description": ["Prabir Suresh and his younger sister, Madhursee, live in a remote paradise called Teranesia, where their biologist parents are studying an unexplained genetic mutation among the island's butterflies. Then civil war erupts across Indonesia, shattering their idyllic world and their lives.Twenty years later, Prabir is still plagued by feelings of guilt and an overwhelming res", "Prabir Suresh and his younger sister, Madhursee, live in a remote paradise called Teranesia, where their biologist parents are studying an unexplained genetic mutation among the island's butterflies. Then civil war erupts across Indonesia, shattering their idyllic world and their lives.Twenty years later, Prabir is still plagued by feelings of guilt and an overwhelming responsiblity for his sister, now a biologist herself. Against his advice, Madhurse is returning to Teranesia to solve the mystery of the butterflies and study strange new plant and animal species that have been emerging throughout the region-species seperated from their known cousins by dramatic mutations that seem far too efficient to have arisen by chance.", "Afraid for her safety, Prabir joins forces with independant scientist Martha Grant to find her. But what he will discover on Teranesia is far more dangerous and wondrous than he can ever fear--or imagine.."], "author": "Greg Egan", "num_pages": "352", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-11-01 00:00:00", "ISBN": "0061059803"},
{"url": "https://www.goodreads.com/book/show/3634216-planet-of-the-owls", "num_ratings": "12", "num_reviews": "3", "avg_ratings": 3.67, "genres": [], "title": "Planet of the Owls", "description": ["Oxford, England: Marcus (who works part-time at the falafel kiosk in town) awakens to find a giant black and white bird at his window. He's sure that's what he sees: a giant bird with feathers that throb with sinister portent. He shakes himself awake and gets ready for work, unaware that his world no longer exists. Beijing, China: Su-Ki Chin (a fourteen-year-old schoolgirl", "Oxford, England: Marcus (who works part-time at the falafel kiosk in town) awakens to find a giant black and white bird at his window. He's sure that's what he sees: a giant bird with feathers that throb with sinister portent. He shakes himself awake and gets ready for work, unaware that his world no longer exists. Beijing, China: Su-Ki Chin (a fourteen-year-old schoolgirl) stands at the bus stop with her schoolmates, but their bus never arrives. Returning home, she finds the family chickens have gone berserk, chasing her brothers around the yard and leaving her parents for dead. It's like she's in a dream-the chickens tower over her terrified brothers. She will soon become one of those hybrid birds. Planet of the Owls, a new genreclectic novel by UK-based artist/writer Mike Philbin, is a split-narrative story that tells of the time-and-space traveling powers of the Gods who have finally arrived on planet Earth in the guise of birds."], "author": "Hertzan Chimera", "num_pages": "172", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-01 00:00:00", "ISBN": "0981519148"},
{"url": "https://www.goodreads.com/book/show/531944.Salt_Fish_Girl", "num_ratings": "638", "num_reviews": "89", "avg_ratings": 3.68, "genres": ["Fiction", "Fantasy", "Science Fiction", "Glbt", "Queer", "Lgbt", "Cultural", "Canada", "Magical Realism"], "title": "Salt Fish Girl", "description": ["\"Salt Fish Girl\" is the mesmerizing tale of an ageless female character who shifts shape and form through time and place. Told in the beguiling voice of a narrator who is fish, snake, girl, and woman - all of whom must struggle against adversity for survival - the novel is set alternately in nineteenth-century China and in a futuristic Pacific Northwest.", "At turns whimsical", "\"Salt Fish Girl\" is the mesmerizing tale of an ageless female character who shifts shape and form through time and place. Told in the beguiling voice of a narrator who is fish, snake, girl, and woman - all of whom must struggle against adversity for survival - the novel is set alternately in nineteenth-century China and in a futuristic Pacific Northwest.", "At turns whimsical and wry, \"Salt Fish Girl\" intertwines the story of Nu Wa, the shape-shifter, and that of Miranda, a troubled young girl living in the walled city of Serendipity circa 2044. Miranda is haunted by traces of her mother's glamourous cabaret career, the strange smell of durian fruit that lingers about her, and odd tokens reminiscient of Nu Wa. Could Miranda be infected by the Dreaming Disease that makes the past leak into the present?", "Framed by a playful sense of magical realism, \"Salt Fish Girl\" reveals a futuristic Pacific Northwest where corporations govern cities, factory workers are cybernetically engineered, middle-class labour is a video game, and those who haven't sold out to commerce and other ills must fight the evil powers intent on controlling everything. Rich with ancient Chinese mythology and cultural lore, this remarkable novel is about gender, love, honour, intrigue, and fighting against oppression."], "author": "Larissa Lai", "num_pages": "269", "awards": ["James Tiptree Jr. Award Honor List (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-08-04 00:00:00", "ISBN": "0887621112"},
{"url": "https://www.goodreads.com/book/show/29387827-the-terracotta-bride", "num_ratings": "803", "num_reviews": "162", "avg_ratings": 3.89, "genres": ["Fantasy", "Short Stories", "Fiction", "Lgbt", "Novella", "Glbt", "Queer"], "title": "The Terracotta Bride", "description": [" ", "In the tenth court of hell, spirits wealthy enough to bribe the bureaucrats of the underworld can avoid both the torments of hell and the irreversible change of reincarnation. ", "It's a comfortable undeath … even for Siew Tsin. She didn't choose to be married to the richest man in hell, but s", " ", "In the tenth court of hell, spirits wealthy enough to bribe the bureaucrats of the underworld can avoid both the torments of hell and the irreversible change of reincarnation. ", "It's a comfortable undeath … even for Siew Tsin. She didn't choose to be married to the richest man in hell, but she's reconciled. Until her husband brings home a new bride. ", "Yonghua is an artificial woman crafted from terracotta. What she is may change hell for good. ", " she is will transform Siew Tsin. And as they grow closer, the mystery of Yonghua's creation will draw Siew Tsin into a conspiracy where the stakes are eternal life – or a very final death. ", "THE TERRACOTTA BRIDE is an 11,000-word standalone fantasy novelette."], "author": "Zen Cho", "num_pages": "51", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19253834-sunbolt", "num_ratings": "2,225", "num_reviews": "417", "avg_ratings": 4.22, "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic", "Fiction", "Paranormal", "Vampires"], "title": "Sunbolt", "description": ["The winding streets and narrow alleys of Karolene hide many secrets, and Hitomi is one of them. Orphaned at a young age, Hitomi has learned to hide her magical aptitude and who her parents really were. Most of all, she must conceal her role in the Shadow League, an underground movement working to undermine the powerful and corrupt Arch Mage Wilhelm Blackflame. ", "When the Lea", "The winding streets and narrow alleys of Karolene hide many secrets, and Hitomi is one of them. Orphaned at a young age, Hitomi has learned to hide her magical aptitude and who her parents really were. Most of all, she must conceal her role in the Shadow League, an underground movement working to undermine the powerful and corrupt Arch Mage Wilhelm Blackflame. ", "When the League gets word that Blackflame intends to detain—and execute—a leading political family, Hitomi volunteers to help the family escape. But there are more secrets at play than Hitomi’s, and much worse fates than execution. When Hitomi finds herself captured along with her charges, it will take everything she can summon to escape with her life."], "author": "Intisar Khanani", "num_pages": "142", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3053351-doctor-who", "num_ratings": "1,149", "num_reviews": "98", "avg_ratings": 3.89, "genres": ["Media Tie In", "Doctor Who", "Science Fiction", "Fiction", "Science Fiction", "Time Travel"], "title": "Doctor Who: Ghosts of India", "description": ["India in 1947 is a country in the grip of chaos - a country torn apart by internal strife. When the Doctor and Donna arrive in Calcutta, they are instantly swept up in violent events.", "Barely escaping with their lives, they discover that the city is rife with tales of 'half-made men', who roam the streets at night and steal people away. These creatures, it is said, are as wh", "India in 1947 is a country in the grip of chaos - a country torn apart by internal strife. When the Doctor and Donna arrive in Calcutta, they are instantly swept up in violent events.", "Barely escaping with their lives, they discover that the city is rife with tales of 'half-made men', who roam the streets at night and steal people away. These creatures, it is said, are as white as salt and have only shadows where their eyes should be.", "With help from India's great spiritual leader, Mohandas 'Mahatma' Gandhi, the Doctor and Donna set out to investigate these rumours.", "What is the real truth behind the 'half-made men'? Why is Gandhi's role in history under threat? And has an ancient, all-powerful god of destruction ", " come back to wreak his vengeance upon the Earth?", "The Doctor and Donna travel back in time to India, 1947 - the latest in the bestselling series of ", " novels.", "Featuring the Doctor and Donna as played by David Tennant and Catherine Tate in the hit series from BBC Television."], "author": "Mark Morris", "num_pages": "256", "awards": [], "places": [], "character_names": ["The Tenth Doctor", "The Doctor", "Donna Noble", "Racnoss"], "language": "English", "publish_date": "2008-09-04 00:00:00", "ISBN": "1846075599"},
{"url": "https://www.goodreads.com/book/show/92581.The_Chronicles_of_Master_Li_and_Number_Ten_Ox", "num_ratings": "1,511", "num_reviews": "143", "avg_ratings": 4.37, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction"], "title": "The Chronicles of Master Li and Number Ten Ox", "description": ["Omnibus edition including the three novels in the series."], "author": "Barry Hughart", "num_pages": "652", "awards": [], "places": [], "character_names": ["Master Li Kao", "Number Ten Ox"], "language": "English", "publish_date": "1998-01-01 00:00:00", "ISBN": "0966543602"},
{"url": "https://www.goodreads.com/book/show/13638462-the-crane-wife", "num_ratings": "6,176", "num_reviews": "1,122", "avg_ratings": 3.53, "genres": ["Fantasy", "Fiction", "Magical Realism", "Romance", "Adult", "Contemporary"], "title": "The Crane Wife", "description": ["The extraordinary happens every day...", "One night, George Duncan - decent man, a good man - is woken by a noise in his garden. Impossibly, a great white crane has tumbled to earth, shot through its wing by an arrow. Unexpectedly moved, George helps the bird, and from the moment he watches it fly off, his life is transformed.", "The next day, a kind but enigmatic woman walks into", "The extraordinary happens every day...", "One night, George Duncan - decent man, a good man - is woken by a noise in his garden. Impossibly, a great white crane has tumbled to earth, shot through its wing by an arrow. Unexpectedly moved, George helps the bird, and from the moment he watches it fly off, his life is transformed.", "The next day, a kind but enigmatic woman walks into George's shop. Suddenly a new world opens up for George, and one night she starts to tell him the most extraordinary story.", "Wise, romantic, magical and funny, The Crane Wife is a hymn to the creative imagination and a celebration of the disruptive and redemptive power of love."], "author": "Patrick Ness", "num_pages": "311", "awards": ["Andrew Carnegie Medal Nominee for Fiction (2015)"], "places": ["London, England"], "character_names": ["George Duncan"], "language": "English", "publish_date": "2013-04-04 00:00:00", "ISBN": "0857868713"},
{"url": "https://www.goodreads.com/book/show/16129295-the-goddess-chronicle", "num_ratings": "1,622", "num_reviews": "237", "avg_ratings": 3.65, "genres": ["Fantasy", "Fiction", "Cultural", "Japan", "Fantasy", "Mythology", "Asian Literature", "Japanese Literature"], "title": "The Goddess Chronicle", "description": ["From internationally bestselling crime writer Natsuo Kirino comes a mythical feminist noir about family secrets, broken loyalties, and the search from truth in a deceitful world.", "In a place like no other, on a mystical island in the shape of tear drop, two sisters are born into a family of oracles. Kamikuu is admired far and wide for her otherworldly beauty; small and heads", "From internationally bestselling crime writer Natsuo Kirino comes a mythical feminist noir about family secrets, broken loyalties, and the search from truth in a deceitful world.", "In a place like no other, on a mystical island in the shape of tear drop, two sisters are born into a family of oracles. Kamikuu is admired far and wide for her otherworldly beauty; small and headstrong Namima learns to live in her sister’s shadow. On her sixth birthday, Kamikuu is chosen to become the next Oracle, serving the realm of light, while Namima is forced to serve the realm of darkness—destined to spend eternity guiding the spirits of the deceased to the underworld.", "As the sisters serve opposite fates, Namima embarks on a journey that takes her from the experience of first love to the aftermath of scalding betrayal. Caught in an elaborate web of treachery, she travels between the land of the living and the Realm of the Dead, seeking vengeance and closure.", "At the heart of this exquisitely dark tale, Kirino masterfully reimagines the ancient Japanese creation myth of Izanami and Izanaki. A provocative, fantastical saga, ", " tells a sumptuous story of sex, murder, gods and goddesses, and bittersweet revenge."], "author": "Natsuo Kirino", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-23 00:00:00", "ISBN": "0802121098"},
{"url": "https://www.goodreads.com/book/show/1039593.Sword_of_the_Demon", "num_ratings": "56", "num_reviews": "9", "avg_ratings": 3.05, "genres": ["Fantasy", "Asian Literature", "Japanese Literature", "Science Fiction"], "title": "Sword of the Demon", "description": ["Cover Artist: KJ Bishop", "Through realms of oriental splender and superhuman conflict, a beautiful woman warrior and a fierce man-god journey to challenge a being more awesome than the gods for a magical sword that holds the power of death ... and the key to enlightenment."], "author": "Richard A. Lupoff", "num_pages": "174", "awards": ["Nebula Award Nominee for Novel (1977)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-07-01 00:00:00", "ISBN": "1587154145"},
{"url": "https://www.goodreads.com/book/show/4835.Haroun_and_the_Sea_of_Stories", "num_ratings": "25,609", "num_reviews": "2,105", "avg_ratings": 4.01, "genres": ["Fantasy", "Fiction", "Magical Realism", "Young Adult"], "title": "Haroun and the Sea of Stories", "description": ["Set in an exotic Eastern landscape peopled by magicians and fantastic talking animals, Salman Rushdie's classic children's novel ", " inhabits the same imaginative space as ", ", ", ", and ", "Set in an exotic Eastern landscape peopled by magicians and fantastic talking animals, Salman Rushdie's classic children's novel ", " inhabits the same imaginative space as ", ", ", ", and ", ". In this captivating work of fantasy from the author of ", " and ", ", Haroun sets out on an adventure to restore the poisoned source of the sea of stories. On the way, he encounters many foes, all intent on draining the sea of all its storytelling powers.  "], "author": "Salman Rushdie", "num_pages": "224", "awards": ["Mythopoeic Fantasy Award for Children's Literature (1992)"], "places": [], "character_names": ["Haroun"], "language": "English", "publish_date": "1999-08-27 00:00:00", "ISBN": "0670886580"},
{"url": "https://www.goodreads.com/book/show/9359818-god-s-war", "num_ratings": "3,953", "num_reviews": "668", "avg_ratings": 3.65, "genres": ["Science Fiction", "Fantasy", "Fiction"], "title": "God's War", "description": ["Nyx had already been to hell. One prayer more or less wouldn't make any difference...", "On a ravaged, contaminated world, a centuries-old holy war rages, fought by a bloody mix of mercenaries, magicians, and conscripted soldiers. Though the origins of the war are shady and complex, there's one thing everybody agrees on...", "There's not a chance in hell of ending it. ", "Nyx is a for", "Nyx had already been to hell. One prayer more or less wouldn't make any difference...", "On a ravaged, contaminated world, a centuries-old holy war rages, fought by a bloody mix of mercenaries, magicians, and conscripted soldiers. Though the origins of the war are shady and complex, there's one thing everybody agrees on...", "There's not a chance in hell of ending it. ", "Nyx is a former government assassin who makes a living cutting off heads for cash. But when a dubious deal between her government and an alien gene pirate goes bad, Nyx's ugly past makes her the top pick for a covert recovery. The head they want her to bring home could end the war--but at what price? ", "The world is about to find out."], "author": "Kameron Hurley", "num_pages": "288", "awards": ["Nebula Award Nominee for Best Novel (2011)", "Arthur C. Clarke Award Nominee (2014)", "British Science Fiction Association Award Nominee for Best Novel (2013)", "Gaylactic Spectrum Award Nominee for Best Novel (2012)", "The Kitschies for Golden Tentacle (Debut) (2011)", "James Tiptree Jr. Award Honor List (2011)"], "places": [], "character_names": ["Nyxnissa so Dasheem (Nyx)", "Rakhshan Arjoomand (Rhys)"], "language": "English", "publish_date": "2011-01-18 00:00:00", "ISBN": "159780214X"},
{"url": "https://www.goodreads.com/book/show/15799164-spirit-s-chosen", "num_ratings": "416", "num_reviews": "52", "avg_ratings": 3.7, "genres": ["Historical", "Historical Fiction", "Fantasy", "Young Adult", "Historical"], "title": "Spirit's Chosen", "description": ["Himiko's world is falling apart. An attack by the Ookami clan has left many from her tribe dead or enslaved. And those who remain in the ransacked Matsu village are certain they've angered the gods. Amid the chaos and fear, Himiko hatches a plan to save her beloved tribe. Traveling through the treacherous wilderness with her best friend Kaya, their only goal is to free her", "Himiko's world is falling apart. An attack by the Ookami clan has left many from her tribe dead or enslaved. And those who remain in the ransacked Matsu village are certain they've angered the gods. Amid the chaos and fear, Himiko hatches a plan to save her beloved tribe. Traveling through the treacherous wilderness with her best friend Kaya, their only goal is to free her clanfolk from the Ookami. At every turn she encounters other tribes and unforeseen challenges. But just when it seems that she will outwit Ryu, the cruel Ookami leader, she is captured. Held agains her will, Himiko starts to realize that not all of the Ookami are her enemies and every step of her unconventional journey has prepared her for something greater than life as a princess. Though she may not see her path as clearly as the spirits seem to, there's more adventure (and even unexpected love) for this young shamaness and warrior."], "author": "Esther M. Friesner", "num_pages": "496", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-04-23 00:00:00", "ISBN": "037596908X"},
{"url": "https://www.goodreads.com/book/show/11275.The_Wind_Up_Bird_Chronicle", "num_ratings": "177,084", "num_reviews": "11,741", "avg_ratings": 4.17, "genres": ["Fiction", "Magical Realism", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Fantasy"], "title": "The Wind-Up Bird Chronicle", "description": ["Japan's most highly regarded novelist now vaults into the first ranks of international fiction writers with this heroically imaginative novel, which is at once a detective story, an account of a disintegrating marriage, and an excavation of the buried secrets of World War II.", "In a Tokyo suburb a young man named Toru Okada searches for his wife's missing cat. Soon he finds h", "Japan's most highly regarded novelist now vaults into the first ranks of international fiction writers with this heroically imaginative novel, which is at once a detective story, an account of a disintegrating marriage, and an excavation of the buried secrets of World War II.", "In a Tokyo suburb a young man named Toru Okada searches for his wife's missing cat. Soon he finds himself looking for his wife as well in a netherworld that lies beneath the placid surface of Tokyo. As these searches intersect, Okada encounters a bizarre group of allies and antagonists: a psychic prostitute; a malevolent yet mediagenic politician; a cheerfully morbid sixteen-year-old-girl; and an aging war veteran who has been permanently changed by the hideous things he witnessed during Japan's forgotten campaign in Manchuria.", "Gripping, prophetic, suffused with comedy and menace, ", " is a tour de force equal in scope to the masterpieces of Mishima and Pynchon.", "Three books in one volume: The Thieving Magpie, Bird as Prophet, The Birdcatcher. This translation by Jay Rubin is in collaboration with the author."], "author": "Haruki Murakami", "num_pages": "607", "awards": ["Japan-U.S. Friendship Commission Prize for the Translation of Japanese Literature (1999)", "Yomiuri Prize 読売文学賞 for Fiction (1995)"], "places": ["Tokyo"], "character_names": ["Toru Okada", "Kumiko Okada", "Noboru Wataya", "Malta Kano", "May Kasahara", "Creta Kano", "Tokutaro Mamiya", "Nutmeg Akasaka", "Cinnamon Akasaka", "Boris Gromov", "Ushikawa"], "language": "English", "publish_date": "1997-08-16 00:00:00", "ISBN": "0965341984"},
{"url": "https://www.goodreads.com/book/show/16123804-the-fire-wish", "num_ratings": "1,811", "num_reviews": "283", "avg_ratings": 3.66, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Magic", "Fantasy", "Mythology"], "title": "The Fire Wish", "description": ["A jinni. A princess. And the wish that changes everything. . . . ", "Najwa is a jinni, training to be a spy in the war against the humans. Zayele is a human on her way to marry a prince of Baghdad—which she’ll do anything to avoid. So she captures Najwa and makes a wish. With a rush of smoke and fire, they fall apart and re-form—as each other. A jinni and a human, trading live", "A jinni. A princess. And the wish that changes everything. . . . ", "Najwa is a jinni, training to be a spy in the war against the humans. Zayele is a human on her way to marry a prince of Baghdad—which she’ll do anything to avoid. So she captures Najwa and makes a wish. With a rush of smoke and fire, they fall apart and re-form—as each other. A jinni and a human, trading lives. Both girls must play their parts among enemies who would kill them if the deception were ever discovered—enemies including the young men Najwa and Zayele are just discovering they might love."], "author": "Amber Lough", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-22 00:00:00", "ISBN": "038536976X"},
{"url": "https://www.goodreads.com/book/show/7785917-luka-and-the-fire-of-life", "num_ratings": "5,783", "num_reviews": "810", "avg_ratings": 3.62, "genres": ["Fantasy", "Fiction", "Young Adult", "Magical Realism", "Cultural", "India", "Adventure"], "title": "Luka and the Fire of Life", "description": ["With the same dazzling imagination and love of language that have made Salman Rushdie one of the great storytellers of our time, ", " revisits the magic-infused, intricate world he first brought to life in the modern classic ", " This breathtaking new novel centers on Luka, Haroun’s younger brother, who must save his father fr", "With the same dazzling imagination and love of language that have made Salman Rushdie one of the great storytellers of our time, ", " revisits the magic-infused, intricate world he first brought to life in the modern classic ", " This breathtaking new novel centers on Luka, Haroun’s younger brother, who must save his father from certain doom.", " For Rashid Khalifa, the legendary storyteller of Kahani, has fallen into deep sleep from which no one can wake him. To keep his father from slipping away entirely, Luka must travel to the Magic World and steal the ever-burning Fire of Life. Thus begins a quest replete with unlikely creatures, strange alliances, and seemingly insurmountable challenges as Luka and an assortment of enchanted companions race through peril after peril, pass through the land of the Badly Behaved Gods, and reach the Fire itself, where Luka’s fate, and that of his father, will be decided.", " Filled with mischievous wordplay and delving into themes as universal as the power of filial love and the meaning of mortality,", " is a book of wonders for all ages."], "author": "Salman Rushdie", "num_pages": "223", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "0679463364"},
{"url": "https://www.goodreads.com/book/show/368858.Effendi", "num_ratings": "708", "num_reviews": "30", "avg_ratings": 4.03, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Alternate History", "Fantasy", "Mystery", "Science Fiction", "Cyberpunk"], "title": "Effendi", "description": ["Masterfully blending speculative fiction and hard-boiled mystery, Jon Courtenay Grimwood's acclaimed Arabesk series plunges readers into a world eerily familiar and shockingly unpredictable. Here a troubled detective follows a trail of clues through a city where innocence itself may be a thing of the past....", "It's the twenty-first century and El Iskandryia--an alluring metr", "Masterfully blending speculative fiction and hard-boiled mystery, Jon Courtenay Grimwood's acclaimed Arabesk series plunges readers into a world eerily familiar and shockingly unpredictable. Here a troubled detective follows a trail of clues through a city where innocence itself may be a thing of the past....", "It's the twenty-first century and El Iskandryia--an alluring metropolis built on seduction, corruption, and lies--is the double-dealing heart of an Ottoman Empire that still rules the world. But these days a sense of dread hangs over El Isk--and over Ashraf Bey, the city's new Chief of Detectives. A trial is set to take place, and it's up to Raf to decide the case. There's only one problem: the suspect is the billionaire father of the woman Raf should have married.", "Industrialist Hamzah Effendi is accused of crimes so horrible that even El Iskandryia wants him eliminated. But Raf finds that protecting the sensual and impetuous Zara Quitrimala from the secrets of her father's past may be even more dangerous. For Raf must now solve a series of brutal murders that are somehow connected to the case--and to Zara. And the closer Raf gets to the truth, the more elusive the answers become--and the closer he comes to his own demise....", "Raymond Chandler for the 21st century.\" ", "\"All brilliant light and scorching heat...Grimwood has successfully mingled fantasy with reality to make an unusual, believable, and absorbing mystery.\"--", "(London)", "\"If you're not reading Jon Courtenay Grimwood, then you don't know how subtle and daring fiction can be.\" --Michael Marshall Smith, author of ", " and ", "\"Fast, furious, fun and elegant, the Arabesk trilogy is one of the best things to hit the bookstores in a while.\" --"], "author": "Jon Courtenay Grimwood", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0553587447"},
{"url": "https://www.goodreads.com/book/show/6993091-the-dervish-house", "num_ratings": "4,110", "num_reviews": "465", "avg_ratings": 3.85, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Cyberpunk", "Fantasy"], "title": "The Dervish House", "description": ["ISTANBUL: QUEEN OF CITIES. Here histories, empires, and continents meet and cross. It is the mid-twenty first century and Turkey is a proud and powerful member of a European Union that runs from the Atlantic to Mt. Ararat.", "In the sleepy Istanbul district of Eskiköy stands the former whirling dervish house of Adem Dede. Six characters' lives revolve around it.", "ISTANBUL: QUEEN OF CITIES. Here histories, empires, and continents meet and cross. It is the mid-twenty first century and Turkey is a proud and powerful member of a European Union that runs from the Atlantic to Mt. Ararat.", "In the sleepy Istanbul district of Eskiköy stands the former whirling dervish house of Adem Dede. Six characters' lives revolve around it.", " from the Greek community is hired into a top-security think tank, but keeps a dark secret from another century.", "confined to a silent world by a heart condition where any sudden sound could kill him, becomes a reluctant detective.", " sets up the deal o the century smuggling contraband gas but discovers it's only the tip of an iceberg of corporate fraud.", " takes an offer she can't refuse--a genuine legend of old Istanbul--and finds herself swept up in ancient intrigues and rivalries.", " finds his life forever changed after an act of urban terrorism gives him the ability to see djinn--and they're just the start.", " has five days to save a family nanotechnology start-up with a new product that may just change the world. ", "Over the space of five days of an Istanbul heat wave, these lives weave a story of corporate wheeling and dealing, Islamic mysticism, political and economic intrigues, ancient Ottoman mysteries, a terrifying new terrorist threat, and a nanotechnology with the potential to transform every human on the planet."], "author": "Ian McDonald", "num_pages": "358", "awards": ["Hugo Award Nominee for Best Novel (2011)", "Locus Award Nominee for Best Science Fiction Novel (2011)", "Arthur C. Clarke Award Nominee (2011)", "British Science Fiction Association Award for Best Novel (2010)", "John W. Campbell Memorial Award for Best Science Fiction Novel (2011)", "British Fantasy Award Nominee for Best Collection (2010)"], "places": [], "character_names": ["Can Durukan", "Georgios Ferentinou", "Adnan Sarioglu", "Ayse Erkoc", "Leyla Gultasli", "Necdet"], "language": "English", "publish_date": "2010-07-27 00:00:00", "ISBN": "1616142049"},
{"url": "https://www.goodreads.com/book/show/10374.Hard_Boiled_Wonderland_and_the_End_of_the_World", "num_ratings": "86,636", "num_reviews": "4,961", "avg_ratings": 4.15, "genres": ["Fiction", "Fantasy", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Magical Realism", "Science Fiction"], "title": "Hard-Boiled Wonderland and the End of the World", "description": ["'A narrative particle accelerator that zooms between Wild Turkey Whiskey and Bob Dylan, unicorn skulls and voracious librarians, John Coltrane and ", ". Science fiction, detective story and post-modern manifesto all rolled into one rip-roaring novel, ", " is the tour de force that expanded Haruki Murakami's international follo", "'A narrative particle accelerator that zooms between Wild Turkey Whiskey and Bob Dylan, unicorn skulls and voracious librarians, John Coltrane and ", ". Science fiction, detective story and post-modern manifesto all rolled into one rip-roaring novel, ", " is the tour de force that expanded Haruki Murakami's international following. Tracking one man's descent into the Kafkaesque underworld of contemporary Tokyo, Murakami unites East and West, tragedy and farce, compassion and detachment, slang and philosophy.'"], "author": "Haruki Murakami", "num_pages": "400", "awards": ["Tanizaki Prize 谷崎潤一郎賞 (1985)", "Tähtifantasia Award Nominee (2016)", "Seiun Award 星雲賞 Nominee for Best Japanese Novel (1986)"], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "2001-09-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16248223-the-ghost-bride", "num_ratings": "15,417", "num_reviews": "2,667", "avg_ratings": 3.74, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Romance", "Fantasy", "Paranormal", "Historical", "Paranormal", "Ghosts", "Cultural", "China"], "title": "The Ghost Bride", "description": ["Though ruled by British overlords, the Chinese of colonial Malaya still cling to ancient customs. And in the sleepy port town of Malacca, ghosts and superstitions abound.", "Li Lan, the daughter of a genteel but bankrupt family, has few prospects. But fate intervenes when she receives an unusual propos", "Though ruled by British overlords, the Chinese of colonial Malaya still cling to ancient customs. And in the sleepy port town of Malacca, ghosts and superstitions abound.", "Li Lan, the daughter of a genteel but bankrupt family, has few prospects. But fate intervenes when she receives an unusual proposal from the wealthy and powerful Lim family. They want her to become a ghost bride for the family's only son, who recently died under mysterious circumstances. Rarely practiced, a traditional ghost marriage is used to placate a restless spirit. Such a union would guarantee Li Lan a home for the rest of her days, but at a terrible price.", "After an ominous visit to the opulent Lim mansion, Li Lan finds herself haunted not only by her ghostly would-be suitor, but also by her desire for the Lim's handsome new heir, Tian Bai. Night after night, she is drawn into the shadowy parallel world of the Chinese afterlife, with its ghost cities, paper funeral offerings, vengeful spirits and monstrous bureaucracy—including the mysterious Er Lang, a charming but unpredictable guardian spirit. Li Lan must uncover the Lim family's darkest secrets—and the truth about her own family—before she is trapped in this ghostly world forever."], "author": "Yangsze Choo", "num_pages": "368", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2014)", "Shirley Jackson Award Nominee for Novel (Finalist) (2013)", "Goodreads Choice Award Nominee for Fantasy (2013)", "Carnegie Medal Nominee (2014)"], "places": ["Melaka"], "character_names": ["Li Lan", "Tian Bai", "Lim Tian Ching", "Yan Hong", "Er Lang"], "language": "English", "publish_date": "2013-08-06 00:00:00", "ISBN": "0062227327"},
{"url": "https://www.goodreads.com/book/show/10357575-1q84", "num_ratings": "157,724", "num_reviews": "15,092", "avg_ratings": 3.9, "genres": ["Fiction", "Fantasy", "Magical Realism", "Cultural", "Japan", "Science Fiction", "Asian Literature", "Japanese Literature"], "title": "1Q84", "description": ["A young woman named Aomame follows a taxi driver’s enigmatic suggestion and begins to notice puzzling discrepancies in the world around her. She has entered, she realizes, a parallel existence, which she calls 1Q84 —“Q is for ‘question mark.’ A world that bears a question.” Meanwhile, an aspiring writer named Tengo takes on a suspect", "A young woman named Aomame follows a taxi driver’s enigmatic suggestion and begins to notice puzzling discrepancies in the world around her. She has entered, she realizes, a parallel existence, which she calls 1Q84 —“Q is for ‘question mark.’ A world that bears a question.” Meanwhile, an aspiring writer named Tengo takes on a suspect ghostwriting project. He becomes so wrapped up with the work and its unusual author that, soon, his previously placid life begins to come unraveled. ", "As Aomame’s and Tengo’s narratives converge over the course of this single year, we learn of the profound and tangled connections that bind them ever closer: a beautiful, dyslexic teenage girl with a unique vision; a mysterious religious cult that instigated a shoot-out with the metropolitan police; a reclusive, wealthy dowager who runs a shelter for abused women; a hideously ugly private investigator; a mild-mannered yet ruthlessly efficient bodyguard; and a peculiarly insistent television-fee collector.", "A love story, a mystery, a fantasy, a novel of self-discovery, a dystopia to rival George Orwell’s — ", " is Haruki Murakami’s most ambitious undertaking yet: an instant best seller in his native Japan, and a tremendous feat of imagination from one of our most revered contemporary writers."], "author": "Haruki Murakami", "num_pages": "925", "awards": ["Andrew Carnegie Medal Nominee for Fiction (2012)", "Goodreads Choice Award for Best Fiction (2011)", "International DUBLIN Literary Award Nominee for Shortlist (2013)"], "places": ["Tokyo"], "character_names": ["Aomame Masami", "Tengo Kawana", "Fuka-Eri", "Komatsu"], "language": "English", "publish_date": "2011-10-25 00:00:00", "ISBN": "0307593312"},
{"url": "https://www.goodreads.com/book/show/17931881-voice-of-the-sword", "num_ratings": "13", "num_reviews": "3", "avg_ratings": 4.15, "genres": ["Young Adult", "Young Adult", "High School"], "title": "Voice of the Sword", "description": ["Book 1 of a brand-new YA urban fantasy series!", "17-year-old Reiko Bergman thought she had her hands full with exam stress and adjusting to life in modern Tokyo after 5 years in the USA - but her boyfriend has been possessed by a shadow-demon from another dimension, and creatures from Japanese mythology are stalking the corridors of her school ... ", "Her next lesson will be in a", "Book 1 of a brand-new YA urban fantasy series!", "17-year-old Reiko Bergman thought she had her hands full with exam stress and adjusting to life in modern Tokyo after 5 years in the USA - but her boyfriend has been possessed by a shadow-demon from another dimension, and creatures from Japanese mythology are stalking the corridors of her school ... ", "Her next lesson will be in a brand new subject: survival."], "author": "John Paul Catton", "num_pages": "294", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-19 00:00:00", "ISBN": "4990632036"},
{"url": "https://www.goodreads.com/book/show/29358352-kojiki", "num_ratings": "301", "num_reviews": "102", "avg_ratings": 3.06, "genres": ["Fantasy", "Young Adult", "Cultural", "Japan", "Fantasy", "Urban Fantasy", "Adventure", "Fiction"], "title": "Kojiki", "description": ["Every civilization has its myths. Only one is true.", "When eighteen year old Keiko Yamada’s father dies unexpectedly, he leaves behind a one way ticket to Japan, an unintelligible death poem about powerful Japanese spirits and their gigantic, beast-like Guardians, and the cryptic words: “Go to Japan in my place. Find the Gate. My camera will show you the way.”", "Alone and afraid", "Every civilization has its myths. Only one is true.", "When eighteen year old Keiko Yamada’s father dies unexpectedly, he leaves behind a one way ticket to Japan, an unintelligible death poem about powerful Japanese spirits and their gigantic, beast-like Guardians, and the cryptic words: “Go to Japan in my place. Find the Gate. My camera will show you the way.”", "Alone and afraid, Keiko travels to Tokyo, determined to fulfil her father’s dying wish. There, beneath glittering neon signs, her father’s death poem comes to life. Ancient spirits spring from the shadows. Chaos envelops the city, and as Keiko flees its burning streets, her guide, the beautiful Yui Akiko, makes a stunning confession – that she, Yui, is one of a handful of spirits left behind to defend the world against the most powerful among them: a once noble spirit now insane. Keiko must decide if she will honour her father’s heritage and take her rightful place among the gods."], "author": "Keith Yatsuhashi", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-02 00:00:00", "ISBN": "0857666150"},
{"url": "https://www.goodreads.com/book/show/15808474-river-of-stars", "num_ratings": "5,320", "num_reviews": "626", "avg_ratings": 4.09, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Historical", "Historical Fiction", "Historical Fantasy", "Cultural", "China", "Science Fiction Fantasy", "Cultural", "Canada", "Fantasy", "Epic Fantasy", "Cultural", "Asia"], "title": "River of Stars", "description": [" Under Heaven", " Under Heaven", "Ren Daiyan was still just a boy when he took the lives of seven men while guarding an imperial magistrate of Kitai. That moment on a lonely road changed his life—in entirely unexpected ways, sending him into the forests of Kitai among the outlaws. From there he emerges years later—and his life changes again, dramatically, as he circles towards the court and emperor, while war approaches Kitai from the north.", "Lin Shan is the daughter of a scholar, his beloved only child. Educated by him in ways young women never are, gifted as a songwriter and calligrapher, she finds herself living a life suspended between two worlds. Her intelligence captivates an emperor—and alienates women at the court. But when her father’s life is endangered by the savage politics of the day, Shan must act in ways no woman ever has.", "In an empire divided by bitter factions circling an exquisitely cultured emperor who loves his gardens and his art far more than the burdens of governing, dramatic events on the northern steppe alter the balance of power in the world, leading to events no one could have foretold, under the river of stars."], "author": "Guy Gavriel Kay", "num_pages": "656", "awards": ["Sunburst Award Nominee for Adult (2014)", "Goodreads Choice Award Nominee for Fantasy (2013)", "Copper Cylinder Award for Adult (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-02 00:00:00", "ISBN": "0451464974"},
{"url": "https://www.goodreads.com/book/show/13521501-starry-river-of-the-sky", "num_ratings": "6,335", "num_reviews": "697", "avg_ratings": 4.1, "genres": ["Fantasy", "Childrens", "Middle Grade", "Fiction", "Childrens", "Cultural", "China"], "title": "Starry River of the Sky", "description": ["The moon is missing from the remote Village of Clear Sky, but only a young boy named Rendi seems to notice! Rendi has run away from home and is now working as a chore boy at the village inn. He can't help but notice the village's peculiar inhabitants and their problems-where has the innkeeper's son gone? Why are Master Chao and Widow Yan always arguing? What is the crying", "The moon is missing from the remote Village of Clear Sky, but only a young boy named Rendi seems to notice! Rendi has run away from home and is now working as a chore boy at the village inn. He can't help but notice the village's peculiar inhabitants and their problems-where has the innkeeper's son gone? Why are Master Chao and Widow Yan always arguing? What is the crying sound Rendi keeps hearing? And how can crazy, old Mr. Shan not know if his pet is a toad or a rabbit?", "But one day, a mysterious lady arrives at the Inn with the gift of storytelling, and slowly transforms the villagers and Rendi himself. As she tells more stories and the days pass in the Village of Clear Sky, Rendi begins to realize that perhaps it is his own story that holds the answers to all those questions.", "Newbery Honor author Grace Lin brings readers another enthralling fantasy featuring her marvelous full-color illustrations. ", " is filled with Chinese folklore, fascinating characters, and exciting new adventures."], "author": "Grace Lin", "awards": ["Judy Lopez Memorial Award for Children's Literature Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-02 00:00:00", "ISBN": "0316215538"},
{"url": "https://www.goodreads.com/book/show/149049.The_Fountains_of_Paradise", "num_ratings": "23,262", "num_reviews": "546", "avg_ratings": 3.96, "genres": ["Science Fiction", "Fiction"], "title": "The Fountains of Paradise", "description": ["This Hugo and Nebula Award-winning novel is reissued in this trade paperback edition. Vannemar Morgan's dream of linking Earth with the stars requires a 24,000-mile-high space elevator. But first he must solve a million technical, political, and economic problems while allaying the wrath of God. Includes a new introduction by the author."], "author": "Arthur C. Clarke", "num_pages": "352", "awards": ["Hugo Award for Best Novel (1980)", "Nebula Award for Best Novel (1979)"], "places": ["Sri Lanka"], "character_names": ["Vannevar Morgan"], "language": "English", "publish_date": "2001-09-01 00:00:00", "ISBN": "0446677949"},
{"url": "https://www.goodreads.com/book/show/30558257-unsouled", "num_ratings": "4,536", "num_reviews": "169", "avg_ratings": 4.27, "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic"], "title": "Unsouled", "description": ["Sacred artists follow a thousand Paths to power, using their souls to control the forces of the natural world. ", "Lindon is Unsouled, forbidden to learn the sacred arts of his clan. ", "When faced with a looming fate he cannot ignore, he must defy his family's rules...and forge his own Path."], "author": "Will Wight", "num_pages": "285", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-06-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25975440-statisticity", "num_ratings": "12", "num_reviews": "10", "avg_ratings": 3.83, "genres": ["Science Fiction", "Science Fiction", "Dystopia", "Environment", "Global Warming", "Environment", "Science Fiction", "Climate Change Fiction", "Environment", "Climate Change"], "title": "Statisticity", "description": ["Logan is having a rough day. He hasn’t slept in weeks, his crew is near mutiny, and his latest project is predicting a massive attack of some sort right here in Shanghai. And all before his morning congee.", "The year is 2084. Shanghai is a decaying husk of its former self, an empty city staffed by Party members and an army of scavengers recycling the infrastructure to keep th", "Logan is having a rough day. He hasn’t slept in weeks, his crew is near mutiny, and his latest project is predicting a massive attack of some sort right here in Shanghai. And all before his morning congee.", "The year is 2084. Shanghai is a decaying husk of its former self, an empty city staffed by Party members and an army of scavengers recycling the infrastructure to keep things running. Most of the population now lives inside Zhongguo, a virtual replica of the real world introduced by China as a technological solution to climate change, a fix that lets users cling to their quality of life while meeting strict carbon quotas.", "Logan operates a goldfarm between these two worlds, a shelter for refugees who survive by providing unauthorized Zhongguo services to a select clientele. But his fragile sanctuary has been teetering for months, and a new arrival may soon tip them all over the edge.", "Statisticity introduces a new kind of reading experience. Powered by Beneath the Ink’s elegant ebook technology, Statisticity features a standalone, novel-length dystopian thriller shorn of the plodding exposition and cumbersome world-building that weigh down many entries in this genre. Throughout the book, highlighted words allow readers to access a third dimension with the tap of a finger, a carefully crafted compendium of interactive maps, wikis, character profiles, short stories, photos, and illustrations hidden beneath the ink. Readers can choose to experience Statisticity as a fast-paced, plot-driven tear through the heart of Shanghai circa 2084, or they can pause to explore the rich world waiting below the surface.", "Order the Statisticity webbook now for any computer, tablet, reader, or phone with a web browser:"], "author": "Yaron Glazer", "num_pages": "362", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30975102", "num_ratings": "52", "num_reviews": "14", "avg_ratings": 4.31, "genres": ["Asian Literature", "Indian Literature", "Fiction", "Fantasy"], "title": "अर्थला", "description": ["मिटटी से घड़े बनाने वाले मनुषय ने हजारों वरषों में अपना भौतिक जञान बढाकर उसी मिटटी से यूरेनियम छानना भले ही सीख लिया हो, परनतु उसके मानसिक विकास की अवसथा आज भी आदिकालीन है । ", "काल कोई भी रहा हो - तरेता, दवापर या कलियुग । मनुषय के सदगुण और दुरगुण युगों से उसके वयवहार को संचालित करते रहे हैं । यह गाथा किसी एक विशिषट नायक की नहीं, अपितु सभयता, संसकृति, समाज, देश-काल, निरमाण तथा", "मिट्टी से घड़े बनाने वाले मनुष्य ने हजारों वर्षों में अपना भौतिक ज्ञान बढाकर उसी मिट्टी से यूरेनियम छानना भले ही सीख लिया हो, परन्तु उसके मानसिक विकास की अवस्था आज भी आदिकालीन है । ", "काल कोई भी रहा हो - त्रेता, द्वापर या कलियुग । मनुष्य के सदगुण और दुर्गुण युगों से उसके व्यवहार को संचालित करते रहे हैं । यह गाथा किसी एक विशिष्ट नायक की नहीं, अपितु सभ्यता, संस्कृति, समाज, देश-काल, निर्माण तथा प्रलय को समेटे हुए एक सम्पूर्ण युग की है । वह युग, जिसमें देव, दानव, असुर एवं दैत्य जातियां अपने वर्चस्व पर थीं । यह वह युग था, जब देवास्त्रों और ब्रह्मास्त्रों की धमक से धरती कम्पित हुआ करती थी । ", "शक्ति प्रदर्शन, भोग के उपकरणों को बढ़ाने, नए संसाधनों पर अधिकार तथा सर्वोच्च बनने की होड़ ने देवों, असुरों तथा अन्य जातियों के मध्य ऐसे आर्थिक संघर्ष को जन्म दिया, जिसने सम्पूर्ण जंबूद्वीप को कई बार देवासुर-संग्राम की ओर ढकेला । परन्तु इस बार संग्राम-सिंधु की बारी थी । वह अति विनाशकारी महासंग्राम जो दस देवासुर-संग्रामों से भी अधिक विध्वंसक था । ", "संग्राम-सिंधु गाथा का यह खंड देव, दानव, असुर तथा अन्य जातियों के इतिहास के साथ देवों की अलौकिक देवशक्ति के मूल आधार को उदघाटित करेगा ।"], "author": "Vivek  Kumar", "num_pages": "440", "awards": [], "places": [], "character_names": [], "language": "Hindi", "publish_date": "2016-07-19 00:00:00", "ISBN": "9384419907"},
{"url": "https://www.goodreads.com/book/show/18759743-dr-2", "num_ratings": "86", "num_reviews": "66", "avg_ratings": 3.97, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics"], "title": "Dr. 2 (Issue 1)", "description": ["Shanghai, WWII Internment Camps, and a bizarre New York City murder case intersect in the first issue of DR. 2, a kinetically visceral thriller set in a frightening, yet eerily plausible, future. A physician with a mysterious background, Dr. 2 is the most sought after expert on \"unsolvable\" crimes. But nothing can prepare him for the maelstrom of chaos that awaits as he's", "Shanghai, WWII Internment Camps, and a bizarre New York City murder case intersect in the first issue of DR. 2, a kinetically visceral thriller set in a frightening, yet eerily plausible, future. A physician with a mysterious background, Dr. 2 is the most sought after expert on \"unsolvable\" crimes. But nothing can prepare him for the maelstrom of chaos that awaits as he's forced to delve into a world of passion, destruction, and tragedy, all connected to a woman from his own past. ", "This issue serves as an introduction to DR. 2: A FEAST OF SCENTS, the full graphic novel, that will be releasing at a future date."], "author": "Peter Tieryas", "num_pages": "40", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5983694-where-the-mountain-meets-the-moon", "num_ratings": "29,304", "num_reviews": "3,776", "avg_ratings": 4.25, "genres": ["Fantasy", "Childrens", "Middle Grade", "Fiction", "Childrens", "Adventure"], "title": "Where the Mountain Meets the Moon", "description": ["In the valley of Fruitless Mountain, a young girl named Minli spends her days working hard in the fields and her nights listening to her father spin fantastic tales about the Jade Dragon and the Old Man of the Moon. Minli's mother, tired of their poor life, chides him for filling her head with nonsense. But Minli believes these enchanting stories and embarks on an extraord", "In the valley of Fruitless Mountain, a young girl named Minli spends her days working hard in the fields and her nights listening to her father spin fantastic tales about the Jade Dragon and the Old Man of the Moon. Minli's mother, tired of their poor life, chides him for filling her head with nonsense. But Minli believes these enchanting stories and embarks on an extraordinary journey to find the Old Man of the Moon and ask him how her family can change their fortune. She encounters an assorted cast of characters and magical creatures along the way, including a dragon who accompanies her on her quest. ", "Source: Jacket flap"], "author": "Grace Lin", "num_pages": "282", "awards": ["Newbery Medal Nominee (2010)", "Mythopoeic Fantasy Award for Children's Literature (2010)", "Josette Frank Award (2010)", "Dorothy Canfield Fisher Children's Book Award Nominee (2011)", "Iowa Children's Choice Award Nominee (2013)", "California Young Readers Medal Nominee for Intermediate (2013)", "Cybils Award Nominee for Middle Grade Fantasy & Science Fiction (2009)", "Bluestem Book Award Nominee (2018)", "Goodreads Choice Award Nominee for Children's Book (2009)", "Rebecca Caudill Young Readers' Book Award Nominee (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-16 00:00:00", "ISBN": "0316114278"},
{"url": "https://www.goodreads.com/book/show/6080136-gateway", "num_ratings": "1,170", "num_reviews": "186", "avg_ratings": 3.33, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction", "Young Adult", "Teen"], "title": "Gateway", "description": ["As a Chinese adoptee in St. Louis, teenage Daiyu often feels out of place. When an elderly Asian jewelry seller at a street fair shows her a black jade ring—and tells her that “black jade” translates to “Daiyu”—she buys it as a talisman of her heritage. But it’s more than that; it’s magic. It takes Daiyu through a gateway into a version of St. Louis much like 19th century", "As a Chinese adoptee in St. Louis, teenage Daiyu often feels out of place. When an elderly Asian jewelry seller at a street fair shows her a black jade ring—and tells her that “black jade” translates to “Daiyu”—she buys it as a talisman of her heritage. But it’s more than that; it’s magic. It takes Daiyu through a gateway into a version of St. Louis much like 19th century China. Almost immediately she is recruited as a spy, which means hours of training in manners and niceties and sleight of hand. It also means stealing time to be with handsome Kalen, who is in on the plan. There’s only one problem. Once her task is done, she must go back to St. Louis and leave him behind forever. . . ."], "author": "Sharon Shinn", "num_pages": "280", "awards": [], "places": ["St. Louis, Missouri"], "character_names": [], "language": "English", "publish_date": "2009-10-15 00:00:00", "ISBN": "0670011789"},
{"url": "https://www.goodreads.com/book/show/17707648-the-hen-who-dreamed-she-could-fly", "num_ratings": "8,143", "num_reviews": "1,559", "avg_ratings": 3.97, "genres": ["Fiction", "Fantasy", "Animals"], "title": "The Hen Who Dreamed She Could Fly", "description": [" This is the story of a hen named Sprout. No longer content to lay eggs on command, only to have them carted off to the market, she glimpses her future every morning through the barn doors, where the other animals roam free, and comes up with a plan to escape into the wild—and to hatch an egg of her own.", " An anthem fo", " This is the story of a hen named Sprout. No longer content to lay eggs on command, only to have them carted off to the market, she glimpses her future every morning through the barn doors, where the other animals roam free, and comes up with a plan to escape into the wild—and to hatch an egg of her own.", " An anthem for freedom, individuality and motherhood featuring a plucky, spirited heroine who rebels against the tradition-bound world of the barnyard, ", "is a novel of universal resonance that also opens a window on Korea, where it has captivated millions of readers. And with its array of animal characters—the hen, the duck, the rooster, the dog, the weasel—it calls to mind such classics in English as ", "and ", " Featuring specially-commissioned illustrations, this first English-language edition of Sun-mi Hwang’s fable for our times beautifully captures the journey of an unforgettable character in world literature."], "author": "Sun-mi Hwang", "num_pages": "134", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-26 00:00:00", "ISBN": "0143123203"},
{"url": "https://www.goodreads.com/book/show/11470428-spirit-s-princess", "num_ratings": "774", "num_reviews": "97", "avg_ratings": 3.66, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fantasy", "Historical", "Fantasy", "Mythology", "Cultural", "Japan"], "title": "Spirit's Princess", "description": ["Himiko the beloved daughter of a chieftain in third century Japan has always been special. The day she was born there was a devastating earthquake, and the tribe's shamaness had an amazing vision revealing the young girl's future—one day this privileged child will be the spiritual and tribal leader over all of the tribes. ", "revolves around the events of Himiko's ear", "Himiko the beloved daughter of a chieftain in third century Japan has always been special. The day she was born there was a devastating earthquake, and the tribe's shamaness had an amazing vision revealing the young girl's future—one day this privileged child will be the spiritual and tribal leader over all of the tribes. ", "revolves around the events of Himiko's early teen years—her shaman lessons, friendships, contact with other tribes, and journey to save her family after a series of tragic events. Once again, Esther Friesner masterfully weaves together history, myth, and mysticism in a tale of a princess whose path is far from traditional."], "author": "Esther M. Friesner", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-24 00:00:00", "ISBN": "0375869077"},
{"url": "https://www.goodreads.com/book/show/827.The_Diamond_Age", "num_ratings": "71,562", "num_reviews": "3,018", "avg_ratings": 4.19, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Cyberpunk", "Science Fiction", "Steampunk"], "title": "The Diamond Age: Or, A Young Lady's Illustrated Primer", "description": ["The Diamond Age: Or, A Young Lady's Illustrated Primer is a postcyberpunk novel by Neal Stephenson. It is to some extent a science fiction coming-of-age story, focused on a young girl named Nell, and set in a future world in which nanotechnology affects all aspects of life. The novel deals with themes of education, social class, ethnicity, and the nature of artificial inte", "The Diamond Age: Or, A Young Lady's Illustrated Primer is a postcyberpunk novel by Neal Stephenson. It is to some extent a science fiction coming-of-age story, focused on a young girl named Nell, and set in a future world in which nanotechnology affects all aspects of life. The novel deals with themes of education, social class, ethnicity, and the nature of artificial intelligence."], "author": "Neal Stephenson", "num_pages": "499", "awards": ["Hugo Award for Best Novel (1996)", "Nebula Award Nominee for Best Novel (1996)", "Locus Award for Best Science Fiction Novel (1996)", "Arthur C. Clarke Award Nominee (1996)", "John W. Campbell Memorial Award Nominee for Best Science Fiction Novel (1996)", "Prometheus Award Nominee for Best Novel (1996)"], "places": ["China", "Shanghai"], "character_names": ["Nell", "Bud", "John Percival Hackworth", "Fiona Hackworth", "Harv", "Dr. X", "Carl Hollywood", "Judge Fang", "Ms. Miranda Redpath", "Mr. Chang", "Gwendolyn Hackworth", "Major Napier", "Lord Alexcander Chung-Sik Finkle-McGraw", "King Coyote", "Miss Pao", "Elizabeth Finkle-McGraw", "Miss Matheson", "Demetrius James Cotton", "Mr. PhyrePhox"], "language": "English", "publish_date": "2000-05-02 00:00:00", "ISBN": "0553380966"},
{"url": "https://www.goodreads.com/book/show/474943.Shadrach_in_the_Furnace", "num_ratings": "687", "num_reviews": "31", "avg_ratings": 3.58, "genres": ["Science Fiction", "Fiction", "Fantasy", "Speculative Fiction", "Apocalyptic", "Post Apocalyptic", "Science Fiction Fantasy", "Science Fiction", "Dystopia", "Science Fiction", "Near Future", "Literature"], "title": "Shadrach in the Furnace", "description": ["The year is 2012. The world lies ravaged by biological warfare, its population decimated by a ferocious genetically-transmitted disease known as the organ rot. And presiding over the ruins is a ninety-three-year-old tyrant, preserved in a state of youth by a series of organ transplants: the self-styled Genghis Mao. Shadrach Mordecai, Genghis Mao's trusted personal physicia", "The year is 2012. The world lies ravaged by biological warfare, its population decimated by a ferocious genetically-transmitted disease known as the organ rot. And presiding over the ruins is a ninety-three-year-old tyrant, preserved in a state of youth by a series of organ transplants: the self-styled Genghis Mao. Shadrach Mordecai, Genghis Mao's trusted personal physician, was a vital cog in the great machine devoted to keeping the ruler alive: linked to him by a network of electronic implants, Shadrach was able to detect and diagnose the first signs of malfunction in his lord and master. But close as he was to the aging dictator, Shadrach could not have known that events would soon plunge him into a desperate struggle - a struggle in which a paragon of idealism faced the very incarnation of evil."], "author": "Robert Silverberg", "num_pages": "247", "awards": ["Hugo Award Nominee for Best Novel (1977)", "Nebula Award Nominee for Best Novel (1976)", "Prix Cosmos 2000 (1982)"], "places": [], "character_names": ["Mordecai Shadrach", "Genghis Mao"], "language": "English", "publish_date": "2003-11-16 00:00:00", "ISBN": "0743458478"},
{"url": "https://www.goodreads.com/book/show/17182955-on-a-red-station-drifting", "num_ratings": "813", "num_reviews": "169", "avg_ratings": 3.82, "genres": ["Science Fiction", "Novella", "Fiction"], "title": "On a Red Station, Drifting", "description": ["For generations Prosper Station has thrived under the guidance of its Honoured Ancestress: born of a human womb, the station’s artificial intelligence has offered guidance and protection to its human relatives.", "But war has come to the Dai Viet Empire. Prosper’s brightest minds have been called away to defend the Emperor; and a flood of disorientated refugees strain the stat", "For generations Prosper Station has thrived under the guidance of its Honoured Ancestress: born of a human womb, the station’s artificial intelligence has offered guidance and protection to its human relatives.", "But war has come to the Dai Viet Empire. Prosper’s brightest minds have been called away to defend the Emperor; and a flood of disorientated refugees strain the station’s resources. As deprivations cause the station’s ordinary life to unravel, uncovering old grudges and tearing apart the decimated family, Station Mistress Quyen and the Honoured Ancestress struggle to keep their relatives united and safe. ", "What Quyen does not know is that the Honoured Ancestress herself is faltering, her mind eaten away by a disease that seems to have no cure; and that the future of the station itself might hang in the balance…"], "author": "Aliette de Bodard", "num_pages": "106", "awards": ["Hugo Award Nominee for Best Novella (2013)", "Nebula Award Nominee for Best Novella (2012)", "Locus Award Nominee for Best Novella (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-24 00:00:00", "ISBN": "0956392458"},
{"url": "https://www.goodreads.com/book/show/2887211-moribito", "num_ratings": "2,155", "num_reviews": "343", "avg_ratings": 3.99, "genres": ["Fantasy", "Young Adult", "Adventure", "Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature"], "title": "Moribito: Guardian of the Spirit", "description": ["You've never read a fantasy novel like this one! The deep well of Japanese myth merges with the Western fantasy tradition for a novel that's as rich in place and culture as it is hard to put down.", "Balsa was a wanderer and warrior for hire. Then she rescued a boy flung into a raging river -- and at that moment, her destiny changed. Now Balsa must protect the boy -- the Princ", "You've never read a fantasy novel like this one! The deep well of Japanese myth merges with the Western fantasy tradition for a novel that's as rich in place and culture as it is hard to put down.", "Balsa was a wanderer and warrior for hire. Then she rescued a boy flung into a raging river -- and at that moment, her destiny changed. Now Balsa must protect the boy -- the Prince Chagum -- on his quest to deliver the great egg of the water spirit to its source in the sea. As they travel across the land of Yogo and discover the truth about the spirit, they find themselves hunted by two deadly enemies: the egg-eating monster Rarunga . . . and the prince's own father. "], "author": "Nahoko Uehashi", "num_pages": "248", "awards": ["Batchelder Award (2009)", "Sankei Children's Book Award (1997)", "Beacon of Freedom Award (2009)"], "places": ["New Yogo"], "character_names": ["Balsa", "Chagum", "Tanda", "Torogai", "Shuga"], "language": "English", "publish_date": "2008-06-01 00:00:00", "ISBN": "0545005426"},
{"url": "https://www.goodreads.com/book/show/17162161-pacific-rim", "num_ratings": "1,887", "num_reviews": "273", "avg_ratings": 3.78, "genres": ["Science Fiction", "Fiction", "Fantasy"], "title": "Pacific Rim: The Official Movie Novelization", "description": ["The official novelization of the upcoming sci-fi blockbuster", " from visionary director Guillermo del Toro!", "When legions of monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots,", "The official novelization of the upcoming sci-fi blockbuster", " from visionary director Guillermo del Toro!", "When legions of monstrous creatures, known as Kaiju, started rising from the sea, a war began that would take millions of lives and consume humanity's resources for years on end. To combat the giant Kaiju, a special type of weapon was devised: massive robots, called Jaegers, which are controlled simultaneously by two pilots whose minds are locked in a neural bridge. But even the Jaegers are proving nearly defenseless in the face of the relentless Kaiju. ", "On the verge of defeat, the forces defending mankind have no choice but to turn to two unlikely heroes-a washed up former pilot (Charlie Hunnam) and an untested trainee (Rinko Kikuchi)-who are teamed to drive a legendary but seemingly obsolete Jaeger from the past. Together, they stand as mankind's last hope against the mounting apocalypse.", "\"I wanted to make not a war movie, but an adventure movie, with a huge, romantic sense of adventure, a sense of grandeur, and operatic battles...\" - "], "author": "Alex Irvine", "num_pages": "339", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-16 00:00:00", "ISBN": "1781166781"},
{"url": "https://www.goodreads.com/book/show/278280.River_of_Gods", "num_ratings": "4,967", "num_reviews": "354", "avg_ratings": 3.92, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Cyberpunk", "Cultural", "India"], "title": "River of Gods", "description": ["As Mother India approaches her centenary, nine people are going about their business--a gangster, a cop, his wife, a politician, a stand-up comic, a set designer, a journalist, a scientist, and a dropout. And so is Aj--the waif, the mind reader, the prophet--when she one day finds a man who wants to stay hidden. ", "In the next few weeks, they will all be swept together to dec", "As Mother India approaches her centenary, nine people are going about their business--a gangster, a cop, his wife, a politician, a stand-up comic, a set designer, a journalist, a scientist, and a dropout. And so is Aj--the waif, the mind reader, the prophet--when she one day finds a man who wants to stay hidden. ", "In the next few weeks, they will all be swept together to decide the fate of the nation. ", " teems with the life of a country choked with peoples and cultures--one and a half billion people, twelve semi-independent nations, nine million gods. Ian McDonald has written the great Indian novel of the new millennium, in which a war is fought, a love betrayed, a message from a different world decoded, as the great river Ganges flows on."], "author": "Ian McDonald", "num_pages": "597", "awards": ["Arthur C. Clarke Award Nominee (2005)", "British Science Fiction Association Award for Novel (2004)", "Grand Prix de l'Imaginaire for Roman étranger (2011)", "James Tiptree Jr. Award Nominee for Longlist (2004)", "Prix Bob Morane for roman traduit (2011)", "Cena Akademie SFFH for Kniha roku (Book of the Year) (2009)"], "places": ["Varanasi (Benares)"], "character_names": [], "language": "English", "publish_date": "2006-03-01 00:00:00", "ISBN": "1591024366"},
{"url": "https://www.goodreads.com/book/show/24751478-soundless", "num_ratings": "12,957", "num_reviews": "2,836", "avg_ratings": 3.36, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Mythology"], "title": "Soundless", "description": ["For as long as Fei can remember, no one in her village has been able to hear. Rocky terrain and frequent avalanches make it impossible to leave the village, so Fei and her people are at the mercy of a zipline that carries food up the treacherous cliffs from Beiguo, a mysterious faraway kingdom. ", "When villagers begin to lose their sight, deliveries", "For as long as Fei can remember, no one in her village has been able to hear. Rocky terrain and frequent avalanches make it impossible to leave the village, so Fei and her people are at the mercy of a zipline that carries food up the treacherous cliffs from Beiguo, a mysterious faraway kingdom. ", "When villagers begin to lose their sight, deliveries from the zipline shrink. Many go hungry. Fei and all the people she loves are plunged into crisis, with nothing to look forward to but darkness and starvation.", "Until one night, Fei is awoken by a searing noise. Sound becomes her weapon.", "She sets out to uncover what’s happened to her and to fight the dangers threatening her village. A handsome miner with a revolutionary spirit accompanies Fei on her quest, bringing with him new risks and the possibility of romance. They embark on a majestic journey from the peak of their jagged mountain village to the valley of Beiguo, where a startling truth will change their lives forever…"], "author": "Richelle Mead", "num_pages": "267", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-10 00:00:00", "ISBN": "1595147632"},
{"url": "https://www.goodreads.com/book/show/248484.Book_of_a_Thousand_Days", "num_ratings": "44,285", "num_reviews": "5,890", "avg_ratings": 3.96, "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Fiction"], "title": "Book of a Thousand Days", "description": ["When Dashti, a maid, and Lady Saren, her mistress, are shut in a tower for seven years because of Saren's refusal to marry a man she despises, the two prepare for a very long and dark imprisonment.", "As food runs low and the days go from broiling hot to freezing cold, it is all Dashti can do to keep them fed and comfortable. With the arrival outside the tower of Saren's two s", "When Dashti, a maid, and Lady Saren, her mistress, are shut in a tower for seven years because of Saren's refusal to marry a man she despises, the two prepare for a very long and dark imprisonment.", "As food runs low and the days go from broiling hot to freezing cold, it is all Dashti can do to keep them fed and comfortable. With the arrival outside the tower of Saren's two suitors--one welcome, the other decidedly less so--the girls are confronted with both hope and great danger, and Dashti must make the desperate choices of a girl whose life is worth more than she knows.", "With Shannon Hale's lyrical language, this little-known classic fairy tale from the Brothers Grimm is reimagined and reset on the central Asian steppes; it is a completely unique retelling filled with adventure and romance, drama and disguise."], "author": "Shannon Hale", "num_pages": "306", "awards": ["Utah Book Award for Children/Young Adults (2007)", "Dorothy Canfield Fisher Children's Book Award Nominee (2009)", "Judy Lopez Memorial Award for Children's Literature Nominee (2008)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2010)"], "places": [], "character_names": ["Dashti", "Lady Saren", "Khan Tegus", "Lord Khasar"], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1599900513"},
{"url": "https://www.goodreads.com/book/show/13578175-the-emperor-s-soul", "num_ratings": "46,810", "num_reviews": "3,524", "avg_ratings": 4.35, "genres": ["Fantasy", "Fiction", "Novella", "Fantasy", "High Fantasy"], "title": "The Emperor's Soul", "description": ["Also available in ", ".", "A heretic thief is the empire’s only hope in this fascinating tale that inhabits the same world as the popular novel, ", ".", "Shai is a Forger, a foreigner who can flawlessly copy and re-create any item by rewriting its history with skillful magic. Condemned to death after trying to steal the emperor’s scepter, s", "Also available in ", ".", "A heretic thief is the empire’s only hope in this fascinating tale that inhabits the same world as the popular novel, ", ".", "Shai is a Forger, a foreigner who can flawlessly copy and re-create any item by rewriting its history with skillful magic. Condemned to death after trying to steal the emperor’s scepter, she is given one opportunity to save herself. Though her skill as a Forger is considered an abomination by her captors, Shai will attempt to create a new soul for the emperor, who is almost dead. ", "Probing deeply into his life, she discovers Emperor Ashravan’s truest nature—and the opportunity to exploit it. Her only possible ally is one who is truly loyal to the emperor, but councilor Gaotona must overcome his prejudices to understand that Shai’s forgery is as much artistry as it is deception. ", "Brimming with magic and political intrigue, this deftly woven fantasy delves into the essence of a living spirit."], "author": "Brandon Sanderson", "num_pages": "175", "awards": ["Hugo Award for Best Novella (2013)", "Goodreads Choice Award Nominee for Best Fantasy (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-11 00:00:00", "ISBN": "1616960922"},
{"url": "https://www.goodreads.com/book/show/28695717-the-girl-with-ghost-eyes", "num_ratings": "2,595", "num_reviews": "506", "avg_ratings": 3.89, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Historical"], "title": "The Girl with Ghost Eyes", "description": ["It is 1898 in San Francisco. When a sorcerer mainms Chinatown's Daoshi exorcist, only his daughter Li-lin can protect the immigrant community. With a peachwood sword and a sarcastic talking eyeball to help her, Li-lin must confront evil spirits, gangsters, and soulstealers before the sorcerer summons an ancient evil that could burn Chinatown to the ground.", "Full of creepy As", "It is 1898 in San Francisco. When a sorcerer mainms Chinatown's Daoshi exorcist, only his daughter Li-lin can protect the immigrant community. With a peachwood sword and a sarcastic talking eyeball to help her, Li-lin must confront evil spirits, gangsters, and soulstealers before the sorcerer summons an ancient evil that could burn Chinatown to the ground.", "Full of creepy Asian monsters and authentic Chinese rituals, this critically acclaimed urban fantasy also tells the story of a young immigrant trying to find her place. In a Chinatown torn between tradition and modernity, one woman might be the key to holding everything together."], "author": "M.H. Boroson", "num_pages": "304", "awards": ["Colorado Gold Award for Best Speculative Fiction"], "places": ["Chinatown, San Francisco, California"], "character_names": [], "language": "English", "publish_date": "2016-10-11 00:00:00", "ISBN": "1940456665"},
{"url": "https://www.goodreads.com/book/show/234225.Dune", "num_ratings": "577,155", "num_reviews": "14,967", "avg_ratings": 4.21, "genres": ["Science Fiction", "Fiction", "Fantasy", "Classics"], "title": "Dune", "description": ["Set in the far future amidst a sprawling feudal interstellar empire where planetary dynasties are controlled by noble houses that owe an allegiance to the imperial House Corrino, Dune tells the story of young Paul Atreides (the heir apparent to Duke Leto Atreides and heir of House Atreides) as he and his family accept control of the desert planet Arrakis, the only source o", "Set in the far future amidst a sprawling feudal interstellar empire where planetary dynasties are controlled by noble houses that owe an allegiance to the imperial House Corrino, Dune tells the story of young Paul Atreides (the heir apparent to Duke Leto Atreides and heir of House Atreides) as he and his family accept control of the desert planet Arrakis, the only source of the 'spice' melange, the most important and valuable substance in the cosmos. The story explores the complex, multi-layered interactions of politics, religion, ecology, technology, and human emotion as the forces of the empire confront each other for control of Arrakis.", "Published in 1965, it won the Hugo Award in 1966 and the inaugural Nebula Award for Best Novel. Dune is frequently cited as the world's best-selling sf novel."], "author": "Frank Herbert", "num_pages": "604", "awards": ["Hugo Award for Best Novel (1966)", "Nebula Award for Best Novel (1965)", "Seiun Award 星雲賞 for Best Foreign Novel (1974)"], "places": ["Arrakis", "Caladan", "Giedi Prime", "Harko", "Arrakin", "Sietch Tabr"], "character_names": ["Stilgar", "Vladimir Harkonnen", "Duncan Idaho", "Leto Atreides", "Paul Atreides", "Alia", "Lady Jessica", "Shaddam IV", "Gurney Halleck"], "language": "English", "publish_date": "2006-06-01 00:00:00", "ISBN": "0340839937"},
{"url": "https://www.goodreads.com/book/show/13206900-winter", "num_ratings": "138,168", "num_reviews": "20,230", "avg_ratings": 4.48, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Winter", "description": ["Princess Winter is admired by the Lunar people for her grace and kindness, and despite the scars that mark her face, her beauty is said to be even more breathtaking than that of her stepmother, Queen Levana.", "Winter despises her stepmother, and knows Levana won't approve of her feelings for her childhood friend--the handsome palace guard, Jacin. But Winter isn't as weak as L", "Princess Winter is admired by the Lunar people for her grace and kindness, and despite the scars that mark her face, her beauty is said to be even more breathtaking than that of her stepmother, Queen Levana.", "Winter despises her stepmother, and knows Levana won't approve of her feelings for her childhood friend--the handsome palace guard, Jacin. But Winter isn't as weak as Levana believes her to be and she's been undermining her stepmother's wishes for years. Together with the cyborg mechanic, Cinder, and her allies, Winter might even have the power to launch a revolution and win a war that's been raging for far too long.", "Can Cinder, Scarlet, Cress, and Winter defeat Levana and find their happily ever afters? Fans will not want to miss this thrilling conclusion to Marissa Meyer's national bestselling Lunar Chronicles series."], "author": "Marissa Meyer", "num_pages": "827", "awards": ["Pacific Book Review Award for Best Young Adult (2016)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)"], "places": ["Luna"], "character_names": ["Princess Winter", "Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Carswell Thorne", "Iko", "Crescent Moon \"Cress\" Darnel", "Jacin Clay", "Linh Adri", "Linh Pearl"], "language": "English", "publish_date": "2015-11-10 00:00:00", "ISBN": "0312642989"},
{"url": "https://www.goodreads.com/book/show/77160.Across_the_Nightingale_Floor", "num_ratings": "31,202", "num_reviews": "1,833", "avg_ratings": 4.06, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Cultural", "Japan", "Young Adult", "Historical"], "title": "Across the Nightingale Floor", "description": ["In his black-walled fortress at Inuyama, the warlord Iida Sadamu surveys his famous nightingale floor. Constructed with exquisite skill, it sings at the tread of each human foot. No assassin can cross it unheard.", "The youth Takeo has been brought up in a remote mountain village among the Hidden, a reclusive and spiritual people who have taught him only the ways of peace. But", "In his black-walled fortress at Inuyama, the warlord Iida Sadamu surveys his famous nightingale floor. Constructed with exquisite skill, it sings at the tread of each human foot. No assassin can cross it unheard.", "The youth Takeo has been brought up in a remote mountain village among the Hidden, a reclusive and spiritual people who have taught him only the ways of peace. But unbeknownst to him, his father was a celebrated assassin and a member of the Tribe, an ancient network of families with extraordinary, preternatural skills. When Takeo's village is pillaged, he is rescued and adopted by the mysterious Lord Otori Shigeru. Under the tutelage of Shigeru, he learns that he too possesses the skills of the Tribe. And, with this knowledge, he embarks on a journey that will lead him across the famed nightingale floor—and to his own unimaginable destiny..."], "author": "Lian Hearn", "num_pages": "305", "awards": ["Wirral Paperback of the Year (2004)", "Peter Pan Award", "Prix Litterature in the La Nuit De Lire", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2004)", "Lincoln Award Nominee (2007)"], "places": [], "character_names": ["Otori Takeo", "Lord Iida"], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "1573223328"},
{"url": "https://www.goodreads.com/book/show/47520.Castle_in_the_Air", "num_ratings": "30,126", "num_reviews": "1,849", "avg_ratings": 3.93, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Castle in the Air", "description": ["Far to the south of the land of Ingary, in the Sultanates of Rashpuht, there lived in the city of Zanzib a young and not very prosperous carpet dealer named Abdullah who loved to spend his time daydreaming. He was content with his life and his daydreams until, one day, a stranger sold him a", "Far to the south of the land of Ingary, in the Sultanates of Rashpuht, there lived in the city of Zanzib a young and not very prosperous carpet dealer named Abdullah who loved to spend his time daydreaming. He was content with his life and his daydreams until, one day, a stranger sold him a magic carpet.", "That very night, the carpet flew him to an enchanted garden. There, he met and fell in love with the beauteous princess Flower-in-the-Night, only to have her snatched away, right under his very nose, by a wicked djinn. With only his magic carpet and his wits to help him, Abdullah sets off to rescue his princess...."], "author": "Diana Wynne Jones", "num_pages": "298", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (1992)"], "places": ["Ingary"], "character_names": ["Sophie Hatter", "Calcifer", "Abdullah"], "language": "English", "publish_date": "2001-08-07 00:00:00", "ISBN": "0064473457"},
{"url": "https://www.goodreads.com/book/show/493456.Extras", "num_ratings": "95,207", "num_reviews": "5,155", "avg_ratings": 3.59, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction"], "title": "Extras", "description": ["A few years after rebel Tally Youngblood takes down the Specials regime, a cultural renaissance sweeps the world. “Tech-heads” flaunt their latest gadgets, “kickers” spread gossip and trends, and “surge monkeys” are hooked on extreme plastic surgery. Popularity rules, and everyone craves fame.", "Fifteen-year-old Aya Fuse is no exception. But Aya’s face rank is so low, she’s a", "A few years after rebel Tally Youngblood takes down the Specials regime, a cultural renaissance sweeps the world. “Tech-heads” flaunt their latest gadgets, “kickers” spread gossip and trends, and “surge monkeys” are hooked on extreme plastic surgery. Popularity rules, and everyone craves fame.", "Fifteen-year-old Aya Fuse is no exception. But Aya’s face rank is so low, she’s a total nobody. An extra. Her only chance at stardom is to kick a wild and unexpected story.", "Then she stumbles upon a big secret. Aya knows she is on the cusp of celebrity. But the information she is about to disclose will change both her fate…and that of the brave new world"], "author": "Scott Westerfeld", "num_pages": "417", "awards": ["Ditmar Award Nominee for Best Novel (2008)", "The Inky Awards Nominee for Silver Inky (2008)"], "places": ["Japan"], "character_names": ["David Strorm", "Tally Youngblood", "Shay", "Andrew Simpson Smith", "Aya Fuse", "Eden Maru", "Hiro Fuse", "Ren Machino", "Frizz Mizuno", "Fausto", "Udzir"], "language": "English", "publish_date": "2007-10-02 00:00:00", "ISBN": "1416951172"},
{"url": "https://www.goodreads.com/book/show/9741685-shadows-on-the-moon", "num_ratings": "3,799", "num_reviews": "606", "avg_ratings": 3.88, "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Fairy Tales", "Retellings", "Historical", "Historical Fiction"], "title": "Shadows on the Moon", "description": ["Trained in the magical art of shadow-weaving, sixteen-year-old Suzume is able to recreate herself in any form - a fabulous gift for a girl desperate to escape her past. But who is she really? Is she a girl of noble birth living under the tyranny of her mother's new husband, Lord Terayama, or a lowly drudge scraping a living in the ashes of Terayama's kitchens, or Yue, the", "Trained in the magical art of shadow-weaving, sixteen-year-old Suzume is able to recreate herself in any form - a fabulous gift for a girl desperate to escape her past. But who is she really? Is she a girl of noble birth living under the tyranny of her mother's new husband, Lord Terayama, or a lowly drudge scraping a living in the ashes of Terayama's kitchens, or Yue, the most beautiful courtesan in the Moonlit Lands? Whatever her true identity, Suzume is destined to capture the heart of a prince - and determined to use his power to destroy Terayama. And nothing will stop her, not even love."], "author": "Zoë Marriott", "num_pages": "464", "awards": ["Sasakawa Prize", "Leeds Book Awards Nominee (0)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-07-07 00:00:00", "ISBN": "1406318159"},
{"url": "https://www.goodreads.com/book/show/21469054-cress", "num_ratings": "212,972", "num_reviews": "22,471", "avg_ratings": 4.46, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Cress", "description": ["Cinder and Captain Thorne are fugitives on the run, with Scarlet and Wolf in tow. Together they're plotting to overthrow Queen Levana and her army.", "Their best hope lies with Cress, who has been trapped on a satellite since childhood with only her netscreens as company. All that screen time has made Cress an excellent hacker; unfortunately, she's just received orders from Le", "Cinder and Captain Thorne are fugitives on the run, with Scarlet and Wolf in tow. Together they're plotting to overthrow Queen Levana and her army.", "Their best hope lies with Cress, who has been trapped on a satellite since childhood with only her netscreens as company. All that screen time has made Cress an excellent hacker; unfortunately, she's just received orders from Levana to track down Cinder and her handsome accomplice.", "When a daring rescue goes awry, the group is separated. Cress finally has her freedom, but it comes at a high price. Meanwhile, Queen Levana will let nothing stop her marriage to Emperor Kai. Cress, Scarlet, and Cinder may not have signed up to save the world, but they may be the only ones who can."], "author": "Marissa Meyer", "num_pages": "550", "awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2014)"], "places": ["New Beijing", "Luna"], "character_names": ["Princess Winter", "Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Carswell Thorne", "Iko", "Crescent Moon \"Cress\" Darnel", "Jacin Clay", "Dr. Dmitri Erland", "Sybil Mira", "Aimery Park", "Linh Adri"], "language": "English", "publish_date": "2015-01-27 00:00:00", "ISBN": "1250007224"},
{"url": "https://www.goodreads.com/book/show/836964.China_Mountain_Zhang", "num_ratings": "3,176", "num_reviews": "338", "avg_ratings": 3.93, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Lgbt"], "title": "China Mountain Zhang", "description": ["With this groundbreaking novel, Maureen F. McHugh established herself as one of the decade's best science fiction writers. In its pages, we enter a post-revolution America, moving from the hyper-urbanized eastern seaboard to the Arctic bleakness of Baffin Island; from the new Imperial City to an agricultural commune on Mars. The overlapping lives of cyber-kite fliers, lone", "With this groundbreaking novel, Maureen F. McHugh established herself as one of the decade's best science fiction writers. In its pages, we enter a post-revolution America, moving from the hyper-urbanized eastern seaboard to the Arctic bleakness of Baffin Island; from the new Imperial City to an agricultural commune on Mars. The overlapping lives of cyber-kite fliers, lonely colonists, illicit neural-pressball players, and organic engineers blend into a powerful, taut story of a young man's journey of discovery. This is a macroscopic world of microscopic intensity, one of the most brilliant visions of modern SF."], "author": "Maureen F. McHugh", "num_pages": "313", "awards": ["Nebula Award Nominee for Best Novel (1993)", "Locus Award for Best First Novel (1993)", "James Tiptree Jr. Award (1992)", "Lambda Literary Award for Gay Men's Science Fiction/Fantasy (1993)"], "places": [], "character_names": ["Rafael Zhang"], "language": "English", "publish_date": "1997-04-15 00:00:00", "ISBN": "0312860986"},
{"url": "https://www.goodreads.com/book/show/18458653-goddess-tithe", "num_ratings": "243", "num_reviews": "56", "avg_ratings": 4.19, "genres": ["Fantasy", "Christian Fiction", "Young Adult", "Christian", "Adventure", "Christian Fiction", "Christian Fantasy", "Fiction"], "title": "Goddess Tithe", "description": ["When a stowaway is discovered aboard the merchant ship ", ", Munny, a cabin boy on his first voyage, knows what must be done. All stowaways are sacrificed to Risafeth, the evil goddess of the sea. Such is her right, and the ", " only hope to return safely home.", "Yet, to the horror of his crew, Captain Sunan vows to prot", "When a stowaway is discovered aboard the merchant ship ", ", Munny, a cabin boy on his first voyage, knows what must be done. All stowaways are sacrificed to Risafeth, the evil goddess of the sea. Such is her right, and the ", " only hope to return safely home.", "Yet, to the horror of his crew, Captain Sunan vows to protect the stowaway, a foreigner in clown's garb. A curse falls upon the ship and all who sail with her, for Risafeth will stop at nothing to claim her tithe.", "Will Munny find the courage to trust his captain and to protect the strange clown who has become his friend?"], "author": "Anne Elisabeth Stengl", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-12 00:00:00", "ISBN": "0989447804"},
{"url": "https://www.goodreads.com/book/show/20894732-golden-daughter", "num_ratings": "265", "num_reviews": "60", "avg_ratings": 4.52, "genres": ["Fantasy", "Christian Fiction", "Romance", "Christian", "Young Adult", "Fiction"], "title": "Golden Daughter", "description": ["BEYOND THE REALM OF DREAMS IS A WORLD SHE NEVER IMAGINED", "Masayi Sairu was raised to be dainty, delicate, demure . . . and deadly. She is one of the emperor’s Golden Daughters, as much a legend as she is a commodity. One day, Sairu will be contracted in marriage to a patron, whom she will secretly guard for the rest of her life.", "But when she learns that a sacred Dream Walker", "BEYOND THE REALM OF DREAMS IS A WORLD SHE NEVER IMAGINED", "Masayi Sairu was raised to be dainty, delicate, demure . . . and deadly. She is one of the emperor’s Golden Daughters, as much a legend as she is a commodity. One day, Sairu will be contracted in marriage to a patron, whom she will secretly guard for the rest of her life.", "But when she learns that a sacred Dream Walker of the temple seeks the protection of a Golden Daughter, Sairu forgoes marriage in favor of this role. Her skills are stretched to the limit, for assassins hunt in the shadows, and phantoms haunt in dreams. With only a mysterious Faerie cat and a handsome slave—possessed of his own strange abilities—to help her, can Sairu shield her new mistress from evils she can neither see nor touch?", "For the Dragon is building an army of fire, and soon the heavens will burn."], "author": "Anne Elisabeth Stengl", "num_pages": "570", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-25 00:00:00", "ISBN": "0989447855"},
{"url": "https://www.goodreads.com/book/show/10852343-stormdancer", "num_ratings": "11,291", "num_reviews": "2,021", "avg_ratings": 3.8, "genres": ["Fantasy", "Science Fiction", "Steampunk", "Young Adult", "Science Fiction", "Dystopia"], "title": "Stormdancer", "description": ["Arashitoras are supposed to be extinct. So when Yukiko and her warrior father Masaru are sent to capture one for the Shõgun, they fear that their lives are over – everyone knows what happens to those who fail the Lord of the Shima Isles. But the mission proves less impossible and more deadly than anyone expects. Soon Yukiko finds herself stranded: a young woman alone in he", "Arashitoras are supposed to be extinct. So when Yukiko and her warrior father Masaru are sent to capture one for the Shõgun, they fear that their lives are over – everyone knows what happens to those who fail the Lord of the Shima Isles. But the mission proves less impossible and more deadly than anyone expects. Soon Yukiko finds herself stranded: a young woman alone in her country's last wilderness, with only a furious, crippled arashitora for company. Although she can hear his thoughts, and saved his life, all she knows for certain is he'd rather see her dead than help her. Yet trapped together in the forest, Yukiko and the beast soon discover a bond that neither of them expected.", "Meanwhile, the country around them verges on collapse. A toxic fuel is choking the land, the machine-powered Lotus Guild is publicly burning those they deem Impure, and the Shõgun cares for nothing but his own dominion. Authority has always made Yukiko, but her world changes when she meets Kin, a young man with secrets, and the rebel Kagé cabal. She learns the horrifying extent of the Shõgun's crimes, both against her country and her family.", "Returning to the city, Yukiko is determined to make the Shõgun pay – but what can one girl and a flightless arashitora do against the might of an empire?"], "author": "Jay Kristoff", "num_pages": "451", "awards": ["David Gemmell Legend Award Nominee (2012)", "Compton Crook Award Nominee (2012)", "Aurealis Award Nominee (2012)", "Bookworm Best Award Nominee (2012)"], "places": ["Kigen City", "Iishi Mountains"], "character_names": ["Yukiko", "Buruu"], "language": "English", "publish_date": "2012-09-01 00:00:00", "ISBN": "0230762883"},
{"url": "https://www.goodreads.com/book/show/7992995-eona", "num_ratings": "33,706", "num_reviews": "2,388", "avg_ratings": 4.11, "genres": ["Fantasy", "Young Adult", "Fantasy", "Dragons", "Romance", "Fantasy", "Magic"], "title": "Eona: The Last Dragoneye", "description": ["Eon has been revealed as Eona, the first female Dragoneye in hundreds of years. Along with fellow rebels Ryko and Lady Dela, she is on the run from High Lord Sethon's army. The renegades are on a quest for the black folio, stolen by the drug-riddled Dillon; they must also find Kygo, the young Pearl Emperor, who needs Eona's power and the black folio if he is to wrest back", "Eon has been revealed as Eona, the first female Dragoneye in hundreds of years. Along with fellow rebels Ryko and Lady Dela, she is on the run from High Lord Sethon's army. The renegades are on a quest for the black folio, stolen by the drug-riddled Dillon; they must also find Kygo, the young Pearl Emperor, who needs Eona's power and the black folio if he is to wrest back his throne from the selfstyled \"Emperor\" Sethon. Through it all, Eona must come to terms with her new Dragoneye identity and power - and learn to bear the anguish of the ten dragons whose Dragoneyes were murdered. As they focus their power through her, she becomes a dangerous conduit for their plans. . . .", "Eona, with its pulse-pounding drama and romance, its unforgettable fight scenes, and its surprises, is the conclusion to an epic story only Alison Goodman can create.."], "author": "Alison Goodman", "num_pages": "637", "awards": ["Norma K. Hemming Award Nominee (2012)"], "places": [], "character_names": ["Dillon Walsh", "Eona", "Rilla", "Chart", "Lord Ido", "Lady Dela", "Ryko", "Kygo"], "language": "English", "publish_date": "2011-04-19 00:00:00", "ISBN": "0670063118"},
{"url": "https://www.goodreads.com/book/show/9415946-huntress", "num_ratings": "9,287", "num_reviews": "982", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Young Adult", "Young Adult Fantasy", "Adventure", "Fantasy", "Magic"], "title": "Huntress", "description": ["Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, th", "Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, the city of the Fairy Queen. Taisin is a sage, thrumming with magic, and Kaede is of the earth, without a speck of the otherworldly. And yet the two girls' destinies are drawn together during the mission. As members of their party succumb to unearthly attacks and fairy tricks, the two come to rely on each other and even begin to fall in love. But the Kingdom needs only one huntress to save it, and what it takes could tear Kaede and Taisin apart forever.", "The exciting adventure prequel to Malinda Lo's highly acclaimed novel ", "is overflowing with lush Chinese influences and details inspired by the ", ", and is filled with action and romance."], "author": "Malinda Lo", "num_pages": "371", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2012)", "James Tiptree Jr. Award Nominee for Longlist (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "031604007X"},
{"url": "https://www.goodreads.com/book/show/5577995-silver-phoenix", "num_ratings": "3,256", "num_reviews": "524", "avg_ratings": 3.57, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Romance"], "title": "Silver Phoenix", "description": ["No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that", "No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that her journey to the Palace of Fragrant Dreams isn't only a quest to find her beloved father but a venture with stakes larger than she could have imagined. ", " Bravery, intelligence, the will to fight and fight hard . . . she will need all of these things. Just as she will need the new and mysterious power growing within her. She will also need help. ", " It is Chen Yong who finds her partly submerged and barely breathing at the edge of a deep lake. There is something of unspeakable evil trying to drag her under. On a quest of his own, Chen Yong offers that help . . . and perhaps more."], "author": "Cindy Pon", "num_pages": "340", "awards": [], "places": [], "character_names": ["Ai Ling"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0061730211"},
{"url": "https://www.goodreads.com/book/show/18139931-scarlet", "num_ratings": "244,596", "num_reviews": "25,871", "avg_ratings": 4.3, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Scarlet", "description": ["Cinder is back and trying to break out of prison—even though she'll be the Commonwealth's most wanted fugitive if she does—in this second installment from Marissa Meyer.", "Halfway around the world, Scarlet Benoit's grandmother is missing. It turns out there are many things Scarlet doesn't know about her grandmother, or the grave danger she has lived in her whole life. When Sc", "Cinder is back and trying to break out of prison—even though she'll be the Commonwealth's most wanted fugitive if she does—in this second installment from Marissa Meyer.", "Halfway around the world, Scarlet Benoit's grandmother is missing. It turns out there are many things Scarlet doesn't know about her grandmother, or the grave danger she has lived in her whole life. When Scarlet encounters Wolf, a street fighter who may have information as to her grandmother's whereabouts, she is loath to trust this stranger, but is inexplicably drawn to him, and he to her. As Scarlet and Wolf unravel one mystery, they encounter another when they meet Cinder. Now, all of them must stay one step ahead of the vicious Lunar Queen Levana.", "An NPR Best Book of 2013"], "author": "Marissa Meyer", "num_pages": "452", "awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2013)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2013)"], "places": ["Toulouse", "Paris", "New Beijing", "Rieux"], "character_names": ["Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Ran Kesley", "Carswell Thorne", "Iko", "Aimery Park", "Linh Adri", "Linh Pearl", "Michelle Benoit"], "language": "English", "publish_date": "2014-02-04 00:00:00", "ISBN": "1250007216"},
{"url": "https://www.goodreads.com/book/show/2986865-eon", "num_ratings": "50,254", "num_reviews": "4,122", "avg_ratings": 3.98, "genres": ["Fantasy", "Young Adult", "Fantasy", "Dragons", "Fantasy", "Magic"], "title": "Eon: Dragoneye Reborn", "description": ["Also Known As: Two Pearls of Wisdom, Eon: Rise of the Dragoneye, and Eon (All the same book just published with different publishers)", "Twelve-year-old Eon has been in training for years. His intensive study of Dragon Magic, based on East Asian astrology, involves two kinds of skills: sword-work and magical aptitude.", "Also Known As: Two Pearls of Wisdom, Eon: Rise of the Dragoneye, and Eon (All the same book just published with different publishers)", "Twelve-year-old Eon has been in training for years. His intensive study of Dragon Magic, based on East Asian astrology, involves two kinds of skills: sword-work and magical aptitude. He and his master hope that he will be chosen as a Dragoneye--an apprentice to one of the twelve energy dragons of good fortune. ", "But Eon has a dangerous secret. He is actually Eona, a sixteen-year-old girl who has been masquerading as a boy for the chance to become a Dragoneye. Females are forbidden to use Dragon Magic; if anyone discovers she has been hiding in plain sight, her death is assured.", "When Eon's secret threatens to come to light, she and her allies are plunged into grave danger and a deadly struggle for the Imperial throne. Eon must find the strength and inner power to battle those who want to take her magic...and her life."], "author": "Alison Goodman", "num_pages": "531", "awards": ["Victorian Premier's Literary Award Nominee for Young Adult Fiction Prize (2009)", "Aurealis Award for Best Fantasy Novel & Nominee for Young Adult Novel (2008)", "The Inky Awards Nominee for Gold Inky (2009)", "James Tiptree Jr. Award Honor List (2008)"], "places": [], "character_names": ["Dillon Walsh", "Eona", "Rilla", "Chart", "Ryoko", "Lady Jila", "Lord Ido"], "language": "English", "publish_date": "2008-12-26 00:00:00", "ISBN": "0670062278"},
{"url": "https://www.goodreads.com/book/show/6597651-the-windup-girl", "num_ratings": "55,215", "num_reviews": "5,847", "avg_ratings": 3.74, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Science Fiction", "Steampunk"], "title": "The Windup Girl", "description": ["Anderson Lake is a company man, AgriGen's Calorie Man in Thailand. Under cover as a factory manager, Anderson combs Bangkok's street markets in search of foodstuffs thought to be extinct, hoping to reap the bounty of history's lost calories. There, he encounters Emiko... ", "Emiko is the Windup Girl, a strange and beautiful creature. One of the New People, Emiko is not human;", "Anderson Lake is a company man, AgriGen's Calorie Man in Thailand. Under cover as a factory manager, Anderson combs Bangkok's street markets in search of foodstuffs thought to be extinct, hoping to reap the bounty of history's lost calories. There, he encounters Emiko... ", "Emiko is the Windup Girl, a strange and beautiful creature. One of the New People, Emiko is not human; instead, she is an engineered being, creche-grown and programmed to satisfy the decadent whims of a Kyoto businessman, but now abandoned to the streets of Bangkok. Regarded as soulless beings by some, devils by others, New People are slaves, soldiers, and toys of the rich in a chilling near future in which calorie companies rule the world, the oil age has passed, and the side effects of bio-engineered plagues run rampant across the globe. ", "What Happens when calories become currency? What happens when bio-terrorism becomes a tool for corporate profits, when said bio-terrorism's genetic drift forces mankind to the cusp of post-human evolution? Award-winning author Paolo Bacigalupi delivers one of the most highly acclaimed science fiction novels of the twenty-first century."], "author": "Paolo Bacigalupi", "num_pages": "359", "awards": ["Hugo Award for Best Novel (2010)", "Nebula Award for Best Novel (2009)", "Locus Award for Best First Novel (2010)", "Kurd-Laßwitz-Preis for Best Foreign Novel (2012)", "British Science Fiction Association Award Nominee for Novel (2010)", "John W. Campbell Memorial Award for Best Science Fiction Novel (2010)", "Compton Crook Award (2010)", "Grand Prix de l'Imaginaire for Roman étranger (2013)", "Prix Bob Morane for roman traduit (2013)", "Cena Akademie SFFH for Kniha roku (Book of the Year) (2011)", "Goodreads Choice Award Nominee for Science Fiction (2009)", "Prix Une autre Terre (2013)", "Seiun Award 星雲賞 for Best Foreign Novel (2012)"], "places": ["Bangkok"], "character_names": ["Anderson Lake", "Emiko", "Tan Hock Seng", "Jaidee Rojjanasukchai", "Kanya"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "1597801577"}
]