[
{"url": "https://www.goodreads.com/book/show/133499.Comanche_Moon", "num_ratings": "7,011", "num_reviews": "608", "avg_ratings": 4.12, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Historical", "Historical Fiction", "Romance", "Western Romance", "Adult", "Asian Literature", "Indian Literature", "Fiction", "Historical Romance", "Western Historical Romance"], "title": "Comanche Moon", "author": "Catherine Anderson", "num_pages": "480", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for First Indian Historical Romance (1990)"], "places": ["Texas"], "character_names": ["Loretta Simpson", "Hunter of the Wolf"], "language": "English", "publish_date": "1993-09-01 00:00:00", "ISBN": "006108235X"},
{"url": "https://www.goodreads.com/book/show/17707682-the-spirit-keeper", "num_ratings": "912", "num_reviews": "204", "avg_ratings": 4.01, "genres": ["Historical", "Historical Fiction", "Romance", "Fiction", "Fantasy", "Historical", "Young Adult"], "title": "The Spirit Keeper", "description": ["The thirteenth child conceived of miserable Irish exiles, Katie O’Toole dreams of a different life. Little does she know that someone far away is dreaming of her.", "In 1747, savages raid her family home, and seventeen-year-old Katie is taken captive. Syawa and Hector have been searc", "The thirteenth child conceived of miserable Irish exiles, Katie O’Toole dreams of a different life. Little does she know that someone far away is dreaming of her.", "In 1747, savages raid her family home, and seventeen-year-old Katie is taken captive. Syawa and Hector have been searching for her, guided by Syawa’s dreams. A young Holyman, Syawa believes Katie is the subject of his Vision: the Creature of Fire and Ice, destined to bring a great gift to his people. Despite her flaming hair and ice-blue eyes, Katie is certain he is mistaken, but faced with returning to her family, she agrees to join them. She soon discovers that in order to fulfill Syawa’s Vision, she must first become his Spirit Keeper, embarking on an epic journey that will change her life—and heart—forever."], "author": "K.B. Laugheed", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "0142180335"},
{"url": "https://www.goodreads.com/book/show/278176.Gray_Hawk_s_Lady", "num_ratings": "265", "num_reviews": "16", "avg_ratings": 3.95, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Westerns"], "title": "Gray Hawk's Lady", "description": ["FROM DIFFERENT WORLDS", "A devoted daughter and genteel English lady, Genevieve Rohan proudly joined her father on the frontier to conduct a cultural study of the American Indian--and vows to conclude his work, now that the adventurous Viscount has fallen ill. But when she hires two unscrupulous trappers to capture a member of the elusive Blackfoot tribe, she is shocked when t", "FROM DIFFERENT WORLDS", "A devoted daughter and genteel English lady, Genevieve Rohan proudly joined her father on the frontier to conduct a cultural study of the American Indian--and vows to conclude his work, now that the adventurous Viscount has fallen ill. But when she hires two unscrupulous trappers to capture a member of the elusive Blackfoot tribe, she is shocked when they return with the most magnificent man she has ever seen--a warrior whose intelligence and strength of character force Genevieve to confront her attraction to this native \"savage.\" ", "OF ONE HEART ", "Undaunted by his abduction, Gray Hawk's pride demands justice--and so he escapes, taking the meddling foreign miss as his captive. But his anger turns to passion--and his vengeance to desire--as the brave's noble heart is entranced by the beauty and spirit of his flame-haired prisoner. And Gray Hawk knows only one way to soothe the raging fire in his soul: he must claim Genevieve as his woman ...now and forever."], "author": "Karen Kay", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-08-01 00:00:00", "ISBN": "0380789973"},
{"url": "https://www.goodreads.com/book/show/158454.The_Last_of_the_Mohicans", "num_ratings": "78,384", "num_reviews": "2,244", "avg_ratings": 3.7, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Adventure", "Literature"], "title": "The Last of the Mohicans", "description": ["Set against the French and Indian siege of Fort William Henry in 1757, ", " recounts the story of two sisters, Cora and Alice Munro, daughters of the English commander, who are struggling to be reunited with their father", "Set against the French and Indian siege of Fort William Henry in 1757, ", " recounts the story of two sisters, Cora and Alice Munro, daughters of the English commander, who are struggling to be reunited with their father. They are aided in their perilous journey by Hawk-eye, a frontier scout and his companions Chingachgook and Uncas, the only two survivors of the Mohican tribe. But their lives are endangered by the Mangua, the savage Indian traitor who captures the sisters, wanting Cora to be his squaw. In setting Indian against Indian and the brutal society of the white man against the civilization of the Mohican, Cooper, more than any author before or since, shaped the American sense of itself as a nation."], "author": "James Fenimore Cooper", "num_pages": "350", "awards": [], "places": ["Upstate New York"], "character_names": ["Nathaniel Bumppo", "Chingachgook", "Magua", "Uncas", "Cora Munro", "Alice Munro", "Colonel George Munro", "Duncan Heyward", "David Gamut", "Tamenund", "General Marquis de Montcalm", "General Daniel Webb"], "language": "English", "publish_date": "1986-11-27 00:00:00", "ISBN": "0140390243"},
{"url": "https://www.goodreads.com/book/show/19054212-running-barefoot", "num_ratings": "7,346", "num_reviews": "1,091", "avg_ratings": 4.31, "genres": ["Romance", "Contemporary", "Young Adult", "New Adult", "Romance", "Contemporary Romance"], "title": "Running Barefoot", "description": ["When Josie Jensen, an awkward 13-year-old musical prodigy crashes headlong into new-comer Samuel Yazzie, an 18-year-old Navajo boy full of anger and confusion, an unlikely friendship blooms. Josie teaches Samuel about words, music and friendship, and along the way finds a kindred spirit. Upon graduation, Samuel abandons the sleepy, small town in search of a future and a li", "When Josie Jensen, an awkward 13-year-old musical prodigy crashes headlong into new-comer Samuel Yazzie, an 18-year-old Navajo boy full of anger and confusion, an unlikely friendship blooms. Josie teaches Samuel about words, music and friendship, and along the way finds a kindred spirit. Upon graduation, Samuel abandons the sleepy, small town in search of a future and a life, leaving his young friend behind. Many years go by and Samuel returns, finding Josie in need of the very things she offered him years before. Their roles reversed, Samuel teaches Josie about life, love, and letting go. Deeply romantic and poignant, Running Barefoot is the story of a small town girl and a Native American boy, the ties that bind them to their homes and families, and the love that gives them wings."], "author": "Amy Harmon", "num_pages": "443", "awards": [], "places": ["Utah"], "character_names": [], "language": "English", "publish_date": "2012-04-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1866687.Cheyenne_Captive", "num_ratings": "377", "num_reviews": "35", "avg_ratings": 3.72, "genres": ["Romance", "Historical Romance", "Romance", "Westerns", "Historical"], "title": "Cheyenne Captive", "description": ["SCANDALOUS THOUGHTS", " When Headstrong, golden-haired Summer ran away from home, all she could think of was leaving her strict father behind. But after a vengeance-seeking Indian attacked her stage threatening her with a fate worse, than death, the tempestuous girl yearned for her parents' overbearing rules....until the savage's cruel grip changed to a tantalizing touch! His", "SCANDALOUS THOUGHTS", " When Headstrong, golden-haired Summer ran away from home, all she could think of was leaving her strict father behind. But after a vengeance-seeking Indian attacked her stage threatening her with a fate worse, than death, the tempestuous girl yearned for her parents' overbearing rules....until the savage's cruel grip changed to a tantalizing touch! His sensuous caress banished all ties to the past, the exciting things he did with his lips made her yearn for an unknown fulfillment. From that moment the spirited innocent knew that her future was bound to his - and she'd cherish whatever relationship the uncivilized brave decided to have with her. ", "FORBIDDEN DESIRES", " From the years he was forced to live in Texas, the handsome half-breed Iron Knife knew how deceptive palefaces could be. Surely this creamy-skinned, blue-eyed beauty was no different. But even as he tried to brutally punish her for her heritage, he was ensnared by the hip-length strands of wheat-hued tresses, enchanted by the firm curves of her nubile white body. Before the ruthless warrior could control himself, he was whispering of love, swearing there'd be no others. He could never marry this ignoble slave, but he'd sooner slay her than ever give up his bewitching....CHEYENNE CAPTIVE."], "author": "Georgina Gentry", "num_pages": "496", "awards": [], "places": ["United States of America"], "character_names": ["Summer/Suzannah", "Iron Knife"], "language": "English", "publish_date": "1987-02-01 00:00:00", "ISBN": "0821719807"},
{"url": "https://www.goodreads.com/book/show/7942786-fair-game", "num_ratings": "38,625", "num_reviews": "2,372", "avg_ratings": 4.34, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Romance", "Romance", "Paranormal Romance", "Shapeshifters", "Werewolves"], "title": "Fair Game", "description": ["Patricia Briggs, the #1 \"New York Times\" bestselling author of the Mercy Thompson novels, \"always enchants her readers.\" (Lynn Viehl, \"New York Times\" bestselling author) Now her Alpha and Omega series-set in a world of shifting shapes, loyalty, and passion- brings werewolves out of the darkness and into a society where fear and prejudice could make the hunters prey...", "They", "Patricia Briggs, the #1 \"New York Times\" bestselling author of the Mercy Thompson novels, \"always enchants her readers.\" (Lynn Viehl, \"New York Times\" bestselling author) Now her Alpha and Omega series-set in a world of shifting shapes, loyalty, and passion- brings werewolves out of the darkness and into a society where fear and prejudice could make the hunters prey...", "They say opposites attract. And in the case of werewolves Anna Latham and Charles Cornick, they mate. The son-and enforcer-of the leader of the North American werewolves, Charles is a dominant alpha. While Anna, an omega, has the rare ability to calm others of her kind.", "Now that the werewolves have revealed themselves to humans, they can't afford any bad publicity. Infractions that could have been overlooked in the past must now be punished, and the strain of doing his father's dirty work is taking a toll on Charles.", "Nevertheless, Charles and Anna are sent to Boston, when the FBI requests the pack's help on a local serial killer case. They quickly realize that not only the last two victims were werewolves-all of them were. Someone is targeting their kind. And now Anna and Charles have put themselves right in the killer's sights..."], "author": "Patricia Briggs", "num_pages": "308", "awards": [], "places": ["United States of America", "Boston, Massachusetts"], "character_names": ["Adam Hauptman", "Mercy Thompson", "Leah", "Charles Cornick", "Anna Latham", "Asil \"The Moor\" (Hussan)", "Leslie Fisher", "David Christiansen", "Bran \"The Marrok\" Cornick"], "language": "English", "publish_date": "2012-03-06 00:00:00", "ISBN": "1841497967"},
{"url": "https://www.goodreads.com/book/show/36195.Only_Mine", "num_ratings": "2,353", "num_reviews": "98", "avg_ratings": 3.93, "genres": ["Romance", "Romance", "Historical Romance", "Westerns", "Historical", "Romance", "Western Romance"], "title": "Only Mine", "description": ["The bastard son of a viscount and a Cheyenne shaman′s daughter, Wolfe Lonetree agrees to rescue the pampered Lady Jessica from an unwanted impending wedding -- but only if she will be his wife.", "Naive and shockingly innocent, Lady Jessica Charteris tricked a rugged, handsome stranger into a marriage in name only in order to escape a union with a vile British lord. Totally un", "The bastard son of a viscount and a Cheyenne shaman′s daughter, Wolfe Lonetree agrees to rescue the pampered Lady Jessica from an unwanted impending wedding -- but only if she will be his wife.", "Naive and shockingly innocent, Lady Jessica Charteris tricked a rugged, handsome stranger into a marriage in name only in order to escape a union with a vile British lord. Totally unprepared for the hardships awaiting her in America, she is terrified by the prospect of life in the harsh and magnificent land at the edge of the Rockies. But even more frightening is Wolfe himself -- a man whose raw sensuality leaves her breathless. Her proud, virile new \"husband\" is not one to be trifled with, nor will he be denied what his heart fervently desires -- for only in Wolfe Lonetree′s arms can Jessica truly learn the unparalleled joy of becoming the right man′s woman."], "author": "Elizabeth Lowell", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-05-27 00:00:00", "ISBN": "0380763397"},
{"url": "https://www.goodreads.com/book/show/2745726-lakota-love-song", "num_ratings": "579", "num_reviews": "36", "avg_ratings": 4.03, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns"], "title": "Lakota Love Song", "description": ["A DARING RESCUE", "When Kaylee Matthews finds a wounded Lakota warrior on her family's property, she knows she must help him --- even though it means concealing him from her watchful stepfather. As she secretly tends to the stranger's injury, Kaylee feels a powerful attraction to this handsome, mysterious man --- one that opens her eyes to an entirely new destiny ...", "A FORBIDDE", "A DARING RESCUE", "When Kaylee Matthews finds a wounded Lakota warrior on her family's property, she knows she must help him --- even though it means concealing him from her watchful stepfather. As she secretly tends to the stranger's injury, Kaylee feels a powerful attraction to this handsome, mysterious man --- one that opens her eyes to an entirely new destiny ...", "A FORBIDDEN DESIRE", "Alone and weakened in the land of his enemy, Blue Hawk is determined to return to his village. Every moment he stays with Kaylee, the risk of discovery grows --- but so does his desire for his lovely rescuer. She is his only hope of getting back to his people alive, and when she offers to come with him, he can't refuse ...", "A DIVIDED LAND", "Kaylee and Blue Hawk's shared passion soon sparks into an all-consuming love. But in a land divided by hatred and fear, it will take all of their courage to protect the future they cherish ..."], "author": "Madeline Baker", "num_pages": "341", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "0451204980"},
{"url": "https://www.goodreads.com/book/show/9282385-red-bird-s-song", "num_ratings": "252", "num_reviews": "22", "avg_ratings": 3.95, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical Fiction", "Historical Romance", "Western Historical Romance"], "title": "Red Bird's Song", "description": ["Taken captive by a Shawnee war party wasn't how Charity Edmonson hoped to escape an unwanted marriage. Nor did Shawnee warrior Wicomechee expect to find the treasure promised by his grandfather's vision in the unpredictable red-headed girl. George III's English Red-Coats, unprincipled colonial militia, prejudice and jealousy are not the only enemies Charity and Wicomechee", "Taken captive by a Shawnee war party wasn't how Charity Edmonson hoped to escape an unwanted marriage. Nor did Shawnee warrior Wicomechee expect to find the treasure promised by his grandfather's vision in the unpredictable red-headed girl. George III's English Red-Coats, unprincipled colonial militia, prejudice and jealousy are not the only enemies Charity and Wicomechee will face before they can hope for a peaceful life. The greatest obstacle to happiness is in their own hearts. As they struggle through bleak mountains and cold weather, facing wild nature and wilder men, Wicomechee and Charity must learn to trust each other."], "author": "Beth Trissel", "num_pages": "334", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-01 00:00:00", "ISBN": "1601548125"},
{"url": "https://www.goodreads.com/book/show/5566166-proud-wolf-s-woman", "num_ratings": "238", "num_reviews": "11", "avg_ratings": 4.11, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Westerns", "Romance", "Western Romance"], "title": "Proud Wolf's Woman", "description": ["A STOLEN LIFE ", "Julia Wilson followed her destiny to the Platte River. Now she is an enslaved prisoner of the savage Kiowa. But salvation has come, riding tall and proud from out of Julia's past: a handsome Cheyenne brave who once stirred a girlish heart ...and now inflames a womanly passion. ", "Bitter and vengeful, Neeheeoweo came to the Kiowa for weapons to punish the Pawnee", "A STOLEN LIFE ", "Julia Wilson followed her destiny to the Platte River. Now she is an enslaved prisoner of the savage Kiowa. But salvation has come, riding tall and proud from out of Julia's past: a handsome Cheyenne brave who once stirred a girlish heart ...and now inflames a womanly passion. ", "Bitter and vengeful, Neeheeoweo came to the Kiowa for weapons to punish the Pawnee murderers who killed his wife and unborn child. Instead, his ponies and buffalo robes must buy freedom for a friend from days long past. Yet his wounded soul aches for more than friendship from this courageous beauty who calls him \"Proud Wolf,\" though she endangers his mission with her lingering presence. For Julia's eyes shine with a healing forbidden promise of desire--tempting the Wolf to risk honor and life for the chance to know love again."], "author": "Karen Kay", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-07-07 00:00:00", "ISBN": "0380779978"},
{"url": "https://www.goodreads.com/book/show/6973752-courting-morrow-little", "num_ratings": "4,355", "num_reviews": "410", "avg_ratings": 4.2, "genres": ["Historical", "Historical Fiction", "Christian Fiction", "Romance", "Christian", "Romance", "Historical Romance", "Historical"], "title": "Courting Morrow Little", "description": ["Morrow Little is haunted by the memory of the day her family was torn apart by raiding Shawnee warriors. Now that she is nearly a grown woman and her father is ailing, she must make difficult choices about the future. Several men--ranging from the undesired to the unthinkable--vie for her attentions, but she finds herself inexplicably drawn to a forbidden love that both te", "Morrow Little is haunted by the memory of the day her family was torn apart by raiding Shawnee warriors. Now that she is nearly a grown woman and her father is ailing, she must make difficult choices about the future. Several men--ranging from the undesired to the unthinkable--vie for her attentions, but she finds herself inexplicably drawn to a forbidden love that both terrifies and intrigues her. Can she betray the memory of her lost loved ones--and garner suspicion from her friends--by pursuing a life with him? Or should she seal her own misery by marrying a man she doesn't love? This sweeping tale of romance and forgiveness will envelop readers as it takes them from a Kentucky fort through the vast wilderness to the west in search of true love."], "author": "Laura Frantz", "num_pages": "370", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2010-07-01 00:00:00", "ISBN": "0800733401"},
{"url": "https://www.goodreads.com/book/show/6587387-silver-borne", "num_ratings": "83,686", "num_reviews": "2,762", "avg_ratings": 4.38, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Romance", "Shapeshifters", "Werewolves", "Paranormal", "Vampires", "Romance", "Paranormal Romance"], "title": "Silver Borne", "description": ["Mercy Thompson, car mechanic and shapeshifter, never knows what the day - or night - may bring in a world where \"witches, vampires, werewolves, and shapeshifters live beside ordinary people\" (", "). But she is about to learn that while some secrets are dangerous whose who seek them are just plain deadly...", "Mercy is smart enough to realize that when it comes to the magic", "Mercy Thompson, car mechanic and shapeshifter, never knows what the day - or night - may bring in a world where \"witches, vampires, werewolves, and shapeshifters live beside ordinary people\" (", "). But she is about to learn that while some secrets are dangerous whose who seek them are just plain deadly...", "Mercy is smart enough to realize that when it comes to the magical fae, the less you know, the better. But you can't always get what you want. When she attempts to return a powerful fae she previously borrowed in an act of desperation, she finds the bookstore locked up and closed down.", "It seems the book contains secrets - and the fae will do just about anything to keep it out of the wrong hands. And if that doesn't take enough of Mercy's attention, her friend Samuel is struggling with his wolf side - leaving Mercy to cover for him lest his own father declare Samuel's life forfeit.", "All in all, Mercy has had better days. And if she isn't careful, she may not have many more..."], "author": "Patricia Briggs", "num_pages": "342", "awards": ["Endeavour Award Nominee (2011)", "Goodreads Choice Award Nominee for Paranormal Fantasy (2010)"], "places": ["Tri-Cities, Washington", "Washington (the state)"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Charles Cornick", "Anna Latham", "Darryl Zao", "Warren", "Honey", "Kyle Brooks", "Stefan Uccello", "Marsilia", "Auriele Zao", "Gabriel Sandoval", "Tony Montenegro", "Alicia (Ariana) Brewster", "Ben (werewolf)"], "language": "English", "publish_date": "2010-03-30 00:00:00", "ISBN": "044101819X"},
{"url": "https://www.goodreads.com/book/show/3711152-naked-edge", "num_ratings": "7,158", "num_reviews": "505", "avg_ratings": 4.18, "genres": ["Romance", "Romantic Suspense", "Romance", "Romance", "Contemporary Romance", "Suspense", "Contemporary"], "title": "Naked Edge", "description": ["The day Navajo journalist Katherine James met Gabriel Rossiter, the earth literally moved beneath her feet. Nearly killed in a rockslide while hiking, she found her life in the tall park ranger's hands. Although she can't forget him she thinks she'll never see him again. She is crushed when she recognizes her rescuer", "The day Navajo journalist Katherine James met Gabriel Rossiter, the earth literally moved beneath her feet. Nearly killed in a rockslide while hiking, she found her life in the tall park ranger's hands. Although she can't forget him she thinks she'll never see him again. She is crushed when she recognizes her rescuer among the law enforcement officers raiding a sweat lodge ceremony one night, throwing her and her friends off Mesa Butte, land they consider sacred.", "Gabe long ago swore he would never again lose himself to a woman not even one with long dark hair and big eyes that seem to see right through him. But from the moment he first sees Kat, the attraction he feels is undeniable. Appalled by what he has been ordered to do, he's determined to get to the bottom of recent events at Mesa Butte and to keep Kat safe.", "But asking questions can be dangerous almost as dangerous as risking one's heart. And soon Kat and Gabe's passion for the truth and each other makes them targets for those who would do anything, even kill, to keep Native Americans off their sacred land."], "author": "Pamela Clare", "num_pages": "361", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Romantic Suspense (2011)", "Goodreads Choice Award Nominee for Romance (2010)"], "places": ["Denver, Colorado"], "character_names": ["Katherine (Kat) James", "Gabe Rossiter"], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "0425219763"},
{"url": "https://www.goodreads.com/book/show/1412138.Iron_Kissed", "num_ratings": "94,727", "num_reviews": "3,251", "avg_ratings": 4.36, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Shapeshifters", "Werewolves", "Paranormal", "Vampires", "Romance", "Romance", "Paranormal Romance"], "title": "Iron Kissed", "description": ["Mechanic Mercy Thompson can shift her shape - but not her loyalty. When her former boss and mentor is a", "Mechanic Mercy Thompson can shift her shape - but not her loyalty. When her former boss and mentor is arrested for murder and left to rot behind bars by his own kind, it's up to Mercy to clear his name, whether he wants her to or not.", "Mercy's loyalty is under pressure from other directions, too. Werewolves are not known for their patience, and if Mercy can't decide between the two she cares for, Sam and Adam may make the choice for her..."], "author": "Patricia Briggs", "num_pages": "287", "awards": ["DABWAHA Romance Tournament for Best Romance of the Year & Best Novel with Romantic Elements (2009)"], "places": ["Kennewick", "Umatilla (Fae) Reservation", "Kennewick, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Tim", "Warren", "Honey", "Kyle Brooks", "Uncle Mike", "Gabriel Sandoval", "Gray Lords", "Ben (werewolf)"], "language": "English", "publish_date": "2008-01-02 00:00:00", "ISBN": "0441015662"},
{"url": "https://www.goodreads.com/book/show/12093000-the-cahokian", "num_ratings": "60", "num_reviews": "15", "avg_ratings": 3.97, "genres": ["Historical", "Historical Fiction", "Historical", "Anthropology", "Fiction"], "title": "The Cahokian", "description": ["“The Cahokian” is a historical novel, based on the final years of the largest North American pre-contact empire.", "Acoto, the Chief Warlord of Cahokia, accepts a mission in the far north-east. Determined to restore the fading glory of the Empire, he leads a campaign against the northern barbarians. ", "However, the League of the Iroquois is not an easy target. Before the day of t", "“The Cahokian” is a historical novel, based on the final years of the largest North American pre-contact empire.", "Acoto, the Chief Warlord of Cahokia, accepts a mission in the far north-east. Determined to restore the fading glory of the Empire, he leads a campaign against the northern barbarians. ", "However, the League of the Iroquois is not an easy target. Before the day of the crucial battle is over he discovers his life is about to take a very unexpected turn."], "author": "Zoe Saadia", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-07-17 00:00:00", "ISBN": "1465921028"},
{"url": "https://www.goodreads.com/book/show/2928510-cherokee-warriors", "num_ratings": "51", "num_reviews": "3", "avg_ratings": 3.53, "genres": ["Romance", "Historical", "Romance", "Historical Romance", "Westerns"], "title": "Cherokee Warriors: The Lover", "description": ["Desperate to save her small farm, Susanna Copeland decides to drive a herd of cattle to Kansas—but no crew will work for a woman. Looking for a man who'll pretend he's her husband, she bails Eagle Jack Sixkiller out of jail...and gets more than she bargained for. Jack enjoys beautiful women, and he especially enjoys teasing his \"wife,\" kissing her in front of the men, inve", "Desperate to save her small farm, Susanna Copeland decides to drive a herd of cattle to Kansas—but no crew will work for a woman. Looking for a man who'll pretend he's her husband, she bails Eagle Jack Sixkiller out of jail...and gets more than she bargained for. Jack enjoys beautiful women, and he especially enjoys teasing his \"wife,\" kissing her in front of the men, inventing new verses of \"Oh, Susanna\", and inisting they share a tent. After all, to protect their charade—and her—everyone must believe they're married. And Susanna finds she likes it all much too much. But, happily widowed, she's decided no man will ever control her life again. Yet as they face stampedes, hailstorms, and theives together, they begin sharing a bedroll—and soon, their hearts."], "author": "Genell Dellin", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-01 00:00:00", "ISBN": "0060001461"},
{"url": "https://www.goodreads.com/book/show/1261697.Wolf_Shadow_s_Promise", "num_ratings": "133", "num_reviews": "7", "avg_ratings": 4.09, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical Fiction", "Historical"], "title": "Wolf Shadow's Promise", "description": ["Warrior's Woman", "He had vowed to make her his wife when she was a mere girl. But now that Alys Clayton was a woman grown and ripe for the love of an honorable man, Moon Wolf knew that man could not be him. For she had since been named Wolf Shadow, a warrior pledged to protect his people. A well-born beauty like Alys deserved much more than a revel Indian could give her. And", "Warrior's Woman", "He had vowed to make her his wife when she was a mere girl. But now that Alys Clayton was a woman grown and ripe for the love of an honorable man, Moon Wolf knew that man could not be him. For she had since been named Wolf Shadow, a warrior pledged to protect his people. A well-born beauty like Alys deserved much more than a revel Indian could give her. And Moon Wolf loved her too much to deny her anything...", "Alys had long waited for the day when she would be reunited with the darkly handsome suitor who had filled her young heart with yearning. And once in Moon Wolf's tender embrace, she longed to fulfill their vow of love. But Moon Wolf struggled against his passion, stubbornly denying her the one thing that would make her truly his. Now Alys was determined to show the noble warrior that he need not walk alone and that theirs was a love meant to be..."], "author": "Karen Kay", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-07-03 00:00:00", "ISBN": "0380803402"},
{"url": "https://www.goodreads.com/book/show/110256.Night_Thunder_s_Bride", "num_ratings": "182", "num_reviews": "14", "avg_ratings": 4.2, "genres": ["Romance", "Historical", "Romance", "Historical Romance", "Westerns", "Fiction"], "title": "Night Thunder's Bride", "description": ["His Wife in Every WayHe had promised to protect the beatiful white woman. But a Blackfoot warrior must never raise a hand against his own brothers, even if they mean to harm and disgrace a helpless captive. There was only one thing a man of honor like Night Thunder could do: claim Rebecca Cothern as his wife.", "But One.", "From the moment Rebecca stepped into Night Thunder's powe", "His Wife in Every WayHe had promised to protect the beatiful white woman. But a Blackfoot warrior must never raise a hand against his own brothers, even if they mean to harm and disgrace a helpless captive. There was only one thing a man of honor like Night Thunder could do: claim Rebecca Cothern as his wife.", "But One.", "From the moment Rebecca stepped into Night Thunder's powerful embrace in full view of his tribe--making his marriage vow true in their eyes--she knew her life would never be the same. How could she travel among his people as his \"wife\" and share his bed without succumbing to the desire that burned so fiercely in her breast? Night Thunder swore that she would truly be his bride in every way, if only Rebecca would give hreself to him freely and without remorse. But could she sacrifice the only life she's ever known--and the future she'd always dreamed of--for a deep, satisfying tast of forbidden passion?"], "author": "Karen Kay", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-07-01 00:00:00", "ISBN": "0380803399"},
{"url": "https://www.goodreads.com/book/show/720539.Cherokee_Warriors", "num_ratings": "55", "num_reviews": "4", "avg_ratings": 3.55, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical Fiction", "Westerns"], "title": "Cherokee Warriors: The Loner", "description": ["A proud Cherokee Lighthorseman, Black Fox is determined to hunt down the notorious Cat -- a brazen thief who robs from the wealthy to give to the poor. But his satisfaction at finally capturing the elusive outlaw turns to shock when he discovers The Cat is a woman in disguise -- a breathtaking young hellion who stirs his sympathy and his desire, distracting Black Fox from", "A proud Cherokee Lighthorseman, Black Fox is determined to hunt down the notorious Cat -- a brazen thief who robs from the wealthy to give to the poor. But his satisfaction at finally capturing the elusive outlaw turns to shock when he discovers The Cat is a woman in disguise -- a breathtaking young hellion who stirs his sympathy and his desire, distracting Black Fox from the job he has sworn to do.", "Cathleen O'Sullivan has no love for the law, since it did nothing to punish the villain who destroyed her family. But a bullet wound ended her personal quest for justice, and if she doesn't escape her rugged Cherokee captor, she'll surely hang for a crime she did not commit. But the tender care she's receiving from the sexy lawman -- and the intense heat his touch inspires -- makes the wild beauty burn to have Black Fox as a lover, not an enemy ... and to surrender to a fiery passion that could spell disaster for them both."], "author": "Genell Dellin", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-04-29 00:00:00", "ISBN": "006000147X"},
{"url": "https://www.goodreads.com/book/show/17562900-night-broken", "num_ratings": "43,222", "num_reviews": "3,304", "avg_ratings": 4.43, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Shapeshifters", "Werewolves", "Romance", "Paranormal", "Vampires"], "title": "Night Broken", "description": ["An unexpected phone call heralds a new challenge for Mercy. Her mate Adam’s ex-wife is in trouble, on the run from a stalker. Adam isn’t the kind of man to turn away a person in need—and Mercy knows it. But with Christy holed up in Adam’s house, Mercy can’t shake the feeling that something about the situation isn’t right.", "Soon her suspicions are confirmed when she learns th", "An unexpected phone call heralds a new challenge for Mercy. Her mate Adam’s ex-wife is in trouble, on the run from a stalker. Adam isn’t the kind of man to turn away a person in need—and Mercy knows it. But with Christy holed up in Adam’s house, Mercy can’t shake the feeling that something about the situation isn’t right.", "Soon her suspicions are confirmed when she learns that Christy has the furthest thing from good intentions. She wants Adam back, and she’s willing to do whatever it takes to get him, including turning Adam’s pack against Mercy.", "Mercy isn’t about to step down without a fight, but there’s a more dangerous threat circling. Christy’s stalker is more than a bad man—in fact, he may not be human at all. As the bodies start piling up, Mercy must put her personal troubles aside to face a creature with the power to tear her whole world apart."], "author": "Patricia Briggs", "num_pages": "341", "awards": ["Endeavour Award Nominee (2015)", "Goodreads Choice Award Nominee for Fantasy (2014)"], "places": ["Tri-Cities, Washington", "Washington (the state)"], "character_names": ["Adam Hauptman", "Mercy Thompson", "Honey", "Coyote", "Christy Hauptman", "Guayota, volcano god", "Gary Laughingdog"], "language": "English", "publish_date": "2014-03-11 00:00:00", "ISBN": "042525674X"},
{"url": "https://www.goodreads.com/book/show/5099577-war-cloud-s-passion", "num_ratings": "184", "num_reviews": "10", "avg_ratings": 4.16, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Romance", "Western Romance"], "title": "War Cloud's Passion", "description": ["A Passion Too Perilous Anna Wiley is determined not to show her fear to the bronze, breathtaking Cheyenne brave who led the attack on her westbound train. With twelve orphan children in her care, Anna must now trust the dangerous War Cloud to escort her small party to safety. But even more than his mesmerizing power and his legendary hatred of all whites, Anna fears War Cl", "A Passion Too Perilous Anna Wiley is determined not to show her fear to the bronze, breathtaking Cheyenne brave who led the attack on her westbound train. With twelve orphan children in her care, Anna must now trust the dangerous War Cloud to escort her small party to safety. But even more than his mesmerizing power and his legendary hatred of all whites, Anna fears War Cloud's raw sensuality -- and the wanting in his dark eyes that only inflames her own secret desires.\"This woman is the enemy!Yet noble War Cloud cannot help but admire Anna's strength and courageous spirit, her kindness and gentle heart -- and he cannot ignore the burning feeling in the depths of his soul that she is his destined one. But how can he submit to the forbidden urge to hold her close, to taste the sweet honey of her kiss, when he knows that a centuries-old family curse could cruelly rob him of a bold and forever love?"], "author": "Karen Kay", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-07-01 00:00:00", "ISBN": "0380803429"},
{"url": "https://www.goodreads.com/book/show/2529635.Comanche_Flame", "num_ratings": "394", "num_reviews": "25", "avg_ratings": 3.96, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns"], "title": "Comanche Flame", "author": "Madeline Baker", "num_pages": "446", "awards": [], "places": [], "character_names": ["Buffalo Dancer", "Jessica 'Jesse' Landry"], "language": "English", "publish_date": "1992-03-16 00:00:00", "ISBN": "0843932422"},
{"url": "https://www.goodreads.com/book/show/2460013.Red_Sky_Warrior", "num_ratings": "20", "num_reviews": "1", "avg_ratings": 3.35, "genres": ["Romance", "Historical Romance"], "title": "Red Sky Warrior", "description": ["Refusing to enter into a marriage arranged by her scheming businessman father, Maggie Harrington proposes to convicted outlaw Cade Chisk-Ko, promising to rescue him from being hanged if he will marry her for one year only. Original."], "author": "Genell Dellin", "num_pages": "329", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1996-01-01 00:00:00", "ISBN": "0380775263"},
{"url": "https://www.goodreads.com/book/show/2560668.Song_of_the_Wolf", "num_ratings": "195", "num_reviews": "27", "avg_ratings": 4.37, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical Fiction", "Native Americans", "Historical"], "title": "Song of the Wolf", "description": ["A poignant and accurate portrait of Native American life in the 1800's told almost entirely from the Native American point of view. A Cheyenne woman's extraordinary healing powers and unique sensitivity lead her on an unforgettable odyssey into a primeval world of wilderness and mystery.", "AS THE WINDS OF CHANGE SWEPT ACROSS THE VAST WESTERN PLAINS, HER NAME WAS A CRY OF HOPE", "A poignant and accurate portrait of Native American life in the 1800's told almost entirely from the Native American point of view. A Cheyenne woman's extraordinary healing powers and unique sensitivity lead her on an unforgettable odyssey into a primeval world of wilderness and mystery.", "AS THE WINDS OF CHANGE SWEPT ACROSS THE VAST WESTERN PLAINS, HER NAME WAS A CRY OF HOPE, FREEDOM - AND DESIRE", "They called her Medicine Wolf, and she was born at a time when buffalo herds stretched farther than the sharpest eye could see-a time when a people called the Cheyenne were a proud and free nation. In the sixth summer of her life the events that shaped the destiny of this proud, beautiful, and exotic woman began: a brutal kidnapping, a miraculous vision, and a daring rescue by a great white wolf and a fiercely courageous boy. Her unforgettable odyssey would take her into a primeval world of wildness and mystery where an ancient way of life was ending and another younger, vital, but more violent one was struggling to be born.", "Across the windswept plains, the white men were coming to seize the land and break a piople's spirits-and their hearts. But fate would bring Medicine Wolf a love so deep and unyielding that nothing on earth could stop it...a passion she would traverse the land to find-and follow the haunting, heartbreaking path of the wolf to keep."], "author": "Rosanne Bittner", "num_pages": "496", "awards": ["RITA Award by Romance Writers of America Nominee for Historical Series Romance (1993)"], "places": [], "character_names": [], "language": "English", "publish_date": "1992-02-01 00:00:00", "ISBN": "0553290142"},
{"url": "https://www.goodreads.com/book/show/5585788-skinwalker", "num_ratings": "28,326", "num_reviews": "1,731", "avg_ratings": 3.89, "genres": ["Paranormal", "Shapeshifters", "Adult", "Paranormal", "Witches", "Romance"], "title": "Skinwalker", "description": ["Jane Yellowrock is a supernatural skinwalker--one sharing her body with the soul of a mountain lion. When the rogue-vampire hunter is hired to hunt down a particularly nasty vamp, Jane is drawn into the steamy New Orleans vampire society where she learns the ins-and-outs of the \"sane\" vampire culture, more", "Jane Yellowrock is a supernatural skinwalker--one sharing her body with the soul of a mountain lion. When the rogue-vampire hunter is hired to hunt down a particularly nasty vamp, Jane is drawn into the steamy New Orleans vampire society where she learns the ins-and-outs of the \"sane\" vampire culture, more about her own Cherokee heritage, and we are drawn into a rousing, fast-paced thriller."], "author": "Faith Hunter", "num_pages": "320", "awards": [], "places": ["New Orleans, Louisiana"], "character_names": ["Brian Robere", "Brandon Robere", "Jane Yellowrock", "Leo Pellissier", "George \"Bruiser\" Dumas", "Rick (Ricky Bo) LeFleur", "Beast", "Katherine (Katie) Fontaneau", "Tom (Troll)", "Jodi Richoux", "Aggie One Feather"], "language": "English", "publish_date": "2009-07-07 00:00:00", "ISBN": "0451462807"},
{"url": "https://www.goodreads.com/book/show/1285484.The_Pony_Wife", "num_ratings": "28", "num_reviews": "3", "avg_ratings": 4.32, "genres": ["Historical", "Romance", "Historical Romance", "Historical", "Historical Fiction"], "title": "The Pony Wife", "description": ["They called her Dark Moon, for she was born under the darkened light of a lunar eclipse--and blessed with the gentle gift of healing. As a woman surrounded by superstition, she struggled to gain the trust of her people through kindness and devotion. As a woman of beauty and passion, she was forced to divide her heart between the needs of her tribe and the one man who dared", "They called her Dark Moon, for she was born under the darkened light of a lunar eclipse--and blessed with the gentle gift of healing. As a woman surrounded by superstition, she struggled to gain the trust of her people through kindness and devotion. As a woman of beauty and passion, she was forced to divide her heart between the needs of her tribe and the one man who dared to love her. And as a woman of great power and strength, she vowed to challenge the winds of fate that brought the white man into her people's world, threatened to destroy it forever. Hers was a special destiny of love, course and pride known only to...The Pony Wife."], "author": "Beverly Bird", "num_pages": "456", "awards": [], "places": ["Moon of Migrating Roots"], "character_names": [], "language": "English", "publish_date": "1995-06-01 00:00:00", "ISBN": "0515116297"},
{"url": "https://www.goodreads.com/book/show/6385948-comanche-moon-rising", "num_ratings": "337", "num_reviews": "16", "avg_ratings": 3.95, "genres": ["Romance", "Historical Romance", "Historical", "Romance", "Historical Romance", "Western Historical Romance"], "title": "Comanche Moon Rising", "description": ["The Blue Norther swept across the Texas plains with a fury that would alter lives and change destinies. It killed Shiloh's father, leaving her to run their struggling ranch and raise her little brother alone. It also stranded a feverish young Indian girl in their barn. Shiloh knew the Comanche would come for Moon Song sooner or later, but nothing could have prepared her fo", "The Blue Norther swept across the Texas plains with a fury that would alter lives and change destinies. It killed Shiloh's father, leaving her to run their struggling ranch and raise her little brother alone. It also stranded a feverish young Indian girl in their barn. Shiloh knew the Comanche would come for Moon Song sooner or later, but nothing could have prepared her for the fierce war chief who appeared at her door.", "Shadowhawk was full of restless energy, like a wild animal that couldn't be tamed. And now he owed the blue-eyed beauty a debt of honor for saving his sister's life. Shiloh was his to protect, his to shield from the dangers of the frontier. He would spirit her away to his village, woo her in the way of his people and make her a woman beneath the magical light of a ... Comanche Moon Rising"], "author": "Constance O'Banyon", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-01 00:00:00", "ISBN": "0843962658"},
{"url": "https://www.goodreads.com/book/show/7052533-stormwalker", "num_ratings": "6,105", "num_reviews": "423", "avg_ratings": 3.75, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Fantasy", "Romance", "Fantasy", "Magic", "Fantasy", "Dragons"], "title": "Stormwalker", "description": ["Book One of a the Stormwalker series. Allyson James also writes as NYT Bestselling author Jennifer Ashley", "Half-Navajo Janet Begay possesses extraordinary power which is tied to the storms that waft across the desert. The only person who can control her when she's caught in the storm's evocative power is Mick, a dark-haired, blue-eyed biker Janet can't seem to touch with her", "Book One of a the Stormwalker series. Allyson James also writes as NYT Bestselling author Jennifer Ashley", "Half-Navajo Janet Begay possesses extraordinary power which is tied to the storms that waft across the desert. The only person who can control her when she's caught in the storm's evocative power is Mick, a dark-haired, blue-eyed biker Janet can't seem to touch with her powers. He can wield fire and not get burned, and Janet's never sure where he goes when they're not together. ", "Together they investigate mysterious disappearances, which Janet fears are tied to her mother's people, the mythical gods from below the earth. They are helped along the way by Coyote and Crow, but these shapeshifting gods have their own agendas."], "author": "Allyson James", "num_pages": "330", "awards": ["RITA Award by Romance Writers of America Nominee for Novel with Strong Romantic Elements (2011)"], "places": ["Navajo Nation, Arizona", "Arizona"], "character_names": ["Janet Begay", "Coyote", "Nash Jones", "Mick \"Burns\"", "Maya Medina"], "language": "English", "publish_date": "2010-05-04 00:00:00", "ISBN": "042523469X"},
{"url": "https://www.goodreads.com/book/show/3810095-cherish-the-dream", "num_ratings": "17", "num_reviews": "2", "avg_ratings": 3.65, "genres": ["Romance", "Historical Romance"], "title": "Cherish the Dream", "description": ["THE TRAIL OF DESTINY AND DREAMS... ", "It was a once-in-a-lifetime opportunity for naturalist Theodora Gordon. Leaving her affluent New England home, the bookish, gently bred beauty headed west to join a government expedition across America's last frontier -- and to face the wrath of the drive's rugged, irascible leader, Captain Blade Roberts. ", "The handsome son of a French-Cana", "THE TRAIL OF DESTINY AND DREAMS... ", "It was a once-in-a-lifetime opportunity for naturalist Theodora Gordon. Leaving her affluent New England home, the bookish, gently bred beauty headed west to join a government expedition across America's last frontier -- and to face the wrath of the drive's rugged, irascible leader, Captain Blade Roberts. ", "The handsome son of a French-Canadian trapper and a Cheyenne princess, Blade feared for the life of the innocent, pampered Easterner he was duty-bound to protect. But in a cruel and magnificent wilderness -- on a perilous journey plagued by treachery, tragedy and deceit -- Theodora would win the virile half-breed's grudging respect with her courage and stamina ... and win his heart with the passionate promise of an irresistible and eternal love."], "author": "Kathleen Harrington", "num_pages": "409", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-09-01 00:00:00", "ISBN": "0380761238"},
{"url": "https://www.goodreads.com/book/show/8431076-wolf-runner", "num_ratings": "246", "num_reviews": "4", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Romance", "Historical"], "title": "Wolf Runner", "description": ["From a \"USA Today\"-bestselling author. Wolf Runner has always had a mystical connection with his namesakes, but even they won't be able to help him when he loses his heart to an impossibly beautiful and troublesome woman. Original."], "author": "Constance O'Banyon", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-01 00:00:00", "ISBN": "0843964391"},
{"url": "https://www.goodreads.com/book/show/5393637-alpha-omega", "num_ratings": "16,505", "num_reviews": "865", "avg_ratings": 4.32, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Fantasy", "Romance", "Romance", "Paranormal Romance", "Shapeshifters", "Werewolves", "Paranormal", "Shapeshifters"], "title": "Alpha & Omega", "description": ["In ", ", ", " bestselling author Patricia Briggs started a new urban fantasy series set in the world of Mercy Thompson — but with rules of its own. Now, read \"Alpha and Omega,\" the novella that inspired the new series, and see how it all began...", "Anna Latham never knew werewolves existed, until the night she survived a violent attack... and became one herself.", "In ", ", ", " bestselling author Patricia Briggs started a new urban fantasy series set in the world of Mercy Thompson — but with rules of its own. Now, read \"Alpha and Omega,\" the novella that inspired the new series, and see how it all began...", "Anna Latham never knew werewolves existed, until the night she survived a violent attack... and became one herself. After three years at the bottom of the Chicago pack, she's learned to keep her head down and never, ever trust dominant males. But when she discovers wrongdoing in her pack, she has to go above her Alpha's head to ask for help.", "Charles Cornick is the son — and enforcer — of the leader of the North American werewolves. Now his father has sent him to Chicago to clean up a problem there. Charles never expected to find Anna, a rare Omega wolf — and he certainly never expected to recognize her as his mate...", "This novella was originally published in the anthology, "], "author": "Patricia Briggs", "num_pages": "61", "awards": [], "places": ["Chicago, Illinois", "Montana"], "character_names": ["Charles Cornick", "Anna Latham", "Bran \"The Marrok\" Cornick", "Leo (Chicago Alpha)"], "language": "English", "publish_date": "2008-10-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1166359.Walk_Into_the_Night", "num_ratings": "14", "num_reviews": "4", "avg_ratings": 4.57, "genres": ["Romance", "Historical Romance", "Historical"], "title": "Walk Into the Night", "description": ["When a Fire-Star blazes across the night sky, a proud people will rise again. They will fight their enemy on the boundless Texas Prairie ... and one woman will heed the call of her star-crossed destiny.", "She is known as Storm Trail .... pledged to fight those who would destroy her people's once-great nation. But it is the defiant hostage -- the man the Comanches call White R", "When a Fire-Star blazes across the night sky, a proud people will rise again. They will fight their enemy on the boundless Texas Prairie ... and one woman will heed the call of her star-crossed destiny.", "She is known as Storm Trail .... pledged to fight those who would destroy her people's once-great nation. But it is the defiant hostage -- the man the Comanches call White Raven who will help her defend their ancient and noble way of life.", "Yet even as a peaceful era comes to an end, ushering in a time of bloodshed and tears that makes enemies of lovers, Storm Trail and White Raven will fight the winds of change that sweep across a divided land. Together, they will fight for a love no force on heaven or earth can tear asunder."], "author": "Beverly Bird", "num_pages": "477", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Historical Novel  (1996)"], "places": ["Texas"], "character_names": [], "language": "English", "publish_date": "1996-01-01 00:00:00", "ISBN": "0786002204"},
{"url": "https://www.goodreads.com/book/show/1732514.Apache_Caress", "num_ratings": "138", "num_reviews": "5", "avg_ratings": 4.05, "genres": ["Romance", "Historical Romance", "Historical", "Westerns", "Romance"], "title": "Apache Caress", "description": ["Cholla seethed with fury. The Apache scout had risked his life tracking down renegades for the white man only to find himself chained like an animal on the army prison train. Well, if they wanted a vicious savage, he'd give them one--he'd even force a white woman to help him escape. Sierra Forester had gotten in his way, and he was in no mood to let t", "Cholla seethed with fury. The Apache scout had risked his life tracking down renegades for the white man only to find himself chained like an animal on the army prison train. Well, if they wanted a vicious savage, he'd give them one--he'd even force a white woman to help him escape. Sierra Forester had gotten in his way, and he was in no mood to let the beautiful widow go. He didn't intend to harm her, but it was a long way from St. Louis to Arizona, and along the trail he vowed to discover exactly what his lovely captive knew about satisfying a man's desires . . . and unleashing her own!", "Every day Sierra grew less afraid of her savage captor. At first she thought he would kill her...or worse. After all, her husband had died at the hands of the Apache. But this Indian seemed to have more honor and courage than anyone she'd ever known. As they moved west, the handsome warrior protected her bravely from wild animals and wilder men--and tempted her with delights she'd never imagined. Now her traitorous soul hoped she'd never be free from his muscular embrace and searing touch. Her urges were scandalous, but Sierra could resist no longer. She would give anything to savor the wild ecstasy of his..."], "author": "Georgina Gentry", "num_pages": "435", "awards": [], "places": ["Missouri"], "character_names": ["Sierra Forester", "Cholla"], "language": "English", "publish_date": "1991-10-01 00:00:00", "ISBN": "0821735608"},
{"url": "https://www.goodreads.com/book/show/9665450-storm-s-heart", "num_ratings": "15,179", "num_reviews": "1,054", "avg_ratings": 3.96, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Fantasy", "Fantasy", "Urban Fantasy", "Paranormal", "Shapeshifters", "Fantasy", "Dragons", "Fairies", "Fae"], "title": "Storm's Heart", "description": ["During the rule of her murderous Dark Fae uncle, Thistle \"Tricks\" Periwinkle found sanctuary among the Wyr in New York. Her ethereal beauty and sparkling personality won the hearts of the public, but after her uncle'", "During the rule of her murderous Dark Fae uncle, Thistle \"Tricks\" Periwinkle found sanctuary among the Wyr in New York. Her ethereal beauty and sparkling personality won the hearts of the public, but after her uncle's death, there are those who don't want to see her ascend to the throne.", "Able to wield thunder and lightning, Wyr sentinel Tiago Black Eagle has ruled the skies for centuries. His massive build and thunderous power make him one of the Wyr's best weapons. And he's sent to protect Tricks when she's almost assassinated in Chicago.", "Soon, both Tiago and Tricks will fall prey to the stormy hunger that engulfs them—a passion that will shake the very foundation of all the worlds."], "author": "Thea Harrison", "num_pages": "305", "awards": [], "places": ["Chicago, Illinois"], "character_names": ["Thistle \"Tricks\" Periwinkle", "Tiago Black"], "language": "English", "publish_date": "2011-08-02 00:00:00", "ISBN": "0425242668"},
{"url": "https://www.goodreads.com/book/show/2572812-savage-spirit", "num_ratings": "33", "num_reviews": "6", "avg_ratings": 4.0, "genres": ["Fiction", "Historical", "Historical", "Historical Fiction", "Romance"], "title": "Savage Spirit", "description": ["Captured by Shawnee Indians and taken far from her home, sixteen-year-old Catherine Brant meets Blue Quail, a handsome warrior who captures her heart with his wild bravery."], "author": "Meg Cameron", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1986-04-24 00:00:00", "ISBN": "0583309011"},
{"url": "https://www.goodreads.com/book/show/15923083-moon-over-taylor-s-ridge", "num_ratings": "41", "num_reviews": "12", "avg_ratings": 4.15, "genres": [], "title": "Moon Over Taylor's Ridge", "description": ["Avie Williams Cole reluctantly journeys home to Georgia to settle her father's estate. Too busy to go along, her husband sends her off with their asthmatic son to keep her company.", "In tiny Taylor's Crossing, Avie struggles with her grief, meddling relatives, and a trespasser on her family land. As her stay lengthens, she finds her life unraveling even as she begins to bloss", "Avie Williams Cole reluctantly journeys home to Georgia to settle her father's estate. Too busy to go along, her husband sends her off with their asthmatic son to keep her company.", "In tiny Taylor's Crossing, Avie struggles with her grief, meddling relatives, and a trespasser on her family land. As her stay lengthens, she finds her life unraveling even as she begins to blossom and make new friends. What will she do about her marriage, and the man on Taylor's Ridge? How can she hold onto the red land she cherishes?"], "author": "Janie Dempsey Watts", "num_pages": "243", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10324780-the-bride-wore-spurs", "num_ratings": "1,041", "num_reviews": "91", "avg_ratings": 3.67, "genres": ["Romance", "Historical Romance", "Westerns", "Romance", "Historical", "Romance", "Western Romance"], "title": "The Bride Wore Spurs", "description": ["Kathleen Lacey O'Carroll knew she faced an uncertain future when she arrived in Wyoming as a mail-order bride - especially when she learned that the man she was to marry hadn't actually ordered her. How could John Winterhawke, a fiercely independent and unsettling handsome half-Indian possibly make room in his heart and in his life for her?", "As far as Hawke was concerned, th", "Kathleen Lacey O'Carroll knew she faced an uncertain future when she arrived in Wyoming as a mail-order bride - especially when she learned that the man she was to marry hadn't actually ordered her. How could John Winterhawke, a fiercely independent and unsettling handsome half-Indian possibly make room in his heart and in his life for her?", "As far as Hawke was concerned, the last thing he needed was a high-spirited, overeager Irish wife who knew nothing about surviving on the harsh prairie. But once the determined Lacey sensed the rough kindness and simmering hunger under Hawke's forbidding demeanor, she set out to match his dark passion with her own - and claim his wild heart on her terms."], "author": "Sharon Ihle", "num_pages": "322", "awards": [], "places": ["Wyoming"], "character_names": ["John Winterhawke", "Kathleen Lacey O'Carroll"], "language": "English", "publish_date": "1995-06-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2172383.Lone_Arrow_s_Pride", "num_ratings": "143", "num_reviews": "6", "avg_ratings": 4.15, "genres": ["Romance", "Historical", "Romance", "Historical Romance", "Westerns"], "title": "Lone Arrow's Pride", "description": ["Carolyn White was a child in danger when she was rescued by a young Crow Indian. Years later, she is returning to the place where she and the brave Lone Arrow were briefly united. She tells herself she must undo a curse she had innocently set in motion. Yet there is another reason for Carolyn's journey -- for she longs to find once again the noble stranger who inhabits her", "Carolyn White was a child in danger when she was rescued by a young Crow Indian. Years later, she is returning to the place where she and the brave Lone Arrow were briefly united. She tells herself she must undo a curse she had innocently set in motion. Yet there is another reason for Carolyn's journey -- for she longs to find once again the noble stranger who inhabits her dreams and desires.\"She should not be in his world!\" ", "But try as he might, Lone Arrow cannot dismiss from his thoughts this bold beauty who left as a girl but has come back as woman of spirit and fire. Each moment they spend together merely intensifies the warrior's burning need. For she is his destiny, though the chasm dividing their cultures is wide. Still Lone Arrow will not rest until she is his...and they are making love beneath the moonlit skies."], "author": "Karen Kay", "num_pages": "366", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-01 00:00:00", "ISBN": "0380820668"},
{"url": "https://www.goodreads.com/book/show/2004002.Touch_the_Sun", "num_ratings": "27", "num_reviews": "5", "avg_ratings": 4.37, "genres": ["Romance", "Historical Romance", "Fiction", "Romance"], "title": "Touch the Sun", "description": ["An unforgettable new saga of a proud woman and her people, a story of passion and survival in frontier America... ", "From a shy, innocent girl, Eagle Voice would grow into a woman of strength -- a warrior's woman, bound to a life of danger, struggle, and adventure. Like the roots of a mighty tree, she would help anchor her tribe to its beloved homeland. And like the wings of", "An unforgettable new saga of a proud woman and her people, a story of passion and survival in frontier America... ", "From a shy, innocent girl, Eagle Voice would grow into a woman of strength -- a warrior's woman, bound to a life of danger, struggle, and adventure. Like the roots of a mighty tree, she would help anchor her tribe to its beloved homeland. And like the wings of a bird, her fierce passion for one brave man would set her heart in flight and lead her to a soaring destiny..."], "author": "Beverly Bird", "num_pages": "344", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-04-01 00:00:00", "ISBN": "042514156X"},
{"url": "https://www.goodreads.com/book/show/402054.The_Mists_of_Manittoo", "num_ratings": "31", "num_reviews": "7", "avg_ratings": 3.9, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical Fiction"], "title": "The Mists of Manittoo", "description": ["Elizabeth lay bruised and overcome by fever, the red earth of the forest beneath her and the tall, bronzed Indian above. He was Wakwa, standing proud and prince-like in the wind and the rain. He was a thousand years behind the civilization of the English settlers, but her future was with him.", "From the moment he came", "Elizabeth lay bruised and overcome by fever, the red earth of the forest beneath her and the tall, bronzed Indian above. He was Wakwa, standing proud and prince-like in the wind and the rain. He was a thousand years behind the civilization of the English settlers, but her future was with him.", "From the moment he came upon the frightened young girl who had run away from a cruel betrothal to a Puritan minister, Wakwa was her protector against harm. He would stand beside her against his own people and hers, fearless of the danger. For however great was the suffering their would be made to endure, their love was greater."], "author": "Lois Swann", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1981-12-01 00:00:00", "ISBN": "0380016907"},
{"url": "https://www.goodreads.com/book/show/25600921-into-the-americas", "num_ratings": "260", "num_reviews": "33", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Adventure", "Action", "Young Adult", "Young Adult Romance", "Young Adult", "Romance", "Historical Romance", "Historical", "True Story"], "title": "Into the Americas", "description": ["INTO THE AMERICAS (A novel based on a true story) is a gritty, real-life adventure based on one of history’s greatest survival stories. It was inspired by the diary entries of young English blacksmith John Jewitt during his time aboard the brigantine The Boston and also during his sojourn at Nootka Sound, on North America's western seaboard, from 1802 to 1805.", "Written by fa", "INTO THE AMERICAS (A novel based on a true story) is a gritty, real-life adventure based on one of history’s greatest survival stories. It was inspired by the diary entries of young English blacksmith John Jewitt during his time aboard the brigantine The Boston and also during his sojourn at Nootka Sound, on North America's western seaboard, from 1802 to 1805.", "Written by father-and-son writing team Lance & James Morcan (authors of The World Duology and The Orphan Trilogy), INTO THE AMERICAS is a tale of two vastly different cultures – Indigenous North American and European civilization – colliding head on. It is also a Romeo and Juliet story set in the wilderness.", "Nineteen year-old blacksmith John Jewitt is one of only two survivors after his crewmates clash with the fierce Mowachaht tribe in the Pacific Northwest. A life of slavery awaits John and his fellow survivor, a belligerent American sailmaker, in a village ruled by the iron fist of Maquina, the all-powerful chief. Desperate to taste freedom again, they make several doomed escape attempts over mountains and sea. Only their value to the tribe and John’s relationship with Maquina prevents their captors from killing them.", "As the seasons pass, John ‘goes Indian’ after falling in love with Eu-stochee, a beautiful maiden. This further alienates him from his fellow captive whose defiance leads to violent consequences. In the bloodshed that follows, John discovers another side to himself – a side he never knew existed and a side he detests. His desire to be reunited with the family and friends he left behind returns even stronger than before.", "The stakes rise when John learns Eu-stochee is pregnant. When a final opportunity to escape arises, he must choose between returning to civilization or staying with Eu-stochee and their newborn son."], "author": "Lance Morcan", "num_pages": "542", "awards": [], "places": ["British Columbia", "Vancouver Island, British Columbia", "Nootka Sound, Vancouver Island", "Pacific Northwest", "Canada"], "character_names": ["John Jewitt", "Eu-stochee", "Maquina"], "language": "English", "publish_date": "2015-05-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6439115-comanche-wind", "num_ratings": "33", "num_reviews": "1", "avg_ratings": 3.67, "genres": ["Romance", "Historical Romance", "Historical Romance", "Western Historical Romance"], "title": "Comanche Wind", "description": ["Betrothed against her will while barely more than a child, lovely, impetuous Jennie O'Bannion believes her life is over. Then fate intervenes on the Texas frontier, when a proud Comanche warrior claims Jennie as his own --- abducting the strong-willed, flame-haired beauty from the man who would cruelly break her wild spirit. Though she aches to surrender to his raw and sen", "Betrothed against her will while barely more than a child, lovely, impetuous Jennie O'Bannion believes her life is over. Then fate intervenes on the Texas frontier, when a proud Comanche warrior claims Jennie as his own --- abducting the strong-willed, flame-haired beauty from the man who would cruelly break her wild spirit. Though she aches to surrender to his raw and sensuous power, Jennie fears her handsome, savage captor --- the one they call Windrider --- and vows to escape. But Windrider will not relinquish his cherished prize --- though it means incurring both the wrath of his own people and the white man's vengeance. For the noble brave's passion for his beautiful \"Fire Flower\" cannot be tamed ... and his love will not be denied."], "author": "Genell Dellin", "num_pages": "390", "awards": [], "places": [], "character_names": ["Jennie O'Bannion", "Windrider"], "language": "English", "publish_date": "1993-05-28 00:00:00", "ISBN": "0380767171"},
{"url": "https://www.goodreads.com/book/show/221434.The_Angel_the_Outlaw", "num_ratings": "214", "num_reviews": "10", "avg_ratings": 4.21, "genres": ["Romance", "Historical Romance", "Science Fiction", "Time Travel", "Romance", "Historical", "Westerns"], "title": "The Angel & the Outlaw", "description": ["An outlaw, a horse thief, a man killer, J.T. Cutter wasn't surprised when he was strung up for his crimes. What amazed him was the heavenly being who granted him one year to change his wicked ways, Yet when he returned to his old life, he hoped to cram a whole lot of hell-raising into those 12 months no matter what the future held."], "author": "Madeline Baker", "num_pages": "439", "awards": [], "places": ["United States of America"], "character_names": ["J.T. Cutter", "Brandy (Angel and the Outlaw)"], "language": "English", "publish_date": "1996-03-01 00:00:00", "ISBN": "0843839317"},
{"url": "https://www.goodreads.com/book/show/1047507.Mother_Earth_Father_Sky", "num_ratings": "7,540", "num_reviews": "201", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy", "Historical Fiction", "Prehistoric"], "title": "Mother Earth Father Sky", "description": ["In a time before history, in a harsh and beautiful land near the top of the world, womanhood comes cruelly and suddenly to beautiful, young Chagak. Surviving the brutal massacre of her tribe, she sets out across the icy waters off Ameria's northwest coast on an astonishing odyssey that will reveal to Chagak powerful secrets of the earth and sky... and the mysteries of love", "In a time before history, in a harsh and beautiful land near the top of the world, womanhood comes cruelly and suddenly to beautiful, young Chagak. Surviving the brutal massacre of her tribe, she sets out across the icy waters off Ameria's northwest coast on an astonishing odyssey that will reveal to Chagak powerful secrets of the earth and sky... and the mysteries of love and loss."], "author": "Sue Harrison", "num_pages": "402", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-09-01 00:00:00", "ISBN": "0380715929"},
{"url": "https://www.goodreads.com/book/show/1397385.Forbidden_Ecstasy", "num_ratings": "342", "num_reviews": "12", "avg_ratings": 4.17, "genres": ["Romance", "Historical", "Romance", "Historical Romance", "Westerns"], "title": "Forbidden Ecstasy", "description": ["Forbidden Ecstasy by Janelle Taylor. ", "ALISHA", "was silk and satin, honey and fire. Never before did the possession of a man fill her with such excitement as-when she held her handsome Indian lover in her arms. That she was a white woman living in the red man's world did not matter. They had promised each other their hearts forever -- nothing could keep them apart.", "GRAY EAGLE", "was", "Forbidden Ecstasy by Janelle Taylor. ", "ALISHA", "was silk and satin, honey and fire. Never before did the possession of a man fill her with such excitement as-when she held her handsome Indian lover in her arms. That she was a white woman living in the red man's world did not matter. They had promised each other their hearts forever -- nothing could keep them apart.", "GRAY EAGLE", "was fierce and gentle, powerful and possessive.", "He would never forsake his bride of two moons; he would never let her go.", "But when Alisha awoke to dawn's first light her bronze-skinned warrior was gone.", "Her lips were swollen from his savage kisses; her body bruised from his brutal passion -- and still she longed for him.", "Lost between two worlds, she was desperate and alone. Betrayed by her savage lover, she hungered for their", "FORBIDDEN ECSTASY"], "author": "Janelle Taylor", "num_pages": "494", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-08-08 00:00:00", "ISBN": "0821752782"},
{"url": "https://www.goodreads.com/book/show/502592.Love_in_the_Wind", "num_ratings": "365", "num_reviews": "23", "avg_ratings": 4.16, "genres": ["Romance", "Historical Romance", "Historical", "Westerns", "Romance", "Asian Literature", "Indian Literature"], "title": "Love in the Wind", "description": ["HER ENEMY'S EMBRACE", "Shattered by grief at her fiance's death, lovely Katy Marie Alvarez decided to enter a convent. But fate had other plans. En route to her destination, the coach in which Katy traveled was attacked by Indians and Katy, the lone survivor, was taken captive. Thus she became the slave of the handsome, arrogant Cheyenne warrior known as Iron Wing. Quickened b", "HER ENEMY'S EMBRACE", "Shattered by grief at her fiance's death, lovely Katy Marie Alvarez decided to enter a convent. But fate had other plans. En route to her destination, the coach in which Katy traveled was attacked by Indians and Katy, the lone survivor, was taken captive. Thus she became the slave of the handsome, arrogant Cheyenne warrior known as Iron Wing. Quickened by desire that transformed hatred into love, both were soon ablaze with an erotic flame which neither time nor treachery could quench."], "author": "Madeline Baker", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-03-28 00:00:00", "ISBN": "0843945893"},
{"url": "https://www.goodreads.com/book/show/9799572-rock-chick-redemption", "num_ratings": "30,342", "num_reviews": "1,607", "avg_ratings": 4.42, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Humor", "Funny"], "title": "Rock Chick Redemption", "description": ["Roxie’s on the run from a bad boyfriend who will not catch the hint that it is o-v-e-r. She’s in no mood for love at first sight, but when her eyes fall on Hank, it’s trouble from the get-go. Roxie tries to hold Hank at arms length but Hank wants to be a closer (as in, a lot closer). Roxie’s trouble catches up with her and Hank wants to help but Roxie knows in her heart th", "Roxie’s on the run from a bad boyfriend who will not catch the hint that it is o-v-e-r. She’s in no mood for love at first sight, but when her eyes fall on Hank, it’s trouble from the get-go. Roxie tries to hold Hank at arms length but Hank wants to be a closer (as in, a lot closer). Roxie’s trouble catches up with her and Hank wants to help but Roxie knows in her heart that she’s no good for a white hat guy. The problem is no one agrees with her, especially her crazy hippie best friend Annette or her parents; the even crazier small-Indiana-town Herb and Trish. Toss into the mix the gang from Rock Chick and Rock Chick Rescue and Roxie finds herself totally outnumbered.", "Climb in for another Rock Chick wild ride through Rock Chick Redemption. As the odds stack up against Roxie, she has no choice but to hold on and just ride it out through the kidnappings, car chases, society parties, a riot at the strip club, Hank getting “Mom Bombed” and one crazy night at the Haunted House.", "During all this Hank works at convincing her she really wants to stay and he, along with the Hot Bunch, go all out to make her safe. Hank also needs to work on showing Roxie that her past decisions don’t mean her future can’t include something as downright delicious as… normal."], "author": "Kristen Ashley", "num_pages": "426", "awards": [], "places": ["Denver, Colorado"], "character_names": ["India \"Indy\" Savage", "Liam \"Lee\" Nightingale", "Allyson \"Ally\" Nightingale", "Henry \"Hank\" Nightingale", "Edward \"Eddie\" Chavez", "Roxanne \"Roxie\" Logan"], "language": "English", "publish_date": "2010-11-08 00:00:00", "ISBN": "1453720693"},
{"url": "https://www.goodreads.com/book/show/89360.Seventh_Heaven", "num_ratings": "1,769", "num_reviews": "103", "avg_ratings": 4.01, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary"], "title": "Seventh Heaven", "description": ["Ten years ago Joe Lakota had left behind his small Oregon town and the only woman he'd ever truly loved for the empty promises of the big city. Now he's returned, seeking to raise his young son with values you can only find at home, and longing to rekindle the passion he'd once had with beautiful Marilee Nelson. But Marilee isn't anything like the gentle yet self-assured g", "Ten years ago Joe Lakota had left behind his small Oregon town and the only woman he'd ever truly loved for the empty promises of the big city. Now he's returned, seeking to raise his young son with values you can only find at home, and longing to rekindle the passion he'd once had with beautiful Marilee Nelson. But Marilee isn't anything like the gentle yet self-assured girl he'd left behind. In her place is a woman tormented by a secret she refuses to share, even with Joe.", "Marilee never wanted to see Joe again; their parting had been too painful. And though his strong arms and powerful body could protect her, she knew only too well the harm they could also bring. Her head tells her to resist Joe's persistent advances, her heart is telling her something very different. And then he makes her the sweetest proposition of all: become his wife and mother of his child. But how can she agree to a marriage, even in name only, when she can't stand to tell him the truth?"], "author": "Catherine Anderson", "num_pages": "379", "awards": [], "places": ["Oregon"], "character_names": ["Marilee Nelson", "Joe Lakota"], "language": "English", "publish_date": "2010-07-27 00:00:00", "ISBN": "0380799383"},
{"url": "https://www.goodreads.com/book/show/1936167.Love_Forevermore", "num_ratings": "143", "num_reviews": "6", "avg_ratings": 4.03, "genres": ["Romance", "Historical Romance", "Historical", "Asian Literature", "Indian Literature"], "title": "Love Forevermore", "description": [" — it had been Loralee's dream for as long as she could remember, and Indians were the most fascinating part of the wildly beautiful frontier she imagined. But when Loralee arrived at Fort Apache as the new schoolmarm, she had some hard realities to learn...and a harsh taskmaster to teach her.", "Shad Zuniga was fiercely proud, aloof, a renegade Apache who wanted no pa", " — it had been Loralee's dream for as long as she could remember, and Indians were the most fascinating part of the wildly beautiful frontier she imagined. But when Loralee arrived at Fort Apache as the new schoolmarm, she had some hard realities to learn...and a harsh taskmaster to teach her.", "Shad Zuniga was fiercely proud, aloof, a renegade Apache who wanted no part of the white man's world, not even its women. Yet Loralee was driven to seek him out, compelled to join him in a forbidden union, forced to become an outcast for one slim chance at Love Forevermore."], "author": "Madeline Baker", "num_pages": "431", "awards": [], "places": ["Arizona Territory"], "character_names": [], "language": "English", "publish_date": "1997-06-01 00:00:00", "ISBN": "0843942673"},
{"url": "https://www.goodreads.com/book/show/1106323.Ride_The_Free_Wind", "num_ratings": "300", "num_reviews": "19", "avg_ratings": 4.51, "genres": ["Romance", "Historical Romance", "Historical", "Westerns", "Romance", "Western Romance"], "title": "Ride The Free Wind", "description": ["Abandoning everything she had ever known, Abigail Trent left her family and chose her fate--to ride with Zeke Monroe, half-Cheyenne scout, into the unexplored west. Together they faced peril, until Zeke found his mother's people and became Lone Eagle, turning his back on the white man's world. To stay with him, Abigail must become Cheyenne too--even if it means death and w", "Abandoning everything she had ever known, Abigail Trent left her family and chose her fate--to ride with Zeke Monroe, half-Cheyenne scout, into the unexplored west. Together they faced peril, until Zeke found his mother's people and became Lone Eagle, turning his back on the white man's world. To stay with him, Abigail must become Cheyenne too--even if it means death and warfare."], "author": "Rosanne Bittner", "num_pages": "445", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-07-01 00:00:00", "ISBN": "0821753436"},
{"url": "https://www.goodreads.com/book/show/265861.A_Love_Beyond_Time", "num_ratings": "108", "num_reviews": "10", "avg_ratings": 4.03, "genres": ["Science Fiction", "Time Travel", "Romance", "Romance", "Historical Romance", "Romance", "Time Travel Romance", "Historical", "Historical", "Historical Fiction"], "title": "A Love Beyond Time", "description": ["When anthropologist Ryan Burke joins a dig at the site of Little Big Horn, she realizes that not everyone is excited about the opportunity. Renowned Indian affairs lawyer Dillon Wolf wants to shut the project down. But when Ryan is given an old tribal tipi, she journeys to the past -- where the tension between her and a Lakota warrior named Wolf erupts...into passion."], "author": "Judie Aitken", "num_pages": "376", "awards": ["HOLT Medallion by Virginia Romance Writers for Paranormal/Time Travel/Futuristic (2001)"], "places": ["United States of America"], "character_names": ["Dillon Wolf", "Ryan Burke"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0515127442"},
{"url": "https://www.goodreads.com/book/show/8487974-promise-canyon", "num_ratings": "7,785", "num_reviews": "408", "avg_ratings": 4.12, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Fiction", "Womens Fiction", "Chick Lit"], "title": "Promise Canyon", "description": ["After years spent on ranches around Los Angeles, Clay Tahoma is delighted to be Virgin River's new veterinary assistant. The secluded community's wild beauty tugs at his Navajo roots, and he's been welcomed with open arms by everyone in town—everyone ", " Lilly Yazhi.", "Lilly has encountered her share of strong, silent, ", " men within her own aboriginal community, a", "After years spent on ranches around Los Angeles, Clay Tahoma is delighted to be Virgin River's new veterinary assistant. The secluded community's wild beauty tugs at his Navajo roots, and he's been welcomed with open arms by everyone in town—everyone ", " Lilly Yazhi.", "Lilly has encountered her share of strong, silent, ", " men within her own aboriginal community, and she's not interested in coming back for more. In her eyes, Clay's earthy, sexy appeal is just an act used to charm wealthy women like his ex-wife. She can't deny his gift for gentling horses, but she's not about to let him control her. There's just one small problem—", " can't control her attraction to Clay.", "But in Virgin River, faith in new beginnings and the power of love has doors opening everywhere...."], "author": "Robyn Carr", "num_pages": "342", "awards": [], "places": ["Virgin River, California", "California"], "character_names": ["Clay Tahoma", "Lilly Yazhi"], "language": "English", "publish_date": "2010-12-21 00:00:00", "ISBN": "0778329216"},
{"url": "https://www.goodreads.com/book/show/1603790.Fire_and_Rain", "num_ratings": "138", "num_reviews": "8", "avg_ratings": 4.11, "genres": ["Romance", "Romance", "Historical Romance", "Romance", "Contemporary Romance", "Historical", "Historical Fiction", "Historical", "Westerns"], "title": "Fire and Rain", "description": ["In a century-old steamer trunk, journalist Ceci", "In a century-old steamer trunk, journalist Cecily Metcalf discovers the diary of a remarkable young woman whose words reach out across time--touching Cecily's heart, leading her back to her handsome, enigmatic first love, Kiah Red Thunder...inspiring them both in their glorious, dangerous quest to reclaim a lost and powerful passion."], "author": "Kathleen Eagle", "num_pages": "373", "awards": ["RITA Award by Romance Writers of America Nominee for Contemporary Single Title Romance & Best Romance of 1994 (1995)"], "places": ["South Dakota"], "character_names": ["Whirlwind Rider", "Priscilla Twiss", "Cecily Metcalf", "Kiah Red Thunder"], "language": "English", "publish_date": "1994-01-16 00:00:00", "ISBN": "0380771683"},
{"url": "https://www.goodreads.com/book/show/2516263.Nakoa_s_Woman", "num_ratings": "167", "num_reviews": "25", "avg_ratings": 3.99, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical Fiction", "Westerns", "Historical", "Asian Literature", "Indian Literature"], "title": "Nakoa's Woman", "description": ["The tale of a beautiful white girl who is captured by the Blackfoot Indian warrior Nakoa, and of their stormy relationship as she struggles against her growing love for her captor and he struggles against the customs of his people. A large cast of vivid characters surrounds the young lovers as they work out their fates.", "'Previously published as THE SECOND KISS, 1972, by Gay", "The tale of a beautiful white girl who is captured by the Blackfoot Indian warrior Nakoa, and of their stormy relationship as she struggles against her growing love for her captor and he struggles against the customs of his people. A large cast of vivid characters surrounds the young lovers as they work out their fates.", "'Previously published as THE SECOND KISS, 1972, by Gayle Rogers Brown'"], "author": "Gayle Rogers", "num_pages": "343", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-28 00:00:00", "ISBN": "097230780X"},
{"url": "https://www.goodreads.com/book/show/18070166-savage-forest", "num_ratings": "148", "num_reviews": "28", "avg_ratings": 3.86, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical Fiction"], "title": "Savage Forest", "description": ["Alternate Cover Edition: B00CDG7CO6", "Jenna Ulfsson is faced with one consuming quest: survival. Her darkest nightmares are realized when the young Swedish immigrant is taken by the Lenni Lenape Indians after a grave misunderstanding turns to bloodshed. Looking into the piercing black eyes of her bronze-skinned captor, Jenna prepares to endure a ghastly revenge for her father", "Alternate Cover Edition: B00CDG7CO6", "Jenna Ulfsson is faced with one consuming quest: survival. Her darkest nightmares are realized when the young Swedish immigrant is taken by the Lenni Lenape Indians after a grave misunderstanding turns to bloodshed. Looking into the piercing black eyes of her bronze-skinned captor, Jenna prepares to endure a ghastly revenge for her father’s mortal mistake. ", "Running Wolf is a striking and virile Minsi brave who first discovers the golden-haired female hunting as a man deep within the forest. He is enthralled with the slender, green-eyed creature, so different from any white woman he has ever before encountered. Yet when his brother is needlessly murdered by the girl’s father, the course of his life is changed forever. ", "Running Wolf rashly takes the young woman captive, bearing her deep within the savagely beautiful mountain regions of the New World’s interior, his homeland known as the Dark Forest, steeped with mysticism and lore of a people little known by the Whites. Jenna slowly adapts to the native way of life, discovering her own talent as a natural healer among the native people. ", "Sexual tensions and clashes of will escalate as Jenna is thrown into the care and lodge of Running Wolf by decree of the chief. In close quarters, their mutual attraction can no longer be denied. Temper and passion entwine the couple until Running Wolf is stretched to the breaking point. Can he tame the young Swede's indomitable spirit?"], "author": "Jessica Leigh", "num_pages": "359", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1126427.Summer_Storm", "num_ratings": "185", "num_reviews": "17", "avg_ratings": 4.17, "genres": ["Romance", "Historical Romance", "Romance", "Westerns"], "title": "Summer Storm", "description": ["Summer Storm was as soft and warm as a sweet summer rain--as tempestuous and unpredictable as a thunderstorm over the desert. Windrider was destined to lead his people as a warrior chief and to tame the woman named Summer Storm. Tough she had given her heart to another, he vowed their tumultuous joining would be climaxed in a whirlwind of ecstasy."], "author": "Catherine Hart", "num_pages": "476", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-06-01 00:00:00", "ISBN": "0843940735"},
{"url": "https://www.goodreads.com/book/show/959089.The_Savage_Heart", "num_ratings": "821", "num_reviews": "44", "avg_ratings": 4.02, "genres": ["Romance", "Historical", "Romance", "Historical Romance"], "title": "The Savage Heart", "description": ["Tess Meredith and Raven Following shared freedom and friendship on the wild Montana plains. But the brutal hardships that plagued the Sioux forced Raven to abandon his people, his heritage - and Tess. In Chicago, he forged a new life as a new man. Until Tess arrived, bringing with her the past he'd tried to deny. Gone was the spitfire nonconformist no man could tame, repla", "Tess Meredith and Raven Following shared freedom and friendship on the wild Montana plains. But the brutal hardships that plagued the Sioux forced Raven to abandon his people, his heritage - and Tess. In Chicago, he forged a new life as a new man. Until Tess arrived, bringing with her the past he'd tried to deny. Gone was the spitfire nonconformist no man could tame, replaced by a fearless and determined young suffragette willing to fight for everything she held dear. But Tess would harness all the courage and spirit of a way of life gone forever to wage her greatest battle ... for love."], "author": "Diana Palmer", "num_pages": "311", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-06-28 00:00:00", "ISBN": "0449003345"},
{"url": "https://www.goodreads.com/book/show/7364793-paper-rose", "num_ratings": "1,615", "num_reviews": "51", "avg_ratings": 4.06, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary"], "title": "Paper Rose", "description": ["Archaeologist Cecily Petersen has loved Tate Winthrop since she was a teen, but the handsome Native American refuses to consider a mixed marriage. Instead, he becomes her white knight, protecting her from an abusive stepfather and arranging college grants and housing. But when Cecily discovers that the \"grants\" were actually outright gifts from Tate, she's furious. Her ang", "Archaeologist Cecily Petersen has loved Tate Winthrop since she was a teen, but the handsome Native American refuses to consider a mixed marriage. Instead, he becomes her white knight, protecting her from an abusive stepfather and arranging college grants and housing. But when Cecily discovers that the \"grants\" were actually outright gifts from Tate, she's furious. Her anger shifts their relationship from friends to lovers and forces them both to confront deeply held convictions and fears. When Cecily learns of a political scandal that could threaten Tate, she's determined to shield him, even though she knows it's likely that he'll never forgive her for the necessary deception. ", "With political scandal in D.C., nefarious shenanigans on the reservation, and sizzling passion between the hero and heroine, Paper Rose delivers everything Palmer's readers have come to expect and more"], "author": "Diana Palmer", "num_pages": "0", "awards": [], "places": [], "character_names": ["Tate Winthrop", "Cecily Petersen"], "language": "English", "publish_date": "1999-12-01 00:00:00", "ISBN": "1552041956"},
{"url": "https://www.goodreads.com/book/show/19120654-dutchman-timberbeast-saga", "num_ratings": "10", "num_reviews": "3", "avg_ratings": 3.8, "genres": [], "title": "DutchMan (TimberBeast Saga) (Volume 2)", "description": ["Coming to Buck Meadow and becoming a part of the forest family isn't the only thing that has changed in Kelsy Bowen's life. Since she is now single, she is free to follow her plan to increase her environmental skills and that includes getting closer to Fox in a more personal way. By gaining his trust she hopes he will share his secrets and that in turn will lead her to the", "Coming to Buck Meadow and becoming a part of the forest family isn't the only thing that has changed in Kelsy Bowen's life. Since she is now single, she is free to follow her plan to increase her environmental skills and that includes getting closer to Fox in a more personal way. By gaining his trust she hopes he will share his secrets and that in turn will lead her to the TimberBeast. With or without Fox, her plan is to wrap up her mission before winter sets in, but life in the forest is never predictable or safe, even when your friends are larger than life loggers. Ecoterrorists in the woods keep everyone on their toes. They ramp up their plans to stop the loggers and they don't care who gets hurt. Kelsy finds herself in a tangle of danger, possibilities and decisions. She expands her plans and spends more time with the loggers who bring new insights and doubts to her spying. But when Fox decides to focus his attention on more than friendship, Kelsy finds out that politics and the late summer weather aren't the only things heating up in the forest. Fox isn't shy about letting Kelsy know that he has more than her personal protection on his mind. He pushes her boundaries and teaches her about more than forest life. The truth she does not want to see, and the dangerous implications of knowing too much make her carefully laid plans spin out of control. Kelsy uses her new friends to find the TimberBeast so she can keep her winter deadline, but Fox has different ideas. Now that she has caught his attention, he is playing to win, and fair is not a part of his plan. ."], "author": "Jae Hall", "num_pages": "450", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-10 00:00:00", "ISBN": "1482002175"},
{"url": "https://www.goodreads.com/book/show/6013333-tucker-s-claim", "num_ratings": "2,320", "num_reviews": "139", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Romance", "Westerns", "Historical", "Adult Fiction", "Erotica", "Romance", "Western Romance"], "title": "Tucker's Claim", "description": ["Tucker McCade has known violence his whole life: orphaned in a massacre, abused as a \"half-breed\" child, trained as a ruthless Texas Ranger, he's learned the hard way that might makes right.", "So even he is shocked when he falls for Sallie Mae Reynolds, a Quaker nurse. Unable to resist Tucker's charm, character", "Tucker McCade has known violence his whole life: orphaned in a massacre, abused as a \"half-breed\" child, trained as a ruthless Texas Ranger, he's learned the hard way that might makes right.", "So even he is shocked when he falls for Sallie Mae Reynolds, a Quaker nurse. Unable to resist Tucker's charm, character and chiseled body, she throws herself into their torrid affair, indulging every one of her wildest sexual fantasies. Tucker's occupation, however, is the one thing about him she can't embrace. A staunch pacifist, Sallie Mae can't understand how his strong, caressing hand can clench in fury or pull a trigger to take a life. In this lawless land, Tucker knows you have to fight to survive. But when Sallie Mae becomes pregnant, he's willing to do whatever it takes to have his family — including hanging up his guns.", "Every night they spend together exploring new heights of ecstasy binds them ever closer, slowly erasing their differences…until the day Tucker's past comes calling, precipitating an explosive showdown between her faith, his promise and the need for revenge..."], "author": "Sarah McCarty", "num_pages": "329", "awards": [], "places": ["Texas"], "character_names": ["Tucker McCade", "Sally Mae Schermerhorn"], "language": "English", "publish_date": "2009-09-22 00:00:00", "ISBN": "0373605293"},
{"url": "https://www.goodreads.com/book/show/7882134-tracker-s-sin", "num_ratings": "2,067", "num_reviews": "137", "avg_ratings": 4.09, "genres": ["Historical", "Westerns", "Adult Fiction", "Erotica"], "title": "Tracker's Sin", "description": ["WED BY NECESSITY…JOINED BY DESIRE ", "Before his trade became his name, “Tracker” Ochoa was a scrawny Mestizo runaway. Now as fearsome as he once was frightened, he’s joined the notorious Hell’s Eight...and they have a job for him. ", "He must rescue kidnapped heiress Ari Blake and deliver her safely to the Hell’s Eight compound—by any means necessary. Turns out that includes marr", "WED BY NECESSITY…JOINED BY DESIRE ", "Before his trade became his name, “Tracker” Ochoa was a scrawny Mestizo runaway. Now as fearsome as he once was frightened, he’s joined the notorious Hell’s Eight...and they have a job for him. ", "He must rescue kidnapped heiress Ari Blake and deliver her safely to the Hell’s Eight compound—by any means necessary. Turns out that includes marrying her, if he means to escort her and her infant son across the Texas Territory. Tracker hadn’t bargained on a wife—especially such a fair, blue-eyed beauty. But the erotic pleasures of the marriage bed more than make up for the surprise. ", "Tracker’s well-muscled bronze skin and dark, dangerous eyes are far more exciting than any of Ari’s former debutante dreams. In the light of day, though, his deep scars and brooding intensity terrify her. But he’s her husband and she’s at his mercy. With the frontier against them and mercenary bandits at their heels, Ari fears she’ll never feel safe again. ", "Tracker, too, remembers what fear feels like. Though he burns to protect Ari, to keep her for himself always, he knows that money, history—and especially the truth—can tear them apart."], "author": "Sarah McCarty", "num_pages": "313", "awards": [], "places": ["Texas"], "character_names": ["Arianna Blake", "Tracker Ochoa"], "language": "English", "publish_date": "2010-10-01 00:00:00", "ISBN": "037360548X"},
{"url": "https://www.goodreads.com/book/show/2715826-cherokee-warriors", "num_ratings": "28", "num_reviews": "1", "avg_ratings": 3.25, "genres": ["Romance", "Historical Romance", "Romance"], "title": "Cherokee Warriors: The Captive", "description": ["The powerful sensuality of Creed Sixkiller makes Raney's heart race ... the same as it did three years ago when he proposed to her. But she refused him then, for her family was too finely bred to allow her to marry an Indian. Now, to save her brother who has escaped from prison, Raney must stick close to the proud, handsome half-breed Cherokee ... no matter how scandalous", "The powerful sensuality of Creed Sixkiller makes Raney's heart race ... the same as it did three years ago when he proposed to her. But she refused him then, for her family was too finely bred to allow her to marry an Indian. Now, to save her brother who has escaped from prison, Raney must stick close to the proud, handsome half-breed Cherokee ... no matter how scandalous it will be for them to travel alone together ... no matter how much she aches for his touch. Creed never wants to see Raney Childress again, not after she told him he wasn't good enough to live in her world. But he is determined to put her baby brother back in jail where he belongs, and Raney is not letting Creed out of her sight. Her delicate beauty and gentility only bring back the searing memories of their hopeless romance, but as he leads them both down a dangerous path, Creed is beginning to realize that the greatest peril of all is a love that never truly vanished ... and a wild desire that could not be tamed."], "author": "Genell Dellin", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "0060593326"},
{"url": "https://www.goodreads.com/book/show/379120.Before_Sunrise", "num_ratings": "1,888", "num_reviews": "65", "avg_ratings": 3.96, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Romance", "Romantic Suspense", "Fiction"], "title": "Before Sunrise", "description": ["Jeremiah Cortez thought he'd left the past behind him -- especially the part of his past concerning Phoebe Keller. Once she had stirred his world-weary soul. Now, years later, seeing the blond beauty again sparks dormant desires. But he has to push his emotions aside -- he has new ties that can't be broken.", "Phoebe thought her feelings for Cortez were buried as deep as the a", "Jeremiah Cortez thought he'd left the past behind him -- especially the part of his past concerning Phoebe Keller. Once she had stirred his world-weary soul. Now, years later, seeing the blond beauty again sparks dormant desires. But he has to push his emotions aside -- he has new ties that can't be broken.", "Phoebe thought her feelings for Cortez were buried as deep as the artifacts she studies in her museum. An expert in Native American culture, she has her doubts when an anthropologist claims to have discovered a Neanderthal skeleton on a nearby reservation. But before Phoebe can pursue the matter, the professor in question turns up dead -- and the FBI sends Cortez to investigate.", "Now, as the two delve further into the murder, they find themselves entangled in a world of conspiracy, deception...and a love more powerful than anything they've ever known."], "author": "Diana Palmer", "num_pages": "384", "awards": [], "places": ["North Carolina"], "character_names": [], "language": "English", "publish_date": "2006-07-01 00:00:00", "ISBN": "0373771207"},
{"url": "https://www.goodreads.com/book/show/2008692.So_Wide_the_Sky", "num_ratings": "161", "num_reviews": "21", "avg_ratings": 4.09, "genres": ["Romance", "Historical Romance", "Westerns", "Romance", "Romance", "Western Romance", "Historical", "Historical Fiction", "Historical"], "title": "So Wide the Sky", "description": ["Having survived nine years as a Kiowa captive, Cassandra Morgan is being traded back to the whites--returning to a life she hardly remembers. Drew Reynolds, a cavalry captain who was Cassie's first love feels honor-bound to marry her, though she is no longer the innocent girl he once cherished. Lone Hunter Jalbert, a proud half-Indian scout, secretly desires to claim Cassi", "Having survived nine years as a Kiowa captive, Cassandra Morgan is being traded back to the whites--returning to a life she hardly remembers. Drew Reynolds, a cavalry captain who was Cassie's first love feels honor-bound to marry her, though she is no longer the innocent girl he once cherished. Lone Hunter Jalbert, a proud half-Indian scout, secretly desires to claim Cassie as his own. Like Cass, he understands what it is like to be caught between two worlds."], "author": "Elizabeth Grayson", "num_pages": "384", "awards": [], "places": ["Department of the Platte"], "character_names": ["Cassandra Morgan", "Drew Reynolds", "Hunter Jalbert"], "language": "English", "publish_date": "1997-03-07 00:00:00", "ISBN": "0380778467"},
{"url": "https://www.goodreads.com/book/show/4371494-beloved-savage", "num_ratings": "189", "num_reviews": "22", "avg_ratings": 4.0, "genres": ["Romance", "Historical Romance", "Westerns", "Historical", "Romance", "Historical", "Historical Fiction"], "title": "Beloved Savage", "description": ["Caught between two worlds, Susannah Jacobs must make a choice. Her husband will take her back out of duty, but the Algonquin warrior, who has claimed her as his woman, will cross the rivers and mountains to find her. Nothing will prevent Tonnewa from coming for her. Nothing will prevent Susannah from returning to him.", "Married at fifteen to a man twice her age, Susannah has", "Caught between two worlds, Susannah Jacobs must make a choice. Her husband will take her back out of duty, but the Algonquin warrior, who has claimed her as his woman, will cross the rivers and mountains to find her. Nothing will prevent Tonnewa from coming for her. Nothing will prevent Susannah from returning to him.", "Married at fifteen to a man twice her age, Susannah has lost one baby. Now pregnant again, she's taken captive by Algonquins. Far from home and alone, she fears for her life and that of her unborn child. Tonnewa takes her as his woman rather than see her put to death.", "Tonnewa wants both the woman and the child. Susannah has known neither kindness nor gentleness and never expected it from a savage. She will give up her whole way of life for him. He will remake his for her."], "author": "Sandra Bishop", "num_pages": "381", "awards": [], "places": ["Pennsylvania"], "character_names": ["Susannah Jacobs", "Tonnewa"], "language": "English", "publish_date": "1998-01-01 00:00:00", "ISBN": "0821757296"},
{"url": "https://www.goodreads.com/book/show/1732509.Cheyenne_Song", "num_ratings": "204", "num_reviews": "12", "avg_ratings": 4.01, "genres": ["Romance", "Historical Romance", "Romance", "Westerns", "Historical"], "title": "Cheyenne Song", "description": ["Fort Reno, Indian Territory, 1878. ", "Glory Halstead faced her captor with the same pride and courage that had seen her through hardship and bitter scandal and vowed to be strong. She didn't know what Two Arrows intended to do with her. But she knew her life had changed forever that fateful night she had witnessed three hundred Cheyenne fleeing captivity at Fort Reno.", "Two Arro", "Fort Reno, Indian Territory, 1878. ", "Glory Halstead faced her captor with the same pride and courage that had seen her through hardship and bitter scandal and vowed to be strong. She didn't know what Two Arrows intended to do with her. But she knew her life had changed forever that fateful night she had witnessed three hundred Cheyenne fleeing captivity at Fort Reno.", "Two Arrows wanted vengeance - and he would get it by making another man's woman his own. Yet as captain David Krueger of the U.S. cavalry rode hard and fast with his troops to recapture the woman he loved and the Cheyenne he hated, Glory was losing her heart to a man, a people, and a new life.", "Now, as they made the brutal journey through the harsh, unforgiving wilderness, Glory and Two Arrows would discover passion as primal and unyielding as the land they were destined to tame..."], "author": "Georgina Gentry", "num_pages": "351", "awards": [], "places": ["United States of America"], "character_names": ["Glory Halstead", "Two Arrows"], "language": "English", "publish_date": "1998-03-01 00:00:00", "ISBN": "0821758446"},
{"url": "https://www.goodreads.com/book/show/582070.Tallchief", "num_ratings": "655", "num_reviews": "35", "avg_ratings": 4.11, "genres": ["Romance", "Contemporary", "Romance", "Contemporary Romance", "Romance", "Romantic Suspense", "Fiction"], "title": "Tallchief", "description": ["A Dream...Or A Nightmare?", "Ever since the night Morgan Tallchief lost the only woman he would ever love, he has struggled to seal away the past. But now Kathleen Ryder is back in his life--still pursued by the deadly secrets that forced her to flee before. And even though Morgan swears to protect her, he is helpless against his own rekindled passion.", "Kathleen has never forgot", "A Dream...Or A Nightmare?", "Ever since the night Morgan Tallchief lost the only woman he would ever love, he has struggled to seal away the past. But now Kathleen Ryder is back in his life--still pursued by the deadly secrets that forced her to flee before. And even though Morgan swears to protect her, he is helpless against his own rekindled passion.", "Kathleen has never forgotten the achingly sweet hunger that bound them together years ago. Now, still on the run, all she dares ask is that Morgan keep her safe--never expecting that he has the power to breathe life-giving fire to an ember that has grown cold."], "author": "Dinah McCall", "num_pages": "416", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1997-02-24 00:00:00", "ISBN": "0061084441"},
{"url": "https://www.goodreads.com/book/show/693238.Ramona", "num_ratings": "1,566", "num_reviews": "220", "avg_ratings": 3.72, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Romance"], "title": "Ramona", "description": ["One of the greatest ethical novels of the nineteenth century, this is a tale of true love tested. Set in Old California, this powerful narrative richly depicts the life of the fading Spanish order, the oppression of tribal American communities and inevitably, the brutal intrusion of white settlers. Ramona, an illegitimate orphan, grows up as the ward of the overbearing Sen", "One of the greatest ethical novels of the nineteenth century, this is a tale of true love tested. Set in Old California, this powerful narrative richly depicts the life of the fading Spanish order, the oppression of tribal American communities and inevitably, the brutal intrusion of white settlers. Ramona, an illegitimate orphan, grows up as the ward of the overbearing Senora Moreno. But her desire for Alessandro, a Native American, makes her an outcast and fugitive..."], "author": "Helen Hunt Jackson", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-01 00:00:00", "ISBN": "0451528425"},
{"url": "https://www.goodreads.com/book/show/3379538-the-princess-and-the-wolf", "num_ratings": "70", "num_reviews": "4", "avg_ratings": 3.79, "genres": ["Romance", "Historical Romance", "Westerns", "Historical", "Romance", "Historical", "Historical Fiction"], "title": "The Princess and the Wolf", "description": ["With his heart betrayed and broken in Germany when his beloved Princess Sierra Morena marries his friend, Prince Alaric, Cheyenne warrior High Wolf returns to his home on the American frontier hoping never to set eyes on either one of them again. Little does he know that, many years later, he will once again cross paths with Princess Sierra when she journeys to America in", "With his heart betrayed and broken in Germany when his beloved Princess Sierra Morena marries his friend, Prince Alaric, Cheyenne warrior High Wolf returns to his home on the American frontier hoping never to set eyes on either one of them again. Little does he know that, many years later, he will once again cross paths with Princess Sierra when she journeys to America in search of the truth behind her missing, and presumed dead, husband. Although distrustful, their attraction to each other is undeniable - and Princess Sierra is torn. All her life, she has been convinced that affairs of state take precedence over matters of the heart.", "But as she and High Wolf enter dangerous Crow territory, Princess Sierra finds herself willing to risk all for the chance to regain High Wolf′s love and trust."], "author": "Karen Kay", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-27 00:00:00", "ISBN": "0380820684"},
{"url": "https://www.goodreads.com/book/show/3578778-prairie-embrace", "num_ratings": "96", "num_reviews": "9", "avg_ratings": 4.27, "genres": ["Romance", "Historical Romance", "Romance", "Romance", "Western Romance", "Asian Literature", "Indian Literature", "Westerns", "Historical"], "title": "Prairie Embrace", "description": ["As the hot sun sparked the fiery highlights of her auburn hair, all Katie Russell could see was the monotonous horizon of Southwest Nebraska. Then, out of the blue, she met the heated gaze of a bronze-skinned, jet-haired Indian and suddenly the dry, barren landscape was lifeless no more. Her flesh tingled with his nearness; her blood sang through her veins as he leaned eve", "As the hot sun sparked the fiery highlights of her auburn hair, all Katie Russell could see was the monotonous horizon of Southwest Nebraska. Then, out of the blue, she met the heated gaze of a bronze-skinned, jet-haired Indian and suddenly the dry, barren landscape was lifeless no more. Her flesh tingled with his nearness; her blood sang through her veins as he leaned even closer. The gorgeous pioneer reminded herself that he was a savage heathen and beneath her regard but deep inside she knew her fate was forever bound to his!", "When the powerful Sioux warrior Tohave spotted the lone wagon trespassing on reservation land, he raised his lance and charged, intent on punishing the palefaces for invading his territory. But where he expected to see an ugly white-eyes, he found the creamy-skinned temptress who had haunted his dreams. He pulled her close so she wouldn't run away; he traced her lush curves to make sure she was real. Tohave hated her for coming West, but couldn't stop the swell of love that filled him with primitive passion, as he took her in his Prairie Embrace."], "author": "Rosanne Bittner", "num_pages": "475", "awards": [], "places": ["Nebraska Territory"], "character_names": ["Katie Russell", "Tohave", "Ezra Russell"], "language": "English", "publish_date": "1987-04-01 00:00:00", "ISBN": "082172035X"},
{"url": "https://www.goodreads.com/book/show/18171087-timberbeast", "num_ratings": "16", "num_reviews": "3", "avg_ratings": 3.5, "genres": [], "title": "TimberBeast (TimberBeast, #1)", "description": ["1991. Life in the forest is never what it appears to be. ", "Loggers, led by the TimberBeast, and eco-terrorists from several environmental organizations, are fighting for control of the Sierra forests in California. ", "Kelsy is engaged to Sandy as they climb the Los Angeles corporate ladder together. When life throws her a curve, she becomes an environmental spy to find the iden", "1991. Life in the forest is never what it appears to be. ", "Loggers, led by the TimberBeast, and eco-terrorists from several environmental organizations, are fighting for control of the Sierra forests in California. ", "Kelsy is engaged to Sandy as they climb the Los Angeles corporate ladder together. When life throws her a curve, she becomes an environmental spy to find the identity of the TimberBeast as she fights to secure her personal and financial future.", "Fox is a timber faller with a past. He's a loner by choice and has enough headaches just trying to keep his falling partners and job under control, but when Kelsy shows up in his forest he finds himself drawn to the blond research student and is soon leading her into the world of the Indian logger. ", "Kelsy plays the naïve student as she searches for ways to use Fox and find the TimberBeast, but her life takes a dangerous turn and she heads into unexpected romance on the way to success."], "author": "Jae Hall", "num_pages": "739", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-26 00:00:00", "ISBN": "1479278815"},
{"url": "https://www.goodreads.com/book/show/1126428.Night_Flame", "num_ratings": "241", "num_reviews": "17", "avg_ratings": 4.18, "genres": ["Romance", "Historical Romance", "Romance", "Westerns", "Historical"], "title": "Night Flame", "description": ["CHEYENNE CAPTIVE", "She was stunningly beautiful -- her hair a vivid blaze of red, her eyes the burning blue of a fire's heart -- and from the moment he saw her, Night Hawk knew she must be his. She was his Flame, and the desire to possess her soft body burned in his blood. It made no difference that she was a general's daughter, a spoiled, willful Southern belle who was compl", "CHEYENNE CAPTIVE", "She was stunningly beautiful -- her hair a vivid blaze of red, her eyes the burning blue of a fire's heart -- and from the moment he saw her, Night Hawk knew she must be his. She was his Flame, and the desire to possess her soft body burned in his blood. It made no difference that she was a general's daughter, a spoiled, willful Southern belle who was completely unsuited to life an an Indian squaw. It made no difference that she fought him tooth and nail, refusing to bend her proud spirit to his will. All that mattered was the searing ecstasy she would know when he branded her soul with his smouldering love..."], "author": "Catherine Hart", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-01 00:00:00", "ISBN": "0505523868"},
{"url": "https://www.goodreads.com/book/show/6178037-savage-winter", "num_ratings": "318", "num_reviews": "9", "avg_ratings": 4.28, "genres": ["Romance", "Historical Romance", "Historical", "Fiction", "Westerns"], "title": "Savage Winter", "description": ["The Vision", "He'd been named Wind Warrior and called the savior of his Blackfoot people. But the mystical power that filled him awoke his brother's hatred and envy. Dull Knife would do anything to take what was his.", "The Woman", "Slender and lovely, the white captive had long ago caught Wind Warrior's eye. She was the kind of beauty who could make a man forget all else in the exqui", "The Vision", "He'd been named Wind Warrior and called the savior of his Blackfoot people. But the mystical power that filled him awoke his brother's hatred and envy. Dull Knife would do anything to take what was his.", "The Woman", "Slender and lovely, the white captive had long ago caught Wind Warrior's eye. She was the kind of beauty who could make a man forget all else in the exquisite pleasures of the night.But when Dull Knife plotted to steal her away, the rivalry between the two brothers would come to a head, a prophecy would be fulfilled and with her daring rescue, a great passion would be born."], "author": "Constance O'Banyon", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-05-01 00:00:00", "ISBN": "0821731629"},
{"url": "https://www.goodreads.com/book/show/6178033-savage-autumn", "num_ratings": "553", "num_reviews": "28", "avg_ratings": 4.01, "genres": ["Romance", "Historical Romance", "Historical", "Romance", "Westerns", "Romance", "Western Romance"], "title": "Savage Autumn", "description": ["SEASON OF DESIRE", "Joanna gave a cry of terror when the tall young leader of the Blackfoot tribe carried her away from all that she held dear. But when he laid her gently back against the buffalo robe in his tepee, she felt strangely safe. And when the handsome, bronzed savage began to explore her body with soft kisses and sensuous caresses, her senses reeled with undreamt-of", "SEASON OF DESIRE", "Joanna gave a cry of terror when the tall young leader of the Blackfoot tribe carried her away from all that she held dear. But when he laid her gently back against the buffalo robe in his tepee, she felt strangely safe. And when the handsome, bronzed savage began to explore her body with soft kisses and sensuous caresses, her senses reeled with undreamt-of pleasure. Forever left behind was the genteel Philadelphia society in which she had been raised, as she gave herself completely to forbidden ecstasy...", "SEASON OF LOVE", "Windhawk gave a gasp of surprise when he first set eyes on the lovely white woman Joanna. Her red gold hair was the color of the prairie sunset, her eves the purple of twilight. Though she feared him--fought him--he would take her for his wife. But when he cradled her in his arms, her soft moans were as rapturous, her kisses as urgent, as his own... and he knew that the heights of passion awaited them in the SAVAGE AUTUMN."], "author": "Constance O'Banyon", "num_pages": "479", "awards": [], "places": [], "character_names": ["Joanna", "Windhawk"], "language": "English", "publish_date": "1990-03-15 00:00:00", "ISBN": "0821731882"},
{"url": "https://www.goodreads.com/book/show/7664599-wind-warrior", "num_ratings": "467", "num_reviews": "22", "avg_ratings": 4.02, "genres": ["Romance", "Historical Romance", "Historical", "Romance", "Westerns", "Historical", "Historical Fiction"], "title": "Wind Warrior", "description": ["Employing all the drama, sensuality, and action that she is known for, O'Banyon spins a thrilling tale of a beautiful white captive and the Blackfoot warrior who wins her heart. Original."], "author": "Constance O'Banyon", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-02-01 00:00:00", "ISBN": "0843963018"},
{"url": "https://www.goodreads.com/book/show/1560207.Ride_the_Fire", "num_ratings": "2,571", "num_reviews": "245", "avg_ratings": 4.21, "genres": ["Romance", "Historical Romance", "Historical", "Romance", "Westerns", "Historical", "Historical Fiction"], "title": "Ride the Fire", "description": ["Widowed and alone on the frontier, Elspeth Stewart will do whatever it takes to protect herself and her unborn child from the dangers of the wilderness and of men. Though her youthful beauty doesn't show it, she is broken and scarred from the way men have treated her. So when a stranger wanders onto Bethie's land, wounded", "Widowed and alone on the frontier, Elspeth Stewart will do whatever it takes to protect herself and her unborn child from the dangers of the wilderness and of men. Though her youthful beauty doesn't show it, she is broken and scarred from the way men have treated her. So when a stranger wanders onto Bethie's land, wounded and needing her aid, she takes no risks, tying him to the bed and hiding his weapons before ministering to his injuries.", "But Bethie's defenses cannot keep Nicholas Kenleigh from breaking down her emotional walls. The scars on his body speak of a violent past, but his gentleness, warmth, and piercing eyes arouse longings in her that she never imagined she had. As Nicholas and Bethie reveal to each other both their hidden desires and their tortured secrets, they discover that riding the flames of their passion might be the key to burning away the nightmare of their pasts."], "author": "Pamela Clare", "num_pages": "368", "awards": [], "places": ["Pennsylvania"], "character_names": ["Nicholas Kenleigh", "Elspeth Stewart"], "language": "English", "publish_date": "2005-03-06 00:00:00", "ISBN": "0843954876"},
{"url": "https://www.goodreads.com/book/show/3128411-bone-crossed", "num_ratings": "85,016", "num_reviews": "2,585", "avg_ratings": 4.34, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Shapeshifters", "Werewolves"], "title": "Bone Crossed", "description": ["By day, Mercy is a car mechanic in the sprawling Tri-Cities of Eastern Washington. By night, she explores her preternatural side. As a shapeshifter with some unique talents, Mercy has often found herself having to maintain a tenuous harmony between the human and the not so human. This time she may get more than she bargained for.", "Marsilia, the local Vampire Queen, has learn", "By day, Mercy is a car mechanic in the sprawling Tri-Cities of Eastern Washington. By night, she explores her preternatural side. As a shapeshifter with some unique talents, Mercy has often found herself having to maintain a tenuous harmony between the human and the not so human. This time she may get more than she bargained for.", "Marsilia, the local Vampire Queen, has learned that Mercy crossed her by slaying a member of her clan—and she's out for blood. But since Mercy is protected from direct reprisal by the werewolf pack (and her close relationship with its sexy Alpha), it won't be Mercy's blood Marsilia is after.", "It'll be her friends'."], "author": "Patricia Briggs", "num_pages": "300", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Urban Fantasy (2009)", "P.E.A.R.L. (Paranormal Excellence Award for Romantic Literature) for Best Urban Fantasy Romance (2009)", "Goodreads Choice Award Nominee for Fantasy (2009)"], "places": ["United States of America", "Washington (the state)", "Tri-Cities, Washington", "Spokane, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Darryl Zao", "Warren", "Wulfe", "Kyle Brooks", "Stefan Uccello", "Marsilia", "Elizaveta Arkadyevna Vyshnevetskaya", "Uncle Mike", "Tony Montenegro", "Margi Thompson", "Ben (werewolf)"], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "1841496863"},
{"url": "https://www.goodreads.com/book/show/165446.Ride_the_Wind", "num_ratings": "4,662", "num_reviews": "440", "avg_ratings": 4.37, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Westerns", "Romance"], "title": "Ride the Wind", "description": ["In 1836, when she was nine years old, Cynthia Ann Parker was kidnapped by Comanche Indians. This is the story of how she grew up with them, mastered their ways, married one of their leaders, and became, in every way, a Comanche woman. It is also the story of a proud and innocent people whose lives pulsed with the very heartbeat of the land. It is the story of a way of life", "In 1836, when she was nine years old, Cynthia Ann Parker was kidnapped by Comanche Indians. This is the story of how she grew up with them, mastered their ways, married one of their leaders, and became, in every way, a Comanche woman. It is also the story of a proud and innocent people whose lives pulsed with the very heartbeat of the land. It is the story of a way of life that is gone forever...."], "author": "Lucia St. Clair Robson", "num_pages": "589", "awards": ["Spur Award for Best Historical Novel (1982)"], "places": ["United States of America", "Texas"], "character_names": ["Cynthia Parker"], "language": "English", "publish_date": "1985-11-12 00:00:00", "ISBN": "0345325222"},
{"url": "https://www.goodreads.com/book/show/9915216-comanche-magic", "num_ratings": "1,667", "num_reviews": "124", "avg_ratings": 4.05, "genres": ["Romance", "Historical Romance", "Romance", "Westerns", "Historical"], "title": "Comanche Magic", "description": ["Handsome, strong, and just a little bit dangerous, half-Comanche Chase Wolf is used to getting what he wants. So when he sees Franny --- a golden-haired angel with deep green eyes, delicate features, and the sweetest smile --- he sets out to make her his. But far from the innocent she seems, Franny is the local \"unfortunate,\" who services men above the Lucky Nugget salon.", "Handsome, strong, and just a little bit dangerous, half-Comanche Chase Wolf is used to getting what he wants. So when he sees Franny --- a golden-haired angel with deep green eyes, delicate features, and the sweetest smile --- he sets out to make her his. But far from the innocent she seems, Franny is the local \"unfortunate,\" who services men above the Lucky Nugget salon. The shocking truth sends Chase reeling.", "Long ago, circumstance forced Franny to make a terrible choice in order to provide for those she holds dearest. Now she lives a secret double life --- respectable in one world, shunned in another --- always fearful of discovery, forever marked by shame.", "But Chase's love for Franny is persistent and patient and knows no bounds. He offers her a life she longs to claim but believes she can't possibly deserve. Franny tries to resist Chase, but he won't listen to reason, and he won't stop trying until her defenses have fallen, her heart is healed, and their love has triumphed."], "author": "Catherine Anderson", "num_pages": "414", "awards": [], "places": ["Oregon"], "character_names": ["Francine \"Franny\" Graham", "Chase Kelly Wolf"], "language": "English", "publish_date": "2011-05-03 00:00:00", "ISBN": "045123345X"},
{"url": "https://www.goodreads.com/book/show/473960.Sweet_Prairie_Passion", "num_ratings": "539", "num_reviews": "54", "avg_ratings": 4.25, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Romance", "Western Romance", "Westerns"], "title": "Sweet Prairie Passion", "description": ["Where the mountains reared up to kiss the sky, where the land stretched out to a vast, distant sea -- that's where Abigail Trent was heading. But the moment the spirited lovely girl set eyes on the handsome Cheyenne brave, she instantly knew that no life was worth living if it wasn't by the side of the Indian scout.", "Together they fought nature's violence on the harsh, unmap", "Where the mountains reared up to kiss the sky, where the land stretched out to a vast, distant sea -- that's where Abigail Trent was heading. But the moment the spirited lovely girl set eyes on the handsome Cheyenne brave, she instantly knew that no life was worth living if it wasn't by the side of the Indian scout.", "Together they fought nature's violence on the harsh, unmapped plains; together explored their passion on the stark, hostile frontier. And as they journeyed westward through America's endless forests and fertile acres, their desire deepened into love. A forbidden dream blossomed into a courageous vision, and they set out to forge a destiny of their own!"], "author": "Rosanne Bittner", "num_pages": "463", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-06-01 00:00:00", "ISBN": "0821753428"},
{"url": "https://www.goodreads.com/book/show/13364202-at-road-s-end", "num_ratings": "270", "num_reviews": "52", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Historical", "Fiction", "Romance"], "title": "At Road's End", "description": ["Tecpatl was born a warrior, one of the elite class of fighters, defending his great city, capturing vanquished foes to sacrifice for the honor of the gods.", "He never wished to follow the ancient road into the Southwestern desert; but he had no choice. ", "When he rescues a girl from a ransacked village, he thinks nothing of it. He just wishes to make the traders sell their goods", "Tecpatl was born a warrior, one of the elite class of fighters, defending his great city, capturing vanquished foes to sacrifice for the honor of the gods.", "He never wished to follow the ancient road into the Southwestern desert; but he had no choice. ", "When he rescues a girl from a ransacked village, he thinks nothing of it. He just wishes to make the traders sell their goods in a hurry, so he could return to his homeland. ", "But the fate had planned differently, for the warrior and for the girl alike."], "author": "Zoe Saadia", "num_pages": "150", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5292853-hunting-ground", "num_ratings": "52,180", "num_reviews": "1,883", "avg_ratings": 4.27, "genres": ["Fantasy", "Fantasy", "Paranormal", "Fantasy", "Urban Fantasy", "Romance", "Romance", "Paranormal Romance", "Shapeshifters", "Werewolves"], "title": "Hunting Ground", "description": ["Anna Latham didn’t know how complicated life could be until she became a werewolf. And until she was mated to Charles Cornick, the son — and enforcer — of Bran, the leader of the North American werewolves, she didn’t know how dangerous it could be either...", "Anna and Charles have just been enlisted to attend a summit to present Bran’s controversial proposition: that the wolv", "Anna Latham didn’t know how complicated life could be until she became a werewolf. And until she was mated to Charles Cornick, the son — and enforcer — of Bran, the leader of the North American werewolves, she didn’t know how dangerous it could be either...", "Anna and Charles have just been enlisted to attend a summit to present Bran’s controversial proposition: that the wolves should finally reveal themselves to humans. But the most feared Alpha in Europe is dead set against the plan — and it seems like someone else might be too. When Anna is attacked by vampires using pack magic, the kind of power only werewolves should be able to draw on, Charles and Anna must combine their talents to hunt down whoever is behind it all — or risk losing everything..."], "author": "Patricia Briggs", "num_pages": "286", "awards": ["Endeavour Award Nominee (2010)"], "places": ["Seattle, Washington"], "character_names": ["Samuel Cornick", "Charles Cornick", "Anna Latham", "Asil \"The Moor\" (Hussan)", "Dana Shea", "Arthur Madden", "Sunny Madden", "Jean Chastel", "Heinrich Postinger", "Bran \"The Marrok\" Cornick"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "044101738X"},
{"url": "https://www.goodreads.com/book/show/285205.Blood_Bound", "num_ratings": "97,823", "num_reviews": "3,441", "avg_ratings": 4.31, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Shapeshifters", "Werewolves", "Romance", "Romance", "Paranormal Romance"], "title": "Blood Bound", "description": ["Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since", "Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since she can shapeshift at will, she agrees to act as some extra muscle when her vampire friend Stefan goes to deliver a message to another of his kind.", "But this new vampire is hardly ordinary-and neither is the demon inside of him."], "author": "Patricia Briggs", "num_pages": "292", "awards": [], "places": ["United States of America", "Washington (the state)", "Tri-Cities, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Charles Cornick", "Darryl Zao", "Warren", "Honey", "Wulfe", "Kyle Brooks", "Stefan Uccello", "Marsilia", "Uncle Mike", "Gabriel Sandoval", "Tony Montenegro", "Bran \"The Marrok\" Cornick", "Ben (werewolf)", "Andre (vampire)"], "language": "English", "publish_date": "2007-01-30 00:00:00", "ISBN": "0441014739"},
{"url": "https://www.goodreads.com/book/show/22967304-the-blue-amaryllis", "num_ratings": "91", "num_reviews": "43", "avg_ratings": 4.36, "genres": ["Romance", "Fiction", "Romance", "Contemporary Romance", "Contemporary"], "title": "The Blue Amaryllis", "description": ["Upon the death of her mother, 26 year old Leia York is left bereft and grief-stricken. An old college professor extends her an invitation to join him in one of the most beautiful, yet most dangerous, places on earth - the Amazon rainforest. She embarks on an impulsive journey, hoping to forget the sadness of her life in Chicago. ", "Shortly after arriving in the village, Leia", "Upon the death of her mother, 26 year old Leia York is left bereft and grief-stricken. An old college professor extends her an invitation to join him in one of the most beautiful, yet most dangerous, places on earth - the Amazon rainforest. She embarks on an impulsive journey, hoping to forget the sadness of her life in Chicago. ", "Shortly after arriving in the village, Leia is among those chosen to go on a quest that is vital to the survival of the natives. The six week quest is fraught with danger, adventure, and unexpectedly: love. A love which is strictly forbidden. ", "Will Leia respect an indigenous law that prevents her from pursuing the only love she has ever known? ", "The Blue Amaryllis is a unique story that blends romance and adventure, while exploring the very real ecological issues threatening the Amazon rainforest and tribes within. It is a story of a proud people whose unique way of life faces extinction, and the passionate love that develops between one of their own and an outsider."], "author": "Sonia De Leon", "num_pages": "422", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-14 00:00:00", "ISBN": "1491001046"},
{"url": "https://www.goodreads.com/book/show/89365.Only_By_Your_Touch", "num_ratings": "2,349", "num_reviews": "116", "avg_ratings": 4.17, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Fantasy", "Paranormal"], "title": "Only By Your Touch", "description": ["Determined to give her son, Jeremy, the childhood he deserves, Chloe Evans has left a tough past behind and is starting fresh in the charming resort town of Jack Pine, Oregon. But protecting Jeremy becomes a dicey proposition when he seeks out the most dangerous man in town, Ben Longtree, to heal his sick puppy. Chloe has been warned to stay away from Ben. But there's some", "Determined to give her son, Jeremy, the childhood he deserves, Chloe Evans has left a tough past behind and is starting fresh in the charming resort town of Jack Pine, Oregon. But protecting Jeremy becomes a dicey proposition when he seeks out the most dangerous man in town, Ben Longtree, to heal his sick puppy. Chloe has been warned to stay away from Ben. But there's something about him, at once gentle and untamed, that intrigues her....", "Long ago, Ben accepted his role as the town outcast. Rumored to have once killed a man, he lives in splendid isolation with his forgetful mother, secretly employing his skills as a veterinarian to heal the wounded wild animals that mysteriously come to him. Now Chloe's sunny warmth and brave tenacity arouse desire he has long deified. And although Ben is notorious for his healing touch, it is Chloe's hands ... and heart ... that have the ,.power to save his battered soul."], "author": "Catherine Anderson", "num_pages": "443", "awards": ["RITA Award by Romance Writers of America Nominee for Contemporary Single Title Romance (2004)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Contemporary Romance (2003)"], "places": ["Jack Pine, Oregon"], "character_names": ["Chloe Evans", "Ben Longtree"], "language": "English", "publish_date": "2003-04-01 00:00:00", "ISBN": "0451207947"},
{"url": "https://www.goodreads.com/book/show/2355575.Cry_Wolf", "num_ratings": "76,293", "num_reviews": "3,286", "avg_ratings": 4.12, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Romance", "Shapeshifters", "Werewolves", "Romance", "Paranormal Romance"], "title": "Cry Wolf", "description": ["Anna never knew werewolves existed, until the night she survived a violent attack... and became one herself. After three years at the bottom of the pack, she'd learned to keep her head down and never, ever trust dominant males. Then Charles Cornick, the enforcer—and son—of the leader of the North American werewolves, came into her life.", "Charles insists that not only is Anna", "Anna never knew werewolves existed, until the night she survived a violent attack... and became one herself. After three years at the bottom of the pack, she'd learned to keep her head down and never, ever trust dominant males. Then Charles Cornick, the enforcer—and son—of the leader of the North American werewolves, came into her life.", "Charles insists that not only is Anna his mate, but she is also a rare and valued Omega wolf. And it is Anna's inner strength and calming presence that will prove invaluable as she and Charles go on the hunt in search of a rogue werewolf—a creature bound in magic so dark that it could threaten all of the pack."], "author": "Patricia Briggs", "num_pages": "294", "awards": ["P.E.A.R.L. (Paranormal Excellence Award for Romantic Literature) (2008)", "DABWAHA Romance Tournament for Best Paranormal/Urban Fantasy/SF Romance (2009)"], "places": ["Montana"], "character_names": ["Samuel Cornick", "Charles Cornick", "Anna Latham", "Asil \"The Moor\" (Hussan)", "Mariposa", "Blue Jay Woman", "Walter Rice", "Colin Taggart", "Bran \"The Marrok\" Cornick"], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "0441016154"},
{"url": "https://www.goodreads.com/book/show/696513.Indigo_Blue", "num_ratings": "2,174", "num_reviews": "165", "avg_ratings": 4.05, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns"], "title": "Indigo Blue", "description": [" ", " "], "author": "Catherine Anderson", "num_pages": "388", "awards": ["RITA Award by Romance Writers of America Nominee for Historical Series Romance (1993)"], "places": ["Oregon"], "character_names": ["Indigo Wolf", "Jake Rand"], "language": "English", "publish_date": "1992-10-15 00:00:00", "ISBN": "0061080098"},
{"url": "https://www.goodreads.com/book/show/71811.Moon_Called", "num_ratings": "148,700", "num_reviews": "7,107", "avg_ratings": 4.18, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Shapeshifters", "Werewolves", "Romance"], "title": "Moon Called", "description": ["Mercedes Thompson, aka Mercy, is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot li", "Mercedes Thompson, aka Mercy, is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot like ours but is populated by those things that go bump in the night. And Mercy's connection to those things is about to get her into some serious hot water..."], "author": "Patricia Briggs", "num_pages": "288", "awards": [], "places": ["Tri-Cities, Washington", "Washington (the state)", "United States of America"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Leah", "Charles Cornick", "Darryl Zao", "Warren", "Kyle Brooks", "Stefan Uccello", "Alan MacKenzie Frazier", "Marsilia", "Auriele Zao", "Elizaveta Arkadyevna Vyshnevetskaya", "Gabriel Sandoval", "Tony Montenegro", "David Christiansen", "Bran \"The Marrok\" Cornick", "Ben (werewolf)"], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "0441013813"},
{"url": "https://www.goodreads.com/book/show/1397390.Savage_Ecstasy", "num_ratings": "982", "num_reviews": "72", "avg_ratings": 3.9, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns"], "title": "Savage Ecstasy", "description": ["Savage Ecstasy by Janelle Taylor. It was like lightning, the first time they looked into each other's eyes: Gray Eagle, the captured Indian brave, and Alisha, the beautiful young settler. As the proud Oglala warrior was being tortured by his white captors, only Alsiha seemed to notice he was a human being - handsome and strong, and one who took her breath away.", "But if Alish", "Savage Ecstasy by Janelle Taylor. It was like lightning, the first time they looked into each other's eyes: Gray Eagle, the captured Indian brave, and Alisha, the beautiful young settler. As the proud Oglala warrior was being tortured by his white captors, only Alsiha seemed to notice he was a human being - handsome and strong, and one who took her breath away.", "But if Alisha could have read Gray Eagle's thoughts she would have been even more disturbed...Because from the moment he saw her, the Indian knew he had to possess the fair-skinned one - and his life would not be complete until he had made her his slave!"], "author": "Janelle Taylor", "num_pages": "528", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-03-12 00:00:00", "ISBN": "082175453X"},
{"url": "https://www.goodreads.com/book/show/8230540-river-marked", "num_ratings": "67,391", "num_reviews": "3,349", "avg_ratings": 4.27, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Shapeshifters", "Werewolves", "Romance", "Paranormal", "Vampires", "Romance", "Paranormal Romance", "Paranormal", "Shapeshifters", "Fairies", "Fae", "Fantasy", "Magic"], "title": "River Marked", "description": ["Welcome to Patricia Briggs's world, a place where \"witches, vampires, werewolves, and shapeshifters live beside ordinary people\" (", "Coyote shifter Mercy Thompson knows that life with her mate, the Alpha werewolf Adam, will never be boring, but even their wedding doesn't go as planned. Nevertheless, a ten-day honeymoon camping on the banks of the Columbia River, alone", "Welcome to Patricia Briggs's world, a place where \"witches, vampires, werewolves, and shapeshifters live beside ordinary people\" (", "Coyote shifter Mercy Thompson knows that life with her mate, the Alpha werewolf Adam, will never be boring, but even their wedding doesn't go as planned. Nevertheless, a ten-day honeymoon camping on the banks of the Columbia River, alone, just the two of them, should make up for it. But the trip - and the pimped-out trailer they're using - is courtesy of the fae. And nothing from the fae comes without strings attached...", "Being a different breed of shapeshifter - a walker - Mercy can see ghosts, but the spirit of her long-gone father has never visited her. Until now. An evil is stirring in the depths of the Columbia River - and innocent people are dying. As other walkers make their presence know to Mercy, she must reconnect with her heritage to exorcise the world of the legend known as the river devil..."], "author": "Patricia Briggs", "num_pages": "326", "awards": ["Endeavour Award Nominee (2012)"], "places": ["Oregon", "Washington (the state)"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Darryl Zao", "Warren", "Kyle Brooks", "Stefan Uccello", "Coyote", "Auriele Zao", "Uncle Mike", "Margi Thompson", "Ben (werewolf)"], "language": "English", "publish_date": "2011-03-16 00:00:00", "ISBN": "0441019730"},
{"url": "https://www.goodreads.com/book/show/72854.Into_the_Wilderness", "num_ratings": "30,612", "num_reviews": "1,947", "avg_ratings": 4.1, "genres": ["Historical", "Historical Fiction", "Romance", "Historical", "Fiction", "Romance", "Historical Romance", "Adventure"], "title": "Into the Wilderness", "description": ["Weaving a tapestry of fact and fiction, Sara Donati's epic novel sweeps us into another time and place...and into the heart of a forbidden affair between an unconventional Englishwoman and an American frontiersman.", "It is December of 1792. Elizabeth Middleton leaves her comfortable English estate to join her family in a remote New York mountain village. It is a place unlike", "Weaving a tapestry of fact and fiction, Sara Donati's epic novel sweeps us into another time and place...and into the heart of a forbidden affair between an unconventional Englishwoman and an American frontiersman.", "It is December of 1792. Elizabeth Middleton leaves her comfortable English estate to join her family in a remote New York mountain village. It is a place unlike any she has ever experienced. And she meets a man unlike any she has ever encountered - a white man dressed like a Native American, Nathanial Booner, known to the Mohawk people as Between-Two-Lives. Determined to provide schooling for all the children of the village, she soons finds herself locked in conflict with the local slave owners as well as her own family. ", "Interweaving the fate of the Mohawk Nation with the destiny of two lovers, Sara Donati's compelling novel creates a complex, profound, passionate portrait of an emerging America."], "author": "Sara Donati", "num_pages": "876", "awards": [], "places": [], "character_names": ["Chingachgook", "Elizabeth Middleton", "Nathaniel Bonner", "Dan'l Bonner", "Julian Middleton", "Hannah Bonner", "Runs-from-Bears", "Many-Doves", "Robbie MacLachlan", "Falling-Day", "Alfred Middleton", "Richard Todd", "Kitty Witherspoon"], "language": "English", "publish_date": "1999-08-03 00:00:00", "ISBN": "0553578529"},
{"url": "https://www.goodreads.com/book/show/1126425.Silken_Savage", "num_ratings": "548", "num_reviews": "44", "avg_ratings": 3.93, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns"], "title": "Silken Savage", "description": ["SHE WAS A WOMAN MADE FOR LOVE:", "HE WAS THE MAN DESTINED TO LOVE HER", "Captured by a party of Cheyenne as she was traveling with her family to join her fiance in Colorado Territory, beautiful young Tanya Martin refused to let her proud spirit be broken or her voluptuous body abused. But she had not anticipated the reaction of her heart to A Panther Stalks, the brave who had clai", "SHE WAS A WOMAN MADE FOR LOVE:", "HE WAS THE MAN DESTINED TO LOVE HER", "Captured by a party of Cheyenne as she was traveling with her family to join her fiance in Colorado Territory, beautiful young Tanya Martin refused to let her proud spirit be broken or her voluptuous body abused. But she had not anticipated the reaction of her heart to A Panther Stalks, the brave who had claimed her as his prize. Tanya soon became her captor's willing slave, overcome by a passion she could not resist. ", "Though fate conspired to tear her from her lover's side, Tanya vowed to surmount every obstacle that stood between them, until she was safe at last in the arms of the man who had awakened her to ecstasy..."], "author": "Catherine Hart", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-01 00:00:00", "ISBN": "0843944625"},
{"url": "https://www.goodreads.com/book/show/662323.Mackenzie_s_Mountain", "num_ratings": "14,286", "num_reviews": "562", "avg_ratings": 4.18, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Romance", "Romantic Suspense", "Westerns"], "title": "Mackenzie's Mountain", "description": ["A small Wyoming town is about to learn a few lessons from a new schoolteacher with the courage to win the heart of a man who swore he had nothing to give....", "Mary Elizabeth Potter is a self-appointed spinster with no illusions about love. But she is a good teacher and she wants Wolf Mackenzie's son back in school. And after one heated confrontation with the boy s father, sh", "A small Wyoming town is about to learn a few lessons from a new schoolteacher with the courage to win the heart of a man who swore he had nothing to give....", "Mary Elizabeth Potter is a self-appointed spinster with no illusions about love. But she is a good teacher and she wants Wolf Mackenzie's son back in school. And after one heated confrontation with the boy s father, she knows father and son have changed her life forever.", "Still paying for a crime he didn't commit, Wolf Mackenzie has a chip on his shoulder the size of Wyoming. But prim-and-proper Mary Elizabeth Potter doesn't see Wolf as the dangerous half-breed the town has branded him. Somehow she sees him as a good, decent, honest man. A man who could love...", "Wolf's not sure he or the town of Ruth, Wyoming is ready for the taming of Wolf Mackenzie."], "author": "Linda Howard", "num_pages": "256", "awards": ["RITA Award by Romance Writers of America Nominee for Best Romance of the Year & Long Contemorary Romance (1990)"], "places": ["Wyoming"], "character_names": ["Mary Elizabeth Potter", "Wolf MacKenzie"], "language": "English", "publish_date": "2000-03-01 00:00:00", "ISBN": "1551665743"},
{"url": "https://www.goodreads.com/book/show/696514.Comanche_Heart", "num_ratings": "3,252", "num_reviews": "247", "avg_ratings": 4.05, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Romance", "Western Romance"], "title": "Comanche Heart", "description": ["Forced to flee her home on the windswept Texas plains, Amy Masters sought sanctuary in the golden hills of Oregon. There she began a new life, but could never forget her pledge to Swift Antelope, the magnificent Comanche warrior who had captured her heart. ", "Then Swift, now a notorious gunslinger whose murderous reputation was known throughout the West, found her. He vowed n", "Forced to flee her home on the windswept Texas plains, Amy Masters sought sanctuary in the golden hills of Oregon. There she began a new life, but could never forget her pledge to Swift Antelope, the magnificent Comanche warrior who had captured her heart. ", "Then Swift, now a notorious gunslinger whose murderous reputation was known throughout the West, found her. He vowed never again to lose the proud, sun-kissed beauty who haunted his dreams, and he swore to make her honor her sacred promise. But could he make her believe in his?"], "author": "Catherine Anderson", "num_pages": "384", "awards": [], "places": ["Oregon"], "character_names": ["Amy Masters", "Swift Lopez / Swift Antelope"], "language": "English", "publish_date": "1992-01-04 00:00:00", "ISBN": "0061040681"},
{"url": "https://www.goodreads.com/book/show/17908032-reclaim-my-heart", "num_ratings": "1,063", "num_reviews": "135", "avg_ratings": 3.77, "genres": ["Romance", "Contemporary", "Romance", "Contemporary Romance", "Fiction", "Adult"], "title": "Reclaim My Heart", "description": ["Sixteen years ago, Tyne Whitlock cut all ties to her past and left town under the shameful shadow of a teenage pregnancy. Now her fifteen-year-old son is in trouble with the law and she is desperate for help. But reaching out to high-powered attorney Lucas Silver Hawk will tear open the heart-wrenching past in ways Tyne never imagined. ", "Forced to return to the Delaware Indi", "Sixteen years ago, Tyne Whitlock cut all ties to her past and left town under the shameful shadow of a teenage pregnancy. Now her fifteen-year-old son is in trouble with the law and she is desperate for help. But reaching out to high-powered attorney Lucas Silver Hawk will tear open the heart-wrenching past in ways Tyne never imagined. ", "Forced to return to the Delaware Indian community where Lucas was raised, Tyne and Lucas are tempted by the heated passion that consumed them as teens. Tyne rediscovers all the reasons she found this man irresistible, but there are scandalous secrets waiting to be revealed, disgraceful choices made in the past that cannot be denied. Love is a powerful force that could heal them both—if the truth doesn't rip them apart."], "author": "Donna Fasano", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-10 00:00:00", "ISBN": "9781939000"},
{"url": "https://www.goodreads.com/book/show/8262550-eyes-of-silver-eyes-of-gold", "num_ratings": "4,829", "num_reviews": "527", "avg_ratings": 4.24, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Romance", "Western Romance", "Historical", "Historical Fiction"], "title": "Eyes of Silver, Eyes of Gold", "description": ["Eyes of Silver, Eyes of Gold is a story of family conflicts set in Colorado in 1885. Anne Wells has embarrassed her rigidly proper family since she was a child with occasional but grievous lapses from ladylike behavior. They blame those lapses for the disgraceful fact that she is a spinster at 28. Cord Bennett, the son of his father's second marriage to a Cheyenne woman, i", "Eyes of Silver, Eyes of Gold is a story of family conflicts set in Colorado in 1885. Anne Wells has embarrassed her rigidly proper family since she was a child with occasional but grievous lapses from ladylike behavior. They blame those lapses for the disgraceful fact that she is a spinster at 28. Cord Bennett, the son of his father's second marriage to a Cheyenne woman, is more than an embarrassment to his well-to-do family of ranchers and lawyers - they are ashamed and afraid of their black sheep. When Anne and Cord are found alone together, her father's fury leads to violence. Cord's family is more than willing to believe that the fault is his. Can Anne and Cord use the freedom of being condemned for sins they didn't commit to make a life together? Or will their disapproving, interfering families tear them apart? Kindle Locations: 4,846. "], "author": "Ellen O'Connell", "num_pages": "418", "awards": [], "places": ["Denver, Colorado", "Mason, Colorado"], "character_names": ["Anne Wells Bennett", "Cord Bennett"], "language": "English", "publish_date": "2010-04-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12913453-dancing-on-coals", "num_ratings": "3,062", "num_reviews": "312", "avg_ratings": 4.11, "genres": ["Romance", "Historical Romance", "Historical", "Romance", "Westerns", "Historical", "Historical Fiction", "Romance", "Western Romance"], "title": "Dancing on Coals", "description": ["After escaping robbers intent on murder, Katherine Grant says, \"I jumped from the frying pan into the fire. Before long I'll be dancing on the coals.\" The highwaymen were the frying pan; the handsome young Apache who saved her from them was the fire; and the coals? Gaetan.", "Rage against the enemies of his people has consumed Gaetan from boyhood. The only use he ever found fo", "After escaping robbers intent on murder, Katherine Grant says, \"I jumped from the frying pan into the fire. Before long I'll be dancing on the coals.\" The highwaymen were the frying pan; the handsome young Apache who saved her from them was the fire; and the coals? Gaetan.", "Rage against the enemies of his people has consumed Gaetan from boyhood. The only use he ever found for any white was to test the sharpness of his knife. Forced by his brother to endure Katherine's company, Gaetan tries to deny what he sees—the white woman has a man's temper and a lion's courage. She has an Apache heart.", "In spite of hate, distrust and fear, surviving in the rugged country of southern Arizona and northern Mexico forges a strange bond between Katherine and Gaetan. When the bond turns to love, can they admit it? Can they bear the consequences?"], "author": "Ellen O'Connell", "num_pages": "320", "awards": [], "places": ["Arizona Territory"], "character_names": [], "language": "English", "publish_date": "2011-10-18 00:00:00", "ISBN": "1466441186"}
]