[
{"url": "https://www.goodreads.com/book/show/89731.Kira_Kira", "num_ratings": "20,632", "num_reviews": "2,431", "avg_ratings": 3.91, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Realistic Fiction", "Childrens", "Middle Grade", "Childrens"], "title": "Kira-Kira", "description": [" Glittering. That's how Katie Takeshima's sister, Lynn, makes everything seem. The sky is ", " because its color is deep but see-through at the same time. The sea is ", " for the same reason and so are people's eyes. When Katie and her family move from a Japanese community in Iowa to the Deep South of Georgia, it's Ly", " Glittering. That's how Katie Takeshima's sister, Lynn, makes everything seem. The sky is ", " because its color is deep but see-through at the same time. The sea is ", " for the same reason and so are people's eyes. When Katie and her family move from a Japanese community in Iowa to the Deep South of Georgia, it's Lynn who explains to her why people stop on the street to stare, and it's Lynn who, with her special way of viewing the world, teaches Katie to look beyond tomorrow, but when Lynn becomes desperately ill, and the whole family begins to fall apart, it is up to Katie to find a way to remind them all that there is always something glittering -- ", " -- in the future."], "author": "Cynthia Kadohata", "num_pages": "272", "awards": ["Newbery Medal (2005)", "Dorothy Canfield Fisher Children's Book Award Nominee (2006)", "Asian/Pacific American Award for Literature for Youth Literature (2005)"], "places": ["Georgia"], "character_names": ["Katie Minnamino", "Uncle Katsuhisa", "Silly Kilgore", "Lynn Takeshima", "Sammy Takeshima", "Auntie Fumi"], "language": "English", "publish_date": "2006-12-26 00:00:00", "ISBN": "0689856407"},
{"url": "https://www.goodreads.com/book/show/8705784-born-at-midnight", "num_ratings": "74,614", "num_reviews": "4,063", "avg_ratings": 4.13, "genres": ["Fantasy", "Paranormal", "Paranormal", "Vampires", "Fantasy", "Young Adult", "Shapeshifters", "Werewolves", "Fantasy", "Supernatural"], "title": "Born at Midnight", "description": ["One night Kylie Galen finds herself at the wrong party, with the wrong people, and it changes her life forever. Her mother ships her off to Shadow Falls—a camp for troubled teens, and within hours of arrivi", "One night Kylie Galen finds herself at the wrong party, with the wrong people, and it changes her life forever. Her mother ships her off to Shadow Falls—a camp for troubled teens, and within hours of arriving, it becomes painfully clear that her fellow campers aren’t just “troubled.” Here at Shadow Falls, vampires, werewolves, shapeshifters, witches and fairies train side by side—learning to harness their powers, control their magic and live in the normal world.", "Kylie’s never felt normal, but surely she doesn’t belong here with a bunch of paranormal freaks either. Or does she? They insist Kylie is one of them, and that she was brought here for a reason. As if life wasn’t complicated enough, enter Derek and Lucas. Derek’s a half-fae who’s determined to be her boyfriend, and Lucas is a smokin’ hot werewolf with whom Kylie shares a secret past. Both Derek and Lucas couldn’t be more different, but they both have a powerful hold on her heart. ", "Even though Kylie feels deeply uncertain about everything, one thing is becoming painfully clear—Shadow Falls is exactly where she belongs…"], "author": "C.C. Hunter", "num_pages": "398", "awards": ["Gayle Wilson Award of Excellence for Young Adult (2012)"], "places": ["Texas"], "character_names": ["Della", "Derek", "Lucas Ross", "Miranda", "Kylie Galen", "Burnet"], "language": "English", "publish_date": "2011-03-29 00:00:00", "ISBN": "0312624670"},
{"url": "https://www.goodreads.com/book/show/613218.When_My_Name_Was_Keoko", "num_ratings": "4,428", "num_reviews": "615", "avg_ratings": 4.09, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Cultural", "Asia"], "title": "When My Name Was Keoko", "description": ["Sun-hee and her older brother Tae-yul are proud of their Korean heritage. Yet they live their lives under Japanese occupation. All students must read and write in Japanese and no one can fly the Korean flag. Hardest of all is when the Japanese Emperor forces all Koreans to take Japanese names. Sun-hee and Tae-yul become Keoko and Nobuo. Korea is torn apart by their Japanes", "Sun-hee and her older brother Tae-yul are proud of their Korean heritage. Yet they live their lives under Japanese occupation. All students must read and write in Japanese and no one can fly the Korean flag. Hardest of all is when the Japanese Emperor forces all Koreans to take Japanese names. Sun-hee and Tae-yul become Keoko and Nobuo. Korea is torn apart by their Japanese invaders during World War II. Everyone must help with war preparations, but it doesn’t mean they are willing to defend Japan. Tae-yul is about to risk his life to help his family, while Sun-hee stays home guarding life-and-death secrets."], "author": "Linda Sue Park", "num_pages": "208", "awards": ["Jane Addams Children's Book Award Nominee for Older Children (2003)", "Dorothy Canfield Fisher Children's Book Award Nominee (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-01-13 00:00:00", "ISBN": "0440419441"},
{"url": "https://www.goodreads.com/book/show/3873259-skunk-girl", "num_ratings": "461", "num_reviews": "93", "avg_ratings": 3.34, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Cultural", "Humor", "Contemporary"], "title": "Skunk Girl", "description": ["If Nina Khan were to rate herself on the unofficial Pakistani prestige point system – the one she's sure all the aunties and uncles use to determine the most attractive marriage prospects for their children – her scoring might go something like this: ", "for getting excellent grades ", "for failing to live up to expectations set by genius older sister ", "If Nina Khan were to rate herself on the unofficial Pakistani prestige point system – the one she's sure all the aunties and uncles use to determine the most attractive marriage prospects for their children – her scoring might go something like this: ", "for getting excellent grades ", "for failing to live up to expectations set by genius older sister ", "for dutifully obeying parents and never, ever going to parties, no matter how antisocial that makes her seem to everyone at Deer Hook High ", "for harboring secret jealousy of her best friends, who are allowed to date like normal teenagers ", "for never drinking an alcoholic beverage ", "for obsessing about Asher Richelli, who talks to Nina like she's not a freak at all, even though he knows that she has a disturbing line of hair running down her back", "In this wryly funny debut novel, the smart, sassy, and utterly lovable Nina Khan tackles friends, family, and love, and learns that it's possible to embrace two very different cultures – even if things can get a little bit, well, ", "."], "author": "Sheba Karim", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-31 00:00:00", "ISBN": "0374370117"},
{"url": "https://www.goodreads.com/book/show/18465601-the-shadow-hero", "num_ratings": "7,202", "num_reviews": "758", "avg_ratings": 3.89, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Young Adult", "Fantasy", "Comics", "Superheroes", "Fiction", "Historical", "Historical Fiction"], "title": "The Shadow Hero", "description": ["A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. ", " is based on golden-age comic series ", ", whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American su", "A VIBRANT HOMAGE TO A CLASSIC COMIC FROM TWO MASTERS OF THE MODERN GRAPHIC NOVEL. ", " is based on golden-age comic series ", ", whose hero solved crimes and fought injustice just like any other comics hero. But this mysterious masked crusader was hiding more than your run-of-the-mill secret identity...The Green Turtle was the first Asian American superhero.", "Now, exactly seventy years later, ", "-bestselling author Gene Luen Yang has revived this nearly forgotten, pioneering character in a new graphic novel that creates an origin story for the golden-age Green Turtle. ", "With artwork by the unmatched Sonny Liew, this hilarious and insightful graphic novel about heroism and heritage is also a loving tribute to the long, rich tradition of American superhero comics."], "author": "Gene Luen Yang", "num_pages": "176", "awards": ["Will Eisner Comic Industry Awards for Best Writer (for Gene Luen Yang) AND nominated for Best Publication for Teens (ages 13-17) (2015)", "Goodreads Choice Award Nominee for Graphic Novels & Comics (2014)", "Asian/Pacific American Award for Literature for Young Adult Honor (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-15 00:00:00", "ISBN": "1596436972"},
{"url": "https://www.goodreads.com/book/show/10215349-the-immortal-rules", "num_ratings": "59,715", "num_reviews": "5,903", "avg_ratings": 4.1, "genres": ["Paranormal", "Vampires", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Science Fiction", "Dystopia"], "title": "The Immortal Rules", "description": ["Allison Sekemoto survives in the Fringe, the outermost circle of a walled-in city. By day, she and her crew scavenge for food. By night, any one of them could be eaten. Some days, all that drives Allie is her hatred of", "—the vampires who keep humans as blood cattle. Until the night Allie herself dies and becomes", "Allison Sekemoto survives in the Fringe, the outermost circle of a walled-in city. By day, she and her crew scavenge for food. By night, any one of them could be eaten. Some days, all that drives Allie is her hatred of", "—the vampires who keep humans as blood cattle. Until the night Allie herself dies and becomes one of the monsters.", "Forced to flee her city, Allie must pass for human as she joins a ragged group of pilgrims seeking a legend—a place that might have a cure for the disease that killed off most of civilization and created the rabids, the bloodthirsty creatures who threaten human and vampire alike. And soon Allie will have to decide what and who is worth dying for\u0085 again.", "Enter Julie Kagawa's dark and twisted world as an unforgettable journey begins."], "author": "Julie Kagawa", "num_pages": "485", "awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)"], "places": [], "character_names": ["Allison Sekemoto", "Stick", "Kanin", "Jackal", "Zeke Crosse"], "language": "English", "publish_date": "2012-04-24 00:00:00", "ISBN": "0373210515"},
{"url": "https://www.goodreads.com/book/show/210507.Farewell_to_Manzanar", "num_ratings": "9,898", "num_reviews": "1,004", "avg_ratings": 3.55, "genres": ["Nonfiction", "History", "Autobiography", "Memoir", "Biography", "Academic", "School", "Historical"], "title": "Farewell to Manzanar", "description": ["Jeanne Wakatsuki was seven years old in 1942 when her family was uprooted from their home and sent to live at Manzanar internment camp--with 10,000 other Japanese Americans. Along with searchlight towers and armed guards, Manzanar ludicrously featured cheerleaders, Boy Scouts, sock hops, baton twirling lessons and a dance band called the Jive Bombers who would play any pop", "Jeanne Wakatsuki was seven years old in 1942 when her family was uprooted from their home and sent to live at Manzanar internment camp--with 10,000 other Japanese Americans. Along with searchlight towers and armed guards, Manzanar ludicrously featured cheerleaders, Boy Scouts, sock hops, baton twirling lessons and a dance band called the Jive Bombers who would play any popular song except the nation's #1 hit: \"Don't Fence Me In.\"", " is the true story of one spirited Japanese-American family's attempt to survive the indignities of forced detention--and of a native-born American child who discovered what it was like to grow up behind barbed wire in the United States."], "author": "Jeanne Wakatsuki Houston", "awards": [], "places": ["Independence"], "character_names": [], "language": null, "publish_date": "1974-10-01 00:00:00", "ISBN": "0553085077"},
{"url": "https://www.goodreads.com/book/show/215014.The_Year_of_the_Dog", "num_ratings": "5,107", "num_reviews": "535", "avg_ratings": 3.91, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Childrens", "Fiction"], "title": "The Year of the Dog", "description": ["When Pacy's mom tells her that this is a good year for friends, family, and \"finding herself,\" Pacy begins searching right away. As the year goes on, she struggles to find her talent, deals with disappointment, makes a new best friend, and discovers just why the Year of the Dog is a lucky one for her after all.", "This funny and profound book is", "When Pacy's mom tells her that this is a good year for friends, family, and \"finding herself,\" Pacy begins searching right away. As the year goes on, she struggles to find her talent, deals with disappointment, makes a new best friend, and discovers just why the Year of the Dog is a lucky one for her after all.", "This funny and profound book is a wonderful debut novel by prolific author and illustrator Grace Lin, and young readers will be sure to love and treasure it for years to come.", "This special edition of the modern classic features over 15 pages of new content, including deleted stories, a Q&A with the author and editor, photos from the author's childhood, and more!"], "author": "Grace Lin", "num_pages": "160", "awards": ["Asian/Pacific American Award for Literature for Youth Literature Honor (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "031606002X"},
{"url": "https://www.goodreads.com/book/show/6164187-my-most-excellent-year", "num_ratings": "7,233", "num_reviews": "1,063", "avg_ratings": 4.04, "genres": ["Young Adult", "Fiction", "Romance", "Lgbt", "Contemporary", "Realistic Fiction"], "title": "My Most Excellent Year: A Novel of Love, Mary Poppins, and Fenway Park", "description": ["There are only three great loves in T.C. Keller's life: the Red Sox, his father, and his best friend and unofficial \"brother,\" Augie. But ninth grade is the year when he falls head-over-cleats in love with Ale Perez. She's pretty, sassy, smart, and a great dancer. Ale is so busy playing hard to get that she doesn't realize that she just might be falling head-over-tap shoes", "There are only three great loves in T.C. Keller's life: the Red Sox, his father, and his best friend and unofficial \"brother,\" Augie. But ninth grade is the year when he falls head-over-cleats in love with Ale Perez. She's pretty, sassy, smart, and a great dancer. Ale is so busy playing hard to get that she doesn't realize that she just might be falling head-over-tap shoes for T.C.'s Boston accent, too. Meanwhile, T.C.'s best friend, Augie, is falling in love as well, but with a boy? It may not be so clear to him; but to the rest of his family and friends, it's totally obvious that Augie, who loves musicals and old school screen sirens such as Judy Garland, is head-over-heels in love with Andy Wexler. ", "Told in alternating perspectives, this is the story of their most excellent year, where these three friends discover themselves, love, and that a little magic and Mary Poppins can go a long way."], "author": "Steve Kluger", "num_pages": "403", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2011)", "Amelia Elizabeth Walden Award (2009)", "Peggy Miller Award (2009)"], "places": [], "character_names": ["T.C. Keller", "Ale Perez", "Andy Wexler", "Augie Hwong"], "language": "English", "publish_date": "2009-02-19 00:00:00", "ISBN": "0142413437"},
{"url": "https://www.goodreads.com/book/show/7763.The_Joy_Luck_Club", "num_ratings": "548,448", "num_reviews": "7,390", "avg_ratings": 3.91, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Cultural", "China", "Contemporary"], "title": "The Joy Luck Club", "description": ["In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her se", "In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her secrets, trying to unravel the truth about her life, the strings become more tangled, more entwined..."], "author": "Amy Tan", "num_pages": "288", "awards": ["California Book Award for Fiction (Gold) (1989)", "Los Angeles Times Book Prize Nominee for Fiction (1989)", "Northern California Book Awards for Fiction (1989)", "National Book Critics Circle Award Nominee for Fiction (1989)", "National Book Award Finalist for Fiction (1989)"], "places": ["San Francisco, California", "China"], "character_names": ["Suyuan Woo", "June Woo", "Lindo Jong", "Waverly Jong", "An-Mei Hsu", "Rose Hsu Jordan", "Ying-Ying St. Clair", "Lena St. Clair"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038095"},
{"url": "https://www.goodreads.com/book/show/13423346-ink", "num_ratings": "9,322", "num_reviews": "1,484", "avg_ratings": 3.67, "genres": ["Young Adult", "Fantasy", "Romance", "Fantasy", "Paranormal", "Fantasy", "Mythology"], "title": "Ink", "description": ["On the heels of a family tragedy, the last thing Katie Greene wants to do is move halfway across the world. Stuck with her aunt in Shizuoka, Japan, Katie feels lost. Alone. She doesn’t know the language, she can barely hold a pair of chopsticks, and she can’t seem to get the hang of taking her shoes off whenever she enters a building.", "Then there’s gorgeous but aloof Tomohir", "On the heels of a family tragedy, the last thing Katie Greene wants to do is move halfway across the world. Stuck with her aunt in Shizuoka, Japan, Katie feels lost. Alone. She doesn’t know the language, she can barely hold a pair of chopsticks, and she can’t seem to get the hang of taking her shoes off whenever she enters a building.", "Then there’s gorgeous but aloof Tomohiro, star of the school’s kendo team. How did he really get the scar on his arm? Katie isn’t prepared for the answer. But when she sees the things he draws start moving, there’s no denying the truth: Tomo has a connection to the ancient gods of Japan, and being near Katie is causing his abilities to spiral out of control. If the wrong people notice, they'll both be targets.", "Katie never wanted to move to Japan—now she may not make it out of the country alive."], "author": "Amanda Sun", "num_pages": "326", "awards": [], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "2013-06-25 00:00:00", "ISBN": "037321071X"},
{"url": "https://www.goodreads.com/book/show/785453.A_Single_Shard", "num_ratings": "30,842", "num_reviews": "2,253", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Childrens", "Middle Grade", "Historical"], "title": "A Single Shard", "description": ["Tree-ear, an orphan, lives under a bridge in Ch’ulp’o, a potters’ village famed for delicate celadon ware. He has become fascinated with the potter’s craft; he wants nothing more than to watch master potter Min at work, and he dreams of making a pot of his own someday. When Min takes Tree-ear on as his helper, Tree-ear is elated–until he finds obstacles in his path: the ba", "Tree-ear, an orphan, lives under a bridge in Ch’ulp’o, a potters’ village famed for delicate celadon ware. He has become fascinated with the potter’s craft; he wants nothing more than to watch master potter Min at work, and he dreams of making a pot of his own someday. When Min takes Tree-ear on as his helper, Tree-ear is elated–until he finds obstacles in his path: the backbreaking labor of digging and hauling clay, Min’s irascible temper, and his own ignorance. But Tree-ear is determined to prove himself–even if it means taking a long, solitary journey on foot to present Min’s work in the hope of a royal commission . . . even if it means arriving at the royal court with nothing to show but a single celadon shard."], "author": "Linda Sue Park", "num_pages": "192", "awards": ["Newbery Medal (2002)", "جایزه ی نیوبری", "Dorothy Canfield Fisher Children's Book Award Nominee (2003)", "Asian/Pacific American Award for Literature for Children and Young Adult Honor (2003)", "Rebecca Caudill Young Readers' Book Award Nominee (2006)"], "places": ["Ch’ulp’o"], "character_names": [], "language": "English", "publish_date": "2003-02-11 00:00:00", "ISBN": "0440418518"},
{"url": "https://www.goodreads.com/book/show/26489591-nora-kettle", "num_ratings": "975", "num_reviews": "232", "avg_ratings": 4.11, "genres": ["Historical", "Historical Fiction", "Young Adult", "Retellings", "Historical"], "title": "Nora & Kettle", "description": ["Seventeen-year-old Kettle has had his share of adversity. As an orphaned Japanese American struggling to make a life in the aftermath of an event in history not often referred to — the internment of Japanese Americans during World War II and the removal of children f", "Seventeen-year-old Kettle has had his share of adversity. As an orphaned Japanese American struggling to make a life in the aftermath of an event in history not often referred to — the internment of Japanese Americans during World War II and the removal of children from orphanages for having \"one drop of Japanese blood in them\" — things are finally looking up. He has his hideout in an abandoned subway tunnel, a job, and his gang of Lost Boys.", "Desperate to run away, the world outside her oppressive brownstone calls to naive, eighteen-year-old Nora — the privileged daughter of a controlling and violent civil rights lawyer who is building a compensation case for the interned Japanese Americans. But she is trapped, enduring abuse to protect her younger sister Frankie and wishing on the stars every night for things to change.", "For months, they've lived side by side, their paths crossing yet never meeting. But when Nora is nearly killed and her sister taken away, their worlds collide as Kettle, grief stricken at the loss of a friend, angrily pulls Nora from her window.", "In her honeyed eyes, Kettle sees sadness and suffering. In his, Nora sees the chance to take to the window and fly away."], "author": "Lauren Nicolle Taylor", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-15 00:00:00", "ISBN": "1634221354"},
{"url": "https://www.goodreads.com/book/show/27431418-coinman", "num_ratings": "232", "num_reviews": "128", "avg_ratings": 3.94, "genres": ["Humor", "Asian Literature", "Indian Literature", "Literary Fiction", "Fiction", "Humor", "Comedy"], "title": "Coinman: An Untold Conspiracy", "description": ["Coinman is one of life's victims, the receiver of subtle bullying in an office environment and thinly disguised control in his own home, but remains true to his desire to be polite and accepting of how he is treated by everyone. Then an incident at work changes all that.", "One of the best literary fiction books of 2016 (Independently Published)."], "author": "Pawan Mishra", "num_pages": "230", "awards": ["Readers' Favorite Book Award for Fiction - Cultural (Honorable Mention) (2016)", "National Indie Excellence Awards Nominee for Humor (2016)", "IAN Book of the Year Awards Nominee for Fiction (2016)", "eLit Book Award for Literary Fiction - Bronze (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-04 00:00:00", "ISBN": "0692475672"},
{"url": "https://www.goodreads.com/book/show/498772.Wait_for_Me", "num_ratings": "1,043", "num_reviews": "146", "avg_ratings": 3.47, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Romance", "Contemporary"], "title": "Wait for Me", "description": ["Mina is the perfect daughter. Bound for Harvard, she's Honor Society president and a straight-A student, even as she works at her family's dry-cleaning store and helps care for her hearingimpaired little sister. On the outside, Mina does everything right. On the inside, Mina knows the truth. Her life is a lie. Then, the summer before her senior year, Mina meets someone to", "Mina is the perfect daughter. Bound for Harvard, she's Honor Society president and a straight-A student, even as she works at her family's dry-cleaning store and helps care for her hearingimpaired little sister. On the outside, Mina does everything right. On the inside, Mina knows the truth. Her life is a lie. Then, the summer before her senior year, Mina meets someone to whom she cannot lie. Ysrael, a young migrant worker who dreams of becoming a musician, comes to work for her family, and asks Mina the one question that scares her the most. What does she want?"], "author": "An Na", "num_pages": "172", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-06-08 00:00:00", "ISBN": "0399242759"},
{"url": "https://www.goodreads.com/book/show/18705209-the-blood-of-olympus", "num_ratings": "148,332", "num_reviews": "13,332", "avg_ratings": 4.42, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Blood of Olympus", "description": [" Going through the House of Hades would stir the demigods' worst memories. Their ghosts would become restless. Nico may actually ", " a ghost if he has to shadow-travel with Reyna and Coach Hedge one more time. But that might be better than the alternative: allowing someone else to die, as Hades foretold.", " who abandoned him", " Going through the House of Hades would stir the demigods' worst memories. Their ghosts would become restless. Nico may actually ", " a ghost if he has to shadow-travel with Reyna and Coach Hedge one more time. But that might be better than the alternative: allowing someone else to die, as Hades foretold.", " who abandoned him when he was little. He may not know how he is going to prove himself as a leader, but he does know that he will not break promises like she did. He will complete his line of the prophecy: ", " who radiate anger. But she can't allow them to distract her from getting the Athena Parthenos to Camp Half-Blood before war breaks out between the Romans and Greeks. Will she have enough strength to succeed, especially with a deadly hunter on her trail?", " that his friends might interfere. But there is no other way. All of them know that one of the Seven has to die in order to defeat Gaea, the Earth Mother.", " Only then will she be able to do her part at the end: utter a single word.", "Heroes, gods, and monsters all have a role to play in the climactic fulfillment of the prophecy in ", ", the electrifying finale of the best-selling Heroes of Olympus series."], "author": "Rick Riordan", "num_pages": "516", "awards": ["Goodreads Choice Award for Middle Grade & Children's (2014)"], "places": ["Ithaca", "Pompeii", "Olympus", "Évora", "Long Island, New York", "Pylos", "Sparta", "San Juan", "Buford, South Carolina", "Delos, Cyclades", "Athens"], "character_names": ["Leo Valdez", "Nico di Angelo", "Thalia Grace", "Annabeth Chase", "Demeter (Goddess)", "Grover Underwood", "Hera", "Hades", "Reyna", "Juno", "Rachel Elizabeth Dare", "Jason Grace", "Piper McLean", "Hazel Levesque", "Frank Zhang", "Will Solace", "Percy Jackson"], "language": "English", "publish_date": "2014-10-07 00:00:00", "ISBN": "1484724917"},
{"url": "https://www.goodreads.com/book/show/332807.Nothing_But_the_Truth_and_a_few_white_lies_", "num_ratings": "1,243", "num_reviews": "121", "avg_ratings": 3.63, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction", "Young Adult", "Teen"], "title": "Nothing But the Truth [and a few white lies]", "description": ["\"Getting her fortune told by a Taiwanese 'belly-button grandmother' (who feels up her navel) instead of attending the spring dance is just one of the joys of being Patty Ho, a covertly snarky 'hapa' (half Asian, half white) struggling with her dual heritage. Patty's domineering mother is determined to make her a good Taiwanese girl. Gangly Patty, no 'China doll,' longs to", "\"Getting her fortune told by a Taiwanese 'belly-button grandmother' (who feels up her navel) instead of attending the spring dance is just one of the joys of being Patty Ho, a covertly snarky 'hapa' (half Asian, half white) struggling with her dual heritage. Patty's domineering mother is determined to make her a good Taiwanese girl. Gangly Patty, no 'China doll,' longs to be white like her long-gone father...readers will find a compelling narrative, and a spunky, sympathetic heroine. This book should enjoy wide appeal.\" -VOYA"], "author": "Justina Chen", "num_pages": "256", "awards": ["Asian/Pacific American Award for Literature for Youth Literature (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "0316011312"},
{"url": "https://www.goodreads.com/book/show/1627784.The_Amah", "num_ratings": "99", "num_reviews": "10", "avg_ratings": 3.65, "genres": ["Young Adult", "Childrens", "Fiction", "Own"], "title": "The Amah", "description": ["Twelve-year-old Amy finds her family responsibilities growing and interfering with her ballet practice when her mother takes a job outside the home."], "author": "Laurence Yep", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-03-05 00:00:00", "ISBN": "0698118782"},
{"url": "https://www.goodreads.com/book/show/25066780-ms-marvel-vol-4", "num_ratings": "12,233", "num_reviews": "1,052", "avg_ratings": 4.22, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Young Adult", "Superheroes", "Marvel", "Comics", "Superheroes", "Graphic Novels Comics", "Fiction"], "title": "Ms. Marvel, Vol. 4: Last Days", "description": ["From the moment Kamala put on her costume, she's been challenged. But nothing has prepared her for this: the last days of the Marvel Universe. Lucky she's got the help of Carol \"Captain Marvel\" Danvers! Between teaming up with her personal hero to rescue her brother and trying to keep her city from falling into an all-out frenzy, Kamala has barely had time to come to terms", "From the moment Kamala put on her costume, she's been challenged. But nothing has prepared her for this: the last days of the Marvel Universe. Lucky she's got the help of Carol \"Captain Marvel\" Danvers! Between teaming up with her personal hero to rescue her brother and trying to keep her city from falling into an all-out frenzy, Kamala has barely had time to come to terms with the fact that the world is literally collapsing around her. But the truth will catch up to her, and soon. When the world is about to end, do you still keep fighting? Kamala knows the answer. Let's do this, Jersey City.", "Collecting: ", ", written by G. Willow Wilson and illustrated by Adrian Alphona, plus material from ", "."], "author": "G. Willow Wilson", "num_pages": "120", "awards": [], "places": ["Jersey City, New Jersey", "Manhattan, New York City, New York"], "character_names": ["Carol Danvers", "Kamran Akmal", "Kamala Khan", "Zoe Zimmer", "Cindy Moon", "Bruno Carrelli", "Yusuf Khan", "Muneeba Khan", "Aamir Khan", "Vittorio \"Vick\" Carrelli", "Kaboom", "Anna Maria Marconi", "Natalie Long", "Clayton Cole", "Doctor Minerva", "Peter Parker", "Josh Richardson"], "language": "English", "publish_date": "2015-12-01 00:00:00", "ISBN": "0785197362"},
{"url": "https://www.goodreads.com/book/show/18378827-abby-spencer-goes-to-bollywood", "num_ratings": "322", "num_reviews": "101", "avg_ratings": 3.86, "genres": ["Childrens", "Middle Grade", "Realistic Fiction", "Contemporary", "Cultural", "Young Adult", "Childrens", "Fiction", "Family", "Cultural", "India", "Humor"], "title": "Abby Spencer Goes to Bollywood", "description": ["What thirteen-year-old Abby wants most is to meet her father. She just never imagined he would be a huge film star--in Bollywood! Now she's traveling to Mumbai to get to know her famous father. Abby is overwhelmed by the culture clash, the pressures of being the daughter of India's most famous celebrity, and the burden of keeping her identity a secret. But as she learns to", "What thirteen-year-old Abby wants most is to meet her father. She just never imagined he would be a huge film star--in Bollywood! Now she's traveling to Mumbai to get to know her famous father. Abby is overwhelmed by the culture clash, the pressures of being the daughter of India's most famous celebrity, and the burden of keeping her identity a secret. But as she learns to navigate her new surroundings, she just might discover where she really belongs."], "author": "Varsha Bajaj", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-03-01 00:00:00", "ISBN": "0807563633"},
{"url": "https://www.goodreads.com/book/show/7969452-fury-of-the-phoenix", "num_ratings": "934", "num_reviews": "158", "avg_ratings": 3.96, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction", "Adventure", "Young Adult", "Young Adult Fantasy"], "title": "Fury of the Phoenix", "description": ["The Gods have abandoned Ai Ling.", "Her mysterious power haunts her day and night, and she leaves home—with just the moon as her guide—overwhelmed by her memories and visions and an unbearable sense of dread. For Ai Ling knows that Chen Yong is vulnerable to corrupt enchantments from the under-world. How can she do nothing when she has the skill and power to fight at his side?", "The Gods have abandoned Ai Ling.", "Her mysterious power haunts her day and night, and she leaves home—with just the moon as her guide—overwhelmed by her memories and visions and an unbearable sense of dread. For Ai Ling knows that Chen Yong is vulnerable to corrupt enchantments from the under-world. How can she do nothing when she has the skill and power to fight at his side? A dream has told her where he is, the name of the ship he is traveling on, his destination. So she steals off and stows away on board.", "The ocean voyage brings with it brutal danger, haunting revelations, and new friendships, but also the premonition of a very real and terrifying threat. Zhong Ye—the powerful sorcerer whom Ai Ling believed she had vanquished in the Palace of Fragrant Dreams—is trapped in Hell, neither alive nor dead. Can he reach from beyond the grave to reunite with Silver Phoenix and destroy Chen Yong? And destroy whatever chance Ai Ling has at happiness, at love?", "In this sequel to the acclaimed novel ", ", four lives are woven together and four destinies become one, now and forever."], "author": "Cindy Pon", "num_pages": "362", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-29 00:00:00", "ISBN": "0061730254"},
{"url": "https://www.goodreads.com/book/show/12389478-words-in-the-dust", "num_ratings": "2,693", "num_reviews": "520", "avg_ratings": 4.02, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Historical", "Historical Fiction", "Childrens", "Middle Grade"], "title": "Words in the Dust", "description": ["Zulaikha hopes. She hopes for peace, now that the Taliban have been driven from Afghanistan; a good relationship with her hard stepmother; and one day even to go to school, or to have her cleft palate fixed. Zulaikha knows all will be provided for her--\"Inshallah,\" God willing. ", "Then she meets Meena, who offers to teach her the Afghan poetry she taught her late mother. And", "Zulaikha hopes. She hopes for peace, now that the Taliban have been driven from Afghanistan; a good relationship with her hard stepmother; and one day even to go to school, or to have her cleft palate fixed. Zulaikha knows all will be provided for her--\"Inshallah,\" God willing. ", "Then she meets Meena, who offers to teach her the Afghan poetry she taught her late mother. And the Americans come to her village, promising not just new opportunities and dangers, but surgery to fix her face. These changes could mean a whole new life for Zulaikha--but can she dare to hope they'll come true?"], "author": "Trent Reedy", "num_pages": "264", "awards": ["Christopher Award (2011)", "SCBWI Golden Kite Award", "Cybils Award Nominee for Middle Grade Fiction (2011)", "Society of Midland Authors Award for Children's Fiction (2012)", "Rebecca Caudill Young Readers' Book Award Nominee (2014)"], "places": ["Afghanistan"], "character_names": [], "language": "English", "publish_date": "2011-01-16 00:00:00", "ISBN": "0545336996"},
{"url": "https://www.goodreads.com/book/show/32052246-champions-volume-1", "num_ratings": "779", "num_reviews": "147", "avg_ratings": 3.79, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Superheroes", "Marvel", "Comics", "Superheroes"], "title": "Champions, Volume 1: Change the World", "description": ["One of the great team names in Marvel history returns, in incredible new fashion! During the fallout of ", ", Ms. Marvel, Nova and Spider-Man quit the Avengers and strike out on their own! With Viv Vision and the Totally Awesome Hulk by their side, these young heroes are determined to change the world their own way - and they're only the beginning! It starts as an", "One of the great team names in Marvel history returns, in incredible new fashion! During the fallout of ", ", Ms. Marvel, Nova and Spider-Man quit the Avengers and strike out on their own! With Viv Vision and the Totally Awesome Hulk by their side, these young heroes are determined to change the world their own way - and they're only the beginning! It starts as an idea. It becomes an ideal. But what happens when it turns into a movement - one so big even the Hulk can't stop it? And will one of the greatest X-Men of all forge a new future by their side? Welcome to the Champions, Cyclops! Unfortunately, not all of your new would-be teammates are glad to see you!"], "author": "Mark Waid", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-05-16 00:00:00", "ISBN": "1302906186"},
{"url": "https://www.goodreads.com/book/show/1657831.April_and_the_Dragon_Lady", "num_ratings": "134", "num_reviews": "21", "avg_ratings": 3.49, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Literature", "Asian Literature", "Contemporary", "Cultural"], "title": "April and the Dragon Lady", "description": ["April Chen is happily planning to go away to college, and she has a great new boyfriend, Steve. But as the only girl in her family, April is expected to take care of her grandmother. And Grandma, \"the Dragon Lady,\" hates Steve and has other plans for April. Torn between her duty to her family and her desire for independence, April realizes she must find a way to define her", "April Chen is happily planning to go away to college, and she has a great new boyfriend, Steve. But as the only girl in her family, April is expected to take care of her grandmother. And Grandma, \"the Dragon Lady,\" hates Steve and has other plans for April. Torn between her duty to her family and her desire for independence, April realizes she must find a way to define herself on her own terms. ", " "], "author": "Lensey Namioka", "num_pages": "224", "awards": ["Washington State Book Award (1995)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-08-01 00:00:00", "ISBN": "0152056696"},
{"url": "https://www.goodreads.com/book/show/23017947-ms-marvel-vol-2", "num_ratings": "20,674", "num_reviews": "1,992", "avg_ratings": 4.14, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Young Adult", "Superheroes", "Marvel", "Comics", "Superheroes", "Graphic Novels Comics"], "title": "Ms. Marvel, Vol. 2: Generation Why", "description": ["Who is the Inventor, and what does he want with the all-new Ms. Marvel and all her friends? Maybe Wolverine can help! If Kamala can stop fan-girling out about meeting her favorite super hero, that is. Then, Kamala crosses paths with Inhumanity -- by meeting the royal dog, Lockjaw! But why is Lockjaw really with Kamala? As Ms. Marvel discovers more about her past, the Inven", "Who is the Inventor, and what does he want with the all-new Ms. Marvel and all her friends? Maybe Wolverine can help! If Kamala can stop fan-girling out about meeting her favorite super hero, that is. Then, Kamala crosses paths with Inhumanity -- by meeting the royal dog, Lockjaw! But why is Lockjaw really with Kamala? As Ms. Marvel discovers more about her past, the Inventor continues to threaten her future. Kamala bands together with some unlikely heroes to stop the maniacal villain before he does real damage, but has she taken on more than she can handle? And how much longer can Ms. Marvel's life take over Kamala Khan's? Kamala Khan continues to prove why she's the best (and most adorable) new super hero there is!", "Collecting ", "."], "author": "G. Willow Wilson", "num_pages": "136", "awards": ["Goodreads Choice Award Nominee for Graphic Novels & Comics (2015)"], "places": ["Jersey City, New Jersey"], "character_names": ["Wolverine", "Steve Rogers", "Medusalith Amaquelin Boltagon", "Kamala Khan", "Sheik Abdullah", "Thomas Edison (clone)", "Doyle", "Mrs. Van Boom", "Vinatos", "Knox", "Bruno Carrelli", "Nakia Badahir", "Yusuf Khan", "Muneeba Khan", "Aamir Khan", "Vittorio \"Vick\" Carrelli", "Lockjaw (Marvel)"], "language": "English", "publish_date": "2015-04-07 00:00:00", "ISBN": "0785190228"},
{"url": "https://www.goodreads.com/book/show/3356979-thirteen-orphans", "num_ratings": "895", "num_reviews": "132", "avg_ratings": 3.6, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Magic", "Cultural", "China", "Young Adult"], "title": "Thirteen Orphans", "description": ["As evocative and moving as Charles de Lint’s Newford books, with the youthful protagonists and exciting action of Mercedes Lackey’s fantasies, ", "makes our world today as excitingly strange and unfamiliar as any fantasy realm . . .and grants readers a glimpse of a fantasy world founded by ancient Chinese lore and magic.", "As far as college freshman Brenda Morris", "As evocative and moving as Charles de Lint’s Newford books, with the youthful protagonists and exciting action of Mercedes Lackey’s fantasies, ", "makes our world today as excitingly strange and unfamiliar as any fantasy realm . . .and grants readers a glimpse of a fantasy world founded by ancient Chinese lore and magic.", "As far as college freshman Brenda Morris knows, there is only one Earth and magic exists only in fairy tales.", "Brenda is wrong.", "A father-daughter weekend turns into a nightmare when Brenda’s father is magically attacked before her eyes. Brenda soon learns that her ancestors once lived in world of smoke and shadows, of magic and secrets.", "When that world’s Emperor was overthrown, the Thirteen Orphans fled to our earth and hid their magic system in the game of mah-jong. Each Orphan represents an animal from the Chinese Zodiac. Brenda’s father is the Rat. And her polished, former child-star aunt, Pearl—that eminent lady is the Tiger.", "Only a handful of Orphans remain to stand against their enemies. The Tiger, the Rooster, the Dog, the Rabbit . . . and Brenda Morris. Not quite the Rat, but not quite human either."], "author": "Jane Lindskold", "num_pages": "368", "awards": [], "places": ["United States of America"], "character_names": ["Pearl Bright", "Brenda Morris", "Gaheris Morris", "Riprap", "Noelani", "Nissa"], "language": "English", "publish_date": "2008-11-11 00:00:00", "ISBN": "0765317001"},
{"url": "https://www.goodreads.com/book/show/645270.The_Year_of_the_Rat", "num_ratings": "1,925", "num_reviews": "163", "avg_ratings": 4.08, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Childrens", "Fiction", "Cultural"], "title": "The Year of the Rat", "description": ["In this sequel to ", ", Pacy has another big year in store for her. The Year of the Dog was a very lucky year: she met her best friend Melody and discovered her true talents. However, the Year of the Rat brings big changes: Pacy must deal with Melody moving to California, find the courage to forge on with her dream of becoming a writer and illustrator, and learn", "In this sequel to ", ", Pacy has another big year in store for her. The Year of the Dog was a very lucky year: she met her best friend Melody and discovered her true talents. However, the Year of the Rat brings big changes: Pacy must deal with Melody moving to California, find the courage to forge on with her dream of becoming a writer and illustrator, and learn to face some of her own flaws. Pacy encounters prejudice, struggles with acceptance, and must find the beauty in change.", "Based on the author's childhood adventures, ", " features the whimsical black and white illustrations and the hilarious and touching anecdotes that helped ", "earn rave reviews and satisfied readers."], "author": "Grace Lin", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-02-07 00:00:00", "ISBN": "031611426X"},
{"url": "https://www.goodreads.com/book/show/10800916-awake-at-dawn", "num_ratings": "51,335", "num_reviews": "1,740", "avg_ratings": 4.29, "genres": ["Fantasy", "Paranormal", "Fantasy", "Paranormal", "Vampires", "Young Adult", "Romance", "Shapeshifters", "Werewolves"], "title": "Awake at Dawn", "description": ["From the moment Kylie Galen arrived at Shadow Falls Camp, she’s had one burning question: What am I? Surrounded by vampires, werewolves, shape-shifters, fairies and witches, Kylie longs to figure out her o", "From the moment Kylie Galen arrived at Shadow Falls Camp, she’s had one burning question: What am I? Surrounded by vampires, werewolves, shape-shifters, fairies and witches, Kylie longs to figure out her own supernatural identity…and what her burgeoning powers mean. And now she’ll need them more than ever, because she’s being haunted by a new spirit who insists that someone Kylie knows—and loves—will die before the end of the summer. If only she only knew who she was supposed to save. And how...", "But giving Kylie the most trouble is her aching heart. Gorgeous werewolf Lucas left camp with another girl, but he’s still visiting Kylie in her dreams. And Derek, a sexy half Fae who’s always been there for her when she needed him, is pushing to get more serious—and growing impatient, especially when Lucas returns. Kylie knows she needs to decide between the boys, and it’s tearing her up inside. ", "Yet romance will have to wait, because something from the dark side of the supernatural world is hiding in Shadow Falls. It’s about to threaten everything she holds dear... and bring her closer to her destiny."], "author": "C.C. Hunter", "num_pages": "383", "awards": [], "places": [], "character_names": ["Lucas Ross", "Kylie Galen"], "language": "English", "publish_date": "2011-10-11 00:00:00", "ISBN": "0312624689"},
{"url": "https://www.goodreads.com/book/show/18692431-everything-everything", "num_ratings": "238,228", "num_reviews": "31,220", "avg_ratings": 4.09, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "Everything, Everything", "description": ["My disease is as rare as it is famous. Basically, I’m allergic to the world. I don’t leave my house, have not left my house in seventeen years. The only people I ever see are my mom and my nurse, Carla.", "But then one day, a moving truck arrives next door. I look out my window, and I see him. He’s tall, lean and wearing all black—black T-shirt, black jeans, black sneakers, an", "My disease is as rare as it is famous. Basically, I’m allergic to the world. I don’t leave my house, have not left my house in seventeen years. The only people I ever see are my mom and my nurse, Carla.", "But then one day, a moving truck arrives next door. I look out my window, and I see him. He’s tall, lean and wearing all black—black T-shirt, black jeans, black sneakers, and a black knit cap that covers his hair completely. He catches me looking and stares at me. I stare right back. His name is Olly.", "Maybe we can’t predict the future, but we can predict some things. For example, I am certainly going to fall in love with Olly. It’s almost certainly going to be a disaster."], "author": "Nicola Yoon", "num_pages": "307", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Soaring Eagle Book Award (2016)", "Milwaukee County Teen Book Award Nominee (2017)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2016)", "Goodreads Choice Award Nominee for Debut Goodreads Author, and for Young Adult Fiction (2015)", "Missouri Gateway Readers Award Nominee (2017)"], "places": ["Los Angeles, California", "Maui, Hawaii"], "character_names": ["Madeline \"Maddy\" Furukawa Whittier", "Oliver \"Olly\" Bright", "Pauline Furukawa Whittier", "Carla Flores"], "language": "English", "publish_date": "2015-09-01 00:00:00", "ISBN": "0553496646"},
{"url": "https://www.goodreads.com/book/show/11207142-maid-for-me", "num_ratings": "604", "num_reviews": "51", "avg_ratings": 3.5, "genres": ["Young Adult", "Romance", "Womens Fiction", "Chick Lit", "Fiction"], "title": "Maid for Me", "description": ["Feisty Mina Lin waltzes on glass shards when she lands a job as billionaire Jaiden Daniels's maid. What happens when Jaiden hires her to become his pretend girlfriend? Pretending to be in love with the hot Rich Boy is hard, when Mina's heart only beats for her boy next door, Kiterin Forrests. What happens when Mina doesn't know what her heart wants and a crazy Stalker is a", "Feisty Mina Lin waltzes on glass shards when she lands a job as billionaire Jaiden Daniels's maid. What happens when Jaiden hires her to become his pretend girlfriend? Pretending to be in love with the hot Rich Boy is hard, when Mina's heart only beats for her boy next door, Kiterin Forrests. What happens when Mina doesn't know what her heart wants and a crazy Stalker is after Jaiden's life, and the only person who can save him is Mina?", "Find out in Maid for Me, starring Mina Lin, an ambitious, silly, funny, and talented Asian-American heroine who has even developed her own fighting styled called Mina-Jitsu. A fast-paced debut novel for young adults, by Kat Lieu. Filled with hilarious dialogue, suspense, sparkling wit and imagination-- a romance novel packed with action and humor!"], "author": "Kat Lieu", "num_pages": "138", "awards": [], "places": [], "character_names": ["Mina Lin", "Jaiden Daniels", "Kiterin Forrests"], "language": "English", "publish_date": "2009-11-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12866426-taken-at-dusk", "num_ratings": "40,585", "num_reviews": "1,478", "avg_ratings": 4.33, "genres": ["Fantasy", "Paranormal", "Paranormal", "Vampires", "Young Adult", "Shapeshifters", "Werewolves", "Romance"], "title": "Taken at Dusk", "description": ["Kylie Galen wants the truth so badly she can taste it. The truth about who her real family is, the truth about which boy she's meant to be with--and the truth about what her emerging powers mean. But she's", "Kylie Galen wants the truth so badly she can taste it. The truth about who her real family is, the truth about which boy she's meant to be with--and the truth about what her emerging powers mean. But she's about to discover that some secrets can change your life forever…and not always for the better.", "Just when she and Lucas are finally getting close, she learns that his pack has forbidden them from being together. Was it a mistake to pick him over Derek? And it's not just romance troubling Kylie. An amnesia-stricken ghost is haunting her, delivering the frightful warning, ", "As Kylie races to unravel the mystery and protect those she loves, she finally unlocks the truth about her supernatural identity, which is far different--and more astonishing--than she ever imagined."], "author": "C.C. Hunter", "num_pages": "380", "awards": [], "places": [], "character_names": ["Lucas Ross", "Della", "Derek", "Miranda", "Kylie Galen"], "language": "English", "publish_date": "2012-04-10 00:00:00", "ISBN": "0312624697"},
{"url": "https://www.goodreads.com/book/show/9723.Obasan", "num_ratings": "5,439", "num_reviews": "399", "avg_ratings": 3.62, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Canada", "Cultural", "Japan", "Academic", "School", "Historical"], "title": "Obasan", "description": ["Based on the author's own experiences, this award-winning novel was the first to tell the story of the evacuation, relocation, and dispersal of Canadian citizens of Japanese ancestry during the Second World War. \"This quiet novel burns in your hand.\" -- \"Washington Post.\""], "author": "Joy Kogawa", "num_pages": "320", "awards": ["American Book Award (1983)", "Canadian Authors Association Award for Fiction (1982)"], "places": ["Alberta"], "character_names": [], "language": "English", "publish_date": "1993-12-27 00:00:00", "ISBN": "0385468865"},
{"url": "https://www.goodreads.com/book/show/35276743-damselfly", "num_ratings": "190", "num_reviews": "71", "avg_ratings": 3.54, "genres": ["Young Adult", "Adventure", "Survival", "Adventure", "Contemporary", "Fiction", "Action", "Young Adult", "Teen"], "title": "Damselfly", "description": ["In the wake of crash-landing on a deserted tropical island, a group of private-school teens must rely on their wits and one another to survive. ", "Having just survived a plane crash, Samantha Mishra finds herself isolated and injured in the thick of the jungle. She has no idea where she is or where anybody else is -- she doesn't even know if anybody else is alive. Once Sam co", "In the wake of crash-landing on a deserted tropical island, a group of private-school teens must rely on their wits and one another to survive. ", "Having just survived a plane crash, Samantha Mishra finds herself isolated and injured in the thick of the jungle. She has no idea where she is or where anybody else is -- she doesn't even know if anybody else is alive. Once Sam connects with her best friend, Mel, and they locate the others, they set up camp and hope for rescue. But as the days pass, the survivors, all teammates on the Drake Rosemont fencing team, realize that they're on their own -- with the exception of a mysterious presence who taunts and threatens them. When their initial attempts to escape the island fail, the teens find they need to survive more than the jungle . . . they need to survive each other.", "This taut novel, with a setting evocative of Lord of the Flies, is by turns cinematic and intimate, and always thought-provoking."], "author": "Chandra Prasad", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-03-27 00:00:00", "ISBN": "0545907926"},
{"url": "https://www.goodreads.com/book/show/25226237-weaving-a-net-is-better-than-praying-for-fish", "num_ratings": "7", "num_reviews": "0", "avg_ratings": 5.0, "genres": ["Childrens", "Middle Grade", "Realistic Fiction", "Cultural"], "title": "Weaving a Net is Better Than Praying for Fish", "description": ["Donna Bray at HarperCollins imprint Balzer + Bray has acquired at auction Ki-Wing Merlin's ", ", about a first-generation Chinese-American girl navigating school and classmates while concealing secrets from friends and family, who must learn to rely on others to catch the thief when her father's store is robbed."], "author": "Ki-Wing Merlin", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/30724132-geekerella", "num_ratings": "23,051", "num_reviews": "5,729", "avg_ratings": 4.06, "genres": ["Young Adult", "Contemporary", "Romance", "Retellings"], "title": "Geekerella", "description": ["Geek girl Elle Wittimer lives and breathes Starfield, the classic science-fiction series she grew up watching with her late father. So when she sees a cosplay contest for a new Starfield movie, she has to enter. The prize? An invitation to the ExcelsiCon Cosplay Ball and a meet-and-greet with the actor slated to play Federation Prince Carmindor in the reboot. With savings", "Geek girl Elle Wittimer lives and breathes Starfield, the classic science-fiction series she grew up watching with her late father. So when she sees a cosplay contest for a new Starfield movie, she has to enter. The prize? An invitation to the ExcelsiCon Cosplay Ball and a meet-and-greet with the actor slated to play Federation Prince Carmindor in the reboot. With savings from her gig at the Magic Pumpkin food truck and her dad's old costume, Elle's determined to win - unless her stepsisters get there first.", "Teen actor Darien Freeman used to live for cons - before he was famous. Now they're nothing but autographs and awkward meet-and-greets. Playing Carmindor is all he has ever wanted, but Starfield fandom has written him off as just another dumb heartthrob. As ExcelsiCon draws near, Darien feels more and more like a fake - until he meets a girl who shows him otherwise. But when she disappears at midnight, will he ever be able to find her again?", "Part-romance, part-love letter to nerd culture, and all totally adorbs, Geekerella is a fairy tale for anyone who believes in the magic of fandom."], "author": "Ashley Poston", "num_pages": "320", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2017)"], "places": ["Charleston, South Carolina", "Atlanta, Georgia"], "character_names": ["Elle Wittimer", "Darien Freeman", "Catherine", "Chloe", "Calliope Wittimer", "Gail Morgan O'Sullivan", "Sage"], "language": "English", "publish_date": "2017-04-04 00:00:00", "ISBN": "1594749477"},
{"url": "https://www.goodreads.com/book/show/1495474.Angelfish", "num_ratings": "184", "num_reviews": "13", "avg_ratings": 3.73, "genres": ["Realistic Fiction", "Childrens", "Juvenile", "Young Adult", "Fiction", "Childrens", "Fairy Tales", "Fairy Tale Retellings"], "title": "Angelfish", "description": ["Robin, a young ballet dancer who is half Chinese and half white, works in a fish store for Mr. Tsow, a brusque Chinese who accuses her of being a half-person and who harbors a bitter secret. Robin and her grandmother decide to help and end Mr. Tsow's nightmare."], "author": "Laurence Yep", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-06-25 00:00:00", "ISBN": "0399230416"},
{"url": "https://www.goodreads.com/book/show/588327.Throwaway_Daughter", "num_ratings": "477", "num_reviews": "50", "avg_ratings": 3.65, "genres": ["Young Adult", "Fiction", "Cultural", "China", "Cultural", "Canada", "Contemporary"], "title": "Throwaway Daughter", "description": ["A dramatic and moving YA novel by Ting-xing Ye, the internationally acclaimed author of ", ", working with her husband, William Bell, author of the award-winning novels for young adults ", ", ", ", and ", ".", ".", " tells the dramatic and moving story of Grace Dong-mei Parker, a typical Canadian teenager until the day she witness", "A dramatic and moving YA novel by Ting-xing Ye, the internationally acclaimed author of ", ", working with her husband, William Bell, author of the award-winning novels for young adults ", ", ", ", and ", ".", ".", " tells the dramatic and moving story of Grace Dong-mei Parker, a typical Canadian teenager until the day she witnesses the Tiananmen massacre on television. Horrified, she sets out to explore her Chinese ancestry, only to discover that she was one of the thousands of infant girls abandoned in China since the introduction of the one-child policy, strictly enforced by the Communist government. But Grace was one of the lucky ones, adopted as a baby by a loving Canadian couple.", "With the encouragement of her adoptive parents, she studies Chinese and travels back to China in search of her birth mother. She manages to locate the village where she was born, but at first no one is willing to help her. However, Grace never gives up and, finally, she is reunited with her birth mother, discovering through this emotional bond the truth of what happened to her almost twenty years before."], "author": "Ting-xing Ye", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-27 00:00:00", "ISBN": "0770429211"},
{"url": "https://www.goodreads.com/book/show/858315.F_Is_For_Fabuloso", "num_ratings": "34", "num_reviews": "1", "avg_ratings": 3.59, "genres": ["Cultural", "Childrens"], "title": "F Is For Fabuloso", "description": ["Seventh grader Jin-Ha finds her adjustment to life in America complicated by her mother's difficulty in learning to speak English."], "author": "Marie G. Lee", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-09-30 00:00:00", "ISBN": "038097648X"},
{"url": "https://www.goodreads.com/book/show/40616158-gift-of-the-fox", "num_ratings": "4", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "Gift of the Fox", "description": ["In the kingdom of Wanglong, slave girls work in the royal palace. Three girls - Tamie Beanson, Tiegan Brown and Liz Schettner - are close friends to each other. They serve as water-maids in the palace and occasionally do some other work. They all are from three different kingdoms and belonged to different classes.", "The three girls strive hard to live and survive and hope to", "In the kingdom of Wanglong, slave girls work in the royal palace. Three girls - Tamie Beanson, Tiegan Brown and Liz Schettner - are close friends to each other. They serve as water-maids in the palace and occasionally do some other work. They all are from three different kingdoms and belonged to different classes.", "The three girls strive hard to live and survive and hope to regain their lost freedom. But meanwhile, they get to contemplate the life of seven princes - the sons of Wang Ru - the emperor of Wanglong and the son of Wang Long, the founder of the empire. ", "The girls have fun watching the princes' lives, but Tamie has a crush on one of them, so the two friends are often teasing her. Tamie wishes to get closer to the prince she secretly admires - Wang Shao, the most mysterious of the seven. But as she is only a water-maid and a servant, she gets no chance to get closer to the boys. Furthermore, she is a woman, and women servants are regarded even lower than men. The men servants sometimes get to train together with the princes and even become their personal servants, aiding them in hunts and battles. ", "One day, Tamie rescues an injured fox from being captured by the princes, and Tiegan who is familiar with healing animals, helps her get the fox back to her feet. ", "Tamie is grieved that she is unable to reach her sweetheart, so she goes alone in the forest to lament, and dreams only if she were a boy. Once she makes this wish, her friend fox from before appears and breathes at her while she's still sleeping.", "Later when Tamie wakes up, she feels she has somehow changed... but everything gets clear when she crawls up to the river and looks into the water, just to discover what that 'change' actually is...", "She looks in the water, but it reflects a boy..."], "author": "Tamuna Tsertsvadze", "num_pages": "247", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-06-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7818683-five-flavors-of-dumb", "num_ratings": "9,474", "num_reviews": "1,074", "avg_ratings": 3.87, "genres": ["Young Adult", "Contemporary", "Music", "Realistic Fiction", "Romance", "Fiction"], "title": "Five Flavors of Dumb", "description": ["The Challenge: Piper has one month to get the rock band Dumb a paying gig.", " The Deal: If she does it, Piper will become the band's manager and get her share of the profits.", " The Catch: How can Piper possibly manage one egomaniacal pretty boy, one talentless piece of eye candy, one crush, one silent rocker, and one angry girl? And how can she do it when she's deaf?", " Piper can'", "The Challenge: Piper has one month to get the rock band Dumb a paying gig.", " The Deal: If she does it, Piper will become the band's manager and get her share of the profits.", " The Catch: How can Piper possibly manage one egomaniacal pretty boy, one talentless piece of eye candy, one crush, one silent rocker, and one angry girl? And how can she do it when she's deaf?", " Piper can't hear Dumb's music, but with growing self-confidence, a budding romance, and a new understanding of the decision her family made to buy a cochlear implant for her deaf baby sister, she discovers her own inner rock star and what it truly means to be a flavor of Dumb."], "author": "Antony John", "num_pages": "338", "awards": ["Schneider Family Book Award for Teen Book (2011)", "Lincoln Award Nominee (2014)", "Missouri Gateway Readers Award Nominee (2013)"], "places": ["Seattle, Washington", "Washington (the state)"], "character_names": [], "language": "English", "publish_date": "2010-11-11 00:00:00", "ISBN": "0803734336"},
{"url": "https://www.goodreads.com/book/show/26192915-outrun-the-moon", "num_ratings": "2,485", "num_reviews": "598", "avg_ratings": 4.0, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction"], "title": "Outrun the Moon", "description": ["San Francisco, 1906: Fifteen-year-old Mercy Wong is determined to break from the poverty in Chinatown, and an education at St. Clare’s School for Girls is her best hope. Although St. Clare’s is off-limits to all but the wealthiest white girls, Mercy gains admittance through a mix of cunning and a little bribery, only to discover that getting in was the easiest part. Not to", "San Francisco, 1906: Fifteen-year-old Mercy Wong is determined to break from the poverty in Chinatown, and an education at St. Clare’s School for Girls is her best hope. Although St. Clare’s is off-limits to all but the wealthiest white girls, Mercy gains admittance through a mix of cunning and a little bribery, only to discover that getting in was the easiest part. Not to be undone by a bunch of spoiled heiresses, Mercy stands strong—until disaster strikes.", "On April 18, a historic earthquake rocks San Francisco, destroying Mercy’s home and school. With martial law in effect, she is forced to wait with her classmates for their families in a temporary park encampment. Though fires might rage, and the city may be in shambles, Mercy can’t sit by while they wait for the army to bring help—she still has the “bossy” cheeks that mark her as someone who gets things done. But what can one teenage girl do to heal so many suffering in her broken city?"], "author": "Stacey  Lee", "num_pages": "391", "awards": [], "places": ["San Francisco, California"], "character_names": [], "language": "English", "publish_date": "2016-05-24 00:00:00", "ISBN": "0399175415"},
{"url": "https://www.goodreads.com/book/show/6353906-revenge-of-the-mooncake-vixen", "num_ratings": "500", "num_reviews": "83", "avg_ratings": 3.52, "genres": ["Fiction", "Short Stories", "Cultural", "China", "Novels", "Literary Fiction", "Feminism"], "title": "Revenge of the Mooncake Vixen", "description": [" ", "Raucous twin sisters Moonie and Mei Ling Wong are known as the “double happiness” Chinese food delivery girls. Each day they load up a “crappy donkey-van” and deliver Americanized (“bad”) Chinese food to homes throughout their southern California neighborhood. United in", " ", "Raucous twin sisters Moonie and Mei Ling Wong are known as the “double happiness” Chinese food delivery girls. Each day they load up a “crappy donkey-van” and deliver Americanized (“bad”) Chinese food to homes throughout their southern California neighborhood. United in their desire to blossom into somebodies, the Wong girls fearlessly assert their intellect and sexuality, even as they come of age under the care of their dominating, cleaver-wielding grandmother from Hong Kong. They transform themselves from food delivery girls into accomplished women, but along the way they wrestle with the influence and continuity of their Chinese heritage.", " Marilyn Chin’s prose waxes and wanes between satire and metaphorical lyric, referencing classical Chinese tales and ghost stories that are at turns sensual, lurid, hilarious, shocking, and surreal. ."], "author": "Marilyn Chin", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-21 00:00:00", "ISBN": "0393331458"},
{"url": "https://www.goodreads.com/book/show/25387133-up-from-the-sea", "num_ratings": "498", "num_reviews": "134", "avg_ratings": 3.99, "genres": ["Young Adult", "Poetry", "Historical", "Historical Fiction", "Realistic Fiction", "Cultural", "Japan", "Contemporary"], "title": "Up From the Sea", "description": [" ", "On that fateful day, Kai loses nearly everyone and everything he cares about in the storm. When he’s offered a trip to New York to meet kids whose lives were changed by 9/11, Kai realizes he also has a chance to look for his estranged American father. Visi", " ", "On that fateful day, Kai loses nearly everyone and everything he cares about in the storm. When he’s offered a trip to New York to meet kids whose lives were changed by 9/11, Kai realizes he also has a chance to look for his estranged American father. Visiting Ground Zero on its tenth anniversary, Kai learns that the only way to make something good come out of the disaster back home is to return there and help rebuild his town."], "author": "Leza Lowitz", "num_pages": "272", "awards": [], "places": ["Japan", "New York City, New York"], "character_names": [], "language": null, "publish_date": "2016-01-12 00:00:00", "ISBN": "0553534769"},
{"url": "https://www.goodreads.com/book/show/36375234-asashin", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 5.0, "genres": [], "title": "Asashin", "description": ["A story about a young villager girl, Cherrie Bloom, the only child of an old forester, who goes into a forbidden land - the Blood Forest - and gets captured by savage tribesmen known as the Asashins, who are famous for their mercilessness and bloodthirstiness throughout the lands.", "But there in the camp she meets a kind young prince, swordsman Chao Lin, and falls in love...", "T", "A story about a young villager girl, Cherrie Bloom, the only child of an old forester, who goes into a forbidden land - the Blood Forest - and gets captured by savage tribesmen known as the Asashins, who are famous for their mercilessness and bloodthirstiness throughout the lands.", "But there in the camp she meets a kind young prince, swordsman Chao Lin, and falls in love...", "Though their happiness is short-timed - a war starts between the young princes and the chief, and Chao and Cherrie get to be separated. Cherrie returns to her homeland, and soon forms a new family - she acquires a husband and has a son.", "However, the young woman cannot forget about her lost beloved, and dreams to someday reunite with him again...", "*NOTE* This story is written in a fantasy world, so no culture is directly involved. The Asashins resemble East Asian people (Japanese and Chinese) by their culture and language, however, the tribe is created purely out of fantasy."], "author": "Tamuna Tsertsvadze", "num_pages": "106", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22713341-zero-defect", "num_ratings": "192", "num_reviews": "22", "avg_ratings": 3.83, "genres": ["Romance", "Fiction", "Romance", "Romantic Suspense"], "title": "Zero Defect", "description": ["He is a young programmer, filled with vigor and hope. He has, the job he likes and the girl he is in love with. But his life turns on its head when his boss cheats him by claiming the ownership of his \"creation\" (an ingenuous software program).", "Suddenly, the girl, Ishikia, he loves, moves away, and he finds himself alone struggling against all the strangeness of the world.", "He is a young programmer, filled with vigor and hope. He has, the job he likes and the girl he is in love with. But his life turns on its head when his boss cheats him by claiming the ownership of his \"creation\" (an ingenuous software program).", "Suddenly, the girl, Ishikia, he loves, moves away, and he finds himself alone struggling against all the strangeness of the world. He realizes the life is far more complex than the ideals he believed in. He finds love again, but he fails to see it. He is too fixated with Ishika, while Ishika has decided to move but he is not willing to let go.", "He is blinded by his own rage and seeks revenge against those who wronged him, his only way to redemption. There are actions that can't be reversed, and there are secrets which will question the nature of reality itself. ", "What happens next upheavals everyone's life. Nothing is what it seems in this edge of the seat romantic thriller !"], "author": "Aarohan Atwal", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22402516-fish-out-of-water", "num_ratings": "252", "num_reviews": "79", "avg_ratings": 4.02, "genres": ["Young Adult", "Contemporary", "Romance", "Realistic Fiction"], "title": "Fish Out of Water", "description": ["Mika Arlington was supposed to spend the summer after her junior year shadowing her marine biologist parents at the Monterey Bay Aquarium, but when her estranged grandmother randomly shows up on the doorstep one day, those plans are derailed. Because Grandma Betty isn't here to play nice—she is cranky, intolerant of Mika's mixed-race-couple parents, and oh yeah she has Alz", "Mika Arlington was supposed to spend the summer after her junior year shadowing her marine biologist parents at the Monterey Bay Aquarium, but when her estranged grandmother randomly shows up on the doorstep one day, those plans are derailed. Because Grandma Betty isn't here to play nice—she is cranky, intolerant of Mika's mixed-race-couple parents, and oh yeah she has Alzheimer's and is out of money.  While Mika's family would rather not deal with Grandma Betty, they don't have much choice. And despite Mika's protests, she is roped into caring for a person that seems impossible to have compassion for. And if that wasn't hard enough, Mika must train the new guy at her pet shop job who wants to be anywhere else, and help a friend through her own family crisis. Something's gotta a give, but whichever ball Mika drops means losing someone she loves. Not exactly a recipe for Best Summer Ever—or is it?"], "author": "Natalie Whipple", "num_pages": "322", "awards": [], "places": [], "character_names": ["Mika Arlington"], "language": "English", "publish_date": "2015-02-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22302705-love-s-prey", "num_ratings": "66", "num_reviews": "19", "avg_ratings": 3.8, "genres": ["Romance", "Young Adult"], "title": "Love's Prey", "description": ["Xirena hasn't smiled in years. People whisper horrible things about her wherever she goes. She is so different from what her backwoods society expects of her. Then she meets Kai, the smoking hot seventeen-year-old next door. All the girls are swooning over him, but he is captivated by enigmatic Xirena.", "She can't deny the magnetic attraction between them, but when Kai falls", "Xirena hasn't smiled in years. People whisper horrible things about her wherever she goes. She is so different from what her backwoods society expects of her. Then she meets Kai, the smoking hot seventeen-year-old next door. All the girls are swooning over him, but he is captivated by enigmatic Xirena.", "She can't deny the magnetic attraction between them, but when Kai falls for her, she steels herself against him, not wanting to believe life can be different than the misery she has lived and envisions for her future. The prospect of trusting someone, of allowing them to enter her secret, innermost core, is unimaginable. But Kai won't give her up. He recognizes her as his kindred spirit and will go as far as one can go to prove his love for her. ", "This unforgettable tale of first love will capture your heart and leave your breathless. Read Xierna and Kai's love story now for a unique, unparalleled experience."], "author": "Meg Xuemei X", "num_pages": "201", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18629288-persimmon", "num_ratings": "9", "num_reviews": "7", "avg_ratings": 4.11, "genres": ["Cultural", "Young Adult"], "title": "Persimmon", "description": ["Immigrant from a small Korean fishing village, Kee, balances the study of Martial Arts, English, New York City Life and family dysfunction. First in a trilogy."], "author": "Doc Pruyne", "num_pages": "246", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-18 00:00:00", "ISBN": "1940022231"},
{"url": "https://www.goodreads.com/book/show/18105597-red-turban-white-horse", "num_ratings": "110", "num_reviews": "22", "avg_ratings": 4.27, "genres": ["Romance", "Young Adult"], "title": "Red Turban White Horse: My Sister's Hurricane Wedding", "description": ["Can a teenager plan a Big Fat Indian Wedding—in America?", "It’s been seven years since mom died— and dad’s raised Mini to know more about computers, calculus, and cars than desi weddings—but ever since Mini saw the jewelry mom left them she’s wanted her sister to have the wedding mom would have planned.", "Dad’s tech start-up means a shoestring budget, but Mini has her old Mini C", "Can a teenager plan a Big Fat Indian Wedding—in America?", "It’s been seven years since mom died— and dad’s raised Mini to know more about computers, calculus, and cars than desi weddings—but ever since Mini saw the jewelry mom left them she’s wanted her sister to have the wedding mom would have planned.", "Dad’s tech start-up means a shoestring budget, but Mini has her old Mini Cooper, her new driver’s license, her stellar sense of style, and two months of summer vacation to get it done. And she’s not letting the persistent, mysterious, and smoking hot Vir distract her, either. Flower garlands, decorations, catering, clothes, even a white wedding horse—everything is in place.", "But a monster hurricane is headed for Boston and it could blow the whole band, baja, and baraat away..."], "author": "Nandini Bajpai", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-07 00:00:00", "ISBN": "9351030032"},
{"url": "https://www.goodreads.com/book/show/17931571-the-leaving-of-things", "num_ratings": "2,396", "num_reviews": "247", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "India", "Contemporary", "Young Adult"], "title": "The Leaving of Things", "description": ["Vikram is not your model Indian-American teenager. Rebellious and adrift in late 1980s Wisconsin, he is resentful of his Indian roots and has no clue what he wants from his future—other than to escape his family’s life of endless moving and financial woes. But after a drunken weekend turns disastrous, Vikram’s outraged parents decide to pack up the family and return to Ind", "Vikram is not your model Indian-American teenager. Rebellious and adrift in late 1980s Wisconsin, he is resentful of his Indian roots and has no clue what he wants from his future—other than to escape his family’s life of endless moving and financial woes. But after a drunken weekend turns disastrous, Vikram’s outraged parents decide to pack up the family and return to India—permanently.", "So begins a profound journey of self-discovery as Vikram, struggling with loneliness, culture shock, and the chaos of daily Indian life, finds his creativity awakened by a new romance and an old camera. His artistic gifts bring him closer to a place and family he barely knew. But a devastating family crisis challenges Vikram’s sense of his destiny, hurtling him toward a crossroads where he must make the fateful choice between India, the land of his soul, and America, the land of his heart."], "author": "Jay Antani", "num_pages": "368", "awards": ["Kindle Book Award for Literary Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-16 00:00:00", "ISBN": "0988419300"},
{"url": "https://www.goodreads.com/book/show/7210530-growing-up-filipino-ii", "num_ratings": "13", "num_reviews": "3", "avg_ratings": 4.15, "genres": ["Fiction"], "title": "Growing Up Filipino II: More Stories for Young Adults", "description": ["Growing Up Filipino II: More Stories for Young Adults is the second volume of the Growing Up Filipino series by PALH. In this collection of 27 short stories, Filipino and Filipino American writers explore the universal challenges and experiences of Filipino teens after the historic events of 9/11. The modern demands do not hinder Filipino youth from dealing with the univer", "Growing Up Filipino II: More Stories for Young Adults is the second volume of the Growing Up Filipino series by PALH. In this collection of 27 short stories, Filipino and Filipino American writers explore the universal challenges and experiences of Filipino teens after the historic events of 9/11. The modern demands do not hinder Filipino youth from dealing with the universal concerns of growing up: family, friends, love, home, budding sexuality, leaving home. The delightful stories are written by well known as well as emerging writers. While the target audience of this fine anthology is young adults, the stories can be enjoyed by adult readers as well. There is a scarcity of Filipino American literature and this book is a welcome addition."], "author": "Cecilia Manguerra Brainard", "num_pages": "257", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-15 00:00:00", "ISBN": "0971945829"},
{"url": "https://www.goodreads.com/book/show/7692857-crossing", "num_ratings": "1,173", "num_reviews": "263", "avg_ratings": 3.4, "genres": ["Young Adult", "Fiction", "Mystery", "Thriller", "Thriller", "Mystery Thriller"], "title": "Crossing", "description": ["A loner in his all-white high school, Chinese-born Xing (pronounced “Shing”) is a wallflower longing for acceptance. His isolation is intensified by his increasingly awkward and undeniable crush on his only friend, the beautiful and brilliant Naomi Lee. Xing’s quiet adolescent existence is rattled when a series of disappearances rock his high school and fear ripples throug", "A loner in his all-white high school, Chinese-born Xing (pronounced “Shing”) is a wallflower longing for acceptance. His isolation is intensified by his increasingly awkward and undeniable crush on his only friend, the beautiful and brilliant Naomi Lee. Xing’s quiet adolescent existence is rattled when a series of disappearances rock his high school and fear ripples through the blue collar community in which he lives. Amidst the chaos surrounding him, only Xing, alone on the sidelines of life, takes notice of some peculiar sightings around town. He begins to investigate with the hope that if he can help put an end to the disappearances, he will finally win the acceptance for which he has longed. However, as Xing draws closer to unveiling the identity of the abductor, he senses a noose of suspicion tightening around his own neck. While Xing races to solve the mystery and clear his name, Crossing hurtles readers towards a chilling climax."], "author": "Andrew Xia Fukuda", "num_pages": "213", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "1935597035"},
{"url": "https://www.goodreads.com/book/show/3559996-shine-coconut-moon", "num_ratings": "421", "num_reviews": "92", "avg_ratings": 3.64, "genres": ["Young Adult", "Contemporary", "Cultural", "Fiction", "Realistic Fiction", "Religion", "Young Adult", "Teen"], "title": "Shine, Coconut Moon", "description": ["Seventeen-year-old Samar -- a.k.a. Sam -- has never known much about her Indian heritage. Her mom has deliberately kept Sam away from her old-fashioned family. It's never bothered Sam, who is busy with school, friends, and a really cute but demanding boyfriend.But things change after 9/11. A guy in a turban shows up at Sam's house, and he turns out to be her uncle. He want", "Seventeen-year-old Samar -- a.k.a. Sam -- has never known much about her Indian heritage. Her mom has deliberately kept Sam away from her old-fashioned family. It's never bothered Sam, who is busy with school, friends, and a really cute but demanding boyfriend.But things change after 9/11. A guy in a turban shows up at Sam's house, and he turns out to be her uncle. He wants to reconcile the family and teach Sam about her Sikh heritage. Sam isn't sure what to do, until a girl at school calls her a coconut -- brown on the outside, white on the inside. That decides it: Why shouldn't Sam get to know her family? What is her mom so afraid of? Then some boys attack her uncle, shouting, \"Go back home, Osama!\" and Sam realizes she could be in danger -- and also discovers how dangerous ignorance can be. Sam will need all her smarts and savvy to try to bridge two worlds and make them both her own."], "author": "Neesha Meminger", "num_pages": "256", "awards": [], "places": ["Linton, New Jersey"], "character_names": ["Samar Ahluwahlia", "Sharanjit Ahluwahlia", "Sandeep Ahluwahlia", "Molly MacFadden", "Mike Brezinsky"], "language": "English", "publish_date": "2009-03-10 00:00:00", "ISBN": "1416954953"},
{"url": "https://www.goodreads.com/book/show/7788379-shooting-kabul", "num_ratings": "3,899", "num_reviews": "749", "avg_ratings": 3.92, "genres": ["Historical", "Historical Fiction", "Young Adult", "Realistic Fiction", "Fiction", "Childrens", "Middle Grade", "Cultural"], "title": "Shooting Kabul", "description": ["In the summer of 2001, twelve-year-old Fadi's parents make the difficult decision to illegally leave Afghanistan and move the family to the United States. When their underground transport arrives at the rendezvous point, chaos ensues, and Fadi is left dragging his younger sister Mariam through the crush of people. But Mariam accidentally lets go of his hand and becomes los", "In the summer of 2001, twelve-year-old Fadi's parents make the difficult decision to illegally leave Afghanistan and move the family to the United States. When their underground transport arrives at the rendezvous point, chaos ensues, and Fadi is left dragging his younger sister Mariam through the crush of people. But Mariam accidentally lets go of his hand and becomes lost in the crowd, just as Fadi is snatched up into the truck. With Taliban soldiers closing in, the truck speeds away, leaving Mariam behind. "], "author": "N.H. Senzai", "num_pages": "272", "awards": ["Asian/Pacific American Award for Literature for Young Adult (2010)", "Rebecca Caudill Young Readers' Book Award Nominee (2013)"], "places": ["Kabul"], "character_names": [], "language": "English", "publish_date": "2010-06-22 00:00:00", "ISBN": "144240194X"},
{"url": "https://www.goodreads.com/book/show/925826.Re_Gifters", "num_ratings": "2,349", "num_reviews": "217", "avg_ratings": 3.62, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Fiction", "Romance", "Young Adult", "Teen"], "title": "Re-Gifters", "description": ["Jen Dik Seong, aka Dixie, is dirt poor and living on the ragged edge of LA's Koreatown. Her only outlet is the ancient martial art of hapkido, and she's on the verge of winning a championship--until she falls for surfer boy Adam. Older teens."], "author": "Mike Carey", "num_pages": "174", "awards": [], "places": ["Los Angeles, California"], "character_names": ["Jen Dik Seong"], "language": "English", "publish_date": "2007-06-06 00:00:00", "ISBN": "140120371X"},
{"url": "https://www.goodreads.com/book/show/8847930-dogtag-summer", "num_ratings": "206", "num_reviews": "53", "avg_ratings": 3.71, "genres": ["Historical", "Historical Fiction", "Childrens", "Middle Grade", "Parenting", "Adoption", "Family", "Childrens", "War"], "title": "Dogtag Summer", "description": ["Twelve-year-old Tracy-or Tuyet-has always felt different. The villagers in Vietnam called her con-lai, or \"half-breed,\" because her father was an American GI. And she doesn't fit in with her adoptive family in California, either. But when Tracy and a friend discover a soldier's dogtag hidden among her father's things, it sets her past and her present on a collision course.", "Twelve-year-old Tracy-or Tuyet-has always felt different. The villagers in Vietnam called her con-lai, or \"half-breed,\" because her father was an American GI. And she doesn't fit in with her adoptive family in California, either. But when Tracy and a friend discover a soldier's dogtag hidden among her father's things, it sets her past and her present on a collision course. Where should her broken heart come to rest? In a time and place she remembers only in her dreams? Or among the people she now calls family? Partridge's sensitive portrayal of a girl and her family grappling with the complicated legacy of war is as timely today as the events were decades ago."], "author": "Elizabeth Partridge", "num_pages": "240", "awards": ["California Young Readers Medal for Middle School/Junior High (2016)"], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2011-03-15 00:00:00", "ISBN": "1599901838"},
{"url": "https://www.goodreads.com/book/show/1713239.The_Star_Fisher", "num_ratings": "394", "num_reviews": "45", "avg_ratings": 3.77, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Cultural", "Childrens"], "title": "The Star Fisher", "description": ["\"This poignant, gently humorous novel is about prejudice and acceptance....15-year-old Joan Lee is a child of two worlds. As a Chinese American, she has never felt her separateness more than now, in 1927, in this new place in West Virginia. Only Miss Lucy, their landlord and neighbor, seems welcoming....There's nothing coy about Yep's portrait of prejudice, which he sketch", "\"This poignant, gently humorous novel is about prejudice and acceptance....15-year-old Joan Lee is a child of two worlds. As a Chinese American, she has never felt her separateness more than now, in 1927, in this new place in West Virginia. Only Miss Lucy, their landlord and neighbor, seems welcoming....There's nothing coy about Yep's portrait of prejudice, which he sketches from several angles.\"--Booklist. \"A pleasure to read, entertaining its audience even as it educates their hearts.\"--Horn Book."], "author": "Laurence Yep", "num_pages": "160", "awards": [], "places": ["West Virginia"], "character_names": [], "language": "English", "publish_date": "1991-05-20 00:00:00", "ISBN": "0688093655"},
{"url": "https://www.goodreads.com/book/show/16173250-gilded", "num_ratings": "4,010", "num_reviews": "587", "avg_ratings": 3.46, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Fantasy", "Urban Fantasy", "Romance"], "title": "Gilded", "description": ["Sixteen-year-old Jae Hwa Lee is a Korean-American girl with a black belt, a deadly proclivity with steel-tipped arrows, and a chip on her shoulder the size of Korea itself. When her widowed dad uproots her to Seoul from her home in L.A., Jae thinks her biggest challenges will be fitting in to a new school and dealing with her dismissive Korean grandfather. Then she discove", "Sixteen-year-old Jae Hwa Lee is a Korean-American girl with a black belt, a deadly proclivity with steel-tipped arrows, and a chip on her shoulder the size of Korea itself. When her widowed dad uproots her to Seoul from her home in L.A., Jae thinks her biggest challenges will be fitting in to a new school and dealing with her dismissive Korean grandfather. Then she discovers that a Korean demi-god, Haemosu, has been stealing the soul of the oldest daughter of each generation in her family for centuries. And she's next.", "But that’s not Jae’s only problem.", "There's also Marc. Irresistible and charming, Marc threatens to break the barriers around Jae's heart. As the two grow closer, Jae must decide if she can trust him. But Marc has a secret of his own—one that could help Jae overturn the curse on her family for good. It turns out that Jae's been wrong about a lot of things: her grandfather is her greatest ally, even the tough girl can fall in love, and Korea might just be the home she's always been looking for."], "author": "Christina  Farley", "num_pages": "352", "awards": [], "places": ["South Korea"], "character_names": ["Jae Hwa Lee", "Haemosu", "Marc Grayson", "Michelle Myong"], "language": "English", "publish_date": "2014-03-01 00:00:00", "ISBN": "1477847014"},
{"url": "https://www.goodreads.com/book/show/17847318-the-girl-from-the-well", "num_ratings": "5,521", "num_reviews": "1,147", "avg_ratings": 3.77, "genres": ["Horror", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Paranormal", "Ghosts", "Mystery"], "title": "The Girl from the Well", "description": [" ", "A dead girl walks the streets.", "She hunts murderers. Child killers, much like the man who threw her body down a well three hundred years ago.", "And when a s", " ", "A dead girl walks the streets.", "She hunts murderers. Child killers, much like the man who threw her body down a well three hundred years ago.", "And when a strange boy bearing stranger tattoos moves into the neighborhood so, she discovers, does something else. And soon both will be drawn into the world of eerie doll rituals and dark Shinto exorcisms that will take them from American suburbia to the remote valleys and shrines of Aomori, Japan.", "Because the boy has a terrifying secret - one that would just ", " to get out. ", " is A YA Horror novel pitched as \"Dexter\" meets \"The Grudge\", based on a well-loved Japanese ghost story."], "author": "Rin Chupeco", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23546843-ms-marvel-vol-3", "num_ratings": "15,681", "num_reviews": "1,256", "avg_ratings": 4.2, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Young Adult", "Comics", "Superheroes", "Superheroes", "Marvel", "Graphic Novels Comics", "Fiction"], "title": "Ms. Marvel, Vol. 3: Crushed", "description": ["Love is in the air in Jersey City as Valentine’s Day arrives! Kamala Khan may not be allowed to go to the school dance, but Ms. Marvel is! Well sort of--by crashing it in an attempt to capture Asgard’s most annoying trickster! Yup, it’s a special Valentine’s Day story featuring Marvel’s favorite charlatan, Loki! And", "Love is in the air in Jersey City as Valentine’s Day arrives! Kamala Khan may not be allowed to go to the school dance, but Ms. Marvel is! Well sort of--by crashing it in an attempt to capture Asgard’s most annoying trickster! Yup, it’s a special Valentine’s Day story featuring Marvel’s favorite charlatan, Loki! And when a mysterious stranger arrives in Jersey City, Ms. Marvel must deal with...a crush! Because this new kid is really, really cute. What are these feelings, Kamala Khan? Prepare for drama! Intrigue! Romance! Suspense! Punching things! All this and more! The fan-favorite, critically acclaimed, amazing new series continues as Kamala Khan proves why she’s the best (and most adorable) new super hero there is! Plus, see what happens when S.H.I.E.L.D. agent Jemma Simmons goes undercover at Kamala’s school!", "Collecting ", " and ", "."], "author": "G. Willow Wilson", "num_pages": "112", "awards": [], "places": ["Jersey City, New Jersey"], "character_names": ["Loki (Marvel)", "Medusalith Amaquelin Boltagon", "Kamran Akmal", "Kamala Khan", "Zoe Zimmer", "Bruno Carrelli", "Lineage", "Nakia Badahir", "Yusuf Khan", "Muneeba Khan", "Aamir Khan", "Vittorio \"Vick\" Carrelli", "Kaboom", "Phil Coulson", "Jemma Simmons", "Lockjaw (Marvel)"], "language": "English", "publish_date": "2015-06-23 00:00:00", "ISBN": "0785192271"},
{"url": "https://www.goodreads.com/book/show/25284.Ribbons", "num_ratings": "264", "num_reviews": "26", "avg_ratings": 3.75, "genres": ["Young Adult", "Childrens", "Fiction"], "title": "Ribbons", "description": ["But no one's asking Robin. Not her parents, who can no longer afford ballet lessons because all of their money is going toward bringing Robin's Chinese grandmother to America. Not her grandmother, a demanding woman who can barely walk. And now, Robin is even losing touch with her ballet friends, who are", "But no one's asking Robin. Not her parents, who can no longer afford ballet lessons because all of their money is going toward bringing Robin's Chinese grandmother to America. Not her grandmother, a demanding woman who can barely walk. And now, Robin is even losing touch with her ballet friends, who are moving on without her. It's hard for Robin to hide her resentment of this foreign grandmother who's changed her whole life. Then Robin uncovers a secret that leads to a new understanding of the many ways in which she and her tough old grandmother are alike.", "\"Kids who appreciate a story about fighting for one's dream will enjoy Robin's saga.\"--"], "author": "Laurence Yep", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-10-13 00:00:00", "ISBN": "0698116062"},
{"url": "https://www.goodreads.com/book/show/165149.Year_of_Impossible_Goodbyes", "num_ratings": "1,879", "num_reviews": "198", "avg_ratings": 3.82, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "War"], "title": "Year of Impossible Goodbyes", "description": ["It is 1945, and courageous ten-year-old Sookan and her family must endure the cruelties of the Japanese military occupying Korea.  Police captain Narita does his best to destroy everything of value to the family, but he cannot break their spirit.  Sookan's father is with the resistance movement in Manchuria and her older brothers have been sent away to labor camps.  Her mo", "It is 1945, and courageous ten-year-old Sookan and her family must endure the cruelties of the Japanese military occupying Korea.  Police captain Narita does his best to destroy everything of value to the family, but he cannot break their spirit.  Sookan's father is with the resistance movement in Manchuria and her older brothers have been sent away to labor camps.  Her mother is forced to supervise a sock factory and Sookan herself must wear a uniform and attend a Japanese school.", "Then the war ends.  Out come the colorful Korean silks and bags of white rice.  But Communist Russian troops have taken control of North Korea and once again the family is suppressed.  Sookan and her family know their only hope for freedom lies in a dangerous escape to Americancontrolled South Korea.", "Here is the incredible story of one family's love for each other and their determination to risk everything to find freedom."], "author": "Sook Nyul Choi", "num_pages": "176", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (1993)", "Judy Lopez Memorial Award for Children's Literature (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "1993-01-01 00:00:00", "ISBN": "0440407591"},
{"url": "https://www.goodreads.com/book/show/13414446-prodigy", "num_ratings": "175,528", "num_reviews": "13,725", "avg_ratings": 4.28, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Romance"], "title": "Prodigy", "description": ["Injured and on the run, it has been seven days since June and Day barely escaped Los Angeles and the Republic with their lives. Day is believed dead having lost his own brother to an execution squad who thought they were assassinating him. June is now the Republic's most wanted traitor. Desperate for help, they turn to the Patriots - a vigilante rebel group sworn to bring", "Injured and on the run, it has been seven days since June and Day barely escaped Los Angeles and the Republic with their lives. Day is believed dead having lost his own brother to an execution squad who thought they were assassinating him. June is now the Republic's most wanted traitor. Desperate for help, they turn to the Patriots - a vigilante rebel group sworn to bring down the Republic. But can they trust them or have they unwittingly become pawns in the most terrifying of political games?"], "author": "Marie Lu", "num_pages": "371", "awards": [], "places": ["Nevada"], "character_names": ["June Iparis", "Daniel Altan Wing"], "language": "English", "publish_date": "2013-01-29 00:00:00", "ISBN": "0399256768"},
{"url": "https://www.goodreads.com/book/show/590216.Mismatch", "num_ratings": "335", "num_reviews": "72", "avg_ratings": 3.39, "genres": ["Young Adult", "Romance", "Fiction", "Contemporary", "Cultural", "China", "Young Adult", "Teen", "Realistic Fiction"], "title": "Mismatch", "description": ["Sue Hua just moved from racially diverse Seattle to a suburban white-bread town where she feels like the only Asian American for miles. Then she meets Andy, a handsome and passionate violin player who happens to be Asian American. Sue feels an instant attraction to Andy, and her white friends think they’re “made for each other”–after all, they both use chopsticks and eat a", "Sue Hua just moved from racially diverse Seattle to a suburban white-bread town where she feels like the only Asian American for miles. Then she meets Andy, a handsome and passionate violin player who happens to be Asian American. Sue feels an instant attraction to Andy, and her white friends think they’re “made for each other”–after all, they both use chopsticks and eat a lot of rice, right? But there’s just one problem. Andy’s last name is Suzuki. And while that may mean nothing to the other students at Lakeview High, Sue knows that it presents a world of problems to her family."], "author": "Lensey Namioka", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-12-18 00:00:00", "ISBN": "044023879X"},
{"url": "https://www.goodreads.com/book/show/20898019-ms-marvel-vol-1", "num_ratings": "70,177", "num_reviews": "4,927", "avg_ratings": 4.12, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Young Adult", "Comics", "Superheroes", "Fiction"], "title": "Ms. Marvel, Vol. 1: No Normal", "description": [" ", "Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of", " ", "Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of her newfound powers, she unlocks a secret behind them, as well. Is Kamala ready to wield these immense new gifts? Or will the weight of the legacy before her be too much to bear? Kamala has no idea, either. But she's comin' for you, Jersey! ", "It's history in the making from acclaimed writer G. Willow Wilson (Air, Cairo) and beloved artist Adrian Alphona (RUNAWAYS)! Collecting MS. MARVEL (2014) #1-5 and material from ALL-NEW MARVEL NOW! POINT ONE #1."], "author": "G. Willow Wilson", "num_pages": "120", "awards": ["Hugo Award for Best Graphic Story (2015)", "Harvey Awards Nominee for Best New Series, Best Writer (for G. Willow Wilson) (2015)", "Lincoln Award Nominee (2019)", "Will Eisner Comic Industry Awards Nominee for Best New Series, Best Writer (for G. Willow Wilson), Best Penciller/Inker (for Adrian Alphona), Best Lettering (for Joe Caramagna), Best Cover Artist (for Jamie McKelvie & Matthew Wilson) (2015)", "Goodreads Choice Award Nominee for Graphic Novels & Comics (2014)"], "places": ["Jersey City, New Jersey"], "character_names": ["Steve Rogers", "Carol Danvers", "Kamala Khan", "Tony Stark", "Zoe Zimmer", "Chatty Bob", "Sheik Abdullah", "Doyle", "Thomas Edison (clone)", "Knox", "Bruno Carrelli", "Nakia Badahir", "Yusuf Khan", "Muneeba Khan", "Aamir Khan", "Vittorio \"Vick\" Carrelli", "Josh Richardson"], "language": "English", "publish_date": "2014-10-30 00:00:00", "ISBN": "078519021X"},
{"url": "https://www.goodreads.com/book/show/10137468-silver-phoenix", "num_ratings": "3,256", "num_reviews": "524", "avg_ratings": 3.57, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Romance"], "title": "Silver Phoenix", "description": ["No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters.", "But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that he", "No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters.", "But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that her journey to the Palace of Fragrant Dreams isn't only a quest to find her beloved father but a venture with stakes larger than she could have imagined.", "Bravery, intelligence, the will to fight and fight hard . . . she will need all of these things. Just as she will need the new and mysterious power growing within her. She will also need help.", "It is Chen Yong who finds her partly submerged and barely breathing at the edge of a deep lake. There is something of unspeakable evil trying to drag her under. On a quest of his own, Chen Yong offers that help . . . and perhaps more."], "author": "Cindy Pon", "num_pages": "368", "awards": [], "places": [], "character_names": ["Ai Ling"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0061910643"},
{"url": "https://www.goodreads.com/book/show/14290364-champion", "num_ratings": "139,656", "num_reviews": "13,768", "avg_ratings": 4.36, "genres": ["Science Fiction", "Dystopia", "Young Adult", "Romance"], "title": "Champion", "description": [" ", "June and Day have sacrificed so much for the people of the Republic—and each other—and now their country is on the brink of a new existence. June is back in the good graces of the Republic, working within the government’s elite circles as Princeps-Elect, while Day has been assigned a high-level military position. ", "But ne", " ", "June and Day have sacrificed so much for the people of the Republic—and each other—and now their country is on the brink of a new existence. June is back in the good graces of the Republic, working within the government’s elite circles as Princeps-Elect, while Day has been assigned a high-level military position. ", "But neither could have predicted the circumstances that will reunite them: just when a peace treaty is imminent, a plague outbreak causes panic in the Colonies, and war threatens the Republic’s border cities. This new strain of plague is deadlier than ever, and June is the only one who knows the key to her country’s defense. But saving the lives of thousands will mean asking the one she loves to give up everything. ", "With heart-pounding action and suspense, Marie Lu’s bestselling trilogy draws to a stunning conclusion."], "author": "Marie Lu", "num_pages": "369", "awards": [], "places": [], "character_names": ["June Iparis", "Daniel Altan Wing"], "language": "English", "publish_date": "2013-11-05 00:00:00", "ISBN": "0399256776"},
{"url": "https://www.goodreads.com/book/show/10841844-dumpling-days", "num_ratings": "1,703", "num_reviews": "227", "avg_ratings": 4.17, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Fiction", "Family", "Childrens", "Childrens", "Chapter Books"], "title": "Dumpling Days", "description": [".", "Pacy is back! The beloved heroine of ", " and", " has returned in a brand new story. This summer, Pacy's family is going to Taiwan for an entire month to visit family and prepare for their grandmother's 60th birthday celebration. Pacy's parents have signed her up for a Chinese painting clas", ".", "Pacy is back! The beloved heroine of ", " and", " has returned in a brand new story. This summer, Pacy's family is going to Taiwan for an entire month to visit family and prepare for their grandmother's 60th birthday celebration. Pacy's parents have signed her up for a Chinese painting class, and at first she's excited. This is a new way to explore her art talent! But everything about the trip is harder than she thought it would be--she looks like everyone else but can't speak the language, she has trouble following the art teacher's instructions, and it's difficult to make friends in her class. At least the dumplings are delicious...", "As the month passes by, Pacy eats chicken feet (by accident!), gets blessed by a fortune teller, searches for her true identity, and grows closer to those who matter most."], "author": "Grace Lin", "num_pages": "261", "awards": [], "places": ["Taiwan"], "character_names": [], "language": "English", "publish_date": "2012-01-02 00:00:00", "ISBN": "0316125903"},
{"url": "https://www.goodreads.com/book/show/12127810-the-house-of-hades", "num_ratings": "201,779", "num_reviews": "12,842", "avg_ratings": 4.55, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The House of Hades", "description": [" She and the remaining crew of the ", " could return home with the Athena Parthenos statue and try to stop Camp Half-Blood and Camp Jupiter from going to war. Or they could continue their quest to find the House of Hades, where they might be able to open the Doors of Death, rescue their friends Percy and Annabeth from Tartarus, and prevent m", " She and the remaining crew of the ", " could return home with the Athena Parthenos statue and try to stop Camp Half-Blood and Camp Jupiter from going to war. Or they could continue their quest to find the House of Hades, where they might be able to open the Doors of Death, rescue their friends Percy and Annabeth from Tartarus, and prevent monsters from being reincarnated in the mortal world. Whichever road they decide to take, they have to hurry, because time is running out. Gaea, the bloodthirsty Earth Mother, has set the date of August 1 for her rise to power.", " How will the two of them make it through Tartarus? Starving, thirsty, and in pain, they are barely able to stumble on in the dark and poisonous landscape that holds new horrors at every turn. They have no way of locating the Doors of Death. Even if they did, a legion of Gaea's strongest monsters guards the Doors on the Tartarus side. Annabeth and Percy can't exactly launch a frontal assault.", "Despite the terrible odds, Hazel, Annabeth, Percy, and the other demigods of the prophecy know that there is only one choice: to attempt the impossible. Not just for themselves, but for everyone they love. Even though love can be the riskiest choice of all.", "Join the demigods as they face their biggest challenges yet in ", ", the hair-raising penultimate book in the best-selling Heroes of Olympus series."], "author": "Rick Riordan", "num_pages": "597", "awards": ["Goodreads Choice Award for Middle Grade & Children's (2013)"], "places": ["Rome", "Venice", "Split", "Bologna", "Valletta", "Epirus"], "character_names": ["Nico di Angelo", "Hades", "Hazel Levesque", "Annabeth Chase", "Percy Jackson", "Leo Valdez", "Jason Grace", "Piper McLean", "Frank Zhang"], "language": "English", "publish_date": "2013-10-08 00:00:00", "ISBN": "1423146727"},
{"url": "https://www.goodreads.com/book/show/13581990-the-eternity-cure", "num_ratings": "32,573", "num_reviews": "3,185", "avg_ratings": 4.24, "genres": ["Paranormal", "Vampires", "Fantasy", "Paranormal", "Science Fiction", "Dystopia", "Fantasy", "Young Adult"], "title": "The Eternity Cure", "description": ["In Allison Sekemoto's world, there is one rule left: Blood calls to blood ", "She has done the unthinkable: died so that she might continue to live. Cast out of Eden and separated from the boy she dared to love, Allie will follow the call of blood to save her creator, Kanin, from the psychotic vampire Sarren. But when the trail leads to Allie's birthplace in New Covington, wha", "In Allison Sekemoto's world, there is one rule left: Blood calls to blood ", "She has done the unthinkable: died so that she might continue to live. Cast out of Eden and separated from the boy she dared to love, Allie will follow the call of blood to save her creator, Kanin, from the psychotic vampire Sarren. But when the trail leads to Allie's birthplace in New Covington, what Allie finds there will change the world forever—and possibly end human and vampire existence. ", "There's a new plague on the rise, a strain of the Red Lung virus that wiped out most of humanity generations ago—and this strain is deadly to humans and vampires alike. The only hope for a cure lies in the secrets Kanin carries, if Allie can get to him in time. ", "Allison thought that immortality was forever. But now, with eternity itself hanging in the balance, the lines between human and monster will blur even further, and Allie must face another choice she could never have imagined having to make."], "author": "Julie Kagawa", "num_pages": "434", "awards": [], "places": [], "character_names": ["Allison Sekemoto", "Stick", "Kanin", "Jackal", "Zeke Crosse"], "language": "English", "publish_date": "2013-04-30 00:00:00", "ISBN": "0373210698"},
{"url": "https://www.goodreads.com/book/show/17348906-jet-black-and-the-ninja-wind", "num_ratings": "149", "num_reviews": "47", "avg_ratings": 3.6, "genres": ["Young Adult", "Fantasy", "Adventure", "Cultural", "Japan", "Thriller", "Action"], "title": "Jet Black and the Ninja Wind", "description": ["Seventeen-year-old Jet Black is a ninja. There's only one problem--she doesn't know it. Others do, however, and they're scheming to capture her and uncover her secrets. When her mother dies, Jet knows only that she must go to Japan to protect a family treasure hidden in her ancestral land. She's terrified, but if Jet won't fight to protect her world, who will? Stalked by b", "Seventeen-year-old Jet Black is a ninja. There's only one problem--she doesn't know it. Others do, however, and they're scheming to capture her and uncover her secrets. When her mother dies, Jet knows only that she must go to Japan to protect a family treasure hidden in her ancestral land. She's terrified, but if Jet won't fight to protect her world, who will? Stalked by bounty hunters and desperately in love with the man who's been sent to kill her, Jet must be strong enough to protect the treasure, preserve an ancient culture, and save a sacred mountain from destruction. In ", ", multiple award-winning author, poet, and translator team Leza Lowitz and Shogo Oketani make their first foray into young adult fiction with a compulsively readable tale whose teenage heroine must discover if she can put the blade above the heart--or die trying."], "author": "Leza Lowitz", "num_pages": "320", "awards": ["Asian/Pacific American Award for Literature for Young Adult (2013)"], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "2013-10-29 00:00:00", "ISBN": "480531284X"},
{"url": "https://www.goodreads.com/book/show/2322339.Emiko_Superstar", "num_ratings": "1,284", "num_reviews": "146", "avg_ratings": 3.66, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Fiction", "Young Adult", "Teen", "Realistic Fiction"], "title": "Emiko Superstar", "description": ["A borrowed diary, a double life, and identity issues fuel a teenager's quest to find herself before she cracks and commits social suicide, in this new series written especially for girls. Young adult."], "author": "Mariko Tamaki", "num_pages": "176", "awards": ["Cybils Award for Young Adult Graphic Novel (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-10-14 00:00:00", "ISBN": "140121536X"},
{"url": "https://www.goodreads.com/book/show/16043238-gadget-girl", "num_ratings": "142", "num_reviews": "60", "avg_ratings": 3.86, "genres": ["Young Adult", "Contemporary", "Fiction", "Cultural", "Japan", "Sequential Art", "Graphic Novels"], "title": "Gadget Girl: The Art of Being Invisible", "description": ["Aiko Cassidy is fourteen and lives with her sculptor mother in a small Midwestern town. For most of her young life Aiko, who has cerebral palsy, has been her mother's muse. But now, she no longer wants to pose for the sculptures that have made her mother famous and have put food on the table. Aiko works hard on her own dream of becoming a great manga artist with a secret i", "Aiko Cassidy is fourteen and lives with her sculptor mother in a small Midwestern town. For most of her young life Aiko, who has cerebral palsy, has been her mother's muse. But now, she no longer wants to pose for the sculptures that have made her mother famous and have put food on the table. Aiko works hard on her own dream of becoming a great manga artist with a secret identity. ", "When Aiko's mother invites her to Paris for a major exhibition of her work, Aiko at first resists. She'd much rather go to Japan, Manga Capital of the World, where she might be able to finally meet her father, the indigo farmer. When she gets to France, however, a hot waiter with a passion for manga and an interest in Aiko makes her wonder if being invisible is such a great thing after all. And a side trip to Lourdes, ridiculous as it seems to her, might just change her life. ", "began as a novella published in ", ". The story won the SCBWI Magazine Merit Award in Fiction and was included in an anthology of the best stories published in ", " over the past ten years. "], "author": "Suzanne Kamata", "num_pages": "256", "awards": ["Paris Book Festival for Grand Prize (0)", "Next Generation Indie Book Awards Nominee for Young Adult (2013)", "International Book Awards", "Asian/Pacific American Award for Literature for Young Adult Honor (2013)", "Best Children's Books of the Year (Bank Street College of Education)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-17 00:00:00", "ISBN": "1936846381"},
{"url": "https://www.goodreads.com/book/show/495411.Necessary_Roughness", "num_ratings": "257", "num_reviews": "47", "avg_ratings": 3.71, "genres": ["Young Adult", "Sports and Games", "Sports", "Fiction", "Football"], "title": "Necessary Roughness", "description": ["Chan Kim has never felt like an outsider in his life. That is, not until his family moves from L.A. to a tiny town in Minnesota--Land of 10,000 Lakes--and probably 10,000 hicks,too. The Kims are the only Asian family in town, and when Chan and his twin sister, Young, attend high school, it's a blond-haired, blue-eyed whiteout.Chan throws himself into the only game in town-", "Chan Kim has never felt like an outsider in his life. That is, not until his family moves from L.A. to a tiny town in Minnesota--Land of 10,000 Lakes--and probably 10,000 hicks,too. The Kims are the only Asian family in town, and when Chan and his twin sister, Young, attend high school, it's a blond-haired, blue-eyed whiteout.Chan throws himself into the only game in town--football--and the necessary roughness required to make a player. On the field it means \"justifiable violence,\" but as Chan is about to discover, off the field it's a whole different ballgame."], "author": "Marie G. Lee", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-01-03 00:00:00", "ISBN": "0064471691"},
{"url": "https://www.goodreads.com/book/show/529493.The_Necessary_Hunger", "num_ratings": "394", "num_reviews": "52", "avg_ratings": 3.81, "genres": ["Lgbt", "Young Adult", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Sports and Games", "Sports"], "title": "The Necessary Hunger", "author": "Nina Revoyr", "num_pages": "365", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-15 00:00:00", "ISBN": "0312181426"},
{"url": "https://www.goodreads.com/book/show/29456598-starfish", "num_ratings": "2,627", "num_reviews": "621", "avg_ratings": 4.06, "genres": ["Contemporary", "Young Adult", "Health", "Mental Health", "Fiction", "Mental Health", "Mental Illness"], "title": "Starfish", "description": ["Kiko Himura has always had a hard time saying exactly what she’s thinking. With a mother who makes her feel unremarkable and a half-Japanese heritage she doesn’t quite understand, Kiko prefers to keep her head down, certain that once she makes it into her dream art school, Prism, her real life will begin.", "But then Kiko doesn’t get into Prism, at the same time her abusive un", "Kiko Himura has always had a hard time saying exactly what she’s thinking. With a mother who makes her feel unremarkable and a half-Japanese heritage she doesn’t quite understand, Kiko prefers to keep her head down, certain that once she makes it into her dream art school, Prism, her real life will begin.", "But then Kiko doesn’t get into Prism, at the same time her abusive uncle moves back in with her family. So when she receives an invitation from her childhood friend to leave her small town and tour art schools on the west coast, Kiko jumps at the opportunity in spite of the anxieties and fears that attempt to hold her back. And now that she is finally free to be her own person outside the constricting walls of her home life, Kiko learns life-changing truths about herself, her past, and how to be brave."], "author": "Akemi Dawn Bowman", "num_pages": "340", "awards": ["William C. Morris YA Debut Award Nominee (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-26 00:00:00", "ISBN": "1481487728"},
{"url": "https://www.goodreads.com/book/show/24034941-the-kaleidoscope", "num_ratings": "40", "num_reviews": "10", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Philosophy", "Futurism"], "title": "The Kaleidoscope: The Gift of Madness", "description": ["The rise of Alec Helena's most ambitious dream creates an existential shift tainted by an imperfect god. The first generation of life beyond humanity will be riddled with inherit contradictions. Every new life will have its own challenges and strive to find meaning. When androids become the next unwelcome native immigrants, they will be faced with humanity's foreign and do", "The rise of Alec Helena's most ambitious dream creates an existential shift tainted by an imperfect god. The first generation of life beyond humanity will be riddled with inherit contradictions. Every new life will have its own challenges and strive to find meaning. When androids become the next unwelcome native immigrants, they will be faced with humanity's foreign and domestic failures. Can the oppressed forgive their oppressors, or are the scars of such trespasses too deeply ingrained?"], "author": "Adrian Mendoza", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-22 00:00:00", "ISBN": "1505209358"},
{"url": "https://www.goodreads.com/book/show/17925536-no-surrender-soldier", "num_ratings": "129", "num_reviews": "45", "avg_ratings": 3.94, "genres": ["Young Adult", "Fiction", "Historical", "Historical", "Historical Fiction", "War"], "title": "No Surrender Soldier", "description": ["A young man, an old soldier , and a terrible injustice. Should the punishment be death?", "Growing up on Guam in 1972, fifteen-year-old Kiko is beset by worries: He’s never kissed a girl, and he thinks it’s possible he never will. The popular guys get all the attention, but the worst part is that Kiko has serious problems at home. His older brother is missing in Vietnam; his g", "A young man, an old soldier , and a terrible injustice. Should the punishment be death?", "Growing up on Guam in 1972, fifteen-year-old Kiko is beset by worries: He’s never kissed a girl, and he thinks it’s possible he never will. The popular guys get all the attention, but the worst part is that Kiko has serious problems at home. His older brother is missing in Vietnam; his grandfather is losing it to dementia; he just learned that his mother was raped in World War II by a Japanese soldier. It all comes together when he discovers an old man, a Japanese soldier, hiding in the jungle behind his house. It’s not the same man who raped his mother, but, in his rage, Kiko cares only about protecting his family and avenging his mom – no matter what it takes. And so, a shy, peaceable boy begins to plan a murder. But how far will Kiko go to prove to himself that he’s a man ? Based on a historical incident, No Surrender Soldier is the story of a boy grappling with ancient questions of courage and manhood before he can move on."], "author": "Christine Kohler", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-01 00:00:00", "ISBN": "1440565619"},
{"url": "https://www.goodreads.com/book/show/29385546-warcross", "num_ratings": "38,385", "num_reviews": "8,463", "avg_ratings": 4.21, "genres": ["Young Adult", "Science Fiction", "Fantasy"], "title": "Warcross", "description": [" ", "The obsession started ten years ago and its fan base now spans the globe, some eager to escape from reality and others hoping to make a profit. Struggling to make ends meet, teenage hacker Emika Chen works as a bounty hunter, tracking down Warcross players who bet on the game illegally. B", " ", "The obsession started ten years ago and its fan base now spans the globe, some eager to escape from reality and others hoping to make a profit. Struggling to make ends meet, teenage hacker Emika Chen works as a bounty hunter, tracking down Warcross players who bet on the game illegally. But the bounty hunting world is a competitive one, and survival has not been easy. To make some quick cash, Emika takes a risk and hacks into the opening game of the international Warcross Championships—only to accidentally glitch herself into the action and become an overnight sensation.", "Convinced she’s going to be arrested, Emika is shocked when instead she gets a call from the game’s creator, the elusive young billionaire Hideo Tanaka, with an irresistible offer. He needs a spy on the inside of this year’s tournament in order to uncover a security problem . . . and he wants Emika for the job. With no time to lose, Emika’s whisked off to Tokyo and thrust into a world of fame and fortune that she’s only dreamed of. But soon her investigation uncovers a sinister plot, with major consequences for the entire Warcross empire."], "author": "Marie Lu", "num_pages": "353", "awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2017)"], "places": [], "character_names": ["Emika Chen", "Hideo Tanaka", "Zero"], "language": "English", "publish_date": "2017-09-12 00:00:00", "ISBN": "0399547967"},
{"url": "https://www.goodreads.com/book/show/9520360-the-son-of-neptune", "num_ratings": "346,385", "num_reviews": "13,359", "avg_ratings": 4.44, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Son of Neptune", "description": [" When he awoke from his long sleep, he didn't know much more than his name. His brain fuzz is lingering, even after the wolf Lupa told him he is a demigod and trained him to fight with the pen/sword in his pocket. Somehow Percy manages to make it to a camp for half-bloods, despite the fact that he has to keep killing monsters along the way. But the camp d", " When he awoke from his long sleep, he didn't know much more than his name. His brain fuzz is lingering, even after the wolf Lupa told him he is a demigod and trained him to fight with the pen/sword in his pocket. Somehow Percy manages to make it to a camp for half-bloods, despite the fact that he has to keep killing monsters along the way. But the camp doesn't ring any bells with him. The only thing he can recall from his past is another name: ", ". ", " When she lived before, she didn't do a very good job of it. Sure, she was an obedient daughter, even when her mother was possessed by greed. But that was the problem—when the Voice took over her mother and commanded Hazel to use her \"gift\" for an evil purpose, Hazel couldn't say no. Now because of her mistake, the future of the world is at risk. Hazel wishes she could ride away from it all on the stallion that appears in her dreams. ", " His grandmother says he is descended from heroes and can be anything he wants to be, but he doesn't see it. He doesn't even know who his father is. He keeps hoping Apollo will claim him, because the only thing he is good at is archery—although not good enough to win camp war games. His bulky physique makes him feel like an ox, especially in front of Hazel, his closest friend at camp. He trusts her completely—enough to share the secret he holds close to his heart. ", "Beginning at the \"other\" camp for half-bloods and extending as far as the land beyond the gods, this breathtaking second installment of the Heroes of Olympus series introduces new demigods, revives fearsome monsters, and features other remarkable creatures, all destined to play a part in the Prophesy of Seven."], "author": "Rick Riordan", "num_pages": "521", "awards": ["Buckeye Children's Book Award for 6-8 (2012)"], "places": ["Oakland, California", "Alaska", "Portland, Oregon", "Seattle, Washington", "Berkeley, California", "North Vancouver, British Columbia", "Anchorage, Alaska", "Seward, Alaska"], "character_names": ["Nico di Angelo", "Octavian", "Hera", "Reyna", "Juno", "Hazel Levesque", "Frank Zhang", "Ella the Harpy", "Percy Jackson"], "language": "English", "publish_date": "2011-10-04 00:00:00", "ISBN": "1423140591"},
{"url": "https://www.goodreads.com/book/show/7157310-rot-ruin", "num_ratings": "30,077", "num_reviews": "3,480", "avg_ratings": 4.1, "genres": ["Horror", "Zombies", "Young Adult", "Horror", "Science Fiction", "Dystopia"], "title": "Rot & Ruin", "description": ["In the zombie-infested, post-apocalyptic America where Benny Imura lives, every teenager must find a job by the time they turn fifteen or get their rations cut in half. Benny doesn't want to apprentice as a zombie hunter with his boring older brother Tom, but he has no choice. He expects a tedious job whacking zoms for cash, but what he gets is a vocation that will teach h", "In the zombie-infested, post-apocalyptic America where Benny Imura lives, every teenager must find a job by the time they turn fifteen or get their rations cut in half. Benny doesn't want to apprentice as a zombie hunter with his boring older brother Tom, but he has no choice. He expects a tedious job whacking zoms for cash, but what he gets is a vocation that will teach him what it means to be human."], "author": "Jonathan Maberry", "num_pages": "458", "awards": ["Bram Stoker Award Nominee for Best Novel (2010)", "Lincoln Award Nominee (2016)", "Cybils Award for Young Adult Fantasy & Science Fiction (2010)", "Missouri Gateway Readers Award (2013)"], "places": ["California"], "character_names": ["Benjamin Imura", "Tom Imura", "Nix Riley"], "language": "English", "publish_date": "2010-09-14 00:00:00", "ISBN": "1442402326"},
{"url": "https://www.goodreads.com/book/show/1722423.Good_Enough", "num_ratings": "1,688", "num_reviews": "295", "avg_ratings": 3.9, "genres": ["Young Adult", "Realistic Fiction", "Music", "Fiction", "Romance", "Contemporary"], "title": "Good Enough", "description": ["How to make your Korean parents happy:", "1. Get a perfect score on the SATs.", "2. Get into HarvardYalePrinceton.", "3. Don't talk to boys.*", "Patti's parents expect nothing less than the best from their Korean-American daughter. Everything she does affects her chances of getting into an Ivy League school. So winning ", " concertmaster in her All-State violin competition and earnin", "How to make your Korean parents happy:", "1. Get a perfect score on the SATs.", "2. Get into HarvardYalePrinceton.", "3. Don't talk to boys.*", "Patti's parents expect nothing less than the best from their Korean-American daughter. Everything she does affects her chances of getting into an Ivy League school. So winning ", " concertmaster in her All-State violin competition and earning less than 2300 on her SATs is simply ", ".", "But Patti's discovering that there's more to life than the Ivy League. To start with, there's Cute Trumpet Guy. He's funny, he's talented, and he looks exactly like the lead singer of Patti's favorite band. Then, of course, there's her love of the violin. Not to mention cool rock concerts. And anyway, what if Patti doesn't want to go to ", " after all?", "Paula Yoo scores big in her hilarious debut novel about an overachiever who longs to fit in and strives to stand out. The pressure is on!", "*Boys will distract you from your studies."], "author": "Paula Yoo", "num_pages": "322", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2010)", "Asian/Pacific American Award for Literature for Youth Literature Honor (2008)", "Missouri Gateway Readers Award Nominee (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-02-05 00:00:00", "ISBN": "0060790857"},
{"url": "https://www.goodreads.com/book/show/546443.Girl_Overboard", "num_ratings": "1,964", "num_reviews": "198", "avg_ratings": 3.66, "genres": ["Young Adult", "Realistic Fiction", "Sports and Games", "Sports", "Contemporary", "Fiction", "Young Adult", "Teen"], "title": "Girl Overboard", "description": ["Everybody thinks Syrah is the golden girl. After all, her father is Ethan Cheng, billionaire, and she has everything any kid could possibly desire: a waterfront mansion, jet plane, and custom-designed snowboards. But most of what glitters in her life is fool's gold. Her half-siblings hate her, her best friend's girlfriend is ruining their friendship, and her own so-called", "Everybody thinks Syrah is the golden girl. After all, her father is Ethan Cheng, billionaire, and she has everything any kid could possibly desire: a waterfront mansion, jet plane, and custom-designed snowboards. But most of what glitters in her life is fool's gold. Her half-siblings hate her, her best friend's girlfriend is ruining their friendship, and her own so-called boyfriend is only after her for her father's name. When her broken heart results in a snowboarding accident that exiles her from the mountains-the one place where she feels free and accepted for who she is, not what she has-can Syrah rehab both her busted-up knee, \"and\" her broken heart? ", " Justina Chen Headley writes with an engaging wit and a powerful, distinct voice. Her first novel, \"Nothing But the Truth (and a few white lies) \"was a Border's Original Voices nominee, a Book Sense pick, and received a starred review from \"Publisher's Weekly: \"\"Headley makes an impressive debut with this witty, intimate novel.\"\"\"\"\""], "author": "Justina Chen", "num_pages": "339", "awards": [], "places": ["Seattle, Washington", "Whistler Mountain", "Vancouver, British Columbia"], "character_names": ["Syrah Cheng", "Adrian \"Age\" Rodriguez", "Lillian Fujimori", "Grace Cheng", "Bau-mo"], "language": "English", "publish_date": "2008-01-01 00:00:00", "ISBN": "0316011304"},
{"url": "https://www.goodreads.com/book/show/238821.Children_of_the_River", "num_ratings": "1,571", "num_reviews": "185", "avg_ratings": 3.67, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Academic", "School", "Realistic Fiction", "Romance"], "title": "Children of the River", "description": ["Sundara fled Cambodia with her aunt's family to escape the Khmer Rouge army when she was thirteen, leaving behind her parents, her brother and sister, and the boy she had loved since she was a child.", "Now, four years later, she struggles to fit in at her Oregon high school and to be \"a good Cambodian girl\" at home. A good Cambodian girl never dates; she waits for her family", "Sundara fled Cambodia with her aunt's family to escape the Khmer Rouge army when she was thirteen, leaving behind her parents, her brother and sister, and the boy she had loved since she was a child.", "Now, four years later, she struggles to fit in at her Oregon high school and to be \"a good Cambodian girl\" at home. A good Cambodian girl never dates; she waits for her family to arrange her marriage to a Cambodian boy. Yet Sundara and Jonathan, an extraordinary American boy, are powerfully drawn to each other. Haunted by grief for her lost family and for the life left behind, Sundara longs to be with him. At the same time she wonders, Are her hopes for happiness and new life in America disloyal to her past and her people?"], "author": "Linda Crew", "num_pages": "213", "awards": ["Michigan Library Association Thumbs Up! Award Nominee (1990)", "IRA Children’s and Young Adult’s Book Award for Older Reader Category (1990)", "California Young Readers Medal Nominee for Young Adult (1992)"], "places": ["Oregon"], "character_names": [], "language": "English", "publish_date": "1991-08-01 00:00:00", "ISBN": "0440210224"},
{"url": "https://www.goodreads.com/book/show/462234.Millicent_Min_Girl_Genius", "num_ratings": "4,005", "num_reviews": "343", "avg_ratings": 3.75, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Fiction", "Young Adult", "Childrens", "Humor"], "title": "Millicent Min, Girl Genius", "description": ["Millicent Min is having a bad summer. Her fellow high school students hate her for setting the curve. Her fellow 11-year-olds hate her for going to high school. And her mother has arranged for her to tutor Stanford Wong, the poster boy for Chinese geekdom. But then Millie meets Emily. Emily doesn't know Millicent's IQ score. She actually thinks Millie is cool. And if Milli", "Millicent Min is having a bad summer. Her fellow high school students hate her for setting the curve. Her fellow 11-year-olds hate her for going to high school. And her mother has arranged for her to tutor Stanford Wong, the poster boy for Chinese geekdom. But then Millie meets Emily. Emily doesn't know Millicent's IQ score. She actually thinks Millie is cool. And if Millie can hide her awards, ignore her grandmother's advice, swear her parents to silence, blackmail Stanford, and keep all her lies straight, she just might make her first friend.", "What's it going to take? Sheer genius."], "author": "Lisa Yee", "num_pages": "272", "awards": ["Sid Fleischman Humor Award (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "0439425204"},
{"url": "https://www.goodreads.com/book/show/15749186-to-all-the-boys-i-ve-loved-before", "num_ratings": "197,833", "num_reviews": "22,023", "avg_ratings": 4.11, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction", "Womens Fiction", "Chick Lit", "Realistic Fiction", "Young Adult", "Young Adult Contemporary", "Audiobook", "Did Not Finish", "Young Adult", "High School"], "title": "To All the Boys I've Loved Before", "description": ["What if all the crushes you ever had found out how you felt about them… all at once? ", "Sixteen-year-old Lara Jean Song keeps her love letters in a hatbox her mother gave her. They aren’t love letters that anyone else wrote for her; these are ones she’s written. One for every boy she’s ever loved—five in all. When she writes, she pours out her heart and soul and says all the", "What if all the crushes you ever had found out how you felt about them… all at once? ", "Sixteen-year-old Lara Jean Song keeps her love letters in a hatbox her mother gave her. They aren’t love letters that anyone else wrote for her; these are ones she’s written. One for every boy she’s ever loved—five in all. When she writes, she pours out her heart and soul and says all the things she would never say in real life, because her letters are for her eyes only. Until the day her secret letters are mailed, and suddenly, Lara Jean’s love life goes from imaginary to out of control."], "author": "Jenny Han", "num_pages": "355", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Lincoln Award Nominee (2018)", "Goodreads Choice Award Nominee for Young Adult Fiction (2014)"], "places": ["Charlottesville, Virginia"], "character_names": ["Josh", "Kitty", "Margot", "Lara Jean", "Peter Kavinsky"], "language": "English", "publish_date": "2015-03-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3367956-hotel-on-the-corner-of-bitter-and-sweet", "num_ratings": "229,097", "num_reviews": "19,017", "avg_ratings": 3.99, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Book Club", "Romance", "War", "World War II"], "title": "Hotel on the Corner of Bitter and Sweet", "description": ["In 1986, Henry Lee joins a crowd outside the Panama Hotel, once the gateway to Seattle's Japantown. It has been boarded up for decades, but now the new owner has discovered the belongings of Japanese families who were sent to internment camps during World War II. As the owner displays and unfurls a Japanese parasol, Henry, a Chinese American, remembers a young Japanese Ame", "In 1986, Henry Lee joins a crowd outside the Panama Hotel, once the gateway to Seattle's Japantown. It has been boarded up for decades, but now the new owner has discovered the belongings of Japanese families who were sent to internment camps during World War II. As the owner displays and unfurls a Japanese parasol, Henry, a Chinese American, remembers a young Japanese American girl from his childhood in the 1940s—Keiko Okabe, with whom he forged a bond of friendship and innocent love that transcended the prejudices of their Old World ancestors. After Keiko and her family were evacuated to the internment camps, she and Henry could only hope that their promise to each other would be kept. Now, forty years later, Henry explores the hotel's basement for the Okabe family's belongings and for a long-lost object whose value he cannot even begin to measure. His search will take him on a journey to revisit the sacrifices he has made for family, for love, for country."], "author": "Jamie Ford", "num_pages": "290", "awards": ["Montana Book Award (2009)", "Goodreads Choice Award Nominee for Fiction (2009)", "David J. Langum Sr. Prize Nominee for American Historical Fiction  (Director's Mention) (2009)", "Asian/Pacific American Award for Literature for Adult Fiction (2009)"], "places": ["Seattle, Washington", "Puyallup, Washington", "Minidoka, Idaho", "Washington (the state)"], "character_names": ["Henry Lee", "Keiko Okabe"], "language": "English", "publish_date": "2009-01-27 00:00:00", "ISBN": "0345505336"},
{"url": "https://www.goodreads.com/book/show/9135893-black-halo", "num_ratings": "1,993", "num_reviews": "80", "avg_ratings": 4.16, "genres": ["Paranormal", "Angels", "Young Adult", "Fantasy", "Paranormal", "Romance", "Paranormal Romance"], "title": "Black Halo", "description": ["While nearly everyone else at Heath High is preparing for prom and graduation, Grace Shelley is coming to terms with the end of her relationship with Robert, the angel who saved her soul, her life, and then broke her heart. It's not easy, especially when she can't escape his thoughts.", "But Grace has other things to worry about. Like her friend Stacy's cancer, and her best fr", "While nearly everyone else at Heath High is preparing for prom and graduation, Grace Shelley is coming to terms with the end of her relationship with Robert, the angel who saved her soul, her life, and then broke her heart. It's not easy, especially when she can't escape his thoughts.", "But Grace has other things to worry about. Like her friend Stacy's cancer, and her best friend Graham's ex-girlfriend, whose attacks on Grace and her friends only seem to escalate with each passing day. And then there's Samael, the Archangel of Death, whose own death after his last attack on Grace had been revealed to be nothing but a lie.", "When Samael tries once again to finish what he started, Grace finds herself having to rely on Robert for help, something that forces the both of them to confront the lies that exist between them. But, as Samael closes in on not only Grace, but also on the people she cares about, she learns a secret that forces her to make a decision that changes not only her, but the very world she lives in."], "author": "S.L. Naeole", "num_pages": "500", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3238153-north-of-beautiful", "num_ratings": "34,281", "num_reviews": "2,154", "avg_ratings": 3.92, "genres": ["Young Adult", "Romance", "Contemporary", "Realistic Fiction", "Fiction"], "title": "North of Beautiful", "description": ["Why not fix your face? ", "It's hard not to notice Terra Cooper.", " She's tall, blond, and has an enviable body. But with one turn of her cheek, all people notice is her unmistakably \"flawed\" face. Terra secretly plans to le", "Why not fix your face? ", "It's hard not to notice Terra Cooper.", " She's tall, blond, and has an enviable body. But with one turn of her cheek, all people notice is her unmistakably \"flawed\" face. Terra secretly plans to leave her stifling small town in the Northwest and escape to an East Coast college, but gets pushed off-course by her controlling father. When an unexpected collision puts Terra directly in Jacob's path, the handsome but quirky Goth boy immediately challenges her assumptions about herself and her life, and she is forced in yet another direction. With her carefully laid plans disrupted, will Terra be able to find her true path?", "Written in lively, artful prose, award-winning author Justina Chen Headley has woven together a powerful novel about a fractured family, falling in love, travel, and the meaning of true beauty."], "author": "Justina Chen", "num_pages": "373", "awards": ["Florida Teens Read Nominee (2010)", "Amelia Elizabeth Walden Award Nominee (2010)", "Lincoln Award Nominee (2013)", "James Cook Book Award Nominee (2011)", "Cybils Award Nominee for Young Adult Fiction (2009)", "Goodreads Choice Award Nominee for Young Adult Fiction (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-02-01 00:00:00", "ISBN": "0316025054"},
{"url": "https://www.goodreads.com/book/show/8480035-bird-song", "num_ratings": "2,055", "num_reviews": "86", "avg_ratings": 4.09, "genres": ["Paranormal", "Angels", "Young Adult", "Fantasy", "Paranormal", "Romance", "Paranormal Romance"], "title": "Bird Song", "description": ["Grace Shelley's life has changed a lot these past four months. She's lost her best friend Graham, fallen in love with Death himself, Robert Bellegarde, made a new best friend in Stacy Kim, a spunky girl who clashes with Graham at every turn, and battled a rogue angel named Samael to death. And all before her eighteenth birthday.", "And now she faces the biggest challenge in he", "Grace Shelley's life has changed a lot these past four months. She's lost her best friend Graham, fallen in love with Death himself, Robert Bellegarde, made a new best friend in Stacy Kim, a spunky girl who clashes with Graham at every turn, and battled a rogue angel named Samael to death. And all before her eighteenth birthday.", "And now she faces the biggest challenge in her life: Hormones.", "With Graham seeking her help in understanding his feelings for Lark, Robert's icy sister, Grace gets a glimpse at just how difficult it is for a human to love an angel. Stacy's new relationship shows Grace that sometimes, dating a human isn't any easier. And Robert's refusal to take their relationship past the chaste and brotherly kisses they've shared has made Grace question his attraction to her.", "It's as normal a life as Grace is going to get. But when she discovers who it was that nearly killed a few months ago in a hit-and-run, her accusation sets into motion a series of events that changes them all, angel and human alike.", "At the end of it all, will Grace be left whole, or will she be even more broken than before?"], "author": "S.L. Naeole", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-06-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2514746.Outside_Beauty", "num_ratings": "1,172", "num_reviews": "187", "avg_ratings": 3.56, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Contemporary", "Family"], "title": "Outside Beauty", "description": [" ", " "], "author": "Cynthia Kadohata", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-03 00:00:00", "ISBN": "0689865759"},
{"url": "https://www.goodreads.com/book/show/9275658-legend", "num_ratings": "354,355", "num_reviews": "25,467", "avg_ratings": 4.18, "genres": ["Young Adult", "Romance", "Fantasy", "Science Fiction", "Fiction"], "title": "Legend", "description": ["What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal.", "What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal. But his motives may not be as malicious as they seem.", "From very different worlds, June and Day have no reason to cross paths—until the day June's brother, Metias, is murdered and Day becomes the prime suspect. Caught in the ultimate game of cat and mouse, Day is in a race for his family's survival, while June seeks to avenge Metias's death. But in a shocking turn of events, the two uncover the truth of what has really brought them together, and the sinister lengths their country will go to keep its secrets."], "author": "Marie Lu", "num_pages": "305", "awards": ["Milwaukee County Teen Book Award Nominee (2013)", "The Inky Awards Nominee for Silver Inky (2012)", "California Young Readers Medal Nominee for Young Adult (2015)", "Lincoln Award Nominee (2014)", "Missouri Truman Readers Award (2014)", "Goodreads Choice Award Nominee for Young Adult Fantasy and Science Fiction (2012)", "Rebecca Caudill Young Readers' Book Award (2015)"], "places": ["Los Angeles, The Republic of America"], "character_names": ["June Iparis", "Daniel Altan Wing", "Metias Iparis", "Commander Jameson", "Thomas Bryant", "Tess", "Kaede"], "language": "English", "publish_date": "2011-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1800712.The_Fold", "num_ratings": "1,058", "num_reviews": "164", "avg_ratings": 3.42, "genres": ["Young Adult", "Realistic Fiction", "Contemporary", "Fiction", "Cultural", "Young Adult", "Teen"], "title": "The Fold", "description": ["Joyce never used to care that much about how she looked, but that was before she met JFK—John Ford Kang, the most gorgeous guy in school. And it doesn’t help that she’s constantly being compared to her beautiful older sister, Helen. Then her rich plastic-surgery-addict aunt offers Joyce a gift to “fix” a part of herself she’d never realized needed fixing—her eyes. Joyce ha", "Joyce never used to care that much about how she looked, but that was before she met JFK—John Ford Kang, the most gorgeous guy in school. And it doesn’t help that she’s constantly being compared to her beautiful older sister, Helen. Then her rich plastic-surgery-addict aunt offers Joyce a gift to “fix” a part of herself she’d never realized needed fixing—her eyes. Joyce has heard of the fold surgery—a common procedure meant to make Asian women’s eyes seem “prettier” and more “American”—but she’s not sure she wants to go through with it. Her friend Gina can’t believe she isn’t thrilled. After all, the plastic surgeon has shown Joyce that her new eyes will make her look just like Helen—but is that necessarily a good thing?"], "author": "An Na", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-10 00:00:00", "ISBN": "0399242767"},
{"url": "https://www.goodreads.com/book/show/8081589-falling-from-grace", "num_ratings": "4,154", "num_reviews": "253", "avg_ratings": 3.83, "genres": ["Paranormal", "Angels", "Young Adult", "Fantasy", "Paranormal", "Romance", "Fantasy"], "title": "Falling From Grace", "description": ["When you wake up in the morning and your eyes take in the first hints of light that shine through your window, the dust motes catching and reflecting the sun’s rays like little diamonds, the shimmering hues of yellow and orangey gold breaking through into your room, the first thing you think about usually isn’t how you’re going to make it through the worst day of your life", "When you wake up in the morning and your eyes take in the first hints of light that shine through your window, the dust motes catching and reflecting the sun’s rays like little diamonds, the shimmering hues of yellow and orangey gold breaking through into your room, the first thing you think about usually isn’t how you’re going to make it through the worst day of your life.", "Unfortunately for Grace Shelley, that’s exactly what she’s facing as she ponders what to do now that she’s going to be starting out her last year in high school without her best friend. She’s not exactly the most popular girl in school - well, not the most popular girl in school to like, anyway - and everything seems to be hinting at another status quo year for her until she bumps into a stranger who leaves her stumbling for words and chasing after her heart.", "The new guy in school is different. Robert doesn’t care about the rumors he’s heard about her or that no one else seems to see her the same way that he does; he only wants to be her friend. That’s when things get complicated. When Grace learns that he’s not your typical high school boy and that he’s actually a wingless angel who’s looking for someone to trust, she’s thrust into his world where not all angels are meant to protect human beings, and where the changes she brings into his life changes everything in hers."], "author": "S.L. Naeole", "num_pages": "474", "awards": [], "places": [], "character_names": ["Robert Cambourne", "Grace Shelley"], "language": "English", "publish_date": "2010-01-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/224392.Weedflower", "num_ratings": "3,665", "num_reviews": "512", "avg_ratings": 3.89, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Childrens", "Middle Grade", "War", "World War II"], "title": "Weedflower", "description": ["Twelve-year-old Sumiko feels her life has been made up of two parts: before Pearl Harbor and after it. The good part and the bad part. Raised on a flower farm in California, Sumiko is used to being the only Japanese girl in her class. Even when the other kids tease her, she always has had her flowers and family to go home to. ", "Twelve-year-old Sumiko feels her life has been made up of two parts: before Pearl Harbor and after it. The good part and the bad part. Raised on a flower farm in California, Sumiko is used to being the only Japanese girl in her class. Even when the other kids tease her, she always has had her flowers and family to go home to. "], "author": "Cynthia Kadohata", "num_pages": "260", "awards": ["Jane Addams Children's Book Award for Older Children (2007)", "Dorothy Canfield Fisher Children's Book Award Nominee (2008)"], "places": ["United States of America", "Arizona"], "character_names": ["Sumiko"], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0689865740"},
{"url": "https://www.goodreads.com/book/show/463780.A_Step_from_Heaven", "num_ratings": "6,381", "num_reviews": "641", "avg_ratings": 3.77, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural"], "title": "A Step from Heaven", "description": ["When Young Ju is four years old, she learns that her family is leaving their small fishing village in Korea to live in Mi Gook. Young Ju has heard enough about Mi Gook to be sure the place they are moving to is paradise, that she and her family are going to heaven.", "After flying through the sky for a long time, Young Ju finds out that Mi Gook is actually a regular earthly pl", "When Young Ju is four years old, she learns that her family is leaving their small fishing village in Korea to live in Mi Gook. Young Ju has heard enough about Mi Gook to be sure the place they are moving to is paradise, that she and her family are going to heaven.", "After flying through the sky for a long time, Young Ju finds out that Mi Gook is actually a regular earthly place called America. And it doesn't feel at all like heaven. A STEP FROM HEAVEN follows Young's life from the age of 4 all the way up until she is ready for college, as we watch her change from a hopeful girl into a hardened young adult."], "author": "An Na", "num_pages": "160", "awards": ["Michael L. Printz Award (2002)", "Dorothy Canfield Fisher Children's Book Award Nominee (2003)", "IRA Children’s and Young Adult’s Book Award for Young Adult–Fiction (2002)", "National Book Award Finalist for Young People's Literature (2001)", "Asian/Pacific American Award for Literature for Children and Young Adult (2003)", "Missouri Gateway Readers Award Nominee (2004)"], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2003-10-13 00:00:00", "ISBN": "0142500275"},
{"url": "https://www.goodreads.com/book/show/766319.Born_Confused", "num_ratings": "4,719", "num_reviews": "451", "avg_ratings": 3.8, "genres": ["Young Adult", "Fiction", "Romance", "Contemporary", "Young Adult", "Coming Of Age"], "title": "Born Confused", "description": ["Dimple Lala doesn't know what to think. Her parents are from India, and she's spent her whole life resisting their traditions. Then suddenly she gets to high school and everything Indian is trendy. To make matters worse, her parents arrange for her to meet a \"suitable boy.\" Of course it doesn't go well -- until Dimple goes to a club and finds him spinning a magical web . S", "Dimple Lala doesn't know what to think. Her parents are from India, and she's spent her whole life resisting their traditions. Then suddenly she gets to high school and everything Indian is trendy. To make matters worse, her parents arrange for her to meet a \"suitable boy.\" Of course it doesn't go well -- until Dimple goes to a club and finds him spinning a magical web . Suddenly the suitable boy is suitable because of his sheer unsuitability. Complications ensue. This is a funny, thoughtful story about finding your heart, finding your culture, and finding your place in America."], "author": "Tanuja Desai Hidier", "num_pages": "512", "awards": ["Lincoln Award Nominee (2005)", "Asian/Pacific American Award for Literature for Children and Young Adult Honor (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-07-01 00:00:00", "ISBN": "0439510112"},
{"url": "https://www.goodreads.com/book/show/15745753-eleanor-park", "num_ratings": "680,580", "num_reviews": "57,922", "avg_ratings": 4.09, "genres": ["Young Adult", "Romance", "Contemporary", "Fiction"], "title": "Eleanor & Park", "description": ["... Red hair, wrong clothes. Standing behind him until he turns his head. Lying beside him until he wakes up. Making everyone else seem drabber and flatter and never good enough...Eleanor.", "... He knows she'll love a song before he plays it for her. He laughs at her jokes before she ever gets to the punch line. There's a place on", "... Red hair, wrong clothes. Standing behind him until he turns his head. Lying beside him until he wakes up. Making everyone else seem drabber and flatter and never good enough...Eleanor.", "... He knows she'll love a song before he plays it for her. He laughs at her jokes before she ever gets to the punch line. There's a place on his chest, just below his throat, that makes her want to keep promises...Park.", "Set over the course of one school year, this is the story of two star-crossed sixteen-year-olds—smart enough to know that first love almost never lasts, but brave and desperate enough to try."], "author": "Rainbow Rowell", "num_pages": "328", "awards": ["Georgia Peach Book Award (2014)", "All About Romance (AAR) Annual Reader Poll for Best Young Adult Romance (2014)", "Odyssey Award Nominee (2014)", "Michael L. Printz Award Nominee (2016)", "Pennsylvania Young Readers' Choice Award for Young Adults (2015)", "Milwaukee County Teen Book Award (2014)", "Michigan Library Association Thumbs Up! Award (2014)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2016)", "Amelia Elizabeth Walden Award (2014)", "Boston Globe-Horn Book Award for Fiction (2013)", "Dioraphte Jongerenliteratuurprijs for vertaald boek (2015)", "California Young Readers Medal Nominee for Young Adult (2016)", "Lincoln Award (2015)", "DABWAHA Romance Tournament Nominee for Best Young Adult Romance (2014)", "North Carolina Young Adult Book Award for High School (2016)", "Goodreads Choice Award for Best Young Adult Fiction (2013)", "Green Mountain Book Award Nominee (2015)", "The Magnolia Award for 9-12 (2015)", "Missouri Gateway Readers Award Nominee (2016)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2013)"], "places": ["Omaha, Nebraska"], "character_names": ["Park Sheridan", "Eleanor Douglas"], "language": "English", "publish_date": "2013-02-26 00:00:00", "ISBN": "1250012570"},
{"url": "https://www.goodreads.com/book/show/7362158-girl-in-translation", "num_ratings": "40,363", "num_reviews": "5,036", "avg_ratings": 3.97, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Contemporary", "Cultural", "China", "Adult Fiction"], "title": "Girl in Translation", "description": ["When Kimberly Chang and her mother emigrate from Hong Kong to Brooklyn squalor, she quickly begins a secret double life: exceptional schoolgirl during the day, Chinatown sweatshop worker in the evenings. Disguising the more di", "When Kimberly Chang and her mother emigrate from Hong Kong to Brooklyn squalor, she quickly begins a secret double life: exceptional schoolgirl during the day, Chinatown sweatshop worker in the evenings. Disguising the more difficult truths of her life like the staggering degree of her poverty, the weight of her family’s future resting on her shoulders, or her secret love for a factory boy who shares none of her talent or ambition. Kimberly learns to constantly translate not just her language but herself back and forth between the worlds she straddles.", "Through Kimberly’s story, author Jean Kwok, who also emigrated from Hong Kong as a young girl, brings to the page the lives of countless immigrants who are caught between the pressure to succeed in America, their duty to their family, and their own personal desires, exposing a world that we rarely hear about. ", "Written in an indelible voice that dramatizes the tensions of an immigrant girl growing up between two cultures, surrounded by a language and world only half understood, ", " is an unforgettable and classic novel of an American immigrant-a moving tale of hardship and triumph, heartbreak and love, and all that gets lost in translation."], "author": "Jean Kwok", "num_pages": "290", "awards": ["ALA Alex Award (2011)", "Lincoln Award Nominee (2016)", "Suburban Mosaic Book of the Year (2011)", "Chinese Library Association Best Book (2010)", "John Gardner Book Award Nominee for Fiction (2011)", "Goodreads Choice Award Nominee for Fiction, Debut Author (2010)"], "places": ["Brooklyn, New York City, New York"], "character_names": ["Kimberly Chang", "Aunt Paula", "Uncle Bob", "Matt Wu", "Annette Avery", "Curt"], "language": "English", "publish_date": "2010-04-29 00:00:00", "ISBN": "1594487561"},
{"url": "https://www.goodreads.com/book/show/118944.American_Born_Chinese", "num_ratings": "57,628", "num_reviews": "6,641", "avg_ratings": 3.88, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Fiction", "Fantasy"], "title": "American Born Chinese", "description": ["All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...", "Born to rule over all the monkeys in the world, the story of the Monkey K", "All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...", "Born to rule over all the monkeys in the world, the story of the Monkey King is one of the oldest and greatest Chinese fables. Adored by his subjects, master of the arts of kung-fu, he is the most powerful monkey on earth. But the Monkey King doesn't want to be a monkey. He wants to be hailed as a god...", "Chin-Kee is the ultimate negative Chinese stereotype, and he's ruining his cousin Danny's life. Danny's a popular kid at school, but every year Chin-Kee comes to visit, and every year Danny has to transfer to a new school to escape the shame. This year, though, things quickly go from bad to worse...", "These three apparently unrelated tales come together with an unexpected twist, in a modern fable that is hilarious, poignant and action-packed. ", " is an amazing rise, all the way up to the astonishing climax--and confirms what a growing number of readers already know: Gene Yang is a major talent."], "author": "Gene Luen Yang", "num_pages": "240", "awards": ["Michael L. Printz Award (2007)", "James Cook Book Award Nominee (2007)", "Will Eisner Comic Industry Awards for Best Graphic Album - New (2007)", "National Book Award Finalist for Young People's Literature (2006)", "One Book One San Diego for Young Adult (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "1596431520"}
]