[
{"url": "https://www.goodreads.com/book/show/22616635-puddle-jumping", "num_ratings": "9,512", "num_reviews": "1,865", "avg_ratings": 4.31, "genres": ["Young Adult", "Romance", "Contemporary", "New Adult", "Romance", "Contemporary Romance"], "title": "Puddle Jumping", "description": ["When it comes to love there’s no such thing as conventional. ", "Everyone thinks Colton Neely is special. ", "Lilly Evans just thinks he’s fascinating. ", "Once friends when they were younger, their bond is cut short due to her accident prone nature and they go their separate ways. Years later, they meet again and Lilly learns that there is something special about the boy she once kne", "When it comes to love there’s no such thing as conventional. ", "Everyone thinks Colton Neely is special. ", "Lilly Evans just thinks he’s fascinating. ", "Once friends when they were younger, their bond is cut short due to her accident prone nature and they go their separate ways. Years later, they meet again and Lilly learns that there is something special about the boy she once knew, but she has no idea what it all means. And she’s not sure if she’s ready to find out. ", "When he walks through the corridor of her school the first day of her senior year, she knows that it’s time to get to know the real Colton Neely. The more she learns, the deeper she falls. ", "Their friendship grows into love, even as Colton does not express it in words. But one decision threatens to break down the world that Lilly has tried so hard to integrate into and she must figure out if the relationship can survive if they are apart."], "author": "Amber L.  Johnson", "num_pages": "127", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20647188-by-the-light-of-the-moon", "num_ratings": "73", "num_reviews": "39", "avg_ratings": 3.74, "genres": ["Fantasy", "Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Shapeshifters", "Werewolves", "New Adult", "Paranormal", "Shapeshifters", "Romance", "Historical Romance"], "title": "By the Light of the Moon", "description": ["Book #1 in the Lakeside Series!", "Withdrawn and with a reputation for her strange, eccentric ways, young Lady Moira Rochmond is old to be unwed. Rumors say, she has been seen barefoot in the orchard, is awake all night in moon-struck rambles and sleeps all day. Some will even claim her ghostly pallor and aloof manner are signs of illness, of a curse or insanity.", "The hopes of t", "Book #1 in the Lakeside Series!", "Withdrawn and with a reputation for her strange, eccentric ways, young Lady Moira Rochmond is old to be unwed. Rumors say, she has been seen barefoot in the orchard, is awake all night in moon-struck rambles and sleeps all day. Some will even claim her ghostly pallor and aloof manner are signs of illness, of a curse or insanity.", "The hopes of the peaceful succession to her father’s fief lie in an advantageous marriage. When a suitor does show interest, her family pushes for a decision.", "Almost resigned to the fact that she has no choice but to play the part she has been given in life, Moira is faced with Owain. A member of the mysterious Blaidyn creatures and a new guard in her father’s castle, he is specifically tasked to keep her safe. He is different from other people she knows and when one night under the full moon, she makes the acquaintance of the wolf who shares Owain’s soul, her life starts to change and to unravel."], "author": "Laila Blake", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-06 00:00:00", "ISBN": "0996005420"},
{"url": "https://www.goodreads.com/book/show/270805.Impulse", "num_ratings": "65,182", "num_reviews": "3,304", "avg_ratings": 4.28, "genres": ["Young Adult", "Poetry", "Fiction"], "title": "Impulse", "description": ["Three lives, three different paths to the same destination: Aspen Springs, a psychiatric hospital for those who have attempted the ultimate act—suicide.", "Vanessa is beautiful and smart, but her secrets keep her answering the call of the blade.", "Tony, after suffering a painful childhood, c", "Three lives, three different paths to the same destination: Aspen Springs, a psychiatric hospital for those who have attempted the ultimate act—suicide.", "Vanessa is beautiful and smart, but her secrets keep her answering the call of the blade.", "Tony, after suffering a painful childhood, can only find peace through pills.", "And Conner, outwardly, has the perfect life. But dig a little deeper and find a boy who is in constant battle with his parents, his life, himself.", "In one instant each of these young people decided enough was enough. They grabbed the blade, the bottle, the gun—and tried to end it all. Now they have a second chance, and just maybe, with each other's help, they can find their way to a better life—but only if they're strong and can fight the demons that brought them here in the first place."], "author": "Ellen Hopkins", "num_pages": "666", "awards": ["Georgia Peach Book Award (2008)", "Lincoln Award Nominee (2013)"], "places": ["United States of America", "Arizona"], "character_names": ["Tony Daniels", "Connor Sykes", "Vanessa O'Reilly"], "language": "English", "publish_date": "2007-01-23 00:00:00", "ISBN": "1416903569"},
{"url": "https://www.goodreads.com/book/show/15990969-ten-tiny-breaths", "num_ratings": "63,704", "num_reviews": "5,257", "avg_ratings": 4.15, "genres": ["New Adult", "Romance", "Contemporary", "Romance", "Contemporary Romance", "Young Adult"], "title": "Ten Tiny Breaths", "description": ["Kacey Cleary’s whole life imploded four years ago in a drunk-driving accident. Now she’s working hard to bury the pieces left behind—all but one. Her little sister, Livie. Kacey can swallow the constant disapproval from her born-again aunt Darla over her self-destructive lifestyle; she can stop herself from going kick-boxer crazy on Uncle Raymond when he loses the girls’ c", "Kacey Cleary’s whole life imploded four years ago in a drunk-driving accident. Now she’s working hard to bury the pieces left behind—all but one. Her little sister, Livie. Kacey can swallow the constant disapproval from her born-again aunt Darla over her self-destructive lifestyle; she can stop herself from going kick-boxer crazy on Uncle Raymond when he loses the girls’ college funds at a blackjack table. She just needs to keep it together until Livie is no longer a minor, and then they can get the hell out of Grand Rapids, Michigan.", "But when Uncle Raymond slides into bed next to Livie one night, Kacey decides it’s time to run. Armed with two bus tickets and dreams of living near the coast, Kacey and Livie start their new lives in a Miami apartment complex, complete with a grumpy landlord, a pervert upstairs, and a neighbor with a stage name perfectly matched to her chosen “profession.” But Kacey’s not worried. She can handle all of them. What she can’t handle is Trent Emerson in apartment 1D.", "Kacey doesn’t want to feel. She doesn’t. It’s safer that way. For everyone. But sexy Trent finds a way into her numb heart, reigniting her ability to love again. She starts to believe that maybe she can leave the past where it belongs and start over. Maybe she’s not beyond repair.", "But Kacey isn’t the only one who’s broken. Seemingly perfect Trent has an unforgiveable past of his own; one that, when discovered, will shatter Kacey’s newly constructed life and send her back into suffocating darkness."], "author": "K.A. Tucker", "num_pages": "262", "awards": ["Goodreads Choice Award Nominee for Best Romance (2013)"], "places": ["Miami, Florida"], "character_names": ["Kacey Cleary", "Trent Emerson", "Nora Matthews", "Dan Ryder"], "language": "English", "publish_date": "2012-12-11 00:00:00", "ISBN": "0991686004"},
{"url": "https://www.goodreads.com/book/show/68783.Girl_Interrupted", "num_ratings": "161,027", "num_reviews": "3,944", "avg_ratings": 3.9, "genres": ["Nonfiction", "Autobiography", "Memoir", "Psychology"], "title": "Girl, Interrupted", "description": ["\"Searing . . . captures an exquisite range of self-awareness between madness and insight.\"", "First published in 1994. Reprinted and a bestseller in 2000 (due to movie based on the book).", "In the late 1960s, the author spent nearly two years on the ward for teenage girls at McLean Hospital, a renowned psychiatric facility. Her memoir encompasses horror and razor-edged perception", "\"Searing . . . captures an exquisite range of self-awareness between madness and insight.\"", "First published in 1994. Reprinted and a bestseller in 2000 (due to movie based on the book).", "In the late 1960s, the author spent nearly two years on the ward for teenage girls at McLean Hospital, a renowned psychiatric facility. Her memoir encompasses horror and razor-edged perceptions, while providing vivid portraits of her fellow patients and their keepers. ", "\"Searing . . . captures an exquisite range of self-awareness between madness and insight.\"--Boston Globe."], "author": "Susanna Kaysen", "num_pages": "169", "awards": [], "places": [], "character_names": ["Susanna Kaysen"], "language": "English", "publish_date": "1994-04-19 00:00:00", "ISBN": "0679746048"},
{"url": "https://www.goodreads.com/book/show/12351649-perfection", "num_ratings": "57,545", "num_reviews": "2,604", "avg_ratings": 4.16, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Humor", "Funny", "Adult"], "title": "Perfection", "description": ["Zoe is used to taking care of herself and has long ago accepted that if anything bad was going to happen, it was going to happen to her. So when she loses her job over something most bosses would probably be happy with and her life starts going down hill from there she doesn't expect it to get any better. She certainly didn't expect any help from the loud jerk next door, b", "Zoe is used to taking care of herself and has long ago accepted that if anything bad was going to happen, it was going to happen to her. So when she loses her job over something most bosses would probably be happy with and her life starts going down hill from there she doesn't expect it to get any better. She certainly didn't expect any help from the loud jerk next door, but then again she has nothing to lose so puts her trust in him and hopes for the best. What she didn't expect was the once in a lifetime opportunity that he offers her through an arrangement where they both benefit and no one is supposed to get hurt, but she should have known better because her luck has never been that good.", "Like most Bradfords, Trevor has a soft spot for food, but that's about all. He leads a pretty straightforward life and likes to keep things simple and that includes his relationships. He wants the perfect woman and knows exactly what she'll be like. So when he discovers much to his horror that he's thinking about his frumpy little neighbor he decides the best way to get his head straight is by working her out of his system. He'll keep her around, but only until he finds perfection."], "author": "R.L. Mathewson", "num_pages": "247", "awards": [], "places": [], "character_names": ["Trevor Bradford", "Zoe O'Shea"], "language": "English", "publish_date": "2011-08-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/31558066-win-some-lose-some", "num_ratings": "1,568", "num_reviews": "307", "avg_ratings": 4.4, "genres": ["Romance", "Young Adult", "Contemporary", "New Adult", "Young Adult", "High School", "Romance", "Contemporary Romance"], "title": "Win Some, Lose Some", "description": ["For Matthew Rohan, every day is a struggle. Each task others complete without thinking is a challenge for him. Recently orphaned, he has to finish the last few months of high school and take care of his disabled sister on his own.", "When Mayra comes into his life, his comfortable routines implode. Matthew can’t handle change, but Mayra is unrelenting in her quest to understan", "For Matthew Rohan, every day is a struggle. Each task others complete without thinking is a challenge for him. Recently orphaned, he has to finish the last few months of high school and take care of his disabled sister on his own.", "When Mayra comes into his life, his comfortable routines implode. Matthew can’t handle change, but Mayra is unrelenting in her quest to understand him, to show him acceptance and maybe even love. When she breaks through his shell, Matthew’s world will never be the same again.", "An awkward boy with Asperger’s Syndrome, a persistent girl who pulls him out of his isolated existence, and a lottery ticket that will change their lives forever."], "author": "Shay Savage", "num_pages": "425", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18373.Flowers_for_Algernon", "num_ratings": "382,483", "num_reviews": "13,212", "avg_ratings": 4.09, "genres": ["Fiction", "Classics", "Science Fiction", "Young Adult"], "title": "Flowers for Algernon", "description": ["The story of a mentally disabled man whose experimental quest for intelligence mirrors that of Algernon, an extraordinary lab mouse. In diary entries, Charlie tells how a brain operation increases his IQ and changes his life. As the experimental procedure takes effect, Charlie's intelligence expands until it surpasses that of the doctors who engineered his metamorphosis. T", "The story of a mentally disabled man whose experimental quest for intelligence mirrors that of Algernon, an extraordinary lab mouse. In diary entries, Charlie tells how a brain operation increases his IQ and changes his life. As the experimental procedure takes effect, Charlie's intelligence expands until it surpasses that of the doctors who engineered his metamorphosis. The experiment seems to be a scientific breakthrough of paramount importance--until Algernon begins his sudden, unexpected deterioration. Will the same happen to Charlie?"], "author": "Daniel Keyes", "num_pages": "311", "awards": ["Hugo Award Nominee for Best Novel (1967)", "Nebula Award for Best Novel (1966)", "Locus Award Nominee for All-Time Best Novel (1975)"], "places": ["New York City, New York"], "character_names": ["Charlie Gordon", "Alice Kinnian"], "language": "English", "publish_date": "2005-05-01 00:00:00", "ISBN": "0156030306"},
{"url": "https://www.goodreads.com/book/show/16081754-find-you-in-the-dark", "num_ratings": "25,856", "num_reviews": "1,992", "avg_ratings": 3.98, "genres": ["Romance", "New Adult", "Young Adult", "Contemporary", "Romance", "Contemporary Romance"], "title": "Find You in the Dark", "description": ["Maggie Young had the market on normal. Normal friends, normal parents, normal grades.. normal life. ", " ", " Clayton Reed was running from his past and an army of personal demons that threatened to take him down. He never thought he had a chance at happiness. Until her.", " Maggie thought their love could overcome anything. Clay thought she was all he needed to fix his mes", "Maggie Young had the market on normal. Normal friends, normal parents, normal grades.. normal life. ", " ", " Clayton Reed was running from his past and an army of personal demons that threatened to take him down. He never thought he had a chance at happiness. Until her.", " Maggie thought their love could overcome anything. Clay thought she was all he needed to fix his messy life. That together, they could face the world. But the darkness is always waiting.", " Sometimes the greatest obstacle to true love is within yourself."], "author": "A. Meredith Walters", "num_pages": "290", "awards": [], "places": [], "character_names": ["Maggie Young", "Clayton Reed"], "language": "English", "publish_date": "2012-10-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20504754-transcendence", "num_ratings": "13,961", "num_reviews": "2,430", "avg_ratings": 4.11, "genres": ["Romance", "Science Fiction", "Time Travel", "Historical", "Romance", "Historical Romance", "Fantasy", "Adult", "Historical", "Historical Fiction"], "title": "Transcendence", "description": ["It’s said that women and men are from two different planets when it comes to communication, but how can they overcome the obstacles of prehistoric times when one of them simply doesn’t have the ability to comprehend language?", "Ehd’s a caveman living on his own in a harsh wilderness. He’s strong and intelligent, but completely alone. When he finds a beautiful young woman in h", "It’s said that women and men are from two different planets when it comes to communication, but how can they overcome the obstacles of prehistoric times when one of them simply doesn’t have the ability to comprehend language?", "Ehd’s a caveman living on his own in a harsh wilderness. He’s strong and intelligent, but completely alone. When he finds a beautiful young woman in his pit trap, it’s obvious to him that she is meant to be his mate. He doesn’t know where she came from; she’s wearing some pretty odd clothing, and she makes a lot of noises with her mouth that give him a headache. Still, he’s determined to fulfill his purpose in life – provide for her, protect her, and put a baby in her.", "Elizabeth doesn’t know where she is or exactly how she got there. She’s confused and distressed by her predicament, and there’s a caveman hauling her back to his cavehome. She’s not at all interested in Ehd’s primitive advances, and she just can’t seem to get him to listen. No matter what she tries, getting her point across to this primitive, but beautiful, man is a constant – and often hilarious – struggle. ", "With only each other for company, they must rely on one another to fight the dangers of the wild and prepare for the winter months. As they struggle to coexist, theirs becomes a love story that transcends language and time."], "author": "Shay Savage", "num_pages": "312", "awards": ["Goodreads Choice Award Nominee for Romance (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/692935.Simple_Jess", "num_ratings": "2,493", "num_reviews": "244", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Historical", "Historical Fiction"], "title": "Simple Jess", "description": ["The last thing widow Althea Winsloe wanted to do was remarry. Unfortunately, her meddlesome mountain neighbors had other plans. So, one autumn night they banded together and gave Althea a shocking ultimatum: She was to find herself a husband by Christmas...or the town would do it for her! ", "Althea knew she had her choice of any single man in Marrying Stone, Arkansas. Yet the", "The last thing widow Althea Winsloe wanted to do was remarry. Unfortunately, her meddlesome mountain neighbors had other plans. So, one autumn night they banded together and gave Althea a shocking ultimatum: She was to find herself a husband by Christmas...or the town would do it for her! ", "Althea knew she had her choice of any single man in Marrying Stone, Arkansas. Yet the only one she felt truly comfortable with was Simple Jess.", "Sweet and gentle, Jess wasn't as smart as your average man. But his tender manner stirred Althea's heart in ways she had never dreamed possible.", "It would take a miracle to find a husband in Marrying Stone. But sometimes miracles are right under your nose."], "author": "Pamela Morsi", "num_pages": "325", "awards": [], "places": ["Ozark Mountains", "Arkansas"], "character_names": ["Althea Winsloe", "Jesse Best"], "language": "English", "publish_date": "1996-04-01 00:00:00", "ISBN": "0515118370"},
{"url": "https://www.goodreads.com/book/show/22471294-black-lies", "num_ratings": "24,745", "num_reviews": "4,023", "avg_ratings": 4.31, "genres": ["Romance", "Adult Fiction", "Erotica", "Romance", "Contemporary Romance", "Contemporary", "Dark", "Adult"], "title": "Black Lies", "description": ["Brant:", "Became a tech billionaire by his twentieth birthday. Has been in a relationship with me for 3 years. Has proposed 4 times. Been rejected 4 times.", "Lee:", "Cuts grass when he's not banging housewives. Good with his hands, his mouth, and his body. Has been pursued relentlessly by me for almost 2 years, whether he knows it or not. ", "Go ahead. Judge me. You have no idea what my", "Brant:", "Became a tech billionaire by his twentieth birthday. Has been in a relationship with me for 3 years. Has proposed 4 times. Been rejected 4 times.", "Lee:", "Cuts grass when he's not banging housewives. Good with his hands, his mouth, and his body. Has been pursued relentlessly by me for almost 2 years, whether he knows it or not. ", "Go ahead. Judge me. You have no idea what my love entails.", "If you think you've heard this story before, trust me - you haven't.", "**This is a STANDALONE full-length novel. It is not part of a series, and does not contain a cliffhanger.**"], "author": "Alessandra Torre", "num_pages": "290", "awards": ["Goodreads Choice Award Nominee for Romance (2014)"], "places": ["San Francisco, California"], "character_names": ["Lee", "Brant Sharp", "Layana Fairmont"], "language": "English", "publish_date": "2014-08-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16068905-fangirl", "num_ratings": "442,520", "num_reviews": "43,523", "avg_ratings": 4.1, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "Fangirl", "description": ["From the author of the", " bestseller ", ". ", "Cath is a Simon Snow fan.", "Okay, the whole world is a Simon Snow fan...", "But for Cath, being a fan is her life—and she’s really good at it. She and her twin sister, Wren, ensconced themselves in the Simon Snow series when they were just kids; it’s w", "From the author of the", " bestseller ", ". ", "Cath is a Simon Snow fan.", "Okay, the whole world is a Simon Snow fan...", "But for Cath, being a fan is her life—and she’s really good at it. She and her twin sister, Wren, ensconced themselves in the Simon Snow series when they were just kids; it’s what got them through their mother leaving. Reading. Rereading. Hanging out in Simon Snow forums, writing Simon Snow fan fiction, dressing up like the characters for every movie premiere.", "Cath’s sister has mostly grown away from fandom, but Cath can’t let go. She doesn’t want to.", "Now that they’re going to college, Wren has told Cath she doesn’t want to be roommates. Cath is on her own, completely outside of her comfort zone. She’s got a surly roommate with a charming, always-around boyfriend, a fiction-writing professor who thinks fan fiction is the end of the civilized world, a handsome classmate who only wants to talk about words... And she can’t stop worrying about her dad, who’s loving and fragile and has never really been alone.", "For Cath, the question is: Can she do this? Can she make it without Wren holding her hand? Is she ready to start living her own life? Writing her own stories?", "And does she even want to move on if it means leaving Simon Snow behind?"], "author": "Rainbow Rowell", "num_pages": "481", "awards": ["Milwaukee County Teen Book Award Nominee (2015)", "The Inky Awards Nominee for Silver Inky (2015)", "Lincoln Award Nominee (2016)", "Goodreads Choice Award Nominee for Young Adult Fiction (2013)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2014)"], "places": ["Lincoln, Nebraska", "Omaha, Nebraska"], "character_names": ["Wren", "Levi", "Cath Avery"], "language": "English", "publish_date": "2013-09-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/286957.The_Yellow_Wall_Paper", "num_ratings": "66,605", "num_reviews": "3,274", "avg_ratings": 4.11, "genres": ["Classics", "Short Stories", "Fiction", "Horror", "Feminism", "Gothic"], "title": "The Yellow Wall-Paper", "description": ["‘It is stripped off - the paper - in great patches . . . The colour is repellent . . . In the places where it isn’t faded and where the sun is just so - I can see a strange, provoking, formless sort of figure, that seems to skulk about . . .’", "Based on the author’s own experiences, 'The Yellow Wallpaper' is the chilling tale of a woman driven to the brink of insanity by the", "‘It is stripped off - the paper - in great patches . . . The colour is repellent . . . In the places where it isn’t faded and where the sun is just so - I can see a strange, provoking, formless sort of figure, that seems to skulk about . . .’", "Based on the author’s own experiences, 'The Yellow Wallpaper' is the chilling tale of a woman driven to the brink of insanity by the ‘rest cure’ prescribed after the birth of her child. Isolated in a crumbling colonial mansion, in a room with bars on the windows, the tortuous pattern of the yellow wallpaper winds its way into the recesses of her mind.", "Charlotte Perkins Gilman was America’s leading feminist intellectual of the early twentieth century. In addition to her masterpiece 'The Yellow Wallpaper', this new edition includes a selection of her best short fiction and extracts from her autobiography."], "author": "Charlotte Perkins Gilman", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-09-01 00:00:00", "ISBN": "1558611584"},
{"url": "https://www.goodreads.com/book/show/10194514-pushing-the-limits", "num_ratings": "106,809", "num_reviews": "7,698", "avg_ratings": 4.07, "genres": ["Young Adult", "Romance", "Contemporary", "New Adult"], "title": "Pushing the Limits", "description": ["No one knows what happened the night Echo Emerson went from popular girl with jock boyfriend to gossiped-about outsider with \"freaky\" scars on her arms. Even Echo can't remember the whole truth of that horrible night. All she knows is that she wants everything to go back to normal. But when Noah Hutchins, the smoking-hot, girl-using loner in the black leather jacket, explodes into her life with his tough attitude and surprising understanding, Echo's world shifts in ways she could never have imagined. They should have nothing in common. And with the secrets they both keep, being together is pretty much", ". Yet the crazy attraction between them refuses to go away. And Echo has to ask herself just how far they can push the limits and what she'll risk for the one guy who might teach her how to love again..."], "author": "Katie McGarry", "num_pages": "392", "awards": ["RITA Award by Romance Writers of America Nominee for First Book & Nominee for Young Adult Romance (2013)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Contemporary Novel (2012)", "Gayle Wilson Award of Excellence for Young Adult Fiction (2013)", "New England Chapter RWA Readers' Choice for Young Adult Fiction (2013)"], "places": ["Kentucky"], "character_names": ["Echo Emerson", "Noah Hutchins"], "language": "English", "publish_date": "2012-07-31 00:00:00", "ISBN": "0373210493"},
{"url": "https://www.goodreads.com/book/show/6514.The_Bell_Jar", "num_ratings": "485,489", "num_reviews": "18,037", "avg_ratings": 3.99, "genres": ["Classics", "Fiction", "Feminism"], "title": "The Bell Jar", "description": ["Sylvia Plath's shocking, realistic, and intensely emotional novel about a woman falling into the grip of insanity. ", "Esther Greenwood is brilliant, beautiful, enormously talented, and successful, but slowly going under—maybe for the last time. In her acclaimed and enduring masterwork, Sylvia Plath brilliantly draws the reader into Esther's breakdown with such intensity that", "Sylvia Plath's shocking, realistic, and intensely emotional novel about a woman falling into the grip of insanity. ", "Esther Greenwood is brilliant, beautiful, enormously talented, and successful, but slowly going under—maybe for the last time. In her acclaimed and enduring masterwork, Sylvia Plath brilliantly draws the reader into Esther's breakdown with such intensity that her insanity becomes palpably real, even rational—as accessible an experience as going to the movies. A deep penetration into the darkest and most harrowing corners of the human psyche, ", " is an extraordinary accomplishment and a haunting American classic."], "author": "Sylvia Plath", "num_pages": "244", "awards": [], "places": ["Boston, Massachusetts", "New York City, New York"], "character_names": ["Constantin", "Esther Greenwood", "Valerie", "Marco", "Mrs. Greenwood", "Buddy Willard", "Doctor Nolan", "Joan Gilling", "Jay Cee", "Betsy", "Irwin", "Doctor Gordon", "Philomena Guinea", "Mrs. Willard", "Lenny Shepherd", "Dodo Conway", "Eric", "Doreen"], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0061148512"},
{"url": "https://www.goodreads.com/book/show/18055732-boy-in-the-ivy", "num_ratings": "14", "num_reviews": "2", "avg_ratings": 4.57, "genres": ["Psychology", "Health", "Mental Health", "Medicine", "Psychiatry"], "title": "Boy in the Ivy: The Inner Child of a Buried Man", "description": ["In 2009, T McKinley's brother committed suicide, and his first question to himself was why he hadn't done the same. In this moving and poignant memoir, McKinley takes the reader back through the events that led to a lifelong struggle with depression, shame, and inadequacy. Beginning with his own conception and birth and continuing through his parents' divorce and the fragm", "In 2009, T McKinley's brother committed suicide, and his first question to himself was why he hadn't done the same. In this moving and poignant memoir, McKinley takes the reader back through the events that led to a lifelong struggle with depression, shame, and inadequacy. Beginning with his own conception and birth and continuing through his parents' divorce and the fragmentation of his family, McKinley traces the origins and evolution of his deep-seated belief that everyone would have been better off if he had never existed at all. In this way, McKinley blamed, rejected, and buried his inner child, setting himself up for a lifetime of disconnection and depression. Years later, McKinley married, had two children, and soon saw that he was repeating the same toxic patterns that defined his own childhood. His feelings of hopelessness continued to increase until the family bought a fixer-upper house in suburban Virginia. As they sifted through the rubble of the dysfunctional family that had come before, McKinley was brought face-to-face with the pain that had buried him for far too long. He began to realize his own value to his family and reconnect with his own childhood-and the innocent child he had once been-in a more compassionate and loving way. He realized he was not broken, but that he did need to ask for help. Ultimately, through this experience, McKinley was able to find the hope that his brother never could. McKinley approaches difficult subjects with insight and humor, in a direct and disarming way. Readers are invited to approach their own issues with shame and depression with compassion instead of fear, and to confront their own patterns of disconnection and isolation with hope instead of powerlessness. McKinley had contemplated suicide often, but he learned that sometimes the greatest strength comes from admitting you need help. T. McKinley has an undergraduate degree in religious studies and a master's degree in folklore. He has worked a variety of jobs in his life, including short-order cook, towel boy at a YMCA, sperm donor, bartender, and professional cartoonist, and he spent six years working as a stand-up comic in Los Angeles. For the past eighteen years, he has taught English and theater in a variety of private middle and high schools. He is a suicide survivor who is happily married with two children."], "author": "T. McKinley", "num_pages": "284", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-04 00:00:00", "ISBN": "1482761297"},
{"url": "https://www.goodreads.com/book/show/21567813-the-attic-of-sand-and-secrets", "num_ratings": "27", "num_reviews": "17", "avg_ratings": 4.41, "genres": ["Mystery", "Fantasy", "Childrens", "Middle Grade", "Young Adult"], "title": "The Attic of Sand and Secrets", "description": ["Lily, a learning disabled girl, attempts to unravel the mystery of her abducted mother using supernatural clues from an ancient stranger, even when it means posing a danger to herself."], "author": "Medeia Sharif", "num_pages": "107", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20830175-dream-brother", "num_ratings": "33", "num_reviews": "7", "avg_ratings": 3.76, "genres": ["Health", "Mental Health", "Fiction", "Abandoned", "Psychology"], "title": "Dream Brother: A Novel", "description": ["San Francisco, California. Fifty hills surrounded by the cold waters of the ocean and the bay. City of rebellion and revolution. Smothered by fog daily. ", "This is the place where Jacob Gavel grew up, the place he ran away from at twenty, and the place he never thought he’d come back to. ", "The city’s in the middle of its second financial re", "San Francisco, California. Fifty hills surrounded by the cold waters of the ocean and the bay. City of rebellion and revolution. Smothered by fog daily. ", "This is the place where Jacob Gavel grew up, the place he ran away from at twenty, and the place he never thought he’d come back to. ", "The city’s in the middle of its second financial renaissance. A century and a half earlier, gold nuggets. In the year 2000, silicon microchips. The dot-com boom created hundreds of new companies, swollen with capital and potential, profitable only in theory, run by young professionals with a lot of disposable income. ", "After Jacob, a fledgling sculptor, leaves a failed marriage and flees New York City, he returns home, welcomed by his mentally ill mother, subordinate father, and successful sister. As he settles in, he discovers a family secret. He had a twin brother who died in the womb right next to him. When the shock wears off, his reality becomes clear. He’s alone, broke, and unemployed. In an attempt to rebuild his life, he takes a low-paying job as a mental health case manager, but with all the tech money flooding the city, his childhood friend, Paul, has a better idea. ", "His fresh start spoils. Events trigger his dreams, and his dreams resurrect childhood memories, propelling him forward on a sleep-deprived, speed-fueled mission to find recognition, love, and revenge.", "( ", " )"], "author": "Brian Marggraf", "num_pages": "245", "awards": [], "places": ["San Francisco, California"], "character_names": [], "language": "English", "publish_date": "2014-01-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18596523-the-bride-stripped-bare-by-her-bachelors-even", "num_ratings": "106", "num_reviews": "29", "avg_ratings": 4.11, "genres": ["Fiction", "Art", "Mental Health", "Mental Illness"], "title": "The Bride Stripped Bare By Her Bachelors, Even", "description": ["This is a wonderful comic novel, about philosophy, the nature of art, the beauty of the ordinary, and about quirky, complete, night & day victims of obsessive-compulsive disorder. Two charming, over-anxious, germ-phobic friends, Isaac and Greg take a road trip from Boston to Philadelphia. They are both obsessed with Marcel Duchamp, his art and his ideas, and thus the d", "This is a wonderful comic novel, about philosophy, the nature of art, the beauty of the ordinary, and about quirky, complete, night & day victims of obsessive-compulsive disorder. Two charming, over-anxious, germ-phobic friends, Isaac and Greg take a road trip from Boston to Philadelphia. They are both obsessed with Marcel Duchamp, his art and his ideas, and thus the destination has to be the largest collection of Duchamp in the world, The Philadelphia Art Museum, the actual place \"The Bride Stripped Bare by Her Bachelors, Even\" was to be delivered when it was cracked and broken in shipment. The piece is sometimes known as The Large Glass, and today it sits in the middle of a large gallery proudly displayed in its broken state which Duchamp repaired and then certified had been his intention all along.", "The two men are driven in a rented disinfected Winnebago by Kelly, a beautiful art scholar who smells like a mixture of lemons and fresh sawdust. They intend to pick up an ancient chocolate grinder, an exact working sculptural copy of one used in a Duchamp painting. Isaac intends to grind his own pure chocolate, which will prevent the build-up or arterial plaque, because his mother died of a stroke. Every action has its own suitable reaction, and then some. Isaac hopes eventually to overcome his devotion to his many obsessions and to re-enter the world, evidently his version of the real world. He is not an unreliable narrator, he is a hyper-reliable narrator, consumed by his own attention and thrilled with the connections he sees everywhere all at once. Of course when he finally gets to the museum he must dress-up as a woman to visit the collection."], "author": "Chris F. Westbury", "num_pages": "312", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-06-10 00:00:00", "ISBN": "1619022907"},
{"url": "https://www.goodreads.com/book/show/18685092-stim", "num_ratings": "146", "num_reviews": "70", "avg_ratings": 4.06, "genres": ["New Adult", "Fiction", "Contemporary", "Young Adult"], "title": "Stim", "description": ["Robert is different. He has Asperger's Syndrome. He experiences the world differently to 99% of the population. Follow his entertaining and highly empathetic story as he struggles to realise and accept who he really is, try to understand other people—which he cannot—and find a girlfriend. Especially find a girlfriend—he's decided it's his special project for the year. Acco", "Robert is different. He has Asperger's Syndrome. He experiences the world differently to 99% of the population. Follow his entertaining and highly empathetic story as he struggles to realise and accept who he really is, try to understand other people—which he cannot—and find a girlfriend. Especially find a girlfriend—he's decided it's his special project for the year. Accompanied on this transformative journey by his quirky flatmates, Chloe (who also has Asperger's, amongst other things), Stef (who hasn't, but doesn't mind) and their oddly-named kitten, Robert endures a myriad of awkward moments in his quest to meet a nice, normal girl...and not even a major earthquake will stop him.", "This absorbing and humorous story is starkly told from Robert's point of view, through the kaleidoscope of autistic experience."], "author": "Kevin Berry", "num_pages": "176", "awards": ["Kindle Book Award Nominee for Literary Fiction (Semi-Finalist) (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18009591-irish-firebrands", "num_ratings": "7", "num_reviews": "5", "avg_ratings": 4.57, "genres": ["Cultural", "Ireland", "Romance", "Contemporary Romance", "Historical"], "title": "Irish Firebrands", "description": ["He's an Irish political journalist who's in search of his past. She's an American professional genealogist who's trying to forget hers. But what's the real reason that keeps bringing them together?", "Synopsis:", "The Celtic Tiger is losing its fangs, so journalist Dillon Carroll must rent his farm in the Gaeltacht. The worsening exchange rate depletes the budget of genealogist La", "He's an Irish political journalist who's in search of his past. She's an American professional genealogist who's trying to forget hers. But what's the real reason that keeps bringing them together?", "Synopsis:", "The Celtic Tiger is losing its fangs, so journalist Dillon Carroll must rent his farm in the Gaeltacht. The worsening exchange rate depletes the budget of genealogist Lana Pedersen, so the baby-boomer backpacker breaks into a vacant farmhouse for shelter. After the Irishman discovers the American at Drumcarroll, their tangent lives catalyze the chemistry between their beleaguered bodies and stormy spirits. ", "Dillon stalks Lana with the drive of an investigative reporter; Lana attempts to counter Dillon’s obsessions; compel her emotions to conform to her faith; deal with unfathomable feelings about Drumcarroll farm; flirt with a dairy farmer possessing unusual avocations; and mentor a troubled teenager. Set amid the social controversies of contemporary Ireland, ", " portrays psychological crises shattering the bedrock of beliefs and belonging.", "Terrible questions - tragic secrets. Touched by madness - torn by vows. Fleeing the past - fearing the future. A quest for deliverance - and evocative evidence that love is eternal.... ", "(New Standard International Edition.)"], "author": "Christine Plouvier", "num_pages": "482", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-19 00:00:00", "ISBN": "1484165705"},
{"url": "https://www.goodreads.com/book/show/9992246-eating-smoke", "num_ratings": "505", "num_reviews": "49", "avg_ratings": 3.57, "genres": ["Nonfiction", "Mystery", "Crime", "Psychology", "Autobiography", "Memoir", "Cultural", "China", "Mental Health", "Mental Illness"], "title": "Eating Smoke: One Man's Descent Into Crystal Meth Psychosis in Hong Kong's Triad Heartland", "description": ["Chris Thrall left the Royal Marines to find fortune in Hong Kong, but following a bizarre series of jobs ended up homeless and in psychosis from crystal meth.", "He began working for the 14K, a notorious crime syndicate, as a nightclub doorman in the Wan Chai red-light district, where he uncovered a vast global conspiracy and the 'Foreign Triad' - a secretive expat clique in c", "Chris Thrall left the Royal Marines to find fortune in Hong Kong, but following a bizarre series of jobs ended up homeless and in psychosis from crystal meth.", "He began working for the 14K, a notorious crime syndicate, as a nightclub doorman in the Wan Chai red-light district, where he uncovered a vast global conspiracy and the 'Foreign Triad' - a secretive expat clique in cahoots with the Chinese gangs.", "Alone and confused in the neon glare of Hong Kong's seedy backstreets, Chris was forced to survive in the world's most unforgiving city, hooked on the world's most dangerous drug.", "Engaging, honest and full of Chris's irrepressible humour, this remarkable memoir combines gripping storytelling with brooding menace as the Triads begin to cast their shadow over him. The result is a truly psychotic urban nightmare ..."], "author": "Chris Thrall", "num_pages": "420", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-16 00:00:00", "ISBN": "9881900298"},
{"url": "https://www.goodreads.com/book/show/18147053-a-kid-s-guide-to-autism", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 5.0, "genres": ["Childrens"], "title": "A Kid's Guide to Autism", "description": ["Most people look at Autism as a disability because they only see someone who isn't acting \"normal\" and they haven't learned about Autism. I think of Autism as just another type of person who does things a little differently. You might be wondering why I think of Autism differently than most people. This is because my little brother Carter has Autism. Carter is 6 years old", "Most people look at Autism as a disability because they only see someone who isn't acting \"normal\" and they haven't learned about Autism. I think of Autism as just another type of person who does things a little differently. You might be wondering why I think of Autism differently than most people. This is because my little brother Carter has Autism. Carter is 6 years old and he is the best little brother. One out of 88 children in the United States has Autism, so at some point in your life, you will know someone that has it. Cameron Davis is a second grade student at Village Elementary located in Hilton, NY. He lives with his parents, two brothers, and dog."], "author": "Cameron Davis", "num_pages": "30", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-06-25 00:00:00", "ISBN": "1490534989"},
{"url": "https://www.goodreads.com/book/show/18593080-water-and-fire", "num_ratings": "314", "num_reviews": "67", "avg_ratings": 3.51, "genres": ["Romance", "Fantasy", "Paranormal", "Fantasy", "Contemporary", "Romance", "Contemporary Romance"], "title": "Water and Fire", "description": ["Working as a student midwife in an Australian country hospital is never easy, but Belinda finds more trouble than most.", "There's the intern doctor who follows her around like an overgrown puppy, the dangerous local wil", "Working as a student midwife in an Australian country hospital is never easy, but Belinda finds more trouble than most.", "There's the intern doctor who follows her around like an overgrown puppy, the dangerous local wildlife and her own secrets she must keep. ", "When she finds herself without a place to live, what else can possibly go wrong? ", "Or is it time for something to go right? ", "I touched my fingers to his shoulder to steady myself before reaching for my drink. ", "His face split in a wide grin beneath his ocean-deep eyes. \"I think you've had enough. What'll you give me for it?\"", "I shrugged. \"What do you want?\" ", "His smile shrank, becoming more thoughtful. \"You could start with a kiss.\"", "I looked into those yearning, deep-water eyes of a man who seemed all fire. ", "I cautiously placed my hands on the sides of his face and touched my lips to his. His mouth was open, so the draught of his breath cooled my lips for the briefest moment before I pulled away. ", "\"F*** that!\" He strode to the coffee table and clunked the glasses down. His hands were empty for barely a moment before they were splayed warmly on my back. \"Belinda. That's not a kiss.\"", "I moved with him as he pulled me closer, one of his hands travelling up to the back of my neck as the other drifted down to the small of my back. I leaned in closer still. ", "He bowed his head as I tilted mine up. I wet my lips and parted them, feeling fear for the first time. ", " ", "He pressed his mouth to mine, layering our lips as we shared a breath. His smiling blue eyes drooped to show blue-veined lids as his tongue stroked mine. ", "His shoulders were smooth beneath my questing fingers, his lips warm and responsive as I deepened my kiss. I felt his chuckle rumble through both of us, though I couldn't see him with my eyes closed. He tasted of whiskey with a hint of chocolate and I wanted more...", "\"Now that's a kiss.\" ", "This book is a stand-alone prequel to the Ocean's Gift series, which currently includes:", "  ", " (Book 1) \n  ", " ", " (Book 2) \n  ", " \n    ", "\n   \n "], "author": "Demelza Carlton", "num_pages": "168", "awards": [], "places": ["Australia"], "character_names": [], "language": "English", "publish_date": "2013-11-16 00:00:00", "ISBN": "1492732451"},
{"url": "https://www.goodreads.com/book/show/77276.A_Swiftly_Tilting_Planet", "num_ratings": "91,463", "num_reviews": "1,986", "avg_ratings": 4.12, "genres": ["Fantasy", "Young Adult", "Fiction", "Science Fiction", "Science Fiction Fantasy", "Childrens"], "title": "A Swiftly Tilting Planet", "description": ["In this companion volume to \"A Wrinkle In Time\" (Newbery Award winner) and \"A Wind In The Door\" fifteen-year-old Charles Wallace and the unicorn Gaudior undertake a perilous journey through time in a desperate attempt to stop the destruction of the world by the mad dictator Madog Branzillo. They are not alone in their quest. Charles Wallace's sister, Meg--grown and expecti", "In this companion volume to \"A Wrinkle In Time\" (Newbery Award winner) and \"A Wind In The Door\" fifteen-year-old Charles Wallace and the unicorn Gaudior undertake a perilous journey through time in a desperate attempt to stop the destruction of the world by the mad dictator Madog Branzillo. They are not alone in their quest. Charles Wallace's sister, Meg--grown and expecting her first child, but still able to enter her brother's thoughts and emotions by \"kything\"--goes with him in spirit.But in overcoming the challenges, Charles Wallace must face the ultimate test of his faith and will, as he is sent within four people from another time, there to search for a way to avert the tragedy threatening them all."], "author": "Madeleine L'Engle", "num_pages": "256", "awards": ["National Book Award for Children's Books (Paperback) (1980)"], "places": [], "character_names": ["Meg Murry", "Charles Wallace Murry", "Mrs. O'Keefe", "Mad Dog Branzillo", "Gaudior", "Echthroi", "Harcels", "Madoc Gywnedd", "Brandon Llawcae", "Matthew Maddox", "Chuck Maddox"], "language": "English", "publish_date": "1979-07-16 00:00:00", "ISBN": "0440401585"},
{"url": "https://www.goodreads.com/book/show/28186.The_Sea_of_Monsters", "num_ratings": "604,347", "num_reviews": "22,073", "avg_ratings": 4.23, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Fiction"], "title": "The Sea of Monsters", "description": ["The heroic son of Poseidon makes an action-packed comeback in the second must-read installment of Rick Riordan's amazing young readers series. Starring Percy Jackson, a \"half blood\" whose mother is human and whose father is the God of the Sea, Riordan's series combines cliffhanger adventure and Greek mythology lessons that results in true page-turners that get better with", "The heroic son of Poseidon makes an action-packed comeback in the second must-read installment of Rick Riordan's amazing young readers series. Starring Percy Jackson, a \"half blood\" whose mother is human and whose father is the God of the Sea, Riordan's series combines cliffhanger adventure and Greek mythology lessons that results in true page-turners that get better with each installment. ", "In this episode, The Sea of Monsters, Percy sets out to retrieve the Golden Fleece before his summer camp is destroyed, surpassing the first book's drama and setting the stage for more thrills to come."], "author": "Rick Riordan", "num_pages": "279", "awards": [], "places": ["Miami, Florida", "Atlantic Ocean", "Bermuda Triangle"], "character_names": ["Tyson", "Annabeth Chase", "Grover Underwood", "Luke Castellan", "Ares (god)", "Circe", "Blackbeard", "Chiron", "Hermes", "Polyphemus", "Clarisse", "Percy Jackson"], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0786856866"},
{"url": "https://www.goodreads.com/book/show/561456.The_Titan_s_Curse", "num_ratings": "552,354", "num_reviews": "16,984", "avg_ratings": 4.34, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Fiction"], "title": "The Titan's Curse", "description": ["It's not everyday you find yourself in combat with a half-lion, half-human.", "But when you're the son of a Greek god, it happens. And now my friend Annabeth is missing, a goddess is in chains and only five half-blood heroes can join the quest to defeat the doomsday monster.", "Oh, and guess what? The Oracle has predicted that not all of us will survive..."], "author": "Rick Riordan", "num_pages": "320", "awards": ["Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2009)"], "places": ["United States of America"], "character_names": ["Artemis (Goddess)", "Nico di Angelo", "Thalia Grace", "Tyson", "Annabeth Chase", "Demeter (Goddess)", "Grover Underwood", "Zeus (God)", "Dionysus (mythology)", "Ares (god)", "Athena (Greek goddess)", "Hera", "Atlas", "Luke", "Poseidon (God)", "Zöe", "Chiron", "Mr. Chase", "Dr. Thorn", "Aphrodite", "Bianca di Angelo", "Percy Jackson"], "language": "English", "publish_date": "2007-05-05 00:00:00", "ISBN": "0141382899"},
{"url": "https://www.goodreads.com/book/show/4502507-the-last-olympian", "num_ratings": "546,017", "num_reviews": "19,276", "avg_ratings": 4.5, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Last Olympian", "description": ["All year the half-bloods have been preparing for battle against the Titans, knowing the odds of a victory are grim. Kronos’s army is stronger than ever, and with every god and half-blood he recruits, the evil Titan’s power only grows. ", "While the Olympians struggle to contain the rampaging monster Typhon, Kronos begins his advance on New York City, where Mount Olympus stands", "All year the half-bloods have been preparing for battle against the Titans, knowing the odds of a victory are grim. Kronos’s army is stronger than ever, and with every god and half-blood he recruits, the evil Titan’s power only grows. ", "While the Olympians struggle to contain the rampaging monster Typhon, Kronos begins his advance on New York City, where Mount Olympus stands virtually unguarded. Now it’s up to Percy Jackson and an army of young demigods to stop the Lord of Time.", "In this momentous final book in the ", " best-selling series, the long-awaited prophecy surrounding Percy’s sixteenth birthday unfolds. And as the battle for Western civilization rages on the streets of Manhattan, Percy faces a terrifying suspicion that he may be fighting against his own fate."], "author": "Rick Riordan", "num_pages": "381", "awards": ["Soaring Eagle Book Award (2010)", "Goodreads Choice Award Nominee for Favorite Book & Young Adult Series (2009)", "Carnegie Medal Nominee (2010)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2010)"], "places": ["Manhattan, New York City, New York", "New York City, New York", "New York (the state)"], "character_names": ["Nico di Angelo", "Thalia Grace", "Tyson", "Annabeth Chase", "Demeter (Goddess)", "Luke Castellan", "Hera", "Hades", "Will Solace", "Percy Jackson"], "language": "English", "publish_date": "2009-05-12 00:00:00", "ISBN": "0739380338"},
{"url": "https://www.goodreads.com/book/show/3521484-cracked-up-to-be", "num_ratings": "15,070", "num_reviews": "1,487", "avg_ratings": 3.74, "genres": ["Young Adult", "Contemporary", "Realistic Fiction", "Romance", "Fiction"], "title": "Cracked Up to Be", "description": ["When \"Perfect\" Parker Fadley starts drinking at school and failing her classes, all of St. Peter's High goes on alert. How has the cheerleading captain, girlfriend of the most popular guy in school, consummate teacher's pet, and future valedictorian fallen so far from grace?", "Parker doesn't want to talk about it. She'd just like to be left alone, to disappear, to be ignored.", "When \"Perfect\" Parker Fadley starts drinking at school and failing her classes, all of St. Peter's High goes on alert. How has the cheerleading captain, girlfriend of the most popular guy in school, consummate teacher's pet, and future valedictorian fallen so far from grace?", "Parker doesn't want to talk about it. She'd just like to be left alone, to disappear, to be ignored. But her parents have placed her on suicide watch and her conselors are demanding the truth. Worse, there's a nice guy falling in love with her and he's making her feel things again when she'd really rather not be feeling anything at all.", "Nobody would have guessed she'd turn out like this. But nobody knows the truth.", "Something horrible has happened, and it just might be her fault."], "author": "Courtney Summers", "num_pages": "214", "awards": ["Cybils Award for Young Adult Fiction (2009)"], "places": ["Connecticut"], "character_names": ["Parker Fadley", "Jake Gardner", "Ms. Grey", "Chris Ellory"], "language": "English", "publish_date": "2008-12-23 00:00:00", "ISBN": "031238369X"},
{"url": "https://www.goodreads.com/book/show/31223319-a-heartwarming-holiday", "num_ratings": "239", "num_reviews": "55", "avg_ratings": 4.4, "genres": ["Holiday", "Christmas", "Holiday", "Romance", "Novella", "Romance", "Contemporary Romance", "Anthologies"], "title": "A Heartwarming Holiday", "description": ["This holiday season, warm your heart with 15 connected sweet, clean & wholesome holiday romances set in Christmas Town from 15 Harlequin Heartwarming authors who are USA Today, national bestselling, and award-winning authors. ", "There are five connected books in A Heartwarming Holiday. That means each set of three novellas shares characters and storylines! This collection", "This holiday season, warm your heart with 15 connected sweet, clean & wholesome holiday romances set in Christmas Town from 15 Harlequin Heartwarming authors who are USA Today, national bestselling, and award-winning authors. ", "There are five connected books in A Heartwarming Holiday. That means each set of three novellas shares characters and storylines! This collection of PG-rated holiday romances are all set in Christmas Town, Maine, a location introduced in the 2014 Harlequin Heartwarming release Christmas, Actually. A Heartwarming Holiday will bring you laughter, tears, and happily-ever-afters (no cliffhangers), for more than 1200 pages. ", "Book 1: Once Upon a Holiday by Anna Adams, Anna J Stewart & Melinda Curtis: ", "Three former college roommates start a business to bring the magic of the holidays to everyone in Christmas Town. ", "Novella 1: Once Upon a Thanksgiving by Anna Adams, award-winning, USA Today bestselling, Harlequin Heartwarming author ", "Novella 2: Once Upon a Christmas by Anna J Stewart, award-winning, USA Today bestselling, Harlequin Heartwarming author ", "Novella 3: Once Upon a New Year’s Eve by Melinda Curtis, award-winning, USA Today bestselling, Harlequin Heartwarming author ", "Book 2: Holiday Heroes by Leigh Riker, Tara Randel & Cari Lynn Webb: ", "Three former Navy SEALs come together to restore an outdated resort. ", "Novella 1: Thankfully Yours by Leigh Riker, award-winning, USA Today bestselling, Harlequin Heartwarming author ", "Novella 2: Cooking Up Christmas by Tara Randel, Barnes and Noble bestselling, USA Today bestselling, Harlequin Heartwarming author ", "Novella 3: Countdown to Romance by Cari Lynn Webb, USA Today bestselling, Harlequin Heartwarming author ", "Book 3: 24 North Pole Lane by Carol Ross, Amy Vastine & Cheryl Harper: ", "Romance is being delivered to 24 North Pole Lane this holiday season. ", "Novella 1: Hers by Thanksgiving by Carol Ross, USA Today bestselling, Harlequin Heartwarming author ", "Novella 2: Peace, Love, and Baby Joy by Amy Vastine, USA Today bestselling, Harlequin Heartwarming author ", "Novella 3: Never Say Never on New Year’s by Cheryl Harper, USA Today bestselling, Harlequin Heartwarming author ", "Book 4: Magic Moments by Tara Taylor Quinn, Shirley Hailstock & Liz Flaherty: ", "Three different times, three different stories. They all bring magic to Christmas Town. ", "Novella 1: Christmas Past by Tara Taylor Quinn, USA Today bestselling, Harlequin Heartwarming author ", "Novella 2: It Only Happens in Christmas Town by Shirley Hailstock, Harlequin Heartwarming author ", "Novella 3: The Magic Stocking by Liz Flaherty, USA Today bestselling, Harlequin Heartwarming author ", "Book 5: Nutcracker Sweethearts by Dana Mentink, Roz Denny Fox, & Amie Denman: ", "As the stage production of the Nutcracker unfolds in Christmas Town, three couples find love with the help of a little holiday magic! ", "Novella 1: Thanksgiving Duet by Dana Mentink, Harlequin Heartwarming author ", "Novella 2: Christmas Curtain Call by Roz Denny Fox, Harlequin Heartwarming author ", "Novella 3: Set for New Year’s by Amie Denman, Harlequin Heartwarming author ", "If this boxed set appeals to you, look for our previous holiday anthology: A Heartwarming Christmas."], "author": "Anna Adams", "num_pages": "1200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2120932.The_Battle_of_the_Labyrinth", "num_ratings": "584,407", "num_reviews": "15,553", "avg_ratings": 4.39, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Battle of the Labyrinth", "description": ["Percy Jackson isn't expecting freshman orientation to be any fun. But when a mysterious mortal acquaintance appears at his potential new school, followed by demon cheerleaders, things quickly move from bad to worse.", "In this fourth installment of the blockbuster series, time is running out as war between the Olympians and the evil Titan lord Kronos draws near. Even the safe", "Percy Jackson isn't expecting freshman orientation to be any fun. But when a mysterious mortal acquaintance appears at his potential new school, followed by demon cheerleaders, things quickly move from bad to worse.", "In this fourth installment of the blockbuster series, time is running out as war between the Olympians and the evil Titan lord Kronos draws near. Even the safe haven of Camp Half-Blood grows more vulnerable by the minute as Kronos's army prepares to invade its once impenetrable borders. To stop the invasion, Percy and his demigod friends must set out on a quest through the Labyrinth - a sprawling underground world with stunning surprises at every turn."], "author": "Rick Riordan", "num_pages": "361", "awards": [], "places": ["United States of America"], "character_names": ["Nico di Angelo", "Tyson", "Annabeth Chase", "Grover Underwood", "Hera", "Daedalus", "Rachel Elizabeth Dare", "Percy Jackson"], "language": "English", "publish_date": "2008-03-06 00:00:00", "ISBN": "1423101464"},
{"url": "https://www.goodreads.com/book/show/16735.The_Prince_of_Tides", "num_ratings": "174,992", "num_reviews": "3,742", "avg_ratings": 4.23, "genres": ["Fiction", "American", "Southern", "Classics", "Contemporary", "Romance"], "title": "The Prince of Tides", "description": ["PAT CONROY has created a huge, brash thunderstorm of a novel, stinging with honesty and resounding with drama. Spanning forty years, this is the story of turbulent Tom Wingo, his gifted and troubled twin sister Savannah, and their struggle to triumph over the dark and tragic legacy of the extraordinary family into which they were born.", "Filled with the vanishing beauty of th", "PAT CONROY has created a huge, brash thunderstorm of a novel, stinging with honesty and resounding with drama. Spanning forty years, this is the story of turbulent Tom Wingo, his gifted and troubled twin sister Savannah, and their struggle to triumph over the dark and tragic legacy of the extraordinary family into which they were born.", "Filled with the vanishing beauty of the South Carolina low country as well as the dusty glitter of New York City, ", " is PAT CONROY at his very best."], "author": "Pat Conroy", "num_pages": "679", "awards": [], "places": ["South Carolina", "New York City, New York"], "character_names": ["Tom Wingo", "Susan Lowenstein", "Savannah Wingo", "Luke Wingo"], "language": "English", "publish_date": "2002-03-26 00:00:00", "ISBN": "0553381547"},
{"url": "https://www.goodreads.com/book/show/10766509-the-best-of-me", "num_ratings": "127,833", "num_reviews": "9,833", "avg_ratings": 3.91, "genres": ["Romance", "Fiction", "Womens Fiction", "Chick Lit", "Contemporary", "Adult"], "title": "The Best of Me", "description": ["THE BEST OF ME is the heart-rending story of two small-town former high school sweethearts from opposite sides of the tracks. Now middle-aged, they've taken wildly divergent paths, but neither has lived the life they imagined . . . and neither can forget the passionate first love that forever altered their world. When they are both called back to their hometown for the fun", "THE BEST OF ME is the heart-rending story of two small-town former high school sweethearts from opposite sides of the tracks. Now middle-aged, they've taken wildly divergent paths, but neither has lived the life they imagined . . . and neither can forget the passionate first love that forever altered their world. When they are both called back to their hometown for the funeral of the mentor who once gave them shelter, they will be forced to confront the choices each has made, and ask whether love can truly rewrite the past."], "author": "Nicholas Sparks", "num_pages": "292", "awards": [], "places": ["Oriental, North Carolina", "Oriental, North Carolina"], "character_names": ["Amanda Collier", "Dawson Cole"], "language": "English", "publish_date": "2011-10-11 00:00:00", "ISBN": "0446547654"},
{"url": "https://www.goodreads.com/book/show/4701.A_Spot_of_Bother", "num_ratings": "29,793", "num_reviews": "3,058", "avg_ratings": 3.47, "genres": ["Fiction", "Contemporary", "Humor"], "title": "A Spot of Bother", "description": ["George Hall is an unobtrusive man. A little distant, perhaps, a little cautious, not at quite at ease with the emotional demands of fatherhood, or manly bonhomie. He does not understand the modern obsession with talking about everything. “The secret of contentment, George felt, lay in ignoring many things completely.” Some things in life, however, cannot be ignored.", "At 61,", "George Hall is an unobtrusive man. A little distant, perhaps, a little cautious, not at quite at ease with the emotional demands of fatherhood, or manly bonhomie. He does not understand the modern obsession with talking about everything. “The secret of contentment, George felt, lay in ignoring many things completely.” Some things in life, however, cannot be ignored.", "At 61, George is settling down to a comfortable retirement, building a shed in his garden, reading historical novels and listening to a bit of light jazz. Then his tempestuous daughter, Katie, announces that she is getting re-married, to the deeply inappropriate Ray. Her family is not pleased – as her brother Jamie observes, Ray has “strangler’s hands.” Katie can’t decide if she loves Ray, or loves the wonderful way he has with her son Jacob, and her mother Jean is a bit put out by all the planning and arguing the wedding has occasioned, which get in the way of her quite fulfilling late-life affair with one of her husband’s ex-colleagues. And the tidy and pleasant life Jamie has created crumbles when he fails to invite his lover, Tony, to the dreaded nuptials. ", "Unnoticed in the uproar, George discovers a sinister lesion on his hip, and quietly begins to lose his mind. ", "The way these damaged people fall apart – and come together – as a family is the true subject of Haddon’s disturbing yet amusing portrait of a dignified man trying to go insane politely.", "A SPOT OF BOTHER is Mark Haddon’s unforgettable follow-up to the internationally beloved bestseller THE CURIOUS INCIDENT OF THE DOG IN THE NIGHT-TIME. Here the madness – literally – of family life proves rich comic fodder for Haddon’s crackling prose and bittersweet insights into misdirected love."], "author": "Mark Haddon", "num_pages": "354", "awards": ["Costa Book Award Nominee for Novel (2006)"], "places": ["United Kingdom"], "character_names": ["George Hall", "Katie Hall", "Jean Hall", "Jamie Hall"], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "0385520514"},
{"url": "https://www.goodreads.com/book/show/11964742-side-effects", "num_ratings": "148", "num_reviews": "22", "avg_ratings": 4.14, "genres": ["Young Adult", "Romance", "Contemporary", "Mental Health", "Mental Illness", "Fan Fiction"], "title": "Side Effects", "description": ["High school can be Hell on Earth, something Isaac Matthews knows from experience. His ex-best friend is now the biggest bully in school. The medicine for his anxiety disorder is supposed to make him better, but there’s a chance he could just get worse. And then there’s the beautiful, outgoing new girl who shakes his very foundation and grounds him at the same time.", "Grace is", "High school can be Hell on Earth, something Isaac Matthews knows from experience. His ex-best friend is now the biggest bully in school. The medicine for his anxiety disorder is supposed to make him better, but there’s a chance he could just get worse. And then there’s the beautiful, outgoing new girl who shakes his very foundation and grounds him at the same time.", "Grace is drawn to Isaac from the moment they meet. She holds his hand through his panic attacks, draws him out of his shell, and changes the way he sees the world. Why would anyone try so hard to help the school freak? She has her reasons.", "Warning: Side Effects may include increased heart rate, dry mouth, interrupted speech, elevated body temperature, and dizziness or lightheadedness upon seeing her smile."], "author": "Jennifer M. Barry", "num_pages": "349", "awards": [], "places": [], "character_names": ["David Brooks", "Isaac Matthews", "Grace Thomas"], "language": "English", "publish_date": "2016-11-30 00:00:00", "ISBN": "1540517187"},
{"url": "https://www.goodreads.com/book/show/248704.It_s_Kind_of_a_Funny_Story", "num_ratings": "184,231", "num_reviews": "9,344", "avg_ratings": 4.13, "genres": ["Young Adult", "Fiction", "Contemporary", "Health", "Mental Health"], "title": "It's Kind of a Funny Story", "description": ["Ambitious New York City teenager Craig Gilner is determined to succeed at life - which means getting into the right high school to get into the right job. But once Craig aces his way into Manhattan's Executive Pre-Professional High School, the pressure becomes unbearable. He stops eating and sleeping until, one night, he nearly kills himself.", "Craig's suicidal episode gets h", "Ambitious New York City teenager Craig Gilner is determined to succeed at life - which means getting into the right high school to get into the right job. But once Craig aces his way into Manhattan's Executive Pre-Professional High School, the pressure becomes unbearable. He stops eating and sleeping until, one night, he nearly kills himself.", "Craig's suicidal episode gets him checked into a mental hospital, where his new neighbors include a transsexual sex addict, a girl who has scarred her own face with scissors, and the self-elected President Armelio. There, Craig is finally able to confront the sources of his anxiety.", "Ned Vizzini, who himself spent time in a psychiatric hospital, has created a remarkably moving tale about the sometimes unexpected road to happiness."], "author": "Ned Vizzini", "num_pages": "444", "awards": ["Lincoln Award Nominee (2009)", "Goldener Lufti (2008)"], "places": ["New York City, New York"], "character_names": ["Aaron", "Nia", "Craig Gilner", "Noelle"], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "078685197X"},
{"url": "https://www.goodreads.com/book/show/18810882-talking-dirty-with-the-boss", "num_ratings": "987", "num_reviews": "93", "avg_ratings": 3.82, "genres": ["Romance", "Contemporary", "Romance", "Contemporary Romance"], "title": "Talking Dirty With the Boss", "description": ["Marisa Clair wants to get her artist dreams back on track after a life detour. That means no partying, no shopping…and definitely no men to distract her. Should be easy, but there’s something about her hot and exceedingly uptight boss and she can't seem to stop herself from ruffling Mr. Tall, Dark and Irritating.", "Financial consultant Luke McNamara lives his life strictly by", "Marisa Clair wants to get her artist dreams back on track after a life detour. That means no partying, no shopping…and definitely no men to distract her. Should be easy, but there’s something about her hot and exceedingly uptight boss and she can't seem to stop herself from ruffling Mr. Tall, Dark and Irritating.", "Financial consultant Luke McNamara lives his life strictly by schedule – his OCD simply won't allow him to do anything else. And the very last thing he needs is a sassy blonde putting lipstick on his collar and messing with his routine. She annoys the hell out of him so why can’t he stop thinking about the color of her panties…and how free he feels when he’s with her?", "Marisa and Luke’s plans to steer clear of one another are shot to hell after a hot office encounter. Now the two of them will have to learn to get along as they face a much more permanent reminder of their lack of self-control – a pregnancy."], "author": "Jackie Ashenden", "num_pages": "150", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-12-09 00:00:00", "ISBN": "1622663241"},
{"url": "https://www.goodreads.com/book/show/223845.My_Friend_is_Sad", "num_ratings": "8,022", "num_reviews": "420", "avg_ratings": 4.35, "genres": ["Childrens", "Picture Books", "Childrens", "Humor"], "title": "My Friend is Sad", "description": ["Gerald is careful. Piggie is not.", "Piggie cannot help smiling. Gerald can.", "Gerald worries so that Piggie does not have to.", "Gerald and Piggie are best friends.", "In ", ", elephant Gerald is down in the dumps. Piggie is determined to cheer him up by dressing as a cowboy, a clown, and even a robot! But what does it take to make a sad elephant happy? The answer will make", "Gerald is careful. Piggie is not.", "Piggie cannot help smiling. Gerald can.", "Gerald worries so that Piggie does not have to.", "Gerald and Piggie are best friends.", "In ", ", elephant Gerald is down in the dumps. Piggie is determined to cheer him up by dressing as a cowboy, a clown, and even a robot! But what does it take to make a sad elephant happy? The answer will make even pessimistic elephants smile."], "author": "Mo Willems", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "1423102975"},
{"url": "https://www.goodreads.com/book/show/6972157-beast-behaving-badly", "num_ratings": "12,759", "num_reviews": "660", "avg_ratings": 4.4, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance", "Paranormal", "Shapeshifters"], "title": "Beast Behaving Badly", "description": ["Ten years after Blayne Thorpe first encountered Bo Novikov, she still can't get the smooth-talking shifter out of her head. Now he's shadowing her in New York-all seven-plus feet of him-determined to protect her from stalkers who want to use her in shifter dogfights. Even if he has to drag her off to an isolated Maine town where the only neighbors are other bears almost as", "Ten years after Blayne Thorpe first encountered Bo Novikov, she still can't get the smooth-talking shifter out of her head. Now he's shadowing her in New York-all seven-plus feet of him-determined to protect her from stalkers who want to use her in shifter dogfights. Even if he has to drag her off to an isolated Maine town where the only neighbors are other bears almost as crazy as he is...", "Let sleeping dogs lie. Bo knows it's good advice, but he can't leave Blayne be. Blame it on her sweet sexiness -- or his hunch that there's more to this little wolfdog than meets the eye. Blayne has depths he hasn't yet begun to fathom -- much as he'd like to. She may insist Bo's nothing but a pain in her delectable behind, but polar bears have patience in spades. Soon she'll realize how good they can be together. And when she does, animal instinct tells him it'll be worth the wait..."], "author": "Shelly Laurenston", "num_pages": "379", "awards": [], "places": ["New York City, New York", "Ursus County, Maine"], "character_names": ["Blayne Thorpe", "Bold “Bo” Novikov"], "language": "English", "publish_date": "2010-05-25 00:00:00", "ISBN": "0758231687"},
{"url": "https://www.goodreads.com/book/show/251762.Bee_Season", "num_ratings": "23,045", "num_reviews": "1,534", "avg_ratings": 3.56, "genres": ["Fiction", "Literature", "Jewish", "Adult Fiction", "Contemporary"], "title": "Bee Season", "description": ["Eliza Naumann, a seemingly unremarkable nine-year-old, expects never to fit into her gifted family: her autodidact father, Saul, absorbed in his study of Jewish mysticism; her brother, Aaron, the vessel of his father's spiritual ambitions; and her brilliant but distant lawyer-mom, Miriam. But when Eliza sweeps her school and district spelling bees in quick succession, Saul", "Eliza Naumann, a seemingly unremarkable nine-year-old, expects never to fit into her gifted family: her autodidact father, Saul, absorbed in his study of Jewish mysticism; her brother, Aaron, the vessel of his father's spiritual ambitions; and her brilliant but distant lawyer-mom, Miriam. But when Eliza sweeps her school and district spelling bees in quick succession, Saul takes it as a sign that she is destined for greatness. In this altered reality, Saul inducts her into his hallowed study and lavishes upon her the attention previously reserved for Aaron, who in his displacement embarks upon a lone quest for spiritual fulfillment. When Miriam's secret life triggers a familial explosion, it is Eliza who must order the chaos.", "Myla Goldberg's keen eye for detail brings Eliza's journey to three-dimensional life. As she rises from classroom obscurity to the blinding lights and outsized expectations of the National Bee, Eliza's small pains and large joys are finely wrought and deeply felt.", "Not merely a coming-of-age story, Goldberg's first novel delicately examines the unraveling fabric of one family. The outcome of this tale is as startling and unconventional as her prose, which wields its metaphors sharply and rings with maturity. The work of a lyrical and gifted storyteller, ", " marks the arrival of an extraordinarily talented new writer."], "author": "Myla Goldberg", "num_pages": "275", "awards": ["New York Public Library Young Lions Fiction Award Nominee (2001)", "Guardian First Book Award Nominee for Longlist (2001)", "Edward Lewis Wallant Award (2001)", "PEN/Hemingway Foundation Award Nominee (2001)", "Borders Original Voices Award for Fiction (2000)"], "places": ["New York City, New York"], "character_names": ["Eliza Naumann", "Saul Naumann", "Miriam Naumann", "Aaron Naumann"], "language": "English", "publish_date": "2001-05-15 00:00:00", "ISBN": "0385498802"},
{"url": "https://www.goodreads.com/book/show/17834441-talking-dirty-with-the-ceo", "num_ratings": "1,674", "num_reviews": "175", "avg_ratings": 3.68, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Adult Fiction", "Erotica"], "title": "Talking Dirty with the CEO", "description": ["Gadget journalist Christie St. John is more geek than chic. But when research for an article she has to write on online dating leads to the bed of the hottest guy she’s ever met, she knows that if the geek is to keep the hottie CEO, she’s going to have to come out of her digital shell.", "Tech mogul Joseph Ashton never expected an Internet blind date to end in the best sex of", "Gadget journalist Christie St. John is more geek than chic. But when research for an article she has to write on online dating leads to the bed of the hottest guy she’s ever met, she knows that if the geek is to keep the hottie CEO, she’s going to have to come out of her digital shell.", "Tech mogul Joseph Ashton never expected an Internet blind date to end in the best sex of his life. Yet as the chemistry between him and Christie burns out of control, he can't help but think this woman is out for his money like all the rest. She claims she wants his heart instead – but that’s the one thing he can never give."], "author": "Jackie Ashenden", "num_pages": "206", "awards": [], "places": ["New Zealand"], "character_names": [], "language": null, "publish_date": "2013-05-13 00:00:00", "ISBN": "1622660668"},
{"url": "https://www.goodreads.com/book/show/20868172-gator", "num_ratings": "1,125", "num_reviews": "105", "avg_ratings": 3.53, "genres": ["Dark", "Romance", "Sociology", "Abuse", "Contemporary", "Romance", "Contemporary Romance"], "title": "Gator", "description": ["Gator", "My scars terrify most people, but she views me as the sun, shining light into the darkness of her past. I am a killer, yet gave her life. She is mine and I dare anyone to stand in my way.", "Mia", "I am nobody until Gator sees me through the scope of his rifle. My life is suffering and violence, but he offers redemption. I am his and I dare anyone to keep us apart.", "Gator is a", "Gator", "My scars terrify most people, but she views me as the sun, shining light into the darkness of her past. I am a killer, yet gave her life. She is mine and I dare anyone to stand in my way.", "Mia", "I am nobody until Gator sees me through the scope of his rifle. My life is suffering and violence, but he offers redemption. I am his and I dare anyone to keep us apart.", "Gator is a standalone romance noir scheduled for release on Feb. 25, 2014."], "author": "Bijou Hunter", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17876.Notes_from_Underground_White_Nights_The_Dream_of_a_Ridiculous_Man_and_Selections_from_The_House_of_the_Dead", "num_ratings": "70,384", "num_reviews": "1,701", "avg_ratings": 4.17, "genres": ["Classics", "Fiction", "Cultural", "Russia", "Philosophy", "Literature", "Literature", "Russian Literature"], "title": "Notes from Underground, White Nights, The Dream of a Ridiculous Man, and Selections from The House of the Dead", "description": ["A collection of powerful stories by one of the masters of Russian literature, illustrating the author's thoughts on political philosophy, religion and above all, humanity: ", " (150th Anniversary Edition)", "The compelling works presented in this volume were written at dis", "A collection of powerful stories by one of the masters of Russian literature, illustrating the author's thoughts on political philosophy, religion and above all, humanity: ", " (150th Anniversary Edition)", "The compelling works presented in this volume were written at distinct periods in Dostoyevsky's life, at decisive moments in his groping for a political philosophy and a religious answer. From the primitive peasant who kills without understanding that he is destroying life to the anxious antihero of ", "—who both craves and despises affection—the writer's often-tormented characters showcase his evolving outlook on our fate.", "Thomas Mann described Dostoyevsky as \"an author whose Christian sympathy is ordinarily devoted to human misery, sin, vice, the depths of lust and crime, rather than to nobility of body and soul\" and ", " as \"an awe- and terror- inspiring example of this sympathy.\""], "author": "Fyodor Dostoyevsky", "num_pages": "233", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-02 00:00:00", "ISBN": "0451529553"},
{"url": "https://www.goodreads.com/book/show/6658391-wintergirls", "num_ratings": "98,507", "num_reviews": "8,396", "avg_ratings": 3.98, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction", "Health", "Mental Health"], "title": "Wintergirls", "description": ["Lia and Cassie are best friends, wintergirls frozen in fragile bodies, competitors in a deadly contest to see who can be the thinnest. But then Cassie suffers the ultimate loss—her life—and Lia is left behind, haunted by her friend’s memory and feeling guilty for not being able to help save her. ", "In her most powerfully moving novel since Speak, awardwinning author Laurie Ha", "Lia and Cassie are best friends, wintergirls frozen in fragile bodies, competitors in a deadly contest to see who can be the thinnest. But then Cassie suffers the ultimate loss—her life—and Lia is left behind, haunted by her friend’s memory and feeling guilty for not being able to help save her. ", "In her most powerfully moving novel since Speak, awardwinning author Laurie Halse Anderson explores Lia’s struggle, her painful path to recovery, and her desperate attempts to hold on to the most important thing of all—hope."], "author": "Laurie Halse Anderson", "num_pages": "278", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Novel (2009)", "Milwaukee County Teen Book Award (2010)", "Michigan Library Association Thumbs Up! Award Nominee (2010)", "Iowa High School Book Award Nominee (2011)", "Lincoln Award Nominee (2014)", "Cybils Award Nominee for Young Adult Fiction (2009)", "Literaturpreis der Jury der jungen Leser for Cover (2011)", "Goodreads Choice Award Nominee for Young Adult Fiction (2009)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2010)"], "places": ["New Hampshire"], "character_names": [], "language": "English", "publish_date": "2010-02-23 00:00:00", "ISBN": "014241557X"},
{"url": "https://www.goodreads.com/book/show/22628.The_Perks_of_Being_a_Wallflower", "num_ratings": "1,051,774", "num_reviews": "50,385", "avg_ratings": 4.21, "genres": ["Young Adult", "Fiction", "Contemporary"], "title": "The Perks of Being a Wallflower", "description": ["The critically acclaimed debut novel from Stephen Chbosky, Perks follows observant “wallflower” Charlie as he charts a course through the strange world between adolescence and adulthood. First dates, family drama, and new friends. Sex, drugs, and The Rocky Horror Picture Show. Devastating loss, young love, and life on the fringes. Caught between trying to live his life and", "The critically acclaimed debut novel from Stephen Chbosky, Perks follows observant “wallflower” Charlie as he charts a course through the strange world between adolescence and adulthood. First dates, family drama, and new friends. Sex, drugs, and The Rocky Horror Picture Show. Devastating loss, young love, and life on the fringes. Caught between trying to live his life and trying to run from it, Charlie must learn to navigate those wild and poignant roller-coaster days known as growing up.", "Listening Length: 6 hours and 18 minutes"], "author": "Stephen Chbosky", "num_pages": "213", "awards": [], "places": ["Pittsburgh, Pennsylvania"], "character_names": ["Bill", "Patrick Grogan", "Charlie Scorsoni", "Sam Turner", "Michael Dobson", "Mary-Elizabeth", "Candace Grogan"], "language": "English", "publish_date": "1999-02-16 00:00:00", "ISBN": "0671027344"},
{"url": "https://www.goodreads.com/book/show/17704167-interrupted", "num_ratings": "201", "num_reviews": "37", "avg_ratings": 4.15, "genres": ["Romance", "Contemporary Romance", "Romance"], "title": "Interrupted", "description": ["After the emotional turmoil that was ‘Jesse’ subsides, Charlie manages to find peace with her decision to leave him, despite her conscience telling her otherwise. Saying goodbye to the drama proves to be an easier task than she anticipated.", "And although Charlie’s life continues to test her strength, her will, and her motivation to pick herself up and dust herself off, she c", "After the emotional turmoil that was ‘Jesse’ subsides, Charlie manages to find peace with her decision to leave him, despite her conscience telling her otherwise. Saying goodbye to the drama proves to be an easier task than she anticipated.", "And although Charlie’s life continues to test her strength, her will, and her motivation to pick herself up and dust herself off, she carves a new path. Making positive changes in her life, she gets a new job, a new apartment, and a new guy; everything is nearly perfect. Nearly.", "Hundreds of miles away, Jesse isn’t faring too well in their aftermath. But within his darkness, he finds a purpose and reconstructs himself with one goal in mind:", "He needs to find his Charlie.", "Interrupted is the second book in The Progress Series."], "author": "Amy Queau", "num_pages": "286", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17567221-progress", "num_ratings": "350", "num_reviews": "73", "avg_ratings": 3.81, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Dark"], "title": "Progress", "description": ["Is love an infection or is it a sick addiction, when there's nowhere left to run?", "Jesse has a curious attraction to Charlie, a hostess at the restaurant where he works. Outwardly he’s rude, awkward and unapproachable. But his sudden bursts of charm are inescapable. A devastating childhood filled with physical and emotional abuse have left him complex and frigid.", "Charlie, an", "Is love an infection or is it a sick addiction, when there's nowhere left to run?", "Jesse has a curious attraction to Charlie, a hostess at the restaurant where he works. Outwardly he’s rude, awkward and unapproachable. But his sudden bursts of charm are inescapable. A devastating childhood filled with physical and emotional abuse have left him complex and frigid.", "Charlie, an innocent, is quickly mystified. Her craving for him generates an infatuation and a purpose. Losing weight and gaining confidence, she begins taking more risks. She defies her past, damaged and tender, in order to move ahead.", "If nobody makes the first move then nobody gets hurt.", "Their journeys take them down parallel paths which leave them just as emotionally unmatched and conflicted as the day they met. As the story progresses the viewpoints change, giving the reader an insight to the character’s thoughts and feelings.", "Psychological Fiction, Contemporary Romance, Women's Fiction."], "author": "Amy Queau", "num_pages": "265", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22020598-on-the-edge-of-gone", "num_ratings": "2,152", "num_reviews": "497", "avg_ratings": 3.96, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fiction"], "title": "On the Edge of Gone", "description": ["January 29, 2035.", "That’s the day the comet is scheduled to hit—the big one. Denise and her mother and sister, Iris, have been assigned to a temporary shelter near their hometown of Amsterdam to wait out the blast, but Iris is nowhere to be found, and at the rate Denise’s drug-addicted mother is going, they’ll never reach the shelter in time.", "Then a last-minute encounter lead", "January 29, 2035.", "That’s the day the comet is scheduled to hit—the big one. Denise and her mother and sister, Iris, have been assigned to a temporary shelter near their hometown of Amsterdam to wait out the blast, but Iris is nowhere to be found, and at the rate Denise’s drug-addicted mother is going, they’ll never reach the shelter in time.", "Then a last-minute encounter leads them to something better than a temporary shelter: a generation ship that’s scheduled to leave Earth behind and colonize new worlds after the comet hits. But each passenger must have a practical skill to contribute. Denise is autistic and fears that she’ll never be allowed to stay. Can she obtain a spot before the ship takes flight? What about her mother and sister?", "When the future of the human race is at stake, whose lives matter most?"], "author": "Corinne Duyvis", "num_pages": "456", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-08 00:00:00", "ISBN": "1419719033"},
{"url": "https://www.goodreads.com/book/show/19794.The_Echo_Maker", "num_ratings": "7,294", "num_reviews": "1,180", "avg_ratings": 3.35, "genres": ["Fiction", "Mystery", "Literature"], "title": "The Echo Maker", "description": ["Following a near-fatal accident, Mark Schluter is nursed by his reluctant sister. But when he emerges from his coma, Mark believes that this woman – who looks, acts, and sounds just like his sister – is really an identical impostor. As a famous neurologist investigates his condition, Mark tries to learn what really happened the night of his accident.", "On a winter night on a", "Following a near-fatal accident, Mark Schluter is nursed by his reluctant sister. But when he emerges from his coma, Mark believes that this woman – who looks, acts, and sounds just like his sister – is really an identical impostor. As a famous neurologist investigates his condition, Mark tries to learn what really happened the night of his accident.", "On a winter night on a remote Nebraska road, 27-year-old Mark Schluter flips his truck in a near-fatal accident. His older sister Karin, his only near kin, returns reluctantly to their hometown to nurse Mark back from a traumatic head injury. But when he emerges from a protracted coma, Mark believes that this woman – who looks, acts, and sounds just like his sister – is really an identical impostor. Shattered by her brother’s refusal to recognize her, Karin contacts the cognitive neurologist Gerald Weber, famous for his case histories describing the infinitely bizarre worlds of brain disorder. Weber recognizes Mark as a rare case of Capgras Syndrome, a doubling delusion, and eagerly investigates. What he discovers in Mark slowly undermines even his own sense of being. Meanwhile, Mark, armed only with a note left by an anonymous witness, attempts to learn what happened the night of his inexplicable accident. The truth of that evening will change the lives of all three beyond recognition. ", "Set against the Platte River’s massive spring migrations – one of the greatest spectacles in nature – The Echo Maker is a gripping mystery that explores the improvised human self and the even more precarious brain that splits us from and joins us to the rest of creation."], "author": "Richard Powers", "num_pages": "451", "awards": ["Pulitzer Prize Nominee for Fiction (2007)", "National Book Award for Fiction (2006)"], "places": ["Nebraska"], "character_names": ["Barbara Gillespie", "Gerald Weber", "Mark Schluter", "Karin Schluter", "Duane Cain", "Tommy Rupp", "Sylvie Weber", "Bonnie Travis", "Daniel Riegel"], "language": "English", "publish_date": "2006-10-17 00:00:00", "ISBN": "0374146357"},
{"url": "https://www.goodreads.com/book/show/25419982-trueman-bradley---the-next-great-detective", "num_ratings": "17", "num_reviews": "3", "avg_ratings": 4.82, "genres": ["Mystery"], "title": "Trueman Bradley - The Next Great Detective", "description": ["Trueman Bradley visits London and sets up shop on Baker Street, in the hopes of becoming the next Sherlock Holmes. Using hints he has derived from the original Sherlock stories, Trueman uncovers the mysterious methods of \"The Great Detective\" and uses them to solve the mystery of how his grandfather acquired his fortune, as well as helping Scotland Yard to capture a notori", "Trueman Bradley visits London and sets up shop on Baker Street, in the hopes of becoming the next Sherlock Holmes. Using hints he has derived from the original Sherlock stories, Trueman uncovers the mysterious methods of \"The Great Detective\" and uses them to solve the mystery of how his grandfather acquired his fortune, as well as helping Scotland Yard to capture a notorious cat burglar. With the help of a few new friends, Trueman learns the value of deduction, imagination and instinct, in detective work, and proves that he has what it takes to become \"The Next Great Detective.\""], "author": "Alexei Maxim Russell", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-21 00:00:00", "ISBN": "1511829176"},
{"url": "https://www.goodreads.com/book/show/19048336-rewired", "num_ratings": "138", "num_reviews": "37", "avg_ratings": 4.32, "genres": ["Romance", "Contemporary Romance", "Mental Health", "Mental Illness", "Sociology", "Abuse", "Romance"], "title": "Rewired", "description": [" -Charlie", "Impasse: def. ", ". 1. a situation in which no progress seems possible. 2. a difficult or puzzling situation from which there is no easy escape.", "Charlie is about to find out how far into Jesse’s tormented past she needs to travel when she hops into his car, leaving the man she", " -Charlie", "Impasse: def. ", ". 1. a situation in which no progress seems possible. 2. a difficult or puzzling situation from which there is no easy escape.", "Charlie is about to find out how far into Jesse’s tormented past she needs to travel when she hops into his car, leaving the man she loves alone and searching for answers.", "But Samuel’s a fighter. He’s not about to give up without an explanation. And he’s soon to discover events in Charlie’s past that offer reasons to her recent behavior. But will it be enough for him to want her back?", "Unable to forgive herself for what she’s done to Samuel - and her crumbling future without him - Charlie’s solution is simple: Help Jesse open his mind and his heart, allowing him to trust someone for the first time in his life.", "Rewired is the third and final book in The Progress Series.", "Warning: This book contains sensitive material (including sexually explicit content, acts of graphic violence, language, and triggers) and may not be appropriate for all readers."], "author": "Amy Queau", "num_pages": "334", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6609765-out-of-my-mind", "num_ratings": "80,877", "num_reviews": "11,451", "avg_ratings": 4.37, "genres": ["Realistic Fiction", "Young Adult", "Fiction", "Childrens", "Middle Grade", "Contemporary", "Childrens", "Disability", "Academic", "School", "Childrens", "Juvenile", "Family"], "title": "Out of My Mind", "description": ["Melody is not like most people. She cannot walk or talk, but she has a photographic memory; she can remember every detail of everything she has ever experienced. She is smarter than most of the adults who try to diagnose her and smarter than her classmates in her integrated classroom - the very same classmates who dismiss her as mentally challenged because she cannot tell", "Melody is not like most people. She cannot walk or talk, but she has a photographic memory; she can remember every detail of everything she has ever experienced. She is smarter than most of the adults who try to diagnose her and smarter than her classmates in her integrated classroom - the very same classmates who dismiss her as mentally challenged because she cannot tell them otherwise. But Melody refuses to be defined by cerebral palsy. And she's determined to let everyone know it - somehow.", " In this breakthrough story, reminiscent of ", ", from multiple Coretta Scott King Award-winner Sharon Draper, readers will come to know a brilliant mind and a brave spirit who will change forever how they look at anyone with a disability."], "author": "Sharon M. Draper", "num_pages": "295", "awards": ["Josette Frank Award (2011)", "Buckeye Children's Book Award for 6-8 (2011)", "Pennsylvania Young Readers' Choice Award for Grades 6-8 (2013)", "Dorothy Canfield Fisher Children's Book Award Nominee (2012)", "New Mexico Land of Enchantment Award for Young Adult (2013)", "California Young Readers Medal for Middle School/Junior High (2013)", "Washington State Sasquatch Award (2013)", "Bluestem Book Award (2013)", "Goodreads Choice Award Nominee for Middle Grade & Children's Books (2010)", "Intermediate Nutmeg Book Award (2014)", "Rebecca Caudill Young Readers' Book Award Nominee (2013)"], "places": ["Ohio"], "character_names": [], "language": "English", "publish_date": "2010-03-09 00:00:00", "ISBN": "141697170X"},
{"url": "https://www.goodreads.com/book/show/977097.Town_House", "num_ratings": "503", "num_reviews": "89", "avg_ratings": 3.63, "genres": ["Fiction", "Cultural", "Canada", "Humor"], "title": "Town House", "description": ["Jack Madigan should be leading an enviable life. He’s the sole heir of a ’70s rock icon. He lives with his retro-obsessed teenage son, Harlan, in a once-magnificent Boston town house. But now 36, Jack’s painting career is buckling under a raging case of agoraphobia. And when the foreclosure notice arrives, Jack must face losing the only home he’s ever known—and his only sa", "Jack Madigan should be leading an enviable life. He’s the sole heir of a ’70s rock icon. He lives with his retro-obsessed teenage son, Harlan, in a once-magnificent Boston town house. But now 36, Jack’s painting career is buckling under a raging case of agoraphobia. And when the foreclosure notice arrives, Jack must face losing the only home he’s ever known—and his only safe zone. When Jack’s ex-wife announces that Harlan would be better off living with her and her vitamin-enriched fiancé, Jack has to figure out how to deter the perky, inexperienced real-estate agent, hold on to his house, keep his son at home, and—through the tenacity of the little girl next door—finally step out onto the sidewalk.", "Fox 2000 swooped in to pre-empt the film rights while ", "was still on submission to publishers. Ridley Scott’s Scott Free Productions is set to produce the movie and Pulitzer Prize-winning screenwriter Doug Wright (", ") is adapting the screenplay. A book with the ability to both entertain and move us, ", "is a smart, acerbic novel bursting with heart and quirky charm."], "author": "Tish Cohen", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-01-30 00:00:00", "ISBN": "0061131318"},
{"url": "https://www.goodreads.com/book/show/26720410-craven-conflict", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Craven Conflict", "description": ["Barely days after recruitment consultant Karen Rutherford’s right hand man suddenly quits, she is horrified to discover the theft of her database and an underhand campaign to entice her clients away and destroy her business. Anger turns to disbelief when immediate legal redress fails. Her livelihood threatened to the core, she finds herself locked into a courtroom battle e", "Barely days after recruitment consultant Karen Rutherford’s right hand man suddenly quits, she is horrified to discover the theft of her database and an underhand campaign to entice her clients away and destroy her business. Anger turns to disbelief when immediate legal redress fails. Her livelihood threatened to the core, she finds herself locked into a courtroom battle escalating into bitter conflict when a fraught episode from her private life pours oil on already troubled waters. ", "Not far away, legal executive Paul Craven can hardly believe his luck and his headhunter’s skills when he lands his dream job. Or so he thought. As the cold reality of the new workplace sinks in, it slowly dawns on him that his deepest personal secret - his affliction with Asperger’s Syndrome - may be impossible to keep to himself any longer. Amid the turmoil, being drawn into someone else’s legal dispute was all he needed. ", "Craven Conflict. Unwelcome choices. Harsh decisions. Barely lesser evils."], "author": "David  Cooper", "num_pages": "482", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24795570-every-last-word", "num_ratings": "27,525", "num_reviews": "3,911", "avg_ratings": 4.23, "genres": ["Young Adult", "Contemporary", "Health", "Mental Health", "Mental Health", "Mental Illness", "Romance"], "title": "Every Last Word", "description": ["Samantha McAllister looks just like the rest of the popular girls in her junior class. But hidden beneath the straightened hair and expertly applied makeup is a secret that her friends would never understand: Sam has Purely-Obsessional OCD and is consumed by a stream of dark thoughts and worries that she can't turn off. ", "Se", "Samantha McAllister looks just like the rest of the popular girls in her junior class. But hidden beneath the straightened hair and expertly applied makeup is a secret that her friends would never understand: Sam has Purely-Obsessional OCD and is consumed by a stream of dark thoughts and worries that she can't turn off. ", "Second-guessing every move, thought, and word makes daily life a struggle, and it doesn't help that her lifelong friends will turn toxic at the first sign of a wrong outfit, wrong lunch, or wrong crush. Yet Sam knows she'd be ", " crazy to leave the protection of the most popular girls in school. So when Sam meets Caroline, she has to keep her new friend with a refreshing sense of humor and no style a secret, right up there with Sam's weekly visits to her psychiatrist.", "Caroline introduces Sam to Poet's Corner, a hidden room and a tight-knit group of misfits who have been ignored by the school at large. Sam is drawn to them immediately, especially a guitar-playing guy with a talent for verse, and starts to discover a whole new side of herself. Slowly, she begins to feel more \"normal\" than she ever has as part of the popular crowd . . . until she finds a new reason to question her sanity and all she holds dear."], "author": "Tamara Ireland Stone", "num_pages": "368", "awards": ["Buxtehuder Bulle (2016)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2017)", "Goodreads Choice Award Nominee for Young Adult Fiction (2015)"], "places": [], "character_names": [], "language": null, "publish_date": "2015-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23635100-a-tundra-tale", "num_ratings": "11", "num_reviews": "5", "avg_ratings": 4.18, "genres": ["Fantasy"], "title": "A Tundra Tale", "description": ["Inspired by Alaskan folklore, this fairytale story takes Olive, a twenty-year-old resident of a remote psychiatric hospital, on a journey into the tundra, where with the help of her arctic fox companion, a young Athabascan child, and an old trapper she will discover the secrets of the black wolf, the story of the land's ancestors, and the power of the northern lights that", "Inspired by Alaskan folklore, this fairytale story takes Olive, a twenty-year-old resident of a remote psychiatric hospital, on a journey into the tundra, where with the help of her arctic fox companion, a young Athabascan child, and an old trapper she will discover the secrets of the black wolf, the story of the land's ancestors, and the power of the northern lights that could unite them all."], "author": "Lone Alaskan Gypsy", "num_pages": "186", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-13 00:00:00", "ISBN": "1503171752"},
{"url": "https://www.goodreads.com/book/show/25086948-i-belong-to-the-earth", "num_ratings": "48", "num_reviews": "28", "avg_ratings": 4.54, "genres": ["Fantasy", "Paranormal", "Mystery", "Death"], "title": "I Belong to the Earth", "description": ["Seventeen-year-old Emlynn knows all about grief and guilt, not to mention secrets. Being able to sense the Dead wasn’t so bad before the accident which killed her mother. Now it’", "Seventeen-year-old Emlynn knows all about grief and guilt, not to mention secrets. Being able to sense the Dead wasn’t so bad before the accident which killed her mother. Now it’s taking over her life. Broken and shut off from the world, Emlynn is horrified when her father moves the family to a remote Yorkshire vicarage. A house that stands at the centre of a centuries old curse born of betrayal, jealousy and poisoned love. A curse that feeds on the lives of young girls. A pattern about to repeat itself once more... ", "When her older sister, Grace, gets involved with local bad boy, Haze, Emlynn knows she has to act fast. Somehow Haze is connected to the curse. Is Grace his next intended victim? ", "Hurtling towards another family tragedy, Emlynn must find the strength to stop running from her gift, or risk losing the rest of her family for good.", "Only the dead have the answers she needs. If she can bring herself to speak to them..."], "author": "J.A. Ironside", "num_pages": "246", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22612837-blind-stitches", "num_ratings": "29", "num_reviews": "5", "avg_ratings": 3.59, "genres": ["Romance", "Romance", "Contemporary Romance"], "title": "Blind Stitches", "description": ["Nikolai Solvay has been dreading his sister’s wedding, but when his father dies unexpectedly two weeks beforehand, his return to New Hampshire promises to rake up his worst nightmares.", "Meanwhile, talented young seamstress Juliet Glitch has been putting the finishing touches on the wedding dress. Mother of the bride—former prima ballerina and Russian expatriate—asks Juliet i", "Nikolai Solvay has been dreading his sister’s wedding, but when his father dies unexpectedly two weeks beforehand, his return to New Hampshire promises to rake up his worst nightmares.", "Meanwhile, talented young seamstress Juliet Glitch has been putting the finishing touches on the wedding dress. Mother of the bride—former prima ballerina and Russian expatriate—asks Juliet if she ‘would hem her blind son Nikolai’s trousers for the funeral’ … and the wedding. ", "When Juliet meets Nikolai, he draws her into the whirlwind of his unraveling family that makes her own quirky domestic situation seem normal. Confronted with the Solvay’s delusions and narcissism, Juliet must decide if her developing relationship with Nikolai is worth the turmoil as she deals with her own unreconciled past.", "Either way, Nikolai cannot stave off the repressed memories surrounding his mother’s defection from the Soviet Union twenty years earlier. Against the backdrop of autumn 1989, during the Glasnost era, Nikolai’s family secrets crash alongside the crumbling Berlin Wall."], "author": "J.B. Chicoine", "num_pages": "312", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-15 00:00:00", "ISBN": "0692214739"},
{"url": "https://www.goodreads.com/book/show/15833525-ethan-who-loved-carter", "num_ratings": "3,531", "num_reviews": "555", "avg_ratings": 4.13, "genres": ["Romance", "M M Romance", "Contemporary", "Disability", "Romance"], "title": "Ethan, Who Loved Carter", "description": ["By twenty-four, Carter Stevenson has stuttered and ticced his way to debilitating shyness. Although his friends accuse him of letting his Tourette's dictate his life, Carter moves from Los Angeles to a quiet California town. He'll keep his head down and avoid people. He doesn't anticipate his new neighbor, Ethan Hart, crashing into his solitude and forcing him to get out a", "By twenty-four, Carter Stevenson has stuttered and ticced his way to debilitating shyness. Although his friends accuse him of letting his Tourette's dictate his life, Carter moves from Los Angeles to a quiet California town. He'll keep his head down and avoid people. He doesn't anticipate his new neighbor, Ethan Hart, crashing into his solitude and forcing him to get out and live.", "From the beginning, Ethan makes his love for Carter clear. But he fears Carter won't see past Ethan's damaged brain, even though it makes Ethan more attuned to his emotions than most people. For Carter, there's a bigger issue: he's been burned by so-called \"perfect\" matches, and he won't risk his heart again.", "One way or another, Ethan's determined to show Carter they belong together. Then Ethan receives tragic news. Suddenly he must turn to Carter for strength and support. Will Carter come through when Ethan needs him most?"], "author": "Ryan Loveless", "num_pages": "210", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2012-09-17 00:00:00", "ISBN": "1613727356"},
{"url": "https://www.goodreads.com/book/show/22171202-delbert-judd", "num_ratings": "9", "num_reviews": "4", "avg_ratings": 5.0, "genres": ["Politics", "Mental Health", "Mental Illness", "Marriage", "Adult Fiction"], "title": "Delbert Judd", "description": ["...the tale is lighthearted and funny thanks to the humor of oddball Delbert, but it also explores some substantial issues, which gives it poignancy and weight. A well-written novel that is an interesting exploration of mental illness from the perspective of a sufferer's partner. -- Kirkus Reviews ", "A quirky, amusing debut novel about mental illness, religious corruption and", "...the tale is lighthearted and funny thanks to the humor of oddball Delbert, but it also explores some substantial issues, which gives it poignancy and weight. A well-written novel that is an interesting exploration of mental illness from the perspective of a sufferer's partner. -- Kirkus Reviews ", "A quirky, amusing debut novel about mental illness, religious corruption and the things people do to cope.", "At the center of Hammond's novel is Delbert Judd, a charming, if odd, sports enthusiast, who has isolated himself from most of humanity. The cause of his isolation—and center of his world—is Hannah, his beloved wife who suffers from borderline personality disorder. Delbert has become a hermit in his own neighborhood—a result of his attempts to avoid provoking a reaction from his wife and exacerbating her condition. ", "As the novel begins, however, Hannah has left for a lengthy business trip in Florida, and Delbert finally has time and space to himself—save for the nightly 8 p.m. phone calls with his wife. With the freedom to do as he pleases, Delbert unwittingly becomes involved in his neighborhood association's fight over allowing a new Christian fraternity to move into the neighborhood. He begins to adjust to spending time around people again, slowly becoming passionate about the issue at hand and making friends with his neighbors along the way. Despite these new distractions, there is still one thing that always weighs on his mind—his nightly phone calls with Hannah.", "The narrative is an intriguing exploration of mental illness, particularly borderline personality disorder, and how it affects its sufferers and the people who surround them. The book also considers religious freedom and the abuse of religious freedom. ", "Overall, the tale is lighthearted and funny thanks to the humor of oddball Delbert, but it also explores some substantial issues, which gives it poignancy and weight.", "A well-written novel that is an interesting exploration of mental illness from the perspective of a sufferer's partner. -- Kirkus Reviews"], "author": "Dan Hammond Jr.", "num_pages": "274", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-14 00:00:00", "ISBN": "0615972357"},
{"url": "https://www.goodreads.com/book/show/18733288-upside-down", "num_ratings": "1,492", "num_reviews": "370", "avg_ratings": 3.72, "genres": ["New Adult", "Romance", "Contemporary", "Romance", "Contemporary Romance"], "title": "Upside Down", "description": ["If You Never Get Lost, You’ll Never Be Found", "Twenty-one-year-old Natalia Stolfi is saying good-bye to the past-and turning her life upside down with a trip to the land down under. For the next six months, she'll act like a carefree exchange student, not a girl sinking under the weight of painful memories. Everything is going according to plan until she meets a brooding surf", "If You Never Get Lost, You’ll Never Be Found", "Twenty-one-year-old Natalia Stolfi is saying good-bye to the past-and turning her life upside down with a trip to the land down under. For the next six months, she'll act like a carefree exchange student, not a girl sinking under the weight of painful memories. Everything is going according to plan until she meets a brooding surfer with hypnotic green eyes and the troubling ability to see straight through her act.", "Bran Lockhart is having the worst year on record. After the girl of his dreams turned into a nightmare, he moved back home to Melbourne to piece his life together. Yet no amount of disappointment could blind him to the pretty California girl who gets past all his defenses. He's never wanted anyone the way he wants Talia. But when Bran gets a stark reminder of why he stopped believing in love, he and Talia must decide if what they have is once in a lifetime . . . or if they were meant to live a world apart.", "Book #1 in the OFF THE MAP series"], "author": "Lia Riley", "num_pages": "384", "awards": [], "places": ["Santa Cruz, California", "Hobart, Tasmania", "Melbourne, Victoria"], "character_names": [], "language": "English", "publish_date": "2014-08-05 00:00:00", "ISBN": "1455585718"},
{"url": "https://www.goodreads.com/book/show/317282.Memoirs_of_a_Teenage_Amnesiac", "num_ratings": "32,227", "num_reviews": "2,548", "avg_ratings": 3.69, "genres": ["Young Adult", "Contemporary", "Romance", "Fiction", "Realistic Fiction"], "title": "Memoirs of a Teenage Amnesiac", "description": ["If Naomi had picked tails, she would have won the coin toss. She wouldn't have had to go back for the yearbook camera, and she wouldn't have hit her head on the steps. She wouldn't have woken up in an ambulance with amnesia. She certainly would have remembered her boyfriend, Ace. She might even have remembered why she fell in love with him in the first place. She would und", "If Naomi had picked tails, she would have won the coin toss. She wouldn't have had to go back for the yearbook camera, and she wouldn't have hit her head on the steps. She wouldn't have woken up in an ambulance with amnesia. She certainly would have remembered her boyfriend, Ace. She might even have remembered why she fell in love with him in the first place. She would understand why her best friend, Will, keeps calling her \"Chief.\" She'd know about her mom's new family. She'd know about her dad's fiancée. She never would have met James, the boy with the questionable past and the even fuzzier future, who tells her he once wanted to kiss her. She wouldn't have wanted to kiss him back.", "But Naomi picked heads.", "After her remarkable debut, Gabrielle Zevin has crafted an imaginative second novel all about love and second chances.", " is a 2008 Bank Street - Best Children's Book of the Year."], "author": "Gabrielle Zevin", "num_pages": "288", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2010)", "The Inky Awards Nominee for Silver Inky (2008)", "Missouri Gateway Readers Award Nominee (2010)"], "places": [], "character_names": ["Naomi Porter", "James Larkin", "Will Landsman", "Ace Zuckerman"], "language": "English", "publish_date": "2007-08-21 00:00:00", "ISBN": "0374349460"},
{"url": "https://www.goodreads.com/book/show/16143347-we-were-liars", "num_ratings": "353,586", "num_reviews": "41,227", "avg_ratings": 3.84, "genres": ["Young Adult", "Contemporary", "Mystery", "Fiction", "Romance"], "title": "We Were Liars", "description": ["A beautiful and distinguished family.", "A private island.", "A brilliant, damaged girl; a passionate, political boy.", "A group of four friends—the Liars—whose friendship turns destructive.", "A revolution. An accident. A secret.", "Lies upon lies.", "True love.", "The truth.", "We Were Liars is a modern, sophisticated suspense novel from New York Times bestselling author, National Book Award finalist,", "A beautiful and distinguished family.", "A private island.", "A brilliant, damaged girl; a passionate, political boy.", "A group of four friends—the Liars—whose friendship turns destructive.", "A revolution. An accident. A secret.", "Lies upon lies.", "True love.", "The truth.", "We Were Liars is a modern, sophisticated suspense novel from New York Times bestselling author, National Book Award finalist, and Printz Award honoree E. Lockhart. ", "Read it.", "And if anyone asks you how it ends, just LIE."], "author": "E. Lockhart", "num_pages": "242", "awards": ["Georgia Peach Book Award (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Milwaukee County Teen Book Award Nominee (2015)", "The Inky Awards Nominee for Silver Inky (2015)", "Lincoln Award (2016)", "Bookworm Best Award for Best Fiction (2014)", "Goodreads Choice Award for Young Adult Fiction (2014)", "The Magnolia Award for 9-12 (2016)"], "places": [], "character_names": ["Cadence Sinclair"], "language": "English", "publish_date": "2014-05-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6442769-paper-towns", "num_ratings": "719,481", "num_reviews": "45,099", "avg_ratings": 3.86, "genres": ["Young Adult", "Contemporary", "Fiction", "Romance"], "title": "Paper Towns", "description": ["Quentin Jacobsen has spent a lifetime loving the magnificently adventurous Margo Roth Spiegelman from afar. So when she cracks open a window and climbs into his life—dressed like a ninja and summoning him for an ingenious campaign of revenge—he follows. After their all-nighter ends, and a new day breaks, Q arrives at school to discover that Margo, alw", "Quentin Jacobsen has spent a lifetime loving the magnificently adventurous Margo Roth Spiegelman from afar. So when she cracks open a window and climbs into his life—dressed like a ninja and summoning him for an ingenious campaign of revenge—he follows. After their all-nighter ends, and a new day breaks, Q arrives at school to discover that Margo, always an enigma, has now become a mystery. But Q soon learns that there are clues—and they're for him. Urged down a disconnected path, the closer he gets, the less Q sees the girl he thought he knew..."], "author": "John Green", "num_pages": "305", "awards": ["Anthony Award Nominee for Best Children's/Young Adult Novel (2009)", "Edgar Award for Best Young Adult (2009)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2011)", "The Inky Awards Nominee for Silver Inky (2009)", "Lincoln Award Nominee (2011)", "Bronzener Lufti (2010)", "Literaturpreis der Jury der jungen Leser for Jugendbuch (2010)", "The Inky Awards Shortlist for Silver Inky (2009)", "Missouri Gateway Readers Award Nominee (2011)", "Corine Internationaler Buchpreis for Kinder- und Jugendbuch (2010)"], "places": ["Orlando, Florida", "Agloe, New York"], "character_names": ["Margo Roth Spiegelman", "Quentin  Jacobsen", "Marcus \"Radar\" Lincoln", "Lacey Pemberton", "Ben Starling", "Jason Worthington"], "language": "English", "publish_date": "2009-09-22 00:00:00", "ISBN": "014241493X"},
{"url": "https://www.goodreads.com/book/show/4570768-willow", "num_ratings": "30,710", "num_reviews": "1,973", "avg_ratings": 3.93, "genres": ["Young Adult", "Romance", "Contemporary", "Fiction", "Realistic Fiction"], "title": "Willow", "description": ["Seven months ago on a rainy March night, Willow's parents drank too much wine at dinner and asked her to drive them home. But they never made it--Willow lost control of the car, and both of her parents were killed.", "Now seventeen, Willow is living with her older brother, who can barely speak to her. She has left behind her old home, friends, and school. But Willow has found", "Seven months ago on a rainy March night, Willow's parents drank too much wine at dinner and asked her to drive them home. But they never made it--Willow lost control of the car, and both of her parents were killed.", "Now seventeen, Willow is living with her older brother, who can barely speak to her. She has left behind her old home, friends, and school. But Willow has found a way to survive, to numb the new reality of her life: She is secretly cutting herself.", "And then she meets Guy, a boy as sensitive and complicated as she is. When Guy discovers Willow's secret, he pulls her out of the solitary world she's created for herself, and into a difficult, intense, and potentially life-changing relationship.", "Julia Hoban has created an unflinching story about cutting, grieving, and starting anew. But above all, she has written an unforgettable tale of first love."], "author": "Julia Hoban", "num_pages": "329", "awards": ["Florida Teens Read Nominee (2010)"], "places": [], "character_names": ["Willow Rosenberg", "Guy"], "language": "English", "publish_date": "2009-04-02 00:00:00", "ISBN": "0803733569"},
{"url": "https://www.goodreads.com/book/show/20946038-obsessive", "num_ratings": "110", "num_reviews": "21", "avg_ratings": 4.09, "genres": ["Romance", "Young Adult", "Did Not Finish"], "title": "Obsessive", "description": ["Hometown Hero. Mr. Perfect. Valedictorian. Most Likely to Succeed (or Die Trying). ", "For 18-year-old Grant Blue, the summer after high school graduation is a lot like that movie where the astronauts get cut loose and drift off into space. Any normal teenage guy would be glad for a few weeks of vacation, for all those extra hours spent with his gorgeous—but unpredictable—girl", "Hometown Hero. Mr. Perfect. Valedictorian. Most Likely to Succeed (or Die Trying). ", "For 18-year-old Grant Blue, the summer after high school graduation is a lot like that movie where the astronauts get cut loose and drift off into space. Any normal teenage guy would be glad for a few weeks of vacation, for all those extra hours spent with his gorgeous—but unpredictable—girlfriend, even for the chance to participate in a coveted internship that will make him a shoo-in for top of his class when he gets to college in the fall. ", "But Grant can’t seem to stop counting the reasons why he can’t do what ‘normal’ guys his age are doing. Why he shouldn’t want the things he wants. Why he doesn’t deserve to be called ‘perfect.’ On top of his parents’ expectations, Grant is getting tired of carrying a lifelong secret, one he’s betting that future employers, work colleagues and fellow students won’t understand. Let alone the girl he’s falling for, who thinks he’s \"too good\" for her. She couldn’t be more wrong. ", "Because the perfect student, the perfect son, the guy ‘most likely to succeed’…is about to crash and burn. ", "OBSESSIVE is Book Two in the “Issues Series” by Isobel Irons. ", "(For more information on PROMISCUOUS, the first book in this series, please visit ", ".)"], "author": "Isobel Irons", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-03-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6202342-her-fearful-symmetry", "num_ratings": "82,289", "num_reviews": "11,985", "avg_ratings": 3.24, "genres": ["Fiction", "Fantasy", "Fantasy", "Paranormal", "Mystery"], "title": "Her Fearful Symmetry", "description": ["Six years after the phenomenal success of The Time Traveler's Wife, Audrey Niffenegger has returned with a spectacularly compelling and haunting second novel set in and around Highgate Cemetery in London.", "When Elspeth Noblin dies of cancer, she leaves her London apartment to her twin nieces, Julia and Valentina. These two American girls never met their English aunt, only kn", "Six years after the phenomenal success of The Time Traveler's Wife, Audrey Niffenegger has returned with a spectacularly compelling and haunting second novel set in and around Highgate Cemetery in London.", "When Elspeth Noblin dies of cancer, she leaves her London apartment to her twin nieces, Julia and Valentina. These two American girls never met their English aunt, only knew that their mother, too, was a twin, and Elspeth her sister. Julia and Valentina are semi-normal American teenagers--with seemingly little interest in college, finding jobs, or anything outside their cozy home in the suburbs of Chicago, and with an abnormally intense attachment to one another.", "The girls move to Elspeth's flat, which borders Highgate Cemetery in London. They come to know the building's other residents. There is Martin, a brilliant and charming crossword puzzle setter suffering from crippling Obsessive Compulsive Disorder; Marjike, Martin's devoted but trapped wife; and Robert, Elspeth's elusive lover, a scholar of the cemetery. As the girls become embroiled in the fraying lives of their aunt's neighbors, they also discover that much is still alive in Highgate, including--perhaps--their aunt, who can't seem to leave her old apartment and life behind.", "Niffenegger weaves a captivating story in Her Fearful Symmetry about love and identity, about secrets and sisterhood, and about the tenacity of life--even after death."], "author": "Audrey Niffenegger", "num_pages": "406", "awards": ["Goodreads Choice Award Nominee for Favorite Book & Fiction (2009)"], "places": ["London, England"], "character_names": ["Elspeth Noblin", "Edwina Noblin", "Julia Poole", "Valentina Poole", "Robert Fanshawe", "Jack Poole", "Martin Wells", "Marijke Wells", "Jessica Bates", "James Bates"], "language": "English", "publish_date": "2009-09-29 00:00:00", "ISBN": "0224085611"},
{"url": "https://www.goodreads.com/book/show/17930773-found-in-you", "num_ratings": "31,110", "num_reviews": "1,557", "avg_ratings": 4.26, "genres": ["Romance", "Adult Fiction", "Erotica", "Romance", "Contemporary Romance", "Contemporary", "Adult"], "title": "Found in You", "description": ["Alayna Withers has only had one kind of relationship: the kind that makes her obsessive and stalker-crazy. Now that Hudson Pierce has let her into his heart, she’s determined to break down the remaining walls between them so they can build a foundation that’s based on more than just amazing sex. Except Hudson’s not the only one with secrets. ", "With their pasts pulling them i", "Alayna Withers has only had one kind of relationship: the kind that makes her obsessive and stalker-crazy. Now that Hudson Pierce has let her into his heart, she’s determined to break down the remaining walls between them so they can build a foundation that’s based on more than just amazing sex. Except Hudson’s not the only one with secrets. ", "With their pasts pulling them into a web of unfounded mistrust, Alayna turns to the one person who knows Hudson the best—Celia, the woman he almost married. Hoping for insight from someone who understands all sides of the story, Alayna forms a bond with Celia that goes too far—revealing things about Hudson that could end their love for good.", "This is the first relationship where Alayna hasn’t spiraled out of control. And she might lose Hudson anyway…"], "author": "Laurelin Paige", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17155039-light-in-the-shadows", "num_ratings": "15,946", "num_reviews": "1,289", "avg_ratings": 4.22, "genres": ["Romance", "New Adult", "Young Adult", "Contemporary", "Romance", "Contemporary Romance"], "title": "Light in the Shadows", "description": ["How do you keep going when you feel like your life is over?", "Maggie never thought she’d see Clay again. So, she attempts to put her life back together after her heart has been shattered to pieces. Moving on and moving forward, just as Clay wanted her to.", "Clay never stopped thinking of Maggie. Even after ripping their lives apart and leaving her behind to get the help he so de", "How do you keep going when you feel like your life is over?", "Maggie never thought she’d see Clay again. So, she attempts to put her life back together after her heart has been shattered to pieces. Moving on and moving forward, just as Clay wanted her to.", "Clay never stopped thinking of Maggie. Even after ripping their lives apart and leaving her behind to get the help he so desperately needed. He is healing...slowly. But his heart still belongs to the girl who tried to save him.", "When a sudden tragedy brings Maggie and Clay face to face again, nothing is the same. Yet some things never change. Can the darkness that threatened to consume them be transformed into something else and finally give them what they always wanted? And can two people who fought so hard to be together, finally find their happiness? Or will their demons and fear drive them apart for good?", "The thing about love, is even when it destroys you, it has a way of mending what is broken. And in the shadows, you can still see the light."], "author": "A. Meredith Walters", "num_pages": "318", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/662597.Cut", "num_ratings": "51,439", "num_reviews": "2,674", "avg_ratings": 3.76, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Mental Health", "Mental Illness", "Health", "Mental Health", "Contemporary", "Psychology", "Young Adult", "Teen", "Drama", "Young Adult", "High School"], "title": "Cut", "description": ["Callie cuts herself. Never too deep, never enough to die. But enough to feel the pain. Enough to feel the scream inside.", "Now she's at Sea Pines, a \"residential treatment facility\" filled with girls struggling with problems of their own. Callie doesn't want to have anything to do with them. She doesn't want to have anything to do with anyone. She won't even speak.", "But Callie", "Callie cuts herself. Never too deep, never enough to die. But enough to feel the pain. Enough to feel the scream inside.", "Now she's at Sea Pines, a \"residential treatment facility\" filled with girls struggling with problems of their own. Callie doesn't want to have anything to do with them. She doesn't want to have anything to do with anyone. She won't even speak.", "But Callie can only stay silent for so long..."], "author": "Patricia McCormick", "num_pages": "151", "awards": ["Lincoln Award Nominee (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-02-01 00:00:00", "ISBN": "0439324599"},
{"url": "https://www.goodreads.com/book/show/222458.Rules", "num_ratings": "48,228", "num_reviews": "4,389", "avg_ratings": 3.96, "genres": ["Realistic Fiction", "Young Adult", "Fiction", "Childrens", "Middle Grade"], "title": "Rules", "description": ["Twelve-year-old Catherine just wants a normal life. Which is near impossible when you have a brother with autism and a family that revolves around his disability. She's spent years trying to teach David the rules-from \"a peach is not a funny-looking apple\" to \"keep your pants on in public\"-in order to stop his embarrassing behaviors. But the summer Catherine meets Jason, a", "Twelve-year-old Catherine just wants a normal life. Which is near impossible when you have a brother with autism and a family that revolves around his disability. She's spent years trying to teach David the rules-from \"a peach is not a funny-looking apple\" to \"keep your pants on in public\"-in order to stop his embarrassing behaviors. But the summer Catherine meets Jason, a paraplegic boy, and Kristi, the next-door friend she's always wished for, it's her own shocking behavior that turns everything upside down and forces her to ask: What is normal?"], "author": "Cynthia Lord", "num_pages": "208", "awards": ["Newbery Medal Nominee (2007)", "Schneider Family Book Award for Middle School Book (2007)", "Dorothy Canfield Fisher Children's Book Award (2008)", "California Young Readers Medal Nominee for Middle School/Junior High (2009)", "Rebecca Caudill Young Readers' Book Award Nominee (2009)"], "places": ["Maine"], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0439443822"},
{"url": "https://www.goodreads.com/book/show/8077729-i-never-promised-you-a-rose-garden", "num_ratings": "26,208", "num_reviews": "812", "avg_ratings": 3.86, "genres": ["Fiction", "Psychology", "Young Adult", "Mental Health", "Mental Illness", "Health", "Mental Health", "Classics"], "title": "I Never Promised You a Rose Garden", "description": ["Hailed by ", " as \"convincing and emotionally gripping\" upon its publication in 1964, Joanne Greenberg's semiautobiographical novel stands as a timeless and unforgettable portrayal of mental illness. Enveloped in the dark inner kingdom of", "Hailed by ", " as \"convincing and emotionally gripping\" upon its publication in 1964, Joanne Greenberg's semiautobiographical novel stands as a timeless and unforgettable portrayal of mental illness. Enveloped in the dark inner kingdom of her schizophrenia, sixteen-year-old Deborah is haunted by private tormentors that isolate her from the outside world. With the reluctant and fearful consent of her parents, she enters a mental hospital where she will spend the next three years battling to regain her sanity with the help of a gifted psychiatrist. As Deborah struggles toward the possibility of the \"normal\" life she and her family hope for, the reader is inexorably drawn into her private suffering and deep determination to confront her demons.", "A modern classic, ", " remains every bit as poignant, gripping, and relevant today as when it was first published."], "author": "Hannah  Green", "num_pages": "304", "awards": [], "places": [], "character_names": ["Helene", "Carla", "Deborah Blau", "Esther Blau", "Dr. Fried (Furii)", "Miss Coral", "Jacob Blau"], "language": "English", "publish_date": "2009-01-06 00:00:00", "ISBN": "1429988770"},
{"url": "https://www.goodreads.com/book/show/854757.Bet_Me", "num_ratings": "79,280", "num_reviews": "3,414", "avg_ratings": 3.93, "genres": ["Romance", "Womens Fiction", "Chick Lit", "Romance", "Contemporary Romance", "Contemporary", "Fiction", "Humor", "Humor", "Funny"], "title": "Bet Me", "description": ["Minerva Dobbs knows that happily-ever-after is a fairy tale, especially with a man who asked her to dinner to win a bet. Even if he is gorgeous and successful Calvin Morrisey. Cal knows commitment is impossible, especially with a woman as cranky as Min Dobbs. Even if she does wear great shoes and keeps him on his toes. When they say good-bye at the end of their evening, th", "Minerva Dobbs knows that happily-ever-after is a fairy tale, especially with a man who asked her to dinner to win a bet. Even if he is gorgeous and successful Calvin Morrisey. Cal knows commitment is impossible, especially with a woman as cranky as Min Dobbs. Even if she does wear great shoes and keeps him on his toes. When they say good-bye at the end of their evening, they cut their losses and agree never to see each other again.", "But Fate has other plans, and it's not long before Min and Cal meet again. Soon, they're dealing with a jealous ex-boyfriend, Krispy Kreme donuts, a determined psychologist, chaos theory, a freakishly intelligent cat, Chicken Marsala, and more risky propositions than either of them ever dreamed of. Including the biggest gamble of all—true love."], "author": "Jennifer Crusie", "num_pages": "391", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Romance & Best Contemporary Romance & Favorite Funny & Best Heroine & Best Chick Lit/Women's Fiction & Best Couple & Honorable Mention for Best Hero (2005)", "RITA Award by Romance Writers of America for Best Contemporary Single Title (2005)", "Romance Readers Anonymous (RRA) Award for Best Romance of the Year (2004)"], "places": ["United States of America", "Ohio"], "character_names": ["Minerva Dobbs", "Calvin Morrisey", "David Fisk"], "language": "English", "publish_date": "2004-08-31 00:00:00", "ISBN": "0312987854"},
{"url": "https://www.goodreads.com/book/show/23286765-grayson", "num_ratings": "2,090", "num_reviews": "389", "avg_ratings": 4.08, "genres": ["Romance", "Mental Health", "Mental Illness", "Romance", "Contemporary Romance", "Contemporary", "New Adult", "Adult"], "title": "Grayson", "description": ["Contemporary romance. Intended for readers 18+", "An insane love that will keep you from falling---or push you right off the edge.", "All she needed was a job…", "The last thing twenty-four year old grad student Angie Roberts needs is to worry about her new boss’s father. After all, she’s never even seen him. He remains sequestered upstairs in a house that looks like it should be the", "Contemporary romance. Intended for readers 18+", "An insane love that will keep you from falling---or push you right off the edge.", "All she needed was a job…", "The last thing twenty-four year old grad student Angie Roberts needs is to worry about her new boss’s father. After all, she’s never even seen him. He remains sequestered upstairs in a house that looks like it should be the main feature in an episode of Hoarders. She had no idea the house was such a dump when she took the job. But she’s concerned about the safety and health of the old man living under such horrid conditions.", "What she got was a mystery…", "Despite warnings not to venture upstairs, she wanders up to the second floor. What she sees is shocking. The man she finds is a gorgeous, sexy, middle-aged man-- and he's stepping out of the shower. But something is definitely not right. Why would this wealthy, handsome man live in a house in such disrepair while his nine-teen year old son resides in a lavish pent-house? Why does he hide away from society? Why does he come to her rescue and then run away?", "What she discovered was heartbreaking…", "Angie learns that forty-four year old Grayson Whitmore suffers from schiz-ophrenia. Paranoid, he retreats into his own world.", "What she ended up with was a treasure…", "Angie is determined to get through to Grayson. They form a friendship that blazes into an inconceivable love fired with raging passion. Angie must now come to Grayson’s rescue because the wicked that has been perpetrated on him is unconscionable. First, though, she must gain the trust of a man whose mind does not allow for such a thing."], "author": "Lisa Eugene", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/38720300-there-are-things-i-know", "num_ratings": "18", "num_reviews": "9", "avg_ratings": 4.39, "genres": ["Novella", "Fiction"], "title": "There Are Things I Know", "description": ["Eight-year-old Pepper sees the world a little differently from most people.", "One day, during a school field trip, Pepper is kidnapped by a stranger and driven to rural Arkansas. The man, who calls himself ‘Uncle Dan’, claims that Pepper’s mother has died and they are to live together from now on – but the boy isn’t convinced. ", "Pepper always found it hard to figure out when pe", "Eight-year-old Pepper sees the world a little differently from most people.", "One day, during a school field trip, Pepper is kidnapped by a stranger and driven to rural Arkansas. The man, who calls himself ‘Uncle Dan’, claims that Pepper’s mother has died and they are to live together from now on – but the boy isn’t convinced. ", "Pepper always found it hard to figure out when people are lying, but he’s absolutely certain his mother is alive, and he’s going to find her..."], "author": "Karen B. Golightly", "awards": [], "places": ["Arkansas"], "character_names": ["Joseph Phillip 'Pepper' Branigan", "Uncle Dan"], "language": "English", "publish_date": "2018-07-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30981004-crazy-for-alice", "num_ratings": "41", "num_reviews": "17", "avg_ratings": 4.32, "genres": [], "title": "Crazy For Alice", "description": ["Donnie Darko meets Pleasantville in this dark urban fantasy about sixteen-year-old Ben Howard. When Ben accidentally kills his father and is sectioned after a failed suicide attempt, he escapes the guilt by seeking solace deep within the recesses of his own mind.", "Waking in a strange ethereal black and white world, where most people exist as living statues, Ben leaps from Ne", "Donnie Darko meets Pleasantville in this dark urban fantasy about sixteen-year-old Ben Howard. When Ben accidentally kills his father and is sectioned after a failed suicide attempt, he escapes the guilt by seeking solace deep within the recesses of his own mind.", "Waking in a strange ethereal black and white world, where most people exist as living statues, Ben leaps from New York skyscrapers into African jungles without fear of injury, severed from his emotions, until he meets and falls in love with Alice. But, no sooner does he settle into this strange, new existence, he’s traumatically catapulted back to the brutal reality he left behind.", "Nobody believes he’s spent the last six months in a Gray World. Not his neurotic mother, his policeman brother Gavin, or his friends Mitch and Wendy, and certainly not Dr. McKenzie who’s threatening to give him even more pills. They all think he’s crazy, and why wouldn’t they when he’s been in some strange coma locked up in a mental asylum?"], "author": "Alex Dunn", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-01 00:00:00", "ISBN": "1535097418"},
{"url": "https://www.goodreads.com/book/show/20786677-stand-alone", "num_ratings": "21", "num_reviews": "5", "avg_ratings": 4.38, "genres": ["Young Adult", "Health", "Mental Health", "European Literature", "Spanish Literature"], "title": "Stand Alone", "description": ["Is Justine crazy?", "Everyone thinks so...", "Her mother. The kids at school, and the teachers and administrators too. Even the police who pick her up from her night rambles. Maybe them most of all.", "Justine’s therapist says she is ‘troubled’, but it means the same thing. He thinks that her vivid, reoccurring nightmares and atrocious behavior point to some trauma in her past; but Em", "Is Justine crazy?", "Everyone thinks so...", "Her mother. The kids at school, and the teachers and administrators too. Even the police who pick her up from her night rambles. Maybe them most of all.", "Justine’s therapist says she is ‘troubled’, but it means the same thing. He thinks that her vivid, reoccurring nightmares and atrocious behavior point to some trauma in her past; but Em, Justine’s mother, can’t explain it.", "Justine used to have Christian, her best friend and skateboard partner. He was the only one who accepted her. Maybe because skating is the only time that Justine is really free to be herself. Now that Christian is gone… Justine keeps thinking things can’t get any worse.", "Even as she sees her life spinning further and further out of control, Justine can’t give up her sense of who she is—someone far different than the loving daughter Em expects her to be—to just fit in and be happy. She is sure that Em secretly holds the key to who Justine really is. But if she does, Em isn’t talking."], "author": "P.D. Workman", "num_pages": "322", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30455063-subject-375", "num_ratings": "472", "num_reviews": "150", "avg_ratings": 3.51, "genres": ["Thriller", "Did Not Finish", "Thriller", "Mystery Thriller"], "title": "Subject 375", "description": ["My name is Dr Maria Martinez and I am – was – a Consultant Plastic Surgeon. I am 33 years old. Place of birth: Salamanca, Spain... And I was convicted of the murder of a Catholic priest.' Maria is in prison. She says she's innocent and is fighting to clear her name. Because deep down she knows the truth better than anyone. Doesn't she?"], "author": "Nikki Owen", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-06 00:00:00", "ISBN": "1504725794"},
{"url": "https://www.goodreads.com/book/show/17448960-falling-into-you", "num_ratings": "50,443", "num_reviews": "4,363", "avg_ratings": 4.04, "genres": ["Young Adult", "Romance", "Did Not Finish", "Academic", "College"], "title": "Falling into You", "description": ["I wasn't always in love with Colton Calloway; I was in love with his younger brother, Kyle, first. Kyle was my first one true love, my first in every way.", "Then, one stormy August night, he died, and the person I was died with him.", "Colton didn't teach me how to live. He didn't heal the pain. He didn't make it okay. He taught me how to hurt, how to not be okay, and, eventually", "I wasn't always in love with Colton Calloway; I was in love with his younger brother, Kyle, first. Kyle was my first one true love, my first in every way.", "Then, one stormy August night, he died, and the person I was died with him.", "Colton didn't teach me how to live. He didn't heal the pain. He didn't make it okay. He taught me how to hurt, how to not be okay, and, eventually, how to let go."], "author": "Jasinda Wilder", "num_pages": "240", "awards": [], "places": [], "character_names": ["Nell Hawthorne", "Colton Calloway", "Kyle Calloway"], "language": "English", "publish_date": "2013-03-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/99300.The_Yellow_Wallpaper_and_Other_Stories", "num_ratings": "70,644", "num_reviews": "1,594", "avg_ratings": 4.03, "genres": ["Classics", "Short Stories", "Fiction", "Feminism", "Horror", "Literature"], "title": "The Yellow Wallpaper and Other Stories", "description": ["Best known for the 1892 title story of this collection, a harrowing tale of a woman's descent into madness, Charlotte Perkins Gilman wrote more than 200 other short stories. Seven of her finest are reprinted here.", "Written from a feminist perspective, often focusing on the inferior status accorded to women by society, the tales include \"turned,\" an ironic story with a startl", "Best known for the 1892 title story of this collection, a harrowing tale of a woman's descent into madness, Charlotte Perkins Gilman wrote more than 200 other short stories. Seven of her finest are reprinted here.", "Written from a feminist perspective, often focusing on the inferior status accorded to women by society, the tales include \"turned,\" an ironic story with a startling twist, in which a husband seduces and impregnates a naïve servant; \"Cottagette,\" concerning the romance of a young artist and a man who's apparently too good to be true; \"Mr. Peebles' Heart,\" a liberating tale of a fiftyish shopkeeper whose sister-in-law, a doctor, persuades him to take a solo trip to Europe, with revivifying results; \"The Yellow Wallpaper\"; and three other outstanding stories.", "These charming tales are not only highly readable and full of humor and invention, but also offer ample food for thought about the social, economic, and personal relationship of men and women — and how they might be improved.", "The yellow wallpaper ", "Three Thanksgivings ", "The cottagette ", "Turned ", "Making a change ", "If I were a man ", "Mr. Peebles' heart."], "author": "Charlotte Perkins Gilman", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-07-11 00:00:00", "ISBN": "0486298574"},
{"url": "https://www.goodreads.com/book/show/17835766-one-more-chance", "num_ratings": "26,801", "num_reviews": "1,959", "avg_ratings": 4.28, "genres": ["New Adult", "Romance", "Contemporary", "Romance", "Contemporary Romance"], "title": "One More Chance", "description": ["Grant Carter did everything in his power to convince Harlow Manning that he was a good guy. More than a smooth-talker and someone she could trust. He had to overcome his reputation as a playboy, and his history with Harlow's half-sister, Nan, a woman with a reputation of her own.", "Harlow had taken the chance, falling hard and fast for the guy who thrilled her with his all-co", "Grant Carter did everything in his power to convince Harlow Manning that he was a good guy. More than a smooth-talker and someone she could trust. He had to overcome his reputation as a playboy, and his history with Harlow's half-sister, Nan, a woman with a reputation of her own.", "Harlow had taken the chance, falling hard and fast for the guy who thrilled her with his all-consuming desire. After a lifetime of avoiding bad boys like Grant, she had opened herself to the possibilities of love...", "But a life-changing secret has torn them apart, and now Grant and Harlow must decide if they have enough fight to make it work - or if the pain of betrayal has permanently destroyed their future."], "author": "Abbi Glines", "num_pages": "273", "awards": [], "places": ["Rosemary Beach, Florida"], "character_names": ["Harlow Manning", "Grant Carter"], "language": "English", "publish_date": "2014-09-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4271.About_a_Boy", "num_ratings": "115,991", "num_reviews": "2,944", "avg_ratings": 3.79, "genres": ["Fiction", "Contemporary", "Humor"], "title": "About a Boy", "description": ["Too cool! At thirty-six, he's as hip as a teenager. He's single, child-free, goes to the right clubs and knows which trainers to wear. He's also found a great way to score with women: attend single parents' groups full of available (and grateful) mothers, all hoping to meet a Nice Guy.", "Which is how Will meets Marcus, the oldest twelve-year-old on", "Too cool! At thirty-six, he's as hip as a teenager. He's single, child-free, goes to the right clubs and knows which trainers to wear. He's also found a great way to score with women: attend single parents' groups full of available (and grateful) mothers, all hoping to meet a Nice Guy.", "Which is how Will meets Marcus, the oldest twelve-year-old on the planet. Marcus is a bit strange: he listens to Joni Mitchell and Mozart, looks after his mum and has never owned a pair of trainers. But Marcus latches on to Will - and won't let go. Can Will teach Marcus how to grow up cool? And can Marcus help Will just to grow up?"], "author": "Nick Hornby", "num_pages": "307", "awards": [], "places": [], "character_names": ["Will Burrows", "Fiona Waters", "Ellie"], "language": "English", "publish_date": "2000-08-16 00:00:00", "ISBN": "0140285679"},
{"url": "https://www.goodreads.com/book/show/20636361-lovelines", "num_ratings": "2,031", "num_reviews": "307", "avg_ratings": 3.89, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "New Adult", "Did Not Finish"], "title": "LoveLines", "description": ["Arrive at work at 7:58 A.M. sharp. Check. Count forty-seven steps to cubicle. Check. Arrange pens in their red-blue-black-green-purple order of importance. Check. Apply hand sanitizer before opening email. Double check.", "And that’s just the first few minutes of her work day.", "Thirty-one-year-old proofreader Bailey Mitchell is a slave to her tics. She inherited Obsessive Compul", "Arrive at work at 7:58 A.M. sharp. Check. Count forty-seven steps to cubicle. Check. Arrange pens in their red-blue-black-green-purple order of importance. Check. Apply hand sanitizer before opening email. Double check.", "And that’s just the first few minutes of her work day.", "Thirty-one-year-old proofreader Bailey Mitchell is a slave to her tics. She inherited Obsessive Compulsive Disorder from her father, and it’s done nothing but inhibit her love life. She’s run the gamut of boyfriends—none of them willing or able to cope with her condition.", "Enter 32-year-old Reece Powell, her new coworker at Beach Elite Marketing Firm. He’s more than willing to cope. He finds her habits cute and quirky... for now. Reece wins her over, and life coasts along for them until Bailey experiences a devastating blow. Tragedy exacerbates her OCD, and Reece realizes her tics aren’t so cute and quirky anymore. Just like all the others, he has the choice to leave.", "But Reece isn’t like all the others."], "author": "S. Walden", "num_pages": "397", "awards": [], "places": ["Wilmington, North Carolina"], "character_names": ["Bailey Mitchell", "Reece Powell"], "language": "English", "publish_date": "2014-03-25 00:00:00", "ISBN": "1496129040"},
{"url": "https://www.goodreads.com/book/show/23312692-nocte", "num_ratings": "7,168", "num_reviews": "1,503", "avg_ratings": 4.16, "genres": ["New Adult", "Romance", "Mystery", "Dark", "Contemporary"], "title": "Nocte", "description": ["My name is Calla Price. I'm eighteen years old, and I'm one half of a whole. My other half—my twin brother, my Finn—is crazy. I love him. More than life, more than anything. And even though I'm terrified he'll suck me down with him, no one can save him but me. I'm doing all I can to stay afloat in a sea of insanity, but I'm drowning more and more each day. So I reach out f", "My name is Calla Price. I'm eighteen years old, and I'm one half of a whole. My other half—my twin brother, my Finn—is crazy. I love him. More than life, more than anything. And even though I'm terrified he'll suck me down with him, no one can save him but me. I'm doing all I can to stay afloat in a sea of insanity, but I'm drowning more and more each day. So I reach out for a lifeline. Dare DuBray. He's my savior and my anti-Christ. His arms are where I feel safe, where I'm afraid, where I belong, where I'm lost. He will heal me, break me, love me and hate me. He has the power to destroy me. Maybe that's ok. Because I can't seem to save Finn and love Dare without everyone getting hurt. Why? Because of a secret. A secret I'm so busy trying to figure out, that I never see it coming. You won't either."], "author": "Courtney Cole", "num_pages": "322", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17977864-the-long-weekend", "num_ratings": "23", "num_reviews": "1", "avg_ratings": 4.61, "genres": [], "title": "The Long Weekend", "description": ["Five people working for the same company but not really knowing each other. They all start the bank holiday weekend, but how many will finish it and arrive back at work on the right side of the law and still alive?"], "author": "Ross Lennon", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-11-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10441.The_Memory_Keeper_s_Daughter", "num_ratings": "521,737", "num_reviews": "18,502", "avg_ratings": 3.65, "genres": ["Fiction", "Contemporary", "Adult Fiction", "Adult"], "title": "The Memory Keeper's Daughter", "description": ["On a winter night in 1964, Dr. David Henry is forced by a blizzard to deliver his own twins. His son, born first, is perfectly healthy. Yet when his daughter is born, he sees immediately that she has Down's Syndrome. Rationalizing it as a need to protect Norah, his wife, he makes a split-second decision that will alter all of their lives forever. He asks his nurse to take", "On a winter night in 1964, Dr. David Henry is forced by a blizzard to deliver his own twins. His son, born first, is perfectly healthy. Yet when his daughter is born, he sees immediately that she has Down's Syndrome. Rationalizing it as a need to protect Norah, his wife, he makes a split-second decision that will alter all of their lives forever. He asks his nurse to take the baby away to an institution and never to reveal the secret. But Caroline, the nurse, cannot leave the infant. Instead, she disappears into another city to raise the child herself. So begins this story that unfolds over a quarter of a century - in which these two families, ignorant of each other, are yet bound by the fateful decision made that long-ago winter night. Norah Henry, who knows only that her daughter died at birth, remains inconsolable; her grief weighs heavily on their marriage. And Paul, their son, raises himself as best he can, in a house grown cold with mourning. Meanwhile, Phoebe, the lost daughter, grows from a sunny child to a vibrant young woman whose mother loves her as fiercely as if she were her own."], "author": "Kim Edwards", "num_pages": "401", "awards": [], "places": ["Pittsburgh, Pennsylvania", "Lexington, Kentucky", "Paris"], "character_names": ["Phoebe", "Al", "Dr. David Henry", "Norah Henry", "Bree", "Paul Henry"], "language": "English", "publish_date": "2006-05-30 00:00:00", "ISBN": "0143037145"},
{"url": "https://www.goodreads.com/book/show/22402972-fish-in-a-tree", "num_ratings": "24,229", "num_reviews": "3,907", "avg_ratings": 4.3, "genres": ["Realistic Fiction", "Childrens", "Middle Grade", "Young Adult", "Fiction", "Childrens"], "title": "Fish in a Tree", "description": ["“Everybody is smart in different ways. But if you judge a fish by its ability to climb a tree, it will live its life believing it is stupid.”", "Ally has been smart enough to fool a lot of smart people. Every time she lands in a new school, she is able to hide her inability to read by creating clever yet disruptive distractions. She is afraid to ask for help; after all, how ca", "“Everybody is smart in different ways. But if you judge a fish by its ability to climb a tree, it will live its life believing it is stupid.”", "Ally has been smart enough to fool a lot of smart people. Every time she lands in a new school, she is able to hide her inability to read by creating clever yet disruptive distractions. She is afraid to ask for help; after all, how can you cure dumb? However, her newest teacher Mr. Daniels sees the bright, creative kid underneath the trouble maker. With his help, Ally learns not to be so hard on herself and that dyslexia is nothing to be ashamed of. As her confidence grows, Ally feels free to be herself and the world starts opening up with possibilities. She discovers that there’s a lot more to her—and to everyone—than a label, and that great minds don’t always think alike."], "author": "Lynda Mullaly Hunt", "num_pages": "288", "awards": ["Schneider Family Book Award for Middle School (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Grades 6-8 (2017)", "Keystone to Reading Book Award Nominee for Intermediate (2017)", "Bluestem Book Award Nominee (2019)", "Goodreads Choice Award Nominee for Middle Grade & Children's (2015)", "Rebecca Caudill Young Readers' Book Award Nominee (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-05 00:00:00", "ISBN": "0399162593"},
{"url": "https://www.goodreads.com/book/show/40000992-moving-the-chains", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "Moving the Chains", "description": ["Although high school freshman Abby Mandato is the star quarterback of her small town's high school football team, she hates drawing attention to herself and prefers the comfort of routine. When she finds out her family is moving to the big city and leaving behind everything she knows, Abby's latent anxiety becomes a problem that she can no longer ignore. Her mother thinks", "Although high school freshman Abby Mandato is the star quarterback of her small town's high school football team, she hates drawing attention to herself and prefers the comfort of routine. When she finds out her family is moving to the big city and leaving behind everything she knows, Abby's latent anxiety becomes a problem that she can no longer ignore. Her mother thinks she is just being dramatic and tells her to stop seeking attention. Her brother wants to help but doesn’t know what to do. All Abby knows is that these symptoms keep her from living a happy, normal life. In order to be successful both on and off the field, she must face her inner fears, her foes on the football field, and the stigma of having a common mental health condition before her nervous symptoms become crippling. ", "Twenty years later, Abby has become a successful professor of psychology. Although her nervous symptoms are well under control, she still experiences routine anxiety that she effectively deals with using the tools that she has learned over the years. When she is thrown into the lime-light because of her research on the stigma surrounding mental health, Abby experiences a new wave of anxiety. She is called to face her fear of public speaking in order to promote an issue that she is passionate about. With the insight she has gained over the years, she works through her symptoms, reflects back on her path since high school, and finds that she still has a lot to learn. ", "This book was written as a way to give a voice to a group of voiceless people. According to NAMI (National Alliance on Mental Illness), approximately one in five people - children, teens, and adults - in the United States will suffer from a mental illness in a given year. The average sufferer will wait eight to ten before seeking help. Stigma and misconceptions play a great part in the suffering of nervous people. This book seeks to shine a light on the stigma surrounding mental illness and to promote the discussion of healthy alternatives rather than ignoring nervous symptoms."], "author": "Em Lyons Bouch", "num_pages": "462", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-04-03 00:00:00", "ISBN": "1513629336"},
{"url": "https://www.goodreads.com/book/show/12262889-trueman-bradley---aspie-detective", "num_ratings": "47", "num_reviews": "9", "avg_ratings": 4.4, "genres": ["Mystery", "New York", "Fiction"], "title": "Trueman Bradley - Aspie Detective", "description": ["Trueman Bradley is a genius detective with a difference, he has Asperger's Syndrome (AS).", "Trueman leaves his hometown of Heartville, Illinois, and arrives in New York City, hoping to fulfil his dream of becoming a private detective, like his comic book heroes. He is soon told that a guy with AS could not possibly succeed as a detective. Undeterred, Trueman uses his exceptio", "Trueman Bradley is a genius detective with a difference, he has Asperger's Syndrome (AS).", "Trueman leaves his hometown of Heartville, Illinois, and arrives in New York City, hoping to fulfil his dream of becoming a private detective, like his comic book heroes. He is soon told that a guy with AS could not possibly succeed as a detective. Undeterred, Trueman uses his exceptional mathematical skills to invent a crime-fighting equation, and with the help of his new friends and some amazing inventions, sets out to test his skills against the criminal world of New York. He is determined to show the police, his friends, and himself, that a guy with AS can become as good a detective as anyone else, maybe, even, one of the best.", "Trueman Bradley - Aspie Detective is a fantasy adventure that will capture the imagination of anyone interested in Asperger's Syndrome."], "author": "Alexei Maxim Russell", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-15 00:00:00", "ISBN": "184905262X"},
{"url": "https://www.goodreads.com/book/show/1217100.Thirteen_Reasons_Why", "num_ratings": "645,104", "num_reviews": "48,147", "avg_ratings": 3.99, "genres": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "title": "Thirteen Reasons Why", "description": ["Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker–his classmate and crush–who committed suicide two weeks earlier. Hannah’s voice tells him that", "Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker–his classmate and crush–who committed suicide two weeks earlier. Hannah’s voice tells him that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he’ll find out why. ", "Clay spends the night crisscrossing his town with Hannah as his guide. He becomes a firsthand witness to Hannah’s pain, and as he follows Hannah’s recorded words throughout his town, what he discovers changes his life forever."], "author": "Jay Asher", "num_pages": "288", "awards": ["Georgia Peach Book Award Nominee for Honor book (2009)", "California Book Award for Young Adult (Silver) (2007)", "South Carolina Book Award for Young Adult Book (2010)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2010)", "Lincoln Award (2013)", "Missouri Gateway Readers Award (2010)", "Oklahoma Sequoyah Award for High School (2010)"], "places": [], "character_names": ["Clay Jensen", "Hannah Baker", "Bryce Walker", "Jessica Davis", "Justin Foley", "Tyler Down", "Courtney Crimsen", "Alex Standall", "Mr. Porter", "Marcus Cooley", "Zach Dempsey", "Ryan Shaver", "Jenny Kurtz"], "language": "English", "publish_date": "2007-10-18 00:00:00", "ISBN": "1595141715"},
{"url": "https://www.goodreads.com/book/show/29440143-asperger-s-on-the-inside", "num_ratings": "161", "num_reviews": "42", "avg_ratings": 4.18, "genres": ["Nonfiction", "Health", "Aspergers", "Autobiography", "Memoir", "Biography"], "title": "Asperger's on the Inside", "description": [" is an acutely honest and often highly entertaining memoir by Michelle Vines about life with Asperger's Syndrome. The book follows Michelle in exploring her past and takes the reader with her on her journey to receiving and accepting her diagnosis. ", "Instead of rehashing widely available Asperger's information, Michelle focuses on discussing the tho", " is an acutely honest and often highly entertaining memoir by Michelle Vines about life with Asperger's Syndrome. The book follows Michelle in exploring her past and takes the reader with her on her journey to receiving and accepting her diagnosis. ", "Instead of rehashing widely available Asperger's information, Michelle focuses on discussing the thoughts, feelings and ideas that go along with being an Aspie, giving us a rare peek into what it really feels like to be a person on the spectrum. ", "A must read for all those who enjoy deep personal stories or have a loved one on the spectrum that they wish to understand better."], "author": "Michelle Vines", "num_pages": "268", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-08 00:00:00", "ISBN": "1938821955"},
{"url": "https://www.goodreads.com/book/show/34262106-everything-here-is-beautiful", "num_ratings": "5,062", "num_reviews": "876", "avg_ratings": 3.97, "genres": ["Fiction", "Contemporary", "Health", "Mental Health", "Mental Health", "Mental Illness", "Literary Fiction", "Adult Fiction"], "title": "Everything Here Is Beautiful", "description": ["Two sisters: Miranda, the older, responsible one, always her younger sister's protector; Lucia, the vibrant, headstrong, unconventional one, whose impulses are huge and, often, life changing. When their mother dies and Lucia starts to hear voices, it's Miranda who must fight for the help her sister needs — even as Lucia refuses to be defined by any doctor's diagnosis. ", "Dete", "Two sisters: Miranda, the older, responsible one, always her younger sister's protector; Lucia, the vibrant, headstrong, unconventional one, whose impulses are huge and, often, life changing. When their mother dies and Lucia starts to hear voices, it's Miranda who must fight for the help her sister needs — even as Lucia refuses to be defined by any doctor's diagnosis. ", "Determined, impetuous, she plows ahead, marrying a big-hearted Israeli only to leave him, suddenly, to have a baby with a young Latino immigrant. She will move with her new family to Ecuador, but the bitter constant remains: she cannot escape her own mental illness. Lucia lives life on a grand scale, until inevitably, she crashes to earth. And then Miranda must decide, again, whether or not to step in — but this time, Lucia may not want to be saved. The bonds of sisterly devotion stretch across oceans, but what does it take to break them?", "Told from alternating perspectives, ", " is, at its core, a heart-wrenching family drama about relationships and tough choices — how much we're willing to sacrifice for the ones we love, and when it's time to let go and save ourselves."], "author": "Mira T. Lee", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-01-16 00:00:00", "ISBN": "0735221960"},
{"url": "https://www.goodreads.com/book/show/439288.Speak", "num_ratings": "404,773", "num_reviews": "19,988", "avg_ratings": 4.01, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction"], "title": "Speak", "description": ["\"Speak up for yourself--we want to know what you have to say.\" From the first moment of her freshman year at Merryweather High, Melinda knows this is a big fat lie, part of the nonsense of high school. She is friendless, outcast, because she busted an end-of-summer party by calling the cops, so now nobody will talk to her, let alone listen to her. As time passes, she becom", "\"Speak up for yourself--we want to know what you have to say.\" From the first moment of her freshman year at Merryweather High, Melinda knows this is a big fat lie, part of the nonsense of high school. She is friendless, outcast, because she busted an end-of-summer party by calling the cops, so now nobody will talk to her, let alone listen to her. As time passes, she becomes increasingly isolated and practically stops talking altogether. Only her art class offers any solace, and it is through her work on an art project that she is finally able to face what really happened at that terrible party: she was raped by an upperclassman, a guy who still attends Merryweather and is still a threat to her. Her healing process has just begun when she has another violent encounter with him. But this time Melinda fights back, refuses to be silent, and thereby achieves a measure of vindication. ", "In Laurie Halse Anderson's powerful novel, an utterly believable heroine with a bitterly ironic voice delivers a blow to the hypocritical world of high school. She speaks for many a disenfranchised teenager while demonstrating the importance of speaking up for oneself."], "author": "Laurie Halse Anderson", "num_pages": "208", "awards": ["SCBWI Golden Kite Award for Fiction (1999)", "Edgar Award Nominee for Best Young Adult (2000)", "Michael L. Printz Award Nominee (2000)", "South Carolina Book Award for Young Adult Book Award (2002)", "Dorothy Canfield Fisher Children's Book Award Nominee (2001)", "Evergreen Teen Book Award (2002)", "Boston Globe-Horn Book Award (2000)", "California Young Readers Medal Nominee for Young Adult (2003)", "Lincoln Award Nominee (2005)", "National Book Award Finalist for Young People's Literature (1999)", "Oklahoma Sequoyah Award for YA (2002)"], "places": ["Syracuse, New York"], "character_names": ["Rachel Honeybourne (Beauty)", "Ivy Hall", "Heather", "Nichole Smythe Burnell", "Melinda Sordino", "Andy Evans", "David Petrakis", "Mr. Freeman"], "language": "English", "publish_date": "2001-04-01 00:00:00", "ISBN": "014131088X"},
{"url": "https://www.goodreads.com/book/show/11841579-the-unbecoming-of-mara-dyer", "num_ratings": "138,994", "num_reviews": "15,123", "avg_ratings": 4.08, "genres": ["Young Adult", "Fantasy", "Paranormal", "Fantasy", "Romance"], "title": "The Unbecoming of Mara Dyer", "description": ["When Mara Dyer wakes up in hospital with no memory of how she got there, or any explanation as to why the bizarre accident that caused the deaths of her boyfriend and two best friends left her mysteriously unharmed, her doctors suggest that she start over in a new city, at a new school, and just hope her memories gradually come back. ", "But Mara's new start is anything but co", "When Mara Dyer wakes up in hospital with no memory of how she got there, or any explanation as to why the bizarre accident that caused the deaths of her boyfriend and two best friends left her mysteriously unharmed, her doctors suggest that she start over in a new city, at a new school, and just hope her memories gradually come back. ", "But Mara's new start is anything but comforting. She sees the faces of her dead friends everywhere and now she's started to see other peoples deaths before they happen. Is she going crazy? As if dealing with all this isn't enough, Noah Shaw, the most beautiful boy she's ever seen, can't seem to leave her alone. But does he have her best interests at heart, or another agenda altogether?"], "author": "Michelle Hodkin", "num_pages": "452", "awards": [], "places": ["Miami, Florida"], "character_names": ["Mara Dyer", "Noah Shaw"], "language": "English", "publish_date": "2012-03-01 00:00:00", "ISBN": "085707363X"},
{"url": "https://www.goodreads.com/book/show/17617277-real", "num_ratings": "93,361", "num_reviews": "7,186", "avg_ratings": 4.21, "genres": ["Romance", "Contemporary", "Romance", "Contemporary Romance", "Sports and Games", "Sports", "Warfare", "Fighters", "Adult Fiction", "Erotica", "Adult", "Contemporary Romance", "Sports Romance", "Romance", "Erotic Romance", "Martial Arts", "Mixed Martial Arts"], "title": "Real", "description": ["A fallen boxer.", "A woman with a broken dream.", "A competition...", "He even makes me forget my name. One night was all it took, and I forgot everything and anything except the sexy fighter in the ring who sets my mind ablaze and my body on fire with wanting...", "Remington Tate is the strongest, most confusing man I've ever met in my life.", "He’s the star of the dangerous underground figh", "A fallen boxer.", "A woman with a broken dream.", "A competition...", "He even makes me forget my name. One night was all it took, and I forgot everything and anything except the sexy fighter in the ring who sets my mind ablaze and my body on fire with wanting...", "Remington Tate is the strongest, most confusing man I've ever met in my life.", "He’s the star of the dangerous underground fighting circuit, and I’m drawn to him as I've never been drawn to anything in my life. I forget who I am, what I want, with just one look from him. When he’s near, I need to remind myself that I am strong—but he is stronger. And now it’s my job to keep his body working like a perfect machine, his taut muscles primed and ready to break the bones of his next opponents...", "But the one he’s most threatening to, now, is me.", "I want him. I want him without fear. Without reservations.", "If only I knew for sure what it is that he wants from me?"], "author": "Katy Evans", "num_pages": "293", "awards": ["Goodreads Choice Award Nominee for Debut Author, Romance (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-08 00:00:00", "ISBN": "1301347949"},
{"url": "https://www.goodreads.com/book/show/1618.The_Curious_Incident_of_the_Dog_in_the_Night_Time", "num_ratings": "994,449", "num_reviews": "38,720", "avg_ratings": 3.86, "genres": ["Fiction", "Mystery", "Young Adult", "Contemporary"], "title": "The Curious Incident of the Dog in the Night-Time", "description": ["Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. And he detests the color yellow.", "Although gifted with a superbly logical brain, for fifteen-year-old Christopher everyday interactions and admonishment", "Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. And he detests the color yellow.", "Although gifted with a superbly logical brain, for fifteen-year-old Christopher everyday interactions and admonishments have little meaning. He lives on patterns, rules, and a diagram kept in his pocket. Then one day, a neighbor's dog, Wellington, is killed and his carefully constructive universe is threatened. Christopher sets out to solve the murder in the style of his favourite (logical) detective, Sherlock Holmes. What follows makes for a novel that is funny, poignant and fascinating in its portrayal of a person whose curse and blessing are a mind that perceives the world entirely literally."], "author": "Mark Haddon", "num_pages": "226", "awards": ["Man Booker Prize Nominee for Longlist (2003)", "James Tait Black Memorial Prize Nominee for Fiction (2003)", "Whitbread Award for Novel and Book of the Year (2003)", "Guardian Children's Fiction Prize (2003)", "McKitterick Prize (2004)", "Los Angeles Times Book Prize for Art Seidenbaum Award for First Fiction (2003)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Zilveren Zoen (2004)", "Lincoln Award Nominee (2006)", "Commonwealth Writers' Prize for Best First Book Overall (2004)", "North East Teenage Book Award Nominee (2004)", "Dolly Gray Children's Literature Award (2004)"], "places": ["Swindon, England", "London, England", "England"], "character_names": ["Christopher John Francis Boone", "Toby", "Siobhan", "Mr. Jeavons", "Mrs. Alexander", "Ed Boone", "Judy Boone", "Mr. Roger Shears", "Mrs. Eileen Shears", "Rhodri", "Wellington"], "language": "English", "publish_date": "2004-05-18 00:00:00", "ISBN": "1400032717"},
{"url": "https://www.goodreads.com/book/show/28187.The_Lightning_Thief", "num_ratings": "1,594,603", "num_reviews": "50,192", "avg_ratings": 4.24, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Fiction"], "title": "The Lightning Thief", "description": ["Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth ab", "Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse - Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him. When Percy's mom finds out, she knows it's time that he knew the truth about where he came from, and that he go to the one place he'll be safe. She sends Percy to Camp Half Blood, a summer camp for demigods (on Long Island), where he learns that the father he never knew is Poseidon, God of the Sea. Soon a mystery unfolds and together with his friends—one a satyr and the other the demigod daughter of Athena - Percy sets out on a quest across the United States to reach the gates of the Underworld (located in a recording studio in Hollywood) and prevent a catastrophic war between the gods."], "author": "Rick Riordan", "num_pages": "375", "awards": ["Young Readers' Choice Award (2008)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2011)", "South Carolina Book Award for Junior Book Award (2008)", "Grand Canyon Reader Award for Tween Book (2008)", "Nene Award (2008)", "Massachusetts Children's Book Award (2008)", "Pennsylvania Young Readers' Choice Award for Grades 6-8 (2008)", "Sunshine State Young Readers Award for Grades 6-8 (2007)", "Pacific Northwest Library Association Young Reader's Choice Award for Intermediate (2008)", "Iowa Teen Award (2009)", "Lincoln Award Nominee (2009)", "Oklahoma Sequoyah Award for YA (2008)", "Rebecca Caudill Young Readers' Book Award (2009)"], "places": ["New York City, New York", "Montauk, New York", "New Jersey", "St. Louis, Missouri", "Las Vegas, Nevada", "Long Island, New York"], "character_names": ["Annabeth Chase", "Grover Underwood", "Luke Castellan", "Zeus (God)", "Dionysus (mythology)", "Ares (god)", "Hades", "Poseidon (God)", "Chiron", "Percy Jackson"], "language": "English", "publish_date": "2006-03-01 00:00:00", "ISBN": "0786838655"},
{"url": "https://www.goodreads.com/book/show/18240649-reclaiming-the-sand", "num_ratings": "5,499", "num_reviews": "810", "avg_ratings": 4.13, "genres": ["New Adult", "Romance", "Contemporary", "Sociology", "Abuse", "Romance", "Contemporary Romance"], "title": "Reclaiming the Sand", "description": ["Bully and victim. ", "Tormenter and tormented. ", "Villain and hero. ", "Ellie McCallum was a bully. No connection to anyone or anything. A sad and lonely existence for a young woman who had come to expect nothing more for herself. Her only happiness coming from making others miserable. ", "Particularly Freaky Flynn. ", "Flynn Hendrick lived a life completely disconnected even as he struggled", "Bully and victim. ", "Tormenter and tormented. ", "Villain and hero. ", "Ellie McCallum was a bully. No connection to anyone or anything. A sad and lonely existence for a young woman who had come to expect nothing more for herself. Her only happiness coming from making others miserable. ", "Particularly Freaky Flynn. ", "Flynn Hendrick lived a life completely disconnected even as he struggled to become something more than that boy with Asperger's. He was taunted and teased, bearing the brunt of systematic and calculated cruelty, ultimately culminating in a catastrophic turn of events that brought Ellie and Flynn’s worlds crashing down.", "But then Flynn and Ellie grew up. ", "And moved on.", "Until years later when their paths unexpectedly cross again and the bully and the freak are face to face once more.", "When labels come to define you, finding yourself feels impossible. Particularly for two people disconnected from the world who inexplicably find a connection in each other. ", "And out of the wreckage of their tragic beginnings, an unlikely love story unfolds.", "But a painful past doesn’t always want to let go. And old wounds are never truly healed…and sometimes the further you try to run from yourself the closer you come to who you really are."], "author": "A. Meredith Walters", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-17 00:00:00"}
]