[
{"url": "https://www.goodreads.com/book/show/37781.Things_Fall_Apart", "num_ratings": "236,327", "num_reviews": "11,136", "avg_ratings": 3.63, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Academic", "School", "Literature"], "title": "Things Fall Apart", "description": ["THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict betw", "THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict between the individual and society. ", "The second story, which is as modern as the first is ancient, and which elevates the book to a tragic plane, concerns the clash of cultures and the destruction of Okonkwo's world through the arrival of aggressive, proselytizing European missionaries. These twin dramas are perfectly harmonized, and they are modulated by an awareness capable of encompassing at once the life of nature, human history, and the mysterious compulsions of the soul. THINGS FALL APART is the most illuminating and permanent monument we have to the modern African experience as seen from within."], "author": "Chinua Achebe", "num_pages": "209", "awards": [], "places": ["Africa"], "character_names": ["Okonkwo"], "language": "English", "publish_date": "1994-09-01 00:00:00", "ISBN": "0385474547"},
{"url": "https://www.goodreads.com/book/show/8965997-lyrics-alley", "num_ratings": "1,071", "num_reviews": "188", "avg_ratings": 3.69, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Northern Africa", "Sudan", "Northern Africa", "Egypt", "Literature", "African Literature"], "title": "Lyrics Alley", "description": [" is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades. ", "Their fortune threatened by shifting powers in Sudan and their heir's debilitating accident, a powerful family under the leadership of Mahmoud Bey is torn between the traditional and mode", " is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades. ", "Their fortune threatened by shifting powers in Sudan and their heir's debilitating accident, a powerful family under the leadership of Mahmoud Bey is torn between the traditional and modern values of Mahmoud's two wives and his son's efforts to break with cultural limits."], "author": "Leila Aboulela", "num_pages": "310", "awards": ["Orange Prize Nominee for Fiction Longlist (2011)", "Scottish Trust Book Award for Fiction"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "0802119514"},
{"url": "https://www.goodreads.com/book/show/158674.Nervous_Conditions", "num_ratings": "9,179", "num_reviews": "651", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Eastern Africa", "Zimbabwe", "Feminism"], "title": "Nervous Conditions", "description": ["A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousn", "A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousness' of the 'postcolonial' conditions that bedevil us still. In Tambu and the women of her family, we African women see ourselves, whether at home or displaced, doing daily battle with our changing world with a mixture of tenacity, bewilderment and grace."], "author": "Tsitsi Dangarembga", "num_pages": "204", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1989)"], "places": ["Rhodesia", "Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2004-11-29 00:00:00", "ISBN": "1580051340"},
{"url": "https://www.goodreads.com/book/show/122.The_Power_of_One", "num_ratings": "67,235", "num_reviews": "4,818", "avg_ratings": 4.34, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Classics"], "title": "The Power of One", "description": ["Alternate cover for ISBN 034541005X, 9780345410054", "In 1939, as Hitler casts his enormous, cruel shadow across the world, the seeds of apartheid take root in South Africa. There, a boy called Peekay is born. His childhood is marked by humiliation and abandonment, yet he vows to survive and conceives heroic dreams, which are nothing compared to what life actually has in store", "Alternate cover for ISBN 034541005X, 9780345410054", "In 1939, as Hitler casts his enormous, cruel shadow across the world, the seeds of apartheid take root in South Africa. There, a boy called Peekay is born. His childhood is marked by humiliation and abandonment, yet he vows to survive and conceives heroic dreams, which are nothing compared to what life actually has in store for him. He embarks on an epic journey through a land of tribal superstition and modern prejudice where he will learn the power of words, the power to transform lives and the power of one."], "author": "Bryce Courtenay", "num_pages": "544", "awards": ["West Australian Young Readers' Book Award (WAYRBA) for Older Readers (1996)"], "places": ["South Africa"], "character_names": ["\"Doc\" Bradley Stanwick", "Peekay", "Geel Piet", "Morris Levy", "The Judge", "Mrs. Boxall", "Miss Bornstein"], "language": "English", "publish_date": "1996-09-29 00:00:00", "ISBN": "034541005X"},
{"url": "https://www.goodreads.com/book/show/505556.Death_and_the_King_s_Horseman", "num_ratings": "2,546", "num_reviews": "161", "avg_ratings": 3.75, "genres": ["Plays", "Drama", "Cultural", "Africa", "Fiction", "Literature", "African Literature", "Western Africa", "Nigeria", "Plays", "Theatre", "Classics", "Academic", "School", "Nobel Prize"], "title": "Death and the King's Horseman: A Play", "description": ["Based on events that took place in Oyo, an ancient Yoruba city of Nigeria, in 1946, Wole Soyinka's powerful play concerns the intertwined lives of Elesin Oba, the king's chief horseman; his son, Olunde, now studying medicine in England; and Simon Pilkings, the colonial district officer. The king has died and Elesin, his chief horseman, is expected by law and custom to comm", "Based on events that took place in Oyo, an ancient Yoruba city of Nigeria, in 1946, Wole Soyinka's powerful play concerns the intertwined lives of Elesin Oba, the king's chief horseman; his son, Olunde, now studying medicine in England; and Simon Pilkings, the colonial district officer. The king has died and Elesin, his chief horseman, is expected by law and custom to commit suicide and accompany his ruler to heaven. The stage is set for a dramatic climax when Pilkings learns of the ritual and decides to intervene and Elesin's son arrives home."], "author": "Wole Soyinka", "num_pages": "80", "awards": ["Premio letterario Giuseppe Acerbi (1993)"], "places": ["Oyo"], "character_names": [], "language": "English", "publish_date": "2002-04-17 00:00:00", "ISBN": "0393322998"},
{"url": "https://www.goodreads.com/book/show/80213.Anthills_of_the_Savannah", "num_ratings": "3,011", "num_reviews": "158", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Classics", "Novels"], "title": "Anthills of the Savannah", "description": ["Chris, Ikem and Beatrice are like-minded friends working under the military regime of His Excellency, the Sandhurst-educated President of Kangan. In the pressurized atmosphere of oppression and intimidation they are simply trying to live and love - and remain friends. But in a world where each day brings a new betrayal, hope is hard to cling on to. ", "Chris, Ikem and Beatrice are like-minded friends working under the military regime of His Excellency, the Sandhurst-educated President of Kangan. In the pressurized atmosphere of oppression and intimidation they are simply trying to live and love - and remain friends. But in a world where each day brings a new betrayal, hope is hard to cling on to. ", " (1987), Achebe's candid vision of contemporary African politics, is a powerful fusion of angry voices. It continues the journey that Achebe began with his earlier novels, tracing the history of modern Africa through colonialism and beyond, and is a work ultimately filled with hope."], "author": "Chinua Achebe", "num_pages": "240", "awards": ["Man Booker Prize Nominee (1987)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-29 00:00:00", "ISBN": "0141186909"},
{"url": "https://www.goodreads.com/book/show/16951.When_the_Lion_Feeds", "num_ratings": "10,897", "num_reviews": "370", "avg_ratings": 4.17, "genres": ["Historical", "Historical Fiction", "Fiction", "Adventure", "Cultural", "Africa", "Historical", "Thriller"], "title": "When the Lion Feeds", "description": ["Part of the 'Courtney' series", "'Something always dies when the lion feeds and yet there is meat for those that follow him.' The lion is Sean, hero of this tremendous drama of the men who took possession of South Africa in the last quarter of the nineteenth century.", "Sean and his twin-brother Garrick grew up on their father's farm in Natal. The first part of the book deals with", "Part of the 'Courtney' series", "'Something always dies when the lion feeds and yet there is meat for those that follow him.' The lion is Sean, hero of this tremendous drama of the men who took possession of South Africa in the last quarter of the nineteenth century.", "Sean and his twin-brother Garrick grew up on their father's farm in Natal. The first part of the book deals with his childhood and youth and his longing to become a successful farmer and hard-hitting fighter like his father.", "The tough life of cattle-farming is brusquely interrupted by the Zulu Wars, when Sean and his brother see fighting for the first time. Wilbur Smith vividly recreates the excitement of the war for the young men-their hope of winning their own cattle, the horror of the massacre at Isandhlwana, the heroism of the defence at Rorkes Drift.", "'Witwatersrand' is the name of the second part of this book and it tells the story of Sean's fabulous success in the gold rush and his rich life with Duff Charleywood and the beautiful Candy in the new town of Johannesburg, where huge fortunes were made and lost in a morning's dealing on the Exchange.", "The atmosphere of this feverish, violent time is brilliantly drawn: the heavy drinking, the elaborate houses, the ruthless abandonment of the failure. Sean and Duff are caught at last in a trap laid by their rival, the sinister and clever Hradsky, and leave Johannesburg for the wilderness to seek their fortunes once more.", "And now the book moves to its climax. At last it seems as though Sean will settle to a quiet married life – but fate has other plans for him. They return to Johannesburg and tragedy strikes quickly. Sean finds himself alone once more...", "Filled with action scenes in war and the early heady days of the gold rush, and adventure among the vast game herds of the African wilderness, this novel is dominated by the towering compelling personality of Sean, whose life story is continued in The Sound of Thunder and A Sparrow Falls.", "Reviews", " * 'Plenty of incident and colour' – The Observer, 1966", " * 'Pride of place goes to When the Lion Feeds because it is bigger, wider and more full of plot than all the others put together ...'", " – The Daily Telegraph, 1966.", " * 'Wilbur Smith has built up his wide-screen adventure story with energy and shrewdness.' – Sunday Times, 1966", " * 'Mr. Smith is a natural story-teller who moves confidently and often splendidly in his period and sustains a flow of convincing incident without repeating his excitement.' – The Scotsman. 1966", " * 'A very impressive book in its wide scope and its descriptive colour.' – Sphere"], "author": "Wilbur Smith", "num_pages": "544", "awards": [], "places": ["South Africa"], "character_names": ["Sean Courtney"], "language": "English", "publish_date": "2006-10-03 00:00:00", "ISBN": "0312940661"},
{"url": "https://www.goodreads.com/book/show/25792596-nobody-s-children", "num_ratings": "14", "num_reviews": "6", "avg_ratings": 4.0, "genres": ["Cultural", "Africa", "Nonfiction"], "title": "Nobody´s Children", "description": ["An exciting story from the popular author of novels set in an African environment.", "Five children, but only one destiny. They have nobody, and Kenyan street-life is hard. Danger. Darkness. Drugs. Hunger. But there is still hope.", "When David, John and Susanne are orphaned, they end up in the hands of their cruel uncle. The boys decide to run away, promising to return for their", "An exciting story from the popular author of novels set in an African environment.", "Five children, but only one destiny. They have nobody, and Kenyan street-life is hard. Danger. Darkness. Drugs. Hunger. But there is still hope.", "When David, John and Susanne are orphaned, they end up in the hands of their cruel uncle. The boys decide to run away, promising to return for their little sister. Unfortunately they have no idea what is about to happen to her. And their own wishes for a better life in Nairobi dissolve into thin air, as they find themselves pressured into becoming members of a gang of street children. But hope springs eternal...", "Hana Hindráková creates characters that are not only memorable, but unforgettable. This author’s ability to give birth in print to living, breathing souls is exceptional. Nobody´s Children is a real page-turner.", "The novel is based on the author’s thorough knowledge of various typical Kenyan environments. The reader gets to know, in a highly readable and exciting way, the reality of the various layers of current Kenyan society. It’s one of the few books that truly (albeit with authorial licence) explores the complexity of Kenyan society."], "author": "Hana Hindráková", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1262482.On_Trial_for_My_Country", "num_ratings": "22", "num_reviews": "8", "avg_ratings": 3.95, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe"], "title": "On Trial for My Country", "description": ["This historical novel looks at the clash between Cecil Rhodes and Lobengula, the Matebele King."], "author": "Stanlake Samkange", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1967-10-01 00:00:00", "ISBN": "0435900331"},
{"url": "https://www.goodreads.com/book/show/340514.What_Is_the_What", "num_ratings": "68,038", "num_reviews": "6,934", "avg_ratings": 4.16, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction"], "title": "What Is the What", "description": ["From the bestselling author of ", ", ", " is the epic novel based on the life of Valentino Achak Deng who, along with thousands of other children —the so-called Lost Boys—was forced to leave his village in Sudan at the age of seven and trek hundreds of miles by foot, pursued by militias, government bombers, and wild animals,", "From the bestselling author of ", ", ", " is the epic novel based on the life of Valentino Achak Deng who, along with thousands of other children —the so-called Lost Boys—was forced to leave his village in Sudan at the age of seven and trek hundreds of miles by foot, pursued by militias, government bombers, and wild animals, crossing the deserts of three countries to find freedom. When he finally is resettled in the United States, he finds a life full of promise, but also heartache and myriad new challenges. Moving, suspenseful, and unexpectedly funny, ", " is an astonishing novel that illuminates the lives of millions through one extraordinary man.", "-back cover"], "author": "Dave Eggers", "num_pages": "538", "awards": ["Independent Publisher Book Award (IPPY) for Literary Fiction (2007)", "Prix Médicis Etranger (2009)", "National Book Critics Circle Award Nominee for Fiction (2006)"], "places": ["Sudan", "Ethiopia", "Kakuma", "Marial Bai"], "character_names": [], "language": "English", "publish_date": "2007-10-16 00:00:00", "ISBN": "0307385906"},
{"url": "https://www.goodreads.com/book/show/26088499-the-hard-times", "num_ratings": "19", "num_reviews": "7", "avg_ratings": 4.32, "genres": ["Fiction", "Cultural", "Africa"], "title": "The Hard Times", "description": ["The Hard Times is, first and foremost, a novel about how men love. It focuses not on simple lust nor affection, but the complex web of expectations, loyalty, duty, and desire that define the society of men, how they love women, how they love their families, and how they bind themselves to one another in friendship and in war. ", "Taken from the news, declassified CIA documents", "The Hard Times is, first and foremost, a novel about how men love. It focuses not on simple lust nor affection, but the complex web of expectations, loyalty, duty, and desire that define the society of men, how they love women, how they love their families, and how they bind themselves to one another in friendship and in war. ", "Taken from the news, declassified CIA documents, and the author’s personal experiences in Africa and Namibia, it is a fictional story superimposed on what’s actually happening in the diamond trade, today, where international politics and industry, play a strange game of hide and seek with illegal stones.", "It begins in Mississippi. Ray Moffett is an ER doc, and Ray is facing an abyss. When his best friend and former boss comes into the ER dead, just six weeks after his retirement party, Ray finds himself searching for meaning in his own life. All Ray has left is his work. Work, punctuated only by the occasional round of golf. That’s all he can see stretching between him and his own trip to the grave if something doesn’t change.", "A chance meeting with an African hunting guide, Fritz Dietrich, shows Ray a second chance to live the adventures he’d dreamed of as a boy. Dreams that were fueled by books written by men like Hemmingway, Ruark, and Capstick. Unfortunately, Fritz isn’t exactly what he seems.", "Ray finds himself hunting desert oryx in the Namib with Fritz, both men trapped. Fritz must kill Ray and use his papers to smuggle illegal diamonds. For Ray to get home alive, he’s going to have to kill Fritz and then, somehow find his way out of the most hostile desert on the face of the earth."], "author": "Russell Scott", "num_pages": "238", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-01 00:00:00", "ISBN": "0985267135"},
{"url": "https://www.goodreads.com/book/show/130115.The_Grass_is_Singing", "num_ratings": "8,755", "num_reviews": "796", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Classics", "Historical", "Historical Fiction", "Southern Africa", "South Africa"], "title": "The Grass is Singing", "description": ["Set in South Africa under white rule, Doris Lessing's first novel is both a riveting chronicle of human disintegration and a beautifully understated social critique. ", "Mary Turner is a self-confident, independent young woman who becomes the depressed, frustrated wife of an ineffectual, unsuccessful farmer. Little by little the ennui of years on the farm work their slow poiso", "Set in South Africa under white rule, Doris Lessing's first novel is both a riveting chronicle of human disintegration and a beautifully understated social critique. ", "Mary Turner is a self-confident, independent young woman who becomes the depressed, frustrated wife of an ineffectual, unsuccessful farmer. Little by little the ennui of years on the farm work their slow poison, and Mary's despair progresses until the fateful arrival of an enigmatic and virile black servant, Moses. Locked in anguish, Mary and Moses -- master and slave -- are trapped in a web of mounting attraction and repulsion. Their psychic tension explodes in an electrifying scene that ends this disturbing tale of racial strife in colonial South Africa.", " blends Lessing's imaginative vision with her own vividly remembered early childhood to recreate the quiet horror of a woman's struggle against a ruthless fate."], "author": "Doris Lessing", "num_pages": "208", "awards": [], "places": [], "character_names": ["Mary Turner", "Dick Turner", "Moses"], "language": "English", "publish_date": "2000-03-06 00:00:00", "ISBN": "0002257556"},
{"url": "https://www.goodreads.com/book/show/264587.The_Beautyful_Ones_Are_Not_Yet_Born", "num_ratings": "2,122", "num_reviews": "150", "avg_ratings": 3.91, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Ghana", "Literature", "African Literature", "Historical", "Historical Fiction"], "title": "The Beautyful Ones Are Not Yet Born", "description": ["A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after i", "A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after independence in the 1960s. It is often claimed to rank with \"Things Fall Apart\" as one of the high points of post-colonial African Literature. ", "A quote from Chapter 6: ", "\"And where is my solid ground these days? Let us say just that the cycle from birth to decay has been short. Short, brief. But otherwise not at all unusual. And even in the decline into the end there are things that remind the longing mind of old beginnings and hold out the promise of new ones, things even like your despair itself. I have heard this pain before, only then it was multiplied many, many times, but that may only be because at that time I was not so alone, so far apart. Maybe there are other lonely voices despairing now. I will not be entranced by the voice, even if it should swell as it did in the days of hope. I will not be entranced, since I have seen the destruction of the promises it made. But I shall not resist it either. I will be like a cork. It is so surprising, is it not, how even the worst happenings of the past acquire a sweetness in the memory. Old harsh distresses are now merely pictures and tastes which hurt no more, like itching scars which can only give pleasure now. Strange, because when I can think soberly about it all, with out pushing any later joys into the deepr past, I can remember that things were terrible then. When the war was over the soldiers came back to homes broken in their absence and they themselves brought murder in their hearts and gave it to those nearest them. I saw it, not very clearly, because I had no way of understanding it, but it frightened me. We had gone on marches of victory and I do not think there was anyone mean enough in spirit to ask whether we knew what we were celebrating. Whose victory? Ours? It did not matter. We marched, and only a dishonest fool will look back on his boyhood and say he knew even then that there was no meaning in any of it. It is so funny now, to remember that we all thought we were welcoming victory. Or perhaps there is nothing funny here at all, and it is only that victory itself happens to be the identical twin of defeat. \""], "author": "Ayi Kwei Armah", "num_pages": "191", "awards": [], "places": ["Ghana"], "character_names": [], "language": "English", "publish_date": "1989-10-23 00:00:00", "ISBN": "0435905406"},
{"url": "https://www.goodreads.com/book/show/11092210-running-the-rift", "num_ratings": "6,084", "num_reviews": "926", "avg_ratings": 3.96, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Eastern Africa", "Rwanda"], "title": "Running the Rift", "description": [" follows Jean Patrick Nkuba, a gifted Rwandan boy, from the day he knows that running will be his life to the moment he must run to save his life, a ten-year span in which his country is undone by the Hutu-Tutsi tensions. Born a Tutsi, he is thrust into a world where itâ€™s impossible to stay apoliticalâ€”where the man who used to sell you gifts for your fa", " follows Jean Patrick Nkuba, a gifted Rwandan boy, from the day he knows that running will be his life to the moment he must run to save his life, a ten-year span in which his country is undone by the Hutu-Tutsi tensions. Born a Tutsi, he is thrust into a world where itâ€™s impossible to stay apoliticalâ€”where the man who used to sell you gifts for your family now spews hatred, where the girl who flirted with you in the lunchroom refuses to look at you, where your Hutu coach is secretly training the very soldiers who will hunt down your family. Yet in an environment increasingly restrictive for the Tutsi, he holds fast to his dream of becoming Rwandaâ€™s first Olympic medal contender in track, a feat he believes might deliver him and his people from this violence. When the killing begins, Jean Patrick is forced to flee, leaving behind the woman, the family, and the country he loves. Finding them again is the race of his life.", "This is the third Bellwether Prize winner published by Algonquin. The Bellwether Prize is awarded biennially by Barbara Kingsolver for an unpublished novel that addresses issues of social justice and was previously awarded to ", " and ", "."], "author": "Naomi Benaron", "num_pages": "365", "awards": ["PEN/Bellwether Prize for Socially Engaged Fiction (2010)"], "places": ["Rwanda"], "character_names": ["Jean Patrick Nkuba"], "language": "English", "publish_date": "2012-01-03 00:00:00", "ISBN": "1616200421"},
{"url": "https://www.goodreads.com/book/show/9414177-tiny-sunbirds-far-away", "num_ratings": "3,717", "num_reviews": "524", "avg_ratings": 4.07, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Contemporary"], "title": "Tiny Sunbirds, Far Away", "description": ["Set in the Niger Delta, Tiny Sunbirds, Far Away is the witty and beautifully written story of one family’s attempt to survive a new life they could never have imagined, struggling to find a deeper sense of identity along the way.", "When their mother catches their father with another woman, twelve year-old Blessing and her fourteen-year-old brother, Ezikiel, are forced to leav", "Set in the Niger Delta, Tiny Sunbirds, Far Away is the witty and beautifully written story of one family’s attempt to survive a new life they could never have imagined, struggling to find a deeper sense of identity along the way.", "When their mother catches their father with another woman, twelve year-old Blessing and her fourteen-year-old brother, Ezikiel, are forced to leave their comfortable home in Lagos for a village in the Niger Delta, to live with their mother's family. ", "Without running water or electricity, Warri is at first a nightmare for Blessing. Her mother is gone all day and works suspiciously late into the night to pay the children's school fees. Her brother, once a promising student, seems to be falling increasingly under the influence of the local group of violent teenage boys calling themselves Freedom Fighters. Her grandfather, a kind if misguided man, is trying on Islam as his new religion of choice, and is even considering the possibility of bringing in a second wife.", "But Blessing's grandmother, wise and practical, soon becomes a beloved mentor, teaching Blessing the ways of the midwife in rural Nigeria. Blessing is exposed to the horrors of genital mutilation and the devastation wrought on the environment by British and American oil companies. As Warri comes to feel like home, Blessing becomes increasingly aware of the threats to its safety, both from its unshakable but dangerous traditions and the relentless carelessness of the modern world. Tiny Sunbirds, Far Away is the witty and beautifully written story of one family's attempt to survive a new life they could never have imagined, struggling to find a deeper sense of identity along the way."], "author": "Christie Watson", "num_pages": "438", "awards": ["Costa Book Award for First Novel (2011)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2011-05-10 00:00:00", "ISBN": "1590514661"},
{"url": "https://www.goodreads.com/book/show/423125.The_African_Queen", "num_ratings": "6,756", "num_reviews": "348", "avg_ratings": 4.05, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Adventure", "Cultural", "Africa", "War", "Romance"], "title": "The African Queen", "description": [" - New York Times Book Review", "As World War I reaches the heart of the African jungle, Charlie Allnutt and Rose Sayer, a dishevelled trader", " - New York Times Book Review", "As World War I reaches the heart of the African jungle, Charlie Allnutt and Rose Sayer, a dishevelled trader and an English spinster missionary, find themselves thrown together by circumstance. Fighting time, heat, malaria, and bullets, they make their escape on the rickety steamboat ", "...and hatch their own outrageous military plan. Originally published in 1935, ", " is a tale replete with vintage Forester drama - unrelenting suspense, reckless heroism, impromptu military manoeuvres, near-death experiences - and a good old-fashioned love story to boot."], "author": "C.S. Forester", "num_pages": "256", "awards": [], "places": [], "character_names": ["Charlie Allnutt", "Rose Sayer"], "language": "English", "publish_date": "1984-06-30 00:00:00", "ISBN": "0316289108"},
{"url": "https://www.goodreads.com/book/show/2568.The_Interpreters", "num_ratings": "359", "num_reviews": "36", "avg_ratings": 3.56, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Nigeria", "Novels", "Literature", "African Literature", "Nobel Prize", "Literature"], "title": "The Interpreters", "description": ["The Nobel Laureate's first novel spotlights a small circle of young Nigerian intellectuals living in Lagos."], "author": "Wole Soyinka", "num_pages": "251", "awards": ["Jock Campbell-New Statesman Award (1968)"], "places": ["Lagos"], "character_names": [], "language": "English", "publish_date": "1996-08-16 00:00:00", "ISBN": "0233989781"},
{"url": "https://www.goodreads.com/book/show/218445.The_Slave_Girl", "num_ratings": "367", "num_reviews": "20", "avg_ratings": 3.74, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Literature"], "title": "The Slave Girl", "description": [" follows the fortunes of Ogbanje Ojebeta, a Nigerian woman who is sold into slavery in her own land after disease and tragedy leave her orphaned as a child. In her fellow slaves, she finds a surrogate family that clings together under the unbending will of their master. As Ogbanje Ojebeta becomes a woman and discovers her need for home and family, and for fre", " follows the fortunes of Ogbanje Ojebeta, a Nigerian woman who is sold into slavery in her own land after disease and tragedy leave her orphaned as a child. In her fellow slaves, she finds a surrogate family that clings together under the unbending will of their master. As Ogbanje Ojebeta becomes a woman and discovers her need for home and family, and for freedom and identity, she realizes that she must ultimately choose her own destiny."], "author": "Buchi Emecheta", "num_pages": "180", "awards": ["Jock Campbell-New Statesman Award (1978)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1980-05-17 00:00:00", "ISBN": "0807609528"},
{"url": "https://www.goodreads.com/book/show/28184.Blue_Shoes_and_Happiness", "num_ratings": "23,068", "num_reviews": "1,039", "avg_ratings": 4.06, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Southern Africa", "Botswana", "Mystery", "Detective"], "title": "Blue Shoes and Happiness", "description": ["There is considerable excitement at The No. 1 Ladies' Detective Agency. A cobra has been found in Precious Ramotswe's office. Then a nurse from a local medical clinic reveals that faulty blood–pressure readings are being recorded there. And Botswana has a new advice columnist, Aunty Emang, whose advice is rather curt for Mma Ramotswe’s taste.", "In this latest installment in t", "There is considerable excitement at The No. 1 Ladies' Detective Agency. A cobra has been found in Precious Ramotswe's office. Then a nurse from a local medical clinic reveals that faulty blood–pressure readings are being recorded there. And Botswana has a new advice columnist, Aunty Emang, whose advice is rather curt for Mma Ramotswe’s taste.", "In this latest installment in the internationally best-selling, universally beloved series, there is considerable excitement at The No. 1 Ladies’ Detective Agency. A cobra has been found in Precious Ramotswe’s office. Then a nurse from a local medical clinic reveals that faulty blood–pressure readings are being recorded there. And Botswana has a new advice columnist, Aunty Emang, whose advice is rather curt for Mma Ramotswe’s taste.", "All this means a lot of work for our heroine and her inestimable assistant, Grace Makutsi, and they are, of course, up to the challenge. But there’s trouble brewing in Mma Makutsi’s own life. When Phuti Radiphuti misses their customary dinner date, she begins to wonder if he is having second thoughts about their engagement. And while Mma Makutsi may be able to buy that fashionably narrow (and uncomfortable) pair of blue shoes, it may not buy her the happiness that Mma Ramotswe promises her she’ll find in the simpler things—in contentment with the world and enough tea to smooth over the occasional bumps in the road."], "author": "Alexander McCall Smith", "num_pages": "256", "awards": [], "places": ["Gaborone"], "character_names": ["Precious Ramotswe", "Puso", "Charlie the older apprentice", "Mr. Polopetsi", "Mr. J.L.B. Matekoni", "Motholeli", "Phuti Radiphuti", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe"], "language": "English", "publish_date": "2007-03-13 00:00:00", "ISBN": "1400075718"},
{"url": "https://www.goodreads.com/book/show/7053.In_the_Company_of_Cheerful_Ladies", "num_ratings": "23,591", "num_reviews": "1,065", "avg_ratings": 4.07, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Southern Africa", "Botswana"], "title": "In the Company of Cheerful Ladies", "description": ["Mma Ramotswe's normally unshakable composure is rattled when a visitor forces her to confront a secret from her past.", "In the newest addition to the universally beloved No. 1 Ladies’ Detective Agency series, the charming and ever-resourceful Precious Ramotswe finds herself overly beset by problems. She is already busier than usual at the detective agency when added to her co", "Mma Ramotswe's normally unshakable composure is rattled when a visitor forces her to confront a secret from her past.", "In the newest addition to the universally beloved No. 1 Ladies’ Detective Agency series, the charming and ever-resourceful Precious Ramotswe finds herself overly beset by problems. She is already busier than usual at the detective agency when added to her concerns are a strange intruder in her house on Zebra Drive and the baffling appearance of a pumpkin. And then there is Mma Makutsi, who decides to treat herself to dance lessons, only to be partnered with a man who seems to have two left feet. Nor are things running quite as smoothly as they usually do at Tlokweng Road Speedy Motors. Mma Ramotswe’s husband, the estimable Mr. J.L.B. Matekoni, is overburdened with work even before one of his apprentices runs off with a wealthy woman. But what finally rattles Mma Ramotswe’s normally unshakable composure is a visitor who forces her to confront a secret from her past. . . . ", "All this unfolds against the sunlit background of Mma Ramotswe’s beloved homeland, Botswana–a land of empty spaces, echoing skies, and an endless supply of soothing bush tea."], "author": "Alexander McCall Smith", "num_pages": "233", "awards": [], "places": ["Gaborone"], "character_names": ["Precious Ramotswe", "Puso", "Charlie the older apprentice", "Mr. Polopetsi", "Note Mokoti", "Mr. J.L.B. Matekoni", "Motholeli", "Phuti Radiphuti", "Violet Sepotho", "Grace Makutsi", "Fanwell the younger apprentice", "Mr. Radiphuti"], "language": "English", "publish_date": "2005-04-19 00:00:00", "ISBN": "0375422714"},
{"url": "https://www.goodreads.com/book/show/4529.Cause_Celeb", "num_ratings": "6,009", "num_reviews": "341", "avg_ratings": 3.0, "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Romance", "Cultural", "Africa", "Humor"], "title": "Cause Celeb", "description": ["Available for the first time in the United States, ", " is the hilarious debut novel by British literary sensation Helen Fielding. With the same wit and candor that shot ", " and ", " to the top of bestseller lists and forever altered the vocabulary of dating, Fielding executes a remarkable spoof on the altruistic en", "Available for the first time in the United States, ", " is the hilarious debut novel by British literary sensation Helen Fielding. With the same wit and candor that shot ", " and ", " to the top of bestseller lists and forever altered the vocabulary of dating, Fielding executes a remarkable spoof on the altruistic endeavors of commoners and celebrities alike as they unite to combat the horror of famine and neglect in Africa. Populated by larger-than-life characters from London's West End and the unsung heroes toiling anonymously on the Continent, ", " is a cunning and poignant tale that discloses the romantic underpinnings of life and love in the 21st century."], "author": "Helen Fielding", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-02-26 00:00:00", "ISBN": "0142000221"},
{"url": "https://www.goodreads.com/book/show/7058.The_Good_Husband_of_Zebra_Drive", "num_ratings": "21,414", "num_reviews": "1,123", "avg_ratings": 4.06, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Southern Africa", "Botswana"], "title": "The Good Husband of Zebra Drive", "description": ["Fans around the world adore the bestselling No. 1 Ladies’ Detective Agency series, the basis of the HBO TV show, and its proprietor Precious Ramotswe, Botswana’s premier lady detective.  In this charming series, Mma  Ramotswe navigates her cases and her personal life with wisdom, and good humor—not to mention help from her loyal a", "Fans around the world adore the bestselling No. 1 Ladies’ Detective Agency series, the basis of the HBO TV show, and its proprietor Precious Ramotswe, Botswana’s premier lady detective.  In this charming series, Mma  Ramotswe navigates her cases and her personal life with wisdom, and good humor—not to mention help from her loyal assistant, Grace Makutsi, and the occasional cup of tea.", "In the life of Precious Ramotswe–a woman duly proud of her fine traditional build– there is rarely a dull moment, and in the latest installment in the universally beloved No. 1 Ladies’ Detective Agency series there is much happening on Zebra Drive and Tlokweng Road. Mma Ramotswe is experiencing staffing difficulties. First Mr. J.L.B. Matekoni asks to be put in charge of a case involving an errant husband. But can a man investigate such matters as successfully as the number one lady detective can? Then she has a minor falling-out with her assistant, Mma Makutsi, who decides to leave the agency, taking the 97 percent she received on her typing final from the Botswana Secretarial College with her. ", "Along the way, Mma Ramotswe is asked to investigate a couple of tricky cases. Will she be able to explain an unexpected series of deaths at the hospital in Mochudi? And what about the missing office supplies at a local printing company? These are the types of questions that she is uniquely well suited to answer.", "In the end, whatever happens, Mma Ramotswe knows she can count on Mr. J.L.B. Matekoni, who stands for all that is solid and true in a shifting world. And there is always her love for Botswana, a country of which she is justifiably proud."], "author": "Alexander McCall Smith", "num_pages": "213", "awards": [], "places": ["Gaborone", "Mochudi"], "character_names": ["Precious Ramotswe", "Puso", "Mr. Polopetsi", "Mr. J.L.B. Matekoni", "Motholeli", "Phuti Radiphuti", "Violet Sepotho", "Grace Makutsi", "Fanwell the younger apprentice"], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0375422730"},
{"url": "https://www.goodreads.com/book/show/1482431.The_Key_to_Rebecca", "num_ratings": "22,584", "num_reviews": "791", "avg_ratings": 3.87, "genres": ["Fiction", "Historical", "Historical Fiction", "Thriller", "Mystery", "Spy Thriller", "Espionage", "Suspense", "War"], "title": "The Key to Rebecca", "author": "Ken Follett", "num_pages": "310", "awards": [], "places": ["Cairo"], "character_names": ["William Vandam", "Alexander Wolff", "Erwin Rommel", "Elene Fontana", "Joan Arbuthnot", "Anwar el-Sadat", "Colonel Reggie Bogge", "Sonja (The Key to Rebecca)", "Major Sandy Smith", "Kemel", "Billy Vandam"], "language": "English", "publish_date": "1985-05-01 00:00:00", "ISBN": "0688037348"},
{"url": "https://www.goodreads.com/book/show/209194.The_Man_in_the_Brown_Suit", "num_ratings": "66,456", "num_reviews": "1,281", "avg_ratings": 3.96, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Classics"], "title": "The Man in the Brown Suit", "description": ["alternate cover edition for 330102427", "The newly-orphaned Anne Beddingfield came to London expecting excitement. She didn't expect to find it on the platform of Hyde Park Corner tube station. When a fellow passenger pitches onto the rails and is electrocuted, the 'doctor' on the scene seems intent on searching the victim rather than examining him...", "Armed with a single clue,", "alternate cover edition for 330102427", "The newly-orphaned Anne Beddingfield came to London expecting excitement. She didn't expect to find it on the platform of Hyde Park Corner tube station. When a fellow passenger pitches onto the rails and is electrocuted, the 'doctor' on the scene seems intent on searching the victim rather than examining him...", "Armed with a single clue, Anne finds herself struggling to unmask a faceless killer known only as 'The Colonel' - while 'The Colonel' struggles to eliminate her..."], "author": "Agatha Christie", "num_pages": "381", "awards": [], "places": ["South Africa", "Bulawayo", "Johannesburg"], "character_names": ["Anne Beddingfeld", "Colonel Race", "John Eardsley", "The Honourable Mrs Suzanne Blair", "Sir Eustace Pedler, MP", "Guy Pagett", "Anita Grünberg", "Arthur Minks", "Harry Lucas", "Mr Flemming", "Mrs Flemming", "L B Carton", "Inspector Meadows", "Lord Nasby", "Mrs Caroline James", "The Colonel (The Man in the Brown Suit)", "Professor Beddingfeld", "Harry Rayburn", "Miss Pettigrew"], "language": "English", "publish_date": "2002-08-16 00:00:00", "ISBN": "0007151667"},
{"url": "https://www.goodreads.com/book/show/1605034.The_Miracle_at_Speedy_Motors", "num_ratings": "19,695", "num_reviews": "1,250", "avg_ratings": 4.09, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Southern Africa", "Botswana", "Mystery", "Crime"], "title": "The Miracle at Speedy Motors", "description": ["Under the endless skies of Botswana, there is always something Mma Ramotswe can do to help someone and here she finds herself assisting a woman looking for her family. The problem is the woman doesn't know her real name or whether any of her family members are still alive. Meanwhile, Mma Makutsi is the recipient of a beautiful new bed that causes more than a few sleepless", "Under the endless skies of Botswana, there is always something Mma Ramotswe can do to help someone and here she finds herself assisting a woman looking for her family. The problem is the woman doesn't know her real name or whether any of her family members are still alive. Meanwhile, Mma Makutsi is the recipient of a beautiful new bed that causes more than a few sleepless nights. And, at Tlokweng Road Speedy Motors, Mr. J.L.B. Matekoni has come under the influence of a doctor promising a miracle cure for his daughter's medical condition, which Mma Ramotswe finds hard to accept. Nonetheless, Precious Ramotswe handles these things in her usual compassionate and good-natured way, while always finding time for a cup of red bush tea."], "author": "Alexander McCall Smith", "num_pages": "214", "awards": [], "places": [], "character_names": ["Precious Ramotswe", "Puso", "Charlie the older apprentice", "Mr. J.L.B. Matekoni", "Motholeli", "Phuti Radiphuti", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe"], "language": "English", "publish_date": "2008-04-15 00:00:00", "ISBN": "0375424482"},
{"url": "https://www.goodreads.com/book/show/8582356-the-informationist", "num_ratings": "9,207", "num_reviews": "1,488", "avg_ratings": 3.77, "genres": ["Thriller", "Mystery", "Fiction", "Thriller", "Mystery Thriller", "Cultural", "Africa", "Suspense"], "title": "The Informationist", "description": ["\"Vanessa Michael Munroe deals in information--expensive information--working for corporations, heads of state, private clients, and anyone else who can pay for her unique brand of expertise. Born to missionary parents in lawless central Africa, Munroe took up with an infamous gunrunner and his mercenary crew when she was just fourteen. As his protégé, she earned the respec", "\"Vanessa Michael Munroe deals in information--expensive information--working for corporations, heads of state, private clients, and anyone else who can pay for her unique brand of expertise. Born to missionary parents in lawless central Africa, Munroe took up with an infamous gunrunner and his mercenary crew when she was just fourteen. As his protégé, she earned the respect of the jungle's most dangerous men, cultivating her own reputation for years until something sent her running. After almost a decade building a new life and lucrative career from her home base in Dallas, she's never looked back. Until now.\""], "author": "Taylor Stevens", "num_pages": "307", "awards": ["Barry Award for Best First Novel (2012)", "Macavity Award Nominee for Best First Mystery Novel (2012)", "Anthony Award Nominee for Best First Novel (2012)"], "places": ["Malabo", "Douala", "Yaoundé", "Mbini", "Bata, Cameroon", "Frankfurt"], "character_names": ["Logan", "Vanessa Michael Munroe", "Katherine ”Kate” Breeden", "Emily Burbank", "Elizabeth Burbank", "Miles Bradford", "Kristof Berger", "Mel Shore", "Boniface Akambe", "Nicolas", "Teodoro", "Don Felipe", "Silvestre Mba", "Salvatore", "Fransisco Beyard", "Pieter Willem", "George Wheal", "Timoteo Otoro Nchama", "Richard Burbank"], "language": "English", "publish_date": "2011-03-08 00:00:00", "ISBN": "0307717097"},
{"url": "https://www.goodreads.com/book/show/153719.Ladysmith", "num_ratings": "184", "num_reviews": "22", "avg_ratings": 3.36, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Cultural", "Africa", "War", "European Literature", "British Literature", "Southern Africa", "South Africa", "War", "Military Fiction", "Adventure", "Survival", "Literary Fiction"], "title": "Ladysmith", "description": ["The year is 1899, and Boer forces have surounded the small South African town of Ladysmith. As shells and shrapnel rain down, British soldiers and townsfolk dig themselves in, waiting for rescue. But General Buller's relief column can't break through."], "author": "Giles Foden", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-04 00:00:00", "ISBN": "0571203663"},
{"url": "https://www.goodreads.com/book/show/6544214-beneath-the-lion-s-gaze", "num_ratings": "1,897", "num_reviews": "310", "avg_ratings": 3.87, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Ethiopia", "Historical", "Historical Fiction", "War", "Literature", "African Literature", "Novels"], "title": "Beneath the Lion's Gaze", "description": [" ", "This memorable, heartbreaking story opens in Addis Ababa, Ethiopia, 1974, on the eve of a revolution. Yonas kneels in his mother’s prayer room, pleading to his god for an end to the violence that has wracked his family and country. His father, Hai", " ", "This memorable, heartbreaking story opens in Addis Ababa, Ethiopia, 1974, on the eve of a revolution. Yonas kneels in his mother’s prayer room, pleading to his god for an end to the violence that has wracked his family and country. His father, Hailu, a prominent doctor, has been ordered to report to jail after helping a victim of state-sanctioned torture to die. And Dawit, Hailu’s youngest son, has joined an underground resistance movement—a choice that will lead to more upheaval and bloodshed across a ravaged Ethiopia. ", " tells a gripping story of family, of the bonds of love and friendship set in a time and place that has rarely been explored in fiction. It is a story about the lengths human beings will go in pursuit of freedom and the human price of a national revolution. Emotionally gripping, poetic, and indelibly tragic, ", " is a transcendent and powerful debut. ."], "author": "Maaza Mengiste", "num_pages": "308", "awards": ["Dayton Literary Peace Prize for Fiction (Runner-up) (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-11 00:00:00", "ISBN": "0393071766"},
{"url": "https://www.goodreads.com/book/show/16200165-a-girl-called-problem", "num_ratings": "277", "num_reviews": "77", "avg_ratings": 3.95, "genres": ["Cultural", "Africa", "Mystery", "Historical", "Historical Fiction", "Childrens", "Middle Grade", "Historical", "Fiction", "Young Adult"], "title": "A Girl Called Problem", "description": ["Thirteen-year-old Shida, whose name means “problem” in Swahili, certainly has a lot of problems in her life — her father is dead, her depressed mother is rumored to be a witch, and everyone in her rural Tanzanian village expects her to marry rather than pursue her dream of becoming a healer. So when the village’s elders make a controversial decision to move their people to", "Thirteen-year-old Shida, whose name means “problem” in Swahili, certainly has a lot of problems in her life — her father is dead, her depressed mother is rumored to be a witch, and everyone in her rural Tanzanian village expects her to marry rather than pursue her dream of becoming a healer. So when the village’s elders make a controversial decision to move their people to a nearby village, Shida welcomes the change. Surely the opportunity to go to school and learn from a nurse can only mean good things.", "However, after a series of puzzling misfortunes plague the new village, Shida must prove to her people that moving was the right decision, and that they can have a better life in their new home."], "author": "Katie Quirk", "num_pages": "256", "awards": ["Maine Literary Award Nominee for Young Adults (Finalist) (2014)"], "places": ["Litongo"], "character_names": [], "language": "English", "publish_date": "2013-04-18 00:00:00", "ISBN": "0802854044"},
{"url": "https://www.goodreads.com/book/show/75050.Uhuru", "num_ratings": "377", "num_reviews": "22", "avg_ratings": 4.06, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Historical", "Eastern Africa", "Kenya", "Literature"], "title": "Uhuru", "description": ["A vivid and exciting fictional story of the Mau Mau era in Kenya."], "author": "Robert Ruark", "num_pages": "445", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-02-01 00:00:00", "ISBN": "1568490259"},
{"url": "https://www.goodreads.com/book/show/161002.Prester_John", "num_ratings": "749", "num_reviews": "82", "avg_ratings": 3.6, "genres": ["Fiction", "Classics", "Adventure", "Cultural", "Africa", "Historical", "Historical Fiction", "Literature"], "title": "Prester John", "description": ["Nineteen-year-old David Crawfurd travels from Scotland to South Africa to work as a storekeeper. On the voyage he encounters again John Laputa, the celebrated Zulu minister, of whom he has strange memories.", "In his remote store David finds himself with the key to a massive uprising led by the minister, who has taken the title of the mythical priest-king, Prester John.", "David's", "Nineteen-year-old David Crawfurd travels from Scotland to South Africa to work as a storekeeper. On the voyage he encounters again John Laputa, the celebrated Zulu minister, of whom he has strange memories.", "In his remote store David finds himself with the key to a massive uprising led by the minister, who has taken the title of the mythical priest-king, Prester John.", "David's courage and his understanding of this man take him to the heart of the uprising, a secret cave in the Rooirand."], "author": "John Buchan", "num_pages": "272", "awards": [], "places": ["Zululand"], "character_names": ["David Crawfurd", "John Laputa"], "language": "English", "publish_date": "1910-08-16 00:00:00", "ISBN": "1406943223"},
{"url": "https://www.goodreads.com/book/show/34533496-smrt-c-byznys", "num_ratings": "9", "num_reviews": "5", "avg_ratings": 3.89, "genres": [], "title": "Smrtící byznys", "description": ["Ellen dorazí do Ugandy, země plné bídy, aby na zdejší klinice pomáhala trpícím dětem. Iluze o léčbě ji brzy přejdou. Děti, které dostaly falešné léky na malárii, totiž umírají. Když se Ellen obrátí na tamní Organizaci pro boj s falešnými léky, udělá osudovou chybu. Nemohla tušit, že za výnosným kšeftem stojí někdo s hodně dlouhými prsty… Ona teď musí zachránit jak děti, ta", "Ellen dorazí do Ugandy, země plné bídy, aby na zdejší klinice pomáhala trpícím dětem. Iluze o léčbě ji brzy přejdou. Děti, které dostaly falešné léky na malárii, totiž umírají. Když se Ellen obrátí na tamní Organizaci pro boj s falešnými léky, udělá osudovou chybu. Nemohla tušit, že za výnosným kšeftem stojí někdo s hodně dlouhými prsty… Ona teď musí zachránit jak děti, tak sebe."], "author": "Hana Hindráková", "awards": [], "places": [], "character_names": [], "language": "Czech", "publish_date": "2017-09-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/37774.Arrow_of_God", "num_ratings": "3,965", "num_reviews": "302", "avg_ratings": 3.81, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Classics", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Literature", "Novels", "Literature", "20th Century", "Literary Fiction"], "title": "Arrow of God", "description": ["Set in the Igbo heartland of eastern Nigeria, one of Africa's best-known writers describes the conflict between old and new in its most poignant aspect: the personal struggle between father and son.", "Ezeulu, the headstrong chief priest of the god Ulu, is worshipped by the six villages of Umuaro. But his authority is increasingly under threat—from rivals within his tribe, fro", "Set in the Igbo heartland of eastern Nigeria, one of Africa's best-known writers describes the conflict between old and new in its most poignant aspect: the personal struggle between father and son.", "Ezeulu, the headstrong chief priest of the god Ulu, is worshipped by the six villages of Umuaro. But his authority is increasingly under threat—from rivals within his tribe, from functionaries of the colonial government, and even from his own family members. Yet he believes himself to be untouchable: surely he is an arrow in the bow of his God? Armed with this belief, he is prepared to lead his people, even if it is towards their own destruction. But his people will not be dominated so easily.", "Spare and powerful, Arrow of God is an unforgettable portrayal of the loss of faith, and the downfall of a man in a society forever altered by colonialism."], "author": "Chinua Achebe", "num_pages": "230", "awards": ["Jock Campbell-New Statesman Award (1965)"], "places": ["Nigeria"], "character_names": ["Ezeulu", "Obika", "Oduche"], "language": "English", "publish_date": "1989-01-01 00:00:00", "ISBN": "0385014805"},
{"url": "https://www.goodreads.com/book/show/1174043.Kringe_in_n_Bos", "num_ratings": "1,803", "num_reviews": "64", "avg_ratings": 4.23, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Historical", "Historical Fiction", "Drama", "Classics", "Literature", "African Literature", "Historical", "Adventure", "Academic", "School"], "title": "Kringe in 'n Bos", "description": ["Saul Barnard is 'n houtkapper met 'n rustelose siel - hy wil vreemdes uit die Bos hou en die vernietiging van die Bos probeer keer. Dan is daar 'n legendariese olifantbul - Oupoot - wat losbreek van sy trop ... Oupoot en Saul het 'n vreemde band tussen hulle . In die groen skemerwêreld van die Outeniekwa loop hulle kringpaaie. Saul Barnard, deur sy mense verwerp en deur ge", "Saul Barnard is 'n houtkapper met 'n rustelose siel - hy wil vreemdes uit die Bos hou en die vernietiging van die Bos probeer keer. Dan is daar 'n legendariese olifantbul - Oupoot - wat losbreek van sy trop ... Oupoot en Saul het 'n vreemde band tussen hulle . In die groen skemerwêreld van die Outeniekwa loop hulle kringpaaie. Saul Barnard, deur sy mense verwerp en deur gewetenlose houtkopers tot kneg verneder; Oupoot, eindeloos agtervolg deur jagters. 'n Man en sy dier-broer - saamgegooi in 'n ongerepte oerbos, wat stuk vir stuk deur gouddelwers, boskappers en ander uitroeiers vernietig word. Saul volg Oupoot se spoor, al nader aan die waarheid wat sy lewe vir altyd sal verander."], "author": "Dalene Matthee", "num_pages": "310", "awards": ["ATKV Award for Prose (1984)"], "places": ["South Africa"], "character_names": [], "language": "Afrikaans", "publish_date": "1989-08-16 00:00:00", "ISBN": "0624028178"},
{"url": "https://www.goodreads.com/book/show/7636414-een-zondag-aan-het-zwembad-in-kigali", "num_ratings": "2,592", "num_reviews": "320", "avg_ratings": 3.93, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Eastern Africa", "Rwanda", "Cultural", "Canada", "War"], "title": "Een zondag aan het zwembad in Kigali", "description": ["De door het leven teleurgestelde Canadese journalist Bernard Valcourt komt naar Rwanda voor de oprichting van een lokale televisiezender. Als dat plan vastloopt, besluit hij om een film te gaan maken over aids. Daarnaast schrijft hij een boek, aan het zwembad van zijn hotel in Kigali, waar de blanke en zwarte elite onder het genot van Franse kaas de politieke situatie door", "De door het leven teleurgestelde Canadese journalist Bernard Valcourt komt naar Rwanda voor de oprichting van een lokale televisiezender. Als dat plan vastloopt, besluit hij om een film te gaan maken over aids. Daarnaast schrijft hij een boek, aan het zwembad van zijn hotel in Kigali, waar de blanke en zwarte elite onder het genot van Franse kaas de politieke situatie doornemen. Valcourt, die de liefde heeft afgezworen na pijnlijke ervaringen met de drie vrouwen van zijn leven, wordt toch opnieuw verliefd. Gentille, de serveerster van het hotel, is een prachtige vrouw met een gemengde Hutu-Tutsi achtergrond. Als het geweld losbarst en de door de Hutu-regering aangewakkerde moordpartijen op Tutsi's een aanvang nemen, loopt zij groot gevaar. Valcourt raakt veel dieper betrokken bij de onthutsende gebeurtenissen dan hij ooit had kunnen vermoeden. Hij stuit op het opportunisme en de onverschilligheid van ontwikkelingswerkers, diplomaten en nonnen. Tegelijkertijd leert hij in deze onmenselijke omstandigheden, waar de dood een dagelijkse verschijning is, wat liefde en leven is.", "Gil Courtemanche doet in ", " het onmogelijke: een prachtig boek schrijven over liefde en menselijkheid in tijden van de Rwandese genocide."], "author": "Gil Courtemanche", "num_pages": "288", "awards": ["Prix des libraires du Québec for Lauréats québécois (2001)", "Rogers Writers' Trust Fiction Prize Nominee (2003)"], "places": [], "character_names": [], "language": "Dutch", "publish_date": "2003-01-01 00:00:00", "ISBN": "9023411927"},
{"url": "https://www.goodreads.com/book/show/10374279-the-hairdresser-of-harare", "num_ratings": "1,318", "num_reviews": "227", "avg_ratings": 3.59, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "The Hairdresser of Harare", "description": ["Like very good dark chocolate this is a delicious novel, with a bitter-sweet flavour. Vimbai is a hairdresser, the best in Mrs Khumalo's salon, and she knows she is the queen on whom they all depend. Her situation is reversed when the good-looking, smooth-talking Dumisani joins them. However, his charm and desire to please slowly erode Vimbai's rancour and when he needs so", "Like very good dark chocolate this is a delicious novel, with a bitter-sweet flavour. Vimbai is a hairdresser, the best in Mrs Khumalo's salon, and she knows she is the queen on whom they all depend. Her situation is reversed when the good-looking, smooth-talking Dumisani joins them. However, his charm and desire to please slowly erode Vimbai's rancour and when he needs somewhere to live, Vimbai becomes his landlady. So, when Dumisani needs someone to accompany him to his brother's wedding to help smooth over a family upset, Vimbai obliges. Startled to find that this smart hairdresser is the scion of one of the wealthiest families in Harare, she is equally surprised by the warmth of their welcome; and it is their subsequent generosity which appears to foster the relationship between the two young people. The ambiguity of this deepening friendship - used or embraced by Dumisani and Vimbai with different futures in mind - collapses in unexpected brutality when secrets and jealousies are exposed. Written with delightful humour and a penetrating eye, The Hairdresser of Harare is a novel that you will find hard to put down."], "author": "Tendai Huchu", "num_pages": "190", "awards": [], "places": ["Harare"], "character_names": [], "language": "English", "publish_date": "2010-10-01 00:00:00", "ISBN": "1779221096"},
{"url": "https://www.goodreads.com/book/show/65278.Rules_of_the_Wild", "num_ratings": "981", "num_reviews": "124", "avg_ratings": 3.82, "genres": ["Cultural", "Africa", "Fiction", "Travel", "Romance", "Contemporary"], "title": "Rules of the Wild: A Novel of Africa", "description": ["A mesmerizing novel of love and nostalgia set in the vast spaces of contemporary East Africa.", "Romantic, often resonantly ironic, moving and wise, ", " transports us to a landscape of unsurpassed beauty even as it gives us a sharp-eyed portrait of a closely knit tribe of cultural outsiders: the expatriates living in Kenya today. Challenged by race, by class, and", "A mesmerizing novel of love and nostalgia set in the vast spaces of contemporary East Africa.", "Romantic, often resonantly ironic, moving and wise, ", " transports us to a landscape of unsurpassed beauty even as it gives us a sharp-eyed portrait of a closely knit tribe of cultural outsiders: the expatriates living in Kenya today. Challenged by race, by class, and by a longing for home, here are \"safari boys\" and samaritans, reporters bent on their own fame, travelers who care deeply about elephants but not at all about the people of Africa. They all know each other. They meet at dinner parties, they sleep with each other, they argue about politics and the best way to negotiate their existence in a place where they don't really belong. ", "At the center is Esmé, a beautiful young woman of dazzling ironies and introspections, who tells us her story in a voice both passionate and self-deprecating. Against a paradoxical backdrop of limitless physical freedom and escalating civil unrest, Esmé struggles to make sense of her own place in Africa and of her feelings for the two men there whom she loves--Adam, a second-generation Kenyan who is the first to show her the wonders of her adopted land, and Hunter, a British journalist sickened by its horrors.        ", " evokes the worlds of Isak Dinesen, Beryl Markham, and Ernest Hemingway. It explores unforgettably our infinite desire for a perfect elsewhere, for love and a place to call home. It is an astonishing literary debut."], "author": "Francesca Marciano", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-09-07 00:00:00", "ISBN": "0375703438"},
{"url": "https://www.goodreads.com/book/show/21948349-yohannes-ishi", "num_ratings": "28", "num_reviews": "10", "avg_ratings": 3.79, "genres": ["Eastern Africa", "Ethiopia", "Cultural", "Africa", "Fiction"], "title": "Yohannes Ishi", "description": ["Born in Ethiopia, but adopted by a British couple, Yohannes grows up far from his cultural roots. Following the death of his adoptive mother, he is persuaded to return to the beautiful, yet seemingly impossible nation, to take on a teaching job.", "With no memories of the land of his birth and no knowledge of the language or culture, Yohannes finds himself a virtual stranger.", "Born in Ethiopia, but adopted by a British couple, Yohannes grows up far from his cultural roots. Following the death of his adoptive mother, he is persuaded to return to the beautiful, yet seemingly impossible nation, to take on a teaching job.", "With no memories of the land of his birth and no knowledge of the language or culture, Yohannes finds himself a virtual stranger. He meets a whole raft of interesting characters, each with their own story to tell including Abeba, who helps him not only to learn about his country, but also to make discoveries about himself.", "Yohannes Ishi is a light read, but, at the same time, it paints vivid pictures of contemporary Ethiopia and successfully explores issues of identity and belonging. It is full of memorable characters and evocative locations. While introducing you to, or reminding you of, Addis Ababa it will certainly raise a smile or two along the way."], "author": "Nabse Bamato", "num_pages": "138", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-15 00:00:00", "ISBN": "1495471772"},
{"url": "https://www.goodreads.com/book/show/25980869-three-great-lies", "num_ratings": "27", "num_reviews": "13", "avg_ratings": 4.15, "genres": ["Fantasy", "Northern Africa", "Egypt", "Historical", "Historical Fiction"], "title": "Three Great Lies", "description": ["PUBLISHERS WEEKLY: \"A strong conclusion sets this light fantasy a notch above its peers.\"", "ABYSS & APEX: \"It felt like a visit to a real place–a real, vibrant culture–with real people that I won’t soon forget and will want to revisit again and again. Go, buy this book now. You’ll thank me. RECOMMENDED.\"", "While vacationing in Egypt. . . ", "Jeannette Walker, a cynical scientist", "PUBLISHERS WEEKLY: \"A strong conclusion sets this light fantasy a notch above its peers.\"", "ABYSS & APEX: \"It felt like a visit to a real place–a real, vibrant culture–with real people that I won’t soon forget and will want to revisit again and again. Go, buy this book now. You’ll thank me. RECOMMENDED.\"", "While vacationing in Egypt. . . ", "Jeannette Walker, a cynical scientist jaded by swarms of tour groups and knick-knack shacks, is lured by a teenage tour guide to visit a newly discovered tomb. No other tourists there! Inside the chamber, she tumbles down a shaft and 3000 years back in time. ", "Now, in a world where deities walk the streets and prophecy heats up the air, Jeannette is desperate for normal and the simple pleasures of sanitation and refrigeration. However, a slave master hawking a cat-headed girl derails her homebound mission, and Jeannette—penniless in this ancient world—steals the girl, bringing down the tireless fury of the slaver. ", "Saddled with a newly awakened mummy and the cat-headed girl, Jeannette contrives a plan to free them from the slaver's ire, but will she have to dive into the belly of the beast to succeed?"], "author": "Vanessa MacLellan", "num_pages": "352", "awards": [], "places": ["Egypt"], "character_names": [], "language": "English", "publish_date": "2015-08-07 00:00:00", "ISBN": "0989263142"},
{"url": "https://www.goodreads.com/book/show/17253767-bound-to-passion", "num_ratings": "21", "num_reviews": "6", "avg_ratings": 4.24, "genres": ["Romance", "Contemporary"], "title": "Bound to Passion", "description": ["When Christy Inemi-Spiff discovers that the man she vowed to love and honor has no such feelings for her, she is determined to cut her losses and move on with her life. A quick, quiet divorce is all she wishes….", "However, Joshua has other ideas. He’s not ready to walk away yet, especially when he doesn’t understand why Christy wants out of their marriage. So he demands she a", "When Christy Inemi-Spiff discovers that the man she vowed to love and honor has no such feelings for her, she is determined to cut her losses and move on with her life. A quick, quiet divorce is all she wishes….", "However, Joshua has other ideas. He’s not ready to walk away yet, especially when he doesn’t understand why Christy wants out of their marriage. So he demands she agree to spend a quiet Christmas on a remote African Island with him, hoping they can salvage their relationship. If she still wants a divorce after these two weeks, he will let her go. But not before he’s had his fill of her.", " But with the sparking tension between them, and the secrets behind the disintegration of their marriage threatening to explode, will either of them get their wish? Or will this season of good will show them what really lies at the bottom of their hearts?"], "author": "Kiru Taye", "num_pages": "67", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2013-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/77833.An_Ice_Cream_War", "num_ratings": "2,716", "num_reviews": "142", "avg_ratings": 3.86, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "War", "War", "World War I"], "title": "An Ice-Cream War", "description": ["An Ice-Cream War was the debut novel of William Boyd who would go on to be recognized as 'the finest storyteller of his generation' (Sebastian Faulks). It follows the fortunes of several wildly different characters - including an expat farmer and a young English aristocrat - as they are swept up in the fighting in German East Africa during the First World War, their lives", "An Ice-Cream War was the debut novel of William Boyd who would go on to be recognized as 'the finest storyteller of his generation' (Sebastian Faulks). It follows the fortunes of several wildly different characters - including an expat farmer and a young English aristocrat - as they are swept up in the fighting in German East Africa during the First World War, their lives converging amid battle, betrayal, love, comedy and tragedy."], "author": "William  Boyd", "num_pages": "416", "awards": ["Man Booker Prize Nominee (1982)", "John Llewellyn Rhys Prize (1982)"], "places": ["German East Africa", "England", "East Africa", "Africa", "British Empire"], "character_names": ["Walter Smith", "Erich von Bishop", "Liesl von Bishop", "Felix Cobb", "Gabriel Cobb", "Charis Cobb", "Wheech-Browning", "Major Bilderbeck", "Gilzean", "Philip Holland", "Amory Holland"], "language": "English", "publish_date": "1999-10-05 00:00:00", "ISBN": "0375705023"},
{"url": "https://www.goodreads.com/book/show/36495279-nairobi-days", "num_ratings": "8", "num_reviews": "4", "avg_ratings": 4.63, "genres": [], "title": "Nairobi Days", "description": ["This diaspora novel is a celebration of Indian and African culture seen through the eyes of a young woman. As a member of an Indian minority in a small African country, Shaza’s life is complicated. She lives in a lively house full of relatives. Later, she meets Idi Amin, the bloodthirsty Ugandan dictator and has a narrow escape… ", "Shaza goes to a convent school. Despite the", "This diaspora novel is a celebration of Indian and African culture seen through the eyes of a young woman. As a member of an Indian minority in a small African country, Shaza’s life is complicated. She lives in a lively house full of relatives. Later, she meets Idi Amin, the bloodthirsty Ugandan dictator and has a narrow escape… ", "Shaza goes to a convent school. Despite the strict rules, the girls are beginning to discover the opposite sex. Shaza is part of a Muslim family that emigrated from India, the old ways still rule. No one in Kenya dates, they just sneak around. Shaza falls for a Hindu boy, Sameer is smitten but they come from two different religions. Shaza is torn between her sense of duty and longing for Sameer. Will the relationship survive her family’s disapproval and a long separation? They live in difficult times in a turbulent African country; Shaza’s cousin is almost killed by thugs and Kenya has a coup d’état where the Indian minority is targeted. The saga follows Shaza’s life from the 1960’s to the 1980’s showing the political upheavals in Kenya and her move to the United States. Nairobi Days is a coming of age story, a love story, a political novel and above all a celebration of life. ", "Shelina Shariff-Zia grew up in Nairobi, a tomboy who was always getting into trouble. She is the fifth generation of an Indian family who migrated to Kenya from Gujarat. She moved to Texas to study literature at Rice University. After earning an M.A. at Columbia, she became a journalist. She now teaches college students at CUNY in the Bronx."], "author": "Shelina Shariff-Zia", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25509625-ndura", "num_ratings": "58", "num_reviews": "23", "avg_ratings": 4.29, "genres": ["Fiction", "European Literature", "Spanish Literature", "Cultural", "Africa", "Young Adult"], "title": "Ndura: Son of the forest", "description": ["Chosen as best young adult fiction novel for 2014 in Spain!", "When a common normal person, anyone of us, suddenly finds himself or herself in a life-and-death situation in the middle of the forest, would he or she know how to survive?", "This is the simple dilemma that is offered to the protagonist of our story, who, returning from a relaxing holiday in Namibia on a typical photo", "Chosen as best young adult fiction novel for 2014 in Spain!", "When a common normal person, anyone of us, suddenly finds himself or herself in a life-and-death situation in the middle of the forest, would he or she know how to survive?", "This is the simple dilemma that is offered to the protagonist of our story, who, returning from a relaxing holiday in Namibia on a typical photographic safari, is involved in an unexpected extreme survival situation in the Ituri forest, in the Republic of Congo in Africa when the plane he was in gets shot down by rebels. A place where Nature is not the only enemy and where survival is not the only problem.", "A classic scented adventure which makes this book the perfect place to escape reality and feel within you, the anguish and despair of the hero while facing the challenges he is presented with. This book smoothly blends emotion and tension when faced with the challenge to survive, but also the psychological degradation of the protagonist throughout the story and an in-depth study on the environment, the animals, the plants as well as the people, that the author carried out. It also teaches us that our perception of where our limits lie are usually wrong, sometimes for better and sometimes for worse.", "This novel comes highly recommended."], "author": "Javier Salazar Calle", "num_pages": "220", "awards": [], "places": ["Congo, Democratic Republic of the "], "character_names": [], "language": "English", "publish_date": "2015-04-21 00:00:00", "ISBN": "150710829X"},
{"url": "https://www.goodreads.com/book/show/29006270-the-witch-s-list", "num_ratings": "61", "num_reviews": "55", "avg_ratings": 3.75, "genres": ["Fiction", "Mystery", "Fantasy", "Supernatural", "Thriller", "Fantasy", "Paranormal"], "title": "The Witch's List", "description": ["Sandy Beech doesn't believe in witches and the supernatural. However, certain strange events occur which put his scepticism to the test: a burning book, a falling crucifix, a mysterious illness, and a fire in a convent which kills all twelve nuns. On her deathbed, Bernadette, the last surviving nun, warns him to control his lusts and avoid African women. Sandy finds this d", "Sandy Beech doesn't believe in witches and the supernatural. However, certain strange events occur which put his scepticism to the test: a burning book, a falling crucifix, a mysterious illness, and a fire in a convent which kills all twelve nuns. On her deathbed, Bernadette, the last surviving nun, warns him to control his lusts and avoid African women. Sandy finds this difficult, since he is attracted to exotic, dark-skinned women and after his hedonistic university exchange year in Paris, marries Rocky from the Ivory Coast. Five years later, childless and with the marriage souring, they decide to visit Rocky's home country. Sandy is drawn into a world of strange beliefs and practices: he finds out about the Witch's List - a list of people destined to die, and is attacked by various animals starting with a ferocious dog in Abidjan. He delves further and further into the realm of African witchcraft, but the horrific truth remains obscure... The Witch's List is the first of a trilogy."], "author": "Andrew Cairns", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-06-24 00:00:00", "ISBN": "1785353489"},
{"url": "https://www.goodreads.com/book/show/944103.The_Palm_Wine_Drinkard", "num_ratings": "1,586", "num_reviews": "159", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "Africa", "Fantasy", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "The Palm-Wine Drinkard", "description": ["When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African (Nigeria) Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages", "When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African (Nigeria) Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages and has come to be regarded as a masterwork of one of Africa's most influential writers."], "author": "Amos Tutuola", "num_pages": "125", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1977-08-16 00:00:00", "ISBN": "0571049966"},
{"url": "https://www.goodreads.com/book/show/18003524-eyelids-of-the-morning", "num_ratings": "13", "num_reviews": "10", "avg_ratings": 3.85, "genres": ["Adventure", "Science Fiction", "Animals", "Dinosaurs", "Religion"], "title": "Eyelids of the Morning", "description": ["Ethan is a sixteen-year-old boy who, with his twelve-year-old brother Rory, reluctantly leaves his boarding school for the summer to be dragged to the other side of the world by their reclusive and eccentric uncle. When their uncle finally explains that he is hunting for a true, living dinosaur in the heart of the Congo River basin, Ethan immediately pegs him for a lunatic", "Ethan is a sixteen-year-old boy who, with his twelve-year-old brother Rory, reluctantly leaves his boarding school for the summer to be dragged to the other side of the world by their reclusive and eccentric uncle. When their uncle finally explains that he is hunting for a true, living dinosaur in the heart of the Congo River basin, Ethan immediately pegs him for a lunatic. However, using documented eyewitness accounts, a vivid description of dinosaurs from the Bible, and, his most powerful weapon, news that Ethan and Rory’s late mother believed that dinosaurs exist too, their uncle has them convinced. They journey to the Congo and meet Shari, a missionary nurse, and her adopted daughter Maggie whose passion for the plight of the Congolese people leaves Ethan instantly smitten. Their dinosaur hunt leaves Ethan, Maggie and Rory separated from their group, facing danger at every turn, and racing against the clock to get medical help for a serious injury. In the end, they make the discovery and sacrifice of a life time, the emotional gap between the boys and their uncle is finally bridged, and Ethan learns that home truly is where the heart is."], "author": "Heidi Peltier", "num_pages": "214", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/73973.Changes", "num_ratings": "1,122", "num_reviews": "81", "avg_ratings": 3.77, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Ghana", "Literature", "African Literature"], "title": "Changes: A Love Story", "description": ["Esi decides to divorce after enduring yet another morning's marital rape. Though her friends and family remain baffled by her decision (after all, he doesn't beat her!), Esi holds fast. When she falls in love with a married man—wealthy, and able to arrange a polygamous marriage—the modern woman finds herself trapped in a new set of problems. Witty and compelling, Aidoo's n", "Esi decides to divorce after enduring yet another morning's marital rape. Though her friends and family remain baffled by her decision (after all, he doesn't beat her!), Esi holds fast. When she falls in love with a married man—wealthy, and able to arrange a polygamous marriage—the modern woman finds herself trapped in a new set of problems. Witty and compelling, Aidoo's novel, \"inaugurates a new realist style in African literature.\""], "author": "Ama Ata Aidoo", "num_pages": "208", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "1993-11-01 00:00:00", "ISBN": "1558610650"},
{"url": "https://www.goodreads.com/book/show/152642.The_River_Between", "num_ratings": "2,405", "num_reviews": "173", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Kenya", "Literature", "African Literature"], "title": "The River Between", "description": ["Christian missionaries attempt to outlaw the female circumcision ritual and in the process create a terrible rift between the two Kikuyu communities on either side of the river."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "152", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-11 00:00:00", "ISBN": "0435905481"},
{"url": "https://www.goodreads.com/book/show/1648234.We_Killed_Mangy_Dog_and_Other_Stories", "num_ratings": "122", "num_reviews": "13", "avg_ratings": 3.97, "genres": ["Cultural", "Africa", "Literature", "African Literature", "Short Stories", "Eastern Africa", "Mozambique", "Fiction", "European Literature", "Portuguese Literature"], "title": "We Killed Mangy-Dog and Other Stories", "description": ["These short stories are all set in Mozambique."], "author": "Luís Bernardo Honwana", "num_pages": "124", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1969-01-01 00:00:00", "ISBN": "0435900609"},
{"url": "https://www.goodreads.com/book/show/8521.Smokescreen", "num_ratings": "2,703", "num_reviews": "105", "avg_ratings": 3.91, "genres": ["Fiction", "Mystery", "Thriller", "Mystery", "Crime"], "title": "Smokescreen", "description": ["Edward Lincoln is a worldwide celebrity who plays detectives on the big screen. But when his godmother asks him to investigate her racehorses in South Africa, he's out of his depth. Soon enough, he's plunged into a plot of gold, greed, and gilded lives that forces him to uncover a killer and give a bravura performance he'll never give again...."], "author": "Dick Francis", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-02 00:00:00", "ISBN": "0425210251"},
{"url": "https://www.goodreads.com/book/show/97898.The_Full_Cupboard_of_Life", "num_ratings": "26,381", "num_reviews": "1,181", "avg_ratings": 4.02, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Southern Africa", "Botswana"], "title": "The Full Cupboard of Life", "description": ["Precious Ramotswe, of the No.1 Ladies Detective Agency, is on the case again, this time assisting the self-made founder of a chain of hairdressing salons who wants to unearth the real intentions of her four suitors, each possibly more interested in her money than her heart.", "Here is the fifth novel in the internationally bestselling No. 1 Ladies' Detective Agency hit series.", "Precious Ramotswe, of the No.1 Ladies Detective Agency, is on the case again, this time assisting the self-made founder of a chain of hairdressing salons who wants to unearth the real intentions of her four suitors, each possibly more interested in her money than her heart.", "Here is the fifth novel in the internationally bestselling No. 1 Ladies' Detective Agency hit series. Once again we are transported to Gaborone, capital city of Botswana, and into the world of Mma Ramotswe and her friends. ", "THE NO. 1 LADIES' DETECTIVE AGENCY.", "FOR ALL CONFIDENTIAL MATTERS AND ENQUIRIES. ", "SATISFACTION GUARANTEED FOR ALL PARTIES.", "UNDER PERSONAL MANAGEMENT. ", "Mma Ramotswe and Mr. J.L.B. Matekoni are still engaged, but with no immediate plans to get married. Mma Ramotswe wonders when a wedding date will be named, but she is anxious to avoid putting pressure on her fiancé. For indeed he has other things on his mind -- particularly a frightening request (involving a parachute jump) made by Mma Potokwani, the persuasive matron of the orphan farm. ", "Mma Ramotswe herself has weighty matters on her mind. She has been approached by a wealthy lady to check up on several suitors. Are these men interested in her or just her money? This may be difficult to find out, but it's just the kind of case Mma Ramotswe likes and she is, as we know, a very intuitive lady. ", "Meanwhile, Mma Makutsi -- plucky assistant detective and deputy manager of the Tlokweng Road Speedy Motors garage -- is moving. Her entrepreneurial venture, the Kalahari Typing School for Men, is thriving and with this new income she has rented two rooms in a house. Her spare time is occupied with planning the move, the décor and her new life in a house with running water all to herself. ", "In the background of all this is Botswana, a country of empty spaces and echoing skies, a country so beautiful and entrancing that it breaks your heart. Mma Ramotswe has prepared the bush tea and is waiting for us to join her."], "author": "Alexander McCall Smith", "num_pages": "198", "awards": ["Audie Award for Solo Narration - Female (2005)"], "places": ["Gaborone"], "character_names": ["Precious Ramotswe", "Silvia Potokwani", "Charlie the older apprentice", "Mr. J.L.B. Matekoni", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe", "Mma Holonga", "Mr. Radiphuti"], "language": "English", "publish_date": "2005-01-25 00:00:00", "ISBN": "1400031818"},
{"url": "https://www.goodreads.com/book/show/6194.Waiting_for_the_Barbarians", "num_ratings": "20,672", "num_reviews": "1,445", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Literature", "Southern Africa", "South Africa"], "title": "Waiting for the Barbarians", "description": ["For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that bran", "For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that brands him an enemy of the state.J. M. Coetzee's prize-winning novel is a startling allegory of the war between opressor and opressed. The Magistrate is not simply a man living through a crisis of conscience in an obscure place in remote times; his situation is that of all men living in unbearable complicity with regimes that ignore justice and decency."], "author": "J.M. Coetzee", "num_pages": "152", "awards": ["James Tait Black Memorial Prize for Fiction (1980)", "Philip K. Dick Award Nominee (1982)", "CNA Literary Award", "Geoffrey Faber Memorial Prize (1981)"], "places": [], "character_names": ["The Magistrate"], "language": "English", "publish_date": "1999-10-01 00:00:00", "ISBN": "0140283358"},
{"url": "https://www.goodreads.com/book/show/5488.The_Cairo_Trilogy", "num_ratings": "3,258", "num_reviews": "247", "avg_ratings": 4.46, "genres": ["Fiction", "Northern Africa", "Egypt", "Historical", "Historical Fiction", "Classics", "Cultural", "Africa", "Literature"], "title": "The Cairo Trilogy: Palace Walk / Palace of Desire / Sugar Street", "description": ["Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patri", "Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patriarch Al-Sayyid Ahmad Abd al-Jawad, who rules his household with a strict hand while living a secret life of self-indulgence. ", " introduces us to his gentle, oppressed wife, Amina, his cloistered daughters, Aisha and Khadija, and his three sons–the tragic and idealistic Fahmy, the dissolute hedonist Yasin, and the soul-searching intellectual Kamal. Al-Sayyid Ahmad’s rebellious children struggle to move beyond his domination in ", ", as the world around them opens to the currents of modernity and political and domestic turmoil brought by the 1920s. ", " brings Mahfouz’s vivid tapestry of an evolving Egypt to a dramatic climax as the aging patriarch sees one grandson become a Communist, one a Muslim fundamentalist, and one the lover of a powerful politician.", "Throughout the trilogy, the family's trials mirror those of their turbulent country during the years spanning the two World Wars, as change comes to a society that has resisted it for centuries. Filled with compelling drama, earthy humor, and remarkable insight, ", " is the achievement of a master storyteller."], "author": "Naguib Mahfouz", "num_pages": "1313", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "2001-10-16 00:00:00", "ISBN": "0375413316"},
{"url": "https://www.goodreads.com/book/show/289487.The_English_Patient", "num_ratings": "98,397", "num_reviews": "3,732", "avg_ratings": 3.88, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Romance", "Historical"], "title": "The English Patient", "description": ["Haunting and harrowing, as beautiful as it is disturbing, ", " tells the story of the entanglement of four damaged lives in an Italian monastery as World War II ends. The exhausted nurse, Hana; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless burn victim who l", "Haunting and harrowing, as beautiful as it is disturbing, ", " tells the story of the entanglement of four damaged lives in an Italian monastery as World War II ends. The exhausted nurse, Hana; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless burn victim who lies in an upstairs room and whose memories of passion, betrayal, and rescue illuminate this book like flashes of heat lightning. In lyrical prose informed by a poetic consciousness, Michael Ondaatje weaves these characters together, pulls them tight, then unravels the threads with unsettling acumen. "], "author": "Michael Ondaatje", "num_pages": "336", "awards": ["Man Booker Prize (1992)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (1992)", "Commonwealth Writers' Prize for Best Book in Caribbean and Canada (1993)", "Trillium Book Award (1993)", "Golden Man Booker Prize (2018)"], "places": ["Italy", "North Africa", "Sahara Desert", "Tuscany", "Fiesole, Tuscany", "Cairo", "Florence"], "character_names": ["Kip", "Hana", "Geoffrey Clifton", "Katharine Clifton", "David Caravaggio", "Ladislaus de Almásy"], "language": "English", "publish_date": "2004-08-02 00:00:00", "ISBN": "0747572593"},
{"url": "https://www.goodreads.com/book/show/385234.Jump_and_Other_Stories", "num_ratings": "801", "num_reviews": "53", "avg_ratings": 3.92, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Literature", "Literature", "African Literature"], "title": "Jump and Other Stories", "description": ["In sixteen new stories ranging from the dynamics of family life to the worldwide confusion of human values, Nadine Gordimer gives us access to many lives in places as far apart as suburban London, Mozambique, a mythical island, and South Africa. In \"Some Are Born to Sweet Delight, \" a girl's innocent love for an enigmatic foreign lodger in her parents' home leads her to in", "In sixteen new stories ranging from the dynamics of family life to the worldwide confusion of human values, Nadine Gordimer gives us access to many lives in places as far apart as suburban London, Mozambique, a mythical island, and South Africa. In \"Some Are Born to Sweet Delight, \" a girl's innocent love for an enigmatic foreign lodger in her parents' home leads her to involve others in a tragedy of international terrorism. \"The Moment Before the Gun Went Off\" reveals the strange mystery behind an accident in which a white farmer has killed a black boy. \"Once Upon a Time\" is a horrifying fairy tale about a child raised in a society founded on fear."], "author": "Nadine Gordimer", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-10-01 00:00:00", "ISBN": "0140165347"},
{"url": "https://www.goodreads.com/book/show/7981086-djibouti", "num_ratings": "2,366", "num_reviews": "458", "avg_ratings": 2.98, "genres": ["Fiction", "Mystery", "Mystery", "Crime", "Cultural", "Africa", "Thriller", "Abandoned"], "title": "Djibouti", "description": ["Elmore Leonard, New York Times bestselling author and \"the hippest, funniest national treasure in sight\" (Washington Post), brings his trademark wit and inimitable style to this twisting, gripping—and sometimes playful—tale of modern-day piracy", "Dara Barr, documentary filmmaker, is at the top of her game. She's covered the rape of Bosnian women, neo-Nazi white supremacists,", "Elmore Leonard, New York Times bestselling author and \"the hippest, funniest national treasure in sight\" (Washington Post), brings his trademark wit and inimitable style to this twisting, gripping—and sometimes playful—tale of modern-day piracy", "Dara Barr, documentary filmmaker, is at the top of her game. She's covered the rape of Bosnian women, neo-Nazi white supremacists, and post-Katrina New Orleans, and has won awards for all three. Now, looking for a bigger challenge, Dara and her right-hand-man, Xavier LeBo, a six-foot-six, seventy-two-year-old African American seafarer, head to Djibouti, on the Horn of Africa, to film modern-day pirates hijacking merchant ships.", "They learn soon enough that almost no one in the Middle East is who he seems to be. The most successful pirate, driving his Mercedes around Djibouti, appears to be a good guy, but his pal, a cultured Saudi diplomat, has dubious connections. Billy Wynn, a Texas billionaire, plays mysterious roles as the mood strikes him. He's promised his girlfriend, Helene, a nifty fashion model, that he'll marry her if she doesn't become seasick or bored while circling the world on his yacht. And there's Jama Raisuli, a black al Qaeda terrorist from Miami, who's vowed to blow up something big.", "What Dara and Xavier have to decide, besides the best way to stay alive: Should they shoot the action as a documentary or turn it into a Hollywood feature film?"], "author": "Elmore Leonard", "num_pages": "279", "awards": [], "places": ["Djibouti"], "character_names": ["Dara Barr", "Xavier LeBo", "Billy Wynn", "Ari Ahmed Sheik Bakar", "Idris Mohammed"], "language": "English", "publish_date": "2010-10-12 00:00:00", "ISBN": "0061735175"},
{"url": "https://www.goodreads.com/book/show/7036.The_Kalahari_Typing_School_for_Men", "num_ratings": "32,142", "num_reviews": "1,376", "avg_ratings": 4.0, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime", "Southern Africa", "Botswana"], "title": "The Kalahari Typing School for Men", "description": ["Life is never without its problems. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Find out in this, the fourth volume in the No.1 Ladies Detective Agency series featuring Botswana's first and only lady detective.", "Now that The No. 1 Ladies’ Detective Agency (the only detective agency for ladies and others in Botswana) is established", "Life is never without its problems. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Find out in this, the fourth volume in the No.1 Ladies Detective Agency series featuring Botswana's first and only lady detective.", "Now that The No. 1 Ladies’ Detective Agency (the only detective agency for ladies and others in Botswana) is established, its founder, Precious Ramotswe, can look upon her life with pride: she’s reached her late thirties (\"the finest age to be\"), has a house, two children, a good fiancé -- Mr. J. L. B. Matekoni -- and many satisfied customers. But life is never without its problems. It turns out that her adopted son is responsible for the dead hoopoe bird in the garden; her assistant, Mma Makutsi, wants a husband and needs help with her idea to open the Kalahari Typing School for Men; yet Mma Ramotswe’s sexist rival has no trouble opening his Satisfaction Guaranteed Detective Agency across town. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Follow the continuing story of Botswana’s first lady detective in the irresistible The Kalahari Typing School for Men."], "author": "Alexander McCall Smith", "num_pages": "210", "awards": [], "places": ["Botswana"], "character_names": ["Precious Ramotswe", "Puso", "Silvia Potokwani", "Charlie the older apprentice", "Note Mokoti", "Mr. J.L.B. Matekoni", "Motholeli", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe", "Cephas Buthelezi", "Mr. Molefelo", "Tebogoå Bathopi", "Bernard Selelipeng", "Mma Selelipeng"], "language": "English", "publish_date": "2004-02-26 00:00:00", "ISBN": "0349117047"},
{"url": "https://www.goodreads.com/book/show/159336.Weep_Not_Child", "num_ratings": "1,951", "num_reviews": "157", "avg_ratings": 3.85, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Eastern Africa", "Kenya", "Classics", "Literature", "Academic", "School", "Novels", "Historical", "Historical Fiction", "Literary Fiction"], "title": "Weep Not, Child", "description": ["Tells the moving story about the effects of the Mau Mau war on the lives of ordinary men and women in Kenya. In the forests, the Mau Mau are waging war against the white government, and two brothers, Kamau and Njoroge, and the rest of the family must decide where their loyalties lie."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-04-30 00:00:00", "ISBN": "0435908308"},
{"url": "https://www.goodreads.com/book/show/456710.A_Bend_in_the_River", "num_ratings": "13,430", "num_reviews": "750", "avg_ratings": 3.77, "genres": ["Cultural", "Africa", "Classics", "Literature"], "title": "A Bend in the River", "description": ["In the \"brilliant novel\" (", ") V.S. Naipaul takes us deeply into the life of one man—an Indian who, uprooted by the bloody tides of Third World history, has come to live in an isolated town at the bend of a great river in a newly independent African nation. Naipaul gives us the most convincing and disturbing vis", "In the \"brilliant novel\" (", ") V.S. Naipaul takes us deeply into the life of one man—an Indian who, uprooted by the bloody tides of Third World history, has come to live in an isolated town at the bend of a great river in a newly independent African nation. Naipaul gives us the most convincing and disturbing vision yet of what happens in a place caught between the dangerously alluring modern world and its own tenacious past and traditions."], "author": "V.S. Naipaul", "num_pages": "278", "awards": ["Man Booker Prize Nominee (1979)"], "places": ["Africa"], "character_names": ["Salim", "Metty", "Zabeth", "Ferdinand (A Bend in the River)", "Nazruddin", "Mahesh", "Shoba", "Father Huismans", "Indar", "Raymond (A Bend in the River)", "Yvette (A Bend in the River)"], "language": "English", "publish_date": "1989-10-20 00:00:00", "ISBN": "0679722025"},
{"url": "https://www.goodreads.com/book/show/3476509-a-guide-to-the-birds-of-east-africa", "num_ratings": "2,906", "num_reviews": "700", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Kenya", "Romance", "Animals", "Animals", "Birds"], "title": "A Guide to the Birds of East Africa", "description": ["For the past three years, Mr. Malik has been secretly in love with Rose Mbikwa, a woman who leads the weekly bird walks sponsored by the East African Ornithological Society. Just as Malik is getting up the nerve to invite Rose to the Nairobi Hunt Club Ball (the premier social occasion of the Kenyan calendar), Harry Khan, a nemesis from his school days, arrives in town.", "Khan", "For the past three years, Mr. Malik has been secretly in love with Rose Mbikwa, a woman who leads the weekly bird walks sponsored by the East African Ornithological Society. Just as Malik is getting up the nerve to invite Rose to the Nairobi Hunt Club Ball (the premier social occasion of the Kenyan calendar), Harry Khan, a nemesis from his school days, arrives in town.", "Khan has also become enraptured with Rose and announces his intent to invite her to the Ball. Rather than force Rose to choose between the two men, a clever solution is proposed. Whoever can identify the most species of birds in one week’s time gets the privilege of asking Ms. Mbikwa to the ball."], "author": "Nicholas Drayson", "num_pages": "202", "awards": ["Australian Capital Territory (ACT) Book of the Year (2009)"], "places": ["East Africa", "Nairobi"], "character_names": ["Mr. Malik", "Rose Mbikwa", "Harry Khan"], "language": "English", "publish_date": "2008-09-18 00:00:00", "ISBN": "0547152582"},
{"url": "https://www.goodreads.com/book/show/1274972.The_Old_Man_and_the_Medal", "num_ratings": "205", "num_reviews": "16", "avg_ratings": 3.55, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Central Africa", "Cameroon", "Literature"], "title": "The Old Man and the Medal", "description": ["Takes a satirical look at colonialism and the situations it promotes. By the author of Houseboy."], "author": "Ferdinand Oyono", "num_pages": "167", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1969-01-01 00:00:00", "ISBN": "0435900390"},
{"url": "https://www.goodreads.com/book/show/3359611-mrs-pollifax-on-safari", "num_ratings": "4,336", "num_reviews": "226", "avg_ratings": 4.12, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Adventure"], "title": "Mrs. Pollifax on Safari", "description": ["Mrs. Pollifax has been sent on safari by the C.I.A. and told only to take pictures of all of her companions, in order to find the international assassin whose next target is the president of Zambia. It sounded so simple, but shortly after Mrs. Pollifax started taking pictures, someone stole her film. And right after that she was kidnapped by Rhodesian terrorists. And right", "Mrs. Pollifax has been sent on safari by the C.I.A. and told only to take pictures of all of her companions, in order to find the international assassin whose next target is the president of Zambia. It sounded so simple, but shortly after Mrs. Pollifax started taking pictures, someone stole her film. And right after that she was kidnapped by Rhodesian terrorists. And right after that--well, read for yourself...."], "author": "Dorothy Gilman", "num_pages": "224", "awards": [], "places": ["Zambia"], "character_names": ["Mrs. Emily Pollifax", "John Sebastian Farrell", "Cyrus Reed"], "language": "English", "publish_date": "1987-12-12 00:00:00", "ISBN": "0449234142"},
{"url": "https://www.goodreads.com/book/show/131359.Death_on_the_Nile", "num_ratings": "85,904", "num_reviews": "2,941", "avg_ratings": 4.08, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Classics"], "title": "Death on the Nile", "description": ["The tranquillity of a cruise along the Nile is shattered by the discovery that Linnet Ridgeway has been shot through the head. She was young, stylish and beautiful, a girl who had everything - until she lost her life. Hercule Poirot recalls an earlier outburst by a fellow passenger: 'I'd like to put my dear little pistol against her head and just press the trigger.' Yet in", "The tranquillity of a cruise along the Nile is shattered by the discovery that Linnet Ridgeway has been shot through the head. She was young, stylish and beautiful, a girl who had everything - until she lost her life. Hercule Poirot recalls an earlier outburst by a fellow passenger: 'I'd like to put my dear little pistol against her head and just press the trigger.' Yet in this exotic setting, nothing is ever quite what it seems..."], "author": "Agatha Christie", "num_pages": "214", "awards": [], "places": ["Egypt"], "character_names": ["Colonel Race", "Simon  Doyle", "Hercule Poirot", "Linnet Ridgeway", "Jacqueline de Bellefort"], "language": "English", "publish_date": "1978-08-16 00:00:00", "ISBN": "0553119222"},
{"url": "https://www.goodreads.com/book/show/78425.The_Camel_Bookmobile", "num_ratings": "2,048", "num_reviews": "473", "avg_ratings": 3.35, "genres": ["Fiction", "Cultural", "Africa", "Writing", "Books About Books", "Adult Fiction", "Eastern Africa", "Kenya"], "title": "The Camel Bookmobile", "description": ["The Camel Bookmobile follows an American librarian who travels to the arid bush of northeastern Kenya to give meaning to her life, but ultimately loses a piece of her heart. A compelling novel that shows how one life can change many, in spite of dangerous and seemingly immutable obstacles.", "When Fiona Sweeney tells her family she wants to do something that matters, they do n", "The Camel Bookmobile follows an American librarian who travels to the arid bush of northeastern Kenya to give meaning to her life, but ultimately loses a piece of her heart. A compelling novel that shows how one life can change many, in spite of dangerous and seemingly immutable obstacles.", "When Fiona Sweeney tells her family she wants to do something that matters, they do not expect her to go to Africa to help start a traveling library. But that is where Fiona chooses to make her mark: in the arid bush of northeastern Kenya, among tiny, far-flung communities, nearly unknown and lacking roads and schools, where people live daily with drought, hunger, and disease. ", "In The Camel Bookmobile, Fi travels to settlements where people have never held a book in their hands. Her goal is to help bring Dr. Seuss, Homer, Tom Sawyer, and Hemingway to a largely illiterate and semi-nomadic populace. However, because the donated books are limited in number and the settlements are many, the library initiates a tough fine: if anyone fails to return a book, the bookmobile will stop coming. ", "Though her motives are good, Fi doesn't understand the people she seeks to help. Encumbered by her Western values, she finds herself in the midst of several struggles within the community of Mididima. There the bookmobile's presence sparks a feud between those who favor modernization and those who fear the loss of the traditional way of life in the African bush. The feud heightens when one young man—\"Scar Boy\"—doesn't return his books. As promised, the library stops all visits, but Fi goes to the settlement alone, determined to recover what has been lost. ", "Evocative, seamless, and haunting, The Camel Bookmobile is a powerful saga that challenges our fears of the unknown. It is a story that captures the riddles and calamities that often occur when two cultures collide. It follows an American librarian who travels to Africa to give meaning to her life, and ultimately loses a piece of her heart. In the end, this compelling novel shows how one life can change many, in spite of dangerous and seemingly immutable obstacles."], "author": "Masha Hamilton", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-03 00:00:00", "ISBN": "0061173487"},
{"url": "https://www.goodreads.com/book/show/297779.Master_Harold_and_the_boys", "num_ratings": "4,390", "num_reviews": "225", "avg_ratings": 3.8, "genres": ["Plays", "Drama", "Academic", "School", "Fiction", "Plays", "Theatre", "Classics"], "title": "Master Harold...and the boys", "description": ["The role that won Zakes Mokae a Tony Award brought Danny Glover back to the New York stage for the Roundabout Theatre's revival of this searing coming of age story, considered by many to be Fugard's masterpiece. A white teen who has grown up in the affectionate company of the two black waiters who work in his mother's tea room in Port Elizabeth learns that his viciously ra", "The role that won Zakes Mokae a Tony Award brought Danny Glover back to the New York stage for the Roundabout Theatre's revival of this searing coming of age story, considered by many to be Fugard's masterpiece. A white teen who has grown up in the affectionate company of the two black waiters who work in his mother's tea room in Port Elizabeth learns that his viciously racist alcoholic father is on his way home from the hospital. An ensuing rage unwittingly triggers his inevitable passage into the culture of hatred fostered by apartheid.", "\"One of those depth charge plays [that] has lasting relevance [and] can triumphantly survive any test of time...The story is simple, but the resonance that Fugard brings to it lets it reach beyond the narrative, to touch so many nerves connected to betrayal and guilt. An exhilarating play...It is a triumph of playmaking, and unforgettable.\"-New York Post", "\"Fugard creates a blistering fusion of the personal and the political.\"-The New York Times", "\"This revival brings out [the play's] considerable strengths.\"-New York Daily News"], "author": "Athol Fugard", "num_pages": "64", "awards": ["New York Drama Critics' Circle Award Nominee for Best Play (1982)"], "places": [], "character_names": [], "language": "English", "publish_date": "1984-11-06 00:00:00", "ISBN": "0140481877"},
{"url": "https://www.goodreads.com/book/show/74778.The_Sunbird", "num_ratings": "4,724", "num_reviews": "150", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Adventure", "Historical", "Thriller"], "title": "The Sunbird", "description": ["In Wilbur Smith's ", ", Dr. Ben Kazin is a brilliant archeologist. Louren Sturvesant is rich, impulsive, and physically imposing, everything Ben is not. Now, the two men--friends, competitors and partners--are searching for the legendary lost city of Opet, built by who escaped the fall of Carthage two thousand years ago.", "For Ben, the expedition is a chance to prove a", "In Wilbur Smith's ", ", Dr. Ben Kazin is a brilliant archeologist. Louren Sturvesant is rich, impulsive, and physically imposing, everything Ben is not. Now, the two men--friends, competitors and partners--are searching for the legendary lost city of Opet, built by who escaped the fall of Carthage two thousand years ago.", "For Ben, the expedition is a chance to prove a controversial thesis. For Louren, it is a chance to spend millions--and make it all back in gold and glory. But what awaits them is an astounding discovery, a siege of terror, and an act of betrayal that will tear the two men apart and bind them together forever...", "Hidden beneath water, jungle, and blood-red cliffs is a lost world where two men and a beautiful woman were caught in a furious battle of passions two thousands years ago, but which has begun once again...."], "author": "Wilbur Smith", "num_pages": "615", "awards": [], "places": [], "character_names": ["Dr. Ben Kazin", "Louren Sturvesant", "Sally Benator"], "language": "English", "publish_date": "2002-12-15 00:00:00", "ISBN": "0312983395"},
{"url": "https://www.goodreads.com/book/show/77829.Brazzaville_Beach", "num_ratings": "4,109", "num_reviews": "310", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "Africa", "Novels"], "title": "Brazzaville Beach", "description": ["In the heart of a civil war-torn African nation, primate researcher Hope Clearwater made a shocking discovery about apes and man . . .", "Young, alone, and far from her family in Britain, Hope Clearwater contemplates the extraordinary events that left her washed up like driftwood on Brazzaville Beach. It is here, on the distant, lonely outskirts of Africa, where she must come", "In the heart of a civil war-torn African nation, primate researcher Hope Clearwater made a shocking discovery about apes and man . . .", "Young, alone, and far from her family in Britain, Hope Clearwater contemplates the extraordinary events that left her washed up like driftwood on Brazzaville Beach. It is here, on the distant, lonely outskirts of Africa, where she must come to terms with the perplexing and troubling circumstances of her recent past. For Hope is a survivor of the devastating cruelities of apes and humans alike. And to move forward, she must first grasp some hard and elusive truths: about marriage and madness, about the greed and savagery of charlatan science . . . and about what compels seemingly benign creatures to kill for pleasure alone."], "author": "William  Boyd", "num_pages": "320", "awards": ["James Tait Black Memorial Prize for Fiction (1990)"], "places": ["Republic of the Congo"], "character_names": ["Hope Clearwater", "Eugene Mallabar", "John Clearwater", "Usman Shoukry"], "language": "English", "publish_date": "1995-08-01 00:00:00", "ISBN": "0380780496"},
{"url": "https://www.goodreads.com/book/show/124982.Sweetness_in_the_Belly", "num_ratings": "7,477", "num_reviews": "636", "avg_ratings": 3.9, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Cultural", "Canada", "Eastern Africa", "Ethiopia", "Religion"], "title": "Sweetness in the Belly", "description": ["Like ", " and ", ", Camilla Gibb's widely praised new novel is a poignant and intensely atmospheric look beyond the stereotypes of Islam. After her hippie British parents are murdered, Lilly is raised at a Sufi shrine in Morocco. As a young woman she goes on pilgrimage to Harar, Ethiopia, where she teaches Qur'an to children and falls in love with an ideal", "Like ", " and ", ", Camilla Gibb's widely praised new novel is a poignant and intensely atmospheric look beyond the stereotypes of Islam. After her hippie British parents are murdered, Lilly is raised at a Sufi shrine in Morocco. As a young woman she goes on pilgrimage to Harar, Ethiopia, where she teaches Qur'an to children and falls in love with an idealistic doctor. But even swathed in a traditional headscarf, Lilly can't escape being marked as a foreigner. Forced to flee Ethiopia for England, she must once again confront the riddle of who she is and where she belongs."], "author": "Camilla Gibb", "num_pages": "338", "awards": ["Scotiabank Giller Prize Nominee (2005)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Traduction (2009)", "Trillium Book Award (2006)"], "places": [], "character_names": ["Lilly", "Aziz", "Amina"], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "0143038729"},
{"url": "https://www.goodreads.com/book/show/7105495-agaat", "num_ratings": "1,135", "num_reviews": "185", "avg_ratings": 4.06, "genres": ["Fiction", "Southern Africa", "South Africa", "Historical", "Historical Fiction", "Cultural", "Africa", "Literature", "African Literature"], "title": "Agaat", "description": ["Set in apartheid South Africa, ", " portrays the unique relationship between Milla, a 67-year-old white woman, and her black maidservant turned caretaker, Agaat. Through flashbacks and diary entries, the reader learns about Milla's past. Life for white farmers in 1950s South Africa was full of promise — young and newly married, Milla raised a son and created her own farm", "Set in apartheid South Africa, ", " portrays the unique relationship between Milla, a 67-year-old white woman, and her black maidservant turned caretaker, Agaat. Through flashbacks and diary entries, the reader learns about Milla's past. Life for white farmers in 1950s South Africa was full of promise — young and newly married, Milla raised a son and created her own farm out of a swathe of Cape mountainside. Forty years later her family has fallen apart, the country she knew is on the brink of huge change, and all she has left are memories and her proud, contrary, yet affectionate guardian. With haunting, lyrical prose, Marlene Van Niekerk creates a story of love and family loyalty. Winner of the South African Sunday Times Fiction Prize in 2007, ", " was translated as ", " by Michiel Heyns, who received the Sol Plaatje Award for his translation."], "author": "Marlene van Niekerk", "num_pages": "630", "awards": ["BTBA Best Translated Book Award Nominee for Fiction shortlist (2011)", "Hertzogprys (2007)", "St. Francis College Literary Prize Nominee (2011)", "Independent Foreign Fiction Prize Nominee for Shortlist (2008)", "Barry Ronge Fiction Prize (2007)"], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "0982503091"},
{"url": "https://www.goodreads.com/book/show/12359323-three-weeks-in-december", "num_ratings": "756", "num_reviews": "174", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Literary Fiction"], "title": "Three Weeks in December", "description": ["In 1899 Jeremy, a young engineer, leaves a small town in Maine to oversee the construction of a railroad across British East Africa. In charge of hundreds of Indian laborers, he becomes the reluctant hunter of two lions that are killing his men in nightly attacks on their camp. Plagued by fear, wracked with malaria, and alienated by a secret he can tell no one, he takes in", "In 1899 Jeremy, a young engineer, leaves a small town in Maine to oversee the construction of a railroad across British East Africa. In charge of hundreds of Indian laborers, he becomes the reluctant hunter of two lions that are killing his men in nightly attacks on their camp. Plagued by fear, wracked with malaria, and alienated by a secret he can tell no one, he takes increasing solace in the company of an African man who scouts for him.", "In 2000 Max, an American ethnobotonist, travels to Rwanda in search of an obscure vine that could become a lifesaving pharmaceutical. Stationed in the mountains, she shadows a family of gorillas—the last of their group to survive the merciless assault of local poachers. Max bears a striking gift for communicating with the apes. But soon the precarious freedom of both is threatened as a violent rebel group from the nearby Congo draws close.", "Told in alternating perspectives that interweave the two characters and their fates, Audrey Schulman’s newest novel deftly confronts the struggle between progress and preservation, idiosyncrasy and acceptance. Evoking both Barbara Kingsolver and Andrea Barrett, this enthralling fiction, wise and generous, explores some of the crucial social and cultural challenges that, over the years, have come to shape our world.", "The engaging story and memorable characters make this fine novel an ideal book club selection."], "author": "Audrey Schulman", "num_pages": "353", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-31 00:00:00", "ISBN": "1609450647"},
{"url": "https://www.goodreads.com/book/show/16074560-a-spear-of-summer-grass", "num_ratings": "3,839", "num_reviews": "648", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Romance", "Historical", "Fiction", "Cultural", "Africa", "Romance", "Historical Romance"], "title": "A Spear of Summer Grass", "description": ["Paris, 1923 ", "The daughter of a scandalous mother, Delilah Drummond is already notorious, even amongst Paris society. But her latest scandal is big enough to make even her oft-married mother blanch. Delilah is exiled to Kenya and her favorite stepfather's savannah manor house until gossip subsides. ", "Fairlight is the crumbling, sun-bleached skeleton of a faded African dream, a", "Paris, 1923 ", "The daughter of a scandalous mother, Delilah Drummond is already notorious, even amongst Paris society. But her latest scandal is big enough to make even her oft-married mother blanch. Delilah is exiled to Kenya and her favorite stepfather's savannah manor house until gossip subsides. ", "Fairlight is the crumbling, sun-bleached skeleton of a faded African dream, a world where dissolute expats are bolstered by gin and jazz records, cigarettes and safaris. As mistress of this wasted estate, Delilah falls into the decadent pleasures of society.  ", "Against the frivolity of her peers, Ryder White stands in sharp contrast. As foreign to Delilah as Africa, Ryder becomes her guide to the complex beauty of this unknown world. Giraffes, buffalo, lions and elephants roam the shores of Lake Wanyama amid swirls of red dust. Here, life is lush and teeming-yet fleeting and often cheap.  ", "Amidst the wonders-and dangers-of Africa, Delilah awakes to a land out of all proportion: extremes of heat, darkness, beauty and joy that cut to her very heart. Only when this sacred place is profaned by bloodshed does Delilah discover what is truly worth fighting for-and what she can no longer live without."], "author": "Deanna Raybourn", "num_pages": "370", "awards": ["DABWAHA Romance Tournament Nominee for Novel with Strong Romantic Elements (2014)"], "places": ["Paris", "Kenya"], "character_names": [], "language": "English", "publish_date": "2013-04-30 00:00:00", "ISBN": "0778314391"},
{"url": "https://www.goodreads.com/book/show/2944610-the-mulberry-forest", "num_ratings": "386", "num_reviews": "14", "avg_ratings": 3.97, "genres": ["Fiction", "Historical", "Historical Fiction", "Southern Africa", "South Africa", "Cultural", "Africa"], "title": "The Mulberry Forest", "description": ["Silkworm farmers from Italy were lured to Gouna in the Knysna Forest to establish a silk industry. The only problem was that mulberry trees refused to grow in sticky mud. Disgruntled immigrants had to battle severe winter rains, fever and a lack of understanding. They were becoming increasingly disillusioned with the government dumping them in the wilderness under false pr", "Silkworm farmers from Italy were lured to Gouna in the Knysna Forest to establish a silk industry. The only problem was that mulberry trees refused to grow in sticky mud. Disgruntled immigrants had to battle severe winter rains, fever and a lack of understanding. They were becoming increasingly disillusioned with the government dumping them in the wilderness under false pretences. The man coming their rescue was a forest person with an unruly daughter and a head full of plans - the headstrong Silas Miggel. He wanted to get them back on board a ship, heading for Italy ..."], "author": "Dalene Matthee", "num_pages": "368", "awards": ["ATKV Award for Prose (1987)"], "places": ["South Africa", "Gouna"], "character_names": [], "language": "English", "publish_date": "1990-09-27 00:00:00", "ISBN": "0140120254"},
{"url": "https://www.goodreads.com/book/show/836746.A_Grain_of_Wheat", "num_ratings": "3,068", "num_reviews": "170", "avg_ratings": 3.83, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Kenya", "Historical", "Historical Fiction", "Literature", "African Literature"], "title": "A Grain of Wheat", "description": ["Set in the wake of the Mau Mau rebellion and on the cusp of Kenya's independence from Britain, A Grain of Wheat follows a group of villagers whose lives have been transformed by the 1952–1960 Emergency. At the center of it all is the reticent Mugo, the village's chosen hero and a man haunted by a terrible secret. As we learn of the villagers' tangled histories in a narrati", "Set in the wake of the Mau Mau rebellion and on the cusp of Kenya's independence from Britain, A Grain of Wheat follows a group of villagers whose lives have been transformed by the 1952–1960 Emergency. At the center of it all is the reticent Mugo, the village's chosen hero and a man haunted by a terrible secret. As we learn of the villagers' tangled histories in a narrative interwoven with myth and peppered with allusions to real-life leaders, including Jomo Kenyatta, a masterly story unfolds in which compromises are forced, friendships are betrayed, and loves are tested."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "247", "awards": [], "places": ["East Africa"], "character_names": [], "language": "English", "publish_date": "1994-01-01 00:00:00", "ISBN": "0435909878"},
{"url": "https://www.goodreads.com/book/show/34533486-o-arovan", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 3.0, "genres": [], "title": "Očarovaná", "description": ["Kateřina odlétá do Keni čerpat inspiraci pro nový román. Jenže uvidí, něco co neměla, a tím nad sebou vynese rozsudek smrti. Sandra tuší, že se sestře přihodilo něco zlého. Vydá se na stejně nebezpečnou cestu a upadne do pasti kmenových tabu, kouzelných rituálů a mocných kleteb..."], "author": "Hana Hindráková", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "Czech", "publish_date": "2015-08-16 00:00:00", "ISBN": "9788074667"},
{"url": "https://www.goodreads.com/book/show/24687.Don_t_Let_s_Go_to_the_Dogs_Tonight", "num_ratings": "44,010", "num_reviews": "3,108", "avg_ratings": 3.96, "genres": ["Autobiography", "Memoir", "Nonfiction", "Cultural", "Africa", "Biography"], "title": "Don't Let's Go to the Dogs Tonight: An African Childhood", "description": ["In ", ", Alexandra Fuller remembers her African childhood with candor and sensitivity. Though it is a diary of an unruly life in an often inhospitable place, it is suffused with Fuller’s endearing ability to find laughter, even when there is little to celebrate. Fuller’s debut is unsentimental and unflinching but always captivating. In wry and", "In ", ", Alexandra Fuller remembers her African childhood with candor and sensitivity. Though it is a diary of an unruly life in an often inhospitable place, it is suffused with Fuller’s endearing ability to find laughter, even when there is little to celebrate. Fuller’s debut is unsentimental and unflinching but always captivating. In wry and sometimes hilarious prose, she stares down disaster and looks back with rage and love at the life of an extraordinary family in an extraordinary time."], "author": "Alexandra Fuller", "num_pages": "315", "awards": ["Guardian First Book Award Nominee (2002)", "Book Sense Book of the Year Award for Adult Nonfiction (2003)", "Winifred Holtby Memorial Prize (2002)"], "places": ["Zimbabwe", "Malawi", "Zambia"], "character_names": [], "language": "English", "publish_date": "2003-03-11 00:00:00", "ISBN": "0375758992"},
{"url": "https://www.goodreads.com/book/show/25258507-dobrovolnice", "num_ratings": "7", "num_reviews": "2", "avg_ratings": 4.0, "genres": ["Cultural", "Africa"], "title": "Dobrovolnice", "author": "Hana Hindráková", "num_pages": "228", "awards": [], "places": [], "character_names": [], "language": "Czech", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22461198-karibu-ke-a", "num_ratings": "5", "num_reviews": "3", "avg_ratings": 3.2, "genres": [], "title": "Karibu Keňa", "description": ["Sára Ječmínková se po zklamání v osobním životě rozhodne začít znovu – a to od základu. Rodnou zemi nechává za zády a jako delegátka cestovní kanceláře odjíždí do Keni. Ta jí hned od první chvíle učaruje a její život dostává nový rozměr. Se všemi klady a přese všechny zápory, které život v okouzlující, ale také velmi chudé a povolebními nepokoji zmítané exotické zemi nabíz", "Sára Ječmínková se po zklamání v osobním životě rozhodne začít znovu – a to od základu. Rodnou zemi nechává za zády a jako delegátka cestovní kanceláře odjíždí do Keni. Ta jí hned od první chvíle učaruje a její život dostává nový rozměr. Se všemi klady a přese všechny zápory, které život v okouzlující, ale také velmi chudé a povolebními nepokoji zmítané exotické zemi nabízí.", "Seznamuje se s Benem Okongem, jenž pochází z kmene Luo, dozvídá se o tradičních kmenových rituálech a zvycích. A zamiluje se. Je tu však také někdo, kdo Sáře nový život nepřeje a ohrožuje ji černou magií.", "Podaří se Sáře vytoužené a přitom tak křehké štěstí v Keni ubránit?"], "author": "Hana Hindráková", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "Czech", "publish_date": "2013-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30145154-almost-a-bride", "num_ratings": "1,370", "num_reviews": "100", "avg_ratings": 4.27, "genres": ["Romance", "Womens Fiction", "Chick Lit", "Contemporary"], "title": "Almost a Bride", "description": ["Annie knows life isn't always fair. Sometimes you win. Sometimes you lose. Sometimes you get mistaken for a crazed intruder when you come home early and find your boyfriend wearing nipple clamps with a coworker on the night you thought he was going to prop", "Annie knows life isn't always fair. Sometimes you win. Sometimes you lose. Sometimes you get mistaken for a crazed intruder when you come home early and find your boyfriend wearing nipple clamps with a coworker on the night you thought he was going to propose to you.", "The important thing is to move on, and for Annie that means treating herself to a tropical vacation. But when she runs into her ex and his new woman staying at the same resort, reason is washed out to sea. Caught off guard, Annie pretends she's with Chris, a cute screenwriter she meets on the beach. With his own writing blocked, Chris is happy to help Annie craft a story to save face. Soon Annie isn't just getting over her ex, she's getting under Chris. As her fictional feelings grow increasingly real, Annie has to decide if she's ready to risk her heart on a new relationship.", "\"Top Pick! ", " put a smile on my face more than once. The dialogue was witty, the words were well-written and the heroine was one-of-a-kind.\" ---Harlequin Junkie"], "author": "Jo Watson", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-01-31 00:00:00", "ISBN": "1455595500"},
{"url": "https://www.goodreads.com/book/show/13452959-the-palaver-tree", "num_ratings": "38", "num_reviews": "29", "avg_ratings": 4.26, "genres": ["Cultural", "Africa", "History"], "title": "The Palaver Tree", "description": ["Africa: Beautiful, serene ... and dangerous", "Lives and fortunes change in the blink of an eye.", "After suffering a terrible tragedy in her home town, Ellie Hathaway is offered an opportunity she can’t resist. A teaching position in a remote African village, through The Hope Foundation, run by the enigmatic Gabriel Cole.", "But dark forces and ambitions were in play long before Elli", "Africa: Beautiful, serene ... and dangerous", "Lives and fortunes change in the blink of an eye.", "After suffering a terrible tragedy in her home town, Ellie Hathaway is offered an opportunity she can’t resist. A teaching position in a remote African village, through The Hope Foundation, run by the enigmatic Gabriel Cole.", "But dark forces and ambitions were in play long before Ellie set foot on the dusty plains of Africa.", "Just as Ellie is beginning to believe she might find happiness again, she realises something is very wrong at the school. ", "Is Gabriel Cole really the guardian angel everyone believes him to be?", "Realising she needs to tread carefully, or put those around her at risk, Ellie starts searching for answers. Then political chaos descends, and Ellie finds herself in terrible danger..."], "author": "Wendy Unsworth", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25825065-marshall-s-family", "num_ratings": "13", "num_reviews": "5", "avg_ratings": 4.46, "genres": [], "title": "Marshall's Family", "description": ["Richard Marshall is a pilot, working in Africa, who wishes for a quiet domestic life. Unfortunately, he has a wife who despises him, a daughter who brings home problems and a lover who wants him all to herself. ", "He is an an easy-going, unremarkable man who avoids responsibility whenever he can, yet the responsibilities just keep piling up, until perhaps the fate of an entir", "Richard Marshall is a pilot, working in Africa, who wishes for a quiet domestic life. Unfortunately, he has a wife who despises him, a daughter who brings home problems and a lover who wants him all to herself. ", "He is an an easy-going, unremarkable man who avoids responsibility whenever he can, yet the responsibilities just keep piling up, until perhaps the fate of an entire nation rests on his inadequate shoulders. People are dying and the situation needs a hero, what it has is Richard Marshall."], "author": "Anson Welsh", "num_pages": "277", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12663.The_Covenant", "num_ratings": "17,727", "num_reviews": "379", "avg_ratings": 4.18, "genres": ["Historical", "Historical Fiction", "Southern Africa", "South Africa", "Fiction"], "title": "The Covenant", "description": ["Set in South Africa, beginning 15,000 years ago and ending with the Boer War, this is a novel about people caught up in the march of world history. It is a story of adventure and heroism, love and loyalty, and cruelty and betrayal."], "author": "James A. Michener", "num_pages": "1240", "awards": [], "places": ["South Africa", "Africa"], "character_names": [], "language": "English", "publish_date": "1992-01-09 00:00:00", "ISBN": "0749311614"},
{"url": "https://www.goodreads.com/book/show/2296567.Say_You_re_One_of_Them", "num_ratings": "13,296", "num_reviews": "2,280", "avg_ratings": 3.5, "genres": ["Fiction", "Cultural", "Africa", "Short Stories", "Historical", "Historical Fiction", "Abandoned", "War", "Western Africa", "Nigeria", "Adult", "Literature", "African Literature", "Eastern Africa", "Rwanda"], "title": "Say You're One of Them", "description": ["Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds,", "Uwem Akpan's stunning stories humanize the perils of poverty and violence so piercingly that few readers will feel they've ever encountered Africa so immediately. The eight-year-old narrator of \"An Ex-Mas Feast\" needs only enough money to buy books and pay fees in order to attend school. Even when his twelve-year-old sister takes to the streets to raise these meager funds, his dream can't be granted. Food comes first. His family lives in a street shanty in Nairobi, Kenya, but their way of both loving and taking advantage of each other strikes a universal chord. ", "In the second of his stories published in a New Yorker special fiction issue, Akpan takes us far beyond what we thought we knew about the tribal conflict in Rwanda. The story is told by a young girl, who, with her little brother, witnesses the worst possible scenario between parents. They are asked to do the previously unimaginable in order to protect their children. This singular collection will also take the reader inside Nigeria, Benin, and Ethiopia, revealing in beautiful prose the harsh consequences for children of life in Africa. ", "Akpan's voice is a literary miracle, rendering lives of almost unimaginable deprivation and terror into stories that are nothing short of transcendent."], "author": "Uwem Akpan", "num_pages": "358", "awards": ["Guardian First Book Award Nominee for Longlist (2008)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2009)", "PEN Open Book Award (2009)", "Paris Book Festival for Compilation/Anthology (2010)", "Hurston/Wright Legacy Award for Fiction (2009)", "Commonwealth Writers' Prize for Best First Book in Africa (2009)"], "places": ["Benin", "Kenya", "Ethiopia", "Rwanda", "Nigeria", "Africa"], "character_names": [], "language": "English", "publish_date": "2009-09-18 00:00:00", "ISBN": "0316113786"},
{"url": "https://www.goodreads.com/book/show/7039.Tears_of_the_Giraffe", "num_ratings": "43,656", "num_reviews": "2,442", "avg_ratings": 3.96, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime"], "title": "Tears of the Giraffe", "description": ["\"This is a superior piece of detective fiction, written in simple, direct but effective prose. Perhaps most importantly, this novel offers a refreshingly positive picture of an African nation - and probably deserves a wide audience in the West on those grounds alone.\"", "In 1999 The No. 1 Ladies' Detective Agency received two Booker Judges' Special Recommendations and was vote", "\"This is a superior piece of detective fiction, written in simple, direct but effective prose. Perhaps most importantly, this novel offers a refreshingly positive picture of an African nation - and probably deserves a wide audience in the West on those grounds alone.\"", "In 1999 The No. 1 Ladies' Detective Agency received two Booker Judges' Special Recommendations and was voted one of the ‘International Books of the Year and the Millennium' by the Times Literary Supplement. ", "Tears of the Giraffe takes us further into the life of the engaging and sassy Precious Ramotswe, the owner and detective of Botswana's only Ladies' detective agency. Among her cases are wayward wives, unscrupulous maids and a challenge to resolve a mother's pain for her son, who is long lost on the African plains. Mma Ramotswe's own impending marriage to that most gentlemanly of men, Mr. J. L. B. Matekoni, the promotion of her secretary to the dizzy heights of Assistant Detective and new additions to the Matekoni family, all brew up the most humorous and charmingly entertaining of tales."], "author": "Alexander McCall Smith", "num_pages": "217", "awards": [], "places": ["Bulawayo", "Gaborone"], "character_names": ["Precious Ramotswe", "Puso", "Silvia Potokwani", "Mr. J.L.B. Matekoni", "Motholeli", "Grace Makutsi", "Obed Ramotswe"], "language": "English", "publish_date": "2003-08-07 00:00:00", "ISBN": "0349116652"},
{"url": "https://www.goodreads.com/book/show/151374.So_Long_a_Letter", "num_ratings": "5,441", "num_reviews": "453", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Senegal", "Literature", "African Literature", "Cultural", "France", "Feminism"], "title": "So Long a Letter", "description": ["This novel is in the form of a letter, written by the widowed Ramatoulaye and describing her struggle for survival. It is the winner of the Noma Award."], "author": "Mariama Bâ", "num_pages": "90", "awards": ["Noma Award for Publishing in Africa (1980)"], "places": ["Senegal"], "character_names": ["Ramatoulaye", "Aissatou", "Mawdo Ba", "Modou Fall", "Binetou"], "language": "English", "publish_date": "1989-06-28 00:00:00", "ISBN": "0435905554"},
{"url": "https://www.goodreads.com/book/show/123748.God_s_Bits_of_Wood", "num_ratings": "2,062", "num_reviews": "117", "avg_ratings": 3.92, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Western Africa", "Senegal"], "title": "God's Bits of Wood", "description": ["In 1947-48 the workers on the Dakar-Niger railway staged a strike. In this vivid, timeless novel, Ousmane Sembène envinces the color, passion, and tragedy of those formative years in the history of West Africa."], "author": "Ousmane Sembène", "num_pages": "252", "awards": [], "places": ["Senegal"], "character_names": [], "language": "English", "publish_date": "2008-08-11 00:00:00", "ISBN": "0435909592"},
{"url": "https://www.goodreads.com/book/show/49552.The_Stranger", "num_ratings": "546,479", "num_reviews": "17,285", "avg_ratings": 3.97, "genres": ["Classics", "Fiction", "Philosophy", "Cultural", "France", "Literature"], "title": "The Stranger", "description": ["Through the story of an ordinary man unwittingly drawn into a senseless murder on an Algerian beach, Camus explored what he termed \"the nakedness of man faced with the absurd.\" First published in English in 1946; now in a new translation by Matthew Ward."], "author": "Albert Camus", "num_pages": "123", "awards": ["PEN Translation Prize for Matthew Ward (1989)"], "places": ["Algeria"], "character_names": ["Meursault", "Raymond Sintès", "Marie Cardona", "Salamano"], "language": "English", "publish_date": "1989-03-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4900.Heart_of_Darkness", "num_ratings": "342,801", "num_reviews": "11,081", "avg_ratings": 3.42, "genres": ["Classics", "Fiction", "Literature", "Cultural", "Africa", "Academic", "School"], "title": "Heart of Darkness", "description": ["Dark allegory describes the narrator's journey up the Congo River and his meeting with, and fascination by, Mr. Kurtz, a mysterious personage who dominates the unruly inhabitants of the region. Masterly blend of adventure, character development, psychological penetration. Considered by many Conrad's finest, most enigmatic story."], "author": "Joseph Conrad", "num_pages": "188", "awards": [], "places": ["Africa", "Belgian Congo", "Brussels", "Congo Free State"], "character_names": ["Charles Marlow", "Kurtz"], "language": "English", "publish_date": "2003-10-01 00:00:00", "ISBN": "1892295490"},
{"url": "https://www.goodreads.com/book/show/65249.A_Dry_White_Season", "num_ratings": "2,976", "num_reviews": "184", "avg_ratings": 4.04, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "South Africa", "Historical", "Historical Fiction"], "title": "A Dry White Season", "description": ["As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple", "As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple, apolitical man, he believes in the essential fairness of the South African government and its policies—until the sudden arrest and subsequent \"suicide\" of a black janitor from Du Toit's school. Haunted by new questions and desperate to believe that the man's death was a tragic accident, Du Toit undertakes an investigation into the terrible affair—a quest for the truth that will have devastating consequences for the teacher and his family, as it draws him into a lethal morass of lies, corruption, and murder."], "author": "André Brink", "num_pages": "316", "awards": ["Prix Médicis Etranger (1980)"], "places": ["Johannesburg"], "character_names": [], "language": "English", "publish_date": "2006-09-19 00:00:00", "ISBN": "0061138630"},
{"url": "https://www.goodreads.com/book/show/6192.Disgrace", "num_ratings": "69,576", "num_reviews": "5,066", "avg_ratings": 3.84, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Novels", "Literature"], "title": "Disgrace", "description": ["Set in post-apartheid South Africa, J. M. Coetzee’s searing novel tells the story of David Lurie, a twice divorced, 52-year-old professor of communications and Romantic Poetry at Cape Technical University. Lurie believes he has created a comfortable, if somewhat passionless, life for himself. He lives within his financial and emotional means. Though his position at the uni", "Set in post-apartheid South Africa, J. M. Coetzee’s searing novel tells the story of David Lurie, a twice divorced, 52-year-old professor of communications and Romantic Poetry at Cape Technical University. Lurie believes he has created a comfortable, if somewhat passionless, life for himself. He lives within his financial and emotional means. Though his position at the university has been reduced, he teaches his classes dutifully; and while age has diminished his attractiveness, weekly visits to a prostitute satisfy his sexual needs. He considers himself happy. But when Lurie seduces one of his students, he sets in motion a chain of events that will shatter his complacency and leave him utterly disgraced."], "author": "J.M. Coetzee", "num_pages": "220", "awards": ["Man Booker Prize (1999)", "National Book Critics Circle Award Nominee for Fiction (1999)", "Commonwealth Writers' Prize for Best Book Overall (2000)", "The Best of the Booker Nominee (2008)"], "places": ["South Africa", "Cape Town"], "character_names": ["David Lurie", "Lucy Lurie", "Petrus", "Bev Shaw", "Melanie Isaacs"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0143036378"},
{"url": "https://www.goodreads.com/book/show/7061.The_No_1_Ladies_Detective_Agency", "num_ratings": "203,056", "num_reviews": "10,007", "avg_ratings": 3.76, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime"], "title": "The No. 1 Ladies' Detective Agency", "description": ["Precious Ramotswe has only just set up shop as Botswana's No.1 (and only) lady detective when she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. However, the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "First published in the UK in 1998, and in", "Precious Ramotswe has only just set up shop as Botswana's No.1 (and only) lady detective when she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. However, the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "First published in the UK in 1998, and in the USA in 2001 by Polygon. Republished in 2002 and 2003 by Anchor. ", "This first novel in Alexander McCall Smith's widely acclaimed The No. 1 Ladies Detective Agency series tells the story of the delightfully cunning and enormously engaging Precious Ramotswe, who is drawn to her profession to \"help people with problems in their lives.\" Immediately upon setting up shop in a small storefront in Gaborone, she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. But the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "The No. 1 Ladies' Detective Agency received two Booker Judges' Special Recommendations and was voted one of the International Books of the Year and the Millennium by the Times Literary Supplement."], "author": "Alexander McCall Smith", "num_pages": "235", "awards": ["Martin Beck Award (2004)"], "places": ["Botswana", "Johannesburg", "Mafikeng"], "character_names": ["Precious Ramotswe", "Silvia Potokwani", "Charlie the older apprentice", "Note Mokoti", "Mr. J.L.B. Matekoni", "Violet Sepotho", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe"], "language": "English", "publish_date": "2003-02-06 00:00:00", "ISBN": "1400034779"},
{"url": "https://www.goodreads.com/book/show/4078927-little-bee", "num_ratings": "208,384", "num_reviews": "20,272", "avg_ratings": 3.71, "genres": ["Historical", "Historical Fiction", "Fiction", "Adult Fiction", "Contemporary", "Adult", "Book Club"], "title": "Little Bee", "description": ["This is the story of two women. Their lives collide one fateful day, and one of them has to make a terrible choice, the kind of choice we hope you never have to face. Two years later, they meet again - the story starts there ..."], "author": "Chris Cleave", "num_pages": "288", "awards": ["Costa Book Award Nominee for Novel (2008)", "Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Kingston-upon-Thames, London, England"], "character_names": ["Sarah O'Rourke", "Pequena Abelha", "Andrew O'Rourke", "Little Bee"], "language": "English", "publish_date": "2009-02-10 00:00:00", "ISBN": "038566530X"},
{"url": "https://www.goodreads.com/book/show/6150.Cry_the_Beloved_Country", "num_ratings": "57,772", "num_reviews": "3,472", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Southern Africa", "South Africa"], "title": "Cry, the Beloved Country", "description": ["Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.", "Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.", "The eminent literary critic Lewis Gannett wrote, “We have had many novels from statesmen and reformers, almost all bad; many novels from poets, almost all thin. In Alan Paton’s ", " the statesman, the poet and the novelist meet in a unique harmony.” ", " is the deeply moving story of the Zulu pastor Stephen Kumalo and his son, Absalom, set against the background of a land and a people riven by racial injustice. Remarkable for its lyricism, unforgettable for character and incident, ", " is a classic work of love and hope, courage and endurance, born of the dignity of man."], "author": "Alan Paton", "num_pages": "316", "awards": ["Anisfield-Wolf Book Award for Fiction (1949)"], "places": ["South Africa"], "character_names": ["Stephen Kumalo", "Absalom Kumalo", "Msimangu", "James Jarvis"], "language": "English", "publish_date": "2003-11-25 00:00:00", "ISBN": "074326195X"},
{"url": "https://www.goodreads.com/book/show/126381.Purple_Hibiscus", "num_ratings": "44,222", "num_reviews": "4,231", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her bro", "Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her brother away to stay with their aunt, a University professor, whose house is noisy and full of laughter. There, Kambili and her brother discover a life and love beyond the confines of their father’s authority. The visit will lift the silence from their world and, in time, give rise to devotion and defiance that reveal themselves in profound and unexpected ways. ", "This is a book about the promise of freedom; about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new."], "author": "Chimamanda Ngozi Adichie", "num_pages": "307", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0007189885"},
{"url": "https://www.goodreads.com/book/show/7244.The_Poisonwood_Bible", "num_ratings": "591,565", "num_reviews": "20,959", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Classics"], "title": "The Poisonwood Bible", "description": [" is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is", " is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is a suspenseful epic of one family's tragic undoing and remarkable reconstruction over the course of three decades in postcolonial Africa."], "author": "Barbara Kingsolver", "num_pages": "546", "awards": ["Pulitzer Prize Nominee for Fiction (1999)", "Orange Prize Nominee for Fiction Shortlist (1999)", "Book Sense Book of the Year Award for Adult (2000)", "PEN/Faulkner Award for Fiction Nominee (1999)", "Independent Publisher Book Award (IPPY) for Audio Fiction - Unabridged (1999)", "Exclusive Books Boeke Prize (2000)", "Puddly Award for Novel (2001)"], "places": ["Bethlehem, Georgia", "Kilanga", "Sanderling Island, Georgia", "Leopoldville"], "character_names": ["Orleanna Price", "Ruth May Price", "Rachel Rebeccah Price", "Leah Price", "Nathan Price", "Dr Bud Wharton", "Adah Price", "Reverend & Mrs. Underdown"], "language": "English", "publish_date": "2005-07-05 00:00:00", "ISBN": "0060786507"},
{"url": "https://www.goodreads.com/book/show/17789633-african-safari-with-ted-and-raymond", "num_ratings": "65", "num_reviews": "13", "avg_ratings": 4.63, "genres": ["Childrens"], "title": "African Safari with Ted and Raymond", "description": ["Ted and Raymond go to Africa. They find great facts about the animals, they learn new words, and new foods."], "author": "Rhonda Patton", "num_pages": "40", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3591262-cutting-for-stone", "num_ratings": "304,871", "num_reviews": "23,928", "avg_ratings": 4.28, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Book Club", "Eastern Africa", "Ethiopia", "Health", "Medicine"], "title": "Cutting for Stone", "description": ["An unforgettable journey into one man's remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others set in 1960s & 1970s Ethiopia and 1980s America.", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon at a mission hospital in Addis Ababa. Orphaned by", "An unforgettable journey into one man's remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others set in 1960s & 1970s Ethiopia and 1980s America.", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon at a mission hospital in Addis Ababa. Orphaned by their mother’s death in childbirth and their father’s disappearance, bound together by a preternatural connection and a shared fascination with medicine, the twins come of age as Ethiopia hovers on the brink of revolution. Yet it will be love, not politics—their passion for the same woman—that will tear them apart and force Marion, fresh out of medical school, to flee his homeland. He makes his way to America, finding refuge in his work as an intern at an underfunded, overcrowded New York City hospital. When the past catches up to him—nearly destroying him—Marion must entrust his life to the two men he thought he trusted least in the world: the surgeon father who abandoned him and the brother who betrayed him. ", "An unforgettable journey into one man’s remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others."], "author": "Abraham Verghese", "num_pages": "541", "awards": ["PEN/Hemingway Foundation Award Nominee (2010)", "Exclusive Books Boeke Prize Nominee (2011)", "Indies Choice Book Award for Adult Fiction (2010)", "Dayton Literary Peace Prize Nominee for Fiction (2010)", "Wellcome Book Prize Nominee for Shortlist (2009)", "Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Addis Ababa"], "character_names": ["Thomas Stone", "Sister Mary Joseph Praise", "Marion Stone", "Shiva Stone"], "language": "English", "publish_date": "2009-02-03 00:00:00", "ISBN": "0375414495"},
{"url": "https://www.goodreads.com/book/show/9478000-the-liquidator", "num_ratings": "54", "num_reviews": "10", "avg_ratings": 3.91, "genres": ["Cultural", "Africa", "Fiction"], "title": "The Liquidator", "description": ["Dangerous things happen in Africa. People disappear. Everybody knows that.", "But as an outsider, Paul thinks he is safe, even from the secret police, whatever he starts to find, or wherever it leads; despite the turmoil leading up to the country’s first multi party election and with a diamond fuelled civil war raging in the failed state just across the border.", "But when Paul fi", "Dangerous things happen in Africa. People disappear. Everybody knows that.", "But as an outsider, Paul thinks he is safe, even from the secret police, whatever he starts to find, or wherever it leads; despite the turmoil leading up to the country’s first multi party election and with a diamond fuelled civil war raging in the failed state just across the border.", "But when Paul finds himself and his friends trapped holding a potentially deadly secret as the country begins to implode, what will he be prepared to do to protect himself and those around him in order to escape?", "Iain’s first novel, The Liquidator, is a contemporary political mystery / black comedy that asks, when the chips are down, what would you do if you felt threatened enough in an alien situation?"], "author": "Iain Parke", "num_pages": "284", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-24 00:00:00", "ISBN": "0956161502"},
{"url": "https://www.goodreads.com/book/show/18749.Half_of_a_Yellow_Sun", "num_ratings": "69,512", "num_reviews": "6,171", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21", "Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed. ", "With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another. ", "Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had."], "author": "Chimamanda Ngozi Adichie", "num_pages": "433", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "1400044162"}
]