[
{"url": "https://www.goodreads.com/book/show/843804.The_Absolutely_True_Diary_of_a_Part_Time_Indian", "num_ratings": "191,233", "num_reviews": "21,153", "avg_ratings": 4.12, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Contemporary", "Humor"], "title": "The Absolutely True Diary of a Part-Time Indian", "description": ["Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolut", "Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolutely True Diary of a Part-Time Indian, which is based on the author's own experiences, coupled with poignant drawings by Ellen Forney that reflect the character's art, chronicles the contemporary adolescence of one Native American boy as he attempts to break away from the life he was destined to live.", "With a forward by Markus Zusak, interviews with Sherman Alexie and Ellen Forney, and four-color interior art throughout, this edition is perfect for fans and collectors alike. "], "author": "Sherman Alexie", "num_pages": "230", "awards": ["National Book Award for Young People's Literature (2007)", "Odyssey Award (2009)", "American Indian Library Association Award", "South Carolina Book Award Nominee for Young Adult Book Award (2010)", "Michigan Library Association Thumbs Up! Award Nominee (2008)", "Florida Teens Read Nominee (2009)", "American Indian Youth Literature Award for Best Young Adult Book (Award Retroactively Rescinded in 2018) (2008)", "Boston Globe-Horn Book Award for Fiction (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2010)", "Lincoln Award Nominee (2011)", "James Cook Book Award Nominee (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["United States of America", "Washington (the state)"], "character_names": ["Arnold \"Junior\" Spirit", "Coach", "Rowdy", "Mary \"Runs Away\" Spirit", "Mr. P", "Agnes Adams / Spirit", "Melinda", "Mr. Grant", "Penelope (divers)", "Micah", "Roger \"The Giant\"", "Grandma Spirit", "Eugene", "Dawn", "Mr. Dodge", "Gordy", "Dad Spirit", "Rowdy's Dad", "Mr. Sheridan", "Earl", "Gerald", "Ted", "Bobby"], "language": "English", "publish_date": "2009-04-01 00:00:00", "ISBN": "0316013692"},
{"url": "https://www.goodreads.com/book/show/6931234-shadows-cast-by-stars", "num_ratings": "1,710", "num_reviews": "231", "avg_ratings": 3.57, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Dystopia", "Science Fiction", "Fantasy", "Paranormal", "Romance"], "title": "Shadows Cast By Stars", "description": ["Two hundred years from now, blood has become the most valuable commodity on the planet— especially the blood of aboriginal peoples, for it contains antibodies that protect them from the Plague ravaging the rest of the world.", "Sixteen-year-old Cassandra", "Two hundred years from now, blood has become the most valuable commodity on the planet— especially the blood of aboriginal peoples, for it contains antibodies that protect them from the Plague ravaging the rest of the world.", "Sixteen-year-old Cassandra Mercredi might be immune to Plague, but that doesn't mean she's safe— government forces are searching for those of aboriginal heritage to harvest their blood. When a search threatens Cassandra and her family, they flee to the Island: a mysterious and idyllic territory protected by the Band, a group of guerrilla warriors— and by an enigmatic energy barrier that keeps outsiders out and the spirit world in. And though the village healer has taken her under her wing, and the tribal leader's son into his heart, the creatures of the spirit world are angry, and they have chosen Cassandra to be their voice and instrument...", "Incorporating the traditions of the First Peoples as well as the more familiar stories of Greek mythology and Arthurian legend, ", " is a haunting, beautifully written story that breathes new life into ancient customs."], "author": "Catherine Knutsson", "num_pages": "456", "awards": ["Monica Hughes Award for Science Fiction and Fantasy Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-05 00:00:00", "ISBN": "1442401915"},
{"url": "https://www.goodreads.com/book/show/295305.Wolf_Brother", "num_ratings": "19,529", "num_reviews": "1,347", "avg_ratings": 4.16, "genres": ["Fantasy", "Young Adult", "Adventure", "Fiction", "Historical", "Historical Fiction"], "title": "Wolf Brother", "description": ["Six thousand years ago. Evil stalks the land. Only twelve-year-old Torak and his wolf-cub companion can defeat it. Their journey together takes them through deep forests, across giant glaciers, and into dangers they never imagined. ", "In this page-turning, original, and spectacularly told adventure story, Torak and Wolf are joined by an incredible cast of characters as they b", "Six thousand years ago. Evil stalks the land. Only twelve-year-old Torak and his wolf-cub companion can defeat it. Their journey together takes them through deep forests, across giant glaciers, and into dangers they never imagined. ", "In this page-turning, original, and spectacularly told adventure story, Torak and Wolf are joined by an incredible cast of characters as they battle to save their world, in this first book in the Chronicles of Ancient Darkness."], "author": "Michelle Paver", "num_pages": "295", "awards": ["Manchester Book Award  Nominee for Shortlist (2006)", "Rebecca Caudill Young Readers' Book Award Nominee (2009)"], "places": [], "character_names": ["Torak, Ren, Serigala"], "language": "English", "publish_date": "2006-02-21 00:00:00", "ISBN": "0060728272"},
{"url": "https://www.goodreads.com/book/show/12829446-fated", "num_ratings": "15,962", "num_reviews": "1,607", "avg_ratings": 3.68, "genres": ["Fantasy", "Young Adult", "Teen", "Young Adult"], "title": "Fated", "description": ["I shove through the crowd, knocking into girls and bouncing off boys, until one in particular catches me, steadies me.", "I feel so secure, so at home in his arms.", "I melt against his chest-lift my gaze to meet his. Gasping when I stare into a pair of icy blue eyes banded by brilliant flecks of", "I shove through the crowd, knocking into girls and bouncing off boys, until one in particular catches me, steadies me.", "I feel so secure, so at home in his arms.", "I melt against his chest-lift my gaze to meet his. Gasping when I stare into a pair of icy blue eyes banded by brilliant flecks of gold that shine like kaleidoscopes, reflecting my image thousands of times.", "The boy from my dream.", "The one who died in my arms.", "Strange things are happening to Daire Santos. Crows mock her, glowing people stalk her, time stops without warning, and a beautiful boy with unearthly blue eyes haunts all her dreams. Fearing for her daughter’s sanity, Daire’s mother sends her to live with the grandmother she’s never met. A woman who recognizes the visions for what they truly are—the call to her destiny as a Soul Seeker—one who can navigate the worlds between the living and dead.", "There on the dusty plains of Enchantment, New Mexico, Daire sets out to harness her mystical powers. But it’s when she meets Dace, the boy from her dreams, that her whole world is shaken to its core. Now Daire is forced to discover if Dace is the one guy she's meant to be with...or if he’s allied with the enemy she's destined to destroy."], "author": "Alyson Noel", "num_pages": "352", "awards": [], "places": ["Enchantment, New Mexico"], "character_names": ["Daire Santos", "Paloma Santos", "Jennika Lyons", "Django Santos", "Cade Richter", "Dace Whitefeather", "Chepi Whitefeather"], "language": "English", "publish_date": "2012-05-22 00:00:00", "ISBN": "0312664850"},
{"url": "https://www.goodreads.com/book/show/428263.Eclipse", "num_ratings": "1,236,499", "num_reviews": "35,973", "avg_ratings": 3.69, "genres": ["Young Adult", "Fantasy", "Romance", "Paranormal", "Vampires", "Fiction"], "title": "Eclipse", "description": ["As Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge, Bella once again finds herself surrounded by danger. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob - knowing that her decision has the potential to ignite the ageless struggle between vampire and werew", "As Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge, Bella once again finds herself surrounded by danger. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob - knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella has one more decision to make: life or death. But which is which?"], "author": "Stephenie Meyer", "num_pages": "629", "awards": ["Colorado Blue Spruce Young Adult Book Award (2009)", "Teen Buckeye Book Award (2008)"], "places": ["Forks, Washington", "Washington (the state)", "La Push, Washington"], "character_names": ["Edward Cullen", "Jacob Black", "Bella Swan", "Billy Black", "Esme Cullen", "Alice Cullen", "Jasper Hale", "Carlisle Cullen", "Emmett Cullen", "Rosalie Hale", "Charlie Swan"], "language": "English", "publish_date": "2007-08-07 00:00:00", "ISBN": "0316160202"},
{"url": "https://www.goodreads.com/book/show/49041.New_Moon", "num_ratings": "1,261,517", "num_reviews": "44,963", "avg_ratings": 3.52, "genres": ["Young Adult", "Fantasy", "Romance", "Paranormal", "Vampires", "Fiction"], "title": "New Moon", "description": [" ", " ", "For Bella Swan, there is one thing more important than life itself: Edward Cullen. But being in love with a vampire is even more dangerous than Bella could ever have imagined. Edward has already rescued Bella from the clutches of one evil vampire, but now, as their daring relationship threatens all that is near and dear to them, they realize their troubles may be just beginning..."], "author": "Stephenie Meyer", "num_pages": "563", "awards": ["Books I Loved Best Yearly (BILBY) Awards for Older Readers (2010)", "South Carolina Book Award for Young Adult Book Award (2009)", "The Flume: New Hampshire Teen Reader's Choice Award (2008)", "Soaring Eagle Book Award (2007)", "Pacific Northwest Library Association Young Reader's Choice Award for Senior (2009)"], "places": ["Forks, Washington", "La Push, Washington", "Volterra", "Washington (the state)"], "character_names": ["Edward Cullen", "Jacob Black", "Bella Swan", "Billy Black", "Esme Cullen", "Alice Cullen", "Jasper Hale", "Carlisle Cullen", "Emmett Cullen", "Rosalie Hale", "Charlie Swan", "Mike Newton", "Alec (Twilight Saga)", "Jane (Twilight Saga)", "Aro (Twilight Saga)", "Caius (Twilight Saga)", "Marcus (Twilight Saga)"], "language": "English", "publish_date": "2006-09-06 00:00:00", "ISBN": "0316160199"},
{"url": "https://www.goodreads.com/book/show/21535634-crazy-horse-s-girlfriend", "num_ratings": "195", "num_reviews": "43", "avg_ratings": 3.76, "genres": ["Young Adult", "Fiction", "Family", "Realistic Fiction"], "title": "Crazy Horse's Girlfriend", "description": ["Margaritte is a sharp-tongued, drug-dealing, sixteen-year-old Native American floundering in a Colorado town crippled by poverty, unemployment, and drug abuse. She hates the burnout, futureless kids surrounding her and dreams that she and her unreliable new boyfriend can move far beyond the bright lights of Denver that float on the horizon before the daily suffocation of t", "Margaritte is a sharp-tongued, drug-dealing, sixteen-year-old Native American floundering in a Colorado town crippled by poverty, unemployment, and drug abuse. She hates the burnout, futureless kids surrounding her and dreams that she and her unreliable new boyfriend can move far beyond the bright lights of Denver that float on the horizon before the daily suffocation of teen pregnancy eats her alive."], "author": "Erika T. Wurth", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-16 00:00:00", "ISBN": "1940430437"},
{"url": "https://www.goodreads.com/book/show/16163667-culloo", "num_ratings": "186", "num_reviews": "27", "avg_ratings": 4.32, "genres": ["Young Adult", "Adventure", "Childrens", "Middle Grade", "Animals", "Young Adult", "Coming Of Age", "Family"], "title": "Culloo", "description": ["Tala can’t answer the door. The welfare officer is knocking and her father isn’t home again. She needs to find him before her and her young brother get placed in foster care. Their quest brings them to secluded woods where they discover bear poachers are responsible for their father’s disappearance."], "author": "Murielle Cyr", "num_pages": "30", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17675246-house-of-purple-cedar", "num_ratings": "271", "num_reviews": "71", "avg_ratings": 4.05, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Magical Realism", "Historical"], "title": "House of Purple Cedar", "description": ["\"The hour has come to speak of troubled times. It is time we spoke of Skullyville.\" Thus begins Rose Goode's story of her growing up in Indian Territory in pre-statehood Oklahoma. Skullyville, a once-thriving Choctaw community, was destroyed by land-grabbers, culminating in the arson on New Year's Eve, 1896, of New Hope Academy for Girls. Twenty Choctaw girls died, but Ros", "\"The hour has come to speak of troubled times. It is time we spoke of Skullyville.\" Thus begins Rose Goode's story of her growing up in Indian Territory in pre-statehood Oklahoma. Skullyville, a once-thriving Choctaw community, was destroyed by land-grabbers, culminating in the arson on New Year's Eve, 1896, of New Hope Academy for Girls. Twenty Choctaw girls died, but Rose escaped. She is blessed by the presence of her grandmother Pokoni and her grandfather Amafo, both respected elders who understand the old ways. Soon after the fire, the white sheriff beats Amafo in front of the town's people, humiliating him. Instead of asking the Choctaw community to avenge the beating, her grandfather decides to follow the path of forgiveness. And so unwinds this tale of mystery, Indian-style magical realism, and deep wisdom. It's a world where backwoods spiritualism and Bible-thumping Christianity mix with bad guys; a one-legged woman shop-keeper, her oaf of a husband, herbal potions, and shape-shifting panthers rendering justice. Tim Tingle—a scholar of his nation's language, culture, and spirituality—tells Rose's story of good and evil with understanding and even laugh-out-loud Choctaw humor."], "author": "Tim Tingle", "num_pages": "192", "awards": ["American Indian Youth Literature Award for Best Young Adult Book (2016)"], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-18 00:00:00", "ISBN": "1935955241"},
{"url": "https://www.goodreads.com/book/show/42466.Indian_Captive", "num_ratings": "8,376", "num_reviews": "402", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Historical"], "title": "Indian Captive: The Story of Mary Jemison", "description": ["In this classic frontier adventure, Lois Lenski reconstructs the real life story of Mary Jemison, who was captured in a raid as young girl and raised amongst the Seneca Indians. Meticulously researched and illustrated with many detailed drawings, this novel offers an exceptionally vivid and personal portrait of Native American life and customs."], "author": "Lois Lenski", "num_pages": "298", "awards": ["Newbery Medal Nominee (1942)"], "places": ["Pennsylvania"], "character_names": ["Mary (Molly) Jemison, Shagbark, Little Turtle, Shining Star, Squirrel Woman, Earth Woman, Beaver Girl"], "language": null, "publish_date": "1995-02-18 00:00:00", "ISBN": "0064461629"},
{"url": "https://www.goodreads.com/book/show/143555.Tiger_Eyes", "num_ratings": "14,018", "num_reviews": "1,006", "avg_ratings": 3.86, "genres": ["Young Adult", "Fiction", "Childrens", "Realistic Fiction", "Young Adult", "Teen"], "title": "Tiger Eyes", "description": ["Davey has never felt so alone in her life. Her father is dead (shot in a holdup) and now her mother is moving the family to New Mexico to try to recover. Climbing in Los Alamos Canyons, Davey meets mysterous Wolf, who seems to understand the rage and fear she feels. Slowly, with Wolf's help, Davey realizes that she must get on with her life. But when will she be ready to l", "Davey has never felt so alone in her life. Her father is dead (shot in a holdup) and now her mother is moving the family to New Mexico to try to recover. Climbing in Los Alamos Canyons, Davey meets mysterous Wolf, who seems to understand the rage and fear she feels. Slowly, with Wolf's help, Davey realizes that she must get on with her life. But when will she be ready to leave the past behind? Will she ever stop hurting?"], "author": "Judy Blume", "num_pages": "218", "awards": ["Buckeye Children's Book Award for 4-8 (1983)", "Colorado Blue Spruce Young Adult Book Award (1985)", "Dorothy Canfield Fisher Children's Book Award (1983)", "Iowa Teen Award (1985)", "California Young Readers Medal for Middle School/Jr. High (1983)", "National Book Award Finalist for Children's Fiction (Paperback) (1983)"], "places": ["Los Alamos, New Mexico", "New Mexico", "Atlantic City, New Jersey"], "character_names": ["Davey Wexler", "Jason Wexler", "Gwen Wexler", "Lenaya", "Hugh", "Walter Kronick", "Elizabeth \"Bitsy\" Kronick", "Martin \"Wolf\" Ortiz", "Willie Ortiz", "Jane Albertson"], "language": "English", "publish_date": "2005-02-12 00:00:00", "ISBN": "0330398121"},
{"url": "https://www.goodreads.com/book/show/16520900-nocturne-opus-1", "num_ratings": "56", "num_reviews": "13", "avg_ratings": 3.82, "genres": ["Mystery", "Thriller", "Fiction", "Thriller", "Mystery Thriller", "Christian"], "title": "Nocturne, Opus 1: Sea Foam", "description": ["Nocturne, Opus 1: Sea Foam ", "Authored by Norene Moskalski", "Hard Cover 978-0-988-38116-2", "Trade Paperback 978-0-988-38117-9 ", "Kindle, Nook, & Kobo 978-0-988-38118-6", "AN INTERNATIONAL MEDICAL ECO-THRILLER SET IN FRANCE, BELGIUM, SPAIN, ITALY, MONACO, AND THE UNITED STATES...", "A college student collecting water samples is missing...", "Another collapses on a sea foam covered beach...", "Youn", "Nocturne, Opus 1: Sea Foam ", "Authored by Norene Moskalski", "Hard Cover 978-0-988-38116-2", "Trade Paperback 978-0-988-38117-9 ", "Kindle, Nook, & Kobo 978-0-988-38118-6", "AN INTERNATIONAL MEDICAL ECO-THRILLER SET IN FRANCE, BELGIUM, SPAIN, ITALY, MONACO, AND THE UNITED STATES...", "A college student collecting water samples is missing...", "Another collapses on a sea foam covered beach...", "Young adults start dying at coastal resorts...", "And no one knows why...", "THE RACE TO SAVE A GENERATION BEGINS NOW!", "DRS. KATE AND JAKE CONNORS are research professors at the Atlantic University Institute which is dedicated to peacefully resolving international conflicts caused by climate change.", "They also serve as covert agents for a privately-funded, secretive subdivision of the Institute known simply as the Agency.", "The Agency assigns its operatives to investigate and eliminate natural and human threats to the environment. As cover for their missions, the agents pose as visiting professors and graduate students at universities near crisis areas...sometimes walking the thin line between activists and extremists.", "While vacationing at Venice's Lido Beach, Kate and Jake witness one of the first cases of a normally passive waterborne bacterium attacking a person. Along the shores of the Mid-Atlantic States and Coastal Europe, one in ten people begin dying from exposure to the bacteria, and all of them are young adults in their twenties and thirties.", "When the CDC and WHO extrapolate for the bacteria entering the world's aquifers, they predict the death of an entire generation.", "Racing against time and across continents, Kate and Jake must find the cure for Bacillus nocturne, track down the rogue scientist who genetically modified the bacterium, and solve the mystery surrounding its specifically targeted victims…before it contaminates the world's water supply."], "author": "Norene Moskalski", "num_pages": "404", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-30 00:00:00", "ISBN": "0988381176"},
{"url": "https://www.goodreads.com/book/show/1162543.Breaking_Dawn", "num_ratings": "1,147,914", "num_reviews": "45,299", "avg_ratings": 3.69, "genres": ["Young Adult", "Fantasy", "Romance", "Paranormal", "Vampires", "Fiction"], "title": "Breaking Dawn", "description": ["To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, she has endured a tumultuous year of temptation, loss, and strife to reach the ultimate turning point. Her immi", "To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, she has endured a tumultuous year of temptation, loss, and strife to reach the ultimate turning point. Her imminent choice to either join the dark but seductive world of immortals or to pursue a fully human life has become the thread from which the fates of two tribes hangs.", "Now that Bella has made her decision, a startling chain of unprecedented events is about to unfold with potentially devastating and unfathomable, consequences. Just when the frayed strands of Bella's life - first discovered in ", ", then scattered and torn in ", " and ", " - seem ready to heal and knit together, could they be destroyed... forever?"], "author": "Stephenie Meyer", "num_pages": "756", "awards": ["Children's Choice Book Award for Teen Choice Book of the Year (2009)"], "places": ["Forks, Washington", "Washington (the state)"], "character_names": ["Edward Cullen", "Jacob Black", "Bella Swan", "Esme Cullen", "Alice Cullen", "Jasper Hale", "Emmett Cullen", "Rosalie Hale", "Charlie Swan", "Renesmee Cullen"], "language": "English", "publish_date": "2008-08-02 00:00:00", "ISBN": "031606792X"},
{"url": "https://www.goodreads.com/book/show/16128296-sister-raven", "num_ratings": "27", "num_reviews": "8", "avg_ratings": 4.56, "genres": ["Fantasy", "Fiction", "Cultural", "Literature"], "title": "Sister Raven", "description": ["WINNER: Independent Book Award/Fantasy: \"A powerfully written story mixing old magic and Native American lore, Sister Raven kept our genre enthusiast judges captivated page after page.\"", "Bound by magic to Old Mother, Beetle Girl lives a lonely life on the fringes of her Native American society. When forced into the role of Keeper of the Ravens, she must break the bonds of he", "WINNER: Independent Book Award/Fantasy: \"A powerfully written story mixing old magic and Native American lore, Sister Raven kept our genre enthusiast judges captivated page after page.\"", "Bound by magic to Old Mother, Beetle Girl lives a lonely life on the fringes of her Native American society. When forced into the role of Keeper of the Ravens, she must break the bonds of her cruel mother, confront a powerful shape-shifter who threatens to destroy the village, and solve the mystery of her past."], "author": "Karen Rae Levine", "num_pages": "120", "awards": ["Next Generation Indie Book Awards Nominee for Novella (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-14 00:00:00", "ISBN": "147925455X"},
{"url": "https://www.goodreads.com/book/show/30183.Marked", "num_ratings": "391,564", "num_reviews": "13,356", "avg_ratings": 3.79, "genres": ["Young Adult", "Paranormal", "Vampires", "Fantasy", "Fantasy", "Paranormal"], "title": "Marked", "description": [" ", "After a Vampire Tracker Marks her with a crescent moon on her forehead, 16-year-old Zoey Redbird enters the House of Night and learns that she is no average fledgling. She has been Marked as special by the vampyre Goddess Nyx and has affinities for all five elements: Air, Fire Water, Earth and Spirit. But she", " ", "After a Vampire Tracker Marks her with a crescent moon on her forehead, 16-year-old Zoey Redbird enters the House of Night and learns that she is no average fledgling. She has been Marked as special by the vampyre Goddess Nyx and has affinities for all five elements: Air, Fire Water, Earth and Spirit. But she is not the only fledgling at the House of Night with special powers. When she discovers that the leader of the Dark Daughters, the school’s most elite club, is mis-using her Goddess-given gifts, Zoey must look deep within herself for the courage to embrace her destiny – with a little help from her new vampyre friends (or Nerd Herd, as Aphrodite calls them)"], "author": "P.C. Cast", "num_pages": "306", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Young Adult (2007)"], "places": ["United States of America", "Tulsa, Oklahoma", "Oklahoma"], "character_names": ["Zoey Redbird", "Nyx (House of Night)", "Erik Night", "Stevie Rae Johnson", "Neferet", "Heath Luck", "Aphrodite LaFont", "Sylvia Redbird", "Erin Bates", "Shaunee Cole", "Damien Maslin"], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "0312360266"},
{"url": "https://www.goodreads.com/book/show/25600921-into-the-americas", "num_ratings": "260", "num_reviews": "33", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Adventure", "Action", "Young Adult", "Young Adult Romance", "Young Adult", "Romance", "Historical Romance", "Historical", "True Story"], "title": "Into the Americas", "description": ["INTO THE AMERICAS (A novel based on a true story) is a gritty, real-life adventure based on one of history’s greatest survival stories. It was inspired by the diary entries of young English blacksmith John Jewitt during his time aboard the brigantine The Boston and also during his sojourn at Nootka Sound, on North America's western seaboard, from 1802 to 1805.", "Written by fa", "INTO THE AMERICAS (A novel based on a true story) is a gritty, real-life adventure based on one of history’s greatest survival stories. It was inspired by the diary entries of young English blacksmith John Jewitt during his time aboard the brigantine The Boston and also during his sojourn at Nootka Sound, on North America's western seaboard, from 1802 to 1805.", "Written by father-and-son writing team Lance & James Morcan (authors of The World Duology and The Orphan Trilogy), INTO THE AMERICAS is a tale of two vastly different cultures – Indigenous North American and European civilization – colliding head on. It is also a Romeo and Juliet story set in the wilderness.", "Nineteen year-old blacksmith John Jewitt is one of only two survivors after his crewmates clash with the fierce Mowachaht tribe in the Pacific Northwest. A life of slavery awaits John and his fellow survivor, a belligerent American sailmaker, in a village ruled by the iron fist of Maquina, the all-powerful chief. Desperate to taste freedom again, they make several doomed escape attempts over mountains and sea. Only their value to the tribe and John’s relationship with Maquina prevents their captors from killing them.", "As the seasons pass, John ‘goes Indian’ after falling in love with Eu-stochee, a beautiful maiden. This further alienates him from his fellow captive whose defiance leads to violent consequences. In the bloodshed that follows, John discovers another side to himself – a side he never knew existed and a side he detests. His desire to be reunited with the family and friends he left behind returns even stronger than before.", "The stakes rise when John learns Eu-stochee is pregnant. When a final opportunity to escape arises, he must choose between returning to civilization or staying with Eu-stochee and their newborn son."], "author": "Lance Morcan", "num_pages": "542", "awards": [], "places": ["British Columbia", "Vancouver Island, British Columbia", "Nootka Sound, Vancouver Island", "Pacific Northwest", "Canada"], "character_names": ["John Jewitt", "Eu-stochee", "Maquina"], "language": "English", "publish_date": "2015-05-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18922471-east", "num_ratings": "34,256", "num_reviews": "2,139", "avg_ratings": 4.15, "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Retellings", "Fiction"], "title": "East", "description": ["In the rural villages of Norway, there is an ancient belief that children inherit the qualities of the direction in which they are born. Nymah Rose, the last daughter of eight siblings born to a poor mapmaker and his superstitious wife, was a North-born baby. It is said that North-born babies are wild, unpredictable, intelligent, and destined to break their mothers' hearts", "In the rural villages of Norway, there is an ancient belief that children inherit the qualities of the direction in which they are born. Nymah Rose, the last daughter of eight siblings born to a poor mapmaker and his superstitious wife, was a North-born baby. It is said that North-born babies are wild, unpredictable, intelligent, and destined to break their mothers' hearts because they all leave hearth and home to travel to the far ends of the earth. To keep her close, Rose's mother lied and told her she had been born of the obedient and pliable East. But destiny cannot be denied. One day, a great white bear comes to the mapmaker's door to claim Rose's birthright. Everything that comes after, as richly imagined by author Edith Pattou, is the basis for one of the most epic romantic fantasies ever told. ", " is a deftly woven tapestry that melds traditional fairy tale motifs of both ", " and ", ", with the haunting icy lore of medieval northern lands. Told in a changing chorus of voices, including that of Rose, her hopeful brother Neddy, her regretful father, the charmed white bear, and the Troll Queen whose selfish wish is the catalyst that seals Rose's fate, ", " will enchant any and all who venture within its pages. It is a tale for the Ages, and for all ages. Highly recommended. (Ages 12 and older) "], "author": "Edith Pattou", "num_pages": "512", "awards": ["Michigan Library Association Thumbs Up! Award Nominee (2004)", "Rebecca Caudill Young Readers' Book Award Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/303197.Spirited", "num_ratings": "2,430", "num_reviews": "137", "avg_ratings": 3.56, "genres": ["Fantasy", "Fantasy", "Fairy Tales", "Young Adult", "Retellings", "Romance", "Historical", "Historical Fiction"], "title": "Spirited", "description": ["In May 1756 war is formally declared between the British and the French. During this highly dangerous time, Isabella Sevens is travelling with her father to the British stronghold Fort William Henry.", "In the forest, Wusamequin, the young and handsome medicine man, looks to avenge the death of his wife and child at the hands of British soldiers. When Wusamequin spots Isabella", "In May 1756 war is formally declared between the British and the French. During this highly dangerous time, Isabella Sevens is travelling with her father to the British stronghold Fort William Henry.", "In the forest, Wusamequin, the young and handsome medicine man, looks to avenge the death of his wife and child at the hands of British soldiers. When Wusamequin spots Isabella and her father, he alerts his warriors to capture them. But Wusamequin is quite taken with how bravely Isabella battles. He orders the warriors to spare her and her father, and they are dragged back to their village. However, many members of the Mohican tribe still want them to be killed. In a desperate plea to Wusamequin, Isabella vows to stay as his hostage if he lets her father go.", "Holder's colonial \"captured-by-Indians\" romance is an homage to \"Last of the Mohicans\" and a retelling of \"Beauty and the Beast\"."], "author": "Nancy Holder", "num_pages": "255", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "0689870639"},
{"url": "https://www.goodreads.com/book/show/529474.Rifles_for_Watie", "num_ratings": "8,732", "num_reviews": "419", "avg_ratings": 3.9, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Military History", "Civil War"], "title": "Rifles for Watie", "description": ["Jeff Bussey walked briskly up the rutted wagon road toward Fort Leavenworth on his way to join the Union volunteers. It was 1861 in Linn County, Kansas, and Jeff was elated at the prospect of fighting for the North at last.", "In the Indian country south of Kansas there was dread in the air; and the name, Stand Watie, was on every tongue. A hero to the rebel, a devil to the Un", "Jeff Bussey walked briskly up the rutted wagon road toward Fort Leavenworth on his way to join the Union volunteers. It was 1861 in Linn County, Kansas, and Jeff was elated at the prospect of fighting for the North at last.", "In the Indian country south of Kansas there was dread in the air; and the name, Stand Watie, was on every tongue. A hero to the rebel, a devil to the Union man, Stand Watie led the Cherokee Indian Na-tion fearlessly and successfully on savage raids behind the Union lines. Jeff came to know the Watie men only too well.", "He was probably the only soldier in the West to see the Civil War from both sides and live to tell about it. Amid the roar of cannon and the swish of flying grape, Jeff learned what it meant to fight in battle. He learned how it felt never to have enough to eat, to forage for his food or starve. He saw the green fields of Kansas and Okla-homa laid waste by Watie's raiding parties, homes gutted, precious corn deliberately uprooted. He marched endlessly across parched, hot land, through mud and slash-ing rain, always hungry, always dirty and dog-tired.", "And, Jeff, plain-spoken and honest, made friends and enemies. The friends were strong men like Noah Babbitt, the itinerant printer who once walked from Topeka to Galveston to see the magnolias in bloom; boys like Jimmy Lear, too young to carry a gun but old enough to give up his life at Cane Hill; ugly, big-eared Heifer, who made the best sourdough biscuits in the Choctaw country; and beautiful Lucy Washbourne, rebel to the marrow and proud of it. The enemies were men of an-other breed - hard-bitten Captain Clardy for one, a cruel officer with hatred for Jeff in his eyes and a dark secret on his soul.", "This is a rich and sweeping novel-rich in its panorama of history; in its details so clear that the reader never doubts for a moment that he is there; in its dozens of different people, each one fully realized and wholly recognizable. It is a story of a lesser -- known part of the Civil War, the Western campaign, a part different in its issues and its problems, and fought with a different savagery. Inexorably it moves to a dramat-ic climax, evoking a brilliant picture of a war and the men of both sides who fought in it."], "author": "Harold Keith", "num_pages": "352", "awards": ["Newbery Medal (1958)", "Dorothy Canfield Fisher Children's Book Award Nominee (1959)"], "places": ["Kansas"], "character_names": [], "language": "English", "publish_date": "1987-09-25 00:00:00", "ISBN": "006447030X"},
{"url": "https://www.goodreads.com/book/show/803120.Witch_Child", "num_ratings": "14,742", "num_reviews": "1,115", "avg_ratings": 3.79, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fantasy", "Historical", "Fiction", "Paranormal", "Witches"], "title": "Witch Child", "description": ["Enter the world of young Mary Newbury, a world where simply being different can cost a person her life. Hidden until now in the pages of her diary, Mary's startling story begins in 1659, the year her beloved grandmother is hanged in the public s", "Enter the world of young Mary Newbury, a world where simply being different can cost a person her life. Hidden until now in the pages of her diary, Mary's startling story begins in 1659, the year her beloved grandmother is hanged in the public square as a witch. Mary narrowly escapes a similar fate, only to face intolerance and new danger among the Puritans in the New World. How long can she hide her true identity? Will she ever find a place where her healing powers will not be feared?", "Just two weeks after publication, Celia Rees's WITCH CHILD spirited its way onto the Book Sense Children's Only 76 list as one of the Top 10 books that independent booksellers like to handsell. Within a month, this riveting book sold out its first two hardcover printings. Now, Candlewick Press is pleased to announce the publication of WITCH CHILD in paperback."], "author": "Celia Rees", "num_pages": "240", "awards": ["North East Teenage Book Award Nominee (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-04-01 00:00:00", "ISBN": "0763618292"},
{"url": "https://www.goodreads.com/book/show/235186.Wilderness_Days", "num_ratings": "1,590", "num_reviews": "116", "avg_ratings": 4.14, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Romance", "Adventure"], "title": "Wilderness Days", "description": ["\"Remember -- you make your own luck.\" Abandoned on the frontier by her faithless fiance, Jane Peck prepares to head home, only to learn that the Philadelphia life she once knew is no more. But can a proper young lady find happiness as the only woman in a primitive pioneer settlement? Armed with only a finishing-school education and her natural determination, Jane must endu", "\"Remember -- you make your own luck.\" Abandoned on the frontier by her faithless fiance, Jane Peck prepares to head home, only to learn that the Philadelphia life she once knew is no more. But can a proper young lady find happiness as the only woman in a primitive pioneer settlement? Armed with only a finishing-school education and her natural determination, Jane must endure life with her flea-bitten landlord, a perilous manhunt, and the traps and hazards of a blossoming romance.", "Will Jane survive the challenges of the wild, uncharted frontiers of friendship, love, and the Washington Territory?"], "author": "Jennifer L. Holm", "num_pages": "242", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2004-03-02 00:00:00", "ISBN": "0064408817"},
{"url": "https://www.goodreads.com/book/show/235187.The_Claim", "num_ratings": "1,441", "num_reviews": "113", "avg_ratings": 4.1, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Romance", "Adventure"], "title": "The Claim", "description": ["Jane Peck is a nineteenth-century girl with a mind of her own and a handsome suitor who loves her for it. She's outwitted wild animals, vengeful ghosts, and a disloyal fiance, but when her finishing school nemesis, Sally Biddle, invades the Washington Territory, Jane finds everything she holds dear threatened -- including her true love, a rakish sailor named Jehu. As the B", "Jane Peck is a nineteenth-century girl with a mind of her own and a handsome suitor who loves her for it. She's outwitted wild animals, vengeful ghosts, and a disloyal fiance, but when her finishing school nemesis, Sally Biddle, invades the Washington Territory, Jane finds everything she holds dear threatened -- including her true love, a rakish sailor named Jehu. As the Biddles of Philadelphia charm their way into Jane's frontier community, it will take all of the spunk and spit she can muster to protect her land and preserve her dreams. Will Jane's claim on happiness slip away?"], "author": "Jennifer L. Holm", "num_pages": "240", "awards": [], "places": ["Washington Territory"], "character_names": [], "language": "English", "publish_date": "2005-03-01 00:00:00", "ISBN": "0064408825"},
{"url": "https://www.goodreads.com/book/show/18490635-copper-magic", "num_ratings": "139", "num_reviews": "42", "avg_ratings": 3.33, "genres": ["Fantasy", "Historical", "Historical Fiction", "Childrens", "Middle Grade", "Young Adult", "Fiction", "Historical Fiction", "Historical Fantasy", "Historical"], "title": "Copper Magic", "description": ["The year is 1906, and twelve-year-old Violet Blake unearths an ancient talisman—a copper hand—beside the stream where her mother used to harvest medicine. Violet’s touch warms the copper hand and it begins to reveal glimpses of another time. Violet is certain that the copper hand is magic—and if anyone is in need of its powers, it’s Violet. Her mother and adored baby broth", "The year is 1906, and twelve-year-old Violet Blake unearths an ancient talisman—a copper hand—beside the stream where her mother used to harvest medicine. Violet’s touch warms the copper hand and it begins to reveal glimpses of another time. Violet is certain that the copper hand is magic—and if anyone is in need of its powers, it’s Violet. Her mother and adored baby brother are gone, perhaps never to return. Her heartbroken father can’t seem to sustain the failing farm on the outskirts of Pigeon Harbor, on the shores of Lake Michigan.", "Surely the magic of the copper hand can make things right for Violet and restore her fractured family. Violet makes a wish. But her ignorant carelessness unleashes formidable powers—and her attempts to control them jeopardizes not only herself, but the entire town of Pigeon Harbor.", "In ", ", land and waters are alive with memories, intentions, and impulses. Magic alters Violet and brings her gifts—but not always the kind she thinks she needs.", "Julia Mary Gibson brings Violet and her community to life in this debut based on an incident from her own childhood."], "author": "Julia Mary Gibson", "num_pages": "330", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-07-01 00:00:00", "ISBN": "0765332116"},
{"url": "https://www.goodreads.com/book/show/886248.Cabin_on_Trouble_Creek", "num_ratings": "201", "num_reviews": "35", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Adventure", "Adventure", "Survival", "Childrens", "Juvenile"], "title": "Cabin on Trouble Creek", "description": ["Wolves, bears, and a heavy snowstorm are just some of the dangers that Daniel and Will must face&150alone. It's 1803, and the boys and their father have recently arrived in Ohio, following the promise of rich farmland. After clearing enough forest to build a log cabin, Pa sets off for Pennsylvania to fetch the rest of the family, while eleven-year-old Daniel and nine-y", "Wolves, bears, and a heavy snowstorm are just some of the dangers that Daniel and Will must face&150alone. It's 1803, and the boys and their father have recently arrived in Ohio, following the promise of rich farmland. After clearing enough forest to build a log cabin, Pa sets off for Pennsylvania to fetch the rest of the family, while eleven-year-old Daniel and nine-year-old Will stay behind to watch the land. Pa had planned to return within five or six weeks . . . but something must have gone terribly wrong. Now the boys must survive the winter with only an axe, two knives, a sack of cornmeal, and&150most important of all&150their ability to invent and improvise. But are they truly alone in the woods? Daniel thinks that someone is watching them . . ."], "author": "Jean Van Leeuwen", "num_pages": "224", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (2006)"], "places": ["Ohio"], "character_names": [], "language": "English", "publish_date": "2004-06-17 00:00:00", "ISBN": "0803725485"},
{"url": "https://www.goodreads.com/book/show/10224627-shifting", "num_ratings": "1,964", "num_reviews": "302", "avg_ratings": 3.96, "genres": ["Young Adult", "Fantasy", "Fantasy", "Paranormal", "Romance", "Fantasy", "Mythology", "Paranormal", "Shapeshifters"], "title": "Shifting", "description": ["After bouncing from foster home to foster home, Magdalene Mae is transferred to what should be her last foster home in the tiny town of Silver City, New Mexico. Now that she's eighteen and has only a year left in high school, she's determined to stay out of trouble and just be normal. ", "Agreeing to go to the prom with Bridger O'Connell is a good first step. Fitting in has ne", "After bouncing from foster home to foster home, Magdalene Mae is transferred to what should be her last foster home in the tiny town of Silver City, New Mexico. Now that she's eighteen and has only a year left in high school, she's determined to stay out of trouble and just be normal. ", "Agreeing to go to the prom with Bridger O'Connell is a good first step. Fitting in has never been her strong suit, but it's not for the reasons most people would expect-it all has to do with the deep secret that she is a shape shifter. But even in her new home danger lurks, waiting in the shadows to pounce. They are the Skinwalkers of Navajo legend, who have traded their souls to become the animal whose skin they wear-and Maggie is their next target.", "Full of romance, mysticism, and intrigue, this dark take on Navajo legend will haunt readers to the final page."], "author": "Bethany Wiggins", "num_pages": "353", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-27 00:00:00", "ISBN": "0802722806"},
{"url": "https://www.goodreads.com/book/show/34649348-the-marrow-thieves", "num_ratings": "3,386", "num_reviews": "657", "avg_ratings": 4.14, "genres": ["Young Adult", "Fiction", "Science Fiction", "Dystopia", "Cultural", "Canada", "Science Fiction"], "title": "The Marrow Thieves", "description": ["In a futuristic world ravaged by global warming, people have lost the ability to dream, and the dreamlessness has led to widespread madness. The only people still able to dream are North America's Indigenous people, and it is their marrow that holds the cure for the rest of the world. But getting the marrow, and dreams, means death for the unwilling donors. Driven to fligh", "In a futuristic world ravaged by global warming, people have lost the ability to dream, and the dreamlessness has led to widespread madness. The only people still able to dream are North America's Indigenous people, and it is their marrow that holds the cure for the rest of the world. But getting the marrow, and dreams, means death for the unwilling donors. Driven to flight, a fifteen-year-old and his companions struggle for survival, attempt to reunite with loved ones and take refuge from the \"recruiters\" who seek them out to bring them to the marrow-stealing \"factories.\""], "author": "Cherie Dimaline", "num_pages": "231", "awards": ["American Indian Youth Literature Award for Best Young Adult Book (Honor Book) (2018)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général (2017)", "CBC Canada Reads Nominee (2018)", "Kirkus Prize for Young Readers' Literature (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-01 00:00:00", "ISBN": "1770864865"},
{"url": "https://www.goodreads.com/book/show/7896345-the-gathering", "num_ratings": "53,652", "num_reviews": "3,282", "avg_ratings": 4.03, "genres": ["Young Adult", "Fantasy", "Paranormal", "Fantasy", "Fantasy", "Urban Fantasy", "Fantasy", "Supernatural"], "title": "The Gathering", "description": ["Sixteen-year-old Maya is just an ordinary teen in an ordinary town. Sure, she doesn't know much about her background - the only thing she really has to cling to is an odd paw-print birthmark on her hip - but she never really put much thought into who her parents were or how she ended up with her adopted parents in this tiny medical-research community on Vancouver Island.", "Sixteen-year-old Maya is just an ordinary teen in an ordinary town. Sure, she doesn't know much about her background - the only thing she really has to cling to is an odd paw-print birthmark on her hip - but she never really put much thought into who her parents were or how she ended up with her adopted parents in this tiny medical-research community on Vancouver Island.", ".", "Strange things have been happening in this claustrophobic town - from the mountain lions that have been approaching Maya to her best friend's hidden talent for \"feeling\" out people and situations, to the sexy new bad boy who makes Maya feel...", ". Combine that with a few unexplained deaths and a mystery involving Maya's biological parents and it's easy to suspect that this town might have more than its share of skeletons in its closet."], "author": "Kelley Armstrong", "num_pages": "359", "awards": ["Canadian Library Association Young Adult Book Award Nominee (2012)", "White Pine Award for Fiction (2012)"], "places": ["Vancouver Island, British Columbia"], "character_names": ["Maya Delaney", "Daniel Bianchi", "Serena", "Rafael \"Rafe\" Martinez", "Nicole Tillson", "Sam Russo", "Corey Carling", "Hayley Morris", "Annie Martinez"], "language": "English", "publish_date": "2011-04-12 00:00:00", "ISBN": "0061797022"},
{"url": "https://www.goodreads.com/book/show/17946249-killer-of-enemies", "num_ratings": "597", "num_reviews": "171", "avg_ratings": 3.75, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Fantasy", "Apocalyptic", "Post Apocalyptic"], "title": "Killer of Enemies", "description": ["Years ago, seventeen-year-old Apache hunter Lozen and her family lived in a world of haves and have-nots. There were the Ones -- people so augmented with technology and genetic enhancements that they were barely human -- and there was everyone else who served them. Then the Cloud came, and every", "Years ago, seventeen-year-old Apache hunter Lozen and her family lived in a world of haves and have-nots. There were the Ones -- people so augmented with technology and genetic enhancements that they were barely human -- and there was everyone else who served them. Then the Cloud came, and everything changed. Tech stopped working. The world plunged back into a new steam age. The Ones' pets -- genetically engineered monsters -- turned on them and are now loose on the world.", "Lozen was not one of the lucky ones pre-C, but fate has given her a unique set of survival skills and magical abilities. She hunts monsters for the Ones who survived the apocalyptic events of the Cloud, which ensures the safety of her kidnapped family. But with every monster she takes down, Lozen's powers grow, and she connects those powers to an ancient legend of her people. It soon becomes clear to Lozen that she is not just a hired gun. As the legendary Killer of Enemies was in the ancient days of the Apache people, Lozen is meant to be a more than a hunter. Lozen is meant to be a hero."], "author": "Joseph Bruchac", "num_pages": "400", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2014)", "American Indian Youth Literature Award for Best Young Adult Book (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-17 00:00:00", "ISBN": "1620141434"},
{"url": "https://www.goodreads.com/book/show/7936035-cate-of-the-lost-colony", "num_ratings": "1,793", "num_reviews": "218", "avg_ratings": 3.63, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Romance", "Fiction"], "title": "Cate of the Lost Colony", "author": "Lisa M. Klein", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-12 00:00:00", "ISBN": "1599905078"},
{"url": "https://www.goodreads.com/book/show/19370304-the-smell-of-other-people-s-houses", "num_ratings": "6,896", "num_reviews": "1,623", "avg_ratings": 3.99, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Historical", "Contemporary"], "title": "The Smell of Other People's Houses", "description": ["In Alaska, 1970, being a teenager here isn’t like being a teenager anywhere else. Ruth has a secret that she can’t hide forever. Dora wonders if she can ever truly escape where she comes from, even when good luck strikes. Alyce is trying to reconcile her desire to dance, with the life she’s always known on her family’s fishing boat. Hank and his brothers decide it’s safer", "In Alaska, 1970, being a teenager here isn’t like being a teenager anywhere else. Ruth has a secret that she can’t hide forever. Dora wonders if she can ever truly escape where she comes from, even when good luck strikes. Alyce is trying to reconcile her desire to dance, with the life she’s always known on her family’s fishing boat. Hank and his brothers decide it’s safer to run away than to stay home—until one of them ends up in terrible danger.", " ", "Four very different lives are about to become entangled."], "author": "Bonnie-Sue Hitchcock", "num_pages": "240", "awards": ["William C. Morris YA Debut Award Nominee (2017)", "Deutscher Jugendliteraturpreis for Jugendbuch (2017)", "Carnegie Medal Nominee (2017)"], "places": ["Alaska"], "character_names": [], "language": "English", "publish_date": "2016-02-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/448114.Amazing_Grace", "num_ratings": "1,752", "num_reviews": "220", "avg_ratings": 3.86, "genres": ["Young Adult", "Romance", "Contemporary", "Sports and Games", "Sports", "Young Adult", "Teen", "Realistic Fiction"], "title": "Amazing Grace", "author": "Megan Shull", "num_pages": "256", "awards": ["Missouri Gateway Readers Award Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-11 00:00:00", "ISBN": "0786856912"},
{"url": "https://www.goodreads.com/book/show/1190695.The_Night_Wanderer", "num_ratings": "354", "num_reviews": "81", "avg_ratings": 3.44, "genres": ["Fantasy", "Young Adult", "Paranormal", "Vampires", "Fiction", "Horror", "Cultural", "Canada"], "title": "The Night Wanderer", "description": ["Nothing ever happens on the Otter Lake reservation. But when 16-year-old Tiffany discovers her father is renting out her room, she’s deeply upset. Sure, their guest is polite and keeps to himself, but he’s also a little creepy. Little do Tiffany, her father, or even her astute Granny Ruth suspect the truth. The mysterious Pierre L’Errant is actually a vampire, returning to", "Nothing ever happens on the Otter Lake reservation. But when 16-year-old Tiffany discovers her father is renting out her room, she’s deeply upset. Sure, their guest is polite and keeps to himself, but he’s also a little creepy. Little do Tiffany, her father, or even her astute Granny Ruth suspect the truth. The mysterious Pierre L’Errant is actually a vampire, returning to his tribal home after centuries spent in Europe. But Tiffany has other things on her mind: her new boyfriend is acting weird, disputes with her father are escalating, and her estranged mother is starting a new life with somebody else. Fed up and heartsick, Tiffany threatens drastic measures and flees into the bush. There, in the midnight woods, a chilling encounter with L’Errant changes everything ... for both of them. A mesmerizing blend of Gothic thriller and modern coming-of-age novel, The Night Wanderer is unlike any other vampire story."], "author": "Drew Hayden Taylor", "num_pages": "215", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1554510996"},
{"url": "https://www.goodreads.com/book/show/122482.Julie_s_Wolf_Pack", "num_ratings": "5,199", "num_reviews": "138", "avg_ratings": 3.99, "genres": ["Fiction", "Young Adult", "Animals", "Childrens"], "title": "Julie's Wolf Pack", "description": ["From the author of the Newbery Medal–winning ", " and its sequel, Julie, comes a third exciting adventure about the wolf pack that saved the life of a young girl when she was lost on the tundra. Julie has returned to her family, but her wolf pack has a story all its own. Fearless but inexperienced Kapu is now the new leader of the pack. He must protect his w", "From the author of the Newbery Medal–winning ", " and its sequel, Julie, comes a third exciting adventure about the wolf pack that saved the life of a young girl when she was lost on the tundra. Julie has returned to her family, but her wolf pack has a story all its own. Fearless but inexperienced Kapu is now the new leader of the pack. He must protect his wolves from the threats of famine and disease and, at the same time, defend himself from bitter rivals, both inside and outside the pack, who are waiting for their chance to overthrow him. The strength of Kapu's leadership will determine not just the well-being of the pack but its very survival. Jean Craighead George's research and first-hand observation form this engrossing, epic tale that's sure to draw readers into the fascinating world of wolves."], "author": "Jean Craighead George", "num_pages": "208", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (1999)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-02-13 00:00:00", "ISBN": "0064407217"},
{"url": "https://www.goodreads.com/book/show/17564519-walk-on-earth-a-stranger", "num_ratings": "13,090", "num_reviews": "2,555", "avg_ratings": 3.94, "genres": ["Fantasy", "Historical", "Historical Fiction", "Young Adult", "Historical"], "title": "Walk on Earth a Stranger", "description": ["Lee Westfall has a strong, loving family. She has a home she loves and a loyal steed. She has a best friend—who might want to be something more.", "She also has a secret.", "Lee can sense gold in the world around her. Veins deep in the earth. Small nuggets in a stream. Even gold dust caught underneath a fingernail. S", "Lee Westfall has a strong, loving family. She has a home she loves and a loyal steed. She has a best friend—who might want to be something more.", "She also has a secret.", "Lee can sense gold in the world around her. Veins deep in the earth. Small nuggets in a stream. Even gold dust caught underneath a fingernail. She has kept her family safe and able to buy provisions, even through the harshest winters. But what would someone do to control a girl with that kind of power? A person might murder for it.", "When everything Lee holds dear is ripped away, she flees west to California—where gold has just been discovered. Perhaps this will be the one place a magical girl can be herself. If she survives the journey.", "The acclaimed Rae Carson begins a sweeping new trilogy set in Gold Rush-era America, about a young woman with a powerful and dangerous gift."], "author": "Rae Carson", "num_pages": "436", "awards": ["National Book Award Nominee for Young People's Literature (2015)", "Spur Award for Best Western Juvenile Fiction (2016)"], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2015-09-22 00:00:00", "ISBN": "0062242911"},
{"url": "https://www.goodreads.com/book/show/412509.Welcome_to_Junior_High_", "num_ratings": "580", "num_reviews": "28", "avg_ratings": 3.67, "genres": ["Young Adult", "Fiction", "Childrens"], "title": "Welcome to Junior High!", "description": ["Girl Talk #1."], "author": "L.E. Blair", "num_pages": "128", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1993-04-16 00:00:00", "ISBN": "030722001X"},
{"url": "https://www.goodreads.com/book/show/470175.The_Ransom_of_Mercy_Carter", "num_ratings": "1,711", "num_reviews": "160", "avg_ratings": 3.78, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Adventure"], "title": "The Ransom of Mercy Carter", "description": ["Deerfield, Massachusetts is one of the most remote, and therefore dangerous, settlements in the English colonies. In 1704 an Indian tribe attacks the town, and Mercy Carter becomes separated from the rest of her family, some of whom do not survive. Mercy and hundreds of other settlers are herded together and ordered by the Indians to start walking. The grueling journey --", "Deerfield, Massachusetts is one of the most remote, and therefore dangerous, settlements in the English colonies. In 1704 an Indian tribe attacks the town, and Mercy Carter becomes separated from the rest of her family, some of whom do not survive. Mercy and hundreds of other settlers are herded together and ordered by the Indians to start walking. The grueling journey -- three hundred miles north to a Kahnawake Indian village in Canada -- takes more than 40 days. At first Mercy's only hope is that the English government in Boston will send ransom for her and the other white settlers. But days turn into months and Mercy, who has become a Kahnawake daughter, thinks less and less of ransom, of Deerfield, and even of her \"English\" family. She slowly discovers that the \"savages\" have traditions and family life that soon become her own, and Mercy begins to wonder: If ransom comes, will she take it?"], "author": "Caroline B. Cooney", "num_pages": "256", "awards": [], "places": ["Canada"], "character_names": [], "language": "English", "publish_date": "2002-11-12 00:00:00", "ISBN": "0440227755"},
{"url": "https://www.goodreads.com/book/show/122468.Julie", "num_ratings": "4,815", "num_reviews": "127", "avg_ratings": 3.89, "genres": ["Young Adult", "Fiction", "Childrens", "Animals", "Adventure", "Classics", "Animals", "Wolves", "Childrens", "Middle Grade", "Historical", "Historical Fiction", "Adventure", "Survival"], "title": "Julie", "description": ["Julie's decision to return home to her people is not an easy one. But after many months in the wilderness, living in harmony with the wolves that saved her life, she knows the time has come.", "Julie is not prepared, however, for all the changes that she finds. Her father has forsaken many of the old Eskimo traditions. He has given up his sled dogs for a snowmobile, and now lo", "Julie's decision to return home to her people is not an easy one. But after many months in the wilderness, living in harmony with the wolves that saved her life, she knows the time has come.", "Julie is not prepared, however, for all the changes that she finds. Her father has forsaken many of the old Eskimo traditions. He has given up his sled dogs for a snowmobile, and now looks after the musk oxen that serve as the village's income. He will do anything to protect them -- even shoot any wolves that might threaten the herd. Julie knows that, like her father, she must find a way to reconcile the old ways with the new. But how can she do that without putting her beloved wolves in danger?"], "author": "Jean Craighead George", "num_pages": "240", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (1996)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-01-18 00:00:00", "ISBN": "0064405737"},
{"url": "https://www.goodreads.com/book/show/589995.The_Lesser_Blessed", "num_ratings": "836", "num_reviews": "92", "avg_ratings": 3.93, "genres": ["Cultural", "Canada", "Fiction", "Young Adult", "Contemporary"], "title": "The Lesser Blessed", "description": ["A fresh, funny look at growing up Native in the North, by award-winning author Richard Van Camp.", "Larry is a Dogrib Indian growing up in the small northern town of Fort Simmer. His tongue, his hallucinations and his fantasies are hotter than the sun. At sixteen, he loves Iron Maiden, the North and Juliet Hope, the high school \"tramp.\" When Johnny Beck, a Metis from Hay River", "A fresh, funny look at growing up Native in the North, by award-winning author Richard Van Camp.", "Larry is a Dogrib Indian growing up in the small northern town of Fort Simmer. His tongue, his hallucinations and his fantasies are hotter than the sun. At sixteen, he loves Iron Maiden, the North and Juliet Hope, the high school \"tramp.\" When Johnny Beck, a Metis from Hay River, moves to town, Larry is ready for almost anything.", "In this powerful and often very funny first novel, Richard Van Camp gives us one of the most original teenage characters in fiction. Skinny as spaghetti, nervy and self-deprecating, Larry is an appealing mixture of bravado and vulnerability. His past holds many terrors: an abusive father, blackouts from sniffing gasoline, an accident that killed several of his cousins. But through his friendship with Johnny, he’s ready now to face his memories—and his future.", "Marking the debut of an exciting new writer, The Lesser Blessed is an eye-opening depiction of what it is to be a young Native man in the age of AIDS, disillusionment with Catholicism and a growing world consciousness.", "A coming-of-age story that any fan of The Catcher in the Rye will enjoy."], "author": "Richard Van Camp", "num_pages": "128", "awards": ["Deutscher Jugendliteraturpreis for Jugendbuch (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-06 00:00:00", "ISBN": "1550545256"},
{"url": "https://www.goodreads.com/book/show/17659589-the-night-wanderer", "num_ratings": "108", "num_reviews": "44", "avg_ratings": 3.47, "genres": ["Sequential Art", "Graphic Novels", "Paranormal", "Vampires", "Horror", "Young Adult", "Fantasy", "Paranormal"], "title": "The Night Wanderer: A Graphic Novel", "description": ["A mesmerizing blend of vampire thriller and coming-of-age story—now available as a graphic novel. Newcomers to the Otter Lake native reserve don’t go unnoticed for long. So it’s no surprise that 16-year-old Tiffany’s curiosity is piqued when her father rents out her room to a complete stranger. But little do Tiffany, her father, or even her insightful Granny Ruth suspect t", "A mesmerizing blend of vampire thriller and coming-of-age story—now available as a graphic novel. Newcomers to the Otter Lake native reserve don’t go unnoticed for long. So it’s no surprise that 16-year-old Tiffany’s curiosity is piqued when her father rents out her room to a complete stranger. But little do Tiffany, her father, or even her insightful Granny Ruth suspect the truth about their guest. The mysterious Pierre L’Errant has a dreadful secret. After centuries roaming Europe as a brooding vampire, he has returned home to reclaim his Native roots before facing the rising sun and certain death. Meanwhile, Tiffany is deeply troubled—she doubts her boyfriend is being faithful, has escalating disputes with her father, and her estranged mother is starting a new life with somebody else. Fed up and heartsick, Tiffany threatens drastic measures and flees into the bush. There, in the midnight woods, a chilling encounter with L’Errant changes everything as Pierre introduces Tiffany to her proud Native heritage. For Pierre, though, destiny is fixed at sunrise. In this stunning graphic version of the award-winning novel first developed as a play in 1992, artist Mike Wyatt brings a brilliant story to visual life."], "author": "Drew Taylor", "num_pages": "104", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-09-01 00:00:00", "ISBN": "1554515726"},
{"url": "https://www.goodreads.com/book/show/294442.Journey_to_the_River_Sea", "num_ratings": "10,355", "num_reviews": "734", "avg_ratings": 4.16, "genres": ["Historical", "Historical Fiction", "Adventure", "Young Adult", "Childrens", "Fiction"], "title": "Journey to the River Sea", "description": ["Sent in 1910 to live with distant relatives who own a rubber plantation along the Amazon River, English orphan Maia is excited. She believes she is in for brightly colored macaws, enormous butterflies, and \"curtains of sweetly scented orchids trailing from the trees.\" Her British classmates warn her of man-eating alligators and wild, murderous Indians. Unfortunately, no on", "Sent in 1910 to live with distant relatives who own a rubber plantation along the Amazon River, English orphan Maia is excited. She believes she is in for brightly colored macaws, enormous butterflies, and \"curtains of sweetly scented orchids trailing from the trees.\" Her British classmates warn her of man-eating alligators and wild, murderous Indians. Unfortunately, no one cautions Maia about her nasty, xenophobic cousins, who douse the house in bug spray and forbid her from venturing beyond their coiffed compound. Maia, however, is resourceful enough to find herself smack in the middle of more excitement than she ever imagined, from a mysterious \"Indian\" with an inheritance, to an itinerant actor dreading his impending adolescence, to a remarkable journey down the Amazon in search of the legendary giant sloth."], "author": "Eva Ibbotson", "num_pages": "304", "awards": ["Nestlé Smarties Book Prize for 9–11 years (2001)", "Rebecca Caudill Young Readers' Book Award Nominee (2006)"], "places": ["Amazon Rainforest"], "character_names": [], "language": "English", "publish_date": "2003-10-13 00:00:00", "ISBN": "0142501840"},
{"url": "https://www.goodreads.com/book/show/22114263-terminal", "num_ratings": "3,766", "num_reviews": "388", "avg_ratings": 4.36, "genres": ["Young Adult", "Mystery", "Science Fiction"], "title": "Terminal", "description": ["The thrilling finale to Kathy and Brendan Reichs’ New York Times bestselling VIRALS series", "The Virals are back—but they’re not the only pack in town anymore. Terminal finds Tory Brennan—grandniece of the famous forensic anthropologist (star of the hit show Bones)—and the rest of the Morris Island gang tracking a pack of rogue Virals who call themselves the Trinity. The new", "The thrilling finale to Kathy and Brendan Reichs’ New York Times bestselling VIRALS series", "The Virals are back—but they’re not the only pack in town anymore. Terminal finds Tory Brennan—grandniece of the famous forensic anthropologist (star of the hit show Bones)—and the rest of the Morris Island gang tracking a pack of rogue Virals who call themselves the Trinity. The new pack was infected by a strain of supervirus created by Tory’s nemesis and sometimes-crush, Chance Clayborne, who accidentally infected himself, too.", "These red-eyed Virals have openly challenged Tory’s pack for domination of Charleston, bringing on the attention of a shadowy government organization intent on learning the secret to their powers. Surviving it all is going to test the limits of the gang’s abilities."], "author": "Kathy Reichs", "num_pages": "380", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-03 00:00:00", "ISBN": "1595145281"},
{"url": "https://www.goodreads.com/book/show/10564965-my-name-is-not-easy", "num_ratings": "1,578", "num_reviews": "310", "avg_ratings": 3.63, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical"], "title": "My Name is Not Easy", "description": ["Luke knows his I'nupiaq name is full of sounds white people can't say. He knows he'll have to leave it behind when he and his brothers are sent to boarding school hundreds of miles from their Arctic village. At Sacred Heart School things are different. Instead of family, there are students -- Eskimo, Indian, White -- who line up on different sides of the cafeteria like the", "Luke knows his I'nupiaq name is full of sounds white people can't say. He knows he'll have to leave it behind when he and his brothers are sent to boarding school hundreds of miles from their Arctic village. At Sacred Heart School things are different. Instead of family, there are students -- Eskimo, Indian, White -- who line up on different sides of the cafeteria like there's some kind of war going on. And instead of comforting words like tutu and maktak, there's English. Speaking I'nupiaq -- or any native language -- is forbidden. And Father Mullen, whose fury is like a force of nature, is ready to slap down those who disobey. Luke struggles to survive at Sacred Heart. But he's not the only one. There's smart-aleck Amiq, a daring leader -- if he doesn't self destruct; Chickie, blond and freckled, a different kind of outsider; and small quiet Junior, noticing everything and writing it all down. Each has their own story to tell. But once their separate stories come together, things at Sacred Heart School -- and in the wider world -- will never be the same."], "author": "Debby Dahl Edwardson", "num_pages": "248", "awards": ["National Book Award Finalist for Young People's Literature (2011)"], "places": ["Alaska"], "character_names": [], "language": "English", "publish_date": "2011-10-01 00:00:00", "ISBN": "0761459804"},
{"url": "https://www.goodreads.com/book/show/7514925-tiger-lily", "num_ratings": "21,423", "num_reviews": "4,380", "avg_ratings": 3.98, "genres": ["Fantasy", "Young Adult", "Retellings", "Romance", "Fantasy", "Fairy Tales"], "title": "Tiger Lily", "description": ["Before Peter Pan belonged to Wendy, he belonged to the girl with the crow feather in her hair...", "Fifteen-year-old Tiger Lily doesn't believe in love stories or happy endings. Then she meets the alluring teenage Peter Pan in the forbidden woods of Neverland and immediately falls under his spell.", "Peter is unlike anyone she's ever known. Impetuous and brave, he both scares and", "Before Peter Pan belonged to Wendy, he belonged to the girl with the crow feather in her hair...", "Fifteen-year-old Tiger Lily doesn't believe in love stories or happy endings. Then she meets the alluring teenage Peter Pan in the forbidden woods of Neverland and immediately falls under his spell.", "Peter is unlike anyone she's ever known. Impetuous and brave, he both scares and enthralls her. As the leader of the Lost Boys, the most fearsome of Neverland's inhabitants, Peter is an unthinkable match for Tiger Lily. Soon, she is risking everything—her family, her future—to be with him. When she is faced with marriage to a terrible man in her own tribe, she must choose between the life she's always known and running away to an uncertain future with Peter.", "With enemies threatening to tear them apart, the lovers seem doomed. But it's the arrival of Wendy Darling, an English girl who's everything Tiger Lily is not, that leads Tiger Lily to discover that the most dangerous enemies can live inside even the most loyal and loving heart.", "From the New York Times bestselling author of Peaches comes a magical and bewitching story of the romance between a fearless heroine and the boy who wouldn't grow up."], "author": "Jodi Lynn Anderson", "num_pages": "292", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adult (2015)"], "places": ["Neverland"], "character_names": ["Peter Pan", "Tinker Bell", "Tiger Lily", "Tik Tok", "Maeryn", "James Hook", "Smee", "Nibs", "Tootles", "Baby", "Slightly", "Curly", "Pine Sap", "Moon Eye", "Giant", "Aunt Fire", "Aunt Sticky Feet", "Phillip", "Wendy"], "language": "English", "publish_date": "2012-07-03 00:00:00", "ISBN": "0062114611"},
{"url": "https://www.goodreads.com/book/show/21991165-teen-titans", "num_ratings": "1,378", "num_reviews": "237", "avg_ratings": 3.55, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Superheroes", "Dc Comics", "Comics", "Superheroes", "Comics", "Comic Book", "Graphic Novels Comics"], "title": "Teen Titans: Earth One, Volume 1", "description": ["A new original graphic novel in DC's popular ", " series, ", ", Vol. 1 follows in the tradition of ", ", Vol. 1 & ", ", Vol. 1, both of which were #1 ", " bestsellers.", "The Teen Titans never felt like normal kids... but they had no idea how right they were. Their seemingly idyllic Oregon upbringing hides a secr", "A new original graphic novel in DC's popular ", " series, ", ", Vol. 1 follows in the tradition of ", ", Vol. 1 & ", ", Vol. 1, both of which were #1 ", " bestsellers.", "The Teen Titans never felt like normal kids... but they had no idea how right they were. Their seemingly idyllic Oregon upbringing hides a secret; one that will bring killers, shamans, and extraterrestrials down on their heads, and force them into an alliance that could shake the planet to its foundations!", "Superstars Jeff Lemire (", ", ", ") and Terry Dodson (", ") reinvent DC's youngest heroes, with an all-new mythos in an all-new world!"], "author": "Jeff Lemire", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-25 00:00:00", "ISBN": "1401245560"},
{"url": "https://www.goodreads.com/book/show/18079755-exposure", "num_ratings": "5,441", "num_reviews": "422", "avg_ratings": 4.33, "genres": ["Young Adult", "Mystery", "Science Fiction"], "title": "Exposure", "description": [" When twin classmates are abducted from Bolton Prep, Tory and the Virals decide there’s no one better equipped than them to investigate. But the gang has other problems to face. Their powers a", " When twin classmates are abducted from Bolton Prep, Tory and the Virals decide there’s no one better equipped than them to investigate. But the gang has other problems to face. Their powers are growing wilder, and becoming harder to control. Chance Claybourne is investigating the disastrous medical experiment that twisted their DNA. The bonds that unite them are weakening, threatening the future of the pack itself.", " The Virals must decipher the clues and track down a ruthless criminal before he strikes again, all while protecting their secret from prying eyes. And ", " seems to be watching."], "author": "Kathy Reichs", "num_pages": "418", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-04 00:00:00", "ISBN": "1595145303"},
{"url": "https://www.goodreads.com/book/show/1346086.The_Spirit_Line", "num_ratings": "52", "num_reviews": "6", "avg_ratings": 3.5, "genres": ["Realistic Fiction", "Mystery", "Young Adult"], "title": "The Spirit Line", "description": ["Crystal Manyfeathers is caught between two worlds: her life at a modern American high school, and her life with the Dineh, her Navajo people, where spiritual ceremonies and traditions prevail. In deference to her father, Crystal prepares for her upcoming womanhood ceremony. But days before it starts, a valuable rug Crystal has been weaving for the event is mysteriously sto", "Crystal Manyfeathers is caught between two worlds: her life at a modern American high school, and her life with the Dineh, her Navajo people, where spiritual ceremonies and traditions prevail. In deference to her father, Crystal prepares for her upcoming womanhood ceremony. But days before it starts, a valuable rug Crystal has been weaving for the event is mysteriously stolen. Her best friend Henry believes the theft is punishment for Crystal’s stubborn refusal to weave in the spirit line, a required tribute to the Navajo goddess Spider Woman. Despite their spiritual differences, Crystal and Henry launch a bold and dangerous search for the rug. Will they find it in time? And will Crystal at last learn to be at peace with her Navajo identity?"], "author": "David Thurlo", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-12 00:00:00", "ISBN": "0670036455"},
{"url": "https://www.goodreads.com/book/show/1007345.Rain_Is_Not_My_Indian_Name", "num_ratings": "417", "num_reviews": "72", "avg_ratings": 3.45, "genres": ["Young Adult", "Fiction", "Childrens", "Middle Grade", "Realistic Fiction", "Contemporary", "Young Adult", "Teen", "Death"], "title": "Rain Is Not My Indian Name", "description": ["It's been six months since her best friend died, and up until now Rain has succeeded in shutting herself off from the world. But when controversy arises around her aunt Georgia's Indian Camp in their mostly white midwestern community, Rain decides to face the outside world again—at least through the lens of her camera.", "Hired by her town newspaper to photograph the campers,", "It's been six months since her best friend died, and up until now Rain has succeeded in shutting herself off from the world. But when controversy arises around her aunt Georgia's Indian Camp in their mostly white midwestern community, Rain decides to face the outside world again—at least through the lens of her camera.", "Hired by her town newspaper to photograph the campers, Rain soon finds that she has to decide how involved she wants to become in Indian Camp. Does she want to keep a professional distance from the intertribal community she belongs to? And just how willing is she to connect with the campers after her great loss?"], "author": "Cynthia Leitich Smith", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-06-19 00:00:00", "ISBN": "0688173977"},
{"url": "https://www.goodreads.com/book/show/1554507.Boston_Jane_An_Adventure", "num_ratings": "3,652", "num_reviews": "350", "avg_ratings": 3.99, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Adventure", "Fiction", "Romance"], "title": "Boston Jane - An Adventure", "description": ["For use in schools and libraries only. Jane must learn to rely on herself when her fiance disappears, stranding her in the wilds of the Pacific Northwest frontier."], "author": "Jennifer L. Holm", "num_pages": "273", "awards": ["WILLA Literary Award Nominee for Children's/Young Adult (Finalist) (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-08-16 00:00:00", "ISBN": "0439405033"},
{"url": "https://www.goodreads.com/book/show/940388.Monkey_Beach", "num_ratings": "3,856", "num_reviews": "331", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "Canada"], "title": "Monkey Beach", "description": [" combines both joy and tragedy in a harrowing yet restrained story of grief and survival, and of a family on the edge of heartbreak. In the first English-language novel to be published by a Haisla writer, Eden Robinson offers a rich celebration of life in the Native settlement of Kitamaat, on the coast of British Columbia. ", "The story grips the reader from the be", " combines both joy and tragedy in a harrowing yet restrained story of grief and survival, and of a family on the edge of heartbreak. In the first English-language novel to be published by a Haisla writer, Eden Robinson offers a rich celebration of life in the Native settlement of Kitamaat, on the coast of British Columbia. ", "The story grips the reader from the beginning. It is the morning after the narrator’s brother has gone missing at sea; the mood is tense in the family house, as speculations remain unspoken. Jimmy is a prospective Olympic swimmer, seventeen years old and on the edge of proposing to his beautiful girlfriend Karaoke. As his elder sister, Lisa, faces possible disaster, she chain-smokes and drifts into thoughts of their lives so far. She recalls the time when she and Jimmy saw the sasquatch, or b’gwus – and this sighting introduces the novel's fascinating undercurrent of characters from the spirit world. These ghostly presences may strike the reader as mysterious or frightening, but they provide Lisa with guidance through a difficult coming of age.", "In and out of the emergency room as a child, Lisa is a fighter. Her smart mouth and temper constantly threaten to land her in serious trouble. Those who have the most influence on her are her stubbornly traditional, machete-wielding grandmother, and her wild, passionate, political Uncle Mick, who teaches her to make moose calls. When they empty fishing nets together, she pretends she doesn’t feel the jellyfish stinging her young hands – she’s Uncle Mick’s “little warrior.” ", "We watch Lisa leave her teenage years behind as she waits for news of her younger brother. She reflects on the many rich episodes of their lives – so many of which take place around the water, reminding us of the news she fears, and revealing the menacing power of nature. But Lisa has a special recourse – a “gift” that enables her to see and hear spirits, and ask for their help.", "Eden Robinson’s first novel, was nominated for Canada’s two largest literary prizes: the Giller Prize and the Governor General’s Literary Award. The book was also published in Great Britain, the United States and Germany, and was a Canadian bestseller for many weeks. ", "is beautifully written, in prose that is simple and subtle, bold and vivid, and pervaded by humour.", "Robinson fills her novel with details of Haisla culture and the rich wildlife surrounding Kitamaat. She uses traditional elements of storytelling – such as dreams, and people’s ties to nature – but also demystifies Native beliefs, simultaneously peeling away and intensifying the mystery surrounding spirits. Ancient rituals are shown as part of the reality of a modern Native community, along with Kraft Dinner and TV soaps and the legacy of residential schools. Robinson’s previous book of stories, ", ", was remarked upon for being brutally honest, featuring rapists and drunks and drug dealers, psychopaths and sadists – proving to ", " ", " that “Canadians are as weird and violent as anyone else.” ", " is just as honest, but only hints at the darker elements. In the words of the author, “None of the characters are bad. They’re just reacting like anyone else to situations of loss and death.”"], "author": "Eden Robinson", "num_pages": "374", "awards": ["Scotiabank Giller Prize Nominee (2000)", "Ethel Wilson Fiction Prize (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-01-09 00:00:00", "ISBN": "0676973221"},
{"url": "https://www.goodreads.com/book/show/17623990-code", "num_ratings": "8,307", "num_reviews": "682", "avg_ratings": 4.25, "genres": ["Young Adult", "Science Fiction"], "title": "Code", "description": ["Tory and the rest of the Virals are put to the ultimate test when they find a geocache containing an ornate puzzle box. Shelton decodes the cipher inside, only to find more tantalizing clues left by \"The Gamemaster.\" A second, greater geocache is within reach—if the Virals are up to the challenge. But the hunt takes a dark turn when Tory locates the other box—it contains a", "Tory and the rest of the Virals are put to the ultimate test when they find a geocache containing an ornate puzzle box. Shelton decodes the cipher inside, only to find more tantalizing clues left by \"The Gamemaster.\" A second, greater geocache is within reach—if the Virals are up to the challenge. But the hunt takes a dark turn when Tory locates the other box—it contains a fake bomb, along with a sinister proposal from The Gamemaster. Now, the real game has begun: another bomb is out there—a real one—and the clock is ticking."], "author": "Kathy Reichs", "num_pages": "432", "awards": [], "places": [], "character_names": ["Ben Blue", "Hiram Stolowitski", "Victoria Brennan", "Shelton Devers"], "language": "English", "publish_date": "2013-12-05 00:00:00", "ISBN": "1595145729"},
{"url": "https://www.goodreads.com/book/show/32353.New_Mutants_Classic_Vol_1", "num_ratings": "608", "num_reviews": "33", "avg_ratings": 3.76, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Superheroes", "Marvel", "Marvel", "X Men", "Comics", "Superheroes", "Comics", "Comic Book"], "title": "New Mutants Classic, Vol. 1", "description": ["Cannonball. Sunspot. Moonstar. Karma. Rahne. Teenagers, thrown together by the one thing they had in common -- the X-Factor in their genes that made them different, made them mutants. Relive the adventures of the team that will come to be known as X-Force... if they survive. Collects Marvel Graphic Novel #4, New Mutants #1-7 and Uncanny X-Men #167."], "author": "Chris Claremont", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-03 00:00:00", "ISBN": "0785121943"},
{"url": "https://www.goodreads.com/book/show/3605301-buffalo-gal", "num_ratings": "372", "num_reviews": "55", "avg_ratings": 4.3, "genres": ["Young Adult", "Historical", "Historical Fiction", "Childrens", "Fiction", "Romance", "Childrens", "Middle Grade", "Westerns"], "title": "Buffalo Gal", "description": ["In 1904, Amanda grudgingly joins a crusade to save the buffalo."], "author": "Bill Wallace", "num_pages": "185", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (1994)"], "places": [], "character_names": [], "language": "English", "publish_date": "1992-04-02 00:00:00", "ISBN": "0823409430"},
{"url": "https://www.goodreads.com/book/show/386286.Julie_of_the_Wolves", "num_ratings": "50,103", "num_reviews": "1,478", "avg_ratings": 3.8, "genres": ["Young Adult", "Fiction", "Childrens", "Classics", "Historical", "Historical Fiction"], "title": "Julie of the Wolves", "description": ["Miyax, like many adolescents, is torn. But unlike most, her choices may determine whether she lives or dies. At 13, an orphan, and unhappily married, Miyax runs away from her husband's parents' home, hoping to reach San Francisco and her pen pal. But she becomes lost in the vast Alaskan tundra, with no food, no shelter, and no idea which is the way to safety. Now, more tha", "Miyax, like many adolescents, is torn. But unlike most, her choices may determine whether she lives or dies. At 13, an orphan, and unhappily married, Miyax runs away from her husband's parents' home, hoping to reach San Francisco and her pen pal. But she becomes lost in the vast Alaskan tundra, with no food, no shelter, and no idea which is the way to safety. Now, more than ever, she must look hard at who she really is. Is she Miyax, Eskimo girl of the old ways? Or is she Julie (her \"gussak\"-white people-name), the modernized teenager who must mock the traditional customs? And when a pack of wolves begins to accept her into their community, Miyax must learn to think like a wolf as well. If she trusts her Eskimo instincts, will she stand a chance of surviving?"], "author": "Jean Craighead George", "num_pages": "176", "awards": ["Newbery Medal (1973)", "Zilveren Griffel (1975)", "Dorothy Canfield Fisher Children's Book Award Nominee (1974)", "Deutscher Jugendliteraturpreis for Jugendbuch (1975)", "California Young Readers Medal Nominee for Intermediate (1977)", "National Book Award Finalist for Children's Books (1973)"], "places": ["Alaska"], "character_names": ["Miyax", "Amaroq", "Kapugen"], "language": "English", "publish_date": "2016-01-05 00:00:00", "ISBN": "0064400581"},
{"url": "https://www.goodreads.com/book/show/16166400-shadow-of-time", "num_ratings": "850", "num_reviews": "193", "avg_ratings": 3.69, "genres": ["Romance", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Romance", "Paranormal Romance"], "title": "Shadow of Time", "description": ["An alternate cover for this ISBN can be found ", ".", "All Hannah needs is a nice and quiet vacation after her first year of teaching French at a high school. She joins her brother Ben for the summer in their mom’s log cabin in Arizona. There, she meets Josh again, Ben’s childhood friend from the Navajo reservation. The little boy from the rez has grown up fast, and Hannah can", "An alternate cover for this ISBN can be found ", ".", "All Hannah needs is a nice and quiet vacation after her first year of teaching French at a high school. She joins her brother Ben for the summer in their mom’s log cabin in Arizona. There, she meets Josh again, Ben’s childhood friend from the Navajo reservation. The little boy from the rez has grown up fast, and Hannah can’t help but feeling more for him than just friendship. ", "But fate apparently has something else in store for her. And it’s not peace and quiet. Night after night, Hannah is plagued by strange nightmares about the past of Navajo Nation and terrifying shadows chasing her. They seem to come closer – and why is Josh always present in her dreams? ", "Sometimes, the past has a way of catching up with you."], "author": "Jen Minkman", "num_pages": "400", "awards": ["Kindle Book Award Nominee for Romance (Semi-Finalist) (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-01 00:00:00", "ISBN": "1480242233"},
{"url": "https://www.goodreads.com/book/show/10454578-nokosee-and-stormy", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 3.33, "genres": ["Young Adult"], "title": "Nokosee and Stormy: Love and Bullets", "description": ["You're Stormy Jones, a pregnant 17-year-old punk rock chick with \"sky eyes\" and a pink tipped blond Mohawk with spear tats on each side of your shaved head. You're racing a stolen chopper that belongs to the chief of the Seminoles and it seems half the cops in south Florida are hot on your tail from land, sea, and air. You're wanted by the Feds for domestic terrorism and y", "You're Stormy Jones, a pregnant 17-year-old punk rock chick with \"sky eyes\" and a pink tipped blond Mohawk with spear tats on each side of your shaved head. You're racing a stolen chopper that belongs to the chief of the Seminoles and it seems half the cops in south Florida are hot on your tail from land, sea, and air. You're wanted by the Feds for domestic terrorism and you and your Seminole/Cuban boyfriend Nokosee just made the FBI's Ten Most Wanted List but it's all a big misunderstanding. You didn't mean for anyone to get hurt. If it counts for anything, you did it for love; to love and protect Nokosee and the baby he put inside you. He's the first of the New Seminole groomed by his nutcase dad Busimanolotome Osceola to wage an eco-war on the \"Outside\" that will restore south Florida to its natural state. But that's not you. You're not a tree hugger, you're a boy hugger, a one boy hugger and it's not your fault people are dying all around you. In this sequel to NOKOSEE: RISE OF THE NEW SEMINOLE, Stormy Jones fights to overcome everything thrown at her and does it in a way that would make all girls proud-- not in a superhuman way or through the assistance of some heroic act of a man or monster but by her own means, stumbling as it were through raging hormones, bullets, and a host of bad decisions toward a seen it all/done it all stoic-eyed adulthood and motherhood by the time she's 18. You can learn more at http: //"], "author": "Holatte-Sutv Turwv Osceola", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "Korean", "publish_date": "2011-08-16 00:00:00", "ISBN": "096344994X"},
{"url": "https://www.goodreads.com/book/show/8709640-seizure", "num_ratings": "12,898", "num_reviews": "922", "avg_ratings": 4.16, "genres": ["Young Adult", "Mystery", "Science Fiction", "Fiction"], "title": "Seizure", "description": ["Ever since Tory Brennan and her friends rescued Cooper, a kidnapped wolf pup with a rare strain of canine parvovirus, they've turned from regular kids into a crime-solving pack. But now the very place that brought them together - the Loggerhead Island Research Institute - is out of funding and will have to shut down. That is, unless the Virals can figure out a way to save", "Ever since Tory Brennan and her friends rescued Cooper, a kidnapped wolf pup with a rare strain of canine parvovirus, they've turned from regular kids into a crime-solving pack. But now the very place that brought them together - the Loggerhead Island Research Institute - is out of funding and will have to shut down. That is, unless the Virals can figure out a way to save it.", "So when Tory learns of an old Charleston legend about a famous she-pirate, Anne Bonney, whose fortune was never found, she can't believe her luck - buried treasure is exactly what she needs to save the Institute on Loggerhead! Trouble is, she and her friends aren't the only ones looking for it. And this time, the Virals' special powers may not be enough to dig them out of trouble . . ."], "author": "Kathy Reichs", "num_pages": "496", "awards": ["Golden Duck Award Nominee for Hal Clement Award for Young Adult (2012)"], "places": [], "character_names": ["Tory Brennan", "Ben Blue", "Hiram Stolowitski", "Shelton Devers"], "language": "English", "publish_date": "2011-10-18 00:00:00", "ISBN": "0099543885"},
{"url": "https://www.goodreads.com/book/show/1484677.Dixie_In_The_Big_Pasture", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 3.5, "genres": [], "title": "Dixie In The Big Pasture", "description": ["In 1908 thirteen-year-old Dixie's new life on the Oklahoma frontier is complicated by a war of nerves between her and John Three, a young Kiowa Indian who insists that his pony was sold to her without his permission."], "author": "Belinda Hurmence", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-03-01 00:00:00", "ISBN": "0395520029"},
{"url": "https://www.goodreads.com/book/show/10495679-kagagi", "num_ratings": "15", "num_reviews": "4", "avg_ratings": 3.4, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics"], "title": "Kagagi: The Raven", "description": ["Matthew Carver is an average 16-year-old kid dealing with normal teenage stuff. Or, at least, he was yesterday. Today he found out that he has inherited an ancient power and responsibility - the age-old evil known as the Windigo has returned, and Matthew Carver must defeat it! He is Kagagi: The Raven!"], "author": "Jay Odjick", "num_pages": "78", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-01 00:00:00", "ISBN": "1926914295"},
{"url": "https://www.goodreads.com/book/show/17071488-if-i-ever-get-out-of-here", "num_ratings": "1,815", "num_reviews": "375", "avg_ratings": 3.92, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Realistic Fiction", "Music"], "title": "If I Ever Get Out of Here", "description": ["Lewis \"Shoe\" Blake is used to the joys and difficulties of life on the Tuscarora Indian reservation in 1975: the joking, the Fireball games, the snow blowing through his roof. What he's not used to is white people being nice to him -- people like George Haddonfield, whose family recently moved to town with the Air Force. As the boys connect through their mutual passion for", "Lewis \"Shoe\" Blake is used to the joys and difficulties of life on the Tuscarora Indian reservation in 1975: the joking, the Fireball games, the snow blowing through his roof. What he's not used to is white people being nice to him -- people like George Haddonfield, whose family recently moved to town with the Air Force. As the boys connect through their mutual passion for music, especially the Beatles, Lewis has to lie more and more to hide the reality of his family's poverty from George. He also has to deal with the vicious Evan Reininger, who makes Lewis the special target of his wrath. But when everyone else is on Evan's side, how can he be defeated? And if George finds out the truth about Lewis's home -- will he still be his friend?", "Acclaimed adult author Eric Gansworth makes his YA debut with this wry and powerful novel about friendship, memory, and the joy of rock 'n' roll."], "author": "Eric Gansworth", "num_pages": "368", "awards": ["American Indian Youth Literature Award for Best Young Adult Book (Honor Book) (2014)", "Alabama Library Association Children's Book of the Year Nominee for 6-8 Fiction (2014)"], "places": ["Niagara County, New York"], "character_names": [], "language": "English", "publish_date": "2013-07-30 00:00:00", "ISBN": "0545417309"},
{"url": "https://www.goodreads.com/book/show/843604.Meet_Kaya", "num_ratings": "2,803", "num_reviews": "116", "avg_ratings": 3.91, "genres": ["Historical", "Historical Fiction", "Childrens", "Historical", "Fiction"], "title": "Meet Kaya", "description": ["Kaya dreams of racing her beautiful mare Steps High. Her father warns her that the horse isn't ready, but when a pesky boy insults Steps High, Kaya accepts his challenge to race. As they ride, Kaya loses sight of her little brothers. Her carelessness earns her a nickname that her friends won't let her forget."], "author": "Janet Beeler Shaw", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-08-16 00:00:00", "ISBN": "1584854235"},
{"url": "https://www.goodreads.com/book/show/24347852-algonquin-spring", "num_ratings": "11", "num_reviews": "5", "avg_ratings": 3.64, "genres": ["Did Not Finish", "Historical", "Historical Fiction"], "title": "Algonquin Spring", "description": ["Six years earlier in the fourteenth century, Mahingan and his tribe fought the Battle of the Falls against the Haudenosaunee. There were many losses, and Mahingan thought he had lost his wife, Wàbananang (Morning Star). But after the battle, he learned she was still alive, taken c", "Six years earlier in the fourteenth century, Mahingan and his tribe fought the Battle of the Falls against the Haudenosaunee. There were many losses, and Mahingan thought he had lost his wife, Wàbananang (Morning Star). But after the battle, he learned she was still alive, taken captive by the Haudenosaunee. Now on a desperate quest to rescue her, Mahingan and his small family are wintering north of the Ottawa River near present-day Lachute, Quebec. If they are to have any hope of recovering Wàbananang, though, they must first survive until spring.", "At the same time, over 2,000 kilometres away in present-day Newfoundland, events taking place will affect four Native tribes: Mahingan’s, a group of Mi’kmaq, a Beothuk group, and a band of Haudenosaunee warriors led by Mahingan’s old nemesis, Ò:nenhste Erhar (Corn Dog) — a fierce Mohawk War Chief and Wàbananang’s captor.", "Along the way, Mahingan’s brother, Mitigomij, will reveal his true self and powers. Then, an influential Mi’kmaq legend puts a new, powerful twist on events, and threatens to send things spiraling out of Mahingan’s control."], "author": "Rick Revelle", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-10-10 00:00:00", "ISBN": "1459730631"},
{"url": "https://www.goodreads.com/book/show/425098.A_Thief_of_Time", "num_ratings": "10,052", "num_reviews": "405", "avg_ratings": 4.06, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "A Thief of Time", "description": ["A noted anthropologist vanishes at a moonlit Indian ruin where \"thieves of time\" ravage sacred ground for profit. When two corpses appear amid stolen goods and bones at an ancient burial site, Navajo Tribal Policemen Lt. Joe Leaphorn and Officer Jim Chee must plunge into the past to unearth the astonishing truth behind a mystifying series of horrific murders."], "author": "Tony Hillerman", "num_pages": "352", "awards": ["Macavity Award for Best Mystery Novel (1989)", "Anthony Award Nominee for Best Novel (1989)", "Edgar Award Nominee for Best Novel (1989)"], "places": [], "character_names": ["Joe Leaphorn", "Jim Chee", "Eleanor Friedman-Bernal", "Maxie Davis", "Randy Elliott", "Slick Nakai", "Pete Etcitty", "Richard DuMont", "Harrison Houk", "Largo"], "language": "English", "publish_date": "1990-01-05 00:00:00", "ISBN": "0061000043"},
{"url": "https://www.goodreads.com/book/show/20648668-mysteries-of-the-red-coyote-inn", "num_ratings": "77", "num_reviews": "17", "avg_ratings": 4.9, "genres": ["Mystery", "Young Adult"], "title": "Mysteries of the Red Coyote Inn", "description": ["Want to check in at the Red Coyote Inn? You may want to check out it’s shady past which includes: ghosts, sightings of supernatural creatures, and guests encountering bizarre accidents. This charming inn is nestled out in the Sonoran Desert on the Apace Trail close to the foreboding Superstition Mountains which are said to be the home of the legendary Lost Dutchman Mine. S", "Want to check in at the Red Coyote Inn? You may want to check out it’s shady past which includes: ghosts, sightings of supernatural creatures, and guests encountering bizarre accidents. This charming inn is nestled out in the Sonoran Desert on the Apace Trail close to the foreboding Superstition Mountains which are said to be the home of the legendary Lost Dutchman Mine. Some say the inn sits at the top of an energy vortex that has ties to the mine. And this just may be the reason for all of the paranormal activity .You may find some of the guests who come to the inn are as strange as the inn itself.", "The inn was a gift left to a family of three – a divorced mother, daughter and son - one of those being Dean Banks, a young fifteen year old boy who comes to find out he has inherited a supernatural gift of power from a long ago Apache ancestor and is destined to be the Guardian of the mine. He feels this is more of a curse than a gift. With these powers come some pretty unnatural occurrences for Dean as he acquires the ability to gain superhuman strength along with mystical powers which enable him to thwart any attempts from anyone who tries to discover the whereabouts of the mine. Dean fears his new responsibility and also is terrified of the possibility of harming someone. He tries to remain a normal teenage boy as he enjoys his life riding in the desert and hanging out with his newfound friends, which leads him to befriend a mysterious old miner who holds the key to some of Dean’s past . One guest in particular is onto Dean’s secrets and is out to destroy the Red Coyote Inn and possibly Dean himself."], "author": "Lorraine Carey", "num_pages": "182", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18217217-eleanor-mcgraw-a-pony-named-mouse-and-a-boy-called-fire", "num_ratings": "81", "num_reviews": "27", "avg_ratings": 4.53, "genres": ["Animals", "Horses", "Young Adult", "Contemporary", "Romance"], "title": "Eleanor McGraw, a Pony Named Mouse and a Boy Called Fire (Hawthorne Horses 1)", "description": ["Eleanor McGraw, vertically challenged, empathic and sharp daughter of folk musician Isabel Payne and a world famous rock guitarist, wakes up a few days shy of her 14th birthday to a life more ordinary. After years of vagabonding around the world alongside a series of chaotic father figures, they are settling down with quiet Kjell, a Swedish dentist, on the outskirts of a s", "Eleanor McGraw, vertically challenged, empathic and sharp daughter of folk musician Isabel Payne and a world famous rock guitarist, wakes up a few days shy of her 14th birthday to a life more ordinary. After years of vagabonding around the world alongside a series of chaotic father figures, they are settling down with quiet Kjell, a Swedish dentist, on the outskirts of a small town on the South coast of England. While exploring her new home’s surroundings, Eleanor discovers a solitary pony in a deserted plot of grazing land. As she befriends the animal and meets scar-faced, foul-mouthed, 16-year-old Pike she is slowly drawn into another family’s tragic past and finds herself at the centre of a decision between life or death, past or future, beginning or end. ", " is a contemporary book about people, ponies, patchwork families, friendship and love, suitable for anyone - horse rider or not - between 14 and 104. ", "Contains some strong language."], "author": "Katharina Marcus", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-20 00:00:00", "ISBN": "149031234X"},
{"url": "https://www.goodreads.com/book/show/7800188-virals", "num_ratings": "33,832", "num_reviews": "2,749", "avg_ratings": 3.94, "genres": ["Young Adult", "Mystery", "Science Fiction"], "title": "Virals", "description": ["Tory Brennan, niece of acclaimed forensic anthropologist Temperance Brennan (of the Bones novels and hit TV show), is the leader of a ragtag band of teenage \"sci-philes\" who live on a secluded island off the coast of South Carolina. When the group rescues a dog caged for medical testing on a nearby island, they are exposed to an experimental strain of canine parvovirus tha", "Tory Brennan, niece of acclaimed forensic anthropologist Temperance Brennan (of the Bones novels and hit TV show), is the leader of a ragtag band of teenage \"sci-philes\" who live on a secluded island off the coast of South Carolina. When the group rescues a dog caged for medical testing on a nearby island, they are exposed to an experimental strain of canine parvovirus that changes their lives forever.", "As the friends discover their heightened senses and animal-quick reflexes, they must combine their scientific curiosity with their newfound physical gifts to solve a cold-case murder that has suddenly become very hot if they can stay alive long enough to catch the killer's scent.", "Fortunately, they are now more than friends. They're a pack. They are ", "."], "author": "Kathy Reichs", "num_pages": "454", "awards": ["Agatha Award Nominee for Best Childrens Young Adult (2010)"], "places": ["Charleston, South Carolina"], "character_names": ["Temperance Brennan", "Tory Brennan", "Ben Blue", "Hiram Stolowitski", "Shelton Devers"], "language": "English", "publish_date": "2010-11-02 00:00:00", "ISBN": "1595143424"},
{"url": "https://www.goodreads.com/book/show/999560.Waiting_for_Deliverance", "num_ratings": "47", "num_reviews": "5", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Young Adult", "Teen", "Romance", "Historical Romance", "Historical"], "title": "Waiting for Deliverance", "description": ["In this gripping tale set in 1793, 15-year-old Deliverance Pelton and her younger cousin are sold at a pauper auction after their family is killed on a flooding river. Their new master was raised by Seneca Indians, and he sends Livy (Deliverance) to his Seneca relatives to teach spinning. Livy is terrified; she has been raised to believe that there's nothing more dangerous", "In this gripping tale set in 1793, 15-year-old Deliverance Pelton and her younger cousin are sold at a pauper auction after their family is killed on a flooding river. Their new master was raised by Seneca Indians, and he sends Livy (Deliverance) to his Seneca relatives to teach spinning. Livy is terrified; she has been raised to believe that there's nothing more dangerous than an Indian. But then love blossoms between her and a young Seneca man -- and leads to great danger for them both. This is a moving personal story about a spirited girl. It is also a thought-provoking exploration of the relations between Americans, ex-Tories, and Native Americans in the wake of the American Revolution."], "author": "Betsy Urban", "num_pages": "186", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-01 00:00:00", "ISBN": "0531303101"},
{"url": "https://www.goodreads.com/book/show/30257957-son-of-a-trickster", "num_ratings": "2,040", "num_reviews": "395", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Canada", "Fantasy", "Young Adult"], "title": "Son of a Trickster", "description": ["Everyone knows a guy like Jared: the burnout kid in high school who sells weed cookies and has a scary mom who's often wasted and wielding some kind of weapon. Jared does smoke and drink too much, and he does make the best cookies in town, and his mom is a mess, but he's also a kid who has an immense capacity for compassion and an impulse to watch over people more than twice his age, and he can't rely on anyone for consistent love and support, except for his flatulent pit bull, Baby Killer (he calls her Baby)--and now she's dead. ", "Jared can't count on his mom to stay sober and stick around to take care of him. He can't rely on his dad to pay the bills and support his new wife and step-daughter. Jared is only sixteen but feels like he is the one who must stabilize his family's life, even look out for his elderly neighbours. But he struggles to keep everything afloat...and sometimes he blacks out. And he puzzles over why his maternal grandmother has never liked him, why she says he's the son of a trickster, that he isn't human. Mind you, ravens speak to him--even when he's not stoned. ", "You think you know Jared, but you don't."], "author": "Eden Robinson", "num_pages": "336", "awards": ["Scotiabank Giller Prize Nominee (2017)", "Ethel Wilson Fiction Prize Nominee (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-07 00:00:00", "ISBN": "0345810783"},
{"url": "https://www.goodreads.com/book/show/24382227-dreamland-burning", "num_ratings": "3,919", "num_reviews": "780", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Young Adult", "Mystery", "Fiction", "Historical"], "title": "Dreamland Burning", "description": ["When seventeen-year-old Rowan Chase finds a skeleton on her family’s property, she has no idea that investigating the brutal century-old murder will lead to a summer of painful discoveries about the past, the present, and herself.", "One hundred years earlier, a single violent encounter propels seventeen-year-old Will", "When seventeen-year-old Rowan Chase finds a skeleton on her family’s property, she has no idea that investigating the brutal century-old murder will lead to a summer of painful discoveries about the past, the present, and herself.", "One hundred years earlier, a single violent encounter propels seventeen-year-old Will Tillman into a racial firestorm. In a country rife with violence against blacks and a hometown segregated by Jim Crow, Will must make hard choices on a painful journey towards self discovery and face his inner demons in order to do what’s right the night Tulsa burns."], "author": "Jennifer Latham", "num_pages": "365", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-21 00:00:00", "ISBN": "0316384933"},
{"url": "https://www.goodreads.com/book/show/35991878-the-renegades", "num_ratings": "1", "num_reviews": "1", "avg_ratings": 4.0, "genres": ["Fantasy", "Fiction"], "title": "The Renegades (Unbroken, #1)", "description": ["Once upon a time…that would be the beginning given to a happy story with a happy ending, but this is no average story. There exist four kingdoms in my world. Their origin is unknown, but somewhere along the line, our ancestors thought it best to separate according to customs, mainly warrior customs. Together, we produce some of the most elite warriors the world has ever se", "Once upon a time…that would be the beginning given to a happy story with a happy ending, but this is no average story. There exist four kingdoms in my world. Their origin is unknown, but somewhere along the line, our ancestors thought it best to separate according to customs, mainly warrior customs. Together, we produce some of the most elite warriors the world has ever seen. ", "Fourteen-year-old Makai is destined to join the king’s army, being a descendent of Richard, one of the greatest warriors of his time. However, his grandfather has other plans in mind. And the elder has all the right help to elicit his treasonous plans and save his grandson. Makai’s older cousin happens to be the Wolf Guardian, with the innate ability to communicate with wolves, a power that is essentially useless to the government; while his other cousin, Ashleigh, is an elite archer and falconer. Together, they will work to bring the young warrior and the rest of their people into a new era, where they are free from the enslavement of the king. A rebellion is brewing. Are you ready to join the renegades? "], "author": "Na'Imah Anderson", "num_pages": "353", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-07-05 00:00:00", "ISBN": "1521762562"},
{"url": "https://www.goodreads.com/book/show/3239511-i-am-apache", "num_ratings": "715", "num_reviews": "106", "avg_ratings": 4.03, "genres": ["Young Adult", "Historical", "Fiction", "Historical", "Historical Fiction"], "title": "I Am Apache", "description": ["After watching helplessly as Mexican raiders brutally murder her little brother, fourteen-year-old Siki is filled with a desire for vengeance and chooses to turn away from a woman's path to become a warrior of her Apache tribe. Though some m", "After watching helplessly as Mexican raiders brutally murder her little brother, fourteen-year-old Siki is filled with a desire for vengeance and chooses to turn away from a woman's path to become a warrior of her Apache tribe. Though some men, like envious Keste, wish to see Siki fail, she passes test after test, and her skills grow under the guidance of her tribe's greatest warrior, Golahka. But Keste begins to whisper about Siki's father's dishonorable death, and even as Siki earns her place among the warriors, she senses a dark secret in her past — one that will throw into doubt everything she knows. Taking readers on a sweeping and suspenseful journey through the nineteenth-century American Southwest, Tanya Landman draws on historical accounts to imagine the Black Mountain Apache as a tribe in a fight for survival against the devastating progress of nations."], "author": "Tanya Landman", "num_pages": "320", "awards": ["Borders Original Voices Award for YA or Independent Reader (2008)", "Carnegie Medal Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-26 00:00:00", "ISBN": "0763636649"},
{"url": "https://www.goodreads.com/book/show/11886571-coyote-s-daughter", "num_ratings": "91", "num_reviews": "18", "avg_ratings": 3.82, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology", "Mystery"], "title": "Coyote's Daughter", "description": ["Trapped in a world where the legends of Tewa mythology walk free, a young girl must solve an ancient mystery in order to return to her own world.", "It is the beginning of summer, and twelve-year-old Maggie is angry about her family's move from San Diego to Albuquerque, New Mexico. Lonely and resentful at her new circumstances, Maggie and her dog Jack explore their new neighbo", "Trapped in a world where the legends of Tewa mythology walk free, a young girl must solve an ancient mystery in order to return to her own world.", "It is the beginning of summer, and twelve-year-old Maggie is angry about her family's move from San Diego to Albuquerque, New Mexico. Lonely and resentful at her new circumstances, Maggie and her dog Jack explore their new neighborhood and soon find the shady trail leading up to the Rio Grande.", "While playing by the river, Jack startles a strange young boy, Ash. Maggie is slowly drawn away from the real world of her family and into Ash's land, one populated by myths and legends. Threatening all is Shriveled Corn Man, a powerful sorcerer in search of vengeance for wrongs long past.", "Guided by the trickster Coyote and the cryptic Spider Old Woman, Maggie and Jack must travel across Ash's world in order to free her new friend and his people."], "author": "Corie Weaver", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-05-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23281271-stories-of-survival-and-revenge-english", "num_ratings": "10", "num_reviews": "4", "avg_ratings": 3.8, "genres": ["Young Adult", "Female Authors", "Childrens", "Middle Grade", "Sequential Art", "Graphica"], "title": "Stories of Survival and Revenge (English): From Inuit Folklore", "description": ["Stories of Survival and Revenge presents three action-packed Inuit folktales: the stories of Nuliajuk, the mother of the sea mammals; Kaugjagjuk, the mistreated orphan who seeks revenge; and the Nanurluk, an enormous polar bear many times the size of a regular bear. ", "Written at a reading level of approximately grade three, and an interest level suitable for the 12+ age grou", "Stories of Survival and Revenge presents three action-packed Inuit folktales: the stories of Nuliajuk, the mother of the sea mammals; Kaugjagjuk, the mistreated orphan who seeks revenge; and the Nanurluk, an enormous polar bear many times the size of a regular bear. ", "Written at a reading level of approximately grade three, and an interest level suitable for the 12+ age group, this book is a perfect pick for reluctant and struggling readers. ", "With comic book-inspired illustrations, this book presents these folktales as they were meant to be experienced, with all of the heart-pounding action and awe-inspiring creatures that Inuit mythology has to offer. "], "author": "Rachel Qitsualik-Tinsley", "num_pages": "88", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-02-27 00:00:00", "ISBN": "1772270016"},
{"url": "https://www.goodreads.com/book/show/29413544-the-bitter-harvest", "num_ratings": "23", "num_reviews": "8", "avg_ratings": 4.04, "genres": ["Historical", "Historical Fiction"], "title": "The Bitter Harvest", "description": ["The year is 1825, and a small Native American village has lost many of its people and bravest warriors to a pack of Lofa; huge beasts humanoid in shape but covered with coarse hair. The creatures are taller than any normal man, and fiercer than even the wildest animal. Rather than leave the land of their ancestors, the tribe chooses to stay and fight the beasts. But they'r", "The year is 1825, and a small Native American village has lost many of its people and bravest warriors to a pack of Lofa; huge beasts humanoid in shape but covered with coarse hair. The creatures are taller than any normal man, and fiercer than even the wildest animal. Rather than leave the land of their ancestors, the tribe chooses to stay and fight the beasts. But they're losing the war, and perhaps more critically, they're almost without hope.", "The small community grasps for anything to help them survive. There is a warrior on the frontier known as Orenda. He's already legendary across the west for his bravery and honor.", "Onsi, a young villager, sets out on a journey to find the warrior.", "Orenda will be forced to choose between almost certain death, not just for himself, but also his warrior wife Nazshoni and her brother Kanuna, or a dishonorable refusal that would mean annihilation for the entire village.", "The crucial decision is only the beginning, and Orenda will soon face the greatest test of his life; the challenge that could turn out to be too much even for a warrior of legend."], "author": "Oliver Phipps", "num_pages": "94", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-02-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/57763.Dance_Me_Outside", "num_ratings": "517", "num_reviews": "40", "avg_ratings": 4.16, "genres": ["Fiction", "Short Stories", "Cultural", "Canada", "Literature", "Canadian Literature"], "title": "Dance Me Outside", "description": ["Dance Me Outside is a collection of short stories written by W. P. Kinsella in 1977.", "The book contains seventeen stories narrated by Silas Ermineskin and is set on a Cree Indian reserve in Central Alberta and is about what happens in the lives of the people that live on the reserve."], "author": "W.P. Kinsella", "num_pages": "158", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1977-09-30 00:00:00", "ISBN": "0887502245"},
{"url": "https://www.goodreads.com/book/show/25667026-stone-field", "num_ratings": "251", "num_reviews": "88", "avg_ratings": 3.27, "genres": ["Historical", "Historical Fiction", "Young Adult", "Romance", "Retellings", "Historical"], "title": "Stone Field", "description": ["In a small town on the brink of the Civil War, Catrina finds a man making strange patterns in her family’s sorghum crop. He’s mad with fever, naked, and strikingly beautiful. He has no memory of who he is or what he’s done before Catrina found him in Stone Field. But that doesn’t bother Catrina because she doesn’t like thinking about the things she’s done before either.", "Cat", "In a small town on the brink of the Civil War, Catrina finds a man making strange patterns in her family’s sorghum crop. He’s mad with fever, naked, and strikingly beautiful. He has no memory of who he is or what he’s done before Catrina found him in Stone Field. But that doesn’t bother Catrina because she doesn’t like thinking about the things she’s done before either.", "Catrina and Stonefield fall passionately, dangerously, in love. All they want is to live with each other, in harmony with the land and away from Cat’s protective brother, the new fanatical preacher, and the neighbors who are scandalized by their relationship. But Stonefield can’t escape the truth about who he is, and the conflict tearing apart the country demands that everyone take a side before the bloodbath reaches their doorstep.", "Inspired by Emily Bronte’s ", "."], "author": "Christy Lenzi", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-03-29 00:00:00", "ISBN": "162672069X"},
{"url": "https://www.goodreads.com/book/show/24246762-sedition", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "Sedition (The Fractures Book 1)", "description": ["In the rubble of the world lies Hydra, an integration of all previous nations of Earth. Many years ago, The Catastrophe devastated the planet, and from the ashes rose the Hexad, a ruthless dictatorship. Now citizens of Hydra live in fenced cities, called The White, and are forbidden to cross the barriers into The Black. ", "Eighteen-year-old Alexis Cybria, about to be forced i", "In the rubble of the world lies Hydra, an integration of all previous nations of Earth. Many years ago, The Catastrophe devastated the planet, and from the ashes rose the Hexad, a ruthless dictatorship. Now citizens of Hydra live in fenced cities, called The White, and are forbidden to cross the barriers into The Black. ", "Eighteen-year-old Alexis Cybria, about to be forced into an arranged marriage, wins a seat on one of the rare flights leaving her city. What she thinks will be her final week of freedom becomes a fight for the survival of the human race alongside Captain Sevan Hunter of The Seventh Column, the Rebel resistance. Amidst a rebellion and rumors of an alien invasion, Alexis learns the truth about the world, and discovers the paranormal abilities that make her the most valuable person alive."], "author": "Zeva Tayler", "num_pages": "382", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/673501.Flight_of_the_Goose", "num_ratings": "79", "num_reviews": "16", "avg_ratings": 4.03, "genres": ["Fiction", "Historical", "Historical Fiction", "The United States Of America", "Adventure", "Novels"], "title": "Flight of the Goose: A Story of the Far North", "description": ["\"Flight of the Goose\" is an award-winning novel about an indigenous woman shaman, a draft-dodging bird scientist, and a young Inupiaq hunter caught between traditions.", "\"Flight of the Goose\" is an award-winning novel about an indigenous woman shaman, a draft-dodging bird scientist, and a young Inupiaq hunter caught between traditions."], "author": "Lesley Thomas", "num_pages": "434", "awards": ["National Federation of Press Women", "Washington Press Association", "Pacific Northwest Booksellers Association Award Nominee (0)"], "places": ["Seward Peninsula, Bering Strait", "Alaskan Arctic", "Seattle, Washington", "Inupiaq village", "The Otherworld"], "character_names": ["a shaman", "a bird biologist", "a draft-dodger", "an Inupiaq elder", "an Inupiaq hunter", "a missionary", "a bush pilot", "a schoolteacher", "a big game hunter", "a grizzly bear", "a wild goose", "a village health aide", "an oil man"], "language": "English", "publish_date": "2010-02-08 00:00:00", "ISBN": "0967884217"},
{"url": "https://www.goodreads.com/book/show/19546544-pukawiss-the-outcast", "num_ratings": "139", "num_reviews": "37", "avg_ratings": 3.8, "genres": ["Romance", "M M Romance", "Young Adult", "Lgbt", "Contemporary", "Glbt", "Queer", "Glbt", "Gay"], "title": "Pukawiss The Outcast", "description": ["When family complications take Joshua away from his fundamentalist Christian mother and leave him with his grandfather, he finds himself immersed in a mysterious and magical world. Joshua’s grandfather is a Wisconsin Ojibwe Indian who, along with an array of quirky characters, runs a recreated sixteenth-century village for the tourists who visit the reservation. Joshua’s m", "When family complications take Joshua away from his fundamentalist Christian mother and leave him with his grandfather, he finds himself immersed in a mysterious and magical world. Joshua’s grandfather is a Wisconsin Ojibwe Indian who, along with an array of quirky characters, runs a recreated sixteenth-century village for the tourists who visit the reservation. Joshua’s mother kept him from his Ojibwe heritage, so living on the reservation is liberating for him. The more he learns about Ojibwe traditions, the more he feels at home.", "One Ojibwe legend in particular captivates him. Pukawiss was a powerful manitou known for introducing dance to his people, and his nontraditional lifestyle inspires Joshua to embrace both his burgeoning sexuality and his status as an outcast. Ultimately, Joshua summons the courage necessary to reject his strict upbringing and to accept the mysterious path set before him."], "author": "Jay Jordan Hawke", "num_pages": "204", "awards": ["Lambda Literary Award Nominee for LGBT Children's/Young Adult (Finalist) (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-16 00:00:00", "ISBN": "1627986472"},
{"url": "https://www.goodreads.com/book/show/20734174-papina", "num_ratings": "20", "num_reviews": "13", "avg_ratings": 3.85, "genres": ["Contemporary", "Mystery", "Romance"], "title": "Papina", "description": ["Forrest and Braydon Miller moved to the small town of Papina to follow their dreams and start a family. Braydon loves her new life in the quiet town, kept alive by the prestigious boarding school overlooking the valley. She is so proud of her husband's work, helping the teens on the reservation.", "Until one day, Forrest doesn't come home.", "Scandal spreads when one of the teenag", "Forrest and Braydon Miller moved to the small town of Papina to follow their dreams and start a family. Braydon loves her new life in the quiet town, kept alive by the prestigious boarding school overlooking the valley. She is so proud of her husband's work, helping the teens on the reservation.", "Until one day, Forrest doesn't come home.", "Scandal spreads when one of the teenagers is found missing, too. But Braydon refuses to believe her husband would leave her. When the teen is found, she isn't talking—literally.", "While Braydon's heart is breaking, she needs to hold her crumbling life together, raise her son, and find a way to love the teenager enough to find the truth of what happened to her husband."], "author": "Katie Hamstead", "num_pages": "380", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-08 00:00:00", "ISBN": "1495430251"},
{"url": "https://www.goodreads.com/book/show/22217085-out-of-the-ashes", "num_ratings": "43", "num_reviews": "10", "avg_ratings": 4.93, "genres": [], "title": "Out of the Ashes", "description": ["Dean Banks is back in this sequel to Mysteries of the Red Coyote Inn, but can be a stand alone read.", "Here we find Dean Banks emerging from his Vision Quest with more powers from the ancient spirit gods to enable him to fight a powerful enemy which has threatened to destroy a sacred gold mine, the Superstition Mountains and many lives in its path. He will unlock the key to t", "Dean Banks is back in this sequel to Mysteries of the Red Coyote Inn, but can be a stand alone read.", "Here we find Dean Banks emerging from his Vision Quest with more powers from the ancient spirit gods to enable him to fight a powerful enemy which has threatened to destroy a sacred gold mine, the Superstition Mountains and many lives in its path. He will unlock the key to the mysterious underground world of these mountains where a diabolical plot is unfolding to destroy mankind. Dean and readers will finally come full circle with this one as the ending has a special spiritual message for all of us."], "author": "Lorraine Carey", "num_pages": "146", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/52872.Flight", "num_ratings": "13,615", "num_reviews": "2,021", "avg_ratings": 3.89, "genres": ["Fiction", "Young Adult", "Fantasy", "Historical", "Historical Fiction", "Science Fiction", "Time Travel", "Audiobook", "Magical Realism", "Science Fiction", "Novels", "Young Adult", "Coming Of Age"], "title": "Flight", "description": ["Sherman Alexie is one of our most gifted and accomplished storytellers and a treasured writer of huge national stature. His first novel in ten years is the hilarious and tragic portrait of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful and swift, prose, ", " follows this troubled foster teenager--a", "Sherman Alexie is one of our most gifted and accomplished storytellers and a treasured writer of huge national stature. His first novel in ten years is the hilarious and tragic portrait of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful and swift, prose, ", " follows this troubled foster teenager--a boy who is not a \"legal\" Indian because he was never claimed by his father--as he learns that violence is not the answer.", "The journey for ", "'s young hero begins as he's about to commit a massive act o violence. At the moment of decision, he finds himself shot back through time to resurface in the body of an FBI agent during the civil rights era, where he sees why \"Hell is Re driver, Idaho, in the 1970s.\" Red River is only the first stop in an eye-opening trip through moments in American history. He will continue traveling back to inhabit the body of an Indian child during the battle at Little Bighorn and then ride with an Indian tracker in the nineteenth century before materializing as an airline pilot jetting through the skies today. During these furious travels through time, his refrain grows: \"Who's to judge?\" and \"I don't understand humans.\" When finally, blessedly, our young warrior comes to rest again in his own life, he is mightily transformed by all he has seen.", "This is Sherman Alexie at his most brilliant--making us laugh while he's breaking our hearts. ", " has said that \"Alexie, like his characters, is on a modern-day vision quest,\" and in ", " he seeks nothing less than an understanding of why human beings hate. ", " is irrepressible, fearless, and groundbreaking Alexie."], "author": "Sherman Alexie", "num_pages": "181", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0802170374"},
{"url": "https://www.goodreads.com/book/show/303917.Zia", "num_ratings": "3,748", "num_reviews": "203", "avg_ratings": 3.44, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens"], "title": "Zia", "author": "Scott O'Dell", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-06-08 00:00:00", "ISBN": "0440228174"},
{"url": "https://www.goodreads.com/book/show/15804071-illuminate-alive-she-cried", "num_ratings": "23", "num_reviews": "16", "avg_ratings": 4.22, "genres": ["Fantasy", "Paranormal"], "title": "Illuminate-Alive, She Cried", "description": ["Seventeen-year-old Talisa Santiago, the pregnant Native American shifter and granddaughter of a shaman is about to begin the self discovering journey of a lifetime, taking her from the only place she truly remembers and putting her on sacred land. The trials and tribulations there lead her into what can only be described as truly illuminating. She also finds herself in a l", "Seventeen-year-old Talisa Santiago, the pregnant Native American shifter and granddaughter of a shaman is about to begin the self discovering journey of a lifetime, taking her from the only place she truly remembers and putting her on sacred land. The trials and tribulations there lead her into what can only be described as truly illuminating. She also finds herself in a love triangle, one that throws her life into utter chaos. Leaving her to learn not only how to deal with her shape shifting abilities, a new baby and now two men who will both tug at her heart in very different ways. Who will she decide to live with and what will it mean for the rest of her journey?"], "author": "Jamie-Leigh Haden", "num_pages": "326", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-15 00:00:00", "ISBN": "1479108235"},
{"url": "https://www.goodreads.com/book/show/5149921-nokosee", "num_ratings": "10", "num_reviews": "3", "avg_ratings": 3.8, "genres": [], "title": "Nokosee: Rise of the New Seminole", "description": ["Cultures clash, sparks fly, love blooms, people die, and two kids, one a little bit punk and the other way too country, see their lives changed forever. Stormy Jones has to spend summers with her father, an Everglades park ranger. Thinking it might build character, he drags her along to fight an Everglades fire and promptly loses her when it gets out of control. Stormy is", "Cultures clash, sparks fly, love blooms, people die, and two kids, one a little bit punk and the other way too country, see their lives changed forever. Stormy Jones has to spend summers with her father, an Everglades park ranger. Thinking it might build character, he drags her along to fight an Everglades fire and promptly loses her when it gets out of control. Stormy is helpless in the Natural World until Nokosee stumbles upon her. Raised deep in the Everglades, Nokosee has never seen a white person before, much less one with \"sky eyes and flamingo hair.\" Built like a bronze Adonis, 17-year-old Nokosee and Stormy begin a series of amazing adventures as a modern day \"Tarzan and Jane\" and it's only a matter of time before they fall into a libido fueled mixed-up kinda love. Too bad for them. Nokosee's father is certifiably deranged. Nokosee is the first of the \"New Seminole\" whom he is grooming to take back the \"Outside.\" The last thing he wants is for his son to fall for an \"Outsider.\" You can learn more at: http: //"], "author": "Micco Mann", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-02 00:00:00", "ISBN": "0963449915"},
{"url": "https://www.goodreads.com/book/show/36373298-trail-of-lightning", "num_ratings": "1,647", "num_reviews": "479", "avg_ratings": 4.25, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Young Adult", "Fiction", "Science Fiction", "Dystopia"], "title": "Trail of Lightning", "description": ["While most of the world has drowned beneath the sudden rising waters of a climate apocalypse, Dinétah (formerly the Navajo reservation) has been reborn. The gods and heroes of legend walk the land, but so do monsters.", "Maggie Hoskie is a Dinétah monster hunter, a supernaturally gifted killer. When a small town needs help finding a missing girl, Maggie is their last—and best—", "While most of the world has drowned beneath the sudden rising waters of a climate apocalypse, Dinétah (formerly the Navajo reservation) has been reborn. The gods and heroes of legend walk the land, but so do monsters.", "Maggie Hoskie is a Dinétah monster hunter, a supernaturally gifted killer. When a small town needs help finding a missing girl, Maggie is their last—and best—hope. But what Maggie uncovers about the monster is much larger and more terrifying than anything she could imagine.", "Maggie reluctantly enlists the aid of Kai Arviso, an unconventional medicine man, and together they travel to the rez to unravel clues from ancient legends, trade favors with tricksters, and battle dark witchcraft in a patchwork world of deteriorating technology.", "As Maggie discovers the truth behind the disappearances, she will have to confront her past—if she wants to survive.", "Welcome to the Sixth World."], "author": "Rebecca Roanhorse", "num_pages": "287", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-06-26 00:00:00", "ISBN": "1534413499"},
{"url": "https://www.goodreads.com/book/show/233818.Island_of_the_Blue_Dolphins", "num_ratings": "258,053", "num_reviews": "7,260", "avg_ratings": 3.81, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Classics", "Childrens"], "title": "Island of the Blue Dolphins", "description": ["An alternate cover edition can be found ", "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.", "This is the story of Karana, the Indian girl", "An alternate cover edition can be found ", "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.", "This is the story of Karana, the Indian girl who lived alone for years on the Island of the Blue Dolphins. Year after year, she watched one season pass into another and waited for a ship to take her away. But while she waited, she kept herself alive by building shelter, making weapons, finding food, and fighting her enemies, the wild dogs. It is not only an unusual adventure of survival, but also a tale of natural beauty and personal discovery."], "author": "Scott O'Dell", "num_pages": "184", "awards": ["Newbery Medal (1961)", "Lewis Carroll Shelf Award (1961)", "Nene Award (1964)", "Dorothy Canfield Fisher Children's Book Award Nominee (1962)", "Deutscher Jugendliteraturpreis for Jugendbuch (1963)"], "places": ["Island of the Blue Dolphins", "California"], "character_names": ["Karana"], "language": "English", "publish_date": "1987-02-01 00:00:00", "ISBN": "0440439884"},
{"url": "https://www.goodreads.com/book/show/53496.Walk_Two_Moons", "num_ratings": "138,270", "num_reviews": "6,051", "avg_ratings": 3.96, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Childrens", "Childrens", "Middle Grade"], "title": "Walk Two Moons", "description": ["\"How about a story? Spin us a yarn.\"", "Instantly, Phoebe Winterbottom came to mind. \"I could tell you an extensively strange story,\" I warned.", "\"Oh, good!\" Gram said. \"Delicious!\"", "And that is how I happened to tell them about Phoebe, her disappearing mother, and the lunatic.", "As Sal entertains her grandparents with Phoebe's outrageous story, her own story begins to unfold — the st", "\"How about a story? Spin us a yarn.\"", "Instantly, Phoebe Winterbottom came to mind. \"I could tell you an extensively strange story,\" I warned.", "\"Oh, good!\" Gram said. \"Delicious!\"", "And that is how I happened to tell them about Phoebe, her disappearing mother, and the lunatic.", "As Sal entertains her grandparents with Phoebe's outrageous story, her own story begins to unfold — the story of a thirteen-year-old girl whose only wish is to be reunited with her missing mother.", "In her own award-winning style, Sharon Creech intricately weaves together two tales, one funny, one bittersweet, to create a heartwarming, compelling, and utterly moving story of love, loss, and the complexity of human emotion."], "author": "Sharon Creech", "num_pages": "280", "awards": ["Newbery Medal (1995)", "Dorothy Canfield Fisher Children's Book Award Nominee (1996)", "W.H. Smith's Mind-Boggling Books Award (1996)", "Oklahoma Sequoyah Award for YA (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-05-24 00:00:00", "ISBN": "0060739495"},
{"url": "https://www.goodreads.com/book/show/41865.Twilight", "num_ratings": "4,234,882", "num_reviews": "97,585", "avg_ratings": 3.58, "genres": ["Young Adult", "Fantasy", "Romance", "Paranormal", "Vampires", "Fiction", "Fantasy", "Paranormal"], "title": "Twilight", "description": ["In the first book of the Twilight Saga, internationally bestselling author Stephenie Meyer introduces Bella Swan and Edward Cul", "In the first book of the Twilight Saga, internationally bestselling author Stephenie Meyer introduces Bella Swan and Edward Cullen, a pair of star-crossed lovers whose forbidden relationship ripens against the backdrop of small-town suspicion and a mysterious coven of vampires. This is a love story with bite."], "author": "Stephenie Meyer", "num_pages": "498", "awards": ["Georgia Peach Book Award (2007)", "Buxtehuder Bulle (2006)", "Kentucky Bluegrass Award for 9-12 (2007)", "Prijs van de Kinder- en Jeugdjury Vlaanderen (2008)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2009)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2008)", "Garden State Book Award for Fiction (Grades 9-12) (2008)", "South Carolina Book Award for Young Adult Book Award (2008)", "Grand Canyon Reader Award for Teen Book (2008)", "Maryland Black-Eyed Susan Book Award for High School (2008)", "Golden Sower Award for Young Adult (2009)", "Nevada Young Readers' Award for Young Adult Category  (2007)", "The Flume: New Hampshire Teen Reader's Choice Award (2007)", "Pennsylvania Young Readers' Choice Award for Young Adult (2009)", "Rhode Island Teen Book Award (2007)", "Evergreen Teen Book Award (2008)", "Michigan Library Association Thumbs Up! Award Nominee (2006)", "Teen Read Award Nominee for Best All-Time-Fave (2010)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2007)", "Iowa High School Book Award (2008)", "Lincoln Award (2008)", "Literaturpreis der Jury der jungen Leser for Cover (2007)", "Prix Et-lisez-moi (2008)", "Missouri Gateway Readers Award (2008)"], "places": ["Forks, Washington", "Phoenix, Arizona", "Washington (the state)"], "character_names": ["Edward Cullen", "Jacob Black", "Laurent", "Renee", "Bella Swan", "Billy Black", "Esme Cullen", "Alice Cullen", "Jasper Hale", "Carlisle Cullen", "Emmett Cullen", "Rosalie Hale", "Charlie Swan", "Mike Newton", "Jessica Stanley", "Angela Weber", "Tyler Crowley"], "language": "English", "publish_date": "2006-09-06 00:00:00", "ISBN": "0316015849"}
]