[
{"url": "https://www.goodreads.com/book/show/5199022-cut-run", "num_ratings": "18,782", "num_reviews": "2,233", "avg_ratings": 4.06, "genres": ["Romance", "M M Romance", "Romance", "Mystery", "Contemporary"], "title": "Cut & Run", "description": ["A series of murders in New York City has stymied the police and FBI alike, and they suspect the culprit is a single killer sending an indecipherable message. But when the two federal agents assigned to the investigation are taken out, the FBI takes a more personal interest in the case.", "Special Agent Ty Grady is pulled out of undercover work after his case blows up in his fa", "A series of murders in New York City has stymied the police and FBI alike, and they suspect the culprit is a single killer sending an indecipherable message. But when the two federal agents assigned to the investigation are taken out, the FBI takes a more personal interest in the case.", "Special Agent Ty Grady is pulled out of undercover work after his case blows up in his face. He's cocky, abrasive, and indisputably the best at what he does. But when he's paired with Special Agent Zane Garrett, it's hate at first sight. Garrett is the perfect image of an agent: serious, sober, and focused, which makes their partnership a classic cliche: total opposites, good cop-bad cop, the odd couple. They both know immediately that their partnership will pose more of an obstacle than the lack of evidence left by the murderer.", "Practically before their special assignment starts, the murderer strikes again this time at them. Now on the run, trying to track down a man who has focused on killing his pursuers, Grady and Garrett will have to figure out how to work together before they become two more notches in the murderer's knife."], "author": "Abigail Roux", "num_pages": "376", "awards": [], "places": ["New York City, New York", "Maryland"], "character_names": ["Beaumont \"Ty\" Tyler Grady", "Zane Zachary Garrett"], "language": "English", "publish_date": "2008-09-30 00:00:00", "ISBN": "193519223X"},
{"url": "https://www.goodreads.com/book/show/5260435-criss-cross", "num_ratings": "4,652", "num_reviews": "454", "avg_ratings": 4.12, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Fantasy", "Urban Fantasy"], "title": "Criss Cross", "description": ["Criss Cross finds the ghosts surrounding Victor getting awfully pushy. The medications that Victor usually takes to control his abilities are threatening to destroy his liver, and his new meds aren't any more effective than sugar pills.", "Vic is also adjusting to a new PsyCop partner, a mild-mannered guy named Roger with all the personality of white bread. At least he's willi", "Criss Cross finds the ghosts surrounding Victor getting awfully pushy. The medications that Victor usually takes to control his abilities are threatening to destroy his liver, and his new meds aren't any more effective than sugar pills.", "Vic is also adjusting to a new PsyCop partner, a mild-mannered guy named Roger with all the personality of white bread. At least he's willing to spring for the Starbucks.", "Jacob’s ex-boyfriend, Crash, is an empathic healer who might be able to help Victor pull his powers into balance, but he seems more interested in getting into Victor’s pants than in providing any actual assistance."], "author": "Jordan Castillo Price", "num_pages": "163", "awards": [], "places": ["Chicago, Illinois", "Illinois", "Missouri"], "character_names": ["Victor Bayne", "Jacob Marks", "Maurice Taylor", "Carolyn Brinkman", "Lisa Gutierrez", "Curtis \"Crash\" Ash"], "language": "English", "publish_date": "2008-11-11 00:00:00", "ISBN": "0981875246"},
{"url": "https://www.goodreads.com/book/show/17730586-the-magpie-lord", "num_ratings": "8,330", "num_reviews": "1,323", "avg_ratings": 4.11, "genres": ["Fantasy", "Romance", "M M Romance", "Romance", "Historical", "Fantasy", "Paranormal", "Fantasy", "Magic", "Mystery"], "title": "The Magpie Lord", "description": ["Exiled to China for twenty years, Lucien Vaudrey never planned to return to England. But with the mysterious deaths of his father and brother, it seems the new Lord Crane has inherited an earldom. He’s also inherited his family’s enemies. He needs magical assistance, fast. He doesn't expect it to turn up angry.", "Mag", "Exiled to China for twenty years, Lucien Vaudrey never planned to return to England. But with the mysterious deaths of his father and brother, it seems the new Lord Crane has inherited an earldom. He’s also inherited his family’s enemies. He needs magical assistance, fast. He doesn't expect it to turn up angry.", "Magician Stephen Day has good reason to hate Crane’s family. Unfortunately, it’s his job to deal with supernatural threats. Besides, the earl is unlike any aristocrat he’s ever met, with the tattoos, the attitude... and the way Crane seems determined to get him into bed. That’s definitely unusual.", "Soon Stephen is falling hard for the worst possible man, at the worst possible time. But Crane’s dangerous appeal isn't the only thing rendering Stephen powerless. Evil pervades the house, a web of plots is closing round Crane, and if Stephen can’t find a way through it—they’re both going to die. "], "author": "K.J. Charles", "num_pages": "200", "awards": ["DABWAHA Romance Tournament Nominee for Best Gay/Lesbian/Transgender Romance (2014)"], "places": ["Lychdale, England", "London, England"], "character_names": ["Lucien Vaudrey", "Stephen Day", "Frank Merrick"], "language": "English", "publish_date": "2013-09-03 00:00:00", "ISBN": "1619215764"},
{"url": "https://www.goodreads.com/book/show/3953718-dangerous-ground", "num_ratings": "4,184", "num_reviews": "379", "avg_ratings": 3.81, "genres": ["Romance", "M M Romance", "Romance", "Mystery", "Contemporary", "Mystery", "Crime"], "title": "Dangerous Ground", "description": ["Special Agents for the Department of Diplomatic Security, Taylor MacAllister and Will Brandt have been partners and best friends for three years, but everything changed the night Taylor admitted the truth about his feelings for Will. And when Taylor was shot a few hours later, Will felt his reluctance to get involved was vindicated. For Will, the team and the friendship ha", "Special Agents for the Department of Diplomatic Security, Taylor MacAllister and Will Brandt have been partners and best friends for three years, but everything changed the night Taylor admitted the truth about his feelings for Will. And when Taylor was shot a few hours later, Will felt his reluctance to get involved was vindicated. For Will, the team and the friendship have to come first--despite the fact that he hasn't failed to notice just how...hot Taylor is.", "Taylor has been in love with his partner and best friend since they were first partnered. There isn't much he wouldn't do for Will--but he doesn't know how much longer they can stay teamed feeling the way he does. Still, he agreed to a camping trip in the High Sierras--despite the fact that he hates camping--because Will wanted a chance to save their partnership.", "But the trip is a disaster from the first, and things rapidly go from bad to worse when they find a crashed plane and a couple of million dollars in stolen money. With a trio of murderous robbers trailing them, Will and Taylor are on dangerous ground, fighting for their partnership, their passion...and their lives."], "author": "Josh Lanyon", "num_pages": "108", "awards": [], "places": ["Lake Tahoe", "Nevada"], "character_names": ["WIlliam \"Will\" Brandt, Jr", "Taylor MacAllister"], "language": "English", "publish_date": "2008-04-22 00:00:00", "ISBN": "1596326581"},
{"url": "https://www.goodreads.com/book/show/6370838-the-white-knight", "num_ratings": "1,359", "num_reviews": "100", "avg_ratings": 3.98, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "The White Knight", "description": [" ", "Actor Sean Fairchild has a not-so-secret admirer: a psycho stalker who thinks taking out the sexy, shy young actor will leave the world a better place. His manager insists Sean needs protection, and Sean's beginning to think he's right.", "It's a Hollywood cliché: the hot and handsome bodyguard. But in the case of LAPD Detective Daniel Moran, it's", " ", "Actor Sean Fairchild has a not-so-secret admirer: a psycho stalker who thinks taking out the sexy, shy young actor will leave the world a better place. His manager insists Sean needs protection, and Sean's beginning to think he's right.", "It's a Hollywood cliché: the hot and handsome bodyguard. But in the case of LAPD Detective Daniel Moran, it's all true. Dan is everything Sean ever wanted in a leading man, but Dan's kind of an old-fashioned guy. It's his job to keep Sean safe and in one piece--happy is someone else's problem.", "As tension mounts, Sean can't help turning to Dan, while Dan is finding it harder and harder to say no. Their only chance of a happy ending is if Dan can keep Sean alive--but what happens when he uncovers the secrets Sean is trying hard to conceal?", " This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, male/male sexual practices.'"], "author": "Josh Lanyon", "num_pages": "103", "awards": [], "places": ["Los Angeles, California", "Wales"], "character_names": ["Sean Fairchild", "Dan Moran"], "language": "English", "publish_date": "2009-03-16 00:00:00", "ISBN": "1596329084"},
{"url": "https://www.goodreads.com/book/show/11787563-dirty-kiss", "num_ratings": "3,919", "num_reviews": "547", "avg_ratings": 4.02, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "Dirty Kiss", "description": ["Cole Kenjiro McGinnis, ex-cop and PI, is trying to get over the shooting death of his lover when a supposedly routine investigation lands in his lap. Investigating the apparent suicide of a prominent Korean businessman's son proves to be anything but ordinary, especially when it introduces Cole to the dead man's handsome cousin, Kim Jae-Min.", "Jae-Min's cousin had a dirty lit", "Cole Kenjiro McGinnis, ex-cop and PI, is trying to get over the shooting death of his lover when a supposedly routine investigation lands in his lap. Investigating the apparent suicide of a prominent Korean businessman's son proves to be anything but ordinary, especially when it introduces Cole to the dead man's handsome cousin, Kim Jae-Min.", "Jae-Min's cousin had a dirty little secret, the kind that Cole has been familiar with all his life and that Jae-Min is still hiding from his family. The investigation leads Cole from tasteful mansions to seedy lover s trysts to Dirty Kiss, the place where the rich and discreet go to indulge in desires their traditional-minded families would rather know nothing about.", "It also leads Cole McGinnis into Jae-Min's arms, and that could be a problem. The death of Jae-Min's cousin is looking less and less like a suicide, and Jae-Min is looking more and more like a target. Cole has already lost one lover to violence he's not about to lose Jae-Min too."], "author": "Rhys Ford", "num_pages": "216", "awards": [], "places": ["California", "Los Angeles, California"], "character_names": [], "language": "English", "publish_date": "2011-07-01 00:00:00", "ISBN": "1615819584"},
{"url": "https://www.goodreads.com/book/show/10671152-come-unto-these-yellow-sands", "num_ratings": "2,914", "num_reviews": "344", "avg_ratings": 4.15, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "Come Unto These Yellow Sands", "description": ["Sometimes the adventure chooses you.", "Lover of fine poetry and lousy choose-your-own-adventure novels, Professor Sebastian Swift was once the bad-boy darling of the literati. The only lines he does these days are Browning, Frost, and Cummings. Even his relationship with the hot, handsome Wolfe Neck Police chief, Max Prescott, is healthy.", "When one of his most talented students", "Sometimes the adventure chooses you.", "Lover of fine poetry and lousy choose-your-own-adventure novels, Professor Sebastian Swift was once the bad-boy darling of the literati. The only lines he does these days are Browning, Frost, and Cummings. Even his relationship with the hot, handsome Wolfe Neck Police chief, Max Prescott, is healthy.", "When one of his most talented students comes to him bruised and begging for help, Swift hands over the keys to his Orson Island cabin - only to find out that the boy's father is dead and the police are suspicious. In an instant, the stable life Swift has built for himself hangs on finding the boy and convincing him to give himself up before Max figures out Swift's involvement in the case.", "Max enjoys splitting an infinitive or two with his favorite nutty professor, but he's not much for sonnets or Shakespeare. He likes being lied to even less. Yet his instincts - and his heart - tell him his lover is being played. Max can forgive lies and deception, but a dangerous enemy may not stop until Swift is heading up his own dead poet's society."], "author": "Josh Lanyon", "num_pages": "161", "awards": [], "places": ["Maine"], "character_names": [], "language": "English", "publish_date": "2011-06-14 00:00:00", "ISBN": "1609282736"},
{"url": "https://www.goodreads.com/book/show/6080449-deadly-nightshade", "num_ratings": "872", "num_reviews": "95", "avg_ratings": 3.56, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance", "Gay Romance", "Gay For You"], "title": "Deadly Nightshade", "description": ["Straight cop, gay cop, and a woman who \"isn't real.\" Tom and Stanley are on the trail of a drag queen serial killer, and along the way, they find themselves engaged in a more intimate pursuit, trying to resolve another mystery: their unexpected attraction to one another."], "author": "Victor J. Banis", "num_pages": "221", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2009-01-16 00:00:00", "ISBN": "1934531758"},
{"url": "https://www.goodreads.com/book/show/7093114-a-matter-of-time-book-ii", "num_ratings": "4,141", "num_reviews": "234", "avg_ratings": 4.16, "genres": ["Romance", "Romance", "M M Romance", "Mystery", "Gay Romance", "Gay For You"], "title": "A Matter of Time Book II", "description": ["Jory Keyes is doing his best to get over Detective Sam Kage, who broke his heart. Fearful of coming out of the closet, Sam intended to marry and uphold the status quo. After testifying against the man he saw commit cold-blooded murder, Jory is sure he and the detective will never cross paths again. But fate has other plans. ", "Between Sam’s job and Jory being openly gay and o", "Jory Keyes is doing his best to get over Detective Sam Kage, who broke his heart. Fearful of coming out of the closet, Sam intended to marry and uphold the status quo. After testifying against the man he saw commit cold-blooded murder, Jory is sure he and the detective will never cross paths again. But fate has other plans. ", "Between Sam’s job and Jory being openly gay and on the run from hired killers, the path to true love has never been rockier. When Jory is kidnapped, the culprit is someone no one ever suspected."], "author": "Mary Calmes", "num_pages": "140", "awards": [], "places": ["Chicago, Illinois"], "character_names": ["Jory \"J\" Keyes", "Samuel \"Sam\" Thomas Kage"], "language": "English", "publish_date": "2009-11-02 00:00:00", "ISBN": "1897532776"},
{"url": "https://www.goodreads.com/book/show/7504681-catch-me-if-you-can", "num_ratings": "2,151", "num_reviews": "269", "avg_ratings": 3.9, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance", "Humor", "Funny"], "title": "Catch Me If You Can", "description": ["Lowly art gallery assistant Caesar Romano is freely out of the closet. Now he’d just like to get out of his Nana’s guest room. Everything—his reputation and his financial freedom—is riding on the success of tonight’s gallery opening. If only he could shake free of the past so easily.", "A mysterious gatecrasher, Dan Green, looks lik", "Lowly art gallery assistant Caesar Romano is freely out of the closet. Now he’d just like to get out of his Nana’s guest room. Everything—his reputation and his financial freedom—is riding on the success of tonight’s gallery opening. If only he could shake free of the past so easily.", "A mysterious gatecrasher, Dan Green, looks like a promising addition to his pending new life—until Caesar’s ex shows up and suddenly the opening disintegrates into a half-naked dance melee. When the glitter settles, a missing sculpture of Justin Timberlake has Caesar up to his eyebrows in extortion, intrigue and a wild sexual adventure underneath, inside, and on top of a variety of furnishings.", "As the cast of suspects piles up, so do the questions. Like who’s really blackmailing whom? And what does a stolen paint-by-numbers clown matter when Dan is so outrageously capable of blowing Caesar’s resistance to smithereens?"], "author": "L.B. Gregg", "num_pages": "128", "awards": [], "places": ["New York (the state)"], "character_names": ["Caesar Romano", "Dan Green"], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "1605049506"},
{"url": "https://www.goodreads.com/book/show/3214725-the-dark-horse", "num_ratings": "1,637", "num_reviews": "138", "avg_ratings": 3.9, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "The Dark Horse", "description": ["Paul Hammond is dead. That's what tough and sexy LAPD Detective Daniel Moran tells his lover, Hollywood actor Sean Fairchild--and Sean wants to believe him, but what about those threatening postcards in Hammond's handwriting? The last thing Sean needs is someone doubting him. But then, what does Sean really know about his new boyfriend? Dan is a dark horse--and maybe Sean", "Paul Hammond is dead. That's what tough and sexy LAPD Detective Daniel Moran tells his lover, Hollywood actor Sean Fairchild--and Sean wants to believe him, but what about those threatening postcards in Hammond's handwriting? The last thing Sean needs is someone doubting him. But then, what does Sean really know about his new boyfriend? Dan is a dark horse--and maybe Sean is betting too much on this relationship. He can't afford to take foolish chances. It not just Sean's career at stake or his relationship or even his sanity--it's his life. [Publisher's note: this book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: m/m homoerotic sex practices.]"], "author": "Josh Lanyon", "num_pages": "134", "awards": [], "places": ["Malibu, California", "California"], "character_names": ["Sean Fairchild", "Dan Moran"], "language": "English", "publish_date": "2007-04-16 00:00:00", "ISBN": "1596324430"},
{"url": "https://www.goodreads.com/book/show/3595953-the-assignment", "num_ratings": "5,519", "num_reviews": "411", "avg_ratings": 3.66, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Gay Romance", "Gay For You", "Adult Fiction", "Erotica"], "title": "The Assignment", "description": [" ", "Detective Nicholas Valenti, tall, dark and stoic, has been best friends with his partner", " ", "Detective Nicholas Valenti, tall, dark and stoic, has been best friends with his partner, Sean O’Brian for six years. The two men have seen each other through divorce, disaster and danger and saved each other’s asses more times than Valenti can count. Exactly when he started seeing his blond, intense partner in another light, Valenti isn’t really sure. He only knows that he wants O’Brian in a way that had nothing to do with friendship and everything to do with possession. It is a desire he will have to hide forever because O’Brian is undeniably straight.", "Just as Valenti is coming to grips with his new, unacceptable feelings for his partner their police Captain puts them on a new case that could blow Valenti’s cover once and for all. He and O’Brian are going undercover at the country’s largest and most infamous gay resort to bust a notorious drug lord and stop the shipments of poison cocaine that are flooding the gay bars all over the city.", "Now Valenti will have to make a choice between friendship and desire. He and O’Brian will play the roles of gay men that will push the limits of their relationship to the breaking point. Will their time at the RamJack forge a new bond between them or destroy their partnership forever?"], "author": "Evangeline Anderson", "num_pages": "190", "awards": [], "places": ["California"], "character_names": ["Sean O'Brian", "Nicholas Valenti"], "language": "English", "publish_date": "2008-03-11 00:00:00", "ISBN": "1596326727"},
{"url": "https://www.goodreads.com/book/show/15705835-pressure-head", "num_ratings": "3,789", "num_reviews": "531", "avg_ratings": 3.9, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Fantasy", "Paranormal", "Contemporary"], "title": "Pressure Head", "description": ["To most of the world, Tom Paretski is just a plumber with a cheeky attitude and a dodgy hip, souvenir of a schoolboy accident. The local police keep his number on file for a different reason—his sixth sense for finding hidden things.", "When he’s called in to help locate the body of a missing woman up on Nomansland Common, he unexpectedly en", "To most of the world, Tom Paretski is just a plumber with a cheeky attitude and a dodgy hip, souvenir of a schoolboy accident. The local police keep his number on file for a different reason—his sixth sense for finding hidden things.", "When he’s called in to help locate the body of a missing woman up on Nomansland Common, he unexpectedly encounters someone who resurrects a host of complicated emotions. Phil Morrison, Tom’s old school crush, now a private investigator working the same case. And the former bully partly responsible for Tom’s injury.", "The shocks keep coming. Phil is now openly gay, and shows unmistakable signs of interest. Tom’s attraction to the big, blond investigator hasn’t changed—in fact, he’s even more desirable all grown up. But is Phil’s interest genuine, or does he only want to use Tom’s talent?", "As the pile of complicated evidence surrounding the woman’s murder grows higher, so does the heat between Tom and Phil. But opening himself to this degree exposes Tom’s heart in a way he’s not sure he’s ready for…while the murderer’s trigger finger is getting increasingly twitchy."], "author": "J.L. Merrow", "num_pages": "279", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-18 00:00:00", "ISBN": "1619212587"},
{"url": "https://www.goodreads.com/book/show/16159276-touch-geaux", "num_ratings": "8,495", "num_reviews": "1,174", "avg_ratings": 4.5, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery", "Mystery", "Crime"], "title": "Touch & Geaux", "description": ["After having their faces plastered across the news during a high-profile case, FBI Special Agents Ty Grady and Zane Garrett have become more useful to the Bureau posing for photo ops than working undercover. Just as Zane is beginning to consider retirement a viable option, Ty receives a distress call from a friend, leading them to a city rife with echoes from the past.", "New", "After having their faces plastered across the news during a high-profile case, FBI Special Agents Ty Grady and Zane Garrett have become more useful to the Bureau posing for photo ops than working undercover. Just as Zane is beginning to consider retirement a viable option, Ty receives a distress call from a friend, leading them to a city rife with echoes from the past.", "New Orleans wears its history on its streets, and it’s the one place Ty’s face could get him killed. Surrounded by trouble as soon as they land, Ty and Zane are swiftly confronted with a past from which Ty can’t hide—one with a surprising connection to Zane’s.", "As threats close in from all directions, both men must come to terms with the lives they’ve led and the lies they’ve told. They soon discover that not all their secrets are out yet, and nothing lasts forever."], "author": "Abigail Roux", "num_pages": "349", "awards": [], "places": ["Louisiana", "Maryland", "New Orleans, Louisiana"], "character_names": ["Beaumont \"Ty\" Tyler Grady", "Zane Zachary Garrett", "Nick O'Flaherty", "Liam Bell", "Kelly Abbott"], "language": "English", "publish_date": "2013-04-08 00:00:00", "ISBN": "1937551865"},
{"url": "https://www.goodreads.com/book/show/5975704-the-long-way-home", "num_ratings": "2,823", "num_reviews": "300", "avg_ratings": 3.95, "genres": ["Fantasy", "Paranormal", "Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "The Long Way Home", "description": ["When young boys go missing, psychic Kevin Quinn is called in to help the police department. Quinn's partner is Connor Dougal, a newer detective on the force, and a skeptic when it comes to psychic abilities. That is until strange things happen to Kevin when he touches objects belonging to the missing kids. Even more disturbing is the way Kevin can participate in Conner's d", "When young boys go missing, psychic Kevin Quinn is called in to help the police department. Quinn's partner is Connor Dougal, a newer detective on the force, and a skeptic when it comes to psychic abilities. That is until strange things happen to Kevin when he touches objects belonging to the missing kids. Even more disturbing is the way Kevin can participate in Conner's dreams. Conner's past is more tied to the current case than anyone realizes and it's only by lancing the pain of the past there is a hope for the future."], "author": "Z.A. Maxfield", "num_pages": "286", "awards": [], "places": ["California", "Wyoming"], "character_names": ["Kevin Quinn", "Connor Dougal"], "language": "English", "publish_date": "2008-11-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11277601-life-lessons", "num_ratings": "4,919", "num_reviews": "496", "avg_ratings": 4.04, "genres": ["Romance", "M M Romance", "Romance", "Mystery", "Contemporary"], "title": "Life Lessons", "description": ["Tony Hart's life has been quiet lately. He has good friends and a rewarding teaching job. Then the murdered body of another teacher falls into the elevator at his feet, and Tony's life gets a little too exciting.", "Jared MacLean is a homicide detective, a widowed father, and deeply in the closet. But from the moment he meets Tony's blue eyes in that high school hallway, Mac c", "Tony Hart's life has been quiet lately. He has good friends and a rewarding teaching job. Then the murdered body of another teacher falls into the elevator at his feet, and Tony's life gets a little too exciting.", "Jared MacLean is a homicide detective, a widowed father, and deeply in the closet. But from the moment he meets Tony's blue eyes in that high school hallway, Mac can't help wanting this man in his life. However Mac isn't the only one with his eyes on Tony. As the murderer tries to cover his tracks, Mac has to work fast or lose Tony, permanently."], "author": "Kaje Harper", "num_pages": "276", "awards": [], "places": ["Minneapolis, Minnesota"], "character_names": ["Anthony \"Tony\" Hart", "Jared \"Mac\" MacLean"], "language": "English", "publish_date": "2011-05-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9649605-bloodlines", "num_ratings": "1,056", "num_reviews": "211", "avg_ratings": 4.41, "genres": ["Mystery", "Romance", "M M Romance", "Fantasy", "Paranormal", "Fantasy", "Urban Fantasy", "Paranormal", "Shapeshifters", "Romance"], "title": "Bloodlines", "description": ["In a world where a werecat virus has changed society, Roan McKichan, a born infected and ex-cop, works as a private detective trying to solve crimes involving other infecteds.", "The newly married Roan is struggling to balance his work with his home life as he grows increasingly distracted by his husband Paris's declining health. One case with strong emotions attached takes up", "In a world where a werecat virus has changed society, Roan McKichan, a born infected and ex-cop, works as a private detective trying to solve crimes involving other infecteds.", "The newly married Roan is struggling to balance his work with his home life as he grows increasingly distracted by his husband Paris's declining health. One case with strong emotions attached takes up most of his time: finding the murderer of a missing little rich girl. It's a family with secrets so toxic they'd rather no one investigate, and there's no shortage of suspects. But despite the dangers and obstructions involved, Roan won't stop... until he loses something infinitely precious as well."], "author": "Andrea Speed", "num_pages": "222", "awards": [], "places": [], "character_names": ["Roan Christopher McKichan", "Paris Damon Lehane"], "language": "English", "publish_date": "2010-12-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18278085-catch-a-ghost", "num_ratings": "4,599", "num_reviews": "639", "avg_ratings": 3.97, "genres": ["Romance", "M M Romance", "War", "Military Fiction", "Romance", "Contemporary", "Mystery"], "title": "Catch a Ghost", "description": ["Everyone knows that Prophet—former Navy SEAL, former CIA spook, full-time pain in the ass—works alone and thinks only about the trouble he can cause. But his boss, Phil Butler of Extreme Escapes, LTD., has just assigned Proph not only a new partner but also a case haunted by ghosts from Proph’s past. Suddenly, he’s got to confront them both head on.", "Tom Boudreaux—failed FBI", "Everyone knows that Prophet—former Navy SEAL, former CIA spook, full-time pain in the ass—works alone and thinks only about the trouble he can cause. But his boss, Phil Butler of Extreme Escapes, LTD., has just assigned Proph not only a new partner but also a case haunted by ghosts from Proph’s past. Suddenly, he’s got to confront them both head on.", "Tom Boudreaux—failed FBI agent, failed sheriff, full time believer in bad luck—is wondering why the head of a private contracting firm has hunted him down to offer him a job. Still he's determined to succeed this time, despite being partnered with Prophet, EE, LTD’s most successful, lethal, and annoying operative, and even though the case is also resurrecting his own painful past.", "Together, Prophet and Tom must find a way to take down killers in the dangerous world of underground cage matches, while fighting their own dangerous attraction. And when they find themselves caught in the crossfire, these two loners are forced to trust each other and work together to escape their ghosts . . . or pay the price."], "author": "S.E. Jakes", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-13 00:00:00", "ISBN": "1626490392"},
{"url": "https://www.goodreads.com/book/show/21880559-fair-play", "num_ratings": "2,598", "num_reviews": "357", "avg_ratings": 4.16, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "Fair Play", "description": ["Fifty years ago, Roland Mills belonged to a violent activist group. Now, someone is willing to kill to prevent him from publishing his memoirs.", "When ex-FBI agent Elliot Mills is called out to examine the charred ruins of his childhood home, he quickly identifies the fire for what it is--arson. A knee injury may have forced Elliot out of the Bureau, but it's not going to sto", "Fifty years ago, Roland Mills belonged to a violent activist group. Now, someone is willing to kill to prevent him from publishing his memoirs.", "When ex-FBI agent Elliot Mills is called out to examine the charred ruins of his childhood home, he quickly identifies the fire for what it is--arson. A knee injury may have forced Elliot out of the Bureau, but it's not going to stop him from bringing the man who wants his father dead to justice.", "Agent Tucker Lance is still working to find the serial killer who's obsessed with Elliot and can't bear the thought of his lover putting himself in additional danger. Straightlaced Tucker has never agreed with radical Roland on much--\"opposing political viewpoints\" is an understatement--but they're united on this: Elliot needs to leave the case alone. Now.", "Tucker would do nearly anything for the man he loves, but he won't be used to gain Elliot access to the FBI's resources. When the past comes back to play and everything both men had known to be true is questioned, their fragile relationship is left hanging in the balance.", "68,000 words"], "author": "Josh Lanyon", "num_pages": "199", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-11-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18698511-full-disclosure", "num_ratings": "4,936", "num_reviews": "691", "avg_ratings": 4.28, "genres": ["Romance", "M M Romance", "Romance", "Contemporary"], "title": "Full Disclosure", "description": ["Deputy United States Marshal Mitch Knox apprehends fugitives for a living. His calm, cool, collected attitude and devastatingly handsome good looks earn him a well-deserved bad boy reputation, both in the field and out. While away on an assignment, he blows off some steam at a notorious Dallas nightclub. Solving the case that has plagued him for months takes a sudden backs", "Deputy United States Marshal Mitch Knox apprehends fugitives for a living. His calm, cool, collected attitude and devastatingly handsome good looks earn him a well-deserved bad boy reputation, both in the field and out. While away on an assignment, he blows off some steam at a notorious Dallas nightclub. Solving the case that has plagued him for months takes a sudden backseat to finding out all there is to know about the gorgeous, shy blond sitting alone at the bar.", "Texas State Trooper Cody Turner is moving up the ranks, well on his way to his dream of being a Texas Ranger. While on a two-week mandatory vacation, he plans to relax and help out on his family’s farm. Mitch is the last distraction Cody needs, but the tatted up temptation that walks into the bar and steals his baseball cap is too hard to ignore.", "As Mitch’s case gains nationwide attention, how will he convince the sexy state trooper that giving him a chance won’t jeopardize his life’s plan...especially when the evil he’s tracking brings the hate directly to his doorstep, threatening more than just their careers"], "author": "Kindle Alexander", "num_pages": "350", "awards": [], "places": ["Washington, D.C.", "Texas"], "character_names": [], "language": "English", "publish_date": "2014-09-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17282116-every-move-he-makes", "num_ratings": "1,226", "num_reviews": "183", "avg_ratings": 3.91, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Mystery", "Suspense"], "title": "Every Move He Makes", "description": ["Keeping an eye on his charge isn’t easy. Keeping his hands off? Impossible…", "It took attending his own funeral to force Logan to accept a new life as an undercover MI6 agent. That doesn’t make his latest assignment any less aggravating. Babysitting a Russian pop star with delusions that someone’s trying to kill him.", "Other than an inexplicable attraction Logan ruthlessly suppr", "Keeping an eye on his charge isn’t easy. Keeping his hands off? Impossible…", "It took attending his own funeral to force Logan to accept a new life as an undercover MI6 agent. That doesn’t make his latest assignment any less aggravating. Babysitting a Russian pop star with delusions that someone’s trying to kill him.", "Other than an inexplicable attraction Logan ruthlessly suppresses, he couldn’t have less in common with the irritating, arrogant rich kid. He’s even prepared to walk away—until very real bullets start flying.", "After his mother’s death, Zak Kochenkov’s life unravels in an impenetrable haze of grief, drugs and alcohol—until one bodyguard candidate stands out. Except his hopes of having some fun with that guard’s body evaporate when he realizes Logan is buttoned up tighter than a clam.", "The first thing Logan learns is that his charge won’t do as he’s told. And there’s some secret behind his haunted eyes that shakes Logan’s resolve to keep him at arm’s length. Because he knows if he lets passion close his eyes, that’s when danger will find them both…"], "author": "Barbara Elsborg", "num_pages": "324", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2159989.Boy_Meets_Body", "num_ratings": "366", "num_reviews": "42", "avg_ratings": 4.07, "genres": ["Romance", "M M Romance", "Mystery", "Anthologies", "Romance", "Glbt", "Gay", "Contemporary"], "title": "Boy Meets Body", "description": ["BOY MEETS BODY #1 in the PARTNERS in CRIME series Two young lives snuffed out, half a century a part, half a continent apart. The men who solve the murders also have to solve riddles in their own lives. Love is never easy. Sometimes, if you're lucky, you can give your life to it. Sometimes, though, if you're not so lucky, you can give your life for it... ", "BOY MEETS BODY #1 in the PARTNERS in CRIME series Two young lives snuffed out, half a century a part, half a continent apart. The men who solve the murders also have to solve riddles in their own lives. Love is never easy. Sometimes, if you're lucky, you can give your life to it. Sometimes, though, if you're not so lucky, you can give your life for it... ", " Fifty years ago a glamorous Hollywood party ended in murder-the only clue a bloody Tarot card. Timothy North is trying to find out what happened that long ago summer's night, but when a Tarot card turns up pinned to his front door, the only person Tim can turn to for help is his ex-lover, Detective Jack Brady. ", " Peter Moon, proprietor of a charming little get-away in the Land of the Midnight Sun, finds himself headed for less comfortable accommodations when he's accused of murder. Then his personal heartbreak showed up, fresh from six months in a Yukon River fish camp, determined to help."], "author": "Josh Lanyon", "num_pages": "184", "awards": [], "places": ["Alaska"], "character_names": [], "language": "English", "publish_date": "2007-10-01 00:00:00", "ISBN": "1934531006"},
{"url": "https://www.goodreads.com/book/show/61534.Death_Trick", "num_ratings": "644", "num_reviews": "70", "avg_ratings": 3.85, "genres": ["Mystery", "Romance", "M M Romance", "Lgbt"], "title": "Death Trick", "description": ["A young man has been brutally murdered. The gay son of a wealthy family has disappeared. Now it's up to private dick Don Strachey to get to the bottom of this mess--even if he has to cruise every gay bar in the city to do it Don Strachey isn't exactly the most sought-after private eye in Albany, New York. In fact, this gay P.I. has gotten to the point of having to write ch", "A young man has been brutally murdered. The gay son of a wealthy family has disappeared. Now it's up to private dick Don Strachey to get to the bottom of this mess--even if he has to cruise every gay bar in the city to do it Don Strachey isn't exactly the most sought-after private eye in Albany, New York. In fact, this gay P.I. has gotten to the point of having to write checks to pay his tab at the cheapest lunch counter in town. And he isn't sure that the latest one, for the grand total of two dollars and ninety-three cents, is going to clear. Then the phone rings. Billy Blount, the gay heir to one of Saratoga Springs' upper-crust families, has disappeared, and his parents want him back. On top of that, Billy, a young and outspoken gay activist, is wanted for the grizzly murder of the man he slept with on his last night in Albany--a man he'd never met before that night ", "Set in the glorious, promiscuous pre-HIV late 1970s, Death Trick: A Murder Mystery is a fast-paced excursion through the seamy underside of gay Albany. From gay discos where the hard-pumping music never stops, to the city's infamous baths, to the dark alley behind the local precinct house, this hard-bitten private dick searches for answers to the questions that plague Billy's parents and the police. With his faithful companion (and unfaithful lover) Timmy, plus a cast of characters that includes drag queens, ex-jock gay bar owners, homophobic cops, male hustlers, and wealthy suburbanites, Strachey begins a chase that leads him to seedy gay bars, posh suburban homes, and pricey mental institutions where they use electric shock to destroy \"sick\" gay tendencies."], "author": "Richard Stevenson", "num_pages": "199", "awards": [], "places": ["Albany, New York", "New York (the state)"], "character_names": ["Donald Strachey", "Timothy Callahan"], "language": "English", "publish_date": "2003-09-01 00:00:00", "ISBN": "1560234709"},
{"url": "https://www.goodreads.com/book/show/6726150-deadly-slumber", "num_ratings": "304", "num_reviews": "29", "avg_ratings": 3.88, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Glbt", "Gay"], "title": "Deadly Slumber", "description": ["The House of the Dead: a mortuary whose directors are drop dead gorgeous and terminally horny-and one of them up to mischief. Stanley and Tom try to separate the naturally dead from the murdered dead and find themselves awash with coffins-until they come to the one Stanley's name on it.", "Deadly Slumber indeed"], "author": "Victor J. Banis", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6033472-holiday-outing", "num_ratings": "813", "num_reviews": "126", "avg_ratings": 3.82, "genres": ["Romance", "M M Romance", "Contemporary", "Holiday", "Romance", "Mystery"], "title": "Holiday Outing", "description": ["Jonah hasn't seen his family in twelve years. They don't know he's gay. Now he's trapped with them in the storm of a century. A family heirloom has been stolen. And now, his childhood rival, Ethan, has arrived to steal his heart. ", "Jonah hasn't seen his family in twelve years. They don't know he's gay. Now he's trapped with them in the storm of a century. A family heirloom has been stolen. And now, his childhood rival, Ethan, has arrived to steal his heart. "], "author": "Astrid Amara", "num_pages": "147", "awards": [], "places": ["Connecticut"], "character_names": ["Jonah Levinson", "Dr. Ethan Rosenberg"], "language": "English", "publish_date": "2008-12-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3152265-false-confessions", "num_ratings": "58", "num_reviews": "14", "avg_ratings": 4.14, "genres": ["Mystery", "Romance", "M M Romance", "Glbt", "Gay", "Fiction", "Thriller", "Mystery Thriller"], "title": "False Confessions", "description": ["CATCH A KILLER — No one needed this: a serial killer who left his victims naked but for dozens of long, murderous needles. Doug Orlando, the New York cop who had the guts to come out of the closet, was desperately trying to crack the case when another murder came his way. A priest had been found before his altar, bludgeoned with a bat. Were the two cases connected? Orlando", "CATCH A KILLER — No one needed this: a serial killer who left his victims naked but for dozens of long, murderous needles. Doug Orlando, the New York cop who had the guts to come out of the closet, was desperately trying to crack the case when another murder came his way. A priest had been found before his altar, bludgeoned with a bat. Were the two cases connected? Orlando's search led him through the underside of modern, urban Catholicism to New York's S & M playgrounds, and a tattoo parlor that left its own unique mark on its patrons. But the closer Orlando got to the truth, the more he came face-to-face with something far more dangerous: a cop with murder in his soul ..."], "author": "Steve Neil Johnson", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-01 00:00:00", "ISBN": "0451403835"},
{"url": "https://www.goodreads.com/book/show/24401069-two-nick-nowak-novellas", "num_ratings": "358", "num_reviews": "70", "avg_ratings": 4.3, "genres": ["Romance", "M M Romance", "Mystery", "Historical", "Contemporary"], "title": "Two Nick Nowak Novellas", "description": ["In the two novellas that make up the third book in the popular Boystown Mysteries private Investigator Nick Nowak works two challenging cases and grapples with an even more challenging personal life. In Little Boy Boom, Nick’s car explodes when a thief attempts to steal it. Realizing the bomb was meant for him, Nick sets out to discover who wants him dead only to find that", "In the two novellas that make up the third book in the popular Boystown Mysteries private Investigator Nick Nowak works two challenging cases and grapples with an even more challenging personal life. In Little Boy Boom, Nick’s car explodes when a thief attempts to steal it. Realizing the bomb was meant for him, Nick sets out to discover who wants him dead only to find that the list of possible suspects is longer than he’d like. When he begins to run out of suspects he wonders if the bomb was truly meant for him. Little Boy Tenor finds Nick investigating the murderer of a church choir’s star tenor, while at the same time his friend Ross asks him to discover the truth behind his lover, Earl Silver’s mysterious death. As he juggles the two cases, he becomes increasingly disturbed by what he learns."], "author": "Marshall Thornton", "num_pages": "194", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18333332-spook-squad", "num_ratings": "2,465", "num_reviews": "382", "avg_ratings": 4.32, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Fantasy", "Urban Fantasy", "Paranormal", "Ghosts"], "title": "Spook Squad", "description": ["Everyone enjoys peace and tranquility, and Victor Bayne is no exception. He goes to great lengths to maintain a harmonious home with his partner, Jacob. Although the cannery is huge, it’s grown difficult to avoid the elephant in the room…the elephant with the letters FPMP scrawled on its hide.", "Once Jacob surrendered his PsyCop badge, he infiltrated the Federal Psychic Monit", "Everyone enjoys peace and tranquility, and Victor Bayne is no exception. He goes to great lengths to maintain a harmonious home with his partner, Jacob. Although the cannery is huge, it’s grown difficult to avoid the elephant in the room…the elephant with the letters FPMP scrawled on its hide.", "Once Jacob surrendered his PsyCop badge, he infiltrated the Federal Psychic Monitoring Program. In his typical restrained fashion, he hasn’t been sharing much about what he actually does behind its vigilantly guarded doors. And true to form, Vic hasn’t asked. In fact, he would prefer not to think about the FPMP at all, since he’s owed Director Dreyfuss an exorcism since their private flight to PsyTrain.", "While Vic has successfully avoided FPMP entanglement for several months, now his debt has finally come due."], "author": "Jordan Castillo Price", "num_pages": "321", "awards": [], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Victor Bayne", "Jacob Marks"], "language": "English", "publish_date": "2013-08-30 00:00:00", "ISBN": "1935540661"},
{"url": "https://www.goodreads.com/book/show/18074870-a-case-of-possession", "num_ratings": "5,218", "num_reviews": "616", "avg_ratings": 4.26, "genres": ["Romance", "M M Romance", "Fantasy", "Historical", "Romance", "Fantasy", "Paranormal", "Fantasy", "Magic"], "title": "A Case of Possession", "description": ["Lord Crane has never had a lover quite as elusive as Stephen Day. True, Stephen’s job as justiciar requires secrecy, but the magician’s disappearing act bothers Crane more than it should. When a blackmailer threatens to expose their illicit relationship, Crane knows a smart man would hop the first ship bound for China. But somethin", "Lord Crane has never had a lover quite as elusive as Stephen Day. True, Stephen’s job as justiciar requires secrecy, but the magician’s disappearing act bothers Crane more than it should. When a blackmailer threatens to expose their illicit relationship, Crane knows a smart man would hop the first ship bound for China. But something unexpectedly stops him. His heart.", "Stephen has problems of his own. As he investigates a plague of giant rats sweeping London, his sudden increase in power, boosted by his blood-and-sex bond with Crane, is rousing suspicion that he’s turned warlock. With all eyes watching him, the threat of exposure grows. Stephen could lose his friends, his job and his liberty over his relationship with Crane. He’s not sure if he can take that risk much longer. And Crane isn’t sure if he can ask him to.", "The rats are closing in, and something has to give…"], "author": "K.J. Charles", "num_pages": "159", "awards": [], "places": ["London, England"], "character_names": ["Lucien Vaudrey", "Stephen Day", "Frank Merrick"], "language": "English", "publish_date": "2014-01-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17912488-whiskey-and-wry", "num_ratings": "2,473", "num_reviews": "319", "avg_ratings": 4.19, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Whiskey and Wry", "description": ["He was dead. And it was murder most foul. If erasing a man’s existence could even be called murder.", "When Damien Mitchell wakes, he finds himself without a life or a name. The Montana asylum’s doctors tell him he’s delusional and his memories are all lies: he’s really Stephen Thompson, and he’d gone over the edge, obsessing about a rock star who died in a fiery crash. His ch", "He was dead. And it was murder most foul. If erasing a man’s existence could even be called murder.", "When Damien Mitchell wakes, he finds himself without a life or a name. The Montana asylum’s doctors tell him he’s delusional and his memories are all lies: he’s really Stephen Thompson, and he’d gone over the edge, obsessing about a rock star who died in a fiery crash. His chance to escape back to his own life comes when his prison burns, but a gunman is waiting for him, determined that neither Stephen Thompson nor Damien Mitchell will escape.", "With the assassin on his tail, Damien flees to the City by the Bay, but keeping a low profile is the only way he’ll survive as he searches San Francisco for his best friend, Miki St. John. Falling back on what kept him fed before he made it big, Damien sings for his supper outside Finnegan’s, an Irish pub on the pier, and he soon falls in with the owner, Sionn Murphy. Damien doesn’t need a complication like Sionn, and to make matters worse, the gunman—who doesn’t mind going through Sionn or anyone else if that’s what it takes kill Damien—shows up to finish what he started."], "author": "Rhys Ford", "num_pages": "254", "awards": [], "places": ["California"], "character_names": ["Damien Stephen Mitchell"], "language": "English", "publish_date": "2013-08-19 00:00:00", "ISBN": "1627980784"},
{"url": "https://www.goodreads.com/book/show/18633099-stormhaven", "num_ratings": "2,986", "num_reviews": "391", "avg_ratings": 4.3, "genres": ["Romance", "M M Romance", "Historical", "Fantasy", "Paranormal", "Fantasy", "Romance", "Mystery"], "title": "Stormhaven", "description": ["Mysterious happenings are nothing new to reclusive scholar Percival Endicott Whyborne, but finding one of his colleagues screaming for help in the street is rather unusual. Allan Tambling claims he can’t remember any of the last hour—but someone murdered his uncle, and Allan is covered in blood. ", "Whyborne’s lover, dashing ex-Pinkerton detective Griffin Flaherty, agrees to p", "Mysterious happenings are nothing new to reclusive scholar Percival Endicott Whyborne, but finding one of his colleagues screaming for help in the street is rather unusual. Allan Tambling claims he can’t remember any of the last hour—but someone murdered his uncle, and Allan is covered in blood. ", "Whyborne’s lover, dashing ex-Pinkerton detective Griffin Flaherty, agrees to prove Allan’s innocence. But when Allan is deemed insane and locked away in the Stormhaven Lunatic Asylum, Griffin finds himself reliving the horrifying memories of his own ordeal inside a madhouse.", "Along with their friend Christine, the two men become drawn deeper and deeper into a dark web of conspiracy, magic, and murder. Their only clue: a missing artifact depicting an unknown god. Who stole the artifact, and why can’t Allan remember what happened? And what is the truth behind the terrible experiments conducted on Stormhaven’s forbidden fourth floor?", "It will take all of Whyborne’s sorcery and Griffin’s derring-do to stop the murderers and save Allan. But first, they must survive an even greater challenge: a visit from Griffin’s family."], "author": "Jordan L. Hawk", "num_pages": "176", "awards": [], "places": ["Massachusetts"], "character_names": ["Griffin Flaherty", "Percival Endicott Whyborne"], "language": "English", "publish_date": "2013-12-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23109724-love-and-punishment", "num_ratings": "295", "num_reviews": "55", "avg_ratings": 3.92, "genres": ["Romance", "M M Romance", "Romance", "Mystery", "Suspense", "Contemporary"], "title": "Love and Punishment", "description": ["FROM DARKNESS", "AND LIGHT", "Someone is leaving a trail of bodies throughout London, and Detective Anthony Parglietto is determined to end the violence. Then he’ll return to the man he loves.", "Tough, street-savvy, and used to dealing with lowlifes, Flynn Parker is the last person Anthony thinks he has to protect. Then the Bow-Tie Killer strikes close to home and the world turns ups", "FROM DARKNESS", "AND LIGHT", "Someone is leaving a trail of bodies throughout London, and Detective Anthony Parglietto is determined to end the violence. Then he’ll return to the man he loves.", "Tough, street-savvy, and used to dealing with lowlifes, Flynn Parker is the last person Anthony thinks he has to protect. Then the Bow-Tie Killer strikes close to home and the world turns upside down. Right is wrong, black is white, and a policeman might become a monster. But in the name of love, justice must be served. In the name of love, pain can be endured. In the name of love, a man can taste the very essence that defines him."], "author": "Susan Mac Nicol", "num_pages": "261", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6516978-like-coffee-and-doughnuts", "num_ratings": "1,470", "num_reviews": "179", "avg_ratings": 3.75, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance"], "title": "Like Coffee and Doughnuts", "description": ["Dino Martini might accept his friend Seth as a lover--if they can stay alive.", "Dino Martini is an old-school P.I. in a modern age. Sure, he may do most of his work on a computer, but he carries a gun, drives a convertible, and lives on the beach. Best friend and mechanic Seth Donnelly will back him in a fight, and there's not a lot more Dino could ask from life.", "< Until hi", "Dino Martini might accept his friend Seth as a lover--if they can stay alive.", "Dino Martini is an old-school P.I. in a modern age. Sure, he may do most of his work on a computer, but he carries a gun, drives a convertible, and lives on the beach. Best friend and mechanic Seth Donnelly will back him in a fight, and there's not a lot more Dino could ask from life.", "< Until his world is turned upside down.", "A dangerous case and a new apartment are just the start. His friendship with Seth has turned into a romance, only Dino has never had a boyfriend before. Can he handle this sudden twist? Just as he begins to believe it's possible, he loses Seth in more ways than one..."], "author": "Elle Parker", "num_pages": "246", "awards": [], "places": ["Florida"], "character_names": ["Dino Martini", "Seth Donnelly"], "language": "English", "publish_date": "2009-05-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5958281-the-elegant-corpse", "num_ratings": "1,328", "num_reviews": "160", "avg_ratings": 3.8, "genres": ["Romance", "M M Romance", "Erotica", "Bdsm", "Mystery", "Contemporary", "Romance"], "title": "The Elegant Corpse", "description": ["Detective Roger Corso is open about his sexual orientation. He's less forthcoming about his leather lifestyle. He thinks he's doing a pretty good job of keeping it covert, but then something happen that changes his mind.", "Someone delivers an elegantly clothed corpse to his home. His couch to be precise. And that corpse is carrying a leather flogger. Roger's taking that perso", "Detective Roger Corso is open about his sexual orientation. He's less forthcoming about his leather lifestyle. He thinks he's doing a pretty good job of keeping it covert, but then something happen that changes his mind.", "Someone delivers an elegantly clothed corpse to his home. His couch to be precise. And that corpse is carrying a leather flogger. Roger's taking that personally.", "Additional distraction comes in the form of the victim's younger brother Sean. He's annoying. Knows something about the murder he's not telling. Wants something from Roger--and is everything Roger ever wanted. But before he can make Sean his, he's going to have to solve the mystery of the elegant corpse.", "[Publisher's Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, BDSM with significant D/s play, male/male sexual practices, spanking, strong violence.]"], "author": "A.M. Riley", "num_pages": "152", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2008-05-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1046382.Oleander_House", "num_ratings": "1,581", "num_reviews": "179", "avg_ratings": 3.56, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Horror"], "title": "Oleander House", "description": ["Book One in the Bay City Paranormal Investigation series.", "Sam Raintree has never been normal. All his life, he's experienced thi", "Book One in the Bay City Paranormal Investigation series.", "Sam Raintree has never been normal. All his life, he's experienced things he can't explain. Things that have colored his view of the world and of himself. So taking a job as a paranormal investigator seems like a perfect fit. His new co-workers, he figures, don't have to know he's gay. ", "When Sam arrives at Oleander House, the site of his first assignment with Bay City Paranormal Investigations, nothing is what he expected. The repetitive yet exciting work, the unusual and violent history of the house, the intensely erotic and terrifying dreams which plague his sleep. But the most unexpected thing is Dr. Bo Broussard, the group's leader.", "From the moment they meet, Sam is strongly attracted to his intelligent, alluring boss. It doesn't take Sam long to figure out that although Bo has led a heterosexual life, he is very much in the closet, and wants Sam as badly as Sam wants him. ", "As the investigation of Oleander House progresses and paranormal events in the house escalate, Sam and Bo circle warily around their mutual attraction, until a single night of bloodshed and revelation changes their lives forever. "], "author": "Ally Blue", "num_pages": "228", "awards": [], "places": ["Mississippi"], "character_names": ["Sam Raintree", "Bo Broussard"], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "1599983559"},
{"url": "https://www.goodreads.com/book/show/6537059-the-geography-of-murder", "num_ratings": "454", "num_reviews": "47", "avg_ratings": 3.72, "genres": ["Romance", "M M Romance", "Contemporary", "Erotica", "Bdsm", "Suspense", "Glbt", "Gay"], "title": "The Geography Of Murder", "description": ["All Jason Zachary wants is to keep the loneliness and despair at bay. He escapes to the clubs where drugs and a warm body for the night offer fleeting comfort. But when he wakes one morning, dazed after another blackout, to find himself in bed with a dead body, his life careens him into the arms of Detective Alexander Spider. For Jason, Spider becomes an addiction, a drug", "All Jason Zachary wants is to keep the loneliness and despair at bay. He escapes to the clubs where drugs and a warm body for the night offer fleeting comfort. But when he wakes one morning, dazed after another blackout, to find himself in bed with a dead body, his life careens him into the arms of Detective Alexander Spider. For Jason, Spider becomes an addiction, a drug that makes him feel alive and safe; his body craves Spider's control, and Jason falls hard. ", "But Alex Spider sees the darker side of humanity daily, and he isn't looking for connections, only to drown himself in encounters with nameless subs willing to let him play his bondage games. His attraction to Jason begins as lust for one more golden boy, but their games of pain and pleasure grow into a tenuous trust, arousing feelings in Spider that are the first light he's seen in a long time. ", "But as Spider races to solve a brutal homicide, the daily grind of the job takes its toll, and Spider's control slips dangerously. A killer closes in, and Spider must confront his own inner darkness, while Jason struggles to save himself by making some hard choices."], "author": "P.A. Brown", "num_pages": "372", "awards": [], "places": ["Santa Barbara, California"], "character_names": ["Jason Aaron Zachary", "Alexander Spider"], "language": "English", "publish_date": "2009-06-01 00:00:00", "ISBN": "1608200558"},
{"url": "https://www.goodreads.com/book/show/17347222-the-little-death", "num_ratings": "584", "num_reviews": "83", "avg_ratings": 3.93, "genres": ["Mystery", "Romance", "M M Romance", "Lgbt", "Fiction", "Mystery", "Crime"], "title": "The Little Death", "description": ["In the first book of the acclaimed Henry Rios series, a lawyer doggedly pursues a murder investigation into the lion’s den of San Francisco’s moneyed elite", "Henry Rios meets Hugh Paris when Paris is arrested for drug possession and being high on PCP. A burnt-out public defender battling alcoholism, Rios has reached a crossroads in his life. While interviewing Paris in jail,", "In the first book of the acclaimed Henry Rios series, a lawyer doggedly pursues a murder investigation into the lion’s den of San Francisco’s moneyed elite", "Henry Rios meets Hugh Paris when Paris is arrested for drug possession and being high on PCP. A burnt-out public defender battling alcoholism, Rios has reached a crossroads in his life. While interviewing Paris in jail, Rios goes through the motions, but notices that Paris is far more polished and well-off than the usual drug suspects. Paris is mysteriously bailed out—but a few weeks later, he turns up on Rios’s doorstep. Skittish and paranoid, he admits to using heroin and says he’s afraid that his wealthy grandfather wants to murder him.", "Rios tries to help Paris get clean, but when Paris is found dead of an apparent heroin overdose, Rios is the only one who considers foul play. Determined to find Paris’s killer, Rios knocks on San Francisco’s most gilded doors, where he discovers a family tainted by jealousy, greed, and hate. They’ve been warped by a fortune someone’s willing to kill—and kill again—to possess.", "At once an atmospheric noir mystery and a scathing indictment of a legal system caught in the maws of escalating corruption, The Little Death chronicles one man’s struggle to achieve true justice for all."], "author": "Michael Nava", "num_pages": "165", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-19 00:00:00", "ISBN": "1480401838"},
{"url": "https://www.goodreads.com/book/show/6758368-immortality-is-the-suck", "num_ratings": "734", "num_reviews": "105", "avg_ratings": 3.62, "genres": ["Romance", "M M Romance", "Paranormal", "Vampires", "Fantasy", "Paranormal", "Romance", "Fantasy"], "title": "Immortality is the Suck", "description": ["Adam's an undercover vice cop dealing with a dark past. He's no stranger to bad nights; in fact, he's lived a lot of them. But he won't survive this one. First, a drug deal he's working goes south. Then his partner and sometimes sex partner Peter has to watch him bleed to death. But the kicker: he's not sure what's worse. Watching Peter cry over him or waking up undead.", "Pet", "Adam's an undercover vice cop dealing with a dark past. He's no stranger to bad nights; in fact, he's lived a lot of them. But he won't survive this one. First, a drug deal he's working goes south. Then his partner and sometimes sex partner Peter has to watch him bleed to death. But the kicker: he's not sure what's worse. Watching Peter cry over him or waking up undead.", "Peter's a good cop in love with a bad man. Or a bad vampire, now. Watching Adam die was the worst thing he could imagine. Until he woke up. Now their relationship's in crisis. Adam's in the middle of a vampire enclave at the center of Los Angeles motorcycle clubs and Peter just can't hack it.", "Adam thinks he's fine with that. He's a commitment-phobe. But he's about to discover, immortality is seriously the suck."], "author": "A.M. Riley", "num_pages": "256", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2009-08-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7176018-old-poison", "num_ratings": "2,493", "num_reviews": "206", "avg_ratings": 3.9, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Mystery", "Crime"], "title": "Old Poison", "description": [" ", "Happy Birthday, Taylor! Taylor has pretty well recovered from his shooting, but not everyone is happy to see him reach his next birthday. Does a cobra pickled in a bottle of wine means someone cares enough to send the very death -- best?"], "author": "Josh Lanyon", "num_pages": "102", "awards": [], "places": ["Ventura, California", "Los Angeles, California", "San Diego, California", "Casmalia, California", "California"], "character_names": ["WIlliam \"Will\" Brandt, Jr", "Taylor MacAllister"], "language": "English", "publish_date": "2011-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15853341-dirty-secret", "num_ratings": "2,145", "num_reviews": "309", "avg_ratings": 4.29, "genres": ["Romance", "M M Romance", "Romance", "Mystery", "Contemporary"], "title": "Dirty Secret", "description": ["Loving Kim Jae-Min isn’t always easy: Jae is gun-shy about being openly homosexual. Ex-cop turned private investigator Cole McGinnis doesn’t know any other way to be. Still, he understands where Jae is coming from. Traditional Korean men aren’t gay—at least not usually where people can see them. ", "But Cole can’t spend too much time unraveling his boyfriend’s issues. He has a", "Loving Kim Jae-Min isn’t always easy: Jae is gun-shy about being openly homosexual. Ex-cop turned private investigator Cole McGinnis doesn’t know any other way to be. Still, he understands where Jae is coming from. Traditional Korean men aren’t gay—at least not usually where people can see them. ", "But Cole can’t spend too much time unraveling his boyfriend’s issues. He has a job to do. When a singer named Scarlet asks him to help find Park Dae-Hoon, a gay Korean man who disappeared nearly two decades ago, Cole finds himself submerged in the tangled world of rich Korean families, where obligation and politics mean sacrificing happiness to preserve corporate empires. Soon the bodies start piling up without rhyme or reason. With every step Cole takes toward locating Park Dae-Hoon, another person meets their demise—and someone Cole loves could be next on the murderer’s list."], "author": "Rhys Ford", "num_pages": "234", "awards": [], "places": ["California", "Los Angeles, California"], "character_names": [], "language": "English", "publish_date": "2012-09-28 00:00:00", "ISBN": "1613727755"},
{"url": "https://www.goodreads.com/book/show/24806206-murder-book", "num_ratings": "301", "num_reviews": "73", "avg_ratings": 4.53, "genres": ["Romance", "M M Romance", "Mystery", "Mystery", "Crime", "Historical"], "title": "Murder Book", "description": ["In the second of the Boystown mysteries to be a finalist for the Lambda Award, it’s fall 1982 and Chicago is gripped by panic after five people die from poisoned Tylenol capsules. Amid the chaos, the Bughouse Slasher takes his eighth victim, this time striking close to private investigator Nick Nowak. With the Chicago Police Department stretched to its limit, Nick takes ma", "In the second of the Boystown mysteries to be a finalist for the Lambda Award, it’s fall 1982 and Chicago is gripped by panic after five people die from poisoned Tylenol capsules. Amid the chaos, the Bughouse Slasher takes his eighth victim, this time striking close to private investigator Nick Nowak. With the Chicago Police Department stretched to its limit, Nick takes matters into his own hands. But what will he do with the Bughouse Slasher once he finds him."], "author": "Marshall Thornton", "num_pages": "184", "awards": ["Lambda Literary Award Nominee for Gay Mystery (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17736067-ball-chain", "num_ratings": "6,682", "num_reviews": "993", "avg_ratings": 4.1, "genres": ["Romance", "M M Romance", "Romance", "Mystery", "Contemporary", "War", "Military Fiction"], "title": "Ball & Chain", "description": ["Home from their unexpected deployment, the former members of Marine Force Recon team Sidewinder rejoin their loved ones and try to pick up the pieces of the lives they were forced to leave behind. Ty Grady comes home to Zane Garrett, only to find that everything around him has changed—even the men he went to war with. He barely has time to adjust before his brother, Deuce,", "Home from their unexpected deployment, the former members of Marine Force Recon team Sidewinder rejoin their loved ones and try to pick up the pieces of the lives they were forced to leave behind. Ty Grady comes home to Zane Garrett, only to find that everything around him has changed—even the men he went to war with. He barely has time to adjust before his brother, Deuce, asks Ty to be his best man. But that isn’t all Deuce asks Ty to do, and Ty must call for backup to deal with the business issues of Deuce’s future father-in-law.", "Nick O’Flaherty and Kelly Abbott join Ty and Zane at the wedding on an island in Scotland, thinking they’re there to assuage Deuce’s paranoia. But when bodies start dropping and boats start sinking, the four men get more involved with the festivities than they’d ever planned to.", "With the clock ticking and the killer just as stuck on the isolated island as they are, Ty and Zane must navigate a veritable minefield of family, friends, and foes to stop the whole island from being destroyed."], "author": "Abigail Roux", "num_pages": "288", "awards": [], "places": [], "character_names": ["Beaumont \"Ty\" Tyler Grady", "Zane Zachary Garrett", "Nick O'Flaherty", "Deacon \"Deuce\" Grady", "Kelly Abbott"], "language": "English", "publish_date": "2014-03-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26157385-the-mermaid-murders", "num_ratings": "2,218", "num_reviews": "380", "avg_ratings": 4.23, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Mystery", "Crime"], "title": "The Mermaid Murders", "description": ["Special Agent Jason West is seconded from the FBI Art Crime Team to temporarily partner with disgraced, legendary “manhunter” Sam Kennedy when it appears that Kennedy’s most famous case, the capture and conviction of a serial killer known as The Huntsman, may actually have been a disastrous failure.", "For The Huntsman is still out there… and the killing has begun again."], "author": "Josh Lanyon", "num_pages": "243", "awards": [], "places": ["Kingsfield, Worcester County, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2016-02-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3741522-first-you-fall", "num_ratings": "1,115", "num_reviews": "161", "avg_ratings": 3.88, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Mystery", "Crime", "Romance", "Lgbt"], "title": "First You Fall", "description": ["When his friend's death is ruled a suicide, Kevin Connor—a hustler by trade, sleuth by default—sets out to prove a case of murder. It doesn't help matters that the victim's grown children, who disapproved of their father's gay lifestyle, are only concerned about their inheritance. But they are not Kevin's only problem. His high-strung mother has moved in with him—and she k", "When his friend's death is ruled a suicide, Kevin Connor—a hustler by trade, sleuth by default—sets out to prove a case of murder. It doesn't help matters that the victim's grown children, who disapproved of their father's gay lifestyle, are only concerned about their inheritance. But they are not Kevin's only problem. His high-strung mother has moved in with him—and she knows nothing about his questionable . . . job."], "author": "Scott  Sherman", "num_pages": "253", "awards": ["Lambda Literary Award for Gay Mystery (2008)"], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2008-06-01 00:00:00", "ISBN": "1593500599"},
{"url": "https://www.goodreads.com/book/show/9574343-trust-me-if-you-dare", "num_ratings": "1,478", "num_reviews": "158", "avg_ratings": 4.15, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance", "Humor", "Funny"], "title": "Trust Me If You Dare", "description": ["Feisty New Yorker Caesar Romano has a knack for getting into a jam, and this week is no exception. When his pregnancy-hormone-buzzed business partner sweet talks him into working a solo gig for his famous ex, Caesar attracts the worst kind of attention.", "It’s only the beginning. Hit on by a lusty German, stalked by the paparazzi, victim of an un", "Feisty New Yorker Caesar Romano has a knack for getting into a jam, and this week is no exception. When his pregnancy-hormone-buzzed business partner sweet talks him into working a solo gig for his famous ex, Caesar attracts the worst kind of attention.", "It’s only the beginning. Hit on by a lusty German, stalked by the paparazzi, victim of an unexpected airbag attack—and desperate for some part-time help—Ce’s running out of time, staff and patience. But what’s really got him poised to run? A looming brunch with his sexy lover’s esteemed family.", "PI Dan Albright is a man of many gifts: investigation, security, sex talk and driving Caesar nuts in and out of the bedroom. Hired to protect an outrageous soap star from a deranged personal assistant, Dan’s got his hands full refereeing rival actors, locating one four-foot-eleven woman…and convincing Ce that he’s playing for keeps.", "Hey, nobody ever said taking a relationship to the next level was a waltz in the park."], "author": "L.B. Gregg", "num_pages": "158", "awards": [], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2010-12-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9688919-ghostv", "num_ratings": "3,482", "num_reviews": "385", "avg_ratings": 4.38, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Fantasy", "Urban Fantasy"], "title": "GhosTV", "description": ["For the past dozen years, Victor Bayne has solved numerous murders by interrogating witnesses only he can see—dead witnesses. But when his best friend Lisa goes missing from the sunny California campus of PsyTrain, the last thing he wants to find there is her spirit.", "Disappearing without a trace in a school full of psychics? That’s some trick. But somehow both Lisa and her", "For the past dozen years, Victor Bayne has solved numerous murders by interrogating witnesses only he can see—dead witnesses. But when his best friend Lisa goes missing from the sunny California campus of PsyTrain, the last thing he wants to find there is her spirit.", "Disappearing without a trace in a school full of psychics? That’s some trick. But somehow both Lisa and her roommate have vanished into thin air. A group of fanatics called Five Faith has been sniffing around, and Lisa’s email is compromised. ", "Time is running out, and with no ghosts to cross-examine, Vic can’t afford to turn down any offers of help. An old enemy can provide an innovative way to track Vic’s missing friend, and he enters into an uneasy alliance—even though its ultimate cost will ensnare him in a debt he may never manage to settle."], "author": "Jordan Castillo Price", "num_pages": "379", "awards": [], "places": ["California", "Illinois"], "character_names": ["Victor Bayne", "Jacob Marks"], "language": "English", "publish_date": "2011-02-24 00:00:00", "ISBN": "1935540211"},
{"url": "https://www.goodreads.com/book/show/12989319-final-atonement", "num_ratings": "85", "num_reviews": "17", "avg_ratings": 4.26, "genres": ["Mystery", "Romance", "M M Romance", "Mystery", "Crime", "Fiction", "Lgbt"], "title": "Final Atonement", "description": ["LAMBDA LITERARY AWARD FINALIST FOR BEST MYSTERY! The bestselling crime novels of New York life in the early nineties are back. Gruff, weary, gay Brooklyn Homicide cop Doug Orlando is facing his most shocking case: Rabbi Avraham Rabowitz lay in a pool of his own blood, a prayer shawl stuffed down his throat, and his beard shaved off. The question for Detective Orlando isn't", "LAMBDA LITERARY AWARD FINALIST FOR BEST MYSTERY! The bestselling crime novels of New York life in the early nineties are back. Gruff, weary, gay Brooklyn Homicide cop Doug Orlando is facing his most shocking case: Rabbi Avraham Rabowitz lay in a pool of his own blood, a prayer shawl stuffed down his throat, and his beard shaved off. The question for Detective Orlando isn't who hated the right wing religious sect leader-Rabowitz had been the open enemy of blacks, gays, pro-choice women, even fellow Jews. In a case that moves from the depths of the ghetto to the high-rise office of a real estate glamour-boy tycoon, the suspects come in every color and shade of belief. And unless Orlando can defuse a ticking time bomb of tension by nailing the killer, the melting pot of the city is going to melt down...."], "author": "Steve Neil Johnson", "num_pages": "220", "awards": ["Lambda Literary Award Nominee for Gay Men's Mystery (1993)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-29 00:00:00", "ISBN": "0615525741"},
{"url": "https://www.goodreads.com/book/show/9435740-foxe-tail", "num_ratings": "1,143", "num_reviews": "177", "avg_ratings": 3.73, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance"], "title": "Foxe Tail", "description": ["Gay teacher Skyler Foxe thought teaching English Lit was murder. Wait till he falls into the real thing.", "Skyler Foxe is a brand new English teacher in his hometown of Redlands, CA. He loves literature, loves his students, loves his friends, especially his best friend Detective Sidney Feldman. But he doesn't love keeping his orientation a secret, afraid of the backlash in th", "Gay teacher Skyler Foxe thought teaching English Lit was murder. Wait till he falls into the real thing.", "Skyler Foxe is a brand new English teacher in his hometown of Redlands, CA. He loves literature, loves his students, loves his friends, especially his best friend Detective Sidney Feldman. But he doesn't love keeping his orientation a secret, afraid of the backlash in this conservative county. But will murder thrust him into unwanted limelight? Who killed his principal's son outside a gay dance club? And what's the connection to James Polk High? Is the macho football coach or his mysterious and gorgeous new assistant coach involved? Can Skyler trust anyone at the high school when there seems to be conspiracies around every corner?"], "author": "Haley Walsh", "num_pages": "288", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2010-09-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6659898-hemovore", "num_ratings": "1,609", "num_reviews": "296", "avg_ratings": 3.91, "genres": ["Romance", "M M Romance", "Paranormal", "Vampires", "Fantasy", "Paranormal", "Romance", "Fantasy"], "title": "Hemovore", "description": ["Mark Hansen thought working as artist’s assistant would be glamorous, especially if that artist was a vampire. Black tie events, witty repartee, gracing the pages of the local style section…. Didn’t happen. Not even once.", "Jonathan Varga is an enigma. True, he’s quiet, generous, and scrupulously polite. But he has zero social life, refuses to be interviewed or photographed,", "Mark Hansen thought working as artist’s assistant would be glamorous, especially if that artist was a vampire. Black tie events, witty repartee, gracing the pages of the local style section…. Didn’t happen. Not even once.", "Jonathan Varga is an enigma. True, he’s quiet, generous, and scrupulously polite. But he has zero social life, refuses to be interviewed or photographed, and insists he can only consume feline blood.", "Why supermarket blood won't suffice, Mark hasn’t asked. He’s rarely at a loss for words—he can dish an insult and follow it with a snap as quick as you can say “Miss Thang.” But one look at Jonathan’s black-as-sin gypsy eyes, and Mark’s objections drain away.", "So he endures the perpetual grind of their routine: Jonathan hiding in his studio, swiping black paint onto black canvases. Mark hurling insults while he buffs the office to a shine with antiviral wipes. Each of them avoiding the other in a careful choreography…until a blurb in Art in America unleashes a chain of harrowing events.", "As secrets from Jonathan’s past are brought to light, it becomes clear that all his precautions weren’t nearly enough."], "author": "Jordan Castillo Price", "num_pages": "183", "awards": ["Rainbow Award for LGBT Cover (2009)"], "places": ["Illinois"], "character_names": [], "language": "English", "publish_date": "2009-07-28 00:00:00", "ISBN": "1605046345"},
{"url": "https://www.goodreads.com/book/show/18335673-learning-curve", "num_ratings": "1,728", "num_reviews": "232", "avg_ratings": 4.28, "genres": ["Romance", "M M Romance", "Contemporary", "Romance", "Mystery"], "title": "Learning Curve", "description": ["Three months after being shot, Detective Jared MacLean is healing, but he's afraid it may not be enough to go back on the job. He won't give up, though. Being a cop is written deep in Mac’s bones, and he'll do whatever it takes to carry his badge again.", "Tony used to wish he", "Three months after being shot, Detective Jared MacLean is healing, but he's afraid it may not be enough to go back on the job. He won't give up, though. Being a cop is written deep in Mac’s bones, and he'll do whatever it takes to carry his badge again.", "Tony used to wish he could have Mac safely home, but watching his strong husband battle disabilities is far from Tony's dream come true. When Mac is asked to consult on a case involving one of Tony's students, both men will have to face old demons and new fears to find a way to move forward together."], "author": "Kaje Harper", "num_pages": "370", "awards": [], "places": ["Minneapolis, Minnesota"], "character_names": ["Anthony \"Tony\" Hart", "Jared \"Mac\" MacLean"], "language": "English", "publish_date": "2013-09-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13423652-cards-on-the-table", "num_ratings": "1,103", "num_reviews": "142", "avg_ratings": 4.09, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "Cards on the Table", "description": ["Fifty years ago a glamorous Hollywood party ended in murder -- the only clue a bloody Tarot card. Timothy North is trying to find out what happened that long ago summer's night, but when a Tarot card turns up pinned to his front door, the only person Tim can turn to for help is his ex-lover, Detective Jack Brady.", "Originally published in the \"Partners in Crime\" anthology."], "author": "Josh Lanyon", "num_pages": "95", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2012-01-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3212631-amor-en-retrogrado", "num_ratings": "727", "num_reviews": "112", "avg_ratings": 3.85, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance"], "title": "Amor En Retrogrado", "description": ["In the year since JD Ryan, Robert Lemos's life partner, packed his bags and moved out, Robert has been in a painful daze, anesthetizing himself with work. Then one rainy night, he gets a call that his ex has been beaten and shot in a parking lot outside a gay dance club. JD is in critical condition and the man who was with him is dead.", "Robert rushes to JD's bedside to find", "In the year since JD Ryan, Robert Lemos's life partner, packed his bags and moved out, Robert has been in a painful daze, anesthetizing himself with work. Then one rainy night, he gets a call that his ex has been beaten and shot in a parking lot outside a gay dance club. JD is in critical condition and the man who was with him is dead.", "Robert rushes to JD's bedside to find him recovering from the gunshot wound but suffering from retrograde amnesia. As JD slowly regains his memories, he recalls everything except the circumstances of the murder, and the reasons why he left Robert. He remembers their love, and seems determined to reconcile. It's the miracle Robert's been hoping for.", "Interference comes from all sides. Detective Bill Turner, who seems to have too personal an interest in JD, pegs Robert as the primary suspect in the shooting. Robert's best friend, police Captain Gabe Lara, seems to feel that Robert is better off without JD. Even JD's returning memory seems to conspire against Robert. And as the detectives track down the killer, Robert helplessly waits for JD to recall the truth of their relationship and leave him yet again.", "But if they survive the investigation, they just might find love in retrograde.", "Publisher's Note: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: Anal play/intercourse, male/male sexual practices, masturbation, violence. "], "author": "A.M. Riley", "num_pages": "329", "awards": [], "places": ["Los Angeles, California", "California"], "character_names": ["Robert Lemos", "JD (Joseph) Ryan"], "language": "English", "publish_date": "2008-01-22 00:00:00", "ISBN": "1596326107"},
{"url": "https://www.goodreads.com/book/show/16219338-the-boy-with-the-painful-tattoo", "num_ratings": "2,304", "num_reviews": "386", "avg_ratings": 4.27, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Mystery", "Crime"], "title": "The Boy with the Painful Tattoo", "description": ["It's moving day at Chez Holmes. Somehow, against Kit's better instincts, he and J.X. are setting up house together. But while J.X. is off at a writing conference, Kit unpacks a crate that should contain either old books or new china. It doesn't. Within the mounds of green Styrofoam popcorn is a dead body. A very dead body.", "There goes the neighborhood."], "author": "Josh Lanyon", "num_pages": "228", "awards": [], "places": ["California", "San Francisco, California"], "character_names": [], "language": "English", "publish_date": "2014-10-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7332306-a-matter-of-time-book-iv", "num_ratings": "3,581", "num_reviews": "193", "avg_ratings": 4.24, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "A Matter of Time Book IV", "description": ["Jory Harcourt is back in trouble. An old threat has shown up, and soon Jory is running from a madman who-ll do anything to see him dead. When Jory is kidnapped it soon becomes clear he is up against something bigger than he ever imagined. Sam Kage, the police detective he loves, is caught in the crossfire, and ends up fighting for his life in a hospital bed. Jory springs i", "Jory Harcourt is back in trouble. An old threat has shown up, and soon Jory is running from a madman who-ll do anything to see him dead. When Jory is kidnapped it soon becomes clear he is up against something bigger than he ever imagined. Sam Kage, the police detective he loves, is caught in the crossfire, and ends up fighting for his life in a hospital bed. Jory springs into action, and goes on the defensive to catch a serial killer. The trail leads from his home in Chicago to Dallas and back. More resourceful than anyone imagined, Jory cracks the case, or does he?  And can his love affair with Sam withstand the pressure?", "This edition is out of print."], "author": "Mary Calmes", "num_pages": "253", "awards": [], "places": ["Illinois"], "character_names": ["Jory \"J\" Keyes", "Samuel \"Sam\" Thomas Kage"], "language": "English", "publish_date": "2009-12-15 00:00:00", "ISBN": "1897532881"},
{"url": "https://www.goodreads.com/book/show/3100718-cheating-chance", "num_ratings": "1,198", "num_reviews": "166", "avg_ratings": 3.84, "genres": ["Romance", "M M Romance", "Erotica", "Bdsm", "Contemporary", "Mystery", "Romance"], "title": "Cheating Chance", "description": ["Nick O'Mallley is an agent for the Nevada Gaming Commission. He's also a Goth with a hearse he's restoring, and an ex lover he's only just getting over. Brandon Carr is a cop with the Riverside PD. Lucky for him, he's in Vice where his tattoos and biker boy looks serve him well. The two meet at a Goth convention in San Diego and the sparks fly immediately. So much so that", "Nick O'Mallley is an agent for the Nevada Gaming Commission. He's also a Goth with a hearse he's restoring, and an ex lover he's only just getting over. Brandon Carr is a cop with the Riverside PD. Lucky for him, he's in Vice where his tattoos and biker boy looks serve him well. The two meet at a Goth convention in San Diego and the sparks fly immediately. So much so that a weekend fling turns into more and Brandon spends his four day weekend visiting Nick. Things aren't all sparks and roses though: the two do live a nine hour drive apart, and Brandon's not out. Add to that a murder right in front of them, a company trying to cheat the system and the Mexican Mafia, and Brandon and Nick's relationship will need to overcome a whole slew of obstacles in order to work. Despite everything, can Brandon and Nick make a go of it? Taken a chance on these two and find out."], "author": "James Buchanan", "num_pages": "183", "awards": [], "places": ["Nevada"], "character_names": ["Nick O'Malley", "Brandon Carr"], "language": "English", "publish_date": "2008-08-16 00:00:00", "ISBN": "1603703039"},
{"url": "https://www.goodreads.com/book/show/7234142-a-matter-of-time-book-iii", "num_ratings": "3,719", "num_reviews": "187", "avg_ratings": 4.15, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "A Matter of Time Book III", "description": ["Three years have passed since Jory Keyes was kidnapped, shot, and left by his lover, Detective Sam Kage. Jory walked through fire and came out the other side stronger. He changed his name to Harcourt and shut the door forever on a past full of pain. Jory now owns his own business, and has a life he enjoys. What he doesn’t have is love. He’s been unable to make that deep co", "Three years have passed since Jory Keyes was kidnapped, shot, and left by his lover, Detective Sam Kage. Jory walked through fire and came out the other side stronger. He changed his name to Harcourt and shut the door forever on a past full of pain. Jory now owns his own business, and has a life he enjoys. What he doesn’t have is love. He’s been unable to make that deep connection with another man, the kind of connection he’s only had with Sam. When a chance encounter brings Sam back into his life, Jory doesn’t know what to do. But for Sam there’s no hesitation. He wants Jory back and this time he wants him for keeps. When Sam is called away to a crime scene in the middle of the night, Jory realizes that his fear has nothing to do with being emotionally vulnerable. Why, he wonders, is he so damned uneasy?"], "author": "Mary Calmes", "num_pages": "157", "awards": [], "places": ["Illinois"], "character_names": ["Jory \"J\" Keyes", "Samuel \"Sam\" Thomas Kage"], "language": "English", "publish_date": "2009-11-30 00:00:00", "ISBN": "1897532830"},
{"url": "https://www.goodreads.com/book/show/24384775-three-nick-nowak-mysteries", "num_ratings": "750", "num_reviews": "167", "avg_ratings": 3.82, "genres": ["Romance", "M M Romance", "Mystery", "Mystery", "Crime", "Glbt", "Gay"], "title": "Three Nick Nowak Mysteries", "description": ["Finalist for the Lambda Award in Gay Mystery, Boystown: Three Nick Nowak Mysteries takes place in Chicago during the early 1980s. Haunted by his abrupt departure from the Chicago Police Department and the end of his relationship with librarian Daniel Laverty, Nick Nowak is a beat cop-turned-dogged private investigator. In this first book of the series, Nick works through t", "Finalist for the Lambda Award in Gay Mystery, Boystown: Three Nick Nowak Mysteries takes place in Chicago during the early 1980s. Haunted by his abrupt departure from the Chicago Police Department and the end of his relationship with librarian Daniel Laverty, Nick Nowak is a beat cop-turned-dogged private investigator. In this first book of the series, Nick works through three cases: a seemingly simple missing persons search, an arson investigation, and a suicide that turns out to be anything but. While working the cases, Nick moves through a series of casual relationships until he meets homicide detective Bert Harker and begins a tentative relationship. "], "author": "Marshall Thornton", "num_pages": "241", "awards": [], "places": ["Chicago, Illinois", "Illinois"], "character_names": [], "language": "English", "publish_date": "2015-01-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17840306-threshold", "num_ratings": "3,644", "num_reviews": "499", "avg_ratings": 4.14, "genres": ["Romance", "M M Romance", "Historical", "Fantasy", "Paranormal", "Fantasy", "Romance", "Mystery"], "title": "Threshold", "description": ["Introverted scholar Percival Endicott Whyborne wants nothing more than to live quietly with his lover, ex-Pinkerton detective Griffin Flaherty. Unfortunately, Whyborne's railroad tycoon father has other ideas, namely hiring Griffin to investigate mysterious events at a coal mine.", "Whyborne, Griffin, and their friend Christine travel to Threshold Mountain, a place of dark leg", "Introverted scholar Percival Endicott Whyborne wants nothing more than to live quietly with his lover, ex-Pinkerton detective Griffin Flaherty. Unfortunately, Whyborne's railroad tycoon father has other ideas, namely hiring Griffin to investigate mysterious events at a coal mine.", "Whyborne, Griffin, and their friend Christine travel to Threshold Mountain, a place of dark legend even before the mine burrowed into its heart. A contingent of Pinkertons-including Griffin's ex-lover Elliot-already guard the mine. But Griffin knows better than anyone just how unprepared the detectives are to face the otherworldly forces threatening them.", "Soon, Whyborne and Griffin are on the trail of mysterious disappearances, deadly accidents, and whispered secrets. Is Elliot an ally, or does he only want to rekindle his relationship with Griffin? And if so, how can Whyborne possibly hope to compete with the stunningly handsome Pinkerton-especially when Griffin is hiding secrets about his past?", "For in a town where friends become enemies and horror lurks behind a human mask, Whyborne can't afford to trust anything-including his own heart."], "author": "Jordan L. Hawk", "num_pages": "249", "awards": [], "places": ["Widdershins, Massashusetts", "West Virginia"], "character_names": ["Griffin Flaherty", "Percival Endicott Whyborne"], "language": "English", "publish_date": "2013-06-04 00:00:00", "ISBN": "0988564971"},
{"url": "https://www.goodreads.com/book/show/6696439-windows-in-time", "num_ratings": "387", "num_reviews": "62", "avg_ratings": 3.85, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Historical", "Contemporary", "Paranormal", "Ghosts", "Glbt", "Gay"], "title": "Windows in Time", "description": ["Fate added injury to insult when Jonah Sellers's live-in boyfriend left him: while moving out his ex's belongings, Jonah fell down the stairs and broke his leg. Now his house is a prison, and he's working from home while his sister checks up on him. The only diversion in Jonah's routine is catching the odd glimpse of a man in the apartment across the way taking off his clo", "Fate added injury to insult when Jonah Sellers's live-in boyfriend left him: while moving out his ex's belongings, Jonah fell down the stairs and broke his leg. Now his house is a prison, and he's working from home while his sister checks up on him. The only diversion in Jonah's routine is catching the odd glimpse of a man in the apartment across the way taking off his clothes in front of the window. But then Jonah is distracted by Liam Brooks, the nurse his sister sends over when she goes on vacation. As they dance around their growing attraction, Jonah and Liam begin to wonder about the man in the window. Why is he always dressed in the same clothes? Why is he there one minute and not the next? How is it that he lives in an old woman's apartment? It's while trying to answer these questions that they stumble across a fifty-year-old missing persons case they can't resist trying to solve."], "author": "M. Jules Aedin", "num_pages": "221", "awards": [], "places": ["California"], "character_names": ["Genevieve", "Buck Addison", "Jonah Sellers", "Liam Brooks", "Stephanie Sellers", "Oliver Caldwell", "Minna Redding"], "language": "English", "publish_date": "2009-08-10 00:00:00", "ISBN": "1615810269"},
{"url": "https://www.goodreads.com/book/show/6359535-deadly-wrong", "num_ratings": "526", "num_reviews": "47", "avg_ratings": 3.82, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "Deadly Wrong", "description": ["The police say \"involuntary manslaughter,\" but a tragic accident turns out instead to be murder, plain and simple. And San Francisco Homicide Inspector Stanley Korski, on leave from the force and his unrequited love for fellow detective Tom Danzel, walks right into a murderer's web of treachery. Wrong, Stanley. Deadly wrong."], "author": "Victor J. Banis", "num_pages": "252", "awards": [], "places": ["United States of America"], "character_names": ["Stanley Korski"], "language": "English", "publish_date": "2009-02-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22267616-hell-high-water", "num_ratings": "6,995", "num_reviews": "1,123", "avg_ratings": 4.2, "genres": ["Romance", "M M Romance", "Paranormal", "Shapeshifters", "Romance", "Fantasy", "Paranormal", "Mystery"], "title": "Hell & High Water", "description": ["When homicide detective Dexter J. Daley’s testimony helps send his partner away for murder, the consequences—and the media frenzy—aren’t far behind. He soon finds himself sans boyfriend, sans friends, and, after an unpleasant encounter in a parking garage after the trial, he’s lucky he doesn’t find himself sans teeth. Dex fears he’ll get transferred from the Human Police F", "When homicide detective Dexter J. Daley’s testimony helps send his partner away for murder, the consequences—and the media frenzy—aren’t far behind. He soon finds himself sans boyfriend, sans friends, and, after an unpleasant encounter in a parking garage after the trial, he’s lucky he doesn’t find himself sans teeth. Dex fears he’ll get transferred from the Human Police Force’s Sixth Precinct, or worse, get dismissed. Instead, his adoptive father—a sergeant at the Therian-Human Intelligence Recon Defense Squadron otherwise known as the THIRDS—pulls a few strings, and Dex gets recruited as a Defense Agent. ", "Dex is determined to get his life back on track and eager to get started in his new job. But his first meeting with Team Leader Sloane Brodie, who also happens to be his new jaguar Therian partner, turns disastrous. When the team is called to investigate the murders of three HumaniTherian activists, it soon becomes clear to Dex that getting his partner and the rest of the tightknit team to accept him will be a lot harder than catching the killer—and every bit as dangerous."], "author": "Charlie Cochet", "num_pages": "296", "awards": [], "places": ["New York City, New York"], "character_names": ["Sloane Brodie", "Dexter \"Dex\" Justice Daley"], "language": "English", "publish_date": "2014-07-07 00:00:00", "ISBN": "1632160129"},
{"url": "https://www.goodreads.com/book/show/12478639-bulletproof", "num_ratings": "4,318", "num_reviews": "354", "avg_ratings": 4.28, "genres": ["Romance", "M M Romance", "Romance", "Contemporary"], "title": "Bulletproof", "description": ["Sequel to A Matter of Time Vols: I & II", "Jory Harcourt doesn't have to go looking for trouble. Wherever he goes, it seems to find him—particularly when his partner, Sam Kage, is working undercover on a federal task force.", "After the recession forces him to close his business, Jory goes to work as a matchmaker and event planner. From there, it's only a matter of time before", "Sequel to A Matter of Time Vols: I & II", "Jory Harcourt doesn't have to go looking for trouble. Wherever he goes, it seems to find him—particularly when his partner, Sam Kage, is working undercover on a federal task force.", "After the recession forces him to close his business, Jory goes to work as a matchmaker and event planner. From there, it's only a matter of time before his big mouth and up-front attitude make him the rope in a tug-of-war between a trust fund baby and a drug-smuggling criminal. Then, as if that situation weren't delicate enough, Jory's undercover lover shows up working for the smuggler.", "Between the men who want him and the men who just want him dead, Chicago is getting a little crowded for Jory, so on the advice of his brother, his boyfriend, and the FBI task force, he heads for Hawaii... where a serious accident threatens his quality of life. Can Sam and Jory keep the faith and prove that their relationship really is bulletproof?"], "author": "Mary Calmes", "num_pages": "260", "awards": [], "places": ["Hawaii", "Illinois"], "character_names": ["Jory \"J\" Keyes", "Samuel \"Sam\" Thomas Kage"], "language": "English", "publish_date": "2011-09-26 00:00:00", "ISBN": "1613721536"},
{"url": "https://www.goodreads.com/book/show/17796292-a-casual-weekend-thing", "num_ratings": "1,777", "num_reviews": "255", "avg_ratings": 4.03, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance", "Sociology", "Abuse"], "title": "A Casual Weekend Thing", "description": ["Doug Heavy Runner left the life of an openly gay Miami police officer and returned to his home on the Salish-Kootenai Indian Reservation when his mother got sick. In the two years since she passed, he’s carved out an empty life as a small-town deputy, relying on out-of-town one-night stands to keep him sane. Then he meets Detective Christopher Hayes, and they share a wild", "Doug Heavy Runner left the life of an openly gay Miami police officer and returned to his home on the Salish-Kootenai Indian Reservation when his mother got sick. In the two years since she passed, he’s carved out an empty life as a small-town deputy, relying on out-of-town one-night stands to keep him sane. Then he meets Detective Christopher Hayes, and they share a wild night so incredible Doug breaks his own rule and allows a one-night stand to grow into a weekend of amazing sex. ", "When Christopher travels from San Diego to Montana to deal with his abusive brother’s suicide, he doesn’t expect to find the man he spent the weekend with to be handling his brother’s case. He certainly doesn’t mind spending more time with Doug—but then an arsonist destroys the house Christopher inherited from his brother, and Christopher and Doug discover they are the primary suspects.", "As they investigate, they discover Christopher’s dead brother has set them on the trail of a psychotic pedophile who will stop at nothing to silence his last victim. However, the search for the victim goes horribly wrong, leaving Doug hospitalized and Christopher at the mercy of the killer…."], "author": "A.J.  Thomas", "num_pages": "310", "awards": ["AMB Ovation Award for Best LGBT Interracial Romance (2013)"], "places": ["Montana"], "character_names": [], "language": "English", "publish_date": "2013-05-13 00:00:00", "ISBN": "1623804876"},
{"url": "https://www.goodreads.com/book/show/395567.L_A_Heat", "num_ratings": "1,022", "num_reviews": "84", "avg_ratings": 3.83, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance", "Mystery", "Crime"], "title": "L.A. Heat", "author": "P.A. Brown", "num_pages": "307", "awards": ["Rainbow Award (2009)"], "places": ["Los Angeles, California"], "character_names": ["Christopher Robin Bellamere", "David Eric Laine"], "language": "English", "publish_date": "2006-07-01 00:00:00", "ISBN": "1555839487"},
{"url": "https://www.goodreads.com/book/show/5942455-lessons-in-love", "num_ratings": "1,197", "num_reviews": "177", "avg_ratings": 3.71, "genres": ["Romance", "M M Romance", "Historical", "Mystery", "Romance", "Historical", "Historical Fiction"], "title": "Lessons in Love", "description": ["St. Bride's College, Cambridge, England, 1905. When Jonty Stewart takes up a teaching post at the college where he studied, the handsome and outgoing young man acts as a catalyst for change within the archaic institution. He also has a catalytic effect on Orlando Coppersmith. Orlando is a brilliant, introverted mathematician with very little experience of life outside the", "St. Bride's College, Cambridge, England, 1905. When Jonty Stewart takes up a teaching post at the college where he studied, the handsome and outgoing young man acts as a catalyst for change within the archaic institution. He also has a catalytic effect on Orlando Coppersmith. Orlando is a brilliant, introverted mathematician with very little experience of life outside the college walls. He strikes up an alliance with the outgoing Jonty, and soon finds himself having feelings hes never experienced before. Before long their friendship blossoms into more than either man had hoped and they enter into a clandestine relationship. Their romance is complicated when a series of murders is discovered within St. Brides. All of the victims have one thing in common, a penchant for men. While acting as the eyes and ears for the police, a mixture of logic and luck leads them to a confrontation with the murderercan they survive it?"], "author": "Charlie Cochrane", "num_pages": "186", "awards": [], "places": ["United Kingdom"], "character_names": ["Jonty Stewart", "Orlando Coppersmith"], "language": "English", "publish_date": "2008-11-16 00:00:00", "ISBN": "160202149X"},
{"url": "https://www.goodreads.com/book/show/16169304-sinner-s-gin", "num_ratings": "3,622", "num_reviews": "539", "avg_ratings": 4.15, "genres": ["Romance", "M M Romance", "Romance", "Mystery", "Contemporary"], "title": "Sinner's Gin", "description": ["There’s a dead man in Miki St. John’s vintage Pontiac GTO, and he has no idea how it got there.", "After Miki survives the tragic accident that killed his best friend and the other members of their band, Sinner’s Gin, all he wants is to hide from the world in the refurbished warehouse he bought before their last tour. But when the man who sexually abused him as a boy is killed", "There’s a dead man in Miki St. John’s vintage Pontiac GTO, and he has no idea how it got there.", "After Miki survives the tragic accident that killed his best friend and the other members of their band, Sinner’s Gin, all he wants is to hide from the world in the refurbished warehouse he bought before their last tour. But when the man who sexually abused him as a boy is killed and his remains are dumped in Miki’s car, Miki fears Death isn’t done with him yet.", "Kane Morgan, the SFPD inspector renting space in the art co-op next door, initially suspects Miki had a hand in the man’s murder, but Kane soon realizes Miki is as much a victim as the man splattered inside the GTO. As the murderer’s body count rises, the attraction between Miki and Kane heats up. Neither man knows if they can make a relationship work, but despite Miki’s emotional damage, Kane is determined to teach him how to love and be loved — provided, of course, Kane can catch the killer before Miki becomes the murderer’s final victim."], "author": "Rhys Ford", "num_pages": "260", "awards": [], "places": ["San Francisco, California", "Los Angeles, California"], "character_names": ["Kane Aodh Morgan", "Mieko \"Miki\" St. John"], "language": "English", "publish_date": "2012-12-24 00:00:00", "ISBN": "1623802490"},
{"url": "https://www.goodreads.com/book/show/7236870-the-dickens-with-love", "num_ratings": "1,832", "num_reviews": "238", "avg_ratings": 3.93, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Holiday", "Holiday", "Christmas"], "title": "The Dickens with Love", "description": [" ", " ", " ", " "], "author": "Josh Lanyon", "num_pages": "111", "awards": [], "places": ["California"], "character_names": ["Sedgwick Crisparkle", "James Winter"], "language": "English", "publish_date": "2009-12-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/14061520-stars-stripes", "num_ratings": "9,164", "num_reviews": "990", "avg_ratings": 4.58, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery", "Mystery", "Crime"], "title": "Stars & Stripes", "description": ["Special Agents Ty Grady and Zane Garrett have managed the impossible: a few months of peace and quiet. After nearly a year of personal and professional turmoil, they're living together conflict-free, work is going smoothly, and they're both happy, healthy, and home every night before dark. But anyone who knows them knows that can’t possibly last.", "When an emergency call from", "Special Agents Ty Grady and Zane Garrett have managed the impossible: a few months of peace and quiet. After nearly a year of personal and professional turmoil, they're living together conflict-free, work is going smoothly, and they're both happy, healthy, and home every night before dark. But anyone who knows them knows that can’t possibly last.", "When an emergency call from home upsets the balance of their carefully arranged world, Ty and Zane must juggle family drama with a perplexing crime to save a helpless victim before time runs out.", "From the mountains of West Virginia to a remote Texas horse ranch harboring more than just livestock and childhood memories, Ty and Zane must face their fears—and their families—to overcome an unlikely enemy and bring peace back into their newly shared world."], "author": "Abigail Roux", "num_pages": "292", "awards": ["DABWAHA Romance Tournament for Best Romance of the Year (2013)"], "places": ["Texas", "West Virginia", "Baltimore, Maryland"], "character_names": ["Beaumont \"Ty\" Tyler Grady", "Zane Zachary Garrett", "Nick O'Flaherty"], "language": "English", "publish_date": "2012-08-13 00:00:00", "ISBN": "1937551423"},
{"url": "https://www.goodreads.com/book/show/6504180-chasing-smoke", "num_ratings": "1,532", "num_reviews": "136", "avg_ratings": 3.69, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Chasing Smoke", "description": ["In the best of times, Daniel Gardner hates visiting his family. With his boyfriend pressuring him for a mortgage-serious commitment, Christmas in Easton, PA sounds, for once, like a welcome escape. His old house holds more than memories of a miserable adolescence, though. It has Trey Eriksson.", "At sevente", "In the best of times, Daniel Gardner hates visiting his family. With his boyfriend pressuring him for a mortgage-serious commitment, Christmas in Easton, PA sounds, for once, like a welcome escape. His old house holds more than memories of a miserable adolescence, though. It has Trey Eriksson.", "At seventeen, Trey was taken in by the wealthy Gardner family after his father was jailed for his mother’s murder. Until he left for the Army, he fought a double-edged battle—for proof of his father’s innocence and against his attraction to Daniel.", "Fifteen years later, things haven’t changed. Trey is still looking for the real killer. And Daniel has never forgotten how Trey used to sneak into his room at night.", "Now new clues to the murder are resurfacing—and so is Trey and Daniel’s sexual chemistry. Except this time, Trey has come to terms with his orientation.", "But their connection may not be enough to overcome the mistakes of the past. Not while a murderer still walks free…"], "author": "K.A. Mitchell", "num_pages": "264", "awards": [], "places": ["Pennsylvania"], "character_names": ["Daniel Gardner", "Trey Eriksson"], "language": "English", "publish_date": "2009-06-09 00:00:00", "ISBN": "1605045780"},
{"url": "https://www.goodreads.com/book/show/6307616-the-slayer-s-apprentice", "num_ratings": "789", "num_reviews": "129", "avg_ratings": 4.01, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Thriller", "Romance"], "title": "The Slayer's Apprentice", "description": ["When Senior Constable Daniel Hart stops bartender Phoenix Love from picking his pocket one evening, it’s an inauspicious beginning, but Daniel falls for the beautiful Phoenix anyway. Things become complicated when Detective Paul Somerset, who’s been on the trail of Australia’s notorious serial killer “The Crucifix Slayer”, sets his sights on Phoenix.", "Convinced that Phoenix", "When Senior Constable Daniel Hart stops bartender Phoenix Love from picking his pocket one evening, it’s an inauspicious beginning, but Daniel falls for the beautiful Phoenix anyway. Things become complicated when Detective Paul Somerset, who’s been on the trail of Australia’s notorious serial killer “The Crucifix Slayer”, sets his sights on Phoenix.", "Convinced that Phoenix Love is the killer, Detective Somerset pursues him single-mindedly. As evidence, and Phoenix’s behavior, point toward Somerset being right, Daniel must protect their fledgling love affair, his own heart and his lover while deciphering whether or not Phoenix actually is the killer.", "Is Phoenix Love a victim or is his love affair with Daniel doomed to fall at the whims of a monster?"], "author": "Zathyn Priest", "num_pages": "258", "awards": ["Coffee Time Romance Book of the Year"], "places": ["Sydney, New South Wales"], "character_names": ["Phoenix Love", "Daniel Hart"], "language": "English", "publish_date": "2009-01-24 00:00:00", "ISBN": "1603706011"},
{"url": "https://www.goodreads.com/book/show/16128152-widdershins", "num_ratings": "5,772", "num_reviews": "1,020", "avg_ratings": 4.11, "genres": ["Romance", "M M Romance", "Historical", "Fantasy", "Paranormal", "Romance", "Fantasy", "Mystery"], "title": "Widdershins", "description": ["Some things should stay buried.", "Repressed scholar Percival Endicott Whyborne has two skills: reading dead languages and hiding in his office at the Ladysmith Museum. After the tragic death of the friend he secretly loved, he’s ruthlessly suppressed any desire for another man.", "So when handsome ex-Pinkerton Griffin Flaherty approaches him to translate a mysterious book, Whybor", "Some things should stay buried.", "Repressed scholar Percival Endicott Whyborne has two skills: reading dead languages and hiding in his office at the Ladysmith Museum. After the tragic death of the friend he secretly loved, he’s ruthlessly suppressed any desire for another man.", "So when handsome ex-Pinkerton Griffin Flaherty approaches him to translate a mysterious book, Whyborne wants to finish the job and get rid of the detective as quickly as possible. Griffin left the Pinkertons following the death of his partner, hoping to start a new life. But the powerful cult which murdered Glenn has taken root in Widdershins, and only the spells in the book can stop them. Spells the intellectual Whyborne doesn’t believe are real.", "As the investigation draws the two men closer, Griffin’s rakish charm threatens to shatter Whyborne’s iron control. When the cult resurrects an evil sorcerer who commands terrifying monsters, can Whyborne overcome his fear and learn to trust? Will Griffin let go of his past and risk falling in love? Or will Griffin’s secrets cost Whyborne both his heart and his life?"], "author": "Jordan L. Hawk", "num_pages": "236", "awards": [], "places": ["Widdershins, Massashusetts", "Massachusetts"], "character_names": ["Griffin Flaherty", "Percival Endicott Whyborne"], "language": "English", "publish_date": "2012-12-04 00:00:00", "ISBN": "0988564106"},
{"url": "https://www.goodreads.com/book/show/15847019-a-reason-to-believe", "num_ratings": "2,651", "num_reviews": "436", "avg_ratings": 4.01, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Paranormal", "Ghosts", "Contemporary"], "title": "A Reason To Believe", "description": ["Detective Matthew Bennett doesn't believe in ghosts. So when the spirit of a murdered child leads him to her body, he's shaken to the core—and taken off the case. Unable to explain his vision, or to let go of the investigation, Matthew turns to renowned medium Kiernan Fitzpatrick. Though he has doubts about Kiernan's claims to communicate with the dead, Matt is nevertheles", "Detective Matthew Bennett doesn't believe in ghosts. So when the spirit of a murdered child leads him to her body, he's shaken to the core—and taken off the case. Unable to explain his vision, or to let go of the investigation, Matthew turns to renowned medium Kiernan Fitzpatrick. Though he has doubts about Kiernan's claims to communicate with the dead, Matt is nevertheless drawn to the handsome psychic, who awakens feelings he thought were long-buried.", "Haunted by the lingering spirit of the little girl, Kiernan is compelled to aid in the search for her killer. The chance to get closer to the enigmatic Matt is an unexpected bonus. Although Kiernan's been betrayed by people who turned out to be more interested in his fame than in himself, with Matt he's willing to risk his heart. As the two men grow closer, Kiernan helps Matt rediscover that life offers no guarantees—but love offers a reason to believe..."], "author": "Diana Copland", "num_pages": "217", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-22 00:00:00", "ISBN": "1426894538"},
{"url": "https://www.goodreads.com/book/show/8393603-prey", "num_ratings": "1,806", "num_reviews": "314", "avg_ratings": 4.0, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Paranormal", "Shapeshifters", "Fantasy", "Urban Fantasy", "Mystery", "Romance", "Fantasy"], "title": "Prey", "description": ["In a world where a werecat virus has changed society, Roan McKichan, a born infected and ex-cop, works as a private detective trying to solve crimes involving other infecteds.", "The murder of a former cop draws Roan into an odd case where an unidentifiable species of cat appears to be showing an unusual level of intelligence. He juggles that with trying to find a missing teen", "In a world where a werecat virus has changed society, Roan McKichan, a born infected and ex-cop, works as a private detective trying to solve crimes involving other infecteds.", "The murder of a former cop draws Roan into an odd case where an unidentifiable species of cat appears to be showing an unusual level of intelligence. He juggles that with trying to find a missing teenage boy, who, unbeknownst to his parents, was “cat” obsessed. And when someone is brutally murdering infecteds, Eli Winters, leader of the Church of the Divine Transformation, hires Roan to find the killer before he closes in on Eli.", "Working the crimes will lead Roan through a maze of hate, personal grudges, and mortal danger. With help from his tiger-strain infected partner, Paris Lehane, he does his best to survive in a world that hates and fears their kind… and occasionally worships them."], "author": "Andrea Speed", "num_pages": "364", "awards": [], "places": ["Seattle, Washington"], "character_names": ["Roan Christopher McKichan", "Paris Damon Lehane"], "language": "English", "publish_date": "2010-06-25 00:00:00", "ISBN": "1615814671"},
{"url": "https://www.goodreads.com/book/show/20738173-stranger-on-the-shore", "num_ratings": "2,377", "num_reviews": "422", "avg_ratings": 4.19, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "Stranger on the Shore", "description": ["Twenty years ago young Brian Arlington, heir to Arlington fortune, was kidnapped. Though the ransom was paid, the boy was never seen again and is presumed dead. Pierce Mather, the family lawyer, now administers and controls the Arlington billions. He's none too happy, and more than a little suspicious, when investigative journalist Griffin Hadley shows up to write about th", "Twenty years ago young Brian Arlington, heir to Arlington fortune, was kidnapped. Though the ransom was paid, the boy was never seen again and is presumed dead. Pierce Mather, the family lawyer, now administers and controls the Arlington billions. He's none too happy, and more than a little suspicious, when investigative journalist Griffin Hadley shows up to write about the decades-old mystery. Griff shrugs off the coldly handsome Pierce's objections, but it might not be so easy to shrug off the objections of someone willing to do anything to keep the past buried."], "author": "Josh Lanyon", "num_pages": "226", "awards": [], "places": ["Long Island, New York", "New York (the state)"], "character_names": [], "language": "English", "publish_date": "2014-05-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12045922-breaking-cover", "num_ratings": "3,546", "num_reviews": "325", "avg_ratings": 4.23, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Breaking Cover", "description": ["For homicide detective Mac, it's been a good year. Having Tony to go home to makes him a better cop and a better person. For Tony, it's been hard being in love with a man he can't touch in public. Evasions and outright lying to friends and family take a little of the shine off his relationship with Mac, but Tony is determined to make it work.", "As the Minneapolis Police Depar", "For homicide detective Mac, it's been a good year. Having Tony to go home to makes him a better cop and a better person. For Tony, it's been hard being in love with a man he can't touch in public. Evasions and outright lying to friends and family take a little of the shine off his relationship with Mac, but Tony is determined to make it work.", "As the Minneapolis Police Department moves into a hot, humid summer, Mac is faced with a different challenge. A killer has murdered two blond women, and the police have no real clues. Mac hates to think that another murder may be the only way they'll make progress with the case. But when that murder happens, it hits close to home for Tony. And suddenly Mac faces an ultimatum: come out into the sunlight and stand beside Tony as his lover, or walk away and live without a piece of his heart."], "author": "Kaje Harper", "num_pages": "320", "awards": [], "places": ["Minneapolis, Minnesota"], "character_names": ["Anthony \"Tony\" Hart", "Jared \"Mac\" MacLean", "Ben Serrano", "Anna MacLean"], "language": "English", "publish_date": "2011-07-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7090484-a-matter-of-time-book-i", "num_ratings": "5,623", "num_reviews": "445", "avg_ratings": 4.07, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Gay Romance", "Gay For You"], "title": "A Matter of Time Book I", "description": ["Jory Keyes spends his time drinking and cruising gay bars picking up one night stands. Then suddenly he becomes the only witness to a brutal murder. Although the killer vows to silence him, Jory refuses to go into witness protection. This puts him into conflict with Sam Kage, a very straight and very hot police detective. When passion flares between the two men, Sam is ast", "Jory Keyes spends his time drinking and cruising gay bars picking up one night stands. Then suddenly he becomes the only witness to a brutal murder. Although the killer vows to silence him, Jory refuses to go into witness protection. This puts him into conflict with Sam Kage, a very straight and very hot police detective. When passion flares between the two men, Sam is astonished. Is he really gay? And if so, what will this mean to his career, and his life? As the danger threatening Jory increases, Sam senses that nothing is as it seems, and wonders who is really after his newfound and forbidden love?"], "author": "Mary Calmes", "num_pages": "140", "awards": [], "places": ["Chicago, Illinois"], "character_names": ["Jory \"J\" Keyes", "Samuel \"Sam\" Thomas Kage"], "language": "English", "publish_date": "2009-10-16 00:00:00", "ISBN": "1897532733"},
{"url": "https://www.goodreads.com/book/show/2390341.Body_and_Soul", "num_ratings": "4,121", "num_reviews": "353", "avg_ratings": 4.2, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Fantasy", "Urban Fantasy"], "title": "Body and Soul", "description": ["The PsyCop boys are back! Policeman Vic has yet another new partner at work, but the really scary thing in his life is spending Thanksgiving with Jacob's family. The domesticity of the holiday is followed by a little light house-hunting, and it's a relief to get the call to go back to work.", "The urgent case means that Vic and company have a serial kidnapper on their hands, a", "The PsyCop boys are back! Policeman Vic has yet another new partner at work, but the really scary thing in his life is spending Thanksgiving with Jacob's family. The domesticity of the holiday is followed by a little light house-hunting, and it's a relief to get the call to go back to work.", "The urgent case means that Vic and company have a serial kidnapper on their hands, and it will take every resource they have, and every bit of their talent, to solve the mystery. Grab the third PsyCop book today!"], "author": "Jordan Castillo Price", "num_pages": "138", "awards": [], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Victor Bayne", "Jacob Marks", "Lisa Gutierrez", "Curtis \"Crash\" Ash", "Bob \"Zig\" Zigler"], "language": "English", "publish_date": "2007-10-20 00:00:00", "ISBN": "1603701737"},
{"url": "https://www.goodreads.com/book/show/2390327.Snowball_in_Hell", "num_ratings": "2,093", "num_reviews": "265", "avg_ratings": 4.0, "genres": ["Romance", "M M Romance", "Mystery", "Historical", "Romance"], "title": "Snowball in Hell", "description": ["Los Angeles, 1943", "Reporter Nathan Doyle had his reasons to want Phil Arlen dead, but when he sees the man's body pulled from the La Brea tar pit, he knows he'll be the prime suspect. He also knows that his life won't stand up to intense police scrutiny, so he sets out to crack the case himself.", "Lieutenant Matthew Spain's official inquiries soon lead him to believe that Natha", "Los Angeles, 1943", "Reporter Nathan Doyle had his reasons to want Phil Arlen dead, but when he sees the man's body pulled from the La Brea tar pit, he knows he'll be the prime suspect. He also knows that his life won't stand up to intense police scrutiny, so he sets out to crack the case himself.", "Lieutenant Matthew Spain's official inquiries soon lead him to believe that Nathan knows more than he's saying. But that's not the only reason Matt takes notice of the handsome journalist. Matt's been drawn to men before, but he must hide his true feelings—or risk his entire career.", "As Nathan digs deeper, it becomes increasingly difficult to stay one step ahead of Matt Spain—and to deny his intense attraction to him. Nathan's secrets may not include murder, but has his hunt put him right in the path of the real killer?"], "author": "Josh Lanyon", "num_pages": "191", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2007-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7016638-shades-of-gray", "num_ratings": "5,533", "num_reviews": "574", "avg_ratings": 4.04, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery", "Crime"], "title": "Shades of Gray", "description": ["Miller Sutton, a by-the-book FBI agent, is starting to see some troubling shades of gray in his black-and-white world. He comes face-to-face with his doubts in the person of Danny Butler, a mid-level drug runner Miller hopes to use to catch a much larger fish: Roberto Hinestroza, a drug lord Miller has pursued for years. Danny has no interest in being a witness against his", "Miller Sutton, a by-the-book FBI agent, is starting to see some troubling shades of gray in his black-and-white world. He comes face-to-face with his doubts in the person of Danny Butler, a mid-level drug runner Miller hopes to use to catch a much larger fish: Roberto Hinestroza, a drug lord Miller has pursued for years. Danny has no interest in being a witness against his boss, both out of a sense of twisted loyalty and because he knows double-crossing Hinestroza is a sure death sentence. But he reluctantly agrees to cooperate, and as he suspects, it doesn't take long for Hinestroza to figure out the betrayal. Miller is surprised to discover Danny's not the career-criminal lowlife he expected; at the same time, Danny finds himself helplessly attracted to Miller's innate goodness. They barely begin to explore the sparking attraction between them when Hinestroza's hitman tracks them down, and then they're on the run, both for their lives and for any kind of love."], "author": "Brooke McKinley", "num_pages": "246", "awards": [], "places": ["Illinois", "Texas"], "character_names": ["Danny Butler", "Miller Sutton"], "language": "English", "publish_date": "2009-10-19 00:00:00", "ISBN": "1615810803"},
{"url": "https://www.goodreads.com/book/show/13420351-shattered-glass", "num_ratings": "8,120", "num_reviews": "1,178", "avg_ratings": 4.1, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Shattered Glass", "description": ["A male prostitute, a mangy cat, a murder and a maniacal mix-up that threatens his career, his impending marriage and his life. Nothing is going as planned for Austin Glass.", "Austin—seems to have it all. At least on the surface. A loving fiancee. A future with the FBI and a healthy sized trust fund. He also has a grin and a wisecrack for every situation. But the smile he pres", "A male prostitute, a mangy cat, a murder and a maniacal mix-up that threatens his career, his impending marriage and his life. Nothing is going as planned for Austin Glass.", "Austin—seems to have it all. At least on the surface. A loving fiancee. A future with the FBI and a healthy sized trust fund. He also has a grin and a wisecrack for every situation. But the smile he presents to everyone hides a painful past he’s buried too deeply to remember. And his quips mask bitterness and insecurity. Austin has himself and most of the whole world fooled. Until he meets someone who immediately sees him better than he sees himself.", "As events unfold and Austin’s world unravels, he finds himself pushed into making quick life-changing decisions. But can he trust Peter or what’s happening between them when each meeting seems to be just a series of volatile reactions?"], "author": "Dani Alexander", "num_pages": "360", "awards": [], "places": ["Denver, Colorado"], "character_names": ["Austin Glass", "Peter \"Rabbit\" Dyachenko", "Nikolaj Strakosha", "Darryl Boerner", "Luis Martinez", "Dave Buchanan"], "language": "English", "publish_date": "2012-01-31 00:00:00", "ISBN": "1465850090"},
{"url": "https://www.goodreads.com/book/show/6003542-camp-hell", "num_ratings": "3,866", "num_reviews": "363", "avg_ratings": 4.36, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Fantasy", "Urban Fantasy"], "title": "Camp Hell", "description": ["Victor Bayne honed his dubious psychic skills at one of the first psych training facilities in the country, Heliotrope Station, otherwise known as Camp Hell to the psychics who've been guests behind its razorwire fence.", "Vic discovered that none of the people he remembers from Camp Hell can be found online, and there’s no mention of Heliotrope Station itself, either. Someone", "Victor Bayne honed his dubious psychic skills at one of the first psych training facilities in the country, Heliotrope Station, otherwise known as Camp Hell to the psychics who've been guests behind its razorwire fence.", "Vic discovered that none of the people he remembers from Camp Hell can be found online, and there’s no mention of Heliotrope Station itself, either. Someone's gone through a lot of trouble to bury the past. But who?"], "author": "Jordan Castillo Price", "num_pages": "292", "awards": [], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Victor Bayne", "Jacob Marks"], "language": "English", "publish_date": "2008-12-10 00:00:00", "ISBN": "0981875254"},
{"url": "https://www.goodreads.com/book/show/5522148-mexican-heat", "num_ratings": "3,787", "num_reviews": "312", "avg_ratings": 4.0, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Mexican Heat", "description": ["SFPD detective Gabriel Sandalini might as well have put a gun to his own head. One red-hot sexual encounter in a bar’s back room has put two years of deep undercover work in jeopardy—two years of danger and deception as he worked his way into crime boss Ricco Botelli’s inner circle. Gabriel can’t afford emotional entanglements. Hell, he can’t afford emotions. But that was", "SFPD detective Gabriel Sandalini might as well have put a gun to his own head. One red-hot sexual encounter in a bar’s back room has put two years of deep undercover work in jeopardy—two years of danger and deception as he worked his way into crime boss Ricco Botelli’s inner circle. Gabriel can’t afford emotional entanglements. Hell, he can’t afford emotions. But that was before he had a name to pin on that anonymous one-off—Miguel Ortega.", "Miguel Ortega doesn’t trust anyone, but tough, street-smart Gabriel brings out the conquistador in his Spanish blood. But distractions are nothing short of deadly right now, not with his boss’s impending marriage to Botelli’s sister, which will ensure peace—and massive drug profits—for both families.", "On a trip to Mexico to set up drug supply lines, a violent confrontation proves they’ve got each other’s backs—to a degree.", "Then one savage act changes everything, testing not only their fragile bond, but Gabriel’s will to live."], "author": "Laura Baumbach", "num_pages": "242", "awards": ["Lambda Literary Award Nominee (2009)"], "places": ["California"], "character_names": ["Miguel Ortega", "Gabriel Sandalini"], "language": "English", "publish_date": "2008-10-26 00:00:00", "ISBN": "1934531057"},
{"url": "https://www.goodreads.com/book/show/13246997-armed-dangerous", "num_ratings": "10,008", "num_reviews": "991", "avg_ratings": 4.51, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Armed & Dangerous", "description": ["Left alone in Baltimore after his unpredictable lover bails, Special Agent Zane Garrett takes his frustration out on everything in his path until he is ordered to Chicago to back up an undercover operative. When he gets there, though, he finds himself face to face with his wayward partner, Special Agent Ty Grady. They have to deal with the uncertainty lingering between the", "Left alone in Baltimore after his unpredictable lover bails, Special Agent Zane Garrett takes his frustration out on everything in his path until he is ordered to Chicago to back up an undercover operative. When he gets there, though, he finds himself face to face with his wayward partner, Special Agent Ty Grady. They have to deal with the uncertainty lingering between them while they work to retrieve their intended mark, a retired hit man and CIA wet-works operative named Julian Cross.", "Ty, once a marine and now an FBI hotshot, has a penchant for being unpredictable, a trait Zane can vouch for. Zane is a man who once lived for his job but has come to realize his heartbreaking past doesn’t have to overshadow his future. They're partners, friends, lovers, and the go-to team for unusual cases. With Cross and his innocuous boyfriend, Cameron Jacobs, in tow, Ty and Zane must navigate the obstacles of a cross-country trek, including TSA pat-downs, blizzards, their uncooperative prisoners, CIA kill teams, a desperate lack of sleep or caffeine, and each other. Ty and Zane are determined to get Julian Cross to DC in one piece, but it’s starting to look like it might be the last thing they do."], "author": "Abigail Roux", "num_pages": "330", "awards": [], "places": ["Baltimore, Maryland", "Chicago, Illinois", "Ohio", "Washington, D.C."], "character_names": ["Beaumont \"Ty\" Tyler Grady", "Zane Zachary Garrett", "Cameron Jacobs", "Julian Cross", "Preston", "Nick O'Flaherty", "Deacon \"Deuce\" Grady"], "language": "English", "publish_date": "2012-05-18 00:00:00", "ISBN": "1613725132"},
{"url": "https://www.goodreads.com/book/show/5260437-secrets", "num_ratings": "3,698", "num_reviews": "367", "avg_ratings": 4.24, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Fantasy", "Urban Fantasy"], "title": "Secrets", "description": ["Victor Bayne’s job as a PsyCop involves tracking down dead people and getting them to spill their guts about their final moments. It's never been fun, per se. But it's not usually this annoying. ", "Vic has just moved in with his boyfriend Jacob, he can’t figure out where anything’s packed, and his co-worker is pressuring him to have a housewarming party. Can’t a guy catch a b", "Victor Bayne’s job as a PsyCop involves tracking down dead people and getting them to spill their guts about their final moments. It's never been fun, per se. But it's not usually this annoying. ", "Vic has just moved in with his boyfriend Jacob, he can’t figure out where anything’s packed, and his co-worker is pressuring him to have a housewarming party. Can’t a guy catch a break? ", "On a more sinister note, Vic discovers there’s absolutely no trace of him online. No trace of anyone else who trained at \"Camp Hell,\" either. Everyone Vic knows has signed a mysterious set of papers to ensure his “privacy.” The contracts are so confidential that even Vic has never heard of them. But Jacob might have. ", "What other secrets has Jacob been keeping?"], "author": "Jordan Castillo Price", "num_pages": "169", "awards": [], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Victor Bayne", "Jacob Marks"], "language": null, "publish_date": "2008-06-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9502791-all-she-wrote", "num_ratings": "3,647", "num_reviews": "369", "avg_ratings": 4.17, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "All She Wrote", "description": ["A murderous fall down icy stairs is nearly the death of Anna Hitchcock, the much-beloved American Agatha Christie and Christopher Holmes's former mentor. Anna's plea for him to host her annual winter writing retreat touches all Kit's sore spots: traveling, teaching writing classes, and separation from his new lover, J.X.", "A murderous fall down icy stairs is nearly the death of Anna Hitchcock, the much-beloved American Agatha Christie and Christopher Holmes's former mentor. Anna's plea for him to host her annual winter writing retreat touches all Kit's sore spots: traveling, teaching writing classes, and separation from his new lover, J.X. Moriarity.", "For J.X., Kit's cancellation of yet another romantic weekend is the death knell of a relationship that has been limping along for months. But that s just as well, right? Kit isn't ready for anything serious and besides, Kit owes Anna far too much to refuse.", "Faster than you can say ", ", Kit is snooping around Anna's elegant, snowbound mansion in the Berkshires for clues as to who's trying to kill her. A tough task with six amateur sleuths underfoot, six budding writers with a tangled web of dark undercurrents running among them.", "Slowly, Kit gets the uneasy feeling that the secret may lie between the pages of someone's fictional past. Unfortunately, a clever killer is one step ahead. And it may be too late for J.X. to ride to the rescue.", "Warning: Contains one irascible, forty-year-old mystery writer who desperately needs to get laid, one exasperated thirty-something ex-cop only too happy to oblige, an isolated country manor that needs the thermostat cranked up, various assorted aspiring and perspiring authors, and a merciless killer who may have read one too many mystery novels."], "author": "Josh Lanyon", "num_pages": "173", "awards": [], "places": ["Berkshires, Massachusetts", "Connecticut"], "character_names": [], "language": "English", "publish_date": "2010-12-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12384681-divide-conquer", "num_ratings": "10,185", "num_reviews": "969", "avg_ratings": 4.49, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Divide & Conquer", "description": ["Baltimore, Maryland, is a city in alarming distress. Rising violence is fanning the flames of public outrage, and all law enforcement agencies, including the FBI, are catching blame. Thus the FBI’s latest ideas to improve public relations: a municipal softball league and workshops for community leaders. But the new commitments just mean more time Special Agents Ty Grady an", "Baltimore, Maryland, is a city in alarming distress. Rising violence is fanning the flames of public outrage, and all law enforcement agencies, including the FBI, are catching blame. Thus the FBI’s latest ideas to improve public relations: a municipal softball league and workshops for community leaders. But the new commitments just mean more time Special Agents Ty Grady and Zane Garrett have to spend apart when they’re happily exploring how to be more than by-the-book partners.", "Then the latest spate of crime explodes in their faces—literally—throwing the city, the Bureau, and Ty and Zane’s volatile partnership both in and out of the office into chaos. They’re hip-deep in trouble, trying to track down bombers and bank robbers in the dark with very few clues, and the only way to reach the light at the end of the tunnel together requires Ty and Zane to close their eyes and trust each other to the fiery end."], "author": "Abigail Roux", "num_pages": "320", "awards": [], "places": ["Baltimore, Maryland", "Maryland"], "character_names": ["Beaumont \"Ty\" Tyler Grady", "Zane Zachary Garrett", "Nick O'Flaherty", "Kelly Abbott"], "language": "English", "publish_date": "2011-10-14 00:00:00", "ISBN": "1615817166"},
{"url": "https://www.goodreads.com/book/show/6782412-warrior-s-cross", "num_ratings": "7,508", "num_reviews": "744", "avg_ratings": 3.96, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Warrior's Cross", "description": ["Cameron Jacobs is an open book. He considers himself a common waiter with normal friends, boring hobbies, harmless dogs, and nothing even resembling a secret... except a crush on a tall, dark, devastatingly handsome man who dines alone at his restaurant on Tuesday nights. All it takes is one passionate night with Julian Cross to turn Cameron’s world on its head.", "Julian's lo", "Cameron Jacobs is an open book. He considers himself a common waiter with normal friends, boring hobbies, harmless dogs, and nothing even resembling a secret... except a crush on a tall, dark, devastatingly handsome man who dines alone at his restaurant on Tuesday nights. All it takes is one passionate night with Julian Cross to turn Cameron’s world on its head.", "Julian's love and devotion are all Cameron could have hoped for and more. But when his ordinary life meets and clashes with Julian's extraordinary lifestyle, Cameron discovers that trust and fear can go hand in hand, and love is just a step away from danger."], "author": "Madeleine Urban", "num_pages": "316", "awards": ["Rainbow Award Nominee for LGBT Cover (2009)"], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Cameron Jacobs", "Julian Cross", "Preston"], "language": "English", "publish_date": "2009-08-31 00:00:00", "ISBN": "1615810307"},
{"url": "https://www.goodreads.com/book/show/1609018.A_Dangerous_Thing", "num_ratings": "5,770", "num_reviews": "469", "avg_ratings": 4.16, "genres": ["Mystery", "Romance", "Contemporary", "Romance", "M M Romance", "Mystery", "Crime"], "title": "A Dangerous Thing", "description": ["Suffering from writer's block and frustrated with his tentative relationship with hot but closeted L.A.P.D. Homicide Detective Jake Riordan, gay bookseller and mystery writer Adrien English travels to northern California where he finds a body in his front drive. By the time the sheriffs arrive, the body has disappeared, and Adrien once again finds himself playing amateur s", "Suffering from writer's block and frustrated with his tentative relationship with hot but closeted L.A.P.D. Homicide Detective Jake Riordan, gay bookseller and mystery writer Adrien English travels to northern California where he finds a body in his front drive. By the time the sheriffs arrive, the body has disappeared, and Adrien once again finds himself playing amateur sleuth. But when the game turns deadly, Adrien turns to Jake. Jake may be confused about some things, but keeping his lover alive is not one of them--no matter what the cost.", "Who are the mysterious strangers excavating on his land? And will he sort out his problems with LAPD Detective Jake Riordan, heavily into S/M sex but not so hot on relationships? Find out in this engrossing, slyly witty thriller."], "author": "Josh Lanyon", "num_pages": "238", "awards": [], "places": ["California"], "character_names": ["Adrien English", "Jake Riordan"], "language": "English", "publish_date": "2007-06-01 00:00:00", "ISBN": "0979311055"},
{"url": "https://www.goodreads.com/book/show/6033480-the-ghost-wore-yellow-socks", "num_ratings": "3,585", "num_reviews": "413", "avg_ratings": 4.0, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Mystery", "Crime"], "title": "The Ghost Wore Yellow Socks", "description": ["There's a dead body in Perry Foster's bathtub. A dead body in a very ugly sportscoat and matching socks. The dead man is a stranger to Perry, but that's not much of a comfort; how did a strange dead man get in a locked flat at the isolated Alton Estate in the wilds of the \"Northeast Kingdom\" of Vermont? Perry flees downstairs to get help and runs into \"tall, dark and hosti", "There's a dead body in Perry Foster's bathtub. A dead body in a very ugly sportscoat and matching socks. The dead man is a stranger to Perry, but that's not much of a comfort; how did a strange dead man get in a locked flat at the isolated Alton Estate in the wilds of the \"Northeast Kingdom\" of Vermont? Perry flees downstairs to get help and runs into \"tall, dark and hostile\" former navy SEAL Nick Reno.", "Reno doesn't have a lot of time for drama queens, but, convinced that Perry's jitters are based on something more than caffeine overdose, he heads upstairs to investigate. By then the body has disappeared. If there's one thing Nick has learned the hard way, it's to mind his own business. But Perry Foster doesn't believe in ghosts and isn't willing to let sleeping dead men lie. And Nick just can't convince himself to walk when it's becoming increasingly obvious someone wants the sexy young artist out of the way — permanently."], "author": "Josh Lanyon", "num_pages": "160", "awards": [], "places": ["Vermont"], "character_names": [], "language": "English", "publish_date": "2008-12-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8531376-fair-game", "num_ratings": "6,152", "num_reviews": "693", "avg_ratings": 4.07, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Mystery", "Crime"], "title": "Fair Game", "description": ["A crippling knee injury forced Elliot Mills to trade in his FBI badge for dusty chalkboards and bored college students. Now a history professor at Puget Sound university, the former agent has put his old life behind him—but it seems his old life isn't finished with him.", "A young man has gone missing from campus—and as a favor to a family friend, Elliot agrees to do a little", "A crippling knee injury forced Elliot Mills to trade in his FBI badge for dusty chalkboards and bored college students. Now a history professor at Puget Sound university, the former agent has put his old life behind him—but it seems his old life isn't finished with him.", "A young man has gone missing from campus—and as a favor to a family friend, Elliot agrees to do a little sniffing around. His investigations bring him face-to-face with his former lover, Tucker Lance, the special agent handling the case.", "Things ended badly with Tucker, and neither man is ready to back down on the fight that drove them apart. But they have to figure out a way to move beyond their past and work together as more men go missing and Elliot becomes the target in a killer's obsessive game...", "69,000 words"], "author": "Josh Lanyon", "num_pages": "270", "awards": ["DABWAHA Romance Tournament for Best GLBT Romance (2011)"], "places": ["Seattle, Washington", "Washington (the state)", "Tacoma, Washington"], "character_names": ["Elliot Mills", "Tucker Lance"], "language": "English", "publish_date": "2010-08-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5603414-among-the-living", "num_ratings": "6,588", "num_reviews": "825", "avg_ratings": 4.01, "genres": ["Romance", "M M Romance", "Fantasy", "Paranormal", "Mystery", "Romance", "Fantasy", "Urban Fantasy"], "title": "Among the Living", "description": ["Victor Bayne, the psychic half of a PsyCop team, is a gay medium who’s more concerned with flying under the radar than in making waves.", "He hooks up with handsome Jacob Marks, a non-psychic (or “Stiff”) from an adjacent precinct at his ex-partner’s retirement party and it seems like his dubious luck has taken a turn for the better. But then a serial killer surfaces who can c", "Victor Bayne, the psychic half of a PsyCop team, is a gay medium who’s more concerned with flying under the radar than in making waves.", "He hooks up with handsome Jacob Marks, a non-psychic (or “Stiff”) from an adjacent precinct at his ex-partner’s retirement party and it seems like his dubious luck has taken a turn for the better. But then a serial killer surfaces who can change his appearance to match any witness’ idea of the world’s hottest guy.", "Solving murders is a snap when you can ask the victims whodunit, but this killer’s not leaving any spirits behind.", "Words: 32081 (approx)"], "author": "Jordan Castillo Price", "num_pages": "89", "awards": [], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Victor Bayne", "Jacob Marks", "Maurice Taylor", "Carolyn Brinkman", "Lisa Gutierrez"], "language": "English", "publish_date": "2008-10-18 00:00:00", "ISBN": "1935540025"},
{"url": "https://www.goodreads.com/book/show/1274861.Fatal_Shadows", "num_ratings": "9,123", "num_reviews": "759", "avg_ratings": 3.96, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "Fatal Shadows", "description": ["One sunny morning Los Angeles bookseller and aspiring mystery author Adrien English opens his front door to murder. His old high school buddy (and employee) has been found stabbed to death in a back alley following a loud and very public argument with Adrien the previous evening.", "Naturally the cops want to ask Adrien a few questions; they are none too impressed with his ans", "One sunny morning Los Angeles bookseller and aspiring mystery author Adrien English opens his front door to murder. His old high school buddy (and employee) has been found stabbed to death in a back alley following a loud and very public argument with Adrien the previous evening.", "Naturally the cops want to ask Adrien a few questions; they are none too impressed with his answers, and when a few hours later someone breaks into Adrien's shop and ransacks it, the law is inclined to think Adrien is trying to divert suspicion from himself.", "Adrien knows better. Adrien knows he is next on the killer's list."], "author": "Josh Lanyon", "num_pages": "232", "awards": [], "places": ["Los Angeles, California"], "character_names": ["Adrien English", "Jake Riordan"], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "0979311047"},
{"url": "https://www.goodreads.com/book/show/7314827-sticks-stones", "num_ratings": "11,556", "num_reviews": "1,092", "avg_ratings": 4.38, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Sticks & Stones", "description": ["Six months after nearly losing their lives to a serial killer in New York City, FBI Special Agents Ty Grady and Zane Garrett are suffering through something almost as frightening: the monotony of desk duty. When they're ordered to take a vacation for the good of everyone's sanity, Ty bites the bullet and takes Zane home with him to West Virginia, hoping the peace and quiet", "Six months after nearly losing their lives to a serial killer in New York City, FBI Special Agents Ty Grady and Zane Garrett are suffering through something almost as frightening: the monotony of desk duty. When they're ordered to take a vacation for the good of everyone's sanity, Ty bites the bullet and takes Zane home with him to West Virginia, hoping the peace and quiet of the mountains will give them the chance to explore the explosive attraction they've so far been unable to reconcile with their professional partnership. Ty and Zane, along with Ty's father and brother, head up into the Appalachian mountains for a nice, relaxing hike deep into the woods... where no one will hear them scream. They find themselves facing danger from all directions: unpredictable weather, the unrelenting mountains, wild animals, fellow hikers with nothing to lose, and the most terrifying challenge of all. Each other."], "author": "Abigail Roux", "num_pages": "322", "awards": [], "places": ["West Virginia", "Washington, D.C."], "character_names": ["Beaumont \"Ty\" Tyler Grady", "Zane Zachary Garrett", "Deacon \"Deuce\" Grady", "Earl Grady"], "language": "English", "publish_date": "2010-01-25 00:00:00", "ISBN": "1615813837"},
{"url": "https://www.goodreads.com/book/show/6542216-somebody-killed-his-editor", "num_ratings": "4,968", "num_reviews": "538", "avg_ratings": 4.02, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary"], "title": "Somebody Killed His Editor", "author": "Josh Lanyon", "num_pages": "272", "awards": [], "places": ["California"], "character_names": ["Christopher Holmes", "J.X. Moriarity"], "language": "English", "publish_date": "2009-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9578482-fish-chips", "num_ratings": "11,197", "num_reviews": "1,028", "avg_ratings": 4.48, "genres": ["Romance", "M M Romance", "Romance", "Mystery", "Contemporary"], "title": "Fish & Chips", "description": ["Special Agents Ty Grady and Zane Garrett are back on the job, settled into a personal and professional relationship built on fierce protectiveness and blistering passion. Now they're assigned to impersonate two members of an international smuggling ring-an out-and-proud married couple-on a Christmas cruise in the Caribbean. As their boss says, surely they'd rather kiss eac", "Special Agents Ty Grady and Zane Garrett are back on the job, settled into a personal and professional relationship built on fierce protectiveness and blistering passion. Now they're assigned to impersonate two members of an international smuggling ring-an out-and-proud married couple-on a Christmas cruise in the Caribbean. As their boss says, surely they'd rather kiss each other than be shot at, and he has no idea how right he is. Portraying the wealthy criminals requires a particular change in attitude from Ty and Zane while dealing with the frustrating waiting game of their assignment. As it begins to affect how they treat each other in private, Ty and Zane realize there's more to being partners than watching each other's backs, and when the case takes an unexpected turn and threatens Ty's life, Ty and Zane will have to navigate seas of white lies and stormy secrets, including some of their own."], "author": "Abigail Roux", "num_pages": "280", "awards": [], "places": ["Queen of the Mediterranean", "Caribbean", "Baltimore, Maryland"], "character_names": ["Beaumont \"Ty\" Tyler Grady", "Zane Zachary Garrett", "Corben Porter", "Del Porter", "Dan McCoy", "Lorenzo Bianci", "Norina Bianci", "Vartan Armen"], "language": "English", "publish_date": "2010-12-06 00:00:00", "ISBN": "1615812261"},
{"url": "https://www.goodreads.com/book/show/6084532-fatal-shadows-a-dangerous-thing", "num_ratings": "1,784", "num_reviews": "114", "avg_ratings": 4.38, "genres": ["Romance", "M M Romance", "Mystery", "Contemporary", "Romance"], "title": "Fatal Shadows / A Dangerous Thing", "description": ["Relationships can be murder. Bookseller and mystery author Adrien English is looking for love in all the wrong places--and, according to hot and handsome LAPD detective Jake Riordan, it's liable to get him killed.", "A serial killer is stalking gay men, and a tawny-eyed LAPD detective wants bookseller Adrien English in handcuffs -- for all the wrong reasons!", "Relationships can be murder. Bookseller and mystery author Adrien English is looking for love in all the wrong places--and, according to hot and handsome LAPD detective Jake Riordan, it's liable to get him killed.", "A serial killer is stalking gay men, and a tawny-eyed LAPD detective wants bookseller Adrien English in handcuffs -- for all the wrong reasons!", "When his romance goes south, Adrien heads north to the California Motherlode country. Can murder -- and Adrien's favorite LAPD detective -- be far behind?"], "author": "Josh Lanyon", "num_pages": "290", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2007-05-08 00:00:00", "ISBN": "1596324651"},
{"url": "https://www.goodreads.com/book/show/669790.The_Hell_You_Say", "num_ratings": "5,660", "num_reviews": "493", "avg_ratings": 4.2, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Mystery", "Crime"], "title": "The Hell You Say", "description": ["After bookstore clerk Angus flees following terrifying death threats, owner Adrien must contend with a mysterious Satanic cult, a hot and handsome university professor, and his on-again/off-again relationship with closeted LAPD Homicide Detective Jake Riordan."], "author": "Josh Lanyon", "num_pages": "232", "awards": ["Lambda Literary Award Nominee for Gay Mystery (2007)"], "places": ["California"], "character_names": ["Adrien English", "Jake Riordan"], "language": "English", "publish_date": "2006-03-06 00:00:00", "ISBN": "0595385125"},
{"url": "https://www.goodreads.com/book/show/4768530-death-of-a-pirate-king", "num_ratings": "5,767", "num_reviews": "523", "avg_ratings": 4.36, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Mystery", "Crime"], "title": "Death of a Pirate King", "description": ["Gay bookseller and reluctant amateur sleuth Adrien English's writing career is suddenly taking off. His first novel, Murder Will Out, has been optioned by notorious Hollywood actor Paul Kane. ", "But when murder makes an appearance at a dinner party, who should be called in but Adrien's former lover, handsome closeted detective Jake Riordan, now a Lieutenant with LAPD -- which", "Gay bookseller and reluctant amateur sleuth Adrien English's writing career is suddenly taking off. His first novel, Murder Will Out, has been optioned by notorious Hollywood actor Paul Kane. ", "But when murder makes an appearance at a dinner party, who should be called in but Adrien's former lover, handsome closeted detective Jake Riordan, now a Lieutenant with LAPD -- which may just drive Adrien's new boyfriend, sexy UCLA professor Guy Snowden, to commit a murder of his own."], "author": "Josh Lanyon", "num_pages": "248", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2008-09-13 00:00:00", "ISBN": "1934531316"},
{"url": "https://www.goodreads.com/book/show/7380117-the-dark-tide", "num_ratings": "5,941", "num_reviews": "560", "avg_ratings": 4.44, "genres": ["Romance", "M M Romance", "Mystery", "Romance", "Contemporary", "Mystery", "Crime"], "title": "The Dark Tide", "description": ["As if recovering from heart surgery beneath the gaze of his over-protective family wasn’t exasperating enough, someone keeps trying to break into Adrien English’s bookstore. What is this determined midnight intruder searching for?", "When a half-century old skeleton tumbles out of the wall in the midst of the Cloak and Dagger Bookstore renovation, Adrien turns to hot and hands", "As if recovering from heart surgery beneath the gaze of his over-protective family wasn’t exasperating enough, someone keeps trying to break into Adrien English’s bookstore. What is this determined midnight intruder searching for?", "When a half-century old skeleton tumbles out of the wall in the midst of the Cloak and Dagger Bookstore renovation, Adrien turns to hot and handsome ex-lover Jake Riordan -- now out-of-the closet and working as a private detective.", "Jake is only too happy to have reason to stay in close contact with Adrien, but there are more surprises in Adrien’s past than either of them expects -- and one of those surprises may prove hazardous to Jake’s own heart."], "author": "Josh Lanyon", "num_pages": "185", "awards": [], "places": ["California"], "character_names": [], "language": "English", "publish_date": "2009-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6382879-zero-at-the-bone", "num_ratings": "10,131", "num_reviews": "1,175", "avg_ratings": 4.14, "genres": ["Romance", "M M Romance", "Romance", "Contemporary", "Mystery"], "title": "Zero at the Bone", "description": ["After witnessing a mob hit, surgeon Jack Francisco is put into protective custody to keep him safe until he can testify. ", "A hitman known only as D is blackmailed into killing Jack, but when he tracks him down, his weary conscience won't allow him to murder an innocent man. ", "Finding in each other an unlikely ally, Jack and D are soon on the run from shadowy enemies. Forced to", "After witnessing a mob hit, surgeon Jack Francisco is put into protective custody to keep him safe until he can testify. ", "A hitman known only as D is blackmailed into killing Jack, but when he tracks him down, his weary conscience won't allow him to murder an innocent man. ", "Finding in each other an unlikely ally, Jack and D are soon on the run from shadowy enemies. Forced to work together to survive, the two men forge a bond that ripens into unexpected passion. Jack sees the wounded soul beneath D's cold, detached exterior, and D finds in Jack the person who can help him reclaim the man he once was. ", "As the day of Jack's testimony approaches, he and D find themselves not only fighting for their lives... but also fighting for their future. A future together."], "author": "Jane Seville", "num_pages": "308", "awards": ["DABWAHA Romance Tournament for Best GLBT Romance (2010)", "San Francisco Book Festival Nominee for Gay/Lesbian (Runner-Up) (2009)"], "places": ["Nevada", "Los Angeles, California", "Baltimore, Maryland", "Ohio", "Oregon", "Lake Tahoe", "California"], "character_names": [], "language": "English", "publish_date": "2009-04-06 00:00:00", "ISBN": "1935192817"}
]