[
{"url": "https://www.goodreads.com/book/show/37781.Things_Fall_Apart", "num_ratings": "236,327", "num_reviews": "11,136", "avg_ratings": 3.63, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Academic", "School", "Literature"], "title": "Things Fall Apart", "description": ["THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict betw", "THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict between the individual and society. ", "The second story, which is as modern as the first is ancient, and which elevates the book to a tragic plane, concerns the clash of cultures and the destruction of Okonkwo's world through the arrival of aggressive, proselytizing European missionaries. These twin dramas are perfectly harmonized, and they are modulated by an awareness capable of encompassing at once the life of nature, human history, and the mysterious compulsions of the soul. THINGS FALL APART is the most illuminating and permanent monument we have to the modern African experience as seen from within."], "author": "Chinua Achebe", "num_pages": "209", "awards": [], "places": ["Africa"], "character_names": ["Okonkwo"], "language": "English", "publish_date": "1994-09-01 00:00:00", "ISBN": "0385474547"},
{"url": "https://www.goodreads.com/book/show/41250.GraceLand", "num_ratings": "2,067", "num_reviews": "209", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "GraceLand", "description": ["This novel is set in Maroko, a sprawling, swampy, crazy and colorful ghetto of Lagos, Nigeria, and unfolds against a backdrop of lush reggae and highlife music, American movies and a harsh urban existence. Elvis Oke, a teenage Elvis impersonator spurred on by the triumphs of heroes in the American movies and books he devours, pursues his chosen vocation with ardent single-", "This novel is set in Maroko, a sprawling, swampy, crazy and colorful ghetto of Lagos, Nigeria, and unfolds against a backdrop of lush reggae and highlife music, American movies and a harsh urban existence. Elvis Oke, a teenage Elvis impersonator spurred on by the triumphs of heroes in the American movies and books he devours, pursues his chosen vocation with ardent single-mindedness. He suffers through hours of practice set to the tinny tunes emanating from the radio in the filthy shack he shares with his alcoholic father, his stepmother and his stepsiblings. He applies thick makeup that turns his black skin white, to make his performances more convincing for American tourists and hopefully net him dollars. But still he finds himself constantly broke. Beset by hopelessness and daunted by the squalor and violence of his daily life, he must finally abandon his dream.", "With job prospects few and far between. Elvis is tempted to a life of crime by the easy money his friend Redemption tells him is to be had in Lago's underworld. But the King of the Beggars, Elvis's enigmatic yet faithful adviser, intercedes. And so, torn by the frustration of unrealizable dreams and accompanied by an eclectic chorus of voices, Elvis must find a way to a Graceland of his own making.", "Graceland is the story of a son and his father, and an examination of postcolonial Nigeria, where the trappings of American culture reign supreme."], "author": "Chris Abani", "num_pages": "336", "awards": ["PEN/Hemingway Foundation Award (2005)", "California Book Award for Fiction (Silver) (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2005)"], "places": ["Nigeria", "Lagos"], "character_names": [], "language": "English", "publish_date": "2005-01-26 00:00:00", "ISBN": "0312425287"},
{"url": "https://www.goodreads.com/book/show/111085.No_Longer_at_Ease", "num_ratings": "5,919", "num_reviews": "438", "avg_ratings": 3.83, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Classics", "Western Africa", "Nigeria", "Historical", "Historical Fiction"], "title": "No Longer at Ease", "description": ["An alternate cover for this ISBN can be found ", ".", "Obi Okonkwo is an idealistic young man who has now returned to Nigeria for a job in the civil service. However in his new role he finds that the way of government seems to be corruption. Obi manages to resist the bribes offered to him, but when he falls in love with an unsuitable girl, he sinks further into emotional and f", "An alternate cover for this ISBN can be found ", ".", "Obi Okonkwo is an idealistic young man who has now returned to Nigeria for a job in the civil service. However in his new role he finds that the way of government seems to be corruption. Obi manages to resist the bribes offered to him, but when he falls in love with an unsuitable girl, he sinks further into emotional and financial turmoil."], "author": "Chinua Achebe", "num_pages": "194", "awards": [], "places": ["Lagos"], "character_names": ["Obi Okonkwo"], "language": "English", "publish_date": "1994-09-16 00:00:00", "ISBN": "0385474555"},
{"url": "https://www.goodreads.com/book/show/387509.Houseboy", "num_ratings": "1,396", "num_reviews": "79", "avg_ratings": 3.73, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Central Africa", "Cameroon", "Cultural", "France", "Historical", "Historical Fiction"], "title": "Houseboy", "description": ["Toundi Ondoua, the rural African protagonist of Houseboy, encounters a world of prisms that cast beautiful but unobtainable glimmers, especially for a black youth in colonial Cameroon. ", ", written in the form of Toundi's captivating diary and translated from the original French, discloses his awe of the white world and a web of unpredictable experiences. Early on, he", "Toundi Ondoua, the rural African protagonist of Houseboy, encounters a world of prisms that cast beautiful but unobtainable glimmers, especially for a black youth in colonial Cameroon. ", ", written in the form of Toundi's captivating diary and translated from the original French, discloses his awe of the white world and a web of unpredictable experiences. Early on, he escapes his father's angry blows by seeking asylum with his benefactor, the local European priest who meets an untimely death. Toundi then becomes \"the Chief European's 'boy'--the dog of the King.\" Toundi's attempt to fulfill a dream of advancement and improvement opens his eyes to troubling realities. Gradually, preconceptions of the Europeans come crashing down on him as he struggles with his identity, his place in society, and the changing culture."], "author": "Ferdinand Oyono", "num_pages": "122", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-08-15 00:00:00", "ISBN": "0435905325"},
{"url": "https://www.goodreads.com/book/show/159336.Weep_Not_Child", "num_ratings": "1,951", "num_reviews": "157", "avg_ratings": 3.85, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Eastern Africa", "Kenya", "Classics", "Literature", "Academic", "School", "Novels", "Historical", "Historical Fiction", "Literary Fiction"], "title": "Weep Not, Child", "description": ["Tells the moving story about the effects of the Mau Mau war on the lives of ordinary men and women in Kenya. In the forests, the Mau Mau are waging war against the white government, and two brothers, Kamau and Njoroge, and the rest of the family must decide where their loyalties lie."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-04-30 00:00:00", "ISBN": "0435908308"},
{"url": "https://www.goodreads.com/book/show/65249.A_Dry_White_Season", "num_ratings": "2,976", "num_reviews": "184", "avg_ratings": 4.04, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "South Africa", "Historical", "Historical Fiction"], "title": "A Dry White Season", "description": ["As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple", "As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple, apolitical man, he believes in the essential fairness of the South African government and its policies—until the sudden arrest and subsequent \"suicide\" of a black janitor from Du Toit's school. Haunted by new questions and desperate to believe that the man's death was a tragic accident, Du Toit undertakes an investigation into the terrible affair—a quest for the truth that will have devastating consequences for the teacher and his family, as it draws him into a lethal morass of lies, corruption, and murder."], "author": "André Brink", "num_pages": "316", "awards": ["Prix Médicis Etranger (1980)"], "places": ["Johannesburg"], "character_names": [], "language": "English", "publish_date": "2006-09-19 00:00:00", "ISBN": "0061138630"},
{"url": "https://www.goodreads.com/book/show/540864.Allah_is_Not_Obliged", "num_ratings": "1,107", "num_reviews": "126", "avg_ratings": 3.65, "genres": ["Cultural", "Africa", "Fiction", "War", "Cultural", "France", "Western Africa", "Ivory Coast", "Literature", "African Literature", "Literature", "Novels", "Africa", "Western Africa", "Contemporary"], "title": "Allah is Not Obliged", "description": ["ALLAH IS NOT OBLIGED TO BE FAIR ABOUT ALL THE THINGS HE DOES HERE ON EARTH.These are the words of the boy soldier Birahima in the final masterpiece by one of Africa's most celebrated writers, Ahmadou Kourouma. When ten-year-old Birahima's mother dies, he leaves his native village in the Ivory Coast, accompanied by the sorcerer and cook Yacouba, to search for his aunt Mahan", "ALLAH IS NOT OBLIGED TO BE FAIR ABOUT ALL THE THINGS HE DOES HERE ON EARTH.These are the words of the boy soldier Birahima in the final masterpiece by one of Africa's most celebrated writers, Ahmadou Kourouma. When ten-year-old Birahima's mother dies, he leaves his native village in the Ivory Coast, accompanied by the sorcerer and cook Yacouba, to search for his aunt Mahan. Crossing the border into Liberia, they are seized by rebels and forced into military service. Birahima is given a Kalashnikov, minimal rations of food, a small supply of dope and a tiny wage. Fighting in a chaotic civil war alongside many other boys, Birahima sees death, torture, dismemberment and madness but somehow manages to retain his own sanity. Raw and unforgettable, despairing yet filled with laughter, ", " reveals the ways in which children's innocence and youth are compromised by war."], "author": "Ahmadou Kourouma", "num_pages": "215", "awards": ["Prix Renaudot (2000)", "Prix Goncourt des Lycéens (2000)", "French-American Foundation Translation Prize Nominee for Fiction (2007)", "Prix Amerigo Vespucci (2000)", "Premio Grinzane Cavour Nominee for Narrativa Straniera (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-08 00:00:00", "ISBN": "030727957X"},
{"url": "https://www.goodreads.com/book/show/111050.July_s_People", "num_ratings": "5,468", "num_reviews": "433", "avg_ratings": 3.54, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Historical", "Historical Fiction", "Novels"], "title": "July's People", "description": ["For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable lo", "For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable look into the terrifying, tacit understandings and misunderstandings between blacks and whites."], "author": "Nadine Gordimer", "num_pages": "160", "awards": ["Premio Grinzane Cavour Nominee for Narrativa Straniera (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "1982-07-29 00:00:00", "ISBN": "0140061401"},
{"url": "https://www.goodreads.com/book/show/7244.The_Poisonwood_Bible", "num_ratings": "591,565", "num_reviews": "20,959", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Classics"], "title": "The Poisonwood Bible", "description": [" is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is", " is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is a suspenseful epic of one family's tragic undoing and remarkable reconstruction over the course of three decades in postcolonial Africa."], "author": "Barbara Kingsolver", "num_pages": "546", "awards": ["Pulitzer Prize Nominee for Fiction (1999)", "Orange Prize Nominee for Fiction Shortlist (1999)", "Book Sense Book of the Year Award for Adult (2000)", "PEN/Faulkner Award for Fiction Nominee (1999)", "Independent Publisher Book Award (IPPY) for Audio Fiction - Unabridged (1999)", "Exclusive Books Boeke Prize (2000)", "Puddly Award for Novel (2001)"], "places": ["Bethlehem, Georgia", "Kilanga", "Sanderling Island, Georgia", "Leopoldville"], "character_names": ["Orleanna Price", "Ruth May Price", "Rachel Rebeccah Price", "Leah Price", "Nathan Price", "Dr Bud Wharton", "Adah Price", "Reverend & Mrs. Underdown"], "language": "English", "publish_date": "2005-07-05 00:00:00", "ISBN": "0060786507"},
{"url": "https://www.goodreads.com/book/show/6930014-cutting-for-stone", "num_ratings": "304,877", "num_reviews": "23,928", "avg_ratings": 4.28, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Book Club", "Eastern Africa", "Ethiopia", "Health", "Medicine"], "title": "Cutting for Stone", "description": ["Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon. Orphaned by their mother’s death and their father’s disappearance, bound together by a preternatural connection and a shared fascination with medicine, the twins come of age as Ethiopia hovers on the brink of revolution. ", " ", "Moving from Addis Ababa to Ne", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon. Orphaned by their mother’s death and their father’s disappearance, bound together by a preternatural connection and a shared fascination with medicine, the twins come of age as Ethiopia hovers on the brink of revolution. ", " ", "Moving from Addis Ababa to New York City and back again, ", " is an unforgettable story of love and betrayal, medicine and ordinary miracles—and two brothers whose fates are forever intertwined. --back cover"], "author": "Abraham Verghese", "num_pages": "670", "awards": ["PEN/Hemingway Foundation Award Nominee (2010)", "Exclusive Books Boeke Prize Nominee (2011)", "Indies Choice Book Award for Adult Fiction (2010)", "Dayton Literary Peace Prize Nominee for Fiction (2010)", "Wellcome Book Prize Nominee for Shortlist (2009)", "Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Addis Ababa"], "character_names": ["Thomas Stone", "Sister Mary Joseph Praise", "Marion Stone", "Shiva Stone"], "language": "English", "publish_date": "2010-01-16 00:00:00", "ISBN": "0375714367"},
{"url": "https://www.goodreads.com/book/show/944103.The_Palm_Wine_Drinkard", "num_ratings": "1,586", "num_reviews": "159", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "Africa", "Fantasy", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "The Palm-Wine Drinkard", "description": ["When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African (Nigeria) Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages", "When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African (Nigeria) Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages and has come to be regarded as a masterwork of one of Africa's most influential writers."], "author": "Amos Tutuola", "num_pages": "125", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1977-08-16 00:00:00", "ISBN": "0571049966"},
{"url": "https://www.goodreads.com/book/show/669780.Season_of_Migration_to_the_North", "num_ratings": "15,293", "num_reviews": "1,931", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Northern Africa", "Sudan", "Literature"], "title": "Season of Migration to the North", "description": ["After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into", "After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into his confidence, telling him the story of his own years in London, of his brilliant career as an economist, and of the series of fraught and deadly relationships with European women that led to a terrible public reckoning and his return to his native land.", "But what is the meaning of Mustafa’s shocking confession? Mustafa disappears without explanation, leaving the young man—whom he has asked to look after his wife—in an unsettled and violent no-man’s-land between Europe and Africa, tradition and innovation, holiness and defilement, and man and woman, from which no one will escape unaltered or unharmed.", "Season of Migration to the North is a rich and sensual work of deep honesty and incandescent lyricism. In 2001 it was selected by a panel of Arab writers and critics as the most important Arab novel of the twentieth century."], "author": "Tayeb Salih", "num_pages": "176", "awards": [], "places": ["North Africa"], "character_names": [], "language": "English", "publish_date": "1970-01-01 00:00:00", "ISBN": "0435900668"},
{"url": "https://www.goodreads.com/book/show/6194.Waiting_for_the_Barbarians", "num_ratings": "20,672", "num_reviews": "1,445", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Literature", "Southern Africa", "South Africa"], "title": "Waiting for the Barbarians", "description": ["For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that bran", "For decades the Magistrate has been a loyal servant of the Empire, running the affairs of a tiny frontier settlement and ignoring the impending war with the barbarians. When interrogation experts arrive, however, he witnesses the Empire's cruel and unjust treatment of prisoners of war. Jolted into sympathy for their victims, he commits a quixotic act of rebellion that brands him an enemy of the state.J. M. Coetzee's prize-winning novel is a startling allegory of the war between opressor and opressed. The Magistrate is not simply a man living through a crisis of conscience in an obscure place in remote times; his situation is that of all men living in unbearable complicity with regimes that ignore justice and decency."], "author": "J.M. Coetzee", "num_pages": "152", "awards": ["James Tait Black Memorial Prize for Fiction (1980)", "Philip K. Dick Award Nominee (1982)", "CNA Literary Award", "Geoffrey Faber Memorial Prize (1981)"], "places": [], "character_names": ["The Magistrate"], "language": "English", "publish_date": "1999-10-01 00:00:00", "ISBN": "0140283358"},
{"url": "https://www.goodreads.com/book/show/37774.Arrow_of_God", "num_ratings": "3,965", "num_reviews": "302", "avg_ratings": 3.81, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Classics", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Literature", "Novels", "Literature", "20th Century", "Literary Fiction"], "title": "Arrow of God", "description": ["Set in the Igbo heartland of eastern Nigeria, one of Africa's best-known writers describes the conflict between old and new in its most poignant aspect: the personal struggle between father and son.", "Ezeulu, the headstrong chief priest of the god Ulu, is worshipped by the six villages of Umuaro. But his authority is increasingly under threat—from rivals within his tribe, fro", "Set in the Igbo heartland of eastern Nigeria, one of Africa's best-known writers describes the conflict between old and new in its most poignant aspect: the personal struggle between father and son.", "Ezeulu, the headstrong chief priest of the god Ulu, is worshipped by the six villages of Umuaro. But his authority is increasingly under threat—from rivals within his tribe, from functionaries of the colonial government, and even from his own family members. Yet he believes himself to be untouchable: surely he is an arrow in the bow of his God? Armed with this belief, he is prepared to lead his people, even if it is towards their own destruction. But his people will not be dominated so easily.", "Spare and powerful, Arrow of God is an unforgettable portrayal of the loss of faith, and the downfall of a man in a society forever altered by colonialism."], "author": "Chinua Achebe", "num_pages": "230", "awards": ["Jock Campbell-New Statesman Award (1965)"], "places": ["Nigeria"], "character_names": ["Ezeulu", "Obika", "Oduche"], "language": "English", "publish_date": "1989-01-01 00:00:00", "ISBN": "0385014805"},
{"url": "https://www.goodreads.com/book/show/37772.A_Man_of_the_People", "num_ratings": "3,072", "num_reviews": "202", "avg_ratings": 3.87, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria", "Historical", "Historical Fiction"], "title": "A Man of the People", "description": ["By the renowned author of \"Things Fall Apart,\" this novel foreshadows the Nigerian coups of 1966 and shows the color and vivacity as well as the violence and corruption of a society making its own way between the two worlds."], "author": "Chinua Achebe", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-16 00:00:00", "ISBN": "0385086164"},
{"url": "https://www.goodreads.com/book/show/666276.Zenzele", "num_ratings": "996", "num_reviews": "116", "avg_ratings": 4.1, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Literature", "Historical", "Historical Fiction"], "title": "Zenzele: A Letter for My Daughter", "description": ["Written as a letter from a Zimbabwean mother to her daughter, a student at Harvard, J. Nozipo Maraire evokes the moving story of a mother reaching out to her daughter to share the lessons life has taught her and bring the two closer than ever before. Interweaving history and memories, disappointments and dreams, ", " tells the tales of Zimbabwe's struggle for independen", "Written as a letter from a Zimbabwean mother to her daughter, a student at Harvard, J. Nozipo Maraire evokes the moving story of a mother reaching out to her daughter to share the lessons life has taught her and bring the two closer than ever before. Interweaving history and memories, disappointments and dreams, ", " tells the tales of Zimbabwe's struggle for independence and the men and women who shaped it: Zenzele's father, an outspoken activist lawyer; her aunt, a schoolteacher by day and secret guerrilla fighter by night; and her cousin, a maid and a spy.", "Rich with insight, history, and philosophy, ", " is a powerful and compelling story that is both revolutionary and revelatory--the story of one life that poignantly speaks of all lives."], "author": "J. Nozipo Maraire", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-04-07 00:00:00", "ISBN": "0385318227"},
{"url": "https://www.goodreads.com/book/show/880196.Sozaboy", "num_ratings": "659", "num_reviews": "48", "avg_ratings": 3.95, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "Sozaboy", "description": [" describes the fortunes of a young naive recruit in the Nigerian Civil War: from the first proud days of recruitment to the disillusionment, confusion and horror that follows. The author's use of 'rotten English'—a mixture of Nigerian pidgin English, broken English and idiomatic English—makes this a unique and powerful novel."], "author": "Ken Saro-Wiwa", "num_pages": "188", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1995-04-28 00:00:00", "ISBN": "0582236991"},
{"url": "https://www.goodreads.com/book/show/1418554.Year_of_the_Uprising", "num_ratings": "4", "num_reviews": "0", "avg_ratings": 3.75, "genres": ["Literature", "African Literature", "Cultural", "Africa"], "title": "Year of the Uprising", "author": "Stanlake Samkange", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1978-12-31 00:00:00", "ISBN": "0435901907"},
{"url": "https://www.goodreads.com/book/show/2227966.The_Camel_Bookmobile", "num_ratings": "2,048", "num_reviews": "473", "avg_ratings": 3.35, "genres": ["Fiction", "Cultural", "Africa", "Writing", "Books About Books", "Adult Fiction", "Eastern Africa", "Kenya"], "title": "The Camel Bookmobile", "description": ["Fiona Sweeney wants to do something that matters, and she chooses to make her mark in the arid bush of northeastern Kenya. By helping to start a traveling library, she hopes to bring the words of Homer, Hemingway, and Dr. Seuss to far-flung tiny communities where people live daily with drought, hunger, and disease. Her intentions are honorable, and her rules are firm: due", "Fiona Sweeney wants to do something that matters, and she chooses to make her mark in the arid bush of northeastern Kenya. By helping to start a traveling library, she hopes to bring the words of Homer, Hemingway, and Dr. Seuss to far-flung tiny communities where people live daily with drought, hunger, and disease. Her intentions are honorable, and her rules are firm: due to the limited number of donated books, if any one of them is not returned, the bookmobile will not return.", "But, encumbered by her Western values, Fi does not understand the people she seeks to help. And in the impoverished small community of Mididima, she finds herself caught in the middle of a volatile local struggle when the bookmobile's presence sparks a dangerous feud between the proponents of modernization and those who fear the loss of traditional ways."], "author": "Masha Hamilton", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "0061173495"},
{"url": "https://www.goodreads.com/book/show/8264096-goatsmell", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 4.0, "genres": ["Africa", "Southern Africa", "Cultural", "Africa"], "title": "Goatsmell", "description": ["This is the story of the African's continuing pain over the ages: the dismembering, dispossession and repression of the African people both by the colonialists and later their own governments. Told with pathos and vibrancy, it is still peppered with romance and sprightly humor. It is an optimistic look at the future of Africa and her people."], "author": "Nevanji Madanhire", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-08-16 00:00:00", "ISBN": "9966464530"},
{"url": "https://www.goodreads.com/book/show/3426024-tussen-twee-paleizen", "num_ratings": "11,751", "num_reviews": "1,142", "avg_ratings": 4.15, "genres": ["Fiction", "Historical", "Historical Fiction", "Northern Africa", "Egypt", "Cultural", "Africa", "Novels"], "title": "Tussen twee paleizen", "description": ["Dit eerste deel van Mahfoez’ beroemde drieluik speelt in de tijd dat het verzet tegen de Britse aanwezigheid in Egypte groeiende was.", "Mahfoez beschrijft de lotgevallen van de koopmansfamilie Abd al-Gawwaad in deze woelige periode in de Egyptische geschiedenis."], "author": "Naguib Mahfouz", "num_pages": "572", "awards": [], "places": ["Cairo"], "character_names": [], "language": "Dutch", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/712960.Mine_Boy_Aws_B", "num_ratings": "626", "num_reviews": "52", "avg_ratings": 3.9, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "South Africa", "Literature", "African Literature"], "title": "Mine Boy Aws B", "description": ["First published in 1946, this novel exposed the condition of black South Africans under a white regime. It presents a portrait of labour discrimination, appalling housing conditions and one man's humanitarian act of defiance."], "author": "Peter  Abrahams", "num_pages": "184", "awards": [], "places": ["Johannesburg"], "character_names": [], "language": "English", "publish_date": "2008-09-18 00:00:00", "ISBN": "0435905627"},
{"url": "https://www.goodreads.com/book/show/27071490-homegoing", "num_ratings": "90,943", "num_reviews": "12,712", "avg_ratings": 4.42, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Africa", "Historical", "Literary Fiction"], "title": "Homegoing", "description": ["A novel of breathtaking sweep and emotional power that traces three hundred years in Ghana and along the way also becomes a truly great American novel. Extraordinary for its exquisite language, its implacable sorrow, its soaring beauty, and for its monumental portrait of the forces that shape families and nations, ", " heralds the arrival of a major new voice in conte", "A novel of breathtaking sweep and emotional power that traces three hundred years in Ghana and along the way also becomes a truly great American novel. Extraordinary for its exquisite language, its implacable sorrow, its soaring beauty, and for its monumental portrait of the forces that shape families and nations, ", " heralds the arrival of a major new voice in contemporary fiction.", "Two half-sisters, Effia and Esi, are born into different villages in eighteenth-century Ghana. Effia is married off to an Englishman and lives in comfort in the palatial rooms of Cape Coast Castle. Unbeknownst to Effia, her sister, Esi, is imprisoned beneath her in the castle's dungeons, sold with thousands of others into the Gold Coast's booming slave trade, and shipped off to America, where her children and grandchildren will be raised in slavery. One thread of ", " follows Effia's descendants through centuries of warfare in Ghana, as the Fante and Asante nations wrestle with the slave trade and British colonization. The other thread follows Esi and her children into America. From the plantations of the South to the Civil War and the Great Migration, from the coal mines of Pratt City, Alabama, to the jazz clubs and dope houses of twentieth-century Harlem, right up through the present day, ", " makes history visceral, and captures, with singular and stunning immediacy, how the memory of captivity came to be inscribed in the soul of a nation. ", "Generation after generation, Yaa Gyasi's magisterial first novel sets the fate of the individual against the obliterating movements of time, delivering unforgettable characters whose lives were shaped by historical forces beyond their control. ", " is a tremendous reading experience, not to be missed, by an astonishingly gifted young writer."], "author": "Yaa Gyasi", "num_pages": "300", "awards": ["American Book Award (2017)", "PEN/Robert W. Bingham Prize Nominee for Shortlist (2017)", "Audie Award for Literary Fiction & Classics (2017)", "Dylan Thomas Prize Nominee for Longlist (2017)", "National Book Critics Circle Award for John Leonard Prize (2016)", "The Center for Fiction First Novel Prize Nominee for Shortlist (2016)", "Andrew Carnegie Medal Nominee for Fiction (2017)", "Goodreads Choice Award Nominee for Historical Fiction (2016)", "Alabama Author Award for Fiction (2017)"], "places": [], "character_names": ["Cobbe Otcher", "Effia Otcher", "Big Man Assare", "Esi Assare", "Quey Collins", "Richard Collins", "Ness Stockham", "Sam", "James Richard Collins", "Akosua Mensah", "Kojo Freeman", "Anna Foster", "Abena Collins", "Ohene Nyarko", "H Black", "Ethe Jackson", "Akua Collins", "Asamoah Agyekum", "Eli Dalton", "Willie Black", "Robert Clifton", "Yaw Agyekum", "Esther Amoah", "Carson Clifton", "Amani Zulema", "Marjorie Agyekum", "Marcus Clifton", "Maame"], "language": "English", "publish_date": "2016-06-07 00:00:00", "ISBN": "1101947136"},
{"url": "https://www.goodreads.com/book/show/256466.Ancestor_Stones", "num_ratings": "706", "num_reviews": "101", "avg_ratings": 3.74, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Western Africa", "Sierra Leone", "Literature", "African Literature"], "title": "Ancestor Stones", "description": ["A powerful, sensuously written novel that, through the lives of women, beautifully captures Africa’s past and present, and the legacy that her daughters take with them wherever they live.", "From the author of The Devil That Danced on the Water - a timeless portrait of the lives of a family of independent, spirited African women over the last century of dramatic cultural chang", "A powerful, sensuously written novel that, through the lives of women, beautifully captures Africa’s past and present, and the legacy that her daughters take with them wherever they live.", "From the author of The Devil That Danced on the Water - a timeless portrait of the lives of a family of independent, spirited African women over the last century of dramatic cultural change ", "Aminatta Forna’s The Devil That Danced on the Water was rapturously acclaimed, a moving and gorgeously written memoir that garnered inter­national attention. Now she has seamlessly turned her hand to fiction and delivers a novel that is lush and beautiful, a touching and intimate portrait of several generations of African women. ", "In Ancestor Stones, a young woman from West Africa, who has lived in England for many years and is married to a British man, returns to visit her family after years of civil war. Her four aunts have decided to leave her the family coffee plantation, as she is the last person in the family with the means to revive its fortunes. And on this trip home she is given an unprecedented look into the lives of the women in her family as her aunts Mary, Hawa, Asana, and Serah— women who were mysterious and a bit intimidating to her younger self—begin to tell her their stories. They are timeless tales of rivalrous co-wives, patriarchal society, and old religions challenged by Islamic and Christian incursions; they are modern stories of European-owned mining companies, the repressive influence of mission schools, corrupt elections, and the postcolonial African elite. Through their voices a family history interwoven with the history of a country emerges—one of a society both ancient and modern, of a family of strong women refusing to live as second-class citizens. ", "In her debut foray into fiction, Forna has created a powerful, sensuously written novel that, through the lives of women, beautifully captures Africa’s past and present, and the legacy that her daughters take with them wherever they live. It is a wonderful achievement that recalls The God of Small Things and The Joy Luck Club, and establishes Forna as a gifted novelist."], "author": "Aminatta Forna", "num_pages": "336", "awards": ["Hurston/Wright Legacy Award for Debut Fiction (2007)", "Frankfurt Book Fair LiBeraturpreis (2008)"], "places": ["West Africa"], "character_names": [], "language": "English", "publish_date": "2006-08-14 00:00:00", "ISBN": "0871139448"},
{"url": "https://www.goodreads.com/book/show/16101484-afrosf", "num_ratings": "173", "num_reviews": "29", "avg_ratings": 3.85, "genres": ["Science Fiction", "Short Stories", "Cultural", "Africa", "Anthologies", "Fiction"], "title": "AfroSF: Science Fiction by African Writers", "description": [" is the first ever anthology of Science Fiction by African writers only that was open to submissions of original (previously unpublished) works across Africa and abroad.", "'Proposition 23' by Efe Okogu nominated for the 2013 BSFA awards.", "TOC:", "'Moom!' Nnedi Okorafor", "'Home Affairs' Sarah Lotz", "'The Sale' Tendai Huchu", "'Five Sets of Hands' Cristy Zinn", "'New Mzansi' Ashley Jacobs", "'Az", " is the first ever anthology of Science Fiction by African writers only that was open to submissions of original (previously unpublished) works across Africa and abroad.", "'Proposition 23' by Efe Okogu nominated for the 2013 BSFA awards.", "TOC:", "'Moom!' Nnedi Okorafor", "'Home Affairs' Sarah Lotz", "'The Sale' Tendai Huchu", "'Five Sets of Hands' Cristy Zinn", "'New Mzansi' Ashley Jacobs", "'Azania' Nick Wood", "'Notes from Gethsemane' Tade Thompson", "'Planet X' S.A. Partridge", "'The Gift of Touch' Chinelo Onwualu", "'The Foreigner' Uko Bendi Udo", "'Angel Song' Dave de Burgh", "'The Rare Earth' Biram Mboob", "'Terms & Conditions Apply' Sally-Ann Murray", "'Heresy' Mandisi Nkomo", "'Closing Time' Liam Kruger", "'Masquerade Stories' Chiagozie Fred Nwonwu", "'The Trial' Joan De La Haye", "'Brandy City' Mia Arderne", "'Ofe!' Rafeeat Aliyu", "'Claws and Savages' Martin Stokes", "'To Gaze at the Sun' Clifton Gachagua", "'Proposition 23' (Novelette) Efe Okogu"], "author": "Ivor W. Hartmann", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9125646-on-black-sisters-street", "num_ratings": "1,350", "num_reviews": "218", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Cultural", "Belgium", "Literature", "African Literature"], "title": "On Black Sisters Street", "description": [" tells the haunting story of four very different women who have left their African homeland for the riches of Europe—and who are thrown together by bad luck and big dreams into a sisterhood that will change their lives. ", "Each night, Sisi, Ama, Efe, and Joyce stand in the windows of Antwerp’s red-light district, promising to make men’s desires come tru", " tells the haunting story of four very different women who have left their African homeland for the riches of Europe—and who are thrown together by bad luck and big dreams into a sisterhood that will change their lives. ", "Each night, Sisi, Ama, Efe, and Joyce stand in the windows of Antwerp’s red-light district, promising to make men’s desires come true—if only for half an hour. Pledged to the fierce Madam and a mysterious pimp named Dele, the girls share an apartment but little else—they keep their heads down, knowing that one step out of line could cost them a week’s wages. They open their bodies to strangers but their hearts to no one, each focused on earning enough to get herself free, to send money home or save up for her own future.", "Then, suddenly, a murder shatters the still surface of their lives. Drawn together by tragedy and the loss of one of their own, the women realize that they must choose between their secrets and their safety. As they begin to tell their stories, their confessions reveal the face in Efe’s hidden photograph, Ama’s lifelong search for a father, Joyce’s true name, and Sisi’s deepest secrets—-and all their tales of fear, displacement, and love, concluding in a chance meeting with a powerful, sinister stranger.", " marks the U.S. publication debut of Chika Unigwe, a brilliant new writer and a standout voice among contemporary", "African authors. Raw, vivid, unforgettable, and inspired by a powerful oral storytelling tradition, this novel illuminates the dream of the West—and that dream’s illusion and annihilation—as seen through African eyes. It is a story of courage, unity, and hope, of women’s friendships and of bonds that, once forged, cannot be broken."], "author": "Chika Unigwe", "num_pages": "258", "awards": ["Nigeria Prize for Literature (2012)"], "places": ["Nigeria", "Belgium"], "character_names": [], "language": "English", "publish_date": "2011-04-26 00:00:00", "ISBN": "1400068339"},
{"url": "https://www.goodreads.com/book/show/34533486-o-arovan", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 3.0, "genres": [], "title": "Očarovaná", "description": ["Kateřina odlétá do Keni čerpat inspiraci pro nový román. Jenže uvidí, něco co neměla, a tím nad sebou vynese rozsudek smrti. Sandra tuší, že se sestře přihodilo něco zlého. Vydá se na stejně nebezpečnou cestu a upadne do pasti kmenových tabu, kouzelných rituálů a mocných kleteb..."], "author": "Hana Hindráková", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "Czech", "publish_date": "2015-08-16 00:00:00", "ISBN": "9788074667"},
{"url": "https://www.goodreads.com/book/show/16059213-fine-boys", "num_ratings": "95", "num_reviews": "16", "avg_ratings": 3.86, "genres": ["Western Africa", "Nigeria", "Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Literature", "African Literature"], "title": "Fine Boys", "description": ["In his second novel, Eghosa Imasuen presents the everyday life of a Nigerian university student against the backdrop of the pro-democracy riots of the 1980s and ‘90s, the lost hopes of June 12th, and the terror of the Abacha years."], "author": "Eghosa Imasuen", "num_pages": "274", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2012-07-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25258507-dobrovolnice", "num_ratings": "7", "num_reviews": "2", "avg_ratings": 4.0, "genres": ["Cultural", "Africa"], "title": "Dobrovolnice", "author": "Hana Hindráková", "num_pages": "228", "awards": [], "places": [], "character_names": [], "language": "Czech", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22461198-karibu-ke-a", "num_ratings": "5", "num_reviews": "3", "avg_ratings": 3.2, "genres": [], "title": "Karibu Keňa", "description": ["Sára Ječmínková se po zklamání v osobním životě rozhodne začít znovu – a to od základu. Rodnou zemi nechává za zády a jako delegátka cestovní kanceláře odjíždí do Keni. Ta jí hned od první chvíle učaruje a její život dostává nový rozměr. Se všemi klady a přese všechny zápory, které život v okouzlující, ale také velmi chudé a povolebními nepokoji zmítané exotické zemi nabíz", "Sára Ječmínková se po zklamání v osobním životě rozhodne začít znovu – a to od základu. Rodnou zemi nechává za zády a jako delegátka cestovní kanceláře odjíždí do Keni. Ta jí hned od první chvíle učaruje a její život dostává nový rozměr. Se všemi klady a přese všechny zápory, které život v okouzlující, ale také velmi chudé a povolebními nepokoji zmítané exotické zemi nabízí.", "Seznamuje se s Benem Okongem, jenž pochází z kmene Luo, dozvídá se o tradičních kmenových rituálech a zvycích. A zamiluje se. Je tu však také někdo, kdo Sáře nový život nepřeje a ohrožuje ji černou magií.", "Podaří se Sáře vytoužené a přitom tak křehké štěstí v Keni ubránit?"], "author": "Hana Hindráková", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "Czech", "publish_date": "2013-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6949725-powder-necklace", "num_ratings": "224", "num_reviews": "44", "avg_ratings": 3.78, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Ghana", "Young Adult", "Novels"], "title": "Powder Necklace", "description": ["To protect her daughter from the fast life and bad influences of London, her mother sent her to school in rural Ghana. The move was for the girl’s own good, in her mother’s mind, but for the daughter, the reality of being the new girl, the foreigner-among-your-own-people, was even worse than the idea. ", "During her time at school, she would learn that Ghana was much more comp", "To protect her daughter from the fast life and bad influences of London, her mother sent her to school in rural Ghana. The move was for the girl’s own good, in her mother’s mind, but for the daughter, the reality of being the new girl, the foreigner-among-your-own-people, was even worse than the idea. ", "During her time at school, she would learn that Ghana was much more complicated than her fellow ex-pats had ever told her, including how much a London-raised child takes something like water for granted. In Ghana, water “became a symbol of who had and who didn’t, who believed in God and who didn’t. If you didn’t have water to bathe, you were poor because no one had sent you some.”", "After six years in Ghana, her mother summons her home to London to meet the new man in her mother’s life—and his daughter. The reunion is bittersweet and short-lived as her parents decide it’s time that she get to know her father. So once again, she’s sent off, this time to live with her father, his new wife, and their young children in New York—but not before a family trip to Disney World."], "author": "Nana Ekua Brew-Hammond", "num_pages": "304", "awards": [], "places": ["Ghana"], "character_names": [], "language": "English", "publish_date": "2010-04-06 00:00:00", "ISBN": "1439149119"},
{"url": "https://www.goodreads.com/book/show/385234.Jump_and_Other_Stories", "num_ratings": "801", "num_reviews": "53", "avg_ratings": 3.92, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Literature", "Literature", "African Literature"], "title": "Jump and Other Stories", "description": ["In sixteen new stories ranging from the dynamics of family life to the worldwide confusion of human values, Nadine Gordimer gives us access to many lives in places as far apart as suburban London, Mozambique, a mythical island, and South Africa. In \"Some Are Born to Sweet Delight, \" a girl's innocent love for an enigmatic foreign lodger in her parents' home leads her to in", "In sixteen new stories ranging from the dynamics of family life to the worldwide confusion of human values, Nadine Gordimer gives us access to many lives in places as far apart as suburban London, Mozambique, a mythical island, and South Africa. In \"Some Are Born to Sweet Delight, \" a girl's innocent love for an enigmatic foreign lodger in her parents' home leads her to involve others in a tragedy of international terrorism. \"The Moment Before the Gun Went Off\" reveals the strange mystery behind an accident in which a white farmer has killed a black boy. \"Once Upon a Time\" is a horrifying fairy tale about a child raised in a society founded on fear."], "author": "Nadine Gordimer", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-10-01 00:00:00", "ISBN": "0140165347"},
{"url": "https://www.goodreads.com/book/show/25825065-marshall-s-family", "num_ratings": "13", "num_reviews": "5", "avg_ratings": 4.46, "genres": [], "title": "Marshall's Family", "description": ["Richard Marshall is a pilot, working in Africa, who wishes for a quiet domestic life. Unfortunately, he has a wife who despises him, a daughter who brings home problems and a lover who wants him all to herself. ", "He is an an easy-going, unremarkable man who avoids responsibility whenever he can, yet the responsibilities just keep piling up, until perhaps the fate of an entir", "Richard Marshall is a pilot, working in Africa, who wishes for a quiet domestic life. Unfortunately, he has a wife who despises him, a daughter who brings home problems and a lover who wants him all to herself. ", "He is an an easy-going, unremarkable man who avoids responsibility whenever he can, yet the responsibilities just keep piling up, until perhaps the fate of an entire nation rests on his inadequate shoulders. People are dying and the situation needs a hero, what it has is Richard Marshall."], "author": "Anson Welsh", "num_pages": "277", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1262482.On_Trial_for_My_Country", "num_ratings": "22", "num_reviews": "8", "avg_ratings": 3.95, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe"], "title": "On Trial for My Country", "description": ["This historical novel looks at the clash between Cecil Rhodes and Lobengula, the Matebele King."], "author": "Stanlake Samkange", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1967-10-01 00:00:00", "ISBN": "0435900331"},
{"url": "https://www.goodreads.com/book/show/5949136-circles-in-a-forest", "num_ratings": "1,805", "num_reviews": "64", "avg_ratings": 4.23, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Historical", "Historical Fiction", "Drama", "Classics", "Literature", "African Literature", "Historical", "Adventure", "Academic", "School"], "title": "Circles in a Forest", "description": ["The Knysna Forest: a primal world of strange beauty and hidden dangers, of secrets shrouded beneath the canopy of towering trees, where, for centuries, the only sounds were the songs of birds and the trumpeting of the magnificent elephants.... until man arrived to claim for himself the rare wood of the trees, and the rarer ivory of the elephants' tusks."], "author": "Dalene Matthee", "awards": ["ATKV Award for Prose (1984)"], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "2005-08-31 00:00:00", "ISBN": "014318542X"},
{"url": "https://www.goodreads.com/book/show/9905586-one-day-i-will-write-about-this-place", "num_ratings": "1,303", "num_reviews": "207", "avg_ratings": 3.75, "genres": ["Cultural", "Africa", "Nonfiction", "Autobiography", "Memoir", "Eastern Africa", "Kenya", "Biography", "Literature", "African Literature"], "title": "One Day I Will Write About This Place: A Memoir", "description": ["Binyavanga Wainaina tumbled through his middle-class Kenyan childhood out of kilter with the world around him. This world came to him as a chaos of loud and colorful sounds: the hair dryers at his mother's beauty parlor, black mamba bicycle bells, mech", "Binyavanga Wainaina tumbled through his middle-class Kenyan childhood out of kilter with the world around him. This world came to him as a chaos of loud and colorful sounds: the hair dryers at his mother's beauty parlor, black mamba bicycle bells, mechanics in Nairobi, the music of Michael Jackson—all punctuated by the infectious laughter of his brother and sister, Jimmy and Ciru. He could fall in with their patterns, but it would take him a while to carve out his own.", "In this vivid and compelling debut memoir, Wainaina takes us through his school days, his mother's religious period, his failed attempt to study in South Africa as a computer programmer, a moving family reunion in Uganda, and his travels around Kenya. The landscape in front of him always claims his main attention, but he also evokes the shifting political scene that unsettles his views on family, tribe, and nationhood.", "Throughout, reading is his refuge and his solace. And when, in 2002, a writing prize comes through, the door is opened for him to pursue the career that perhaps had been beckoning all along. A series of fascinating international reporting assignments follow. Finally he circles back to a Kenya in the throes of postelection violence and finds he is not the only one questioning the old certainties.", "Resolutely avoiding stereotype and cliché, Wainaina paints every scene in ", "with a highly distinctive and hugely memorable brush."], "author": "Binyavanga Wainaina", "num_pages": "272", "awards": ["Sister Mariella Gable Prize (2011)", "Hurston/Wright Legacy Award Nominee for Nonfiction (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-07-19 00:00:00", "ISBN": "1555975917"},
{"url": "https://www.goodreads.com/book/show/6265288-i-do-not-come-to-you-by-chance", "num_ratings": "1,682", "num_reviews": "257", "avg_ratings": 3.8, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Nigeria", "Contemporary", "Literature", "African Literature"], "title": "I Do Not Come to You by Chance", "description": [" ", "Being the ", " of the family, Kingsley Ibe is entitled to certain privileges--a piece of meat in his ", " soup, a party to celebrate his graduation from university. As first son, he has responsibili", " ", "Being the ", " of the family, Kingsley Ibe is entitled to certain privileges--a piece of meat in his ", " soup, a party to celebrate his graduation from university. As first son, he has responsibilities, too. But times are bad in Nigeria, and life is hard. Unable to find work, Kingsley cannot take on the duty of training his younger siblings, nor can he provide his parents with financial peace in their retirement. And then there is Ola. Dear, sweet Ola, the sugar in Kingsley's tea. It does not seem to matter that he loves her deeply; he cannot afford her bride price. ", "It hasn't always been like this. For much of his young life, Kingsley believed that education was everything, that through wisdom, all things were possible. Now he worries that without a \"long-leg\"--someone who knows someone who can help him--his degrees will do nothing but adorn the walls of his parents' low-rent house. And when a tragedy befalls his family, Kingsley learns the hardest lesson of all: education may be the language of success in Nigeria, but it's money that does the talking. ", "Unconditional family support may be the way in Nigeria, but when Kingsley turns to his Uncle Boniface for help, he learns that charity may come with strings attached. Boniface--aka Cash Daddy--is an exuberant character who suffers from elephantiasis of the pocket. He's also rumored to run a successful empire of email scams. But he can help. With Cash Daddy's intervention, Kingsley and his family can be as safe as a tortoise in its shell. It's up to Kingsley now to reconcile his passion for knowledge with his hunger for money, and to fully assume his role of first son. But can he do it without being drawn into this outlandish mileu?"], "author": "Adaobi Tricia Nwaubani", "num_pages": "402", "awards": ["Wole Soyinka Prize for Literature in Africa  (2010)", "Commonwealth Writers' Prize for Best First Book in Africa (2010)", "Nigeria Prize Nominee for Literature (2012)", "Betty Trask Award (2010)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2009-05-05 00:00:00", "ISBN": "1401323111"},
{"url": "https://www.goodreads.com/book/show/1608417.Coconut", "num_ratings": "736", "num_reviews": "87", "avg_ratings": 3.57, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "South Africa", "Literature", "African Literature", "Contemporary", "Young Adult"], "title": "Coconut", "description": ["Debut novel about growing up black in white suburbs, where the cost of fitting in can be your very identity. Redefining what it means to be young, black and beautiful in the the New South Africa. Winner of the European Union Literary Award. "], "author": "Kopano Matlwa", "num_pages": "190", "awards": ["Wole Soyinka Prize for Literature in Africa  (2010)"], "places": [], "character_names": [], "language": null, "publish_date": "2007-08-16 00:00:00", "ISBN": "7817700933"},
{"url": "https://www.goodreads.com/book/show/8526694-open-city", "num_ratings": "11,798", "num_reviews": "1,568", "avg_ratings": 3.51, "genres": ["Fiction", "Cultural", "Africa", "Novels", "New York", "Contemporary", "Western Africa", "Nigeria"], "title": "Open City", "description": ["Along the streets of Manhattan, a young Nigerian doctor doing his residency wanders aimlessly. The walks meet a need for Julius: they are a release from the tightly regulated mental environment of work, and they give him the opportunity to process his relationships, his recent breakup with his girlfriend, his present, his past.", "But it is not only a physical landscape he cov", "Along the streets of Manhattan, a young Nigerian doctor doing his residency wanders aimlessly. The walks meet a need for Julius: they are a release from the tightly regulated mental environment of work, and they give him the opportunity to process his relationships, his recent breakup with his girlfriend, his present, his past.", "But it is not only a physical landscape he covers; Julius crisscrosses social territory as well, encountering people from different cultures and classes who will provide insight on his journey—which takes him to Brussels, to the Nigeria of his youth, and into the most unrecognizable facets of his own soul."], "author": "Teju Cole", "num_pages": "259", "awards": ["New York Public Library Young Lions Fiction Award Nominee (2012)", "PEN/Hemingway Foundation Award (2012)", "Internationaler Literaturpreis – Haus der Kulturen der Welt (2013)", "New York City Book Award for Fiction (2011)", "Rosenthal Family Foundation Award (2012)", "National Book Critics Circle Award Nominee for Fiction (2011)", "The Royal Society of Literature Ondaatje Prize Nominee (2012)"], "places": ["New York City, New York", "Manhattan, New York City, New York", "Upper West Side, Manhattan, New York"], "character_names": [], "language": "English", "publish_date": "2011-02-08 00:00:00", "ISBN": "1400068096"},
{"url": "https://www.goodreads.com/book/show/4298745-the-burning-of-rags", "num_ratings": "15", "num_reviews": "0", "avg_ratings": 4.07, "genres": ["Literature", "Plays", "Theatre", "Plays"], "title": "The Burning of Rags", "author": "Francis Imbuga", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "9966467815"},
{"url": "https://www.goodreads.com/book/show/8483883-de-pest", "num_ratings": "122,888", "num_reviews": "4,036", "avg_ratings": 3.98, "genres": ["Fiction", "Classics", "Philosophy", "Cultural", "France", "Literature"], "title": "De pest", "description": ["De kuststad Oran is in de greep van de pest. De slachtoffers sterven een snelle en vreselijke dood, en als gevolg van de quarantaine worden de andere inwoners geplaagd door gevoelens van angst en claustrofobie. Elke persoon reageert verschillend op de dodelijke ziekte: sommigen leggen zich neer bij hun lot, anderen zoeken schuld en wraak. En een paar, onder wie de antiheld", "De kuststad Oran is in de greep van de pest. De slachtoffers sterven een snelle en vreselijke dood, en als gevolg van de quarantaine worden de andere inwoners geplaagd door gevoelens van angst en claustrofobie. Elke persoon reageert verschillend op de dodelijke ziekte: sommigen leggen zich neer bij hun lot, anderen zoeken schuld en wraak. En een paar, onder wie de antiheld dokter Rieux, proberen kost wat kost de terreur te weerstaan."], "author": "Albert Camus", "num_pages": "320", "awards": ["Prix des Critiques (1947)"], "places": ["Oran"], "character_names": ["Raoul", "Dr Bernard Rieux", "Father Paneloux (Jesuit Priest)", "Joseph Grand", "Raymond Rambert", "Jean Tarrou", "Cottard", "M. Othon", "Garcia", "Gonzales", "Dr. Castel", "Dr. Richard", "Jacques Othon", "The Prefect", "Mme. Rieux", "Asthma Patient", "Marcel"], "language": "Dutch", "publish_date": "2010-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/95826.Ways_of_Dying", "num_ratings": "1,301", "num_reviews": "109", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Literature", "African Literature", "Novels"], "title": "Ways of Dying", "description": ["In ", ", Zakes Mda's acclaimed first novel, Toloki is a \"professional mourner\" in a vast and violent city of the new South Africa. Day after day he attends funerals in the townships, dressed with dignity in a threadbare suit, cape, and battered top hat, to comfort the grieving families of the victims of the city's crime, racial hatred, and crippling poverty. At a", "In ", ", Zakes Mda's acclaimed first novel, Toloki is a \"professional mourner\" in a vast and violent city of the new South Africa. Day after day he attends funerals in the townships, dressed with dignity in a threadbare suit, cape, and battered top hat, to comfort the grieving families of the victims of the city's crime, racial hatred, and crippling poverty. At a Christmas day funeral for a young boy Toloki is reunited with Noria, a woman from his village. Together they help each other to heal the past, and as their story interweaves with those of their acquaintances this elegant short novel provides a magical and painful picture of South Africa today."], "author": "Zakes Mda", "num_pages": "216", "awards": ["M-Net Literary Award (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-08-01 00:00:00", "ISBN": "0312420919"},
{"url": "https://www.goodreads.com/book/show/6885465-say-you-re-one-of-them", "num_ratings": "13,295", "num_reviews": "2,280", "avg_ratings": 3.51, "genres": ["Fiction", "Cultural", "Africa", "Short Stories", "Historical", "Historical Fiction", "Abandoned", "War", "Western Africa", "Nigeria", "Adult", "Literature", "African Literature", "Eastern Africa", "Rwanda"], "title": "Say You're One of Them", "description": ["Each story in this jubilantly acclaimed collection pays testament to the wisdom and resilience of children, even in the face of the most agonizing circumstances.", "A family living in a makeshift shanty in urban Kenya scurries to find gifts of any kind for the impending Christmas holiday. A Rwandan girl relates her family's struggles to maintain a facade of normalcy amid unspe", "Each story in this jubilantly acclaimed collection pays testament to the wisdom and resilience of children, even in the face of the most agonizing circumstances.", "A family living in a makeshift shanty in urban Kenya scurries to find gifts of any kind for the impending Christmas holiday. A Rwandan girl relates her family's struggles to maintain a facade of normalcy amid unspeakable acts. A young brother and sister cope with their uncle's attempt to sell them into slavery. Aboard a bus filled with refugees—a microcosm of today's Africa—a Muslim boy summons his faith to bear a treacherous ride across Nigeria. Through the eyes of childhood friends the emotional toll of religious conflict in Ethiopia becomes viscerally clear.", "Uwem Akpan's debut signals the arrival of a breathtakingly talented writer who gives a matter-of-fact reality to the most extreme circumstances in stories that are nothing short of transcendent."], "author": "Uwem Akpan", "num_pages": "384", "awards": ["Guardian First Book Award Nominee for Longlist (2008)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2009)", "PEN Open Book Award (2009)", "Paris Book Festival for Compilation/Anthology (2010)", "Hurston/Wright Legacy Award for Fiction (2009)", "Commonwealth Writers' Prize for Best First Book in Africa (2009)"], "places": ["Benin", "Kenya", "Ethiopia", "Rwanda", "Nigeria", "Africa"], "character_names": [], "language": "English", "publish_date": "2009-09-18 00:00:00", "ISBN": "0316086371"},
{"url": "https://www.goodreads.com/book/show/219867.Maru", "num_ratings": "881", "num_reviews": "77", "avg_ratings": 3.8, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "Botswana", "Literature", "African Literature", "Southern Africa", "South Africa"], "title": "Maru", "description": ["An orphaned Masarwa girl comes to Dilepe to teach, only to discover that in this remote Botswana village her people are treated as outcasts. In the love story and intrigue that follow, the author's exploration of racism draws upon her own experiences of growing up in South Africa."], "author": "Bessie Head", "num_pages": "127", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-23 00:00:00", "ISBN": "0435909630"},
{"url": "https://www.goodreads.com/book/show/328504.Maps", "num_ratings": "670", "num_reviews": "68", "avg_ratings": 3.76, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Somalia", "Literature", "African Literature", "Historical", "Historical Fiction", "Literature"], "title": "Maps", "description": ["This first novel in Nuruddin Farah's Blood in the Sun trilogy tells the story of Askar, a man coming of age in the turmoil of modern Africa. With his father a victim of the bloody Ethiopian civil war and his mother dying the day of his birth, Askar is taken in and raised by a man named Misra amid the scandal, gossip, and ritual of a small African village. As an adolescent,", "This first novel in Nuruddin Farah's Blood in the Sun trilogy tells the story of Askar, a man coming of age in the turmoil of modern Africa. With his father a victim of the bloody Ethiopian civil war and his mother dying the day of his birth, Askar is taken in and raised by a man named Misra amid the scandal, gossip, and ritual of a small African village. As an adolescent, Askar goes to live in Somalia's capital, where he strives to find himself just as Somalia struggles for national identity."], "author": "Nuruddin Farah", "num_pages": "259", "awards": [], "places": ["Somalia"], "character_names": [], "language": "English", "publish_date": "2000-11-01 00:00:00", "ISBN": "0140296433"},
{"url": "https://www.goodreads.com/book/show/748164.Sleepwalking_Land", "num_ratings": "2,031", "num_reviews": "155", "avg_ratings": 4.06, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Mozambique", "Magical Realism", "Literature", "African Literature", "Literature", "European Literature", "Portuguese Literature", "Romance", "Novels", "Literary Fiction"], "title": "Sleepwalking Land", "description": ["As the civil war rages in 1980s Mozambique, an old man and a young boy, refugees from the war, seek shelter in a burnt-out bus. Among the effects of a dead passenger, they come across a set of notebooks that tell of his life. As the boy reads the story to his elderly companion, this story and their own develop in tandem. Written in 1992, Mia Couto’s first novel is a powerf", "As the civil war rages in 1980s Mozambique, an old man and a young boy, refugees from the war, seek shelter in a burnt-out bus. Among the effects of a dead passenger, they come across a set of notebooks that tell of his life. As the boy reads the story to his elderly companion, this story and their own develop in tandem. Written in 1992, Mia Couto’s first novel is a powerful indictment of the suffering war brings."], "author": "Mia Couto", "num_pages": "256", "awards": ["Camões Prize (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-21 00:00:00", "ISBN": "185242897X"},
{"url": "https://www.goodreads.com/book/show/371397.A_Question_of_Power", "num_ratings": "661", "num_reviews": "76", "avg_ratings": 3.76, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "Botswana"], "title": "A Question of Power", "description": ["\"Your mother was insane. If you're not careful you'll get insane just like your mother. Your mother was a white woman. They had to lock her up, as she was having a child by the stable boy who was a native.\" It is never clear to Elizabeth whether the mission school principal's cruel revelation of her origins is at the bottom of her mental breakdown. She has left South Afric", "\"Your mother was insane. If you're not careful you'll get insane just like your mother. Your mother was a white woman. They had to lock her up, as she was having a child by the stable boy who was a native.\" It is never clear to Elizabeth whether the mission school principal's cruel revelation of her origins is at the bottom of her mental breakdown. She has left South Africa with her son and is living in the village of Motabeng, the place of sand, in Botswana where there are no street lights at night. In the darkness of this country where people turn and look at her with vague curiosity as an outsider she establishes an entirely abnormal relationship with two men. A mind-bending book which takes the reader in and out of sanity."], "author": "Bessie Head", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-11 00:00:00", "ISBN": "0435907204"},
{"url": "https://www.goodreads.com/book/show/865365.Second_Class_Citizen", "num_ratings": "1,098", "num_reviews": "103", "avg_ratings": 3.87, "genres": ["Fiction", "Cultural", "Africa", "Feminism", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "Second Class Citizen", "description": ["A poignant story of a resourceful Nigerian woman who overcomes strict tribal domination of women and countless setbacks to achieve an independent life for herself and her children."], "author": "Buchi Emecheta", "num_pages": "174", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1983-02-17 00:00:00", "ISBN": "0807610666"},
{"url": "https://www.goodreads.com/book/show/1274972.The_Old_Man_and_the_Medal", "num_ratings": "205", "num_reviews": "16", "avg_ratings": 3.55, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Central Africa", "Cameroon", "Literature"], "title": "The Old Man and the Medal", "description": ["Takes a satirical look at colonialism and the situations it promotes. By the author of Houseboy."], "author": "Ferdinand Oyono", "num_pages": "167", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1969-01-01 00:00:00", "ISBN": "0435900390"},
{"url": "https://www.goodreads.com/book/show/6088236-baking-cakes-in-kigali", "num_ratings": "5,085", "num_reviews": "967", "avg_ratings": 3.67, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Rwanda", "Food and Drink", "Food"], "title": "Baking Cakes in Kigali", "description": ["Once in a great while a debut novelist comes along who dazzles us with rare eloquence and humanity, who takes us to bold new places and into previously unimaginable lives. Gaile Parkin is just such a talent—and ", "is just such a novel. This gloriously written tale—set in modern-day Rwanda—introduces one of the most singular and engaging characters in re", "Once in a great while a debut novelist comes along who dazzles us with rare eloquence and humanity, who takes us to bold new places and into previously unimaginable lives. Gaile Parkin is just such a talent—and ", "is just such a novel. This gloriously written tale—set in modern-day Rwanda—introduces one of the most singular and engaging characters in recent fiction: Angel Tungaraza—mother, cake baker, keeper of secrets—a woman living on the edge of chaos, finding ways to transform lives, weave magic, and create hope amid the madness swirling all around her.", "In Kigali, Angel runs a bustling business: baking cakes for all occasions—cakes filled with vibrant color, buttery richness, and, most of all, a sense of hope only Angel can deliver.…A CIA agent’s wife seeks the perfect holiday cake but walks away with something far sweeter…a former boy-soldier orders an engagement cake, then, between sips of tea, shares an enthralling story…weary human rights workers…lovesick limo drivers. Amid this cacophony of native tongues, love affairs, and confessions, Angel’s kitchen is an oasis where people tell their secrets, where hope abounds and help awaits.", "In this unlikely place, in the heart of Rwanda, unexpected things are beginning to happen: A most unusual wedding is planned…a heartbreaking mystery—involving Angel’s own family—unravels…and extraordinary connections are being made among the men and women who have tasted Angel’s beautiful cakes…as a chain of events unfolds that will change Angel’s life—and the lives of those around her—in the most astonishing ways."], "author": "Gaile Parkin", "num_pages": "361", "awards": [], "places": ["Kigali", "Rwanda"], "character_names": ["Angel Tungaraza"], "language": "English", "publish_date": "2009-08-18 00:00:00", "ISBN": "0385343434"},
{"url": "https://www.goodreads.com/book/show/2568.The_Interpreters", "num_ratings": "359", "num_reviews": "36", "avg_ratings": 3.56, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Nigeria", "Novels", "Literature", "African Literature", "Nobel Prize", "Literature"], "title": "The Interpreters", "description": ["The Nobel Laureate's first novel spotlights a small circle of young Nigerian intellectuals living in Lagos."], "author": "Wole Soyinka", "num_pages": "251", "awards": ["Jock Campbell-New Statesman Award (1968)"], "places": ["Lagos"], "character_names": [], "language": "English", "publish_date": "1996-08-16 00:00:00", "ISBN": "0233989781"},
{"url": "https://www.goodreads.com/book/show/141473.A_Sunday_at_the_Pool_in_Kigali", "num_ratings": "2,592", "num_reviews": "320", "avg_ratings": 3.93, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Eastern Africa", "Rwanda", "Cultural", "Canada", "War"], "title": "A Sunday at the Pool in Kigali", "description": [" is a moving, passionate love story set amid the turmoil and terror of Rwanda’s genocide.", "All manner of Kigali residents pass their time by the pool of the Mille-Collines hotel: aid workers, Rwandan bourgeoisie, expatriates, UN peacekeepers, prostitutes. Keeping a watchful eye is Bernard Valcourt, a jaded foreign journalist, but his closest at", " is a moving, passionate love story set amid the turmoil and terror of Rwanda’s genocide.", "All manner of Kigali residents pass their time by the pool of the Mille-Collines hotel: aid workers, Rwandan bourgeoisie, expatriates, UN peacekeepers, prostitutes. Keeping a watchful eye is Bernard Valcourt, a jaded foreign journalist, but his closest attention is devoted to Gentille, a hotel waitress with the slender, elegant build of a Tutsi. As they slip into an intense, improbable affair, the delicately balanced world around them–already devastated by AIDS–erupts in a Hutu-led genocide against the Tutsi people. Valcourt’s efforts to spirit Gentille to safety end in their separation. It will be months before he learns of his lover’s shocking fate."], "author": "Gil Courtemanche", "num_pages": "272", "awards": ["Prix des libraires du Québec for Lauréats québécois (2001)", "Rogers Writers' Trust Fiction Prize Nominee (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-10-12 00:00:00", "ISBN": "1400034345"},
{"url": "https://www.goodreads.com/book/show/2340.Whitethorn", "num_ratings": "2,312", "num_reviews": "148", "avg_ratings": 4.05, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Historical", "Historical Fiction"], "title": "Whitethorn", "description": ["From Bryce Courtenay comes a new novel about Africa. The time is 1939. White South Africa is a deeply divided nation with many of the Afrikaner people fanatically opposed to the English.", "The world is also on the brink of war and South Africa elects to fight for the Allied cause against Germany. Six-year-old Tom Fitzsaxby finds himself in The Boys Farm, an orphanage in a rem", "From Bryce Courtenay comes a new novel about Africa. The time is 1939. White South Africa is a deeply divided nation with many of the Afrikaner people fanatically opposed to the English.", "The world is also on the brink of war and South Africa elects to fight for the Allied cause against Germany. Six-year-old Tom Fitzsaxby finds himself in The Boys Farm, an orphanage in a remote town in the high mountains, where the Afrikaners side fiercely with Hitler's Germany. ", "Tom's English name proves sufficient for him to be ostracised, marking him as an outsider. And so begin some of life's tougher lessons for the small, lonely boy. Like the Whitethorn, one of Africa's most enduring plants, Tom learns how to survive in the harsh climate of racial hatred. Then a terrible event sends him on a journey to ensure that justice is done. On the way, his most unexpected discovery is love.", " Whitethorn "], "author": "Bryce Courtenay", "num_pages": "683", "awards": [], "places": ["South Africa"], "character_names": ["Tom Fitzaxby"], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "067002922X"},
{"url": "https://www.goodreads.com/book/show/25792596-nobody-s-children", "num_ratings": "14", "num_reviews": "6", "avg_ratings": 4.0, "genres": ["Cultural", "Africa", "Nonfiction"], "title": "Nobody´s Children", "description": ["An exciting story from the popular author of novels set in an African environment.", "Five children, but only one destiny. They have nobody, and Kenyan street-life is hard. Danger. Darkness. Drugs. Hunger. But there is still hope.", "When David, John and Susanne are orphaned, they end up in the hands of their cruel uncle. The boys decide to run away, promising to return for their", "An exciting story from the popular author of novels set in an African environment.", "Five children, but only one destiny. They have nobody, and Kenyan street-life is hard. Danger. Darkness. Drugs. Hunger. But there is still hope.", "When David, John and Susanne are orphaned, they end up in the hands of their cruel uncle. The boys decide to run away, promising to return for their little sister. Unfortunately they have no idea what is about to happen to her. And their own wishes for a better life in Nairobi dissolve into thin air, as they find themselves pressured into becoming members of a gang of street children. But hope springs eternal...", "Hana Hindráková creates characters that are not only memorable, but unforgettable. This author’s ability to give birth in print to living, breathing souls is exceptional. Nobody´s Children is a real page-turner.", "The novel is based on the author’s thorough knowledge of various typical Kenyan environments. The reader gets to know, in a highly readable and exciting way, the reality of the various layers of current Kenyan society. It’s one of the few books that truly (albeit with authorial licence) explores the complexity of Kenyan society."], "author": "Hana Hindráková", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/159334.Devil_on_the_Cross", "num_ratings": "1,016", "num_reviews": "86", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Novels", "Eastern Africa", "Kenya", "Literature"], "title": "Devil on the Cross", "description": ["This remarkable and symbolic novel centers on Wariinga's tragedy and uses it to tell a story of contemporary Kenya."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-10-23 00:00:00", "ISBN": "0435908448"},
{"url": "https://www.goodreads.com/book/show/7036.The_Kalahari_Typing_School_for_Men", "num_ratings": "32,142", "num_reviews": "1,376", "avg_ratings": 4.0, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime", "Southern Africa", "Botswana"], "title": "The Kalahari Typing School for Men", "description": ["Life is never without its problems. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Find out in this, the fourth volume in the No.1 Ladies Detective Agency series featuring Botswana's first and only lady detective.", "Now that The No. 1 Ladies’ Detective Agency (the only detective agency for ladies and others in Botswana) is established", "Life is never without its problems. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Find out in this, the fourth volume in the No.1 Ladies Detective Agency series featuring Botswana's first and only lady detective.", "Now that The No. 1 Ladies’ Detective Agency (the only detective agency for ladies and others in Botswana) is established, its founder, Precious Ramotswe, can look upon her life with pride: she’s reached her late thirties (\"the finest age to be\"), has a house, two children, a good fiancé -- Mr. J. L. B. Matekoni -- and many satisfied customers. But life is never without its problems. It turns out that her adopted son is responsible for the dead hoopoe bird in the garden; her assistant, Mma Makutsi, wants a husband and needs help with her idea to open the Kalahari Typing School for Men; yet Mma Ramotswe’s sexist rival has no trouble opening his Satisfaction Guaranteed Detective Agency across town. Will Precious Ramotswe’s delightfully cunning and profoundly moral methods save the day? Follow the continuing story of Botswana’s first lady detective in the irresistible The Kalahari Typing School for Men."], "author": "Alexander McCall Smith", "num_pages": "210", "awards": [], "places": ["Botswana"], "character_names": ["Precious Ramotswe", "Puso", "Silvia Potokwani", "Charlie the older apprentice", "Note Mokoti", "Mr. J.L.B. Matekoni", "Motholeli", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe", "Cephas Buthelezi", "Mr. Molefelo", "Tebogoå Bathopi", "Bernard Selelipeng", "Mma Selelipeng"], "language": "English", "publish_date": "2004-02-26 00:00:00", "ISBN": "0349117047"},
{"url": "https://www.goodreads.com/book/show/10374279-the-hairdresser-of-harare", "num_ratings": "1,318", "num_reviews": "227", "avg_ratings": 3.59, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "The Hairdresser of Harare", "description": ["Like very good dark chocolate this is a delicious novel, with a bitter-sweet flavour. Vimbai is a hairdresser, the best in Mrs Khumalo's salon, and she knows she is the queen on whom they all depend. Her situation is reversed when the good-looking, smooth-talking Dumisani joins them. However, his charm and desire to please slowly erode Vimbai's rancour and when he needs so", "Like very good dark chocolate this is a delicious novel, with a bitter-sweet flavour. Vimbai is a hairdresser, the best in Mrs Khumalo's salon, and she knows she is the queen on whom they all depend. Her situation is reversed when the good-looking, smooth-talking Dumisani joins them. However, his charm and desire to please slowly erode Vimbai's rancour and when he needs somewhere to live, Vimbai becomes his landlady. So, when Dumisani needs someone to accompany him to his brother's wedding to help smooth over a family upset, Vimbai obliges. Startled to find that this smart hairdresser is the scion of one of the wealthiest families in Harare, she is equally surprised by the warmth of their welcome; and it is their subsequent generosity which appears to foster the relationship between the two young people. The ambiguity of this deepening friendship - used or embraced by Dumisani and Vimbai with different futures in mind - collapses in unexpected brutality when secrets and jealousies are exposed. Written with delightful humour and a penetrating eye, The Hairdresser of Harare is a novel that you will find hard to put down."], "author": "Tendai Huchu", "num_pages": "190", "awards": [], "places": ["Harare"], "character_names": [], "language": "English", "publish_date": "2010-10-01 00:00:00", "ISBN": "1779221096"},
{"url": "https://www.goodreads.com/book/show/7035.Morality_for_Beautiful_Girls", "num_ratings": "34,301", "num_reviews": "1,647", "avg_ratings": 3.97, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime", "Southern Africa", "Botswana"], "title": "Morality for Beautiful Girls", "description": ["Botswana PI Precious Ramotswe investigates the alleged poisoning of the brother of an important government official, and the moral character of four beauty contestants. When her business has money trouble, and problems arise at at her reliable fiance Mr J.L.B. Matekoni's Speedy Motors, she finds he is more complicated then he seems."], "author": "Alexander McCall Smith", "num_pages": "227", "awards": [], "places": ["Gaborone"], "character_names": ["Precious Ramotswe", "Puso", "Silvia Potokwani", "Charlie the older apprentice", "Note Mokoti", "Mr. J.L.B. Matekoni", "Motholeli", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe"], "language": "English", "publish_date": "2002-11-12 00:00:00", "ISBN": "1400031362"},
{"url": "https://www.goodreads.com/book/show/6544214-beneath-the-lion-s-gaze", "num_ratings": "1,897", "num_reviews": "310", "avg_ratings": 3.87, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Ethiopia", "Historical", "Historical Fiction", "War", "Literature", "African Literature", "Novels"], "title": "Beneath the Lion's Gaze", "description": [" ", "This memorable, heartbreaking story opens in Addis Ababa, Ethiopia, 1974, on the eve of a revolution. Yonas kneels in his mother’s prayer room, pleading to his god for an end to the violence that has wracked his family and country. His father, Hai", " ", "This memorable, heartbreaking story opens in Addis Ababa, Ethiopia, 1974, on the eve of a revolution. Yonas kneels in his mother’s prayer room, pleading to his god for an end to the violence that has wracked his family and country. His father, Hailu, a prominent doctor, has been ordered to report to jail after helping a victim of state-sanctioned torture to die. And Dawit, Hailu’s youngest son, has joined an underground resistance movement—a choice that will lead to more upheaval and bloodshed across a ravaged Ethiopia. ", " tells a gripping story of family, of the bonds of love and friendship set in a time and place that has rarely been explored in fiction. It is a story about the lengths human beings will go in pursuit of freedom and the human price of a national revolution. Emotionally gripping, poetic, and indelibly tragic, ", " is a transcendent and powerful debut. ."], "author": "Maaza Mengiste", "num_pages": "308", "awards": ["Dayton Literary Peace Prize for Fiction (Runner-up) (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-11 00:00:00", "ISBN": "0393071766"},
{"url": "https://www.goodreads.com/book/show/231851.The_Beautiful_Things_That_Heaven_Bears", "num_ratings": "6,117", "num_reviews": "987", "avg_ratings": 3.65, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Ethiopia", "Contemporary", "Literary Fiction", "Novels"], "title": "The Beautiful Things That Heaven Bears", "description": ["A haunting and powerful first novel that views the streets of Washington, D.C. and Addis Ababa through the eyes of Sepha who, seventeen years ago, fled Ethiopia during the Revolution, and now runs a failing convenience store in a poor African-American neighborhood in Washington. Published as The Beautiful Thing That Heaven Bears in the USA, Canada and Australia; and as Chi", "A haunting and powerful first novel that views the streets of Washington, D.C. and Addis Ababa through the eyes of Sepha who, seventeen years ago, fled Ethiopia during the Revolution, and now runs a failing convenience store in a poor African-American neighborhood in Washington. Published as The Beautiful Thing That Heaven Bears in the USA, Canada and Australia; and as Children of the Revolution in the UK.", "Seventeen years ago, Sepha Stephanos fled the Ethiopian Revolution after witnessing soldiers beat his father to the point of certain death, selling off his parents' jewelry to pay for passage to the United States. Now he finds himself running a grocery store in a poor African-American neighborhood in Washington, D.C. His only companions are two fellow African immigrants who share his feelings of frustration with and bitter nostalgia for their home continent. He realizes that his life has turned out completely different and far more isolated from the one he had imagined for himself years ago. ", "Soon Sepha's neighborhood begins to change. Hope comes in the form of new neighbors-Judith and Naomi, a white woman and her biracial daughter-who become his friends and remind him of what having a family is like for the first time in years. But when the neighborhood's newfound calm is disturbed by a series of racial incidents, Sepha may lose everything all over again. ", "Told in a haunting and powerful first-person narration that casts the streets of Washington, D.C., and Addis Ababa through Sepha's eyes, The Beautiful Things That Heaven Bears is a deeply affecting and unforgettable debut novel about what it means to lose a family and a country-and what it takes to create a new home. ", "Published as The Beautiful Thing That Heaven Bears in the USA, Canada and Australia; and as Children of the Revolution in the UK. Winner of the Guardian (UK) 2007 book award."], "author": "Dinaw Mengestu", "num_pages": "240", "awards": ["New York Public Library Young Lions Fiction Award Nominee (2008)", "Guardian First Book Award (2007)", "Los Angeles Times Book Prize for Art Seidenbaum Award for First Fiction (2007)"], "places": ["Washington, D.C."], "character_names": ["Sepha Stephanos", "Judith Henderson", "Naomi"], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "1594489408"},
{"url": "https://www.goodreads.com/book/show/373967.The_Heart_of_Redness", "num_ratings": "1,125", "num_reviews": "85", "avg_ratings": 3.7, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "South Africa"], "title": "The Heart of Redness", "description": ["In a new novel by one of the premier writers of the ''new'' South Africa, an exile returns from America--where he fled during the apartheid regime--to find his newly democratic country in a shambles."], "author": "Zakes Mda", "num_pages": "277", "awards": ["Hurston/Wright Legacy Award for Fiction (2003)", "Commonwealth Writers' Prize for Best Book in Africa (2001)", "Barry Ronge Fiction Prize (2001)"], "places": ["Johannesburg"], "character_names": [], "language": "English", "publish_date": "2003-08-01 00:00:00", "ISBN": "0312421745"},
{"url": "https://www.goodreads.com/book/show/15811505-ghana-must-go", "num_ratings": "7,568", "num_reviews": "1,004", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Ghana", "Contemporary"], "title": "Ghana Must Go", "description": ["Kweku Sai is dead. A renowned surgeon and failed husband, he succumbs suddenly at dawn outside his home in suburban Accra. The news of Kweku’s death sends a ripple around the world, bringing together the family he abandoned years before. ", " is their story. Electric, exhilarating, beautifully crafted, Ghana Must Go is a testament to the transformative power of un", "Kweku Sai is dead. A renowned surgeon and failed husband, he succumbs suddenly at dawn outside his home in suburban Accra. The news of Kweku’s death sends a ripple around the world, bringing together the family he abandoned years before. ", " is their story. Electric, exhilarating, beautifully crafted, Ghana Must Go is a testament to the transformative power of unconditional love, from a debut novelist of extraordinary talent.  ", "Moving with great elegance through time and place, ", "charts the Sais’ circuitous journey to one another. In the wake of Kweku’s death, his children gather in Ghana at their enigmatic mother’s new home. The eldest son and his wife; the mysterious, beautiful twins; the baby sister, now a young woman: each carries secrets of his own. What is revealed in their coming together is the story of how they came apart: the hearts broken, the lies told, the crimes committed in the name of love. Splintered, alone, each navigates his pain, believing that what has been lost can never be recovered—until, in Ghana, a new way forward, a new family, begins to emerge.", "is at once a portrait of a modern family, and an exploration of the importance of where we come from to who we are. In a sweeping narrative that takes us from Accra to Lagos to London to New York, ", " teaches that the truths we speak can heal the wounds we hide."], "author": "Taiye Selasi", "num_pages": "336", "awards": ["PEN Open Book Award Nominee for Shortlist (2014)"], "places": ["Accra", "Boston, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "1594204497"},
{"url": "https://www.goodreads.com/book/show/371406.Two_Thousand_Seasons", "num_ratings": "305", "num_reviews": "31", "avg_ratings": 4.43, "genres": ["Cultural", "Africa", "Literature", "African Literature", "Historical", "Historical Fiction", "Western Africa", "Ghana", "Fiction"], "title": "Two Thousand Seasons", "description": ["Trans Atlantic and African slave trades are the subject of Armah's Two Thousand Seasons (1973) in which a pluralized communal voice speaks through the history of Africa, its wet and dry seasons, from a period of one thousand years. Arab and European oppressors are portrayed as \"predators,\" \"destroyers,\" and \"zombies\". The novel is written in allegorical tone, and shifts fr", "Trans Atlantic and African slave trades are the subject of Armah's Two Thousand Seasons (1973) in which a pluralized communal voice speaks through the history of Africa, its wet and dry seasons, from a period of one thousand years. Arab and European oppressors are portrayed as \"predators,\" \"destroyers,\" and \"zombies\". The novel is written in allegorical tone, and shifts from autobiographical and realistic details to philosophical pondering, prophesying a new age.", "Set in the era of European slave raiding wars in Africa, known to Europeans as The Enlightenment, the narrative centers on a group of adolescent friends tricked and sold by an African king to European slavers. On the trans-Atlantic voyage, the group organizes a successful shipboard revolt, then returns to the continent to begin the work of their lives — organizing to end the rule of injustice established by European invaders and their African collaborators."], "author": "Ayi Kwei Armah", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1980-06-01 00:00:00", "ISBN": "0435902180"},
{"url": "https://www.goodreads.com/book/show/80213.Anthills_of_the_Savannah", "num_ratings": "3,011", "num_reviews": "158", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Classics", "Novels"], "title": "Anthills of the Savannah", "description": ["Chris, Ikem and Beatrice are like-minded friends working under the military regime of His Excellency, the Sandhurst-educated President of Kangan. In the pressurized atmosphere of oppression and intimidation they are simply trying to live and love - and remain friends. But in a world where each day brings a new betrayal, hope is hard to cling on to. ", "Chris, Ikem and Beatrice are like-minded friends working under the military regime of His Excellency, the Sandhurst-educated President of Kangan. In the pressurized atmosphere of oppression and intimidation they are simply trying to live and love - and remain friends. But in a world where each day brings a new betrayal, hope is hard to cling on to. ", " (1987), Achebe's candid vision of contemporary African politics, is a powerful fusion of angry voices. It continues the journey that Achebe began with his earlier novels, tracing the history of modern Africa through colonialism and beyond, and is a work ultimately filled with hope."], "author": "Chinua Achebe", "num_pages": "240", "awards": ["Man Booker Prize Nominee (1987)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-29 00:00:00", "ISBN": "0141186909"},
{"url": "https://www.goodreads.com/book/show/2320230.Every_Day_is_for_the_Thief", "num_ratings": "4,964", "num_reviews": "663", "avg_ratings": 3.7, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Novels", "Travel", "Literary Fiction", "Contemporary", "Literature", "African Literature", "Literature", "The United States Of America"], "title": "Every Day is for the Thief", "description": ["Visiting Lagos after many years away, Teju Cole's unnamed narrator rediscovers his hometown as both a foreigner and a local. A young writer uncertain of what he wants to say, the man moves through tableaus of life in one of the most dynamic cities in the world: he hears the", "Visiting Lagos after many years away, Teju Cole's unnamed narrator rediscovers his hometown as both a foreigner and a local. A young writer uncertain of what he wants to say, the man moves through tableaus of life in one of the most dynamic cities in the world: he hears the muezzin's call to prayer in the early morning light, and listens to John Coltrane during the late afternoon heat. He witnesses teenagers diligently perpetrating e-mail frauds from internet cafes, longs after a woman reading Michael Ondaatje on a public bus, and visits the impoverished National Museum. Along the way, he reconnects with old school friends and his family, who force him to ask himself profound questions of personal and national history. Over long, wandering days, the narrator compares present-day Lagos to the Lagos of his memory, and in doing so reveals changes that have taken place in himself."], "author": "Teju Cole", "num_pages": "128", "awards": ["PEN Open Book Award Nominee for Shortlist (2015)"], "places": ["Lagos"], "character_names": [], "language": "English", "publish_date": "2007-08-16 00:00:00", "ISBN": "978080515X"},
{"url": "https://www.goodreads.com/book/show/3476509-a-guide-to-the-birds-of-east-africa", "num_ratings": "2,906", "num_reviews": "700", "avg_ratings": 3.79, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Kenya", "Romance", "Animals", "Animals", "Birds"], "title": "A Guide to the Birds of East Africa", "description": ["For the past three years, Mr. Malik has been secretly in love with Rose Mbikwa, a woman who leads the weekly bird walks sponsored by the East African Ornithological Society. Just as Malik is getting up the nerve to invite Rose to the Nairobi Hunt Club Ball (the premier social occasion of the Kenyan calendar), Harry Khan, a nemesis from his school days, arrives in town.", "Khan", "For the past three years, Mr. Malik has been secretly in love with Rose Mbikwa, a woman who leads the weekly bird walks sponsored by the East African Ornithological Society. Just as Malik is getting up the nerve to invite Rose to the Nairobi Hunt Club Ball (the premier social occasion of the Kenyan calendar), Harry Khan, a nemesis from his school days, arrives in town.", "Khan has also become enraptured with Rose and announces his intent to invite her to the Ball. Rather than force Rose to choose between the two men, a clever solution is proposed. Whoever can identify the most species of birds in one week’s time gets the privilege of asking Ms. Mbikwa to the ball."], "author": "Nicholas Drayson", "num_pages": "202", "awards": ["Australian Capital Territory (ACT) Book of the Year (2009)"], "places": ["East Africa", "Nairobi"], "character_names": ["Mr. Malik", "Rose Mbikwa", "Harry Khan"], "language": "English", "publish_date": "2008-09-18 00:00:00", "ISBN": "0547152582"},
{"url": "https://www.goodreads.com/book/show/563722.Measuring_Time", "num_ratings": "531", "num_reviews": "66", "avg_ratings": 3.8, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Nigeria", "Literature", "African Literature", "Novels", "Historical", "Historical Fiction", "Contemporary", "Literature", "War", "Cultural", "International"], "title": "Measuring Time", "description": ["Mamo and LaMamo are twin brothers living in the small Nigerian village of Keti, where their domineering father controls their lives. With high hopes the twins attempt to flee from home, but only LaMamo escapes successfully and is able to live their dream of becoming a soldier who meets beautiful women. Mamo, the sickly, awkward twin, is doomed to remain in the village with", "Mamo and LaMamo are twin brothers living in the small Nigerian village of Keti, where their domineering father controls their lives. With high hopes the twins attempt to flee from home, but only LaMamo escapes successfully and is able to live their dream of becoming a soldier who meets beautiful women. Mamo, the sickly, awkward twin, is doomed to remain in the village with his father. Gradually he comes out of his father's shadow and gains local fame as a historian, and, using Plutarch's Parallel Lives as his model, he embarks on the ambitious project of writing a \"true\" history of his people. But when the rains fail and famine rages, religious zealots incite the people to violence—and LaMamo returns to fight the enemy at home.", "A novel of ardent loyalty, encroaching modernity, political desire, and personal liberation, ", " is a heart-wrenching history of Nigeria, portrayed through the eyes of a single family."], "author": "Helon Habila", "num_pages": "272", "awards": ["Hurston/Wright Legacy Award Nominee for Fiction (2008)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2007-02-19 00:00:00", "ISBN": "0393052516"},
{"url": "https://www.goodreads.com/book/show/2599364-the-river-and-the-source", "num_ratings": "289", "num_reviews": "38", "avg_ratings": 4.12, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Kenya"], "title": "The River and the Source", "description": ["In 1995, this novel won both the Jomo Kenyatta Literature Prize, and the Commonwealth Writers Prize Best First Book in the Africa Region. Now reprinted, it remains in great demand. An epic story spanning cultures, it tells the lives of three generations of women. It traces the story of Akoko in her rich traditional Luo setting, through to the children who live and die in t", "In 1995, this novel won both the Jomo Kenyatta Literature Prize, and the Commonwealth Writers Prize Best First Book in the Africa Region. Now reprinted, it remains in great demand. An epic story spanning cultures, it tells the lives of three generations of women. It traces the story of Akoko in her rich traditional Luo setting, through to the children who live and die in the 20th century."], "author": "Margaret A. Ogola", "num_pages": "292", "awards": ["Commonwealth Writers' Prize for Best First Book in Africa (1995)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-12-29 00:00:00", "ISBN": "9966882057"},
{"url": "https://www.goodreads.com/book/show/765618.Paradise", "num_ratings": "565", "num_reviews": "57", "avg_ratings": 3.57, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Tanzania", "Historical", "Historical Fiction", "Literary Fiction", "Literature", "African Literature"], "title": "Paradise", "description": ["Paradise is at once the story of an African boy's coming of age, a tragic love story, and a tale of the corruption of traditional African patterns by European colonialism. It presents a major African voice to American readers - a voice that prompted Peter Tinniswood to write in the London Times, reviewing Gurnah's previous novel, \"Mr. Gurnah is a very fine writer. I am cer", "Paradise is at once the story of an African boy's coming of age, a tragic love story, and a tale of the corruption of traditional African patterns by European colonialism. It presents a major African voice to American readers - a voice that prompted Peter Tinniswood to write in the London Times, reviewing Gurnah's previous novel, \"Mr. Gurnah is a very fine writer. I am certain he will become a great one.\" Paradise is Abdulrazak Gurnah's great novel. At twelve, Yusuf, the protagonist of this twentieth-century odyssey, is sold by his father in repayment of a debt. From the simple life of rural Africa, Yusuf is thrown into the complexities of precolonial urban East Africa - a fascinating world in which Muslim black Africans, Christian missionaries, and Indians from the subcontinent coexist in a fragile, subtle social hierarchy. Through the eyes of Yusuf, Gurnah depicts communities at war, trading safaris gone awry, and the universal trials of adolescence. Then, just as Yusuf begins to comprehend the choices required of him, he and everyone around him must adjust to the new reality of European colonialism. The result is a page-turning saga that covers the same territory as the novels of Isak Dinesen and William Boyd, but does so from a perspective never before available on that seldom-chronicled part of the world."], "author": "Abdulrazak Gurnah", "num_pages": "256", "awards": ["Man Booker Prize Nominee (1994)"], "places": ["Tanzania, United Republic of"], "character_names": [], "language": "English", "publish_date": "1995-05-01 00:00:00", "ISBN": "1565841638"},
{"url": "https://www.goodreads.com/book/show/6199.In_the_Heart_of_the_Country", "num_ratings": "2,569", "num_reviews": "210", "avg_ratings": 3.68, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa"], "title": "In the Heart of the Country", "description": ["On a remote farm in South Africa, the protagonist of J. M. Coetzee's fierce and passionate novel watches the life from which she has been excluded. Ignored by her callous father, scorned and feared by his servants, she is a bitterly intelligent woman whose outward meekness disguises a desperate resolve not to become \"one of the forgotten ones of history.\" When her father t", "On a remote farm in South Africa, the protagonist of J. M. Coetzee's fierce and passionate novel watches the life from which she has been excluded. Ignored by her callous father, scorned and feared by his servants, she is a bitterly intelligent woman whose outward meekness disguises a desperate resolve not to become \"one of the forgotten ones of history.\" When her father takes an African mistress, that resolve precipitates an act of vengeance that suggests a chemical reaction between the colonizer and the colonized -- and between European yearnings and the vastness and solitude of Africa."], "author": "J.M. Coetzee", "num_pages": "139", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1982-10-28 00:00:00", "ISBN": "0140062289"},
{"url": "https://www.goodreads.com/book/show/28278.When_Rain_Clouds_Gather", "num_ratings": "996", "num_reviews": "83", "avg_ratings": 3.84, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "Botswana", "Literature", "African Literature", "Classics", "Southern Africa", "South Africa"], "title": "When Rain Clouds Gather", "description": ["A poverty-stricken village in the heart of rural Botswana is a haven to the exiles gathered there. When a political refugee from South Africa joins forces with an English agricultural expert, the time-honoured subsistence-farming method and old ways of life are challenged."], "author": "Bessie Head", "num_pages": "185", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-06-05 00:00:00", "ISBN": "0435909614"},
{"url": "https://www.goodreads.com/book/show/15852479-we-need-new-names", "num_ratings": "14,827", "num_reviews": "2,013", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "We Need New Names", "description": ["An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by", "An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by paramilitary policemen, before the school closed, before the fathers left for dangerous jobs abroad.", "But Darling has a chance to escape: she has an aunt in America. She travels to this new land in search of America's famous abundance only to find that her options as an immigrant are perilously few. NoViolet Bulawayo's debut calls to mind the great storytellers of displacement and arrival who have come before her--from Junot Diaz to Zadie Smith to J.M. Coetzee--while she tells a vivid, raw story all her own."], "author": "NoViolet Bulawayo", "num_pages": "298", "awards": ["Man Booker Prize Nominee (2013)", "Guardian First Book Award Nominee (2013)", "PEN/Hemingway Foundation Award (2014)", "Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee (2015)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)", "Betty Trask Award (2014)"], "places": ["Tsholotsho", "Detroit, Michigan", "bulawayo"], "character_names": [], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "0316230812"},
{"url": "https://www.goodreads.com/book/show/130115.The_Grass_is_Singing", "num_ratings": "8,755", "num_reviews": "796", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Africa", "Classics", "Historical", "Historical Fiction", "Southern Africa", "South Africa"], "title": "The Grass is Singing", "description": ["Set in South Africa under white rule, Doris Lessing's first novel is both a riveting chronicle of human disintegration and a beautifully understated social critique. ", "Mary Turner is a self-confident, independent young woman who becomes the depressed, frustrated wife of an ineffectual, unsuccessful farmer. Little by little the ennui of years on the farm work their slow poiso", "Set in South Africa under white rule, Doris Lessing's first novel is both a riveting chronicle of human disintegration and a beautifully understated social critique. ", "Mary Turner is a self-confident, independent young woman who becomes the depressed, frustrated wife of an ineffectual, unsuccessful farmer. Little by little the ennui of years on the farm work their slow poison, and Mary's despair progresses until the fateful arrival of an enigmatic and virile black servant, Moses. Locked in anguish, Mary and Moses -- master and slave -- are trapped in a web of mounting attraction and repulsion. Their psychic tension explodes in an electrifying scene that ends this disturbing tale of racial strife in colonial South Africa.", " blends Lessing's imaginative vision with her own vividly remembered early childhood to recreate the quiet horror of a woman's struggle against a ruthless fate."], "author": "Doris Lessing", "num_pages": "208", "awards": [], "places": [], "character_names": ["Mary Turner", "Dick Turner", "Moses"], "language": "English", "publish_date": "2000-03-06 00:00:00", "ISBN": "0002257556"},
{"url": "https://www.goodreads.com/book/show/27971013-like-a-mule-bringing-ice-cream-to-the-sun", "num_ratings": "597", "num_reviews": "134", "avg_ratings": 3.93, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Contemporary"], "title": "Like a Mule Bringing Ice Cream to the Sun", "description": ["Morayo Da Silva, a cosmopolitan Nigerian woman, lives in hip San Francisco. On the cusp of seventy-five, she is in good health and makes the most of it, enjoying road trips in her vintage Porsche, chatting to strangers, and recollecting characters from her favourite novels. Then she has a fall and her independence crumbles. Without the support of family, she relies on frie", "Morayo Da Silva, a cosmopolitan Nigerian woman, lives in hip San Francisco. On the cusp of seventy-five, she is in good health and makes the most of it, enjoying road trips in her vintage Porsche, chatting to strangers, and recollecting characters from her favourite novels. Then she has a fall and her independence crumbles. Without the support of family, she relies on friends and chance encounters. As Morayo recounts her story, moving seamlessly between past and present, we meet Dawud, a charming Palestinian shopkeeper, Sage, a feisty, homeless Grateful Dead devotee, and Antonio, the poet whom Morayo desired more than her ambassador husband. ", "A subtle story about ageing, friendship and loss, this is also a nuanced study of the erotic yearnings of an older woman.", " “Dr. Morayo Da Silva is one of the most memorable characters you are likely to encounter on the page – intelligent, indomitable, author and survivor of a large life. In dreamlike prose, Manyika dips in and out of her present, her past, in a story that argues always for generosity, for connection, for a vigorous and joyful endurance.\" - Karen Joy Fowler, author of We Are All Completely Beside Ourselves", "“Manyika's story about an elderly Nigerian woman is quiet, sophisticated and it expands the canon of contemporary African literature into welcome new territory.” ", " - Bernardine Evaristo, author of Mr Loverman", "“If aging be a lamp, then Morayo, the protagonist in Like a Mule Bringing Ice Cream to the Sun is a mesmerizing glow. Astute, sensual, funny, and moving.” - NoViolet Bulawayo, author of We Need New Names", " “A wonderfully constructed novel, always surprising and wrong-footing the reader at every turn and challenging one's assumptions about the Other. Like a Mule Bringing Ice Cream to the Sun is a delightful multi-helical reading experience that speaks to our times in insightful and pleasantly understated ways.\" - Brian Chikwava, author of Harare North"], "author": "Sarah Ladipo Manyika", "num_pages": "118", "awards": ["Goldsmiths Prize Nominee (2016)"], "places": ["San Francisco Bay Area, California"], "character_names": [], "language": "English", "publish_date": "2016-04-01 00:00:00", "ISBN": "1911115049"},
{"url": "https://www.goodreads.com/book/show/210722.The_Joys_of_Motherhood", "num_ratings": "3,782", "num_reviews": "282", "avg_ratings": 4.06, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria", "Feminism"], "title": "The Joys of Motherhood", "description": ["Nnu Ego is a woman who gives all her energy, money and everything she has to raising her children - leaving her little time to make friends."], "author": "Buchi Emecheta", "num_pages": "224", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1994-02-04 00:00:00", "ISBN": "043590972X"},
{"url": "https://www.goodreads.com/book/show/21870572-the-kraals-of-ulundi", "num_ratings": "24", "num_reviews": "6", "avg_ratings": 4.5, "genres": ["Historical", "Historical Fiction", "Cultural", "Africa", "Military", "Military History"], "title": "The Kraals of Ulundi: A Novel of the Zulu War", "description": ["1879 - the British army has suffered one of the worst defeats in its history at the hands of the Zulu King Cetshwayo. Now the British seek revenge and a second invasion of Zululand is about to take place. Within the Zulu regiments charged with repelling the assault is Shaba kaNdabuko driven by ambition to share the glory of battle, to bring honour and cattle to his family.", "1879 - the British army has suffered one of the worst defeats in its history at the hands of the Zulu King Cetshwayo. Now the British seek revenge and a second invasion of Zululand is about to take place. Within the Zulu regiments charged with repelling the assault is Shaba kaNdabuko driven by ambition to share the glory of battle, to bring honour and cattle to his family. Meanwhile, new British soldiers are shipped out to replace those lost in the military disasters, and among them is Lieutenant Jahleel Carey, likewise also hoping that adventure will bring him a change of fortune. But there are also always those on the sidelines of conflict, profiteers like renegade trader William McTeague. Three men, three women, will be brought together by one of the Zulu War's strangest episodes, and their destinies will be changed forever.\""], "author": "David Ebsworth", "num_pages": "366", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-04-01 00:00:00", "ISBN": "1781322112"},
{"url": "https://www.goodreads.com/book/show/123773.The_Dark_Child", "num_ratings": "1,291", "num_reviews": "104", "avg_ratings": 3.65, "genres": ["Cultural", "Africa", "Nonfiction", "Cultural", "France", "Autobiography", "Memoir"], "title": "The Dark Child", "author": "Camara Laye", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1954-01-01 00:00:00", "ISBN": "080901548X"},
{"url": "https://www.goodreads.com/book/show/6193.Life_and_Times_of_Michael_K", "num_ratings": "13,514", "num_reviews": "784", "avg_ratings": 3.85, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa"], "title": "Life and Times of Michael K", "description": [" On the way there she dies, leaving him alone in an anarchic world of brutal roving armies. Imprisoned, Michael is unable to bear confinement and escapes, determined to live with dignity. ", "goes to the centre of human experience - the need for an inte", " On the way there she dies, leaving him alone in an anarchic world of brutal roving armies. Imprisoned, Michael is unable to bear confinement and escapes, determined to live with dignity. ", "goes to the centre of human experience - the need for an interior, spiritual life, for some connections to the world in which we live, and for purity of vision."], "author": "J.M. Coetzee", "num_pages": "192", "awards": ["Man Booker Prize (1983)", "Prix Femina for Étranger (1985)", "Βραβείο Λογοτεχνικής Μετάφρασης ΕΚΕΜΕΛ for Αγγλόφωνη Λογοτεχνία (2007)"], "places": ["Capetown", "Prince Albert"], "character_names": ["Michael K"], "language": "English", "publish_date": "2004-09-02 00:00:00", "ISBN": "009947915X"},
{"url": "https://www.goodreads.com/book/show/526927.Burger_s_Daughter", "num_ratings": "1,560", "num_reviews": "140", "avg_ratings": 3.55, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa"], "title": "Burger's Daughter", "description": ["As a depiction of South Africa, this novel is more revealing than a thousand news dispatches as it tells the story of a young woman cast in the role of a young revolutionary, trying to uphold a heritage handed on by martyred parents while carving out a sense of self."], "author": "Nadine Gordimer", "num_pages": "361", "awards": [], "places": ["South Africa", "France"], "character_names": [], "language": "English", "publish_date": "1980-11-20 00:00:00", "ISBN": "0140055932"},
{"url": "https://www.goodreads.com/book/show/7061.The_No_1_Ladies_Detective_Agency", "num_ratings": "203,056", "num_reviews": "10,007", "avg_ratings": 3.76, "genres": ["Mystery", "Fiction", "Cultural", "Africa", "Mystery", "Crime"], "title": "The No. 1 Ladies' Detective Agency", "description": ["Precious Ramotswe has only just set up shop as Botswana's No.1 (and only) lady detective when she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. However, the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "First published in the UK in 1998, and in", "Precious Ramotswe has only just set up shop as Botswana's No.1 (and only) lady detective when she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. However, the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "First published in the UK in 1998, and in the USA in 2001 by Polygon. Republished in 2002 and 2003 by Anchor. ", "This first novel in Alexander McCall Smith's widely acclaimed The No. 1 Ladies Detective Agency series tells the story of the delightfully cunning and enormously engaging Precious Ramotswe, who is drawn to her profession to \"help people with problems in their lives.\" Immediately upon setting up shop in a small storefront in Gaborone, she is hired to track down a missing husband, uncover a con man, and follow a wayward daughter. But the case that tugs at her heart, and lands her in danger, is a missing eleven-year-old boy, who may have been snatched by witchdoctors.", "The No. 1 Ladies' Detective Agency received two Booker Judges' Special Recommendations and was voted one of the International Books of the Year and the Millennium by the Times Literary Supplement."], "author": "Alexander McCall Smith", "num_pages": "235", "awards": ["Martin Beck Award (2004)"], "places": ["Botswana", "Johannesburg", "Mafikeng"], "character_names": ["Precious Ramotswe", "Silvia Potokwani", "Charlie the older apprentice", "Note Mokoti", "Mr. J.L.B. Matekoni", "Violet Sepotho", "Grace Makutsi", "Fanwell the younger apprentice", "Obed Ramotswe"], "language": "English", "publish_date": "2003-02-06 00:00:00", "ISBN": "1400034779"},
{"url": "https://www.goodreads.com/book/show/101094.The_Famished_Road", "num_ratings": "9,613", "num_reviews": "658", "avg_ratings": 3.73, "genres": ["Fiction", "Cultural", "Africa", "Magical Realism", "Fantasy", "Western Africa", "Nigeria", "Novels", "Literature", "African Literature", "Literary Fiction", "Literature", "20th Century", "Classics"], "title": "The Famished Road", "description": ["In the decade since it won the Booker Prize, Ben Okri's ", " has become a classic. Like Salman Rushdie's ", " or Gabriel Garcia Marquez's ", ", it combines brilliant narrative technique with a fresh vision to create an essential work of world literature.", "The narrator, Azaro, is an ", ", a spirit child, who in the Yoruba trad", "In the decade since it won the Booker Prize, Ben Okri's ", " has become a classic. Like Salman Rushdie's ", " or Gabriel Garcia Marquez's ", ", it combines brilliant narrative technique with a fresh vision to create an essential work of world literature.", "The narrator, Azaro, is an ", ", a spirit child, who in the Yoruba tradition of Nigeria exists between life and death. The life he foresees for himself and the tale he tells is full of sadness and tragedy, but inexplicably he is born with a smile on his face. Nearly called back to the land of the dead, he is resurrected. But in their efforts to save their child, Azaro's loving parents are made destitute. The tension between the land of the living, with its violence and political struggles, and the temptations of the carefree kingdom of the spirits propels this latter-day Lazarus's story."], "author": "Ben Okri", "num_pages": "512", "awards": ["Man Booker Prize (1991)", "Premio Grinzane Cavour Nominee for Narrativa Straniera (1994)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1993-06-01 00:00:00", "ISBN": "0385425139"},
{"url": "https://www.goodreads.com/book/show/5488.The_Cairo_Trilogy", "num_ratings": "3,258", "num_reviews": "247", "avg_ratings": 4.46, "genres": ["Fiction", "Northern Africa", "Egypt", "Historical", "Historical Fiction", "Classics", "Cultural", "Africa", "Literature"], "title": "The Cairo Trilogy: Palace Walk / Palace of Desire / Sugar Street", "description": ["Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patri", "Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patriarch Al-Sayyid Ahmad Abd al-Jawad, who rules his household with a strict hand while living a secret life of self-indulgence. ", " introduces us to his gentle, oppressed wife, Amina, his cloistered daughters, Aisha and Khadija, and his three sons–the tragic and idealistic Fahmy, the dissolute hedonist Yasin, and the soul-searching intellectual Kamal. Al-Sayyid Ahmad’s rebellious children struggle to move beyond his domination in ", ", as the world around them opens to the currents of modernity and political and domestic turmoil brought by the 1920s. ", " brings Mahfouz’s vivid tapestry of an evolving Egypt to a dramatic climax as the aging patriarch sees one grandson become a Communist, one a Muslim fundamentalist, and one the lover of a powerful politician.", "Throughout the trilogy, the family's trials mirror those of their turbulent country during the years spanning the two World Wars, as change comes to a society that has resisted it for centuries. Filled with compelling drama, earthy humor, and remarkable insight, ", " is the achievement of a master storyteller."], "author": "Naguib Mahfouz", "num_pages": "1313", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "2001-10-16 00:00:00", "ISBN": "0375413316"},
{"url": "https://www.goodreads.com/book/show/7784648-the-memory-of-love", "num_ratings": "3,326", "num_reviews": "416", "avg_ratings": 3.88, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Western Africa", "Sierra Leone", "Literature", "African Literature"], "title": "The Memory of Love", "description": ["In contemporary Sierra Leone, a devastating civil war has left an entire populace with secrets to keep. In the capital hospital, a gifted young surgeon is plagued by demons that are beginning to threaten his livelihood. Elsewhere in the hospital lies a dying man who was young during the country’s turbulent postcolonial years and has stories to tell that are far from heroic", "In contemporary Sierra Leone, a devastating civil war has left an entire populace with secrets to keep. In the capital hospital, a gifted young surgeon is plagued by demons that are beginning to threaten his livelihood. Elsewhere in the hospital lies a dying man who was young during the country’s turbulent postcolonial years and has stories to tell that are far from heroic. ", "As past and present intersect in the buzzing city, these men are drawn unwittingly closer by a British psychologist with good intentions, and into the path of one woman at the center of their stories. ", "A work of breathtaking writing and rare wisdom, ", " seamlessly weaves together two generations of African life to create a story of loss, absolution, and the indelible effects of the past—and, in the end, the very nature of love."], "author": "Aminatta Forna", "num_pages": "445", "awards": ["Warwick Prize for Writing Nominee for Shortlist (2011)", "Orange Prize Nominee for Fiction Shortlist (2011)", "Commonwealth Writers' Prize for Best Book Overall (2011)", "Europese Literatuurprijs Nominee (2013)"], "places": ["Sierra Leone"], "character_names": [], "language": "English", "publish_date": "2010-05-01 00:00:00", "ISBN": "1408808137"},
{"url": "https://www.goodreads.com/book/show/152642.The_River_Between", "num_ratings": "2,405", "num_reviews": "173", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Kenya", "Literature", "African Literature"], "title": "The River Between", "description": ["Christian missionaries attempt to outlaw the female circumcision ritual and in the process create a terrible rift between the two Kikuyu communities on either side of the river."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "152", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-11 00:00:00", "ISBN": "0435905481"},
{"url": "https://www.goodreads.com/book/show/836746.A_Grain_of_Wheat", "num_ratings": "3,068", "num_reviews": "170", "avg_ratings": 3.83, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Kenya", "Historical", "Historical Fiction", "Literature", "African Literature"], "title": "A Grain of Wheat", "description": ["Set in the wake of the Mau Mau rebellion and on the cusp of Kenya's independence from Britain, A Grain of Wheat follows a group of villagers whose lives have been transformed by the 1952–1960 Emergency. At the center of it all is the reticent Mugo, the village's chosen hero and a man haunted by a terrible secret. As we learn of the villagers' tangled histories in a narrati", "Set in the wake of the Mau Mau rebellion and on the cusp of Kenya's independence from Britain, A Grain of Wheat follows a group of villagers whose lives have been transformed by the 1952–1960 Emergency. At the center of it all is the reticent Mugo, the village's chosen hero and a man haunted by a terrible secret. As we learn of the villagers' tangled histories in a narrative interwoven with myth and peppered with allusions to real-life leaders, including Jomo Kenyatta, a masterly story unfolds in which compromises are forced, friendships are betrayed, and loves are tested."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "247", "awards": [], "places": ["East Africa"], "character_names": [], "language": "English", "publish_date": "1994-01-01 00:00:00", "ISBN": "0435909878"},
{"url": "https://www.goodreads.com/book/show/158674.Nervous_Conditions", "num_ratings": "9,179", "num_reviews": "651", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Eastern Africa", "Zimbabwe", "Feminism"], "title": "Nervous Conditions", "description": ["A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousn", "A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousness' of the 'postcolonial' conditions that bedevil us still. In Tambu and the women of her family, we African women see ourselves, whether at home or displaced, doing daily battle with our changing world with a mixture of tenacity, bewilderment and grace."], "author": "Tsitsi Dangarembga", "num_pages": "204", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1989)"], "places": ["Rhodesia", "Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2004-11-29 00:00:00", "ISBN": "1580051340"},
{"url": "https://www.goodreads.com/book/show/5587960-the-thing-around-your-neck", "num_ratings": "18,423", "num_reviews": "1,814", "avg_ratings": 4.21, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Contemporary", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "The Thing Around Your Neck", "description": ["Searing and profound, suffused with beauty, sorrow, and longing, the stories in The Thing Around Your Neck map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them.", "Chimamanda Ngozi Adichie burst onto the literary scene with her remarkable debut novel, Purple Hibiscus, which critics hailed as \"one of the b", "Searing and profound, suffused with beauty, sorrow, and longing, the stories in The Thing Around Your Neck map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them.", "Chimamanda Ngozi Adichie burst onto the literary scene with her remarkable debut novel, Purple Hibiscus, which critics hailed as \"one of the best novels to come out of Africa in years\" (Baltimore Sun), with \"prose as lush as the Nigerian landscape that it powerfully evokes\" (The Boston Globe); The Washington Post called her \"the twenty-first-century daughter of Chinua Achebe.\" Her award-winning Half of a Yellow Sun became an instant classic upon its publication three years later, once again putting her tremendous gifts - graceful storytelling, knowing compassion, and fierce insight into her characters' hearts - on display. Now, in her most intimate and seamlessly crafted work to date, Adichie turns her penetrating eye on not only Nigeria but America, in twelve dazzling stories that explore the ties that bind men and women, parents and children, Africa and the United States.", "In \"A Private Experience,\" a medical student hides from a violent riot with a poor Muslim woman whose dignity and faith force her to confront the realities and fears she's been pushing away. In \"Tomorrow is Too Far,\" a woman unlocks the devastating secret that surrounds her brother's death. The young mother at the center of \"Imitation\" finds her comfortable life in Philadelphia threatened when she learns that her husband has moved his mistress into their Lagos home. And the title story depicts the choking loneliness of a Nigerian girl who moves to an America that turns out to be nothing like the country she expected; though falling in love brings her desires nearly within reach, a death in her homeland forces her to reexamine them.", "Searing and profound, suffused with beauty, sorrow, and longing, these stories map, with Adichie's signature emotional wisdom, the collision of two cultures and the deeply human struggle to reconcile them. The Thing Around Your Neck is a resounding confirmation of the prodigious literary powers of one of our most essential writers."], "author": "Chimamanda Ngozi Adichie", "num_pages": "218", "awards": ["John Llewellyn Rhys Prize Nominee (2009)", "O. Henry Award for 'The American Embassy' (2003)", "Dayton Literary Peace Prize for Fiction (Runner-up) (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-16 00:00:00", "ISBN": "0307271072"},
{"url": "https://www.goodreads.com/book/show/6150.Cry_the_Beloved_Country", "num_ratings": "57,772", "num_reviews": "3,472", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Southern Africa", "South Africa"], "title": "Cry, the Beloved Country", "description": ["Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.", "Cry, the Beloved Country, the most famous and important novel in South Africa’s history, was an immediate worldwide bestseller in 1948. Alan Paton’s impassioned novel about a black man’s country under white man’s law is a work of searing beauty.", "The eminent literary critic Lewis Gannett wrote, “We have had many novels from statesmen and reformers, almost all bad; many novels from poets, almost all thin. In Alan Paton’s ", " the statesman, the poet and the novelist meet in a unique harmony.” ", " is the deeply moving story of the Zulu pastor Stephen Kumalo and his son, Absalom, set against the background of a land and a people riven by racial injustice. Remarkable for its lyricism, unforgettable for character and incident, ", " is a classic work of love and hope, courage and endurance, born of the dignity of man."], "author": "Alan Paton", "num_pages": "316", "awards": ["Anisfield-Wolf Book Award for Fiction (1949)"], "places": ["South Africa"], "character_names": ["Stephen Kumalo", "Absalom Kumalo", "Msimangu", "James Jarvis"], "language": "English", "publish_date": "2003-11-25 00:00:00", "ISBN": "074326195X"},
{"url": "https://www.goodreads.com/book/show/264587.The_Beautyful_Ones_Are_Not_Yet_Born", "num_ratings": "2,122", "num_reviews": "150", "avg_ratings": 3.91, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Ghana", "Literature", "African Literature", "Historical", "Historical Fiction"], "title": "The Beautyful Ones Are Not Yet Born", "description": ["A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after i", "A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after independence in the 1960s. It is often claimed to rank with \"Things Fall Apart\" as one of the high points of post-colonial African Literature. ", "A quote from Chapter 6: ", "\"And where is my solid ground these days? Let us say just that the cycle from birth to decay has been short. Short, brief. But otherwise not at all unusual. And even in the decline into the end there are things that remind the longing mind of old beginnings and hold out the promise of new ones, things even like your despair itself. I have heard this pain before, only then it was multiplied many, many times, but that may only be because at that time I was not so alone, so far apart. Maybe there are other lonely voices despairing now. I will not be entranced by the voice, even if it should swell as it did in the days of hope. I will not be entranced, since I have seen the destruction of the promises it made. But I shall not resist it either. I will be like a cork. It is so surprising, is it not, how even the worst happenings of the past acquire a sweetness in the memory. Old harsh distresses are now merely pictures and tastes which hurt no more, like itching scars which can only give pleasure now. Strange, because when I can think soberly about it all, with out pushing any later joys into the deepr past, I can remember that things were terrible then. When the war was over the soldiers came back to homes broken in their absence and they themselves brought murder in their hearts and gave it to those nearest them. I saw it, not very clearly, because I had no way of understanding it, but it frightened me. We had gone on marches of victory and I do not think there was anyone mean enough in spirit to ask whether we knew what we were celebrating. Whose victory? Ours? It did not matter. We marched, and only a dishonest fool will look back on his boyhood and say he knew even then that there was no meaning in any of it. It is so funny now, to remember that we all thought we were welcoming victory. Or perhaps there is nothing funny here at all, and it is only that victory itself happens to be the identical twin of defeat. \""], "author": "Ayi Kwei Armah", "num_pages": "191", "awards": [], "places": ["Ghana"], "character_names": [], "language": "English", "publish_date": "1989-10-23 00:00:00", "ISBN": "0435905406"},
{"url": "https://www.goodreads.com/book/show/123748.God_s_Bits_of_Wood", "num_ratings": "2,062", "num_reviews": "117", "avg_ratings": 3.92, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Western Africa", "Senegal"], "title": "God's Bits of Wood", "description": ["In 1947-48 the workers on the Dakar-Niger railway staged a strike. In this vivid, timeless novel, Ousmane Sembène envinces the color, passion, and tragedy of those formative years in the history of West Africa."], "author": "Ousmane Sembène", "num_pages": "252", "awards": [], "places": ["Senegal"], "character_names": [], "language": "English", "publish_date": "2008-08-11 00:00:00", "ISBN": "0435909592"},
{"url": "https://www.goodreads.com/book/show/7194279-the-secret-lives-of-baba-segi-s-wives", "num_ratings": "4,470", "num_reviews": "700", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Literature", "African Literature", "Contemporary"], "title": "The Secret Lives of Baba Segi's Wives", "description": ["African-born poet Lola Shoneyin makes her fiction debut with ", "a perceptive, entertaining, and eye-opening novel of polygamy in modern-day Nigeria. The struggles, rivalries, intricate family politics, and the interplay of personalities and relationships within the complex private world of a polygamous union come to life in ", "African-born poet Lola Shoneyin makes her fiction debut with ", "a perceptive, entertaining, and eye-opening novel of polygamy in modern-day Nigeria. The struggles, rivalries, intricate family politics, and the interplay of personalities and relationships within the complex private world of a polygamous union come to life in ", "—", " ", "and ", "set against a contemporary African background."], "author": "Lola Shoneyin", "num_pages": "280", "awards": ["Orange Prize Nominee for Fiction Longlist (2011)", "Nigeria Prize Nominee for Literature (2012)", "ANA/NDDC Ken Saro-Wiwa Prose Prize (2011)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2010-06-29 00:00:00", "ISBN": "0061946370"},
{"url": "https://www.goodreads.com/book/show/49552.The_Stranger", "num_ratings": "546,479", "num_reviews": "17,285", "avg_ratings": 3.97, "genres": ["Classics", "Fiction", "Philosophy", "Cultural", "France", "Literature"], "title": "The Stranger", "description": ["Through the story of an ordinary man unwittingly drawn into a senseless murder on an Algerian beach, Camus explored what he termed \"the nakedness of man faced with the absurd.\" First published in English in 1946; now in a new translation by Matthew Ward."], "author": "Albert Camus", "num_pages": "123", "awards": ["PEN Translation Prize for Matthew Ward (1989)"], "places": ["Algeria"], "character_names": ["Meursault", "Raymond Sintès", "Marie Cardona", "Salamano"], "language": "English", "publish_date": "1989-03-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6192.Disgrace", "num_ratings": "69,576", "num_reviews": "5,066", "avg_ratings": 3.84, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Novels", "Literature"], "title": "Disgrace", "description": ["Set in post-apartheid South Africa, J. M. Coetzee’s searing novel tells the story of David Lurie, a twice divorced, 52-year-old professor of communications and Romantic Poetry at Cape Technical University. Lurie believes he has created a comfortable, if somewhat passionless, life for himself. He lives within his financial and emotional means. Though his position at the uni", "Set in post-apartheid South Africa, J. M. Coetzee’s searing novel tells the story of David Lurie, a twice divorced, 52-year-old professor of communications and Romantic Poetry at Cape Technical University. Lurie believes he has created a comfortable, if somewhat passionless, life for himself. He lives within his financial and emotional means. Though his position at the university has been reduced, he teaches his classes dutifully; and while age has diminished his attractiveness, weekly visits to a prostitute satisfy his sexual needs. He considers himself happy. But when Lurie seduces one of his students, he sets in motion a chain of events that will shatter his complacency and leave him utterly disgraced."], "author": "J.M. Coetzee", "num_pages": "220", "awards": ["Man Booker Prize (1999)", "National Book Critics Circle Award Nominee for Fiction (1999)", "Commonwealth Writers' Prize for Best Book Overall (2000)", "The Best of the Booker Nominee (2008)"], "places": ["South Africa", "Cape Town"], "character_names": ["David Lurie", "Lucy Lurie", "Petrus", "Bev Shaw", "Melanie Isaacs"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0143036378"},
{"url": "https://www.goodreads.com/book/show/15796700-americanah", "num_ratings": "169,639", "num_reviews": "16,436", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Feminism", "Literary Fiction"], "title": "Americanah", "description": ["Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a d", "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London. Fifteen years later, they reunite in a newly democratic Nigeria, and reignite their passion—for each other and for their homeland.", "Source: chimamanda.com"], "author": "Chimamanda Ngozi Adichie", "num_pages": "477", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0307271080"},
{"url": "https://www.goodreads.com/book/show/151374.So_Long_a_Letter", "num_ratings": "5,441", "num_reviews": "453", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Senegal", "Literature", "African Literature", "Cultural", "France", "Feminism"], "title": "So Long a Letter", "description": ["This novel is in the form of a letter, written by the widowed Ramatoulaye and describing her struggle for survival. It is the winner of the Noma Award."], "author": "Mariama Bâ", "num_pages": "90", "awards": ["Noma Award for Publishing in Africa (1980)"], "places": ["Senegal"], "character_names": ["Ramatoulaye", "Aissatou", "Mawdo Ba", "Modou Fall", "Binetou"], "language": "English", "publish_date": "1989-06-28 00:00:00", "ISBN": "0435905554"},
{"url": "https://www.goodreads.com/book/show/126381.Purple_Hibiscus", "num_ratings": "44,222", "num_reviews": "4,231", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her bro", "Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her brother away to stay with their aunt, a University professor, whose house is noisy and full of laughter. There, Kambili and her brother discover a life and love beyond the confines of their father’s authority. The visit will lift the silence from their world and, in time, give rise to devotion and defiance that reveal themselves in profound and unexpected ways. ", "This is a book about the promise of freedom; about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new."], "author": "Chimamanda Ngozi Adichie", "num_pages": "307", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0007189885"},
{"url": "https://www.goodreads.com/book/show/18749.Half_of_a_Yellow_Sun", "num_ratings": "69,512", "num_reviews": "6,171", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21", "Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed. ", "With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another. ", "Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had."], "author": "Chimamanda Ngozi Adichie", "num_pages": "433", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "1400044162"}
]