[
{"url": "https://www.goodreads.com/book/show/38447.The_Handmaid_s_Tale", "num_ratings": "912,590", "num_reviews": "49,580", "avg_ratings": 4.08, "genres": ["Fiction", "Classics", "Science Fiction", "Dystopia", "Science Fiction", "Feminism"], "title": "The Handmaid's Tale", "description": ["Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Ha", "Offred is a Handmaid in the Republic of Gilead. She may leave the home of the Commander and his wife once a day to walk to food markets whose signs are now pictures instead of words because women are no longer allowed to read. She must lie on her back once a month and pray that the Commander makes her pregnant, because in an age of declining births, Offred and the other Handmaids are valued only if their ovaries are viable. Offred can remember the years before, when she lived and made love with her husband, Luke; when she played with and protected her daughter; when she had a job, money of her own, and access to knowledge. But all of that is gone now..."], "author": "Margaret Atwood", "num_pages": "311", "awards": ["Man Booker Prize Nominee (1986)", "Nebula Award Nominee for Best Novel (1986)", "Arthur C. Clarke Award for Best Novel (1987)", "Audie Award for Fiction (2013)", "Los Angeles Times Book Prize for Fiction (1986)", "Prometheus Award Nominee for Best Novel (1987)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (1985)", "Commonwealth Writers' Prize Nominee for Best Book in Caribbean and Canada (1987)", "CBC Canada Reads Nominee (2002)"], "places": ["Cambridge, Massachusetts", "Republic of Gilead"], "character_names": ["The Commander", "Offred", "Serena Joy", "Ofglen", "Nick", "Moira", "Luke Castellan"], "language": "English", "publish_date": "1998-03-16 00:00:00", "ISBN": "038549081X"},
{"url": "https://www.goodreads.com/book/show/12557.The_Kitchen_God_s_Wife", "num_ratings": "65,931", "num_reviews": "1,908", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia", "Contemporary"], "title": "The Kitchen God's Wife", "description": ["Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside", "Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside Shanghai in the 1920s, and other places in China during World War II, and traces the happy and desperate events that led to Winnie's coming to America in 1949."], "author": "Amy Tan", "num_pages": "416", "awards": [], "places": ["United States of America"], "character_names": ["Winnie", "Auntie Helen", "Pearl Bright", "Mary", "Frank Russell", "Roger \"Bao Bao\"", "Doug Cheu", "Phil Brandt", "Tessa Russo", "Cleo", "Mimi Wong", "Loy Fong", "Edna Fong", "New Aunt", "Old Aunt", "Wen Fu", "Huazheng \"Peanut\"", "Uncle Henry"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038109"},
{"url": "https://www.goodreads.com/book/show/337113.The_Tenant_of_Wildfell_Hall", "num_ratings": "74,726", "num_reviews": "3,323", "avg_ratings": 3.92, "genres": ["Classics", "Fiction", "Romance", "Literature", "19th Century"], "title": "The Tenant of Wildfell Hall", "description": ["This is the story of a woman's struggle for independence. Helen \"Graham\" has returned to Wildfell Hall in flight from a disastrous marriage. Exiled to the desolate moorland mansion,", "This is the story of a woman's struggle for independence. Helen \"Graham\" has returned to Wildfell Hall in flight from a disastrous marriage. Exiled to the desolate moorland mansion, she adopts an assumed name and earns her living as a painter."], "author": "Anne Brontë", "num_pages": "542", "awards": [], "places": ["Yorkshire, England", "London, England"], "character_names": ["Helen Graham", "Gilbert Markham", "Arthur Huntingdon", "Eliza Millward", "Frederick Lawrence", "Milicent Hargrave", "Esther Hargrave", "Walter Hargrave", "Arthur Huntingdon-Jr.", "Rachel (The Tenant of Wildfell Hall)"], "language": "English", "publish_date": "1996-04-16 00:00:00", "ISBN": "0140434747"},
{"url": "https://www.goodreads.com/book/show/324786.House_on_Mango_Street", "num_ratings": "98,024", "num_reviews": "8,148", "avg_ratings": 3.6, "genres": ["Fiction", "Young Adult", "Classics", "Short Stories", "Academic", "School"], "title": "House on Mango Street", "description": ["2 cassettes / Approx. 2 1/2 hours", "Listen as Sandra Cisneros brings to life ", ", her greatly admired novel of a young girl growing up in the Latino section of Chicago.  Acclaimed by critics, beloved by children, their parents and grandparents, taught everywhere from inner-city grade schools to universities across the co", "2 cassettes / Approx. 2 1/2 hours", "Listen as Sandra Cisneros brings to life ", ", her greatly admired novel of a young girl growing up in the Latino section of Chicago.  Acclaimed by critics, beloved by children, their parents and grandparents, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, it has entered the canon of coming-of-age classics.", " tells the story of Esperanza Cordero, whose neighborhood is one of harsh realities and hard beauty.  Esperanza doesn't want to belong - not to her rundown neighborhood, and not to the low expectations the world has for her.  Esperanza's story is that of a young girl coming into her power, and inventing for herself what she will become.", "This timeless classic is now available, for the first time, unabridged.  And what makes this a particularly special audio production is the fact that the author, Sandra Cisneros, reads."], "author": "Sandra Cisneros", "num_pages": "0", "awards": ["American Book Award (1985)", "George C. Stone Center for Children's Books Recognition of Merit Award (1994)"], "places": ["Chicago, Illinois"], "character_names": ["Esperanza", "Nenny"], "language": "English", "publish_date": "1991-01-01 00:00:00", "ISBN": "0072435178"},
{"url": "https://www.goodreads.com/book/show/104344.The_Gate_to_Women_s_Country", "num_ratings": "10,578", "num_reviews": "644", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction", "Dystopia", "Feminism"], "title": "The Gate to Women's Country", "description": ["Tepper's finest novel to date is set in a post-holocaust feminist dystopia that offers only two political alternatives: a repressive polygamist sect that is slowly self-destructing through inbreeding and the matriarchal dictatorship called Women's Country. Here, in a desperate effort to prevent another world war, the women have segregated most men into closed military garr", "Tepper's finest novel to date is set in a post-holocaust feminist dystopia that offers only two political alternatives: a repressive polygamist sect that is slowly self-destructing through inbreeding and the matriarchal dictatorship called Women's Country. Here, in a desperate effort to prevent another world war, the women have segregated most men into closed military garrisons and have taken on themselves every other function of government, industry, agriculture, science and learning.", "The resulting manifold responsibilities are seen through the life of Stavia, from a dreaming 10-year-old to maturity as doctor, mother and member of the Marthatown Women's Council. As in Tepper's Awakeners series books, the rigid social systems are tempered by the voices of individual experience and, here, by an imaginative reworking of The Trojan Woman that runs through the text. A rewarding and challenging novel that is to be valued for its provocative ideas."], "author": "Sheri S. Tepper", "num_pages": "315", "awards": ["Locus Award for Best Fantasy Novel (1992)", "Arthur C. Clarke Award Nominee (1998)"], "places": ["Marthatown"], "character_names": ["Sylvia", "Stavia", "Chernon", "Morgot", "Jerby", "Dawid", "Beneda", "Myra Morgotdoughter"], "language": "English", "publish_date": "1999-08-16 00:00:00", "ISBN": "0006482708"},
{"url": "https://www.goodreads.com/book/show/15055.Oranges_Are_Not_the_Only_Fruit", "num_ratings": "45,531", "num_reviews": "2,229", "avg_ratings": 3.74, "genres": ["Fiction", "Lgbt", "Glbt", "Queer", "Contemporary", "Classics", "Novels", "Glbt", "Lesbian", "European Literature", "British Literature", "Religion", "Feminism"], "title": "Oranges Are Not the Only Fruit", "description": ["This startling novel describes the adolescence of a ferociously bright and rebellious orphan adopted into a Pentecostal household in the dour, industrial Midlands and her coming to terms with her unorthodox sexuality."], "author": "Jeanette Winterson", "num_pages": "176", "awards": ["Whitbread Award for First Novel (1985)"], "places": ["United Kingdom"], "character_names": [], "language": "English", "publish_date": "1997-08-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/78433.The_Blind_Assassin", "num_ratings": "119,948", "num_reviews": "6,569", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Cultural", "Canada"], "title": "The Blind Assassin", "description": ["Margaret Atwood takes the art of storytelling to new heights in a dazzling novel that unfolds layer by astonishing layer and concludes in a brilliant and wonderfully satisfying twist. Told in a style that magnificently captures the colloquialisms and clichés of the 1930s and 1940s, The Blind Assassin is a richly layered and uniquely rewarding experience.", "It opens with these", "Margaret Atwood takes the art of storytelling to new heights in a dazzling novel that unfolds layer by astonishing layer and concludes in a brilliant and wonderfully satisfying twist. Told in a style that magnificently captures the colloquialisms and clichés of the 1930s and 1940s, The Blind Assassin is a richly layered and uniquely rewarding experience.", "It opens with these simple, resonant words: \"Ten days after the war ended, my sister drove a car off the bridge.\" They are spoken by Iris, whose terse account of her sister Laura's death in 1945 is followed by an inquest report proclaiming the death accidental. But just as the reader expects to settle into Laura's story, Atwood introduces a novel-within-a- novel. Entitled The Blind Assassin, it is a science fiction story told by two unnamed lovers who meet in dingy backstreet rooms. When we return to Iris, it is through a 1947 newspaper article announcing the discovery of a sailboat carrying the dead body of her husband, a distinguished industrialist.", "For the past twenty-five years, Margaret Atwood has written works of striking originality and imagination. In The Blind Assassin, she stretches the limits of her accomplishments as never before, creating a novel that is entertaining and profoundly serious. The Blind Assassin proves once again that Atwood is one of the most talented, daring, and exciting writers of our time. Like The Handmaid's Tale, it is destined to become a classic."], "author": "Margaret Atwood", "num_pages": "637", "awards": ["Man Booker Prize (2000)", "Orange Prize Nominee for Fiction Shortlist (2001)", "Hammett Prize (2000)", "Puddly Award for New Novel (2001)", "International DUBLIN Literary Award Nominee (2002)"], "places": ["Canada", "Toronto, Ontario", "Southwest Ontario"], "character_names": ["Iris Chase", "Laura Chase", "Alex Thomas", "Richard Griffen"], "language": "English", "publish_date": "2001-09-03 00:00:00", "ISBN": "1860498809"},
{"url": "https://www.goodreads.com/book/show/1591.Lysistrata", "num_ratings": "31,634", "num_reviews": "734", "avg_ratings": 3.85, "genres": ["Plays", "Classics", "Drama", "Fiction", "Plays", "Theatre"], "title": "Lysistrata", "description": ["Aristophanes' comic masterpiece of war and sex remains one of the greatest plays ever written. Led by the title character, the women of the warring city-states of Greece agree to withhold sexual favours with their husbands until they agree to cease fighting. The war of the sexes that ensues makes ", " a comedy without peer in the history of theatre."], "author": "Aristophanes", "num_pages": "132", "awards": [], "places": ["Greece"], "character_names": ["Lysistrata"], "language": "English", "publish_date": "2003-03-01 00:00:00", "ISBN": "0872206033"},
{"url": "https://www.goodreads.com/book/show/49011.The_Bloody_Chamber_and_Other_Stories", "num_ratings": "29,694", "num_reviews": "2,484", "avg_ratings": 4.01, "genres": ["Short Stories", "Fantasy", "Fiction", "Horror", "Fantasy", "Fairy Tales", "Gothic", "Feminism"], "title": "The Bloody Chamber and Other Stories", "description": ["Angela Carter was a storytelling sorceress, the literary godmother of such contemporary masters of supernatural fiction as Neil Gaiman, David Mitchell, Audrey Niffenegger, J. K. Rowling, and Kelly Link, who introduces this edition of Carter's most celebrated book, published for the seventy-fifth anniversary of her birth. In ", "—which includes the story that", "Angela Carter was a storytelling sorceress, the literary godmother of such contemporary masters of supernatural fiction as Neil Gaiman, David Mitchell, Audrey Niffenegger, J. K. Rowling, and Kelly Link, who introduces this edition of Carter's most celebrated book, published for the seventy-fifth anniversary of her birth. In ", "—which includes the story that is the basis of Neil Jordan's 1984 movie ", "—Carter spins subversively dark and sensual versions of familiar fairy tales and legends like \"Little Red Riding Hood,\" \"Bluebeard,\" \"Puss in Boots,\" and \"Beauty and the Beast,\" giving them exhilarating new life in a style steeped in the romantic trappings of the gothic tradition."], "author": "Angela Carter", "num_pages": "128", "awards": ["Cheltenham Prize for Literature (1979)"], "places": [], "character_names": [], "language": "English", "publish_date": "1990-08-16 00:00:00", "ISBN": "014017821X"},
{"url": "https://www.goodreads.com/book/show/240130.The_Paper_Bag_Princess", "num_ratings": "43,375", "num_reviews": "1,775", "avg_ratings": 4.32, "genres": ["Childrens", "Picture Books", "Childrens", "Fantasy"], "title": "The Paper Bag Princess", "description": ["The Princess Elizabeth is slated to marry Prince Ronald when a dragon attacks the castle and kidnaps Ronald. In resourceful and humorous fashion, Elizabeth finds the dragon, outsmarts him, and rescues Ronald--who is less than pleased at her un-princess-like appearance. Full color."], "author": "Robert Munsch", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1980-05-01 00:00:00", "ISBN": "0920236162"},
{"url": "https://www.goodreads.com/book/show/2294528.Howl_s_Moving_Castle", "num_ratings": "159,484", "num_reviews": "10,644", "avg_ratings": 4.3, "genres": ["Fantasy", "Young Adult", "Fiction", "Romance", "Fantasy", "Magic"], "title": "Howl's Moving Castle", "description": ["Sophie has the great misfortune of being the eldest of three daughters, destined to fail miserably should she ever leave home to seek her fate. But when she unwittingly attracts the ire of the Witch of the Waste, Sophie finds herself under a horrid spell that transforms her into an old lady. Her only chance at breaking it lies in the ever-moving castle in the hills: the Wi", "Sophie has the great misfortune of being the eldest of three daughters, destined to fail miserably should she ever leave home to seek her fate. But when she unwittingly attracts the ire of the Witch of the Waste, Sophie finds herself under a horrid spell that transforms her into an old lady. Her only chance at breaking it lies in the ever-moving castle in the hills: the Wizard Howl's castle. To untangle the enchantment, Sophie must handle the heartless Howl, strike a bargain with a fire demon, and meet the Witch of the Waste head-on. Along the way, she discovers that there's far more to Howl—and herself—than first meets the eye."], "author": "Diana Wynne Jones", "num_pages": "429", "awards": ["Phoenix Award (Children's Literature Association) (2006)", "Boston Globe-Horn Book Award (1987)"], "places": ["Ingary", "Porthaven", "Wales"], "character_names": ["Michael", "Wizard Howl", "Sophie Hatter", "Calcifer", "Witch of the Waste", "Lily Angorian"], "language": "English", "publish_date": "2008-04-22 00:00:00", "ISBN": "0061478784"},
{"url": "https://www.goodreads.com/book/show/11346.Sula", "num_ratings": "46,762", "num_reviews": "2,602", "avg_ratings": 3.88, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Literature"], "title": "Sula", "description": ["This rich and moving novel traces the lives of two black heroines from their close-knit childhood in a small Ohio town, through their sharply divergent paths of womanhood, to their ultimate confrontation and reconciliation.", "Nel Wright has chosen to stay in the place where she was born, to marry, raise a family, and become a pillar of the black community. Sula Peace has reje", "This rich and moving novel traces the lives of two black heroines from their close-knit childhood in a small Ohio town, through their sharply divergent paths of womanhood, to their ultimate confrontation and reconciliation.", "Nel Wright has chosen to stay in the place where she was born, to marry, raise a family, and become a pillar of the black community. Sula Peace has rejected the life Nel has embraced, escaping to college, and submerging herself in city life. When she returns to her roots, it is as a rebel and a wanton seductress. Eventually, both women must face the consequences of their choices. Together, they create an unforgettable portrait of what it means and costs to be a black woman in America."], "author": "Toni Morrison", "num_pages": "192", "awards": ["Audie Award for Narration by the Author or Authors (1998)", "National Book Award Finalist for Fiction (1975)"], "places": [], "character_names": ["Nel Wright Greene", "Sula Peace", "Helene Wright", "Eva Peace", "Hannah Peace"], "language": "English", "publish_date": "2002-04-05 00:00:00", "ISBN": "0452283868"},
{"url": "https://www.goodreads.com/book/show/25437891-the-v-girl", "num_ratings": "5,708", "num_reviews": "676", "avg_ratings": 4.01, "genres": ["Romance", "Young Adult", "Young Adult", "Coming Of Age", "Science Fiction", "Dystopia", "Fiction", "Science Fiction"], "title": "The V Girl", "description": ["ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substi", "ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substitute for love.", "Lila’s coping mechanism to deal with her mother’s loss is her secret. A secret that will bring her closer to Aleksey Fürst, a foreign, broody man who she distrusts because of his links to the troops and his rough, yet irresistible appearance. He offers Lila an alternative to her plans, a possibility that terrifies her…and tempts her in spite of herself.", "With threats looming at every turn and no way to escape, Lila fears that falling in love will only lead to more heartache. The consequences of laying down her arms for Aleksey and welcoming hope might destroy more than her heart. They might force her to face the worst of her nightmares becoming a reality. Is love possible in a world that has forgotten what the human touch is?", "NOTES FROM THE AUTHOR", "* This is a book full of romance and anti-rape messages. I didn't write this book to romanticize violence against women but to tell the story of a girl who has to come of age under the most terrible circumstances. ", "* This full-length novel is a stand alone. No cliffhanger", "* Alpha male hero. No cheating. No slut-shaming.", "* Includes a discussion guide for bookclubs", "* Possible triggers for abuse survivors."], "author": "Mya Robarts", "num_pages": "341", "awards": [], "places": ["Starville"], "character_names": ["Lila Velez", "Aleksey Fürst", "Azalea Velez", "Olmo Velez", "Tristan Froh", "Ethan Velez"], "language": "English", "publish_date": "2015-06-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24100.The_Golden_Notebook", "num_ratings": "16,670", "num_reviews": "1,384", "avg_ratings": 3.76, "genres": ["Fiction", "Classics", "Feminism", "Literature", "Novels"], "title": "The Golden Notebook", "description": ["Anna is a writer, author of one very successful novel, who now keeps four notebooks. In one, with a black cover, she reviews the African experience of her earlier year. In a red one she records her political life, her disillusionment with communism. In a yellow one she writes a novel in which the heroine reviles part of her own experience. And in the blue one she keeps a p", "Anna is a writer, author of one very successful novel, who now keeps four notebooks. In one, with a black cover, she reviews the African experience of her earlier year. In a red one she records her political life, her disillusionment with communism. In a yellow one she writes a novel in which the heroine reviles part of her own experience. And in the blue one she keeps a personal diary. Finally, in love with an American writer and threatened with insanity, Anna tries to bring the threads of all four books together in a golden notebook."], "author": "Doris Lessing", "num_pages": "640", "awards": ["Prix Médicis Etranger (1976)"], "places": [], "character_names": ["Anna Wulf", "Max Wulf", "Janet Wulf", "Molly Jacobs", "Richard Portmain"], "language": "English", "publish_date": "1999-02-03 00:00:00", "ISBN": "006093140X"},
{"url": "https://www.goodreads.com/book/show/133445.The_Edible_Woman", "num_ratings": "25,353", "num_reviews": "1,388", "avg_ratings": 3.67, "genres": ["Fiction", "Cultural", "Canada", "Feminism", "Classics", "Novels", "Literary Fiction", "Contemporary", "Literature", "Literature", "Canadian Literature", "Adult Fiction"], "title": "The Edible Woman", "description": ["Marian is determined to be ordinary. She lays her head gently on the shoulder of her serious fiancé and quietly awaits marriage. But she didn't count on an inner rebellion that would rock her stable routine, and her digestion. Marriage a la mode, Marian discovers, is something she literally can't stomach... The Edible Woman is a funny, engaging novel about emotional cannib", "Marian is determined to be ordinary. She lays her head gently on the shoulder of her serious fiancé and quietly awaits marriage. But she didn't count on an inner rebellion that would rock her stable routine, and her digestion. Marriage a la mode, Marian discovers, is something she literally can't stomach... The Edible Woman is a funny, engaging novel about emotional cannibalism, men and women, and the desire to be consumed."], "author": "Margaret Atwood", "num_pages": "310", "awards": [], "places": ["Toronto, Ontario"], "character_names": ["Marian McAlpin", "Ainsley Tewce", "Peter Wollander"], "language": "English", "publish_date": "1998-06-16 00:00:00", "ISBN": "0385491069"},
{"url": "https://www.goodreads.com/book/show/17645.The_Penelopiad", "num_ratings": "29,542", "num_reviews": "2,937", "avg_ratings": 3.68, "genres": ["Fiction", "Fantasy", "Mythology", "Historical", "Historical Fiction", "Fantasy", "Feminism", "Cultural", "Canada"], "title": "The Penelopiad", "description": [" ", " ", " "], "author": "Margaret Atwood", "num_pages": "198", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2006)"], "places": [], "character_names": ["Odysseus", "Penelope (wife of Odysseus)"], "language": "English", "publish_date": "2005-10-05 00:00:00", "ISBN": "1841957178"},
{"url": "https://www.goodreads.com/book/show/18889.Lady_of_Avalon", "num_ratings": "18,776", "num_reviews": "345", "avg_ratings": 3.94, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Mythology", "Arthurian"], "title": "Lady of Avalon", "author": "Marion Zimmer Bradley", "num_pages": "460", "awards": [], "places": ["United Kingdom"], "character_names": ["Morgaine", "Gwenhwyfar", "Merlin", "King Arthur"], "language": "English", "publish_date": "1998-05-01 00:00:00", "ISBN": "0788720392"},
{"url": "https://www.goodreads.com/book/show/2728527-the-guernsey-literary-and-potato-peel-pie-society", "num_ratings": "469,132", "num_reviews": "43,936", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance", "War", "World War II", "Book Club"], "title": "The Guernsey Literary and Potato Peel Pie Society", "description": ["Written with warmth and humor as a series of letters, this novel is a celebration of the written word in all its guises, and of finding connection in the most surprising ways.", "“I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” ", "January 1946: London is emerging from the shadow of th", "Written with warmth and humor as a series of letters, this novel is a celebration of the written word in all its guises, and of finding connection in the most surprising ways.", "“I wonder how the book got to Guernsey? Perhaps there is some sort of secret homing instinct in books that brings them to their perfect readers.” ", "January 1946: London is emerging from the shadow of the Second World War, and writer Juliet Ashton is looking for her next book subject. Who could imagine that she would find it in a letter from a man she’s never met, a native of the island of Guernsey, who has come across her name written inside a book by Charles Lamb…. ", "As Juliet and her new correspondent exchange letters, Juliet is drawn into the world of this man and his friends—and what a wonderfully eccentric world it is. The Guernsey Literary and Potato Peel Pie Society—born as a spur-of-the-moment alibi when its members were discovered breaking curfew by the Germans occupying their island—boasts a charming, funny, deeply human cast of characters, from pig farmers to phrenologists, literature lovers all. ", "Juliet begins a remarkable correspondence with the society’s members, learning about their island, their taste in books, and the impact the recent German occupation has had on their lives. Captivated by their stories, she sets sail for Guernsey, and what she finds will change her forever. ", "Written with warmth and humor as a series of letters, this novel is a celebration of the written word in all its guises, and of finding connection in the most surprising ways."], "author": "Mary Ann Shaffer", "num_pages": "277", "awards": ["Indies Choice Book Award for Best Indie Buzz Book (Fiction) (2009)"], "places": ["United Kingdom", "Guernsey"], "character_names": ["Sophie Mercer Evans", "Juliet Ashton", "Dawsey Adams", "Susan Scott", "Sidney Stark", "Elizabeth McKenna", "Isola Pribby", "Markham V. Reynolds, Jr.", "Kit McKenna", "Adelaide Addison", "Eben Ramsey", "Amelia Maugery"], "language": "English", "publish_date": "2008-07-29 00:00:00", "ISBN": "0385340990"},
{"url": "https://www.goodreads.com/book/show/60944.Meridian", "num_ratings": "4,504", "num_reviews": "183", "avg_ratings": 3.7, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Classics", "Feminism", "Literature"], "title": "Meridian", "description": ["The second novel written by Alice Walker, preceding ", " is a heartfelt and moving story about one woman's personal revolution as she joins the Civil Rights Movement. Set in the American South in the 1960s it follows Meridian Hill, a courageous young woman who dedicates herself heart and soul to her civil rights work, touching the lives of those around her even", "The second novel written by Alice Walker, preceding ", " is a heartfelt and moving story about one woman's personal revolution as she joins the Civil Rights Movement. Set in the American South in the 1960s it follows Meridian Hill, a courageous young woman who dedicates herself heart and soul to her civil rights work, touching the lives of those around her even as her own health begins to deteriorate. Hers is a lonely battle, but it is one she will not abandon, whatever the costs. This is classic Alice Walker, beautifully written, intense and passionate."], "author": "Alice Walker", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "075381949X"},
{"url": "https://www.goodreads.com/book/show/84544.The_Firebrand", "num_ratings": "8,852", "num_reviews": "381", "avg_ratings": 4.05, "genres": ["Historical", "Historical Fiction", "Fantasy", "Fiction", "Historical", "Fantasy", "Mythology"], "title": "The Firebrand", "description": ["Blending archaeological fact and legend, the myths of the gods and the feats of heroes, Marion Zimmer Bradley breathes new life into the classic tale of the Trojan War-reinventing larger-than-life figures as living people engaged in a desperate struggle that dooms both the victors and the vanquished, their fate seen through the eyes of Kassandra-priestess, princess, and pa", "Blending archaeological fact and legend, the myths of the gods and the feats of heroes, Marion Zimmer Bradley breathes new life into the classic tale of the Trojan War-reinventing larger-than-life figures as living people engaged in a desperate struggle that dooms both the victors and the vanquished, their fate seen through the eyes of Kassandra-priestess, princess, and passionate woman with the spirit of a warrior."], "author": "Marion Zimmer Bradley", "num_pages": "608", "awards": [], "places": ["Troy"], "character_names": ["Ajax", "Helen of Troy", "Menelaus", "Paris", "Hector of Troy", "Achilles (Greek hero)", "Agamemnon", "Priam", "Cassandra (of Troy)", "Andromache", "Briseis", "Hecuba", "Clytemnestra (wife of Agamemnon)"], "language": "English", "publish_date": "2003-05-06 00:00:00", "ISBN": "0451459245"},
{"url": "https://www.goodreads.com/book/show/59921.The_Telling", "num_ratings": "4,636", "num_reviews": "388", "avg_ratings": 3.89, "genres": ["Science Fiction", "Fiction", "Fantasy", "Speculative Fiction"], "title": "The Telling", "description": ["Once a culturally rich world, the planet Aka has been utterly transformed by technology. Records of the past have been destroyed, and citizens are strictly monitored. But an official observer from Earth named Sutty has learned of a group of outcasts who live in the wilderness. They still believe in the ancient ways and still practice its lost religion - the Telling.", "Intrigu", "Once a culturally rich world, the planet Aka has been utterly transformed by technology. Records of the past have been destroyed, and citizens are strictly monitored. But an official observer from Earth named Sutty has learned of a group of outcasts who live in the wilderness. They still believe in the ancient ways and still practice its lost religion - the Telling.", "Intrigued by their beliefs, Sutty joins them on a sacred pilgrimage into the mountains...and into the dangerous terrain of her own heart, mind, and soul."], "author": "Ursula K. Le Guin", "num_pages": "231", "awards": ["Locus Award for Best Science Fiction Novel (2001)", "Tähtivaeltaja Award Nominee (2010)", "Endeavour Award (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-01 00:00:00", "ISBN": "0441011233"},
{"url": "https://www.goodreads.com/book/show/28078.The_Birth_of_Venus", "num_ratings": "85,978", "num_reviews": "3,101", "avg_ratings": 3.8, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "Italy", "Art", "Romance", "Adult Fiction", "Adult", "Book Club", "Literature", "15th Century"], "title": "The Birth of Venus", "description": ["Alessandra Cecchi is not quite fifteen when her father, a prosperous cloth merchant, brings a young painter back from northern Europe to decorate the chapel walls in the family’s Florentine palazzo. A child of the Renaissance, with a precocious mind and a talent for drawing, Alessandra is intoxicated by the painter’s abilities.", "But their burgeoning relationship is interrupt", "Alessandra Cecchi is not quite fifteen when her father, a prosperous cloth merchant, brings a young painter back from northern Europe to decorate the chapel walls in the family’s Florentine palazzo. A child of the Renaissance, with a precocious mind and a talent for drawing, Alessandra is intoxicated by the painter’s abilities.", "But their burgeoning relationship is interrupted when Alessandra’s parents arrange her marriage to a wealthy, much older man. Meanwhile, Florence is changing, increasingly subject to the growing suppression imposed by the fundamentalist monk Savonarola, who is seizing religious and political control. Alessandra and her native city are caught between the Medici state, with its love of luxury, learning, and dazzling art, and the hellfire preaching and increasing violence of Savonarola’s reactionary followers. Played out against this turbulent backdrop, Alessandra’s married life is a misery, except for the surprising freedom it allows her to pursue her powerful attraction to the young painter and his art. ", " is a tour de force, the first historical novel from one of Britain’s most innovative writers of literary suspense. It brings alive the history of Florence at its most dramatic period, telling a compulsively absorbing story of love, art, religion, and power through the passionate voice of Alessandra, a heroine with the same vibrancy of spirit as her beloved city."], "author": "Sarah Dunant", "num_pages": "427", "awards": [], "places": ["Italy", "Florence"], "character_names": ["Alessandra Cecci", "Tomaso Cecci", "Cristoforo Langella", "Painter", "Girolamo Savonarola"], "language": "English", "publish_date": "2004-11-30 00:00:00", "ISBN": "0812968972"},
{"url": "https://www.goodreads.com/book/show/6137154-fire", "num_ratings": "143,850", "num_reviews": "9,570", "avg_ratings": 4.12, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction"], "title": "Fire", "description": ["It is not a peaceful time in the Dells. The young King Nash clings to his throne while rebel lords in the north and south build armies to unseat him. The mountains and forests are filled with spies and thieves and lawless men.", "This is where Fire lives. With a wild, irresistible appearance and hair the color of flame, Fire is the last remaining human monster. Equally hated a", "It is not a peaceful time in the Dells. The young King Nash clings to his throne while rebel lords in the north and south build armies to unseat him. The mountains and forests are filled with spies and thieves and lawless men.", "This is where Fire lives. With a wild, irresistible appearance and hair the color of flame, Fire is the last remaining human monster. Equally hated and adored, she had the unique ability to control minds, but she guards her power, unwilling to steal the secrets of innocent people. Especially when she has so many of her own.", "Then Prince Brigan comes to bring her to King City, The royal family needs her help to uncover the plot against the king. Far away from home, Fire begins to realize there's more to her power than she ever dreamed. Her power could save the kingdom.", "If only she weren't afraid of becoming the monster her father was."], "author": "Kristin Cashore", "num_pages": "480", "awards": ["Milwaukee County Teen Book Award Nominee (2011)", "Amelia Elizabeth Walden Award (2010)", "Cybils Award for Young Adult Fantasy & Science Fiction (2009)"], "places": [], "character_names": ["Brocker (Graceling Realm)", "Roen (Graceling Realm)", "Nash (Graceling Realm)", "Brigan (Graceling Realm)", "Leck (Graceling Realm)", "Garan (Graceling Realm)", "Archer (Graceling Realm)", "Fire (Graceling Realm)"], "language": "English", "publish_date": "2009-10-05 00:00:00", "ISBN": "0803734611"},
{"url": "https://www.goodreads.com/book/show/14250.Pigs_in_Heaven", "num_ratings": "49,517", "num_reviews": "1,898", "avg_ratings": 3.97, "genres": ["Fiction", "Contemporary", "Adult Fiction", "Literary Fiction"], "title": "Pigs in Heaven", "description": ["Mother and adopted daughter, Taylor and Turtle Greer, are back in this spellbinding sequel about family, heartbreak and love.", "Six-year-old Turtle Greer witnesses a freak accident at the Hoover Dam during a tour of the Grand Canyon with her guardian, Taylor. Her insistence on what she has seen, and her mother's belief in her, lead to a man's dramatic rescue. The mother and a", "Mother and adopted daughter, Taylor and Turtle Greer, are back in this spellbinding sequel about family, heartbreak and love.", "Six-year-old Turtle Greer witnesses a freak accident at the Hoover Dam during a tour of the Grand Canyon with her guardian, Taylor. Her insistence on what she has seen, and her mother's belief in her, lead to a man's dramatic rescue. The mother and adopted daughter duo soon become nationwide heroes - even landing themselves a guest appearance on the Oprah Winfrey show. But Turtle's moment of celebrity draws her into a conflict of historic proportions stemming right back to her Cherokee roots. The crisis quickly envelops not only Turtle and her guardian, but everyone else who touches their lives in a complex web connecting their future with their past.", "Embark on a unforgettable road trip from rural Kentucky and the urban Southwest to Heaven, Oklahoma, and the Cherokee Nation, testing the boundaries of family and the many separate truths about the ties that bind."], "author": "Barbara Kingsolver", "num_pages": "343", "awards": ["Los Angeles Times Book Prize for Fiction (1993)"], "places": [], "character_names": [], "language": "English", "publish_date": "1994-08-16 00:00:00", "ISBN": "0571171788"},
{"url": "https://www.goodreads.com/book/show/159604.Woman_at_Point_Zero", "num_ratings": "7,188", "num_reviews": "1,005", "avg_ratings": 3.99, "genres": ["Feminism", "Fiction", "Northern Africa", "Egypt", "Cultural", "Africa"], "title": "Woman at Point Zero", "description": ["From her prison cell, Firdaus, sentenced to die for having killed a pimp in a Cairo street, tells of her life from village childhood to city prostitute. Society's retribution for her act of defiance - death - she welcomes as the only way she can finally be free."], "author": "Nawal El-Saadawi", "num_pages": "112", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1997-09-15 00:00:00", "ISBN": "0862321107"},
{"url": "https://www.goodreads.com/book/show/15050.Sexing_the_Cherry", "num_ratings": "12,959", "num_reviews": "792", "avg_ratings": 3.83, "genres": ["Fiction", "Fantasy", "Magical Realism"], "title": "Sexing the Cherry", "description": ["In a fantastic world that is and is not seventeenth-century England, a baby is found floating in the Thames. The child, Jordan, is rescued by Dog Woman and grows up to travel the world like Gulliver, though he finds that the world’s most curious oddities come from his own mind. Winterson leads the reader from discussions on the nature of time to Jordan’s fascination with j", "In a fantastic world that is and is not seventeenth-century England, a baby is found floating in the Thames. The child, Jordan, is rescued by Dog Woman and grows up to travel the world like Gulliver, though he finds that the world’s most curious oddities come from his own mind. Winterson leads the reader from discussions on the nature of time to Jordan’s fascination with journeys concealed within other journeys, all with a dizzying speed that shoots the reader from epiphany to shimmering epiphany."], "author": "Jeanette Winterson", "num_pages": "167", "awards": [], "places": [], "character_names": ["Dog Woman"], "language": "English", "publish_date": "1998-08-10 00:00:00", "ISBN": "0802135781"},
{"url": "https://www.goodreads.com/book/show/41193.A_Thousand_Acres", "num_ratings": "52,268", "num_reviews": "2,443", "avg_ratings": 3.79, "genres": ["Fiction", "Literary Fiction", "Contemporary"], "title": "A Thousand Acres", "description": ["Aging Larry Cook announces his intention to turn over his 1,000-acre farm--one of the largest in Zebulon County, Iowa--to his three daughters, Caroline, Ginny, and Rose. A man of harsh sensibilities, he carves Caroline out of the deal because she has the nerve to be less than enthusiastic about her father's generosity. While Larry Cook deteriorates into a pathetic drunk, h", "Aging Larry Cook announces his intention to turn over his 1,000-acre farm--one of the largest in Zebulon County, Iowa--to his three daughters, Caroline, Ginny, and Rose. A man of harsh sensibilities, he carves Caroline out of the deal because she has the nerve to be less than enthusiastic about her father's generosity. While Larry Cook deteriorates into a pathetic drunk, his daughters are left to cope with the often grim realities of life on a family farm--from battering husbands to cutthroat lenders. In this winner of the 1992 Pulitzer Prize for Fiction, Smiley captures the essence of such a life with stark, painful detail."], "author": "Jane Smiley", "num_pages": "371", "awards": ["Pulitzer Prize for Fiction (1992)", "Ambassador Book Award for Fiction (1992)", "Chicago Tribune Heartland Prize for Fiction (1991)", "National Book Critics Circle Award for Fiction (1991)", "Society of Midland Authors Award for Fiction (1992)"], "places": ["United States of America", "Iowa"], "character_names": [], "language": "English", "publish_date": "2003-12-02 00:00:00", "ISBN": "1400033837"},
{"url": "https://www.goodreads.com/book/show/47122.Lady_Oracle", "num_ratings": "10,024", "num_reviews": "551", "avg_ratings": 3.67, "genres": ["Fiction", "Cultural", "Canada", "Contemporary", "Literary Fiction"], "title": "Lady Oracle", "description": ["Joan Foster is the bored wife of a myopic ban-the-bomber.  She takes off overnight as Canada's new superpoet, pens lurid gothics on the sly, attracts a blackmailing reporter, skids cheerfully in and out of menacing plots, hair-raising traps, and passionate trysts, and lands dead and well in Terremoto, Italy.  In this remarkable, poetic, and magical novel, Margaret Atwood p", "Joan Foster is the bored wife of a myopic ban-the-bomber.  She takes off overnight as Canada's new superpoet, pens lurid gothics on the sly, attracts a blackmailing reporter, skids cheerfully in and out of menacing plots, hair-raising traps, and passionate trysts, and lands dead and well in Terremoto, Italy.  In this remarkable, poetic, and magical novel, Margaret Atwood proves yet again why she is considered to be one of the most important and accomplished writers of our time."], "author": "Margaret Atwood", "num_pages": "346", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-04-13 00:00:00", "ISBN": "0385491085"},
{"url": "https://www.goodreads.com/book/show/752900.Medea", "num_ratings": "46,594", "num_reviews": "1,256", "avg_ratings": 3.84, "genres": ["Classics", "Plays", "Drama", "Fiction", "Fantasy", "Mythology", "Plays", "Theatre"], "title": "Medea", "description": ["One of the most powerful and enduring of Greek tragedies, Medea centers on the myth of Jason, leader of the Argonauts, who has won the dragon-guarded treasure of the Golden Fleece with the help of the sorceress Medea. Having married Medea and fathered her two children, Jason abandons her for a more favorable match, never suspecting the terrible revenge she will take. ", "Eurip", "One of the most powerful and enduring of Greek tragedies, Medea centers on the myth of Jason, leader of the Argonauts, who has won the dragon-guarded treasure of the Golden Fleece with the help of the sorceress Medea. Having married Medea and fathered her two children, Jason abandons her for a more favorable match, never suspecting the terrible revenge she will take. ", "Euripides' masterly portrayal of the motives fiercely driving Medea's pursuit of vengeance for her husband's insult and betrayal has held theater audiences spellbound for more than twenty centuries. Rex Warner's authoritative translation brings this great classic of world literature vividly to life.", "Reprint of the John Lane, The Bodley Head Limited, London, 1944 edition."], "author": "Euripides", "num_pages": "59", "awards": [], "places": ["Corinth"], "character_names": ["Jason (Argonaut)", "Medea of Colchis", "Aegeus", "Nurse", "Tutor (to Medea's sons)", "Creon"], "language": "English", "publish_date": "1993-04-19 00:00:00", "ISBN": "0486275485"},
{"url": "https://www.goodreads.com/book/show/6457081-remarkable-creatures", "num_ratings": "36,403", "num_reviews": "4,068", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "European Literature", "British Literature", "Literature", "19th Century"], "title": "Remarkable Creatures", "description": ["In 1810, a sister and brother uncover the fossilized skull of an unknown animal in the cliffs on the south coast of England. With its long snout and prominent teeth, it might be a crocodile – except that it has a huge, bulbous eye.", " is the story of Mary Anning, who has a talent for finding fossils, and whose discovery of ancient marine reptiles such as t", "In 1810, a sister and brother uncover the fossilized skull of an unknown animal in the cliffs on the south coast of England. With its long snout and prominent teeth, it might be a crocodile – except that it has a huge, bulbous eye.", " is the story of Mary Anning, who has a talent for finding fossils, and whose discovery of ancient marine reptiles such as that ichthyosaur shakes the scientific community and leads to new ways of thinking about the creation of the world.", "Working in an arena dominated by middle-class men, however, Mary finds herself out of step with her working-class background. In danger of being an outcast in her community, she takes solace in an unlikely friendship with Elizabeth Philpot, a prickly London spinster with her own passion for fossils.", "The strong bond between Mary and Elizabeth sees them through struggles with poverty, rivalry and ostracism, as well as the physical dangers of their chosen obsession. It reminds us that friendship can outlast storms and landslides, anger and jealousy."], "author": "Tracy Chevalier", "num_pages": "352", "awards": [], "places": ["Lyme Regis, England"], "character_names": ["Mary Anning", "Elizabeth Philpot", "William Buckland", "Captain Birch", "Cuvier"], "language": "English", "publish_date": "2009-08-24 00:00:00", "ISBN": "0007178379"},
{"url": "https://www.goodreads.com/book/show/5168.Where_the_Heart_Is", "num_ratings": "218,260", "num_reviews": "3,367", "avg_ratings": 4.01, "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Romance", "Contemporary", "Adult Fiction"], "title": "Where the Heart Is", "description": ["Talk about unlucky sevens. An hour ago, seventeen-year-old, seven months pregnant Novalee Nation was heading for California with her boyfriend. Now she finds herself stranded at a Wal-Mart in Sequoyah, Oklahoma, with just $7.77 in change. But Novalee is about to discover hidden treasures in this small Southwest town--a group of down-to-earth, deeply caring people willing t", "Talk about unlucky sevens. An hour ago, seventeen-year-old, seven months pregnant Novalee Nation was heading for California with her boyfriend. Now she finds herself stranded at a Wal-Mart in Sequoyah, Oklahoma, with just $7.77 in change. But Novalee is about to discover hidden treasures in this small Southwest town--a group of down-to-earth, deeply caring people willing to help a homeless, jobless girl living secretly in a Wal-Mart. From Bible-thumping blue-haired Sister Thelma Husband to eccentric librarian Forney Hull who loves Novalee more than she loves herself, they are about to take her--and you, too--on a moving, funny, and unforgettable journey to . . . Where the Heart Is."], "author": "Billie Letts", "num_pages": "376", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-06-01 00:00:00", "ISBN": "0446672211"},
{"url": "https://www.goodreads.com/book/show/47401.Chocolat", "num_ratings": "98,767", "num_reviews": "3,737", "avg_ratings": 3.95, "genres": ["Fiction", "Romance", "Magical Realism", "Cultural", "France", "Fantasy"], "title": "Chocolat", "description": ["A timeless novel of a straitlaced village's awakening to joy and sensuality - every page offers a description of chocolate to melt in the mouths of chocoholics, francophiles, armchair gourmets, cookbook readers, and lovers of passion everywhere.", "Illuminating Peter Mayle's South of France with a touch of Laura Esquivel's magic realism, Chocolat is a timeless novel of a strai", "A timeless novel of a straitlaced village's awakening to joy and sensuality - every page offers a description of chocolate to melt in the mouths of chocoholics, francophiles, armchair gourmets, cookbook readers, and lovers of passion everywhere.", "Illuminating Peter Mayle's South of France with a touch of Laura Esquivel's magic realism, Chocolat is a timeless novel of a straitlaced village's awakening to joy and sensuality. In tiny Lansquenet, where nothing much has changed in a hundred years, beautiful newcomer Vianne Rocher and her exquisite chocolate shop arrive and instantly begin to play havoc with Lenten vows. Each box of luscious bonbons comes with a free gift: Vianne's uncanny perception of its buyer's private discontents and a clever, caring cure for them. Is she a witch? Soon the parish no longer cares, as it abandons itself to temptation, happiness, and a dramatic face-off between Easter solemnity and the pagan gaiety of a chocolate festival. ", "Chocolat's every page offers a description of chocolate to melt in the mouths of chocoholics, francophiles, armchair gourmets, cookbook readers, and lovers of passion everywhere. It's a must for anyone who craves an escapist read, and is a bewitching gift for any holiday."], "author": "Joanne Harris", "num_pages": "306", "awards": [], "places": ["Lansquenet-sous-Tannes", "France"], "character_names": ["Caro Clairmont", "Josephine Bonnet", "Anouk Rocher", "Vianne Rocher", "Roux", "Francis Reynaud", "Armande Voizin", "Paul-Marie Muscat", "Luc Clairmont", "Guillaume Duplessis"], "language": "English", "publish_date": "2000-11-01 00:00:00", "ISBN": "014100018X"},
{"url": "https://www.goodreads.com/book/show/18749.Half_of_a_Yellow_Sun", "num_ratings": "69,512", "num_reviews": "6,171", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21", "Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed. ", "With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another. ", "Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had."], "author": "Chimamanda Ngozi Adichie", "num_pages": "433", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "1400044162"},
{"url": "https://www.goodreads.com/book/show/9464733-beauty-queens", "num_ratings": "44,987", "num_reviews": "7,071", "avg_ratings": 3.61, "genres": ["Young Adult", "Humor", "Contemporary", "Fiction", "Lgbt"], "title": "Beauty Queens", "description": ["When a plane crash strands thirteen teen beauty contestants on a mysterious island, they struggle to survive, to get along with one another, to combat the island's other diabolical occupants, and to learn their dance numbers in case they are rescued in time for the competition."], "author": "Libba Bray", "num_pages": "396", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Young Adult Novel (2011)", "Audie Award for Narration by the Author or Authors (2012)", "Los Angeles Times Book Prize Nominee for Young Adult Literature (2011)", "Milwaukee County Teen Book Award Nominee (2012)", "James Tiptree Jr. Award Honor List (2011)"], "places": ["an island in the middle of nowhere"], "character_names": ["Taylor (Miss Texas)", "Adina (Miss New Hampshire)"], "language": "English", "publish_date": "2011-05-24 00:00:00", "ISBN": "0439895979"},
{"url": "https://www.goodreads.com/book/show/15047.The_Passion", "num_ratings": "16,210", "num_reviews": "1,148", "avg_ratings": 4.11, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Lgbt", "Glbt", "Queer", "Historical"], "title": "The Passion", "description": ["Jeanette Winterson’s novels have established her as one of the most important young writers in world literature. ", " is perhaps her most highly acclaimed work, a modern classic that confirms her special claim on the novel. Set during the tumultuous years of the Napoleonic Wars, ", " intertwines the destinies of two remarkable people: Henri, a simple French s", "Jeanette Winterson’s novels have established her as one of the most important young writers in world literature. ", " is perhaps her most highly acclaimed work, a modern classic that confirms her special claim on the novel. Set during the tumultuous years of the Napoleonic Wars, ", " intertwines the destinies of two remarkable people: Henri, a simple French soldier, who follows Napoleon from glory to Russian ruin; and Villanelle, the red-haired, web-footed daughter of a Venetian boatman, whose husband has gambled away her heart. In Venice’s compound of carnival, chance, and darkness, the pair meet their singular destiny.", "In her unique and mesmerizing voice, Winterson blends reality with fantasy, dream, and imagination to weave a hypnotic tale with stunning effects."], "author": "Jeanette Winterson", "num_pages": "176", "awards": ["John Llewellyn Rhys Prize (1987)", "Commonwealth Writers' Prize Nominee for Best Book in  South Asia and Europe (1988)"], "places": ["Venice"], "character_names": [], "language": "English", "publish_date": "1997-08-07 00:00:00", "ISBN": "0802135226"},
{"url": "https://www.goodreads.com/book/show/219879.The_Piano_Teacher", "num_ratings": "7,285", "num_reviews": "703", "avg_ratings": 3.54, "genres": ["Fiction", "Nobel Prize", "European Literature", "German Literature"], "title": "The Piano Teacher", "description": [" the most famous novel of Elfriede Jelinek, who was awarded the 2004 Nobel Prize in Literature, is a shocking, searing, aching portrait of a woman bound between a repressive society and her darkest desires.", "Erika Kohut is a piano teacher at the prestigious and formal Vienna Conservatory, who still lives with her domineering and possessive mother. Her life", " the most famous novel of Elfriede Jelinek, who was awarded the 2004 Nobel Prize in Literature, is a shocking, searing, aching portrait of a woman bound between a repressive society and her darkest desires.", "Erika Kohut is a piano teacher at the prestigious and formal Vienna Conservatory, who still lives with her domineering and possessive mother. Her life appears to be a seamless tissue of boredom, but Erika, a quiet thirty-eight-year-old, secretly visits Turkish peep shows at night to watch live sex shows and sadomasochistic films. Meanwhile, a handsome, self-absorbed, seventeen-year-old student has become enamored with Erika and sets out to seduce her. She resists him at first, but then the dark passions roiling under the piano teacher's subdued exterior explode in a release of sexual perversity, suppressed violence, and human degradation.", "Celebrated throughout Europe for the intensity and frankness of her writings and awarded the Heinrich Böll Prize for her outstanding contribution to German letters, Elfriede Jelinek is one of the most original and controversial writers in the world today. ", " was made into a film, released in the United States in 2001, was awarded the Grand Jury Prize at Cannes."], "author": "Elfriede Jelinek", "num_pages": "288", "awards": [], "places": ["Vienna"], "character_names": ["Erika Kohut", "Walter Klemmer"], "language": "English", "publish_date": "2004-11-30 00:00:00", "ISBN": "0802118062"},
{"url": "https://www.goodreads.com/book/show/233818.Island_of_the_Blue_Dolphins", "num_ratings": "258,053", "num_reviews": "7,260", "avg_ratings": 3.81, "genres": ["Young Adult", "Fiction", "Historical", "Historical Fiction", "Classics", "Childrens"], "title": "Island of the Blue Dolphins", "description": ["An alternate cover edition can be found ", "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.", "This is the story of Karana, the Indian girl", "An alternate cover edition can be found ", "In the Pacific there is an island that looks like a big fish sunning itself in the sea. Around it, blue dolphins swim, otters play, and sea elephants and sea birds abound. Once, Indians also lived on the island. And when they left and sailed to the east, one young girl was left behind.", "This is the story of Karana, the Indian girl who lived alone for years on the Island of the Blue Dolphins. Year after year, she watched one season pass into another and waited for a ship to take her away. But while she waited, she kept herself alive by building shelter, making weapons, finding food, and fighting her enemies, the wild dogs. It is not only an unusual adventure of survival, but also a tale of natural beauty and personal discovery."], "author": "Scott O'Dell", "num_pages": "184", "awards": ["Newbery Medal (1961)", "Lewis Carroll Shelf Award (1961)", "Nene Award (1964)", "Dorothy Canfield Fisher Children's Book Award Nominee (1962)", "Deutscher Jugendliteraturpreis for Jugendbuch (1963)"], "places": ["Island of the Blue Dolphins", "California"], "character_names": ["Karana"], "language": "English", "publish_date": "1987-02-01 00:00:00", "ISBN": "0440439884"},
{"url": "https://www.goodreads.com/book/show/312435.So_Far_from_God", "num_ratings": "2,967", "num_reviews": "212", "avg_ratings": 3.88, "genres": ["Fiction", "Magical Realism", "Fantasy", "Contemporary", "Novels", "Feminism", "Literature"], "title": "So Far from God", "description": ["Sofia and her fated daughters, Fe, Esperanza, Caridad, and la Loca, endure hardship and enjoy love in the sleepy New Mexico hamlet of Tome, a town teeming with marvels where the comic and the horrific, the real and the supernatural, reside."], "author": "Ana Castillo", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-17 00:00:00", "ISBN": "0393326934"},
{"url": "https://www.goodreads.com/book/show/1629601.The_Disreputable_History_of_Frankie_Landau_Banks", "num_ratings": "41,739", "num_reviews": "5,026", "avg_ratings": 3.82, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction", "Young Adult", "Teen"], "title": "The Disreputable History of Frankie Landau-Banks", "description": ["Frankie Landau-Banks at age 14: Debate Club. Her father's \"bunny rabbit.\" A mildly geeky girl attending a highly competitive boarding school. ", "Frankie Landau-Banks at age 15: A knockout figure. A sharp tongue. A chip on her shoulder. And a gorgeous new senior boyfriend: the supremely goofy, word-obsessed Matthew Livingston. ", "Frankie Landau-Banks, at age 16: No longer the kin", "Frankie Landau-Banks at age 14: Debate Club. Her father's \"bunny rabbit.\" A mildly geeky girl attending a highly competitive boarding school. ", "Frankie Landau-Banks at age 15: A knockout figure. A sharp tongue. A chip on her shoulder. And a gorgeous new senior boyfriend: the supremely goofy, word-obsessed Matthew Livingston. ", "Frankie Landau-Banks, at age 16: No longer the kind of girl to take \"no\" for an answer and possibly a criminal mastermind. This is the story of how she got that way.", "Frankie Landau-Banks. No longer the kind of girl to take \"no\" for an answer. Especially when \"no\" means she's excluded from her boyfriend's all-male secret society. Not when her ex-boyfriend shows up in the strangest of places. Not when she knows she's smarter than any of them. When she knows Matthew's lying to her. And when there are so many, many pranks to be done. ", "Frankie Landau-Banks, at age 16: Possibly a criminal mastermind. ", "This is the story of how she got that way."], "author": "E. Lockhart", "num_pages": "345", "awards": ["Michael L. Printz Award Nominee (2009)", "South Carolina Book Award Nominee for Young Adult Book Award (2011)", "Florida Teens Read Nominee (2009)", "Iowa Teen Award Nominee (2011)", "Lincoln Award Nominee (2011)", "Cybils Award for Young Adult Fiction (2008)", "National Book Award Finalist for Young People's Literature (2008)", "Missouri Gateway Readers Award Nominee (2011)"], "places": ["Massachusetts"], "character_names": ["Frankie Landau-Banks", "Matthew Livingston"], "language": "English", "publish_date": "2008-03-25 00:00:00", "ISBN": "0786838183"},
{"url": "https://www.goodreads.com/book/show/13928.Daughter_of_the_Forest", "num_ratings": "47,029", "num_reviews": "3,525", "avg_ratings": 4.28, "genres": ["Fantasy", "Romance", "Fiction", "Historical", "Historical Fiction", "Fantasy", "Fairy Tales", "Young Adult"], "title": "Daughter of the Forest", "description": ["Lovely Sorcha is the seventh child and only daughter of Lord Colum of Sevenwaters. Bereft of a mother, she is comforted by her six brothers who love and protect her. Sorcha is the light in their lives, they are determined that she know only contentment.", "But Sorcha's joy is shattered when her father is bewitched by his new wife, an evil enchantress who binds her brothers wit", "Lovely Sorcha is the seventh child and only daughter of Lord Colum of Sevenwaters. Bereft of a mother, she is comforted by her six brothers who love and protect her. Sorcha is the light in their lives, they are determined that she know only contentment.", "But Sorcha's joy is shattered when her father is bewitched by his new wife, an evil enchantress who binds her brothers with a terrible spell, a spell which only Sorcha can lift-by staying silent. If she speaks before she completes the quest set to her by the Fair Folk and their queen, the Lady of the Forest, she will lose her brothers forever. ", "When Sorcha is kidnapped by the enemies of Sevenwaters and taken to a foreign land, she is torn between the desire to save her beloved brothers, and a love that comes only once. Sorcha despairs at ever being able to complete her task, but the magic of the Fair Folk knows no boundaries, and love is the strongest magic of them all..."], "author": "Juliet Marillier", "num_pages": "554", "awards": ["ALA Alex Award (2001)", "Prix Imaginales for Roman étranger (2010)"], "places": [], "character_names": ["Simon Holt", "Lord Colum", "Hugh of Harrowfield", "Liam the God", "Lady Anne", "Sorcha", "Finbar", "Diarmid", "Padriac", "Margery", "Fat Janis", "Cormack", "Father Brian", "Seamus Redbeard", "Lady Oonagh", "Eilis", "Richard of Northwoods", "Benedict of Greystones", "John   --"], "language": "English", "publish_date": "2002-02-18 00:00:00", "ISBN": "0765343436"},
{"url": "https://www.goodreads.com/book/show/32049.Lady_Chatterley_s_Lover", "num_ratings": "83,799", "num_reviews": "4,147", "avg_ratings": 3.5, "genres": ["Classics", "Fiction", "Romance", "Literature"], "title": "Lady Chatterley's Lover", "description": ["Lawrence's frank portrayal of an extramarital affair and the explicit sexual explorations of the central characters caused this controversial book, now considered a masterpiece, to be banned as pornography until 1960."], "author": "D.H. Lawrence", "num_pages": "376", "awards": [], "places": ["Venice", "Nottinghamshire, England"], "character_names": ["Constance Chatterley", "Oliver Mellors", "Clifford Chatterley", "Mrs. Bolton"], "language": "English", "publish_date": "1983-06-12 00:00:00", "ISBN": "039460430X"},
{"url": "https://www.goodreads.com/book/show/531509.Herland", "num_ratings": "11,182", "num_reviews": "1,089", "avg_ratings": 3.48, "genres": ["Fiction", "Feminism", "Classics", "Science Fiction", "Fantasy"], "title": "Herland", "description": ["An all-female society is discovered somewhere in the distant reaches of the earth by three male explorers who are now forced to re-examine their assumptions about women's roles in society."], "author": "Charlotte Perkins Gilman", "num_pages": "147", "awards": ["Tähtivaeltaja Award Nominee (2010)"], "places": ["Herland"], "character_names": ["Vandyck Jennings", "Jeff Margrave", "Terry O. Nicholson", "Ellador", "Celis", "Alima"], "language": "English", "publish_date": "1979-02-12 00:00:00", "ISBN": "0394736656"},
{"url": "https://www.goodreads.com/book/show/22749796-dietland", "num_ratings": "13,646", "num_reviews": "2,422", "avg_ratings": 3.54, "genres": ["Fiction", "Feminism", "Womens Fiction", "Chick Lit", "Contemporary", "Adult Fiction"], "title": "Dietland", "description": [" Plum Kettle does her best not to be noticed, because when you’re fat, to be noticed is to be judged. Or mocked. Or worse. With her job answering fan mail for a popular teen girls’ magazine, she is biding her time until her weight-loss surgery. Only then can her true life as a thin person finally begin.", " Then, when a mysterious wo", " Plum Kettle does her best not to be noticed, because when you’re fat, to be noticed is to be judged. Or mocked. Or worse. With her job answering fan mail for a popular teen girls’ magazine, she is biding her time until her weight-loss surgery. Only then can her true life as a thin person finally begin.", " Then, when a mysterious woman starts following her, Plum finds herself falling down a rabbit hole and into an underground community of women who live life on their own terms. There Plum agrees to a series of challenges that force her to deal with her past, her doubts, and the real costs of becoming “beautiful.” At the same time, a dangerous guerrilla group called “Jennifer” begins to terrorize a world that mistreats women, and as Plum grapples with her personal struggles, she becomes entangled in a sinister plot. The consequences are explosive.", "is a bold, original, and funny debut novel that takes on the beauty industry, gender inequality, and our weight loss obsession—from the inside out, and with fists flying."], "author": "Sarai Walker", "num_pages": "320", "awards": ["Goodreads Choice Award Nominee for Debut Goodreads Author (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-26 00:00:00", "ISBN": "054437343X"},
{"url": "https://www.goodreads.com/book/show/662.Atlas_Shrugged", "num_ratings": "318,234", "num_reviews": "15,560", "avg_ratings": 3.68, "genres": ["Fiction", "Classics", "Philosophy", "Literature", "Politics"], "title": "Atlas Shrugged", "description": ["Why did he have to fight his battle, not against his enemies, but against those who needed him most, and his hardest battle against the woman he loved? What is the world’s motor — and the motive power of every man? You will know the answer", "Why did he have to fight his battle, not against his enemies, but against those who needed him most, and his hardest battle against the woman he loved? What is the world’s motor — and the motive power of every man? You will know the answer to these questions when you discover the reason behind the baffling events that play havoc with the lives of the characters in this story. ", "Tremendous in its scope, this novel presents an astounding panorama of human life — from the productive genius who becomes a worthless playboy — to the great steel industrialist who does not know that he is working for his own destruction — to the philosopher who becomes a pirate — to the composer who gives up his career on the night of his triumph — to the woman who runs a transcontinental railroad — to the lowest track worker in her Terminal tunnels. ", "This is a mystery story, not about the murder — and rebirth — of man’s spirit. It is a philosophical revolution, told in the form of an action thriller of violent events, a ruthlessly brilliant plot structure and an irresistible suspense. Do you say this is impossible? Well, ", " is the first of your premises to check."], "author": "Ayn Rand", "num_pages": "1168", "awards": ["Prometheus Hall of Fame Award (1983)", "National Book Award Finalist for Fiction (1958)"], "places": [], "character_names": ["Prometheus (mythology)", "Atlas", "Dagny Taggart", "John Galt", "Hank Rearden", "Francisco d'Anconia", "James Taggart"], "language": "English", "publish_date": "1999-08-01 00:00:00", "ISBN": "0452011876"},
{"url": "https://www.goodreads.com/book/show/60926.Lilith_s_Brood", "num_ratings": "11,394", "num_reviews": "844", "avg_ratings": 4.32, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Lilith's Brood", "description": ["Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny", "Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny, unimaginably alien creatures: their own children. This is their story..."], "author": "Octavia E. Butler", "num_pages": "746", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-01 00:00:00", "ISBN": "0446676101"},
{"url": "https://www.goodreads.com/book/show/1885.Pride_and_Prejudice", "num_ratings": "2,417,846", "num_reviews": "53,623", "avg_ratings": 4.25, "genres": ["Classics", "Fiction", "Romance", "Historical", "Historical Fiction", "Literature", "Historical", "Novels", "Romance", "Historical Romance", "Classics", "Classic Literature", "Adult"], "title": "Pride and Prejudice", "description": ["'It is a truth universally acknowledged, that a single man in possession of a good fortune must be in want of a wife.' Thus memorably begins ", "'s ", ", one of the world's most popular novels. ", "--Austen's own 'darling child'--tells the story of fiercely independent Elizabeth Bennett, one of five sisters who must marry rich, as she c", "'It is a truth universally acknowledged, that a single man in possession of a good fortune must be in want of a wife.' Thus memorably begins ", "'s ", ", one of the world's most popular novels. ", "--Austen's own 'darling child'--tells the story of fiercely independent Elizabeth Bennett, one of five sisters who must marry rich, as she confounds the arrogant, wealthy Mr. Darcy. What ensues is one of the most delightful and engrossingly readable courtships known to literature, written by a precocious Austen when she was just twenty-one years old.", "Humorous and profound, and filled with highly entertaining dialogue, this witty comedy of manners dips and turns through drawing-rooms and plots to reach an immensely satisfying finale."], "author": "Jane Austen", "num_pages": "279", "awards": [], "places": ["England", "Hertfordshire, England", "Derbyshire, England"], "character_names": ["Mr. Bennet", "Mrs. Bennet", "Jane Bennet", "Elizabeth Bennet", "Mary Bennet", "Kitty Bennet", "Lydia Bennet", "Louisa Hurst", "Caroline Bingley", "Fitzwilliam Darcy", "Georgiana Darcy", "Lady Catherine de Bourgh", "Anne de Bourgh", "Colonel Fitzwilliam", "Mr. Gardiner", "Mrs. Gardiner", "Sir William Lucas", "Lady Lucas", "Charlotte Lucas", "Maria Lucas", "Mr. Darcy", "Charles Bingley", "George Wickham", "Mr. William Collins"], "language": "English", "publish_date": "2000-10-10 00:00:00", "ISBN": "0679783261"},
{"url": "https://www.goodreads.com/book/show/7767021-who-fears-death", "num_ratings": "11,143", "num_reviews": "1,730", "avg_ratings": 3.96, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia", "Cultural", "Africa"], "title": "Who Fears Death", "description": [" In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, sh", " In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, she manages to escape, wandering farther into the desert. She gives birth to a baby girl with hair and skin the color of sand and instinctively knows that her daughter is different. She names her daughter Onyesonwu, which means \"Who Fears Death?\" in an ancient African tongue.", " Reared under the tutelage of a mysterious and traditional shaman, Onyesonwu discovers her magical destiny – to end the genocide of her people. The journey to fulfill her destiny will force her to grapple with nature, tradition, history, true love, the spiritual mysteries of her culture – and eventually death itself."], "author": "Nnedi Okorafor", "num_pages": "386", "awards": ["Nebula Award Nominee for Best Novel (2010)", "Locus Award Nominee for Best Fantasy Novel (2011)", "World Fantasy Award for Best Novel (2011)", "Grand Prix de l'Imaginaire Nominee for Roman étranger (2014)", "Prix Imaginales for Roman étranger (2014)", "Goodreads Choice Award Nominee for Fantasy (2010)", "James Tiptree Jr. Award Honor List (2010)"], "places": [], "character_names": ["Onyesonwu Ubaid-Ogundimu", "Mwita", "Najeeba", "Aro (Who Fears Death series)", "Luyu", "Binta", "Diti", "Fanasi", "Daib"], "language": "English", "publish_date": "2010-06-01 00:00:00", "ISBN": "075640617X"},
{"url": "https://www.goodreads.com/book/show/887089.Free_to_Be_You_and_Me", "num_ratings": "712", "num_reviews": "69", "avg_ratings": 4.4, "genres": ["Childrens", "Poetry", "Childrens", "Picture Books"], "title": "Free to Be...You and Me (The Original Classic Edition)", "description": ["-brought to new life with brand new illustrations to captivate and inspire a new generation of readers on a journey of the heart. Whether you are opening ", " for the first time or the one hundredth time you will be engaged and transformed by this newly beautifully illustrated compi", "-brought to new life with brand new illustrations to captivate and inspire a new generation of readers on a journey of the heart. Whether you are opening ", " for the first time or the one hundredth time you will be engaged and transformed by this newly beautifully illustrated compilation of inspirational stories, songs, and poems. The sentiments of thirty-five years ago are as relevant today as when this book was published. Celebrating individuality and challenging stereotypes empowers both children and adults with the freedom to be who they want to be and to have compassion and empathy for others who may be different. Working closely with Marlo and co-creator Carole Hart, Peter H. Reynolds, the ", " Best Selling Children's Book Author/Illustrator, conjured his whimsical drawings throughout the book bringing a new sense of unity and warmth to the pages. You will find yourself ", " at the illustrations, nodding in agreement with the stories and poems, and ", " the words to all the classic songs! It is wonderful that the thoughts, ideas, and emotions the creators envisioned so many years ago can still have a magical effect on children today."], "author": "Marlo Thomas", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-11 00:00:00", "ISBN": "0762413069"},
{"url": "https://www.goodreads.com/book/show/452306.The_Sisterhood_of_the_Traveling_Pants", "num_ratings": "566,280", "num_reviews": "6,802", "avg_ratings": 3.77, "genres": ["Young Adult", "Fiction", "Womens Fiction", "Chick Lit", "Contemporary"], "title": "The Sisterhood of the Traveling Pants", "description": ["Carmen got the jeans at a thrift shop. They didn’t look all that great: they were worn, dirty, and speckled with bleach. On the night before she and her friends part for the summer, Carmen decides to toss them. ", "But Tibby says they’re great. She'd love to have them. Lena and Bridget also think they’re fabulous. Lena decides that they should all try them on. Whoever they fit", "Carmen got the jeans at a thrift shop. They didn’t look all that great: they were worn, dirty, and speckled with bleach. On the night before she and her friends part for the summer, Carmen decides to toss them. ", "But Tibby says they’re great. She'd love to have them. Lena and Bridget also think they’re fabulous. Lena decides that they should all try them on. Whoever they fit best will get them. ", "Nobody knows why, but the pants fit everyone perfectly. Even Carmen (who never thinks she looks good in anything) thinks she looks good in the pants. Over a few bags of cheese puffs, they decide to form a sisterhood and take the vow of the Sisterhood of the Traveling Pants . . . the next morning, they say good-bye. ", "And then the journey of the pants — and the most memorable summer of their lives — begins."], "author": "Ann Brashares", "num_pages": "294", "awards": ["Book Sense Book of the Year Award for Children's Literature (2002)", "South Carolina Book Award Nominee for Young Adult Book Award (2004)", "Maryland Black-Eyed Susan Book Award for High School (2003)", "Evergreen Teen Book Award (2004)", "Pacific Northwest Library Association Young Reader's Choice Award for Senior (2004)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2003)", "Iowa Teen Award (2004)", "Lincoln Award Nominee (2007)", "Missouri Gateway Readers Award (2004)", "Oklahoma Sequoyah Award for YA (2004)"], "places": ["Santorini", "Maryland", "South Carolina", "Baja"], "character_names": ["Bridget Vreeland", "Tibby Rollins", "Carmen Lowell", "Lena Kaligaris"], "language": "English", "publish_date": "2001-09-11 00:00:00", "ISBN": "0385729332"},
{"url": "https://www.goodreads.com/book/show/3189884-the-essential-dykes-to-watch-out-for", "num_ratings": "7,964", "num_reviews": "497", "avg_ratings": 4.36, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Lgbt", "Glbt", "Queer", "Fiction"], "title": "The Essential Dykes to Watch Out For", "description": ["From the author of Fun Home -- the lives, loves, and politics of cult fav characters Mo, Lois, Sydney, Sparrow, Ginger, Stuart, Clarice, and others", "For twenty-five years Bechdel’s path-breaking Dykes to Watch Out For strip has been collected in award-winning volumes (with a quarter of a million copies in print), syndicated in fifty alternative newspapers, and translated int", "From the author of Fun Home -- the lives, loves, and politics of cult fav characters Mo, Lois, Sydney, Sparrow, Ginger, Stuart, Clarice, and others", "For twenty-five years Bechdel’s path-breaking Dykes to Watch Out For strip has been collected in award-winning volumes (with a quarter of a million copies in print), syndicated in fifty alternative newspapers, and translated into many languages. Now, at last, The Essential Dykes to Watch Out For gathers a “rich, funny, deep and impossible to put down” (Publishers Weekly) selection from all eleven Dykes volumes. Here too are sixty of the newest strips, never before published in book form.", "Settle in to this wittily illustrated soap opera (Bechdel calls it “half op-ed column and half endless serialized Victorian novel”) of the lives, loves, and politics of a cast of characters, most of them lesbian, living in a midsize American city that may or may not be Minneapolis.", "Her brilliantly imagined countercultural band of friends -- academics, social workers, bookstore clerks -- fall in and out of love, negotiate friendships, raise children, switch careers, and cope with aging parents.", "Bechdel fuses high and low culture -- from foreign policy to domestic routine, hot sex to postmodern theory -- in a serial graphic narrative “suitable for humanists of all persuasions.”"], "author": "Alison Bechdel", "num_pages": "392", "awards": ["Ferro-Grumley Award for LGBT Fiction (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-11-12 00:00:00", "ISBN": "0618968806"},
{"url": "https://www.goodreads.com/book/show/17150.My_ntonia", "num_ratings": "107,726", "num_reviews": "6,375", "avg_ratings": 3.77, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "My Ántonia", "description": ["Through Jim Burden's endearing, smitten voice, we revisit the remarkable vicissitudes of immigrant life in the Nebraska heartland, with all its insistent bonds. Guiding the way are some of literature's most beguiling characters: the Russian brothers plagued by memories of a fateful sleigh ride, Antonia's desperately homesick father and self-indulgent mother, and the coy Le", "Through Jim Burden's endearing, smitten voice, we revisit the remarkable vicissitudes of immigrant life in the Nebraska heartland, with all its insistent bonds. Guiding the way are some of literature's most beguiling characters: the Russian brothers plagued by memories of a fateful sleigh ride, Antonia's desperately homesick father and self-indulgent mother, and the coy Lena Lingard. Holding the pastoral society's heart, of course, is the bewitching, free-spirited Antonia."], "author": "Willa Cather", "num_pages": "232", "awards": [], "places": ["Nebraska"], "character_names": ["Ántonia Shimerda", "Jim Burden", "Josiah Burden", "Emmaline Burden", "Ambrosch Shimerda", "Lena Lingard", "Otto Fuchs", "Jake Marpole", "Mr. Shimerda", "Mrs. Shimerda"], "language": "English", "publish_date": "2000-02-20 00:00:00", "ISBN": "1583485090"},
{"url": "https://www.goodreads.com/book/show/10920.Cold_Mountain", "num_ratings": "201,078", "num_reviews": "5,160", "avg_ratings": 3.84, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance", "Military History", "Civil War"], "title": "Cold Mountain", "description": [" is a novel about a soldier’s perilous journey back to his beloved near the Civil War's end. At once a love story & a harrowing account of one man’s long walk home, Cold Mountain introduces a new talent in American literature.", "Based on local history & family stories passed down by Frazier’s great-great-grandfather, ", " is the tale of a wounded", " is a novel about a soldier’s perilous journey back to his beloved near the Civil War's end. At once a love story & a harrowing account of one man’s long walk home, Cold Mountain introduces a new talent in American literature.", "Based on local history & family stories passed down by Frazier’s great-great-grandfather, ", " is the tale of a wounded Confederate soldier, Inman, who walks away from the ravages of the war & back home to his prewar sweetheart, Ada. His odyssey thru the devastated landscape of the soon-to-be-defeated South interweaves with Ada’s struggle to revive her father’s farm, with the help of an intrepid young drifter named Ruby. As their long-separated lives begin to converge at the close of the war, Inman & Ada confront the vastly transformed world they’ve been delivered.", "Frazier reveals insight into human relations with the land & the dangers of solitude. He also shares with the great 19th century novelists a keen observation of a society undergoing change. ", " recreates a world gone by that speaks to our time."], "author": "Charles Frazier", "num_pages": "356", "awards": ["National Book Award for Fiction (1997)", "American Booksellers Book Of The Year  Award for Adult Trade (1998)", "Exclusive Books Boeke Prize (1998)", "Sue Kaufman Prize for First Fiction (1998)", "Chicago Tribune Heartland Prize for Fiction (1997)", "National Book Critics Circle Award Nominee for Fiction (1997)", "Weatherford Award (1997)", "Lillian Smith Book Award (1997)"], "places": ["United States of America", "North Carolina", "Virginia"], "character_names": [], "language": "English", "publish_date": "2006-09-01 00:00:00", "ISBN": "0802142842"},
{"url": "https://www.goodreads.com/book/show/60925.Fledgling", "num_ratings": "15,020", "num_reviews": "2,109", "avg_ratings": 3.89, "genres": ["Fantasy", "Fiction", "Paranormal", "Vampires", "Science Fiction", "Horror", "Fantasy", "Paranormal", "Science Fiction Fantasy", "Speculative Fiction", "Fantasy", "Supernatural", "Fantasy", "Urban Fantasy"], "title": "Fledgling", "description": [", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wa", ", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wants - to destroy her and those she cares for and how she can save herself. ", " is a captivating novel that tests the limits of \"otherness\" and questions what it means to be truly human."], "author": "Octavia E. Butler", "num_pages": "320", "awards": ["Endeavour Award Nominee (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-02 00:00:00", "ISBN": "0446696161"},
{"url": "https://www.goodreads.com/book/show/17650.The_Robber_Bride", "num_ratings": "34,673", "num_reviews": "1,854", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "Canada", "Contemporary", "Literary Fiction"], "title": "The Robber Bride", "description": ["Margaret Atwood's ", " is inspired by \"The Robber Bridegroom,\" a wonderfully grisly tale from the Brothers Grimm in which an evil groom lures three maidens into his lair and devours them, one by one. But in her version, Atwood brilliantly recasts the monster as Zenia, a villainess of demonic proportions, and sets her loose in the lives of three friends, Tony, C", "Margaret Atwood's ", " is inspired by \"The Robber Bridegroom,\" a wonderfully grisly tale from the Brothers Grimm in which an evil groom lures three maidens into his lair and devours them, one by one. But in her version, Atwood brilliantly recasts the monster as Zenia, a villainess of demonic proportions, and sets her loose in the lives of three friends, Tony, Charis, and Roz. All three \"have lost men, spirit, money, and time to their old college acquaintance, Zenia. At various times, and in various emotional disguises, Zenia has insinuated her way into their lives and practically demolished them. To Tony, who almost lost her husband and jeopardized her academic career, Zenia is 'a lurking enemy commando.' To Roz, who did lose her husband and almost her magazine, Zenia is 'a cold and treacherous bitch.' To Charis, who lost a boyfriend, quarts of vegetable juice and some pet chickens, Zenia is a kind of zombie, maybe 'soulless'\" (Lorrie Moore, ", "). In love and war, illusion and deceit, Zenia's subterranean malevolence takes us deep into her enemies' pasts."], "author": "Margaret Atwood", "num_pages": "528", "awards": ["Governor General's Literary Awards / Prix littéraires du Gouverneur général Nominee for Fiction (1994)", "Commonwealth Writers' Prize for Best Book in Caribbean and Canada (1994)", "Trillium Book Award (1994)", "Canadian Authors Association Award for Fiction (1994)", "James Tiptree Jr. Award Honor List (1993)"], "places": [], "character_names": ["Zenia"], "language": "English", "publish_date": "1998-01-20 00:00:00", "ISBN": "0385491034"},
{"url": "https://www.goodreads.com/book/show/48328.Revolutionary_Road", "num_ratings": "69,526", "num_reviews": "6,235", "avg_ratings": 3.9, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction"], "title": "Revolutionary Road", "description": ["In the hopeful 1950s, Frank and April Wheeler appear to be a model couple: bright, beautiful, talented, with two young children and a starter home in the suburbs. Perhaps they married too young and started a family too early. Maybe Frank's job is dull. And April never saw herself as a housewife. Yet they have always lived on the assumption that greatness is only just aroun", "In the hopeful 1950s, Frank and April Wheeler appear to be a model couple: bright, beautiful, talented, with two young children and a starter home in the suburbs. Perhaps they married too young and started a family too early. Maybe Frank's job is dull. And April never saw herself as a housewife. Yet they have always lived on the assumption that greatness is only just around the corner. But now that certainty is about to crumble. With heartbreaking compassion and remorseless clarity, Richard Yates shows how Frank and April mortgage their spiritual birthright, betraying not only each other, but their best selves."], "author": "Richard Yates", "num_pages": "355", "awards": ["National Book Award Finalist for Fiction (1962)"], "places": ["Connecticut"], "character_names": ["Frank Wheeler", "April Wheeler", "Shep Campbell", "Milly Campbell"], "language": "English", "publish_date": "2001-02-01 00:00:00", "ISBN": "0413757102"},
{"url": "https://www.goodreads.com/book/show/35959740-circe", "num_ratings": "32,428", "num_reviews": "5,758", "avg_ratings": 4.38, "genres": ["Fantasy", "Fantasy", "Mythology", "Fiction", "Historical", "Historical Fiction", "Retellings"], "title": "Circe", "description": ["In the house of Helios, god of the sun and mightiest of the Titans, a daughter is born. But Circe is a strange child—not powerful, like her father, nor viciously alluring like her mother. Turning to the world of mortals for companionship, she discovers that she does possess power—the power of witchcraft, which can transform rivals into monsters and menace the gods themselv", "In the house of Helios, god of the sun and mightiest of the Titans, a daughter is born. But Circe is a strange child—not powerful, like her father, nor viciously alluring like her mother. Turning to the world of mortals for companionship, she discovers that she does possess power—the power of witchcraft, which can transform rivals into monsters and menace the gods themselves.", "Threatened, Zeus banishes her to a deserted island, where she hones her occult craft, tames wild beasts and crosses paths with many of the most famous figures in all of mythology, including the Minotaur, Daedalus and his doomed son Icarus, the murderous Medea, and, of course, wily Odysseus.", "But there is danger, too, for a woman who stands alone, and Circe unwittingly draws the wrath of both men and gods, ultimately finding herself pitted against one of the most terrifying and vengeful of the Olympians. To protect what she loves most, Circe must summon all her strength and choose, once and for all, whether she belongs with the gods she is born from, or the mortals she has come to love."], "author": "Madeline Miller", "num_pages": "394", "awards": [], "places": [], "character_names": ["Odysseus", "Zeus (God)", "Circe", "Medea of Colchis", "Daedalus", "Minotaur", "Helius (mythology)", "Icarus (mythology)"], "language": "English", "publish_date": "2018-04-10 00:00:00", "ISBN": "0316556343"},
{"url": "https://www.goodreads.com/book/show/5198.Paradise", "num_ratings": "20,124", "num_reviews": "844", "avg_ratings": 3.78, "genres": ["Fiction", "Cultural", "African American", "Classics", "Literature"], "title": "Paradise", "description": ["\"They shoot the white girl first. With the rest they can take their time.\" So begins this visionary work from a storyteller. Toni Morrison's first novel since she was awarded the Nobel Prize for Literature, Paradise opens with a horrifying scene of mass violence and chronicles its genesis in an all-black small town in rural Oklahoma. Founded by the descendants of freed sla", "\"They shoot the white girl first. With the rest they can take their time.\" So begins this visionary work from a storyteller. Toni Morrison's first novel since she was awarded the Nobel Prize for Literature, Paradise opens with a horrifying scene of mass violence and chronicles its genesis in an all-black small town in rural Oklahoma. Founded by the descendants of freed slaves and survivors in exodus from a hostile world, the patriarchal community of Ruby is built on righteousness, rigidly enforced moral law, and fear. But seventeen miles away, another group of exiles has gathered in a promised land of their own. And it is upon these women in flight from death and despair that nine male citizens of Ruby will lay their pain, their terror, and their murderous rage.", "In prose that soars with the rhythms, grandeur, and tragic arc of an epic poem, Toni Morrison challenges our most fiercely held beliefs as she weaves folklore and history, memory and myth into an unforgettable meditation of race, religion, gender, and a far-off past that is ever present."], "author": "Toni Morrison", "num_pages": "318", "awards": ["Orange Prize Nominee for Fiction Shortlist (1999)", "Ohioana Book Award for Fiction (1999)", "International DUBLIN Literary Award Nominee (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "0452280397"},
{"url": "https://www.goodreads.com/book/show/45162.Fingersmith", "num_ratings": "62,420", "num_reviews": "4,513", "avg_ratings": 4.02, "genres": ["Historical", "Historical Fiction", "Fiction", "Lgbt", "Historical", "Mystery", "Romance"], "title": "Fingersmith", "description": ["This is an alternate cover edition for ", "Sue Trinder is an orphan, left as an infant in the care of Mrs. Sucksby, a \"baby farmer,\" who raised her with unusual tenderness, as if Sue were her own. Mrs. Sucksby’s household, with its fussy babies calmed with doses of gin, also hosts a transient family of petty thieves—fingersmiths—for whom this house in th", "This is an alternate cover edition for ", "Sue Trinder is an orphan, left as an infant in the care of Mrs. Sucksby, a \"baby farmer,\" who raised her with unusual tenderness, as if Sue were her own. Mrs. Sucksby’s household, with its fussy babies calmed with doses of gin, also hosts a transient family of petty thieves—fingersmiths—for whom this house in the heart of a mean London slum is home.", "One day, the most beloved thief of all arrives—Gentleman, an elegant con man, who carries with him an enticing proposition for Sue: If she wins a position as the maid to Maud Lilly, a naïve gentlewoman, and aids Gentleman in her seduction, they will all share in Maud’s vast inheritance. Once the inheritance is secured, Maud will be disposed of—passed off as mad, and made to live out the rest of her days in a lunatic asylum.", "With dreams of paying back the kindness of her adopted family, Sue agrees to the plan. Once in, however, Sue begins to pity her helpless mark and care for Maud Lilly in unexpected ways, but no one and nothing is as it seems in this Dickensian novel of thrills and reversals."], "author": "Sarah Waters", "num_pages": "582", "awards": ["Man Booker Prize Nominee (2002)", "Stonewall Book Award Nominee for Literature (2003)", "Orange Prize Nominee for Fiction Shortlist (2002)", "CWA Ellis Peters Historical Award (2002)", "Lambda Literary Award for Lesbian Fiction (2003)", "このミステリーがすごい！ for Best Translated Mystery Novel of the Year in Japan (2005)"], "places": ["London, England"], "character_names": ["Sue Trinder", "Maud Lilly", "Gentleman", "Mrs. Sucksby"], "language": "English", "publish_date": "2002-10-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/126381.Purple_Hibiscus", "num_ratings": "44,222", "num_reviews": "4,231", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her bro", "Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her brother away to stay with their aunt, a University professor, whose house is noisy and full of laughter. There, Kambili and her brother discover a life and love beyond the confines of their father’s authority. The visit will lift the silence from their world and, in time, give rise to devotion and defiance that reveal themselves in profound and unexpected ways. ", "This is a book about the promise of freedom; about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new."], "author": "Chimamanda Ngozi Adichie", "num_pages": "307", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0007189885"},
{"url": "https://www.goodreads.com/book/show/25354.Bastard_Out_of_Carolina", "num_ratings": "34,812", "num_reviews": "2,399", "avg_ratings": 4.1, "genres": ["Fiction", "Classics", "American", "Southern", "Young Adult", "Coming Of Age", "Novels"], "title": "Bastard Out of Carolina", "description": ["Greenville County, South Carolina, is a wild, lush place that is home to the Boatwright family-a tight-knit clan of rough-hewn, hard- drinking men who shoot up each other's trucks, and indomitable women who get married young and age too quickly. At the heart of this story is Ruth Anne Boatwright, known simply as Bone, a bastard child who observes the world around her with", "Greenville County, South Carolina, is a wild, lush place that is home to the Boatwright family-a tight-knit clan of rough-hewn, hard- drinking men who shoot up each other's trucks, and indomitable women who get married young and age too quickly. At the heart of this story is Ruth Anne Boatwright, known simply as Bone, a bastard child who observes the world around her with a mercilessly keen perspective. When her stepfather Daddy Glen, \"cold as death, mean as a snake,\" becomes increasingly more vicious toward her, Bone finds herself caught in a family triangle that tests the loyalty of her mother, Anney-and leads to a final, harrowing encounter from which there can be no turning back."], "author": "Dorothy Allison", "num_pages": "320", "awards": ["Ferro-Grumley Award for Lesbian Fiction (1993)", "National Book Award Finalist for Fiction (1992)"], "places": ["Greenville, South Carolina", "South Carolina"], "character_names": [], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0452287057"},
{"url": "https://www.goodreads.com/book/show/30868.The_Bean_Trees", "num_ratings": "122,131", "num_reviews": "5,677", "avg_ratings": 3.96, "genres": ["Fiction", "Contemporary", "Novels"], "title": "The Bean Trees", "description": ["Clear-eyed and spirited, Taylor Greer grew up poor in rural Kentucky with the goals of avoiding pregnancy and getting away. But when she heads west with high hopes and a barely functional car, she meets the human condition head-on. By the time Taylor arrives in Tucson, Arizona, she has acquired a completely unexpected child, a three-year-old American Indian girl named Turt", "Clear-eyed and spirited, Taylor Greer grew up poor in rural Kentucky with the goals of avoiding pregnancy and getting away. But when she heads west with high hopes and a barely functional car, she meets the human condition head-on. By the time Taylor arrives in Tucson, Arizona, she has acquired a completely unexpected child, a three-year-old American Indian girl named Turtle, and must somehow come to terms with both motherhood and the necessity for putting down roots. Hers is a story about love and friendship, abandonment and belonging, and the discovery of surprising resources in apparently empty places."], "author": "Barbara Kingsolver", "num_pages": "232", "awards": [], "places": ["Tucson, Arizona"], "character_names": ["Taylor Greer", "Turtle Greer", "Lou Ann Ruiz", "Estevan", "Esperanza", "Mattie"], "language": "English", "publish_date": "1989-03-01 00:00:00", "ISBN": "0812474945"},
{"url": "https://www.goodreads.com/book/show/74341.The_Clan_of_the_Cave_Bear_the_Valley_of_Horses_the_Mammoth_Hunters_the_Plains_of_Passage", "num_ratings": "4,864", "num_reviews": "258", "avg_ratings": 4.27, "genres": ["Historical", "Historical Fiction", "Fiction", "Fantasy", "Historical"], "title": "The Clan of the Cave Bear, the Valley of Horses, the Mammoth Hunters, the Plains of Passage", "description": ["Boxed set includes ", ", ", ", ", ", and ", "."], "author": "Jean M. Auel", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1986-10-15 00:00:00", "ISBN": "0553328298"},
{"url": "https://www.goodreads.com/book/show/3236307-graceling", "num_ratings": "327,985", "num_reviews": "20,232", "avg_ratings": 4.09, "genres": ["Fantasy", "Young Adult", "Romance", "Fiction"], "title": "Graceling", "description": ["Katsa has been able to kill a man with her bare hands since she was eight—she’s a Graceling, one of the rare people in her land born with an extreme skill. As niece of the king, she should be able to live a life of privilege, but Graced as she is with killing, she is forced to work as the king’s thug. ", "She never expects to fall in love with beautiful Prince Po. ", "She never ex", "Katsa has been able to kill a man with her bare hands since she was eight—she’s a Graceling, one of the rare people in her land born with an extreme skill. As niece of the king, she should be able to live a life of privilege, but Graced as she is with killing, she is forced to work as the king’s thug. ", "She never expects to fall in love with beautiful Prince Po. ", "She never expects to learn the truth behind her Grace—or the terrible secret that lies hidden far away . . . a secret that could destroy all seven kingdoms with words alone. ", "With elegant, evocative prose and a cast of unforgettable characters, debut author Kristin Cashore creates a mesmerizing world, a death-defying adventure, and a heart-racing romance that will consume you, hold you captive, and leave you wanting more."], "author": "Kristin Cashore", "num_pages": "471", "awards": ["Mythopoeic Fantasy Award for Children's Literature (2009)", "William C. Morris YA Debut Award Nominee (2009)", "Rhode Island Teen Book Award Nominee (2011)", "Milwaukee County Teen Book Award Nominee (2010)", "Sakura Medal Nominee for High School Book (2010)", "Florida Teens Read Nominee (2010)", "Amelia Elizabeth Walden Award Nominee (2009)", "Iowa High School Book Award Nominee (2011)", "California Young Readers Medal for Young Adult (2012)", "Lincoln Award Nominee (2011)", "Andre Norton Award Nominee (2008)", "Cybils Award Nominee for Young Adult Fantasy & Science Fiction (2008)", "Green Mountain Book Award (2011)", "Missouri Gateway Readers Award Nominee (2011)"], "places": [], "character_names": ["Katsa (Graceling Realm)", "Bitterblue", "Leck (Graceling Realm)", "Randa (Graceling Realm)", "Grandfather Tealiff", "Po (Graceling Realm)"], "language": "English", "publish_date": "2008-10-01 00:00:00", "ISBN": "015206396X"},
{"url": "https://www.goodreads.com/book/show/8127.Anne_of_Green_Gables", "num_ratings": "591,699", "num_reviews": "16,410", "avg_ratings": 4.24, "genres": ["Classics", "Fiction", "Young Adult", "Childrens", "Historical", "Historical Fiction", "Historical", "Cultural", "Canada", "Childrens", "Middle Grade", "Audiobook", "Young Adult", "Coming Of Age"], "title": "Anne of Green Gables", "description": ["As soon as Anne Shirley arrives at the snug white farmhouse called Green Gables, she is sure she wants to stay forever . . . but will the Cuthberts send her back to to the orphanage? Anne knows she's not what they expected—a skinny girl with fiery red hair and a temper to match. If only she can convince them to let her stay, she'll try very hard not to keep rushing headlon", "As soon as Anne Shirley arrives at the snug white farmhouse called Green Gables, she is sure she wants to stay forever . . . but will the Cuthberts send her back to to the orphanage? Anne knows she's not what they expected—a skinny girl with fiery red hair and a temper to match. If only she can convince them to let her stay, she'll try very hard not to keep rushing headlong into scrapes and blurting out the first thing that comes to her mind. Anne is not like anyone else, the Cuthberts agree; she is special—a girl with an enormous imagination. This orphan girl dreams of the day when she can call herself Anne of Green Gables."], "author": "L.M. Montgomery", "num_pages": "320", "awards": [], "places": ["Avonlea, Prince Edward Island", "Prince Edward Island"], "character_names": ["Marilla Cuthbert", "Matthew Cuthbert", "Diana Barry", "Gilbert Blythe", "Rachel Lynde", "Anne Blythe", "Anne Shirley"], "language": "English", "publish_date": "2003-05-06 00:00:00", "ISBN": "0451528824"},
{"url": "https://www.goodreads.com/book/show/114345.The_Little_House_Collection", "num_ratings": "132,444", "num_reviews": "2,074", "avg_ratings": 4.33, "genres": ["Classics", "Childrens", "Historical", "Historical Fiction", "Fiction", "Young Adult"], "title": "The Little House Collection", "description": ["Little House in the Big Woods/Little House on the Prairie/Farmer Boy/On The Banks of Plum Creek/By the Shores of Silver Lake/The Long Winter/Little Town on the Prairie/These Happy Golden Years/The First Four Years (Little House Books)"], "author": "Laura Ingalls Wilder", "num_pages": "2700", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-10-07 00:00:00", "ISBN": "0060529962"},
{"url": "https://www.goodreads.com/book/show/9654.Fear_of_Flying", "num_ratings": "16,143", "num_reviews": "1,380", "avg_ratings": 3.45, "genres": ["Fiction", "Feminism", "Classics", "Adult Fiction", "Erotica", "Novels"], "title": "Fear of Flying", "description": ["After five years, Isadora Wing has come to a crossroads in her marriage: Should she and her husband stay together or get divorced? Accompanying her husband to an analysts’ conference in Vienna, she ditches him and strikes out on her own, crisscrossing Europe in search of a man who can in", "After five years, Isadora Wing has come to a crossroads in her marriage: Should she and her husband stay together or get divorced? Accompanying her husband to an analysts’ conference in Vienna, she ditches him and strikes out on her own, crisscrossing Europe in search of a man who can inspire uninhibited passion. But, as she comes to learn, liberation and happiness are not necessarily the same thing.", "A literary sensation when first published in 1973, ", " established Erica Jong as one of her generation’s foremost voices on sex and feminism. Nearly four decades later, the novel has lost none of its insight, verve, or jaw-dropping wit."], "author": "Erica Jong", "num_pages": "461", "awards": [], "places": [], "character_names": ["Isadora Wing", "Bennett Wing", "Adrian Goodlove"], "language": "English", "publish_date": "2003-11-04 00:00:00", "ISBN": "0451209435"},
{"url": "https://www.goodreads.com/book/show/14249.Prodigal_Summer", "num_ratings": "85,328", "num_reviews": "5,545", "avg_ratings": 3.99, "genres": ["Fiction", "Contemporary", "Novels", "Environment", "Nature"], "title": "Prodigal Summer", "description": [" weaves together three stories of human love within a larger tapestry of lives inhabiting the forested mountains and struggling small farms of southern Appalachia.", "From her outpost in an isolated mountain cabin, Deanna Wolfe, a reclusive wildlife biologist, watches a den of coyotes that have recently migrated into the region. She is caught off-guard by a youn", " weaves together three stories of human love within a larger tapestry of lives inhabiting the forested mountains and struggling small farms of southern Appalachia.", "From her outpost in an isolated mountain cabin, Deanna Wolfe, a reclusive wildlife biologist, watches a den of coyotes that have recently migrated into the region. She is caught off-guard by a young hunter who invades her most private spaces and confounds her self-assured, solitary life. On a farm several miles down the mountain, Lusa Maluf Landowski, a bookish city girl turned farmer's wife, finds herself unexpectedly marooned in a strange place where she must declare or lose her attachment to the land that has become her own. And a few more miles down the road, a pair of elderly feuding neighbors tend their respective farms and wrangle about God, pesticides, and the possibilities of a future neither of them expected.", "Over the course of one humid summer, these characters find their connections to one another and to the flora and fauna with whom they share a place. ", " demonstrates a balance of narrative, drama and ideas that is characteristic of Barbara Kingsolver's finest work."], "author": "Barbara Kingsolver", "num_pages": "444", "awards": [], "places": ["Egg Fork, Zebulon County, Kentucky"], "character_names": ["Deanna Wolfe", "Eddie Bondo", "Lusa Maluf Landowski", "Garnett Walker", "Nannie Rawley"], "language": "English", "publish_date": "2001-10-16 00:00:00", "ISBN": "0060959037"},
{"url": "https://www.goodreads.com/book/show/37380.The_Heart_Is_a_Lonely_Hunter", "num_ratings": "81,103", "num_reviews": "5,338", "avg_ratings": 3.97, "genres": ["Fiction", "Classics", "Literature"], "title": "The Heart Is a Lonely Hunter", "description": ["An alternate cover for this ISBN can be found ", ".", "Carson McCullers’ prodigious first novel was published to instant acclaim when she was just twenty-three. Set in a small town in the middle of the deep South, it is the story of John Singer, a lonely deaf-mute, and a disparate group of people who are drawn towards his kind, sympathetic nature. The owner of the café where S", "An alternate cover for this ISBN can be found ", ".", "Carson McCullers’ prodigious first novel was published to instant acclaim when she was just twenty-three. Set in a small town in the middle of the deep South, it is the story of John Singer, a lonely deaf-mute, and a disparate group of people who are drawn towards his kind, sympathetic nature. The owner of the café where Singer eats every day, a young girl desperate to grow up, an angry drunkard, a frustrated black doctor: each pours their heart out to Singer, their silent confidant, and he in turn changes their disenchanted lives in ways they could never imagine.", "Contains Chronology, list of Further Reading and Notes."], "author": "Carson McCullers", "num_pages": "368", "awards": [], "places": [], "character_names": ["John Singer", "Spiros Antonapoulos", "Biff Brannon", "Jake Blount", "Mick Kelly", "Benedict Copeland"], "language": "English", "publish_date": "2000-09-08 00:00:00", "ISBN": "0618084746"},
{"url": "https://www.goodreads.com/book/show/2267195.The_Story_of_an_Hour", "num_ratings": "16,052", "num_reviews": "510", "avg_ratings": 4.09, "genres": ["Short Stories", "Academic", "School", "Classics", "Academic", "Read For School", "Literature", "American", "Fiction", "Literature"], "title": "The Story of an Hour", "description": ["In these four stories, Kate Chopin subtly captures the intricate interior lives of a generation of women. From the famous proto-feminist tale \"The Story of an Hour\" to the subtly sexy \"A Respectable Woman,\" Chopin sheds light on the frustrations, desires, and dreams of her own era and their reverberations today. Artist Gemma Correll's quirky illustrations provide a perfect", "In these four stories, Kate Chopin subtly captures the intricate interior lives of a generation of women. From the famous proto-feminist tale \"The Story of an Hour\" to the subtly sexy \"A Respectable Woman,\" Chopin sheds light on the frustrations, desires, and dreams of her own era and their reverberations today. Artist Gemma Correll's quirky illustrations provide a perfect modern counterpoint to Chopin's classic prose.("], "author": "Kate Chopin", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-09-01 00:00:00", "ISBN": "078915479X"},
{"url": "https://www.goodreads.com/book/show/310146.The_True_Confessions_of_Charlotte_Doyle", "num_ratings": "73,449", "num_reviews": "2,957", "avg_ratings": 3.82, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Adventure", "Historical"], "title": "The True Confessions of Charlotte Doyle", "description": ["An ocean voyage of unimaginable consequences... Not every thirteen-year-old girl is accused of murder, brought to trial, and found guilty. But I was just such a girl, and my story is worth relating even if it did happen years ago. Be warned, however: If strong ideas and action offend you, read no more. Find another companion to share your idle hours. For my part I intend t", "An ocean voyage of unimaginable consequences... Not every thirteen-year-old girl is accused of murder, brought to trial, and found guilty. But I was just such a girl, and my story is worth relating even if it did happen years ago. Be warned, however: If strong ideas and action offend you, read no more. Find another companion to share your idle hours. For my part I intend to tell the truth as I lived it."], "author": "Avi", "num_pages": "278", "awards": ["Newbery Medal Nominee (1991)", "Massachusetts Children's Book Award (1996)", "Dorothy Canfield Fisher Children's Book Award Nominee (1992)", "Evergreen Teen Book Award (1993)", "Sunshine State Young Readers Award (1993)", "Judy Lopez Memorial Award for Children's Literature (1991)"], "places": ["Rhode Island", "Liverpool, England", "Atlantic Ocean"], "character_names": ["Charlotte Doyle"], "language": "English", "publish_date": "2003-09-02 00:00:00", "ISBN": "0380714752"},
{"url": "https://www.goodreads.com/book/show/15796700-americanah", "num_ratings": "169,692", "num_reviews": "16,442", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Feminism", "Literary Fiction"], "title": "Americanah", "description": ["Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a d", "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London. Fifteen years later, they reunite in a newly democratic Nigeria, and reignite their passion—for each other and for their homeland.", "Source: chimamanda.com"], "author": "Chimamanda Ngozi Adichie", "num_pages": "477", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0307271080"},
{"url": "https://www.goodreads.com/book/show/19089.Middlemarch", "num_ratings": "118,283", "num_reviews": "5,997", "avg_ratings": 3.94, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Middlemarch", "description": ["Taking place in the years leading up to the First Reform Bill of 1832, Middlemarch explores nearly every subject of concern to modern life: art, religion, science, politics, self, society, human relationships. Among her characters are some of the most remarkable portraits in English literature: Dorothea Brooke, the heroine, idealistic but naive; Rosamond Vincy, beautiful a", "Taking place in the years leading up to the First Reform Bill of 1832, Middlemarch explores nearly every subject of concern to modern life: art, religion, science, politics, self, society, human relationships. Among her characters are some of the most remarkable portraits in English literature: Dorothea Brooke, the heroine, idealistic but naive; Rosamond Vincy, beautiful and egoistic: Edward Casaubon, the dry-as-dust scholar: Tertius Lydgate, the brilliant but morally-flawed physician: the passionate artist Will Ladislaw: and Fred Vincey and Mary Garth, childhood sweethearts whose charming courtship is one of the many humorous elements in the novel's rich comic vein."], "author": "George Eliot", "num_pages": "904", "awards": [], "places": ["Midlands, England"], "character_names": ["Dorothea Brooke", "Celia Brooke", "Will Ladislaw", "Mary Garth", "Rosamond Vincy", "Fred Vincy", "Sir James Chettam", "Tertius Lydgate", "Peter Featherstone", "Edward Casaubon", "Caleb Garth", "Camden Farebrother", "Joshua Rigg", "John Raffles", "Nicholas Bulstrode", "Harriet Bulstrode", "Arthur Brooke"], "language": "English", "publish_date": "2004-08-16 00:00:00", "ISBN": "0451529170"},
{"url": "https://www.goodreads.com/book/show/156538.North_and_South", "num_ratings": "121,029", "num_reviews": "6,073", "avg_ratings": 4.13, "genres": ["Classics", "Fiction", "Romance", "Historical", "Historical Fiction", "Historical"], "title": "North and South", "description": ["When her father leaves the Church in a crisis of conscience, Margaret Hale is uprooted from her comfortable home in Hampshire to move with her family to the north of England. Initially repulsed by the ugliness of her new surroundings in the industrial town of Milton, Margaret becomes aware of the poverty and suffering of the local mill workers and develops a passionate sen", "When her father leaves the Church in a crisis of conscience, Margaret Hale is uprooted from her comfortable home in Hampshire to move with her family to the north of England. Initially repulsed by the ugliness of her new surroundings in the industrial town of Milton, Margaret becomes aware of the poverty and suffering of the local mill workers and develops a passionate sense of social justice. This is intensified by her tempestuous relationship with the mill-owner and self-made man, John Thornton, as their fierce opposition over his treatment of his employees masks a deeper attraction.", "In ", ", Elizabeth Gaskell skillfully fuses individual feeling with social concern, and in Margaret Hale creates one of the most original heroines of Victorian literature."], "author": "Elizabeth Gaskell", "num_pages": "521", "awards": [], "places": ["England"], "character_names": ["Margaret Hale", "Frederick Hale", "Mr. Hale", "Mrs. Hale", "Mr. Bell", "Dixon", "Mrs. Hannah Thornton", "Fanny Thornton", "Bessy Higgins", "Nicholas Higgins", "John   Thornton"], "language": "English", "publish_date": "1994-01-13 00:00:00", "ISBN": "0140620192"},
{"url": "https://www.goodreads.com/book/show/17728.The_House_of_Mirth", "num_ratings": "72,124", "num_reviews": "3,789", "avg_ratings": 3.95, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "The House of Mirth", "description": ["First published in 1905, THE HOUSE OF MIRTH shocked the New York society it so deftly chronicles, portraying the moral, social and economic restraints on a woman who dared to claim the privileges of marriage without assuming the responsibilities.", "Lily Bart, beautiful, witty and sophisticated, is accepted by 'old money' and courted by the growing tribe of nouveaux riches. Bu", "First published in 1905, THE HOUSE OF MIRTH shocked the New York society it so deftly chronicles, portraying the moral, social and economic restraints on a woman who dared to claim the privileges of marriage without assuming the responsibilities.", "Lily Bart, beautiful, witty and sophisticated, is accepted by 'old money' and courted by the growing tribe of nouveaux riches. But as she nears thirty, her foothold becomes precarious; a poor girl with expensive tastes, she needs a husband to preserve her social standing and to maintain her in the luxury she has come to expect. Whilst many have sought her, something - fastidiousness or integrity- prevents her from making a 'suitable' match."], "author": "Edith Wharton", "num_pages": "351", "awards": [], "places": ["New York City, New York"], "character_names": ["Lily Bart", "Lawrence Selden", "Simon Rosedale", "Judy Trenor", "Gus Trenor", "Percy Gryce", "Bertha Dorset", "George Dorset", "Gerty Farish", "Julia Peniston", "Carry Fisher"], "language": "English", "publish_date": "2006-01-19 00:00:00", "ISBN": "1844082938"},
{"url": "https://www.goodreads.com/book/show/52397.Parable_of_the_Sower", "num_ratings": "35,611", "num_reviews": "3,530", "avg_ratings": 4.15, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Apocalyptic", "Post Apocalyptic"], "title": "Parable of the Sower", "description": ["In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a cul", "In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a culture that has been destroyed by drugs, disease, war, and chronic water shortages. While her father tries to lead people on the righteous path, Lauren struggles with hyperempathy, a condition that makes her extraordinarily sensitive to the pain of others.", "When fire destroys their compound, Lauren’s family is killed and she is forced out into a world that is fraught with danger. With a handful of other refugees, Lauren must make her way north to safety, along the way conceiving a revolutionary idea that may mean salvation for all mankind."], "author": "Octavia E. Butler", "num_pages": "345", "awards": [], "places": ["California"], "character_names": ["Lauren Olamina"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0446675504"},
{"url": "https://www.goodreads.com/book/show/772888.Woman_on_the_Edge_of_Time", "num_ratings": "11,866", "num_reviews": "769", "avg_ratings": 3.95, "genres": ["Fiction", "Science Fiction", "Feminism", "Science Fiction", "Time Travel", "Science Fiction", "Dystopia"], "title": "Woman on the Edge of Time", "description": ["Connie Ramos, a woman in her mid-thirties, has been declared insane. But Connie is overwhelmingly sane, merely tuned to the future, and able to communicate with the year 2137. As her doctors persuade her to agree to an operation, Connie struggles to force herself to listen to the future and its lessons for today...."], "author": "Marge Piercy", "num_pages": "376", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "1985-11-12 00:00:00", "ISBN": "0449210820"},
{"url": "https://www.goodreads.com/book/show/60931.Kindred", "num_ratings": "60,626", "num_reviews": "7,284", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Science Fiction", "Fantasy", "Science Fiction", "Time Travel"], "title": "Kindred", "description": ["The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into ante", "The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into antebellum Maryland. After saving a drowning white boy there, she finds herself staring into the barrel of a shotgun and is transported back to the present just in time to save her life. During numerous such time-defying episodes with the same young man, she realizes the challenge she’s been given: to protect this young slaveholder until he can father her own great-grandmother."], "author": "Octavia E. Butler", "num_pages": "287", "awards": [], "places": ["Maryland", "Altadena, California"], "character_names": ["Dana Franklin", "Kevin Franklin", "Rufus Weylin", "Tom Weylin", "Margaret Weylin", "Alice Greenwood"], "language": "English", "publish_date": "2004-02-01 00:00:00", "ISBN": "0807083690"},
{"url": "https://www.goodreads.com/book/show/46456.The_Women_s_Room", "num_ratings": "6,791", "num_reviews": "496", "avg_ratings": 3.94, "genres": ["Fiction", "Feminism", "Classics", "Womens", "Novels"], "title": "The Women's Room", "description": ["The bestselling feminist novel that awakened both women and men, ", " follows the transformation of Mira Ward and her circle as the women's movement begins to have an impact on their lives. A biting social commentary on an emotional world gone silently haywire, ", " is a modern classic that offers piercin", "The bestselling feminist novel that awakened both women and men, ", " follows the transformation of Mira Ward and her circle as the women's movement begins to have an impact on their lives. A biting social commentary on an emotional world gone silently haywire, ", " is a modern classic that offers piercing insight into the social norms accepted so blindly and revered so completely. Marilyn French questions those accepted norms and poignantly portrays the hopeful believers looking for new truths."], "author": "Marilyn French", "num_pages": "526", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-05-01 00:00:00", "ISBN": "1860492827"},
{"url": "https://www.goodreads.com/book/show/58027.Alias_Grace", "num_ratings": "81,421", "num_reviews": "4,668", "avg_ratings": 4.01, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Cultural", "Canada", "Historical"], "title": "Alias Grace", "description": ["Toronto, 1843: Das junge Dienstmädchen Grace wird mit sechzehn des Doppelmordes an ihren Arbeitgebern schuldig gesprochen. In letzter Sekunde wandelt das Gericht ihr Todesurteil in eine lebenslange Gefängnisstrafe um. Sie verbringt Jahre hinter Gittern, bis man sie schließlich entlässt. Im Haushalt des Anstaltdirektors begegnet sie dem Nervenarzt Simon, der ihrer Geschicht", "Toronto, 1843: Das junge Dienstmädchen Grace wird mit sechzehn des Doppelmordes an ihren Arbeitgebern schuldig gesprochen. In letzter Sekunde wandelt das Gericht ihr Todesurteil in eine lebenslange Gefängnisstrafe um. Sie verbringt Jahre hinter Gittern, bis man sie schließlich entlässt. Im Haushalt des Anstaltdirektors begegnet sie dem Nervenarzt Simon, der ihrer Geschichte auf den Grund gehen will: Ist Grace eine gemeingefährliche Verbrecherin oder unschuldig? Margaret Atwood hat einen Roman von hypnotischer Spannung geschrieben, der die Geschichte einer realen Gestalt, einer der berüchtigtsten Frauen Kanadas erzählt."], "author": "Margaret Atwood", "num_pages": "636", "awards": ["Man Booker Prize Nominee (1996)", "Orange Prize Nominee for Fiction Shortlist (1997)", "Scotiabank Giller Prize (1996)", "James Tiptree Jr. Award Nominee for Longlist (1996)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général Nominee for Fiction (1996)", "International DUBLIN Literary Award Nominee (1998)", "Mikael Agricola -palkinto (1998)"], "places": ["Toronto, Ontario", "Kingston, Ontario"], "character_names": ["Grace Marks"], "language": "German", "publish_date": "1998-10-01 00:00:00", "ISBN": "3442723434"},
{"url": "https://www.goodreads.com/book/show/18423.The_Left_Hand_of_Darkness", "num_ratings": "87,135", "num_reviews": "6,257", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Fantasy", "Classics"], "title": "The Left Hand of Darkness", "description": ["A groundbreaking work of science fiction, ", " tells the story of a lone human emissary to Winter, an alien world whose inhabitants can choose -and change - their gender. His goal is to facilitate Winter's inclusion in a growing intergalactic civilization. But to do so he must bridge the gulf between his own views and those of the completely dissimilar", "A groundbreaking work of science fiction, ", " tells the story of a lone human emissary to Winter, an alien world whose inhabitants can choose -and change - their gender. His goal is to facilitate Winter's inclusion in a growing intergalactic civilization. But to do so he must bridge the gulf between his own views and those of the completely dissimilar culture that he encounters. ", "Embracing the aspects of psychology, society, and human emotion on an alien world, ", " stands as a landmark achievement in the annals of intellectual science fiction."], "author": "Ursula K. Le Guin", "num_pages": "304", "awards": ["Hugo Award for Best Novel (1970)", "Nebula Award for Best Novel (1969)", "James Tiptree Jr. Award for Retrospective"], "places": [], "character_names": ["Genly Ai", "Therem Harth rem ir Estraven", "Argaven XV"], "language": "English", "publish_date": "2000-07-01 00:00:00", "ISBN": "0441007317"},
{"url": "https://www.goodreads.com/book/show/13831.Alanna", "num_ratings": "99,617", "num_reviews": "4,261", "avg_ratings": 4.27, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Adventure"], "title": "Alanna: The First Adventure", "description": ["And so young Alanna of Trebond begins the journey to knighthood. Though a girl, Alanna has always craved the adventure and daring allowed only for boys; her twin brother, Thom, yearns to learn the art of magic. So one day they decide to switch places: Thom heads for the convent to learn magic; Alanna, pret", "And so young Alanna of Trebond begins the journey to knighthood. Though a girl, Alanna has always craved the adventure and daring allowed only for boys; her twin brother, Thom, yearns to learn the art of magic. So one day they decide to switch places: Thom heads for the convent to learn magic; Alanna, pretending to be a boy, is on her way to the castle of King Roald to begin her training as a page. "], "author": "Tamora Pierce", "num_pages": "274", "awards": ["Preis der Leseratten des ZDF", "NSK Neustadt Prize for Children's Literature Nominee (2013)"], "places": ["Tortall"], "character_names": ["Alanna of Trebond", "Thom of Trebond", "Coram Smythesson", "George Cooper", "Jonathan of Conte", "Raoul of Goldenlake", "Gareth of Naxen the Second (Gary)", "Alex of Tirrigan", "Duke Roger of Conte"], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "0689878559"},
{"url": "https://www.goodreads.com/book/show/59716.To_the_Lighthouse", "num_ratings": "105,517", "num_reviews": "5,521", "avg_ratings": 3.77, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "To the Lighthouse", "description": ["The serene and maternal Mrs. Ramsay, the tragic yet absurd Mr. Ramsay, and their children and assorted guests are on holiday on the Isle of Skye. From the seemingly trivial postponement of a visit to a nearby lighthouse, Woolf constructs a remarkable, moving examination of the complex tensions and allegiances of family life and the conflict between men and women.", "As time wi", "The serene and maternal Mrs. Ramsay, the tragic yet absurd Mr. Ramsay, and their children and assorted guests are on holiday on the Isle of Skye. From the seemingly trivial postponement of a visit to a nearby lighthouse, Woolf constructs a remarkable, moving examination of the complex tensions and allegiances of family life and the conflict between men and women.", "As time winds its way through their lives, the Ramsays face, alone and simultaneously, the greatest of human challenges and its greatest triumph--the human capacity for change."], "author": "Virginia Woolf", "num_pages": "209", "awards": ["Prix Femina Vie Heureuse Anglais (1928)"], "places": ["Isle of Skye, Scotland"], "character_names": ["James Ramsay", "Mrs. Ramsay", "Mr. Ramsay", "Lily Briscoe", "Paul Rayley", "Minta Doyle", "Charles Tansley", "William Bankes", "Augustus Carmichael", "Andrew Ramsay", "Jasper Ramsay", "Roger Ramsay", "Prue Ramsay", "Rose Ramsay", "Nancy Ramsay", "Cam Ramsay", "Mrs. McNab"], "language": "English", "publish_date": "1989-12-27 00:00:00", "ISBN": "140679239X"},
{"url": "https://www.goodreads.com/book/show/44597.Wide_Sargasso_Sea", "num_ratings": "50,657", "num_reviews": "4,102", "avg_ratings": 3.57, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Literature"], "title": "Wide Sargasso Sea", "description": ["Prequel to ", " by Charlotte Bronte. Born into an oppressive, colonialist society, Creole heiress Antoinette Cosway meets a young Englishman who is drawn to her innocent sensuality and beauty, but soon after their marriage, rumors of madness in her family poison his mind against her. He forces Antoinette to conform to his rigid Victorian ideals."], "author": "Jean Rhys", "num_pages": "160", "awards": ["WH Smith Literary Award (1967)", "W.H. Heinemann Award (1966)"], "places": [], "character_names": ["Antoinette Cosway", "Tia", "Aunt Cora", "Grace Poole", "Richard Mason", "Annette Cosway", "Pierre Cosway", "Mr Mason", "Christophine", "Godfrey", "Edward Rochester"], "language": "English", "publish_date": "1998-09-03 00:00:00", "ISBN": "0140274219"},
{"url": "https://www.goodreads.com/book/show/51019.Cat_s_Eye", "num_ratings": "48,853", "num_reviews": "2,774", "avg_ratings": 3.93, "genres": ["Fiction", "Cultural", "Canada", "Contemporary", "Literary Fiction"], "title": "Cat's Eye", "description": [" is the story of Elaine Risley, a controversial painter who returns to Toronto, the city of her youth, for a retrospective of her art. Engulfed by vivid images of the past, she reminisces about a trio of girls who initiated her into the fierce politics of childhood and its secret world of friendship, longing, and betrayal. Elaine must come to terms with her own id", " is the story of Elaine Risley, a controversial painter who returns to Toronto, the city of her youth, for a retrospective of her art. Engulfed by vivid images of the past, she reminisces about a trio of girls who initiated her into the fierce politics of childhood and its secret world of friendship, longing, and betrayal. Elaine must come to terms with her own identity as a daughter, a lover, and artist, and woman - but above all she must seek release from her haunting memories. Disturbing, hilarious, and compassionate, ", " is a breathtaking novel of a woman grappling with the tangled knots of her life."], "author": "Margaret Atwood", "num_pages": "462", "awards": ["Man Booker Prize Nominee (1989)"], "places": ["Toronto, Ontario", "Canada", "Ontario"], "character_names": [], "language": "English", "publish_date": "1998-08-16 00:00:00", "ISBN": "0385491026"},
{"url": "https://www.goodreads.com/book/show/11899.The_Hours", "num_ratings": "114,498", "num_reviews": "4,416", "avg_ratings": 3.92, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "The Hours", "description": ["Passionate, profound, and deeply moving, ", " is the story of three women: Clarissa Vaughan, who one New York morning goes about planning a party in honor of a beloved friend; Laura Brown, who in a 1950s Los Angeles suburb slowly begins to feel the constraints of a perfect family and home; and Virginia Woolf, recuperating with her husband in a London suburb and beginn", "Passionate, profound, and deeply moving, ", " is the story of three women: Clarissa Vaughan, who one New York morning goes about planning a party in honor of a beloved friend; Laura Brown, who in a 1950s Los Angeles suburb slowly begins to feel the constraints of a perfect family and home; and Virginia Woolf, recuperating with her husband in a London suburb and beginning to write ", ". By the end of the novel, the stories have intertwined and finally come together in an act of subtle and haunting grace, demonstrating Michael Cunningham's deep empathy for his characters as well as the extraordinary resonance of his prose."], "author": "Michael Cunningham", "num_pages": "230", "awards": ["Pulitzer Prize for Fiction (1999)", "Stonewall Book Award for Literature (1999)", "PEN/Faulkner Award for Fiction (1999)", "Ferro-Grumley Award for Gay Fiction (1999)", "National Book Critics Circle Award Nominee for Fiction (1998)", "Premio Grinzane Cavour for Narrativa Straniera (2000)"], "places": ["London, England", "New York City, New York", "Los Angeles, California"], "character_names": ["Virginia Woolf", "Clarissa Vaughan", "Laura Brown"], "language": "English", "publish_date": "2002-10-16 00:00:00", "ISBN": "0312305060"},
{"url": "https://www.goodreads.com/book/show/18839.Orlando", "num_ratings": "44,290", "num_reviews": "2,617", "avg_ratings": 3.86, "genres": ["Classics", "Fiction", "Fantasy", "Historical", "Historical Fiction", "Lgbt"], "title": "Orlando", "description": ["Virginia Woolf’s Orlando ‘The longest and most charming love letter in literature’, playfully constructs the figure of Orlando as the fictional embodiment of Woolf’s close friend and lover, Vita Sackville-West. Spanning three centuries, the novel opens as Orlando, a young nobleman in Elizabeth’s England, awaits a visit from the Queen and traces his experience with first lo", "Virginia Woolf’s Orlando ‘The longest and most charming love letter in literature’, playfully constructs the figure of Orlando as the fictional embodiment of Woolf’s close friend and lover, Vita Sackville-West. Spanning three centuries, the novel opens as Orlando, a young nobleman in Elizabeth’s England, awaits a visit from the Queen and traces his experience with first love as England under James I lies locked in the embrace of the Great Frost. At the midpoint of the novel, Orlando, now an ambassador in Costantinople, awakes to find that he is a woman, and the novel indulges in farce and irony to consider the roles of women in the 18th and 19th centuries. As the novel ends in 1928, a year consonant with full suffrage for women. Orlando, now a wife and mother, stands poised at the brink of a future that holds new hope and promise for women."], "author": "Virginia Woolf", "num_pages": "228", "awards": [], "places": ["England", "Turkey"], "character_names": ["Nicholas Greene", "Marmaduke Bonthrop Shelmerdine", "Sasha", "Orlando"], "language": "English", "publish_date": "2000-09-28 00:00:00", "ISBN": "0141184272"},
{"url": "https://www.goodreads.com/book/show/9375.Fried_Green_Tomatoes_at_the_Whistle_Stop_Cafe", "num_ratings": "237,869", "num_reviews": "5,104", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Lgbt", "Womens Fiction", "Chick Lit", "Classics", "American", "Southern"], "title": "Fried Green Tomatoes at the Whistle Stop Cafe", "description": ["It's first the story of two women in the 1980s, of gray-headed Mrs. Threadgoode telling her life story to Evelyn, who is in the sad slump of middle age. The tale she tells is ", " of two women—of the irrepressibly daredevilish tomboy Idgie and her friend Ruth, who back in the thirties ran a little place in Whistle Stop, Alabama, a Southern kind of Cafe Wobegon offering goo", "It's first the story of two women in the 1980s, of gray-headed Mrs. Threadgoode telling her life story to Evelyn, who is in the sad slump of middle age. The tale she tells is ", " of two women—of the irrepressibly daredevilish tomboy Idgie and her friend Ruth, who back in the thirties ran a little place in Whistle Stop, Alabama, a Southern kind of Cafe Wobegon offering good barbecue and good coffee and all kinds of love and laughter, even an occasional murder."], "author": "Fannie Flagg", "num_pages": "416", "awards": ["Alabama Author Award for Fiction (1989)"], "places": ["Davenport, Iowa", "Troutville, Alabama", "Birmingham, Alabama", "Whistle Stop, Alabama", "Alabama"], "character_names": ["Ruth", "Mrs. Ninny Threadgoode", "Evelyn Couch", "Idgie"], "language": "English", "publish_date": "2002-05-07 00:00:00", "ISBN": "0375508414"},
{"url": "https://www.goodreads.com/book/show/9328.The_House_of_the_Spirits", "num_ratings": "153,042", "num_reviews": "6,035", "avg_ratings": 4.21, "genres": ["Fiction", "Magical Realism", "Historical", "Historical Fiction", "Classics", "Fantasy"], "title": "The House of the Spirits", "description": ["In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. ", "Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherwor", "In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. ", "Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherworldly hand. Their daughter, Blanca, whose forbidden love for a man Esteban has deemed unworthy infuriates her father, yet will produce his greatest joy: his granddaughter Alba, a beautiful, ambitious girl who will lead the family and their country into a revolutionary future.", " is an enthralling saga that spans decades and lives, twining the personal and the political into an epic novel of love, magic, and fate."], "author": "Isabel Allende", "num_pages": "448", "awards": ["Deutscher Hörbuchpreis for Beste Fiktion (2011)", "Prix du Grand Roman d'évasion (1984)"], "places": ["Chile"], "character_names": ["Esteban Trueba", "Clara del Valle", "Férula Trueba", "Blanca Trueba", "Jaime Trueba", "Nicolàs Trueba", "Pedro Tercero Garcia", "Alba Trueba", "Esteban Garcia"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0553383809"},
{"url": "https://www.goodreads.com/book/show/14942.Mrs_Dalloway", "num_ratings": "181,895", "num_reviews": "7,377", "avg_ratings": 3.79, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "Mrs. Dalloway", "description": [" chronicles a June day in the life of Clarissa Dalloway –a day that is taken up with running minor errands in preparation for a party and that is punctuated, toward the end, by the suicide of a young man she has never met. In giving an apparently ordinary day such immense resonance and significance–infusing it with the elemental conflict between death and life", " chronicles a June day in the life of Clarissa Dalloway –a day that is taken up with running minor errands in preparation for a party and that is punctuated, toward the end, by the suicide of a young man she has never met. In giving an apparently ordinary day such immense resonance and significance–infusing it with the elemental conflict between death and life–Virginia Woolf triumphantly discovers her distinctive style as a novelist. Originally published in 1925, ", "is Woolf’s first complete rendering of what she described as the “luminous envelope” of consciousness: a dazzling display of the mind’s inside as it plays over the brilliant surface and darker depths of reality.", "This edition uses the text of the original British publication of ", ", which includes changes Woolf made that never appeared in the first or subsequent American editions.", "(Book Jacket Status: Jacketed)"], "author": "Virginia Woolf", "num_pages": "194", "awards": [], "places": ["London, England"], "character_names": ["Clarissa Dalloway", "Septimus Warren Smith", "Peter Walsh", "Sally Seton"], "language": "English", "publish_date": "2002-10-28 00:00:00", "ISBN": "0151009988"},
{"url": "https://www.goodreads.com/book/show/6149.Beloved", "num_ratings": "265,879", "num_reviews": "8,680", "avg_ratings": 3.79, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Literature", "Magical Realism"], "title": "Beloved", "description": ["Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by", "Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by the ghost of her baby, who died nameless and whose tombstone is engraved with a single word: Beloved. ", "Filled with bitter poetry and suspense as taut as a rope, ", " is a towering achievement by Nobel Prize laureate Toni Morrison."], "author": "Toni Morrison", "num_pages": "324", "awards": ["Pulitzer Prize for Fiction (1988)", "American Book Award (1988)", "Anisfield-Wolf Book Award (1988)", "National Book Critics Circle Award Nominee for Fiction (1987)", "Frederic G. Melcher Book Award (1988)", "National Book Award Finalist for Fiction (1987)"], "places": ["Delaware", "Ohio", "Kentucky"], "character_names": ["Baby Suggs", "Sethe", "Beloved", "Paul D Garner", "Denver"], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "1400033411"},
{"url": "https://www.goodreads.com/book/show/4989.The_Red_Tent", "num_ratings": "467,764", "num_reviews": "17,942", "avg_ratings": 4.16, "genres": ["Historical", "Historical Fiction", "Fiction", "Christian", "Religion"], "title": "The Red Tent", "description": ["Her name is Dinah. In the Bible, her life is only hinted at in a brief and violent detour within the more familiar chapters of the Book of Genesis that are about her father, Jacob, and his dozen sons. Told in Dinah's voice, this novel reveals the traditions and turmoils of ancient womanhood--the world of the red tent. It begins with the story of her mothers--Leah, Rachel,", "Her name is Dinah. In the Bible, her life is only hinted at in a brief and violent detour within the more familiar chapters of the Book of Genesis that are about her father, Jacob, and his dozen sons. Told in Dinah's voice, this novel reveals the traditions and turmoils of ancient womanhood--the world of the red tent. It begins with the story of her mothers--Leah, Rachel, Zilpah, and Bilhah--the four wives of Jacob. They love Dinah and give her gifts that sustain her through a hard-working youth, a calling to midwifery, and a new home in a foreign land. Dinah's story reaches out from a remarkable period of early history and creates an intimate connection with the past. Deeply affecting, ", " combines rich storytelling with a valuable achievement in modern fiction: a new view of biblical women's society."], "author": "Anita Diamant", "num_pages": "336", "awards": ["Book Sense Book of the Year Award for Adult Fiction (2001)", "Boston Author's Club Award (1998)"], "places": [], "character_names": ["Jacob (Bible)", "Isaac (Bible)", "Dinah (Bible)"], "language": "English", "publish_date": "2005-11-01 00:00:00", "ISBN": "0312353766"},
{"url": "https://www.goodreads.com/book/show/7763.The_Joy_Luck_Club", "num_ratings": "548,448", "num_reviews": "7,390", "avg_ratings": 3.91, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Cultural", "China", "Contemporary"], "title": "The Joy Luck Club", "description": ["In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her se", "In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her secrets, trying to unravel the truth about her life, the strings become more tangled, more entwined..."], "author": "Amy Tan", "num_pages": "288", "awards": ["California Book Award for Fiction (Gold) (1989)", "Los Angeles Times Book Prize Nominee for Fiction (1989)", "Northern California Book Awards for Fiction (1989)", "National Book Critics Circle Award Nominee for Fiction (1989)", "National Book Award Finalist for Fiction (1989)"], "places": ["San Francisco, California", "China"], "character_names": ["Suyuan Woo", "June Woo", "Lindo Jong", "Waverly Jong", "An-Mei Hsu", "Rose Hsu Jordan", "Ying-Ying St. Clair", "Lena St. Clair"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038095"},
{"url": "https://www.goodreads.com/book/show/37793.A_Doll_s_House", "num_ratings": "88,317", "num_reviews": "3,098", "avg_ratings": 3.7, "genres": ["Plays", "Classics", "Drama", "Fiction", "Academic", "School", "Plays", "Theatre"], "title": "A Doll's House", "author": "Henrik Ibsen", "num_pages": "122", "awards": [], "places": [], "character_names": ["Nora Helmer", "Torvald Helmer", "Krogstad", "Anne-Marie", "Helene Alving", "Osvald Alving", "Regine Engstrand", "Dr. Rank", "Mrs. Linde"], "language": "English", "publish_date": "2007-08-16 00:00:00", "ISBN": "1406914835"},
{"url": "https://www.goodreads.com/book/show/402045.The_Mists_of_Avalon", "num_ratings": "171,806", "num_reviews": "5,993", "avg_ratings": 4.12, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Mythology", "Arthurian", "Science Fiction Fantasy"], "title": "The Mists of Avalon", "description": ["Here is the magical legend of King Arthur, vividly retold through the eyes and lives of the women who wielded power from behind the throne. A spellbinding novel, an extraordinary literary achievement, THE MISTS OF AVALON will stay with you for a long time to come...."], "author": "Marion Zimmer Bradley", "num_pages": "884", "awards": ["Locus Award for Best Fantasy Novel (1984)"], "places": ["Camelot", "Avalon"], "character_names": ["Morgause", "Igraine", "Viviane", "Uther", "Gorlois", "Morgaine", "Gwenhwyfar", "Merlin", "Kevin, the Bard", "Lancelet", "Uriens", "Accolon", "King Arthur"], "language": "English", "publish_date": "1984-04-12 00:00:00", "ISBN": "0345350499"},
{"url": "https://www.goodreads.com/book/show/37415.Their_Eyes_Were_Watching_God", "num_ratings": "216,774", "num_reviews": "10,236", "avg_ratings": 3.88, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Academic", "School", "Cultural", "African American"], "title": "Their Eyes Were Watching God", "description": ["Fair and long-legged, independent and articulate, Janie Crawford sets out to be her own person -- no mean feat for a black woman in the '30s. Janie's quest for identity takes her through three marriages and into a journey back to her roots."], "author": "Zora Neale Hurston", "num_pages": "219", "awards": ["Audie Award for Solo Narration - Female (2001)"], "places": ["Florida", "Everglades, Florida"], "character_names": ["Eleanor", "Sam Watson", "Shelby", "Janie Starks", "Pheoby Watson", "Nanny", "Leafy", "Johnny Taylor", "Logan Killicks", "Jody Starks", "Tea Cake", "Pearl Stone", "Mrs. Sumpkins", "Lulu Moss", "Mis' Washburn", "Mr. Washburn", "Miss Nellie", "Mayrella"], "language": "English", "publish_date": "2006-05-30 00:00:00", "ISBN": "0061120065"},
{"url": "https://www.goodreads.com/book/show/99300.The_Yellow_Wallpaper_and_Other_Stories", "num_ratings": "70,644", "num_reviews": "1,594", "avg_ratings": 4.03, "genres": ["Classics", "Short Stories", "Fiction", "Feminism", "Horror", "Literature"], "title": "The Yellow Wallpaper and Other Stories", "description": ["Best known for the 1892 title story of this collection, a harrowing tale of a woman's descent into madness, Charlotte Perkins Gilman wrote more than 200 other short stories. Seven of her finest are reprinted here.", "Written from a feminist perspective, often focusing on the inferior status accorded to women by society, the tales include \"turned,\" an ironic story with a startl", "Best known for the 1892 title story of this collection, a harrowing tale of a woman's descent into madness, Charlotte Perkins Gilman wrote more than 200 other short stories. Seven of her finest are reprinted here.", "Written from a feminist perspective, often focusing on the inferior status accorded to women by society, the tales include \"turned,\" an ironic story with a startling twist, in which a husband seduces and impregnates a naïve servant; \"Cottagette,\" concerning the romance of a young artist and a man who's apparently too good to be true; \"Mr. Peebles' Heart,\" a liberating tale of a fiftyish shopkeeper whose sister-in-law, a doctor, persuades him to take a solo trip to Europe, with revivifying results; \"The Yellow Wallpaper\"; and three other outstanding stories.", "These charming tales are not only highly readable and full of humor and invention, but also offer ample food for thought about the social, economic, and personal relationship of men and women — and how they might be improved.", "The yellow wallpaper ", "Three Thanksgivings ", "The cottagette ", "Turned ", "Making a change ", "If I were a man ", "Mr. Peebles' heart."], "author": "Charlotte Perkins Gilman", "num_pages": "70", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-07-11 00:00:00", "ISBN": "0486298574"},
{"url": "https://www.goodreads.com/book/show/58345.The_Awakening", "num_ratings": "150,695", "num_reviews": "6,234", "avg_ratings": 3.64, "genres": ["Classics", "Fiction", "Feminism", "Academic", "School", "Literature"], "title": "The Awakening", "description": ["When first published in 1899, ", " shocked readers with its honest treatment of female marital infidelity. Audiences accustomed to the pieties of late Victorian romantic fiction were taken aback by Chopin's daring portrayal of a woman trapped in a stifling marriage, who seeks and finds passionate physical love outside the confines of her domestic situation.", "Aside f", "When first published in 1899, ", " shocked readers with its honest treatment of female marital infidelity. Audiences accustomed to the pieties of late Victorian romantic fiction were taken aback by Chopin's daring portrayal of a woman trapped in a stifling marriage, who seeks and finds passionate physical love outside the confines of her domestic situation.", "Aside from its unusually frank treatment of a then-controversial subject, the novel is widely admired today for its literary qualities. Edmund Wilson characterized it as a work \"quite uninhibited and beautifully written, which anticipates D. H. Lawrence in its treatment of infidelity.\" Although the theme of marital infidelity no longer shocks, few novels have plumbed the psychology of a woman involved in an illicit relationship with the perception, artistry, and honesty that Kate Chopin brought to ", "."], "author": "Kate Chopin", "num_pages": "195", "awards": [], "places": ["New Orleans, Louisiana", "Grand Isle, Louisiana"], "character_names": ["Edna Pontellier", "Léonce Pontellier", "Robert Lebrun", "Alcée Arobin", "Adèle Ratignolle", "Mademoiselle Reisz"], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0543898083"},
{"url": "https://www.goodreads.com/book/show/6514.The_Bell_Jar", "num_ratings": "485,489", "num_reviews": "18,037", "avg_ratings": 3.99, "genres": ["Classics", "Fiction", "Feminism"], "title": "The Bell Jar", "description": ["Sylvia Plath's shocking, realistic, and intensely emotional novel about a woman falling into the grip of insanity. ", "Esther Greenwood is brilliant, beautiful, enormously talented, and successful, but slowly going under—maybe for the last time. In her acclaimed and enduring masterwork, Sylvia Plath brilliantly draws the reader into Esther's breakdown with such intensity that", "Sylvia Plath's shocking, realistic, and intensely emotional novel about a woman falling into the grip of insanity. ", "Esther Greenwood is brilliant, beautiful, enormously talented, and successful, but slowly going under—maybe for the last time. In her acclaimed and enduring masterwork, Sylvia Plath brilliantly draws the reader into Esther's breakdown with such intensity that her insanity becomes palpably real, even rational—as accessible an experience as going to the movies. A deep penetration into the darkest and most harrowing corners of the human psyche, ", " is an extraordinary accomplishment and a haunting American classic."], "author": "Sylvia Plath", "num_pages": "244", "awards": [], "places": ["Boston, Massachusetts", "New York City, New York"], "character_names": ["Constantin", "Esther Greenwood", "Valerie", "Marco", "Mrs. Greenwood", "Buddy Willard", "Doctor Nolan", "Joan Gilling", "Jay Cee", "Betsy", "Irwin", "Doctor Gordon", "Philomena Guinea", "Mrs. Willard", "Lenny Shepherd", "Dodo Conway", "Eric", "Doreen"], "language": "English", "publish_date": "2006-08-16 00:00:00", "ISBN": "0061148512"},
{"url": "https://www.goodreads.com/book/show/11486.The_Color_Purple", "num_ratings": "435,722", "num_reviews": "11,087", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "295", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "0671727796"},
{"url": "https://www.goodreads.com/book/show/10210.Jane_Eyre", "num_ratings": "1,364,400", "num_reviews": "34,237", "avg_ratings": 4.11, "genres": ["Classics", "Fiction", "Romance"], "title": "Jane Eyre", "description": [" ", " "], "author": "Charlotte Brontë", "num_pages": "507", "awards": [], "places": ["Thornfield", "England"], "character_names": ["Jane Eyre", "Bertha Mason", "Grace Poole", "Blanche Ingram", "Adele Varens", "St. John Rivers", "Helen Burns", "Richard Mason", "Diana Rivers", "Mary Rivers", "Maria Temple", "Robert Brocklehurst", "Sarah Reed", "Georgiana Reed", "Eliza Reed", "Bessie Lee", "Alice Fairfax", "Rosamond Oliver", "Edward Rochester", "John Eyre", "Celine Varens"], "language": "English", "publish_date": "2003-02-04 00:00:00", "ISBN": "0142437204"}
]