[
{"url": "https://www.goodreads.com/book/show/19288043-gone-girl", "num_ratings": "1,818,705", "num_reviews": "125,221", "avg_ratings": 4.05, "genres": ["Fiction", "Mystery", "Thriller", "Mystery", "Crime", "Suspense"], "title": "Gone Girl", "description": ["On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne’s fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick’s clever and beautiful wife disappears. Husband-of-the-Year Nick isn’t doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife’s head, but passages from Amy's dia", "On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne’s fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick’s clever and beautiful wife disappears. Husband-of-the-Year Nick isn’t doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife’s head, but passages from Amy's diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge", " Under mounting pressure from the police and the media—as well as Amy’s fiercely doting parents—the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he’s definitely bitter—but is he really a killer? "], "author": "Gillian Flynn", "num_pages": "415", "awards": ["Barry Award Nominee for Best Novel (2013)", "Anthony Award Nominee for Best Novel (2013)", "Romantic Times Reviewers' Choice Award (RT Award) for Suspense/Thriller Novel (2012)", "Shirley Jackson Award Nominee for Novel (Finalist) (2012)", "Edgar Award Nominee for Best Novel (2013)", "Puddly Award for Fiction (2013)", "Women's Prize for Fiction Nominee for Longlist (2013)", "Grand Prix des lectrices de Elle for roman policier (2013)", "Goodreads Choice Award for Best Mystery & Thriller (2012)"], "places": ["North Carthage, Missouri", "Missouri"], "character_names": ["Nick Dunne", "Amy Elliot Dunne", "Margo \"Go\" Dunne", "Rand Elliot", "Marybeth Elliot", "Jim Gilpin", "Rhonda Boney", "Tanner Bolt", "Andie Hardy", "Desi Collings"], "language": "English", "publish_date": "2014-04-22 00:00:00", "ISBN": "0307588378"},
{"url": "https://www.goodreads.com/book/show/6534.Postmortem", "num_ratings": "186,063", "num_reviews": "2,457", "avg_ratings": 4.01, "genres": ["Mystery", "Mystery", "Crime", "Fiction", "Thriller", "Thriller", "Mystery Thriller"], "title": "Postmortem", "description": ["Under cover of night in Richmond, Virginia, a human monster strikes, leaving a gruesome trail of stranglings that has paralyzed the city. Medical examiner Kay Scarpetta suspects the worst: a deliberate campaign by a brilliant serial killer whose signature offers precious few clues. With an unerring eye, she calls on the latest advances in forensic research to unmask the ma", "Under cover of night in Richmond, Virginia, a human monster strikes, leaving a gruesome trail of stranglings that has paralyzed the city. Medical examiner Kay Scarpetta suspects the worst: a deliberate campaign by a brilliant serial killer whose signature offers precious few clues. With an unerring eye, she calls on the latest advances in forensic research to unmask the madman. But this investigation will test Kay like no other, because it's being sabotaged from within—and someone wants her dead."], "author": "Patricia Cornwell", "num_pages": "342", "awards": ["Macavity Award for Best First Mystery Novel (1991)", "Anthony Award for Best First Novel (1991)", "CWA New Blood Dagger (1990)", "Edgar Award for Best First Novel (1991)", "John Creasey Memorial Award (1990)", "Prix du Roman d'Aventures (1992)"], "places": ["Richmond, Virginia", "Virginia"], "character_names": ["Kay Scarpetta", "Pete Marino", "Lucy Farinelli", "Benton Wesley"], "language": "English", "publish_date": "2003-12-30 00:00:00", "ISBN": "0743477154"},
{"url": "https://www.goodreads.com/book/show/16131077-the-shining-girls", "num_ratings": "34,516", "num_reviews": "4,734", "avg_ratings": 3.49, "genres": ["Fiction", "Mystery", "Thriller", "Science Fiction", "Time Travel", "Horror", "Science Fiction", "Mystery", "Crime", "Fantasy"], "title": "The Shining Girls", "description": ["The Girl Who Wouldn't Die Hunts the Killer Who Shouldn't Exist", "Harper Curtis is a killer who stepped out of the past. Kirby Mazrachi is the girl who was never meant to have a future.", "Kirby is the last shining girl, one of the bright young women, burning with potential, whose lives Harp", "The Girl Who Wouldn't Die Hunts the Killer Who Shouldn't Exist", "Harper Curtis is a killer who stepped out of the past. Kirby Mazrachi is the girl who was never meant to have a future.", "Kirby is the last shining girl, one of the bright young women, burning with potential, whose lives Harper is destined to snuff out after he stumbles on a House in Depression-era Chicago that opens on to other times. ", "At the urging of the House, Harper inserts himself into the lives of the shining girls, waiting for the perfect moment to strike. He's the ultimate hunter, vanishing into another time after each murder, untraceable-until one of his victims survives.", "Determined to bring her would-be killer to justice, Kirby joins the ", " to work with the ex-homicide reporter, Dan Velasquez, who covered her case. Soon Kirby finds herself closing in on the impossible truth . . . ", " is a masterful twist on the serial killer tale: a violent quantum leap featuring a memorable and appealing heroine in pursuit of a deadly criminal."], "author": "Lauren Beukes", "num_pages": "368", "awards": ["Strand Critics Award  for Best Novel (2013)", "Tähtivaeltaja Award Nominee (2014)", "CWA Gold Dagger Award Nominee (2013)", "Goodreads Choice Award Nominee (2013)"], "places": ["Chicago, Illinois", "Chicago, Illinois", "Illinois"], "character_names": [], "language": "English", "publish_date": "2013-06-04 00:00:00", "ISBN": "0316216852"},
{"url": "https://www.goodreads.com/book/show/16142191-until-you-re-mine", "num_ratings": "6,893", "num_reviews": "983", "avg_ratings": 3.89, "genres": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller", "Psychological Thriller", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Until You're Mine", "description": ["Claudia Morgan-Brown finally has it all. Pregnant with a much-wanted first baby of her own, she has a happily established family of two small step-sons and a loving husband with a great career. But she is also committed to her full-time job as a social worker, and her husband tra", "Claudia Morgan-Brown finally has it all. Pregnant with a much-wanted first baby of her own, she has a happily established family of two small step-sons and a loving husband with a great career. But she is also committed to her full-time job as a social worker, and her husband travels often. So when Claudia hires Zoe to help her around the house in anticipation of the baby’s arrival, it seems like the answer to her prayers. But despite Zoe's glowing recommendations and instant rapport with the children, there's something about her that Claudia cannot trust.", "Moreover, there has been a series of violent attacks on pregnant women in the area, and Claudia becomes acutely aware of her vulnerability. With her husband out of town for work and her family far away, who will be there to protect her? And why does she feel unsettled about Zoe? Realizing appearances can be deceiving even in her seemingly perfect world, Claudia digs deeper into Zoe’s blurry past and begins to wonder – how far would someone go to have a child of her own?", "Riveting from its very first pages, ", " is a multilayered masterwork of twisted, psychological suspense. Readers of ", " and ", " will be enthralled by this multilayered novel, featuring a twisted plot that ends in a breathtaking and shocking finale."], "author": "Samantha Hayes", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-15 00:00:00", "ISBN": "1780891482"},
{"url": "https://www.goodreads.com/book/show/28815474-the-couple-next-door", "num_ratings": "167,124", "num_reviews": "15,215", "avg_ratings": 3.76, "genres": ["Mystery", "Thriller", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "The Couple Next Door", "description": ["Anne and Marco Conti seem to have it all--a loving relationship, a wonderful home, and their beautiful baby, Cora. But one night when they are at a dinner", "Anne and Marco Conti seem to have it all--a loving relationship, a wonderful home, and their beautiful baby, Cora. But one night when they are at a dinner party next door, a terrible crime is committed. Suspicion immediately focuses on the parents. But the truth is a much more complicated story.", "Inside the curtained house, an unsettling account of what actually happened unfolds. Detective Rasbach knows that the panicked couple is hiding something. Both Anne and Marco soon discover that the other is keeping secrets, secrets they've kept for years.", "What follows is the nerve-racking unraveling of a family--a chilling tale of deception, duplicity, and unfaithfulness that will keep you breathless until the final shocking twist."], "author": "Shari Lapena", "num_pages": "308", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-23 00:00:00", "ISBN": "0735221081"},
{"url": "https://www.goodreads.com/book/show/32263.The_Surgeon", "num_ratings": "109,583", "num_reviews": "3,559", "avg_ratings": 4.1, "genres": ["Mystery", "Mystery", "Crime", "Thriller", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "The Surgeon", "description": ["A killer who targets lone women, who breaks into their apartments and performs terrifying ritualistic acts of torture on them before finishing them off. His surgical skills lead police to suspect he is a physician - a physician who, instead of saving lives, takes them.", "But as homicide detective Thomas Moore and his partner Jane Riz", "A killer who targets lone women, who breaks into their apartments and performs terrifying ritualistic acts of torture on them before finishing them off. His surgical skills lead police to suspect he is a physician - a physician who, instead of saving lives, takes them.", "But as homicide detective Thomas Moore and his partner Jane Rizzoli begin their investigation, they make a startling discovery. Closely linked to these killings is Catherine Cordell, a beautiful doctor with a mysterious past. Two years ago she was subjected to a horrifying rape and shot her attacker dead.", "Now the man she believes she killed seems to be stalking her once again, and this time he knows exactly where to find her..."], "author": "Tess Gerritsen", "num_pages": "416", "awards": ["RITA Award by Romance Writers of America for Best Romantic Suspense (2002)"], "places": ["Boston, Massachusetts"], "character_names": ["Jane Rizzoli", "Thomas Moore", "Catherine Cordell"], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "055381706X"},
{"url": "https://www.goodreads.com/book/show/18007535-the-winter-people", "num_ratings": "36,376", "num_reviews": "5,309", "avg_ratings": 3.77, "genres": ["Horror", "Fiction", "Mystery", "Thriller", "Fantasy", "Paranormal", "Historical", "Historical Fiction", "Suspense"], "title": "The Winter People", "description": ["West Hall, Vermont, has always been a town of strange disappearances and old legends. The most mysterious is that of Sara Harrison Shea, who, in 1908, was found dead in the field behind her house just months after the tragic death of her daughter.", "Now, in present day, nineteen-year-old Ruthie lives in Sara's farmhouse with her mother, Alice, and her younger sister. Alice ha", "West Hall, Vermont, has always been a town of strange disappearances and old legends. The most mysterious is that of Sara Harrison Shea, who, in 1908, was found dead in the field behind her house just months after the tragic death of her daughter.", "Now, in present day, nineteen-year-old Ruthie lives in Sara's farmhouse with her mother, Alice, and her younger sister. Alice has always insisted that they live off the grid, a decision that has weighty consequences when Ruthie wakes up one morning to find that Alice has vanished. In her search for clues, she is startled to find a copy of Sara Harrison Shea's diary hidden beneath the floorboards of her mother's bedroom. As Ruthie gets sucked into the historical mystery, she discovers that she's not the only person looking for someone that they've lost. But she may be the only one who can stop history from repeating itself."], "author": "Jennifer  McMahon", "num_pages": "317", "awards": ["Goodreads Choice Award Nominee for Horror (2014)"], "places": ["Vermont"], "character_names": [], "language": "English", "publish_date": "2014-02-11 00:00:00", "ISBN": "0385538499"},
{"url": "https://www.goodreads.com/book/show/657034.Heartsick", "num_ratings": "31,971", "num_reviews": "2,705", "avg_ratings": 3.92, "genres": ["Mystery", "Thriller", "Fiction", "Mystery", "Crime", "Suspense", "Horror"], "title": "Heartsick", "author": "Chelsea Cain", "num_pages": "336", "awards": [], "places": ["Portland, Oregon", "Oregon"], "character_names": ["Archie Sheridan", "Susan Ward", "Gretchen Lowell"], "language": "English", "publish_date": "2007-09-04 00:00:00", "ISBN": "0312368461"},
{"url": "https://www.goodreads.com/book/show/23638955-pretty-baby", "num_ratings": "36,638", "num_reviews": "3,673", "avg_ratings": 3.74, "genres": ["Fiction", "Mystery", "Thriller", "Suspense", "Thriller", "Mystery Thriller", "Audiobook"], "title": "Pretty Baby", "description": ["She sees the teenage girl on the train platform, standing in the pouring rain, clutching an infant in her arms. She boards a train and is whisked away. But she can't get the girl out of her head...", "Heidi Wood has always been a charitab", "She sees the teenage girl on the train platform, standing in the pouring rain, clutching an infant in her arms. She boards a train and is whisked away. But she can't get the girl out of her head...", "Heidi Wood has always been a charitable woman: she works for a nonprofit, takes in stray cats. Still, her husband and daughter are horrified when Heidi returns home one day with a young woman named Willow and her four-month-old baby in tow. Disheveled and apparently homeless, this girl could be a criminal—or worse. But despite her family's objections, Heidi invites Willow and the baby to take refuge in their home.", "Heidi spends the next few days helping Willow get back on her feet, but as clues into Willow's past begin to surface, Heidi is forced to decide how far she's willing to go to help a stranger. What starts as an act of kindness quickly spirals into a story far more twisted than anyone could have anticipated."], "author": "Mary Kubica", "num_pages": "380", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-28 00:00:00", "ISBN": "0778317706"},
{"url": "https://www.goodreads.com/book/show/237209.In_the_Woods", "num_ratings": "233,429", "num_reviews": "17,230", "avg_ratings": 3.75, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Thriller", "Mystery Thriller"], "title": "In the Woods", "description": ["The bestselling debut with over a million copies sold that launched Tana French, “required reading for anyone who appreciates tough, unflinching intelligence and ingenious plotting” (The New York Times), who is “the most interesting, most important crime novelist to emerge in the past 10 years” (The Washington Post) ", "Look out for Tana French’s newest novel, The Trespasser,", "The bestselling debut with over a million copies sold that launched Tana French, “required reading for anyone who appreciates tough, unflinching intelligence and ingenious plotting” (The New York Times), who is “the most interesting, most important crime novelist to emerge in the past 10 years” (The Washington Post) ", "Look out for Tana French’s newest novel, The Trespasser, available now", "As dusk approaches a small Dublin suburb in the summer of 1984, mothers begin to call their children home. But on this warm evening, three children do not return from the dark and silent woods. When the police arrive, they find only one of the children gripping a tree trunk in terror, wearing blood-filled sneakers, and unable to recall a single detail of the previous hours.", "Twenty years later, the found boy, Rob Ryan, is a detective on the Dublin Murder Squad and keeps his past a secret. But when a twelve-year-old girl is found murdered in the same woods, he and Detective Cassie Maddox—his partner and closest friend—find themselves investigating a case chillingly similar to the previous unsolved mystery. Now, with only snippets of long-buried memories to guide him, Ryan has the chance to uncover both the mystery of the case before him and that of his own shadowy past.", "Richly atmospheric and stunning in its complexity, In the Woods is utterly convincing and surprising to the end.", "Winner of the Anthony, Macavity, and Barry Awards for Best First Novel, and the Edgar Award for Best First Novel by an American Author", "Finalist for Los Angeles Times Book Prize"], "author": "Tana French", "num_pages": "429", "awards": ["Barry Award for Best First Novel (2008)", "Macavity Award for Best First Mystery Novel (2008)", "Anthony Award for Best First Novel (2008)", "Edgar Award for Best First Novel by an American Author (2008)"], "places": ["Dublin"], "character_names": ["Detective Cassie Maddox", "Detective Rob (Adam) Ryan", "Detective Sam O'Neill", "Detective Quigley", "Superintendent O'Kelly"], "language": "English", "publish_date": "2007-05-17 00:00:00", "ISBN": "0670038601"},
{"url": "https://www.goodreads.com/book/show/16158525-the-never-list", "num_ratings": "11,059", "num_reviews": "1,595", "avg_ratings": 3.61, "genres": ["Thriller", "Fiction", "Mystery", "Horror", "Suspense", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "The Never List", "description": ["The most relentless, deeply disturbing thriller writer since Jeffery Deaver and Gillian Flynn", "For years, best friends Sarah and Jennifer kept what they called the “Never List”: a list of actions to be avoided, for safety’s sake, at all costs. But one night, against their best instincts, they accept a cab ride with grave, everlasting consequences. For the next three years, t", "The most relentless, deeply disturbing thriller writer since Jeffery Deaver and Gillian Flynn", "For years, best friends Sarah and Jennifer kept what they called the “Never List”: a list of actions to be avoided, for safety’s sake, at all costs. But one night, against their best instincts, they accept a cab ride with grave, everlasting consequences. For the next three years, they are held captive with two other girls in a dungeon-like cellar by a connoisseur of sadism.", "Ten years later, at thirty-one, Sarah is still struggling to resume a normal life, living as a virtual recluse under a new name, unable to come to grips with the fact that Jennifer didn’t make it out of that cellar. Now, her abductor is up for parole and Sarah can no longer ignore the twisted letters he sends from jail.", "Finally, Sarah decides to confront her phobias and the other survivors—who hold their own deep grudges against her. When she goes on a cross-country chase that takes her into the perverse world of BDSM, secret cults, and the arcane study of torture, she begins unraveling a mystery more horrifying than even she could have imagined.", "A shocking, blazingly fast read, Koethi Zan’s debut is a must for fans of Karin Slaughter, Laura Lippman, and S.J. Watson."], "author": "Koethi Zan", "num_pages": "303", "awards": [], "places": [], "character_names": ["Jennifer", "Sarah Farber", "Jack Derber", "Adele Hinton", "Noah Philben", "Sylvia Dunham", "Dan Dunham", "Erline Dunham", "Scott Weber", "Helen Watson", "Tracy Elwes", "Christine McMasters", "David Stiller", "Jim McCordy", "Ray Stewart"], "language": "English", "publish_date": "2013-07-16 00:00:00", "ISBN": "0670026514"},
{"url": "https://www.goodreads.com/book/show/16119032-blue-coyote-motel", "num_ratings": "659", "num_reviews": "163", "avg_ratings": 3.66, "genres": ["Thriller", "Suspense", "Thriller", "Psychological Thriller", "Romance", "Thriller", "Mystery Thriller"], "title": "Blue Coyote Motel", "description": ["Would you take an anti-aging hormone? What if you could keep your youth? If someone you knew was terrified of aging, and you'd invented the hormone, would you give it to them? Even if it meant discovery would cause you to lose your chance of winning the Nobel Prize?", "Blue Coyote Motel is a suspense love story which begins in the barrios of Southern California and spans the g", "Would you take an anti-aging hormone? What if you could keep your youth? If someone you knew was terrified of aging, and you'd invented the hormone, would you give it to them? Even if it meant discovery would cause you to lose your chance of winning the Nobel Prize?", "Blue Coyote Motel is a suspense love story which begins in the barrios of Southern California and spans the globe in such diverse locations as Provence, South America, and the Himalayas. The beautiful Latina, Maria, and her husband, Jeffrey, a scientist fired from a prestigious laboratory, struggle to build a new life in a remote Southern California desert areas as owners of the motel.", "Along with the anti-aging hormone, Jeffrey invents a \"feel-good\" wonder drug to help Maria with her depression. As Jeffrey becomes insane he begins to experiment with the wonder drug. Six wayward travelers, including an alcoholic priest, a couple who own gold mines in Brazil, a depressed widow, a struggling salesman, and a Native American pediatrician find themselves spending the night at the small motel. The next morning they wake up feeling better than ever. Has Jeffrey's miracle drug delivered? Or is the nightmare of addiction only beginning?", "Blue Coyote Motel presents an engaging look at the human frailties present in all of us."], "author": "Dianne Harman", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/28187230-the-woman-in-cabin-10", "num_ratings": "206,099", "num_reviews": "19,959", "avg_ratings": 3.68, "genres": ["Mystery", "Fiction", "Thriller", "Suspense", "Thriller", "Mystery Thriller"], "title": "The Woman in Cabin 10", "description": ["Lo Blacklock, a journalist who writes for a travel magazine, has just been given the assignment of a lifetime: a week on a luxury cruise with only a handful of cabins. The sky is clear, the waters calm, and the veneered, select guests jovial as the exclusive cruise ship, the Aurora, begins her voyage in the picturesque North Sea. At first, Lo's stay is nothing but pleasant", "Lo Blacklock, a journalist who writes for a travel magazine, has just been given the assignment of a lifetime: a week on a luxury cruise with only a handful of cabins. The sky is clear, the waters calm, and the veneered, select guests jovial as the exclusive cruise ship, the Aurora, begins her voyage in the picturesque North Sea. At first, Lo's stay is nothing but pleasant: the cabins are plush, the dinner parties are sparkling, and the guests are elegant. But as the week wears on, frigid winds whip the deck, gray skies fall, and Lo witnesses what she can only describe as a dark and terrifying nightmare: a woman being thrown overboard. The problem? All passengers remain accounted for and so, the ship sails on as if nothing has happened, despite Lo's desperate attempts to convey that something (or someone) has gone terribly, terribly wrong."], "author": "Ruth Ware", "num_pages": "340", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller (2016)", "Book of the Month Book of the Year Award Nominee (2016)", "Theakston Old Peculier Crime Novel of the Year Nominee for Longlist (2017)"], "places": ["London, England"], "character_names": [], "language": "English", "publish_date": "2016-07-19 00:00:00", "ISBN": "1501132938"},
{"url": "https://www.goodreads.com/book/show/25574782-pretty-girls", "num_ratings": "115,553", "num_reviews": "11,183", "avg_ratings": 3.98, "genres": ["Mystery", "Thriller", "Fiction", "Thriller", "Mystery Thriller", "Mystery", "Crime", "Suspense", "Audiobook"], "title": "Pretty Girls", "description": ["#1 internationally bestselling author Karin Slaughter returns with a sophisticated and chilling psychological thriller of dangerous secrets, cold vengeance, and unexpected absolution, in which two estranged sisters must come together to find truth about two harrowing tragedies, twenty years apart, that devastate their lives.", "Sisters. Strangers. Survivors.", "More than twenty ye", "#1 internationally bestselling author Karin Slaughter returns with a sophisticated and chilling psychological thriller of dangerous secrets, cold vengeance, and unexpected absolution, in which two estranged sisters must come together to find truth about two harrowing tragedies, twenty years apart, that devastate their lives.", "Sisters. Strangers. Survivors.", "More than twenty years ago, Claire and Lydia's teenaged sister Julia vanished without a trace. The two women have not spoken since, and now their lives could not be more different. Claire is the glamorous trophy wife of an Atlanta millionaire. Lydia, a single mother, dates an ex-con and struggles to make ends meet. But neither has recovered from the horror and heartbreak of their shared loss—a devastating wound that's cruelly ripped open when Claire's husband is killed.", "The disappearance of a teenage girl and the murder of a middle-aged man, almost a quarter-century apart: what could connect them? Forming a wary truce, the surviving sisters look to the past to find the truth, unearthing the secrets that destroyed their family all those years ago . . . and uncovering the possibility of redemption, and revenge, where they least expect it.", "Powerful, poignant, and utterly gripping, packed with indelible characters and unforgettable twists, Pretty Girls is a masterful thriller from one of the finest suspense writers working today."], "author": "Karin Slaughter", "num_pages": "688", "awards": ["ITW Thriller Award Nominee for Best Hardcover Novel (2016)", "Goodreads Choice Award Nominee for Mystery & Thriller (2015)"], "places": ["Atlanta, Georgia"], "character_names": ["Claire Scott", "Lydia Carroll"], "language": "English", "publish_date": "2015-09-29 00:00:00", "ISBN": "0062430874"},
{"url": "https://www.goodreads.com/book/show/22609317-luckiest-girl-alive", "num_ratings": "115,119", "num_reviews": "10,503", "avg_ratings": 3.49, "genres": ["Fiction", "Mystery", "Thriller", "Contemporary"], "title": "Luckiest Girl Alive", "description": ["HER PERFECT LIFE IS A PERFECT LIE.", "As a teenager at the prestigious Bradley School, Ani FaNelli endured a shocking, public humiliation that left her desperate to reinvent herself. Now, with a glamorous job, expensive wardrobe, and handsome blue blood fiancé, she’s this close to living the perfect life she’s worked so hard to achieve.", "But Ani has a secret.", "There’s something el", "HER PERFECT LIFE IS A PERFECT LIE.", "As a teenager at the prestigious Bradley School, Ani FaNelli endured a shocking, public humiliation that left her desperate to reinvent herself. Now, with a glamorous job, expensive wardrobe, and handsome blue blood fiancé, she’s this close to living the perfect life she’s worked so hard to achieve.", "But Ani has a secret.", "There’s something else buried in her past that still haunts her, something private and painful that threatens to bubble to the surface and destroy everything.", "With a singular voice and twists you won’t see coming, Luckiest Girl Alive explores the unbearable pressure that so many women feel to “have it all” and introduces a heroine whose sharp edges and cutthroat ambition have been protecting a scandalous truth, and a heart that's bigger than it first appears.", "The question remains: will breaking her silence destroy all that she has worked for—or, will it at long last, set Ani free?"], "author": "Jessica Knoll", "num_pages": "352", "awards": ["Edgar Award Nominee for Best First Novel (2016)", "Goodreads Choice Award Nominee for Mystery & Thriller, and for Goodreads Debut Author (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-12 00:00:00", "ISBN": "1476789630"},
{"url": "https://www.goodreads.com/book/show/21448484-cornered-coyote", "num_ratings": "248", "num_reviews": "51", "avg_ratings": 4.47, "genres": ["Mystery", "Drama", "Romance", "Romantic Suspense", "Suspense"], "title": "Cornered Coyote", "description": ["A Gripping tale that is as Sweet as a Ballerina and as Pugnacious as a Pitbull!", "The silver bird gleamed in the blue sky, as the early morning sun bathed it in soft golden hues. Flight 714 was on the last leg of its journey, having burned close to fifty thousand gallons of jet fuel on its trans-Atlantic flight from Paris to Los Angeles. ", "Dianne Harman’s third and final book i", "A Gripping tale that is as Sweet as a Ballerina and as Pugnacious as a Pitbull!", "The silver bird gleamed in the blue sky, as the early morning sun bathed it in soft golden hues. Flight 714 was on the last leg of its journey, having burned close to fifty thousand gallons of jet fuel on its trans-Atlantic flight from Paris to Los Angeles. ", "Dianne Harman’s third and final book in the Coyote series, Cornered Coyote, is a throbbing tale of love, courage and passion. The frailties of human nature are deftly brought into the spotlight, as insecurity, jealousy, hatred, contempt and xenophobia rear their ugly head from time to time.", "Follow the loveable yet eccentric private investigator, Slade Kelly, (a readers' favorite), as he tries to save Maria's sweet ass from seemingly insurmountable odds.", "The story moves at a rapid pace, from the ghettos of Chicago to the beaches of Florida, from the streets of Los Angeles to the lush gardens of New York city. Each twist and turn comes with its own cast of colorful characters, from sleazy men in the mafia to hot, desperate women, who will do anything to make it big, in a world that is always trying to keep them small."], "author": "Dianne Harman", "num_pages": "210", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-24 00:00:00", "ISBN": "0988934981"},
{"url": "https://www.goodreads.com/book/show/23014603-those-girls", "num_ratings": "15,851", "num_reviews": "2,049", "avg_ratings": 3.88, "genres": ["Thriller", "Fiction", "Mystery", "Suspense", "Thriller", "Mystery Thriller"], "title": "Those Girls", "description": ["Chevy Stevens is back with her most powerful, emotional thriller yet— a story of survival…and revenge. ", "Life has never been easy for the three Campbell sisters. Jess, Courtney, and Dani live on a remote ranch in Western Canada where they work hard and try to stay out of the way of their father’s fists. One night, a fight gets out of hand and the sisters are forced to go on", "Chevy Stevens is back with her most powerful, emotional thriller yet— a story of survival…and revenge. ", "Life has never been easy for the three Campbell sisters. Jess, Courtney, and Dani live on a remote ranch in Western Canada where they work hard and try to stay out of the way of their father’s fists. One night, a fight gets out of hand and the sisters are forced to go on the run, only to get caught in an even worse nightmare when their truck breaks down in a small town. Events spiral out of control and a chance encounter with the wrong people leaves them in a horrific and desperate situation. They are left with no choice but to change their names and create new lives. ", "Eighteen years later, they are still trying to forget what happened that summer when one of the sisters goes missing and they are pulled back into their past. ", "This time there’s nowhere left to run. ", "As much of a thriller as it is a deep exploration of the bonds among sisters, THOSE GIRLS is an unforgettable portrait of desperation, loyalty, and evil."], "author": "Chevy Stevens", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-07-07 00:00:00", "ISBN": "1250034582"},
{"url": "https://www.goodreads.com/book/show/1088704.Sleeping_with_the_Enemy", "num_ratings": "7,928", "num_reviews": "134", "avg_ratings": 4.01, "genres": ["Thriller", "Suspense", "Fiction", "Mystery", "Mystery", "Crime", "Media Tie In", "Movies"], "title": "Sleeping with the Enemy", "description": ["She is a stranger in a small town. She changed her name. Her looks. Her life. All to escape the most dangerous man she ever met: her husband."], "author": "Nancy     Price", "num_pages": "309", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1991-02-01 00:00:00", "ISBN": "0425127923"},
{"url": "https://www.goodreads.com/book/show/27833860-the-girl-before", "num_ratings": "11,378", "num_reviews": "1,126", "avg_ratings": 3.98, "genres": ["Thriller", "Fiction", "Mystery", "Thriller", "Mystery Thriller", "Thriller", "Psychological Thriller", "Suspense"], "title": "The Girl Before", "description": ["In this powerful psychological suspense debut, when a woman’s life is shattered, she is faced with a devastating question: What if everything she thought was normal and good and true . . . wasn’t?", " Clara Lawson is torn from her life in an instant. Without warning, her home is invaded by armed men, and she finds herself separated from her beloved husband and daughters. The l", "In this powerful psychological suspense debut, when a woman’s life is shattered, she is faced with a devastating question: What if everything she thought was normal and good and true . . . wasn’t?", " Clara Lawson is torn from her life in an instant. Without warning, her home is invaded by armed men, and she finds herself separated from her beloved husband and daughters. The last thing her husband yells to her is to ", ".", " In chapters that alternate between past and present, the novel slowly unpeels the layers of Clara’s fractured life. We see her growing up, raised with her sisters by the stern Mama and Papa G, becoming a poised and educated young woman, falling desperately in love with the forbidden son of her adoptive parents. We see her now, sequestered in an institution, questioned by men and women who call her a different name—Diana—and who accuse her husband of unspeakable crimes. As recollections of her past collide with new revelations, Clara must question everything she thought she knew, to come to terms with the truth of her history and to summon the strength to navigate her future."], "author": "Rena Olsen", "num_pages": "314", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-09 00:00:00", "ISBN": "1101982357"},
{"url": "https://www.goodreads.com/book/show/25644437-find-her", "num_ratings": "29,976", "num_reviews": "2,617", "avg_ratings": 4.13, "genres": ["Mystery", "Fiction", "Suspense", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Find Her", "description": ["Seven years ago, carefree college student Flora Dane was kidnapped while on spring break. For 472 days, Flora learned just how much one person can endure.", "Miraculously alive after her ordeal, Flora has spent the past five years reacquainting herself with the rhythms", "Seven years ago, carefree college student Flora Dane was kidnapped while on spring break. For 472 days, Flora learned just how much one person can endure.", "Miraculously alive after her ordeal, Flora has spent the past five years reacquainting herself with the rhythms of normal life, working with her FBI victim advocate, Samuel Keynes. She has a mother who's never stopped loving her, a brother who is scared of the person she's become, and a bedroom wall covered with photos of other girls who've never made it home.", "When Boston detective D. D. Warren is called to the scene of a crime--a dead man and the bound, naked woman who killed him--she learns that Flora has tangled with three other suspects since her return to society. Is Flora a victim or a vigilante? And with her firsthand knowledge of criminal behavior, could she hold the key to rescuing a missing college student whose abduction has rocked Boston? When Flora herself disappears, D.D. realizes a far more sinister predator is out there. One who's determined that this time, Flora Dane will never escape. And now it is all up to D. D. Warren to"], "author": "Lisa Gardner", "num_pages": "402", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-02-09 00:00:00", "ISBN": "0525954570"},
{"url": "https://www.goodreads.com/book/show/18912774-virtual-justice", "num_ratings": "352", "num_reviews": "36", "avg_ratings": 4.27, "genres": ["Anthologies", "Collections"], "title": "Virtual Justice", "description": ["P.I. Lorne Warner is back in Virtual Justice, the seventh installment in the Justice series.", "The strangled body of a gorgeous woman draws Lorne into an intricate investigation that swiftly expands when a second beautiful innocent is murdered. Victims are being plucked from internet dating sites. A serial killer is on the loose. But when a third victim is discovered—this one", "P.I. Lorne Warner is back in Virtual Justice, the seventh installment in the Justice series.", "The strangled body of a gorgeous woman draws Lorne into an intricate investigation that swiftly expands when a second beautiful innocent is murdered. Victims are being plucked from internet dating sites. A serial killer is on the loose. But when a third victim is discovered—this one male—Lorne is forced to admit her worst fears… she is on the trail of a serial killer duo.", "Lorne’s personal life grows complicated as her sister, Jade, struggles to come to terms with their father’s death. Lorne suggests drastic measures to cure Jade's grief.", "The answers are out there, but will Lorne solve the crimes and find the killer before more victims die?"], "author": "M.A. Comley", "num_pages": "179", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30239893-anything-for-him", "num_ratings": "311", "num_reviews": "65", "avg_ratings": 3.99, "genres": ["Thriller", "Thriller", "Psychological Thriller", "Mystery", "Fiction", "Thriller", "Mystery Thriller"], "title": "Anything for Him", "description": ["Vulnerable and alone after the tragic loss of her parents Felicity finds herself in a relationship with volatile and troubled Jay.", "Reluctantly drawn in to a twisted revenge plan against Jay’s former best friend, Felicity soon becomes trapped, and as Jay turns increasingly controlling and abusive she questions everything he has told her about his past and his former girlfrie", "Vulnerable and alone after the tragic loss of her parents Felicity finds herself in a relationship with volatile and troubled Jay.", "Reluctantly drawn in to a twisted revenge plan against Jay’s former best friend, Felicity soon becomes trapped, and as Jay turns increasingly controlling and abusive she questions everything he has told her about his past and his former girlfriend Sammie. But when she wants to expose the truth she comes up against an even greater threat: Someone obsessed and dangerous. Someone who has always been in the background of Jay’s life. Someone who will do anything for him."], "author": "L.K. Chapman", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-01-23 00:00:00"},
{"url": "https://www.goodreads.com/book/show/39868570-what-happened-to-michael", "num_ratings": "24", "num_reviews": "12", "avg_ratings": 4.33, "genres": [], "title": "What Happened to Michael", "description": ["When her five year old son, Michael, is kidnapped and murdered, Ann finds herself willing to do anything to find out the truth. Trapped in an unhappy marriage and burdened by the memories of her only son, she tries to piece together exactly what happened.", "But when another child is taken, she realises she must confront her past and overcome her grief, in order to find out wh", "When her five year old son, Michael, is kidnapped and murdered, Ann finds herself willing to do anything to find out the truth. Trapped in an unhappy marriage and burdened by the memories of her only son, she tries to piece together exactly what happened.", "But when another child is taken, she realises she must confront her past and overcome her grief, in order to find out who is responsible and catch a killer…"], "author": "N.F. Paupe", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-04-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/35041669-planning-penelope", "num_ratings": "82", "num_reviews": "17", "avg_ratings": 3.49, "genres": ["Academic", "College", "Thriller"], "title": "Planning Penelope", "description": ["Alexander George Bishop V has an obsession. He controls every detail of her life, and she doesn't even know he exists. ", "Everything always goes as planned ... until it doesn't."], "author": "Erin Lockwood", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-07-11 00:00:00", "ISBN": "9780692889"},
{"url": "https://www.goodreads.com/book/show/23492629-hidden-bodies", "num_ratings": "18,187", "num_reviews": "2,850", "avg_ratings": 3.85, "genres": ["Fiction", "Mystery", "Contemporary", "Thriller"], "title": "Hidden Bodies", "description": ["Joe Goldberg is no stranger to hiding bodies. In the past ten years, this thirty-something has buried four of them, collateral damage in his quest for love. Now he’s heading west to Los Angeles, the city of second chances, determined to put his past behind him.", "In Hollywood, Joe blends in effortlessly with the other young upstarts. He eats guac, works in a bookstore, and fl", "Joe Goldberg is no stranger to hiding bodies. In the past ten years, this thirty-something has buried four of them, collateral damage in his quest for love. Now he’s heading west to Los Angeles, the city of second chances, determined to put his past behind him.", "In Hollywood, Joe blends in effortlessly with the other young upstarts. He eats guac, works in a bookstore, and flirts with a journalist neighbor. But while others seem fixated on their own reflections, Joe can’t stop looking over his shoulder. The problem with hidden bodies is that they don’t always stay that way. They re-emerge, like dark thoughts, multiplying and threatening to destroy what Joe wants most: true love. And when he finds it in a darkened room in Soho House, he’s more desperate than ever to keep his secrets buried. He doesn’t want to hurt his new girlfriend—he wants to be with her forever. But if she ever finds out what he’s done, he may not have a choice..."], "author": "Caroline Kepnes", "num_pages": "439", "awards": [], "places": ["Los Angeles, California", "California"], "character_names": [], "language": null, "publish_date": "2016-02-23 00:00:00", "ISBN": "1476785627"},
{"url": "https://www.goodreads.com/book/show/13120860-dead-scared", "num_ratings": "8,525", "num_reviews": "888", "avg_ratings": 4.05, "genres": ["Mystery", "Thriller", "Mystery Thriller", "Suspense", "Thriller", "Mystery", "Crime", "European Literature", "British Literature"], "title": "Dead Scared", "description": ["When a rash of suicides tears through Cambridge University, DI Mark Joesbury recruits DC Lacey Flint to go undercover as a student to investigate. Although each student's death appears to be a suicide, the psychological histories, social networks, and online activities of the students involved share remarkable similarities, and the London police are not convinced that the", "When a rash of suicides tears through Cambridge University, DI Mark Joesbury recruits DC Lacey Flint to go undercover as a student to investigate. Although each student's death appears to be a suicide, the psychological histories, social networks, and online activities of the students involved share remarkable similarities, and the London police are not convinced that the victims acted alone. They believe that someone might be preying on lonely and insecure students and either encouraging them to take their own lives or actually luring them to their deaths. As long as Lacey can play the role of a vulnerable young woman, she may be able to stop these deaths, but is it just a role for her? With her fragile past, is she drawing out the killers, or is she herself being drawn into a deadly game where she's a perfect victim?"], "author": "Sharon J. Bolton", "num_pages": "384", "awards": ["Barry Award Nominee for Best Novel (2013)", "Mary Higgins Clark Award Nominee (2013)"], "places": ["Cambridge University, England"], "character_names": [], "language": "English", "publish_date": "2012-06-05 00:00:00", "ISBN": "0312600534"},
{"url": "https://www.goodreads.com/book/show/32523.Hide", "num_ratings": "28,155", "num_reviews": "1,703", "avg_ratings": 4.15, "genres": ["Mystery", "Thriller", "Suspense", "Mystery", "Crime", "Fiction", "Thriller", "Mystery Thriller"], "title": "Hide", "description": ["Ex-sniper Bobby Dodge, from Gardner's New York Times bestseller Alone, returns in this thriller about a woman who is thrust into the center of a 20-year-old crime with terrifying repercussions."], "author": "Lisa Gardner", "num_pages": "313", "awards": [], "places": ["Mattapan, Massachusetts", "Boston, Massachusetts"], "character_names": ["Bobby Dodge", "Annabelle M. Granger", "Sgt. D.D. Warren"], "language": "English", "publish_date": "2007-01-30 00:00:00", "ISBN": "0553804324"},
{"url": "https://www.goodreads.com/book/show/16171235-kind-of-cruel", "num_ratings": "4,074", "num_reviews": "518", "avg_ratings": 3.58, "genres": ["Mystery", "Thriller", "Fiction", "Mystery", "Crime", "Suspense"], "title": "Kind of Cruel", "description": ["Amber Hewerdine suffers from chronic insomnia. As a last resort, she visits a hypnotherapist, doubtful that anything will really change. Under hypnosis, Amber hears herself saying, \"Kind, cruel, kind of", "Amber Hewerdine suffers from chronic insomnia. As a last resort, she visits a hypnotherapist, doubtful that anything will really change. Under hypnosis, Amber hears herself saying, \"Kind, cruel, kind of cruel.\" The words awaken a vague memory, but she dismisses the whole episode as nonsense. Two hours later, however, Amber is arrested for the brutal murder of a woman she’s never heard of, and the only way she can clear her name is by remembering exactly where she’s seen those words.", "Kind of Cruel—the latest page-turner featuring Detectives Charlotte \"Charlie\" Zailer and Simon Waterhouse—will enthrall Hannah’s ever-growing readership."], "author": "Sophie Hannah", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-06 00:00:00", "ISBN": "0670785857"},
{"url": "https://www.goodreads.com/book/show/659546.Promise_Not_to_Tell", "num_ratings": "13,776", "num_reviews": "1,546", "avg_ratings": 3.62, "genres": ["Mystery", "Fiction", "Thriller", "Suspense", "Thriller", "Mystery Thriller"], "title": "Promise Not to Tell", "description": ["Forty-one-year-old school nurse Kate Cypher has returned home to rural Vermont to care for her mother who's afflicted with Alzheimer's. On the night she arrives, a young girl is murdered—a horrific crime that eerily mirrors another from Kate's childhood. Three decades earlier, her dirt-poor friend Del—shunned and derided by classmates as \"Potato Girl\"—was brutally slain. D", "Forty-one-year-old school nurse Kate Cypher has returned home to rural Vermont to care for her mother who's afflicted with Alzheimer's. On the night she arrives, a young girl is murdered—a horrific crime that eerily mirrors another from Kate's childhood. Three decades earlier, her dirt-poor friend Del—shunned and derided by classmates as \"Potato Girl\"—was brutally slain. Del's killer was never found, while the victim has since achieved immortality in local legends and ghost stories. Now, as this new murder investigation draws Kate irresistibly in, her past and present collide in terrifying, unexpected ways. Because nothing is quite what it seems . . . and the grim specters of her youth are far from forgotten.", "More than just a murder mystery, Jennifer McMahon's extraordinary debut novel, Promise Not to Tell, is a story of friendship and family, devotion and betrayal—tautly written, deeply insightful, beautifully evocative, and utterly unforgettable."], "author": "Jennifer  McMahon", "num_pages": "250", "awards": [], "places": [], "character_names": ["Kate Cypher"], "language": "English", "publish_date": "2007-04-10 00:00:00", "ISBN": "0061143316"},
{"url": "https://www.goodreads.com/book/show/23332827-humber-boy-b", "num_ratings": "776", "num_reviews": "150", "avg_ratings": 4.06, "genres": ["Mystery", "Thriller", "Psychological Thriller", "Fiction", "Mystery", "Crime", "Thriller"], "title": "Humber Boy B", "description": ["A child is killed after falling from the Humber Bridge. Despite fleeing the scene, two young brothers are found guilty and sent to prison. Upon their release they are granted one privilege only, their anonymity.", "Probation officer Cate Austin is responsible for Humber Boy B's reintegration into society. But the general public's anger is steadily growing, and those around her are wondering if the secret of his identity is one he actually deserves to keep.", "Cate's loyalty is challenged when she begins to discover the truth of the crime. She must ask herself if a child is capable of premeditated murder. Or is there a greater evil at play?"], "author": "Ruth Dugdall", "num_pages": "352", "awards": [], "places": ["England"], "character_names": ["Cate Austin"], "language": null, "publish_date": "2015-04-01 00:00:00", "ISBN": "1910394599"},
{"url": "https://www.goodreads.com/book/show/24804444-little-pretty-things", "num_ratings": "1,895", "num_reviews": "280", "avg_ratings": 3.47, "genres": ["Mystery", "Fiction", "Suspense", "Thriller", "Thriller", "Mystery Thriller"], "title": "Little Pretty Things", "description": ["OLD RIVALRIES NEVER DIE. BUT SOME RIVALS DO.", "Juliet Townsend is used to losing. Back in high school, she lost every track team race to her best friend, Madeleine Bell. Ten years later, she’s still running behind, stuck in a dead-end job cleaning rooms at the Mid-Night Inn, a one-star motel that attracts only the cheap or the desperate. But what life won’t provide, Juliet ta", "OLD RIVALRIES NEVER DIE. BUT SOME RIVALS DO.", "Juliet Townsend is used to losing. Back in high school, she lost every track team race to her best friend, Madeleine Bell. Ten years later, she’s still running behind, stuck in a dead-end job cleaning rooms at the Mid-Night Inn, a one-star motel that attracts only the cheap or the desperate. But what life won’t provide, Juliet takes. ", "Then one night, Maddy checks in. Well-dressed, flashing a huge diamond ring, and as beautiful as ever, Maddy has it all. By the next morning, though, Juliet is no longer jealous of Maddy—she’s the chief suspect in her murder.", "To protect herself, Juliet investigates the circumstances of her friend’s death. But what she learns about Maddy’s life might cost Juliet everything she didn’t realize she had."], "author": "Lori Rader-Day", "num_pages": "303", "awards": ["Mary Higgins Clark Award (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-07 00:00:00", "ISBN": "1633880044"},
{"url": "https://www.goodreads.com/book/show/32739596-caged", "num_ratings": "55", "num_reviews": "34", "avg_ratings": 3.38, "genres": ["Fiction", "Fantasy", "Paranormal"], "title": "Caged", "description": ["\"Keep your mind right, put your body in action and let your spirit guide you.”", "These are the words keeping her sane after her husband takes her into isolation in northern Canada. But after three months with only a servant, a television and the screams of another captive keeping her company, she begins to lose touch with reality - even forgetting her own name.", "With the help o", "\"Keep your mind right, put your body in action and let your spirit guide you.”", "These are the words keeping her sane after her husband takes her into isolation in northern Canada. But after three months with only a servant, a television and the screams of another captive keeping her company, she begins to lose touch with reality - even forgetting her own name.", "With the help of an unexpected ally, she discovers an inner strength and powers previously unknown; changing her perspective and realigning her past, present and future."], "author": "Onaiza Khan", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-11-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16199630-the-accident", "num_ratings": "9,608", "num_reviews": "744", "avg_ratings": 3.77, "genres": ["Thriller", "Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Psychological Thriller", "Thriller", "Mystery Thriller", "Suspense", "Contemporary", "Adult", "Adult Fiction"], "title": "The Accident", "description": ["Sue Jackson has the perfect family but when her teenage daughter Charlotte deliberately steps in front of a bus and ends up in a coma she is forced to face a very dark reality.", "Retracing her daughter’s steps she finds a horrifying entry in Charlotte’s diary and is forced to head deep into Charlotte’s private", "Sue Jackson has the perfect family but when her teenage daughter Charlotte deliberately steps in front of a bus and ends up in a coma she is forced to face a very dark reality.", "Retracing her daughter’s steps she finds a horrifying entry in Charlotte’s diary and is forced to head deep into Charlotte’s private world. In her hunt for evidence, Sue begins to mistrust everyone close to her daughter and she’s forced to look further, into the depths of her own past.", "There is a lot that Sue doesn’t know about Charlotte’s life. But then there’s a lot that Charlotte doesn’t know about Sue’s …"], "author": "C.L. Taylor", "num_pages": "404", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-10 00:00:00", "ISBN": "0007540035"},
{"url": "https://www.goodreads.com/book/show/22545426-the-first-wife", "num_ratings": "4,703", "num_reviews": "627", "avg_ratings": 3.5, "genres": ["Mystery", "Thriller", "Fiction", "Suspense", "Romance", "Thriller", "Mystery Thriller", "Romance", "Romantic Suspense"], "title": "The First Wife", "description": ["An idealistic young woman marries a man she barely knows only to discover his first wife disappeared under mysterious circumstances. As a child, Bailey Browne dreamed of a knight in shining armor swooping in to rescue her and her mother. As she grew older, those dreams transformed, becoming ones of a mysterious stranger who swept her off her feet and whisked her away from", "An idealistic young woman marries a man she barely knows only to discover his first wife disappeared under mysterious circumstances. As a child, Bailey Browne dreamed of a knight in shining armor swooping in to rescue her and her mother. As she grew older, those dreams transformed, becoming ones of a mysterious stranger who swept her off her feet and whisked her away from her ordinary existence; then, suddenly, there he was. Despite the ten-year difference in their ages and her working class upbringing and his of privilege, Logan Abbott and Bailey fall deeply in love. Marriage quickly follows.", "But when Logan brings her home to his horse farm in Louisiana, a magnificent estate on ninety wooded acres, her dreams of happily-ever-after begin to unravel. A tragic family history Bailey knew nothing about surfaces, along with whisperings about the disappearance of his first wife and rumors about women from the area who have gone missing, and when another woman disappears, all signs point to her husband's involvement."], "author": "Erica Spindler", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-02-10 00:00:00", "ISBN": "1250012546"},
{"url": "https://www.goodreads.com/book/show/4835296-awakening", "num_ratings": "4,630", "num_reviews": "490", "avg_ratings": 3.92, "genres": ["Mystery", "Thriller", "Fiction", "Mystery", "Crime", "Suspense", "Thriller", "Mystery Thriller"], "title": "Awakening", "description": ["An idyllic village is thrown into Âturmoil in the startling, heart-racing new thriller from the author of ", ". ", "Veterinary surgeon Clara Benning is young and intelligent, but practically a reclu", "An idyllic village is thrown into Â­turmoil in the startling, heart-racing new thriller from the author of ", ". ", "Veterinary surgeon Clara Benning is young and intelligent, but practically a recluse. Disfigured by a childhood accident, she lives alone and shies away from human contact whenever possible. But when a man dies following a supposed snake bite, the victimâ€™s post mortem shows a higher concentration of venom than could ever be found in a single snake. ", "Assisted by her softly spoken neighbour, and an eccentric reptile expert, Clara unravels sinister links to a barbaric ancient ritual, an abandoned house and a fifty-year-old tragedy that left the survivors fiercely secretive. Then the villageâ€™s inventive attacker strikes again, and Claraâ€™s own solitary existence is brutally invaded. ", "For someone the truth must remain buried in the past â€” even if they have to kill to keep it there."], "author": "Sharon J. Bolton", "num_pages": "400", "awards": ["Barry Award Nominee for Best British Crime Novel (2010)", "Mary Higgins Clark Award (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-14 00:00:00", "ISBN": "0593059239"},
{"url": "https://www.goodreads.com/book/show/17346037-how-to-be-a-good-wife", "num_ratings": "5,402", "num_reviews": "1,001", "avg_ratings": 3.34, "genres": ["Fiction", "Mystery", "Thriller", "Suspense", "Contemporary", "Thriller", "Mystery Thriller"], "title": "How To Be a Good Wife", "description": ["Marta and Hector have been married for a long time – so long that she finds it difficult to remember her life before him. He", "Marta and Hector have been married for a long time – so long that she finds it difficult to remember her life before him. He has always taken care of her, and she has always done everything she can to be a good wife. But when Hector comes home with a secret, their ordered domestic life begins to unravel, and Marta begins to see things, or perhaps to remember them. In the shadows there is a blonde girl that only Marta can see. And she wants something..."], "author": "Emma  Chapman", "num_pages": "287", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7656016-the-woman-before-me", "num_ratings": "2,622", "num_reviews": "308", "avg_ratings": 3.8, "genres": ["Mystery", "Fiction", "Thriller", "Mystery", "Crime", "Thriller", "Psychological Thriller"], "title": "The Woman Before Me", "description": ["Rose Wilks' life is shattered when her newborn baby J", "Rose Wilks' life is shattered when her newborn baby Joel is admitted to intensive care. Emma Hatcher has all that Rose lacks. Beauty. A loving husband. A healthy son. Until tragedy strikes and Rose is the only suspect.", "Now, having spent nearly five years behind bars, Rose is just weeks away from freedom. Her probation officer Cate must decide whether Rose is remorseful for Luke's death, or whether she remains a threat to society. As Cate is drawn in, she begins to doubt her own judgement.", "Where is the line between love and obsession, can justice be served and, if so... by what means?", "New Edition includes exclusive material and author Q&A", "A clever, sophisticated, psychological thriller, perfect for fans of Gillian Flynn, S.J. Watson, B A Paris and Sophie Hannah"], "author": "Ruth Dugdall", "num_pages": "288", "awards": ["CWA Debut Dagger (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-28 00:00:00", "ISBN": "1907461159"},
{"url": "https://www.goodreads.com/book/show/35410511-baby-teeth", "num_ratings": "5,185", "num_reviews": "2,187", "avg_ratings": 3.78, "genres": ["Thriller", "Fiction", "Horror", "Mystery", "Thriller", "Mystery Thriller"], "title": "Baby Teeth", "description": ["Meet Hanna.", "She’s the sweet-but-silent angel in the adoring eyes of her Daddy. He’s the only person who understands her, and all Hanna wants is to live happily ever after with him. But Mommy stands in her way, and she’ll try any trick she can think of to get rid of her. Ideally for good.", "Meet Suzette.", "She loves her daughter, really, but after yea", "Meet Hanna.", "She’s the sweet-but-silent angel in the adoring eyes of her Daddy. He’s the only person who understands her, and all Hanna wants is to live happily ever after with him. But Mommy stands in her way, and she’ll try any trick she can think of to get rid of her. Ideally for good.", "Meet Suzette.", "She loves her daughter, really, but after years of expulsions and strained home schooling, her precarious health and sanity are weakening day by day. As Hanna’s tricks become increasingly sophisticated, and Suzette's husband remains blind to the failing family dynamics, Suzette starts to fear that there’s something seriously wrong, and that maybe home isn’t the best place for their baby girl after all."], "author": "Zoje Stage", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-07-17 00:00:00", "ISBN": "1250170753"},
{"url": "https://www.goodreads.com/book/show/28016509-the-girl-before", "num_ratings": "71,496", "num_reviews": "7,408", "avg_ratings": 3.69, "genres": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "The Girl Before", "description": ["The request seems odd, even intrusive - and for the two women who answer, the consequences are devastating.", "Reeling from a traumatic break-in, Emma wants a new place to live. But none of the apartments she sees are affordable or feel safe. Until One Folgate Street. The house is an architectural masterpiece: a minimalist design of pale stone, plate glass, and soaring ceilings. But there are rules. The enigmatic architect who designed the house retains full control: no books, no throw pillows, no photos or clutter or personal effects of any kind. The space is intended to transform its occupant - and it does.", "After a personal tragedy, Jane needs a fresh start. When she finds One Folgate Street, she is instantly drawn to the space - and to its aloof but seductive creator. Moving in, Jane soon learns about the untimely death of the home's previous tenant, a woman similar to Jane in age and appearance. As Jane tries to untangle truth from lies, she unwittingly follows the same patterns, makes the same choices, crosses paths with the same people, and experiences the same terror as the girl before."], "author": "J.P. Delaney", "num_pages": "341", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller (2017)"], "places": ["London, England"], "character_names": ["Emma", "Jane", "Edward Monkford"], "language": "English", "publish_date": "2017-01-24 00:00:00", "ISBN": "0425285049"},
{"url": "https://www.goodreads.com/book/show/25734248-the-widow", "num_ratings": "63,434", "num_reviews": "7,011", "avg_ratings": 3.49, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Thriller", "Mystery Thriller", "Suspense"], "title": "The Widow", "description": ["When the police started asking questions, Jean Taylor turned into a different woman. One who enabled her and her husband to carry on, when more bad things began to happen...", "But that woman’s husband died last week. And Jean doesn’t have to be her anymore.", "There’s a lot Jean hasn’t said over the years about the crime her husband was suspected of committing. She was too busy b", "When the police started asking questions, Jean Taylor turned into a different woman. One who enabled her and her husband to carry on, when more bad things began to happen...", "But that woman’s husband died last week. And Jean doesn’t have to be her anymore.", "There’s a lot Jean hasn’t said over the years about the crime her husband was suspected of committing. She was too busy being the perfect wife, standing by her man while living with the accusing glares and the anonymous harassment. ", "Now there’s no reason to stay quiet. There are people who want to hear her story. They want to know what it was like living with that man. She can tell them that there were secrets. There always are in a marriage. ", "The truth—that’s all anyone wants. But the one lesson Jean has learned in the last few years is that she can make people believe anything…"], "author": "Fiona Barton", "num_pages": "324", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller (2016)"], "places": ["Southampton, England", "London, England", "England"], "character_names": [], "language": "English", "publish_date": "2016-02-16 00:00:00", "ISBN": "1101990260"},
{"url": "https://www.goodreads.com/book/show/17900221-wrong-place-wrong-time", "num_ratings": "248", "num_reviews": "110", "avg_ratings": 4.04, "genres": ["Thriller", "Thriller", "Mystery Thriller", "Mystery"], "title": "Wrong Place, Wrong Time", "description": ["When Tsara Adelman leaves her husband and two young children for a weekend to visit her estranged uncle, she little dreams he is holding several local children captive on his lavish estate. Mike Westbrook, father of one of the boys, kidnaps her to trade her life for the children's. Soon Tsara and Mike are fleeing through New Hampshire's mountain wilderness pursued by two r", "When Tsara Adelman leaves her husband and two young children for a weekend to visit her estranged uncle, she little dreams he is holding several local children captive on his lavish estate. Mike Westbrook, father of one of the boys, kidnaps her to trade her life for the children's. Soon Tsara and Mike are fleeing through New Hampshire's mountain wilderness pursued by two rogue cops with murder on their minds."], "author": "Tilia Klebenov Jacobs", "num_pages": "397", "awards": ["London Book Festival Nominee for General Fiction (Honorable Mention) (2013)", "New England Book Festival", "Beverly Hills International Book Awards"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-01 00:00:00", "ISBN": "0615805590"},
{"url": "https://www.goodreads.com/book/show/32258.Body_Double", "num_ratings": "39,117", "num_reviews": "1,479", "avg_ratings": 4.17, "genres": ["Mystery", "Mystery", "Crime", "Thriller", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "Body Double", "description": ["Boston medical examiner Dr. Maura Isles literally meets her match–and must face a savage serial killer and shattering personal revelations–in the brilliant new novel of suspense by the New York Times bestselling author of ", " and ", "Dr. Maura Isles makes her living dealing with death. As a pathologist in a major metropolitan city, she has seen more than her", "Boston medical examiner Dr. Maura Isles literally meets her match–and must face a savage serial killer and shattering personal revelations–in the brilliant new novel of suspense by the New York Times bestselling author of ", " and ", "Dr. Maura Isles makes her living dealing with death. As a pathologist in a major metropolitan city, she has seen more than her share of corpses every day–many of them victims of violent murder. But never before has her blood run cold, and never has the grim expression “dead ringer” rung so terrifyingly true. Because never before has the lifeless body on the medical examiner’s table been her own.", "Yet there can be no denying the mind-reeling evidence before her shocked eyes and those of her colleagues, including Detective Jane Rizzoli: the woman found shot to death outside Maura’s home is the mirror image of Maura, down to the most intimate physical nuances. Even more chilling is the discovery that they share the same birth date and blood type. For the stunned Maura, an only child, there can be just one explanation. And when a DNA test confirms that Maura’s mysterious doppelgänger is in fact her twin sister, an already bizarre murder investigation becomes a disturbing and dangerous excursion into a past full of dark secrets.", "Searching for answers, Maura is drawn to a seaside town in Maine where other horrifying surprises await. But perhaps more frightening, an unknown murderer is at large on a cross-country killing spree. To stop the massacre and uncover the twisted truth about her own roots, Maura must probe her first living subject: the mother that she never knew . . . an icy and cunning woman who could be responsible for giving Maura life–and who just may have a plan to take it away."], "author": "Tess Gerritsen", "num_pages": "432", "awards": [], "places": ["United States of America", "Massachusetts"], "character_names": ["Jane Rizzoli", "Gabriel Dean", "Dr. Maura Isles", "Anna Jessup", "Father Daniel Brophy", "Barry Frost", "Matilda Hayes", "Rick Ballard"], "language": "English", "publish_date": "2005-07-26 00:00:00", "ISBN": "034545894X"},
{"url": "https://www.goodreads.com/book/show/26025580-the-grownup", "num_ratings": "67,143", "num_reviews": "8,478", "avg_ratings": 3.54, "genres": ["Short Stories", "Fiction", "Horror", "Mystery", "Thriller"], "title": "The Grownup", "description": ["A canny young woman is struggling to survive by perpetrating various levels of mostly harmless fraud. On a rainy April morning, she is reading auras at Spiritual Palms when Susan Burke walks in. A keen observer of human behavior, our unnamed narrator immediately diagnoses beautiful, rich Susan as an unhappy woman eager to give her lovely life a drama injection. However, wh", "A canny young woman is struggling to survive by perpetrating various levels of mostly harmless fraud. On a rainy April morning, she is reading auras at Spiritual Palms when Susan Burke walks in. A keen observer of human behavior, our unnamed narrator immediately diagnoses beautiful, rich Susan as an unhappy woman eager to give her lovely life a drama injection. However, when the \"psychic\" visits the eerie Victorian home that has been the source of Susan's terror and grief, she realizes she may not have to pretend to believe in ghosts anymore. Miles, Susan's teenage stepson, doesn't help matters with his disturbing manner and grisly imagination. The three are soon locked in a chilling battle to discover where the evil truly lurks and what, if anything, can be done to escape it.", "“The Grownup,” originally appeared as “What Do You Do?” in George R. R. Martin’s Rogues anthology."], "author": "Gillian Flynn", "num_pages": "64", "awards": ["Edgar Award for Best Short Story (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-03 00:00:00", "ISBN": "0804188971"},
{"url": "https://www.goodreads.com/book/show/8701129-love-you-more", "num_ratings": "34,482", "num_reviews": "2,382", "avg_ratings": 4.16, "genres": ["Mystery", "Thriller", "Fiction", "Suspense", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Love You More", "description": ["One question, a split-second decision, and Brian Darby lies dead on the kitchen floor. His wife, state police trooper Tessa Leoni, claims to have shot him in self-defense, and bears the bruises to back up her tale. For veteran detective D. D. Warren it should be an open-and-shut case. But where is their six-year-old daughter?", "As the homicide investigation ratchets into a fr", "One question, a split-second decision, and Brian Darby lies dead on the kitchen floor. His wife, state police trooper Tessa Leoni, claims to have shot him in self-defense, and bears the bruises to back up her tale. For veteran detective D. D. Warren it should be an open-and-shut case. But where is their six-year-old daughter?", "As the homicide investigation ratchets into a frantic statewide search for a missing child, D. D. Warren must partner with former lover Bobby Dodge to break through the blue wall of police brotherhood, seeking to understand the inner workings of a trooper’s mind while also unearthing family secrets. Would a trained police officer truly shoot her own husband? And would a mother harm her own child?", "For Tessa Leoni, the worst has not yet happened. She is walking a tightrope, with nowhere to turn, no one to trust, as the clock ticks down to a terrifying deadline. She has one goal in sight, and she will use every ounce of her training, every trick at her disposal, to do what must be done. No sacrifice is too great, no action unthinkable. A mother knows who she loves. And all others will be made to pay."], "author": "Lisa Gardner", "num_pages": "368", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Best Suspense/Thriller (2011)"], "places": ["Massachusetts"], "character_names": [], "language": "English", "publish_date": "2011-03-08 00:00:00", "ISBN": "0553807250"},
{"url": "https://www.goodreads.com/book/show/15818278-the-one-i-left-behind", "num_ratings": "12,228", "num_reviews": "1,218", "avg_ratings": 3.77, "genres": ["Mystery", "Fiction", "Thriller", "Suspense", "Thriller", "Mystery Thriller"], "title": "The One I Left Behind", "description": ["Bestselling author Jennifer McMahon is back with a gut-wrenching mystery about an architect whose troubled mother has been found 25 years after being kidnapped-by a killer who is still on the loose.", "The summer of 1985 changed Reggie's life. Thirteen, awkward, and without a father, she finds herself mixed up with her school's outcasts-Charlie, the local detective's son, and", "Bestselling author Jennifer McMahon is back with a gut-wrenching mystery about an architect whose troubled mother has been found 25 years after being kidnapped-by a killer who is still on the loose.", "The summer of 1985 changed Reggie's life. Thirteen, awkward, and without a father, she finds herself mixed up with her school's outcasts-Charlie, the local detective's son, and Tara, a goth kid who has a mental hold over Reggie and harbors a dark secret. That same summer a serial killer called Neptune begins kidnapping women. He leaves their severed hands on the police department steps and, five days later, displays their bodies around town. Just when Reggie needs her mother Vera-an ex-model with many \"boyfriends\" and a thirst for gin-the most, Vera's hand is found on the steps. But after five days, there's no body and Neptune disappears.", "Now a successful architect who left her hometown behind after that horrific summer, Reggie doesn't trust anyone and lives with few attachments. But when she gets a call from a homeless shelter saying that her mother has been found alive, Reggie must confront the ghosts of her past and find Neptune before he kills again.", "With her signature style, Jennifer McMahon portrays the dark side of adolescent friendship and introduces characters who haunt the imagination, along with a disturbing web of secrets, betrayals, and murder."], "author": "Jennifer  McMahon", "num_pages": "422", "awards": ["ITW Thriller Award for Best Paperback Original Novel (2014)"], "places": ["Brighton Falls, Connecticut"], "character_names": [], "language": "English", "publish_date": "2013-01-02 00:00:00", "ISBN": "006212255X"},
{"url": "https://www.goodreads.com/book/show/132336.Body_of_Evidence", "num_ratings": "56,594", "num_reviews": "1,036", "avg_ratings": 4.01, "genres": ["Mystery", "Mystery", "Crime", "Fiction", "Thriller"], "title": "Body of Evidence", "description": ["After months of menacing phone calls and feeling that her every move is being watched, successful writer Beryl Madison flees Key West when a terrifying message is scratched on her car. But the very night she returns to Richmond, she deactivates her burglar alarm and opens her door to someone who nearly decapitates her. Why did she let him in, wonders Chief Medical Examiner", "After months of menacing phone calls and feeling that her every move is being watched, successful writer Beryl Madison flees Key West when a terrifying message is scratched on her car. But the very night she returns to Richmond, she deactivates her burglar alarm and opens her door to someone who nearly decapitates her. Why did she let him in, wonders Chief Medical Examiner Dr. Kay Scarpetta? And, why is Beryl's latest manuscript missing? Persuing the answers involves Scarpetta in the murder of another writer - Beryl's jealous mentor. While she copes with a variety of personal and professional problems, Scarpetta's high-tech forensic skills enable her to collect a body of evidence - clues that would mean little without her intelligence, compassion, and imagination - that leads her directly into a nightmare all her own."], "author": "Patricia Cornwell", "num_pages": "403", "awards": [], "places": ["Richmond, Virginia", "Virginia"], "character_names": ["Kay Scarpetta", "Pete Marino", "Mark James", "Benton Wesley", "Beryl Madison", "Cary Harper", "Sterling Harper", "Al Hunt"], "language": "English", "publish_date": "2004-11-30 00:00:00", "ISBN": "0743493915"},
{"url": "https://www.goodreads.com/book/show/30753570-are-you-sleeping", "num_ratings": "6,080", "num_reviews": "979", "avg_ratings": 3.65, "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Suspense"], "title": "Are You Sleeping", "description": [" meets Ruth Ware’s ", " in this inventive and twisty psychological thriller about a mega-hit podcast that reopens a murder case—and threatens to unravel the carefully constructed life of the victim’s daughter.", "Josie Buhrman has spent the last ten years trying to escape her family’s reputation and", " meets Ruth Ware’s ", " in this inventive and twisty psychological thriller about a mega-hit podcast that reopens a murder case—and threatens to unravel the carefully constructed life of the victim’s daughter.", "Josie Buhrman has spent the last ten years trying to escape her family’s reputation and with good reason. After her father's murder thirteen years prior, her mother ran away to join a cult and her twin sister Lanie, once Josie’s closest friend and confidant, betrayed her in an unimaginable way. Now, Josie has finally put down roots in New York, settling into domestic life with her partner Caleb, and that’s where she intends to stay. The only problem is that she has lied to Caleb about every detail of her past—starting with her last name.", "When investigative reporter Poppy Parnell sets off a media firestorm with a mega-hit podcast that reopens the long-closed case of Josie’s father’s murder, Josie’s world begins to unravel. Meanwhile, the unexpected death of Josie’s long-absent mother forces her to return to her Midwestern hometown where she must confront the demons from her past—and the lies on which she has staked her future."], "author": "Kathleen  Barber", "num_pages": "326", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-01 00:00:00", "ISBN": "1501157663"},
{"url": "https://www.goodreads.com/book/show/17856517-the-sleeper", "num_ratings": "2,394", "num_reviews": "260", "avg_ratings": 3.75, "genres": ["Mystery", "Thriller", "Fiction", "Mystery", "Crime", "Audiobook", "Thriller", "Mystery Thriller"], "title": "The Sleeper", "description": ["A tense, gripping psychological thriller, with Hitchcockian overtones, perfect for fans of Gillian Flynn's ", " and Sophie Hannah.", "Iris's world is rocked when her friend Lara disappears while travelling on the sleeper train between Cornwall and London. The police investigation reveals that married Lara, a regular commuter on the night train, was secretly having an affa", "A tense, gripping psychological thriller, with Hitchcockian overtones, perfect for fans of Gillian Flynn's ", " and Sophie Hannah.", "Iris's world is rocked when her friend Lara disappears while travelling on the sleeper train between Cornwall and London. The police investigation reveals that married Lara, a regular commuter on the night train, was secretly having an affair with another married commuter. Although they have yet to find Lara's body, the police suspect she was killed by her lover and dumped from the train as it sped through the countryside. Iris is unconvinced and starts to delve into what really happened to her friend. She soon discovers that Lara has been running away from a secret past and from someone who wants to do her harm. Iris's search takes her to the Far East where Lara travelled as a young woman. Here, Iris unveils the shocking truth and also finds herself in terrible danger..."], "author": "Emily Barr", "num_pages": "407", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-04 00:00:00", "ISBN": "0755388003"},
{"url": "https://www.goodreads.com/book/show/31450633-the-breakdown", "num_ratings": "44,659", "num_reviews": "6,392", "avg_ratings": 3.91, "genres": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller", "Thriller", "Psychological Thriller"], "title": "The Breakdown", "description": ["Cass is having a hard time since the night she saw the car in the woods, on the winding rural road, in the middle of a downpour, with the woman sitting inside—the woman who was killed. She’s been trying to put the crime out of her mind; what could she have done, really? It’s a dangerous road to be on in the middle of a storm. Her husband would be furious if he knew she’d b", "Cass is having a hard time since the night she saw the car in the woods, on the winding rural road, in the middle of a downpour, with the woman sitting inside—the woman who was killed. She’s been trying to put the crime out of her mind; what could she have done, really? It’s a dangerous road to be on in the middle of a storm. Her husband would be furious if he knew she’d broken her promise not to take that shortcut home. And she probably would only have been hurt herself if she’d stopped.", "But since then, she’s been forgetting every little thing: where she left the car, if she took her pills, the alarm code, why she ordered a pram when she doesn’t have a baby.", "The only thing she can’t forget is that woman, the woman she might have saved, and the terrible nagging guilt.", "Or the silent calls she’s receiving, or the feeling that someone’s watching her…"], "author": "B.A. Paris", "num_pages": "328", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller (2017)", "ITW Award Nominee for Best Novel (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-07-18 00:00:00", "ISBN": "1250122465"},
{"url": "https://www.goodreads.com/book/show/2308838.Sacrifice", "num_ratings": "6,075", "num_reviews": "655", "avg_ratings": 3.9, "genres": ["Mystery", "Thriller", "Fiction", "Mystery", "Crime", "Suspense", "Cultural", "Scotland", "Thriller", "Mystery Thriller"], "title": "Sacrifice", "description": ["In this masterful debut that starts off as a mystery and becomes much more, Tora Hamilton is an outsider at her new home on the rocky, wind-swept Shetland Islands, a hundred miles from the northeastern tip of Scotland.  Though her husband  grew up here, it’s the first time he’s been back in twenty years.  Digging in the peat on their new property, Tora unearths a human bod", "In this masterful debut that starts off as a mystery and becomes much more, Tora Hamilton is an outsider at her new home on the rocky, wind-swept Shetland Islands, a hundred miles from the northeastern tip of Scotland.  Though her husband  grew up here, it’s the first time he’s been back in twenty years.  Digging in the peat on their new property, Tora unearths a human body, at first glance a centuries-old bog body, interesting but not uncommon. But realizing that the body is in fact much newer, that the woman’s heart has been cut out and that she was killed within a few days of bearing a child, Tora, herself an obstetrician, becomes obsessed with finding out what happened to her—even when the police, her colleagues and eventually her husband warn her against getting involved.", " is a bone-chilling, spell-binding debut that will grip readers from its beginning to its startling end. "], "author": "Sharon J. Bolton", "num_pages": "384", "awards": ["Mary Higgins Clark Award Nominee (2009)", "ITW Thriller Award Nominee for Best First Novel (2009)"], "places": ["Shetland Islands, Scotland"], "character_names": ["Tora Hamilton", "Detective Sergeant Dana Tulloch", "Detective Chief Inspector Helen Rowley", "Duncan Guthrie", "Detective Inspector Andy Dunn", "Kenn Gifford"], "language": "English", "publish_date": "2008-05-27 00:00:00", "ISBN": "0312381131"},
{"url": "https://www.goodreads.com/book/show/16044953-always-watching", "num_ratings": "9,540", "num_reviews": "1,191", "avg_ratings": 3.7, "genres": ["Mystery", "Thriller", "Fiction", "Suspense", "Thriller", "Mystery Thriller", "Adult Fiction", "Thriller", "Psychological Thriller", "Mystery", "Crime", "Cultural", "Canada", "Contemporary"], "title": "Always Watching", "description": ["She helps people put their demons to rest.", "But she has a few of her own…", "In the lockdown ward of a psychiatric hospital, Dr. Nadine Lavoie is in her element. She has the tools to help people, and she has the desire—healing broken families is what she lives for. But Nadine doesn’t want to look too closely at her own past because there are whole chunks of her life that are bla", "She helps people put their demons to rest.", "But she has a few of her own…", "In the lockdown ward of a psychiatric hospital, Dr. Nadine Lavoie is in her element. She has the tools to help people, and she has the desire—healing broken families is what she lives for. But Nadine doesn’t want to look too closely at her own past because there are whole chunks of her life that are black holes. It takes all her willpower to tamp down her recurrent claustrophobia, and her daughter, Lisa, is a runaway who has been on the streets for seven years.", "When a distraught woman, Heather Simeon, is brought into the Psychiatric Intensive Care Unit after a suicide attempt, Nadine gently coaxes her story out of her—and learns of some troubling parallels with her own life. Digging deeper, Nadine is forced to confront her traumatic childhood, and the damage that began when she and her brother were brought by their mother to a remote commune on Vancouver Island. What happened to Nadine? Why was their family destroyed? And why does the name Aaron Quinn, the group’s leader, bring complex feelings of terror to Nadine even today? ", "And then, the unthinkable happens, and Nadine realizes that danger is closer to home than she ever imagined. She has no choice but to face what terrifies her the most…and fight back. ", "Sometimes you can leave the past, but you can never escape. ", "Told with the trademark powerful storytelling that has had critics praising her work as “Gripping” (Kirkus), “Jaw-dropping” (Publishers Weekly) and “Crackling with suspense” (People magazine), ALWAYS WATCHING shows why Chevy Stevens is one of the most mesmerizing new talents of our day."], "author": "Chevy Stevens", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-18 00:00:00", "ISBN": "0312595697"},
{"url": "https://www.goodreads.com/book/show/20763881-keep-your-friends-close", "num_ratings": "3,438", "num_reviews": "507", "avg_ratings": 3.78, "genres": ["Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller", "Thriller", "Thriller", "Psychological Thriller"], "title": "Keep Your Friends Close", "description": ["From breakout thriller writer Paula Daly, the story of a husband and wife and the devious best friend who comes between them.", "Natty and Sean have a rock-solid marriage—with two daughters, a successful business, and a beautiful house, they are a model family. When their younger daughter falls ill on a school", "From breakout thriller writer Paula Daly, the story of a husband and wife and the devious best friend who comes between them.", "Natty and Sean have a rock-solid marriage—with two daughters, a successful business, and a beautiful house, they are a model family. When their younger daughter falls ill on a school trip, Natty rushes to her side. Luckily, Natty’s best friend from college, Eve, is visiting and offers to stay with Sean to lend a hand in the household. But Natty returns home to find that Eve has taken to family life a little too well: Sean has fallen in love with her. With no choice but to put on a brave face, Natty attempts to start anew—yet no matter how hard she tries to set herself upright, Eve is there to knock her down again. Then Natty receives a mysterious note that says Eve has done this before—more than once—and the consequences were fatal. On a mission to reveal Eve as a vindictive serial mistress, Natty must navigate through a treacherous maze of secrets and lies that threatens her life and the safety of her loved ones."], "author": "Paula Daly", "num_pages": "335", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-19 00:00:00", "ISBN": "0802123201"},
{"url": "https://www.goodreads.com/book/show/33151805-into-the-water", "num_ratings": "149,333", "num_reviews": "15,807", "avg_ratings": 3.54, "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Suspense"], "title": "Into the Water", "description": ["In the last days before her death, Nel called her sister. Jules didn’t pick up the phone, ignoring her plea for help. Now Nel is dead. They say she jumped. And Jules has been dragged back to the one place she hoped she had escaped for good, to care for the teenage girl her sister left behind. But Jules is afraid. So afraid. Of her long-buried memories, of the old Mill Hous", "In the last days before her death, Nel called her sister. Jules didn’t pick up the phone, ignoring her plea for help. Now Nel is dead. They say she jumped. And Jules has been dragged back to the one place she hoped she had escaped for good, to care for the teenage girl her sister left behind. But Jules is afraid. So afraid. Of her long-buried memories, of the old Mill House, of knowing that Nel would never have jumped. And most of all she’s afraid of the water, and the place they call the Drowning Pool . . ."], "author": "Paula Hawkins", "num_pages": "386", "awards": ["Goodreads Choice Award for Mystery & Thriller (2017)"], "places": ["Beckford, England"], "character_names": [], "language": "English", "publish_date": "2017-05-02 00:00:00", "ISBN": "0735211205"},
{"url": "https://www.goodreads.com/book/show/7455508-blood-harvest", "num_ratings": "4,962", "num_reviews": "632", "avg_ratings": 3.96, "genres": ["Mystery", "Thriller", "Fiction", "Horror", "Thriller", "Mystery Thriller", "Mystery", "Crime", "Suspense"], "title": "Blood Harvest", "description": ["Gillian is haunted by the disappearance of her little girl two years ago. A devastating fire burned down their home, but she remains convinced her daughter survived.", "Ten year old Tom lived by a neglected church. Is he the only one who sees the strange, solitary child playing there? And what is she trying t", "Gillian is haunted by the disappearance of her little girl two years ago. A devastating fire burned down their home, but she remains convinced her daughter survived.", "Ten year old Tom lived by a neglected church. Is he the only one who sees the strange, solitary child playing there? And what is she trying to tell him?", "There's a new vicar in town - Harry. But menacing events suggest he isn't welcome. What terrible secret is this town hiding?"], "author": "Sharon J. Bolton", "num_pages": "432", "awards": ["Barry Award Nominee for Best British Crime Novel (2011)", "Mary Higgins Clark Award Nominee (2010)"], "places": ["Heptonclough"], "character_names": ["Evi Oliver", "Harry Laycock", "Tom Fletcher", "Joe Fletcher", "Millie Fletcher", "Alice Fletcher", "Gareth Fletcher", "Gillian Royle"], "language": "English", "publish_date": "2010-06-08 00:00:00", "ISBN": "0312600518"},
{"url": "https://www.goodreads.com/book/show/13123877-broken-harbor", "num_ratings": "58,047", "num_reviews": "5,980", "avg_ratings": 3.93, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller", "Cultural", "Ireland"], "title": "Broken Harbor", "description": ["The mesmerizing fourth novel of the Dublin murder squad by ", " bestselling author Tana French", "Mick \"Scorcher\" Kennedy, the brash cop from Tana French’s bestselling ", ", plays by the book and plays hard. That’s what’s made him the Murder squad’s top detective—and that’s what puts the biggest case of the year into his hands.", "On one of the half-built, half", "The mesmerizing fourth novel of the Dublin murder squad by ", " bestselling author Tana French", "Mick \"Scorcher\" Kennedy, the brash cop from Tana French’s bestselling ", ", plays by the book and plays hard. That’s what’s made him the Murder squad’s top detective—and that’s what puts the biggest case of the year into his hands.", "On one of the half-built, half-abandoned \"luxury\" developments that litter Ireland, Patrick Spain and his two young children are dead. His wife, Jenny, is in intensive care.", "At first, Scorcher and his rookie partner, Richie, think it’s going to be an easy solve. But too many small things can’t be explained. The half dozen baby monitors, their cameras pointing at holes smashed in the Spains’ walls. The files erased from the Spains’ computer. The story Jenny told her sister about a shadowy intruder who was slipping past all the locks.", "And Broken Harbor holds memories for Scorcher. Seeing the case on the news sends his sister Dina off the rails again, and she’s resurrecting something that Scorcher thought he had tightly under control: what happened to their family one summer at Broken Harbor, back when they were children.", "With her signature blend of police procedural and psychological thriller, French’s new novel goes full throttle with a heinous crime, creating her most complicated detective character and her best book yet."], "author": "Tana French", "num_pages": "450", "awards": ["Dilys Award Nominee (2013)", "Los Angeles Times Book Prize for Mystery/Thriller (2012)", "Bord Gáis Energy Irish Book Award for Ireland AM Crime Fiction Award (2012)", "Goodreads Choice Award Nominee for Best Mystery & Thriller (2013)"], "places": ["Dublin"], "character_names": ["Scorcher Kennedy"], "language": "English", "publish_date": "2012-08-16 00:00:00", "ISBN": "0670023655"},
{"url": "https://www.goodreads.com/book/show/16085482-kiss-me-first", "num_ratings": "4,405", "num_reviews": "692", "avg_ratings": 3.37, "genres": ["Fiction", "Mystery", "Thriller", "Contemporary", "Suspense", "Adult"], "title": "Kiss Me First", "description": [" When Leila discovers the Web site Red Pill, she feels she has finally found people who understand her. A sheltered young woman raised by her mother, Leila has often struggled to", " When Leila discovers the Web site Red Pill, she feels she has finally found people who understand her. A sheltered young woman raised by her mother, Leila has often struggled to connect with the girls at school; but on Red Pill, a chat forum for ethical debate, Leila comes into her own, impressing the Web site's founder, a brilliant and elusive man named Adrian. Leila is thrilled when Adrian asks to meet her, flattered when he invites her to be part of \"Project Tess.\" Tess is a woman Leila might never have met in real life. She is beautiful, urbane, witty, and damaged. As they e-mail, chat, and Skype, Leila becomes enveloped in the world of Tess, learning every single thing she can about this other woman—because soon, Leila will have to become her. An ingeniously plotted novel of stolen identity, ", " is brilliantly frightening about the lies we tell—to ourselves, to others, for good, and for ill."], "author": "Lottie Moggach", "num_pages": "308", "awards": ["Guardian First Book Award Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-09 00:00:00", "ISBN": "0385537476"},
{"url": "https://www.goodreads.com/book/show/16233477-dark-tide", "num_ratings": "4,371", "num_reviews": "488", "avg_ratings": 3.47, "genres": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller", "Mystery", "Crime"], "title": "Dark Tide", "description": ["Elizabeth Haynes, author of the bestselling debut ", ", returns with a tense, gripping thriller about a woman caught in an underworld of corruption and murder...", "Genevieve has finally achieved her dream: to leave the stress of London behind and start a new life aboard a houseboat in Kent. She’s found the perfect vessel: ", "She already fe", "Elizabeth Haynes, author of the bestselling debut ", ", returns with a tense, gripping thriller about a woman caught in an underworld of corruption and murder...", "Genevieve has finally achieved her dream: to leave the stress of London behind and start a new life aboard a houseboat in Kent. She’s found the perfect vessel: ", "She already feels less lonely; as if the boat is looking after her.", "But the night of her boat-warming party, a body washes up, and to Genevieve’s horror, she recognizes the victim. She isn’t about to tell the police, though; hardly anyone knows about her past as a dancer at a private members’ club, The Barclay. The death can’t have anything to do with her. Or so she thinks...", "Soon, the lull of the waves against ", " feels anything but soothing, as Genevieve begins to receive strange calls and can’t reach the one person who links the present danger with her history at the club. Fearing for her safety, Genevieve recalls the moment when it all started to go wrong: the night she saw her daytime boss in the crowd at The Barclay...", "Dark, sexy, and exquisitely chilling, ", "is another superb mystery from acclaimed rising star Elizabeth Haynes."], "author": "Elizabeth Haynes", "num_pages": "388", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-12 00:00:00", "ISBN": "0062197339"},
{"url": "https://www.goodreads.com/book/show/38726615-ana-rocha", "num_ratings": "187", "num_reviews": "45", "avg_ratings": 4.43, "genres": ["Mystery", "Crime"], "title": "Ana Rocha: Shadows of Justice", "description": ["Ana Rocha is a woman on fire. Being talented and from a well-off family, Ana could have become anything. But driven by her sister's murder, Ana chose the path of an undercover narcotics officer. Ana has made a vow to help clean up the streets of Houston. The journey her duty takes her on forces", "Ana Rocha is a woman on fire. Being talented and from a well-off family, Ana could have become anything. But driven by her sister's murder, Ana chose the path of an undercover narcotics officer. Ana has made a vow to help clean up the streets of Houston. The journey her duty takes her on forces her to confront her worst nightmares and face the city’s most ruthless criminals. The further she goes down this path, the more the line between her two lives begins to blur. And soon, this journey brings her face-to-face with a monster from her past."], "author": "Ammar Habib", "num_pages": "218", "awards": [], "places": ["Houston, Texas"], "character_names": [], "language": "English", "publish_date": "2018-02-23 00:00:00", "ISBN": "1985736136"},
{"url": "https://www.goodreads.com/book/show/17452179-apple-tree-yard", "num_ratings": "18,109", "num_reviews": "1,752", "avg_ratings": 3.72, "genres": ["Fiction", "Thriller", "Mystery", "Crime", "Mystery", "Suspense", "Thriller", "Mystery Thriller"], "title": "Apple Tree Yard", "description": ["Yvonne Carmichael sits in the witness box. The charge is murder. Before all of this, she was happily married, a successful scientist, a mother of two. Now she's a suspect, squirming under fluorescent lights and the penetrating gaze of the alleged accomplice who's sitting across from her, watching: a man who's also her lover. As Yvonne faces hostile questioning, she must pi", "Yvonne Carmichael sits in the witness box. The charge is murder. Before all of this, she was happily married, a successful scientist, a mother of two. Now she's a suspect, squirming under fluorescent lights and the penetrating gaze of the alleged accomplice who's sitting across from her, watching: a man who's also her lover. As Yvonne faces hostile questioning, she must piece together the story of her affair with this unnamed figure who has charmed and haunted her. This is a tale of sexual intrigue, ruthless urges, and danger, which has blindsided her from a seemingly innocuous angle. Here in the courtroom, everything hinges on one night in a dark alley called "], "author": "Louise Doughty", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-06 00:00:00", "ISBN": "0571297889"},
{"url": "https://www.goodreads.com/book/show/23212667-all-the-missing-girls", "num_ratings": "77,659", "num_reviews": "7,604", "avg_ratings": 3.79, "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Suspense"], "title": "All the Missing Girls", "description": ["Like the spellbinding psychological suspense in The Girl on the Train and Luckiest Girl Alive, Megan Miranda’s novel is a nail-biting, breathtaking story about the disappearances of two young women—a decade apart—told in reverse.", "It’s been ten years since Nicolette Farrell left her rural hometown after her best friend, Corinne, disappeared from Cooley Ridge without a trace.", "Like the spellbinding psychological suspense in The Girl on the Train and Luckiest Girl Alive, Megan Miranda’s novel is a nail-biting, breathtaking story about the disappearances of two young women—a decade apart—told in reverse.", "It’s been ten years since Nicolette Farrell left her rural hometown after her best friend, Corinne, disappeared from Cooley Ridge without a trace. Back again to tie up loose ends and care for her ailing father, Nic is soon plunged into a shocking drama that reawakens Corinne’s case and breaks open old wounds long since stitched.", "The decade-old investigation focused on Nic, her brother Daniel, boyfriend Tyler, and Corinne’s boyfriend Jackson. Since then, only Nic has left Cooley Ridge. Daniel and his wife, Laura, are expecting a baby; Jackson works at the town bar; and Tyler is dating Annaleise Carter, Nic’s younger neighbor and the group’s alibi the night Corinne disappeared. Then, within days of Nic’s return, Annaleise goes missing.", "Told backwards—Day 15 to Day 1—from the time Annaleise goes missing, Nic works to unravel the truth about her younger neighbor’s disappearance, revealing shocking truths about her friends, her family, and what really happened to Corinne that night ten years ago.", "Like nothing you’ve ever read before, All the Missing Girls delivers in all the right ways. With twists and turns that lead down dark alleys and dead ends, you may think you’re walking a familiar path, but then Megan Miranda turns it all upside down and inside out and leaves us wondering just how far we would be willing to go to protect those we love."], "author": "Megan Miranda", "num_pages": "384", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller (2016)"], "places": ["Cooley Ridge, North Carolina"], "character_names": [], "language": "English", "publish_date": "2016-06-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26262230-14-days-to-die", "num_ratings": "769", "num_reviews": "185", "avg_ratings": 3.48, "genres": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller", "Psychological Thriller"], "title": "14 Days to Die", "description": ["To what extent would you go to avenge your husband's infidelity? ", "Stay-at-home mom Sarah Johnson has the perfect family—a handsome, hardworking husband and two healthy and beautiful children. At least, that’s what she’s been telling herself for years. After the tragedies in her youth, Sarah deemed living a lie easier than dwelling on the past and facing her everyday failure", "To what extent would you go to avenge your husband's infidelity? ", "Stay-at-home mom Sarah Johnson has the perfect family—a handsome, hardworking husband and two healthy and beautiful children. At least, that’s what she’s been telling herself for years. After the tragedies in her youth, Sarah deemed living a lie easier than dwelling on the past and facing her everyday failures. To avoid any kind of confrontation at home she doesn’t read her husband’s emails or spy on him like most jealous wives do. She wouldn’t jeopardize her comfortable but dull life for anything. ", "But Sarah’s world is about to crumble around her when she receives a phone call from a man with a heavy foreign accent telling her that her perfect husband has put a price on her head. She is offered two weeks to come up with a counteroffer or die. Why would her model husband Mike want her dead? Hasn’t she been the perfect wife? Or has her karma finally caught up with her—making her pay for her former transgressions? The final countdown begins and now Sarah has to race against time to find out what went wrong in her marriage and find a way out of this nightmare. ", "So the game of life or death begins. Secrets are unveiled. Emotions are unleashed. Actions are taken. ", "Will there be a winner in this dangerous game when no one can escape the twist of fate?"], "author": "A.B. Whelan", "num_pages": "266", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-01-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20884254-the-book-of-you", "num_ratings": "10,646", "num_reviews": "1,352", "avg_ratings": 3.59, "genres": ["Thriller", "Fiction", "Mystery", "Suspense", "Thriller", "Mystery Thriller", "Mystery", "Crime"], "title": "The Book of You", "description": ["A terrifying psychological thriller about obsession and power, perfect for fans of Gone Girl and Before I Go to Sleep.", "Clarissa is becoming more and more frightened of her colleague, Rafe. He won’t leave her alone, and he refuses to take no for an answer. He is always there.", "Being selected for jury service is a relief. The courtroom is a safe haven, a place where Rafe can’t", "A terrifying psychological thriller about obsession and power, perfect for fans of Gone Girl and Before I Go to Sleep.", "Clarissa is becoming more and more frightened of her colleague, Rafe. He won’t leave her alone, and he refuses to take no for an answer. He is always there.", "Being selected for jury service is a relief. The courtroom is a safe haven, a place where Rafe can’t be. But as a violent tale of kidnap and abuse unfolds, Clarissa begins to see parallels between her own situation and that of the young woman on the witness stand.", "Realizing that she bears the burden of proof, Clarissa unravels the twisted, macabre fairytale that Rafe has spun around them – and discovers that the ending he envisions is more terrifying than she could have imagined.", "But how do you protect yourself from an enemy no one else can see?", "(Spoilers! Trigger warning: This book contains stalking and scenes of rape, drug use and violence)"], "author": "Claire Kendal", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-24 00:00:00", "ISBN": "0007531648"},
{"url": "https://www.goodreads.com/book/show/2199587.Fractured", "num_ratings": "31,777", "num_reviews": "1,534", "avg_ratings": 4.18, "genres": ["Mystery", "Thriller", "Mystery", "Crime", "Fiction", "Suspense"], "title": "Fractured", "description": ["With its gracious homes and tree-lined streets, Ansley Park is one of Atlanta's most desirable neighborhoods. But in one gleaming mansion, in a teenager's lavish bedroom, a girl has been savagely murdered. And in the hallway, her horrified mother stands amid shattered glass, having killed her daughter's attacker with her bare hands. ", "Detective Will Trent of the Georgia Bure", "With its gracious homes and tree-lined streets, Ansley Park is one of Atlanta's most desirable neighborhoods. But in one gleaming mansion, in a teenager's lavish bedroom, a girl has been savagely murdered. And in the hallway, her horrified mother stands amid shattered glass, having killed her daughter's attacker with her bare hands. ", "Detective Will Trent of the Georgia Bureau of Investigation is here only to do a political favor; the murder site belongs to the Atlanta police. But Trent soon sees something that the cops are missing, something in the trail of blood, in a matrix of forensic evidence, and in the eyes of the shell-shocked mother. Within minutes, Trent is taking over the case -- and adding another one to it. He is sure that another teenage girl is missing, and that a killer is on the loose.", "Armed with only fleeting clues, teamed with a female cop who has her own personal reasons for hating him, Trent has enemies all around him -- and a gnawing feeling that this case, which started in the best of homes, is cutting quick and deep through the ruins of perfect lives broken wide-open: where human demons emerge with a vengeance."], "author": "Karin Slaughter", "num_pages": "388", "awards": ["Prix Polar International (2011)"], "places": ["Atlanta, Georgia"], "character_names": ["Angie Polaski", "Will Trent", "Faith Mitchell", "Amanda Wagner"], "language": "English", "publish_date": "2008-07-29 00:00:00", "ISBN": "0385341954"},
{"url": "https://www.goodreads.com/book/show/12922320-criminal", "num_ratings": "25,175", "num_reviews": "2,004", "avg_ratings": 4.22, "genres": ["Mystery", "Mystery", "Crime", "Thriller", "Fiction", "Thriller", "Mystery Thriller"], "title": "Criminal", "description": ["Will Trent is a brilliant agent with the Georgia Bureau of Investigation. Newly in love, he is beginning to put a difficult past behind him. Then a local college student goes missing, and Will is inexplicably kept off the case by his supervisor and mentor, deputy director Amanda Wagner. Will cannot fathom Amanda’s motivation until the two of them literally collide in an ab", "Will Trent is a brilliant agent with the Georgia Bureau of Investigation. Newly in love, he is beginning to put a difficult past behind him. Then a local college student goes missing, and Will is inexplicably kept off the case by his supervisor and mentor, deputy director Amanda Wagner. Will cannot fathom Amanda’s motivation until the two of them literally collide in an abandoned orphanage they have both been drawn to for different reasons. Decades before, when his father was imprisoned for murder, this was Will’s home. It appears that the case that launched Amanda’s career forty years ago has suddenly come back to life—and it involves the long-held mystery of Will’s birth and parentage. Now these two dauntless investigators will each need to face down demons from the past if they are to prevent an even greater terror from being unleashed."], "author": "Karin Slaughter", "num_pages": "448", "awards": [], "places": [], "character_names": ["Sara Linton", "Will Trent", "Faith Mitchell", "Amanda Wagner"], "language": "English", "publish_date": "2012-07-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16071790-just-what-kind-of-mother-are-you", "num_ratings": "8,472", "num_reviews": "1,082", "avg_ratings": 3.78, "genres": ["Mystery", "Fiction", "Thriller", "Mystery", "Crime", "Suspense", "Thriller", "Mystery Thriller"], "title": "Just What Kind of Mother Are You?", "description": ["A searing and sinister thriller for readers who liked Gone Girl.", "A searing and sinister thriller for readers who liked Gone Girl.What if your best friend's child disappears? And it was all your fault. This is exactly what happens to Lisa Kallisto, overwhelmed working mother of three, one freezing Decembe", "A searing and sinister thriller for readers who liked Gone Girl.", "A searing and sinister thriller for readers who liked Gone Girl.What if your best friend's child disappears? And it was all your fault. This is exactly what happens to Lisa Kallisto, overwhelmed working mother of three, one freezing December in the English Lake District. She takes her eye off the ball for just a moment and her whole world descends into the stuff of nightmares. Because, not only is thirteen-year-old Lucinda missing, and not only is it all Lisa's fault, but she's the second teenage girl to disappear within this small tightknit community over two weeks. The first girl turned up stripped bare, dumped on a busy high street, after suffering from a terrifying ordeal. ", "Wracked with guilt over her mistake and after being publicly blamed by Lucinda's family, Lisa sets out to right the wrong. But as she begins peeling away the layers surrounding Lucinda's disappearance, Lisa learns that the small, posh, quiet town she lives in isn't what she thought it was, and her friends may not be who they appear, either."], "author": "Paula Daly", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-30 00:00:00", "ISBN": "0385680074"},
{"url": "https://www.goodreads.com/book/show/16045220-close-my-eyes", "num_ratings": "5,292", "num_reviews": "875", "avg_ratings": 3.8, "genres": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "Close My Eyes", "description": ["When Geniver Loxley lost her daughter at birth eight years ago, her world stopped… and never fully started again. Mothers with strollers still make her flinch; her love of writing has turned into a half-hearted teaching career; and she and her husband, Art, have slipped into the kind of rut that seems inescapable.", "But then a stranger shows up on their doorstep, telling Gen", "When Geniver Loxley lost her daughter at birth eight years ago, her world stopped… and never fully started again. Mothers with strollers still make her flinch; her love of writing has turned into a half-hearted teaching career; and she and her husband, Art, have slipped into the kind of rut that seems inescapable.", "But then a stranger shows up on their doorstep, telling Gen the very thing she’s always wanted to hear: that her daughter Beth was not stillborn, but was taken away as a healthy infant and is still out there, somewhere, waiting to be found. It’s insane, unbelievable. But why would anyone make that up? A fissure suddenly opens up in Gen’s carefully reconstructed life, letting in a flood of unanswerable questions. Where is Beth now? Why is Art so reluctant to get involved? To save his wife from further hurt? Or is it something more sinister? And who can she trust to help her?", "Ignoring the warnings of her husband and friends, Gen begins to delve into the dark corners of her past, hopeful she’ll find a clue to her daughter’s whereabouts. But hope quickly turns into fear and paranoia, as she realizes that finding the answers might open the door to something even worse than not knowing. A truth that could steal everything she holds close – even her own life."], "author": "Sophie McKenzie", "num_pages": "391", "awards": [], "places": [], "character_names": ["Geniver Loxley", "Art Loxley", "Lorcan Byrne"], "language": "English", "publish_date": "2013-07-09 00:00:00", "ISBN": "1250033896"},
{"url": "https://www.goodreads.com/book/show/13359714-the-surgeon-s-blade", "num_ratings": "126", "num_reviews": "27", "avg_ratings": 3.68, "genres": ["Mystery", "Fiction", "Thriller"], "title": "The Surgeon's Blade", "description": ["Mystery-suspense-thriller writer, Faith Mortimer is delighted to add book three to the best-selling Diana Rivers mystery thriller series. This latest novel, \"The Surgeon's Blade\" is chilling, tense and is described as a 'real corker of a read'. Nursing sister, Libby Hunter wakes up in hospital with amnesia after a traumatic sailing accident. The stranger she finds sitting", "Mystery-suspense-thriller writer, Faith Mortimer is delighted to add book three to the best-selling Diana Rivers mystery thriller series. This latest novel, \"The Surgeon's Blade\" is chilling, tense and is described as a 'real corker of a read'. Nursing sister, Libby Hunter wakes up in hospital with amnesia after a traumatic sailing accident. The stranger she finds sitting by her bedside claims to be her fiance. As she cannot remember ever being engaged, she finds excuses to put him off until she is completely sure of her true feelings. Returning home, Libby finds herself in great danger when her house is broken into. Who is the intruder and what does he want? Is this connected in any way to a series of attacks on nurses in London and Southampton? Will Libby be the latest targeted victim? Distressed Libby turns to helicopter pilot, Robert for help and understanding, but is he as respectable and kind as he appears to be? Is her so-called fiance, Nigel trustworthy? The night time intrusion into Libby's house sets in motion a downwards spiral of cataclysmic and terrifying events, culminating in our favourite sleuth, Diana Rivers stepping in to help solve the case in this chilling mystery"], "author": "Faith Mortimer", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17329041-the-other-typist", "num_ratings": "16,043", "num_reviews": "2,624", "avg_ratings": 3.55, "genres": ["Historical", "Historical Fiction", "Fiction", "Mystery", "Historical"], "title": "The Other Typist", "description": ["A haunting debut novel set against the background of New York City in the 1920s…", "Confessions are Rose Baker’s job. A typist for the New York City Police Department, she sits in judgment like a high priestess. Criminals come before her to admit their transgressions, and, with a few strokes of the keys before her, she seals their fate. But while she may hear about shootings,", "A haunting debut novel set against the background of New York City in the 1920s…", "Confessions are Rose Baker’s job. A typist for the New York City Police Department, she sits in judgment like a high priestess. Criminals come before her to admit their transgressions, and, with a few strokes of the keys before her, she seals their fate. But while she may hear about shootings, knifings, and crimes of passion, as soon as she leaves the room, she reverts to a dignified and proper lady. Until Odalie joins the typing pool.", "As Rose quickly falls under the stylish, coquettish Odalie’s spell, she is lured into a sparkling underworld of speakeasies and jazz. And what starts as simple fascination turns into an obsession from which she may never recover."], "author": "Suzanne Rindell", "num_pages": "354", "awards": [], "places": ["New York City, New York"], "character_names": ["Rose Baker"], "language": "English", "publish_date": "2014-01-02 00:00:00", "ISBN": "0241963745"},
{"url": "https://www.goodreads.com/book/show/65910.The_Perfect_Husband", "num_ratings": "32,916", "num_reviews": "1,352", "avg_ratings": 4.01, "genres": ["Mystery", "Thriller", "Suspense", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "The Perfect Husband", "description": ["What would you do if the man of your dreams hides the soul of a killer? ", "Jim Beckett was everything she'd ever dreamed of...But two years after Tess married the decorated cop and bore his child, she helped put him behind bars for savagely murdering ten women. Even locked up in a maximum security prison, he vowed he would come after her and make her pay. Now the cunning kill", "What would you do if the man of your dreams hides the soul of a killer? ", "Jim Beckett was everything she'd ever dreamed of...But two years after Tess married the decorated cop and bore his child, she helped put him behind bars for savagely murdering ten women. Even locked up in a maximum security prison, he vowed he would come after her and make her pay. Now the cunning killer has escaped--and the most dangerous game of all begins.... ", "After a lifetime of fear, Tess will do something she's never done before. She's going to learn to protect her daughter and fight back, with the help of a burned-out ex-marine. As the largest manhunt four states have ever seen mobilizes to catch Beckett, the clock winds down to the terrifying reunion between husband and wife. And Tess knows that this time, her only choices are to kill--or be killed."], "author": "Lisa Gardner", "num_pages": "432", "awards": [], "places": ["Arizona", "Massachusetts"], "character_names": [], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "0553587692"},
{"url": "https://www.goodreads.com/book/show/22693182-where-they-found-her", "num_ratings": "27,033", "num_reviews": "2,776", "avg_ratings": 3.84, "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Suspense", "Audiobook", "Adult"], "title": "Where They Found Her", "description": ["From the author of the New York Times bestseller and 2014 Edgar and Anthony nominee Reconstructing Amelia comes another harrowing, gripping novel that marries psychological suspense with an emotionally powerful story about a community struggling with the consequences of a devastating discovery.", "At the end of a long winter, in bucolic Ridgedale, New Jersey, the body of an in", "From the author of the New York Times bestseller and 2014 Edgar and Anthony nominee Reconstructing Amelia comes another harrowing, gripping novel that marries psychological suspense with an emotionally powerful story about a community struggling with the consequences of a devastating discovery.", "At the end of a long winter, in bucolic Ridgedale, New Jersey, the body of an infant is discovered in the woods near the town’s prestigious university campus. No one knows who the baby is, or how her body ended up out there. But there is no shortage of opinions. ", "When freelance journalist, and recent Ridgedale transplant, Molly Anderson is unexpectedly called upon to cover the story for the Ridegdale Reader, it’s a risk, given the severe depression that followed the loss of her own baby. But the bigger threat comes when Molly unearths some of Ridgedale’s darkest secrets, including a string of unreported sexual assaults that goes back twenty years. ", "Meanwhile, Sandy, a high school dropout, searches for her volatile and now missing mother, and PTA president Barbara struggles to help her young son, who’s suddenly having disturbing outbursts. ", "Told from the perspectives of Molly, Barbara, and Sandy, Kimberly McCreight’s taut and profoundly moving novel unwinds the tangled truth about the baby’s death revealing that these three women have far more in common than they realized. And that their lives are more intertwined with what happened to the baby than they ever could have imagined."], "author": "Kimberly McCreight", "num_pages": "326", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-14 00:00:00", "ISBN": "0062225464"},
{"url": "https://www.goodreads.com/book/show/21922122-look-behind-you", "num_ratings": "11,118", "num_reviews": "705", "avg_ratings": 3.83, "genres": ["Thriller", "Mystery", "Fiction", "Thriller", "Psychological Thriller", "Mystery", "Crime", "Suspense"], "title": "Look Behind You", "description": ["Chloe Benson wakes up kidnapped and bound in an underground tomb with no memory of how she got there. ", "She escapes through deserted woods with her life, but no one believes her story.", "And when she suspects her husband is lying to her, Chloe is forced to retrace her past, following in her own footsteps to find the truth and stay alive.", "But who is following Chloe?", "Look Behind Yo", "Chloe Benson wakes up kidnapped and bound in an underground tomb with no memory of how she got there. ", "She escapes through deserted woods with her life, but no one believes her story.", "And when she suspects her husband is lying to her, Chloe is forced to retrace her past, following in her own footsteps to find the truth and stay alive.", "But who is following Chloe?", "Look Behind You. You never know who’s out there."], "author": "Sibel Hodge", "num_pages": "238", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-16 00:00:00", "ISBN": "149609705X"},
{"url": "https://www.goodreads.com/book/show/23014593-little-black-lies", "num_ratings": "8,333", "num_reviews": "1,340", "avg_ratings": 3.99, "genres": ["Mystery", "Thriller", "Fiction", "Thriller", "Mystery Thriller", "Suspense"], "title": "Little Black Lies", "description": ["In such a small community as the Falkland Islands, a missing child is unheard of. In such a dangerous landscape it can only be a terrible tragedy, surely...", "When another child goes missing, and then a third, it’s no longer possible to believe that their deaths were accidental, and the villagers must admit that there is a murderer among them. Even Catrin Quinn, a damaged wom", "In such a small community as the Falkland Islands, a missing child is unheard of. In such a dangerous landscape it can only be a terrible tragedy, surely...", "When another child goes missing, and then a third, it’s no longer possible to believe that their deaths were accidental, and the villagers must admit that there is a murderer among them. Even Catrin Quinn, a damaged woman living a reclusive life after the accidental deaths of her own two sons a few years ago, gets involved in the searches and the speculation.", "And suddenly, in this wild and beautiful place that generations have called home, no one feels safe and the hysteria begins to rise.", "But three islanders—Catrin, her childhood best friend, Rachel, and her ex-lover Callum—are hiding terrible secrets. And they have two things in common: all three of them are grieving, and none of them trust anyone, not even themselves."], "author": "Sharon J. Bolton", "num_pages": "368", "awards": [], "places": ["Falkland Islands"], "character_names": [], "language": "English", "publish_date": "2015-05-19 00:00:00", "ISBN": "1250028590"},
{"url": "https://www.goodreads.com/book/show/11940384-the-wicked-girls", "num_ratings": "13,112", "num_reviews": "1,400", "avg_ratings": 3.48, "genres": ["Mystery", "Fiction", "Thriller", "Mystery", "Crime", "Thriller", "Mystery Thriller", "Suspense"], "title": "The Wicked Girls", "description": ["One fateful summer morning in 1986, two 11-year-old girls meet for the first time and by the end of the day are charged with murder.", "Twenty-five years later, journalist Kirsty Lindsay is reporting on a series of attacks on young female tourists in a seaside town when her investigation leads her to interview funfair cleaner Amber Gordon. For Kirsty and Amber, it's the first", "One fateful summer morning in 1986, two 11-year-old girls meet for the first time and by the end of the day are charged with murder.", "Twenty-five years later, journalist Kirsty Lindsay is reporting on a series of attacks on young female tourists in a seaside town when her investigation leads her to interview funfair cleaner Amber Gordon. For Kirsty and Amber, it's the first time they've seen each other since that dark day when they were just children. But with new lives – and families – to protect, will they really be able to keep their secret hidden?"], "author": "Alex Marwood", "num_pages": "378", "awards": ["Anthony Award Nominee for Best Paperback Original (2014)", "Edgar Award for Best Paperback Original (2014)"], "places": [], "character_names": ["Jade Walker", "Annabel Oldacre", "Amber Gordon", "Kirsty Lindsay", "Chloe Francis", "Jackie Jacobs", "Martin Bagshawe"], "language": "English", "publish_date": "2012-02-01 00:00:00", "ISBN": "1847445209"},
{"url": "https://www.goodreads.com/book/show/27191173-sister-dear", "num_ratings": "914", "num_reviews": "256", "avg_ratings": 3.74, "genres": ["Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller", "Contemporary", "Thriller"], "title": "Sister Dear", "description": ["Convicted of a crime she didn’t commit, Allie watched a decade of her life vanish – time that can never be recovered. Now, out on parole, Allie is determined to clear her name, rebuild her life, and reconnect with the daughter she bare", "Convicted of a crime she didn’t commit, Allie watched a decade of her life vanish – time that can never be recovered. Now, out on parole, Allie is determined to clear her name, rebuild her life, and reconnect with the daughter she barely knows.", "But Allie’s return home shatters the quaint, coastal community of Brunswick, Georgia. Even her own daughter Caroline, now a teenager, bristles at Allie’s claims of innocence. Refusing defeat, a stronger, smarter Allie launches a battle for the truth, digging deeply into the past even if it threatens her parole status, personal safety, and the already-fragile bond with family.", "As her commitment to finding the truth intensifies, what Allie ultimately uncovers is far worse than she imagined. Her own sister has been hiding a dark secret—one that holds the key to Allie’s freedom."], "author": "Laura McNeill", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-19 00:00:00", "ISBN": "0718030923"},
{"url": "https://www.goodreads.com/book/show/16045136-lost", "num_ratings": "6,713", "num_reviews": "652", "avg_ratings": 4.13, "genres": ["Mystery", "Mystery", "Crime", "Thriller", "Fiction", "Thriller", "Mystery Thriller", "Suspense"], "title": "Lost", "description": ["Like everyone reading the newspapers these days, 10-year-old Barney Roberts knows the killer will strike again soon. The victim will be another boy, just like him. The body will be drained of blood, and left somewhere on a Thames beach. There will be no clues for London detectives Dana Tulloch and Mark Joesbury to find. There will be no warning about who will be next. Ther", "Like everyone reading the newspapers these days, 10-year-old Barney Roberts knows the killer will strike again soon. The victim will be another boy, just like him. The body will be drained of blood, and left somewhere on a Thames beach. There will be no clues for London detectives Dana Tulloch and Mark Joesbury to find. There will be no warning about who will be next. There will be no real reason for Barney's friend and neighbor, Lacey Flint, on leave from her job as a London police detective, to become involved…and no chance that she can stay away. With the clock ticking, the violence escalating, and young lives at stake, Lacey and Barney both know they can't afford a single wrong step if they hope to make it through alive.", "Please note, this title is published in the UK as Like This For Ever."], "author": "Sharon J. Bolton", "num_pages": "391", "awards": [], "places": [], "character_names": ["Lacey Flint", "Detective Inspector Dana Tulloch", "Mark Joesbury"], "language": "English", "publish_date": "2013-06-04 00:00:00", "ISBN": "1250028566"},
{"url": "https://www.goodreads.com/book/show/18209468-the-weight-of-blood", "num_ratings": "18,638", "num_reviews": "2,272", "avg_ratings": 3.74, "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Suspense", "Mystery", "Crime"], "title": "The Weight of Blood", "description": ["The Dane family's roots tangle deep in the Ozark Mountain town of Henbane, but that doesn't kee", "The Dane family's roots tangle deep in the Ozark Mountain town of Henbane, but that doesn't keep sixteen-year-old Lucy Dane from being treated like an outsider. Folks still whisper about her mother, a bewitching young stranger who inspired local myths when she vanished years ago. When one of Lucy's few friends, slow-minded Cheri, is found murdered, Lucy feels haunted by the two lost girls-the mother she never knew and the friend she couldn't protect. Everything changes when Lucy stumbles across Cheri's necklace in an abandoned trailer and finds herself drawn into a search for answers. What Lucy discovers makes it impossible to ignore the suspicion cast on her own kin. More alarming, she suspects Cheri's death could be linked to her mother's disappearance, and the connection between the two puts Lucy at risk of losing everything. In a place where the bonds of blood weigh heavy, Lucy must decide where her allegiances lie."], "author": "Laura McHugh", "num_pages": "302", "awards": ["ITW Thriller Award for Best First Novel (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Silver Falchion Award (2015)", "Goodreads Choice Award Nominee for Mystery & Thriller and for Debut Goodreads Author (2014)", "Missouri Author Award for Fiction (2016)"], "places": ["Ozark Mountains", "Arkansas", "Missouri"], "character_names": ["Carl Bishop", "Lucy", "Lila", "Crete"], "language": "English", "publish_date": "2014-03-11 00:00:00", "ISBN": "0812995201"},
{"url": "https://www.goodreads.com/book/show/18635113-elizabeth-is-missing", "num_ratings": "43,879", "num_reviews": "5,712", "avg_ratings": 3.7, "genres": ["Fiction", "Mystery", "Contemporary"], "title": "Elizabeth Is Missing", "description": ["In this darkly riveting debut novel—a sophisticated psychological mystery that is also a heartbreakingly honest meditation on memory, identity, and aging—an elderly woman descending into dementia embarks on a desperate quest to find the best friend she believes has disappeared, and her search for the truth will go back decades and have shattering consequences.", "Maud, an agin", "In this darkly riveting debut novel—a sophisticated psychological mystery that is also a heartbreakingly honest meditation on memory, identity, and aging—an elderly woman descending into dementia embarks on a desperate quest to find the best friend she believes has disappeared, and her search for the truth will go back decades and have shattering consequences.", "Maud, an aging grandmother, is slowly losing her memory—and her grip on everyday life. Yet she refuses to forget her best friend Elizabeth, who she is convinced is missing and in terrible danger.", "But no one will listen to Maud—not her frustrated daughter, Helen, not her caretakers, not the police, and especially not Elizabeth's mercurial son, Peter. Armed with handwritten notes she leaves for herself and an overwhelming feeling that Elizabeth needs her help, Maud resolves to discover the truth and save her beloved friend.", "This singular obsession forms a cornerstone of Maud's rapidly dissolving present. But the clues she discovers seem only to lead her deeper into her past, to another unsolved disappearance: her sister, Sukey, who vanished shortly after World War II.", "As vivid memories of a tragedy that occurred more than fifty years ago come flooding back, Maud discovers new momentum in her search for her friend. Could the mystery of Sukey's disappearance hold the key to finding Elizabeth?"], "author": "Emma Healey", "num_pages": "320", "awards": ["Costa Book Award for First Novel (2014)", "Dylan Thomas Prize Nominee for Longlist (2014)", "Desmond Elliott Prize Nominee for Shortlist (2015)", "Women's Prize for Fiction Nominee for Longlist (2015)", "Betty Trask Award (2015)", "Specsavers National Book Award Nominee for Books Are My Bag New Writer of the Year; Specsavers Popular Fiction Book of the Year (2014)", "Goodreads Choice Award Nominee for Debut Goodreads Author (2014)"], "places": ["Dorset, England"], "character_names": ["Maud Horsham", "Elizabeth Markham", "Susan \"Sukey\" Gerrard", "Mr. Palmer", "Lilian Palmer", "Frank Gerrard", "Carla the carer", "Helen (daughter of Maud)", "Katy the granddaughter", "Douglas the lodger", "Peter Markham", "Mrs. Winner"], "language": "English", "publish_date": "2014-06-10 00:00:00", "ISBN": "0062309668"},
{"url": "https://www.goodreads.com/book/show/20821043-the-secret-place", "num_ratings": "46,017", "num_reviews": "5,465", "avg_ratings": 3.85, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller", "Thriller"], "title": "The Secret Place", "description": ["The photo on the card shows a boy who was found murdered, a year ago, on the grounds of a girls’ boarding school in the leafy suburbs of Dublin. The caption says, I KNOW WHO KILLED HIM.", "Detective Stephen Moran has been waiting for his chance to get a foot in the door of Dublin’s Murder Squad—and one morning, sixteen-year-old Holly Mackey brings him this photo. The Secret Pl", "The photo on the card shows a boy who was found murdered, a year ago, on the grounds of a girls’ boarding school in the leafy suburbs of Dublin. The caption says, I KNOW WHO KILLED HIM.", "Detective Stephen Moran has been waiting for his chance to get a foot in the door of Dublin’s Murder Squad—and one morning, sixteen-year-old Holly Mackey brings him this photo. The Secret Place, a board where the girls at St. Kilda’s School can pin up their secrets anonymously, is normally a mishmash of gossip and covert cruelty, but today someone has used it to reignite the stalled investigation into the murder of handsome, popular Chris Harper. Stephen joins forces with the abrasive Detective Antoinette Conway to find out who and why.", "But everything they discover leads them back to Holly’s close-knit group of friends and their fierce enemies, a rival clique—and to the tangled web of relationships that bound all the girls to Chris Harper. Every step in their direction turns up the pressure. Antoinette Conway is already suspicious of Stephen’s links to the Mackey family. St. Kilda’s will go a long way to keep murder outside their walls. Holly’s father, Detective Frank Mackey, is circling, ready to pounce if any of the new evidence points toward his daughter. And the private underworld of teenage girls can be more mysterious and more dangerous than either of the detectives imagined."], "author": "Tana French", "num_pages": "452", "awards": ["Anthony Award Nominee for Best Novel (2015)", "Strand Critics Award  Nominee for Best Novel (2014)", "Goodreads Choice Award Nominee for Mystery & Thriller (2014)"], "places": [], "character_names": ["Frank Mackey", "Holly Mackey", "Antoinette Conway", "Stephen Moran"], "language": "English", "publish_date": "2014-09-02 00:00:00", "ISBN": "0670026328"},
{"url": "https://www.goodreads.com/book/show/21718.Blindsighted", "num_ratings": "53,747", "num_reviews": "2,334", "avg_ratings": 4.1, "genres": ["Mystery", "Thriller", "Mystery", "Crime", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "Blindsighted", "description": ["A small Georgia town erupts in panic when a young college professor is found brutally mutilated in the local diner. But it's only when town pediatrician and coroner Sara Linton does the autopsy that the full extent of the killer's twisted work becomes clear. Sara's ex-husband, police chief Jeffrey Tolliver, leads the investigation -- a trail of terror that grows increasing", "A small Georgia town erupts in panic when a young college professor is found brutally mutilated in the local diner. But it's only when town pediatrician and coroner Sara Linton does the autopsy that the full extent of the killer's twisted work becomes clear. Sara's ex-husband, police chief Jeffrey Tolliver, leads the investigation -- a trail of terror that grows increasingly macabre when another local woman is found crucified a few days later. But he's got more than a sadistic serial killer on his hands, for the county's sole female detective, Lena Adams -- the first victim's sister -- wants to serve her own justice. But it is Sara who holds the key to finding the killer. A secret from her past could unmask the brilliantly malevolent psychopath .. or mean her death."], "author": "Karin Slaughter", "num_pages": "418", "awards": ["Barry Award Nominee for Best First Novel (2002)", "Macavity Award Nominee for Best First Mystery Novel (2002)"], "places": ["United States of America", "Heartsdale, Georgia", "Georgia"], "character_names": ["Sara Linton", "Chief Jeffrey Tolliver", "Lena Adams", "Hank Adams", "Tess Linton"], "language": "English", "publish_date": "2002-10-01 00:00:00", "ISBN": "0380820889"},
{"url": "https://www.goodreads.com/book/show/9783200-now-you-see-me", "num_ratings": "13,462", "num_reviews": "1,521", "avg_ratings": 4.04, "genres": ["Mystery", "Thriller", "Mystery", "Crime", "Fiction", "Thriller", "Mystery Thriller", "Suspense"], "title": "Now You See Me", "description": ["One night after interviewing a reluctant witness at a London apartment complex, Lacey Flint, a young detective constable, stumbles onto a woman brutally stabbed just moments before in the building’s darkened parking lot. Within twenty-four hours a reporter receives an anonymous letter that points out alarming similarities between the murder and Jack the Ripper’s first murd", "One night after interviewing a reluctant witness at a London apartment complex, Lacey Flint, a young detective constable, stumbles onto a woman brutally stabbed just moments before in the building’s darkened parking lot. Within twenty-four hours a reporter receives an anonymous letter that points out alarming similarities between the murder and Jack the Ripper’s first murder—a letter that calls out Lacey by name. If it’s real, and they have a killer bent on re-creating London’s bloody past, history shows they have just five days until the next attempt.", "No one believes the connections are anything more than a sadistic killer’s game, not even Lacey, whom the killer seems to be taunting specifically. However, as they investigate the details of the case start reminding her more and more of a part of her past she’d rather keep hidden. And the only way to do that is to catch the killer herself."], "author": "Sharon J. Bolton", "num_pages": "400", "awards": ["Mary Higgins Clark Award Nominee (2012)"], "places": ["London, England"], "character_names": ["Lacey Flint", "Detective Inspector Dana Tulloch", "Mark Joesbury"], "language": "English", "publish_date": "2011-06-07 00:00:00", "ISBN": "0312600526"},
{"url": "https://www.goodreads.com/book/show/23125266-i-let-you-go", "num_ratings": "74,548", "num_reviews": "9,330", "avg_ratings": 4.08, "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Mystery", "Crime", "Suspense"], "title": "I Let You Go", "description": ["In a split second, Jenna Gray's world descends into a nightmare. Her only hope of moving on is to walk away from everything she knows to start afresh. Desperate to escape, Jenna moves to a remote cottage on the Welsh coast, but she is haunted by her fears, her grief and her memories of", "In a split second, Jenna Gray's world descends into a nightmare. Her only hope of moving on is to walk away from everything she knows to start afresh. Desperate to escape, Jenna moves to a remote cottage on the Welsh coast, but she is haunted by her fears, her grief and her memories of a cruel November night that changed her life forever.", "Slowly, Jenna begins to glimpse the potential for happiness in her future. But her past is about to catch up with her, and the consequences will be devastating . . ."], "author": "Clare Mackintosh", "num_pages": "371", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-09 00:00:00", "ISBN": "0751554154"},
{"url": "https://www.goodreads.com/book/show/7159515-still-missing", "num_ratings": "55,277", "num_reviews": "6,456", "avg_ratings": 3.97, "genres": ["Mystery", "Fiction", "Thriller", "Suspense", "Thriller", "Mystery Thriller", "Mystery", "Crime"], "title": "Still Missing", "description": ["On the day she was abducted, Annie O’Sullivan, a 32-year-old realtor, had three goals—sell a house, forget about a recent argument with her mother, and be on time for dinner with her ever-patient boyfriend. The open house is slow, but when her last visitor pulls up in a van as she's about to leave, Annie thinks it just might be her lucky day after all. ", " interw", "On the day she was abducted, Annie O’Sullivan, a 32-year-old realtor, had three goals—sell a house, forget about a recent argument with her mother, and be on time for dinner with her ever-patient boyfriend. The open house is slow, but when her last visitor pulls up in a van as she's about to leave, Annie thinks it just might be her lucky day after all. ", " interweaves the year Annie spent as the captive of a psychopath in a remote mountain cabin, which unfold through sessions with her psychiatrist, with a second narrative following the events after her escape—her struggle to piece her shattered life back together and the ongoing police investigation into the identity of her captor.", " is a shocking, visceral, brutal and beautifully crafted novel."], "author": "Chevy Stevens", "num_pages": "352", "awards": ["ITW Thriller Award for Best First Novel (2011)", "Goodreads Choice Award Nominee (2010)"], "places": ["Vancouver Island, British Columbia", "Canada"], "character_names": ["Annie O'Sullivan"], "language": "English", "publish_date": "2010-07-06 00:00:00", "ISBN": "0312595670"},
{"url": "https://www.goodreads.com/book/show/24345258-hiding-places", "num_ratings": "247", "num_reviews": "113", "avg_ratings": 3.66, "genres": ["Suspense", "Contemporary", "Fiction", "Christian Fiction", "Mystery", "Thriller"], "title": "Hiding Places", "description": ["Eleven-year-old Kate Whitby leads an invisible life, the youngest member of her odd family. They live in their historic small-town hotel, where she is an expert at keeping everyone’s secrets: her sister’s a thief, her great-grandmother isn’t as crazy as people think, her mother lives in the past, and her belove", "Eleven-year-old Kate Whitby leads an invisible life, the youngest member of her odd family. They live in their historic small-town hotel, where she is an expert at keeping everyone’s secrets: her sister’s a thief, her great-grandmother isn’t as crazy as people think, her mother lives in the past, and her beloved grandfather might have killed his best friend.", "Devoted to the people she loves—more than they have ever been to her—Kate vows to protect each one.", "Charlie Fuse has lived on the streets since his alcoholic father threw him out. When Charlie’s powerful street family tests his loyalty by demanding that he kill the son of a rival gang leader, he refuses. They frame him for the murder, forcing Charlie to run.", "When Kate finds Charlie injured and penniless, she hides him from his enemies and her uncharitable relatives, unaware that he has a connection to her family as old as the hotel itself.", "The murderous gang tracks Charlie down. To flush him out, they take the clueless family hostage and threaten young Kate. Even then, Kate keeps Charlie hidden, putting all her childlike faith in one terrible hope: that the family who has never been able to protect her before might learn how to do it now."], "author": "Erin Healy", "num_pages": "368", "awards": [], "places": ["Other Editions (6)", "\n", "\n", "\n", "\n", "\n", "All Editions"], "character_names": [], "language": null, "publish_date": "2015-09-08 00:00:00", "ISBN": "1401689604"},
{"url": "https://www.goodreads.com/book/show/23346377-in-a-dark-dark-wood", "num_ratings": "130,202", "num_reviews": "12,640", "avg_ratings": 3.67, "genres": ["Mystery", "Thriller", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "In a Dark, Dark Wood", "description": ["Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. ", "Until, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?", "But something goes wrong. Very wrong.", "Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. ", "Until, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?", "But something goes wrong. Very wrong.", "Some things can’t stay secret for ever."], "author": "Ruth Ware", "num_pages": "352", "awards": [], "places": ["England"], "character_names": [], "language": "English", "publish_date": "2015-07-30 00:00:00", "ISBN": "1846558913"},
{"url": "https://www.goodreads.com/book/show/1914973.The_Likeness", "num_ratings": "91,763", "num_reviews": "7,748", "avg_ratings": 4.05, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller", "Thriller"], "title": "The Likeness", "description": ["Detective Cassie Maddox is still trying to deal with the events of ", ". She is out of the Murder Squad and has started a relationship with fellow detective Sam O'Neill but is too badly shaken to commit to Sam or to her career. Then Sam is allocated a new case, that of a young woman stabbed to death just outside Dublin. He calls Cassie to the murder scene and she f", "Detective Cassie Maddox is still trying to deal with the events of ", ". She is out of the Murder Squad and has started a relationship with fellow detective Sam O'Neill but is too badly shaken to commit to Sam or to her career. Then Sam is allocated a new case, that of a young woman stabbed to death just outside Dublin. He calls Cassie to the murder scene and she finds the victim is strangely familiar. In fact, she is Cassie's double. Not only that, but her ID says she is Lexie Madison the identity Cassie used, years ago, as an undercover detective. With no leads, no suspects and no clues, Cassie's old undercover boss spots the opportunity of a lifetime: to send Cassie undercover in the dead girl's place. She could pick up information the police would never hear and tempt the killer to finish the job. So Cassie moves into Whitethorn House, poses as a post-grad student, and prepares to enter Lexie's world."], "author": "Tana French", "num_pages": "466", "awards": [], "places": ["Ireland"], "character_names": ["Detective Cassie Maddox", "Lexie Madison", "Detective Sam O'Neill", "Frank Mackey"], "language": "English", "publish_date": "2008-07-17 00:00:00", "ISBN": "0670018864"},
{"url": "https://www.goodreads.com/book/show/29437949-behind-closed-doors", "num_ratings": "175,986", "num_reviews": "18,136", "avg_ratings": 3.94, "genres": ["Thriller", "Fiction", "Mystery", "Suspense", "Thriller", "Mystery Thriller"], "title": "Behind Closed Doors", "description": ["Everyone knows a couple like Jack and Grace: he has looks and wealth, she has charm and elegance. You'd like to get to know Grace better. But it's difficult, because you realize Jack and Grace are never apart. Some might call this true love.", "Picture this: a dinner party at their perfect home, the conversation and wine flowing. They appear to be in their element while entert", "Everyone knows a couple like Jack and Grace: he has looks and wealth, she has charm and elegance. You'd like to get to know Grace better. But it's difficult, because you realize Jack and Grace are never apart. Some might call this true love.", "Picture this: a dinner party at their perfect home, the conversation and wine flowing. They appear to be in their element while entertaining. And Grace's friends are eager to reciprocate with lunch the following week. Grace wants to go, but knows she never will. Her friends call—so why doesn't Grace ever answer the phone? And how can she cook such elaborate meals but remain so slim?", "And why are there bars on one of the bedroom windows?", "The perfect marriage? Or the perfect lie?"], "author": "B.A. Paris", "num_pages": "293", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller & for Debut Goodreads Author (2016)"], "places": ["London, England", "Bangkok", "England"], "character_names": [], "language": "English", "publish_date": "2016-08-09 00:00:00", "ISBN": "1250121000"},
{"url": "https://www.goodreads.com/book/show/16171291-the-silent-wife", "num_ratings": "81,552", "num_reviews": "8,601", "avg_ratings": 3.3, "genres": ["Fiction", "Thriller", "Mystery", "Thriller", "Mystery Thriller", "Suspense"], "title": "The Silent Wife", "description": ["A chilling psychological thriller about a marriage, a way of life, and how far one woman will go to keep what is rightfully hers:", "Jodi and Todd are at a bad place in their marriage. Much is at stake, including the affluent life they lead in their beautiful waterfront condo in Chicago, as she, the killer, and he, the victim, rush haplessly toward the main event. He is a comm", "A chilling psychological thriller about a marriage, a way of life, and how far one woman will go to keep what is rightfully hers:", "Jodi and Todd are at a bad place in their marriage. Much is at stake, including the affluent life they lead in their beautiful waterfront condo in Chicago, as she, the killer, and he, the victim, rush haplessly toward the main event. He is a committed cheater. She lives and breathes denial. He exists in dual worlds. She likes to settle scores. He decides to play for keeps. She has nothing left to lose. Told in alternating voices, The Silent Wife is about a marriage in the throes of dissolution, a couple headed for catastrophe, concessions that can’t be made, and promises that won’t be kept. Expertly plotted and reminiscent of Gone Girl and These Things Hidden, The Silent Wife ensnares the reader from page one and does not let go."], "author": "A.S.A. Harrison", "num_pages": "326", "awards": ["Goodreads Choice Award Nominee (2013)"], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Jodi Brett", "Todd Gilbert", "Natasha Kovacs"], "language": "English", "publish_date": "2013-06-25 00:00:00", "ISBN": "0143123238"},
{"url": "https://www.goodreads.com/book/show/15776309-reconstructing-amelia", "num_ratings": "108,496", "num_reviews": "10,813", "avg_ratings": 3.83, "genres": ["Mystery", "Fiction", "Thriller", "Young Adult", "Thriller", "Mystery Thriller", "Contemporary"], "title": "Reconstructing Amelia", "description": ["In ", ", the stunning debut novel from Kimberly McCreight, Kate's in the middle of the biggest meeting of her career when she gets the telephone call from Grace Hall, her daughter’s exclusive private school in Park Slope, Brooklyn. Amelia has been suspended, effective immediately, and Kate must come get her daughter—now. But Kate’s stress over leaving work", "In ", ", the stunning debut novel from Kimberly McCreight, Kate's in the middle of the biggest meeting of her career when she gets the telephone call from Grace Hall, her daughter’s exclusive private school in Park Slope, Brooklyn. Amelia has been suspended, effective immediately, and Kate must come get her daughter—now. But Kate’s stress over leaving work quickly turns to panic when she arrives at the school and finds it surrounded by police officers, fire trucks, and an ambulance. By then it’s already too late for Amelia. And for Kate.", "An academic overachiever despondent over getting caught cheating has jumped to her death. At least that’s the story Grace Hall tells Kate. And clouded as she is by her guilt and grief, it is the one she forces herself to believe. Until she gets an anonymous text: She didn’t jump.", " is about secret first loves, old friendships, and an all-girls club steeped in tradition. But, most of all, it’s the story of how far a mother will go to vindicate the memory of a daughter whose life she couldn’t save.", "Fans of Gillian Flynn's ", " will find ", " just as gripping and surprising."], "author": "Kimberly McCreight", "num_pages": "382", "awards": ["Anthony Award Nominee for Best First Novel (2014)", "Edgar Award Nominee for Best First Novel (2014)", "Goodreads Choice Award Nominee (2013)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2013-04-02 00:00:00", "ISBN": "006222543X"},
{"url": "https://www.goodreads.com/book/show/20821614-you", "num_ratings": "58,827", "num_reviews": "10,086", "avg_ratings": 3.85, "genres": ["Thriller", "Fiction", "Mystery", "Contemporary", "Thriller", "Mystery Thriller", "Adult"], "title": "You", "description": ["When a beautiful, aspiring writer strides into the East Village bookstore where Joe Goldberg works, he does what anyone would do: he Googles the name on her credit card.", "There is only one Guinevere Beck in New York City. She has a public Facebook account and Tweets incessantly, telling Joe everything he needs to know: she is simply Beck to her friends, she went to Brown Uni", "When a beautiful, aspiring writer strides into the East Village bookstore where Joe Goldberg works, he does what anyone would do: he Googles the name on her credit card.", "There is only one Guinevere Beck in New York City. She has a public Facebook account and Tweets incessantly, telling Joe everything he needs to know: she is simply Beck to her friends, she went to Brown University, she lives on Bank Street, and she’ll be at a bar in Brooklyn tonight—the perfect place for a “chance” meeting.", "As Joe invisibly and obsessively takes control of Beck’s life, he orchestrates a series of events to ensure Beck finds herself in his waiting arms. Moving from stalker to boyfriend, Joe transforms himself into Beck’s perfect man, all while quietly removing the obstacles that stand in their way—even if it means murder."], "author": "Caroline Kepnes", "num_pages": "424", "awards": [], "places": ["New York City, New York", "New York (the state)"], "character_names": [], "language": "English", "publish_date": "2014-09-30 00:00:00", "ISBN": "1476785597"},
{"url": "https://www.goodreads.com/book/show/17899948-rebecca", "num_ratings": "361,678", "num_reviews": "17,091", "avg_ratings": 4.21, "genres": ["Classics", "Fiction", "Mystery", "Romance", "Gothic"], "title": "Rebecca", "description": ["Last night I dreamt I went to Manderley again . . .", "The novel begins in Monte Carlo, where our heroine is swept off her feet by the dashing widower Maxim de Winter and his sudden proposal of marriage. Orphaned and working as a lady's maid, she can barely believe her luck. It is only when they arrive at his massive country estate that she realizes how large a shadow his late", "Last night I dreamt I went to Manderley again . . .", "The novel begins in Monte Carlo, where our heroine is swept off her feet by the dashing widower Maxim de Winter and his sudden proposal of marriage. Orphaned and working as a lady's maid, she can barely believe her luck. It is only when they arrive at his massive country estate that she realizes how large a shadow his late wife will cast over their lives--presenting her with a lingering evil that threatens to destroy their marriage from beyond the grave."], "author": "Daphne du Maurier", "num_pages": "449", "awards": ["National Book Award for Fiction (1938)", "Anthony Award for Best Novel of the Century"], "places": ["Cornwall", "Monte Carlo"], "character_names": ["Maxim de Winter", "Mrs. Danvers", "the second Mrs. de Winter", "Rebecca de Winter", "Frank Crowley", "Jack Favell", "Beatrice Lacy", "Giles Lacy"], "language": "English", "publish_date": "2013-12-17 00:00:00", "ISBN": "0316323705"},
{"url": "https://www.goodreads.com/book/show/20640318-the-girl-in-6e", "num_ratings": "14,302", "num_reviews": "2,711", "avg_ratings": 3.82, "genres": ["Thriller", "Dark", "Adult", "Mystery", "Adult Fiction", "Erotica", "Romance"], "title": "The Girl in 6E", "description": ["I haven't touched a human in three years. That seems like it would be a difficult task, but it's not. Not anymore, thanks to the internet.", "I am, quite possibly, the most popular recluse ever. Not many shut-ins have a 200-member fan club, a bank account in the seven-figure range, and hundreds of men lining up to pay for undivided attention.", "They get satisfaction, I get a dist", "I haven't touched a human in three years. That seems like it would be a difficult task, but it's not. Not anymore, thanks to the internet.", "I am, quite possibly, the most popular recluse ever. Not many shut-ins have a 200-member fan club, a bank account in the seven-figure range, and hundreds of men lining up to pay for undivided attention.", "They get satisfaction, I get a distraction. Their secret desires are nothing compared to why I hide... my lust for blood, my love of death.", "Taking their money is easy. Keeping all these secrets... one is bound to escape.", "What if you hid yourself away because all you could think of was killing? And what if one girl's life depending on you venturing into society?", "Enter a world of lies, thrills, fears, and all desires, in this original thriller from A. R. Torre."], "author": "A.R. Torre", "num_pages": "352", "awards": [], "places": ["Georgia", "Oklahoma"], "character_names": ["Deanna Madden"], "language": "English", "publish_date": "2014-01-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7937843-room", "num_ratings": "609,779", "num_reviews": "44,207", "avg_ratings": 4.04, "genres": ["Fiction", "Contemporary", "Adult", "Adult Fiction"], "title": "Room", "description": ["To five-year-old-Jack, Room is the world....", "Told in the inventive, funny, and poignant voice of Jack, Room is a celebration of resilience - and a powerful story of a mother and son whose love lets them survive the impossible.", "To five-year-old Jack, Room is the entire world. It is where he was born and grew up; it's where he lives with his Ma as they learn and read and eat a", "To five-year-old-Jack, Room is the world....", "Told in the inventive, funny, and poignant voice of Jack, Room is a celebration of resilience - and a powerful story of a mother and son whose love lets them survive the impossible.", "To five-year-old Jack, Room is the entire world. It is where he was born and grew up; it's where he lives with his Ma as they learn and read and eat and sleep and play. At night, his Ma shuts him safely in the wardrobe, where he is meant to be asleep when Old Nick visits. ", "Room is home to Jack, but to Ma, it is the prison where Old Nick has held her captive for seven years. Through determination, ingenuity, and fierce motherly love, Ma has created a life for Jack. But she knows it's not enough...not for her or for him. She devises a bold escape plan, one that relies on her young son's bravery and a lot of luck. What she does not realize is just how unprepared she is for the plan to actually work. ", "Told entirely in the language of the energetic, pragmatic five-year-old Jack, Room is a celebration of resilience and the limitless bond between parent and child, a brilliantly executed novel about what it means to journey from one world to another."], "author": "Emma Donoghue", "num_pages": "321", "awards": ["Man Booker Prize Nominee (2010)", "Orange Prize Nominee for Fiction Shortlist (2011)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2013)", "ALA Alex Award (2011)", "Indies Choice Book Award for Fiction (2011)", "Bord Gáis Energy Irish Book Award for Hughes & Hughes Irish Novel of the Year (2010)", "Canadian Booksellers Association Libris Award for Fiction Book (2011)", "Lincoln Award Nominee (2014)", "Galaxy National Book Award for WHSmith Paperback of the Year (2011)", "Commonwealth Writers' Prize for Best Book in Caribbean and Canada (2011)", "Trillium Book Award Nominee for English-language (2011)", "UC Book of the Year (2014)", "Eason Novel of the Year (2010)", "Rogers Writers' Trust Fiction Prize (2010)", "OLA Evergreen Award (2011)", "Goodreads Choice Award for Fiction, Nominee for Favorite Heroine (2010)", "International DUBLIN Literary Award Nominee (2012)"], "places": [], "character_names": ["Jack Tenpenny", "Ma", "Old Nick"], "language": "English", "publish_date": "2010-09-13 00:00:00", "ISBN": "0316098337"},
{"url": "https://www.goodreads.com/book/show/19486412-big-little-lies", "num_ratings": "513,497", "num_reviews": "36,643", "avg_ratings": 4.24, "genres": ["Fiction", "Mystery", "Contemporary", "Womens Fiction", "Chick Lit", "Adult"], "title": "Big Little Lies", "description": [" follows three women, each at a crossroads:", "Madeline is a force to be reckoned with. She’s funny and biting, passionate, she remembers everything and forgives no one. Her ex-husband and his yogi new wife have moved into her beloved beachside community, and their daughter is in the same kindergarten class as Madeline’s youngest (", "is this possible?). And to", " follows three women, each at a crossroads:", "Madeline is a force to be reckoned with. She’s funny and biting, passionate, she remembers everything and forgives no one. Her ex-husband and his yogi new wife have moved into her beloved beachside community, and their daughter is in the same kindergarten class as Madeline’s youngest (", "is this possible?). And to top it all off, Madeline’s teenage daughter seems to be choosing Madeline’s ex-husband over her. (How. Is. This. Possible?).", "Celeste is the kind of beautiful woman who makes the world stop and stare. While she may seem a bit flustered at times, who wouldn’t be, with those rambunctious twin boys? Now that the boys are starting school, Celeste and her husband look set to become the king and queen of the school parent body. But royalty often comes at a price, and Celeste is grappling with how much more she is willing to pay.", "New to town, single mom Jane is so young that another mother mistakes her for the nanny. Jane is sad beyond her years and harbors secret doubts about her son. But why? While Madeline and Celeste soon take Jane under their wing, none of them realizes how the arrival of Jane and her inscrutable little boy will affect them all.", " is a brilliant take on ex-husbands and second wives, mothers and daughters, schoolyard scandal, and the dangerous little lies we tell ourselves just to survive."], "author": "Liane Moriarty", "num_pages": "460", "awards": ["Davitt Award for Best Adult Novel (2015)", "Goodreads Choice Award Nominee for Fiction (2014)"], "places": ["Australia"], "character_names": ["Celeste White", "Madeline Martha Mackenzie", "Jane (Liane Moriarty)"], "language": "English", "publish_date": "2014-07-29 00:00:00", "ISBN": "0399167064"},
{"url": "https://www.goodreads.com/book/show/15818362-into-the-darkest-corner", "num_ratings": "50,687", "num_reviews": "5,163", "avg_ratings": 4.1, "genres": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller", "Mystery", "Crime"], "title": "Into the Darkest Corner", "description": ["When young, pretty Catherine Bailey meets Lee Brightman, she can't believe her luck. Gorgeous, charismatic, and a bit mysterious, Lee seems almost too perfect to be true.", "But what begins as flattering attention and spontaneous, passionate sex transforms into raging jealousy, and Catherine soon discovers that Lee's dazzling blue eyes and blond good looks hide a dark, violent", "When young, pretty Catherine Bailey meets Lee Brightman, she can't believe her luck. Gorgeous, charismatic, and a bit mysterious, Lee seems almost too perfect to be true.", "But what begins as flattering attention and spontaneous, passionate sex transforms into raging jealousy, and Catherine soon discovers that Lee's dazzling blue eyes and blond good looks hide a dark, violent nature. Disturbed by his increasingly erratic, controlling behavior, she tries to break it off; turning to her friends for support, she's stunned to find they don't believe her. Increasingly isolated and driven into the darkest corner of her world, a desperate Catherine plans a meticulous escape.", "Four years later, Lee is behind bars and Catherine—now Cathy—is trying to build a new life in a new city. Though her body has healed, the trauma of the past still haunts her. Then Stuart Richardson, her attractive new neighbor, moves in. Encouraging her to confront her fears, he sparks unexpected hope and the possibility of love and a normal life.", "Until the day the phone rings . . ."], "author": "Elizabeth Haynes", "num_pages": "410", "awards": [], "places": ["London, England", "Lancaster, Northern England"], "character_names": ["Catherine \"Cathy\" Bailey", "Stuart Richardson", "Lee Brightman", "Sylvia Bartlett"], "language": "English", "publish_date": "2013-01-02 00:00:00", "ISBN": "0062197266"},
{"url": "https://www.goodreads.com/book/show/18812405-the-good-girl", "num_ratings": "152,436", "num_reviews": "13,039", "avg_ratings": 3.82, "genres": ["Mystery", "Fiction", "Thriller", "Suspense", "Thriller", "Mystery Thriller"], "title": "The Good Girl", "description": ["One night, Mia Dennett enters a bar to meet her on-again, off-again boyfriend. But when he doesn't show, she unwisely leaves with an enigmatic stranger. At first Colin Thatcher seems lik", "One night, Mia Dennett enters a bar to meet her on-again, off-again boyfriend. But when he doesn't show, she unwisely leaves with an enigmatic stranger. At first Colin Thatcher seems like a safe one-night stand. But following Colin home will turn out to be the worst mistake of Mia's life. ", "When Colin decides to hide Mia in a secluded cabin in rural Minnesota instead of delivering her to his employers, Mia's mother, Eve, and detective Gabe Hoffman will stop at nothing to find them. But no one could have predicted the emotional entanglements that eventually cause this family's world to shatter."], "author": "Mary Kubica", "num_pages": "352", "awards": ["Strand Critics Award  Nominee for Best First Novel (2014)", "Goodreads Choice Award Nominee for Mystery & Thriller and for Debut Goodreads Author (2014)"], "places": ["Chicago, Illinois", "Minnesota"], "character_names": ["Mia Dennett", "Colin Thatcher", "Eve Dennett", "James Dennett", "Gabe Hoffman", "Grace Dennett", "Ayanna Jackson", "Dalmar"], "language": "English", "publish_date": "2014-07-29 00:00:00", "ISBN": "0778316556"},
{"url": "https://www.goodreads.com/book/show/5886881-dark-places", "num_ratings": "443,885", "num_reviews": "30,804", "avg_ratings": 3.93, "genres": ["Mystery", "Fiction", "Thriller", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Dark Places", "description": ["Libby Day was seven when her mother and two sisters were murdered in “The Satan Sacrifice\" of Kinnakee, Kansas. She survived—and famously testified that her fifteen-year-old brother, Ben, was the killer. Twenty-five years later, the Kill Club—a secret secret society obsessed with notorious crimes—locates Libby and p", "Libby Day was seven when her mother and two sisters were murdered in “The Satan Sacrifice\" of Kinnakee, Kansas. She survived—and famously testified that her fifteen-year-old brother, Ben, was the killer. Twenty-five years later, the Kill Club—a secret secret society obsessed with notorious crimes—locates Libby and pumps her for details. They hope to discover proof that may free Ben. Libby hopes to turn a profit off her tragic history: She’ll reconnect with the players from that night and report her findings to the club—for a fee. As Libby’s search takes her from shabby Missouri strip clubs to abandoned Oklahoma tourist towns, the unimaginable truth emerges, and Libby finds herself right back where she started—on the run from a killer."], "author": "Gillian Flynn", "num_pages": "349", "awards": ["Black Quill Award for Dark Genre Novel of the Year (2010)", "CWA Ian Fleming Steel Dagger Nominee (2010)"], "places": ["Kinnakee, Kansas", "Kansas City, Missouri", "Other Editions (145)", "\n", "\n", "\n", "\n", "\n", "All Editions"], "character_names": ["Libby Day", "Ben Day", "Patty Day", "Ronald 'Runner' Day", "Diondra Wertzner"], "language": "English", "publish_date": "2009-05-05 00:00:00", "ISBN": "0307341569"},
{"url": "https://www.goodreads.com/book/show/18045891-sharp-objects", "num_ratings": "433,612", "num_reviews": "33,000", "avg_ratings": 3.93, "genres": ["Mystery", "Fiction", "Thriller", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Sharp Objects", "description": ["Fresh from a brief stay at a psych hospital, reporter Camille Preaker faces a troubling assignment: she must return to her tiny hometown to cover the murders of two preteen girls. For years, Camille has hardly spoken to her neurotic, hypochondriac mother or to the half-sister she barely knows: a beautiful thirteen-year-old with an eerie grip on the town. Now, installed in", "Fresh from a brief stay at a psych hospital, reporter Camille Preaker faces a troubling assignment: she must return to her tiny hometown to cover the murders of two preteen girls. For years, Camille has hardly spoken to her neurotic, hypochondriac mother or to the half-sister she barely knows: a beautiful thirteen-year-old with an eerie grip on the town. Now, installed in her old bedroom in her family's Victorian mansion, Camille finds herself identifying with the young victims—a bit too strongly. Dogged by her own demons, she must unravel the psychological puzzle of her own past if she wants to get the story—and survive this homecoming."], "author": "Gillian Flynn", "num_pages": "254", "awards": ["Barry Award Nominee for Best First Novel (2007)", "CWA New Blood Dagger (2007)", "Edgar Award Nominee for Best First Novel (2007)", "CWA Ian Fleming Steel Dagger (2007)"], "places": ["Missouri"], "character_names": ["Camille Preaker", "Frank Curry", "Amma Crellin", "Adora Crellin", "Chief Bill Vickery", "Alan Crellin", "Marian Crellin", "Richard Willis", "Ann Nash", "Natalie Keene"], "language": "English", "publish_date": "2006-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22557272-the-girl-on-the-train", "num_ratings": "1,533,530", "num_reviews": "100,919", "avg_ratings": 3.9, "genres": ["Fiction", "Mystery", "Thriller", "Mystery", "Crime"], "title": "The Girl on the Train", "description": ["Rachel catches the same commuter train every morning. She knows it will wait at the same signal each time, overlooking a row of back gardens. She's even started to feel like she knows the people who live in one of the houses. 'Jess and Jason', she calls them. Their life - as she sees it - is perfect. If only Rachel could be that happy. And then she sees something shocking.", "Rachel catches the same commuter train every morning. She knows it will wait at the same signal each time, overlooking a row of back gardens. She's even started to feel like she knows the people who live in one of the houses. 'Jess and Jason', she calls them. Their life - as she sees it - is perfect. If only Rachel could be that happy. And then she sees something shocking. It's only a minute until the train moves on, but it's enough. Now everything's changed. Now Rachel has a chance to become a part of the lives she's only watched from afar. Now they'll see; she's much more than just the girl on the train..."], "author": "Paula Hawkins", "num_pages": "323", "awards": ["ITW Thriller Award Nominee for Best Hardcover Novel (2016)", "Audie Award for Audiobook of the Year (2016)", "Goodreads Choice Award for Mystery & Thriller (2015)", "Waterstones Book of the Year Nominee (2015)", "Woman & Home Reader's Choice Award for Best Thriller Of The Year (2016)"], "places": ["London, England"], "character_names": ["Rachel Watson", "Anna Watson", "Tom Watson", "Megan Hipwell", "Scott Hipwell", "Kamal Abdic"], "language": "English", "publish_date": "2015-01-13 00:00:00", "ISBN": "1594633665"}
]