[
{"url": "https://www.goodreads.com/book/show/22610866-dwellers-of-ahwahnee", "num_ratings": "123", "num_reviews": "33", "avg_ratings": 4.76, "genres": ["Fantasy", "Mythology", "Young Adult", "Paranormal", "Shapeshifters", "Romance", "Paranormal Romance", "Inspirational", "Fantasy", "Supernatural"], "title": "Dwellers of Ahwahnee (The Beyond Collection)", "description": ["The Dwellers of Ahwahnee (The Beyond Collection) is finally here! 3 Great paranormal books that follow the generation of shifters from the Ahwahneechee. These books are found on Goodreads lists and are #1 in many categories.", "Come to the Beyond for a supernatural unique read!", "BOOK 1: BEYOND BRIDALVEIL FALL", "Oria is celebrating her eighteenth birthday in Yosemite National Park w", "The Dwellers of Ahwahnee (The Beyond Collection) is finally here! 3 Great paranormal books that follow the generation of shifters from the Ahwahneechee. These books are found on Goodreads lists and are #1 in many categories.", "Come to the Beyond for a supernatural unique read!", "BOOK 1: BEYOND BRIDALVEIL FALL", "Oria is celebrating her eighteenth birthday in Yosemite National Park when she goes into the pool at the bottom of Bridalveil Fall, only to come out beyond it.", "In another world she learns she is The Golden Queen of the Ahwahneechee tribe, and that she is a shape shifter. Here the Dwellers of Ahwahnee fight the Evil that tries to get into the world of man. Will she find her soul mate in Grey Wolf or is he more than he appears to be? One thing is for sure, with all the magic and shape shifting happening, only the all knowing grandfather and her grandmother's wisdom can guide her through the Evil Beyond Bridalveil Fall.", "BOOK 2: BEYOND ORIA FALLS", "Oria is the Golden Queen of the Ahwahneechees and a Dweller of Ahwahnee. Together with her friends she travels back to find out why the Village of Lost Souls cannot find their way home to the West. The Ale is back in this second book full of action packed magic and shapeshifting. Will Oria finally find love and happiness with Grey Wolf or will a new evil threaten her magical world Beyond Oria Falls? Join the Dwellers as they try to keep evil out of the world of man.", "BOOK 3: BEYOND THE WORLD OF MAN", "This is the third installment in the Dwellers of Ahwahnee series and with the destruction of the world of man, the Dwellers traveled to other worlds and survived for twenty years.", "With Oria's magic the 'Beyond' has grown and they can now come home.", "There is a different kind of evil in the world now. Who will survive in the 'Beyond'? This generation", "of shapeshifters are different and will lead the Dwellers into a new age.", "Spirit Walker is rebellious and has often been called a Wildcat. She has been sheltered in The Village of Lost Souls for her entire life. Now she is to become the Golden Queen of the Ahwahneechees.", "Her choices for the future involve adult decisions and with only her mother's journal to guide her, she must rely on the magic within the pages."], "author": "Sheryl Seal", "num_pages": "502", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/800780.In_Search_of_April_Raintree_Critical_Edition", "num_ratings": "1,094", "num_reviews": "87", "avg_ratings": 4.02, "genres": ["Fiction", "Cultural", "Canada", "Young Adult", "Academic", "School", "Contemporary", "Historical", "Historical Fiction", "Adult", "Academic", "Read For School", "Adult Fiction", "Literature", "Canadian Literature"], "title": "In Search of April Raintree - Critical Edition", "description": ["Two young sisters are taken from their home and family. Powerless to change their fortunes, they are separated, and each put into different foster homes. Yet over the years, the bond between them grows. As they each make their way in a society that is, at times, indifferent, hostile, and violent, one embraces her Métis identity, while the other tries to leave it behind. In", "Two young sisters are taken from their home and family. Powerless to change their fortunes, they are separated, and each put into different foster homes. Yet over the years, the bond between them grows. As they each make their way in a society that is, at times, indifferent, hostile, and violent, one embraces her Métis identity, while the other tries to leave it behind. In the end, out of tragedy, comes an unexpected legacy of triumph and reclamation.", "In this Critical Edition, editor Cheryl Suzack has chosen ten critical essays to accompany one of the best-known texts by Canadian Aboriginal author Beatrice Culloden/Mosionier."], "author": "Beatrice Culleton", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-01-01 00:00:00", "ISBN": "1894110439"},
{"url": "https://www.goodreads.com/book/show/6159.Reservation_Blues", "num_ratings": "11,605", "num_reviews": "837", "avg_ratings": 3.98, "genres": ["Fiction", "Magical Realism", "Literature", "Novels"], "title": "Reservation Blues", "description": ["The life of Spokane Indian Thomas Builds-the-Fire irrevocably changes when blues legend Robert Johnson miraculously appears on his reservation and passes the misfit storyteller his enchanted guitar. Inspired by this gift, Thomas forms Coyote Springs, an all-Indian Catholic band who find themselves on a magical tour that leads from reservation bars to Seattle and New York--", "The life of Spokane Indian Thomas Builds-the-Fire irrevocably changes when blues legend Robert Johnson miraculously appears on his reservation and passes the misfit storyteller his enchanted guitar. Inspired by this gift, Thomas forms Coyote Springs, an all-Indian Catholic band who find themselves on a magical tour that leads from reservation bars to Seattle and New York--and deep within their own souls."], "author": "Sherman Alexie", "num_pages": "306", "awards": ["American Book Award (1996)", "International DUBLIN Literary Award Nominee (1997)"], "places": ["Wellpinit, Washington"], "character_names": [], "language": "English", "publish_date": "2005-02-07 00:00:00", "ISBN": "0802141900"},
{"url": "https://www.goodreads.com/book/show/91439.The_Beet_Queen", "num_ratings": "11,642", "num_reviews": "483", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "Literary Fiction", "Contemporary"], "title": "The Beet Queen", "description": ["On a spring morning in 1932, young Karl and Mary Adare arrive by boxcar in Argus, North Dakota. After being orphaned in a most peculiar way, they seek refuge in the butcher shop of their aunt and her husband. So begins an exhilarating forty-year saga brimming with colorful, unforgettable characters: ordinary Mary, who will cause a miracle; seductive Karl, who lacks his sis", "On a spring morning in 1932, young Karl and Mary Adare arrive by boxcar in Argus, North Dakota. After being orphaned in a most peculiar way, they seek refuge in the butcher shop of their aunt and her husband. So begins an exhilarating forty-year saga brimming with colorful, unforgettable characters: ordinary Mary, who will cause a miracle; seductive Karl, who lacks his sister's gift for survival; Sita, their lovely but disturbed cousin; and the half-Native American Celestine James, who will become Mary’s best friend. Theirs is a story grounded in the tenacity of relationships, the extraordinary magic of natural events, and the unending mystery of the human condition.", "Bestselling, National Book Award-winning author Louise Erdrich dazzles in this vibrant and heartfelt tale of abandonment and sexual obsession, jealousy and unstinting love that explores with empathy, humor, and power the eternal mystery of the human condition."], "author": "Louise Erdrich", "num_pages": "368", "awards": ["National Book Critics Circle Award Nominee for Fiction (1986)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2017-05-23 00:00:00", "ISBN": "0060835273"},
{"url": "https://www.goodreads.com/book/show/5894634-here-now-and-always", "num_ratings": "4", "num_reviews": "0", "avg_ratings": 4.25, "genres": ["History", "North American Hi...", "American History", "Nonfiction"], "title": "Here, Now, and Always:  Voices of the First Peoples of the Southwest: Voices of the First Peoples of the Southwest", "description": ["This book—companion to a permanent exhibit at the Museum of Indian Arts and Culture in Santa Fe, New Mexico—is an inspirational collection of Native thoughts on place, history, tradition, and change. The voices represent Indian scholars, artists, and writers from various Southwestern tribes speaking to themes of origin, cycles, community, and survival."], "author": "Rina Swentzell", "num_pages": "88", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-11-05 00:00:00", "ISBN": "0890133875"},
{"url": "https://www.goodreads.com/book/show/60892.Lakota_Woman", "num_ratings": "4,794", "num_reviews": "306", "avg_ratings": 3.96, "genres": ["Nonfiction", "Autobiography", "Memoir", "History", "Biography"], "title": "Lakota Woman", "description": ["Mary Brave Bird grew up fatherless in a one-room cabin, without running water or electricity, on the Rosebud Indian Reservation in South Dakota. Rebelling against the aimless drinking, punishing missionary school, narrow strictures for women, and violence and hopeless of reservation life, she joined the new movement of tribal pride sweeping Native American communities in t", "Mary Brave Bird grew up fatherless in a one-room cabin, without running water or electricity, on the Rosebud Indian Reservation in South Dakota. Rebelling against the aimless drinking, punishing missionary school, narrow strictures for women, and violence and hopeless of reservation life, she joined the new movement of tribal pride sweeping Native American communities in the sixties and seventies. Mary eventually married Leonard Crow Dog, the American Indian Movement's chief medicine man, who revived the sacred but outlawed Ghost Dance.", "Originally published in 1990, ", " was a national best seller and winner of the American Book Award. It is a unique document, unparalleled in American Indian literature, a story of death, of determination against all odds, of the cruelties perpetuated against American Indians, and of the Native American struggle for rights. Working with Richard Erdoes, one of the twentieth century's leading writers on Native American affairs, Brave Bird recounts her difficult upbringing and the path of her fascinating life."], "author": "Mary Crow Dog", "num_pages": "263", "awards": ["American Book Award (1991)"], "places": [], "character_names": [], "language": "English", "publish_date": "1991-03-28 00:00:00", "ISBN": "0060973897"},
{"url": "https://www.goodreads.com/book/show/57458.Fools_Crow", "num_ratings": "3,328", "num_reviews": "232", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Academic", "School", "Adult"], "title": "Fools Crow", "description": ["Set in Montana shortly after the Civil War, this novel tells of White Man's Dog (later known as Fools Crow so called after he killed the chief of the Crows during a raid), a young Blackfeet Indian on the verge of manhood, and his band, known as the Lone Eaters. The invasion of white society threatens to change their traditional way of life, and they must choose to fight or", "Set in Montana shortly after the Civil War, this novel tells of White Man's Dog (later known as Fools Crow so called after he killed the chief of the Crows during a raid), a young Blackfeet Indian on the verge of manhood, and his band, known as the Lone Eaters. The invasion of white society threatens to change their traditional way of life, and they must choose to fight or assimilate. ", "The story is a powerful portrait of a fading way of life. The story culminates with the historic Marias Massacre of 1870, in which the U.S. Cavalry mistakenly killed a friendly band of Blackfeet, consisting mostly of non-combatants.", "\"A major contribution to Native American literature.\" -- Wallace Stegner."], "author": "James Welch", "num_pages": "400", "awards": ["American Book Award (1987)", "Los Angeles Times Book Prize for Fiction (1987)"], "places": ["Montana"], "character_names": ["Siksika Indians", "Blackfeet Indians"], "language": "English", "publish_date": "1987-11-03 00:00:00", "ISBN": "0140089373"},
{"url": "https://www.goodreads.com/book/show/76401.Bury_My_Heart_at_Wounded_Knee", "num_ratings": "47,837", "num_reviews": "2,653", "avg_ratings": 4.22, "genres": ["History", "Nonfiction", "North American Hi...", "American History", "Classics", "Historical"], "title": "Bury My Heart at Wounded Knee: An Indian History of the American West", "description": ["Now a special 30th-anniversary edition in both hardcover and paperback, the classic bestselling history ", " called \"Original, remarkable, and finally heartbreaking...Impossible to put down.\"", " is Dee Brown's eloquent, fully documented account of the systematic destruction of the American Indian during the second half of the ninetee", "Now a special 30th-anniversary edition in both hardcover and paperback, the classic bestselling history ", " called \"Original, remarkable, and finally heartbreaking...Impossible to put down.\"", " is Dee Brown's eloquent, fully documented account of the systematic destruction of the American Indian during the second half of the nineteenth century. A national bestseller in hardcover for more than a year after its initial publication, it has sold almost four million copies and has been translated into seventeen languages. For this elegant thirtieth-anniversary edition—published in both hardcover and paperback—Brown has contributed an incisive new preface.", "Using council records, autobiographies, and firsthand descriptions, Brown allows the great chiefs and warriors of the Dakota, Ute, Sioux, Cheyenne, and other tribes to tell us in their own words of the battles, massacres, and broken treaties that finally left them demoralized and defeated. A unique and disturbing narrative told with force and clarity, ", " changed forever our vision of how the West was really won."], "author": "Dee Brown", "num_pages": "509", "awards": [], "places": [], "character_names": ["Sitting Bull", "Red Cloud", "Ely Parker", "Cochise", "Quanah Parker", "Kicking Bird", "Ten Bears", "Crazy Horse", "Chief Joseph", "Geronimo", "Manuelito", "Little Crow"], "language": "English", "publish_date": "2001-01-23 00:00:00", "ISBN": "0805066691"},
{"url": "https://www.goodreads.com/book/show/155882.The_Way_to_Rainy_Mountain", "num_ratings": "2,446", "num_reviews": "137", "avg_ratings": 3.8, "genres": ["Fiction", "Poetry", "Academic", "School"], "title": "The Way to Rainy Mountain", "description": ["First published in paperback by UNM Press in 1976, ", " has sold over 200,000 copies.", "\"The paperback edition of ", " was first published twenty-five years ago. One should not be surprised, I suppose, that it has remained vital, and immediate, for that is the nature of story. And this is particularly true of the oral tradition, which", "First published in paperback by UNM Press in 1976, ", " has sold over 200,000 copies.", "\"The paperback edition of ", " was first published twenty-five years ago. One should not be surprised, I suppose, that it has remained vital, and immediate, for that is the nature of story. And this is particularly true of the oral tradition, which exists in a dimension of timelessness. I was first told these stories by my father when I was a child. I do not know how long they had existed before I heard them. They seem to proceed from a place of origin as old as the earth.", "\"The stories in ", " are told in three voices. The first voice is the voice of my father, the ancestral voice, and the voice of the Kiowa oral tradition. The second is the voice of historical commentary. And the third is that of personal reminiscence, my own voice. There is a turning and returning of myth, history, and memoir throughout, a narrative wheel that is as sacred as language itself.\"--from the new Preface"], "author": "N. Scott Momaday", "num_pages": "88", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1976-09-01 00:00:00", "ISBN": "0826304362"},
{"url": "https://www.goodreads.com/book/show/627519.Black_Elk_Speaks", "num_ratings": "11,691", "num_reviews": "571", "avg_ratings": 4.13, "genres": ["History", "Nonfiction", "Biography", "Religion", "Autobiography", "Memoir"], "title": "Black Elk Speaks", "description": ["The most famous Native American book ever written, ", " is the acclaimed story of Lakota visionary and healer Nicholas Black Elk (1863–1950) and his people during the momentous, twilight years of the nineteenth century. Black Elk grew up in a time when white settlers were invading the Lakotas’ homeland, decimating buffalo herds and threatening to extinguish the", "The most famous Native American book ever written, ", " is the acclaimed story of Lakota visionary and healer Nicholas Black Elk (1863–1950) and his people during the momentous, twilight years of the nineteenth century. Black Elk grew up in a time when white settlers were invading the Lakotas’ homeland, decimating buffalo herds and threatening to extinguish their way of life. Black Elk and other Lakotas fought back, a dogged resistance that resulted in a remarkable victory at the Little Bighorn and an unspeakable tragedy at Wounded Knee.Beautifully told through the celebrated poet and writer John G. Neihardt, ", " offers much more than a life story. Black Elk’s profound and arresting religious visions of the unity of humanity and the world around him have transformed his account into a venerated spiritual classic. Whether appreciated as a collaborative autobiography, a history of a Native American nation, or an enduring spiritual testament for all humankind, ", " is unforgettable.", "This special edition features all three prefaces to ", " that John G. Neihardt wrote at different points in his life, a map of Black Elk’s world, a reset text with Lakota words reproduced using the latest orthographic standards, and color paintings by Lakota artist Standing Bear that have not been widely available for decades."], "author": "John G. Neihardt", "num_pages": "298", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-08-16 00:00:00", "ISBN": "0803283598"},
{"url": "https://www.goodreads.com/book/show/52385.Almanac_of_the_Dead", "num_ratings": "2,298", "num_reviews": "236", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Literature", "Novels"], "title": "Almanac of the Dead", "description": ["In its extraordinary range of character and culture, Almanac of the Dead is fiction on the grand scale. The acclaimed author of Ceremony has undertaken a weaving of ideas and lives, fate and history, passion and conquest in an attempt to re-create the moral history of the Americas, told from the point of view of the conquered, not the conquerors."], "author": "Leslie Marmon Silko", "num_pages": "768", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-11-01 00:00:00", "ISBN": "0140173196"},
{"url": "https://www.goodreads.com/book/show/104671.Red_Earth_White_Lies", "num_ratings": "473", "num_reviews": "30", "avg_ratings": 4.05, "genres": ["Nonfiction", "History", "Science", "Race"], "title": "Red Earth, White Lies: Native Americans and the Myth of Scientific Fact", "description": ["Claiming that science has created a largely fictional scenario for American Indians in prehistoric North America, Deloria offers an alternative view of the continent's history as seen through the eyes and memories of Native Americans."], "author": "Vine Deloria Jr.", "num_pages": "271", "awards": ["Colorado Book Award for General Nonfiction (1996)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-08-01 00:00:00", "ISBN": "1555913881"},
{"url": "https://www.goodreads.com/book/show/3479967-through-black-spruce", "num_ratings": "12,051", "num_reviews": "833", "avg_ratings": 4.12, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Through Black Spruce", "description": ["Will Bird is a legendary Cree bush pilot, now lying in a coma in a hospital in his hometown of Moose Factory, Ontario. His niece Annie Bird, beautiful and self-reliant, has returned from her own perilous journey to sit beside his bed. Broken in different ways, the two take silent communion in th", "Will Bird is a legendary Cree bush pilot, now lying in a coma in a hospital in his hometown of Moose Factory, Ontario. His niece Annie Bird, beautiful and self-reliant, has returned from her own perilous journey to sit beside his bed. Broken in different ways, the two take silent communion in their unspoken kinship, and the story that unfolds is rife with heartbreak, fierce love, ancient blood feuds, mysterious disappearances, fires, plane crashes, murders, and the bonds that hold a family, and a people, together. As Will and Annie reveal their secrets-the tragic betrayal that cost Will his family, Annie's desperate search for her missing sister, the famous model Suzanne-a remarkable saga of resilience and destiny takes shape. From the dangerous bush country of upper Canada to the drug-fueled glamour of the Manhattan club scene, Joseph Boyden tracks his characters with a keen eye for the telling detail and a rare empathy for the empty places concealed within the heart. Sure to appeal to readers of Louise Erdrich and Jim Harrison, ", " establishes Boyden as a writer of startling originality and uncommon power."], "author": "Joseph Boyden", "num_pages": "359", "awards": ["Scotiabank Giller Prize (2008)", "Canadian Booksellers Association Libris Award for Fiction Book (2009)"], "places": ["Ontario", "Manhattan, New York City, New York"], "character_names": ["Will Bird", "Annie Bird", "Marius Netmaker"], "language": "English", "publish_date": "2008-09-09 00:00:00", "ISBN": "0670020575"},
{"url": "https://www.goodreads.com/book/show/197753.Custer_Died_for_Your_Sins", "num_ratings": "2,442", "num_reviews": "125", "avg_ratings": 4.1, "genres": ["History", "Nonfiction", "Politics", "Race", "Anthropology"], "title": "Custer Died for Your Sins: An Indian Manifesto", "description": ["In his new preface to this paperback edition, the author observes, \"The Indian world has changed so substantially since the first publication of this book that some things contained in it seem new again.\" Indeed, it seems that each generation of whites and Indians will have to read and reread Vine Deloria’s Manifesto for some time to come, before we absorb his special, iro", "In his new preface to this paperback edition, the author observes, \"The Indian world has changed so substantially since the first publication of this book that some things contained in it seem new again.\" Indeed, it seems that each generation of whites and Indians will have to read and reread Vine Deloria’s Manifesto for some time to come, before we absorb his special, ironic Indian point of view and what he tells us, with a great deal of humor, about U.S. race relations, federal bureaucracies, Christian churches, and social scientists. This book continues to be required reading for all Americans, whatever their special interest."], "author": "Vine Deloria Jr.", "num_pages": "296", "awards": ["Anisfield-Wolf Book Award (1970)"], "places": [], "character_names": [], "language": "English", "publish_date": "1988-05-15 00:00:00", "ISBN": "0806121297"},
{"url": "https://www.goodreads.com/book/show/52877.The_Toughest_Indian_in_the_World", "num_ratings": "6,210", "num_reviews": "394", "avg_ratings": 4.08, "genres": ["Fiction", "Short Stories", "Literature", "Literature", "American"], "title": "The Toughest Indian in the World", "description": ["A beloved American writer whose books are championed by critics and readers alike, Sherman Alexie has been hailed by Time as \"one of the better new novelists, Indian or otherwise.\" ", "In these stories, we meet the kind of American Indians we rarely see in literature -- the kind who pay their bills, hold down jobs, fall in and out of love. ", "A Spokane Indian journalist transplan", "A beloved American writer whose books are championed by critics and readers alike, Sherman Alexie has been hailed by Time as \"one of the better new novelists, Indian or otherwise.\" ", "In these stories, we meet the kind of American Indians we rarely see in literature -- the kind who pay their bills, hold down jobs, fall in and out of love. ", "A Spokane Indian journalist transplanted from the reservation to the city picks up a hitchhiker, a Lummi boxer looking to take on the toughest Indian in the world. A Spokane son waits for his diabetic father to come home from the hospital, tossing out the Hershey Kisses the father has hidden all over the house. An estranged interracial couple, separated in the midst of a traffic accident, rediscover their love for each other. A white drifter holds up an International House of Pancakes, demanding a dollar per customer and someone to love, and emerges with $42 and an overweight Indian he dubs Salmon Boy. ", "Sherman Alexie's voice is one of remarkable passion, and these stories are love stories -- between parents and children, white people and Indians, movie stars and ordinary people. Witty, tender, and fierce, ", " is a virtuoso performance by one of the country's finest writers."], "author": "Sherman Alexie", "num_pages": "256", "awards": ["Kiriyama Prize Nominee for Fiction (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-01 00:00:00", "ISBN": "0802138004"},
{"url": "https://www.goodreads.com/book/show/233678.Baby_Blues", "num_ratings": "27", "num_reviews": "4", "avg_ratings": 4.0, "genres": ["Cultural", "Canada", "Plays"], "title": "Baby Blues", "description": [" is Drew Hayden Taylor’s highly wrought farce of patrimony in a stifling, politically correct, post-colonial milieu of \"fancy dancers\" of every stripe on the powwow trail. In juxtaposing three generations of careless wandering hedonists, progenitors of a string of offspring from their six-night stands, with their erstwhile naïve women partners who are always", " is Drew Hayden Taylor’s highly wrought farce of patrimony in a stifling, politically correct, post-colonial milieu of \"fancy dancers\" of every stripe on the powwow trail. In juxtaposing three generations of careless wandering hedonists, progenitors of a string of offspring from their six-night stands, with their erstwhile naïve women partners who are always left holding the bag, the \"big questions\" of heritage, family, cultural context and personal identity are ruthlessly stripped of their conventional meanings and become so much useless, embarrassing roadkill on the highway of life.", "Cast of 3 women and 3 men."], "author": "Drew Hayden Taylor", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-02-15 00:00:00", "ISBN": "0889224064"},
{"url": "https://www.goodreads.com/book/show/2545802.Someday", "num_ratings": "50", "num_reviews": "5", "avg_ratings": 3.66, "genres": [], "title": "Someday", "description": [" is a powerful new play by award-winning playwright Drew Hayden Taylor. The story in ", ", though told through fictional characters and full of Taylor's distinctive wit and humour, is based on the real-life tragedies suffered by many Native Canadian families.Anne Wabung's daughter was taken away by children's aid workers when the girl was only a toddler. It is Ch", " is a powerful new play by award-winning playwright Drew Hayden Taylor. The story in ", ", though told through fictional characters and full of Taylor's distinctive wit and humour, is based on the real-life tragedies suffered by many Native Canadian families.Anne Wabung's daughter was taken away by children's aid workers when the girl was only a toddler. It is Christmastime 35 years later, and Anne's yearning to see her now-grown daughter is stronger than ever.", "When the family is finally reunited, however, the dreams of neither women are fulfilled.The setting for the play is a fictional Ojibway community, but could be any reserve in Canada, where thousands of Native children were removed from their families in what is known among Native people as the \"scoop-up\" of the 1950s and 1960s. ", "is an entertaining, humourous, and spirited play that packs an intense emotional wallop.", "\"One of the 50 Essential Canadian Plays\"", "-- "], "author": "Drew Hayden Taylor", "num_pages": "81", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-03-15 00:00:00", "ISBN": "189561810X"},
{"url": "https://www.goodreads.com/book/show/7979263-louis-riel-and-gabriel-dumont", "num_ratings": "246", "num_reviews": "35", "avg_ratings": 3.85, "genres": ["History", "Nonfiction", "Biography", "Cultural", "Canada"], "title": "Louis Riel and Gabriel Dumont", "description": ["Louis Riel is regarded by some as a hero and visionary, by others as a madman and misguided religious zealot. The Métis leader who fought for the rights of his people against an encroaching tide of white settlers helped establish the province of Manitoba before escaping to the United States. Gabriel Dumont was a successful hunter and Métis chief, a man tested by warfare, a", "Louis Riel is regarded by some as a hero and visionary, by others as a madman and misguided religious zealot. The Métis leader who fought for the rights of his people against an encroaching tide of white settlers helped establish the province of Manitoba before escaping to the United States. Gabriel Dumont was a successful hunter and Métis chief, a man tested by warfare, a pragmatist who differed from the devout Riel. Giller Prize—winning novelist Joseph Boyden argues that Dumont, part of a delegation that had sought out Riel in exile, may not have foreseen the impact on the Métis cause of bringing Riel home. While making rational demands of Sir John A. Macdonald's government, Riel seemed increasingly overtaken by a messianic mission. His execution in 1885 by the Canadian government still reverberates today. Boyden provides fresh, controversial insight into these two seminal Canadian figures and how they shaped the country."], "author": "Joseph Boyden", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-10-05 00:00:00", "ISBN": "0670066710"},
{"url": "https://www.goodreads.com/book/show/347192.Sojourners_and_Sundogs", "num_ratings": "21", "num_reviews": "1", "avg_ratings": 4.19, "genres": ["Cultural", "Canada", "Short Stories", "Fiction"], "title": "Sojourners and Sundogs: First Nations Fiction", "description": ["Here is a new combined edition of Lee Maracle's best-loved works of fiction. True to the principles of First Nations oratory, the novel (Sundogs) and short stories (Sojourner's Truth and Other Stories) in this volume are layered with unresolved human dilemmas. Maracle writes with love and humor, whether she's telling the tragic story of a boy's attempt to escape residentia", "Here is a new combined edition of Lee Maracle's best-loved works of fiction. True to the principles of First Nations oratory, the novel (Sundogs) and short stories (Sojourner's Truth and Other Stories) in this volume are layered with unresolved human dilemmas. Maracle writes with love and humor, whether she's telling the tragic story of a boy's attempt to escape residential school or offering an intimate look at one family's struggle during the Mohawk Warrior Society's defiant stand at Oka. These are stories of the heart -- daring and imaginative, crossing cultures and generations -- by a vital and visionary writer."], "author": "Lee Maracle", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-05-08 00:00:00", "ISBN": "0889740615"},
{"url": "https://www.goodreads.com/book/show/505647.Sojourner_s_Truth_and_Other_Stories", "num_ratings": "11", "num_reviews": "0", "avg_ratings": 4.09, "genres": [], "title": "Sojourner's Truth and Other Stories", "description": ["In the tradition of Native oratory, these stories are layered with unresolved human dilemmas; Maracle writes with love and humor about the pain and triumphs, and the spirit of resistance."], "author": "Lee Maracle", "num_pages": "143", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1990-02-08 00:00:00", "ISBN": "0889740232"},
{"url": "https://www.goodreads.com/book/show/231740.The_Hiawatha", "num_ratings": "131", "num_reviews": "14", "avg_ratings": 3.72, "genres": ["Fiction", "Literary Fiction"], "title": "The Hiawatha", "description": ["Recently widowed, and encouraged by government relocation schemes to move Native Americans off their reservations, Betty takes her four young children from their Ojibwe roots to make a new life in Minneapolis. Her younger son Lester finds romance on the soon-to-be-demolished train, The Hiawatha, while his older brother Simon takes a dangerous job scaling skyscrapers. Their", "Recently widowed, and encouraged by government relocation schemes to move Native Americans off their reservations, Betty takes her four young children from their Ojibwe roots to make a new life in Minneapolis. Her younger son Lester finds romance on the soon-to-be-demolished train, The Hiawatha, while his older brother Simon takes a dangerous job scaling skyscrapers. Their fates collide, and result in a tale of crime, punishment, and redemption.", "An elegy to the American dream, and to the sometimes tragic experience of the Native Americans who helped to build it, ", " is a powerful novel that confirms David Treuer's status as a young writer of rare talent."], "author": "David Treuer", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-03 00:00:00", "ISBN": "0312252722"},
{"url": "https://www.goodreads.com/book/show/505615.alterNatives", "num_ratings": "77", "num_reviews": "5", "avg_ratings": 3.86, "genres": ["Drama", "Academic", "School", "Academic", "Read For School"], "title": "alterNatives", "description": ["A very liberal contemporary couple—Angel, an urban Native science fiction writer, and Colleen, a “non-practising” Jewish intellectual who teaches Native literature—hosts a dinner party. The guests at this little “sitcom” soirée are couples that represent what by now have become the clichéd extremes of both societies: Angel’s former radical Native activist buddies and Colle", "A very liberal contemporary couple—Angel, an urban Native science fiction writer, and Colleen, a “non-practising” Jewish intellectual who teaches Native literature—hosts a dinner party. The guests at this little “sitcom” soirée are couples that represent what by now have become the clichéd extremes of both societies: Angel’s former radical Native activist buddies and Colleen’s environmentally concerned vegetarian / veterinarian friends. The menu is, of course, the hosts’ respectful attempt at shorthand for the irreconcilable cultural differences about to come to a head during the evening: moose roast and vegetarian lasagna.", "Like all of Drew Hayden Taylor’s work, alterNatives manages to say things about “Whites and Indians” that one is not supposed to talk about—it digs up the carefully buried, raw and pulsing nerve-endings of the unspeakable and exposes them to the hot bright lights of the stage. That he does so with a humour that the politically correct among his audiences continue to miss entirely beneath the sound and fury of their own self-righteous indignation is a measure of his immense talent as a dramatist. In the end, the play is not about cultural differences at all, but instead constitutes a full frontal attack on the personal qualities the sitcom holds most dear and pushes hardest at its audiences: Taylor actually has the temerity to suggest that neither “attitude” nor “sincerity” are enough to address basic human issues, no matter which side of the cultural fence the characters are on. And that’s hard for the pushers of what is considered a globally enlightened culture to take.", "Cast of 3 women and 3 men."], "author": "Drew Hayden Taylor", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-02-15 00:00:00", "ISBN": "0889224285"},
{"url": "https://www.goodreads.com/book/show/9295720-first-wives-club", "num_ratings": "44", "num_reviews": "5", "avg_ratings": 3.84, "genres": ["Short Stories", "Fiction", "Cultural", "Canada"], "title": "First Wives Club: Coast Salish Style", "description": ["This poignant and powerful collection of short stories provides revealing glimpses into the life experiences of an Aboriginal woman, a university professor, an activist and a single mother. With lyrical eloquence, Lee Maracle takes the reader on a deeply stirring and emotional journey that is at times humorous and heart-wrenching but not soon to be forgotten."], "author": "Lee Maracle", "num_pages": "97", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-06-18 00:00:00", "ISBN": "1894778952"},
{"url": "https://www.goodreads.com/book/show/45040.Rez_Road_Follies", "num_ratings": "123", "num_reviews": "10", "avg_ratings": 3.96, "genres": ["Nonfiction", "Autobiography", "Memoir"], "title": "Rez Road Follies: Canoes, Casinos, Computers, and Birch Bark Baskets", "description": ["The author relates his own life experiences to offer a view of contemporary Native American life."], "author": "Jim Northrup", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-10-15 00:00:00", "ISBN": "0816634955"},
{"url": "https://www.goodreads.com/book/show/589478.Me_Funny", "num_ratings": "109", "num_reviews": "20", "avg_ratings": 3.85, "genres": ["Nonfiction", "Writing", "Essays", "Humor"], "title": "Me Funny", "description": ["Humor has always been an essential part of North American aboriginal culture. This fact remained unnoticed by most settlers, however, since non-aboriginals just didn’t get the joke. For most of written history, a stern, unyielding profile of “the Indian” dominated the popular mainstream imagination. Indians, it was believed, never laughed. But Indians themselves always kne", "Humor has always been an essential part of North American aboriginal culture. This fact remained unnoticed by most settlers, however, since non-aboriginals just didn’t get the joke. For most of written history, a stern, unyielding profile of “the Indian” dominated the popular mainstream imagination. Indians, it was believed, never laughed. But Indians themselves always knew better. As an award-winning playwright, columnist, and comedy-sketch creator, Drew Hayden Taylor has spent 15 years writing and researching aboriginal humor. For ", " he asked a noted cast of writers from a variety of fields — including such celebrated wordsmiths as Thomas King, Allan J. Ryan, Mirjam Hirch, and Tomson Highway — to take a look at what makes aboriginal humor tick. Their hilarious, enlightening contributions playfully examine the use of humor in areas as diverse as stand-up comedy, fiction, visual art, drama, performance, poetry, traditional storytelling, and education."], "author": "Drew Hayden Taylor", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-12-06 00:00:00", "ISBN": "1553651375"},
{"url": "https://www.goodreads.com/book/show/3141751-me-sexy", "num_ratings": "113", "num_reviews": "20", "avg_ratings": 3.93, "genres": ["Nonfiction", "Sexuality", "Writing", "Essays", "Cultural", "Canada", "Criticism", "Literary Criticism"], "title": "Me Sexy: An Exploration of Native Sex and Sexuality", "description": ["A moving and often funny look at Native sexuality from some of Canada's best First Nations and Inuit writers.", "A sequel to the highly successful Me Funny, Me Sexy is an anthology containing thirteen contributions from leading members of North America's First Nations writing communities. The many highlights include Lee Maracle's creation story, Salish style; Tomson Highway ex", "A moving and often funny look at Native sexuality from some of Canada's best First Nations and Inuit writers.", "A sequel to the highly successful Me Funny, Me Sexy is an anthology containing thirteen contributions from leading members of North America's First Nations writing communities. The many highlights include Lee Maracle's creation story, Salish style; Tomson Highway explaining why Cree is the sexiest of all languages; Joseph Boyden asking the eternal question, \"Do Native people have less (or more) pubic hair?\"; Marius P. Tungilik looking at the dark side of Inuit sex; and Marissa Crazytrain discussing her year as a stripper in Toronto, and how it shaped her life back in Saskatchewan."], "author": "Drew Hayden Taylor", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-14 00:00:00", "ISBN": "1553652762"},
{"url": "https://www.goodreads.com/book/show/1281675.The_Invisible_Musician", "num_ratings": "12", "num_reviews": "2", "avg_ratings": 3.75, "genres": ["Poetry", "Academic", "College"], "title": "The Invisible Musician", "description": ["Young Bear draws heavily upon ancient traditions while creating dramatic versions of the harshness of modern tribal life, the Vietnam War, and exploitation of the land. At the same time, images from nature, such as the kingfisher or the eagle, reflect the human condition. Includes original Mesquakie songs translated by the author."], "author": "Ray A. Young Bear", "num_pages": "104", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-01-01 00:00:00", "ISBN": "0930100336"},
{"url": "https://www.goodreads.com/book/show/156364.The_Heartsong_of_Charging_Elk", "num_ratings": "768", "num_reviews": "80", "avg_ratings": 3.87, "genres": ["Historical", "Historical Fiction", "Fiction", "Novels", "Cultural", "France"], "title": "The Heartsong of Charging Elk", "description": ["From the award-winning author of the Native American classic ", ",", "a richly crafted novel of cultural crossing that is a triumph of storytelling and the historical imagination. ", "Charging Elk, an Oglala Sioux, joins Buffalo Bill's Wild West Show and journeys from the Black Hills of South Dakota to the back streets of nineteenth-century Marseille. Left behind in a Marse", "From the award-winning author of the Native American classic ", ",", "a richly crafted novel of cultural crossing that is a triumph of storytelling and the historical imagination. ", "Charging Elk, an Oglala Sioux, joins Buffalo Bill's Wild West Show and journeys from the Black Hills of South Dakota to the back streets of nineteenth-century Marseille. Left behind in a Marseille hospital after a serious injury while the show travels on, he is forced to remake his life alone in a strange land. He struggles to adapt as well as he can, while holding on to the memories and traditions of life on the Plains and eventually falling in love. But none of the worlds the Indian has known can prepare him for the betrayal that follows. This is a story of the American Indian that we have seldom seen: a stranger in a strange land, often an invisible man, loving, violent, trusting, wary, protective, and defenseless against a society that excludes him but judges him by its rules. At once epic and intimate, ", " echoes across time, geography, and cultures."], "author": "James Welch", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-10-02 00:00:00", "ISBN": "0385496753"},
{"url": "https://www.goodreads.com/book/show/3527053-survivor-s-medicine", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 4.33, "genres": ["Short Stories"], "title": "Survivor's Medicine: Short Stories", "description": ["In detail sometimes raw and violent these short stories show how racism and poverty plague the lives of many American Indians. Yet even as they look these realities straight in the eye, the stories affirm the healing power of laughter and celebrate the human capacity for survival. The characters dwell in small towns or big cities, or are simply on the road, whether along t", "In detail sometimes raw and violent these short stories show how racism and poverty plague the lives of many American Indians. Yet even as they look these realities straight in the eye, the stories affirm the healing power of laughter and celebrate the human capacity for survival. The characters dwell in small towns or big cities, or are simply on the road, whether along the highways that crisscross America from Ontario to Texas or in the network of the psyche. For some, such as Joe Walks-Bear (who struggles to build a new life after being jailed for a crime he did not commit) and the adolescent Russell (who wrestles with a paralyzing fear), their passages are life-transforming. For others, such as Chicago bus driver Harold Ball and the slow-walking child Muffin, their journeys involve the mundane stumbling blocks of everyday life."], "author": "E. Donald Two-Rivers", "num_pages": "258", "awards": ["American Book Award (1999)"], "places": [], "character_names": [], "language": "English", "publish_date": "1998-12-31 00:00:00", "ISBN": "080613092X"},
{"url": "https://www.goodreads.com/book/show/2227528.The_Plague_of_Doves", "num_ratings": "11,448", "num_reviews": "1,708", "avg_ratings": 3.76, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Novels"], "title": "The Plague of Doves", "author": "Louise Erdrich", "num_pages": "313", "awards": ["Pulitzer Prize Nominee for Fiction (2009)", "Anisfield-Wolf Book Award (2009)", "Dayton Literary Peace Prize Nominee for Fiction (2009)", "Minnesota Book Award for Novel & Short Story (2009)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2008-04-29 00:00:00", "ISBN": "0060515120"},
{"url": "https://www.goodreads.com/book/show/1048276.Telling_It", "num_ratings": "8", "num_reviews": "0", "avg_ratings": 4.5, "genres": ["Feminism", "Glbt", "Queer"], "title": "Telling It: Women and Language Across Cultures", "description": ["Racism, cultural appropriation, and homophobia are addressed by prominent Asian-Canadian, Native and lesbian writers, including Joy Kogawa, Lee Maracle, Betsy Warland, Sky Lee, Jeanette Armstrong, Barbara Herringer, and Louise Profeit-LeBlanc."], "author": "Lee Maracle", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-11-28 00:00:00", "ISBN": "0889740275"},
{"url": "https://www.goodreads.com/book/show/1058879.Life_Among_The_Piutes", "num_ratings": "249", "num_reviews": "33", "avg_ratings": 3.73, "genres": ["History", "Nonfiction", "Biography", "Autobiography", "Memoir", "Biography", "Autobiography", "History", "Native American History"], "title": "Life Among The Piutes: Their Wrongs And Claims", "description": ["This autobiographical work was written by one of the country's most well-known Native American women, Sarah Winnemucca. She was a Paiute princess and a major figure in the history of Nevada; her tribe still resides primarily in the state. ", " deals with Winnemucca's life and the plight of the Paiute Indians. ", " is Winnemucca's powerful", "This autobiographical work was written by one of the country's most well-known Native American women, Sarah Winnemucca. She was a Paiute princess and a major figure in the history of Nevada; her tribe still resides primarily in the state. ", " deals with Winnemucca's life and the plight of the Paiute Indians. ", " is Winnemucca's powerful legacy to both white and Paiute cultures. Following the oral tradition of Native American people, she reaches out to readers with a deeply personal appeal for understanding. She also records historical events from a unique perspective. She managed to record the Native American viewpoint of whites settling the West, told in a language that was not her own and by a woman during the time when even white women were not allowed to vote. Sarah Winnemucca dedicated her life to improving the living and social conditions for her people. She gave more than 400 speeches across the United States and Europe to gain support for the Paiutes. She died of tuberculosis in 1891. ", " was originally published in 1883."], "author": "Sarah Winnemucca Hopkins", "num_pages": "272", "awards": [], "places": [], "character_names": ["Sarah Winnemucca"], "language": "English", "publish_date": "1994-11-01 00:00:00", "ISBN": "0874172527"},
{"url": "https://www.goodreads.com/book/show/505645.Bobbi_Lee_Indian_Rebel", "num_ratings": "54", "num_reviews": "3", "avg_ratings": 4.09, "genres": ["Autobiography", "Memoir", "Cultural", "Canada"], "title": "Bobbi Lee Indian Rebel", "description": ["\"Bobbi Lee confronts white Canadian society on the ground that it stole from the First Nations of this country. A tough autobiography of an Indian woman's life from the mud flats of Second Narrows Bridge, Vancouver, to the Toronto of the sixties and seventies, Lee Maracle gives us an important sense of the tough terrain of struggle toward political consciousness which all", "\"Bobbi Lee confronts white Canadian society on the ground that it stole from the First Nations of this country. A tough autobiography of an Indian woman's life from the mud flats of Second Narrows Bridge, Vancouver, to the Toronto of the sixties and seventies, Lee Maracle gives us an important sense of the tough terrain of struggle toward political consciousness which all oppressed peoples undertake. Bobbi Lee is a hopeful work for recovering the possibilities of envisioning a world where we are not beaten down every day.\"- Dionne Brand"], "author": "Lee Maracle", "num_pages": "242", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-11-01 00:00:00", "ISBN": "0889611483"},
{"url": "https://www.goodreads.com/book/show/997369.Briefcase_Warriors", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 4.0, "genres": [], "title": "Briefcase Warriors: Stories for the Stage", "description": ["In Briefcase Warriors, a collection of six fast-paced, thought-provoking plays, E. Donald Two-Rivers presents an intricate and multifaceted view of contemporary American Indian urban life. Alternately sad, humorous, or discomfiting, these plays range from one-act vignettes accessible to young adults to extended portrayals of the seedier side of urban existence. Fast-talkin", "In Briefcase Warriors, a collection of six fast-paced, thought-provoking plays, E. Donald Two-Rivers presents an intricate and multifaceted view of contemporary American Indian urban life. Alternately sad, humorous, or discomfiting, these plays range from one-act vignettes accessible to young adults to extended portrayals of the seedier side of urban existence. Fast-talking and hard-living, the characters depicted by Two-Rivers struggle to survive the sometimes hostile environs of a society whose members think of them as a vanishing race.", "The plays included are: Winter Summit or the Bang-Bang Incident; Forked Tongues; Chili Corn; Coyote Sits in Judgment; Shattered Dream; and Old Indian Trick (An Old Urban Indian Story as Told by an Old Urban Indian Who May Have Lied)."], "author": "E. Donald Two-Rivers", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-03-15 00:00:00", "ISBN": "0806133015"},
{"url": "https://www.goodreads.com/book/show/142900.The_Master_Butchers_Singing_Club", "num_ratings": "19,806", "num_reviews": "1,588", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Literary Fiction", "Book Club"], "title": "The Master Butchers Singing Club", "description": ["From National Book Award-winning, ", "-bestselling author Louise Erdrich, a profound and enchanting new novel: a richly imagined world “where butchers sing like angels.”", "Having survived World War I, Fidelis Waldvogel returns to his quiet German village and marries the pregnant widow of his best friend, killed in action. With a suitcase full of sausages and a maste", "From National Book Award-winning, ", "-bestselling author Louise Erdrich, a profound and enchanting new novel: a richly imagined world “where butchers sing like angels.”", "Having survived World War I, Fidelis Waldvogel returns to his quiet German village and marries the pregnant widow of his best friend, killed in action. With a suitcase full of sausages and a master butcher's precious knife set, Fidelis sets out for America. In Argus, North Dakota, he builds a business, a home for his family—which includes Eva and four sons—and a singing club consisting of the best voices in town. When the Old World meets the New—in the person of Delphine Watzka—the great adventure of Fidelis's life begins. Delphine meets Eva and is enchanted. She meets Fidelis, and the ground trembles. These momentous encounters will determine the course of Delphine's life, and the trajectory of this brilliant novel."], "author": "Louise Erdrich", "num_pages": "416", "awards": [], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2016-08-23 00:00:00", "ISBN": "0060837055"},
{"url": "https://www.goodreads.com/book/show/505644.I_Am_Woman", "num_ratings": "299", "num_reviews": "32", "avg_ratings": 4.32, "genres": ["Feminism", "Nonfiction", "Sociology", "Womens"], "title": "I Am Woman: A Native Perspective on Sociology and Feminism", "description": ["A revised edition of Lee Maracle's visionary book which links teaching of her First Nations heritage with feminism."], "author": "Lee Maracle", "num_pages": "146", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-05-31 00:00:00", "ISBN": "0889740593"},
{"url": "https://www.goodreads.com/book/show/9462473-broken-circle", "num_ratings": "208", "num_reviews": "30", "avg_ratings": 3.72, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Canada", "History"], "title": "Broken Circle: The Dark Legacy of Indian Residential Schools: A Memoir", "description": ["Theodore (Ted) Fontaine lost his family and freedom just after his seventh birthday, when his parents were forced to leave him at an Indian residential school by order of the Roman Catholic Church and the Government of Canada. Twelve years later, he left school frozen at the emotional age of seven. He was confused, angry and conflicted, on a path of self-destruction. At ag", "Theodore (Ted) Fontaine lost his family and freedom just after his seventh birthday, when his parents were forced to leave him at an Indian residential school by order of the Roman Catholic Church and the Government of Canada. Twelve years later, he left school frozen at the emotional age of seven. He was confused, angry and conflicted, on a path of self-destruction. At age 29, he emerged from this blackness. By age 32, he had graduated from the Civil Engineering Program at the Northern Alberta Institute of Technology and begun a journey of self-exploration and healing.", "In this powerful and poignant memoir, Ted examines the impact of his psychological, emotional and sexual abuse, the loss of his language and culture, and, most important, the loss of his family and community. He goes beyond details of the abuses of Native children to relate a unique understanding of why most residential school survivors have post-traumatic stress disorders and why succeeding generations of First Nations children suffer from this dark chapter in history.", "Told as remembrances described with insights that have evolved through his healing, his story resonates with his resolve to help himself and other residential school survivors and to share his enduring belief that one can pick up the shattered pieces and use them for good."], "author": "Theodore Fontaine", "num_pages": "190", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "192661366X"},
{"url": "https://www.goodreads.com/book/show/9000190-the-school-days-of-an-indian-girl-and-an-indian-teacher-among-indians", "num_ratings": "32", "num_reviews": "1", "avg_ratings": 3.72, "genres": ["History", "Autobiography", "Memoir", "Biography", "Native Americans", "North American Hi...", "American History"], "title": "The School Days of an Indian Girl, and an Indian Teacher Among Indians", "description": ["Gertrude Simmons Bonnin (1876-1938), better known by her pen name, Zitkala-Sa, was a Native American writer, editor, musician, teacher and political activist. She was born and raised on the Yankton Sioux Reservation in South Dakota by her mother. Zitkala-Sa lived a traditional lifestyle until the age of eight when she left her reservation to attend Whites Manual Labor Inst", "Gertrude Simmons Bonnin (1876-1938), better known by her pen name, Zitkala-Sa, was a Native American writer, editor, musician, teacher and political activist. She was born and raised on the Yankton Sioux Reservation in South Dakota by her mother. Zitkala-Sa lived a traditional lifestyle until the age of eight when she left her reservation to attend Whites Manual Labor Institute, a Quaker mission school in Indiana. She went on to study for a time at Earlham College in Indiana and the New England Conservatory of Music in Boston. A considerable talent, Bonnin co-composed the first American Indian grand opera, The Sun Dance in 1913. After working as a teacher at Carlisle Indian Industrial School, she began publishing short stories and autobiographical vignettes. Her autobiographical writings were serialized in Atlantic Monthly and, later, published in a collection called American Indian Stories in 1921. Her first book, Old Indian Legends (1901), is a collection of folktales that she gathered during her visits home to the Yankton Reservation. Her other works include Stories of Iktomi and Other Legends of the Dakotas (1901) and Oklahoma's Poor Rich Indians (1924)."], "author": "Zitkala-Ša", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-25 00:00:00", "ISBN": "1409978605"},
{"url": "https://www.goodreads.com/book/show/1148401.Kiss_of_the_Fur_Queen", "num_ratings": "1,681", "num_reviews": "116", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Kiss of the Fur Queen", "description": ["Born into a magical Cree world in snowy northern Manitoba, Champion and Ooneemeetoo Okimasis are all too soon torn from their family and thrust into the hostile world of a Catholic residential school. Their language is forbidden, their names are changed to Jeremiah and Gabriel, and both boys are abused by priests.", "As young men, estranged from their own people and alienated", "Born into a magical Cree world in snowy northern Manitoba, Champion and Ooneemeetoo Okimasis are all too soon torn from their family and thrust into the hostile world of a Catholic residential school. Their language is forbidden, their names are changed to Jeremiah and Gabriel, and both boys are abused by priests.", "As young men, estranged from their own people and alienated from the culture imposed upon them, the Okimasis brothers fight to survive. Wherever they go, the Fur Queen--a wily, shape-shifting trickster--watches over them with a protective eye. For Jeremiah and Gabriel are destined to be artists. Through music and dance they soar."], "author": "Tomson Highway", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-09-14 00:00:00", "ISBN": "0385258801"},
{"url": "https://www.goodreads.com/book/show/10518339-one-story-one-song", "num_ratings": "210", "num_reviews": "38", "avg_ratings": 4.27, "genres": ["Cultural", "Canada", "Nonfiction", "Autobiography", "Memoir"], "title": "One Story, One Song", "description": ["One Story, One Song ", "One Story, One Song", "In ", ", Richar", "One Story, One Song ", "One Story, One Song", "In ", ", Richard Wagamese invites readers to accompany him on his travels. His focus is on stories: how they shape us, how they empower us, how they change our lives. Ancient and contemporary, cultural and spiritual, funny and sad, the tales are grouped according to the four Ojibway storytelling principles: balance, harmony, knowledge and intuition.", "Whether the topic is learning from his grade five teacher about Martin Luther King, gleaning understanding from a wolf track, lighting a fire for the first time without matches or finding the universe in an eagle feather, these stories exhibit the warmth, wisdom and generosity that make Wagamese so popular. As always, in these pages, the land serves as Wagameseï¿½s guide. And as always, he finds that true home means not only community but conversation—good, straight-hearted talk about important things. We all need to tell our stories, he says. Every voice matters."], "author": "Richard Wagamese", "num_pages": "216", "awards": ["George Ryga Award for Social Awareness in Literature (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-17 00:00:00", "ISBN": "1553655060"},
{"url": "https://www.goodreads.com/book/show/4861295-one-native-life", "num_ratings": "553", "num_reviews": "79", "avg_ratings": 4.25, "genres": ["Nonfiction", "Autobiography", "Memoir", "Cultural", "Canada", "Biography"], "title": "One Native Life", "description": ["In 2005, award-winning writer ", " moved with his partner to a cabin outside Kamloops, B.C. In the crisp mountain air ", " felt a peace he’d seldom known before. Abused and abandoned as a kid, he’d grown up feeling there was nowhere he belonged. For years, only alcohol and moves from town to town seemed to ease the pain.", "In ", ", ", " looks", "In 2005, award-winning writer ", " moved with his partner to a cabin outside Kamloops, B.C. In the crisp mountain air ", " felt a peace he’d seldom known before. Abused and abandoned as a kid, he’d grown up feeling there was nowhere he belonged. For years, only alcohol and moves from town to town seemed to ease the pain.", "In ", ", ", " looks back down the road he has travelled in reclaiming his identity and talks about the things he has learned as a human being, a man and an Ojibway in his fifty-two years. Whether he’s writing about playing baseball, running away with the circus, attending a sacred bundle ceremony or meeting Pierre Trudeau, he tells these stories in a healing spirit. Through them,", " celebrates the learning journey his life has been.", "Free of rhetoric and anger despite the horrors he has faced, ", "’s prose resonates with a peace that has come from acceptance. Acceptance is an Aboriginal principle, and he has come to see that we are all neighbours here. ", " is his tribute to the people, the places and the events that have allowed him to stand in the sunshine and celebrate being alive."], "author": "Richard Wagamese", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-22 00:00:00", "ISBN": "1553653645"},
{"url": "https://www.goodreads.com/book/show/590560.Keeper_n_Me", "num_ratings": "811", "num_reviews": "93", "avg_ratings": 3.89, "genres": ["Cultural", "Canada", "Fiction"], "title": "Keeper'n Me", "description": ["When Garnet Raven was three years old, he was taken from his home on an Ojibway Indian reserve and placed in a series of foster homes. Having reached his mid-teens, he escapes at the first available opportunity, only to find himself cast adrift on the streets of the big city.", "Having skirted the urban underbelly once too often by age 20, he finds himself thrown in jail. Whil", "When Garnet Raven was three years old, he was taken from his home on an Ojibway Indian reserve and placed in a series of foster homes. Having reached his mid-teens, he escapes at the first available opportunity, only to find himself cast adrift on the streets of the big city.", "Having skirted the urban underbelly once too often by age 20, he finds himself thrown in jail. While there, he gets a surprise letter from his long-forgotten native family.", "The sudden communication from his past spurs him to return to the reserve following his release from jail. Deciding to stay awhile, his life is changed completely as he comes to discover his sense of place, and of self. While on the reserve, Garnet is initiated into the ways of the Ojibway--both ancient and modern--by Keeper, a friend of his grandfather, and last fount of history about his people's ways.", "By turns funny, poignant and mystical, ", " reflects a positive view of Native life and philosophy--as well as casting fresh light on the redemptive power of one's community and traditions."], "author": "Richard Wagamese", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-02-01 00:00:00", "ISBN": "0385254520"},
{"url": "https://www.goodreads.com/book/show/1207931.The_Jailing_of_Cecelia_Capture", "num_ratings": "123", "num_reviews": "17", "avg_ratings": 3.65, "genres": ["Fiction", "Feminism", "Academic", "College", "Academic", "School"], "title": "The Jailing of Cecelia Capture", "description": ["Cecelia Capture Welles, an Indian law student and mother of two, is jailed on her thirtieth birthday for drunk driving. Held on an old welfare fraud charge, she reflects back on her life on the reservation in Idaho, her days as an unwed mother in San Francisco, her marriage to a white liberal, and her decision to return to college. This mixed inheritance of ambition and de", "Cecelia Capture Welles, an Indian law student and mother of two, is jailed on her thirtieth birthday for drunk driving. Held on an old welfare fraud charge, she reflects back on her life on the reservation in Idaho, her days as an unwed mother in San Francisco, her marriage to a white liberal, and her decision to return to college. This mixed inheritance of ambition and despair brings her to the brink of suicide.", " is a beautifully written book. Janet Campbell Hale's gifts are genuine and deeply felt.\"--Toni Morrison\""], "author": "Janet Campbell Hale", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-07-01 00:00:00", "ISBN": "0826310036"},
{"url": "https://www.goodreads.com/book/show/2927735-molly-molasses-and-me", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 5.0, "genres": ["Fiction"], "title": "Molly Molasses and Me: A Collection of Living Adventures", "author": "Ssipsis", "num_pages": "73", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1990-08-28 00:00:00", "ISBN": "1883957001"},
{"url": "https://www.goodreads.com/book/show/590561.For_Joshua_", "num_ratings": "232", "num_reviews": "33", "avg_ratings": 4.22, "genres": ["Cultural", "Canada", "Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "For Joshua : An Ojibway Father Teaches His Son", "description": ["Celebrated Ojibway author Richard Wagamese shares the traditions and teachings of his people, entwining them with an account of his own life-long struggle for self-knowledge and self-respect.", "Richard Wagamese stares the modern world in the eye and takes careful note of its snares and perils. He sees people coveting without knowing why, people looking for roots without under", "Celebrated Ojibway author Richard Wagamese shares the traditions and teachings of his people, entwining them with an account of his own life-long struggle for self-knowledge and self-respect.", "Richard Wagamese stares the modern world in the eye and takes careful note of its snares and perils. He sees people coveting without knowing why, people looking for roots without understanding what might constitute rootedness, people looking for acceptance without offering reciprocal respect, and people longing for love without knowing how to offer it. And underneath all lurks the seductive oblivion of substance abuse. These are the pitfalls of his own life, dangers he hopes his estranged son, Joshua, will be able to navigate with the guidance afforded by this heartfelt memoir.", "Richard Wagamese has no easy answers. His road to self-knowledge has been long and treacherous -- and it is in part this series of trials that has furnished him if not with a complete set of answers then at least a profound understanding of the questions. Again and again Wagamese brings universal problems into astonishingly sharp focus by sharing the special wisdom of Canada’s First Nations, while reminding us that we are not so different after all."], "author": "Richard Wagamese", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-08 00:00:00", "ISBN": "0385257120"},
{"url": "https://www.goodreads.com/book/show/977953.One_Good_Story_That_One", "num_ratings": "554", "num_reviews": "44", "avg_ratings": 4.02, "genres": ["Short Stories", "Fiction", "Cultural", "Canada", "Literature", "Canadian Literature"], "title": "One Good Story, That One", "description": ["There is much more than one good story in this bestselling (over 10,000 copies sold) collection of short fiction. In fact, there are more than a few of the best examples of native storytelling ever published. Thomas King, author of the acclaimed", " and ", "There is much more than one good story in this bestselling (over 10,000 copies sold) collection of short fiction. In fact, there are more than a few of the best examples of native storytelling ever published. Thomas King, author of the acclaimed", " and ", ", and the newly released", ", has proven he has a magical gift, a fresh voice and a special brand of wit and comic imagination. ", " is steeped in native oral tradition, led off by a sly creation tale, introducing the traditional native trickster coyote. Weaving the realities of native history and contemporary life through the story, King recounts a parodic version of the Garden of Eden story, slyly pulling our leg and our funnybone.", "A collection that is rich with strong characters, alive with crisp dialogue and shot through with the universal truths we are all searching for,", " is one great read."], "author": "Thomas King", "num_pages": "147", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1999-12-20 00:00:00", "ISBN": "0006485251"},
{"url": "https://www.goodreads.com/book/show/96052.The_Woman_Who_Fell_from_the_Sky", "num_ratings": "440", "num_reviews": "31", "avg_ratings": 4.22, "genres": ["Poetry", "Cultural", "Feminism"], "title": "The Woman Who Fell from the Sky: Poems", "description": ["Joy Harjo, one of this country's foremost Native American voices, combines elements of storytelling, prayer, and song, informed by her interest in jazz and by her North American tribal background, in this, her fourth volume of poetry.", "She draws from the Native American tradition of praising the land and the spirit, the realities of American culture, and the concept of femin", "Joy Harjo, one of this country's foremost Native American voices, combines elements of storytelling, prayer, and song, informed by her interest in jazz and by her North American tribal background, in this, her fourth volume of poetry.", "She draws from the Native American tradition of praising the land and the spirit, the realities of American culture, and the concept of feminine individuality."], "author": "Joy Harjo", "num_pages": "88", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-08-17 00:00:00", "ISBN": "039331362X"},
{"url": "https://www.goodreads.com/book/show/327232.Manitous", "num_ratings": "134", "num_reviews": "16", "avg_ratings": 4.26, "genres": ["Fantasy", "Mythology", "Nonfiction", "Religion", "Cultural", "Canada"], "title": "Manitous: The Spiritual World Of The Ojibway", "description": ["Manitous lived in human form among the Ojibway in the early days, after Kitchi-Manitou (the Great Mystery) created all things and Muzzu-Kummik-Quae (Mother Earth) revealed the natural order of the world. With depth and humor, Johnston tells how lasting tradition was brought to the Ojibway by four half-human brothers, including Nana'b'oozoo, the beloved archetypal being who", "Manitous lived in human form among the Ojibway in the early days, after Kitchi-Manitou (the Great Mystery) created all things and Muzzu-Kummik-Quae (Mother Earth) revealed the natural order of the world. With depth and humor, Johnston tells how lasting tradition was brought to the Ojibway by four half-human brothers, including Nana'b'oozoo, the beloved archetypal being who means well but often blunders. He also relates how people are helped and hindered by other entities, such as the manitous of the forests and meadows, personal manitous and totems, mermen and merwomen, Pauguk (the cursed Flying Skeleton), and the Weendigoes, famed and terrifying giant cannibals."], "author": "Basil Johnston", "num_pages": "271", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-09-15 00:00:00", "ISBN": "0873514114"},
{"url": "https://www.goodreads.com/book/show/17174.A_Yellow_Raft_in_Blue_Water", "num_ratings": "15,884", "num_reviews": "910", "avg_ratings": 3.86, "genres": ["Fiction", "Classics", "Academic", "School"], "title": "A Yellow Raft in Blue Water", "description": ["Michael Dorris has crafted a fierce saga of three generations of Indian women, beset by hardships and torn by angry secrets, yet inextricably joined by the bonds of kinship. Starting in the present day and moving backward, the novel is told in the voices of the three women: fifteen-year-old part-black Rayona; her American Indian mother, Christine, consumed by tenderness an", "Michael Dorris has crafted a fierce saga of three generations of Indian women, beset by hardships and torn by angry secrets, yet inextricably joined by the bonds of kinship. Starting in the present day and moving backward, the novel is told in the voices of the three women: fifteen-year-old part-black Rayona; her American Indian mother, Christine, consumed by tenderness and resentment toward those she loves; and the fierce and mysterious Ida, mother and grandmother whose haunting secrets, betrayals, and dreams echo through the years, braiding together the strands of the shared past."], "author": "Michael Dorris", "num_pages": "372", "awards": [], "places": ["Montana"], "character_names": [], "language": "English", "publish_date": "2003-03-05 00:00:00", "ISBN": "0312421850"},
{"url": "https://www.goodreads.com/book/show/590563.Ragged_Company", "num_ratings": "1,686", "num_reviews": "280", "avg_ratings": 4.26, "genres": ["Fiction", "Cultural", "Canada", "Book Club"], "title": "Ragged Company", "description": ["Four chronically homeless people–Amelia One Sky, Timber, Double Dick and Digger–seek refuge in a warm movie theatre when a severe Arctic Front descends on the city. During what is supposed to be a one-time event, this temporary refuge transfixes them. They fall in love with this new world, and once the weather clears, continue their trips to the cinema. On one of these out", "Four chronically homeless people–Amelia One Sky, Timber, Double Dick and Digger–seek refuge in a warm movie theatre when a severe Arctic Front descends on the city. During what is supposed to be a one-time event, this temporary refuge transfixes them. They fall in love with this new world, and once the weather clears, continue their trips to the cinema. On one of these outings they meet Granite, a jaded and lonely journalist who has turned his back on writing “the same story over and over again” in favour of the escapist qualities of film, and an unlikely friendship is struck. ", "A found cigarette package (contents: some unsmoked cigarettes, three $20 bills, and a lottery ticket) changes the fortune of this struggling set. The ragged company discovers they have won $13.5 million, but none of them can claim the money for lack proper identification. Enlisting the help of Granite, their lives, and fortunes, become forever changed.", " is a journey into both the future and the past. Richard Wagamese deftly explores the nature of the comforts these friends find in their ideas of “home,” as he reconnects them to their histories."], "author": "Richard Wagamese", "num_pages": "376", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-12 00:00:00", "ISBN": "0385661568"},
{"url": "https://www.goodreads.com/book/show/656330.Dry_Lips_Oughta_Move_To_Kapuskasing", "num_ratings": "401", "num_reviews": "29", "avg_ratings": 3.36, "genres": ["Plays", "Cultural", "Canada", "Drama", "Fiction", "Academic", "Read For School", "Academic", "School"], "title": "Dry Lips Oughta Move To Kapuskasing", "description": ["Nominee, Governor General's Literary Award for Drama Dry Lips Oughta Move to Kapuskasing tells another story of the mythical Wasaychigan Hill Indian Reserve, also the setting for Tomson Highway's award winning play The Rez Sisters. Wherein The Rez Sisters the focus was on seven Wasy women and the game of bingo, Dry Lips Oughta Move to Kapuskasing features seven Wasy men an", "Nominee, Governor General's Literary Award for Drama Dry Lips Oughta Move to Kapuskasing tells another story of the mythical Wasaychigan Hill Indian Reserve, also the setting for Tomson Highway's award winning play The Rez Sisters. Wherein The Rez Sisters the focus was on seven Wasy women and the game of bingo, Dry Lips Oughta Move to Kapuskasing features seven Wasy men and the game of hockey. It is a fast-paced story of tragedy, comedy, and hope."], "author": "Tomson Highway", "num_pages": "136", "awards": [], "places": ["Canada"], "character_names": [], "language": "English", "publish_date": "1989-10-01 00:00:00", "ISBN": "0920079555"},
{"url": "https://www.goodreads.com/book/show/196429.Medicine_River", "num_ratings": "1,077", "num_reviews": "89", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Canada"], "title": "Medicine River", "description": ["When Will returns to Medicine River, he thinks he is simply attending his mother's funeral. He doesn't count on Harlen Bigbear and his unique brand of community planning. Harlen tries to sell Will on the idea of returning to Medicine River to open shop as the town's only Native photographer. Somehow, that's exactly what happens. Through Will's gentle and humorous narrative", "When Will returns to Medicine River, he thinks he is simply attending his mother's funeral. He doesn't count on Harlen Bigbear and his unique brand of community planning. Harlen tries to sell Will on the idea of returning to Medicine River to open shop as the town's only Native photographer. Somehow, that's exactly what happens. Through Will's gentle and humorous narrative, we come to know Medicine River, a small Albertan town bordering a Blackfoot reserve. And we meet its people: the basketball team; Louise Heavyman and her daughter, South Wing; Martha Oldcrow, the marriage doctor; Joe Bigbear, Harlen's world-travelling, storytelling brother; Bertha Morley, who has a short fling with a Calgary dating service; and David Plume, who went to Wounded Knee. At the centre of it all is Harlen, advising and pestering, annoying and entertaining, gossiping and benevolently interfering in the lives of his friends and neighbours."], "author": "Thomas King", "num_pages": "249", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-27 00:00:00", "ISBN": "014305435X"},
{"url": "https://www.goodreads.com/book/show/155890.Ancient_Child", "num_ratings": "300", "num_reviews": "28", "avg_ratings": 3.8, "genres": ["Fiction", "Native Americans", "Westerns"], "title": "Ancient Child", "description": ["In his first novel since the Pulitzer Prize-winning ", " N. Scott Momaday shapes the ancient Kiowa myth of a boy who turned into a bear into a timeless American classic. ", " juxtaposes Indian lore and Wild West legend into a hypnotic, often lyrical contemporary novel--the story of Locke Setman, known as Set, a Native American raised far from th", "In his first novel since the Pulitzer Prize-winning ", " N. Scott Momaday shapes the ancient Kiowa myth of a boy who turned into a bear into a timeless American classic. ", " juxtaposes Indian lore and Wild West legend into a hypnotic, often lyrical contemporary novel--the story of Locke Setman, known as Set, a Native American raised far from the reservation by his adoptive father. Set feels a strange aching in his soul and, returning to tribal lands for the funeral of his grandmother, is drawn irresistibly to the fabled bear-boy. When he meets Grey, a beautiful young medicine woman with a visionary gift, his world is turned upside down. Here is a magical saga of one man's tormented search for his identity--a quintessential American novel, and a great one."], "author": "N. Scott Momaday", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-09-12 00:00:00", "ISBN": "0060973455"},
{"url": "https://www.goodreads.com/book/show/13530588-china-blues", "num_ratings": "1,232", "num_reviews": "95", "avg_ratings": 4.09, "genres": ["Historical", "Historical Fiction", "Mystery", "Fiction", "Historical"], "title": "China Blues", "description": ["The Roaring Twenties, Chinatown, San Francisco: back-street blues and bathtub gin… hardball mobsters and hardheaded cops… seductive speakeasies and sizzling scandals. As the young Louis Armstrong blows his horn in the infamous Blue Canary, impetuous Nob Hill Socialite Elizabeth Stafford Hamilton plunges into a reckless affair with mysterious Li Kwan Won. Unknown to Lizzie,", "The Roaring Twenties, Chinatown, San Francisco: back-street blues and bathtub gin… hardball mobsters and hardheaded cops… seductive speakeasies and sizzling scandals. As the young Louis Armstrong blows his horn in the infamous Blue Canary, impetuous Nob Hill Socialite Elizabeth Stafford Hamilton plunges into a reckless affair with mysterious Li Kwan Won. Unknown to Lizzie, Li is the overlord of the city’s vast bootlegging empire—and archenemy of her powerful husband, the San Francisco district attorney. Suddenly Lizzie’s privileged, upper-crust life is shadowed by danger and intrigue—as she’s trapped between her lover and her husband while they battle for control of the city.", "Eio Books has reissued Ki Longfellow's first novel, published by Harper Collins in England in 1989."], "author": "Ki Longfellow", "num_pages": "456", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-24 00:00:00", "ISBN": "0975925571"},
{"url": "https://www.goodreads.com/book/show/196430.The_Truth_About_Stories", "num_ratings": "1,944", "num_reviews": "183", "avg_ratings": 4.31, "genres": ["Nonfiction", "Cultural", "Canada", "Writing", "Essays"], "title": "The Truth About Stories: A Native Narrative", "author": "Thomas King", "num_pages": "184", "awards": ["Trillium Book Award (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-02 00:00:00", "ISBN": "0816646260"},
{"url": "https://www.goodreads.com/book/show/514811.The_Secret_Magdalene", "num_ratings": "3,341", "num_reviews": "410", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Religion", "Historical"], "title": "The Secret Magdalene", "description": ["Raised like sisters, Mariamne and Salome are indulged with riches, position, and learning-a rare thing for females in Jerusalem. But Mariamne has a further gift: an illness has left her with visions; she has the power of prophecy. It is her prophesying that drives the two girls to flee to Egypt, where they study philosophy, mathematics, and astronomy in the Great Library o", "Raised like sisters, Mariamne and Salome are indulged with riches, position, and learning-a rare thing for females in Jerusalem. But Mariamne has a further gift: an illness has left her with visions; she has the power of prophecy. It is her prophesying that drives the two girls to flee to Egypt, where they study philosophy, mathematics, and astronomy in the Great Library of Alexandria.", "After seven years they return to a Judaea where many now believe John the Baptizer is the messiah. Salome too begins to believe, but Mariamne, now called Magdalene, is drawn to his cousin, Yeshu’a, a man touched by the divine in the same way she was during her days of illness. Together they speak of sharing their direct experience of God; but Yeshu’a unexpectedly gains a reputation as a healer, and as the ill and the troubled flock to him, he and Magdalene are forced to make a terrible decision.", "This radical retelling of the greatest story ever told brings Mary Magdalene to life-not as a prostitute or demon-possessed-but as an educated woman who was truly the “apostle to the apostles.”"], "author": "Ki Longfellow", "num_pages": "448", "awards": [], "places": [], "character_names": ["Salome", "John the Baptizer", "Yeshu’a", "Mary Magdalene"], "language": "English", "publish_date": "2007-03-27 00:00:00", "ISBN": "0307346668"},
{"url": "https://www.goodreads.com/book/show/226354.Lame_Deer_Seeker_of_Visions", "num_ratings": "1,532", "num_reviews": "96", "avg_ratings": 4.26, "genres": ["Nonfiction", "Biography", "History", "Religion"], "title": "Lame Deer, Seeker of Visions", "description": [" ", " "], "author": "John (Fire) Lame Deer", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-10-01 00:00:00", "ISBN": "0671888021"},
{"url": "https://www.goodreads.com/book/show/311782.Bird_Girl_the_Man_Who_Followed_the_Sun", "num_ratings": "423", "num_reviews": "68", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Mythology", "Adventure", "Fantasy", "Native Americans"], "title": "Bird Girl & the Man Who Followed the Sun: An Athabaskan Indian Legend from Alaska", "description": ["In her spellbinding second book, the award-winning author interweaves two classic Athabaskan legends set in ancient central Alaska. This is the story of two rebels who break the strict taboos of their communal culture in their quests for freedom and adventure. Readers will be captivated by this profound myth about two young people who wander far from their culture's deeply", "In her spellbinding second book, the award-winning author interweaves two classic Athabaskan legends set in ancient central Alaska. This is the story of two rebels who break the strict taboos of their communal culture in their quests for freedom and adventure. Readers will be captivated by this profound myth about two young people who wander far from their culture's deeply held traditions and eventually must find a way to come home again. Wallis's first book, TWO OLD WOMEN, is an international best-seller, translated into seventeen languages."], "author": "Velma Wallis", "num_pages": "224", "awards": [], "places": ["Alaska"], "character_names": ["Dragoo", "his family and 3 separate Indian tribes"], "language": "English", "publish_date": "1996-06-01 00:00:00", "ISBN": "0945397348"},
{"url": "https://www.goodreads.com/book/show/913105.Grandmother_Spider", "num_ratings": "795", "num_reviews": "52", "avg_ratings": 4.13, "genres": ["Mystery", "Fiction", "Westerns"], "title": "Grandmother Spider", "description": ["A lawman with a hardy appetite for life and an unshakable faith in the explicable, Southern Ute Acting Chief of Police Charlie Moon is not prepared to accept a purely supernatural explanation for the recent strange events of April 1. Nevertheless, something carried off Tommy Tonompicket and his unlikely drinking companion, research scientist William Pizinski, in the black", "A lawman with a hardy appetite for life and an unshakable faith in the explicable, Southern Ute Acting Chief of Police Charlie Moon is not prepared to accept a purely supernatural explanation for the recent strange events of April 1. Nevertheless, something carried off Tommy Tonompicket and his unlikely drinking companion, research scientist William Pizinski, in the black chill of the Colorado night. And something ripped the head off a man outside a lonely cabin in the mountains...and left two large, fanglike punctures in his chest. And though Charlie's eccentric old aunt, the shaman Daisy Perika, claims the gargantuan avenging arachnid Grandmother Spider has risen up from the depths of Navajo Lake, the hulking, good-natured tribal policeman feels in his gut that this is murder, pure if not simple, and most probably by human hands."], "author": "James D. Doss", "num_pages": "384", "awards": [], "places": ["United States of America"], "character_names": ["Charlie Moon"], "language": "English", "publish_date": "2001-12-04 00:00:00", "ISBN": "0380803941"},
{"url": "https://www.goodreads.com/book/show/230606.The_Shaman_Laughs", "num_ratings": "735", "num_reviews": "32", "avg_ratings": 4.09, "genres": ["Mystery", "Fiction", "Westerns", "Mystery", "Crime"], "title": "The Shaman Laughs", "description": ["Charlie Moon is no stranger to the mysterious ways of the spirit world. But why is prize livestock being ritualistically butchered in the Canyon of the Spirit? That's what Granite Creek's chief of police Scott Parish wants to find out before human blood begins to spill.", "Enter Moon's aunt and aging Ute shaman Daisy Perika. For only she who communes with the ancient spirits c", "Charlie Moon is no stranger to the mysterious ways of the spirit world. But why is prize livestock being ritualistically butchered in the Canyon of the Spirit? That's what Granite Creek's chief of police Scott Parish wants to find out before human blood begins to spill.", "Enter Moon's aunt and aging Ute shaman Daisy Perika. For only she who communes with the ancient spirits can truly comprehend the events that have happened upon Native American lands--and the even greater evil that is yet to be unleashed", "In \"The Shaman Laughs,\" James D. Doss delivers another fascinating Charlie Moon mystery.\""], "author": "James D. Doss", "num_pages": "274", "awards": [], "places": ["United States of America"], "character_names": ["Charlie Moon"], "language": "English", "publish_date": "1999-01-01 00:00:00", "ISBN": "0312136013"},
{"url": "https://www.goodreads.com/book/show/76987.The_Shaman_Sings", "num_ratings": "1,217", "num_reviews": "106", "avg_ratings": 3.88, "genres": ["Mystery", "Fiction", "Westerns", "Thriller", "Mystery Thriller"], "title": "The Shaman Sings", "description": ["The howling Coyote, messenger of the dwarf master pitukupf and dancing balls of fire, the bruja. These are the omens that appear to the aged Ute shaman Daisy Perika and her shepherd friend Nahum Yaciiti. Omens signaling the work of the Dark One among the matukach, the white people in this southwestern corner of Colorado. The brutal, late-night murder of graduate student Pr", "The howling Coyote, messenger of the dwarf master pitukupf and dancing balls of fire, the bruja. These are the omens that appear to the aged Ute shaman Daisy Perika and her shepherd friend Nahum Yaciiti. Omens signaling the work of the Dark One among the matukach, the white people in this southwestern corner of Colorado. The brutal, late-night murder of graduate student Priscilla Song in her physics laboratory is Chief Scott Parris's first homicide case since arriving from Chicago three years earlier. At first it looks open-and-shut, but loose ends quickly unravel to produce several possible suspects with equally pressing motives. With the help of lovely journalist Anne Foster and Daisy Perika, Parris just may be able to catch the killer before he selects another victim. First novelist James D. Doss juxtaposes two extremes of southwestern life to create a dramatic and moving story that is much more than simply a murder mystery. The people in these disparate worlds mingle with, give to, and take from one another. The reader is caught up in not only the discoveries of hard science, but what the old Shaman can see and effect when she sings."], "author": "James D. Doss", "num_pages": "256", "awards": [], "places": ["United States of America"], "character_names": ["Charlie Moon"], "language": "English", "publish_date": "1995-11-01 00:00:00", "ISBN": "0380724960"},
{"url": "https://www.goodreads.com/book/show/52878.Indian_Killer", "num_ratings": "6,870", "num_reviews": "564", "avg_ratings": 3.78, "genres": ["Fiction", "Mystery", "Novels", "Contemporary", "Thriller"], "title": "Indian Killer", "description": ["A murderer is stalking and scalping white men in Seattle, his calling card a pair of feathers crossed on the victim's chest. While this so-called Indian Killer terrorises the city, its Native American population is thrown into turmoil. With each new murder, the city is gripped by fear, and as the killer searches for his latest victim, the novel builds to its unexpected and", "A murderer is stalking and scalping white men in Seattle, his calling card a pair of feathers crossed on the victim's chest. While this so-called Indian Killer terrorises the city, its Native American population is thrown into turmoil. With each new murder, the city is gripped by fear, and as the killer searches for his latest victim, the novel builds to its unexpected and terrifying climax."], "author": "Sherman Alexie", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-08-16 00:00:00", "ISBN": "009926823X"},
{"url": "https://www.goodreads.com/book/show/505616.The_Boy_in_the_Treehouse_Girl_Who_Loved_Her_Horses", "num_ratings": "9", "num_reviews": "0", "avg_ratings": 4.11, "genres": ["Plays"], "title": "The Boy in the Treehouse / Girl Who Loved Her Horses", "description": ["In this collection of two plays about the process of children becoming adults, Drew Hayden Taylor works his delightfully comic and bitter-sweet magic on the denials, misunderstandings and preconceptions which persist between Native and Colonial culture in North America.", "In ", ", Simon, the son of an Ojibway mother and a British father, climbs into his ha", "In this collection of two plays about the process of children becoming adults, Drew Hayden Taylor works his delightfully comic and bitter-sweet magic on the denials, misunderstandings and preconceptions which persist between Native and Colonial culture in North America.", "In ", ", Simon, the son of an Ojibway mother and a British father, climbs into his half-finished tree house on the vision-quest his books say is necessary for him to reclaim his mother’s culture. “It’s a Native thing,” he informs his incredulous father (who tells him he’d never heard of such a thing from his wife): “Only boys do it. It’s part of becoming a man.” Of course, what with the threats of the police, the temptation of the barbeque next door, and the distractions of a persistent neighbourhood girl, Simon probably wouldn’t recognize a vision if he fell over it.", " is the Native name for the strange and quiet Danielle from the non-status community across the tracks, imbued with the mysterious power to draw the horse “every human being on the planet wanted but could never have.” She is and remains an enigma to the people of the reservation, but the power of her spirit remains strong. Years later, a huge image of her horse reappears, covering an entire side of a building in a blighted urban landscape of beggars and broken dreams. The eyes of her stallion, which once gleamed exhilaration and freedom, now glare with defiance and anger. Danielle has clearly been forced to grow up.", "With these two plays, Taylor rediscovers an issue long forgotten in our “post-historical” age: the nature of, and the necessity for, these rites of passage in all cultures."], "author": "Drew Hayden Taylor", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-02-15 00:00:00", "ISBN": "0889224412"},
{"url": "https://www.goodreads.com/book/show/845868.The_Surrounded", "num_ratings": "596", "num_reviews": "49", "avg_ratings": 3.73, "genres": ["Fiction", "Academic", "School", "Historical", "Historical Fiction", "Literature"], "title": "The Surrounded", "description": ["As ", " opens, Archilde Le�n has just returned from the big city to his father's ranch on the Flathead Indian Reservation in Montana. The story that unfolds captures the intense and varied conflict that already characterized reservation life in 1936, when this remarkable novel was first published.", "Educated at a federal Indian boarding school, Archilde is torn not", "As ", " opens, Archilde Le�n has just returned from the big city to his father's ranch on the Flathead Indian Reservation in Montana. The story that unfolds captures the intense and varied conflict that already characterized reservation life in 1936, when this remarkable novel was first published.", "Educated at a federal Indian boarding school, Archilde is torn not only between white and Indian cultures but also between love for his Spanish father and his Indian mother, who in her old age is rejecting white culture and religion to return to the ways of her people. Archilde's young contemporaries, meanwhile, are succumbing to the destructive influence of reservation life, growing increasingly uprooted, dissolute, and hopeless. Although Archilde plans to leave the reservation after a brief visit, his entanglements delay his departure until he faces destruction by the white man's law.", "In an early review of ", " Oliver La Farge praised it as \"simple, clear, direct, devoid of affectations, and fast-moving.\" He included it in his \"small list of creditable modern novels using the first Americans as theme.\" Several decades later, long out of print but not forgotten, ", " is still considered one of the best works of fiction by or about Native Americans."], "author": "D'Arcy McNickle", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1978-02-01 00:00:00", "ISBN": "0826304699"},
{"url": "https://www.goodreads.com/book/show/106540.Tales_of_Burning_Love", "num_ratings": "2,193", "num_reviews": "143", "avg_ratings": 3.87, "genres": ["Fiction", "Novels", "Literary Fiction"], "title": "Tales of Burning Love", "description": ["In her boldest and most darkly humorous novel yet, award-winning, critically acclaimed and bestselling novelist Louise Erdrich tells the intimate and powerful stories of five Great Plains women whose lives are connected through one man. Stranded in a North Dakota blizzard, Jack Mauser's former wives huddle for warmth and pass the endless night by remembering the stories of", "In her boldest and most darkly humorous novel yet, award-winning, critically acclaimed and bestselling novelist Louise Erdrich tells the intimate and powerful stories of five Great Plains women whose lives are connected through one man. Stranded in a North Dakota blizzard, Jack Mauser's former wives huddle for warmth and pass the endless night by remembering the stories of how each came to love, marry and ultimately move beyond Jack. At times painful, at times heartbreaking and often times comic, their tales become the adhesive that holds them together in their love for Jack and in their lives as women.", "Erdrich, with her characteristic powers of observation and luminescent prose, brings these women's unforgettable stories to life with astonishing candor and warmth. Filled with keen perceptions about the apparatus for survival, the force of passion and the necessity of hope, \"Tales of Burning Love\" is a tour de force from one of the most formidable American writers at work today.\"Her most daring and perhaps her most compelling....A wise, wonderful, and wickedly funny novel.\" \"--Booklist\""], "author": "Louise Erdrich", "num_pages": "464", "awards": ["Minnesota Book Award for Novels (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-14 00:00:00", "ISBN": "0060928360"},
{"url": "https://www.goodreads.com/book/show/1190695.The_Night_Wanderer", "num_ratings": "354", "num_reviews": "81", "avg_ratings": 3.44, "genres": ["Fantasy", "Young Adult", "Paranormal", "Vampires", "Fiction", "Horror", "Cultural", "Canada"], "title": "The Night Wanderer", "description": ["Nothing ever happens on the Otter Lake reservation. But when 16-year-old Tiffany discovers her father is renting out her room, she’s deeply upset. Sure, their guest is polite and keeps to himself, but he’s also a little creepy. Little do Tiffany, her father, or even her astute Granny Ruth suspect the truth. The mysterious Pierre L’Errant is actually a vampire, returning to", "Nothing ever happens on the Otter Lake reservation. But when 16-year-old Tiffany discovers her father is renting out her room, she’s deeply upset. Sure, their guest is polite and keeps to himself, but he’s also a little creepy. Little do Tiffany, her father, or even her astute Granny Ruth suspect the truth. The mysterious Pierre L’Errant is actually a vampire, returning to his tribal home after centuries spent in Europe. But Tiffany has other things on her mind: her new boyfriend is acting weird, disputes with her father are escalating, and her estranged mother is starting a new life with somebody else. Fed up and heartsick, Tiffany threatens drastic measures and flees into the bush. There, in the midnight woods, a chilling encounter with L’Errant changes everything ... for both of them. A mesmerizing blend of Gothic thriller and modern coming-of-age novel, The Night Wanderer is unlike any other vampire story."], "author": "Drew Hayden Taylor", "num_pages": "215", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1554510996"},
{"url": "https://www.goodreads.com/book/show/108435.Prison_Writings", "num_ratings": "1,635", "num_reviews": "93", "avg_ratings": 4.16, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Politics"], "title": "Prison Writings: My Life Is My Sun Dance", "description": ["Edited by Harvey Arden, with an Introduction by Chief Arvol Looking Horse, and a Preface by former Attorney General Ramsey Clark.", "In 1977, Leonard Peltier received a life sentence for the murder of two FBI agents. He has affirmed his innocence ever since--his case was made fully and famously in Peter Matthiessen's bestselling ", "--and many remain co", "Edited by Harvey Arden, with an Introduction by Chief Arvol Looking Horse, and a Preface by former Attorney General Ramsey Clark.", "In 1977, Leonard Peltier received a life sentence for the murder of two FBI agents. He has affirmed his innocence ever since--his case was made fully and famously in Peter Matthiessen's bestselling ", "--and many remain convinced he was wrongly convicted. ", "is a wise and unsettling book, both memoir and manifesto, chronicling his life in Leavenworth Prison in Kansas. Invoking the Sun Dance, in which pain leads one to a transcendent reality, Peltier explores his suffering and the insights it has borne him. He also locates his experience within the history of the American Indian peoples and their struggles to overcome the federal government's injustices."], "author": "Leonard Peltier", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-16 00:00:00", "ISBN": "0312263805"},
{"url": "https://www.goodreads.com/book/show/254343.Circle_of_Nations", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 3.0, "genres": [], "title": "Circle of Nations (CL)", "description": ["A stunning anthology of original essays and photographs by 20 American Indian writers and photographers includes the works of Gabriel Horn and Simon Ortiz. Celebrates the depth and diversity of contemporary Native American life. 80 photos, 40 in color. Media tour."], "author": "John Gattuso", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-09-01 00:00:00", "ISBN": "0941831906"},
{"url": "https://www.goodreads.com/book/show/52879.Ten_Little_Indians", "num_ratings": "5,948", "num_reviews": "517", "avg_ratings": 4.08, "genres": ["Short Stories", "Fiction", "Contemporary"], "title": "Ten Little Indians", "description": ["Sherman Alexie offers nine poignant and emotionally resonant stories about Native Americans who find themselves at personal and cultural crossroads. In 'The Life and Times of Estelle Walks Above', an intellectual feminist Spokane Indian woman saves the lives of dozens of white women all around her, to the bewilderment of her only child. In 'Do You Know Where I Am?' two col", "Sherman Alexie offers nine poignant and emotionally resonant stories about Native Americans who find themselves at personal and cultural crossroads. In 'The Life and Times of Estelle Walks Above', an intellectual feminist Spokane Indian woman saves the lives of dozens of white women all around her, to the bewilderment of her only child. In 'Do You Know Where I Am?' two college sweethearts rescue a lost cat - a simple act that has profound moral consequences for the rest of their lives together. In 'What You Pawn I Will Redeem', a homeless Indian man must raise $1,000 in twenty-four hours to buy back the fancy dance outfit stolen from his grandmother fifty years earlier.", "Even as they often make us laugh, Sherman Alexie's stories are driven by a haunting lyricism and naked candour that cut to the heart of the human experience."], "author": "Sherman Alexie", "num_pages": "256", "awards": ["O. Henry Award for 'What You Pawn I Will Redeem' (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-06 00:00:00", "ISBN": "009946456X"},
{"url": "https://www.goodreads.com/book/show/589968.Black_Eagle_Child", "num_ratings": "73", "num_reviews": "4", "avg_ratings": 3.62, "genres": ["Poetry", "Fiction", "Native Americans"], "title": "Black Eagle Child: The Facepaint Narratives", "description": ["A classic of Native American literature, Black Eagle Child uses a rich mix of verse, prose narrative, and letters to tell Edgar Bearchild's journey to adulthood. Although the backdrop of much of Young Bear's novel may be familiar — the conflicts over race, drugs, Vietnam and others that gripped America in the fifties, sixties, and seventies — Bearchild recounts his coming-", "A classic of Native American literature, Black Eagle Child uses a rich mix of verse, prose narrative, and letters to tell Edgar Bearchild's journey to adulthood. Although the backdrop of much of Young Bear's novel may be familiar — the conflicts over race, drugs, Vietnam and others that gripped America in the fifties, sixties, and seventies — Bearchild recounts his coming-of-age story from a distinct vantage point, as a member of the Mesquakie nation. From his childhood delight in Jell-O to his induction into the faith of his elders, Bearchild's journey is a uniquely American one."], "author": "Ray A. Young Bear", "num_pages": "261", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-12-06 00:00:00", "ISBN": "0802134289"},
{"url": "https://www.goodreads.com/book/show/2282584.Old_Indian_Legends", "num_ratings": "221", "num_reviews": "20", "avg_ratings": 3.69, "genres": ["Fiction", "Short Stories", "Fantasy", "Mythology", "Native Americans", "Classics", "Folklore"], "title": "Old Indian Legends", "description": ["Early in the twentieth century, a Sioux woman named Zitkala-Ša published these fourteen Native legends that she had learned during her own childhood on the Yankton Reservation. Her writing talent, developed during her education back east, was put to good use in recording from oral tradition the exploits of Iktomi the trickster, Eya the glutton, the Dragon Fly, and other ma", "Early in the twentieth century, a Sioux woman named Zitkala-Ša published these fourteen Native legends that she had learned during her own childhood on the Yankton Reservation. Her writing talent, developed during her education back east, was put to good use in recording from oral tradition the exploits of Iktomi the trickster, Eya the glutton, the Dragon Fly, and other magical and mysterious figures, human and animal, known to the Sioux. Until her death in 1938, Zitkala-Ša stood between two cultures as preserver and translator."], "author": "Zitkala-Ša", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-01 00:00:00", "ISBN": "0803299036"},
{"url": "https://www.goodreads.com/book/show/122663.Ravensong", "num_ratings": "242", "num_reviews": "31", "avg_ratings": 3.83, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Ravensong", "description": ["Lee Maracle, author of the best-selling I Am Woman: A Native Perspective on Sociology and Feminism, sets this novel in an urban Native American community on the Pacific Northwest coast in the early 1950s. Ravensong is by turns damning, humorous, inspirational, and prophetic."], "author": "Lee Maracle", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-05-08 00:00:00", "ISBN": "0889740445"},
{"url": "https://www.goodreads.com/book/show/377580.Seven_Arrows", "num_ratings": "604", "num_reviews": "41", "avg_ratings": 4.18, "genres": ["Nonfiction", "History", "Spirituality", "Philosophy"], "title": "Seven Arrows", "description": ["A heartbreaking story of victory, defeat, and of a spiritual search in a profane world, this is the story of Night Bear and his people. It is the tale of the land they cherish and the lives they hold sacred, lived until the enemy can no longer be stopped, and the dead have few left to weep for them."], "author": "Hyemeyohsts Storm", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-05-12 00:00:00", "ISBN": "0345329015"},
{"url": "https://www.goodreads.com/book/show/4578640-born-with-a-tooth", "num_ratings": "872", "num_reviews": "90", "avg_ratings": 4.03, "genres": ["Short Stories", "Cultural", "Canada", "Fiction"], "title": "Born with a Tooth", "description": ["Almost a decade after its original publication, award winner and Governor General Literary Award nominee Joseph Boyden's classic book of short stories is finally being reissued. Born With A Tooth, Boyden's debut work of fiction, is a collection of thirteen beautifully written stories about aboriginal life in Ontario. They are stories of love, unexpected triumph, and a pass", "Almost a decade after its original publication, award winner and Governor General Literary Award nominee Joseph Boyden's classic book of short stories is finally being reissued. Born With A Tooth, Boyden's debut work of fiction, is a collection of thirteen beautifully written stories about aboriginal life in Ontario. They are stories of love, unexpected triumph, and a passionate belief in dreams. They are also stories of anger and longing, of struggling to adapt, of searching but remaining unfulfilled. The collection includes 'Bearwalker', a story that introduces a character who appears again in Boyden's novel Three Day Road. By taking on a new voice in each story, Joseph Boyden explores aboriginal stereotypes and traditions in a most unexpected way. Whether told by a woman trying to forget her past or by a drunken man trying to preserve his culture, each story paints an unforgettable and varied image of modern aboriginal culture in Ontario. An extraordinary first book, Born With A Tooth reveals why Joseph Boyden is a writer worth reading."], "author": "Joseph Boyden", "num_pages": "245", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "1897151349"},
{"url": "https://www.goodreads.com/book/show/187799.Where_White_Men_Fear_to_Tread", "num_ratings": "1,042", "num_reviews": "86", "avg_ratings": 4.09, "genres": ["Biography", "Nonfiction", "History", "Biography", "Autobiography", "Autobiography", "Memoir", "Native Americans"], "title": "Where White Men Fear to Tread: The Autobiography of Russell Means", "description": ["Russell Means is the most controversial Indian leader of our time. ", "is the well-detailed, first-hand story of his life so far, in which he has done everything possible to dramatize and justify the Native American aim of self-determination, such as storming Mount Rushmore, seizing Plymouth Rock, running for President in 1988, and--most notorious", "Russell Means is the most controversial Indian leader of our time. ", "is the well-detailed, first-hand story of his life so far, in which he has done everything possible to dramatize and justify the Native American aim of self-determination, such as storming Mount Rushmore, seizing Plymouth Rock, running for President in 1988, and--most notoriously--leading a 71-day takeover of Wounded Knee, South Dakota, in 1973. This visionary autobiography by one of our most magnetic personalities will fascinate, educate, and inspire. As Dee Brown has written, \"A reading of Means's story is essential for any clear understanding of American Indians during the last half of the twentieth century.\""], "author": "Russell Means", "num_pages": "624", "awards": [], "places": ["Porcupine", "Greenwood, Missouri", "Vallejo", "Wounded Knee", "Pine Ridge, South Dakota", "Los Angeles, California"], "character_names": ["Russell Means", "Larry Flynt", "Hank Adams", "Struck by the Ree", "Bill Janklow", "Dennis Banks", "Dick Wilson", "James Abourezk", "Clyde Bellecourt", "Brooklyn Rivera"], "language": "English", "publish_date": "1996-11-15 00:00:00", "ISBN": "0312147619"},
{"url": "https://www.goodreads.com/book/show/4800592-fearless-warriors", "num_ratings": "16", "num_reviews": "3", "avg_ratings": 3.63, "genres": ["Short Stories", "Cultural", "Canada"], "title": "Fearless Warriors", "description": ["Dramatic, chilling, tragic, shocking, tender and affirmative stories of Native people caught between two cultures."], "author": "Drew Hayden Taylor", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-01-01 00:00:00", "ISBN": "0889223955"},
{"url": "https://www.goodreads.com/book/show/110996.House_Made_of_Dawn", "num_ratings": "5,693", "num_reviews": "377", "avg_ratings": 3.68, "genres": ["Fiction", "Classics", "Literature"], "title": "House Made of Dawn", "description": ["The magnificent Pulitzer Prize-winning novel of a proud stranger in his native land.", "He was a young American Indian named Abel, and he lived in two worlds. One was that of his father, wedding him to the rhythm of the seasons, the harsh beauty of the land, the ecstasy of the drug called peyote. The other was the world of the twentieth century, goading him into a compulsive c", "The magnificent Pulitzer Prize-winning novel of a proud stranger in his native land.", "He was a young American Indian named Abel, and he lived in two worlds. One was that of his father, wedding him to the rhythm of the seasons, the harsh beauty of the land, the ecstasy of the drug called peyote. The other was the world of the twentieth century, goading him into a compulsive cycle of sexual exploits, dissipation, and disgust. Home from a foreign war, he was a man being torn apart, a man descending into hell."], "author": "N. Scott Momaday", "num_pages": "198", "awards": ["Pulitzer Prize for Fiction (1969)"], "places": ["New Mexico"], "character_names": [], "language": "English", "publish_date": "2000-05-02 00:00:00", "ISBN": "0072434201"},
{"url": "https://www.goodreads.com/book/show/52528.The_Painted_Drum", "num_ratings": "6,378", "num_reviews": "794", "avg_ratings": 3.85, "genres": ["Fiction", "Historical", "Historical Fiction", "Audiobook", "Novels"], "title": "The Painted Drum", "description": ["When a woman named Faye Travers is called upon to appraise the estate of a family in her small New Hampshire town, she isn't surprised to discover a forgotten cache of valuable Native American artifacts. After all, the family descends from an Indian agent who worked on the North Dakota Ojibwe reservation that is home to her mother's family. However, she stops dead in her t", "When a woman named Faye Travers is called upon to appraise the estate of a family in her small New Hampshire town, she isn't surprised to discover a forgotten cache of valuable Native American artifacts. After all, the family descends from an Indian agent who worked on the North Dakota Ojibwe reservation that is home to her mother's family. However, she stops dead in her tracks when she finds in the collection a rare drum—a powerful yet delicate object, made from a massive moose skin stretched across a hollow of cedar, ornamented with symbols she doesn't recognize and dressed in red tassels and a beaded belt and skirt—especially since, without touching the instrument, she hears it sound. And so begins an illuminating journey both backward and forward in time, following the strange passage of a powerful yet delicate instrument, and revealing the extraordinary lives it has touched and defined.", "Compelling and unforgettable, bestselling author Louise Erdrich's ", " explores the often fraught relationship between mothers and daughters, the strength of family, and the intricate rhythms of grief with all the grace, wit, and startling beauty that characterizes this acclaimed author's finest work."], "author": "Louise Erdrich", "num_pages": "304", "awards": ["Chicago Tribune Heartland Prize for Fiction (2006)", "Minnesota Book Award for Novel & Short Story (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-22 00:00:00", "ISBN": "0060515112"},
{"url": "https://www.goodreads.com/book/show/52872.Flight", "num_ratings": "13,615", "num_reviews": "2,021", "avg_ratings": 3.89, "genres": ["Fiction", "Young Adult", "Fantasy", "Historical", "Historical Fiction", "Science Fiction", "Time Travel", "Audiobook", "Magical Realism", "Science Fiction", "Novels", "Young Adult", "Coming Of Age"], "title": "Flight", "description": ["Sherman Alexie is one of our most gifted and accomplished storytellers and a treasured writer of huge national stature. His first novel in ten years is the hilarious and tragic portrait of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful and swift, prose, ", " follows this troubled foster teenager--a", "Sherman Alexie is one of our most gifted and accomplished storytellers and a treasured writer of huge national stature. His first novel in ten years is the hilarious and tragic portrait of an orphaned Indian boy who travels back and forth through time in a charged search for his true identity. With powerful and swift, prose, ", " follows this troubled foster teenager--a boy who is not a \"legal\" Indian because he was never claimed by his father--as he learns that violence is not the answer.", "The journey for ", "'s young hero begins as he's about to commit a massive act o violence. At the moment of decision, he finds himself shot back through time to resurface in the body of an FBI agent during the civil rights era, where he sees why \"Hell is Re driver, Idaho, in the 1970s.\" Red River is only the first stop in an eye-opening trip through moments in American history. He will continue traveling back to inhabit the body of an Indian child during the battle at Little Bighorn and then ride with an Indian tracker in the nineteenth century before materializing as an airline pilot jetting through the skies today. During these furious travels through time, his refrain grows: \"Who's to judge?\" and \"I don't understand humans.\" When finally, blessedly, our young warrior comes to rest again in his own life, he is mightily transformed by all he has seen.", "This is Sherman Alexie at his most brilliant--making us laugh while he's breaking our hearts. ", " has said that \"Alexie, like his characters, is on a modern-day vision quest,\" and in ", " he seeks nothing less than an understanding of why human beings hate. ", " is irrepressible, fearless, and groundbreaking Alexie."], "author": "Sherman Alexie", "num_pages": "181", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-17 00:00:00", "ISBN": "0802170374"},
{"url": "https://www.goodreads.com/book/show/52870.Smoke_Signals", "num_ratings": "1,285", "num_reviews": "46", "avg_ratings": 4.26, "genres": ["Fiction", "Plays", "Drama"], "title": "Smoke Signals: A Screenplay", "description": ["Set in Arizona, Smoke Signals is the story of two Native American boys on a journey. Victor is the stoic, handsome son of an alcoholic father who has abandoned his family. Thomas is a gregarious, goofy young man who lost both his parents in a fire at a very young age. Through storytelling, Thomas makes every effort to connect with the people around him: Victor, in contrast", "Set in Arizona, Smoke Signals is the story of two Native American boys on a journey. Victor is the stoic, handsome son of an alcoholic father who has abandoned his family. Thomas is a gregarious, goofy young man who lost both his parents in a fire at a very young age. Through storytelling, Thomas makes every effort to connect with the people around him: Victor, in contrast, uses his quiet countenance to gain strength and confidence.When Victor's estranged father dies, the two men embark on an adventure to Phoenix to collect the ashes. Along the way, Smoke Signals illustrates the ties that bind these two very different young men and embraces the lessons they learn from one another."], "author": "Sherman Alexie", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-07-08 00:00:00", "ISBN": "0786883928"},
{"url": "https://www.goodreads.com/book/show/33100568-as-tears-go-by", "num_ratings": "25", "num_reviews": "11", "avg_ratings": 4.8, "genres": ["Nonfiction", "Race"], "title": "As Tears Go By: Inspired by True Events", "description": ["I changed their names. I shaped their minds. I was judge, jury, and executioner. No one could stop me. No one! ", "To anyone looking in, we were just a normal church going, family. No one was aware of the dark secrets we held within the walls of the tiny house by the swamp. ", "I was the woman with the razor strop and I made sure every blow connected. ", "That was until the day the sh", "I changed their names. I shaped their minds. I was judge, jury, and executioner. No one could stop me. No one! ", "To anyone looking in, we were just a normal church going, family. No one was aware of the dark secrets we held within the walls of the tiny house by the swamp. ", "I was the woman with the razor strop and I made sure every blow connected. ", "That was until the day the sheriff handed me my subpoena. I felt the hair stand up on the back of my neck. Abuse? What? The one-word ringing in my head drowning out anything and everything else that might have been said. I felt I might just pass out right there on the step. I kept my composure until he pulled out of the driveway and then my anger quickly exploded into rage. ", "Those ungrateful little bastards. After everything, I did for them. This was my thanks. ", "A bolt of straight adrenaline shot through my veins and I grabbed the gun….. ", "I had instilled the fear of god in them. I am not a woman to be tampered with. How could this be happening? ", "My one mistake…and I don’t make many… was not realizing that these stupid children would grow up. "], "author": "Rosie Christie", "num_pages": "183", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/254349.God_Is_Red", "num_ratings": "1,489", "num_reviews": "117", "avg_ratings": 4.1, "genres": ["Religion", "Nonfiction", "History", "Spirituality"], "title": "God Is Red: A Native View of Religion", "description": ["First published in 1972, Vine Deloria Jr.'s ", " remains the seminal work on Native religious views, asking new questions about our species and our ultimate fate. Celebrating three decades in publication with a special 30th-anniversary edition."], "author": "Vine Deloria Jr.", "num_pages": "325", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-09-01 00:00:00", "ISBN": "1555914985"},
{"url": "https://www.goodreads.com/book/show/78887.Tracks", "num_ratings": "9,735", "num_reviews": "524", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Academic", "School"], "title": "Tracks", "description": ["Set earliest in time within the cycle of her prizewinning and bestselling books, Love Medicine and The Beet Queen, Tracks takes readers to North Dakota at a time when Indian tribes were struggling to keep what little remained of their land. Features many familiar characters."], "author": "Louise Erdrich", "num_pages": "226", "awards": [], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "1989-08-07 00:00:00", "ISBN": "0060972459"},
{"url": "https://www.goodreads.com/book/show/1544588.Half_Breed", "num_ratings": "633", "num_reviews": "51", "avg_ratings": 3.95, "genres": ["Nonfiction", "Biography", "Cultural", "Canada", "Autobiography", "Memoir"], "title": "Half-Breed", "description": ["Maria Campbell's biography is a classic, vital account of a young Métis woman's struggle to come to terms with the joys, sorrows, loves and tragedies of her northern Saskatchewan childhood. ", "Maria was a strong and sensitive child who lived in a community robbed of its pride and dignity by the dominant culture. At 15 she tried in vain to escape by marrying a white man, only", "Maria Campbell's biography is a classic, vital account of a young Métis woman's struggle to come to terms with the joys, sorrows, loves and tragedies of her northern Saskatchewan childhood. ", "Maria was a strong and sensitive child who lived in a community robbed of its pride and dignity by the dominant culture. At 15 she tried in vain to escape by marrying a white man, only to find herself trapped in the slums of Vancouver -- addicted to drugs, tempted by suicide, close to death. But the inspiration of her Cree great-grandmother, Cheechum, gives her confidence in herself and in her people, confidence she needs to survive and to thrive. ", "\"Half-Breed\" offers an unparalleled understanding of the Métis people and of the racism and hatred they face. Maria Campbell's story cannot be denied and it cannot be forgotten: it stands as a challenge to all Canadians who believe in human rights and human dignity."], "author": "Maria Campbell", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1983-01-01 00:00:00", "ISBN": "0887801161"},
{"url": "https://www.goodreads.com/book/show/844522.American_Indian_Myths_and_Legends", "num_ratings": "4,128", "num_reviews": "85", "avg_ratings": 4.05, "genres": ["Fantasy", "Mythology", "Nonfiction", "Folklore", "History", "Religion"], "title": "American Indian Myths and Legends", "description": ["This magnificent collection gathers 160 tales from 80 tribal gathers to offer a rich and lively panorama of the Native American mythic heritage. From all across the continent come tales of creation and love, of heroes and war, of animals, tricksters, and the end of the world. Alfonso Ortiz, an eminent anthropologist, and Richard Erdoes, an artist and master storyteller, In", "This magnificent collection gathers 160 tales from 80 tribal gathers to offer a rich and lively panorama of the Native American mythic heritage. From all across the continent come tales of creation and love, of heroes and war, of animals, tricksters, and the end of the world. Alfonso Ortiz, an eminent anthropologist, and Richard Erdoes, an artist and master storyteller, Indian voices in the best folkloric sources of the nineteenth century to make this the most comprehensive and authentic volume of American Indian myths available anywhere.", "With black-and-white drawings throughout", "Part of the Pantheon Fairy Tale and Folklore Library"], "author": "Richard Erdoes", "num_pages": "527", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-08-12 00:00:00", "ISBN": "0394740181"},
{"url": "https://www.goodreads.com/book/show/588234.Ceremony", "num_ratings": "14,965", "num_reviews": "1,124", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Academic", "School"], "title": "Ceremony", "description": ["Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind o", "Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind of comfort and resolution. Tayo's quest leads him back to the Indian past and its traditions, to beliefs about witchcraft and evil, and to the ancient stories of his people. The search itself becomes a ritual, a curative ceremony that defeats the most virulent of afflictions—despair."], "author": "Leslie Marmon Silko", "num_pages": "262", "awards": ["American Book Award (1980)"], "places": [], "character_names": [], "language": "English", "publish_date": "1986-03-04 00:00:00", "ISBN": "0140086838"},
{"url": "https://www.goodreads.com/book/show/106542.The_Antelope_Wife", "num_ratings": "3,058", "num_reviews": "278", "avg_ratings": 3.8, "genres": ["Fiction", "Fantasy", "Magical Realism", "Historical", "Historical Fiction"], "title": "The Antelope Wife", "description": ["One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life", "One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life the people who live in or around this midwestern city. And like a modern city itself, it portrays people of all backgrounds and is a mixture of vibrant cultures and ideas. But also like a modern city, it has an edge, troubled by violence.", "\"New York Times\" bestselling author Louise Erdrich has twice won the National Magazine Award and her work has been included in both the O. Henry and the Best American collections several times."], "author": "Louise Erdrich", "num_pages": "256", "awards": ["World Fantasy Award for Best Novel (1999)"], "places": ["Minneapolis, Minnesota"], "character_names": [], "language": "English", "publish_date": "1998-10-16 00:00:00", "ISBN": "0007136366"},
{"url": "https://www.goodreads.com/book/show/11994903-indian-horse", "num_ratings": "8,379", "num_reviews": "1,069", "avg_ratings": 4.35, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Indian Horse", "description": ["Saul Indian Horse has hit bottom. His last binge almost killed him, and now he’s a reluctant resident in a treatment centre for alcoholics, surrounded by people he’s sure will never understand him. But Saul wants peace, and he grudgingly comes to see that he’ll find it only through telling his story. With him, readers embark on a journey back through the life he’s led as a", "Saul Indian Horse has hit bottom. His last binge almost killed him, and now he’s a reluctant resident in a treatment centre for alcoholics, surrounded by people he’s sure will never understand him. But Saul wants peace, and he grudgingly comes to see that he’ll find it only through telling his story. With him, readers embark on a journey back through the life he’s led as a northern Ojibway, with all its joys and sorrows.", "With compassion and insight, author Richard Wagamese traces through his fictional characters the decline of a culture and a cultural way. For Saul, taken forcibly from the land and his family when he’s sent to residential school, salvation comes for a while through his incredible gifts as a hockey player. But in the harsh realities of 1960s Canada, he battles obdurate racism and the spirit-destroying effects of cultural alienation and displacement. ", " unfolds against the bleak loveliness of northern Ontario, all rock, marsh, bog and cedar. Wagamese writes with a spare beauty, penetrating the heart of a remarkable Ojibway man."], "author": "Richard Wagamese", "num_pages": "221", "awards": ["First Nation Communities Read Award (2013)", "CBC Canada Reads Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-27 00:00:00", "ISBN": "1553654021"},
{"url": "https://www.goodreads.com/book/show/63837.The_Last_Report_on_the_Miracles_at_Little_No_Horse", "num_ratings": "8,649", "num_reviews": "999", "avg_ratings": 4.18, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Novels"], "title": "The Last Report on the Miracles at Little No Horse", "description": ["This is the story of Father Damien Modeste, priest to his beloved people, the Ojibwe. Modeste, nearing the end of his life, dreads the discovery of his physical identity -- for he is a woman who has lived as a man.", "For more than a half century, Father Damien Modeste has served his beloved people, the Ojibwe, on the remote reservation of Little No Horse. To complicate his fe", "This is the story of Father Damien Modeste, priest to his beloved people, the Ojibwe. Modeste, nearing the end of his life, dreads the discovery of his physical identity -- for he is a woman who has lived as a man.", "For more than a half century, Father Damien Modeste has served his beloved people, the Ojibwe, on the remote reservation of Little No Horse. To complicate his fears, his quiet life changes when a troubled colleague comes to the reservation to investigate the life of the perplexing, difficult, possibly false saint Sister Leopolda. Father Damien alone knows the strange truth of Sister Leopolda's piety and is faced with the most difficult decision of his life: Should he reveal all he knows and risk everything? Or should he manufacture a protective history though he believes Leopolda's wonder-working is motivated by evil?"], "author": "Louise Erdrich", "num_pages": "368", "awards": ["Minnesota Book Award for Novel & Short Story (2002)", "National Book Award Finalist for Fiction (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0007136358"},
{"url": "https://www.goodreads.com/book/show/823411.Three_Day_Road", "num_ratings": "17,873", "num_reviews": "1,482", "avg_ratings": 4.31, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Canada", "War"], "title": "Three Day Road", "description": ["It is 1919, and Niska, the last Oji-Cree woman to live off the land, has received word that one of the two boys she saw off to the Great War has returned. Xavier Bird, her sole living relation, is gravely wounded and addicted to morphine. As Niska slowly paddles her canoe on the three-day journey to bring Xavier home, travelling through the stark but stunning landscape of", "It is 1919, and Niska, the last Oji-Cree woman to live off the land, has received word that one of the two boys she saw off to the Great War has returned. Xavier Bird, her sole living relation, is gravely wounded and addicted to morphine. As Niska slowly paddles her canoe on the three-day journey to bring Xavier home, travelling through the stark but stunning landscape of Northern Ontario, their respective stories emerge—stories of Niska’s life among her kin and of Xavier’s horrifying experiences in the killing fields of Ypres and the Somme."], "author": "Joseph Boyden", "num_pages": "384", "awards": ["Canadian Booksellers Association Libris Award for Fiction Book (2006)", "Canadian Authors Association Award for Fiction (2006)", "Rogers Writers' Trust Fiction Prize (2005)", "McNally Robinson Aboriginal Book of the Year Award", "Amazon.ca First Novel Award (2005)", "OLA Evergreen Award (2006)"], "places": [], "character_names": ["Xavier Bird", "Niska", "Elijah Whiskeyjack"], "language": "English", "publish_date": "2006-03-14 00:00:00", "ISBN": "0143017861"},
{"url": "https://www.goodreads.com/book/show/46277.Green_Grass_Running_Water", "num_ratings": "5,609", "num_reviews": "355", "avg_ratings": 4.02, "genres": ["Fiction", "Cultural", "Canada", "Fantasy", "Magical Realism"], "title": "Green Grass, Running Water", "description": ["Strong, Sassy women and hard-luck hardheaded men, all searching for the middle ground between Native American tradition and the modern world, perform an elaborate dance of approach and avoidance in this magical, rollicking tale by Cherokee author Thomas King. Alberta is a university professor who would like to trade her two boyfriends for a baby but no husband; Lionel is f", "Strong, Sassy women and hard-luck hardheaded men, all searching for the middle ground between Native American tradition and the modern world, perform an elaborate dance of approach and avoidance in this magical, rollicking tale by Cherokee author Thomas King. Alberta is a university professor who would like to trade her two boyfriends for a baby but no husband; Lionel is forty and still sells televisions for a patronizing boss; Eli and his log cabin stand in the way of a profitable dam project. These three—and others—are coming to the Blackfoot reservation for the Sun Dance and there they will encounter four Indian elders and their companion, the trickster Coyote—and nothing in the small town of Blossom will be the same again…"], "author": "Thomas King", "num_pages": "469", "awards": ["Canadian Authors Association Award for Fiction"], "places": ["Alberta"], "character_names": [], "language": "English", "publish_date": "1994-06-01 00:00:00", "ISBN": "0553373684"},
{"url": "https://www.goodreads.com/book/show/91440.Love_Medicine", "num_ratings": "18,507", "num_reviews": "1,266", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Short Stories", "Novels"], "title": "Love Medicine", "description": ["The first book in Louise Erdrich's highly acclaimed \"Native American\" trilogy that includes \"The Beet Queen,\" \"Tracks,\" and \"The Bingo Palace,\" re-sequenced and expanded to include never-before-published chapters.", "\"A dazzling series of family portraits.... This novel is simply about the power of love.\" --"], "author": "Louise Erdrich", "num_pages": "367", "awards": ["American Book Award (1985)", "Los Angeles Times Book Prize for Fiction (1985)", "Sue Kaufman Prize for First Fiction (1985)", "Great Lakes Colleges Association New Writers Award for Fiction (1985)", "National Book Critics Circle Award for Fiction (1984)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "0060786469"},
{"url": "https://www.goodreads.com/book/show/63832.Blue_Highways", "num_ratings": "18,580", "num_reviews": "954", "avg_ratings": 4.0, "genres": ["Nonfiction", "Travel", "Autobiography", "Memoir", "Adventure", "Biography"], "title": "Blue Highways", "description": ["William Least Heat-Moon set out with little more than the need to put home behind him and a sense of curiosity about \"those little towns that get on the map-if they get on at all-only because some cartographer has a blank space to fill: Remote, Oregon;", "William Least Heat-Moon set out with little more than the need to put home behind him and a sense of curiosity about \"those little towns that get on the map-if they get on at all-only because some cartographer has a blank space to fill: Remote, Oregon; Simplicity, Virginia; New Freedom, Pennsylvania; New Hope, Tennessee; Why, Arizona; Whynot, Mississippi.\"", "His adventures, his discoveries, and his recollections of the extraordinary people he encountered along the way amount to a revelation of the true American experience."], "author": "William Least Heat-Moon", "num_pages": "428", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-10-19 00:00:00", "ISBN": "0316353299"},
{"url": "https://www.goodreads.com/book/show/693208.The_Absolutely_True_Diary_of_a_Part_Time_Indian", "num_ratings": "191,231", "num_reviews": "21,153", "avg_ratings": 4.12, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Contemporary", "Humor"], "title": "The Absolutely True Diary of a Part-Time Indian", "description": ["Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolut", "Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolutely True Diary of a Part-Time Indian, which is based on the author's own experiences, coupled with poignant drawings by Ellen Forney that reflect the character's art, chronicles the contemporary adolescence of one Native American boy as he attempts to break away from the life he was destined to live.", "With a forward by Markus Zusak, interviews with Sherman Alexie and Ellen Forney, and four-color interior art throughout, this edition is perfect for fans and collectors alike. "], "author": "Sherman Alexie", "num_pages": "230", "awards": ["National Book Award for Young People's Literature (2007)", "Odyssey Award (2009)", "American Indian Library Association Award", "South Carolina Book Award Nominee for Young Adult Book Award (2010)", "Michigan Library Association Thumbs Up! Award Nominee (2008)", "Florida Teens Read Nominee (2009)", "American Indian Youth Literature Award for Best Young Adult Book (Award Retroactively Rescinded in 2018) (2008)", "Boston Globe-Horn Book Award for Fiction (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2010)", "Lincoln Award Nominee (2011)", "James Cook Book Award Nominee (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["United States of America", "Washington (the state)"], "character_names": ["Arnold \"Junior\" Spirit", "Coach", "Rowdy", "Mary \"Runs Away\" Spirit", "Mr. P", "Agnes Adams / Spirit", "Melinda", "Mr. Grant", "Penelope (divers)", "Micah", "Roger \"The Giant\"", "Grandma Spirit", "Eugene", "Dawn", "Mr. Dodge", "Gordy", "Dad Spirit", "Rowdy's Dad", "Mr. Sheridan", "Earl", "Gerald", "Ted", "Bobby"], "language": "English", "publish_date": "2007-09-12 00:00:00", "ISBN": "0316013684"},
{"url": "https://www.goodreads.com/book/show/15797509-the-inconvenient-indian", "num_ratings": "6,334", "num_reviews": "872", "avg_ratings": 4.12, "genres": ["Nonfiction", "History", "Cultural", "Canada"], "title": "The Inconvenient Indian: A Curious Account of Native People in North America", "description": [" is at once a “history” and the complete subversion of a history—in short, a critical and personal meditation that the remarkable Thomas King has conducted over the past 50 years about what it means to be “Indian” in North America. ", " ", "Rich with dark and light, pain and magic, this book distills the insights gleaned", " is at once a “history” and the complete subversion of a history—in short, a critical and personal meditation that the remarkable Thomas King has conducted over the past 50 years about what it means to be “Indian” in North America. ", " ", "Rich with dark and light, pain and magic, this book distills the insights gleaned from that meditation, weaving the curiously circular tale of the relationship between non-Natives and Natives in the centuries since the two first encountered each other. In the process, King refashions old stories about historical events and figures, takes a sideways look at film and pop culture, relates his own complex experiences with activism, and articulates a deep and revolutionary understanding of the cumulative effects of ever-shifting laws and treaties on Native peoples and lands. ", " ", "This is a book both timeless and timely, burnished with anger but tempered by wit, and ultimately a hard-won offering of hope -- a sometimes inconvenient, but nonetheless indispensable account for all of us, Indian and non-Indian alike, seeking to understand how we might tell a new story for the future."], "author": "Thomas King", "num_pages": "266", "awards": ["Governor General's Literary Awards / Prix littéraires du Gouverneur général for Traduction (2014)", "Canadian Booksellers Association Libris Award for Non‐Fiction Book (2013)", "CBC Canada Reads Nominee (2015)", "British Columbia National Award for Canadian Non-Fiction (2014)", "RBC Taylor Prize (2014)", "Hilary Weston Writers' Trust Prize for Nonfiction Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-13 00:00:00", "ISBN": "0385674058"},
{"url": "https://www.goodreads.com/book/show/52873.The_Lone_Ranger_and_Tonto_Fistfight_in_Heaven", "num_ratings": "21,749", "num_reviews": "1,804", "avg_ratings": 4.09, "genres": ["Fiction", "Short Stories", "Literature", "Humor"], "title": "The Lone Ranger and Tonto Fistfight in Heaven", "description": ["In this darkly comic short story collection, Sherman Alexie, a Spokane/Coeur d'Alene Indian, brilliantly weaves memory, fantasy, and stark realism to paint a complex, grimly ironic portrait of life in and around the Spoke Indian Reservation. These 22 interlinked tales are narrated by characters raised on humiliation and government-issue cheese, and yet are filled with pass", "In this darkly comic short story collection, Sherman Alexie, a Spokane/Coeur d'Alene Indian, brilliantly weaves memory, fantasy, and stark realism to paint a complex, grimly ironic portrait of life in and around the Spoke Indian Reservation. These 22 interlinked tales are narrated by characters raised on humiliation and government-issue cheese, and yet are filled with passion and affection, myth and dream. There is Victor, who as a nine-year-old crawled between his unconscious parents hoping that the alcohol seeping through their skins might help him sleep. Thomas Builds-the-Fire, who tells his stories long after people stop listening, and Jimmy Many Horses, dying of cancer, who writes letters on stationary that reads \"From the Death Bed of James Many Horses III,\" even though he actually writes them on his kitchen table. Against a backdrop of alcohol, car accidents, laughter, and basketball, Alexie depicts the distances between Indians and whites, reservation Indians and urban Indians, men and women, and most poetically, between modern Indians and the traditions of the past."], "author": "Sherman Alexie", "num_pages": "242", "awards": ["PEN/Hemingway Foundation Award Nominee (1993)", "Washington State Book Award (1994)"], "places": ["Washington (the state)"], "character_names": [], "language": "English", "publish_date": "2005-02-08 00:00:00", "ISBN": "0802141676"},
{"url": "https://www.goodreads.com/book/show/21939728-beyond-the-world-of-man", "num_ratings": "145", "num_reviews": "31", "avg_ratings": 4.76, "genres": ["Fantasy", "Adventure", "Young Adult", "Fantasy", "Paranormal", "Fiction", "Fantasy", "Supernatural", "Fantasy", "Mythology"], "title": "Beyond the World of Man", "description": ["This is the third installment in the Dwellers of Ahwahnee series and with the destruction of the world of man, the Dwellers traveled to other worlds and survived for twenty years. ", "With Oria's magic the 'Beyond' has grown and they can now come home. ", "There is a different kind of evil in the world now. Who will survive in the 'Beyond'? This generation ", "of shapeshifters are dif", "This is the third installment in the Dwellers of Ahwahnee series and with the destruction of the world of man, the Dwellers traveled to other worlds and survived for twenty years. ", "With Oria's magic the 'Beyond' has grown and they can now come home. ", "There is a different kind of evil in the world now. Who will survive in the 'Beyond'? This generation ", "of shapeshifters are different and will lead the Dwellers into a new age. ", "Spirit Walker is rebellious and has often been called a Wildcat. She has been sheltered in The Village of Lost Souls for her entire life. Now she is to become the Golden Queen of the Ahwahneechees. ", "Her choices for the future involve adult decisions and with only her mother's journal to guide her, ", "she must rely on the magic within the pages."], "author": "Sheryl Seal", "num_pages": "178", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/21524237-beyond-oria-falls", "num_ratings": "195", "num_reviews": "47", "avg_ratings": 4.75, "genres": ["Young Adult", "Fantasy", "Paranormal", "Fantasy", "Supernatural", "Paranormal", "Shapeshifters", "Fantasy", "Mythology"], "title": "Beyond Oria Falls", "description": ["Oria is the Golden Queen of the Ahwahneechees and a Dweller of Ahwahnee. Together with her friends she travels back to find out why the village of lost souls cannot find their way home to the West. The Ala is back in this second book full of action packed magic and shapeshifting. Will Oria finally find love and happiness with Grey Wolf or will a new evil threaten her magic", "Oria is the Golden Queen of the Ahwahneechees and a Dweller of Ahwahnee. Together with her friends she travels back to find out why the village of lost souls cannot find their way home to the West. The Ala is back in this second book full of action packed magic and shapeshifting. Will Oria finally find love and happiness with Grey Wolf or will a new evil threaten her magical world Beyond Oria Falls? Join the Dwellers as they try to keep evil out of the world of man."], "author": "Sheryl Seal", "num_pages": "303", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/21410220-beyond-bridalveil-fall", "num_ratings": "267", "num_reviews": "70", "avg_ratings": 4.04, "genres": ["Fantasy", "Fantasy", "Paranormal", "Young Adult", "Adventure", "Fantasy", "Supernatural", "Paranormal", "Shapeshifters"], "title": "Beyond Bridalveil Fall", "description": ["Oria is celebrating her eighteenth birthday in Yosemite Naltional Park when she goes into the pool at the bottom of Bridaleveil Fall, only to come out beyond it.", "In another world she learns she is The Golden Queen fairy of the Ahwahneechee tribe, and that she is a shapeshifter. Here the Dwellers of Ahwahnee fight the Evil that tries to get into the world of man. Will she fi", "Oria is celebrating her eighteenth birthday in Yosemite Naltional Park when she goes into the pool at the bottom of Bridaleveil Fall, only to come out beyond it.", "In another world she learns she is The Golden Queen fairy of the Ahwahneechee tribe, and that she is a shapeshifter. Here the Dwellers of Ahwahnee fight the Evil that tries to get into the world of man. Will she find her soul mate in Grey Wolf or is he more than he appears to be? One thing is for sure, with all the magic and shape shifting happening, only the all knowing grandfather can guide her through the Evil Beyond Bridalveil Fall."], "author": "Sheryl Seal", "num_pages": "379", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-03 00:00:00"}
]