[
{"url": "https://www.goodreads.com/book/show/17313660-nevada", "num_ratings": "2,355", "num_reviews": "362", "avg_ratings": 4.06, "genres": ["Fiction", "Glbt", "Queer", "Lgbt", "Lgbt", "Transgender", "Contemporary"], "title": "Nevada", "description": ["Nevada is the darkly comedic story of Maria Griffiths, a young trans woman living in New York City and trying to stay true to her punk values while working retail. When she finds out her girlfriend has lied to her, the world she thought she'd carefully built for herself begins to unravel, and Maria sets out on a journey that will most certainly change her forever."], "author": "Imogen Binnie", "num_pages": "262", "awards": ["Lambda Literary Award Nominee for Transgender Fiction (2014)", "MOTHA Award for Books/Publications of the Year (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-02 00:00:00", "ISBN": "0983242232"},
{"url": "https://www.goodreads.com/book/show/25723022-improvise-girl-improvise", "num_ratings": "37", "num_reviews": "4", "avg_ratings": 4.43, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Transgender"], "title": "Improvise, Girl, Improvise", "description": ["“Even without the preferred methods, one must survive,” swears Lovedog, one of the incandescent stars in Lilith Latini’s constellation of trans heroines. But these women are far from satisfied with mere survival.", "Whether fooling around with boys, dancing till sunrise, or just putting together a really bioluminescent outfit, they are sharply funny, audaciously poised, and re", "“Even without the preferred methods, one must survive,” swears Lovedog, one of the incandescent stars in Lilith Latini’s constellation of trans heroines. But these women are far from satisfied with mere survival.", "Whether fooling around with boys, dancing till sunrise, or just putting together a really bioluminescent outfit, they are sharply funny, audaciously poised, and recklessly honest. A body would hardly know they are only ever a stumble from disaster"], "author": "Lilith Latini", "num_pages": "56", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-02 00:00:00", "ISBN": "1627290125"},
{"url": "https://www.goodreads.com/book/show/28818619-even-this-page-is-white", "num_ratings": "891", "num_reviews": "157", "avg_ratings": 4.2, "genres": ["Poetry", "Glbt", "Queer", "Cultural", "Canada", "Nonfiction", "Race", "Lgbt"], "title": "Even this Page is White", "description": ["Vivek's debut collection of poetry is a bold and timely interrogation of skin: its origins, functions, and limitations. Poems that range in style from starkly concrete to limber break down the barriers that prevent understanding of what it means to be racialized. Shraya paints the face of everyday racism with words, rendering it visible, tangible, and undeniable."], "author": "Vivek Shraya", "num_pages": "116", "awards": ["Goodreads Choice Award Nominee for Poetry (2016)", "The Publishing Triangle Award for Trans and Gender-Variant Literature (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-13 00:00:00", "ISBN": "1551526417"},
{"url": "https://www.goodreads.com/book/show/15858701-my-new-gender-workbook", "num_ratings": "264", "num_reviews": "29", "avg_ratings": 3.77, "genres": ["Nonfiction", "Gender", "Glbt", "Queer", "Lgbt", "Lgbt", "Transgender", "Gender", "Gender Studies"], "title": "My New Gender Workbook: A Step-by-Step Guide to Achieving World Peace Through Gender Anarchy and Sex Positivity", "description": ["Cultural theorists have written loads of smart but difficult-to-fathom texts on gender theory, but most fail to provide a hands-on, accessible guide for those trying to sort out their own sexual identities. In ", ", transgender activist Kate Bornstein brings theory down to Earth and provides a practical approach to living ", " or ", " a gender.", "Bornstein st", "Cultural theorists have written loads of smart but difficult-to-fathom texts on gender theory, but most fail to provide a hands-on, accessible guide for those trying to sort out their own sexual identities. In ", ", transgender activist Kate Bornstein brings theory down to Earth and provides a practical approach to living ", " or ", " a gender.", "Bornstein starts from the premise that there are not just two genders performed in today's world, but countless genders lumped under the two-gender framework. Using a unique, deceptively simple and always entertaining workbook format, complete with quizzes, exercises, and puzzles, Bornstein gently but firmly guides readers toward discovering their own unique gender identity.", "Since its first publication in 1997, ", " has been challenging, encouraging, questioning, and helping those trying to figure out how to become a \"real man,\" a \"real woman,\" or \"something else entirely.\" In this exciting new edition of her classic text, Bornstein re-examines gender in light of issues like race, class, sexuality, and language. With new quizzes, new puzzles, new exercises, and plenty of Kate's playful and provocative style, ", " promises to help a new generation create their own unique place on the gender spectrum."], "author": "Kate Bornstein", "num_pages": "293", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-17 00:00:00", "ISBN": "0415538653"},
{"url": "https://www.goodreads.com/book/show/823882.Becoming_a_Visible_Man", "num_ratings": "644", "num_reviews": "53", "avg_ratings": 3.99, "genres": ["Gender", "Lgbt", "Transgender", "Nonfiction", "Glbt", "Queer", "Lgbt", "Autobiography", "Memoir"], "title": "Becoming a Visible Man", "description": ["Written by a leading activist in the transgender movement, ", " is an artful and compelling inquiry into the politics of gender. Jamison Green combines candid autobiography with informed analysis to offer unique insight into th", "Written by a leading activist in the transgender movement, ", " is an artful and compelling inquiry into the politics of gender. Jamison Green combines candid autobiography with informed analysis to offer unique insight into the multiple challenges of the female-to-male transsexual experience, ranging from encounters with prejudice and strained relationships with family to the development of an FTM community and the realities of surgical sex reassignment.", "For more than a decade, Green has provided educational programs on gender-variance issues for corporations, law-enforcement agencies, social-science conferences and classes, continuing legal education, religious education, and medical venues. His comprehensive knowledge of the processes and problems encountered by transgendered and transsexual people--as well as his legal advocacy work to help ensure that gender-variant people have access to the same rights and opportunities as others--enable him to explain the issues as no transsexual author has previously done.", "Brimming with frank and often poignant recollections of Green's own experiences--including his childhood struggles with identity and his years as a lesbian parent prior to his sex-reassignment surgery--the book examines transsexualism as a human condition, and sex reassignment as one of the choices that some people feel compelled to make in order to manage their gender variance. Relating the FTM psyche and experience to the social and political forces at work in American society, ", " also speaks consciously of universal principles that concern us all, particularly the need to live one's life honestly, openly, and passionately."], "author": "Jamison Green", "num_pages": "231", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-04 00:00:00", "ISBN": "082651457X"},
{"url": "https://www.goodreads.com/book/show/31668044-infect-your-friends-and-loved-ones", "num_ratings": "74", "num_reviews": "13", "avg_ratings": 4.55, "genres": ["Glbt", "Queer", "Fiction", "Lgbt", "Lgbt", "Transgender", "Science Fiction", "Gender"], "title": "Infect Your Friends and Loved Ones", "description": ["In the future, everyone will be trans. So says Lexi. She's a charismatic trans woman furious with the way she sees her trans friends treated by society and resentful of the girl who spurned her love. Now, Lexi has a plan to wreak her vengeance: a future in which no one can produce hormones and everyone must make the same choice that she made-what body best fits your gender", "In the future, everyone will be trans. So says Lexi. She's a charismatic trans woman furious with the way she sees her trans friends treated by society and resentful of the girl who spurned her love. Now, Lexi has a plan to wreak her vengeance: a future in which no one can produce hormones and everyone must make the same choice that she made-what body best fits your gender? FOR SIGNED AND NUMBERED VERSION, CHECK "], "author": "Torrey Peters", "num_pages": "76", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-12 00:00:00", "ISBN": "1537065092"},
{"url": "https://www.goodreads.com/book/show/16073046-bi", "num_ratings": "516", "num_reviews": "77", "avg_ratings": 3.78, "genres": ["Nonfiction", "Glbt", "Queer", "Lgbt", "Feminism", "Sexuality"], "title": "Bi: Notes for a Bisexual Revolution", "description": ["Depicted as duplicitous, traitorous, and promiscuous, bisexuality has long been suspected, marginalized, and rejected by both straight and gay communities alike.", " takes a long overdue, comprehensive look at bisexual politics—from the issues surrounding biphobia/monosexism, feminism, and transgenderism to the practice of labeling those who identify as bi as either \"too bis", "Depicted as duplicitous, traitorous, and promiscuous, bisexuality has long been suspected, marginalized, and rejected by both straight and gay communities alike.", " takes a long overdue, comprehensive look at bisexual politics—from the issues surrounding biphobia/monosexism, feminism, and transgenderism to the practice of labeling those who identify as bi as either \"too bisexual” (promiscuous and incapable of fidelity) or \"not bisexual enough” (not actively engaging romantically or sexually with people of at least two different genders). In this forward-thinking and eye-opening book, feminist bisexual and genderqueer activist Shiri Eisner takes readers on a journey through the many aspects of the meanings and politics of bisexuality, specifically highlighting how bisexuality can open up new and exciting ways of challenging social convention.", "Informed by feminist, transgender, and queer theory, as well as politics and activism, ", " is a radical manifesto for a group that has been too frequently silenced, erased, and denied—and a starting point from which to launch a bisexual revolution."], "author": "Shiri Eisner", "num_pages": "352", "awards": ["Lambda Literary Award Nominee for Bisexual Nonfiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-02 00:00:00", "ISBN": "1580054749"},
{"url": "https://www.goodreads.com/book/show/553103.Conundrum", "num_ratings": "631", "num_reviews": "84", "avg_ratings": 3.83, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Gender", "Glbt", "Queer", "Lgbt"], "title": "Conundrum", "description": ["The great travel writer Jan Morris was born James Morris. James Morris distinguished himself in the British military, became a successful and physically daring reporter, climbed mountains, crossed deserts, and established a reputation as a historian of the British empire. He was happily married, with several children. To all appearances, he was not only a man, but a man’s", "The great travel writer Jan Morris was born James Morris. James Morris distinguished himself in the British military, became a successful and physically daring reporter, climbed mountains, crossed deserts, and established a reputation as a historian of the British empire. He was happily married, with several children. To all appearances, he was not only a man, but a man’s man.", "Except that appearances, as James Morris had known from early childhood, can be deeply misleading. James Morris had known all his conscious life that at heart he was a woman.", "one of the earliest books to discuss transsexuality with honesty and without prurience, tells the story of James Morris’s hidden life and how he decided to bring it into the open, as he resolved first on a hormone treatment and, second, on risky experimental surgery that would turn him into the woman that he truly was."], "author": "Jan Morris", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-16 00:00:00", "ISBN": "1590171896"},
{"url": "https://www.goodreads.com/book/show/7286455-she-s-my-dad", "num_ratings": "85", "num_reviews": "34", "avg_ratings": 4.06, "genres": ["Lgbt", "Fiction", "Lgbt", "Transgender", "Young Adult", "Glbt", "Queer"], "title": "She's My Dad", "description": ["For decades, ultra-liberal Windfield College has been a thorn in the side of Northern Virginia's hidebound elite. When a teaching position unexpectedly becomes available, the school hires a former male graduate - now a transsexual woman named Nickie Farrell - as an assistant professor of English.", "For decades, ultra-liberal Windfield College has been a thorn in the side of Northern Virginia's hidebound elite. When a teaching position unexpectedly becomes available, the school hires a former male graduate - now a transsexual woman named Nickie Farrell - as an assistant professor of English. Hoping to find peace, Nickie keeps her secret under wraps until ambitious lesbian student reporter Cinda Vanderhart outs her. And Cinda has noticed something else: both Nickie and a young townie waiter named Collie Skinner have a genetic quirk which causes their eyes to be different colors. Convinced that the similarity is no coincidence, Cinda begins an investigation to discover the connection between them. ", "Meanwhile, in a death-bed confession as she succumbs to years of brutality at the hands of her disgraced cop husband, Collie's mother Luanne reveals that his birth resulted from an illicit affair she had with a long-vanished Windfield college senior named Nick Farrington. Shattered by his mother's death, Collie turns for comfort to Robin Thompson, a gentle-hearted Christian co-worker at the upper-crust Foxton Arms restaurant. As Nickie is stalked by a pair of homicidal sociopaths, Robin finds herself entangled not only in Cinda's investigative machinations but also a murderous plot by former U.S Ambassador and tycoon Eamon Douglass to eradicate the hated college with a suicide detonation of a Cesium 137 dirty bomb. Lives and secrets hang in the balance until everything comes to a head on the morning of Windfield's annual spring picnic: April Fools Day. ", "Filled with richly-drawn characters and building to a stunning climax, SHE'S MY DAD is a story about the destructiveness of hate, the power of love, and the redemptive triumph of good over evil. ", "Like her title character Nickie Farrell, Iolanthe Woulff is a transsexual woman. A fifty-nine-year-old Princeton-educated English major, she lives in Palm Springs, CA, where for several years she wrote a column in a local magazine about the challenges of gender transition. As the eldest child of author Herman Wouk, storytelling has always been dear to Ms. Woulff's heart. Her hope is that besides providing a suspenseful read, SHE'S MY DAD will help to dispel some of the widespread misconceptions about transsexual people."], "author": "Iolanthe Woulff", "num_pages": "470", "awards": ["Next Generation Indie Book Awards Nominee for GLBT (Gay/Lesbian/Bisexual/Transgender) (2010)", "Feathered Quill Book Award for Best of Backlist (3rd) (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-11-13 00:00:00", "ISBN": "1432743775"},
{"url": "https://www.goodreads.com/book/show/13592250-first-spring-grass-fire", "num_ratings": "285", "num_reviews": "38", "avg_ratings": 4.0, "genres": ["Glbt", "Queer", "Lgbt", "Transgender", "Autobiography", "Memoir", "Nonfiction", "Lgbt", "Gender", "Biography"], "title": "First Spring Grass Fire", "description": ["Transgender indie electronica singer-songwriter Rae Spoon has six albums to their credit, including 2012’s ", ". This first book by Rae (who uses \"they\" as a pronoun) is a candid, powerful story about a young person growing up queer in a strict Pentecostal family in rural Canada.", "The narrator attends church events and Billy Graham rallies faithful", "Transgender indie electronica singer-songwriter Rae Spoon has six albums to their credit, including 2012’s ", ". This first book by Rae (who uses \"they\" as a pronoun) is a candid, powerful story about a young person growing up queer in a strict Pentecostal family in rural Canada.", "The narrator attends church events and Billy Graham rallies faithfully with their family before discovering the music that becomes their salvation and means of escape. As their father's schizophrenia causes their parents' marriage to unravel, the narrator finds solace and safety in the company of their siblings, in their nascent feelings for a girl at school, and in their growing awareness that they are not the person their parents think they are. With a heart as big as the prairie sky, this is a quietly devastating, heart-wrenching coming-of-age book about escaping dogma, surviving abuse, finding love, and risking everything for acceptance.", " lives in Montreal, Quebec."], "author": "Rae Spoon", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-18 00:00:00", "ISBN": "1551524805"},
{"url": "https://www.goodreads.com/book/show/23129755-lost-boi", "num_ratings": "407", "num_reviews": "103", "avg_ratings": 3.67, "genres": ["Glbt", "Queer", "Fiction", "Lgbt", "Fantasy", "Retellings", "Lgbt", "Transgender"], "title": "Lost Boi", "description": ["In Sassafras Lowrey's gorgeous queer punk reimagining of the classic ", " story, prepare to be swept overboard into a world of orphaned, abandoned, and runaway bois who have sworn allegiance and service to Pan, the fearless leader of the Lost Bois brigade and the newly corrupted Mommy Wendi who, along with the tomboy John Michael, Pan con", "In Sassafras Lowrey's gorgeous queer punk reimagining of the classic ", " story, prepare to be swept overboard into a world of orphaned, abandoned, and runaway bois who have sworn allegiance and service to Pan, the fearless leader of the Lost Bois brigade and the newly corrupted Mommy Wendi who, along with the tomboy John Michael, Pan convinces to join him at Neverland.", "Told from the point of view of Tootles, Pan's best boi, the lost bois call the Neverland squat home, creating their own idea of family, and united in their allegiance to Pan, the boi who cannot be broken, and their refusal to join ranks with Hook and the leather pirates. Like a fever-pitched dream, ", " situates a children's fantasy within a subversive alternative reality, chronicling the lost bois' search for belonging, purpose, and their struggle against the biggest battle of all: growing up."], "author": "Sassafras Lowrey", "num_pages": "233", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-28 00:00:00", "ISBN": "155152581X"},
{"url": "https://www.goodreads.com/book/show/34750876-meanwhile-elsewhere", "num_ratings": "87", "num_reviews": "21", "avg_ratings": 4.38, "genres": ["Fantasy", "Short Stories", "Fiction", "Science Fiction", "Glbt", "Queer", "Lgbt"], "title": "Meanwhile, Elsewhere: Science Fiction and Fantasy from Transgender Writers", "description": ["Brand new from Topside Press, twenty-five transgender writers imagine different worlds in Meanwhile, Elsewhere: Science Fiction & Fantasy from Transgender Writers.", "The #1 post-reality generation device approved for home use! This manual will prepare you to travel from multiverse to multiverse. No experience is required. Choose from twenty-five preset post-realities! Rej", "Brand new from Topside Press, twenty-five transgender writers imagine different worlds in Meanwhile, Elsewhere: Science Fiction & Fantasy from Transgender Writers.", "The #1 post-reality generation device approved for home use! This manual will prepare you to travel from multiverse to multiverse. No experience is required. Choose from twenty-five preset post-realities! Rejoice at obstacles unquestionably bested and conflicts efficiently resolved. Bring denouement to your drama with THE FOOLPROOF AUGMENTATION DEVICE FOR OUR CONTEMPORARY UTOPIA."], "author": "Cat Fitzpatrick", "num_pages": "447", "awards": ["Stonewall Book Award for Literature (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-05 00:00:00", "ISBN": "1627290184"},
{"url": "https://www.goodreads.com/book/show/32279708-fierce-femmes-and-notorious-liars", "num_ratings": "303", "num_reviews": "60", "avg_ratings": 4.61, "genres": ["Glbt", "Queer", "Lgbt", "Fiction", "Lgbt", "Transgender", "Cultural", "Canada"], "title": "Fierce Femmes and Notorious Liars: A Dangerous Trans Girl’s Confabulous Memoir", "description": [" by Kai Cheng Thom is the highly sensational, ultra-exciting, sort-of true coming-of-age story of a young Asian trans girl, pathological liar, and kung-fu expert who runs away from her parents’ abusive home in a rainy city called Gloom. Striking off on her own, she finds her true family in a grou", " by Kai Cheng Thom is the highly sensational, ultra-exciting, sort-of true coming-of-age story of a young Asian trans girl, pathological liar, and kung-fu expert who runs away from her parents’ abusive home in a rainy city called Gloom. Striking off on her own, she finds her true family in a group of larger-than-life trans femmes who live in a mysterious pleasure district known only as the Street of Miracles. Under the wings of this fierce and fabulous flock, Dearly blossoms into the woman she has always dreamed of being, with a little help from the unscrupulous Doctor Crocodile. When one of their number is brutally murdered, the protagonist joins her sisters in forming a vigilante gang to fight back against the transphobes, violent johns, and cops that stalk the Street of Miracles. But when things go terribly wrong, she must find the truth within herself in order to stop the violence and discover what it really means to grow up and find your family."], "author": "Kai Cheng Thom", "num_pages": "188", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-11-16 00:00:00", "ISBN": "0994047134"},
{"url": "https://www.goodreads.com/book/show/32146161-coffee-boy", "num_ratings": "1,020", "num_reviews": "309", "avg_ratings": 3.85, "genres": ["Romance", "Contemporary", "Lgbt", "Romance", "M M Romance", "New Adult", "Lgbt", "Transgender", "Glbt", "Queer"], "title": "Coffee Boy", "description": ["After graduation, Kieran expected to go straight into a career of flipping burgers—only to be offered the internship of his dreams at a political campaign. But the pressure of being an out trans man in the workplace quickly sucks the joy out of things, as does Seth, the humorless campaign strategist who watches his every move.", "Soon, the only upside to the job is that Seth h", "After graduation, Kieran expected to go straight into a career of flipping burgers—only to be offered the internship of his dreams at a political campaign. But the pressure of being an out trans man in the workplace quickly sucks the joy out of things, as does Seth, the humorless campaign strategist who watches his every move.", "Soon, the only upside to the job is that Seth has a painful crush on their painfully straight boss, and Kieran has a front row seat to the drama. But when Seth proves to be as respectful and supportive as he is prickly, Kieran develops an awkward crush of his own—one which Seth is far too prim and proper to ever reciprocate."], "author": "Austin Chant", "num_pages": "61", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16098221-transposes", "num_ratings": "176", "num_reviews": "28", "avg_ratings": 4.08, "genres": ["Sequential Art", "Graphic Novels", "Glbt", "Queer", "Sequential Art", "Comics", "Lgbt", "Lgbt", "Transgender", "Nonfiction"], "title": "Transposes", "description": ["Dylan Edwards’ Transposes separates gender from sexuality and illustrates six fascinating true stories of transgender men who also happen to be queer. The result is laugh-out-loud funny, heartbreaking, challenging, inventive, informative, and invites the reader to explore what truly makes a man a man.", "Includes a foreword by New York Times bestselling author Alison Bechdel (", "Dylan Edwards’ Transposes separates gender from sexuality and illustrates six fascinating true stories of transgender men who also happen to be queer. The result is laugh-out-loud funny, heartbreaking, challenging, inventive, informative, and invites the reader to explore what truly makes a man a man.", "Includes a foreword by New York Times bestselling author Alison Bechdel (Fun Home, Are You My Mother?)"], "author": "Dylan  Edwards", "num_pages": "115", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-16 00:00:00", "ISBN": "0984594086"},
{"url": "https://www.goodreads.com/book/show/6598809-the-nearest-exit-may-be-behind-you", "num_ratings": "847", "num_reviews": "62", "avg_ratings": 3.97, "genres": ["Glbt", "Queer", "Nonfiction", "Lgbt", "Writing", "Essays", "Lgbt", "Transgender", "Gender"], "title": "The Nearest Exit May Be Behind You", "description": ["Alternately unsettling and affirming, devastating and delicious, ", " is a new collection of essays on gender and identity by S. Bear Bergman that is irrevocably honest and endlessly illuminating. With humor and grace, these essays deal with issues from women's spaces to the old boys' network, from gay male bathhouses to lesbian potlucks, from", "Alternately unsettling and affirming, devastating and delicious, ", " is a new collection of essays on gender and identity by S. Bear Bergman that is irrevocably honest and endlessly illuminating. With humor and grace, these essays deal with issues from women's spaces to the old boys' network, from gay male bathhouses to lesbian potlucks, from being a child to preparing to have one. Throughout, S. Bear Bergman shows us there are things you learn when you're visibly different from those around you—whether it's being transgressively gendered or readably queer. As a transmasculine person, Bergman keeps readers breathless and rapt in the freakshow tent long after the midway has gone dark, when the good hooch gets passed around and the best stories get told. Ze offers unique perspectives on issues that challenge, complicate, and confound the \"official stories\" about how gender and sexuality work."], "author": "S. Bear Bergman", "num_pages": "192", "awards": ["Lambda Literary Award Nominee for Transgender (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "1551522640"},
{"url": "https://www.goodreads.com/book/show/28698224-being-jazz", "num_ratings": "2,677", "num_reviews": "512", "avg_ratings": 3.9, "genres": ["Nonfiction", "Autobiography", "Memoir", "Lgbt"], "title": "Being Jazz: My Life as a (Transgender) Teen", "description": ["Jazz Jennings is one of the youngest and most prominent voices in the national discussion about gender identity. At the age of five, Jazz transitioned to life as a girl, with the support of her parents. A year later, her parents allowed her to share her incredible journey in her first Barbara Walters interview, aired at a time when the public was much less knowledgeable or", "Jazz Jennings is one of the youngest and most prominent voices in the national discussion about gender identity. At the age of five, Jazz transitioned to life as a girl, with the support of her parents. A year later, her parents allowed her to share her incredible journey in her first Barbara Walters interview, aired at a time when the public was much less knowledgeable or accepting of the transgender community. This groundbreaking interview was followed over the years by other high-profile interviews, a documentary, the launch of her YouTube channel, a picture book, and her own reality TV series—I Am Jazz—making her one of the most recognizable activists for transgender teens, children, and adults.", "In her remarkable memoir, Jazz reflects on these very public experiences and how they have helped shape the mainstream attitude toward the transgender community. But it hasn’t all been easy. Jazz has faced many challenges, bullying, discrimination, and rejection, yet she perseveres as she educates others about her life as a transgender teen. Through it all, her family has been beside her on this journey, standing together against those who don't understand the true meaning of tolerance and unconditional love. Now Jazz must learn to navigate the physical, social, and emotional upheavals of adolescence—particularly high school—complicated by the unique challenges of being a transgender teen. Making the journey from girl to woman is never easy—especially when you began your life in a boy’s body."], "author": "Jazz Jennings", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-06-07 00:00:00", "ISBN": "0735207445"},
{"url": "https://www.goodreads.com/book/show/32041560-when-the-chant-comes", "num_ratings": "38", "num_reviews": "6", "avg_ratings": 4.66, "genres": ["Poetry", "Lgbt", "Disability"], "title": "When the Chant Comes", "description": ["Kay Ulanday Barrett has been bringing his unique poetry to audiences for over a decade, unpicking vital political questions around race, sickness and disability and gender, and chronicling the everydayness of life in the U.S. Empire with humor, poignancy and inimitable vitality. Now at last a generous selection of his work will be available in print. Each of these poems is", "Kay Ulanday Barrett has been bringing his unique poetry to audiences for over a decade, unpicking vital political questions around race, sickness and disability and gender, and chronicling the everydayness of life in the U.S. Empire with humor, poignancy and inimitable vitality. Now at last a generous selection of his work will be available in print. Each of these poems is a brilliant little story. Taken together, they show a master craftsman at the top of his game. Pre-order them now."], "author": "Kay Ulanday Barrett", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-01 00:00:00", "ISBN": "162729015X"},
{"url": "https://www.goodreads.com/book/show/11154613-i-rise---the-transformation-of-toni-newman", "num_ratings": "22", "num_reviews": "1", "avg_ratings": 3.73, "genres": ["Autobiography", "Memoir", "Nonfiction", "Glbt", "Queer", "Lgbt", "Lgbt", "Transgender", "Social Movements", "Social Justice", "Feminism"], "title": "I Rise - The Transformation of Toni Newman", "description": ["I’ve always found it interesting that someone had to throw Jackie Robinson the ball for there to be a Jackie Robinson. Give talent and passion the right team to play on, and, as they say, the rest is history. In no less a historical spotlight, I am proud to present you with I Rise – The Transformation of Toni Newman, the first memoir written in America by a member of the A", "I’ve always found it interesting that someone had to throw Jackie Robinson the ball for there to be a Jackie Robinson. Give talent and passion the right team to play on, and, as they say, the rest is history. In no less a historical spotlight, I am proud to present you with I Rise – The Transformation of Toni Newman, the first memoir written in America by a member of the African American transgender community. It is gut-wrenchingly honest, factually supported, and well written. Dr. Marc Weiss Ph.D., Former Associate Professor of Urban Development, Planning, and Preservation at Columbia University wrote the foreword to this memoir, is a best-selling author, and a former member of the Clinton administration. I Rise is the true story of Toni Newman’s transformation from an internally conflicted male to a proud, pre-operative transsexual. Born the eldest son into a strict Christian family, Toni admits knowing from her earliest days that she “was a different bird born in the wrong body.” With laser-guided sincerity, curiosity, and above all, humor and compassion, Toni tells her story of being a “sissy boy,” a scholarship student, a business professional, an escort, a drag queen, a NYC prostitute, an LA dominatrix, and finally, a transsexual attending law school in order to help her transsexual sisters in need. From cross-dressing and Bible Study classes in Jacksonville, North Carolina, to writing and studying while tending to the fetish fantasies of Hollywood’s A-list, I Rise is far from a tale of fitting in. It is instead a unique and mesmerizing study of finding oneself in a world where gender and beauty can be hard fought for and earned. And Toni Newman, more than anyone else I know, deserves to be proud of her identity. Through the complete loss of friends, family support, employment and shelter, Toni was never deterred from seeking the path that was right for her. When a minority community so stricken by drug abuse, sexual exploitation, explosive suicide rates, and lack of education, has a voice rise out of it as courageous and profound as Toni Newman’s, you do everything you can to make sure it’s a home run heard the world over."], "author": "Toni Newman", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-14 00:00:00", "ISBN": "1461007097"},
{"url": "https://www.goodreads.com/book/show/20759526-some-assembly-required", "num_ratings": "1,822", "num_reviews": "267", "avg_ratings": 3.96, "genres": ["Nonfiction", "Autobiography", "Memoir", "Lgbt"], "title": "Some Assembly Required: The Not-So-Secret Life of a Transgender Teen", "description": ["Seventeen-year-old Arin Andrews shares all the hilarious, painful, and poignant details of undergoing gender reassignment as a high school student in this winning memoir. We've all felt uncomfortable in our own skin at some point, and we've all been told that it's just a part of growing up. But for Arin Andrews, it wasn't a phase that would pass. He had been born in the bo", "Seventeen-year-old Arin Andrews shares all the hilarious, painful, and poignant details of undergoing gender reassignment as a high school student in this winning memoir. We've all felt uncomfortable in our own skin at some point, and we've all been told that it's just a part of growing up. But for Arin Andrews, it wasn't a phase that would pass. He had been born in the body of a girl and there seemed to be no relief in sight. In this revolutionary memoir, Arin details the journey that led him to make the life-transforming decision to undergo gender reassignment as a high school junior. In his captivatingly witty, honest voice, Arin reveals the challenges he faced as a girl, the humiliation and anger he felt after getting kicked out of his private school, and all the changes, both mental and physical, he experienced once his transition began. Arin also writes about the thrill of meeting and dating a young transgender woman named Katie Hill and the heartache that followed after they broke up. ", " is a true coming-of-age story about knocking down obstacles and embracing family, friendship, and first love. But more than that, it is a reminder that self-acceptance does not come ready-made with a manual and spare parts. Rather, some assembly is always required."], "author": "Arin Andrews", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-30 00:00:00", "ISBN": "1481416758"},
{"url": "https://www.goodreads.com/book/show/23857998-the-shape-of-my-name", "num_ratings": "140", "num_reviews": "28", "avg_ratings": 3.9, "genres": ["Short Stories", "Science Fiction", "Science Fiction", "Time Travel", "Lgbt", "Speculative Fiction"], "title": "The Shape of My Name", "description": ["The Shape of My Name by Nino Cipri is a time travel story about what it means to truly claim yourself."], "author": "Nino Cipri", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-04 00:00:00", "ISBN": "1466886307"},
{"url": "https://www.goodreads.com/book/show/23459908-long-macchiatos-and-monsters", "num_ratings": "122", "num_reviews": "53", "avg_ratings": 3.83, "genres": ["Lgbt", "Romance", "Glbt", "Queer", "Lgbt", "Transgender", "Disability", "Short Stories"], "title": "Long Macchiatos and Monsters", "description": ["Jalen, lover of B-grade sci-fi movies, meets the far-too-handsome P in a cafe while deciding whether or not to skip uni again. When P invites them along to a double feature of Robot Monster and Cat Women of the Moon, Jalen can hardly believe that hot boys like bad sci-fi, too. But as their relationship progresses, Jalen realizes P leaves him wondering if they're on the sam", "Jalen, lover of B-grade sci-fi movies, meets the far-too-handsome P in a cafe while deciding whether or not to skip uni again. When P invites them along to a double feature of Robot Monster and Cat Women of the Moon, Jalen can hardly believe that hot boys like bad sci-fi, too. But as their relationship progresses, Jalen realizes P leaves him wondering if they're on the same page about what dating means, and if that's what they're doing."], "author": "Alison   Evans", "num_pages": "44", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/31145748-documenting-light", "num_ratings": "86", "num_reviews": "41", "avg_ratings": 4.02, "genres": ["Romance", "Contemporary", "Lgbt", "Transgender", "Lgbt", "Glbt", "Queer", "Adult", "Queer", "Queer Lit"], "title": "Documenting Light", "description": ["When Wyatt brings an unidentified photograph to the local historical society, he hopes staff historian Grayson will tell him more about the people in the picture. The subjects in the mysterious photograph sit side by side, their hands close but", "When Wyatt brings an unidentified photograph to the local historical society, he hopes staff historian Grayson will tell him more about the people in the picture. The subjects in the mysterious photograph sit side by side, their hands close but not touching. One is dark, the other fair. Both wear men’s suits.", "Were they friends? Lovers? Business partners? Curiosity drives Grayson and Wyatt to dig deep for information, and the more they learn, the more they begin to wonder — about the photograph, and about themselves.", "Grayson has lost his way. He misses the family and friends who anchored him before his transition and the confidence that drove him as a high-achieving graduate student. Wyatt lives in a similar limbo, caring for an ill mother, worrying about money, unsure how and when he might be able to express his nonbinary gender publicly. The growing attraction between Wyatt and Grayson is terrifying — and incredibly exciting.", "As Grayson and Wyatt discover the power of love to provide them with safety and comfort in the present, they find new ways to write the unwritten history of their own lives and the lives of people like them. With sympathy and cutting insight, Ottoman offers a ", " exploration of contemporary trans identity."], "author": "E.E. Ottoman", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/408990.Both_Sides_Now", "num_ratings": "90", "num_reviews": "15", "avg_ratings": 3.74, "genres": ["Biography", "Lgbt", "Lgbt", "Transgender", "Nonfiction", "Autobiography", "Memoir"], "title": "Both Sides Now: One Man's Journey Through Womanhood", "description": ["The courageous and heart-wrenching story of a man's decision to risk it all to be true to himself. ", " Imagine waking up one morning in the wrong body-and that body is the wrong gender. What would you do? Would you experience the world differently? Would your politics change? Would you just accept that this was how you were destined to live out the rest of your life? Or would", "The courageous and heart-wrenching story of a man's decision to risk it all to be true to himself. ", " Imagine waking up one morning in the wrong body-and that body is the wrong gender. What would you do? Would you experience the world differently? Would your politics change? Would you just accept that this was how you were destined to live out the rest of your life? Or would you fight with every ounce of strength you have to find your way back home- to the body that is familiar and comfortable, to the person you know yourself to be? ", " is a vivid and compelling account of how one man's search for wholeness led him through multiple, complex, and life-threatening surgeries that transformed him not only physically but emotionally and spiritually as well. Born with the body of a female, Dhillon Khosla never felt fully at ease in his own skin. He knew very early on that his true identity was male, but spent nearly twenty years repressing this knowledge and trying to embrace his female form. Shortly after turning twenty-eight, he came across an article about men who were born with female bodies and had undergone surgeries to reclaim their male identity. As soon as he began reading their stories, Dhillon felt flashes of recognition stirring within and-for the first time-hope. ", " In this spellbinding memoir, Dhillon discusses openly and honestly what it has been like to live first as a woman and now as a man. Through anecdotes from his work in the courthouse, and his experiences on dates, in bars, and at strip clubs, he shares unique and profound insights into the sexes and our social mores. He also shows us that experiencing life as both genders leads to the understanding that the spiritual consequences of our actions are far more important than the political ones. But ultimately, Both Sides Now is a story about what it truly means to love oneself: the willingness to endure numerous trials and tribulations to be true to your inner voice, even in the face of extreme adversity, and no matter what the cost."], "author": "Dhillon Khosla", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-03-16 00:00:00", "ISBN": "1585424722"},
{"url": "https://www.goodreads.com/book/show/13608556-second-son", "num_ratings": "129", "num_reviews": "11", "avg_ratings": 4.27, "genres": ["Lgbt", "Transgender", "Lgbt", "Glbt", "Queer", "Autobiography", "Memoir", "Nonfiction"], "title": "Second Son:  Transitioning Toward My Destiny, Love and Life", "description": ["Second Son is a story that intimately explores the transition experience of Ryan Salllans, born Kimberly Ann Sallans. The reader is pulled through Ryan's transition from infant to child, child to body-obsessed teenage girl, teenage girl to eating-disordered young woman, female to male, daughter to son, and finally a beloved partner to a cherished fiance'. A unique lens on", "Second Son is a story that intimately explores the transition experience of Ryan Salllans, born Kimberly Ann Sallans. The reader is pulled through Ryan's transition from infant to child, child to body-obsessed teenage girl, teenage girl to eating-disordered young woman, female to male, daughter to son, and finally a beloved partner to a cherished fiance'. A unique lens on life and love. Ryan candidly shares his struggle to find love and acceptance; a struggle that transcends through every layer of society. He nearly died from an extreme case of anorexia as an insecure female college student. The only thing that saved him was his inner spirit begging for a chance to live. ? Second Son chronicles Ryan's battle with his family, his romantic partner, and his body. He unblinkingly focuses on the empowerment he achieved as he underwent gender reassignment surgeries and traces his evolution into manhood. ? It took twenty-nine years for Ryan to find himself. The world is now ready for this intimate and honest autobiography that will educate and empower men and women around the globe. At a time when fighting to find oneself is popular, Ryan's story will resonate with people everywhere who are journeying to find their own destinies, love, and life."], "author": "Ryan Sallans", "num_pages": "227", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-16 00:00:00", "ISBN": "0982000960"},
{"url": "https://www.goodreads.com/book/show/35431102-portland-diary", "num_ratings": "20", "num_reviews": "6", "avg_ratings": 4.7, "genres": ["Lgbt", "Transgender", "Short Stories", "Lgbt", "Science Fiction", "Fiction", "Anthologies"], "title": "Portland Diary: Short Stories 2016/2017", "description": ["A collection of seven stories about women faced with impossible situations. Each narrative unfolds its heightened, speculative version of the everyday reality we find ourselves in as racialized people, queer and mentally ill and colonial subjects, enemies or collaborators to the Western imperial machine, disposable labor for a capitalist system that is devouring the world.", "A collection of seven stories about women faced with impossible situations. Each narrative unfolds its heightened, speculative version of the everyday reality we find ourselves in as racialized people, queer and mentally ill and colonial subjects, enemies or collaborators to the Western imperial machine, disposable labor for a capitalist system that is devouring the world. In “Mansion,” the story that opens the book, an unpaid intern falls into a nightmare after realizing how little she’s worth to the local Human Rights Campaign-esque nonprofit she’s been sacrificing herself for. And the book progresses through dystopian futures, ecastatic visions of liberation, narrow escapes, and betrayals until the last story, “Waiting Room,” where a trans woman and an android woman form a bond while waiting for the surgery consults that promise to bring them a measure of freedom."], "author": "Jamie Berrout", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/29902553-passage", "num_ratings": "67", "num_reviews": "21", "avg_ratings": 4.48, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Transgender", "Cultural", "Canada", "Lgbt", "Gender"], "title": "Passage", "description": ["In her second collection of poetry, Passage, Gwen Benaway examines what it means to experience violence and speaks to the burden of survival. Traveling to Northern Ontario and across the Great Lakes, Passage is a poetic voyage through divorce, family violence, legacy of colonization, and the affirmation of a new sexuality and gender. Previously published as a man, Passage", "In her second collection of poetry, Passage, Gwen Benaway examines what it means to experience violence and speaks to the burden of survival. Traveling to Northern Ontario and across the Great Lakes, Passage is a poetic voyage through divorce, family violence, legacy of colonization, and the affirmation of a new sexuality and gender. Previously published as a man, Passage is the poet's first collection written as a transwoman. Striking and raw in sparse lines, the collection showcases a vital Two Spirited identity that transects borders of race, gender, and experience. In Passage, the poet seeks to reconcile herself to the land, the history of her ancestors, and her separation from her partner and family by invoking the beauty and power of her ancestral waterways. Building on the legacy of other ground-breaking Indigenous poets like Gregory Scofield and Queer poets like Tim Dlugos, Benaway's work is deeply personal and devastating in sharp, clear lines. Passage is a book burning with a beautiful intensity and reveals Benaway as one of the most powerful emerging poets writing in Indigenous poetics today."], "author": "Gwen Benaway", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-12-15 00:00:00", "ISBN": "1928120083"},
{"url": "https://www.goodreads.com/book/show/13510190-bumbling-into-body-hair", "num_ratings": "117", "num_reviews": "25", "avg_ratings": 4.07, "genres": ["Lgbt", "Transgender", "Autobiography", "Memoir", "Nonfiction", "Lgbt", "Glbt", "Queer"], "title": "Bumbling into Body Hair: A Transsexual's Memoir", "description": ["A comical memoir about a klutz's sex change, Bumbling into Body Hair shows how a sense of humor - and true love - can triumph over hair disasters, resurrected breasts, and even the most crippling self-doubt."], "author": "Everett Maroon", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-15 00:00:00", "ISBN": "1935961330"},
{"url": "https://www.goodreads.com/book/show/17571569-revolutionary", "num_ratings": "509", "num_reviews": "121", "avg_ratings": 3.72, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Military History", "American Revolution", "Lgbt", "Literature", "18th Century"], "title": "Revolutionary", "description": ["\"Myers presents an incredibly complex protagonist in Deborah, whose gender identity is not taken as a given.\" - ", "“A novel of the American Revolution by a writer who is himself a true American revolutionary.” —Mark Edmundson, author of ", "In 1782, during the final clashes of the Revolutionary War, one of our young nation’s most valiant and beloved so", "\"Myers presents an incredibly complex protagonist in Deborah, whose gender identity is not taken as a given.\" - ", "“A novel of the American Revolution by a writer who is himself a true American revolutionary.” —Mark Edmundson, author of ", "In 1782, during the final clashes of the Revolutionary War, one of our young nation’s most valiant and beloved soldiers was, secretly, a woman.", "When Deborah Samson disguised herself as a man and joined the Continental Army, she wasn’t just fighting for America’s independence--she was fighting for her own. ", " Alex Myers’s richly imagined and meticulously researched debut novel, brings the true story of Deborah’s struggle against a rigid colonial society back to life--and with it the courage, hope, fear, and heartbreak that shaped her journey through a country’s violent birth.", "After years as an indentured servant in a sleepy Massachusetts town, chafing under the oppressive norms of colonial America, Deborah can’t contain her discontent any longer. When a sudden crisis forces her hand, she decides to finally make her escape. Embracing the peril and promise of the unknown, she cuts her hair, binds her chest, and, stealing clothes from a neighbor, rechristens herself Robert Shurtliff. It’s a desperate, dangerous, and complicated deception, and becomes only more so when, as Robert, she enlists in the Continental Army.", "What follows is an inspiring, one-of-a-kind journey through an America torn apart by war: brutal winters and lethal battlefields, the trauma of combat and the cruelty of betrayal, the joy of true love and the tragedy of heartbreak. In his brilliant ", " Myers, who is a descendant of the historical Deborah, takes full advantage of this real-life heroine’s unique voice to celebrate the struggles for freedom, large and small, like never before."], "author": "Alex    Myers", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-14 00:00:00", "ISBN": "1451663323"},
{"url": "https://www.goodreads.com/book/show/75405.In_a_Queer_Time_and_Place", "num_ratings": "874", "num_reviews": "37", "avg_ratings": 3.92, "genres": ["Glbt", "Queer", "Philosophy", "Theory", "Nonfiction", "Gender", "Feminism", "Lgbt", "Transgender"], "title": "In a Queer Time and Place: Transgender Bodies, Subcultural Lives", "description": ["In his first book since the critically acclaimed ", ", J. Jack Halberstam examines the significance of the transgender body in a provocative collection of essays on queer time and space. He presents a series of case studies focused on the meanings of masculinity in its dominant and alternative forms especially female and trans-masculinities as they exist with", "In his first book since the critically acclaimed ", ", J. Jack Halberstam examines the significance of the transgender body in a provocative collection of essays on queer time and space. He presents a series of case studies focused on the meanings of masculinity in its dominant and alternative forms especially female and trans-masculinities as they exist within subcultures, and are appropriated within mainstream culture.", " opens with a probing analysis of the life and death of Brandon Teena, a young transgender man who was brutally murdered in small-town Nebraska. After looking at mainstream representations of the transgender body as exhibited in the media frenzy surrounding this highly visible case and the Oscar-winning film based on Brandon's story, ", ", Halberstam turns his attention to the cultural and artistic production of queers themselves. He examines the transgender gaze, as rendered in small art-house films like ", ", as well as figurations of ambiguous embodiment in the art of Del LaGrace Volcano, Jenny Saville, Eva Hesse, Shirin Neshat, and others. He then exposes the influence of lesbian drag king cultures upon hetero-male comic films, such as ", " and ", ", and, finally, points to dyke subcultures as one site for the development of queer counterpublics and queer temporalities.", "Considering the sudden visibility of the transgender body in the early twenty-first century against the backdrop of changing conceptions of space and time, ", " is the first full-length study of transgender representations in art, fiction, film, video, and music. This pioneering book offers both a jumping off point for future analysis of transgenderism and an important new way to understand cultural constructions of time and place.", "\""], "author": "J. Jack Halberstam", "num_pages": "213", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "0814735851"},
{"url": "https://www.goodreads.com/book/show/24292701-crooked-words", "num_ratings": "7", "num_reviews": "3", "avg_ratings": 3.57, "genres": ["Short Stories", "Lgbt", "Transgender", "Lgbt", "Glbt", "Queer", "Gender", "Fiction", "Gender and Sexuality"], "title": "Crooked Words: A Collection of Queer, Transgender and Womanist Writings", "description": ["A young transgender magician travels the world on a quest for a mystical talking sword. A witch wonders why her would-be lovers can’t date her the old-fashioned way. A cross-dressing man meets a suit-clad soul whose gender defies definition. A non-binary zombie wishes ze were the hero in science-fiction stories. A genderqueer manservant tries to save her mentally-ill lover", "A young transgender magician travels the world on a quest for a mystical talking sword. A witch wonders why her would-be lovers can’t date her the old-fashioned way. A cross-dressing man meets a suit-clad soul whose gender defies definition. A non-binary zombie wishes ze were the hero in science-fiction stories. A genderqueer manservant tries to save her mentally-ill lover with a deck of tarot cards. A boy looks at himself in the mirror and ponders the fear of telling his family that his name isn’t Susan.", "Crooked Words is an eclectic collection of short fiction in pursuit of the many different shades of what it means to live queer."], "author": "K.A. Cook", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/33099588-the-black-tides-of-heaven", "num_ratings": "2,238", "num_reviews": "502", "avg_ratings": 3.88, "genres": ["Fantasy", "Fiction", "Novella", "Lgbt", "Glbt", "Queer", "Short Stories"], "title": "The Black Tides of Heaven", "description": ["Mokoya and Akeha, the twin children of the Protector, were sold to the Grand Monastery as children. While Mokoya devel", "Mokoya and Akeha, the twin children of the Protector, were sold to the Grand Monastery as children. While Mokoya developed her strange prophetic gift, Akeha was always the one who could see the strings that moved adults to action. While his sister received visions of what would be, Akeha realized what could be. What's more, he saw the sickness at the heart of his mother's Protectorate.", "A rebellion is growing. The Machinists discover new levers to move the world every day, while the Tensors fight to put them down and preserve the power of the state. Unwilling to continue to play a pawn in his mother's twisted schemes, Akeha leaves the Tensorate behind and falls in with the rebels. But every step Akeha takes towards the Machinists is a step away from his sister Mokoya. Can Akeha find peace without shattering the bond he shares with his twin sister?"], "author": "J.Y.  Yang", "num_pages": "236", "awards": ["Nebula Award Nominee for Best Novella (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-26 00:00:00", "ISBN": "076539541X"},
{"url": "https://www.goodreads.com/book/show/24727102-lizard-radio", "num_ratings": "565", "num_reviews": "156", "avg_ratings": 3.57, "genres": ["Young Adult", "Lgbt", "Science Fiction", "Science Fiction", "Dystopia", "Glbt", "Queer"], "title": "Lizard Radio", "description": ["Fifteen-year-old Kivali has never fit in. As a girl in boys’ clothes, she is accepted by neither tribe, bullied by both. ", " they ask. Abandoned as a baby wrapped in a T-shirt with an image of a lizard on the front, Kivali found a home with nonconformist artist Sheila. Is it true what Sheila says, that Kivali was left by a mysterious race of saurians and that she", "Fifteen-year-old Kivali has never fit in. As a girl in boys’ clothes, she is accepted by neither tribe, bullied by both. ", " they ask. Abandoned as a baby wrapped in a T-shirt with an image of a lizard on the front, Kivali found a home with nonconformist artist Sheila. Is it true what Sheila says, that Kivali was left by a mysterious race of saurians and that she’ll one day save the world? Kivali doesn’t think so. But if it is true, why has Sheila sent her off to CropCamp, with its schedules and regs and what feels like indoctrination into a gov-controlled society Kivali isn’t sure has good intentions?", "But life at CropCamp isn’t all bad. Kivali loves being outdoors and working in the fields. And for the first time, she has real friends: sweet, innocent Rasta; loyal Emmett; fierce, quiet Nona. And then there’s Sully. The feelings that explode inside Kivali whenever Sully is near—whenever they touch—are unlike anything she’s experienced, exhilarating and terrifying. But does Sully feel the same way?", "Between mysterious disappearances, tough questions from camp director Ms. Mischetti, and weekly doses of kickshaw—the strange, druglike morsel that Kivali fears but has come to crave—things get more and more complicated. But Kivali has an escape: her unique ability to channel and explore the power of her animal self. She has Lizard Radio.", "Will it be enough to save her?"], "author": "Pat Schmatz", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-08 00:00:00", "ISBN": "0763676357"},
{"url": "https://www.goodreads.com/book/show/36112901-glamour-boutique", "num_ratings": "36", "num_reviews": "10", "avg_ratings": 4.64, "genres": ["Lgbt", "Fiction", "Gender"], "title": "Glamour Boutique", "description": ["You can only lose your virginity once, right? Not if you’re Amy—a trans woman caught in loops of dissociation—so that she has sex for the first time multiple times, in multiple ways, through multiple levels of presence, in a search to own and redeem the self-inflicted pain of her past.", "From Torrey Peters, author of The Masker and Infect Your Friends and Loved Ones, comes a", "You can only lose your virginity once, right? Not if you’re Amy—a trans woman caught in loops of dissociation—so that she has sex for the first time multiple times, in multiple ways, through multiple levels of presence, in a search to own and redeem the self-inflicted pain of her past.", "From Torrey Peters, author of The Masker and Infect Your Friends and Loved Ones, comes a novella that dives into the labor of naming your pain when there’s no easily identifiable source of trauma."], "author": "Torrey Peters", "num_pages": "87", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20500053-the-unintentional-time-traveler", "num_ratings": "152", "num_reviews": "36", "avg_ratings": 3.74, "genres": ["Young Adult", "Science Fiction", "Lgbt", "Science Fiction", "Time Travel", "Fiction"], "title": "The Unintentional Time Traveler", "description": ["Fifteen-year-old Jack Bishop has mad skills with cars and engines, but knows he’ll never get a driver’s license because of his epilepsy. Agreeing to participate in an experimental clinical trial to find new treatments for his disease, he finds himself in a completely different body—that of a girl his age, Jacqueline, who defies the expectations of her era. Since his seizur", "Fifteen-year-old Jack Bishop has mad skills with cars and engines, but knows he’ll never get a driver’s license because of his epilepsy. Agreeing to participate in an experimental clinical trial to find new treatments for his disease, he finds himself in a completely different body—that of a girl his age, Jacqueline, who defies the expectations of her era. Since his seizures usually give him spazzed out visions, Jack presumes this is a hallucination. Feeling fearless, he steals a horse, expecting that at any moment he’ll wake back up in the clinical trial lab. When that doesn't happen, Jacqueline falls unexpectedly in love, even as the town in the past becomes swallowed in a fight for its survival. Jack/Jacqueline is caught between two lives and epochs, and must find a way to save everyone around him as well as himself. And all the while, he is losing time, even if he is getting out of algebra class."], "author": "Everett Maroon", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-24 00:00:00", "ISBN": "162015207X"},
{"url": "https://www.goodreads.com/book/show/30070454-support-your-sisters-not-your-cisters-ber-diskriminierung-von-trans-we", "num_ratings": "11", "num_reviews": "3", "avg_ratings": 4.45, "genres": ["Lgbt", "Transgender", "Politics", "Gender and Sexuality", "Glbt", "Queer", "Feminism"], "title": "Support your sisters not your cisters. Über Diskriminierung von trans*Weiblichkeiten", "description": ["Die Musikerin „FaulenzA“ beschreibt aus ihren persönlichen Erfahrungen die Diskriminierung gegen trans*Frauen und gibt Anregungen für mehr Sensibilität und Support:", "Sie erklärt Trans*misogynie als ein Zusammenwirken von Feminitätsfeindlichkeit, Transfeindlichkeit, Klassismus und Ableismus und richtet ihren Schwerpunkt darauf, wie sie dies auch in der feministischen und quee", "Die Musikerin „FaulenzA“ beschreibt aus ihren persönlichen Erfahrungen die Diskriminierung gegen trans*Frauen und gibt Anregungen für mehr Sensibilität und Support:", "Sie erklärt Trans*misogynie als ein Zusammenwirken von Feminitätsfeindlichkeit, Transfeindlichkeit, Klassismus und Ableismus und richtet ihren Schwerpunkt darauf, wie sie dies auch in der feministischen und queeren Szene zu spüren bekommt. Trans*Frauen wird hier oft mit Skepsis, Ablehnung und Unbehagen begegnet. Sie stehen unter dem Druck zu beweisen, dass sie keine Cis-Männer sind, werden oft nicht als selbstverständlicher Teil feministischer Bewegung akzeptiert und ihre Perspektiven nicht gesehen. Manche Frauenräume/FLT*I*-Räume schließen ganz offen trans*Frauen aus, in anderen erfahren sie Ausschlüsse auf subtilere Weise.", "Trans*Frauen wären „männlich sozialisiert“, wird gesagt, was FaulenzA als ein ebenso unsinniges, wie diskriminierendes Argument entlarvt. Weitere Themen sind u.a. „Trans*misogynie in den Medien“ und der „Trans*gender Day of Remembrance“. Im zweiten Teil des Buches gibt FaulenzA vom „Schwanz ab-Feminismus“ zum „Menstruationsneid“ einige Beispiele, die zeigen, wie durch biologistische Sichtweisen trans*Frauen ausgeschlossen und diskriminiert werden. Absichtlich und unabsichtlich."], "author": "FaulenzA", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "German", "publish_date": "2017-03-16 00:00:00", "ISBN": "3960420102"},
{"url": "https://www.goodreads.com/book/show/31453657-what-it-looks-like", "num_ratings": "409", "num_reviews": "117", "avg_ratings": 4.09, "genres": ["Romance", "M M Romance", "Erotica", "Bdsm", "Lgbt", "Transgender", "Contemporary", "Romance"], "title": "What It Looks Like", "description": ["Eli Bell is the only son of a police chief inspector and a forensic scientist. He's grown up wonky in a world that only deals with the straight and narrow -- and his new boyfriend isn't helping.", "Rob Hawkes is six feet of muscle, tattoos, and arrest warrants. A career criminal and a former guest of Her Majesty's Prison Service, he'd rather hit Eli's parents than sit down to", "Eli Bell is the only son of a police chief inspector and a forensic scientist. He's grown up wonky in a world that only deals with the straight and narrow -- and his new boyfriend isn't helping.", "Rob Hawkes is six feet of muscle, tattoos, and arrest warrants. A career criminal and a former guest of Her Majesty's Prison Service, he'd rather hit Eli's parents than sit down to dinner with them. One wrong move, and Rob could destroy Eli -- and his family -- without a second thought.", "But this isn't what it looks like.", "Rob's not in control here -- and Eli's the one to blame."], "author": "Matthew J. Metzger", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-08-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24844451-me-hijra-me-laxmi", "num_ratings": "83", "num_reviews": "13", "avg_ratings": 3.41, "genres": ["Lgbt", "Biography", "Nonfiction", "Asian Literature", "Indian Literature", "Cultural", "India"], "title": "Me Hijra, Me Laxmi", "description": ["He was born a boy, but never felt like one. What was he then?", "He felt attracted to boys. What did this make him?", "He loved to dance. But why did others make fun of him?", "Battling such emotional turmoil from a very young age, Laxminarayan Tripathi, born in a high-caste Brahman household, felt confused, trapped, and lonely. Slowly, he began wearing women's clothes. Over time, he", "He was born a boy, but never felt like one. What was he then?", "He felt attracted to boys. What did this make him?", "He loved to dance. But why did others make fun of him?", "Battling such emotional turmoil from a very young age, Laxminarayan Tripathi, born in a high-caste Brahman household, felt confused, trapped, and lonely. Slowly, he began wearing women's clothes. Over time, he became bold and assertive about his real sexual identity. Finally, he found his true self—she was Laxmi, a hijra.", "From numerous love affairs to finding solace by dancing in Mumbai's bars; from being taunted as a homo to being the first Indian hijra to attend the World AIDS Conference in Toronto; from mental and physical abuse to finding a life of grace, dignity, and fame, this autobiography is an extraordinary journey of a hijra who fought against tremendous odds for the recognition of hijras and their rights."], "author": "Laxmi", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/34609406-trans-mission", "num_ratings": "269", "num_reviews": "47", "avg_ratings": 4.33, "genres": ["Nonfiction", "Lgbt", "Autobiography", "Memoir", "Biography", "Lgbt", "Transgender"], "title": "Trans Mission: My Quest to a Beard", "description": ["Being a teenager is difficult enough, but having to go through puberty whilst realising you're in the wrong body means dealing with a whole new set of problems: bullying, self-doubt and in some cases facing a physical and medical transition.", "Alex is an ordinary teenager: he likes pugs, donuts, retro video games and he sleeps with his socks on. He's also transgender, and was", "Being a teenager is difficult enough, but having to go through puberty whilst realising you're in the wrong body means dealing with a whole new set of problems: bullying, self-doubt and in some cases facing a physical and medical transition.", "Alex is an ordinary teenager: he likes pugs, donuts, retro video games and he sleeps with his socks on. He's also transgender, and was born female. He's been living as a male for the past few years and he has recently started his physical transition.", "Throughout this book, Alex will share what it means to be in his shoes, as well as his personal advice to other trans teens. Above all, he will show you that every step in his transition is another step towards happiness. This is an important and positive book, a heart-warming coming-of-age memoir with a broad appeal."], "author": "Alex Bertie", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-11-02 00:00:00", "ISBN": "1526360683"},
{"url": "https://www.goodreads.com/book/show/26188804-trans-portraits", "num_ratings": "107", "num_reviews": "23", "avg_ratings": 4.34, "genres": ["Nonfiction", "Lgbt", "Lgbt", "Transgender", "Writing", "Essays", "Autobiography", "Memoir", "Glbt", "Queer"], "title": "Trans/Portraits: Voices from Transgender Communities", "description": ["A fascinating collective memoir of the lives and experiences of transgender people, in their own voices.", "Although transgender people are increasingly represented in academic studies and popular culture, they rarely have the opportunity to add their own voices to the conversation. In this remarkable book, Jackson Shultz records the stories of more than thirty Americans who i", "A fascinating collective memoir of the lives and experiences of transgender people, in their own voices.", "Although transgender people are increasingly represented in academic studies and popular culture, they rarely have the opportunity to add their own voices to the conversation. In this remarkable book, Jackson Shultz records the stories of more than thirty Americans who identify as transgender. They range in age from 15 to 72; come from twenty-five different states and a wide array of racial, religious, and socioeconomic backgrounds; and identify across a vast spectrum of genders and sexualities.", "Giving voice to a diverse group of individuals, the book raises questions about gender, acceptance, and unconditional love. From historical descriptions of activism to personal stories of discrimination, love, and community, these touching accounts of gender transition shed light on the uncharted territories that lie beyond the gender binary. Despite encounters with familial rejection, drug addiction, and medical malpractice, each account is imbued with optimism and humor, providing a thoughtful look at the daily joys and struggles of transgender life."], "author": "Jackson Wright Shultz", "num_pages": "218", "awards": ["The Publishing Triangle Award for Trans and Gender-Variant Literature Nominee (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24388296-trans", "num_ratings": "625", "num_reviews": "73", "avg_ratings": 3.91, "genres": ["Nonfiction", "Autobiography", "Memoir", "Lgbt", "Feminism", "Biography", "Autobiography"], "title": "Trans: A Memoir", "description": ["In July 2012, aged thirty, Juliet Jacques underwent sex reassignment surgery—a process she chronicled with unflinching honesty in a serialised national new", "In July 2012, aged thirty, Juliet Jacques underwent sex reassignment surgery—a process she chronicled with unflinching honesty in a serialised national newspaper column. ", " tells of her life to the present moment: a story of growing up, of defining yourself, and of the rapidly changing world of gender politics.", "Fresh from university, eager to escape a dead-end job, she launches a career as a writer in a publishing culture dominated by London cliques and still figuring out the impact of the Internet. She navigates the treacherous waters of a world where, even in the liberal and feminist media, transgender identities go unacknowledged, misunderstood or worse. Yet through art, film, music, politics and football, Jacques starts to become the person she had only imagined, and begins the process of transition. Interweaving the personal with the political, her memoir is a powerful exploration of debates that comprise trans politics, issues which promise to redefine our understanding of what it means to be alive.", "Revealing, honest, humorous, and self-deprecating, ", " includes an epilogue with Sheila Heti, author of ", ", in which Jacques and Heti discuss the cruxes of writing and identity."], "author": "Juliet Jacques", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-09-22 00:00:00", "ISBN": "1784781657"},
{"url": "https://www.goodreads.com/book/show/25176068-at-land", "num_ratings": "17", "num_reviews": "3", "avg_ratings": 4.35, "genres": ["Lgbt", "Fiction", "Lgbt", "Transgender", "Gender"], "title": "At Land", "description": ["AT LAND is the new novelette by trans writer and performance artist Morgan M Page (Odofemi) following the after effects of an inexplicable event on the lives of two trans people in Montréal. Reed — a bike mechanic — and his girlfriend Gwen — an obsessive filmmaker — are losing time, losing each other, and beginning to change. Inspired by the films of Maya Deren and the wri", "AT LAND is the new novelette by trans writer and performance artist Morgan M Page (Odofemi) following the after effects of an inexplicable event on the lives of two trans people in Montréal. Reed — a bike mechanic — and his girlfriend Gwen — an obsessive filmmaker — are losing time, losing each other, and beginning to change. Inspired by the films of Maya Deren and the writings of Caitlín R. Kiernan and Algernon Blackwood, AT LAND is a mind-bending journey through the disintegration of a relationship."], "author": "Morgan M. Page", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23301854-show-trans", "num_ratings": "55", "num_reviews": "9", "avg_ratings": 3.95, "genres": ["Glbt", "Queer", "Lgbt", "Transgender", "Lgbt", "Biography"], "title": "Show Trans", "description": ["A nonfiction novel about sex addiction, sex work, navigating the MSM scene, a trip West, dissociative identity disorder, and the struggle to find love, connection, and self-actualization as a non-binary trans person. This book is DeLine's most autobiographical (and arguably scandalous) work to date."], "author": "Elliott DeLine", "num_pages": "158", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-01 00:00:00", "ISBN": "1500844497"},
{"url": "https://www.goodreads.com/book/show/329793.The_Transgender_Studies_Reader", "num_ratings": "268", "num_reviews": "17", "avg_ratings": 4.29, "genres": ["Glbt", "Queer", "Nonfiction", "Gender", "Lgbt", "Lgbt", "Transgender", "Philosophy", "Theory", "Feminism"], "title": "The Transgender Studies Reader", "description": ["Transgender studies is the latest area of academic inquiry to grow out of the exciting nexus of queer theory, feminist studies, and the history of sexuality. Because transpeople challenge our most fundamental assumptions about the relationship between bodies, desire, and identity, the field is both fascinating and contentious. ", "r puts between tw", "Transgender studies is the latest area of academic inquiry to grow out of the exciting nexus of queer theory, feminist studies, and the history of sexuality. Because transpeople challenge our most fundamental assumptions about the relationship between bodies, desire, and identity, the field is both fascinating and contentious. ", "r puts between two covers fifty influential texts with new introductions by the editors that, taken together, document the evolution of transgender studies in the English-speaking world. By bringing together the voices and experience of transgender individuals, doctors, psychologists and academically-based theorists, this volume will be a foundational text for the transgender community, transgender studies, and related queer theory."], "author": "Susan Stryker", "num_pages": "752", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-06-09 00:00:00", "ISBN": "0415947081"},
{"url": "https://www.goodreads.com/book/show/30326596-small-beauty", "num_ratings": "143", "num_reviews": "28", "avg_ratings": 4.33, "genres": ["Fiction", "Glbt", "Queer", "Lgbt", "Lgbt", "Transgender", "Cultural", "Canada"], "title": "Small Beauty", "description": [" tells the story of Mei, who in coping with the death of her cousin abandons her life in the city to live in his now empty house in a small town. There she connects with his history as well as her own, learns about her aunt’s long-term secret relationship, and reflects on the trans women she left behind. She also brushes up against some local trans mysteries an", " tells the story of Mei, who in coping with the death of her cousin abandons her life in the city to live in his now empty house in a small town. There she connects with his history as well as her own, learns about her aunt’s long-term secret relationship, and reflects on the trans women she left behind. She also brushes up against some local trans mysteries and gets advice from departed loved ones with a lot to say."], "author": "jia qing wilson-yang", "num_pages": "160", "awards": ["Lambda Literary Award for Transgender Fiction (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-12 00:00:00", "ISBN": "0994047126"},
{"url": "https://www.goodreads.com/book/show/16006608-the-end-of-san-francisco", "num_ratings": "231", "num_reviews": "38", "avg_ratings": 4.02, "genres": ["Glbt", "Queer", "Autobiography", "Memoir", "Nonfiction", "Lgbt"], "title": "The End of San Francisco", "description": ["The End of San Francisco breaks apart the conventions of memoir to reveal the passions and perils of a life that refuses to conform to the rules of straight or gay normalcy. A budding queer activist escapes to San Francisco, in search of a world more politically charged, sexually saturated, and ethically consistent—this is the person who evolves into Mattilda Bernstein Syc", "The End of San Francisco breaks apart the conventions of memoir to reveal the passions and perils of a life that refuses to conform to the rules of straight or gay normalcy. A budding queer activist escapes to San Francisco, in search of a world more politically charged, sexually saturated, and ethically consistent—this is the person who evolves into Mattilda Bernstein Sycamore, infamous radical queer troublemaker, organizer and agitator, community builder, and anti-assimilationist commentator. Here is the tender, provocative, and exuberant story of the formation of one of the contemporary queer movement's most savvy and outrageous writers and spokespersons.", "Using an unrestrained associative style to move kaleidoscopically between past, present, and future, Sycamore conjures the untidy push and pull of memory, exposing the tensions between idealism and critical engagement, trauma and self-actualization, inspiration and loss. Part memoir, part social history, and part elegy, The End of San Francisco explores and explodes the dream of a radical queer community and the mythical city that was supposed to nurture it."], "author": "Mattilda Bernstein Sycamore", "num_pages": "186", "awards": ["Lambda Literary Award Nominee for Transgender Nonfiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-01 00:00:00", "ISBN": "087286572X"},
{"url": "https://www.goodreads.com/book/show/13431485-through-the-door-of-life", "num_ratings": "200", "num_reviews": "37", "avg_ratings": 3.78, "genres": ["Autobiography", "Memoir", "Glbt", "Queer", "Literature", "Jewish", "Lgbt", "Transgender", "Nonfiction", "Gender", "Lgbt"], "title": "Through the Door of Life: A Jewish Journey between Genders", "description": ["After years of teaching literature at Yeshiva University, Professor Jay Ladin made headlines around the world by returning to the Orthodox Jewish campus as a woman: Joy Ladin. In ", ", Joy Ladin takes readers inside her transition as she changed genders and, in the process, created a new self.", "    With unsparing honesty and surprising humor, Ladin wrestl", "After years of teaching literature at Yeshiva University, Professor Jay Ladin made headlines around the world by returning to the Orthodox Jewish campus as a woman: Joy Ladin. In ", ", Joy Ladin takes readers inside her transition as she changed genders and, in the process, created a new self.", "    With unsparing honesty and surprising humor, Ladin wrestles with both the practical problems of gender transition and the larger moral, spiritual, and philosophical questions that arise. Ladin recounts her struggle to reconcile the pain of her experience living as the “wrong” gender with the pain of her children in losing the father they love. We eavesdrop on her lifelong conversations with the God whom she sees both as the source of her agony and as her hope for transcending it. We look over her shoulder as she learns to walk and talk as a woman after forty-plus years of walking and talking as a man. We stare with her into the mirror as she asks herself how the new self she is creating will ever become real.", "    Ladin’s poignant memoir takes us from the death of living as the man she knew she wasn’t, to the shattering of family and career that accompanied her transition, to the new self, relationships, and love she finds when she opens the door of life.", "“Wrenching—and liberating. . . .[it] opens up new ways of looking at gender and the place of LGBT Jews in community.”—", "“Given her high-profile academic position, Ladin’s transition was a major news story in Israel and even internationally. But behind the public story was a private struggle and learning experience, and Ladin pulls no punches in telling that story. She offers a peek into how daunting it was to learn, with little support from others, how to dress as a middle-aged woman, to mu on make-up, to walk and talk like a female. She provides a front-row seat for observing how one person confronted a seemingly impossible situation and how she triumphed, however shakingly, over the many adversities, both societal and psychological, that stood in the way.”—"], "author": "Joy Ladin", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-15 00:00:00", "ISBN": "0299287300"},
{"url": "https://www.goodreads.com/book/show/357381.GenderQueer", "num_ratings": "1,163", "num_reviews": "47", "avg_ratings": 3.94, "genres": ["Glbt", "Queer", "Nonfiction", "Gender", "Lgbt", "Lgbt", "Transgender", "Feminism"], "title": "GenderQueer: Voices From Beyond the Sexual Binary", "description": ["Perhaps more than any other issue, gender identity has galvanized the queer community in recent years. The questions go beyond the nature of male/female to a yet-to-be-traversed region that lies somewhere between and beyond biologically determined gender. In this groundbreaking anthology, three experts in gender studies and politics navigate around rigid, societally impose", "Perhaps more than any other issue, gender identity has galvanized the queer community in recent years. The questions go beyond the nature of male/female to a yet-to-be-traversed region that lies somewhere between and beyond biologically determined gender. In this groundbreaking anthology, three experts in gender studies and politics navigate around rigid, societally imposed concepts of two genders to discover and illuminate the limitless possibilities of identity. Thirty first-person accounts of gender construction, exploration, and questioning provide a groundwork for cultural discussion, political action, and even greater possibilities of autonomous gender choices. Noted scholar Joan Nestle is joined by internationally prominent gender warrior Riki Anne Wilchins and historian Clare Howell to provide a societal, cultural, and political exploration of gender identity.", " National Advertising: ", " Academic mailing to gender studies and queer studies professors", " Media campaign hilighting authors Nestle and Wilchins", "is the cofounder of the Lesbian Herstory Archives in New York and the writer and editor of six books including the groundbreaking ", "series. Riki Anne Wilchins is the executive director of GenderPAC, the national gender advocacy group, and the cofounder of the Gender Identity Project of New York City's Lesbian and Gay Center. She is the author of ", ". Clare Howell is a senior librarian at the Brooklyn Public Library."], "author": "Joan Nestle", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-08-01 00:00:00", "ISBN": "1555837301"},
{"url": "https://www.goodreads.com/book/show/891284.Man_Into_Woman", "num_ratings": "467", "num_reviews": "36", "avg_ratings": 4.07, "genres": ["Nonfiction", "Lgbt", "History", "Autobiography", "Memoir"], "title": "Man Into Woman: The First Sex Change", "description": ["This riveting account of the transformation of the Danish painter Einar Wegener into Lili Elbe is a remarkable journey from man to woman. Einar Wegener was a leading artist in late 1920's Paris. One day his wife Grete asked him to dress as a woman to model for a portrait. It was a shattering event which began a struggle between his public male persona and emergent female s", "This riveting account of the transformation of the Danish painter Einar Wegener into Lili Elbe is a remarkable journey from man to woman. Einar Wegener was a leading artist in late 1920's Paris. One day his wife Grete asked him to dress as a woman to model for a portrait. It was a shattering event which began a struggle between his public male persona and emergent female self, Lili. Einar was forced into living a double life; enjoying a secret hedonist life as Lili, with Grete and a few trusted friends, whilst suffering in public as Einar, driven to despair and almost to suicide. Doctors, unable to understand his condition, dismissed him as hysterical. Lili eventually forced Einar to face the truth of his being - he was, in fact, a woman. This bizarre situation took an extraordinary turn when it was discovered that his body contained primitive female sex organs. There followed a series of dangerous experimental operations and a confrontation with the conventions of the age until Lili was eventually liberated from Einar - a freedom that carried the ultimate price. Now with a foreword written by a modern transsexual - the book has not been published in English for decades, and a sensation when it first appeared over seventy years ago - this new edition of Man into Woman, the birth, life and confessions of Lili Elbe, is a story of a marriage and of love and romance that paints a fascinating portrait of a 1930's European artistic community. Compiled fron Lili's own letters and manuscripts, and those of the people who adored her, Man into Woman is the Genesis of the Gender Revolution."], "author": "Lili Elbe", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-03-31 00:00:00", "ISBN": "0954707206"},
{"url": "https://www.goodreads.com/book/show/17465553-blood-marriage-wine-glitter", "num_ratings": "160", "num_reviews": "21", "avg_ratings": 4.2, "genres": ["Glbt", "Queer", "Lgbt", "Autobiography", "Memoir", "Nonfiction", "Writing", "Essays", "Lgbt", "Transgender"], "title": "Blood, Marriage, Wine, & Glitter", "description": ["S. Bear Bergman is an acclaimed writer and lecturer who travels regularly across North America to speak on trans issues. Bear’s first two books, ", " and ", ", are considered seminal texts on the subject of trans life. In his third essay collection, Bear enters, describes, and rearranges our ideas about family as a daughter, husband", "S. Bear Bergman is an acclaimed writer and lecturer who travels regularly across North America to speak on trans issues. Bear’s first two books, ", " and ", ", are considered seminal texts on the subject of trans life. In his third essay collection, Bear enters, describes, and rearranges our ideas about family as a daughter, husband, father, and friend. In Bear's extended family \"orchard,\" drag sisters, sperm-donor's parents, Sparkles and other relations provide more branches of love, support, and sustenance than a simple family tree. Defiantly queer yet full of tenderness and hilarity, ", " is a beautifully thought-provoking book that redefines the notion of what family is and can be."], "author": "S. Bear Bergman", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-01 00:00:00", "ISBN": "1551525119"},
{"url": "https://www.goodreads.com/book/show/25640393-robins-in-the-night", "num_ratings": "86", "num_reviews": "26", "avg_ratings": 3.53, "genres": ["Fantasy", "Lgbt", "Historical", "Historical Fiction", "Glbt", "Queer", "Fiction", "Lgbt", "Transgender"], "title": "Robins in the Night", "description": ["Legends speak of a man named Robin Hood. ", "They talk of his valiant deeds, of his courageous feats, of his noble exploits. They talk of how this man, this single man, stole from the rich and gave to the poor. They speak of his merry men, and of his bow and arrow, and his green tunic. They speak of him in hushed, reverent tones. They speak of him in loud, exuberant chants. Th", "Legends speak of a man named Robin Hood. ", "They talk of his valiant deeds, of his courageous feats, of his noble exploits. They talk of how this man, this single man, stole from the rich and gave to the poor. They speak of his merry men, and of his bow and arrow, and his green tunic. They speak of him in hushed, reverent tones. They speak of him in loud, exuberant chants. They speak of him in story books. ", "The legends are, as is to be expected, fundamentally wrong. ", "Set in Knottwood, a small city in an alternate timeline Earth, this is the story of a transgender woman named Marian Stoke."], "author": "Dajo Jago", "num_pages": "214", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/21792841-sara-or-the-existence-of-fire", "num_ratings": "55", "num_reviews": "13", "avg_ratings": 4.4, "genres": ["Poetry", "Glbt", "Queer", "Lgbt"], "title": "Sara, or The Existence of Fire", "description": ["\"Sara's father is a wolf. Her dog is a miracle. These little poem-stories are feral in content but meticulous in construction. They are little miracles adding up to the sum of a beautiful storybook.\" - ", ", author of Life Cycle--Poems", "\"As I have learned, and as Sara helped me to understand even more, loving something is not so very far away from wanting to eat", "\"Sara's father is a wolf. Her dog is a miracle. These little poem-stories are feral in content but meticulous in construction. They are little miracles adding up to the sum of a beautiful storybook.\" - ", ", author of Life Cycle--Poems", "\"As I have learned, and as Sara helped me to understand even more, loving something is not so very far away from wanting to eat it. To feel it growing inside of you, stopping your breathing, clogging your pores. To be a way of keeping, of forestalling our inevitable crumble into the ground. And we can feel so very much alone sometimes that loving is almost like hugging the sand, like wanting to marry the beach or kick the water. Almost like being dated by masses of people screaming their phone numbers at you in unison. But maybe with these beautiful, small, heroic bites in Sara, or the Existence of Fire, we can ingest, if only for a little while, what makes us good, what makes us human.\" -", ", author of Soldier On"], "author": "Sara June Woods", "num_pages": "68", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-16 00:00:00", "ISBN": "0982989695"},
{"url": "https://www.goodreads.com/book/show/548383.What_Becomes_You", "num_ratings": "148", "num_reviews": "22", "avg_ratings": 3.73, "genres": ["Glbt", "Queer", "Autobiography", "Memoir", "Nonfiction", "Gender", "Lgbt", "Transgender", "Lgbt"], "title": "What Becomes You", "description": ["“Being a man, like being a woman, is something you have to learn,” Aaron Raz Link remarks. Few would know this better than the coauthor of ", ", who began life as a girl named Sarah and twenty-nine years later began life anew as a gay man. Turning from female to male and from teaching scientist to theatre performer, Link documents the extraordinary medical, soc", "“Being a man, like being a woman, is something you have to learn,” Aaron Raz Link remarks. Few would know this better than the coauthor of ", ", who began life as a girl named Sarah and twenty-nine years later began life anew as a gay man. Turning from female to male and from teaching scientist to theatre performer, Link documents the extraordinary medical, social, legal, and personal process involved in a complete identity change. Hilda Raz, a well-known feminist writer and teacher, observes the process as both an “astonished” parent and as a professor who has studied gender issues. All these perspectives come into play in this collaborative memoir, which travels between women’s experience and men’s lives, explores the art and science of changing sex, maps uncharted family values, and journeys through a world transformed by surgery, hormones, love, and . . . clown school. Combining personal experience and critical analysis, the book is an unusual—and unusually fascinating—reflection on gender, sex, and the art of living."], "author": "Aaron Raz Link", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-24 00:00:00", "ISBN": "0803210817"},
{"url": "https://www.goodreads.com/book/show/25181809-a-boy-called-cin", "num_ratings": "206", "num_reviews": "79", "avg_ratings": 3.83, "genres": ["Romance", "Lgbt", "Transgender", "Lgbt", "Contemporary", "Glbt", "Queer", "Romance", "M M Romance", "Fiction", "Lgbt", "Genderqueer", "Did Not Finish", "Romance", "Contemporary Romance"], "title": "A Boy Called Cin", "description": ["On the search for a cup of coffee before the guest lecture he's giving, Tom spies a tired, half-frozen young man who looks even more need of coffee than him. On impulse, he buys the man a cup—but an attempt to strike up conversation ends in the young man walking off, seemingly put off by Tom Walford—the tabloids’ favourite billionaire—buying him coffee. But when he reappea", "On the search for a cup of coffee before the guest lecture he's giving, Tom spies a tired, half-frozen young man who looks even more need of coffee than him. On impulse, he buys the man a cup—but an attempt to strike up conversation ends in the young man walking off, seemingly put off by Tom Walford—the tabloids’ favourite billionaire—buying him coffee. But when he reappears in Tom's lecture, all Tom knows is that he doesn't want the man slipping away a second time.", "Agreeing to dinner with a man he only knows from internet gossip columns isn't the wisest decision Cin's ever made, but he wants to like the infamous Tom Walford and he can't do that if he doesn't give the man a fair chance to be likeable. Which he is, almost frustratingly so, to the point Cin wishes maybe he hadn't been so fair because he never had any intention of getting attached to Tom, who seems to come from a world far too different from his own for anything between them to last. Little does Cin know, they’ve got a lot more in common than he imagines—including their shared discomfort with their assigned genders, and all the complications that go with it."], "author": "Cecil Wilde", "num_pages": "169", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/37514015-little-fish", "num_ratings": "188", "num_reviews": "39", "avg_ratings": 4.45, "genres": ["Fiction", "Lgbt", "Cultural", "Canada", "Glbt", "Queer", "Lgbt", "Transgender"], "title": "Little Fish", "description": ["In this extraordinary debut novel by the author of the Lambda Literary Award-winning story collection ", ", Wendy Reimer is a thirty-year-old trans woman who comes across evidence that her late grandfather--a devout Mennonite farmer--might have been transgender himself. At first she dismisses this revelation, having other problems at hand, but as she and her", "In this extraordinary debut novel by the author of the Lambda Literary Award-winning story collection ", ", Wendy Reimer is a thirty-year-old trans woman who comes across evidence that her late grandfather--a devout Mennonite farmer--might have been transgender himself. At first she dismisses this revelation, having other problems at hand, but as she and her friends struggle to cope with the challenges of their increasingly volatile lives--from alcoholism, to sex work, to suicide--Wendy is drawn to the lost pieces of her grandfather's life, becoming determined to unravel the mystery of his truth. Alternately warm-hearted and dark-spirited, desperate and mirthful, ", " explores the winter of discontent in the life of one transgender woman as her past and future become irrevocably entwined."], "author": "Casey Plett", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-05-01 00:00:00", "ISBN": "1551527200"},
{"url": "https://www.goodreads.com/book/show/32561237-beyond-trans", "num_ratings": "153", "num_reviews": "48", "avg_ratings": 3.94, "genres": ["Nonfiction", "Lgbt", "Feminism", "Gender", "Glbt", "Queer", "Lgbt", "Transgender"], "title": "Beyond Trans: Does Gender Matter?", "description": [" pushes the conversation on gender identity to its limits: questioning the need for gender categories in the first place. Whether on birth certificates or college admissions applications or on bathroom doors, why do we need to mark people and places with sex categories? Do they serve a real", " pushes the conversation on gender identity to its limits: questioning the need for gender categories in the first place. Whether on birth certificates or college admissions applications or on bathroom doors, why do we need to mark people and places with sex categories? Do they serve a real purpose or are these places and forms just mechanisms of exclusion? Heath Fogg Davis offers an impassioned call to rethink the usefulness of dividing the world into not just Male and Female categories but even additional categories of Transgender and gender fluid. Davis, himself a transgender man, explores the underlying gender-enforcing policies and customs in American life that have led to transgender bathroom bills, college admissions controversies, and more, arguing that it is necessary for our society to take real steps to challenge the assumption that gender matters. ", "He examines four areas where we need to re-think our sex-classification systems: sex-marked identity documents such as birth certificates, driver's licenses and passports; sex-segregated public restrooms; single-sex colleges; and sex-segregated sports. Speaking from his own experience and drawing upon major cases of sex discrimination in the news and in the courts, Davis presents a persuasive case for challenging how individuals are classified according to sex and offers concrete recommendations for alleviating sex identity discrimination and sex-based disadvantage. ", "For anyone in search of pragmatic ways to make our world more inclusive, Davis' recommendations provide much-needed practical guidance about how to work through this complex issue. A provocative call to action, ", "pushes us to think how we can work to make America truly inclusive of all people."], "author": "Heath Fogg Davis", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-02 00:00:00", "ISBN": "1479855405"},
{"url": "https://www.goodreads.com/book/show/15799171-stuck-in-the-middle-with-you", "num_ratings": "749", "num_reviews": "144", "avg_ratings": 3.76, "genres": ["Autobiography", "Memoir", "Nonfiction", "Lgbt", "Parenting", "Gender", "Glbt", "Queer"], "title": "Stuck in the Middle With You: A Memoir of Parenting in Three Genders", "description": ["A father for ten years, a mother for eight, and for a time in between, neither, or both (\"the parental version of the sc", "A father for ten years, a mother for eight, and for a time in between, neither, or both (\"the parental version of the schnoodle, or the cockapoo\"), Jennifer Finney Boylan has seen parenthood from both sides of the gender divide. When her two children were young, Boylan came out as transgender, and as Jenny transitioned from a man to a woman and from a father to a mother, her family faced unique challenges and questions. In this thoughtful, tear-jerking, hilarious memoir, Jenny asks what it means to be a father, or a mother, and to what extent gender shades our experiences as parents. \"It is my hope,\" she writes, \"that having a father who became a woman in turn helped my sons become better men.\"", "Through both her own story and incredibly insightful interviews with others, including Richard Russo, Edward Albee, Ann Beattie, Augusten Burroughs, Susan Minot, Trey Ellis, Timothy Kreider, and more, Jenny examines relationships with fathers and mothers, people's memories of the children they were and the parents they became, and the many different ways a family can be. Followed by an Afterword by Anna Quindlen that includes Jenny and her wife discussing the challenges they've faced and the love they share, ", " is a brilliant meditation on raising – and on being – a child."], "author": "Jennifer Finney Boylan", "num_pages": "304", "awards": ["Judy Grahn Award Nominee (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-30 00:00:00", "ISBN": "0767921763"},
{"url": "https://www.goodreads.com/book/show/20759533-rethinking-normal", "num_ratings": "926", "num_reviews": "174", "avg_ratings": 3.79, "genres": ["Nonfiction", "Lgbt", "Autobiography", "Memoir", "Biography", "Lgbt", "Transgender"], "title": "Rethinking Normal: A Memoir in Transition", "description": ["In her unique, generous, and affecting voice, nineteen-year-old Katie Hill shares her personal journey of undergoing gender reassignment.", "Have you ever worried that you'd never be able to live up to your parents' expectations? Have you ever imagined that life would be better if you were just invisible? Have you ever thought you would do anything--", "--to make the teasi", "In her unique, generous, and affecting voice, nineteen-year-old Katie Hill shares her personal journey of undergoing gender reassignment.", "Have you ever worried that you'd never be able to live up to your parents' expectations? Have you ever imagined that life would be better if you were just invisible? Have you ever thought you would do anything--", "--to make the teasing stop? Katie Hill had and it nearly tore her apart.", "Katie never felt comfortable in her own skin. She realized very young that a serious mistake had been made; she was a girl who had been born in the body of a boy. Suffocating under her peers' bullying and the mounting pressure to be \"normal,\" Katie tried to take her life at the age of eight years old. After several other failed attempts, she finally understood that \"Katie\"--the girl trapped within her--was determined to live.", "In this first-person account, Katie reflects on her pain-filled childhood and the events leading up to the life-changing decision to undergo gender reassignment as a teenager. She reveals the unique challenges she faced while unlearning how to be a boy and shares what it was like to navigate the dating world and experience heartbreak for the first time in a body that matched her gender identity. Told in an unwaveringly honest voice, ", " is a coming-of-age story about transcending physical appearances and redefining the parameters of \"normalcy\" to embody one's true self."], "author": "Katie Rain Hill", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-30 00:00:00", "ISBN": "1481418238"},
{"url": "https://www.goodreads.com/book/show/30414764-trigger", "num_ratings": "25", "num_reviews": "2", "avg_ratings": 4.84, "genres": ["Poetry", "Queer", "Queer Lit", "Glbt", "Queer", "Lgbt", "Transgender", "Lgbt"], "title": "trigger", "description": ["trigger is a bold, intimate, and comfortable/uncomfortable quest, through Selenite's eyes, in being Black, being queer, being trans, being a woman, and being non-binary in the 21st century, in what continues to be systemic and oppressive, but also adventurous and ecstatic."], "author": "Venus Selenite", "num_pages": "112", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-05-24 00:00:00", "ISBN": "1532804369"},
{"url": "https://www.goodreads.com/book/show/70320.The_Last_Time_I_Wore_a_Dress", "num_ratings": "2,089", "num_reviews": "159", "avg_ratings": 3.84, "genres": ["Autobiography", "Memoir", "Nonfiction", "Glbt", "Queer", "Lgbt", "Gender"], "title": "The Last Time I Wore a Dress", "description": ["At fifteen years old, ", " was committed to a mental institution and awarded the dubious diagnosis of \"Gender Identity Disorder.\" She spent three years--and over a million dollars of insurance--\"treating\" the problem...with makeup lessons and instructions in how to walk like a girl.", "Daphne's story--which is, sadly, not that unusual--has already received attenti", "At fifteen years old, ", " was committed to a mental institution and awarded the dubious diagnosis of \"Gender Identity Disorder.\" She spent three years--and over a million dollars of insurance--\"treating\" the problem...with makeup lessons and instructions in how to walk like a girl.", "Daphne's story--which is, sadly, not that unusual--has already received attention from such shows as ", ", ", ", ", ", and ", ". But her memoir, bound to become a classic, tells the story in a funny, ironic, unforgettable voice that \"isn't all grim; Scholinski tells her story in beautifully evocative prose and mines her experiences for every last drop of ironic humor, determined to have the last laugh.\" (", ")"], "author": "Daphne Scholinski", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-10-01 00:00:00", "ISBN": "1573226963"},
{"url": "https://www.goodreads.com/book/show/33099586-the-red-threads-of-fortune", "num_ratings": "1,172", "num_reviews": "220", "avg_ratings": 4.02, "genres": ["Fantasy", "Fiction", "Novella", "Glbt", "Queer", "Lgbt"], "title": "The Red Threads of Fortune", "description": ["Fallen prophet, master of the elements, and daughter of the supreme Protector, Sanao Mokoya has abandoned the life tha", "Fallen prophet, master of the elements, and daughter of the supreme Protector, Sanao Mokoya has abandoned the life that once bound her. Once her visions shaped the lives of citizens across the land, but no matter what tragedy Mokoya foresaw, she could never reshape the future. Broken by the loss of her young daughter, she now hunts deadly, sky-obscuring naga in the harsh outer reaches of the kingdom with packs of dinosaurs at her side, far from everything she used to love.", "On the trail of a massive naga that threatens the rebellious mining city of Bataanar, Mokoya meets the mysterious and alluring Rider. But all is not as it seems: the beast they both hunt harbors a secret that could ignite war throughout the Protectorate. As she is drawn into a conspiracy of magic and betrayal, Mokoya must come to terms with her extraordinary and dangerous gifts, or risk losing the little she has left to hold dear."], "author": "J.Y.  Yang", "num_pages": "213", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-26 00:00:00", "ISBN": "0765395398"},
{"url": "https://www.goodreads.com/book/show/34138368-before-i-had-the-words", "num_ratings": "170", "num_reviews": "28", "avg_ratings": 4.31, "genres": ["Lgbt", "Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Before I Had the Words: On Being a Transgender Young Adult", "description": ["At the beginning of his physical transition from female to male, then-seventeen-year-old Skylar Kergil posted his first video on YouTube. In the months and years that followed, he recorded weekly update videos about the physical and emotional changes he experienced. Skylar's openness and positivity attracted thousands of viewers, who followed along as his voice deepened an", "At the beginning of his physical transition from female to male, then-seventeen-year-old Skylar Kergil posted his first video on YouTube. In the months and years that followed, he recorded weekly update videos about the physical and emotional changes he experienced. Skylar's openness and positivity attracted thousands of viewers, who followed along as his voice deepened and his body changed shape. Through surgeries and recovery, highs and lows, from high school to college to the real world, Skylar welcomed others on his journey. ", " is the story of what came before the videos and what happened behind the scenes. From early childhood memories to the changes and confusion brought by adolescence, Skylar reflects on coming of age while struggling to understand his gender. As humorous as it is heartbreaking and as informative as it is entertaining, this memoir provides an intimate look at the experience of transitioning from one gender to another. Skylar opens up about the long path to gaining his family's acceptance and to accepting himself, sharing stories along the way about smaller challenges like choosing a new name and learning to shave without eyebrow mishaps. ", "Revealing entries from the author's personal journals as well as interviews with his mother, brother, and friends lend remarkable depth to Skylar's story. A groundbreaking chronicle of change, loss, discovery, pain, and relief, ", " brings new meaning to the phrase \"formative years.\" "], "author": "Skylar Kergil", "num_pages": "257", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-09-05 00:00:00", "ISBN": "1510723064"},
{"url": "https://www.goodreads.com/book/show/18763344-i-am-jazz", "num_ratings": "1,406", "num_reviews": "334", "avg_ratings": 4.13, "genres": ["Childrens", "Picture Books", "Lgbt", "Childrens", "Nonfiction", "Biography"], "title": "I Am Jazz", "description": ["From the time she was two years old, Jazz knew that she had a girl's brain in a boy's body. She loved pink and dressing up as a mermaid and didn't feel like herself in boys' clothing. This confused her family, until they took her to a", "From the time she was two years old, Jazz knew that she had a girl's brain in a boy's body. She loved pink and dressing up as a mermaid and didn't feel like herself in boys' clothing. This confused her family, until they took her to a doctor who said that Jazz was transgender and that she was born that way. Jazz's story is based on her real-life experience and she tells it in a simple, clear way that will be appreciated by picture book readers, their parents, and teachers."], "author": "Jessica Herthel", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-04 00:00:00", "ISBN": "0803741073"},
{"url": "https://www.goodreads.com/book/show/2516768.Transgender_Liberation", "num_ratings": "66", "num_reviews": "2", "avg_ratings": 4.02, "genres": ["Lgbt", "Glbt", "Queer", "Gender", "Nonfiction", "Feminism", "History"], "title": "Transgender Liberation: A Movement Whose Time Has Come", "author": "Leslie Feinberg", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/294808.Hiding_My_Candy", "num_ratings": "427", "num_reviews": "60", "avg_ratings": 3.67, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Lgbt", "Biography", "Autobiography"], "title": "Hiding My Candy", "description": ["After leaping off the pages with he unforgettable debut in John Berendt's bestselling Midnight in the Garden of Good and Evil, the unabashed personality known as The Lady Chablis now brings her irresistible charisma to the remarkable odyssey of fabulousness that USA Today calls \"sassy\" and \"provocative....\" ", "Born Benjamin Edward Knox in Quincy, Florida, \"The Doll\" always kn", "After leaping off the pages with he unforgettable debut in John Berendt's bestselling Midnight in the Garden of Good and Evil, the unabashed personality known as The Lady Chablis now brings her irresistible charisma to the remarkable odyssey of fabulousness that USA Today calls \"sassy\" and \"provocative....\" ", "Born Benjamin Edward Knox in Quincy, Florida, \"The Doll\" always knew she was different. At a Tallahassee club, in her teens, she found the drag mother who would set her on the path to stardom. Before long, The Lady Chablis had a headline drag act replete with trademark saucy wit, down-home wisdom, and, of course, breasts. The rest is \"Miss Thang\" history...."], "author": "The Lady Chablis", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-08-01 00:00:00", "ISBN": "0671520954"},
{"url": "https://www.goodreads.com/book/show/23430487-bad-boy", "num_ratings": "393", "num_reviews": "164", "avg_ratings": 3.7, "genres": ["New Adult", "Contemporary", "Romance", "Lgbt", "Fiction"], "title": "Bad Boy", "description": ["Vlog star Renard Grant has nothing to prove: he’s got a pretty face, chiseled body, and two million adoring video subscribers. Plus the scars on his chest and a prescription for testosterone. Because Ren is transgender: assigned female at birth, living now as male. He films his transition and shares it bravely with the world; his fans love his honesty and positivity.", "But Re", "Vlog star Renard Grant has nothing to prove: he’s got a pretty face, chiseled body, and two million adoring video subscribers. Plus the scars on his chest and a prescription for testosterone. Because Ren is transgender: assigned female at birth, living now as male. He films his transition and shares it bravely with the world; his fans love his honesty and positivity.", "But Ren has been living a double life.", "Off-camera, he’s Cane, the muscle-bound enforcer for social justice vigilante group Black Iris. As Cane, he lets his dark side loose. Hurts those who prey on the disempowered. Indulges in the ugly side of masculinity. And his new partner, Tamsin Baylor, is a girl as rough and relentless as him. Together, they terrorize the trolls into silence.", "But when a routine Black Iris job goes south, Ren is put in the crosshairs. Someone is out to ruin his life. He’s a bad boy, they say, guilty of what he punishes others for.", "Just like every other guy: at heart, he’s a monster, too.", "Now Ren’s got everything to prove. He has to clear his name, and show the world he’s a good man. But that requires facing demons he’s locked away for years. And it might mean discovering he’s not such a good guy after all."], "author": "Elliot Wake", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-12-06 00:00:00", "ISBN": "1501115014"},
{"url": "https://www.goodreads.com/book/show/9541862-nina-here-nor-there", "num_ratings": "469", "num_reviews": "55", "avg_ratings": 3.95, "genres": ["Glbt", "Queer", "Autobiography", "Memoir", "Nonfiction", "Lgbt", "Lgbt", "Transgender", "Gender"], "title": "Nina Here Nor There: My Journey Beyond Gender", "description": [" ", "The next-generation ", "--a contemporary memoir of gender awakening and a classic tale of first love and self-discovery.", "Ambitious, sporty, feminine “capital-", " lesbians” had been Nina Krieger’s type, for friends that is.  She hadn’t dated in seven years, a period of non-stop traveling—searching for w", " ", "The next-generation ", "--a contemporary memoir of gender awakening and a classic tale of first love and self-discovery.", "Ambitious, sporty, feminine “capital-", " lesbians” had been Nina Krieger’s type, for friends that is.  She hadn’t dated in seven years, a period of non-stop traveling—searching for what, or avoiding what, she didn’t know. When she lands in San Francisco’s Castro neighborhood, her roommates introduce her to a whole new world, full of people who identify as queer, who modify their bodies and blur the line between woman and man, who defy everything Nina thought she knew about gender and identity. Despite herself, Nina is drawn to the people she once considered freaks, and before long, she is forging a path that is neither man nor woman, here nor there. This candid and humorous memoir of gender awakening brings readers into the world of the next generation of transgender warriors and tells a classic tale of first love and self-discovery."], "author": "Nick Krieger", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-05-10 00:00:00", "ISBN": "0807000922"},
{"url": "https://www.goodreads.com/book/show/17829061-i-know-very-well-how-i-got-my-name", "num_ratings": "87", "num_reviews": "19", "avg_ratings": 3.79, "genres": ["Lgbt", "Transgender", "Lgbt", "Glbt", "Queer", "Young Adult", "Gender"], "title": "I Know Very Well How I Got My Name", "description": ["The night he loses his virginity, he becomes Dean. Amy Wagner names him—and she would know best. Amy knows all kinds of things that Dean doesn’t understand—things about sex, music, and the darker side of life. All Dean knows is his safe suburban home with his parents, books, and imaginary games. Until now, he’s been able to hide his true identity, even from himself. To the", "The night he loses his virginity, he becomes Dean. Amy Wagner names him—and she would know best. Amy knows all kinds of things that Dean doesn’t understand—things about sex, music, and the darker side of life. All Dean knows is his safe suburban home with his parents, books, and imaginary games. Until now, he’s been able to hide his true identity, even from himself. To the rest of the world, he is a teenage girl—an awkward, boyish teenage girl, but a girl nonetheless. Meeting Amy changes everything. Soon that protected world around him begins to fall apart, and he is left with no other option but to face himself and the truth. ", " chronicles Dean’s clumsy progression through the American public school system. It is the 90’s and early 2000’s, in suburban Syracuse, New York—a world in which LGBTQ bullying is not yet a hot topic in schools, and there is little tolerance for outsiders of any kind. A prequel to the award-winning novel ", ", Elliott DeLine’s second book is about the prevailing myths surrounding bullying and abuse, and the hardships of being young and transgender without a community, support, or a roadmap."], "author": "Elliott DeLine", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-01 00:00:00", "ISBN": "1482797526"},
{"url": "https://www.goodreads.com/book/show/12651419-a-queer-and-pleasant-danger", "num_ratings": "2,254", "num_reviews": "289", "avg_ratings": 3.93, "genres": ["Autobiography", "Memoir", "Nonfiction", "Glbt", "Queer", "Lgbt", "Biography", "Lgbt", "Transgender"], "title": "A Queer and Pleasant Danger: The True Story of a Nice Jewish Boy Who Joins the Church of Scientology and Leaves Twelve Years Later to Become the Lovely Lady She is Today", "description": ["A stunningly original memoir of a nice Jewish boy who joined the Church of Scientology and left twelve years later, ultimately transitioning to a woman. A few years later, she stopped calling herself a woman and became famous as a gender outlaw.", "Kate Bornstein—gender theorist, performance artist, author—is set to change lives with her compelling memoir. Wickedly funny and d", "A stunningly original memoir of a nice Jewish boy who joined the Church of Scientology and left twelve years later, ultimately transitioning to a woman. A few years later, she stopped calling herself a woman and became famous as a gender outlaw.", "Kate Bornstein—gender theorist, performance artist, author—is set to change lives with her compelling memoir. Wickedly funny and disarmingly honest, this is Bornstein's most intimate book yet, encompassing her early childhood and adolescence, college at Brown, a life in the theater, three marriages and fatherhood, the Scientology hierarchy, transsexual life, LGBTQ politics, and life on the road as a sought-after speaker."], "author": "Kate Bornstein", "num_pages": "258", "awards": ["Judy Grahn Award Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-05-01 00:00:00", "ISBN": "0807001651"},
{"url": "https://www.goodreads.com/book/show/280880.Butch_Is_a_Noun", "num_ratings": "922", "num_reviews": "71", "avg_ratings": 3.93, "genres": ["Glbt", "Queer", "Nonfiction", "Lgbt", "Gender", "Writing", "Essays", "Glbt", "Lesbian"], "title": "Butch Is a Noun", "description": ["Written by award-winning playwright and inveterate storyteller S. Bear Bergman, ", " picks up where gender theory leaves off. It makes butchness accessible to those who are new to the concept, and makes gender outlaws of all stripes feel as though they have come home--if home is a place where everyone understands you and approves of your haircut. From girls' clo", "Written by award-winning playwright and inveterate storyteller S. Bear Bergman, ", " picks up where gender theory leaves off. It makes butchness accessible to those who are new to the concept, and makes gender outlaws of all stripes feel as though they have come home--if home is a place where everyone understands you and approves of your haircut. From girls' clothes to men's underwear and what lies beyond, ", " chronicles the pleasures and dangers of living life outside the gender binary."], "author": "S. Bear Bergman", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-30 00:00:00", "ISBN": "097715825X"},
{"url": "https://www.goodreads.com/book/show/12685513-refuse", "num_ratings": "187", "num_reviews": "28", "avg_ratings": 4.05, "genres": ["Glbt", "Queer", "Lgbt", "Transgender", "Lgbt", "Fiction", "Contemporary"], "title": "Refuse", "description": ["Dean, a 22-year old female-to-male-transsexual, is no LGBT poster boy. Unemployed, depressed, mid-transition, friendless, and still living in the upstairs bedroom of his parents' house in a conservative suburb, he can think of little to do but write his memoir. In the third person, he tells the tale of his would-be love affair with his college roommate, Colin, another tran", "Dean, a 22-year old female-to-male-transsexual, is no LGBT poster boy. Unemployed, depressed, mid-transition, friendless, and still living in the upstairs bedroom of his parents' house in a conservative suburb, he can think of little to do but write his memoir. In the third person, he tells the tale of his would-be love affair with his college roommate, Colin, another trans man with a girlfriend and a successful indie rock band. The plot is interrupted intermittently by Dean's first person commentary, often criticizing middle-class conformity-but also the queer counterculture from which he feels equally alienated. He is obsessed with Morrissey of The Smiths and wants nothing in life other than the same level of fame. As his far-fetched dreams become a foreseeable reality, he must decide between honesty and belonging, conformity or isolation, community or self...."], "author": "Elliott DeLine", "num_pages": "217", "awards": ["Rainbow Award (2011)"], "places": [], "character_names": [], "language": null, "publish_date": "2011-04-01 00:00:00", "ISBN": "1463650922"},
{"url": "https://www.goodreads.com/book/show/858394.My_Gender_Workbook", "num_ratings": "1,574", "num_reviews": "67", "avg_ratings": 3.97, "genres": ["Gender", "Glbt", "Queer", "Nonfiction", "Gender", "Gender Studies", "Lgbt", "Feminism", "Lgbt", "Transgender"], "title": "My Gender Workbook: How to Become a Real Man, a Real Woman, the Real You, or Something Else Entirely", "description": ["Kate Bornstein brings theory down to Earth and provides a practical guide to living with or without a gender. The workbook includes quizzes and exercises that determine how much of a man or woman you are, and gives you the tools to reach whatever point you desire on the gender continuum. If you don't think you are transgendered when you sit down to read this book, you will", "Kate Bornstein brings theory down to Earth and provides a practical guide to living with or without a gender. The workbook includes quizzes and exercises that determine how much of a man or woman you are, and gives you the tools to reach whatever point you desire on the gender continuum. If you don't think you are transgendered when you sit down to read this book, you will be by the time you finish it!"], "author": "Kate Bornstein", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-12-18 00:00:00", "ISBN": "0415916739"},
{"url": "https://www.goodreads.com/book/show/8251053-normal-life", "num_ratings": "657", "num_reviews": "45", "avg_ratings": 4.4, "genres": ["Glbt", "Queer", "Nonfiction", "Law", "Lgbt", "Transgender", "Gender", "Lgbt"], "title": "Normal Life: Administrative Violence, Critical Trans Politics and the Limits of Law", "description": ["Wait—what’s wrong with rights?", "Much of the legal advocacy for trans and gender nonconforming people in the US has reflected the civil rights and \"equality\" strategies of mainstream gay and lesbian organizations—agitating for legal reforms that would ostensibly guarantee equal access, nondiscrimination, and equal protection under the law. This approach assumes that the state", "Wait—what’s wrong with rights?", "Much of the legal advocacy for trans and gender nonconforming people in the US has reflected the civil rights and \"equality\" strategies of mainstream gay and lesbian organizations—agitating for legal reforms that would ostensibly guarantee equal access, nondiscrimination, and equal protection under the law. This approach assumes that the state and its legal, policing, and social services apparatus—even its policies and documents of belonging and non-belonging—are neutral and benevolent. While we all have to comply with the gender binaries set forth by regulatory bodies of law and administration, many trans people, especially the most marginalized, are even more at risk for poverty, violence, and premature death by virtue of those same \"neutral\" legal structures.", " raises revelatory critiques of the current strategies pivoting solely on a \"legal rights framework,\" but also points to examples of an organized grassroots trans movement that is demanding the most essential of legal reforms in addition to making more comprehensive interventions into dangerous systems of repression—and the administrative violence that ultimately determines our life chances. Setting forth a politic that goes beyond the quest for mere legal inclusion, ", " is an urgent call for justice and trans liberation, and the radical transformations it will require.", "An attorney, educator, and trans activist, ", " has taught classes on sexual orientation, gender identity, poverty and law at the City University of New York (CUNY), Seattle University, Columbia University, and Harvard. In 2002 he founded the Sylvia Rivera Law Project, a collective that provides free legal services and works to build trans resistance rooted in racial and economic justice."], "author": "Dean Spade", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-06 00:00:00", "ISBN": "0896087964"},
{"url": "https://www.goodreads.com/book/show/1884502.Wanting_in_Arabic", "num_ratings": "63", "num_reviews": "12", "avg_ratings": 4.21, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Lgbt", "Transgender", "Cultural", "Canada"], "title": "Wanting in Arabic", "description": ["Poetry. Braiding theoretic concerns with the ambivalences of sexed and raced identity.WANTING IN ARABIC attempts to traverse the fantasies of foundational loss and aggressive nostalgia in order to further a poetics of a conscious partiality of being, of generous struggle and comic rather than tragic misrecognition. \"Trish Salah's poetic sequence is not simply a narrative o", "Poetry. Braiding theoretic concerns with the ambivalences of sexed and raced identity.WANTING IN ARABIC attempts to traverse the fantasies of foundational loss and aggressive nostalgia in order to further a poetics of a conscious partiality of being, of generous struggle and comic rather than tragic misrecognition. \"Trish Salah's poetic sequence is not simply a narrative of gender change; it's a wandering, thoughtful text, one both fierce and tremulous\"--Erin Moure. \"This is a beautiful and disturbing collection of poems, writing from the uncharted langscape of the third sex\"--Mary Di Michele."], "author": "Trish Salah", "num_pages": "90", "awards": ["Lambda Literary Award for Transgender Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "1894770005"},
{"url": "https://www.goodreads.com/book/show/217306.Transgender_Warriors", "num_ratings": "1,572", "num_reviews": "72", "avg_ratings": 3.99, "genres": ["Glbt", "Queer", "History", "Nonfiction", "Lgbt", "Gender", "Lgbt", "Transgender"], "title": "Transgender Warriors: Making History from Joan of Arc to Dennis Rodman", "description": ["With a New Afterword by the Author"], "author": "Leslie Feinberg", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-06-30 00:00:00", "ISBN": "0807079413"},
{"url": "https://www.goodreads.com/book/show/24271389-otros-valles", "num_ratings": "31", "num_reviews": "11", "avg_ratings": 4.74, "genres": ["Lgbt", "Fiction", "Lgbt", "Transgender", "Glbt", "Queer"], "title": "Otros valles", "description": ["Moving cyclically, shifting with the changing of the weather, the novel is composed of story fragments that follow half a year in the life of a trans Latina living on the Texas/Tamaulipas border. It is, at turns: a literary novel that reflects on the act of writing poetry; a sci-fi novel that describes the unreal consequences of the surveillance and militarization of the b", "Moving cyclically, shifting with the changing of the weather, the novel is composed of story fragments that follow half a year in the life of a trans Latina living on the Texas/Tamaulipas border. It is, at turns: a literary novel that reflects on the act of writing poetry; a sci-fi novel that describes the unreal consequences of the surveillance and militarization of the border; a trans lesbian erotic novel and catalog of fantasies; a trans woman's memoir that relates her struggles to be accepted by her family, find community in the deep South, and untangle the shame around her body and her nonbinary identity; a political novel that critically examines the role of race in the narrator's communities and in her own life as a non-Black Latina learning about anti-Blackness; a Latin@ slice-of-life novel that is steeped in the culture, folklore, and supernatural reality of a Mexican family living on the border."], "author": "Jamie Berrout", "num_pages": "151", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/534753.Exile_and_Pride", "num_ratings": "1,348", "num_reviews": "99", "avg_ratings": 4.32, "genres": ["Glbt", "Queer", "Disability", "Nonfiction", "Lgbt", "Autobiography", "Memoir"], "title": "Exile and Pride: Disability, Queerness, and Liberation", "description": ["“Eli Clare works a vital alchemy. . . . Using the language of the elemental world, he delineates a complex human intersection and transmutes cruelty into its opposite—a potent, lifegiving remedy.”—Alison Bechdel, author of ", "First published in 1999, ", " established Eli Clare as one of the leading writers on the intersections of queerness and disability.", "“Eli Clare works a vital alchemy. . . . Using the language of the elemental world, he delineates a complex human intersection and transmutes cruelty into its opposite—a potent, lifegiving remedy.”—Alison Bechdel, author of ", "First published in 1999, ", " established Eli Clare as one of the leading writers on the intersections of queerness and disability. With this critical tenth-anniversary edition, the groundbreaking publication secures its position as essential to the history of queer and disability politics, and, through significant new material that boldly interrogates and advances the original text, to its future as well. Clare’s writing on his experiences as a genderqueer activist/writer with cerebral palsy permanently changed the landscape of disability politics and queer liberation, and yet ", " is much too great in scope to be defined by even these two issues. Instead it offers an intersectional framework for understanding how our bodies actually experience the politics of oppression, power, and resistance. At the heart of Clare’s exploration of environmental destruction, white working-class identity, queer community, disabled sexuality, childhood sexual abuse, coalition politics, and his own gender transition is a call for social justice movements that are truly accessible for everyone.", "Blending prose and theory, personal experience and political debate, anger and compassion, ", " provides a window into a world where our whole selves in all their complexity can be loved and accepted.", "An award-winning poet and essayist, Eli Clare is also the author of ", "."], "author": "Eli Clare", "num_pages": "147", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-09-01 00:00:00", "ISBN": "0896086054"},
{"url": "https://www.goodreads.com/book/show/30279514-dreadnought", "num_ratings": "2,756", "num_reviews": "749", "avg_ratings": 4.16, "genres": ["Fantasy", "Young Adult", "Lgbt", "Comics", "Superheroes", "Glbt", "Queer"], "title": "Dreadnought", "description": ["Until Dreadnought fell out of the sky and died right in front of her, Danny was trying to keep people from finding out she’s transgender. But before he expired, Dreadnought passed his mantle to her, and those secondhand superpowers transformed Danny’s body into what she’", "Until Dreadnought fell out of the sky and died right in front of her, Danny was trying to keep people from finding out she’s transgender. But before he expired, Dreadnought passed his mantle to her, and those secondhand superpowers transformed Danny’s body into what she’s always thought it should be. Now there’s no hiding that she’s a girl. ", "It should be the happiest time of her life, but Danny’s first weeks finally living in a body that fits her are more difficult and complicated than she could have imagined. Between her father’s dangerous obsession with “curing” her girlhood, her best friend suddenly acting like he’s entitled to date her, and her fellow superheroes arguing over her place in their ranks, Danny feels like she’s in over her head.", "She doesn’t have much time to adjust. Dreadnought’s murderer—a cyborg named Utopia—still haunts the streets of New Port City, threatening destruction. If Danny can’t sort through the confusion of coming out, master her powers, and stop Utopia in time, humanity faces extinction."], "author": "April  Daniels", "num_pages": "276", "awards": ["Lambda Literary Award Nominee for LGBTQ Children’s/Young Adult (2018)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-01-24 00:00:00", "ISBN": "1682300684"},
{"url": "https://www.goodreads.com/book/show/16157123-troubling-the-line", "num_ratings": "110", "num_reviews": "16", "avg_ratings": 4.51, "genres": ["Poetry", "Glbt", "Queer", "Lgbt", "Lgbt", "Transgender", "Gender", "Queer", "Queer Lit"], "title": "Troubling the Line: Trans and Genderqueer Poetry and Poetics", "description": ["The first of its kind, ", " gathers together a diverse range of 55 poets with varying aesthetics and backgrounds. In addition to generous samples of poetry by each trans writer, the book also includes “poetics statements”—reflections by each poet that provide context for their work covering a range of issues from ide", "The first of its kind, ", " gathers together a diverse range of 55 poets with varying aesthetics and backgrounds. In addition to generous samples of poetry by each trans writer, the book also includes “poetics statements”—reflections by each poet that provide context for their work covering a range of issues from identification and embodiment to language and activism.", "Poets in ", ": Ahimsa Timoteo Bodhrán, Aimee Herman, Amir Rabiyah, Ari Banias, Ariel Goldberg, Bo Luengsuraswat, CAConrad, Ching-In Chen, Cole Krawitz, D’Lo, David Wolach, Dawn Lundy Martin, Drew Krewer, Duriel E. Harris, EC Crandall, Eileen Myles, Eli Clare, Ely Shipley, Emerson Whitney, Eric Karin, Fabian Romero, Gr Keer, HR Hegnauer, J. Rice, j/j hastain, Jaime Shearn Coan, Jake Pam Dick, Jen (Jay) Besemer, Jenny Johnson, John Wieners, Joy Ladin, Julian Talamantez Brolaski, kari edwards, Kit Yan, Laura Neuman, Lilith Latini, Lizz Bronson, Lori Selke, Max Wolf Valerio, Meg Day, Micha Cárdenas, Monica / Nico Peck, Natro, Oliver Bendorf, Reba Overkill, Samuel Ace, Stacey Waite, Stephen Burt, TC Tolbert, Tim Trace Peterson, Trish Salah, TT Jax, Y. Madrone, Yosmay del Mazo & Zoe Tuck. ", "TC Tolbert, a genderqueer, feminist poet and teacher committed to social justice, is the author of territories of ", ", ", ", and the forthcoming ", ". Tolbert lives in Tucson.", "Tim Trace Peterson is a poet, critic, and editor. The author of ", " and ", ", Peterson is co-editor of the forthcoming ", " and lives in Brooklyn."], "author": "T.C. Tolbert", "num_pages": "544", "awards": ["Lambda Literary Award Nominee for LGBT Anthology (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-16 00:00:00", "ISBN": "1937658104"},
{"url": "https://www.goodreads.com/book/show/32620327-surpassing-certainty", "num_ratings": "1,136", "num_reviews": "148", "avg_ratings": 4.27, "genres": ["Autobiography", "Memoir", "Nonfiction", "Lgbt", "Feminism", "Biography"], "title": "Surpassing Certainty: What My Twenties Taught Me", "description": ["Riveting, rousing, and utterly real, ", " is a portrait of a young woman searching for her purpose and place in the world—without a road map to guide her.", "The journey begins a few months before her twentieth birthday. Janet Mock is adjusting to her days as a first-generation college student at the University of Hawaii and her nights as a dancer at a strip cl", "Riveting, rousing, and utterly real, ", " is a portrait of a young woman searching for her purpose and place in the world—without a road map to guide her.", "The journey begins a few months before her twentieth birthday. Janet Mock is adjusting to her days as a first-generation college student at the University of Hawaii and her nights as a dancer at a strip club. Finally content in her body, she vacillates between flaunting and concealing herself as she navigates dating and disclosure, sex and intimacy, and most important, letting herself be truly ", ". Under the neon lights of Club Nu, Janet meets Troy, a yeoman stationed at Pearl Harbor naval base, who becomes her ", ". The pleasures and perils of their union serve as a backdrop for Janet’s progression through her early twenties with all the universal growing pains—falling in and out of love, living away from home, and figuring out what she wants to ", "with her life.", "Despite her disadvantages, fueled by her dreams and inimitable drive, Janet makes her way through New York City while holding her truth close. She builds a career in the highly competitive world of magazine publishing—within the unique context of being trans, a woman, and a person of color.", "Long before she became one of the world’s most respected media figures and lauded leaders for equality and justice, Janet was a girl taking the time she needed to just ", "—to learn how to advocate for herself before becoming an advocate for others. As you witness Janet’s slow-won success and painful failures, ", "will embolden you, shift the way you see others, and affirm your journey in search of self."], "author": "Janet Mock", "num_pages": "256", "awards": ["Lambda Literary Award Nominee for Transgender Noniction (2018)"], "places": [], "character_names": [], "language": null, "publish_date": "2017-06-13 00:00:00", "ISBN": "1501145797"},
{"url": "https://www.goodreads.com/book/show/25325267-yemaya-s-daughters", "num_ratings": "8", "num_reviews": "2", "avg_ratings": 4.13, "genres": ["Lgbt", "Transgender", "Lgbt", "Fiction", "Speculative Fiction", "Glbt", "Queer"], "title": "Yemaya’s Daughters", "description": ["Inanna Au-Set Oya, a trans woman, priestess, and storyteller with deep connections to the goddess, emerges from a province in Africa untouched by colonialist hands to find a world twisted with misconception and pain. She and her sisters choose to go forth and correct the imbalances found by ushering in an age of love and worth.", "Maryam, mother of Jesus, holds fast to her con", "Inanna Au-Set Oya, a trans woman, priestess, and storyteller with deep connections to the goddess, emerges from a province in Africa untouched by colonialist hands to find a world twisted with misconception and pain. She and her sisters choose to go forth and correct the imbalances found by ushering in an age of love and worth.", "​", "Maryam, mother of Jesus, holds fast to her convictions when from tragedy is born a new god. Without sisters, or guidance for her choices, she finds a world under Roman foot and is determined to create a spiritual revolt that will create ripples for ages to come.", "​", " tells the tale of two different women with but one goal in mind: how best to change the world without losing themselves in the process."], "author": "Dane Figueroa Edidi", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/54935.She_s_Not_There", "num_ratings": "8,213", "num_reviews": "756", "avg_ratings": 3.92, "genres": ["Autobiography", "Memoir", "Nonfiction", "Lgbt", "Gender", "Glbt", "Queer"], "title": "She's Not There: A Life in Two Genders", "description": ["The exuberant memoir of a man named James who became a woman named Jenny. ", "She’s Not There is the story of a person changing genders, the story of a person bearing and finally revealing a complex secret; above all, it is a love story.", "By turns funny and deeply moving, Jennifer Finney Boylan explores the remarkable territory that lies between men and women, examines changing", "The exuberant memoir of a man named James who became a woman named Jenny. ", "She’s Not There is the story of a person changing genders, the story of a person bearing and finally revealing a complex secret; above all, it is a love story.", "By turns funny and deeply moving, Jennifer Finney Boylan explores the remarkable territory that lies between men and women, examines changing friendships, and rejoices in the redeeming power of family. She’s Not There is a portrait of a loving marriage—the love of James for his wife, Grace, and, against all odds, the enduring love of Grace for the woman who becomes her \"sister,\" Jenny.", "To this extraordinary true story, Boylan brings the humorous, fresh voice that won her accolades as one of the best comic novelists of her generation. With her distinctive and winning perspective, She’s Not There explores the dramatic outward changes and unexpected results of life as a woman: Jenny fights the urge to eat salad, while James consumed plates of ribs; gone is the stability of \"one damn mood, all the damn time.\"", "While Boylan’s own secret was unusual, to say the least, she captures the universal sense of feeling uncomfortable, out of sorts with the world, and misunderstood by her peers. Jenny is supported on her journey by her best friend, novelist Richard Russo, who goes from begging his friend to \"Be a man\" (in every sense of the word) to accepting her as an attractive, buoyant woman. \"The most unexpected thing,\" Russo writes in his Afterword to the book, \"is in how Jenny’s story we recognize our shared humanity.\"", "As James evolves into Jennifer in scenes that are by turns tender, startling, and witty, a marvelously human perspective emerges on issues of love, sex, and the fascinating relationship between our physical and our intuitive selves. Through the clear eyes of a truly remarkable woman, She’s Not There provides a new window on the often confounding process of accepting ourselves."], "author": "Jennifer Finney Boylan", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-08-10 00:00:00", "ISBN": "0767914295"},
{"url": "https://www.goodreads.com/book/show/138215.Nobody_Passes", "num_ratings": "2,222", "num_reviews": "135", "avg_ratings": 4.01, "genres": ["Nonfiction", "Glbt", "Queer", "Gender", "Feminism", "Lgbt", "Writing", "Essays"], "title": "Nobody Passes: Rejecting the Rules of Gender and Conformity", "description": [" is a collection of essays that confronts and challenges the very notion of belonging. By examining the perilous intersections of identity, categorization, and community, contributors challenge societal mores and countercultural norms. ", " explores and critiques the various systems of power seen (or not seen) in the act of “passing.” In a pass-fail s", " is a collection of essays that confronts and challenges the very notion of belonging. By examining the perilous intersections of identity, categorization, and community, contributors challenge societal mores and countercultural norms. ", " explores and critiques the various systems of power seen (or not seen) in the act of “passing.” In a pass-fail situation, standards for acceptance may vary, but somebody always gets trampled on. This anthology seeks to eliminate the pressure to pass and thereby unearth the delicious and devastating opportunities for transformation that might create.", "Mattilda, aka Matt Bernstein Sycamore, has a history of editing anthologies based on brazen nonconformity and gender defiance. Mattilda sets out to ask the question, “What lies are people forced to tell in order to gain acceptance as 'real'.” The answers are as varied as the life experiences of the writers who tackle this urgent and essential topic."], "author": "Mattilda Bernstein Sycamore", "num_pages": "354", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-27 00:00:00", "ISBN": "1580051847"},
{"url": "https://www.goodreads.com/book/show/29612732-an-anthology-of-fiction-by-trans-women-of-color", "num_ratings": "26", "num_reviews": "11", "avg_ratings": 4.46, "genres": ["Fiction", "Short Stories", "Lgbt", "Transgender", "Lgbt", "Anthologies", "Glbt", "Queer"], "title": "An Anthology of Fiction by Trans Women of Color", "description": ["This anthology is something new: a collection of stories written, edited, and self-published by trans women of color working collectively to equally share the fruits of our work. ", "The stories in this anthology confront major themes and issues in the lives of trans women of color with profound honesty and attention toward helping one another heal. A story like “The Girl and", "This anthology is something new: a collection of stories written, edited, and self-published by trans women of color working collectively to equally share the fruits of our work. ", "The stories in this anthology confront major themes and issues in the lives of trans women of color with profound honesty and attention toward helping one another heal. A story like “The Girl and the Apple,” by Jasmine Kabale Moore, not only unflinchingly describes the sense of ever-present danger that many of us feel in public spaces (including the hyper-vigilant condition of trauma that results from repeated exposure to intense scrutiny and violence) it also provides invaluable emotional support to other trans women of color by accurately reflecting, and therefore validating, our experiences and our perceptions of reality.", "A number of other stories explore their own kinds of traumas and begin to show us a way to survive them, a day at a time. In contrast, there are also stories in our anthology that take up a completely different subject matter – genre fantasies, memories and the past, self-acceptance, relationships with family and friends, romance and intimacy, and language itself – but they do so in the specific context of our lives as trans women of color."], "author": "Ellyn Peña", "num_pages": "182", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/29467305-tranny", "num_ratings": "3,979", "num_reviews": "434", "avg_ratings": 4.25, "genres": ["Nonfiction", "Music", "Autobiography", "Memoir", "Lgbt", "Glbt", "Queer"], "title": "Tranny: Confessions of Punk Rock's Most Infamous Anarchist Sellout", "description": ["The provocative transgender advocate and lead singer of the punk rock band Against Me! provides a searing account of her search for identity and her true self. It began in a bedroom in Naples, Florida, when a misbehaving punk teenager named Tom Gabel, armed with nothing but an acoustic guitar and a headful of anarchi", "The provocative transgender advocate and lead singer of the punk rock band Against Me! provides a searing account of her search for identity and her true self. It began in a bedroom in Naples, Florida, when a misbehaving punk teenager named Tom Gabel, armed with nothing but an acoustic guitar and a headful of anarchist politics, landed on a riff. Gabel formed Against Me! and rocketed the band from its scrappy beginnings-banging on a drum kit made of pickle buckets-to a major-label powerhouse that critics have called this generation's The Clash. Since its inception in 1997, Against Me! has been one of punk's most influential modern bands, but also one of its most divisive. With every notch the four-piece climbed in their career, they gained new fans while infuriating their old ones. They suffered legal woes, a revolving door of drummers, and a horde of angry, militant punks who called them \"sellouts\" and tried to sabotage their shows at every turn. But underneath the public turmoil, something much greater occupied Gabel-a secret kept for 30 years, only acknowledged in the scrawled-out pages of personal journals and hidden in lyrics. Through a troubled childhood, delinquency, and struggles with drugs, Gabel was on a punishing search for identity. Not until May of 2012 did a ", " profile finally reveal it: Gabel is a transsexual, and would from then on be living as a woman under the name Laura Jane Grace. ", " is the intimate story of Against Me!'s enigmatic founder, weaving the narrative of the band's history, as well as Grace's, with dozens of never-before-seen entries from the piles of journals Grace kept. More than a typical music memoir about sex, drugs, and rock 'n' roll-although it certainly has plenty of that-", " is an inside look at one of the most remarkable stories in the history of rock."], "author": "Laura Jane Grace", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-11-15 00:00:00", "ISBN": "0316387959"},
{"url": "https://www.goodreads.com/book/show/33358438-peter-darling", "num_ratings": "2,350", "num_reviews": "749", "avg_ratings": 4.11, "genres": ["Fantasy", "Lgbt", "Romance", "Retellings", "Romance", "M M Romance"], "title": "Peter Darling", "description": ["Ten years ago, Peter Pan left Neverland to grow up, leaving behind his adolescent dreams of boyhood and resigning himself to life as Wendy Darling. Growing up, however, has only made him realize how inescapable his identity as a man is.", "But when he returns to Neverland, everything has changed: the Lost Boys have become men, and the war games they once played are now real an", "Ten years ago, Peter Pan left Neverland to grow up, leaving behind his adolescent dreams of boyhood and resigning himself to life as Wendy Darling. Growing up, however, has only made him realize how inescapable his identity as a man is.", "But when he returns to Neverland, everything has changed: the Lost Boys have become men, and the war games they once played are now real and deadly. Even more shocking is the attraction Peter never knew he could feel for his old rival, Captain Hook—and the realization that he no longer knows which of them is the real villain."], "author": "Austin Chant", "num_pages": "164", "awards": ["Rainbow Award for Best Transgender - Sci-Fi / Futuristic, Paranormal Romance, Fantasy & Fantasy Romance (2nd Place) & for Best Transgender Debut (2nd Place) (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-15 00:00:00", "ISBN": "1620049589"},
{"url": "https://www.goodreads.com/book/show/22451466-i-ve-got-a-time-bomb", "num_ratings": "121", "num_reviews": "22", "avg_ratings": 4.36, "genres": ["Fiction", "Glbt", "Queer", "Lgbt", "Lgbt", "Transgender", "Gender", "Novels"], "title": "I’ve Got a Time Bomb", "description": ["On her way home from a gay wedding, Sybil’s eponymous protagonist is ambushed, beaten, and left for dead on the train tracks. Days later, Sybil awakens in a hospital and finds her skull has been reconstructed, but it quickly becomes clear that her version of “normal” and “reality” may have been permanently altered. When she falls in love with a very beautiful, but very mar", "On her way home from a gay wedding, Sybil’s eponymous protagonist is ambushed, beaten, and left for dead on the train tracks. Days later, Sybil awakens in a hospital and finds her skull has been reconstructed, but it quickly becomes clear that her version of “normal” and “reality” may have been permanently altered. When she falls in love with a very beautiful, but very married, actress, Sybil does what comes naturally: she presents the object of her affection with a homemade explosive device, and then abruptly leaves town.", "I’ve Got A Time Bomb chronicles her surrealistic journey living among the loners, losers, and leave-behinds in the dark corners of Amerika."], "author": "Sybil Lamb", "num_pages": "350", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-12 00:00:00", "ISBN": "1627290117"},
{"url": "https://www.goodreads.com/book/show/33142375-eric-olafson", "num_ratings": "96", "num_reviews": "25", "avg_ratings": 4.0, "genres": ["Glbt", "Queer", "Science Fiction"], "title": "Eric Olafson : Space Pirate", "description": ["It's the year 5021 and the Milky Way Galaxy is teeming with life and exotic species. The majority of the known civilisations have formed a multi-cultural mega organization called the United Stars of Galaxies. This Union is protected by the brave men and women of the United Stars Space fleet against external threats.", "Eric Olafson, born and raised under harsh conditions of th", "It's the year 5021 and the Milky Way Galaxy is teeming with life and exotic species. The majority of the known civilisations have formed a multi-cultural mega organization called the United Stars of Galaxies. This Union is protected by the brave men and women of the United Stars Space fleet against external threats.", "Eric Olafson, born and raised under harsh conditions of the traditional and inward looking society of Nilfeheim, left his planet to fulfil his dreams of becoming a Starship captain.", "When Eric gets kidnaped by an unknown organization and brought to Sin4, he slowly starts to discover his central role in an ancient conflict of cosmic proportions."], "author": "Vanessa Ravencroft", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-02-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22523264-decolonizing-trans-gender-101", "num_ratings": "95", "num_reviews": "10", "avg_ratings": 4.33, "genres": ["Glbt", "Queer", "Gender", "Nonfiction", "Lgbt", "Transgender", "Race", "Philosophy", "Theory", "Lgbt", "Feminism", "Gender", "Gender Studies", "Gender and Sexuality"], "title": "Decolonizing Trans/Gender 101", "description": ["tired of reading yet another trans/gender 101 entirely centered around white people and their normative narratives? tired of feeling like you must be _this_ tall to be trans enough to belong in the community ? tired of feeling like the white trans community is erasing your experiences? having gender feels but not understanding how they fit into the current white hegemonic", "tired of reading yet another trans/gender 101 entirely centered around white people and their normative narratives? tired of feeling like you must be _this_ tall to be trans enough to belong in the community ? tired of feeling like the white trans community is erasing your experiences? having gender feels but not understanding how they fit into the current white hegemonic discourse on gender? decolonizing trans/gender 101 is a short, accessible (and non-academic) critique of many of the fundamental concepts in white trans/gender theory and discourse. written for the indigenous and/or person of colour trying to understand how their gender is/has been impacted by whiteness and colonialism."], "author": "b. binaohan", "num_pages": "152", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-06-01 00:00:00", "ISBN": "0993793517"},
{"url": "https://www.goodreads.com/book/show/15713728-the-collection", "num_ratings": "294", "num_reviews": "49", "avg_ratings": 4.1, "genres": ["Glbt", "Queer", "Short Stories", "Fiction", "Lgbt", "Transgender", "Lgbt", "Gender"], "title": "The Collection: Short Fiction from the Transgender Vanguard", "description": ["A dynamic composite of rising stars, The Collection represents the depth and range of tomorrow’s finest writers chronicling transgender narratives. 28 authors from North America converge in a single volume to showcase the future of trans literature and the next great movements in queer art."], "author": "Tom Léger", "num_pages": "364", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-16 00:00:00", "ISBN": "0983242208"},
{"url": "https://www.goodreads.com/book/show/22050397-a-safe-girl-to-love", "num_ratings": "650", "num_reviews": "106", "avg_ratings": 4.26, "genres": ["Short Stories", "Glbt", "Queer", "Fiction", "Lgbt", "Lgbt", "Transgender"], "title": "A Safe Girl to Love", "description": ["Eleven unique short stories that stretch from a rural Canadian Mennonite town to a hipster gay bar in Brooklyn, featuring young trans women stumbling through loss, sex, harassment, and love.", "These stories, shiny with whiskey and prairie sunsets, rattling subways and neglected cats, show growing up as a trans girl can be charming, funny, frustrating, or sad, but never will i", "Eleven unique short stories that stretch from a rural Canadian Mennonite town to a hipster gay bar in Brooklyn, featuring young trans women stumbling through loss, sex, harassment, and love.", "These stories, shiny with whiskey and prairie sunsets, rattling subways and neglected cats, show growing up as a trans girl can be charming, funny, frustrating, or sad, but never will it be predictable."], "author": "Casey Plett", "num_pages": "229", "awards": ["Lambda Literary Award for Transgender Fiction (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-16 00:00:00", "ISBN": "1627290052"},
{"url": "https://www.goodreads.com/book/show/18406194-gender-failure", "num_ratings": "1,157", "num_reviews": "129", "avg_ratings": 4.33, "genres": ["Nonfiction", "Glbt", "Queer", "Autobiography", "Memoir", "Lgbt", "Gender", "Lgbt", "Transgender"], "title": "Gender Failure", "description": ["\"Being a girl was something that never really happened for me.\"—Rae Spoon", "Ivan E. Coyote and Rae Spoon are accomplished, award-winning writers, musicians, and performers; they are also both admitted \"gender failures.\" In their first collaborative book, Ivan and Rae explore and expose their failed attempts at fitting into the gender binary, and how ultimately our expectation", "\"Being a girl was something that never really happened for me.\"—Rae Spoon", "Ivan E. Coyote and Rae Spoon are accomplished, award-winning writers, musicians, and performers; they are also both admitted \"gender failures.\" In their first collaborative book, Ivan and Rae explore and expose their failed attempts at fitting into the gender binary, and how ultimately our expectations and assumptions around traditional gender roles fail us all.", "Based on their acclaimed 2012 live show that toured across the United States and in Europe, ", " is a poignant collection of autobiographical essays, lyrics, and images documenting Ivan and Rae's personal journeys from gender failure to gender enlightenment. Equal parts hilarious and heartbreaking, it's a book that will touch LGBTQ readers and others, revealing, with candor and insight, that gender comes in more than two sizes.", " is the author of six story collections and the award-winning novel ", ", and is co-editor of ", ". Ivan frequently performs at high schools, universities, and festivals across North America.", " is a transgender indie musician whose most recent CD is ", ", which is also the title of a new National Film Board of Canada documentary about them. Rae's first book, ", ", was a Lambda Literary Award finalist in 2013."], "author": "Ivan E. Coyote", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-08 00:00:00", "ISBN": "1551525364"},
{"url": "https://www.goodreads.com/book/show/24612624-george", "num_ratings": "19,457", "num_reviews": "4,032", "avg_ratings": 4.02, "genres": ["Childrens", "Middle Grade", "Lgbt", "Contemporary", "Realistic Fiction", "Fiction", "Young Adult", "Childrens"], "title": "George", "description": ["BE WHO YOU ARE. When people look at George, they think they see a boy. But she knows she's not a boy. She knows she's a girl.", "George thinks she'll have to keep this a secret forever. Then her teacher announces that their class play is going to be Charlotte's Web. George really, really, REALLY wants to play Charlotte. But the teacher says she can't even try out for the part.", "BE WHO YOU ARE. When people look at George, they think they see a boy. But she knows she's not a boy. She knows she's a girl.", "George thinks she'll have to keep this a secret forever. Then her teacher announces that their class play is going to be Charlotte's Web. George really, really, REALLY wants to play Charlotte. But the teacher says she can't even try out for the part... because she's a boy.", "With the help of her best friend, Kelly, George comes up with a plan. Not just so she can be Charlotte – but so everyone can know who she is, once and for all."], "author": "Alex Gino", "num_pages": "195", "awards": ["Stonewall Book Award for Children's (2016)", "California Book Award for Juvenile (Gold) (2015)", "Dorothy Canfield Fisher Children's Book Award Nominee (2017)", "Goodreads Choice Award Nominee for Middle Grade & Children's (2015)", "NCTE Charlotte Huck Award Nominee (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-25 00:00:00", "ISBN": "0545812542"},
{"url": "https://www.goodreads.com/book/show/2420983.Transgender_History", "num_ratings": "1,505", "num_reviews": "112", "avg_ratings": 4.07, "genres": ["History", "Nonfiction", "Glbt", "Queer", "Lgbt", "Gender", "Lgbt", "Transgender"], "title": "Transgender History", "description": ["Covering American transgender history from the mid-twentieth century to today, ", " takes a chronological approach to the subject of transgender history, with each chapter covering major movements, writings, and events. Chapters cover the transsexual and transvestite communities in the years following World War II; trans radicalism and social change, which s", "Covering American transgender history from the mid-twentieth century to today, ", " takes a chronological approach to the subject of transgender history, with each chapter covering major movements, writings, and events. Chapters cover the transsexual and transvestite communities in the years following World War II; trans radicalism and social change, which spanned from 1966 with the publication of ", " and lasted through the early 1970s; the mid-'70s to 1990-the era of identity politics and the changes witnessed in trans circles through these years; and the gender issues witnessed through the '90s and '00s. ", " includes informative sidebars highlighting quotes from major texts and speeches in transgender history and brief biographies of key players, plus excerpts from transgender memoirs and discussion of treatments of transgenderism in popular culture. "], "author": "Susan Stryker", "num_pages": "208", "awards": ["Lambda Literary Award Nominee for Transgender (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-05-06 00:00:00", "ISBN": "158005224X"},
{"url": "https://www.goodreads.com/book/show/7922146-gender-outlaws", "num_ratings": "2,168", "num_reviews": "128", "avg_ratings": 4.06, "genres": ["Nonfiction", "Glbt", "Queer", "Gender", "Lgbt", "Feminism", "Lgbt", "Transgender"], "title": "Gender Outlaws: The Next Generation", "description": ["In the 15 years since the release of ", " Kate Bornstein's groundbreaking challenge to gender ideology, transgender narratives have made their way from the margins to the mainstream and back again. Today's transgenders and other sex/gender radicals are writing a drastically new world into being. In ", " Bornstein, together with writer, raconteur, and t", "In the 15 years since the release of ", " Kate Bornstein's groundbreaking challenge to gender ideology, transgender narratives have made their way from the margins to the mainstream and back again. Today's transgenders and other sex/gender radicals are writing a drastically new world into being. In ", " Bornstein, together with writer, raconteur, and theater artist S. Bear Bergman, collects and contextualizes the work of this generation's trans and genderqueer forward thinkers — new voices from the stage, on the streets, in the workplace, in the bedroom, and on the pages and websites of the world's most respected mainstream news sources. ", " includes essays, commentary, comic art, and conversations from a diverse group of trans-spectrum people who live and believe in barrier-breaking lives."], "author": "Kate Bornstein", "num_pages": "304", "awards": ["Lambda Literary Award for Transgender Nonfiction (Nominee), LGBT Anthology (2011)", "Publishing Triangle Judges’ Special Award in Nonfiction (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-31 00:00:00", "ISBN": "1580053084"},
{"url": "https://www.goodreads.com/book/show/26156987-if-i-was-your-girl", "num_ratings": "19,498", "num_reviews": "3,466", "avg_ratings": 4.01, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance", "Fiction"], "title": "If I Was Your Girl", "description": ["A new kind of big-hearted novel about being seen for who you really are.", "Amanda Hardy is the new girl in school. Like anyone else, all she wants is to make friends and fit in. But Amanda is keeping a secret, and she's determined not to get too close to anyone. ", "But when she meets sweet, easygoing Grant, Amanda can't help but start to let him into her life. As they spend more", "A new kind of big-hearted novel about being seen for who you really are.", "Amanda Hardy is the new girl in school. Like anyone else, all she wants is to make friends and fit in. But Amanda is keeping a secret, and she's determined not to get too close to anyone. ", "But when she meets sweet, easygoing Grant, Amanda can't help but start to let him into her life. As they spend more time together, she realizes just how much she is losing by guarding her heart. She finds herself yearning to share with Grant everything about herself, including her past. But Amanda's terrified that once she tells him the truth, he won't be able to see past it. ", "Because the secret that Amanda's been keeping? It's that at her old school, she used to be Andrew. Will the truth cost Amanda her new life, and her new love? ", "Meredith Russo's If I Was Your Girl is a universal story about feeling different and a love story that everyone will root for."], "author": "Meredith Russo", "num_pages": "280", "awards": ["Stonewall Book Award for Young Adult Literature (2017)", "Milwaukee County Teen Book Award Nominee (2017)", "Goodreads Choice Award Nominee for Young Adult Fiction (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-03 00:00:00", "ISBN": "1250078407"},
{"url": "https://www.goodreads.com/book/show/605663.Whipping_Girl", "num_ratings": "5,048", "num_reviews": "426", "avg_ratings": 4.2, "genres": ["Nonfiction", "Feminism", "Glbt", "Queer", "Gender", "Lgbt"], "title": "Whipping Girl: A Transsexual Woman on Sexism and the Scapegoating of Femininity", "description": ["A provocative manifesto, ", "tells the powerful story of Julia Serano, a transsexual woman whose supremely intelligent writing reflects her diverse background as a lesbian transgender activist and professional biologist. Serano shares her experiences and observations—both pre- and post-transition—to reveal the ways in which fear, suspicion, and dismissiveness tow", "A provocative manifesto, ", "tells the powerful story of Julia Serano, a transsexual woman whose supremely intelligent writing reflects her diverse background as a lesbian transgender activist and professional biologist. Serano shares her experiences and observations—both pre- and post-transition—to reveal the ways in which fear, suspicion, and dismissiveness toward femininity shape our societal attitudes toward trans women, as well as gender and sexuality as a whole.", "Serano's well-honed arguments stem from her ability to bridge the gap between the often-disparate biological and social perspectives on gender. She exposes how deep-rooted the cultural belief is that femininity is frivolous, weak, and passive, and how this “feminine” weakness exists only to attract and appease male desire.", "In addition to debunking popular misconceptions about transsexuality, Serano makes the case that today's feminists and transgender activist must work to embrace and empower femininity—in all of its wondrous forms."], "author": "Julia Serano", "num_pages": "390", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-14 00:00:00", "ISBN": "1580051545"},
{"url": "https://www.goodreads.com/book/show/139569.Stone_Butch_Blues", "num_ratings": "15,456", "num_reviews": "856", "avg_ratings": 4.29, "genres": ["Glbt", "Queer", "Fiction", "Lgbt", "Feminism", "Gender"], "title": "Stone Butch Blues", "description": ["Woman or man? This internationally acclaimed novel looks at the world through the eyes of Jess Goldberg, a masculine girl growing up in the \"Ozzie and Harriet\" McCarthy era and coming out as a young butch lesbian in the pre-Stonewall gay drag bars of a blue-collar town. Stone Butch Blues traces a propulsive journey, powerfully evoking history and politics while portraying", "Woman or man? This internationally acclaimed novel looks at the world through the eyes of Jess Goldberg, a masculine girl growing up in the \"Ozzie and Harriet\" McCarthy era and coming out as a young butch lesbian in the pre-Stonewall gay drag bars of a blue-collar town. Stone Butch Blues traces a propulsive journey, powerfully evoking history and politics while portraying an extraordinary protagonist full of longing, vulnerability, and working-class grit. This once-underground classic takes the reader on a roller-coaster ride of gender transformation and exploration and ultimately speaks to the heart of anyone who has ever suffered or gloried in being different."], "author": "Leslie Feinberg", "num_pages": "308", "awards": ["Stonewall Book Award for Literature (1994)", "Lambda Literary Award for Small Press (1994)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-11-16 00:00:00", "ISBN": "1555838537"},
{"url": "https://www.goodreads.com/book/show/18144031-redefining-realness", "num_ratings": "7,918", "num_reviews": "887", "avg_ratings": 4.32, "genres": ["Nonfiction", "Autobiography", "Memoir", "Feminism", "Lgbt", "Glbt", "Queer"], "title": "Redefining Realness: My Path to Womanhood, Identity, Love & So Much More", "description": ["In 2011, ", " magazine published a profile of Janet Mock in which she stepped forward for the first time as a trans woman. Those twenty-three hundred words were life-altering for the People.com editor, turning her into an influential and outspoken public figure and a desperately needed voice for an often voiceless community. In these pages, she offers a bold and in", "In 2011, ", " magazine published a profile of Janet Mock in which she stepped forward for the first time as a trans woman. Those twenty-three hundred words were life-altering for the People.com editor, turning her into an influential and outspoken public figure and a desperately needed voice for an often voiceless community. In these pages, she offers a bold and inspiring perspective on being young, multicultural, economically challenged, and transgender in America. ", "Welcomed into the world as her parents’ firstborn son, Mock decided early on that she would be her own person—no matter what. She struggled as the smart, determined child in a deeply loving yet ill-equipped family that lacked the money, education, and resources necessary to help her thrive. Mock navigated her way through her teen years without parental guidance, but luckily, with the support of a few close friends and mentors, she emerged much stronger, ready to take on—and maybe even change—the world. ", "This powerful memoir follows Mock’s quest for identity, from an early, unwavering conviction about her gender to a turbulent adolescence in Honolulu that saw her transitioning during the tender years of high school, self-medicating with hormones at fifteen, and flying across the world alone for sex reassignment surgery at just eighteen. With unflinching honesty, Mock uses her own experience to impart vital insight about the unique challenges and vulnerabilities of trans youth and brave girls like herself. ", "Despite the hurdles, Mock received a scholarship to college and moved to New York City, where she earned a master’s degree, enjoyed the success of an enviable career, and told no one about her past. She remained deeply guarded until she fell for a man who called her the woman of his dreams. Love fortified her with the strength to finally tell her story, enabling her to embody the undeniable power of testimony and become a fierce advocate for a marginalized and misunderstood community. A profound statement of affirmation from a courageous woman, ", " provides a whole new outlook on what it means to be a woman today, and shows as never before how to be authentic, unapologetic, and wholly yourself."], "author": "Janet Mock", "num_pages": "263", "awards": ["Goodreads Choice Award Nominee for Memoir & Autobiography (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-04 00:00:00", "ISBN": "1476709122"}
]