[
{"url": "https://www.goodreads.com/book/show/2163262.One_Hundred_Years_of_Solitude", "num_ratings": "623,513", "num_reviews": "23,999", "avg_ratings": 4.05, "genres": ["Fiction", "Classics", "Magical Realism", "Literature", "Novels", "Fantasy", "Historical", "Historical Fiction", "European Literature", "Spanish Literature", "Abandoned", "Cultural", "Latin American"], "title": "One Hundred Years of Solitude", "description": [" tells the rich and lusty story of the rise and fall of the Buendia family. Love and death, war and peace, youth and age -- the noble and stunningly beautiful story of this family is alive with a truth and understanding that strike the soul."], "author": "Gabriel García Márquez", "num_pages": "383", "awards": ["Premio Internacional de Novela Rómulo Gallegos (1972)", "Prix du Meilleur Livre Étranger for Roman (1969)"], "places": ["Macondo"], "character_names": ["Úrsula Iguarán", "Remedios Moscote", "Remedios, la bella", "Fernanda del Carpio", "Aureliano Buendía", "José Arcadio Buendía", "Amaranta Buendía", "Amaranta Úrsula Buendía", "Aureliano Babilonia", "José Arcadio Segundo", "Aureliano Segundo", "Aureliano José", "Pilar Ternera", "Rebeca Buendía", "Santa Sofía de la Piedad", "Arcadio Buendía", "José Arcadio Buendía, hijo", "Meme Buendía", "Petra Cotes", "Pietro Crespi", "Melquiades"], "language": "English", "publish_date": "1971-01-01 00:00:00", "ISBN": "038001503X"},
{"url": "https://www.goodreads.com/book/show/517190.On_Love_and_Barley", "num_ratings": "777", "num_reviews": "81", "avg_ratings": 4.32, "genres": ["Poetry", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics"], "title": "On Love and Barley: Haiku of Basho", "description": ["Basho, one of the greatest of Japanese poets and the master of haiku, was also a Buddhist monk and a life-long traveller. His poems combine 'karumi', or lightness of touch, with the Zen ideal of oneness with creation. Each poem evokes the natural world - the cherry blossom, the leaping frog, the summer moon or the winter snow - suggesting the smallness of human life in com", "Basho, one of the greatest of Japanese poets and the master of haiku, was also a Buddhist monk and a life-long traveller. His poems combine 'karumi', or lightness of touch, with the Zen ideal of oneness with creation. Each poem evokes the natural world - the cherry blossom, the leaping frog, the summer moon or the winter snow - suggesting the smallness of human life in comparison to the vastness and drama of nature. Basho himself enjoyed solitude and a life free from possessions, and his haiku are the work of an observant eye and a meditative mind, uncluttered by materialism and alive to the beauty of the world around him."], "author": "Matsuo Bashō", "num_pages": "92", "awards": [], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "1985-08-16 00:00:00", "ISBN": "0140444599"},
{"url": "https://www.goodreads.com/book/show/139874.The_Golden_Days", "num_ratings": "1,367", "num_reviews": "127", "avg_ratings": 4.21, "genres": ["Cultural", "China", "Classics", "Fiction", "Asian Literature", "Chinese Literature", "Literature", "Cultural", "Asia"], "title": "The Golden Days", "description": ["\"The Story of the Stone\" (c. 1760) is one of the greatest novels of Chinese literature. The first part of the story, The Golden Days, begins the tale of Bao-yu, a gentle young boy who prefers girls to Confucian studies, and his two cousins: Bao-chai, his parents' choice of a wife for him, and the ethereal beauty Dai-yu. Through the changing fortunes of the Jia family, this", "\"The Story of the Stone\" (c. 1760) is one of the greatest novels of Chinese literature. The first part of the story, The Golden Days, begins the tale of Bao-yu, a gentle young boy who prefers girls to Confucian studies, and his two cousins: Bao-chai, his parents' choice of a wife for him, and the ethereal beauty Dai-yu. Through the changing fortunes of the Jia family, this rich, magical work sets worldly events - love affairs, sibling rivalries, political intrigues, even murder - within the context of the Buddhist understanding that earthly existence is an illusion and karma determines the shape of our lives."], "author": "Cao Xueqin", "num_pages": "542", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1974-03-30 00:00:00", "ISBN": "0140442936"},
{"url": "https://www.goodreads.com/book/show/207227.Ambiguous_Adventure", "num_ratings": "714", "num_reviews": "64", "avg_ratings": 3.67, "genres": ["Fiction", "Cultural", "Africa", "Cultural", "France", "Western Africa", "Senegal", "Literature", "African Literature", "Philosophy"], "title": "Ambiguous Adventure", "description": ["This novel is about a Senegalese man's experiences in France."], "author": "Cheikh Hamidou Kane", "num_pages": "186", "awards": ["Grand prix littéraire d'Afrique noire de l'ADELF (1962)"], "places": [], "character_names": [], "language": "English", "publish_date": "1972-01-01 00:00:00", "ISBN": "0435901192"},
{"url": "https://www.goodreads.com/book/show/5125728-theologus-autodidactus", "num_ratings": "17", "num_reviews": "3", "avg_ratings": 3.94, "genres": ["Philosophy", "Religion", "Science Fiction", "Classics"], "title": "Theologus Autodidactus", "description": ["This work, written sometime between 1268 and 1277, is one of the first Arabic novels, may be considered an early example of a science fiction, and an early example of a coming of age tale and a desert island story. The protagonist of the story is Kamil, an autodidactic adolescent feral child who is spontaneously generated in a cave and living in seclusion on a deserted isl", "This work, written sometime between 1268 and 1277, is one of the first Arabic novels, may be considered an early example of a science fiction, and an early example of a coming of age tale and a desert island story. The protagonist of the story is Kamil, an autodidactic adolescent feral child who is spontaneously generated in a cave and living in seclusion on a deserted island. He eventually comes in contact with the outside world after the arrival of castaways who get shipwrecked and stranded on the island, and later take him back to the civilized world with them."], "author": "ابن النفيس", "num_pages": "158", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1968-08-16 00:00:00", "ISBN": "0198151225"},
{"url": "https://www.goodreads.com/book/show/5849.A_House_for_Mr_Biswas", "num_ratings": "15,646", "num_reviews": "723", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "India", "Novels", "Nobel Prize"], "title": "A House for Mr Biswas", "description": ["Mohun Biswas has spent his 46 years of life striving for independence. Shuttled from one residence to another after the drowning of his father, he yearns for a place he can call home. He marries into the Tulsi family, on whom he becomes dependent, but rebels and takes on a succession of occupations in a struggle to weaken their hold over him."], "author": "V.S. Naipaul", "num_pages": "623", "awards": [], "places": ["Trinidad and Tobago"], "character_names": ["Mohun Biswas", "Shama"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0330487191"},
{"url": "https://www.goodreads.com/book/show/1200593.The_Confessions_of_Lady_Nij_", "num_ratings": "419", "num_reviews": "37", "avg_ratings": 3.92, "genres": ["Cultural", "Japan", "Nonfiction", "Asian Literature", "Japanese Literature", "Biography Memoir", "History", "Classics", "Autobiography", "Memoir"], "title": "The Confessions of Lady Nijō", "description": ["In about 1307 a remarkable woman in Japan sat down to complete the story of her life. The result was an autobiographical narrative, a tale of thirty-six years (1271-1306) in the life of Lady Nijo, starting when she became the concubine of a retired emperor in Kyoto at the age of fourteen and ending, several love affairs later, with an account of her new life as a wandering", "In about 1307 a remarkable woman in Japan sat down to complete the story of her life. The result was an autobiographical narrative, a tale of thirty-six years (1271-1306) in the life of Lady Nijo, starting when she became the concubine of a retired emperor in Kyoto at the age of fourteen and ending, several love affairs later, with an account of her new life as a wandering Buddhist nun.", "Through the vagaries of history, however, the glory of Lady Nijo's story has taken six and half centuries to arrive. ", " or ", " in Japanese, was not widely circulated after it was written, perhaps because of the dynastic quarrel that soon split the imperial family, or perhaps because of Lady Nijo's intimate portrait of a very human emperor. Whatever the cause, the book was neglected, then forgotten completely, and only a single manuscript survived. This was finally discovered in 1940, but would not be published until after World War II in 1950. This translation and its annotations draw on multiple Japanese editions, but borrow most heavily from the interpretations offered by Tsugita Kasumi."], "author": "Lady Nijō", "num_pages": "288", "awards": ["National Book Award for Translation (1974)"], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "1973-06-01 00:00:00", "ISBN": "0804709300"},
{"url": "https://www.goodreads.com/book/show/194642.Some_Prefer_Nettles", "num_ratings": "2,686", "num_reviews": "197", "avg_ratings": 3.64, "genres": ["Cultural", "Japan", "Fiction", "Asian Literature", "Japanese Literature", "Classics"], "title": "Some Prefer Nettles", "description": ["The marriage of Kaname and Misako is disintegrating: whilst seeking passion and fulfilment in the arms of others, they contemplate the humiliation of divorce. Misako's father believes their relationship has been damaged by the influence of a new and alien culture, and so attempts to heal the breach by educating his son-in-law in the time-honoured Japanese traditions of aes", "The marriage of Kaname and Misako is disintegrating: whilst seeking passion and fulfilment in the arms of others, they contemplate the humiliation of divorce. Misako's father believes their relationship has been damaged by the influence of a new and alien culture, and so attempts to heal the breach by educating his son-in-law in the time-honoured Japanese traditions of aesthetic and sensual pleasure. The result is an absorbing, chilling conflict between ancient and modern, young and old."], "author": "Jun'ichirō Tanizaki", "num_pages": "202", "awards": [], "places": ["Osaka"], "character_names": [], "language": "English", "publish_date": "1995-09-26 00:00:00", "ISBN": "0679752692"},
{"url": "https://www.goodreads.com/book/show/119945.The_Time_of_the_Hero", "num_ratings": "13,210", "num_reviews": "574", "avg_ratings": 4.1, "genres": ["Fiction", "European Literature", "Spanish Literature", "Cultural", "Latin American"], "title": "The Time of the Hero", "description": ["Set among a community of cadets in a Lima military school, it is notable for its experimental and complex employment of multiple perspectives. The novel was so accurate in its portraiture of the academy \"that the academy's authorities burned 1000 copies and condemned the book as a plan by Ecuador to denigrate Peru."], "author": "Mario Vargas Llosa", "num_pages": "379", "awards": ["Premio Biblioteca Breve (1962)", "Premio de la Crítica de narrativa castellana (1964)"], "places": [], "character_names": ["Ricardo Arana “El Esclavo”", "\"El Jaguar\"", "Alberto Fernández “El Poeta”", "\"El Boa”", "Porfirio Cava \"El Serrano\"", "\"El Rulos”", "Brigadier Arróspide", "\"El Negro\" Vallano", "Teniente Gamboa", "\"Pies Dorados\"", "Paulino \"El Injerto\""], "language": "English", "publish_date": "2004-08-16 00:00:00", "ISBN": "0571173209"},
{"url": "https://www.goodreads.com/book/show/115776.The_Diary_of_Lady_Murasaki", "num_ratings": "1,147", "num_reviews": "68", "avg_ratings": 3.84, "genres": ["Cultural", "Japan", "Nonfiction", "Classics", "Asian Literature", "Japanese Literature", "History", "Biography"], "title": "The Diary of Lady Murasaki", "description": ["The ", " recorded by Lady Murasaki (c. 973 c. 1020), author of ", ", is an intimate picture of her life as tutor and companion to the young Empress Shoshi. Told in a series of vignettes, it offers revealing glimpses of the Japanese imperial palace the auspicious", "The ", " recorded by Lady Murasaki (c. 973 c. 1020), author of ", ", is an intimate picture of her life as tutor and companion to the young Empress Shoshi. Told in a series of vignettes, it offers revealing glimpses of the Japanese imperial palace the auspicious birth of a prince, rivalries between the Emperor's consorts, with sharp criticism of Murasaki's fellow ladies-in-waiting and drunken courtiers, and telling remarks about the timid Empress and her powerful father, Michinaga. The ", " is also a work of great subtlety and intense personal reflection, as Murasaki makes penetrating insights into human psychology her pragmatic observations always balanced by an exquisite and pensive melancholy.", "In his illuminating introduction, Richard Bowing discusses what is known of Murasaki's life, and the religion, ceremonies, costumes, architecture and politics of her time, to explain the cultural background to her vivid evocation of court life. This edition also includes an explanation of Japanese names and dates, appendices and updated further reading.", "Translated and introduced by RICHARD BOWRING"], "author": "Murasaki Shikibu", "num_pages": "90", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "014043576X"},
{"url": "https://www.goodreads.com/book/show/911075.Incidents_in_the_Life_of_a_Slave_Girl", "num_ratings": "35,593", "num_reviews": "1,913", "avg_ratings": 4.09, "genres": ["Nonfiction", "History", "Classics", "Biography", "Autobiography", "Memoir", "Cultural", "African American"], "title": "Incidents in the Life of a Slave Girl", "description": ["&&LDIV&&R&&LDIV&&R&&LI&&RIncidents in the Life of a Slave Girl&&L/I&&R, by &&LB&&RHarriet Jacobs&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality edition", "&&LDIV&&R&&LDIV&&R&&LI&&RIncidents in the Life of a Slave Girl&&L/I&&R, by &&LB&&RHarriet Jacobs&&L/B&&R, is part of the &&LI&&RBarnes & Noble Classics&&L/I&&R&&LI&&R &&L/I&&Rseries, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of &&LI&&RBarnes & Noble Classics&&L/I&&R: &&LDIV&&R", "New introductions commissioned from today's top writers and scholars", "Biographies of the authors", "Chronologies of contemporary historical, biographical, and cultural events", "Footnotes and endnotes", "Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work", "Comments by other famous authors", "Study questions to challenge the reader's viewpoints and expectations", "Bibliographies for further reading", "Indices & Glossaries, when appropriate", "All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. &&LI&&RBarnes & Noble Classics &&L/I&&Rpulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.&&L/DIV&&R&&L/DIV&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R &&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&RIn what has become a landmark of American history and literature, &&LI&&RIncidents in the Life of a Slave Girl&&L/I&&R recounts the incredible but true story of &&LB&&RHarriet Jacobs&&L/B&&R, born a slave in North Carolina in 1813. Her tale gains its importance from her descriptions, in great and painful detail, of the sexual exploitation that daily haunted her life—and the life of every other black female slave.&&LBR&&R&&LBR&&RAs a child, Harriet Jacobs remained blissfully unaware that she was a slave until the deaths of both her mother and a benevolent mistress exposed her to a sexually predatory master, Dr. Flint. Determined to escape, she spends seven years hidden away in a garret in her grandmother’s house, three feet high at its tallest point, with almost no air or light, and with only glimpses of her children to sustain her courage. In the face of seemingly insurmountable odds, she finally wins her battle for freedom by escaping to the North in 1842.&&LBR&&R&&LBR&&RA powerful, unflinching portrayal of the brutality of slave life, &&LI&&RIncidents in the Life of a Slave Girl&&L/I&&R stands alongside Frederick Douglass’s classic autobiographies as one of the most significant slave narratives ever written.&&LBR&&R&&L/P&&R&&LP style=\"MARGIN: 0in 0in 0pt\"&&R&&LSTRONG&&RFarah Jasmine Griffin&&L/B&&R&&L/B&&R is Professor of English and Comparative Literature and African American Studies at Columbia University in New York City.&&LSTRONG&&R &&L/B&&R&&L/P&&R&&L/DIV&&R"], "author": "Harriet Ann Jacobs", "num_pages": "272", "awards": [], "places": ["North Carolina"], "character_names": ["Harriet Ann Jacobs"], "language": "English", "publish_date": "2005-03-28 00:00:00", "ISBN": "1593082835"},
{"url": "https://www.goodreads.com/book/show/944103.The_Palm_Wine_Drinkard", "num_ratings": "1,586", "num_reviews": "159", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "Africa", "Fantasy", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "The Palm-Wine Drinkard", "description": ["When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African (Nigeria) Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages", "When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African (Nigeria) Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages and has come to be regarded as a masterwork of one of Africa's most influential writers."], "author": "Amos Tutuola", "num_pages": "125", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1977-08-16 00:00:00", "ISBN": "0571049966"},
{"url": "https://www.goodreads.com/book/show/616911.The_Sound_of_Waves", "num_ratings": "8,392", "num_reviews": "761", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics", "Literature", "Romance"], "title": "The Sound of Waves", "description": ["Set in a remote fishing village in Japan, The Sound of Waves is a timeless story of first love. A young fisherman is entranced at the sight of the beautiful daughter of the wealthiest man in the village. They fall in love, but must then endure the calumny and gossip of the villagers."], "author": "Yukio Mishima", "num_pages": "192", "awards": ["Shincho Prize (1954)"], "places": ["Japan"], "character_names": ["Shinji Kubo", "Terukichi Miyata", "Chiyoko", "Yasuo Kawamoto"], "language": "English", "publish_date": "1994-10-04 00:00:00", "ISBN": "0679752684"},
{"url": "https://www.goodreads.com/book/show/765172.Cane", "num_ratings": "6,963", "num_reviews": "365", "avg_ratings": 3.89, "genres": ["Fiction", "Poetry", "Classics", "Short Stories", "Cultural", "African American"], "title": "Cane", "description": ["A literary masterpiece of the Harlem Renaissance, ", " is a powerful work of innovative fiction evoking black life in the South. The sketches, poems, and stories of black rural and urban life that make up ", " are rich in imagery. Visions of smoke, sugarcane, dusk, and flame permeate the Southern landscape: the Northern world is pictured as a harsher reality of asphalt str", "A literary masterpiece of the Harlem Renaissance, ", " is a powerful work of innovative fiction evoking black life in the South. The sketches, poems, and stories of black rural and urban life that make up ", " are rich in imagery. Visions of smoke, sugarcane, dusk, and flame permeate the Southern landscape: the Northern world is pictured as a harsher reality of asphalt streets. Impressionistic, sometimes surrealistic, the pieces are redolent of nature and Africa, with sensuous appeals to eye and ear."], "author": "Jean Toomer", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-17 00:00:00", "ISBN": "0871401517"},
{"url": "https://www.goodreads.com/book/show/1470442.The_Street", "num_ratings": "4,544", "num_reviews": "418", "avg_ratings": 4.16, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Race", "Novels"], "title": "The Street", "description": ["A Houghton Mifflin Literary Fellowship Novel - Taken from back cover: The Street is the poignant and unblinkingly honest story of Lutie Johnson, a young black woman, and her struggle to live and raise a son amid the violence poverty and racial dissonance of Harlem in the late 1940s. The Street was Ann Petry's first novel, a best seller with more than a million and half cop", "A Houghton Mifflin Literary Fellowship Novel - Taken from back cover: The Street is the poignant and unblinkingly honest story of Lutie Johnson, a young black woman, and her struggle to live and raise a son amid the violence poverty and racial dissonance of Harlem in the late 1940s. The Street was Ann Petry's first novel, a best seller with more than a million and half copies in print."], "author": "Ann Petry", "num_pages": "448", "awards": ["Houghton Mifflin Literary Fellowship Award"], "places": [], "character_names": ["Jim Upton", "Lutie (main)", "Bub", "Pop", "Supe"], "language": "English", "publish_date": "1974-02-12 00:00:00", "ISBN": "0395573807"},
{"url": "https://www.goodreads.com/book/show/15762561-the-weary-blues", "num_ratings": "460", "num_reviews": "47", "avg_ratings": 4.43, "genres": ["Poetry", "Classics", "Cultural", "African American", "Music", "Race", "Academic", "School"], "title": "The Weary Blues", "description": ["A beautiful new edition of this beloved poet's first collection, originally published in 1926 when he was just twenty-four. ", "From the opening \"Proem\" (prologue poem) he offers in this first book-\"I am a Negro: / Black as night is black, / Black the depths of my Africa\"-Hughes spoke directly, intimately, and powerfully of the experiences of African Americans, at a time when", "A beautiful new edition of this beloved poet's first collection, originally published in 1926 when he was just twenty-four. ", "From the opening \"Proem\" (prologue poem) he offers in this first book-\"I am a Negro: / Black as night is black, / Black the depths of my Africa\"-Hughes spoke directly, intimately, and powerfully of the experiences of African Americans, at a time when their voices were newly being heard in our literature. As his Knopf editor Carl Van Vechten wrote in a brief introduction to the original 1926 volume, illuminating the potential of this promising young voice, \"His cabaret songs throb with the true jazz rhythm; his sea-pieces ache with a calm, melancholy lyricism; he cries bitterly from the heart of his race...Always, however, his stanzas are subjective, personal\" and, he concludes, they are \"the expression [of] an essentially sensitive and subtly illusive nature.\" That illusive nature darts among these early lines and begins to reveal itself, sometimes with shocking confidence and clarity: \"Bring me all of your / Heart melodies / That I may wrap them / In a blue cloud-cloth / Away from the too-rough fingers/ Of the world.\""], "author": "Langston Hughes", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1945-10-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1276764.The_Doctor_s_Wife", "num_ratings": "488", "num_reviews": "46", "avg_ratings": 3.78, "genres": ["Cultural", "Japan", "Fiction", "Historical", "Historical Fiction", "Asian Literature", "Japanese Literature"], "title": "The Doctor's Wife", "description": ["'A powerful portrait of two strongwilled women in a society almost totally dominated by men.' -Oriental Economist This is a novel based on the life of the first doctor in the world to perform surgery for breast cancer under a general anesthetic."], "author": "Sawako Ariyoshi", "num_pages": "174", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-08-16 00:00:00", "ISBN": "4770009534"},
{"url": "https://www.goodreads.com/book/show/1101837.Chaka", "num_ratings": "332", "num_reviews": "40", "avg_ratings": 3.7, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "Lesotho", "Historical", "Historical Fiction"], "title": "Chaka", "description": ["Tells the classic story of the Zulu hero Chaka."], "author": "Thomas Mofolo", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1983-01-01 00:00:00", "ISBN": "0435902296"},
{"url": "https://www.goodreads.com/book/show/227986.There_Is_Confusion", "num_ratings": "125", "num_reviews": "9", "avg_ratings": 3.77, "genres": ["Fiction", "Classics", "Cultural", "African American", "Race", "Novels", "Literature", "Gender"], "title": "There Is Confusion", "description": ["Set in Philadelphia some 60 years ago, There Is Confusion traces the lives of Joanna Mitchell and Peter Bye, whose families must come to terms with an inheritance of prejudice and discrimination as they struggle for legitimacy and respect."], "author": "Jessie Redmon Fauset", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-11-07 00:00:00", "ISBN": "1555530664"},
{"url": "https://www.goodreads.com/book/show/67998.Selected_Poems", "num_ratings": "131", "num_reviews": "6", "avg_ratings": 4.17, "genres": ["Poetry", "Nobel Prize", "European Literature", "Spanish Literature", "Cultural", "Latin American", "Literature", "Latin American Literature"], "title": "Selected Poems", "description": ["The first Nobel Prize in literature to be awarded to a Latin American writer went to the Chilean poet Gabriela Mistral. Famous and beloved during her lifetime all over Latin America and in Europe, Mistral has never been known in North America as she deserves to be. The reputation of her more flamboyant and accessible friend and countryman Pablo Neruda has overshadowed hers", "The first Nobel Prize in literature to be awarded to a Latin American writer went to the Chilean poet Gabriela Mistral. Famous and beloved during her lifetime all over Latin America and in Europe, Mistral has never been known in North America as she deserves to be. The reputation of her more flamboyant and accessible friend and countryman Pablo Neruda has overshadowed hers, and she has been officially sentimentalised into a 'poetess' of children and motherhood. Translations, and even selections of her work in Spanish, have tended to underplay the darkness, the strangeness, and the raging intensity of her poems of grief and pain, the yearning power of her evocations of the Chilean landscape, the stark music of her Round Dances, the visionary splendour of her Hymns of America. During her lifetime Mistral published four books: Desolation, Tenderness, Clearcut, and Winepress. These are included in the 'Complete' Nobel edition published in Madrid; the Poem of Chile, her last book, was printed years after her death. Le Guin includes poems from all five books in this volume, with particular emphasis on the later work. The intelligence and passion of Le Guin's selection and translation wil"], "author": "Gabriela Mistral", "num_pages": "407", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-12-02 00:00:00", "ISBN": "0826328180"},
{"url": "https://www.goodreads.com/book/show/192424.American_Indian_Stories", "num_ratings": "634", "num_reviews": "48", "avg_ratings": 3.88, "genres": ["Short Stories", "Fiction", "Classics"], "title": "American Indian Stories", "description": [", first published in 1921, is a collection of childhood stories, allegorical fiction, and an essay. One of the most famous Sioux writers and activists of the modern era, Zitkala-Sa (Gertrude Bonnin) recalled legends and tales from oral tradition and used experiences from her life and community to educate others about the Yankton Sioux. Determined, co", ", first published in 1921, is a collection of childhood stories, allegorical fiction, and an essay. One of the most famous Sioux writers and activists of the modern era, Zitkala-Sa (Gertrude Bonnin) recalled legends and tales from oral tradition and used experiences from her life and community to educate others about the Yankton Sioux. Determined, controversial, and visionary, she creatively worked to bridge the gap between her own culture and mainstream American society and advocated for Native rights on a national level. Susan Rose Dominguez provides a new introduction to this edition."], "author": "Zitkala-Ša", "num_pages": "196", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-09-01 00:00:00", "ISBN": "0803299176"},
{"url": "https://www.goodreads.com/book/show/1396965.A_Dark_Night_s_Passing", "num_ratings": "142", "num_reviews": "15", "avg_ratings": 3.75, "genres": ["Cultural", "Japan", "Asian Literature", "Japanese Literature", "Fiction", "Classics", "Literature", "Literature", "20th Century"], "title": "A Dark Night's Passing (Japan's Modern Writers)", "description": ["Tells the story of a young man's passage through a sequence of disturbing experiences to a hard-worn truce with the destructive forces within himself."], "author": "Naoya Shiga", "num_pages": "408", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1979-12-01 00:00:00", "ISBN": "0870113623"},
{"url": "https://www.goodreads.com/book/show/3567389-the-plays-of-georgia-douglas-johnson", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 3.33, "genres": ["Cultural", "African American", "Drama"], "title": "The Plays of Georgia Douglas Johnson: From the New Negro Renaissance to the Civil Rights Movement", "description": ["This volume collects twelve of Georgia Douglas Johnson's one-act plays, including two never-before-published scripts found in the Library of Congress. As an integral part of Washington, D.C.'s, thriving turn-of-the-century literary scene, Johnson hosted regular meetings with Harlem Renaissance writers and other artists, including Countee Cullen, Langston Hughes, May Miller", "This volume collects twelve of Georgia Douglas Johnson's one-act plays, including two never-before-published scripts found in the Library of Congress. As an integral part of Washington, D.C.'s, thriving turn-of-the-century literary scene, Johnson hosted regular meetings with Harlem Renaissance writers and other artists, including Countee Cullen, Langston Hughes, May Miller, and Jean Toomer, and was herself considered among the finest writers of the time. Johnson also worked for U.S. government agencies and actively supported women's and minorities' rights. As a leading authority on Johnson, Judith L. Stephens provides a brief overview of Johnson's career and significance as a playwright; sections on the creative environment in which she worked; her S Street Salon; The Saturday Nighters, and its significance to the New Negro Theatre; selected photographs; and a discussion of Johnson's genres, themes, and artistic techniques."], "author": "Georgia Douglas Johnson", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-03 00:00:00", "ISBN": "0252030923"},
{"url": "https://www.goodreads.com/book/show/868440.The_Blacker_the_Berry_", "num_ratings": "1,568", "num_reviews": "142", "avg_ratings": 3.95, "genres": ["Fiction", "Cultural", "African American", "Classics", "Historical", "Historical Fiction", "American", "African American Literature", "Race"], "title": "The Blacker the Berry...", "description": ["One of the most widely read and controversial works of the Harlem Renaissance, ", "...was the first novel to openly explore prejudice within the Black community. This pioneering novel found a way beyond the bondage of Blackness in American life to a new meaning in truth and beauty. ", "One of the most widely read and controversial works of the Harlem Renaissance, ", "...was the first novel to openly explore prejudice within the Black community. This pioneering novel found a way beyond the bondage of Blackness in American life to a new meaning in truth and beauty. "], "author": "Wallace Thurman", "num_pages": "221", "awards": [], "places": ["Idaho", "New York City, New York"], "character_names": [], "language": "English", "publish_date": "1996-02-02 00:00:00", "ISBN": "068481580X"},
{"url": "https://www.goodreads.com/book/show/873428.My_Soul_s_High_Song", "num_ratings": "58", "num_reviews": "6", "avg_ratings": 4.26, "genres": ["Poetry", "Classics", "The United States Of America", "Lgbt", "Anthologies"], "title": "My Soul's High Song: The Collected Writings", "description": ["For the first time in more than two decades, the very best of Countee Cullen's poetry and prose is available in one collection.", "For the first time in more than two decades, the very best of Countee Cullen's poetry and prose is available in one collection."], "author": "Countee Cullen", "num_pages": "618", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-12-01 00:00:00", "ISBN": "0385412959"},
{"url": "https://www.goodreads.com/book/show/38066.Jonah_s_Gourd_Vine", "num_ratings": "1,639", "num_reviews": "76", "avg_ratings": 3.99, "genres": ["Fiction", "Classics", "Cultural", "African American", "American", "African American Literature", "Literature"], "title": "Jonah's Gourd Vine", "description": ["The first novel by the noted black novelist, folklorist, and anthropologist. Originally published in 1934, it was praised by Carl Sandburg as \"a bold and beautiful book, many a page priceless and unforgettable.\""], "author": "Zora Neale Hurston", "num_pages": "229", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-01-22 00:00:00", "ISBN": "0060916516"},
{"url": "https://www.goodreads.com/book/show/1074976.My_People_the_Sioux", "num_ratings": "302", "num_reviews": "24", "avg_ratings": 4.0, "genres": ["History", "Nonfiction", "Biography", "Autobiography", "Memoir", "Literature", "American"], "title": "My People the Sioux", "description": ["When it was first published in 1928, Luther Standing Bear's autobiographical account of his tribe and tribesmen was hailed by Van Wyck Brooks as “one of the most engaging and veracious we have ever had.” It remains a landmark in Indian literature, among the first books about Indians written from the Indian point of view by an Indian. Born in the 1860s, the son of a Lakota", "When it was first published in 1928, Luther Standing Bear's autobiographical account of his tribe and tribesmen was hailed by Van Wyck Brooks as “one of the most engaging and veracious we have ever had.” It remains a landmark in Indian literature, among the first books about Indians written from the Indian point of view by an Indian. Born in the 1860s, the son of a Lakota chief, Standing Bear was in the first class at Carlisle Indian School, witnessed the Ghost Dance uprising from the Pine Ridge Reservation, toured Europe with Buffalo Bill's Wild West show, and devoted his later years to the Indian rights movement of the 1920s and 1930s."], "author": "Luther Standing Bear", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "0803293321"},
{"url": "https://www.goodreads.com/book/show/158371.The_Living_is_Easy", "num_ratings": "368", "num_reviews": "30", "avg_ratings": 3.93, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Cultural", "African American", "Literary Fiction", "Womens"], "title": "The Living is Easy", "description": ["One of only a handful of novels published by black women during the forties, the story of ambitious Cleo Judson is a long-time cult classic. \"The Living Is Easy\" is delightfully wry and ironic humor--even bitchiness--of the novel coexists with a challenging moral and social complexity. ", " \"A powerful work.\"--\"Essence\" ", "\"Dorothy West is a brisk storyteller with an eye for iron", "One of only a handful of novels published by black women during the forties, the story of ambitious Cleo Judson is a long-time cult classic. \"The Living Is Easy\" is delightfully wry and ironic humor--even bitchiness--of the novel coexists with a challenging moral and social complexity. ", " \"A powerful work.\"--\"Essence\" ", "\"Dorothy West is a brisk storyteller with an eye for ironic detail...a deft stylist and writer of social satire.\"--\"Ms.\" ", "\"Long beloved for its wry and ironic humor, this novel continues to delight and challenge readers.\"--\"Feminist Bookstore News\" ", "* Alternate of the Book-of-the-Month and Quality Paperback Book Clubs * ", "Suggested for course use in: ", "African-American studies", "20th-century U.S. literature"], "author": "Dorothy West", "num_pages": "376", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1948-04-08 00:00:00", "ISBN": "0965392120"},
{"url": "https://www.goodreads.com/book/show/13532227-where-there-s-love-there-s-hate", "num_ratings": "428", "num_reviews": "52", "avg_ratings": 3.43, "genres": ["Mystery", "Fiction", "Novels", "Literature", "Latin American Literature", "Mystery", "Crime", "Cultural", "Latin American"], "title": "Where There's Love, There's Hate", "description": ["In seaside Bosque de Mar, guests at the Hotel Central are struck by double misfortune: the mysterious death of one of their party, and an investigation headed by the physician, writer and insufferable busybody, Dr. Humberto Huberman. When quiet, young trans", "In seaside Bosque de Mar, guests at the Hotel Central are struck by double misfortune: the mysterious death of one of their party, and an investigation headed by the physician, writer and insufferable busybody, Dr. Humberto Huberman. When quiet, young translator Mary is found dead on the first night of Huberman's stay, he quickly appoints himself leader of an inquiry that will see blame apportioned in turn to each and every guest--including Mary's own sister--and culminating in a wild, wind-blown reconnaissance mission to the nearby shipwreck, the Joseph K.", "Never before translated into English, ", " is both genuinely suspenseful mystery fiction and an ingenious pastiche of the genre, the only novel co-written by two towering figures of Latin American literature. Famously friends and collaborators of Jorge Luis Borges, husband and wife Bioy Casares and Ocampo combine their gifts to produce a novel that's captivating, unashamedly erudite and gloriously witty."], "author": "Adolfo Bioy Casares", "num_pages": "112", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "1612191509"},
{"url": "https://www.goodreads.com/book/show/2568.The_Interpreters", "num_ratings": "359", "num_reviews": "36", "avg_ratings": 3.56, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Nigeria", "Novels", "Literature", "African Literature", "Nobel Prize", "Literature"], "title": "The Interpreters", "description": ["The Nobel Laureate's first novel spotlights a small circle of young Nigerian intellectuals living in Lagos."], "author": "Wole Soyinka", "num_pages": "251", "awards": ["Jock Campbell-New Statesman Award (1968)"], "places": ["Lagos"], "character_names": [], "language": "English", "publish_date": "1996-08-16 00:00:00", "ISBN": "0233989781"},
{"url": "https://www.goodreads.com/book/show/817660.Memoirs_of_a_Woman_Doctor", "num_ratings": "2,194", "num_reviews": "389", "avg_ratings": 3.36, "genres": ["Feminism", "Biography", "Autobiography", "Memoir"], "title": "Memoirs of a Woman Doctor", "description": ["Rebelling against the constraints of family and society, a young Egyptian woman decides to study medicine, becoming the only woman in a class of men. Her encounters with the other students--as well as the male and female corpses in the autopsy room--intensify her dissatisfaction with and her search for identity. She realizes men are not gods as her mother had taught her, t", "Rebelling against the constraints of family and society, a young Egyptian woman decides to study medicine, becoming the only woman in a class of men. Her encounters with the other students--as well as the male and female corpses in the autopsy room--intensify her dissatisfaction with and her search for identity. She realizes men are not gods as her mother had taught her, that science cannot explain everything, and that she cannot be satisfied by living a life purely of the mind.", "After a brief and unhappy marriage, she throws herself into her work, becoming a successful physician, but at the same time, she becomes aware of injustice and hypocrisy in society. Fulfillment and love come to her at last in a wholly unexpected way."], "author": "Nawal El-Saadawi", "num_pages": "128", "awards": [], "places": ["Egypt"], "character_names": [], "language": "English", "publish_date": "2001-01-01 00:00:00", "ISBN": "0872862232"},
{"url": "https://www.goodreads.com/book/show/609367.Nisei_Daughter", "num_ratings": "673", "num_reviews": "89", "avg_ratings": 3.81, "genres": ["Nonfiction", "Autobiography", "Memoir", "History", "Biography", "Historical", "Biography Memoir"], "title": "Nisei Daughter", "description": ["With charm, humor, and deep understanding, a Japanese-American woman tells how it was to grow up on Seattle's waterfront in the 1930s and to be subjected to \"relocation\" during World War II. Along with some 120,000 other persons of Japanese ancestry—77,000 of whom were U.S. citizens—she and her family were uprooted from their home and imprisoned in a camp. In this book, fi", "With charm, humor, and deep understanding, a Japanese-American woman tells how it was to grow up on Seattle's waterfront in the 1930s and to be subjected to \"relocation\" during World War II. Along with some 120,000 other persons of Japanese ancestry—77,000 of whom were U.S. citizens—she and her family were uprooted from their home and imprisoned in a camp. In this book, first published in 1952, she provides a unique personal account of these experiences.", "Replaced by ISBN 9780295993553"], "author": "Monica Itoi Sone", "num_pages": "256", "awards": [], "places": ["Seattle, Washington"], "character_names": [], "language": "English", "publish_date": "1979-10-01 00:00:00", "ISBN": "0295956887"},
{"url": "https://www.goodreads.com/book/show/32750.Brown_Girl_Brownstones", "num_ratings": "2,431", "num_reviews": "110", "avg_ratings": 4.05, "genres": ["Fiction", "Cultural", "African American", "Classics", "New York", "Historical", "Historical Fiction", "Race", "Novels"], "title": "Brown Girl, Brownstones", "description": ["Set in Brooklyn during the Depression and World War II, \"Brown Girl, Brownstones\" is the enduring story of a most extraordinary young woman. Selina Boyce, the daughter of Barbadian immigrants, is caught between the struggles of her hard-working, ambitious mother, who wants to \"buy house\" and educate her daughters, and her father, who longs to return to the land in Barbados", "Set in Brooklyn during the Depression and World War II, \"Brown Girl, Brownstones\" is the enduring story of a most extraordinary young woman. Selina Boyce, the daughter of Barbadian immigrants, is caught between the struggles of her hard-working, ambitious mother, who wants to \"buy house\" and educate her daughters, and her father, who longs to return to the land in Barbados. Selina seeks to define her own identity and values as she struggles to surmount the racism and poverty that surround her. Moving and powerful, \"Brown Girl, Brownstones\" is both a classic coming-of-age tale and a vivid portrait of one family's struggle to achieve the American Dream."], "author": "Paule Marshall", "num_pages": "324", "awards": [], "places": ["Brooklyn, New York City, New York", "Bedford-Stuyesant, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2006-08-01 00:00:00", "ISBN": "1558614982"},
{"url": "https://www.goodreads.com/book/show/509216.Down_Second_Avenue", "num_ratings": "245", "num_reviews": "35", "avg_ratings": 3.73, "genres": ["Cultural", "Africa", "Nonfiction", "Southern Africa", "South Africa"], "title": "Down Second Avenue: Growing Up in a South African Ghetto", "description": ["   ", " Nominated for the Nobel Prize in 1969, Es’kia Mphahlele is considered the Dean of African Letters and the father of black South African writing. ", " is a landmark book that describes Mphahlele’s experience growing up in segregated South Afr", "   ", " Nominated for the Nobel Prize in 1969, Es’kia Mphahlele is considered the Dean of African Letters and the father of black South African writing. ", " is a landmark book that describes Mphahlele’s experience growing up in segregated South Africa. Vivid, graceful, and unapologetic, it details a daily life of severe poverty and brutal police surveillance under the subjugation of an apartheid regime. Banned in South Africa after its original 1959 publication for its protest against apartheid, ", " is a foundational work of literature that continues to inspire activists today. "], "author": "Ezekiel Mphahlele", "num_pages": "222", "awards": [], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "1990-01-01 00:00:00", "ISBN": "084464451X"},
{"url": "https://www.goodreads.com/book/show/225750.Selected_Poems", "num_ratings": "1,660", "num_reviews": "82", "avg_ratings": 4.21, "genres": ["Poetry", "Cultural", "African American", "Womens", "Literature", "Literature", "American"], "title": "Selected Poems", "description": ["The classic volume by the distinguished modern poet, winner of the 1950 Pulitzer Prize, and recipient of the National Book Foundation Medal for Distinguished Contribution to American Letters, showcases an esteemed artist's technical mastery, her warm humanity, and her compassionate and illuminating response to a complex world."], "author": "Gwendolyn Brooks", "num_pages": "161", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-03 00:00:00", "ISBN": "0060882964"},
{"url": "https://www.goodreads.com/book/show/27297.The_Analects", "num_ratings": "14,888", "num_reviews": "536", "avg_ratings": 3.84, "genres": ["Philosophy", "Classics", "Nonfiction", "Religion", "Cultural", "China", "History"], "title": "The Analects", "description": ["This lively new translation with clear explanatory notes by one of the foremost scholars of classical Chinese provides the ideal introduction to the Analects for readers who have no previous knowledge of the Chinese language and philosophical traditions.", "\"How dare I claim to be a sage or a benevolent man?\"", "By constructing the philosophy expressed through ", ", Confuc", "This lively new translation with clear explanatory notes by one of the foremost scholars of classical Chinese provides the ideal introduction to the Analects for readers who have no previous knowledge of the Chinese language and philosophical traditions.", "\"How dare I claim to be a sage or a benevolent man?\"", "By constructing the philosophy expressed through ", ", Confucius might well dare to make such a claim. ", " are a collection of Confucius' sayings, compiled by his pupils shortly after his death in 497 B.C., and they reflect the extent to which Confucius held up a moral ideal for all men. The aim is the perfection of one's moral character, the method one of arduous pursuit of such moral attributes as benevolence, wisdom, courage; the result is no recompense either in this life or the next – to follow the Way must be its own reward. A harsh philosophy perhaps, but shining through it is the splendid intellect and spirit of one of the most reasonable and humane thinkers of all time."], "author": "Confucius", "num_pages": "249", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1979-12-20 00:00:00", "ISBN": "0140443487"},
{"url": "https://www.goodreads.com/book/show/489572.A_Handful_of_Rice", "num_ratings": "71", "num_reviews": "8", "avg_ratings": 3.61, "genres": ["Cultural", "India", "Contemporary"], "title": "A Handful of Rice", "description": ["Indiaclub.com Description", "An extremely fascinating work of art which is compulsively readable and gratifying in a most complete way.", "The novel depicts the hard struggle of life in a ;modern city and its demoralization. Ravi , son of a peasant, joins in the general exodus to the city, and, floating through the indifferent streets, lands into the underworld of petty criminals.", "Indiaclub.com Description", "An extremely fascinating work of art which is compulsively readable and gratifying in a most complete way.", "The novel depicts the hard struggle of life in a ;modern city and its demoralization. Ravi , son of a peasant, joins in the general exodus to the city, and, floating through the indifferent streets, lands into the underworld of petty criminals. He falls in love with pretty Nalini, and marries her against all odds. She tries to change his way of life but fate conspires against him . . And the story moves to a memorable and a haunting climax. ", "MEDIA REVIEWS:", "From among the handful of Indo-Anglian women novelists, Kamala Markandaya stands out as one of the3 finest and most impassionate writers of fiction. Her greatest asset is her language - virile, vibrant and vigorous - with the right choice and turn of words and expressions. A Handful of Rice certainly makes an absorbing and enjoyable reading. - Sunday Standard", "The picture of a joint family with its many psychological stresses and strains is deftly drawn, and so is the picture of the shady underworld. The novel is, in a sense, a saga of the triumph of human spirit over poverty's privations and predicaments. - The Indian PEN", "An overwhelmingly real book. It is about those parts of us, as human beings, which are permanent and universal - love, hunger, lust, passion, ambition, sacrifice, death. She is the best writer now writing who generally uses an Indian background. - John Masters"], "author": "Kamala Markandaya", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1966-06-16 00:00:00", "ISBN": "0381981525"},
{"url": "https://www.goodreads.com/book/show/571420.Jubilee", "num_ratings": "3,685", "num_reviews": "357", "avg_ratings": 4.26, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Cultural", "African American", "Military History", "Civil War", "Historical"], "title": "Jubilee", "description": ["A 50th anniversary edition of Margaret Walker's best-selling classic with a foreword by Nikki Giovanni ", " tells the true story of Vyry, the child of a white plantation owner and one of his black slaves. Vyry bears witness to the South’s antebellum opulence and to its brutality, its wartime ruin, and the promises of Reconstruction. Weaving her own family’s oral history", "A 50th anniversary edition of Margaret Walker's best-selling classic with a foreword by Nikki Giovanni ", " tells the true story of Vyry, the child of a white plantation owner and one of his black slaves. Vyry bears witness to the South’s antebellum opulence and to its brutality, its wartime ruin, and the promises of Reconstruction. Weaving her own family’s oral history with thirty years of research, Margaret Walker’s novel brings the everyday experiences of slaves to light. ", " churns with the hunger, the hymns, the struggles, and the very breath of American history."], "author": "Margaret Walker", "num_pages": "497", "awards": ["Houghton Mifflin Literary Fellowship Award"], "places": ["Alabama", "Georgia"], "character_names": [], "language": "English", "publish_date": "1999-01-21 00:00:00", "ISBN": "0395924952"},
{"url": "https://www.goodreads.com/book/show/387509.Houseboy", "num_ratings": "1,396", "num_reviews": "79", "avg_ratings": 3.73, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Central Africa", "Cameroon", "Cultural", "France", "Historical", "Historical Fiction"], "title": "Houseboy", "description": ["Toundi Ondoua, the rural African protagonist of Houseboy, encounters a world of prisms that cast beautiful but unobtainable glimmers, especially for a black youth in colonial Cameroon. ", ", written in the form of Toundi's captivating diary and translated from the original French, discloses his awe of the white world and a web of unpredictable experiences. Early on, he", "Toundi Ondoua, the rural African protagonist of Houseboy, encounters a world of prisms that cast beautiful but unobtainable glimmers, especially for a black youth in colonial Cameroon. ", ", written in the form of Toundi's captivating diary and translated from the original French, discloses his awe of the white world and a web of unpredictable experiences. Early on, he escapes his father's angry blows by seeking asylum with his benefactor, the local European priest who meets an untimely death. Toundi then becomes \"the Chief European's 'boy'--the dog of the King.\" Toundi's attempt to fulfill a dream of advancement and improvement opens his eyes to troubling realities. Gradually, preconceptions of the Europeans come crashing down on him as he struggles with his identity, his place in society, and the changing culture."], "author": "Ferdinand Oyono", "num_pages": "122", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-08-15 00:00:00", "ISBN": "0435905325"},
{"url": "https://www.goodreads.com/book/show/203938.Crusade_for_Justice", "num_ratings": "324", "num_reviews": "24", "avg_ratings": 4.22, "genres": ["History", "Nonfiction", "Feminism", "Biography", "Autobiography", "Memoir", "Cultural", "African American"], "title": "Crusade for Justice: The Autobiography of Ida B. Wells", "description": ["Ida B. Wells (1862-1931) was one of the foremost crusaders against black oppression. This engaging memoir tells of her private life as mother of a growing family as well as her public activities as teacher, lecturer, and journalist in her fight against attitudes and laws oppressing blacks.", "\"No student of black history should overlook ", ".\"—William M. Tuttle,", "Ida B. Wells (1862-1931) was one of the foremost crusaders against black oppression. This engaging memoir tells of her private life as mother of a growing family as well as her public activities as teacher, lecturer, and journalist in her fight against attitudes and laws oppressing blacks.", "\"No student of black history should overlook ", ".\"—William M. Tuttle, Jr., ", "\"Besides being the story of an incredibly courageous and outspoken black woman in the face of innumerable odds, the book is a valuable contribution to the social history of the United States and to the literature of the women's movement as well.\"—Elizabeth Kolmer, ", "\"[Wells was] a sophisticated fighter whose prose was as though as her intellect.\"—Walter Goodman, ", "\"An illuminating narrative of a zealous, race-conscious, civic- and church-minded black woman reformer, whose life story is a significant chapter in the history of Negro-White relations.\"—Thelma D. Perry, "], "author": "Ida B. Wells-Barnett", "num_pages": "466", "awards": [], "places": [], "character_names": ["Ida B. Wells"], "language": "English", "publish_date": "1991-07-23 00:00:00", "ISBN": "0226893448"},
{"url": "https://www.goodreads.com/book/show/174216.The_Home_and_the_World", "num_ratings": "3,268", "num_reviews": "248", "avg_ratings": 3.82, "genres": ["Fiction", "Classics", "Cultural", "India", "Asian Literature", "Indian Literature", "Literature", "Historical", "Historical Fiction", "Cultural", "Asia", "Poetry", "Novels", "Literature", "20th Century"], "title": "The Home and the World", "description": ["Set on a Bengali noble's estate in 1908, this is both a love story and a novel of political awakening. The central character, Bimala, is torn between the duties owed to her husband, Nikhil, and the demands made on her by the radical leader, Sandip. Her attempts to resolve the irreconciliable pressures of the home and world reflect the conflict in India itself, and the trag", "Set on a Bengali noble's estate in 1908, this is both a love story and a novel of political awakening. The central character, Bimala, is torn between the duties owed to her husband, Nikhil, and the demands made on her by the radical leader, Sandip. Her attempts to resolve the irreconciliable pressures of the home and world reflect the conflict in India itself, and the tragic outcome foreshadows the unrest that accompanied Partition in 1947. This edition includes an introduction by Anita Desai."], "author": "Rabindranath Tagore", "num_pages": "213", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2005-03-31 00:00:00", "ISBN": "0140449868"},
{"url": "https://www.goodreads.com/book/show/78257.Quicksand", "num_ratings": "3,541", "num_reviews": "275", "avg_ratings": 3.66, "genres": ["Fiction", "Classics", "Cultural", "African American"], "title": "Quicksand", "description": ["Born to a white mother and an absent black father, and despised for her dark skin, Helga Crane has long had to fend for herself. As a young woman, Helga teaches at an all-black school in the South, but even here she feels different. Moving to Harlem and eventually to Denmark, she attempts to carve out a comfortable life and place for herself, but ends up back where she sta", "Born to a white mother and an absent black father, and despised for her dark skin, Helga Crane has long had to fend for herself. As a young woman, Helga teaches at an all-black school in the South, but even here she feels different. Moving to Harlem and eventually to Denmark, she attempts to carve out a comfortable life and place for herself, but ends up back where she started, choosing emotional freedom that quickly translates into a narrow existence. ", ", ", "'s powerful first novel, has intriguing autobiographical parallels and at the same time invokes the international dimension of African American culture of the 1920s. It also evocatively portrays the racial and gender restrictions that can mark a life."], "author": "Nella Larsen", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-29 00:00:00", "ISBN": "0141181273"},
{"url": "https://www.goodreads.com/book/show/231900.The_Soul_of_the_Indian", "num_ratings": "456", "num_reviews": "57", "avg_ratings": 4.15, "genres": ["Nonfiction", "History", "Religion", "Spirituality", "North American Hi...", "American History"], "title": "The Soul of the Indian", "description": ["Raised among the Sioux until the age of 15, Charles Alexander Eastman (1858–1939) resolved to become a physician in order to be of the greatest service to his people. Upon completing his education at Boston University School of Medicine, he accepted an appointment to a South Dakota Indian reservation, where he was the only doctor available to the victims of the 1890 massac", "Raised among the Sioux until the age of 15, Charles Alexander Eastman (1858–1939) resolved to become a physician in order to be of the greatest service to his people. Upon completing his education at Boston University School of Medicine, he accepted an appointment to a South Dakota Indian reservation, where he was the only doctor available to the victims of the 1890 massacre at Wounded Knee. With the encouragement of his wife, he further distinguished himself both as a writer and as a uniquely qualified interpreter of Native American ways. His writings offer authentic, sometimes stirring views of a world that has forever changed.", "In ", ", Eastman brings to life the rich spirituality and morality of the Native Americans as they existed before contact with missionaries and other whites. This is a rare firsthand expression of native religion, without the filters imposed by translators or anthropologists. Rather than a scientific treatise, Eastman has written a book, \"as true as I can make it to my childhood teaching and ancestral ideals, but from the human, not the ethnological standpoint.\" His discussions of the forms of ceremonial and symbolic worship, the unwritten scriptures, and the spirit world emphasize the universal quality and personal appeal of Native American religion."], "author": "Charles Alexander Eastman", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-07-02 00:00:00", "ISBN": "0486430898"},
{"url": "https://www.goodreads.com/book/show/7312194-the-real-story-of-ah-q-and-other-tales-of-china", "num_ratings": "582", "num_reviews": "45", "avg_ratings": 3.91, "genres": ["Cultural", "China", "Fiction", "Short Stories", "Classics", "Asian Literature", "Chinese Literature", "Literature", "Cultural", "Asia"], "title": "The Real Story of Ah-Q and Other Tales of China: The Complete Fiction of Lu Xun", "description": ["Lu Xun (Lu Hsun) is arguably the greatest writer of modern China, and is considered by many to be the founder of modern Chinese literature. Lu Xun's stories both indict outdated Chinese traditions and embrace China's cultural richness and individuality. This volume presents brand-new translations by Julia Lovell of all of Lu Xun's stories, including 'The Real Story of Ah-Q", "Lu Xun (Lu Hsun) is arguably the greatest writer of modern China, and is considered by many to be the founder of modern Chinese literature. Lu Xun's stories both indict outdated Chinese traditions and embrace China's cultural richness and individuality. This volume presents brand-new translations by Julia Lovell of all of Lu Xun's stories, including 'The Real Story of Ah-Q', 'Diary of a Madman', 'A Comedy of Ducks', 'The Divorce' and 'A Public Example', among others. With an afterword by Yiyun Li."], "author": "Lu Xun", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-29 00:00:00", "ISBN": "0140455485"},
{"url": "https://www.goodreads.com/book/show/827685.Up_from_Slavery", "num_ratings": "20,042", "num_reviews": "999", "avg_ratings": 4.09, "genres": ["History", "Nonfiction", "Biography", "Classics", "Biography", "Autobiography", "Cultural", "African American", "Autobiography", "Memoir"], "title": "Up from Slavery", "description": ["Booker T. Washington, the most recognized national leader, orator and educator, emerged from slavery in the deep south, to work for the betterment of African Americans in the post Reconstruction period. ", "\"Up From Slavery\" is an autobiography of Booker T. Washington's life and work, which has been the source of inspiration for all Americans. Washington reveals his inner most", "Booker T. Washington, the most recognized national leader, orator and educator, emerged from slavery in the deep south, to work for the betterment of African Americans in the post Reconstruction period. ", "\"Up From Slavery\" is an autobiography of Booker T. Washington's life and work, which has been the source of inspiration for all Americans. Washington reveals his inner most thoughts as he transitions from ex-slave to teacher and founder of one of the most important schools for African Americans in the south, The Tuskegee Industrial Institute."], "author": "Booker T. Washington", "num_pages": "256", "awards": [], "places": ["United States of America"], "character_names": ["Booker T. Washington"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0451527542"},
{"url": "https://www.goodreads.com/book/show/1667786.The_Heart_of_Hyacinth", "num_ratings": "23", "num_reviews": "4", "avg_ratings": 3.17, "genres": ["Literature", "American"], "title": "The Heart of Hyacinth", "description": [", originally published in 1903, tells the coming-of-age story of Hyacinth Lorrimer, a child of white parents who was raised from infancy in Japan by a Japanese foster mother and assumed to be Eurasian. A crisis occurs when, 18 years after her birth, her American father returns to Japan to reclaim her just as Hyacinth has become engaged to a Japanese ar", ", originally published in 1903, tells the coming-of-age story of Hyacinth Lorrimer, a child of white parents who was raised from infancy in Japan by a Japanese foster mother and assumed to be Eurasian. A crisis occurs when, 18 years after her birth, her American father returns to Japan to reclaim her just as Hyacinth has become engaged to a Japanese aristocrat, and she forcefully asserts her Japanese ties only to find that her prospective father-in-law will not tolerate a white wife for his son. Onoto Watanna creates in her protagonist a young white woman who not only claims a Japanese identity but shifts between her Japaneseness and her whiteness as expediency dictates. In this novel Watanna is on the cutting edge of what we now call race theory, using that theory--of racial constructions and fluidity--in the service of an avant-garde feminism."], "author": "Onoto Watanna", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-05-01 00:00:00", "ISBN": "029597916X"},
{"url": "https://www.goodreads.com/book/show/332614.Contending_Forces", "num_ratings": "239", "num_reviews": "20", "avg_ratings": 3.41, "genres": ["Fiction", "Romance", "Cultural", "African American", "Classics", "Female Authors", "Academic", "Read For School", "Literature", "American", "African American Literature"], "title": "Contending Forces: A Romance Illustrative of Negro Life North and South", "author": "Pauline Elizabeth Hopkins", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-05-09 00:00:00", "ISBN": "0195067851"},
{"url": "https://www.goodreads.com/book/show/7575864-a-chinese-ishmael-and-other-stories", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 3.67, "genres": [], "title": "A Chinese Ishmael and Other Stories", "description": ["Edith Maude Eaton (1865-1914) was an author best known under the pseudonym Sui Sin Far. She had to leave school at a young age to work in order to help support her family. Nonetheless, the children were educated at home and raised in an intellectually stimulating environment that saw both Edith and her younger sister Winnifred (1875- 1954), who wrote under the pseudonym On", "Edith Maude Eaton (1865-1914) was an author best known under the pseudonym Sui Sin Far. She had to leave school at a young age to work in order to help support her family. Nonetheless, the children were educated at home and raised in an intellectually stimulating environment that saw both Edith and her younger sister Winnifred (1875- 1954), who wrote under the pseudonym Onoto Watanna, become successful writers. Eaton began writing as a young girl; her articles on the Chinese were accepted for publication in Montreal's English-language newspapers, the Montreal Star and the Daily Witness. She asserted her Chinese heritage and wrote articles that told what life was like for a Chinese woman in white America. Her fictional stories about Chinese Americans, first published in 1896, were a reasoned appeal for her society's acceptance of working-class Chinese at a time when the United States Congress maintained the Chinese Exclusion Act (1882- 1943). Her works include: A Chinese Ishmael (1899), An Autumn Fan (1910), The Bird of Love (1910) and A Love Story From the Rice Fields of China (1911)."], "author": "Sui Far", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-25 00:00:00", "ISBN": "1409989453"},
{"url": "https://www.goodreads.com/book/show/53447.El_t_nel", "num_ratings": "32,920", "num_reviews": "1,987", "avg_ratings": 4.04, "genres": ["Fiction", "Classics", "European Literature", "Spanish Literature"], "title": "El túnel", "description": ["Breve e intensa novela publicada en 1948, este logrado fruto de la denominada \"literatura existencial\" le dio a su autor un reconocimiento que traspasó las fronteras nacionales. Para quien todavía no la leyó, ", " es la mejor introducción al universo prodigioso de Ernesto Sábato; para quien la conoce, un clásico de las letras del continente, una historia sobre el drama", "Breve e intensa novela publicada en 1948, este logrado fruto de la denominada \"literatura existencial\" le dio a su autor un reconocimiento que traspasó las fronteras nacionales. Para quien todavía no la leyó, ", " es la mejor introducción al universo prodigioso de Ernesto Sábato; para quien la conoce, un clásico de las letras del continente, una historia sobre el drama del hombre arrojado en el sinsentido más doloroso: la conciencia de la nada. ", "El narrador describe una historia de amor y muerte en la que muestra la soledad del individuo contemporáneo. No están ausentes de esta trama policial y de suspenso, la locura y la increíble reflexión del protagonista, el pintor Juan Pablo Castel, debatiéndose por comprender las causas que lo arrastraron a matar a la mujer que amaba, María Iribarne, y que era su única vía de salvación. En este alucinante drama de la vida interior, seres intrincados en la bestial búsqueda de comprensión ceden a la mentira, la hipocresía y los celos desmedidos hasta el crimen más inexplicable. Aventura amorosa, aventura onírica, aventura del ser que dan testimonio de un asesinato, de cierta memoria culpable y de una valiente introspección. ", "Técnicamente perfecta y de lectura apasionante, ", " excede el negativismo ácido de Sartre y la frenética huida hacia el vacío que plantea ", " de Camus, pero tiene de esos dos maestros literarios la impronta genial que hace de la escritura una radiografía del alma atormentada."], "author": "Ernesto Sabato", "num_pages": "158", "awards": [], "places": ["Buenos Aires"], "character_names": ["Juan Pablo Castel", "Maria Iribarne"], "language": "Spanish", "publish_date": "2003-01-28 00:00:00", "ISBN": "9871144261"},
{"url": "https://www.goodreads.com/book/show/827686.Black_No_More", "num_ratings": "1,873", "num_reviews": "176", "avg_ratings": 4.0, "genres": ["Fiction", "Classics", "Cultural", "African American", "Science Fiction", "Race"], "title": "Black No More", "description": ["Modern Library Harlem Renaissance", "What would happen to the race problem in America if black people turned white? Would everybody be happy? These questions and more are answered hilariously in Black No More, George S. Schuyler's satiric romp. Black No More is the story of Max Disher, a dapper black rogue of an insurance man who, through a scientific transformation process, b", "Modern Library Harlem Renaissance", "What would happen to the race problem in America if black people turned white? Would everybody be happy? These questions and more are answered hilariously in Black No More, George S. Schuyler's satiric romp. Black No More is the story of Max Disher, a dapper black rogue of an insurance man who, through a scientific transformation process, becomes Matthew Fisher, a white man. Matt dreams up a scam that allows him to become the leader of the Knights of Nordica, a white supremacist group, as well as to marry the white woman who rejected him when he was black. Black No More is a hysterical exploration of race and all its self-serving definitions. If you can't beat them, turn into them.", "        Ishmael Reed, one of today's top black satirists and the author of Mumbo Jumbo and Japanese by Spring, provides a spirited Introduction.", "The fertile artistic period now known as the Harlem Renaissance (1920- 1930) gave birth to many of the world-renowned masters of black literature and is the model for today's renaissance of black writers."], "author": "George S. Schuyler", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-06-29 00:00:00", "ISBN": "037575380X"},
{"url": "https://www.goodreads.com/book/show/182086.Iola_Leroy", "num_ratings": "764", "num_reviews": "55", "avg_ratings": 3.32, "genres": ["Fiction", "Classics", "Cultural", "African American", "Literature", "19th Century", "Academic", "School", "Historical", "Historical Fiction", "Literature", "American"], "title": "Iola Leroy: Shadows Uplifted", "description": ["Being very desirous that one of the race so long distinguished in the cause of freedom for her intellectual worth as Mrs. Harper has had the honor of being should not at this late date in life make a blunder which might detract from her own good name I naturally proposed to await developments before deciding too quickly in favor of giving encouragement to her contemplated", "Being very desirous that one of the race so long distinguished in the cause of freedom for her intellectual worth as Mrs. Harper has had the honor of being should not at this late date in life make a blunder which might detract from her own good name I naturally proposed to await developments before deciding too quickly in favor of giving encouragement to her contemplated effort."], "author": "Frances Ellen Watkins Harper", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2006-12-02 00:00:00", "ISBN": "1426460287"},
{"url": "https://www.goodreads.com/book/show/1040711.Wynema", "num_ratings": "60", "num_reviews": "3", "avg_ratings": 2.78, "genres": ["Academic", "School"], "title": "Wynema: A Child of the Forest", "description": ["Originally published in 1891, ", " is the first novel known to have been written by a woman of American Indian descent. Set against the sweeping and often tragic cultural changes that affected southeastern native peoples during the late nineteenth century, it tells the story of a lifelong friendship between two women from vastly different backgrounds—Wynema Harjo, a Musc", "Originally published in 1891, ", " is the first novel known to have been written by a woman of American Indian descent. Set against the sweeping and often tragic cultural changes that affected southeastern native peoples during the late nineteenth century, it tells the story of a lifelong friendship between two women from vastly different backgrounds—Wynema Harjo, a Muscogee Indian, and Genevieve Weir, a Methodist teacher from a genteel Southern family. Both are firm believers in women’s rights and Indian reform; both struggle to overcome prejudice and correct injustices between sexes and races. Callahan uses the conventional traditions of a sentimental domestic romance to deliver an elegant plea for tolerance, equality, and reform."], "author": "S. Alice Callahan", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-06-01 00:00:00", "ISBN": "080321460X"},
{"url": "https://www.goodreads.com/book/show/194746.No_Longer_Human", "num_ratings": "10,585", "num_reviews": "871", "avg_ratings": 4.07, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics", "Literature"], "title": "No Longer Human", "description": ["Osamu Dazai's ", ", this leading postwar Japanese writer's second novel, tells the poignant and fascinating story of a young man who is caught between the breakup of the traditions of a northern Japanese aristocratic family and the impact of Western ideas. In consequence, he feels himself \"disqualified from being human\" (a literal translation of the Japanese tit", "Osamu Dazai's ", ", this leading postwar Japanese writer's second novel, tells the poignant and fascinating story of a young man who is caught between the breakup of the traditions of a northern Japanese aristocratic family and the impact of Western ideas. In consequence, he feels himself \"disqualified from being human\" (a literal translation of the Japanese title).", "Donald Keene, who translated this and Dazai's first novel, ", ", has said of the author's work: \"His world … suggests Chekhov or possibly postwar France, … but there is a Japanese sensibility in the choice and presentation of the material. A Dazai novel is at once immediately intelligible in Western terms and quite unlike any Western book.\" His writing is in some ways reminiscent of Rimbaud, while he himself has often been called a forerunner of Yukio Mishima."], "author": "Osamu Dazai", "num_pages": "176", "awards": [], "places": ["Japan"], "character_names": ["大庭葉蔵 [Ōba Yōzō]"], "language": "English", "publish_date": "1958-01-17 00:00:00", "ISBN": "0811204812"},
{"url": "https://www.goodreads.com/book/show/32609906-life-among-the-paiutes", "num_ratings": "9", "num_reviews": "3", "avg_ratings": 3.89, "genres": ["History"], "title": "Life Among the Paiutes (1883)", "description": ["Sarah Winnemucca Hopkins (1844 – 1891) was a Northern Paiute author, activist and educator. ", "Winnemucca was born near Humboldt Lake, Nevada, into an influential Paiute family who were leading their community in pursuing friendly relations with the arriving groups of Anglo-American settlers. She was sent to study in a Catholic school in Santa Clara, California. When the Paiu", "Sarah Winnemucca Hopkins (1844 – 1891) was a Northern Paiute author, activist and educator. ", "Winnemucca was born near Humboldt Lake, Nevada, into an influential Paiute family who were leading their community in pursuing friendly relations with the arriving groups of Anglo-American settlers. She was sent to study in a Catholic school in Santa Clara, California. When the Paiute War erupted between the Pyramid Lake Paiute and the settlers, including some who were friends of the Winnemucca family, Sarah and some of her family traveled to San Francisco and Virginia City to escape the fighting. They made a living performing on stage as \"A Paiute Royal Family\". In 1865 while the Winnemucca family was away, their band was attacked by the US cavalry, who killed 29 Paiutes, including Sarah's mother and several members of her extended family. ", "Subsequently Winnemucca became an advocate for the rights of Native Americans, traveling across the US to tell Anglo-Americans about the plight of her people. When the Paiute were interned in a concentration camp at Yakima, Washington after the Bannock War, she traveled to Washington, DC to lobby Congress and the executive branch for their release. She also served US forces as a messenger, interpreter and guide, and as a teacher for imprisoned Native Americans. ", "Winnemucca published Life Among the Paiutes: Their Wrongs and Claims (1883), a book that is both a memoir and history of her people during their first forty years of contact with European Americans. It is considered the \"first known autobiography written by a Native American woman.\" ", "In 1993 she was inducted posthumously into the Nevada Writers Hall of Fame. In 2005, the state of Nevada contributed a statue of her by to the National Statuary Hall Collection in the U.S. Capitol. ", "In all the glimpses Mrs. Hopkins gives of the religion and moralities of the Piutes, we see the moral riches of their nature and traditions. Old Heckerwelder, in his history of the North American Indians, gave a multitude of facts of a like kind ; but it is only an Indian and an Indian woman who could do full justice to the subject. The story of this Indian’s devotion to her people must touch the hearts of all philanthropic people. It is one of the best known and most authentic books on Indian conditions ever published. ", "CONTENTS. ", "I. FIRST MEETING OF PAIUTES AND WHITES ", "II. DOMESTIC AND SOCIAL MORALITIES ", "III. WARS AND THEIR CAUSES ", "IV. CAPTAIN TRUCKEE'S DEATH ", "V. RESERVATION OF PYRAMID AND MUDDY LAKES ", "VI. THE MALHEUR AGENCY ", "VII. THE BANNOCK WAR ", "VIII. THE YAKIMA AFFAIR "], "author": "Sarah W. Hopkins", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/522951.Behind_the_Scenes", "num_ratings": "2,117", "num_reviews": "298", "avg_ratings": 3.81, "genres": ["History", "Nonfiction", "Biography", "Autobiography", "Memoir", "Military History", "Civil War", "Biography", "Autobiography"], "title": "Behind the Scenes: Or, Thirty Years a Slave, and Four Years in the White House", "description": ["Part slave narrative, part memoir, and part sentimental fiction Behind the Scenes depicts Elizabeth Keckley's years as a slave and subsequent four years in Abraham Lincoln's White House during the Civil War. Through the eyes of this black woman, we see a wide range of historical figures and events of the antebellum South, the Washington of the Civil War years, and the fina", "Part slave narrative, part memoir, and part sentimental fiction Behind the Scenes depicts Elizabeth Keckley's years as a slave and subsequent four years in Abraham Lincoln's White House during the Civil War. Through the eyes of this black woman, we see a wide range of historical figures and events of the antebellum South, the Washington of the Civil War years, and the final stages of the war."], "author": "Elizabeth Keckley", "num_pages": "404", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-12-01 00:00:00", "ISBN": "0195060849"},
{"url": "https://www.goodreads.com/book/show/567857.The_New_Negro", "num_ratings": "644", "num_reviews": "16", "avg_ratings": 4.05, "genres": ["Cultural", "African American", "Fiction", "Poetry", "Classics"], "title": "The New Negro", "description": ["From the man known as the father of the Harlem Renaissance comes a powerful, provocative, and affecting anthology of writers who shaped the Harlem Renaissance movement and who help us to consider the evolution of the African American in society.", "With stunning works by seminal black voices such as Zora Neale Hurston, Countee Cullen, and W.E.B. DuBois, Locke has constructed a", "From the man known as the father of the Harlem Renaissance comes a powerful, provocative, and affecting anthology of writers who shaped the Harlem Renaissance movement and who help us to consider the evolution of the African American in society.", "With stunning works by seminal black voices such as Zora Neale Hurston, Countee Cullen, and W.E.B. DuBois, Locke has constructed a vivid look at the new negro, the changing African American finding his place in the ever shifting sociocultural landscape that was 1920s America. With poetry, prose, and nonfiction essays, this collection is widely praised for its literary strength as well as its historical coverage of a monumental and fascinating time in the history of America."], "author": "Alain LeRoy Locke", "num_pages": "452", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-03-01 00:00:00", "ISBN": "0684838311"},
{"url": "https://www.goodreads.com/book/show/823821.The_Curse_of_Caste_Or_the_Slave_Bride", "num_ratings": "87", "num_reviews": "12", "avg_ratings": 3.51, "genres": ["Fiction", "Historical", "Historical Fiction", "Womens", "Cultural", "African American", "Academic", "Read For School"], "title": "The Curse of Caste; Or the Slave Bride: A Rediscovered African American Novel by Julia C. Collins", "description": ["In 1865, ", ", the national newspaper of the African Methodist Episcopal Church, serialized ", ", a novel written by Mrs. Julia C. Collins, an African American woman living in the small town of Williamsport, Pennsylvania. The first novel ever published by a black American woman, it is set in antebellum Louisiana and Conne", "In 1865, ", ", the national newspaper of the African Methodist Episcopal Church, serialized ", ", a novel written by Mrs. Julia C. Collins, an African American woman living in the small town of Williamsport, Pennsylvania. The first novel ever published by a black American woman, it is set in antebellum Louisiana and Connecticut, and focuses on the lives of a beautiful mixed-race mother and daughter whose opportunities for fulfillment through love and marriage are threatened by slavery and caste prejudice. The text shares much with popular nineteenth-century women's fiction, while its dominant themes of interracial romance, hidden African ancestry, and ambiguous racial identity have parallels in the writings of both black and white authors from the period.", "Begun in the waning months of the Civil War, the novel was near its conclusion when Julia Collins died of tuberculosis in November of 1865. In this first-ever book publication of ", ", the editors have composed a hopeful and a tragic ending, reflecting two alternatives Collins almost certainly would have considered for the closing of her unprecedented novel. In their introduction, the editors offer the most complete and current research on the life and community of an author who left few traces in the historical record, and provide extensive discussion of her novel's literary and historical significance. Collins's published essays, which provide intriguing glimpses into the mind of this gifted but overlooked writer, are included in what will prove to be the definitive edition of a major new discovery in African American literature. Its publication contributes immensely to our understanding of black American literature, religion, women's history, community life, and race relations during the era of United States emancipation."], "author": "Julia C.  Collins", "num_pages": "139", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-01 00:00:00", "ISBN": "0195301609"},
{"url": "https://www.goodreads.com/book/show/475285.Efuru", "num_ratings": "586", "num_reviews": "39", "avg_ratings": 3.93, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Western Africa", "Nigeria", "Womens"], "title": "Efuru", "description": ["Efuru, beautiful and respected, is loved and deserted by two ordinary undistinguished husbands."], "author": "Flora Nwapa", "num_pages": "288", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1966-06-01 00:00:00", "ISBN": "0435900269"},
{"url": "https://www.goodreads.com/book/show/999816.Home_to_Harlem", "num_ratings": "1,002", "num_reviews": "50", "avg_ratings": 3.65, "genres": ["Fiction", "Classics", "Cultural", "African American", "Novels", "Literature", "American"], "title": "Home to Harlem", "description": ["With sensual, often brutal accuracy, Claude McKay traces the parallel paths of two very different young men struggling to find their way through the suspicion and prejudice of American society. At the same time, this stark but moving story touches on the central themes of the Harlem Renaissance, including the urgent need for unity and identity among blacks."], "author": "Claude McKay", "num_pages": "360", "awards": [], "places": ["Harlem, New York City, New York"], "character_names": [], "language": "English", "publish_date": "1987-11-30 00:00:00", "ISBN": "1555530249"},
{"url": "https://www.goodreads.com/book/show/672376.Rashomon_and_Other_Stories", "num_ratings": "3,096", "num_reviews": "321", "avg_ratings": 4.02, "genres": ["Short Stories", "Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics"], "title": "Rashomon and Other Stories", "description": ["Writing at the beginning of the twentieth century, Ryunosuke Akutagawa created disturbing stories out of Japan's cultural upheaval. Whether his fictions are set centuries past or close to the present, Akutagawa was a modernist, writing in polished, superbly nuanced prose subtly exposing human needs and flaws. \"In a Grove,\" which was the basis for Kurosawa's classic film ", "Writing at the beginning of the twentieth century, Ryunosuke Akutagawa created disturbing stories out of Japan's cultural upheaval. Whether his fictions are set centuries past or close to the present, Akutagawa was a modernist, writing in polished, superbly nuanced prose subtly exposing human needs and flaws. \"In a Grove,\" which was the basis for Kurosawa's classic film ", ", tells the chilling story of the killing of a samurai through the testimony of witnesses, including the spirit of the murdered man. The fable-like \"Yam Gruel\" is an account of desire and humiliation, but one in which the reader's sympathy is thoroughly unsettled. And in \"The Martyr,\" a beloved orphan raised by Jesuit priests is exiled when he refuses to admit that he made a local girl pregnant. He regains their love and respect only at the price of his life. All six tales in the collection show Akutagawa as a master storyteller and an exciting voice of modern Japanese literature."], "author": "Ryūnosuke Akutagawa", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-12-17 00:00:00", "ISBN": "0871401738"},
{"url": "https://www.goodreads.com/book/show/8376484-biography-of-an-american-bondman-by-his-daughter", "num_ratings": "1", "num_reviews": "1", "avg_ratings": 2.0, "genres": [], "title": "Biography of an American Bondman, by His Daughter", "description": ["Josephine Brown (1839-? ) was the youngest child of the abolitionist and author William Wells Brown (1814-1862) and his wife Elizabeth. Josephine joined her father on his lecture tours, during which she transcribed his correspondence. She, not quite fifteen, found a position at a school in Woolwich, where several of her pupils were older than she was. During these days, Jo", "Josephine Brown (1839-? ) was the youngest child of the abolitionist and author William Wells Brown (1814-1862) and his wife Elizabeth. Josephine joined her father on his lecture tours, during which she transcribed his correspondence. She, not quite fifteen, found a position at a school in Woolwich, where several of her pupils were older than she was. During these days, Josephine also kept quite busy as an assistant to her father's extensive antislavery activities. In 1854, Josephine was again in France for additional schooling. In 1855, she returned to the United States, where she completed the biography of her father she had begun in France: Biography of an American Bondman, by His Daughter. As Josephine Brown explained in her preface to the book, she was moved to finish the book when she discovered that her father's autobiography Narrative of William W. Brown: A Fugitive Slave (1847) was out of print."], "author": "Josephine Brown", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-09-25 00:00:00", "ISBN": "1409980731"},
{"url": "https://www.goodreads.com/book/show/349076.Narrative_of_Sojourner_Truth", "num_ratings": "7,130", "num_reviews": "194", "avg_ratings": 4.11, "genres": ["History", "Nonfiction", "Biography", "Classics", "Autobiography", "Memoir", "Cultural", "African American", "Feminism"], "title": "Narrative of Sojourner Truth", "description": ["One of the most famous and admired African-American women in U.S. history, Sojourner Truth sang, preached, and debated at camp meetings across the country, led by her devotion to the antislavery movement and her ardent pursuit of women's rights. Born into slavery in 1797, Truth fled from bondage some 30 years later to become a powerful figure in the progressive movements r", "One of the most famous and admired African-American women in U.S. history, Sojourner Truth sang, preached, and debated at camp meetings across the country, led by her devotion to the antislavery movement and her ardent pursuit of women's rights. Born into slavery in 1797, Truth fled from bondage some 30 years later to become a powerful figure in the progressive movements reshaping American society.", "This remarkable narrative, first published in 1850, offers a rare glimpse into the little-documented world of Northern slavery. Truth recounts her life as a slave in rural New York, her separation from her family, her religious conversion, and her life as a traveling preacher during the 1840s. She also describes her work as a social reformer, counselor of former slaves, and sponsor of a black migration to the West.", "A spellbinding orator and implacable prophet, Truth mesmerized audiences with her tales of life in bondage and with her moving renditions of Methodist hymns and her own songs. Frederick Douglass described her message as a \"strange compound of wit and wisdom, of wild enthusiasm, and flint-like common sense.\" This inspiring account of a black woman's struggles for racial and sexual equality is essential reading for students of American history, as well as for those interested in the continuing quest for equality of opportunity."], "author": "Sojourner Truth", "num_pages": "80", "awards": [], "places": [], "character_names": ["Sojourner Truth"], "language": "English", "publish_date": "1997-07-07 00:00:00", "ISBN": "048629899X"},
{"url": "https://www.goodreads.com/book/show/501635.Nip_the_Buds_Shoot_the_Kids", "num_ratings": "2,926", "num_reviews": "255", "avg_ratings": 3.8, "genres": ["Cultural", "Japan", "Fiction", "Asian Literature", "Japanese Literature"], "title": "Nip the Buds, Shoot the Kids", "description": ["Nip the Buds, Shoot the Kids recounts the exploits of 15 teenage reformatory boys evacuated in wartime to a remote mountain village where they are feared and detested by the local peasants. When plague breaks out, the villagers flee, blocking the boys inside the deserted town. Their brief attempt to build autonomous lives of self-respect, love, and tribal valor is doomed i", "Nip the Buds, Shoot the Kids recounts the exploits of 15 teenage reformatory boys evacuated in wartime to a remote mountain village where they are feared and detested by the local peasants. When plague breaks out, the villagers flee, blocking the boys inside the deserted town. Their brief attempt to build autonomous lives of self-respect, love, and tribal valor is doomed in the face of death and the adult nightmare of war."], "author": "Kenzaburō Ōe", "num_pages": "189", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-06-13 00:00:00", "ISBN": "0802134637"},
{"url": "https://www.goodreads.com/book/show/152642.The_River_Between", "num_ratings": "2,405", "num_reviews": "173", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Kenya", "Literature", "African Literature"], "title": "The River Between", "description": ["Christian missionaries attempt to outlaw the female circumcision ritual and in the process create a terrible rift between the two Kikuyu communities on either side of the river."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "152", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-11 00:00:00", "ISBN": "0435905481"},
{"url": "https://www.goodreads.com/book/show/73723.The_President", "num_ratings": "2,759", "num_reviews": "190", "avg_ratings": 3.99, "genres": ["Fiction", "European Literature", "Spanish Literature", "Cultural", "Latin American", "Classics"], "title": "The President", "description": ["Guatemalan diplomat and writer Miguel Angel Asturias (1899–1974) began this award-winning work while still a law student. It is a story of a ruthless dictator and his schemes to dispose of a political adversary in an unnamed Latin American country usually identified as Guatemala. The book has been acclaimed for portraying both a totalitarian government and its damaging psy", "Guatemalan diplomat and writer Miguel Angel Asturias (1899–1974) began this award-winning work while still a law student. It is a story of a ruthless dictator and his schemes to dispose of a political adversary in an unnamed Latin American country usually identified as Guatemala. The book has been acclaimed for portraying both a totalitarian government and its damaging psychological effects. Drawing from his experiences as a journalist writing under repressive conditions, Asturias employs such literary devices as satire to convey the government’s transgressions and surrealistic dream sequences to demonstrate the police state’s impact on the individual psyche. Asturias’s stance against all forms of injustice in Guatemala caused critics to view the author as a compassionate spokesperson for the oppressed. My work,” Asturias promised when he accepted the Nobel Prize for Literature, “will continue to reflect the voice of the people, gathering their myths and popular beliefs and at the same time seeking to give birth to a universal consciousness of Latin American problems.”"], "author": "Miguel Ángel Asturias", "num_pages": "286", "awards": ["Prix du Meilleur Livre Étranger for Roman (1950)"], "places": ["Guatemala"], "character_names": [], "language": "English", "publish_date": "1997-09-01 00:00:00", "ISBN": "0881339512"},
{"url": "https://www.goodreads.com/book/show/240009.The_Interesting_Narrative_of_the_Life_of_Olaudah_Equiano", "num_ratings": "9,065", "num_reviews": "341", "avg_ratings": 3.72, "genres": ["History", "Nonfiction", "Classics", "Biography", "Autobiography", "Memoir"], "title": "The Interesting Narrative of the Life of Olaudah Equiano: Written by Himself", "description": ["Widely admired for its vivid accounts of the slave trade, Olaudah Equiano's autobiography -- the first slave narrative to attract a significant readership -- reveals many aspects of the eighteenth-century Western world through the experiences of one individual. The second edition reproduces the original London printing, supervised by Equiano in 1789. Robert J. Allison's in", "Widely admired for its vivid accounts of the slave trade, Olaudah Equiano's autobiography -- the first slave narrative to attract a significant readership -- reveals many aspects of the eighteenth-century Western world through the experiences of one individual. The second edition reproduces the original London printing, supervised by Equiano in 1789. Robert J. Allison's introduction, which places Equiano's narrative in the context of the Atlantic slave trade, has been revised and updated to reflect the heated controversy surrounding Equiano's birthplace, as well as the latest scholarship on Atlantic history and the history of slavery. Improved pedagogical features include contemporary illustrations with expanded captions and a map showing Equiano's travels in greater detail. Helpful footnotes provide guidance throughout the eighteenth-century text, and a chronology and an up-to-date bibliography aid students in their study of this thought-provoking narrative."], "author": "Olaudah Equiano", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-07 00:00:00", "ISBN": "0312442033"},
{"url": "https://www.goodreads.com/book/show/369783.Our_Nig", "num_ratings": "2,026", "num_reviews": "108", "avg_ratings": 3.68, "genres": ["Classics", "Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Academic", "School", "Literature", "American"], "title": "Our Nig", "description": ["Our Nig is the tale of a mixed-race girl, Frado, abandoned by her white mother after the death of the child's black father. Frado becomes the servant of the Bellmonts, a lower-middle-class white family in the free North, while slavery is still legal in the South, and suffers numerous abuses in their household. Frado's story is a tragic one; having left the Bellmonts, she e", "Our Nig is the tale of a mixed-race girl, Frado, abandoned by her white mother after the death of the child's black father. Frado becomes the servant of the Bellmonts, a lower-middle-class white family in the free North, while slavery is still legal in the South, and suffers numerous abuses in their household. Frado's story is a tragic one; having left the Bellmonts, she eventually marries a black fugitive slave, who later abandons her."], "author": "Harriet E. Wilson", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-12-28 00:00:00", "ISBN": "0142437778"},
{"url": "https://www.goodreads.com/book/show/280470.Complete_Writings", "num_ratings": "145", "num_reviews": "11", "avg_ratings": 3.46, "genres": ["Poetry", "History", "Classics", "Academic", "College"], "title": "Complete Writings", "description": ["In 1761, a young girl arrived in Boston on a slave ship, sold to the Wheatley family, and given the name Phillis Wheatley. Struck by Phillis' extraordinary precociousness, the Wheatleys provided her with an education that was unusual for a woman of the time and astonishing for a slave. After", "In 1761, a young girl arrived in Boston on a slave ship, sold to the Wheatley family, and given the name Phillis Wheatley. Struck by Phillis' extraordinary precociousness, the Wheatleys provided her with an education that was unusual for a woman of the time and astonishing for a slave. After studying English and classical literature, geography, the Bible, and Latin, Phillis published her first poem in 1767 at the age of 14, winning much public attention and considerable fame. When Boston publishers who doubted its authenticity rejected an initial collection of her poetry, Wheatley sailed to London in 1773 and found a publisher there for ", "This volume collects both Wheatley's letters and her poetry: hymns, elegies, translations, philosophical poems, tales, and epyllions--including a poignant plea to the Earl of Dartmouth urging freedom for America and comparing the country's condition to her own. With her contemplative elegies and her use of the poetic imagination to escape an unsatisfactory world, Wheatley anticipated the Romantic Movement of the following century. The appendices to this edition include poems of Wheatley's contemporary African-American poets: Lucy Terry, Jupiter Harmon, and Francis Williams.", "For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators."], "author": "Phillis Wheatley", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-01 00:00:00", "ISBN": "014042430X"},
{"url": "https://www.goodreads.com/book/show/123773.The_Dark_Child", "num_ratings": "1,291", "num_reviews": "104", "avg_ratings": 3.65, "genres": ["Cultural", "Africa", "Nonfiction", "Cultural", "France", "Autobiography", "Memoir"], "title": "The Dark Child", "author": "Camara Laye", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1954-01-01 00:00:00", "ISBN": "080901548X"},
{"url": "https://www.goodreads.com/book/show/247960.Clotel", "num_ratings": "1,410", "num_reviews": "90", "avg_ratings": 3.56, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Academic", "School", "Race", "Literature", "19th Century"], "title": "Clotel: or, The President's Daughter", "description": ["First published in December 1853, ", " was written amid then unconfirmed rumors that Thomas Jefferson had fathered children with one of his slaves. The story begins with the auction of his mistress, here called Currer, and their two daughters, Clotel and Althesa. The Virginian who buys Clotel falls in love with her, gets her pregnant, seems to promise marriage—then sells", "First published in December 1853, ", " was written amid then unconfirmed rumors that Thomas Jefferson had fathered children with one of his slaves. The story begins with the auction of his mistress, here called Currer, and their two daughters, Clotel and Althesa. The Virginian who buys Clotel falls in love with her, gets her pregnant, seems to promise marriage—then sells her. Escaping from the slave dealer, Clotel returns to Virginia disguised as a white man in order to rescue her daughter, Mary, a slave in her father’s house. A fast-paced and harrowing tale of slavery and freedom, of the hypocrisies of a nation founded on democratic principles, ", " is more than a sensationalist novel. It is a founding text of the African American novelistic tradition, a brilliantly composed and richly detailed exploration of human relations in a new world in which race is a cultural construct."], "author": "William Wells Brown", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-12-30 00:00:00", "ISBN": "0142437727"},
{"url": "https://www.goodreads.com/book/show/669780.Season_of_Migration_to_the_North", "num_ratings": "15,293", "num_reviews": "1,931", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Northern Africa", "Sudan", "Literature"], "title": "Season of Migration to the North", "description": ["After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into", "After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into his confidence, telling him the story of his own years in London, of his brilliant career as an economist, and of the series of fraught and deadly relationships with European women that led to a terrible public reckoning and his return to his native land.", "But what is the meaning of Mustafa’s shocking confession? Mustafa disappears without explanation, leaving the young man—whom he has asked to look after his wife—in an unsettled and violent no-man’s-land between Europe and Africa, tradition and innovation, holiness and defilement, and man and woman, from which no one will escape unaltered or unharmed.", "Season of Migration to the North is a rich and sensual work of deep honesty and incandescent lyricism. In 2001 it was selected by a panel of Arab writers and critics as the most important Arab novel of the twentieth century."], "author": "Tayeb Salih", "num_pages": "176", "awards": [], "places": ["North Africa"], "character_names": [], "language": "English", "publish_date": "1970-01-01 00:00:00", "ISBN": "0435900668"},
{"url": "https://www.goodreads.com/book/show/129877.The_Guide", "num_ratings": "7,352", "num_reviews": "424", "avg_ratings": 3.9, "genres": ["Fiction", "Cultural", "India", "Asian Literature", "Indian Literature", "Classics"], "title": "The Guide", "description": [" (1906-2001) is unusual among Indian authors writing in English in that he has stayed contentedly in his home country, venturing abroad only rarely. He rarely addresses political issues or tries to explore the cutting edge of fiction. He is a traditional teller of tales, a creator of realist fiction which is often gentle, humorous, and warm rather than hard-hit", " (1906-2001) is unusual among Indian authors writing in English in that he has stayed contentedly in his home country, venturing abroad only rarely. He rarely addresses political issues or tries to explore the cutting edge of fiction. He is a traditional teller of tales, a creator of realist fiction which is often gentle, humorous, and warm rather than hard-hitting or profound. Almost all of his writings are set in the fictional city of Malgudi, and are narrowly focused on the lives of relatively humble individuals, neither extremely poor nor very rich.", " is one of his most interesting books, which begins as a comic look at the life of a rogue, but evolves into something quite different. It should be noted that Narayan is not a devout Hindu, and has accused Westerners of wrongly supposing that all Indians are deeply spiritual beings; but it is also true that he was deeply impressed by some experiences he had with a medium after the sudden death of his young wife (described movingly in The English Teacher (1945).", "Narayan has stated that the incident of the reluctant holy man was based on a real event which he read about in the newspaper.", "Formerly India's most corrupt tourist guide, Raju--just released from prison--seeks refuge in an abandoned temple. Mistaken for a holy man, he plays the part and succeeds so well that God himself intervenes to put Raju's newfound sanctity to the test. ", "Narayan's most celebrated novel, ", " won him the National Prize of the Indian Literary Academy, his country's highest literary honor."], "author": "R.K. Narayan", "num_pages": "224", "awards": ["Sahitya Akademi Award (1960)"], "places": [], "character_names": ["Rosie March", "Raju", "Gaffur"], "language": "English", "publish_date": "2006-11-02 00:00:00", "ISBN": "0143039644"},
{"url": "https://www.goodreads.com/book/show/155054.Strange_Tales_from_a_Chinese_Studio", "num_ratings": "1,292", "num_reviews": "113", "avg_ratings": 4.09, "genres": ["Cultural", "China", "Short Stories", "Classics", "Fiction", "Fantasy", "Asian Literature", "Chinese Literature"], "title": "Strange Tales from a Chinese Studio", "description": ["Eminent Chinese scholar John Minford's superb translation captures the consummate skill and understated humor of Pu Songling's classic ", " (also known as ", "). With elegant prose, witty wordplay, and subtle charm, the 104 stories (selected out of over 400 from the original work) in this collection reveal a world in wh", "Eminent Chinese scholar John Minford's superb translation captures the consummate skill and understated humor of Pu Songling's classic ", " (also known as ", "). With elegant prose, witty wordplay, and subtle charm, the 104 stories (selected out of over 400 from the original work) in this collection reveal a world in which nothing is as it seems. In his tales of shape-shifting spirits, bizarre phenomena, haunted buildings, and enchanted objects, Pu Songling pushes the boundaries of human experience and enlightens as he entertains.", " * Includes an introduction, suggestions for further reading, glossary, notes, and illustrations"], "author": "Pu Songling", "num_pages": "608", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-25 00:00:00", "ISBN": "0140447407"},
{"url": "https://www.goodreads.com/book/show/1830254.Hawaii_s_Story_by_Hawaii_s_Queen", "num_ratings": "603", "num_reviews": "92", "avg_ratings": 3.85, "genres": ["History", "Nonfiction", "Biography", "Autobiography", "Memoir"], "title": "Hawaii's Story by Hawaii's Queen", "description": ["Possibly the most important work in Hawaiian literature, Hawaii's Story is a poignant plea from Hawaii's queen to restore her people's kingdom. FIrst published in 1898 by Queen Liliuokalani, Hawaii's last queen."], "author": "Liliuokalani", "num_pages": "409", "awards": [], "places": ["Hawaii", "Honolulu, Hawaii", "Waikiki, Honolulu, Hawaii", "Oahu, Hawaii"], "character_names": ["Queen Victoria", "Liliuokalani", "Kapaakea", "Pākī", "John Owen Dominis", "Emma of Hawaii", "Kamehameha V", "Kamehameha IV", "Kalakaua", "Likelike", "Bernice Pauahi Bishop", "Kapiolani", "Albert S. Willis", "Paul Neumann", "Charles Burnett Wilson"], "language": "English", "publish_date": "1990-01-01 00:00:00", "ISBN": "0935180850"},
{"url": "https://www.goodreads.com/book/show/123748.God_s_Bits_of_Wood", "num_ratings": "2,062", "num_reviews": "117", "avg_ratings": 3.92, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Western Africa", "Senegal"], "title": "God's Bits of Wood", "description": ["In 1947-48 the workers on the Dakar-Niger railway staged a strike. In this vivid, timeless novel, Ousmane Sembène envinces the color, passion, and tragedy of those formative years in the history of West Africa."], "author": "Ousmane Sembène", "num_pages": "252", "awards": [], "places": ["Senegal"], "character_names": [], "language": "English", "publish_date": "2008-08-11 00:00:00", "ISBN": "0435909592"},
{"url": "https://www.goodreads.com/book/show/62772.I_Am_a_Cat", "num_ratings": "6,142", "num_reviews": "630", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics"], "title": "I Am a Cat", "description": ["So begins one of the most original and unforgettable works in Japanese literature.", "Richly allegorical and delightfully readable, ", " is the chronicle of an unloved, unwanted, wandering kitten who spends all his time observing human nature - from the dramas of businessmen and schoolteachers to the foibles of priests and potentates. Fr", "So begins one of the most original and unforgettable works in Japanese literature.", "Richly allegorical and delightfully readable, ", " is the chronicle of an unloved, unwanted, wandering kitten who spends all his time observing human nature - from the dramas of businessmen and schoolteachers to the foibles of priests and potentates. From this unique perfective, author Sōseki Natsume offers a biting commentary - shaped by his training in Chinese philosophy - on the social upheaval of the Meiji era.", " first appeared in ten installments in the literary magazine ", ", between 1905 and 1906. Sōseki had not intended to write more than the short story that makes up the first chapter of this book. After its great critical and popular success, he expanded it into this epic novel, which is universally recognised as a classic of world literature."], "author": "Sōseki Natsume", "num_pages": "480", "awards": [], "places": [], "character_names": ["Chinno Kushami", "Meitei", "Mizushima Kangetsu", "Kaneda Tomiko"], "language": "English", "publish_date": "2001-09-01 00:00:00", "ISBN": "080483265X"},
{"url": "https://www.goodreads.com/book/show/189123.Love_in_a_Fallen_City", "num_ratings": "1,704", "num_reviews": "188", "avg_ratings": 3.87, "genres": ["Short Stories", "Cultural", "China", "Fiction", "Classics", "Cultural", "Asia", "Asian Literature", "Chinese Literature"], "title": "Love in a Fallen City", "description": ["Eileen Chang is one of the great writers of twentieth-century China, where she enjoys a passionate following both on the mainland and in Taiwan. At the heart of Chang's achievement is her short fiction—tales of love, longing, and the shifting and endlessly treacherous shoals of family life. Written when Chang was still in her twenties, these extraordinary stories combine a", "Eileen Chang is one of the great writers of twentieth-century China, where she enjoys a passionate following both on the mainland and in Taiwan. At the heart of Chang's achievement is her short fiction—tales of love, longing, and the shifting and endlessly treacherous shoals of family life. Written when Chang was still in her twenties, these extraordinary stories combine an unsettled, probing, utterly contemporary sensibility, keenly alert to sexual politics and psychological ambiguity, with an intense lyricism that echoes the classics of Chinese literature. ", ", the first collection in English of this dazzling body of work, introduces American readers to the stark and glamorous vision of a modern master."], "author": "Eileen Chang", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-10 00:00:00", "ISBN": "1590171780"},
{"url": "https://www.goodreads.com/book/show/536938.Thousand_Cranes", "num_ratings": "7,092", "num_reviews": "567", "avg_ratings": 3.77, "genres": ["Cultural", "Japan", "Fiction", "Asian Literature", "Japanese Literature", "Classics"], "title": "Thousand Cranes", "description": ["Thousand Cranes is a story of love given and love withheld. Set against the backdrop of Japan's traditional tea ceremony, it is a taut, highly dramatic novel gleaming with sudden passages of poetic beauty. In one of the book's strongest scenes, the two characters are symbolized by the two fine old China bowls, one female and one male, that sit before them.", "The novel opens w", "Thousand Cranes is a story of love given and love withheld. Set against the backdrop of Japan's traditional tea ceremony, it is a taut, highly dramatic novel gleaming with sudden passages of poetic beauty. In one of the book's strongest scenes, the two characters are symbolized by the two fine old China bowls, one female and one male, that sit before them.", "The novel opens with Kikuji on his way to a tea ceremony given by Chikako, one of his father's former mistresses. He is also on his way to act out the unfinished drama of his father's life. Kikuji's father had been a cultivated man, an art lover and a pleasure seeker. He had cast off one mistress, Chikako, but had loved another, Mrs Ota, until his death. Kikuji, like his father, tries to escape from Chikako, now masculine and meddlesome. Like his father, too, he is drawn to Mrs Ota, who has remained young, alluring and pliant even though her daughter, Fumiko, is only twenty years old. Kikuji's guilty passion for Mrs Ota and Fumiko's efforts to alter the family fate lead to the novel's stunning climax."], "author": "Yasunari Kawabata", "num_pages": "148", "awards": [], "places": [], "character_names": ["Kikuji", "Mrs. Ota", "Fumiko"], "language": "English", "publish_date": "1967-08-16 00:00:00", "ISBN": "4805301996"},
{"url": "https://www.goodreads.com/book/show/2235497.Ficciones", "num_ratings": "39,244", "num_reviews": "1,802", "avg_ratings": 4.46, "genres": ["Fiction", "Short Stories", "Classics", "Magical Realism", "Literature", "Fantasy"], "title": "Ficciones", "description": ["Reading Jorge Luis Borges is an experience akin to having the top of one's head removed for repairs. First comes the unfamiliar breeze tickling your cerebral cortex; then disorientation, even mild discomfort; and finally, the sense that the world has been irrevocably altered--and in this case, rendered infinitely more complex. First published in 1945, his ", " compres", "Reading Jorge Luis Borges is an experience akin to having the top of one's head removed for repairs. First comes the unfamiliar breeze tickling your cerebral cortex; then disorientation, even mild discomfort; and finally, the sense that the world has been irrevocably altered--and in this case, rendered infinitely more complex. First published in 1945, his ", " compressed several centuries' worth of philosophy and poetry into 17 tiny, unclassifiable pieces of prose. He offered up diabolical tigers, imaginary encyclopedias, ontological detective stories, and scholarly commentaries on nonexistent books, and in the process exploded all previous notions of genre. Would any of David Foster Wallace's famous footnotes be possible without Borges? Or, for that matter, the syntactical games of Perec, the metafictional pastiche of Calvino? For good or for ill, the blind Argentinian paved the way for a generation's worth of postmodern monkey business--and fiction will never be simply \"fiction\" again."], "author": "Jorge Luis Borges", "num_pages": "174", "awards": ["Premio Formentor de las Letras for International (1961)"], "places": [], "character_names": [], "language": "English", "publish_date": "1962-08-16 00:00:00", "ISBN": "0394172442"},
{"url": "https://www.goodreads.com/book/show/289991.Black_Rain", "num_ratings": "2,706", "num_reviews": "238", "avg_ratings": 3.98, "genres": ["Cultural", "Japan", "Asian Literature", "Japanese Literature", "Fiction", "Historical", "Historical Fiction", "War"], "title": "Black Rain", "description": ["Black Rain is a novel by Japanese author Masuji Ibuse. Ibuse began serializing Black Rain in the magazine Shincho in January 1965. The novel is based on historical records of the devastation caused by the atomic bombing of Hiroshima."], "author": "Masuji Ibuse", "num_pages": "304", "awards": ["Noma Literary Prize 野間文芸賞 (1966)"], "places": ["Hiroshima"], "character_names": [], "language": "English", "publish_date": "1988-10-15 00:00:00", "ISBN": "087011364X"},
{"url": "https://www.goodreads.com/book/show/3640066-the-waiting-years", "num_ratings": "1,294", "num_reviews": "114", "avg_ratings": 3.93, "genres": ["Cultural", "Japan", "Asian Literature", "Japanese Literature", "Fiction", "Historical", "Historical Fiction", "Cultural", "Asia"], "title": "The Waiting Years", "description": ["The beautiful, immature girl whom she took home to her husband was a maid only in name. Tomo's real mission had been to find him a mistress. Nor did her secret humiliation end there. The web that his insatiable lust spun about him soon trapped another young woman, and another ... and the relationships between the women thus caught were to form, over the years, a subtle, sh", "The beautiful, immature girl whom she took home to her husband was a maid only in name. Tomo's real mission had been to find him a mistress. Nor did her secret humiliation end there. The web that his insatiable lust spun about him soon trapped another young woman, and another ... and the relationships between the women thus caught were to form, over the years, a subtle, shifting pattern in which they all played a part. There was Suga, the innocent, introspective girl from a respectable but impoverished family; the outgoing, cheerful, almost boyish Yumi; the flirtatious, seductive Miya, who soon found her father-in-law more dependable as a man than his brutish son.... And at the center, rejected yet dominating them all, the near tragic figure of the wife Tomo, whose passionate heart was always, until that final day, held in check by an old-fashioned code. "], "author": "Fumiko Enchi", "num_pages": "203", "awards": ["Noma Literary Prize 野間文芸賞 (1957)"], "places": [], "character_names": [], "language": "English", "publish_date": "1971-12-01 00:00:00", "ISBN": "0870111590"},
{"url": "https://www.goodreads.com/book/show/5517.A_Raisin_in_the_Sun", "num_ratings": "55,619", "num_reviews": "2,380", "avg_ratings": 3.74, "genres": ["Plays", "Classics", "Fiction", "Drama", "Academic", "School"], "title": "A Raisin in the Sun", "description": ["\"Never before, in the entire history of the American theater, has so much of the truth of black people's lives been seen on the stage,\" observed James Baldwin shortly before ", " opened on Broadway in 1959.", "Indeed Lorraine Hansberry's award-winning drama about the hopes and aspirations of a struggling, working-class family living on the South Side of Chicago", "\"Never before, in the entire history of the American theater, has so much of the truth of black people's lives been seen on the stage,\" observed James Baldwin shortly before ", " opened on Broadway in 1959.", "Indeed Lorraine Hansberry's award-winning drama about the hopes and aspirations of a struggling, working-class family living on the South Side of Chicago connected profoundly with the psyche of black America--and changed American theater forever.  The play's title comes from a line in Langston Hughes's poem \"Harlem,\" which warns that a dream deferred might \"dry up/like a raisin in the sun.\"", "\"The events of every passing year add resonance to ", ",\" said ", ".  \"It is as if history is conspiring to make the play a classic.\"  This Modern Library edition presents the fully restored, uncut version of Hansberry's landmark work with an introduction by Robert Nemiroff."], "author": "Lorraine Hansberry", "num_pages": "160", "awards": ["New York Drama Critics' Circle Award for Best American Play (1959)", "Audie Award for Multi-Voiced Performance (2012)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2002-05-07 00:00:00", "ISBN": "0375508333"},
{"url": "https://www.goodreads.com/book/show/762134.Palace_Walk", "num_ratings": "11,753", "num_reviews": "1,142", "avg_ratings": 4.15, "genres": ["Fiction", "Historical", "Historical Fiction", "Northern Africa", "Egypt", "Cultural", "Africa", "Novels"], "title": "Palace Walk", "description": ["Volume I of the masterful ", ". A national best-seller in both hardcover and paperback, it introduces the engrossing saga of a Muslim family in Cairo during Egypt's occupation by British forces in the early 1900s."], "author": "Naguib Mahfouz", "num_pages": "501", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1990-08-16 00:00:00", "ISBN": "0385264666"},
{"url": "https://www.goodreads.com/book/show/1074489.The_Woman_in_the_Dunes", "num_ratings": "16,054", "num_reviews": "1,201", "avg_ratings": 3.91, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Classics", "Literature"], "title": "The Woman in the Dunes", "description": ["One of the premier Japanese novels of the twentieth century, The Women in the Dunes combines the essence of myth, suspense, and the existential novel. In a remote seaside village, Niki Jumpei, a teacher and amateur entomologist, is held captive with a young woman at the bottom of a vast sand pit where, Sisyphus-like, they are pressed into shoveling off the ever-advancing s", "One of the premier Japanese novels of the twentieth century, The Women in the Dunes combines the essence of myth, suspense, and the existential novel. In a remote seaside village, Niki Jumpei, a teacher and amateur entomologist, is held captive with a young woman at the bottom of a vast sand pit where, Sisyphus-like, they are pressed into shoveling off the ever-advancing sand dunes that threaten the village."], "author": "Kōbō Abe", "num_pages": "239", "awards": ["Prix du Meilleur Livre Étranger for Roman (1967)", "Yomiuri Prize 読売文学賞 for Fiction (1962)"], "places": ["Japan"], "character_names": ["Niki Jumpei"], "language": "English", "publish_date": "1991-04-16 00:00:00", "ISBN": "0394718143"},
{"url": "https://www.goodreads.com/book/show/2547.The_Prophet", "num_ratings": "180,594", "num_reviews": "7,125", "avg_ratings": 4.23, "genres": ["Poetry", "Philosophy", "Classics", "Fiction", "Spirituality", "Religion"], "title": "The Prophet", "description": ["Kahlil Gibran’s masterpiece, ", "is one of the most beloved classics of our time. Published in 1923, it has been translated into more than twenty languages, and the American editions alone have sold more than nine million copies.", "is a collection of poetic essays that are philosophical, spiritual, and, above all, inspirational. Gibran’s musings are divid", "Kahlil Gibran’s masterpiece, ", "is one of the most beloved classics of our time. Published in 1923, it has been translated into more than twenty languages, and the American editions alone have sold more than nine million copies.", "is a collection of poetic essays that are philosophical, spiritual, and, above all, inspirational. Gibran’s musings are divided into twenty-eight chapters covering such sprawling topics as love, marriage, children, giving, eating and drinking, work, joy and sorrow, housing, clothes, buying and selling, crime and punishment, laws, freedom, reason and passion, pain, self-knowledge, teaching, friendship, talking, time, good and evil, prayer, pleasure, beauty, religion, and death."], "author": "Kahlil Gibran", "num_pages": "127", "awards": [], "places": ["Orphalese"], "character_names": ["Al Mustafa", "Al Mitra"], "language": "English", "publish_date": "2010-01-01 00:00:00", "ISBN": "000100039X"},
{"url": "https://www.goodreads.com/book/show/10216275-native-son", "num_ratings": "74,473", "num_reviews": "3,161", "avg_ratings": 3.97, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Literature", "Novels", "Race", "Academic", "School", "Literature", "American", "Literature", "Banned Books"], "title": "Native Son", "description": ["Right from the start, Bigger Thomas had been headed for jail. It could have been for assault or petty larceny; by chance, it was for murder and rape. ", " tells the story of this young black man caught in a downward spiral after he kills a young white woman in a brief moment of panic.", "Set in Chicago in the 1930s, Wright's powerful novel is an unsparing reflection on t", "Right from the start, Bigger Thomas had been headed for jail. It could have been for assault or petty larceny; by chance, it was for murder and rape. ", " tells the story of this young black man caught in a downward spiral after he kills a young white woman in a brief moment of panic.", "Set in Chicago in the 1930s, Wright's powerful novel is an unsparing reflection on the poverty and feelings of hopelessness experienced by people in inner cities across the country and of what it means to be black in America."], "author": "Richard Wright", "num_pages": "398", "awards": ["New York Drama Critics' Circle Award Nominee for Best American Play"], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Bigger Thomas", "Mary Dalton", "Mrs. Dalton", "Henry Dalton", "Jan Erlone", "Boris Max", "Mrs. Thomas", "Buddy Thomas", "Vera Thomas"], "language": "English", "publish_date": "1966-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1593471.The_Souls_of_Black_Folk", "num_ratings": "27,100", "num_reviews": "1,029", "avg_ratings": 4.26, "genres": ["Nonfiction", "History", "Classics", "Race", "Cultural", "African American", "Writing", "Essays", "Philosophy"], "title": "The Souls of Black Folk", "description": ["William Edward Burghardt Du Bois (1868-1963) is the greatest of African American intellectuals--a sociologist, historian, novelist, and activist whose astounding career spanned the nation's history from Reconstruction to the civil rights movement. Born in Massachusetts and educated at Fisk, Harvard, and the University of Berlin, Du Bois penned his epochal masterpiece, ", "William Edward Burghardt Du Bois (1868-1963) is the greatest of African American intellectuals--a sociologist, historian, novelist, and activist whose astounding career spanned the nation's history from Reconstruction to the civil rights movement. Born in Massachusetts and educated at Fisk, Harvard, and the University of Berlin, Du Bois penned his epochal masterpiece, ", ", in 1903. It remains his most studied and popular work; its insights into life at the turn of the 20th century still ring true."], "author": "W.E.B. Du Bois", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1994-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18501890-twelve-years-a-slave", "num_ratings": "73,925", "num_reviews": "5,379", "avg_ratings": 4.17, "genres": ["Nonfiction", "History", "Biography", "Classics", "Autobiography", "Memoir"], "title": "Twelve Years a Slave", "description": ["Twelve Years a Slave by Solomon Northup is a memoir of a black man who was born free in New York state but kidnapped, sold into slavery and kept in bondage for 12 years in Louisiana before the American Civil War. He provided details of slave markets in Washington, DC, as well as describing at length cotton cultivation on major plantations in Louisiana."], "author": "Solomon Northup", "num_pages": "154", "awards": [], "places": ["Louisiana"], "character_names": ["Solomon Northup"], "language": "English", "publish_date": "2013-09-08 00:00:00", "ISBN": "1492368288"},
{"url": "https://www.goodreads.com/book/show/25200.Silence", "num_ratings": "18,494", "num_reviews": "2,478", "avg_ratings": 4.09, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Japan", "Religion", "Asian Literature", "Japanese Literature", "Classics"], "title": "Silence", "description": ["It is 1640 and Father Sebastian Rodrigues, an idealistic Jesuit priest, sets sail for Japan determined to he", "It is 1640 and Father Sebastian Rodrigues, an idealistic Jesuit priest, sets sail for Japan determined to help the brutally oppressed Christians there. He is also desperate to discover the truth about his former mentor, rumoured to have renounced his faith under torture. Rodrigues cannot believe the stories about a man he so revered, but as his journey takes him deeper into Japan and then into the hands of those who would crush his faith, he finds himself forced to make an impossible choice: whether to abandon his flock or his God.", "The recipient of the 1966 Tanizaki Prize, Silence is Shusaku Endo's most highly acclaimed work and has been called one of the twentieth century's finest novels. As empathetic as it is powerful, it is an astonishing exploration of faith and suffering and an award-winning classic."], "author": "Shūsaku Endō", "num_pages": "201", "awards": ["Tanizaki Prize 谷崎潤一郎賞 (1966)"], "places": ["Japan"], "character_names": ["Sebastian Rodrigues", "Cristóvão Ferreira", "Kichijiro", "Tokugawa Inoue"], "language": "English", "publish_date": "1999-01-01 00:00:00", "ISBN": "0800871863"},
{"url": "https://www.goodreads.com/book/show/5115153-go-tell-it-on-the-mountain", "num_ratings": "34,838", "num_reviews": "1,784", "avg_ratings": 4.01, "genres": ["Fiction", "Cultural", "African American", "Classics", "Religion", "Novels"], "title": "Go Tell It on the Mountain", "description": ["\" Mountain, \" Baldwin said, \" is the book I had to write if I was ever going to write anything else.\" Go Tell It On The Mountain, first published in 1953, is Baldwin's first major work, a novel that has established itself as an American classic. With lyrical precision, psychological directness, resonating symbolic power, and a rage that is at once unrelenting and compassio", "\" Mountain, \" Baldwin said, \" is the book I had to write if I was ever going to write anything else.\" Go Tell It On The Mountain, first published in 1953, is Baldwin's first major work, a novel that has established itself as an American classic. With lyrical precision, psychological directness, resonating symbolic power, and a rage that is at once unrelenting and compassionate, Baldwin chronicles a fourteen-year-old boy's discovery of the terms of his identity as the stepson of the minister of a storefront Pentecostal church in Harlem one Saturday in March of 1935. Baldwin's rendering of his protagonist's spiritual, sexual, and moral struggle of self-invention opened new possibilities in the American language and in the way Americans understand themselves."], "author": "James Baldwin", "num_pages": "256", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "1991-08-16 00:00:00", "ISBN": "0451022726"},
{"url": "https://www.goodreads.com/book/show/6696184-the-autobiography-of-malcom-x", "num_ratings": "149,932", "num_reviews": "4,464", "avg_ratings": 4.3, "genres": ["Nonfiction", "Biography", "History", "Autobiography", "Memoir", "Biography", "Autobiography", "Classics"], "title": "The Autobiography of Malcom X", "description": ["ONE OF TIME’S TEN MOST IMPORTANT NONFICTION BOOKS OF THE TWENTIETH CENTURY", "In the searing pages of this classic autobiography, originally published in 1964, Malcolm X, the Muslim leader, firebrand, and anti-integrationist, tells the extraordinary story of his life and the growth of the Black Muslim movement. His fascinating perspective on the lies and limitations of the Ame", "ONE OF TIME’S TEN MOST IMPORTANT NONFICTION BOOKS OF THE TWENTIETH CENTURY", "In the searing pages of this classic autobiography, originally published in 1964, Malcolm X, the Muslim leader, firebrand, and anti-integrationist, tells the extraordinary story of his life and the growth of the Black Muslim movement. His fascinating perspective on the lies and limitations of the American Dream, and the inherent racism in a society that denies its nonwhite citizens the opportunity to dream, gives extraordinary insight into the most urgent issues of our own time. The Autobiography of Malcolm X stands as the definitive statement of a movement and a man whose work was never completed but whose message is timeless. It is essential reading for anyone who wants to understand America.", "Praise for The Autobiography of Malcolm X", "“Malcolm X’s autobiography seemed to offer something different. His repeated acts of self-creation spoke to me; the blunt poetry of his words, his unadorned insistence on respect, promised a new and uncompromising order, martial in its discipline, forged through sheer force of will.”—Barack Obama, Dreams from My Father", "“Extraordinary . . . a brilliant, painful, important book.”—The New York Times", "“A great book . . . Its dead level honesty, its passion, its exalted purpose, will make it stand as a monument to the most painful truth.”—The Nation", "“The most important book I’ll ever read, it changed the way I thought, it changed the way I acted. It has given me courage I didn’t know I had inside me. I’m one of hundreds of thousands whose lives were changed for the better.”—Spike Lee", "“This book will have a permanent place in the literature of the Afro-American struggle.”—I. F. Stone"], "author": "Malcolm X", "num_pages": "455", "awards": [], "places": [], "character_names": ["Muhammad Ali", "Malcolm X", "George Lincoln Rockwell", "Alex Haley", "Elijah Muhammad", "Betty Shabazz"], "language": "English", "publish_date": "1992-09-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7126.The_Count_of_Monte_Cristo", "num_ratings": "649,779", "num_reviews": "17,375", "avg_ratings": 4.23, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Adventure", "Literature", "Cultural", "France", "Historical", "Classics", "Classic Literature", "Novels", "Romance"], "title": "The Count of Monte Cristo", "description": ["In 1815 Edmond Dantès, a young and successful merchant sailor who has just recently been granted the succession of his erstwhile captain Leclère, returns to Marseille to marry his Catalan fiancée Mercédès. Thrown in prison for a crime he has not committed, Edmond Dantès is confined to the grim fortress of If. There he learns of a great hoard of treasure hidden on the Isle", "In 1815 Edmond Dantès, a young and successful merchant sailor who has just recently been granted the succession of his erstwhile captain Leclère, returns to Marseille to marry his Catalan fiancée Mercédès. Thrown in prison for a crime he has not committed, Edmond Dantès is confined to the grim fortress of If. There he learns of a great hoard of treasure hidden on the Isle of Monte Cristo and he becomes determined not only to escape, but also to unearth the treasure and use it to plot the destruction of the three men responsible for his incarceration."], "author": "Alexandre Dumas", "num_pages": "1536", "awards": [], "places": ["Marseille (Marseilles)", "If", "Montecristo", "Marseille (Marseilles)", "Montecristo", "Rome", "Paris"], "character_names": ["Edmond Dantès", "Abbé Faria", "Giovanni Bertuccio", "Luigi Vampa", "Haydée", "Mercédès Mondego", "Fernand Mondego", "Albert de Morcerf", "Baron Danglars", "Gérard de Villefort", "Valentine de Villefort", "Noirtier de Villefort", "Héloïse de Villefort", "Pierre Morrel", "Maximilien Morrel", "Beauchamp", "Franz d'Épinay", "Lucien Debray", "Eugénie Danglars", "Hermine Danglars", "Benedetto", "Kadrus (tailor,neighboring)"], "language": "English", "publish_date": "2003-05-27 00:00:00", "ISBN": "0140449264"},
{"url": "https://www.goodreads.com/book/show/616862.Narrative_of_the_Life_of_Frederick_Douglass", "num_ratings": "75,676", "num_reviews": "3,218", "avg_ratings": 3.98, "genres": ["Nonfiction", "History", "Classics", "Biography", "Autobiography", "Memoir", "Academic", "School"], "title": "Narrative of the Life of Frederick Douglass: An American Slave", "description": ["Written more than a century ago by Frederick Douglass, a former slave who went on to become a famous orator, U.S. minister, and a leader of his people, this masterpiece is one of the most eloquent indictments of slavery ever recorded. Douglass"], "author": "Frederick Douglass", "num_pages": "124", "awards": [], "places": ["United States of America", "Maryland"], "character_names": ["Frederick Douglass"], "language": "English", "publish_date": "1963-04-03 00:00:00", "ISBN": "0385007051"},
{"url": "https://www.goodreads.com/book/show/18185.The_Pillow_Book", "num_ratings": "4,867", "num_reviews": "425", "avg_ratings": 4.02, "genres": ["Cultural", "Japan", "Classics", "Nonfiction", "Asian Literature", "Japanese Literature", "History"], "title": "The Pillow Book", "description": ["\"The Pillow Book of Sei Shonagon\" is a fascinating, detailed account of Japanese court life in the eleventh century. Written by a lady of the court at the height of Heian culture, this book enthralls with its lively gossip, witty observations, and subtle impressions. ", "Lady Shonagon was an erstwhile rival of Lady Murasaki, whose novel, \"The Tale of Genji,\" fictionalized the", "\"The Pillow Book of Sei Shonagon\" is a fascinating, detailed account of Japanese court life in the eleventh century. Written by a lady of the court at the height of Heian culture, this book enthralls with its lively gossip, witty observations, and subtle impressions. ", "Lady Shonagon was an erstwhile rival of Lady Murasaki, whose novel, \"The Tale of Genji,\" fictionalized the elite world Lady Shonagon so eloquently relates. Featuring reflections on royal and religious ceremonies, nature, conversation, poetry, and many other subjects, \"The Pillow Book\" is an intimate look at the experiences and outlook of the Heian upper class, further enriched by Ivan Morris's extensive notes and critical contextualization."], "author": "Sei Shōnagon", "num_pages": "419", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-12-30 00:00:00", "ISBN": "0231073372"},
{"url": "https://www.goodreads.com/book/show/16981.Invisible_Man", "num_ratings": "137,619", "num_reviews": "4,709", "avg_ratings": 3.85, "genres": ["Classics", "Fiction", "Literature", "Cultural", "African American"], "title": "Invisible Man", "description": ["First published in 1952 and immediately hailed as a masterpiece, ", " is one of those rare novels that have changed the shape of American literature. For not only does Ralph Ellison's nightmare journey across the racial divide tell unparalleled truths about the nature of bigotry and its effects on the minds of both victims and perpetrators, it gives us an entirely", "First published in 1952 and immediately hailed as a masterpiece, ", " is one of those rare novels that have changed the shape of American literature. For not only does Ralph Ellison's nightmare journey across the racial divide tell unparalleled truths about the nature of bigotry and its effects on the minds of both victims and perpetrators, it gives us an entirely new model of what a novel can be.", "As he journeys from the Deep South to the streets and basements of Harlem, from a horrifying \"battle royal\" where black men are reduced to fighting animals, to a Communist rally where they are elevated to the status of trophies, Ralph Ellison's nameless protagonist ushers readers into a parallel universe that throws our own into harsh and even hilarious relief. Suspenseful and sardonic, narrated in a voice that takes in the symphonic range of the American language, black and white, ", " is one of the most audacious and dazzling novels of our century."], "author": "Ralph Ellison", "num_pages": "581", "awards": ["National Book Award for Fiction (1953)"], "places": ["New York City, New York", "Harlem, New York City, New York", "Alabama"], "character_names": ["Mr. Norton", "Jim Trueblood", "Dr. Hebert Bledsoe", "Mary Rambo", "Lucius Brockway", "Brother Jack", "Tod Clifton", "Ras the Exhorter", "Sybil (Invisible Man)", "Unnamed Narrator"], "language": "English", "publish_date": "1995-02-01 00:00:00", "ISBN": "0679732764"},
{"url": "https://www.goodreads.com/book/show/37781.Things_Fall_Apart", "num_ratings": "236,327", "num_reviews": "11,136", "avg_ratings": 3.63, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Academic", "School", "Literature"], "title": "Things Fall Apart", "description": ["THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict betw", "THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict between the individual and society. ", "The second story, which is as modern as the first is ancient, and which elevates the book to a tragic plane, concerns the clash of cultures and the destruction of Okonkwo's world through the arrival of aggressive, proselytizing European missionaries. These twin dramas are perfectly harmonized, and they are modulated by an awareness capable of encompassing at once the life of nature, human history, and the mysterious compulsions of the soul. THINGS FALL APART is the most illuminating and permanent monument we have to the modern African experience as seen from within."], "author": "Chinua Achebe", "num_pages": "209", "awards": [], "places": ["Africa"], "character_names": ["Okonkwo"], "language": "English", "publish_date": "1994-09-01 00:00:00", "ISBN": "0385474547"},
{"url": "https://www.goodreads.com/book/show/132495.The_Book_of_the_Thousand_Nights_and_One_Night", "num_ratings": "65,577", "num_reviews": "2,009", "avg_ratings": 4.05, "genres": ["Classics", "Fiction", "Fantasy", "Short Stories", "Literature", "Fantasy", "Fairy Tales", "Fantasy", "Mythology", "Adventure", "Folklore", "Childrens"], "title": "The Book of the Thousand Nights and One Night", "description": ["First published in 1986. Routledge is an imprint of Taylor & Francis, an informa company.", "This is a translation by Powys Mathers from the French edition by J.-C. Mardrus."], "author": "Anonymous", "num_pages": "2341", "awards": [], "places": [], "character_names": ["Dunyazad", "Shahryar", "Shah Zaman", "Aladdin", "Ali Baba", "Ali Baba", "Aladdin", "Caliph Haroun Al-Raschid", "Syed Nouman", "Cogia Hassan", "Ali Baba", "Aladdin", "Sinbad"], "language": "English", "publish_date": "1990-12-31 00:00:00", "ISBN": "0415045436"}
]