[
{"url": "https://www.goodreads.com/book/show/60931.Kindred", "num_ratings": "60,626", "num_reviews": "7,284", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Science Fiction", "Fantasy", "Science Fiction", "Time Travel"], "title": "Kindred", "description": ["The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into ante", "The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into antebellum Maryland. After saving a drowning white boy there, she finds herself staring into the barrel of a shotgun and is transported back to the present just in time to save her life. During numerous such time-defying episodes with the same young man, she realizes the challenge she’s been given: to protect this young slaveholder until he can father her own great-grandmother."], "author": "Octavia E. Butler", "num_pages": "287", "awards": [], "places": ["Maryland", "Altadena, California"], "character_names": ["Dana Franklin", "Kevin Franklin", "Rufus Weylin", "Tom Weylin", "Margaret Weylin", "Alice Greenwood"], "language": "English", "publish_date": "2004-02-01 00:00:00", "ISBN": "0807083690"},
{"url": "https://www.goodreads.com/book/show/510342.Dark_Matter", "num_ratings": "916", "num_reviews": "63", "avg_ratings": 4.16, "genres": ["Short Stories", "Science Fiction", "Fantasy", "Fiction", "Speculative Fiction", "Anthologies"], "title": "Dark Matter: A Century of Speculative Fiction from the African Diaspora", "description": ["This volume introduces black science fiction, fantasy, and speculative fiction writers to the generations of readers who have not had the chance to explore the scope and diversity among African-American writers.", "Contents", "Fiction. Sister Lilith/Honoree Fanonne Jeffers --", "The comet/W.E.B. Du Bois --", "Chicage 1927/Jewelle Gomez --", "Separation anxiety/Evie Evie Shockley --", "Tasting son", "This volume introduces black science fiction, fantasy, and speculative fiction writers to the generations of readers who have not had the chance to explore the scope and diversity among African-American writers.", "Contents", "Fiction. Sister Lilith/Honoree Fanonne Jeffers --", "The comet/W.E.B. Du Bois --", "Chicage 1927/Jewelle Gomez --", "Separation anxiety/Evie Evie Shockley --", "Tasting songs/Leone Ross --", "Can you wear my eyes/Kalamu ya Salaam --", "Like daughter/Tananarive Due --", "Greedy choke puppy/Nalo Hopkinson --", "Rhythm travel/Amiri Baraka --", "Buddy Bolden/Kalamu ya Salaam --", "Aye, and Gomorrah.../Samuel R. Delany --", "Ganger (ball lightning)/Nalo Hopkinson --", "The becoming/Akua Lezli Hope --", "The goophered grapevine/Charles W. Chestnutt --", "The evening and the morning and the night/Octavia E. Butler --", "Twice, at once, separated/Linda Addison --", "Gimmile's songs/Charles R. Saunders --", "At the huts of Ajala/Nisi Shawl --", "The woman in the wall/Steven Barnes --", "Ark of bones/Henry Dumas --", "Butta's backyard barbecue/Tony Medina --", "At life's limits/Kiini Ibura Salaam --", "The astral visitor Delta blues/Robert Fleming --", "The space traders/Derrick Bell --", "The pretended/Darryl A. Smith --", "Hussy Strutt/Ama Patterson ; Essays. Racism and science fiction/Samuel R. Delany --", "Why Blacks should read (and write) science fiction/Charles R. Saunders --", "Black to the future/Walter Mosley --", "Yet do I wonder/Paul D. Miller --", "The monophobic response/Octavia E. Butler."], "author": "Sheree Thomas", "num_pages": "427", "awards": ["World Fantasy Award for Best Anthology (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-07-01 00:00:00", "ISBN": "0446677248"},
{"url": "https://www.goodreads.com/book/show/7507944-akata-witch", "num_ratings": "9,611", "num_reviews": "1,940", "avg_ratings": 4.09, "genres": ["Fantasy", "Young Adult", "Fiction", "Cultural", "Africa", "Childrens", "Middle Grade", "Fantasy", "Magic"], "title": "Akata Witch", "description": [" transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befr", " transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befriends Orlu and Chichi, Sunny is plunged in to the world of the Leopard People, where your worst defect becomes your greatest asset. Together, Sunny, Orlu, Chichi and Sasha form the youngest ever Oha Coven. Their mission is to track down Black Hat Otokoto, the man responsible for kidnapping and maiming children. Will Sunny be able to overcome the killer with powers stronger than her own, or will the future she saw in the flames become reality?"], "author": "Nnedi Okorafor", "num_pages": "349", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2011)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)"], "places": ["Nigeria"], "character_names": ["Sunny Nwazue"], "language": "English", "publish_date": "2011-04-14 00:00:00", "ISBN": "0670011967"},
{"url": "https://www.goodreads.com/book/show/19161852-the-fifth-season", "num_ratings": "55,862", "num_reviews": "7,699", "avg_ratings": 4.31, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia"], "title": "The Fifth Season", "description": ["This is the way the world ends. Again.", "Three terrible things happen in a single day. Essun, a woman living an ordinary life in a small town, comes home to find that her husband has brutally murdered their son and kidnapped their daughter. Meanwhile, mighty Sanze — the world-spanning empire whose innovations have been civilization’s bedrock for a thousand years — collapses a", "This is the way the world ends. Again.", "Three terrible things happen in a single day. Essun, a woman living an ordinary life in a small town, comes home to find that her husband has brutally murdered their son and kidnapped their daughter. Meanwhile, mighty Sanze — the world-spanning empire whose innovations have been civilization’s bedrock for a thousand years — collapses as most of its citizens are murdered to serve a madman’s vengeance. And worst of all, across the heart of the vast continent known as the Stillness, a great red rift has been torn into the heart of the earth, spewing ash enough to darken the sky for years. Or centuries.", "Now Essun must pursue the wreckage of her family through a deadly, dying land. Without sunlight, clean water, or arable land, and with limited stockpiles of supplies, there will be war all across the Stillness: a battle royale of nations not for power or territory, but simply for the basic resources necessary to get through the long dark night. Essun does not care if the world falls apart around her. She’ll break it herself, if she must, to save her daughter."], "author": "N.K. Jemisin", "num_pages": "468", "awards": ["Hugo Award for Best Novel (2016)", "Nebula Award Nominee for Best Novel (2015)", "Locus Award Nominee for Best Fantasy Novel (2016)", "World Fantasy Award Nominee for Best Novel (2016)", "The Kitschies Nominee for Red Tentacle (Novel) (2015)", "Goodreads Choice Award Nominee for Fantasy (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1063142.The_Gilda_Stories", "num_ratings": "1,129", "num_reviews": "130", "avg_ratings": 3.96, "genres": ["Fantasy", "Lgbt", "Paranormal", "Vampires", "Historical", "Historical Fiction", "Horror", "Fiction"], "title": "The Gilda Stories", "description": ["The winner of two Lambda Literary Awards (fiction and science fiction) ", " is a very American odyssey. Escaping from slavery in the 1850s Gilda's longing for kinship and community grows over two hundred years. Her induction into a family of benevolent vampires takes her on an adventurous and dangerous journey full of loud laughter and subtle terror."], "author": "Jewelle L. Gómez", "num_pages": "252", "awards": ["Lambda Literary Award for Lesbian Fiction and Lesbian Science Fiction/Fantasy/Horror (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "1991-04-01 00:00:00", "ISBN": "093237994X"},
{"url": "https://www.goodreads.com/book/show/41537.Joplin_s_Ghost", "num_ratings": "772", "num_reviews": "85", "avg_ratings": 3.88, "genres": ["Horror", "Fantasy", "Fiction", "Cultural", "African American", "Music", "Historical", "Historical Fiction", "Mystery"], "title": "Joplin's Ghost", "description": ["When Phoenix Smalls was ten, she nearly died at her parents' jazz club when she was crushed by a turn-of-the-century piano. Now twenty-four, Phoenix is launching a career as an R & B singer. She's living out her dreams and seems destined for fame and fortune. But a chance visit to a historical site in St. Louis ignites a series of bizarre, erotic encounters with a spir", "When Phoenix Smalls was ten, she nearly died at her parents' jazz club when she was crushed by a turn-of-the-century piano. Now twenty-four, Phoenix is launching a career as an R & B singer. She's living out her dreams and seems destined for fame and fortune. But a chance visit to a historical site in St. Louis ignites a series of bizarre, erotic encounters with a spirit who may be the King of Ragtime, Scott Joplin. ", " The sound of Scott Joplin is strange enough to the ears of the hip-hop generation. But the idea that these antique sounds are being channeled through Phoenix? Her life is suddenly hanging in the balance. How will she find her true voice and calling? Can the power of her own inner song give Phoenix the strength to fight to live out her own future? Or will she be forever trapped in Scott Joplin's doomed, tragic past? Stunningly original, ", " is a novel filled with art and intrigue -- and is sure to bring music to readers' ears."], "author": "Tananarive Due", "num_pages": "496", "awards": ["Hurston/Wright Legacy Award Nominee for Fiction (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-19 00:00:00", "ISBN": "0743449045"},
{"url": "https://www.goodreads.com/book/show/7005878-redemption-in-indigo", "num_ratings": "1,804", "num_reviews": "360", "avg_ratings": 3.85, "genres": ["Fantasy", "Fiction", "Magical Realism", "Fantasy", "Fairy Tales", "Cultural", "Africa", "Speculative Fiction"], "title": "Redemption in Indigo", "description": ["A tale of adventure, magic, and the power of the human spirit. Paama’s husband is a fool and a glutton. Bad enough that he followed her to her parents’ home in the village of Makendha—now he’s disgraced himself by murdering livestock and stealing corn. When Paama leaves him for good, she attracts the attention of the undying ones—the djombi— who present her with a gift: th", "A tale of adventure, magic, and the power of the human spirit. Paama’s husband is a fool and a glutton. Bad enough that he followed her to her parents’ home in the village of Makendha—now he’s disgraced himself by murdering livestock and stealing corn. When Paama leaves him for good, she attracts the attention of the undying ones—the djombi— who present her with a gift: the Chaos Stick, which allows her to manipulate the subtle forces of the world. Unfortunately, a wrathful djombi with indigo skin believes this power should be his and his alone.", "A contemporary fairy tale that is inspired in part by a Senegalese folk tale."], "author": "Karen Lord", "num_pages": "188", "awards": ["World Fantasy Award Nominee for Best Novel (2011)", "Mythopoeic Fantasy Award for Adult Literature (2011)", "IAFA William L. Crawford Fantasy Award (2011)", "Frank Collymore Award (2008)", "OCM Bocas Prize Nominee for Caribbean Literature (2011)", "Carl Brandon Parallax Award (2010)", "The Kitschies for Golden Tentacle (Debut) (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-01 00:00:00", "ISBN": "1931520666"},
{"url": "https://www.goodreads.com/book/show/20494216-once-upon-a-time-in-afrika", "num_ratings": "31", "num_reviews": "10", "avg_ratings": 4.16, "genres": ["Fantasy", "Science Fiction Fantasy"], "title": "Once Upon a Time in Afrika", "description": ["An exciting Sword and Soul tale by Balogun Ojetade, Once Upon a Time in Afrika Tells the story of a beautiful princess and her eager suitors. Desperate to marry off his beautiful but \"tomboyish\" duaghter, Esuseeke, the Emperor of Oyo, consults the Oracle. The Oracle tells the Emperor Esuseeke must marry the greatest warrior in all Onile (Afrika). To determine who is the gr", "An exciting Sword and Soul tale by Balogun Ojetade, Once Upon a Time in Afrika Tells the story of a beautiful princess and her eager suitors. Desperate to marry off his beautiful but \"tomboyish\" duaghter, Esuseeke, the Emperor of Oyo, consults the Oracle. The Oracle tells the Emperor Esuseeke must marry the greatest warrior in all Onile (Afrika). To determine who is the greatest warrior, the Emperor hosts a grand martial arts tournament inviting warrior from all over the continent. Unknown to the warriors and spectators of the tournament a powerful evil is headed their way. Will the warriors band together against this evil?"], "author": "Balogun Ojetade", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11189187-warriors-of-the-four-worlds", "num_ratings": "14", "num_reviews": "5", "avg_ratings": 4.57, "genres": ["Science Fiction"], "title": "Warriors of the Four Worlds", "description": ["The Vingin are a peaceful species, who are genetically incapable of violence. Humans and Zirans are their protectors. While Humans have shown a frightening appetite for violence, they have never reveled in it the way that their alien counterparts have. For Zirans are a brutal species with a lust for war. Human and Ziran muscle managed to defeat a horde of genocidal aggress", "The Vingin are a peaceful species, who are genetically incapable of violence. Humans and Zirans are their protectors. While Humans have shown a frightening appetite for violence, they have never reveled in it the way that their alien counterparts have. For Zirans are a brutal species with a lust for war. Human and Ziran muscle managed to defeat a horde of genocidal aggressors. But the aftermath of this struggle bears no promise of lasting peace. Storm clouds of treachery are brewing, and the shaky bonds that held this tripartite alliance together are unraveling. The tempest of a new war is erupting. Lev Gorlin, a hard-bitten veteran of the last war, must once again stand firm in the face of a new threat..."], "author": "Ronald T. Jones", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2011-04-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19303948-griots", "num_ratings": "25", "num_reviews": "3", "avg_ratings": 4.4, "genres": ["Fantasy", "Short Stories", "Pulp", "Heroic Fantasy", "Sword and Sorcery", "Adventure"], "title": "Griots: Sisters of the Spear", "description": ["Griots: Sisters of the Spear picks up where the ground breaking Griots Anthology leaves off. Charles R. Saunders and Milton J. Davis present seventeen original and exciting Sword and Soul tales focusing on black women. Just as the Griots Anthology broke ground as the first Sword and Soul Anthology, Griots: Sisters of the Spear pays homage to the spirit, bravery and compass", "Griots: Sisters of the Spear picks up where the ground breaking Griots Anthology leaves off. Charles R. Saunders and Milton J. Davis present seventeen original and exciting Sword and Soul tales focusing on black women. Just as the Griots Anthology broke ground as the first Sword and Soul Anthology, Griots: Sisters of the Spear pays homage to the spirit, bravery and compassion of women of color. The griots have returned to sing new songs, and what wonderful songs they are!"], "author": "Milton J. Davis", "num_pages": "431", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16211260-redeemer", "num_ratings": "14", "num_reviews": "5", "avg_ratings": 4.21, "genres": ["Science Fiction", "Time Travel"], "title": "Redeemer", "description": ["Sent nearly thirty years into the past as an unwilling test subject in a radical time travel experiment, Ezekiel Cross embarks on a perilous adventure, in which he must save his younger self from the deadly path that forged him into the ruthless killer that he is. ", "This edge-of-your-seat thriller is both gangster saga and science fiction epic – “Goodfellas” meets “The Time", "Sent nearly thirty years into the past as an unwilling test subject in a radical time travel experiment, Ezekiel Cross embarks on a perilous adventure, in which he must save his younger self from the deadly path that forged him into the ruthless killer that he is. ", "This edge-of-your-seat thriller is both gangster saga and science fiction epic – “Goodfellas” meets “The Time Machine”."], "author": "Balogun Ojetade", "num_pages": "228", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10239618-smoketown", "num_ratings": "86", "num_reviews": "29", "avg_ratings": 3.62, "genres": ["Science Fiction", "Fantasy", "Lgbt", "Science Fiction", "Dystopia", "Glbt", "Queer"], "title": "Smoketown", "description": ["The city of Leiodare is unlike any other in the post-climate change United States. Within its boundaries, birds are outlawed and what was once a crater in Appalachia is now a tropical, glittering metropolis where Anna Armour is waiting. An artist by passion and a factory worker by trade, Anna is a woman of special gifts. She has chosen this beautiful, traumatized city to w", "The city of Leiodare is unlike any other in the post-climate change United States. Within its boundaries, birds are outlawed and what was once a crater in Appalachia is now a tropical, glittering metropolis where Anna Armour is waiting. An artist by passion and a factory worker by trade, Anna is a woman of special gifts. She has chosen this beautiful, traumatized city to wait for the woman she's lost, the one she believes can save her from her troubled past and uncertain future. When one night Anna creates life out of thin air and desperation, no one is prepared for what comes next-not Lucine, a smooth talking soothsayer with plans for the city; Lucine's brother Eugenio who has designs of his own; Seife, a star performer in the Leiodaran cosmos; or Rory, a forefather of the city who's lived through outbreak, heartbreak, and scandal. Told through their interlocking stories, Smoketown delves into the invisible connections that rival magic, and the cost of redemption."], "author": "Tenea D. Johnson", "num_pages": "197", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-07-26 00:00:00", "ISBN": "0978986156"},
{"url": "https://www.goodreads.com/book/show/25220487-population", "num_ratings": "216", "num_reviews": "62", "avg_ratings": 4.13, "genres": ["Science Fiction", "Dystopia", "Science Fiction", "Did Not Finish"], "title": "Population", "description": ["Lawlessness, violence and desperation are all that is left of the world following the coming of the Others. Abel exists only within the boundaries that her rules allow - rules that she created to keep her alive. But when her best friend's daughter is taken by the Others, she can't keep playing by the rule book. Instead, she must begin a life defining journey that will test", "Lawlessness, violence and desperation are all that is left of the world following the coming of the Others. Abel exists only within the boundaries that her rules allow - rules that she created to keep her alive. But when her best friend's daughter is taken by the Others, she can't keep playing by the rule book. Instead, she must begin a life defining journey that will test her survival techniques and bring all of her instincts into question. When she finds herself allied with one of the Others, Abel must confront foreign concepts like allegiance and desire and trust as he challenges her ability to find what she has always feared: hope.", "*This series is a science fiction romance and some violent and graphic content may not be suitable for young readers*"], "author": "Elizabeth  Stephens", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-04-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22295304-shadowshaper", "num_ratings": "7,047", "num_reviews": "1,668", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Paranormal"], "title": "Shadowshaper", "description": ["Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York may", "Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York mayhem is going on.", "Sierra soon discovers a supernatural order called the Shadowshapers, who connect with spirits via paintings, music, and stories. Her grandfather once shared the order's secrets with an anthropologist, Dr. Jonathan Wick, who turned the Caribbean magic to his own foul ends. Now Wick wants to become the ultimate Shadowshaper by killing all the others, one by one. With the help of her friends and the hot graffiti artist Robbie, Sierra must dodge Wick's supernatural creations, harness her own Shadowshaping abilities, and save her family's past, present, and future."], "author": "Daniel José Older", "num_pages": "297", "awards": ["Locus Award Nominee for Best Young Adult Book (2016)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2016)", "Lincoln Award Nominee (2018)", "Andre Norton Award Nominee (2015)", "Kirkus Prize Nominee for Young Readers' Literature (Finalist) (2015)"], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-30 00:00:00", "ISBN": "0545591619"},
{"url": "https://www.goodreads.com/book/show/2391371.Blood_Colony", "num_ratings": "1,180", "num_reviews": "84", "avg_ratings": 4.13, "genres": ["Fantasy", "Horror", "Fiction", "Science Fiction", "Cultural", "African American"], "title": "Blood Colony", "description": ["Acclaimed for seven novels, ranging from supernatural thrillers to historical fiction, which have garnered her a multitude of fans and awards, Tananarive Due now imagines the story of an ancient group of immortals - a hidden African clan that has survived for more than a thousand years - facing one of the most challenging issues of our time: the AIDS/HIV pandemic.", "There's a", "Acclaimed for seven novels, ranging from supernatural thrillers to historical fiction, which have garnered her a multitude of fans and awards, Tananarive Due now imagines the story of an ancient group of immortals - a hidden African clan that has survived for more than a thousand years - facing one of the most challenging issues of our time: the AIDS/HIV pandemic.", "There's a new drug on the street: Glow. Said to heal almost any illness, it is distributed by an Underground Railroad of drug peddlers. But what gives Glow its power? Its main ingredient is blood - the blood of immortals. A small but powerful colony of immortals is distributing the blood, slowly wiping out the AIDS epidemic and other diseases around the world. ", "Meet Fana Wolde, seventeen years old, the only immortal born with the Living Blood. She can read minds, and her injuries heal immediately. When her best friend, a mortal, is imprisoned by Fana's family, Fana helps her escape and together they run away from Fana's protected home in Washington State to join the Underground Railroad. ", "But Fana has more than her parents to worry about. Glow peddlers are being murdered by a violent, hundred-year-old sect with ties to the Vatican. Now, when Fana is most vulnerable, she is being hunted to fulfill an ancient blood prophecy that could lead to countless deaths. ", "While her people search for Fana and race to unravel the unknown sect's mysterious origins, Fana must learn to confront the deadly forces - or she and everyone she loves will die."], "author": "Tananarive Due", "num_pages": "422", "awards": ["Hurston/Wright Legacy Award Nominee for Fiction (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-03 00:00:00", "ISBN": "0743287355"},
{"url": "https://www.goodreads.com/book/show/4447689-little-miss-strange", "num_ratings": "6", "num_reviews": "0", "avg_ratings": 5.0, "genres": [], "title": "Little Miss Strange", "description": ["Magic, Mischief & Mayhem!- Meet Scorpia--or Little Miss Strange as her friends & foes call her.She's a black alien sorceress who is also a time traveller...Scorpia is about to embark on a search for The Alpha Triad, A mystical device that can restore time and order to her univers"], "author": "Winston Blakely", "num_pages": "100", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-29 00:00:00", "ISBN": "1435708784"},
{"url": "https://www.goodreads.com/book/show/21896515-light-under-the-house", "num_ratings": "44", "num_reviews": "10", "avg_ratings": 3.59, "genres": ["Christian Fiction"], "title": "Light Under the House", "description": ["Sarai Ravensbrook has never known power. She has never been in control of anything in her world. She has lived in the shadow of her stepfather and uncle's abuses to both her mind and body. All she has ever wanted was to have what was hers, to control her own destiny. But when a beautiful and mysterious woman comes into her life, Sarai is guided down a strange path....a pat", "Sarai Ravensbrook has never known power. She has never been in control of anything in her world. She has lived in the shadow of her stepfather and uncle's abuses to both her mind and body. All she has ever wanted was to have what was hers, to control her own destiny. But when a beautiful and mysterious woman comes into her life, Sarai is guided down a strange path....a path that will lead her to a queen from the ancient past, an extraordinary lost relic and to a destiny that is finally her own....or is it?", " This page-turning story set in the late 1960s during a period of cultural rebellion (with a flashback to Biblical times) shows the power of consequence and the hope of redemption. The past events of this allegoric novel are interwoven within several themes that have insightful parallels to today, taking readers on a gripping and thought-provoking journey. "], "author": "Aaron L.", "num_pages": "282", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/566712.Black_Empire", "num_ratings": "58", "num_reviews": "9", "avg_ratings": 3.93, "genres": ["Science Fiction", "Fiction", "Cultural", "African American"], "title": "Black Empire", "description": ["Imagine W.E.B. Du Bois, Booker T. Washington, George Washington Carver and Marcus Garvey rolled into one fascist superman, and there you have Dr. Henry Belsidus. . . [The novels] are an Afrocentrist's dream. -- Henry Louis Gates, Jr., New York Times Book Review"], "author": "George S. Schuyler", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-03 00:00:00", "ISBN": "1555531687"},
{"url": "https://www.goodreads.com/book/show/6803323-dubaku", "num_ratings": "14", "num_reviews": "1", "avg_ratings": 4.14, "genres": ["Horror", "Zombies", "Short Stories", "Historical", "Historical Fiction", "Western Africa", "Benin"], "title": "Dubaku", "description": ["In 1760 somewhere near the Bight of Benin, an African shaman belonging to an obscure interior tribe surrenders himself willingly to an English slaving expedition. This man, Dubaku, has come in search of his wife, abducted and sold to another party of whites. Not knowing one ship from another, Dubaku boards the slaver hoping to find her. The captain, a cruel and careless ma", "In 1760 somewhere near the Bight of Benin, an African shaman belonging to an obscure interior tribe surrenders himself willingly to an English slaving expedition. This man, Dubaku, has come in search of his wife, abducted and sold to another party of whites. Not knowing one ship from another, Dubaku boards the slaver hoping to find her. The captain, a cruel and careless man named Bryce, mistrusts him immediately, and when a rampant sickness takes its toll on the superstitious crew and their human cargo midway through the voyage to Jamaica, Bryce decides to offer up Dubaku as their Jonah. After a violent squall drowns the entire compliment of would-be slaves, Dubaku calls upon dark and terrible powers to enact a fitting vengeance on Captain Bryce and his men."], "author": "Edward M. Erdelac", "num_pages": "48", "awards": [], "places": ["West Africa"], "character_names": [], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "1615720235"},
{"url": "https://www.goodreads.com/book/show/216215.Dead_Sea", "num_ratings": "4,742", "num_reviews": "256", "avg_ratings": 3.86, "genres": ["Horror", "Horror", "Zombies", "Fiction", "Science Fiction", "Apocalyptic"], "title": "Dead Sea", "description": ["The streets of the city are no longer safe. They are filled with zombies - the living dead, rotting predators driven only by a need to kill and eat. For Lamar Reed and a handful of others, their safe haven is an old ship out at sea. But it will soon become a deathtrap, and they'll learn that isolation can also mean no escape."], "author": "Brian Keene", "num_pages": "337", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-07-01 00:00:00", "ISBN": "084395860X"},
{"url": "https://www.goodreads.com/book/show/8880425-awake", "num_ratings": "28", "num_reviews": "7", "avg_ratings": 4.54, "genres": ["Young Adult"], "title": "Awake", "description": ["Adisa and Micah's saga continues as the young couple try to heal Micah on their own. Their repeated failures drive Adisa into a desperate but secret alliance with Micah's father and place a strain on the young couple's relationship that may drive them apart permanently. Adisa learns more about the super world, revealing just how alien they are, like their curious bathroom", "Adisa and Micah's saga continues as the young couple try to heal Micah on their own. Their repeated failures drive Adisa into a desperate but secret alliance with Micah's father and place a strain on the young couple's relationship that may drive them apart permanently. Adisa learns more about the super world, revealing just how alien they are, like their curious bathroom habits and disdain for earthbounds, which leads her to question if a life with Micah is possible. Victor, Micah's super twin, continues his pursuit of Adisa in hopes of fulfilling a prophecy predicting their union is the only way to save Micah's life.", "As Adisa deals with the mounting challenges, threatening her relationship with Micah, she discovers her birth parents are alive and want to see her. Pearl, her earthbound mother, and Cyrus, the greatest super being in modern times, have been absent from Adisa's life since they abandoned her in a cotton field when she was only three years old. Does Adisa's reunion with her birth parents hold the key to Micah's cure or will it lead to his death?"], "author": "Wendy Raven McNair", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18145249-the-blood-of-titans", "num_ratings": "40", "num_reviews": "21", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Fantasy", "Romance", "Historical", "Cultural", "Africa", "Fiction"], "title": "The Blood of Titans", "author": "C. Michael Forsyth", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-14 00:00:00", "ISBN": "0988478005"},
{"url": "https://www.goodreads.com/book/show/71413.Skin_Folk", "num_ratings": "645", "num_reviews": "70", "avg_ratings": 4.05, "genres": ["Fantasy", "Short Stories", "Fiction", "Science Fiction", "Horror", "Speculative Fiction", "Glbt", "Queer"], "title": "Skin Folk", "description": ["A new collection of short stories from Hopkinson, including \"Greedy Choke Puppy,\" which Africana.com called \"a cleverly crafted West Indian story featuring the appearance of both the soucouyant (vampire) & lagahoo (werewolf),\" \"Ganger (Ball Lightning),\" praised by the Washington Post Book World as written in \"prose [that] is vivid & immediate,\" this collection reve", "A new collection of short stories from Hopkinson, including \"Greedy Choke Puppy,\" which Africana.com called \"a cleverly crafted West Indian story featuring the appearance of both the soucouyant (vampire) & lagahoo (werewolf),\" \"Ganger (Ball Lightning),\" praised by the Washington Post Book World as written in \"prose [that] is vivid & immediate,\" this collection reveals Hopkinson's breadth & accomplishments as a storyteller."], "author": "Nalo Hopkinson", "num_pages": "272", "awards": ["World Fantasy Award for Best Collection (2002)", "Sunburst Award (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-12-01 00:00:00", "ISBN": "0446678031"},
{"url": "https://www.goodreads.com/book/show/57498.The_Salt_Roads", "num_ratings": "1,340", "num_reviews": "188", "avg_ratings": 3.83, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Magical Realism", "Glbt", "Queer", "Lgbt"], "title": "The Salt Roads", "description": ["A landmark work by a brilliant young author, THE SALT ROADS transports readers across centuries and civilizations as it fearlessly explores the relationships women have with their lovers, their people, and the divine. Jeanne Duval, the ginger-colored entertainer, struggles with her lover poet Charles Baudelaire...Mer, plantation slave and doctor, both hungers for and dread", "A landmark work by a brilliant young author, THE SALT ROADS transports readers across centuries and civilizations as it fearlessly explores the relationships women have with their lovers, their people, and the divine. Jeanne Duval, the ginger-colored entertainer, struggles with her lover poet Charles Baudelaire...Mer, plantation slave and doctor, both hungers for and dreads liberation...and Thais, a dark-skinned beauty from Alexandria, is impelled to seek a glorious revelation-as Ezili, a being born of hope, unites them all. Interweaving acts of brutality with passionate unions of spirit and flesh, this is a narrative that shocks, entertains, and dazzles-from an award-winning writer who dares to redefine the art of storytelling.", "A Nebula Award nominee -- A Locus Magazine recommended book"], "author": "Nalo Hopkinson", "num_pages": "416", "awards": ["Gaylactic Spectrum Award for Best Novel (2004)", "Hurston/Wright Legacy Award Nominee for Debut Fiction (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "0446677132"},
{"url": "https://www.goodreads.com/book/show/6597817-asleep", "num_ratings": "74", "num_reviews": "15", "avg_ratings": 4.2, "genres": ["Young Adult", "Fantasy", "Fantasy", "Urban Fantasy", "Romance", "Fantasy", "Paranormal", "Comics", "Superheroes"], "title": "Asleep", "description": ["Adisa Summers doesn't know her boyfriend, Micah Alexander, can fly. Micah's odd emotionless behavior, rigid posture, and vacant eyes are mysteries sending mixed messages to Adisa. When a flash of lightning sends a tree crashing down on her, Adisa is shocked to see Micah actually flying to her rescue!", "In an instant, Adisa is in his arms, looking up at the sky over his should", "Adisa Summers doesn't know her boyfriend, Micah Alexander, can fly. Micah's odd emotionless behavior, rigid posture, and vacant eyes are mysteries sending mixed messages to Adisa. When a flash of lightning sends a tree crashing down on her, Adisa is shocked to see Micah actually flying to her rescue!", "In an instant, Adisa is in his arms, looking up at the sky over his shoulder as they fly parallel to the ground. Micah shifts, shielding her completely with his body. As the tree explodes against Micah's back, Adisa feels him shudder with the impact and the air fills with wood chips and sawdust. Miraculously, they aren't smashed into the ground. They safely continue flying.", "Micah finally begins to open up to Adisa about his secret life as a super being and she discovers another shocking secret… Micah burns for her--literally as well as figuratively.", "ASLEEP is a superhero teen love story set in modern day Atlanta that's filled with humor, mystery, romance, and suspense."], "author": "Wendy Raven McNair", "num_pages": "442", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-04-23 00:00:00", "ISBN": "1442125241"},
{"url": "https://www.goodreads.com/book/show/11831627-the-chaos", "num_ratings": "527", "num_reviews": "123", "avg_ratings": 3.09, "genres": ["Fantasy", "Young Adult", "Science Fiction", "Fiction", "Lgbt", "Fantasy", "Urban Fantasy"], "title": "The Chaos", "description": ["Sixteen-year-old Scotch struggles to fit in—at home she’s the perfect daughter, at school she’s provocatively sassy, and thanks to her mixed heritage, she doesn’t feel she belongs with the Caribbeans, whites, ", " blacks. And even more", "Sixteen-year-old Scotch struggles to fit in—at home she’s the perfect daughter, at school she’s provocatively sassy, and thanks to her mixed heritage, she doesn’t feel she belongs with the Caribbeans, whites, ", " blacks. And even more troubling, lately her skin is becoming covered in a sticky black substance that can’t be removed. While trying to cope with this creepiness, she goes out with her brother—and he disappears. A mysterious bubble of light just swallows him up, and Scotch has no idea how to find him. Soon, the Chaos that has claimed her brother affects the city at large, until it seems like everyone is turning into crazy creatures. Scotch needs to get to the bottom of this supernatural situation ASAP before the Chaos consumes everything she’s ever known—and she knows that the black shadowy entity that’s begun trailing her every move is probably not going to help.", "A blend of fantasy and Caribbean folklore, at its heart this tale is about identity and self acceptance—because only by acknowledging her imperfections can Scotch hope to save her brother."], "author": "Nalo Hopkinson", "num_pages": "256", "awards": ["Copper Cylinder Award for Adult (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-17 00:00:00", "ISBN": "1416954880"},
{"url": "https://www.goodreads.com/book/show/23212763-the-keys", "num_ratings": "3", "num_reviews": "2", "avg_ratings": 4.0, "genres": [], "title": "The Keys: A YOU are the Hero Book", "description": ["Pyramids – located all over the world, among different cultures and nations – are actually portals that allow teleportation between them. ", "For thousands of years, there was peace between nations; there was exchange of knowledge and culture and all of the pyramid cultures worldwide advanced because of it. But the peace soon shattered and the world was cast into the bloodiest", "Pyramids – located all over the world, among different cultures and nations – are actually portals that allow teleportation between them. ", "For thousands of years, there was peace between nations; there was exchange of knowledge and culture and all of the pyramid cultures worldwide advanced because of it. But the peace soon shattered and the world was cast into the bloodiest and most costly of wars. ", "At the same time, the Iberian Empire, led by Infante (“Prince”) Henry the Navigator, attacked the Aztec Empire. Henry, the Navigator believed the legendary Christian kingdom of Prester John (“Presbytu Johannes”) to be the Aztec Empire’s Nueva Guatemala de la Asuncion (now called Guatemala City). He wanted to find the kingdom and achieve immortality and would murder the world if it meant achieving his goal.", "The Aztec allied with the powerful Oyo Empire of West Africa and together they defeated Henry the Navigator and his monstrous army and restored a fragile peace to the world, deactivating the power of the world’s pyramids until humanity was once again ready to use their power responsibly. ", "Two gods – one Oyo and one Aztec – were placed into a deep sleep within the bloodlines of two warrior families from the great Oyo-Aztec Alliance. ", "These gods, lying dormant within two unwitting teenagers known as The Keys, are to awaken only when the world – and the gods’ teenaged hosts – is ready. ", "YOU choose to be one of the two heroes of the story: Jordan Drummond, college basketball phenomenon and math genius; or Theresa “Terry” De Fuego, self-proclaimed “extreme journalist.” ", "YOU battle the forces of evil and maybe even save the world! ", "YOU decide your destiny... for YOU are the Hero!"], "author": "Balogun Ojetade", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-14 00:00:00", "ISBN": "0991407318"},
{"url": "https://www.goodreads.com/book/show/25113104-wrath-of-the-siafu", "num_ratings": "2", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "Wrath of the Siafu: A SIngle Link, Book 2 (The WERK Chronicles, #2)", "description": ["The near future…", "A young genius is gunned down brutally by the police. Remi Swan – our hero from the hard-hitting Action-Adventure novella, A SINGLE LINK – fights to defend the little boy and herself. She is arrested, imprisoned, forced to fight and infected with an experimental virus that turns women into raging monsters…or worse.", "Possessed with incredible – and scary – new", "The near future…", "A young genius is gunned down brutally by the police. Remi Swan – our hero from the hard-hitting Action-Adventure novella, A SINGLE LINK – fights to defend the little boy and herself. She is arrested, imprisoned, forced to fight and infected with an experimental virus that turns women into raging monsters…or worse.", "Possessed with incredible – and scary – new abilities, Remi sets off a war against a system that has long brutalized Black people. A war that, alone, she might not be able to fight, but now she is backed by an army…a powerful and deadly force of her own making. Now, that brutal system will suffer the…", "WRATH OF THE SIAFU!"], "author": "Balogun Ojetade", "num_pages": "154", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-28 00:00:00", "ISBN": "0991407334"},
{"url": "https://www.goodreads.com/book/show/20820095-the-forever-man", "num_ratings": "12", "num_reviews": "7", "avg_ratings": 3.83, "genres": [], "title": "The Forever Man", "description": ["Tonight, Harlem hitman Willie Bishop will be:", "SHOT * STABBED * DECAPITATED * EVISCERATED * BLOWN UP * RUN DOWN * BLUDGEONED * ELECTROCUTED * POISONED * DROWNED * CRUSHED BY STAMPEDING ELEPHANTS * STRUCK BY LIGHTNING...AND THE BROOKLYN G-TRAIN.", "And then things are really going to get bad...for Willie has just inherited that which all but angels crave: IMMORTALITY. Now, hunted", "Tonight, Harlem hitman Willie Bishop will be:", "SHOT * STABBED * DECAPITATED * EVISCERATED * BLOWN UP * RUN DOWN * BLUDGEONED * ELECTROCUTED * POISONED * DROWNED * CRUSHED BY STAMPEDING ELEPHANTS * STRUCK BY LIGHTNING...AND THE BROOKLYN G-TRAIN.", "And then things are really going to get bad...for Willie has just inherited that which all but angels crave: IMMORTALITY. Now, hunted by a cadre of superhuman assassins, he must choose whether to protect a troubled and targeted thirteen-year-old mother-to-be or his own extended life.", "Willie never wanted to live forever...but is he prepared to die...today?"], "author": "Xavier Moore", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-09-03 00:00:00", "ISBN": "1500974706"},
{"url": "https://www.goodreads.com/book/show/15818782-moses", "num_ratings": "42", "num_reviews": "7", "avg_ratings": 3.67, "genres": ["Science Fiction", "Steampunk", "Science Fiction", "Fantasy", "Cultural", "African American"], "title": "Moses: The Chronicles of Harriet Tubman", "description": ["In “MOSES: The Chronicles of Harriet Tubman (Book 1: Kings)”, the author masterfully transports you to a world of wonder…of horror…of amazing inventions, captivating locales and extraordinary people.", "In this thrilling mash-up of Steampunk, Alternate History and Horror, Harriet Tubman must match wits and power with the sardonic John Wilkes Booth and a team of hunters with po", "In “MOSES: The Chronicles of Harriet Tubman (Book 1: Kings)”, the author masterfully transports you to a world of wonder…of horror…of amazing inventions, captivating locales and extraordinary people.", "In this thrilling mash-up of Steampunk, Alternate History and Horror, Harriet Tubman must match wits and power with the sardonic John Wilkes Booth and a team of hunters with powers beyond this world in order to save herself, her teenaged nephew, Ben and a little girl in her care – Margaret. But is anyone who, or what, they seem?"], "author": "Balogun Ojetade", "num_pages": "174", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-01 00:00:00", "ISBN": "1477422889"},
{"url": "https://www.goodreads.com/book/show/18753952-the-seedbearing-prince", "num_ratings": "96", "num_reviews": "19", "avg_ratings": 4.04, "genres": ["Fantasy", "Science Fiction"], "title": "The Seedbearing Prince: Part I", "description": ["Dayn Ro'Halan is a farmer's son sworn to a life of plowing on his homeworld, Shard. After finding a lost artifact called a Seed, he's thrust into an ancient conflict between voidwalkers of the hated world Thar'Kur, and Defenders from a floating fortress called the Ring. Dayn must become a Seedbearer and learn to use the Seed's power to shape worlds before the entire World", "Dayn Ro'Halan is a farmer's son sworn to a life of plowing on his homeworld, Shard. After finding a lost artifact called a Seed, he's thrust into an ancient conflict between voidwalkers of the hated world Thar'Kur, and Defenders from a floating fortress called the Ring. Dayn must become a Seedbearer and learn to use the Seed's power to shape worlds before the entire World Belt is lost."], "author": "DaVaun Sanders", "num_pages": "330", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-17 00:00:00", "ISBN": "0985925213"},
{"url": "https://www.goodreads.com/book/show/85863.Nova", "num_ratings": "5,594", "num_reviews": "318", "avg_ratings": 3.83, "genres": ["Science Fiction", "Fiction", "Space", "Space Opera"], "title": "Nova", "description": ["These are [at least some of] the ways you can read NOVA: as a fast-action farflung interstellar adventure; as archetypal mystical/mythical allegory (in which the Tarot and the Grail both figure prominently); as modern myth told in the S-F idiom... the reader observes, recollects, or participates in a range of personal experience including violent pain and disfigurement, se", "These are [at least some of] the ways you can read NOVA: as a fast-action farflung interstellar adventure; as archetypal mystical/mythical allegory (in which the Tarot and the Grail both figure prominently); as modern myth told in the S-F idiom... the reader observes, recollects, or participates in a range of personal experience including violent pain and disfigurement, sensory deprivation and overload, man-machine communion, the drug experience, the creative experience - and inter-personal relationships which include incest and assassination, father-son, leader-follower, human-pet, and lots more!", "The balance of galactic power in the 31st century revolves around Illyrion, the most precious energy source in the universe. The varied and exotic crew who sign up with Captain Lorq van Ray know their mission is dangerous, and they soon learn that they are involved in a deadly race with the charismatic but vicious leader of an opposing space federation. But they have no idea of Lorq's secret obsession: to gather Illyrion at the source by flying through the very heart of an imploding star."], "author": "Samuel R. Delany", "num_pages": "241", "awards": ["Hugo Award Nominee for Best Novel (1969)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-06-11 00:00:00", "ISBN": "0375706704"},
{"url": "https://www.goodreads.com/book/show/6461150-immortal", "num_ratings": "82", "num_reviews": "12", "avg_ratings": 4.21, "genres": ["Speculative Fiction", "Fantasy", "Science Fiction", "Romance", "Interracial Romance", "Romance", "Paranormal Romance", "Romance"], "title": "Immortal", "description": ["Her dreams are terrifying. In the year of our One 3075 Tundra has been at peace for 400 years. There is no racism, poverty or war. Karla is a young, Indigo woman working as a successful healer. Yet she is tormented by lucid and erotic dreams. Dreams in which she is Immortal. Two men emerge from these phantasms: the first a Copper Shape shifter and the other a demon more de", "Her dreams are terrifying. In the year of our One 3075 Tundra has been at peace for 400 years. There is no racism, poverty or war. Karla is a young, Indigo woman working as a successful healer. Yet she is tormented by lucid and erotic dreams. Dreams in which she is Immortal. Two men emerge from these phantasms: the first a Copper Shape shifter and the other a demon more dead than alive. But when this creature appears in her apartment Karla realizes that they share a lust that may one day consume her. His will unlock a mystery. Joseph always dreamt of becoming an artist, a warrior...and a shape shifter. Now he's dreaming of a sorceress who commands that he leave his homeland. Together they will journey to the end of time. To a nightmarish world of revolution and magic. But will they save Tundra or perish in it's destruction?"], "author": "Valjeanne Jeffers", "num_pages": "122", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-12-28 00:00:00", "ISBN": "1441480897"},
{"url": "https://www.goodreads.com/book/show/19310468-a-single-link", "num_ratings": "3", "num_reviews": "2", "avg_ratings": 3.67, "genres": ["Fiction"], "title": "A Single Link (WERK Chronicles, Vol. 1)", "description": ["\"A Single Link NEVER Breaks!\" After suffering a brutal rape at the hands of a martial arts champion, Remi “Ray” Swan decides that, to gain closure and empowerment, she must face her attacker in the first professional fight between a man and a woman. Join Ray in this powerful, two-fisted adventure as she fights, not just for herself, but for all who have suffered at the cru", "\"A Single Link NEVER Breaks!\" After suffering a brutal rape at the hands of a martial arts champion, Remi “Ray” Swan decides that, to gain closure and empowerment, she must face her attacker in the first professional fight between a man and a woman. Join Ray in this powerful, two-fisted adventure as she fights, not just for herself, but for all who have suffered at the cruel hands of those who would wreak pain, oppression, injustice and death! Step into the cage, where action, adventure, bone shattering fights, and a touch of romance await you!"], "author": "Balogun Ojetade", "num_pages": "148", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-07 00:00:00", "ISBN": "1493740652"},
{"url": "https://www.goodreads.com/book/show/20881464-fist-of-africa", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 4.33, "genres": ["Fiction"], "title": "Fist of Africa", "description": ["Nigeria 2004 ... Nicholas 'New Breed' Steed, a tough teen from the mean streets of Chicago, is sent to his mother’s homeland – a tiny village in Nigeria – to avoid trouble with the law. Unknown to Nick, the tiny village is actually a compound where some of the best fighters in the world are trained. Nick is teased, bullied and subjected to torturous training in a culture s", "Nigeria 2004 ... Nicholas 'New Breed' Steed, a tough teen from the mean streets of Chicago, is sent to his mother’s homeland – a tiny village in Nigeria – to avoid trouble with the law. Unknown to Nick, the tiny village is actually a compound where some of the best fighters in the world are trained. Nick is teased, bullied and subjected to torturous training in a culture so very different from the world where he grew up.", "Atlanta 2014 ... After a decade of training in Nigeria, a tragedy brings Nick back to America. Believing the disaffected youth in his home town sorely need the same self-discipline and strength of character training in the African martial arts gave him, Nick opens an Academy. While the kids are disinterested in the fighting style of the cultural heritage Nick offers, they are enamored with mixed martial arts. Nick decides to enter the world of mixed martial arts to make the world aware of the effectiveness and efficiency of the martial arts of Africa.", "Pursuing a professional career in MMA, Nick moves to Atlanta, Georgia, where he runs into his old nemesis – Rico Stokes, the organized crime boss who once employed Nick’s father, wants Nick to replace his father in the Stokes’ protection racket. ", "Will New Breed Steed claim the Light Heavyweight title … Or will the streets of Atlanta claim him?"], "author": "Balogun Ojetade", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-21 00:00:00", "ISBN": "149601829X"},
{"url": "https://www.goodreads.com/book/show/20706149-the-scythe", "num_ratings": "17", "num_reviews": "2", "avg_ratings": 4.35, "genres": ["Paranormal", "Vampires", "Science Fiction Fantasy"], "title": "The Scythe", "description": ["He has been given a second chance at life. A second chance at revenge. ", "He is the bridge between the Quick and the Dead. He is…THE SCYTHE! ", "Out of the tragedy of the Tulsa Race Riot of 1921, a two-fisted hero rises from the grave! ", "Inspired by the pulp magazines of the 1930s and 1940s, a tale of action, adventure, thrills and chills await fans of Dieselpunk, die-hard pulp fan", "He has been given a second chance at life. A second chance at revenge. ", "He is the bridge between the Quick and the Dead. He is…THE SCYTHE! ", "Out of the tragedy of the Tulsa Race Riot of 1921, a two-fisted hero rises from the grave! ", "Inspired by the pulp magazines of the 1930s and 1940s, a tale of action, adventure, thrills and chills await fans of Dieselpunk, die-hard pulp fans and readers who just love a gritty story that packs a mean punch. ", "Enter a world in which Gangsters, Flappers, vampires, robots and the Ku Klux Klan all roam the same dark back streets; a world of grit, grime and grease; a world of hardboiled gumshoe detectives and mad scientists; a world where magic and technology compete for rule over the world. ", "Dieselfunk has emerged in The Scythe…and the Roaring Twenties will never seem the same!"], "author": "Balogun Ojetade", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-01 00:00:00", "ISBN": "099140730X"},
{"url": "https://www.goodreads.com/book/show/17914076-steamfunk", "num_ratings": "73", "num_reviews": "13", "avg_ratings": 4.23, "genres": ["Science Fiction", "Steampunk", "Fantasy", "Short Stories", "Science Fiction", "Science Fiction", "Alternate History"], "title": "Steamfunk!", "description": ["Book by"], "author": "Milton J. Davis", "num_pages": "490", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-22 00:00:00", "ISBN": "0980084253"},
{"url": "https://www.goodreads.com/book/show/11390884-let-s-play-white", "num_ratings": "109", "num_reviews": "29", "avg_ratings": 3.96, "genres": ["Horror", "Short Stories", "Fiction", "Fantasy", "Speculative Fiction", "Cultural", "African American", "Abandoned", "Thriller"], "title": "Let's Play White", "description": ["White brings with it dreams of respect, of wealth, of simply being treated as a human being. It's the one thing Walter will never be. But what if he could play white, the way so many others seem to do? Would it bring him privilege or simply deny the pain? The title story in this collection asks those questions, and then moves on to challenge notions of race, privilege, per", "White brings with it dreams of respect, of wealth, of simply being treated as a human being. It's the one thing Walter will never be. But what if he could play white, the way so many others seem to do? Would it bring him privilege or simply deny the pain? The title story in this collection asks those questions, and then moves on to challenge notions of race, privilege, personal choice, and even life and death with equal vigor. From the spectrum spanning despair and hope in \"What She Saw When They Flew Away\" to the stark weave of personal struggles in \"Chocolate Park,\" ", " speaks with the voices of the overlooked and unheard. \"I Make People Do Bad Things\" shines a metaphysical light on Harlem's most notorious historical madame, and then, with a deft twist into melancholic humor, \"Cue: Change\" brings a zombie-esque apocalypse, possibly for the betterment of all mankind.", "Gritty and sublime, the stories of ", " feature real people facing the worlds they're given, bringing out the best and the worst of what it means to be human. If you're ready to slip into someone else's skin for a while, then it's time to come play white.", " ", " \"These raw, brutal stories, often with intriguingly open endings, display an odd and unsettling relationships to the poetry of violence. These dark tales announce the arrival of a formidable new master of the macabre.\"", " -Samuel R. Delany, author of ", " and ", "\"What a stunning collection. ", "... and so on time. [Chesya Burke has] touched something special in [her] stories. I'm a big Octavia Butler fan and I see a peek of that as well as some latter-day Toni Morrison [within these pages]. I see the light and warmth [Chesya is] offering. There definitely is magic in that. The short story, next to poetry, is the most difficult writing form. [Chesya has] tamed it and made it yield to [her] touch.\"", " -Nikki Giovanni, Grammy-nominated spoken word artist and poet", " ", " Jordan Casteel", " ", " Chesya Burke has published over forty short stories in various venues including ", ", ", ", and ", ", each published by Kensington Publishing Corp. as well as the historical, science, and speculative fiction magazine, ", ", and many more. Several of her articles appeared in the African American National Biography, published by Harvard and Oxford University Press, and she won the 2004 Twilight Tales award for short fiction. Chesya attends Agnes Scott College, where she studies creative writing and the African diaspora as it relates to race, class and gender. Many of these themes find themselves appearing in her fiction."], "author": "Chesya Burke", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-26 00:00:00", "ISBN": "1937009998"},
{"url": "https://www.goodreads.com/book/show/12814333-a-stranger-in-olondria", "num_ratings": "1,696", "num_reviews": "419", "avg_ratings": 3.71, "genres": ["Fantasy", "Fiction", "Writing", "Books About Books", "Science Fiction Fantasy", "Speculative Fiction"], "title": "A Stranger in Olondria", "description": ["Jevick, the pepper merchant's son, has been raised on stories of Olondria, a distant land where books are as common as they are rare in his home. When his father dies and Jevick takes his place on the yearly selling trip to Olondria, Jevick's life is as close to perfect as he can imagine. But just as he revels in Olondria's Rabelaisian Feast of Birds, he is pulled drastica", "Jevick, the pepper merchant's son, has been raised on stories of Olondria, a distant land where books are as common as they are rare in his home. When his father dies and Jevick takes his place on the yearly selling trip to Olondria, Jevick's life is as close to perfect as he can imagine. But just as he revels in Olondria's Rabelaisian Feast of Birds, he is pulled drastically off course and becomes haunted by the ghost of an illiterate young girl.", "In desperation, Jevick seeks the aid of Olondrian priests and quickly becomes a pawn in the struggle between the empire's two most powerful cults. Yet even as the country shimmers on the cusp of war, he must face his ghost and learn her story before he has any chance of becoming free by setting ", " free: an ordeal that challenges his understanding of art and life, home and exile, and the limits of that seductive necromancy, reading.", " is a skillful and immersive debut fantasy novel that pulls the reader in deeper and deeper with twists and turns reminiscent of George R. R. Martin and Joe Hill.", " is an American of Somali and Swiss German Mennonite background. She wrote ", " in Yambio, south Sudan, where she worked as an English teacher. She has worked in Egypt and is pursuing a PhD in African languages and literature at the University of Madison, Wisconsin."], "author": "Sofia Samatar", "num_pages": "299", "awards": ["Nebula Award Nominee for Best Novel (2013)", "World Fantasy Award for Best Novel (2014)", "IAFA William L. Crawford Fantasy Award (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-24 00:00:00", "ISBN": "1931520763"},
{"url": "https://www.goodreads.com/book/show/22393174-half-resurrection-blues", "num_ratings": "2,081", "num_reviews": "487", "avg_ratings": 3.56, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fiction", "Fantasy", "Paranormal", "Paranormal", "Ghosts", "Adult", "Audiobook", "Mystery", "Did Not Finish", "Science Fiction Fantasy"], "title": "Half-Resurrection Blues", "description": ["Carlos Delacruz is one of the New York Council of the Dead’s most unusual agents—an inbetweener, partially resurrected from a death he", "Carlos Delacruz is one of the New York Council of the Dead’s most unusual agents—an inbetweener, partially resurrected from a death he barely recalls suffering, after a life that’s missing from his memory. He thinks he is one of a kind—until he encounters other entities walking the fine line between life and death. ", "One inbetweener is a sorcerer. He’s summoned a horde of implike ngks capable of eliminating spirits, and they’re spreading through the city like a plague. They’ve already taken out some of NYCOD’s finest, leaving Carlos desperate to stop their master before he opens up the entrada to the Underworld—which would destroy the balance between the living and the dead.", "But in uncovering this man’s identity, Carlos confronts the truth of his own life—and death…"], "author": "Daniel José Older", "num_pages": "326", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-06 00:00:00", "ISBN": "0425275981"},
{"url": "https://www.goodreads.com/book/show/22731366-when-night-falls", "num_ratings": "13", "num_reviews": "7", "avg_ratings": 4.38, "genres": ["Fantasy", "Science Fiction Fantasy"], "title": "When Night Falls: Book One of The Three Gifts", "description": ["When Night Falls is an epic fantasy in the tradition of The Lord of the Rings by Tolkein or The Wheel of Time by Robert Jordan.", "We rarely consider the reputation of our age. An ordinary one, for most of us, would suffice. You might be an Empress too concerned with the affairs of State, a soldier focused on your duty, a former rascal trying to find redemption, or even a grea", "When Night Falls is an epic fantasy in the tradition of The Lord of the Rings by Tolkein or The Wheel of Time by Robert Jordan.", "We rarely consider the reputation of our age. An ordinary one, for most of us, would suffice. You might be an Empress too concerned with the affairs of State, a soldier focused on your duty, a former rascal trying to find redemption, or even a great warrior too busy with your command to know that there are whispers being spoken in late-night taverns. But what happens when your ordinary age stops being so ordinary? What happens when dark, twisted, things step out of the mists of legend to walk the world again? Strange, black, ships have been spotted far out at sea. People are disappearing from towns without a trace. Only Cordovan, a member of the Watchmen of Alexandria, knows something is wrong, as he races toward the capital, hoping he will make it in time. Meanwhile, far to the north, two of the ancient Sages of the West, theKi'gadi, know that the darkness is coming. While the rest of the world carries on, unaware of the danger, they search for the place where the darkness is taking root. Heroes will be needed to face what is coming. Thankfully, Alexandria is home to one. His name is Bantu, the Commander-General of the Peoples Company. He will be the key when night falls."], "author": "Gerald L. Coleman", "num_pages": "550", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12205290-the-lake", "num_ratings": "733", "num_reviews": "72", "avg_ratings": 3.57, "genres": ["Horror", "Short Stories", "Fiction", "Fantasy", "Paranormal", "Fantasy"], "title": "The Lake", "author": "Tananarive Due", "num_pages": "20", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13254502-hayward-s-reach", "num_ratings": "7", "num_reviews": "2", "avg_ratings": 4.43, "genres": [], "title": "Hayward's Reach: Tales of the Twilight Continuum", "description": ["Hayward's Reach is a series of short stories told by the last survivor after an unexpected cataclysm destroys the birthplace of Pan-Humanity and its attendant species. Glendale Mokoto, now as a Scout of the Corvan Empire which rescued the remnants of Pan-humanity, has time on his hands and uses it to study temporal records in which the entire history of Old Earth is embedd", "Hayward's Reach is a series of short stories told by the last survivor after an unexpected cataclysm destroys the birthplace of Pan-Humanity and its attendant species. Glendale Mokoto, now as a Scout of the Corvan Empire which rescued the remnants of Pan-humanity, has time on his hands and uses it to study temporal records in which the entire history of Old Earth is embedded. Looking though time and space he reminisces about an Earth that no longer exists.", "In these tales, Mokoto studies both the past and the future of Pan-Humanity, its allies and enemies, and learns even in his current state of in-humanity what it really means to be truly human.", "Hayward's Reach is divided into four sections:", "The Fables of Old Earth: Stories about humans as we might remember them still struggle for survival against a world which only seems to be under their control; instead a hidden reality is just beyond the sight of these early humans, a reality which affects the ultimate destiny of the species.", "A Time of Troubles: The quest for wealth and power affects the choices of both man and god alike. Dark pacts are often made in order to satisfy avarice and the innocent are its first victims.", "Entering the Penumbra: Tales of the darkest nature; a descent into depravity, deprivation and destruction. Each tale reinforcing the horror of the last. But even in this time, a single hope always flickers, a voice brave enough to claim victory, at least some of the time...", "The Diaspora of Earth: the final tales of the Human species after the destruction of Earth. Six adventures of Pan-Humanity's struggles in a hostile universe, more alien than they imagined with creatures whose powers are only hinted at, capable of altering matter and energy which hint at even recreating the Earth, for a price."], "author": "Thaddeus Howze", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-15 00:00:00", "ISBN": "0971994374"},
{"url": "https://www.goodreads.com/book/show/13059065-r-evolution", "num_ratings": "22", "num_reviews": "8", "avg_ratings": 4.05, "genres": ["Science Fiction", "Science Fiction Fantasy", "Science Fiction", "Dystopia"], "title": "R/evolution", "description": ["People are starving, biogenetic adaptations are prevalent amongst the privileged, and the poor are being ground to a sharp and dangerous point. This is the future US where in the struggle for survival citizens are pushed to the breaking point as relationships start to fracture along the lines of class and race. These are stories of the leaders and the followers, the victim", "People are starving, biogenetic adaptations are prevalent amongst the privileged, and the poor are being ground to a sharp and dangerous point. This is the future US where in the struggle for survival citizens are pushed to the breaking point as relationships start to fracture along the lines of class and race. These are stories of the leaders and the followers, the victims, heroes, and the everyday people caught in history's wake, chief among them Dr. Ezekiel Carter, a genius in his field who decides to offer genetic reparations to those being left behind. In this world, what will become of the people at the fringes and more than that of humanity itself?"], "author": "Tenea D. Johnson", "num_pages": "150", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-11-11 00:00:00", "ISBN": "0615553729"},
{"url": "https://www.goodreads.com/book/show/26813703-the-city", "num_ratings": "24", "num_reviews": "6", "avg_ratings": 4.25, "genres": ["Short Stories", "Science Fiction", "Science Fiction Fantasy", "Short Stories", "Short Story Collection"], "title": "The City: A Cyberfunk Anthology", "description": ["The City anthology is a unique creation. It’s a concept anthology, a collection of stories where eighteen different authors share their vision of a single idea. It’s Cyberfunk, cyberpunk stories that play with future concepts from an African/African American perspective. Most of all it’s engaging, exciting, thought provoking and fun. ", "Like the inhabitants, the City is perce", "The City anthology is a unique creation. It’s a concept anthology, a collection of stories where eighteen different authors share their vision of a single idea. It’s Cyberfunk, cyberpunk stories that play with future concepts from an African/African American perspective. Most of all it’s engaging, exciting, thought provoking and fun. ", "Like the inhabitants, the City is perceived in various ways by the various writers. Some stories intersect, some diverge, but they all entertain. The result is a journey into a unique world described by unique and engaging voices. "], "author": "Milton J. Davis", "num_pages": "323", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16101484-afrosf", "num_ratings": "173", "num_reviews": "29", "avg_ratings": 3.85, "genres": ["Science Fiction", "Short Stories", "Cultural", "Africa", "Anthologies", "Fiction"], "title": "AfroSF: Science Fiction by African Writers", "description": [" is the first ever anthology of Science Fiction by African writers only that was open to submissions of original (previously unpublished) works across Africa and abroad.", "'Proposition 23' by Efe Okogu nominated for the 2013 BSFA awards.", "TOC:", "'Moom!' Nnedi Okorafor", "'Home Affairs' Sarah Lotz", "'The Sale' Tendai Huchu", "'Five Sets of Hands' Cristy Zinn", "'New Mzansi' Ashley Jacobs", "'Az", " is the first ever anthology of Science Fiction by African writers only that was open to submissions of original (previously unpublished) works across Africa and abroad.", "'Proposition 23' by Efe Okogu nominated for the 2013 BSFA awards.", "TOC:", "'Moom!' Nnedi Okorafor", "'Home Affairs' Sarah Lotz", "'The Sale' Tendai Huchu", "'Five Sets of Hands' Cristy Zinn", "'New Mzansi' Ashley Jacobs", "'Azania' Nick Wood", "'Notes from Gethsemane' Tade Thompson", "'Planet X' S.A. Partridge", "'The Gift of Touch' Chinelo Onwualu", "'The Foreigner' Uko Bendi Udo", "'Angel Song' Dave de Burgh", "'The Rare Earth' Biram Mboob", "'Terms & Conditions Apply' Sally-Ann Murray", "'Heresy' Mandisi Nkomo", "'Closing Time' Liam Kruger", "'Masquerade Stories' Chiagozie Fred Nwonwu", "'The Trial' Joan De La Haye", "'Brandy City' Mia Arderne", "'Ofe!' Rafeeat Aliyu", "'Claws and Savages' Martin Stokes", "'To Gaze at the Sun' Clifton Gachagua", "'Proposition 23' (Novelette) Efe Okogu"], "author": "Ivor W. Hartmann", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/116254.Mind_of_My_Mind", "num_ratings": "5,542", "num_reviews": "363", "avg_ratings": 4.1, "genres": ["Science Fiction", "Fiction", "Fantasy"], "title": "Mind of My Mind", "description": ["For 4,000 years, an immortal has spread the seeds of a master race, using the downtrodden as his private breeding stock. But now a young ghetto telepath has found a way to awaken -- and rule -- her superhuman kind, igniting a psychic battle as she challenges her creator for her right to free her people."], "author": "Octavia E. Butler", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-08-01 00:00:00", "ISBN": "0446361887"},
{"url": "https://www.goodreads.com/book/show/6461148-the-time-of-legend", "num_ratings": "42", "num_reviews": "9", "avg_ratings": 4.4, "genres": ["Speculative Fiction", "Paranormal", "Shapeshifters", "Science Fiction Fantasy"], "title": "The Time of Legend", "description": ["AN IMMORTAL JOURNEY CONTINUES ... After a century Karla and Joseph are reunited and discover that they are werewolves - only to be marked for death by the sorcerer Tehotep. Escaping into the Time of Legend they find themselves trapped in a world of magic, blood and corruption. The planet is at war. Homeless sleep in deserted buildings, while rich citizens live like kings.", "AN IMMORTAL JOURNEY CONTINUES ... After a century Karla and Joseph are reunited and discover that they are werewolves - only to be marked for death by the sorcerer Tehotep. Escaping into the Time of Legend they find themselves trapped in a world of magic, blood and corruption. The planet is at war. Homeless sleep in deserted buildings, while rich citizens live like kings. By night demonic gangs terrorize Topaz's streets. The lovers must find their kindred ... and start the revolution that will save Tundra. But are they too late?"], "author": "Valjeanne Jeffers", "num_pages": "194", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2008-12-30 00:00:00", "ISBN": "1441468064"},
{"url": "https://www.goodreads.com/book/show/18310321-among-the-veils", "num_ratings": "23", "num_reviews": "7", "avg_ratings": 4.43, "genres": ["Fantasy", "Unfinished"], "title": "Among the Veils (Paper Thrones, #1)", "description": ["Clay Durward has always been able to read the minds of young children. When he is asked to protect a six year old boy, he learns the child carries the spirit of a ten thousand year old energy locked in his subconscious. In trying to help his ward, Clay finds himself embroiled in a civil war between two factions of Ancient Egyptian deities fighting out their rivalry among t", "Clay Durward has always been able to read the minds of young children. When he is asked to protect a six year old boy, he learns the child carries the spirit of a ten thousand year old energy locked in his subconscious. In trying to help his ward, Clay finds himself embroiled in a civil war between two factions of Ancient Egyptian deities fighting out their rivalry among the darkest streets in America’s crumbling cities."], "author": "Bret Alexander Sweet", "num_pages": "444", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-21 00:00:00", "ISBN": "0984493859"},
{"url": "https://www.goodreads.com/book/show/14896781-the-naama-war", "num_ratings": "14", "num_reviews": "2", "avg_ratings": 4.43, "genres": ["Fantasy", "Pulp", "Heroic Fantasy", "Sword and Sorcery", "Adventure", "Science Fiction Fantasy"], "title": "The Naama War", "description": ["Warfare on a cataclysmic scale is convulsing the continent of Nyumbani from north to south. Soldiers fall. Cities burn. Blood reddens the sea. Sorcery sears the land. Deities gather in opposite dimensions, poised to unleash unimaginable cosmic power on a land already battered by the conflict between the Cushites of the north and the Naamans of the south.", "In the midst of thi", "Warfare on a cataclysmic scale is convulsing the continent of Nyumbani from north to south. Soldiers fall. Cities burn. Blood reddens the sea. Sorcery sears the land. Deities gather in opposite dimensions, poised to unleash unimaginable cosmic power on a land already battered by the conflict between the Cushites of the north and the Naamans of the south.", "In the midst of this massive struggle, Imaro, warrior of the Ilyassai, wages a personal war against his nemesis, the sorcerer Bohu of Naama. This individual vendetta mirrors the larger clash between the forces of good and evil – a confrontation that threatens to tear Nyumbani apart. ", "The destiny for which Imaro has been honed like a living weapon now lies directly before him. Imaro vs. Bohu. Cush vs. Naama. War. Magic. Blood. Fire. The losers in this wide-ranging battle for the fate of a continent face oblivion. But the winners will not emerge unscathed."], "author": "Charles R. Saunders", "num_pages": "335", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-12-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1535274.The_Quest_for_Cush", "num_ratings": "116", "num_reviews": "19", "avg_ratings": 4.28, "genres": ["Fantasy", "Heroic Fantasy", "Sword and Sorcery", "Pulp", "Fantasy", "Dark Fantasy", "Action", "Fiction"], "title": "The Quest for Cush", "description": ["It begins with the reunion of Imaro and his kidnapped lover Tanisha, who has been taken to the ruined City of Madness. With the help of their new found friend Pomphis, a Pygmay from the eastern forests of Nyumbani, they learn of the sorcerous forces that may have been behind the dark wizard that destroyed Imaro's youth. The trio goes to Mavindi, the port capital of the Eas", "It begins with the reunion of Imaro and his kidnapped lover Tanisha, who has been taken to the ruined City of Madness. With the help of their new found friend Pomphis, a Pygmay from the eastern forests of Nyumbani, they learn of the sorcerous forces that may have been behind the dark wizard that destroyed Imaro's youth. The trio goes to Mavindi, the port capital of the Eastern Coastal kingdom of Azania, in search of the legendary Kingdom of Cush, where Imaro hopes to find answers to the questions that have plagued his life. Who is he? Who was his father, and why was he seemingly cursed, and hounded from birth by forces beyond his control."], "author": "Charles R. Saunders", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-01 00:00:00", "ISBN": "159780066X"},
{"url": "https://www.goodreads.com/book/show/3527515-a-sunday-in-june", "num_ratings": "32", "num_reviews": "6", "avg_ratings": 3.69, "genres": ["Fiction", "American", "African American Literature"], "title": "A Sunday in June", "description": ["The 20th century has just begun in the South and slavery still haunts. In a deep-woods region of Alabama, the tightening noose of Jim Crow is a rude indication of what white people really think of black people's 'freedom.' Still, the black population of Johnson Creek, Alabama, manages to live their lives with abiding faith and hope. The Mobleys--Frank and Joy--are among th", "The 20th century has just begun in the South and slavery still haunts. In a deep-woods region of Alabama, the tightening noose of Jim Crow is a rude indication of what white people really think of black people's 'freedom.' Still, the black population of Johnson Creek, Alabama, manages to live their lives with abiding faith and hope. The Mobleys--Frank and Joy--are among those who have pinned high hopes both on the future, and on their three daughters, Grace, Mary Nell, and Eva--hopes for good marriages and noble professions. Joy and Frank believe that the Negroes of Johnson Creek have just as much right to advance as anybody up North. But they must let go of the old ways. So they can only react with dismay when their girls show signs that they have 'the sight'--the gift of seeing the unseen, of knowing the past and future. Through their daughters' growing strangeness, Joy and Frank glimpse again the world of Joy's deceased mother, the former slave Ayo. While they do everything possible to discourage their daughters' connection with the past and future, the gift is not something that you can always give back and trying comes at a dear price."], "author": "Phyllis Alesia Perry", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-02-04 00:00:00", "ISBN": "0786868074"},
{"url": "https://www.goodreads.com/book/show/857738.Futureland", "num_ratings": "1,150", "num_reviews": "137", "avg_ratings": 3.75, "genres": ["Science Fiction", "Fiction", "Short Stories", "Science Fiction", "Dystopia"], "title": "Futureland", "description": ["Walter Mosley, the author of the Easy Rawlins mystery novels (Devil in a Blue Dress; Black Betty; etc.) has a new story to tell. Instead of coasting on his success (Bill Clinton is a fan), in 1998 he took a left turn and published Blue Light, an allegorical sort-of science fiction novel that never quite found its voice, although it was a New York Times Notable Book. Blue L", "Walter Mosley, the author of the Easy Rawlins mystery novels (Devil in a Blue Dress; Black Betty; etc.) has a new story to tell. Instead of coasting on his success (Bill Clinton is a fan), in 1998 he took a left turn and published Blue Light, an allegorical sort-of science fiction novel that never quite found its voice, although it was a New York Times Notable Book. Blue Light must have been Mosley's SF false start, because Futureland rocks and roars from the first page. ", "Ostensibly a collection of short stories, Futureland reads more like a William Gibson novel. Minor characters in one story are major characters in another story, which gives the reader that MTV jump-cut sensation, but not so frantic with Mosley as it is with Gibson. ", "And what characters! The charm of Mosley's earlier books is that the characters are normal people in historical settings, getting by as best they can. But in Futureland the reader encounters the heavyweight boxing champion of the world (female); the most intelligent human ever; the mad scientist at the head of the world's largest corporation. These characters are neither normal nor historical. ", "So with sly nods to Hegel and DeLillo, Mosley abandons history and the common man. It's a great privilege for a reader to watch a good writer change his mind. In an essay on his website Mosley claims to have been an SF fan all his life. He knows the genre; he knows the language (before he published his first novel he was a computer programmer); and he knows that there is no better venue to change your mind than SF. ", "Mosley retains some of his favorite themes, though. All the exceptional characters in the book are full members of lively communities. The best story in the book-no surprise-is about a private eye. Like most hardboiled detectives, Folio Johnson needs friends on the force and on the street to survive. Unlike Easy Rawlins, though, he also needs wetware implants to keep from going down. ", "And race pervades this book like it pervades all Mosley's books. It is a theme handled well in all of the stories except for the final one (\"The Nig in Me,\" go figure), where it is too over-the-top, and detracts from a lightweight story that was an SF cliché in the first place. ", "Also in the essay on his website, Mosley asserts that the next five years will see a wave of black SF writers. If Mosley stays with this genre, he'll lead them. He's as good as anyone writing SF today.", "_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _", "Futureland is bestselling mystery author Walter Mosley's first science fiction book since Blue Light, a New York Times Notable Book of the Year. Futureland's nine linked stories will provide an accessible and intelligent introduction to written science fiction for mystery or mainstream fiction fans who do not normally read the genre. Experienced science fiction readers, however, may be less than satisfied with Futureland. Reading it, you might decide Mr. Mosley grew up reading SF, respects the genre, and still watches SF movies, but has read little SF written during or after the New Wave of the 1960s. However, something more may be going on here than a genre newcomer making beginning-SF-writer mistakes. Mr. Mosley may be deliberately, and craftily, creating SF accessible to his large non-SF readership and to others who are strangers to this genre. Some have labeled Futureland cyberpunk, and it does present a dark, infotech-saturated, corporation-controlled future; but it is in fact an inversion of cyberpunk. Instead of that subgenre's cliche of cool, cutting-edge, street-smart, but not very believable outlaws who out-hack and outwit powerful multinational corporations, this Dante-esque collection presents outlaws and outcasts who may be street-wise, but who have little chance of overcoming the corporations and governments that control, and sometimes take, their lives. Like shockingly few other SF works, Futureland directly examines the lives of the working and the nonworking classes, the poor and the marginalized, the criminal and the criminalized. In other words, Futureland is set in a world quite alien to many veteran SF readers, and is therefore a book they should try. --Cynthia Ward"], "author": "Walter Mosley", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-11-12 00:00:00", "ISBN": "0446529540"},
{"url": "https://www.goodreads.com/book/show/25558451-spook-lights", "num_ratings": "68", "num_reviews": "33", "avg_ratings": 4.47, "genres": ["Horror", "Fiction", "Short Stories", "Gothic", "Southern Gothic"], "title": "Spook Lights: Southern Gothic Horror", "description": ["Pull up a rocking chair and sit a spell. Soak in these tales of Southern Gothic horror: ", "Sinister shopkeepers whose goods hold the highest price, a woman’s search for her mother drags her into the binding embrace of a monster, a witchdoctor’s young niece tells him a life-altering secret, an investigator who knows how to keep a 100% confession rate…. ", "These are stories where", "Pull up a rocking chair and sit a spell. Soak in these tales of Southern Gothic horror: ", "Sinister shopkeepers whose goods hold the highest price, a woman’s search for her mother drags her into the binding embrace of a monster, a witchdoctor’s young niece tells him a life-altering secret, an investigator who knows how to keep a 100% confession rate…. ", "These are stories where the setting itself becomes a character—fog laced cemeteries, sulfur rich salt marshes—places housing creatures that defy understanding and where the grotesque and macabre are celebrated. ", "The stories are rich in flavor and clever in metaphor, the horrors completely surreal or—far more unnerving—all too possible. She brings a refreshing perspective to the table that paranormal lovers are sure to enjoy. ", "—B.D. Bruns, author of The Gothic Shift ", "You can feel the warm thick air, the rich history and legends, the desperation of the impoverished, and the deep horror of the betrayed. ", "—Roma Gray, author of Gray Shadows Under a Harvest Moon"], "author": "Eden Royce", "num_pages": "135", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1199688.Babel_17", "num_ratings": "9,877", "num_reviews": "616", "avg_ratings": 3.78, "genres": ["Science Fiction", "Fiction"], "title": "Babel-17", "description": [" is all about the power of language. Humanity, which has spread throughout the universe, is involved in a war with the Invaders, who have been covertly assassinating officials and sabotaging spaceships. The only clues humanity has to go on are strange alien messages that have been intercepted in space. Poet and linguist Rydra Wong is determined to understand the la", " is all about the power of language. Humanity, which has spread throughout the universe, is involved in a war with the Invaders, who have been covertly assassinating officials and sabotaging spaceships. The only clues humanity has to go on are strange alien messages that have been intercepted in space. Poet and linguist Rydra Wong is determined to understand the language and stop the alien threat. "], "author": "Samuel R. Delany", "num_pages": "192", "awards": ["Hugo Award Nominee for Best Novel (1967)", "Nebula Award for Best Novel (1966)"], "places": [], "character_names": [], "language": "English", "publish_date": "1978-06-01 00:00:00", "ISBN": "0839823282"},
{"url": "https://www.goodreads.com/book/show/331810.Stigmata", "num_ratings": "206", "num_reviews": "22", "avg_ratings": 3.8, "genres": ["Fiction", "Cultural", "African American", "Novels"], "title": "Stigmata", "description": ["A powerful and imaginative debut novel about the legacy of slavery, and the psychological mystery surrounding a troubled young woman.", "When Lizzie Du Bose inherits a handmade quilt willed to her by a maternal grandmother she has never met, her life is forever changed. The figures sewn into the quilt tell the stories of Lizzie's grandmother Grace, and Grace's grandmother Ayo,", "A powerful and imaginative debut novel about the legacy of slavery, and the psychological mystery surrounding a troubled young woman.", "When Lizzie Du Bose inherits a handmade quilt willed to her by a maternal grandmother she has never met, her life is forever changed. The figures sewn into the quilt tell the stories of Lizzie's grandmother Grace, and Grace's grandmother Ayo, who was abducted from Africa as a girl and sent as a slave to America. As Lizzie learns, the quilt seems to hold the key to a past that haunts her, at first through terrifyngly lifellike dreams, and finally through visions that seem to take Lizzie back in time, fusing her own life with the lives of Grace and Ayo.", "One night, Lizzie awakens to find the quilt soaked in blood, and discovers horrible wounds on her wrists and back. Wracked with pain, Lizzie has no memory of having harmed herself, but she believes Ayo's manacle scars have appeared on her own body--as real an inheritence as Grace's quilt. Now Lizzie must decide whether she has begun a descent into madness, or made an extraordinary connection to the past. A compelling and utterly intriguing tale, ", " weaves together the stories of three women at once blessed with a powerful vision, and cursed by a shared legacy of slavery, pain, and struggle."], "author": "Phyllis Alesia Perry", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-09-14 00:00:00", "ISBN": "0385496354"},
{"url": "https://www.goodreads.com/book/show/24791787-kaya-abaniah-and-the-father-of-the-forest", "num_ratings": "21", "num_reviews": "4", "avg_ratings": 4.71, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction Fantasy", "Young Adult"], "title": "Kaya Abaniah and the Father of the Forest", "description": ["LEGENDS ARE IMMORTAL DREAMS MADE FLESH...", "Kaya Abaniah believes he’s an ordinary fourteen-year-old college student. He lives with his mother on the Caribbean island of Trinidad; he’s passionate about wildlife conservation and has a crush on the prettiest girl in his class. However, one fateful day, Kaya’s life is changed forever when he encounters Papa Bois, a folklore char", "LEGENDS ARE IMMORTAL DREAMS MADE FLESH...", "Kaya Abaniah believes he’s an ordinary fourteen-year-old college student. He lives with his mother on the Caribbean island of Trinidad; he’s passionate about wildlife conservation and has a crush on the prettiest girl in his class. However, one fateful day, Kaya’s life is changed forever when he encounters Papa Bois, a folklore character similar to the Greek god, Pan.", "Kaya learns he has the talent. He’s a telepath, and he’s not alone. He discovers that men in black are constantly watching him, Soucouyant, the shape-shifting vampire wants his blood, and his packed lunch is never safe.", "Will Kaya succeed in protecting his relatives and friends from the supernatural evils that lurk on the tropic isle? Can he reveal the shape-shifter’s secret identity? And, why on Earth is the most gorgeous girl, he’s ever known, so interested in him?", "Follow Kaya’s struggles with love, rivalry, and academic life, as he confronts the terrifying creatures of Trinidad and Tobago’s folklore, and unlocks the shocking mystery of Papa Bois, the father of the forest.", "About the Author:", "Wayne Gerard Trotman is a British/Trinidadian writer, blogger, filmmaker, artist, photographer, composer and producer of electronic music."], "author": "Wayne Gerard Trotman", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8790197-immortal-fantasy", "num_ratings": "7", "num_reviews": "0", "avg_ratings": 4.71, "genres": [], "title": "Immortal Fantasy", "description": ["Prepare to enter the world of Immortal Fantasy. Kotas, the Dragon Lord in two amazing adventures, Pozitron, the techno-cosmic warrior as well as: Blood and Scapegoats, A Junkie's Delight, The Secret Wonderland of D.H.Fudley and bonus Sword and Sorcery tale \" The Jar\" starring The White Raven. Introduction by Charles R. Saunders, acclaimed award winning author of Imaro ( Do", "Prepare to enter the world of Immortal Fantasy. Kotas, the Dragon Lord in two amazing adventures, Pozitron, the techno-cosmic warrior as well as: Blood and Scapegoats, A Junkie's Delight, The Secret Wonderland of D.H.Fudley and bonus Sword and Sorcery tale \" The Jar\" starring The White Raven. Introduction by Charles R. Saunders, acclaimed award winning author of Imaro ( Dossouye, Imaro, The Quest for Cush and The Trail of Bohu. ) and an afterword by: Jemir Johnson ( 5 shots) winner of the 2008 Younity Guild of America award."], "author": "Winston Blakely", "num_pages": "102", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-02-15 00:00:00", "ISBN": "1449924859"},
{"url": "https://www.goodreads.com/book/show/36347830-song-of-blood-stone", "num_ratings": "915", "num_reviews": "481", "avg_ratings": 3.73, "genres": ["Fantasy", "Romance", "Young Adult", "New Adult"], "title": "Song of Blood & Stone", "description": ["Orphaned and alone, Jasminda lives in a land where cold whispers of invasion and war linger on the wind. Jasminda herself is an outcast in her homeland of Elsira, where her gift of Earthsong is feared. When ruthless soldiers seek refuge in her isolated cabin, they bring w", "Orphaned and alone, Jasminda lives in a land where cold whispers of invasion and war linger on the wind. Jasminda herself is an outcast in her homeland of Elsira, where her gift of Earthsong is feared. When ruthless soldiers seek refuge in her isolated cabin, they bring with them a captive--an injured spy who threatens to steal her heart. ", "Jack's mission behind enemy lines to prove that the Mantle between Elsira and Lagamiri is about to fall nearly cost him his life, but he is saved by the healing Song of a mysterious young woman. Now he must do whatever it takes to save Elsira and it's people from the True Father and he needs Jasminda's Earthsong to do it. They escape their ruthless captors and together they embark on a perilous journey to save Elsira and to uncover the secrets of The Queen Who Sleeps. ", "Thrust into a hostile society, Jasminda and Jack must rely on one another even as secrets jeopardize their bond. As an ancient evil gains power, Jasminda races to unlock a mystery that promises salvation. ", "The fates of two nations hang in the balance as Jasminda and Jack must choose between love and duty to fulfill their destinies and end the war."], "author": "L. Penelope", "num_pages": "372", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-05-01 00:00:00", "ISBN": "1250148073"},
{"url": "https://www.goodreads.com/book/show/26090003-the-mark-of-noba", "num_ratings": "162", "num_reviews": "94", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Science Fiction", "Time Travel", "Science Fiction", "Fantasy", "Paranormal"], "title": "The Mark of Noba", "description": ["Sterling Wayfairer has one goal for his senior year: make his mark. He’s been slipping into the background his whole high school career—distracted by his mother’s mental health, unsettled by the vivid dreams that haunt him at night, and overshadowed by the athletic accomplishments of his popular best friends. But this year is going to be different. He’s going to break a fe", "Sterling Wayfairer has one goal for his senior year: make his mark. He’s been slipping into the background his whole high school career—distracted by his mother’s mental health, unsettled by the vivid dreams that haunt him at night, and overshadowed by the athletic accomplishments of his popular best friends. But this year is going to be different. He’s going to break a few rules, have some fun, and maybe even work up the nerve to ask his crush out on a date.", "But things don’t go exactly as planned. Students are disappearing, Sterling starts losing time, and it all seems to center around Tetra, a girl no one else seems to notice but him. When he finally tracks her down for answers, they aren’t what he expects: He and Tetra hail from a world called Noba, and they’re being hunted by a Naga, a malevolent shapeshifter that’s marked them for destruction.", "Tetra and Sterling have distinct abilities that can help them fight back, but their power depends heavily on the strength of their bond, a connection that transcends friendship, transcends romance. Years apart have left their bond weak. Jumpstarting it will require Sterling to open his heart and his mind and put his full trust in the mysterious Tetra.", "If he doesn’t, neither of them will survive."], "author": "G.L. Tomas", "num_pages": "334", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-12 00:00:00", "ISBN": "1943773009"},
{"url": "https://www.goodreads.com/book/show/18689572-the-seedbearing-prince", "num_ratings": "26", "num_reviews": "7", "avg_ratings": 4.35, "genres": ["Fantasy", "Speculative Fiction", "Science Fiction", "Science Fiction", "Planetary Romance"], "title": "The Seedbearing Prince: Part II", "description": ["Disaster strikes when the young Seedbearer destined to save the World Belt is captured by voidwalkers. Certain that all is lost if Dayn Ro'Halan is killed, the Ringmen Lurec and Nassir set out to rescue him. If he's to escape and defeat the voidwalkers for good, Dayn must accept the Belt's most terrible secret—before the voidwalker leader Raaluwos succeeds in twisting Dayn", "Disaster strikes when the young Seedbearer destined to save the World Belt is captured by voidwalkers. Certain that all is lost if Dayn Ro'Halan is killed, the Ringmen Lurec and Nassir set out to rescue him. If he's to escape and defeat the voidwalkers for good, Dayn must accept the Belt's most terrible secret—before the voidwalker leader Raaluwos succeeds in twisting Dayn's own power against him."], "author": "DaVaun Sanders", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7923006-the-kingdom-of-gods", "num_ratings": "11,578", "num_reviews": "1,085", "avg_ratings": 3.93, "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy", "Romance", "Fantasy", "High Fantasy"], "title": "The Kingdom of Gods", "description": ["For two thousand years the Arameri family has ruled the world by enslaving the very gods that created mortalkind. Now the gods are free, and the Arameris' ruthless grip is slipping. Yet they are all that stands between peace and world-spanning, unending war."], "author": "N.K. Jemisin", "num_pages": "613", "awards": ["Nebula Award Nominee for Best Novel (2011)", "Goodreads Choice Award Nominee for Best Fantasy (2011)"], "places": [], "character_names": ["Yeine Darr/Arameri", "Itempas", "Nahadoth", "Enefa ('post mortem')", "Sieh", "Shahar Arameri", "Deka Arameri", "Nahadoth’s Shadow/Hado/Ahad"], "language": "English", "publish_date": "2011-10-11 00:00:00", "ISBN": "184149819X"},
{"url": "https://www.goodreads.com/book/show/625846.Lion_s_Blood", "num_ratings": "707", "num_reviews": "72", "avg_ratings": 3.93, "genres": ["Science Fiction", "Alternate History", "Fiction", "Fantasy", "Historical", "Historical Fiction", "Science Fiction"], "title": "Lion's Blood", "description": ["In the year 1863, a primitive village is raided, the men killed, and the women and children captured. The survivors find themselves chained in the dark, filthy hold of a ship crossing the ocean to the New World, where they are sold into slavery. The powerful master of a vast Southern plantation purchases the 11-year-old Irish lad Aidan O'Dere. Yes, you read that right--in", "In the year 1863, a primitive village is raided, the men killed, and the women and children captured. The survivors find themselves chained in the dark, filthy hold of a ship crossing the ocean to the New World, where they are sold into slavery. The powerful master of a vast Southern plantation purchases the 11-year-old Irish lad Aidan O'Dere. Yes, you read that right--in this alternate America, the South was colonized by black Africans, and the North by Vikings, who sell abducted Celts and Franks to the Southerners. Through his brilliant inversion of our history, author Steven Barnes examines the complex evils of slavery in a new light with ", ", an intelligent and exciting novel of freedom and bondage, battle and intrigue, sex and love, set in an America threatened by total war as Aztecs, Zulus, Moors, and whites clash.", " A Hugo Award and Cable Ace Award nominee, Steven Barnes has written 15 novels and 15 teleplays. ", " ", "There is a sequel to this book called "], "author": "Steven Barnes", "num_pages": "480", "awards": ["Endeavour Award (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-02-13 00:00:00", "ISBN": "0446526681"},
{"url": "https://www.goodreads.com/book/show/847409.So_Long_Been_Dreaming", "num_ratings": "580", "num_reviews": "80", "avg_ratings": 3.98, "genres": ["Fantasy", "Science Fiction", "Short Stories", "Fiction", "Speculative Fiction", "Anthologies"], "title": "So Long Been Dreaming: Postcolonial Science Fiction and Fantasy", "description": [" is an anthology of original new stories by leading African, Asian, South Asian and Aboriginal authors, as well as North American and British writers of color.", "Stories of imagined futures abound in Western writing. Writer and editor Nalo Hopkinson notes that the science fiction/fantasy genre “speaks so much", " is an anthology of original new stories by leading African, Asian, South Asian and Aboriginal authors, as well as North American and British writers of color.", "Stories of imagined futures abound in Western writing. Writer and editor Nalo Hopkinson notes that the science fiction/fantasy genre “speaks so much about the experience of being alienated but contains so little writing by alienated people themselves.” It’s an oversight that Hopkinson and Mehan aim to correct with this anthology.", "The book depicts imagined futures from the perspectives of writers associated with what might loosely be termed the “third world.” It includes stories that are bold, imaginative, edgy; stories that are centered in the worlds of the “developing” nations; stories that dare to dream what we might develop into.", "The wealth of postcolonial literature has included many who have written insightfully about their pasts and presents. With ", " they creatively address their futures.", "Contributors include: Opal Palmer Adisa, Tobias Buckell, Wayde Compton, Hiromi Goto, Andrea Hairston, Tamai Kobayashi, Karin Lowachee, devorah major, Carole McDonnell, Nnedi Okorafor-Mbachu, Eden Robinson, Nisi Shawl, Vandana Singh, Sheree Renee Thomas and Greg Van Eekhout.", " is the internationally-acclaimed author of ", ", ", ", and ", ". Her books have been nominated for the Hugo, Nebula, Tiptree, and Philip K. Dick Awards; ", " won a World Fantasy Award and the Sunburst Award. Born in Jamaica, Nalo moved to Canada when she was sixteen. She lives in Toronto.", " is a scholar of science fiction and postcolonial literature. A South Asian Canadian, he currently lives in Boston and teaches at Emerson College."], "author": "Nalo Hopkinson", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-10-01 00:00:00", "ISBN": "155152158X"},
{"url": "https://www.goodreads.com/book/show/10365343-zone-one", "num_ratings": "15,175", "num_reviews": "2,686", "avg_ratings": 3.26, "genres": ["Fiction", "Horror", "Horror", "Zombies", "Science Fiction", "Apocalyptic", "Post Apocalyptic", "Science Fiction", "Dystopia"], "title": "Zone One", "description": ["In this wry take on the post-apocalyptic horror novel, a pandemic has devastated the planet. The plague has sorted humanity into two types: the uninfected and the infected, the living and the living dead. ", "Now the plague is receding, and Americans are busy rebuilding civilization under orders from the provisional government based in Buffalo. Their top mission: the resettlem", "In this wry take on the post-apocalyptic horror novel, a pandemic has devastated the planet. The plague has sorted humanity into two types: the uninfected and the infected, the living and the living dead. ", "Now the plague is receding, and Americans are busy rebuild­ing civilization under orders from the provisional govern­ment based in Buffalo. Their top mission: the resettlement of Manhattan. Armed forces have successfully reclaimed the island south of Canal Street—aka Zone One—but pockets of plague-ridden squatters remain. While the army has eliminated the most dangerous of the infected, teams of civilian volunteers are tasked with clearing out a more innocuous variety—the “malfunctioning” stragglers, who exist in a catatonic state, transfixed by their former lives. ", "Mark Spitz is a member of one of the civilian teams work­ing in lower Manhattan. Alternating between flashbacks of Spitz’s desperate fight for survival during the worst of the outbreak and his present narrative, the novel unfolds over three surreal days, as it depicts the mundane mission of straggler removal, the rigors of Post-Apocalyptic Stress Disorder, and the impossible job of coming to grips with the fallen world. ", "And then things start to go wrong. ", "Both spine chilling and playfully cerebral, ", " bril­liantly subverts the genre’s conventions and deconstructs the zombie myth for the twenty-first century."], "author": "Colson Whitehead", "num_pages": "259", "awards": ["Hurston/Wright Legacy Award Nominee for Fiction (2012)"], "places": ["Manhattan, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2011-10-18 00:00:00", "ISBN": "0385528078"},
{"url": "https://www.goodreads.com/book/show/1117058.Bloodchild_and_Other_Stories", "num_ratings": "693", "num_reviews": "83", "avg_ratings": 4.31, "genres": ["Short Stories", "Science Fiction", "Fiction", "Science Fiction Fantasy", "Speculative Fiction"], "title": "Bloodchild and Other Stories", "description": ["Octavia E. Butler once gleefully described her eerie novella \"", "\", the title piece of ", " as her \"pregnant man story\". \"", "\" explores the paradoxes of power and inequality and starkly portrays the experience of a class who, like women throughout most of history, are valued chiefly for their reproductive capacities. After it appeared", "Octavia E. Butler once gleefully described her eerie novella \"", "\", the title piece of ", " as her \"pregnant man story\". \"", "\" explores the paradoxes of power and inequality and starkly portrays the experience of a class who, like women throughout most of history, are valued chiefly for their reproductive capacities. After it appeared in ", ", it won both the Hugo and Nebula Awards, SF's highest honors.", "\"", "\", which also won the Hugo Award, and \"", "\", Butler's first published story, both describe women continuing to endure after their lives ﻿have become unbearable. \"", "\" wrestles with the double-edged sword of illness and talent. \"", "\", Butler's only non-SF story, describes a young woman coming to terms with the death of the mother who abandoned her.", "Also included are two autobiographical essays, \"", "\" and \"", "\", about what Butler calls \"the art, the craft, and the business of writing\"."], "author": "Octavia E. Butler", "num_pages": "145", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-07-01 00:00:00", "ISBN": "1888363363"},
{"url": "https://www.goodreads.com/book/show/714902.Noughts_Crosses", "num_ratings": "37,695", "num_reviews": "2,738", "avg_ratings": 4.23, "genres": ["Young Adult", "Romance", "Science Fiction", "Dystopia", "Fiction"], "title": "Noughts & Crosses", "description": ["Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.", "Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their", "Two young people are forced to make a stand in this thought-provoking look at racism and prejudice in an alternate society.", "Sephy is a Cross -- a member of the dark-skinned ruling class. Callum is a Nought -- a “colourless” member of the underclass who were once slaves to the Crosses. The two have been friends since early childhood, but that’s as far as it can go. In their world, Noughts and Crosses simply don’t mix. Against a background of prejudice and distrust, intensely highlighted by violent terrorist activity, a romance builds between Sephy and Callum -- a romance that is to lead both of them into terrible danger. Can they possibly find a way to be together?"], "author": "Malorie Blackman", "num_pages": "490", "awards": ["FCBG Children’s Book Award (2002)", "Sheffields Children's Book of the Year (2002)", "Wirral Children’s Paperback of the Year Award (2003)", "Lancashire Children’s Book of the Year Award (2002)", "North East Teenage Book Award Nominee (2002)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2009)"], "places": [], "character_names": ["Callum McGregor", "Persephone 'Sephy' Hadley"], "language": "English", "publish_date": "2006-08-08 00:00:00", "ISBN": "0552555703"},
{"url": "https://www.goodreads.com/book/show/18177406-woman-of-the-woods", "num_ratings": "28", "num_reviews": "8", "avg_ratings": 4.43, "genres": ["Fantasy", "Science Fiction Fantasy"], "title": "Woman of the Woods", "description": ["Sadatina, an Adamu girl on the brink of becoming a woman has lived a peaceful life with her family in Adamusola, the land beyond the Old Men Mountains. But tragic events change her life forever, revealing a hidden past that leads her into the midst of a war between her people and those that would see them destroyed, the Mosele. Armed with a spiritual weapon and her feline", "Sadatina, an Adamu girl on the brink of becoming a woman has lived a peaceful life with her family in Adamusola, the land beyond the Old Men Mountains. But tragic events change her life forever, revealing a hidden past that leads her into the midst of a war between her people and those that would see them destroyed, the Mosele. Armed with a spiritual weapon and her feline 'sisters, ' Sadatina becomes a Shosa, a warrior trained to fight the terrible nyokas, demon-like creatures that aid the Mosele in their war against her people. Woman of the Woods by Milton Davis is an action filled, emotionally charged adventure that expands the scope of the world of Uhuru and introduces another unforgettable character to the fabled continent's heroic legends."], "author": "Milton J. Davis", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-01 00:00:00", "ISBN": "0980084261"},
{"url": "https://www.goodreads.com/book/show/13272713-fire-baptized", "num_ratings": "957", "num_reviews": "237", "avg_ratings": 3.76, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Paranormal", "Shapeshifters", "Fantasy", "Magic", "Romance", "Paranormal Romance", "Fantasy"], "title": "Fire Baptized", "description": ["Since the 1970s humans have forced supernaturals to live in caged cities. Silver brands embedded in their foreheads identify them by species: a full moon for Vampires, a crescent moon for Shifters, a pair of wings for Fairies, and the list goes on, for each supernatural species has been tagged and categorized by humans. ", "Lanore Vesta is marked with a silver X, the brand of", "Since the 1970s humans have forced supernaturals to live in caged cities. Silver brands embedded in their foreheads identify them by species: a full moon for Vampires, a crescent moon for Shifters, a pair of wings for Fairies, and the list goes on, for each supernatural species has been tagged and categorized by humans. ", "Lanore Vesta is marked with a silver X, the brand of Mixbreeds, second-class citizens shunned by society. She stays to herself, revealing her ability to create fire only during emergencies. All she wants to do is graduate college and stop having to steal to survive. But when she stumbles upon a murder in progress, she catches the attention of a supernatural killer. Now all she wants is to stop finding dead bodies in her apartment. ", "Enlisting help from her Were-cheetah ex-boyfriend MeShack and a new mysterious friend named Zulu, she is steered through the habitat s raunchy nightlife. But their presence sometimes proves to be more burden than help, as they fight for her attention. ", "While the corpses pile up, and the scent of blood fills the air, Lanore is left wondering: will she find the psycho or die trying?"], "author": "Kenya Wright", "num_pages": "276", "awards": [], "places": [], "character_names": ["Lanore", "Meshack", "Zulu"], "language": "English", "publish_date": "2012-01-28 00:00:00", "ISBN": "0985023007"},
{"url": "https://www.goodreads.com/book/show/10569718-king-s-war", "num_ratings": "24", "num_reviews": "6", "avg_ratings": 3.46, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fiction", "Mythology", "Arthurian"], "title": "King's War", "description": ["FROM THE DRUG GANGS OF DOWNTOWN INDIANAPOLIS, THE ONE TRUE KING WILL ARISE.", "King has been betrayed, but he has no time to lick his wounds - he has to draw his people together to fight the ultimate foe in this conclusion to the stunning Knights of Breton Court trilogy.", " [ Street Gangs | Drug Wars | Wild Magic | Betrayal ]", "e-book ISBN: 9780857661319"], "author": "Maurice Broaddus", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-25 00:00:00", "ISBN": "0857661302"},
{"url": "https://www.goodreads.com/book/show/8714521-king-s-justice", "num_ratings": "48", "num_reviews": "15", "avg_ratings": 2.96, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fiction", "Mythology", "Arthurian"], "title": "King's Justice", "description": ["FROM THE DRUG GANGS OF DOWNTOWN INDIANAPOLIS, THE ONE TRUE KING WILL ARISE. ", "Guided by the crazed visions of his advisor Merle, King knows that he must unite the opposing factions, before the streets erupt in all-out war. But how can he preach peace when even his own warriors are plotting against him? A heart-stopping mix of ancient myth and powerful gang action, from the a", "FROM THE DRUG GANGS OF DOWNTOWN INDIANAPOLIS, THE ONE TRUE KING WILL ARISE. ", "Guided by the crazed visions of his advisor Merle, King knows that he must unite the opposing factions, before the streets erupt in all-out war. But how can he preach peace when even his own warriors are plotting against him? A heart-stopping mix of ancient myth and powerful gang action, from the author of ", ".", " [ Street gangs | Drug wars | Wild magic | Gather darkness ]"], "author": "Maurice Broaddus", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "0857660829"},
{"url": "https://www.goodreads.com/book/show/7163878-king-maker", "num_ratings": "171", "num_reviews": "44", "avg_ratings": 2.85, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fiction", "Mythology", "Arthurian", "Mystery", "Crime"], "title": "King Maker", "description": ["From the drug gangs of downtown Indianapolis, the one true king will arise. The King Arthur myth gets dramatically retold through the eyes of street hustler King, as he tries to unite the crack dealers, gangbangers and the monsters lurking within them to do the right thing. Broaddus' debut is a stunning, edgy work, genuinely unlike anything you've ever read."], "author": "Maurice Broaddus", "num_pages": "385", "awards": ["The Kitschies for Golden Tentacle (Debut) (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-01 00:00:00", "ISBN": "0007343310"},
{"url": "https://www.goodreads.com/book/show/17560038-hades-disciples", "num_ratings": "56", "num_reviews": "10", "avg_ratings": 3.71, "genres": ["Fantasy", "Mythology", "Horror", "Fantasy", "Fantasy", "Paranormal", "Science Fiction"], "title": "Hades' Disciples", "description": ["Terrifying creatures exist all around us, hiding in plain sight. Ancient. Deadly. They gather in secret, conspiring, dreaming of nothing less than humanity's destruction, and their numbers are growing.", "Earl Preston knows the danger all too well. After tangling with a horde of mythological sea monsters in Colonial Bay, he has been tasked with finding these beasts and exposin", "Terrifying creatures exist all around us, hiding in plain sight. Ancient. Deadly. They gather in secret, conspiring, dreaming of nothing less than humanity's destruction, and their numbers are growing.", "Earl Preston knows the danger all too well. After tangling with a horde of mythological sea monsters in Colonial Bay, he has been tasked with finding these beasts and exposing their plans whatever they may be. But Earl is not the only one with a mystery on their hands. At the very top of the world, Carol Miyagi has stumbled onto an artifact from Earth's past, something magnificent held captive in a prison of ice and snow. Now, Carol and Earl must work quickly to decipher the will of the gods--a plot that defies imagination--and to stop their followers from carrying it out.", "They thought the nightmare was over, but they are about to discover that the horror has only just begun."], "author": "Michael  West", "num_pages": "301", "awards": [], "places": ["New York City, New York", "Kathmandu", "Tokyo", "Himalayas"], "character_names": ["Preacher", "Benedict", "Earl L. Preston Jr.", "Carol Miyagi", "Dante \"The Horror Show\" Vianello", "Alan Everson", "Vivian Song", "Kari Hannigan", "Chud", "Dr. Graeme King", "Uzuri \"Zuri\" Shujaa", "Agent Andrews", "Dr. Kathy Ward", "Detective Roy Perry"], "language": "English", "publish_date": "2014-05-16 00:00:00", "ISBN": "1941706002"},
{"url": "https://www.goodreads.com/book/show/41534.The_Between", "num_ratings": "947", "num_reviews": "80", "avg_ratings": 4.01, "genres": ["Horror", "Fiction", "Fantasy", "Cultural", "African American", "Science Fiction", "Fantasy", "Supernatural", "Thriller", "Speculative Fiction", "Mystery", "Fantasy", "Paranormal"], "title": "The Between", "description": ["When Hilton was just a boy, his aged grandmother saved him from drowning by pulling him out of a treacherous ocean current, sacrificing her life for his. Now, thirty years later, Hilton begins to think his borrowed time is running out. His wife, the only elected African–American judge in Dade County, Florida, has begun receiving racist hate mail from a man she once prosecu", "When Hilton was just a boy, his aged grandmother saved him from drowning by pulling him out of a treacherous ocean current, sacrificing her life for his. Now, thirty years later, Hilton begins to think his borrowed time is running out. His wife, the only elected African–American judge in Dade County, Florida, has begun receiving racist hate mail from a man she once prosecuted, and Hilton's sleep is plagued by nightmares more horrible than any he has ever experienced.", "As he battles both the psychotic stalking of his family and the unseen enemy that haunts his sleep, Hilton's sense of reality is slipping away."], "author": "Tananarive Due", "num_pages": "304", "awards": ["Bram Stoker Award Nominee for First Novel"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0060819847"},
{"url": "https://www.goodreads.com/book/show/85867.Dhalgren", "num_ratings": "7,399", "num_reviews": "836", "avg_ratings": 3.79, "genres": ["Science Fiction", "Fiction", "Fantasy"], "title": "Dhalgren", "description": ["In ", " perhaps one of the most profound and bestselling science fiction novels of all time, Samuel R. Delany has produced a novel \"to stand with the best American fiction of the 1970s\" (Jonathan Lethem).", "Bellona is a city at the dead center of the United States. Something has happened there…. The population has fled. Madmen and criminals wander the streets. Strange po", "In ", " perhaps one of the most profound and bestselling science fiction novels of all time, Samuel R. Delany has produced a novel \"to stand with the best American fiction of the 1970s\" (Jonathan Lethem).", "Bellona is a city at the dead center of the United States. Something has happened there…. The population has fled. Madmen and criminals wander the streets. Strange portents appear in the cloud-covered sky. And into this disaster zone comes a young man–poet, lover, and adventurer–known only as the Kid. Tackling questions of race, gender, and sexuality, ", " is a literary marvel and groundbreaking work of American magical realism."], "author": "Samuel R. Delany", "num_pages": "801", "awards": ["Nebula Award Nominee for Novel (1975)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-05-15 00:00:00", "ISBN": "0375706682"},
{"url": "https://www.goodreads.com/book/show/11194627-the-switch-ii", "num_ratings": "21", "num_reviews": "8", "avg_ratings": 4.52, "genres": ["Science Fiction", "Science Fiction", "Steampunk", "Sequential Art", "Comics"], "title": "The Switch II: Clockwork", "description": ["Includes the Switch and The Switch II: Clockwork. Look for The Switch in the groundbreaking anthology: Steamfunk!", "\"As she looked on, the target unzipped his jumpsuit and pushed it down. His blond companion sauntered over to his desk, and slipped off her pants. She straddled him, curling an arm about his neck. With her other hand she unzipped her tunic to bare her plump brea", "Includes the Switch and The Switch II: Clockwork. Look for The Switch in the groundbreaking anthology: Steamfunk!", "\"As she looked on, the target unzipped his jumpsuit and pushed it down. His blond companion sauntered over to his desk, and slipped off her pants. She straddled him, curling an arm about his neck. With her other hand she unzipped her tunic to bare her plump breasts. Moans of pleasure filled Z100’s apartment.", "Z100 watched them, arousal spreading down her pelvis. She cut the tape off, got up and poured herself another glass of wine. She’d planted the tiny cameras in the men’s offices. They were later retrieved by spies posing as under dweller janitors.\"", "York is a city of contradictions. Women are hard-pressed for lovers, because lovemaking can be dangerous. The upper city is powered by computers, the underground by steam. And the wealthy don't work for a living, underdwellers do it for them.", "But certain underdwellers have a big problem with this arrangement. And so does the time keeper.", "Welcome to the Revolution...", "Cover art and design by Quinton Veal"], "author": "Valjeanne Jeffers", "num_pages": "164", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-04-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/57504.Brown_Girl_in_the_Ring", "num_ratings": "3,299", "num_reviews": "389", "avg_ratings": 3.85, "genres": ["Fantasy", "Fiction", "Science Fiction", "Speculative Fiction", "Fantasy", "Urban Fantasy", "Science Fiction", "Dystopia"], "title": "Brown Girl in the Ring", "description": ["The rich and privileged have fled the city, barricaded it behind roadblocks, and left", "The rich and privileged have fled the city, barricaded it behind roadblocks, and left it to crumble. The inner city has had to rediscover old ways--farming, barter, herb lore. But now the monied need a harvest of bodies, and so they prey upon the helpless of the streets. With nowhere to turn, a young woman must open herself to ancient truths, eternal powers, and the tragic mystery surrounding her mother and grandmother.", "She must bargain with gods, and give birth to new legends."], "author": "Nalo Hopkinson", "num_pages": "256", "awards": ["Locus Award for Best First Novel (1999)", "Warner Aspect First Novel Contest (1997)", "James Tiptree Jr. Award Honor List (1998)"], "places": ["Toronto, Ontario"], "character_names": [], "language": "English", "publish_date": "1998-07-01 00:00:00", "ISBN": "0446674338"},
{"url": "https://www.goodreads.com/book/show/85861.Stars_in_My_Pocket_Like_Grains_of_Sand", "num_ratings": "2,116", "num_reviews": "195", "avg_ratings": 3.89, "genres": ["Science Fiction", "Fiction", "Glbt", "Queer", "Science Fiction Fantasy"], "title": "Stars in My Pocket Like Grains of Sand", "description": ["Stars in My Pocket Like Grains of Sand is a science fiction masterpiece, an essay on the inexplicability of sexual attractiveness, and an examination of interstellar politics among far-flung worlds. First published in 1984, the novel's central issues--technology, globalization, gender, sexuality, and multiculturalism--have only become more pressing with the passage of time", "Stars in My Pocket Like Grains of Sand is a science fiction masterpiece, an essay on the inexplicability of sexual attractiveness, and an examination of interstellar politics among far-flung worlds. First published in 1984, the novel's central issues--technology, globalization, gender, sexuality, and multiculturalism--have only become more pressing with the passage of time.", "The novel's topic is information itself: What are the repercussions, once it has been made public, that two individuals have been found to be each other's perfect erotic object out to \"point nine-nine-nine and several nines percent more\"? What will it do to the individuals involved, to the city they inhabit, to their geosector, to their entire world society, especially when one is an illiterate worker, the sole survivor of a world destroyed by \"cultural fugue,\" and the other is--you!"], "author": "Samuel R. Delany", "num_pages": "356", "awards": ["Arthur C. Clarke Award Nominee for Best Novel (1987)", "James Tiptree Jr. Award Nominee for Special Mention - 20th Anniversary Republication (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-12-15 00:00:00", "ISBN": "0819567140"},
{"url": "https://www.goodreads.com/book/show/625847.Zulu_Heart", "num_ratings": "251", "num_reviews": "22", "avg_ratings": 3.96, "genres": ["Science Fiction", "Alternate History", "Fiction", "Historical", "Historical Fiction", "Science Fiction", "Fantasy", "Speculative Fiction"], "title": "Zulu Heart", "description": ["This book is the sequel to ", " returns to the 19th Century of Steven Barnes's justly acclaimed novel ", ", a brilliant alternate history in which black Africans have colonized the New World with white Europeans as their slaves.", "This book is the sequel to ", " returns to the 19th Century of Steven Barnes's justly acclaimed novel ", ", a brilliant alternate history in which black Africans have colonized the New World with white Europeans as their slaves."], "author": "Steven Barnes", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-03-19 00:00:00", "ISBN": "0446531227"},
{"url": "https://www.goodreads.com/book/show/7767021-who-fears-death", "num_ratings": "11,143", "num_reviews": "1,730", "avg_ratings": 3.96, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia", "Cultural", "Africa"], "title": "Who Fears Death", "description": [" In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, sh", " In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, she manages to escape, wandering farther into the desert. She gives birth to a baby girl with hair and skin the color of sand and instinctively knows that her daughter is different. She names her daughter Onyesonwu, which means \"Who Fears Death?\" in an ancient African tongue.", " Reared under the tutelage of a mysterious and traditional shaman, Onyesonwu discovers her magical destiny – to end the genocide of her people. The journey to fulfill her destiny will force her to grapple with nature, tradition, history, true love, the spiritual mysteries of her culture – and eventually death itself."], "author": "Nnedi Okorafor", "num_pages": "386", "awards": ["Nebula Award Nominee for Best Novel (2010)", "Locus Award Nominee for Best Fantasy Novel (2011)", "World Fantasy Award for Best Novel (2011)", "Grand Prix de l'Imaginaire Nominee for Roman étranger (2014)", "Prix Imaginales for Roman étranger (2014)", "Goodreads Choice Award Nominee for Fantasy (2010)", "James Tiptree Jr. Award Honor List (2010)"], "places": [], "character_names": ["Onyesonwu Ubaid-Ogundimu", "Mwita", "Najeeba", "Aro (Who Fears Death series)", "Luyu", "Binta", "Diti", "Fanasi", "Daib"], "language": "English", "publish_date": "2010-06-01 00:00:00", "ISBN": "075640617X"},
{"url": "https://www.goodreads.com/book/show/41539.The_Good_House", "num_ratings": "2,331", "num_reviews": "310", "avg_ratings": 3.94, "genres": ["Horror", "Fiction", "Audiobook", "Fantasy", "Paranormal", "Fantasy"], "title": "The Good House", "description": ["The home that belonged to Angela Toussaint's late grandmother is so beloved that townspeople in Sacajawea, Washington, call it the Good House. But that all changes one summer when an unexpected tragedy takes place behind its closed doors...and the Toussaint's family history -- and future -- is dramatically transformed. Angela has not returned to the Good House since her so", "The home that belonged to Angela Toussaint's late grandmother is so beloved that townspeople in Sacajawea, Washington, call it the Good House. But that all changes one summer when an unexpected tragedy takes place behind its closed doors...and the Toussaint's family history -- and future -- is dramatically transformed. Angela has not returned to the Good House since her son, Corey, died there two years ago. But now, Angela is finally ready to return to her hometown and go beyond the grave to unearth the truth about Corey's death. Could it be related to a terrifying entity Angela's grandmother battled seven decades ago? And what about the other senseless calamities that Sacajawea has seen in recent years? Has Angela's grandmother, an African American woman reputed to have \"powers,\" put a curse on the entire community?", "A thrilling exploration of secrets, lies, and divine inspiration, \"The Good House\" will haunt readers long after its chilling conclusion."], "author": "Tananarive Due", "num_pages": "597", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-01 00:00:00", "ISBN": "0743296168"},
{"url": "https://www.goodreads.com/book/show/6250318-meji", "num_ratings": "65", "num_reviews": "14", "avg_ratings": 4.42, "genres": ["Fantasy", "Speculative Fiction", "Heroic Fantasy", "Sword and Sorcery", "Fiction"], "title": "Meji: Book One", "description": ["Meji Book One Book Description Change: On the Sesu grasslands of the continent of Uhuru, Inkosi Dingane is granted his wish. His Great Wife Shani bears him a son, and heir to his growing empire. But the ancestors have plans of their own. Shani bears him meji, twins boys considered an abomination among the Sesu but a blessing to Shani's people, the Mawena. Thus begins the s", "Meji Book One Book Description Change: On the Sesu grasslands of the continent of Uhuru, Inkosi Dingane is granted his wish. His Great Wife Shani bears him a son, and heir to his growing empire. But the ancestors have plans of their own. Shani bears him meji, twins boys considered an abomination among the Sesu but a blessing to Shani's people, the Mawena. Thus begins the story of two brothers destined to transform their world. One brother, Ndoro, fights for his place among the Sesu hoping to shed the stigma of abomination. The other, Obaseki, grows to a man among the Mawena, struggling with a gift that alienates him from his family. Both are forced to seek their destiny, travelling through teeming savanna, mysterious forests, haunted cliffs and torrid deserts, fulfilling a prophecy that changes them and their world forever."], "author": "Milton J. Davis", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-07-19 00:00:00", "ISBN": "0980084202"},
{"url": "https://www.goodreads.com/book/show/7904453-the-broken-kingdoms", "num_ratings": "16,633", "num_reviews": "1,383", "avg_ratings": 4.05, "genres": ["Fantasy", "Fiction", "Romance", "Fantasy", "Epic Fantasy", "Fantasy", "Magic"], "title": "The Broken Kingdoms", "description": ["In the city of Shadow, beneath the World Tree, alleyways shimmer with magic and godlings live hidden among mortalkind. Oree Shoth, a blind artist, takes in a homeless man who glows like a living sun to her strange sight. This act of kindness engulfs Oree in a nightmarish conspiracy. Someone, somehow, is murdering godlings, leaving their desecrated bodies all over the city.", "In the city of Shadow, beneath the World Tree, alleyways shimmer with magic and godlings live hidden among mortalkind. Oree Shoth, a blind artist, takes in a homeless man who glows like a living sun to her strange sight. This act of kindness engulfs Oree in a nightmarish conspiracy. Someone, somehow, is murdering godlings, leaving their desecrated bodies all over the city. ", "Oree's peculiar guest is at the heart of it, his presence putting her in mortal danger -- but is it him the killers want, or Oree? And is the earthly power of the Arameri king their ultimate goal, or have they set their sights on the Lord of Night himself?"], "author": "N.K. Jemisin", "num_pages": "384", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Fantasy (2010)"], "places": [], "character_names": ["Lil", "Oree Shoth", "Shiny", "Madding", "Dateh", "Kitr", "Hado", "Serymn", "Nahadoth", "Sieh", "T'vril Arameri", "Yeine Darr/Arameri", "Itempas"], "language": "English", "publish_date": "2010-11-03 00:00:00", "ISBN": "0316043966"},
{"url": "https://www.goodreads.com/book/show/12394951-griots", "num_ratings": "88", "num_reviews": "16", "avg_ratings": 4.23, "genres": ["Fantasy", "Short Stories", "Heroic Fantasy", "Sword and Sorcery", "Anthologies", "Adventure", "Pulp"], "title": "Griots: A Sword and Soul Anthology", "description": ["Magic. Myth. Warfare. Wonder. Beauty. Bravery. Glamour. Gore. Sorcery. Sensuality. These and many more elements of fantasy await you in the pages of Griots, which brings you the latest stories of the new genre called Sword and Soul.The tales told in Griots are the annals of the Africa that was, as well as Africas that never were, may have been, or should have been. They ar", "Magic. Myth. Warfare. Wonder. Beauty. Bravery. Glamour. Gore. Sorcery. Sensuality. These and many more elements of fantasy await you in the pages of Griots, which brings you the latest stories of the new genre called Sword and Soul.The tales told in Griots are the annals of the Africa that was, as well as Africas that never were, may have been, or should have been. They are the legends of a continent and people emerging from shadows thrust upon them in the past. They are the sagas sung by the modern heirs of the African story-tellers known by many names - including griots.Here, you will meet mighty warriors, seductive sorceresses, ambitious monarchs, and cunning courtesans. Here, you will journey through the vast variety of settings Africa offers, and inspires. Here, you will savor what the writings of the modern-day griots have to offer: journeys through limitless vistas of the imagination, with a touch of color and a taste of soul.", " Contents:", "The Soul in the Sword • essay by Charles R. Saunders", "A Gathering at the Meeting Tree • essay by Milton J. Davis", "Mrembo Aliyenaswa (Captured Beauty) • shortfiction by Milton J. Davis [as by Milton Davis ]", "Awakening • shortfiction by Valjeanne Jeffers", "Lost Son • shortfiction by Maurice Broaddus", "In the Wake of Mist • shortfiction by Kirk A. Johnson", "Skin Magic • shortfiction by Djeli A. Clark", "The Demon in the Wall • shortfiction by Stafford L. Battle", "The Belly of the Crocodile • shortfiction by Minister Faust", "Changeling • shortfiction by Carole McDonnell", "The General's Daughter • shortfiction by Anthony Nana Kwamu", "Sekadi's Koan • shortfiction by Geoffrey Thorne", "The Queen, the Demon and the Mercenary • shortfiction by Ronald T. Jones", "Icewitch • shortfiction by Rebecca McFarland Kyle", "The Leopard Walks Alone • shortfiction by Melvin Carter", "The Three-Faced One • shortfiction by Charles R. Saunders", "Griots Bios • essay by uncredited"], "author": "Milton J. Davis", "num_pages": "294", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-07 00:00:00", "ISBN": "0980084288"},
{"url": "https://www.goodreads.com/book/show/12057345-damballa", "num_ratings": "25", "num_reviews": "6", "avg_ratings": 4.72, "genres": ["Fiction", "Romance", "Historical Romance", "Contemporary", "Thriller", "Mystery Thriller"], "title": "Damballa", "description": ["The first ever African American 1930s avenger sets out to stop a Nazi plot to subvert a championship fight. From deepest Africa to the streets of 1930s Harlem, the action is none stop. Written by famed novelist Charles Saunders, with interior illos by Clayton Hinkle and a cover by Charles Fetherolf, this is a history making pulp adventure fans do not want to miss."], "author": "Charles R. Saunders", "num_pages": "212", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-06-01 00:00:00", "ISBN": "1613420129"},
{"url": "https://www.goodreads.com/book/show/1535273.Imaro", "num_ratings": "432", "num_reviews": "87", "avg_ratings": 3.94, "genres": ["Fantasy", "Heroic Fantasy", "Sword and Sorcery", "Fiction", "Adventure", "Cultural", "Africa", "Speculative Fiction"], "title": "Imaro", "description": ["Saunders' novel fuses the narrative style of fantasy fiction with a pre-colonial, alternate Africa. Inspired by and directly addresses the alienation of growing up an African American fan of Science Fiction and Fantasy, which to this day remains a very ethnically homogonous genre. It addresses this both structurally (via its unique setting) and thematically (via its aliena", "Saunders' novel fuses the narrative style of fantasy fiction with a pre-colonial, alternate Africa. Inspired by and directly addresses the alienation of growing up an African American fan of Science Fiction and Fantasy, which to this day remains a very ethnically homogonous genre. It addresses this both structurally (via its unique setting) and thematically (via its alienated, tribeless hero-protagonist). The tribal tensions and histories presented in this fantasy novel reflect actual African tribal histories and tensions, and provide a unique perspective to current and recent conflicts in Africa, particularly the Rwandan genocide and the ongoing conflict in The Sudan.", "Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a ", " bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors."], "author": "Charles R. Saunders", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "1597800368"},
{"url": "https://www.goodreads.com/book/show/11634670-bloodchild-and-other-stories", "num_ratings": "8,972", "num_reviews": "802", "avg_ratings": 4.3, "genres": ["Speculative Fiction", "Science Fiction Fantasy", "Short Stories", "Anthologies", "Feminism"], "title": "Bloodchild and Other Stories", "description": ["A perfect introduction for new readers and a must-have for avid fans, this New York Times Notable Book includes \"Bloodchild,\" winner of both the Hugo and the Nebula awards and \"Speech Sounds,\" winner of the Hugo Award. Appearing in print for the first time, \"Amnesty\" is a story of a woman named Noah who works to negotiate the tense and co-dependent relationship between hum", "A perfect introduction for new readers and a must-have for avid fans, this New York Times Notable Book includes \"Bloodchild,\" winner of both the Hugo and the Nebula awards and \"Speech Sounds,\" winner of the Hugo Award. Appearing in print for the first time, \"Amnesty\" is a story of a woman named Noah who works to negotiate the tense and co-dependent relationship between humans and a species of invaders. Also new to this collection is \"The Book of Martha\" which asks: What would you do if God granted you the ability—and responsibility—to save humanity from itself?", "Like all of Octavia Butler’s best writing, these works of the imagination are parables of the contemporary world. She proves constant in her vigil, an unblinking pessimist hoping to be proven wrong, and one of contemporary literature’s strongest voices."], "author": "Octavia E. Butler", "num_pages": "224", "awards": ["Hugo Award for Best Novelette for \"Bloodchild\" (1985)", "Locus Award for Best Novelette (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-04 00:00:00", "ISBN": "1583228039"},
{"url": "https://www.goodreads.com/book/show/41538.The_Living_Blood", "num_ratings": "1,833", "num_reviews": "120", "avg_ratings": 4.33, "genres": ["Horror", "Fiction", "Fantasy", "Science Fiction", "Fantasy", "Paranormal"], "title": "The Living Blood", "description": ["Jessica Jacobs-Wolde's life was destroyed when her husband, David Wolde killed both their daughter Kira and Jessica herself--and revived Jessica with his healing blood. David was a Life Brother, member of an ancient, secret, and immortal African clan. Now Jessica, hiding with her surviving daughter in rural Botswana, attempts to make sense of her new existence, and of Fana", "Jessica Jacobs-Wolde's life was destroyed when her husband, David Wolde killed both their daughter Kira and Jessica herself--and revived Jessica with his healing blood. David was a Life Brother, member of an ancient, secret, and immortal African clan. Now Jessica, hiding with her surviving daughter in rural Botswana, attempts to make sense of her new existence, and of Fana's growing abilities. Jessica's only hope of teaching Fana to control her dangerous talents is to travel to Ethiopia and find the Life Brothers' hidden colony. "], "author": "Tananarive Due", "num_pages": "515", "awards": ["American Book Award (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "0671040847"},
{"url": "https://www.goodreads.com/book/show/25667918-binti", "num_ratings": "21,667", "num_reviews": "3,627", "avg_ratings": 4.0, "genres": ["Science Fiction", "Fiction", "Fantasy", "Novella", "Short Stories"], "title": "Binti", "description": ["Her name is Binti, and she is the first of the Himba people ever to be offered a place at Oomza University, the finest institution of higher learning in the galaxy. But to accept the offer will mean giving up her place in her family to travel between the stars among strangers who do not share her ways or respect her customs.", "Knowledge comes at a cost, one that Binti is will", "Her name is Binti, and she is the first of the Himba people ever to be offered a place at Oomza University, the finest institution of higher learning in the galaxy. But to accept the offer will mean giving up her place in her family to travel between the stars among strangers who do not share her ways or respect her customs.", "Knowledge comes at a cost, one that Binti is willing to pay, but her journey will not be easy. The world she seeks to enter has long warred with the Meduse, an alien race that has become the stuff of nightmares. Oomza University has wronged the Meduse, and Binti's stellar travel will bring her within their deadly reach.", "If Binti hopes to survive the legacy of a war not of her making, she will need both the gifts of her people and the wisdom enshrined within the University, itself - but first she has to make it there, alive."], "author": "Nnedi Okorafor", "num_pages": "96", "awards": ["Hugo Award for Best Novella (2016)", "Nebula Award for Best Novella (2016)", "Locus Award Nominee for Best Novella (2016)", "Nommo Award for Best Novella (2017)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-22 00:00:00", "ISBN": "0765384469"},
{"url": "https://www.goodreads.com/book/show/41536.My_Soul_to_Keep", "num_ratings": "3,643", "num_reviews": "342", "avg_ratings": 4.2, "genres": ["Horror", "Fantasy", "Fiction", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Science Fiction", "Fantasy", "Urban Fantasy"], "title": "My Soul to Keep", "description": ["When Jessica marries David, he is everything she wants in a family man: brilliant, attentive, ever youthful. Yet she still feels something about him is just out of reach. Soon, as people close to Jessica begin to meet violent, mysterious deaths, David makes an unimaginable confession: More than 400 years ago, he and other members of an Ethiopian sect traded their humanity", "When Jessica marries David, he is everything she wants in a family man: brilliant, attentive, ever youthful. Yet she still feels something about him is just out of reach. Soon, as people close to Jessica begin to meet violent, mysterious deaths, David makes an unimaginable confession: More than 400 years ago, he and other members of an Ethiopian sect traded their humanity so they would never die, a secret he must protect at any cost. Now, his immortal brethren have decided David must return and leave his family in Miami. Instead, David vows to invoke a forbidden ritual to keep Jessica and his daughter with him forever. Harrowing, engrossing and skillfully rendered, ", " traps Jessica between the desperation of immortals who want to rob her of her life and a husband who wants to rob her of her soul. With deft plotting and an unforgettable climax, this tour de force reminiscent of early Anne Rice will win Due a new legion of fans."], "author": "Tananarive Due", "num_pages": "346", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-04-08 00:00:00", "ISBN": "006105366X"},
{"url": "https://www.goodreads.com/book/show/52318.Wild_Seed", "num_ratings": "13,004", "num_reviews": "1,220", "avg_ratings": 4.21, "genres": ["Science Fiction", "Fantasy", "Fiction", "Speculative Fiction"], "title": "Wild Seed", "description": ["Doro is an entity who changes bodies like clothes, killing his hosts by reflex or design. He fears no one until he meets Anyanwu. Anyanwu is a shapeshifter who can absorb bullets and heal with a kiss and savage anyone who threatens her. She fears no one until she meets Doro. Together they weave a pattern of destiny (from Africa to the New World) unimaginable to mortals."], "author": "Octavia E. Butler", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-04-01 00:00:00", "ISBN": "0446676977"},
{"url": "https://www.goodreads.com/book/show/6437061-the-hundred-thousand-kingdoms", "num_ratings": "38,000", "num_reviews": "4,171", "avg_ratings": 3.82, "genres": ["Fantasy", "Fiction", "Romance", "Fantasy", "High Fantasy", "Fantasy", "Epic Fantasy"], "title": "The Hundred Thousand Kingdoms", "description": ["Yeine Darr is an outcast from the barbarian north. But when her mother dies under mysterious circumstances, she is summoned to the majestic city of Sky. There, to her shock, Yeine is named an heiress to the king. But the throne of the Hundred Thousand Kingdoms is not easily won, and Yeine is thrust into a vicious power struggle."], "author": "N.K. Jemisin", "num_pages": "427", "awards": ["Hugo Award Nominee for Best Novel (2011)", "Nebula Award Nominee for Best Novel (2010)", "Locus Award for Best First Novel (2011)", "World Fantasy Award Nominee for Best Novel (2011)", "Goodreads Choice Award Nominee for Fantasy (2010)", "James Tiptree Jr. Award Honor List (2010)", "Prix Elbakin.net for Meilleur roman fantasy traduit (2011)"], "places": [], "character_names": ["Dekarta Arameri", "Kinneth Arameri (post mortem)", "Yeine Darr/Arameri", "Scimina Arameri", "Relad Arameri", "Itempas", "Nahadoth", "Enefa ('post mortem')", "Sieh", "T'vril Arameri"], "language": "English", "publish_date": "2010-02-25 00:00:00", "ISBN": "0316043915"},
{"url": "https://www.goodreads.com/book/show/60925.Fledgling", "num_ratings": "15,020", "num_reviews": "2,109", "avg_ratings": 3.89, "genres": ["Fantasy", "Fiction", "Paranormal", "Vampires", "Science Fiction", "Horror", "Fantasy", "Paranormal", "Science Fiction Fantasy", "Speculative Fiction", "Fantasy", "Supernatural", "Fantasy", "Urban Fantasy"], "title": "Fledgling", "description": [", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wa", ", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wants - to destroy her and those she cares for and how she can save herself. ", " is a captivating novel that tests the limits of \"otherness\" and questions what it means to be truly human."], "author": "Octavia E. Butler", "num_pages": "320", "awards": ["Endeavour Award Nominee (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-02 00:00:00", "ISBN": "0446696161"},
{"url": "https://www.goodreads.com/book/show/60926.Lilith_s_Brood", "num_ratings": "11,394", "num_reviews": "844", "avg_ratings": 4.32, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Lilith's Brood", "description": ["Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny", "Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny, unimaginably alien creatures: their own children. This is their story..."], "author": "Octavia E. Butler", "num_pages": "746", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-01 00:00:00", "ISBN": "0446676101"},
{"url": "https://www.goodreads.com/book/show/52397.Parable_of_the_Sower", "num_ratings": "35,611", "num_reviews": "3,530", "avg_ratings": 4.15, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Apocalyptic", "Post Apocalyptic"], "title": "Parable of the Sower", "description": ["In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a cul", "In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a culture that has been destroyed by drugs, disease, war, and chronic water shortages. While her father tries to lead people on the righteous path, Lauren struggles with hyperempathy, a condition that makes her extraordinarily sensitive to the pain of others.", "When fire destroys their compound, Lauren’s family is killed and she is forced out into a world that is fraught with danger. With a handful of other refugees, Lauren must make her way north to safety, along the way conceiving a revolutionary idea that may mean salvation for all mankind."], "author": "Octavia E. Butler", "num_pages": "345", "awards": [], "places": ["California"], "character_names": ["Lauren Olamina"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0446675504"},
{"url": "https://www.goodreads.com/book/show/60929.Dawn", "num_ratings": "19,895", "num_reviews": "1,953", "avg_ratings": 4.11, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Dawn", "description": ["Lilith Iyapo has just lost her husband and son when atomic fire consumes Earth—the last stage of the planet’s final war. Hundreds of years later Lilith awakes, deep in the hold of a massive alien spacecraft piloted by the Oankali—who arrived just in time to save humanity from extinction. They have kept Lilith and other survivors asleep for centuries, as they learned whatev", "Lilith Iyapo has just lost her husband and son when atomic fire consumes Earth—the last stage of the planet’s final war. Hundreds of years later Lilith awakes, deep in the hold of a massive alien spacecraft piloted by the Oankali—who arrived just in time to save humanity from extinction. They have kept Lilith and other survivors asleep for centuries, as they learned whatever they could about Earth. Now it is time for Lilith to lead them back to her home world, but life among the Oankali on the newly resettled planet will be nothing like it was before.", "The Oankali survive by genetically merging with primitive civilizations—whether their new hosts like it or not. For the first time since the nuclear holocaust, Earth will be inhabited. Grass will grow, animals will run, and people will learn to survive the planet’s untamed wilderness. But their children will not be human. Not exactly."], "author": "Octavia E. Butler", "num_pages": "248", "awards": [], "places": [], "character_names": ["Lilith lyapo", "Ahajas", "Dichaan", "Tediin", "Nikanj", "Kahguyaht", "Peter Van Weerden", "Jean Pelerin", "Gabriel Rinaldi", "Curt Loehr", "Celene Ivers", "Ray Ordway", "Victor Dominic", "Beatrice Dwyer", "Allison Zeigler", "Hillary Ballard", "Jdahya", "Tate"], "language": "English", "publish_date": "1997-04-16 00:00:00", "ISBN": "0446603775"}
]