[
{"url": "https://www.goodreads.com/book/show/751635.The_Skin_I_m_In", "num_ratings": "11,822", "num_reviews": "1,533", "avg_ratings": 4.14, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Childrens", "Middle Grade", "Young Adult", "Teen"], "title": "The Skin I'm In", "description": ["Miss Saunders, whose skin is blotched with a rare skin condition, serves as a mirror to Maleeka Madison's struggle against the burden of low self-esteem that many black girls face when they're darker skinned. Miss Saunders is tough and through this, Maleeka learns to stand up to tough-talking Charlese."], "author": "Sharon G. Flake", "num_pages": "176", "awards": ["John Steptoe New Talent Author Award for Author (1999)", "California Young Readers Medal Nominee for Middle School/Junior High (2002)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0786813075"},
{"url": "https://www.goodreads.com/book/show/1995262.Baby_Girl", "num_ratings": "285", "num_reviews": "42", "avg_ratings": 4.16, "genres": ["Young Adult", "Cultural", "African American", "Fiction", "Realistic Fiction", "Urban"], "title": "Baby Girl", "description": [" ", " Sheree has always been a tough girl, able to take care of herself. Then she finds herself in a situation where she can't. She needs help. She needs answers. But she can't get either from the people she she turns t", " ", " Sheree has always been a tough girl, able to take care of herself. Then she finds herself in a situation where she can't. She needs help. She needs answers. But she can't get either from the people she she turns to -- her parents, her friends, and especially, her boyfriend, who calls her Baby Girl and treats her like she's disposable. ", " So who can Sheree turn to? Maybe the answer lies deep within herself, and it's truly time for her to grow up. ", " In a voice that rings strong ant true, debut novelist Lenora Adams tells a story that is rich, complex, and achingly real."], "author": "Lenora Adams", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-27 00:00:00", "ISBN": "1416925120"},
{"url": "https://www.goodreads.com/book/show/266655.Miracle_s_Boys", "num_ratings": "2,687", "num_reviews": "373", "avg_ratings": 3.9, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Cultural", "African American", "Young Adult", "Teen", "Childrens", "Middle Grade"], "title": "Miracle's Boys", "description": ["Nothing is like it used to be. If it were, Mama would still be alive. Papa wouldn't have died. Thirteen-year-old Lafayette's older brother, Charlie wouldn't have done time at a correctional facility. And oldest brother Ty'ree would have gone to college instead of having to work full time to support the three of them. If things were the same, Lafayette wouldn't be so full o", "Nothing is like it used to be. If it were, Mama would still be alive. Papa wouldn't have died. Thirteen-year-old Lafayette's older brother, Charlie wouldn't have done time at a correctional facility. And oldest brother Ty'ree would have gone to college instead of having to work full time to support the three of them. If things were the same, Lafayette wouldn't be so full of questions, like why Mama had to die, why Charlie hates him so much now, and how they're all supposed to survive these times together when so much seems to be set against them.", "This is the story of three remarkable young men; brothers who have only each other to rely on and who must decide whether they'll work with that or let it tear them apart."], "author": "Jacqueline Woodson", "num_pages": "144", "awards": ["Los Angeles Times Book Prize for Young Adult Literature (2000)", "Dorothy Canfield Fisher Children's Book Award Nominee (2002)", "Coretta Scott King Award for Author (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-06-08 00:00:00", "ISBN": "0142406023"},
{"url": "https://www.goodreads.com/book/show/11486.The_Color_Purple", "num_ratings": "435,722", "num_reviews": "11,087", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "295", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "0671727796"},
{"url": "https://www.goodreads.com/book/show/301753.Jason_Kyra", "num_ratings": "1,956", "num_reviews": "171", "avg_ratings": 4.21, "genres": ["Young Adult", "Romance", "Cultural", "African American", "Realistic Fiction", "Young Adult", "Teen", "Fiction"], "title": "Jason & Kyra", "description": ["Jason is a basketball star and one of the most popular guys in school. Brainy Kyra isn't, but she doesn't much care what other people think. Under normal circumstances, Jason and Kyra would live in their separate worlds until graduation. But fate intervenes, and the unlikely duo is paired up for a class project. Although preconceived notions abound on both sides, Kyra soon", "Jason is a basketball star and one of the most popular guys in school. Brainy Kyra isn't, but she doesn't much care what other people think. Under normal circumstances, Jason and Kyra would live in their separate worlds until graduation. But fate intervenes, and the unlikely duo is paired up for a class project. Although preconceived notions abound on both sides, Kyra soon realizes that Jason is not the dumb jock she anticipated. And Jason finds himself telling Kyra things he can't even tell his best friend. As the two become close and eventually start to fall in love, no one in school can believe it, especially Jason's ex-girlfriend, who is determined to get him back. Being together means navigating the obstacles that are coming their way-but staying apart may be impossible. Dana Davidson is a high school teacher who was the 2001 winner of the Newsweek WDIV Outstanding Teacher Award. This is her first book for young adults."], "author": "Dana  Davidson", "num_pages": "327", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-05-10 00:00:00", "ISBN": "0786818514"},
{"url": "https://www.goodreads.com/book/show/159903.If_You_Come_Softly", "num_ratings": "4,650", "num_reviews": "724", "avg_ratings": 3.99, "genres": ["Young Adult", "Romance", "Fiction", "Realistic Fiction", "Contemporary", "Cultural", "African American"], "title": "If You Come Softly", "description": ["Both Elisha (Ellie) and Jeremiah (Miah) attend Percy Academy, a private school where neither quite fits in. Ellie is wrestling with family demons, and Miah is one of the few African American students. The two of them find each other, and fall in love -- but they are hesitant to share their newfound happiness with their friends and families, who will not understand. At the", "Both Elisha (Ellie) and Jeremiah (Miah) attend Percy Academy, a private school where neither quite fits in. Ellie is wrestling with family demons, and Miah is one of the few African American students. The two of them find each other, and fall in love -- but they are hesitant to share their newfound happiness with their friends and families, who will not understand. At the end, life makes the brutal choice for them."], "author": "Jacqueline Woodson", "num_pages": "181", "awards": ["Maryland Black-Eyed Susan Book Award for High School (2002)", "Rhode Island Teen Book Award Nominee (2001)", "California Young Readers Medal Nominee for Young Adult (2001)"], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2006-06-22 00:00:00", "ISBN": "0142406015"},
{"url": "https://www.goodreads.com/book/show/272334.Feathers", "num_ratings": "5,475", "num_reviews": "1,033", "avg_ratings": 3.66, "genres": ["Young Adult", "Historical", "Historical Fiction", "Realistic Fiction", "Childrens", "Middle Grade", "Fiction"], "title": "Feathers", "description": ["\"Hope is the thing with feathers,\" starts the poem Frannie is reading in school. Frannie hasn't thought much about hope. There are so many other things to think about. Each day, her friend Samantha seems a bit more holy. There is a new boy in class everyone is calling the Jesus Boy. And although the new boy looks like a white kid, he says he is not white. Who is he?", "\"Hope is the thing with feathers,\" starts the poem Frannie is reading in school. Frannie hasn't thought much about hope. There are so many other things to think about. Each day, her friend Samantha seems a bit more holy.\u0094 There is a new boy in class everyone is calling the Jesus Boy. And although the new boy looks like a white kid, he says he\u0092 is not white. Who is he?"], "author": "Jacqueline Woodson", "num_pages": "118", "awards": ["Newbery Medal Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "0399239898"},
{"url": "https://www.goodreads.com/book/show/106393.The_Coldest_Winter_Ever", "num_ratings": "27,371", "num_reviews": "2,052", "avg_ratings": 4.48, "genres": ["Fiction", "Cultural", "African American", "Urban"], "title": "The Coldest Winter Ever", "description": ["The stunning national bestseller now features an illuminating discussion with Sister Souljah -- her secret thoughts on creating the story that has sold more than one million copies worldwide and introduced readers everywhere to the real ghetto experience. Here are answers to the questions fans", "The stunning national bestseller now features an illuminating discussion with Sister Souljah -- her secret thoughts on creating the story that has sold more than one million copies worldwide and introduced readers everywhere to the real ghetto experience. Here are answers to the questions fans everywhere have been asking; the meanings and inspirations behind such memorable characters as Winter, Midnight, and Santiaga; and insights into why and how Souljah conceived of one of the most powerful novels of our time."], "author": "Sister Souljah", "num_pages": "544", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "1416521690"},
{"url": "https://www.goodreads.com/book/show/517932.Day_of_Tears", "num_ratings": "3,184", "num_reviews": "577", "avg_ratings": 4.12, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Cultural", "African American", "Historical"], "title": "Day of Tears", "description": ["On March 2 and 3, 1859, the largest auction of slaves in American history took place in Savannah, Georgia. More than 400 slaves were sold. On the first day of the auction, the skies darkened and torrential rain began falling. The rain continued throughout the two days, stopping only when the auction had ended. The simultaneity of the rain storm with the auction led to thes", "On March 2 and 3, 1859, the largest auction of slaves in American history took place in Savannah, Georgia. More than 400 slaves were sold. On the first day of the auction, the skies darkened and torrential rain began falling. The rain continued throughout the two days, stopping only when the auction had ended. The simultaneity of the rain storm with the auction led to these two days being called \"the weeping time.\" Master storyteller Julius Lester has taken this footnote of history and created the crowning achievement of his literary career.", "Julius Lester tells the story of several characters including Emma, a slave owned by Pierce Butler and caretaker of his two daughters, and Pierce, a man with a mounting gambling debt and household to protect. Emma wants to teach his daughters-one who opposes slavery and one who supports it-to have kind hearts. Meanwhile, in a desperate bid to survive, Pierce decides to cash in his \"assets\" and host the largest slave auction in American history. And on that day, the skies open up and weep endlessly on the proceedings below.", "Using the multiple voices of enslaved Africans ", " their owners, Julius Lester has taken a little-known, all-true event in American history and transformed it into a heartbreaking and powerfully dramatic epic on slavery, and the struggle to affirm humanity in the midst of it."], "author": "Julius Lester", "num_pages": "192", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (2007)", "Coretta Scott King Award for Author (2006)", "California Young Readers Medal Nominee for Middle School/Junior High (2008)"], "places": ["Savannah, Georgia"], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "1423104099"},
{"url": "https://www.goodreads.com/book/show/266663.The_Battle_of_Jericho", "num_ratings": "3,435", "num_reviews": "373", "avg_ratings": 4.14, "genres": ["Young Adult", "Realistic Fiction", "Young Adult", "Teen", "Fiction"], "title": "The Battle of Jericho", "description": [" ", " Sixteen-year-old Jericho is psyched when he and his cousin and best friend, Josh, are invited to pledge for the Warriors of Distinction, the oldest and most exclusive club in school. Just being a pledge wins him the attention of Arielle, one of the hottest girls in his class, whom he's been too shy even to ", " to before now. ", " But as the secret initiation r", " ", " Sixteen-year-old Jericho is psyched when he and his cousin and best friend, Josh, are invited to pledge for the Warriors of Distinction, the oldest and most exclusive club in school. Just being a pledge wins him the attention of Arielle, one of the hottest girls in his class, whom he's been too shy even to ", " to before now. ", " But as the secret initiation rites grow increasingly humiliating and force Jericho to make painful choices, he starts to question whether membership in the Warriors of Distinction is worth it. How far will he have to go to wear the cool black silk Warriors jacket? How high a price will he have to pay to belong? The answers are devastating beyond Jericho's imagination."], "author": "Sharon M. Draper", "num_pages": "352", "awards": ["Coretta Scott King Award for Author Honor (2004)", "Lincoln Award Nominee (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "0689842333"},
{"url": "https://www.goodreads.com/book/show/2821648-lady-j", "num_ratings": "1,508", "num_reviews": "54", "avg_ratings": 4.62, "genres": ["Cultural", "African American", "Drama"], "title": "Lady J", "description": ["For South Bay High's bold, beautiful Jayd Jackson, drama has reached record-breaking heights as she finds herself on the defensive at home, work, and school. Maybe it's time to take her destiny--and her power--into her own hands. . .", "Her relationship with now-ex boyfriend Jeremy behind her, Jayd realizes drama is just a never-ending part of daily life. Even so, she's reache", "For South Bay High's bold, beautiful Jayd Jackson, drama has reached record-breaking heights as she finds herself on the defensive at home, work, and school. Maybe it's time to take her destiny--and her power--into her own hands. . .", "Her relationship with now-ex boyfriend Jeremy behind her, Jayd realizes drama is just a never-ending part of daily life. Even so, she's reached her limit, battling with her new boss, jealousies at school, and tensions at home. To deal with it all, Jayd is ready to give some attention to her legacy as one in a long line of conjure women. But that legacy comes with a line of rivals too--and a couple of them are much too close to home.", "First, there's Misty, Jayd's enemy #1 and current girlfriend of Jayd's other ex, KJ. Then there's Jayd's neighbor, Esmeralda, a conjurer from Louisiana whose crystal-clear blue eyes are said to be deadly. When Jayd spots Misty's mom visiting Esmeralda, she knows something's up and it's time for Mama to fill her in. Turns out there's a history between these families, and if Jayd wants to keep the drama under control, she'll have to learn to use her power like never before--and become the woman she was born to be."], "author": "L. Divine", "num_pages": "214", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "0758225342"},
{"url": "https://www.goodreads.com/book/show/72441.Bronx_Masquerade", "num_ratings": "5,848", "num_reviews": "835", "avg_ratings": 3.95, "genres": ["Young Adult", "Poetry", "Realistic Fiction", "Fiction", "Young Adult", "Teen", "Cultural"], "title": "Bronx Masquerade", "description": ["When Wesley Boone writes a poem for his high school English class, some of his classmates clamor to read their poems aloud too. Soon they're having weekly poetry sessions and, one by one, the eighteen students are opening up and taking on the risky challenge of self-revelation. There's Lupe Alvarin, desperate to have a baby so she will feel loved. Raynard Patterson, hiding", "When Wesley Boone writes a poem for his high school English class, some of his classmates clamor to read their poems aloud too. Soon they're having weekly poetry sessions and, one by one, the eighteen students are opening up and taking on the risky challenge of self-revelation. There's Lupe Alvarin, desperate to have a baby so she will feel loved. Raynard Patterson, hiding a secret behind his silence. Porscha Johnson, needing an outlet for her anger after her mother OD's. Through the poetry they share and narratives in which they reveal their most intimate thoughts about themselves and one another, their words and lives show what lies beneath the skin, behind the eyes, beyond the masquerade."], "author": "Nikki Grimes", "num_pages": "167", "awards": ["Coretta Scott King Award for Author (2003)", "California Young Readers Medal Nominee for Young Adult (2005)", "Lincoln Award Nominee (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-12-29 00:00:00", "ISBN": "0142501891"},
{"url": "https://www.goodreads.com/book/show/32075671-the-hate-u-give", "num_ratings": "170,749", "num_reviews": "28,706", "avg_ratings": 4.56, "genres": ["Young Adult", "Contemporary", "Fiction", "Realistic Fiction"], "title": "The Hate U Give", "description": ["Sixteen-year-old Starr Carter moves between two worlds: the poor neighborhood where she lives and the fancy suburban prep school she attends. The uneasy balance between these worlds is shattered when Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Khalil was unarmed.", "Soon afterward, his death is a national headline. S", "Sixteen-year-old Starr Carter moves between two worlds: the poor neighborhood where she lives and the fancy suburban prep school she attends. The uneasy balance between these worlds is shattered when Starr witnesses the fatal shooting of her childhood best friend Khalil at the hands of a police officer. Khalil was unarmed.", "Soon afterward, his death is a national headline. Some are calling him a thug, maybe even a drug dealer and a gangbanger. Protesters are taking to the streets in Khalil's name. Some cops and the local drug lord try to intimidate Starr and her family. What everyone wants to know is: what ", " went down that night? And the only person alive who can answer that is Starr.", "But what Starr does or does not say could upend her community. It could also endanger her life."], "author": "Angie Thomas", "num_pages": "453", "awards": ["National Book Award Nominee for Young People's Literature (2017)", "Odyssey Award (2018)", "Los Angeles Times Book Prize Nominee for Young Adult Literature (2017)", "Edgar Award Nominee for Best Young Adult (2018)", "Coretta Scott King Award Nominee for Author Honor (2018)", "Boston Globe-Horn Book Award for Fiction (2017)", "Lincoln Award Nominee (2019)", "Kirkus Prize Nominee for Young Readers' Literature (2017)", "Goodreads Choice Award for Young Adult Fiction & for Debut Goodreads Author (2017)", "Carnegie Medal Nominee (2018)", "NAACP Image Award Nominee for Youth/Teens (2018)", "Michael L. Printz Honor Award (2018)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2017-02-28 00:00:00", "ISBN": "0062498533"},
{"url": "https://www.goodreads.com/book/show/272393.Heaven", "num_ratings": "2,233", "num_reviews": "228", "avg_ratings": 3.58, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Young Adult", "Teen", "Childrens", "Middle Grade"], "title": "Heaven", "description": ["Marley has lived in Heaven since she was two years old, when her mother found a postcard postmarked HEAVEN, OH on a park bench and decided that was where she wanted to raise her family. ", " And for twelve years, Marley's hometown has lived up to its name. She lives in a house by the river, has loving parents, a funny younger brother, good friends, and receives frequent letter", "Marley has lived in Heaven since she was two years old, when her mother found a postcard postmarked HEAVEN, OH on a park bench and decided that was where she wanted to raise her family. ", " And for twelve years, Marley's hometown has lived up to its name. She lives in a house by the river, has loving parents, a funny younger brother, good friends, and receives frequent letters from her mysterious Uncle Jack. Then one day a letter arrives form Alabama, and Marley's life is turned upside down. Marley doesn't even know who she is anymore -- but where can she go for answers, when she's been deceived by the very people she should be able to trust the most?"], "author": "Angela Johnson", "num_pages": "144", "awards": ["Coretta Scott King Award for Author (1999)"], "places": ["Ohio"], "character_names": [], "language": "English", "publish_date": "2000-08-01 00:00:00", "ISBN": "0689822901"},
{"url": "https://www.goodreads.com/book/show/111011.Darkness_Before_Dawn", "num_ratings": "4,736", "num_reviews": "404", "avg_ratings": 4.29, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American"], "title": "Darkness Before Dawn", "description": ["He's a \"lemon drop wrapped in licorice\": tall, dark, handsome, and as smooth as his silk shirts and leather jacket. He can discuss everything from art to world events, he's traveled the world, and he owns a Jeep, a condo, and a jazz CD collection. But best of all, twenty-three-year-old Jonathan Hathaway, the new track coach and the principal's son, has his golden eyes set", "He's a \"lemon drop wrapped in licorice\": tall, dark, handsome, and as smooth as his silk shirts and leather jacket. He can discuss everything from art to world events, he's traveled the world, and he owns a Jeep, a condo, and a jazz CD collection. But best of all, twenty-three-year-old Jonathan Hathaway, the new track coach and the principal's son, has his golden eyes set on Keisha Montgomery. In her senior year of high school, still recovering from the suicide of her ex-boyfriend, Keisha's thrilled to have someone treat her like a woman rather than a girl. As Jonathan tells her, she's a butterfly ready to try her wings -- much too mature for high school boys, whose only deep thoughts are words from rap songs. Jonathan makes her feel alive again; he seems like the answer to all her dreams and the cure to all her nightmares.", "Gifts wrapped with silver ribbons begin to mysteriously appear on her doorstep, and Keisha is swept off her feet. But events take a terrifying turn, and suddenly darkness overwhelms her life.... As Keisha struggles to put her world back in perspective, she learns the power and the danger of silence, and discovers the secret gifts that had been waiting for her all along."], "author": "Sharon M. Draper", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-01 00:00:00", "ISBN": "0689851340"},
{"url": "https://www.goodreads.com/book/show/481912.Who_Am_I_Without_Him_", "num_ratings": "1,854", "num_reviews": "324", "avg_ratings": 4.14, "genres": ["Young Adult", "Short Stories", "Realistic Fiction", "Fiction", "Cultural", "African American", "Romance", "Young Adult", "Teen"], "title": "Who Am I Without Him?: A Short Story Collection about Girls and Boys in Their Lives", "description": ["There is \"The Ugly One,\" whose only solace comes when she is locked inside her own head. In \"Wanted: A Thug,\" a teenager seeks advice on how to steal her best friend's bad-guy boyfriend. And then there's Erika, who only likes white boys. Sharon Flake takes readers through the minds of girls trying to define themselves while struggling to remain relevant to the boys in thei", "There is \"The Ugly One,\" whose only solace comes when she is locked inside her own head. In \"Wanted: A Thug,\" a teenager seeks advice on how to steal her best friend's bad-guy boyfriend. And then there's Erika, who only likes white boys. Sharon Flake takes readers through the minds of girls trying to define themselves while struggling to remain relevant to the boys in their lives. This is a complex, often humorous, always on-point exposition of black youth resolving to find self-worth . . . any way they know how."], "author": "Sharon G. Flake", "num_pages": "168", "awards": ["Coretta Scott King Award for Author Honor (2005)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "0786806931"},
{"url": "https://www.goodreads.com/book/show/402056.Belle_and_the_Beau", "num_ratings": "1,002", "num_reviews": "63", "avg_ratings": 4.16, "genres": ["Romance", "Young Adult", "Historical", "Historical Fiction", "Romance", "Historical Romance", "Historical", "Fiction", "Cultural", "African American", "Womens Fiction", "Chick Lit", "Young Adult", "Teen", "Romance", "African American Romance"], "title": "Belle and the Beau", "description": ["BelleAfter a grueling escape north, Belle Palmer is free, yet lost and alone. Separated from her father on the harrowing journey, Belle has nowhere to turn until she finds shelter with the Bests, the first free family she's ever known. For the first time in her sixteen years, Belle is able to express herself freely-except where her feelings for a certain dark-eyed young ma", "BelleAfter a grueling escape north, Belle Palmer is free, yet lost and alone. Separated from her father on the harrowing journey, Belle has nowhere to turn until she finds shelter with the Bests, the first free family she's ever known. For the first time in her sixteen years, Belle is able to express herself freely-except where her feelings for a certain dark-eyed young man are concerned.The Beau", "Daniel Best is headed for great things. Educated and handsome, at eighteen he is full of the promise and dream of his people, and is engaged to the prettiest (if the most spoiled) girl around. So when a bedraggled stranger arrives in his household and turns into a vibrant, lovely young woman, his attraction to her catches him entirely by surprise.", "While Belle is determined to deny her feelings for him, Daniel is caught between his conscience and his infatuation with her. That the two belong together is undeniable, but that it could ever happen seems impossible."], "author": "Beverly Jenkins", "num_pages": "296", "awards": [], "places": ["United States of America"], "character_names": ["Belle Palmer", "Daniel Best"], "language": "English", "publish_date": "2002-04-30 00:00:00", "ISBN": "0064473422"},
{"url": "https://www.goodreads.com/book/show/60931.Kindred", "num_ratings": "60,626", "num_reviews": "7,284", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Science Fiction", "Fantasy", "Science Fiction", "Time Travel"], "title": "Kindred", "description": ["The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into ante", "The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into antebellum Maryland. After saving a drowning white boy there, she finds herself staring into the barrel of a shotgun and is transported back to the present just in time to save her life. During numerous such time-defying episodes with the same young man, she realizes the challenge she’s been given: to protect this young slaveholder until he can father her own great-grandmother."], "author": "Octavia E. Butler", "num_pages": "287", "awards": [], "places": ["Maryland", "Altadena, California"], "character_names": ["Dana Franklin", "Kevin Franklin", "Rufus Weylin", "Tom Weylin", "Margaret Weylin", "Alice Greenwood"], "language": "English", "publish_date": "2004-02-01 00:00:00", "ISBN": "0807083690"},
{"url": "https://www.goodreads.com/book/show/6666385-the-clone-codes", "num_ratings": "1,577", "num_reviews": "299", "avg_ratings": 3.55, "genres": ["Science Fiction", "Young Adult", "Science Fiction", "Dystopia", "Fantasy"], "title": "The Clone Codes", "description": ["In the year 2170 an underground abolitionist movement fights for the freedom of cyborgs and clones, who are treated no better than slaves", "The Cyborg Wars are over and Earth has peacefully prospered for more than one hundred years. Yet sometimes history must repeat itself until humanity learns from its mistakes. In the year 2170, despite technological and political advances,", "In the year 2170 an underground abolitionist movement fights for the freedom of cyborgs and clones, who are treated no better than slaves", "The Cyborg Wars are over and Earth has peacefully prospered for more than one hundred years. Yet sometimes history must repeat itself until humanity learns from its mistakes. In the year 2170, despite technological and political advances, cyborgs and clones are treated no better than slaves, and an underground abolitionist movement is fighting for freedom. Thirteen-year-old Leanna's entire life is thrown into chaos when The World Federation of Nations discovers her mom is part of the radical Liberty Bell Movement."], "author": "Patricia C. McKissack", "num_pages": "192", "awards": ["Iowa Children's Choice Award Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-02-01 00:00:00", "ISBN": "0439929830"},
{"url": "https://www.goodreads.com/book/show/20517379-how-it-went-down", "num_ratings": "4,695", "num_reviews": "918", "avg_ratings": 3.94, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Contemporary", "Cultural", "African American", "Young Adult", "Teen"], "title": "How It Went Down", "description": ["When sixteen-year-old Tariq Johnson dies from two gunshot wounds, his community is thrown into an uproar. Tariq was black. The shooter, Jack Franklin, is white.", "In the aftermath of Tariq's death, everyone has something to say, but no two accounts of the events line up. Day by day, new twists further obscure the truth.", "Tariq's friends, family, and community struggle to make s", "When sixteen-year-old Tariq Johnson dies from two gunshot wounds, his community is thrown into an uproar. Tariq was black. The shooter, Jack Franklin, is white.", "In the aftermath of Tariq's death, everyone has something to say, but no two accounts of the events line up. Day by day, new twists further obscure the truth.", "Tariq's friends, family, and community struggle to make sense of the tragedy, and to cope with the hole left behind when a life is cut short. In their own words, they grapple for a way to say with certainty: This is how it went down."], "author": "Kekla Magoon", "num_pages": "336", "awards": ["Coretta Scott King Award for Author Honor (2015)", "The Magnolia Award Nominee for 9-12 (2017)", "In the Margins Award for Top Fiction Award (2015)"], "places": [], "character_names": [], "language": null, "publish_date": "2014-10-21 00:00:00", "ISBN": "1627791590"},
{"url": "https://www.goodreads.com/book/show/11341277-tankborn", "num_ratings": "1,386", "num_reviews": "233", "avg_ratings": 3.67, "genres": ["Science Fiction", "Dystopia", "Fantasy", "Science Fiction", "Romance", "Young Adult", "Fiction"], "title": "Tankborn", "description": ["Best friends Kayla and Mishalla know they will be separated for their Assignments. They are GENs, Genetically Engineered Non-humans, and in their strict caste system, GENs are at the bottom rung of society. GENs are gestated in a tank and sent to work as slaves as soon as they reach age fifteen.", "When Kayla is Assigned to care for Zul Manel, the patriarch of a trueborn famil", "Best friends Kayla and Mishalla know they will be separated for their Assignments. They are GENs, Genetically Engineered Non-humans, and in their strict caste system, GENs are at the bottom rung of society. GENs are gestated in a tank and sent to work as slaves as soon as they reach age fifteen.", "When Kayla is Assigned to care for Zul Manel, the patriarch of a trueborn family, she finds secrets and surprises; not least of which is her unexpected friendship with Zul's great-grandson. Meanwhile, the children that Mishalla is Assigned to care for are being stolen in the middle of the night. ", "After weeks of toiling in their Assignments, mystifying circumstances enable Kayla and Mishalla to reunite. Together they hatch a plan to save the disappearing children. Yet can GENs really trust humans? Both girls must put their lives and hearts at risk to crack open a sinister conspiracy, revealing secrets no one is ready to face."], "author": "Karen Sandler", "num_pages": "373", "awards": ["Golden Duck Award Nominee for Hal Clement Award for Young Adult (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-01 00:00:00", "ISBN": "1600606628"},
{"url": "https://www.goodreads.com/book/show/17201817-the-battle-for-jericho", "num_ratings": "93", "num_reviews": "19", "avg_ratings": 3.89, "genres": ["Young Adult", "Romance", "M M Romance", "Contemporary", "Romance", "Glbt", "Queer"], "title": "The Battle for Jericho", "description": ["A battle is brewing in the conservative little town of Webster’s Glen. Gay activist Dylan Cussler stirs up the establishment when he moves in with his boyfriend and sues the state over its gay adoption ban. Sixteen-year-old Jericho Jiles and his best friend, Mac Travis, decide to do their bit to convince Dylan and his boyfriend to leave town. But when Dylan turns up before", "A battle is brewing in the conservative little town of Webster’s Glen. Gay activist Dylan Cussler stirs up the establishment when he moves in with his boyfriend and sues the state over its gay adoption ban. Sixteen-year-old Jericho Jiles and his best friend, Mac Travis, decide to do their bit to convince Dylan and his boyfriend to leave town. But when Dylan turns up before they can finish trashing his house, Jericho panics, leaving Dylan unconscious and wounded.", "Drowning in guilt, Jericho returns to Dylan’s home to make amends. He is surprised when Dylan forgives him and opens his eyes to the world around him. Soon Jericho comes to a life-changing realization: he is attracted to boys as well as girls. That’s a problem, considering Jericho has a girlfriend and very strict, very religious parents. Accepting his sexuality means he must question not only his identity and his place in the world but his relationship with his girlfriend, his parents, and with God.", "And so begins the battle for Jericho’s soul."], "author": "Gene Gant", "num_pages": "240", "awards": [], "places": ["Webster's Glen, Tennessee"], "character_names": [], "language": null, "publish_date": "2013-01-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/357598.The_Bully", "num_ratings": "5,343", "num_reviews": "777", "avg_ratings": 4.3, "genres": ["Young Adult", "Realistic Fiction", "Fiction"], "title": "The Bully", "description": ["Welcome to Bluford High. This widely acclaimed teen series set in an urban high school features engaging, accessible writing and appealing, contemporary storylines. A new life. An new school. A new bully. That's what Darrell Mercer faces when he and his mother move from Philadelphia to California. After spending months living in fear, Darrell is faced with a big decision.", "Welcome to Bluford High. This widely acclaimed teen series set in an urban high school features engaging, accessible writing and appealing, contemporary storylines. A new life. An new school. A new bully. That's what Darrell Mercer faces when he and his mother move from Philadelphia to California. After spending months living in fear, Darrell is faced with a big decision. He can either keep running from this bully--or find some way to fight back."], "author": "Paul Langan", "num_pages": "190", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-12-01 00:00:00", "ISBN": "0944210007"},
{"url": "https://www.goodreads.com/book/show/18240237-the-freedom-maze", "num_ratings": "754", "num_reviews": "211", "avg_ratings": 3.85, "genres": ["Historical", "Historical Fiction", "Fantasy", "Young Adult", "Science Fiction", "Time Travel", "Childrens", "Middle Grade", "Fiction", "Historical", "Childrens"], "title": "The Freedom Maze", "description": ["Thirteen-year-old Sophie isn’t happy about spending the summer of 1960 at her grandmother’s old house in the bayou. Bored and lonely, she can’t resist exploring the house’s maze, or making an impulsive wish for a fantasy-book adventure with herself as the heroine. What she gets instead is a real adventure: a trip back in time to 1860 and the race-haunted world of her famil", "Thirteen-year-old Sophie isn’t happy about spending the summer of 1960 at her grandmother’s old house in the bayou. Bored and lonely, she can’t resist exploring the house’s maze, or making an impulsive wish for a fantasy-book adventure with herself as the heroine. What she gets instead is a real adventure: a trip back in time to 1860 and the race-haunted world of her family’s Louisiana sugar plantation. Here, President Lincoln’s Emancipation Proclamation is still two years in the future and passage of the Thirteenth Amendment is almost four years away. And here, Sophie is mistaken, by her own ancestors, for a slave."], "author": "Delia Sherman", "num_pages": "272", "awards": ["Mythopoeic Fantasy Award for Children's Literature (2012)", "Andre Norton Award for Young Adult Science Fiction and Fantasy (2011)", "James Tiptree Jr. Award Honor List (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00", "ISBN": "076366975X"},
{"url": "https://www.goodreads.com/book/show/3002300-chains", "num_ratings": "39,414", "num_reviews": "4,691", "avg_ratings": 4.09, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Childrens", "Middle Grade"], "title": "Chains", "description": ["As the Revolutionary War begins, thirteen-year-old Isabel wages her own fight...for freedom. Promised freedom upon the death of their owner, she and her sister, Ruth, in a cruel twist of fate become the property of a malicious New York City couple, the Locktons, who have no sympathy for the American Revolution and even less for Ruth and Isabel. When Isabel meets Curzon, a", "As the Revolutionary War begins, thirteen-year-old Isabel wages her own fight...for freedom. Promised freedom upon the death of their owner, she and her sister, Ruth, in a cruel twist of fate become the property of a malicious New York City couple, the Locktons, who have no sympathy for the American Revolution and even less for Ruth and Isabel. When Isabel meets Curzon, a slave with ties to the Patriots, he encourages her to spy on her owners, who know details of British plans for invasion. She is reluctant at first, but when the unthinkable happens to Ruth, Isabel realizes her loyalty is available to the bidder who can provide her with freedom. ", "  Format: Hardcover \n   Publication Date: 10/21/2008 \n   Pages: 320 \n   Reading Level: Age 10 and Up \n "], "author": "Laurie Halse Anderson", "num_pages": "316", "awards": ["Scott O'Dell Award (2009)", "South Carolina Book Award Nominee for Junior Book Award (2011)", "Missouri Truman Readers Award Nominee (2011)", "Cybils Award for Middle Grade Fiction (2009)", "National Book Award Finalist for Young People's Literature (2008)", "Carnegie Medal Nominee (2010)", "Rebecca Caudill Young Readers' Book Award Nominee (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-10-21 00:00:00", "ISBN": "1416905855"},
{"url": "https://www.goodreads.com/book/show/35295473-a-butler-christmas", "num_ratings": "29", "num_reviews": "17", "avg_ratings": 4.69, "genres": ["Romance", "Holiday", "Holiday", "Christmas"], "title": "A Butler Christmas", "description": ["\"Brooks’s clunky first Naim Butler contemporary romantic thriller has strong characters...The well-developed relationships among the characters propel the story until the addition of suspense very late in the book...\"--Publishers Weekly", "Naim Butler, a rainmaker, has perfected the art of sentencing mitigation, as a partner with Manhattan power-firm, Baker and Keefe. He's the", "\"Brooks’s clunky first Naim Butler contemporary romantic thriller has strong characters...The well-developed relationships among the characters propel the story until the addition of suspense very late in the book...\"--Publishers Weekly", "Naim Butler, a rainmaker, has perfected the art of sentencing mitigation, as a partner with Manhattan power-firm, Baker and Keefe. He's the kind of captivating and accomplished man that therapists vent too. His bachelorhood is turned upside down when an old flame, Sinia Love, drops a seventeen-year-old son into his lap forcing him to balance this revelation and his budding romance with Brandy Scott. ", "Professionally, Naim's assigned to prove a man's innocence of murder is filthy work itself, but catastrophic when an envious lover of Sinia Love's sets out to kill him while hiding amongst the glitterati of Manhattan's upper crust."], "author": "Rahiem Brooks", "num_pages": "278", "awards": [], "places": ["New York City's Upper East Side"], "character_names": [], "language": "English", "publish_date": "2017-12-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/15799010-courage-has-no-color", "num_ratings": "2,121", "num_reviews": "332", "avg_ratings": 3.99, "genres": ["Nonfiction", "History", "Cultural", "African American", "War", "War", "World War II"], "title": "Courage Has No Color: The True Story of the Triple Nickles, America's First Black Paratroopers", "description": ["They became America’s first black paratroopers. Why was their story never told? Sibert Medalist Tanya Lee Stone reveals the history of the Triple Nickles during World War II.", "World War II is raging, and thousands of American soldiers are fighting overseas against the injustices brought on by Hitler. Back on the home front, the injustice of discrimination against African Ame", "They became America’s first black paratroopers. Why was their story never told? Sibert Medalist Tanya Lee Stone reveals the history of the Triple Nickles during World War II.", "World War II is raging, and thousands of American soldiers are fighting overseas against the injustices brought on by Hitler. Back on the home front, the injustice of discrimination against African Americans plays out as much on Main Street as in the military. Enlisted black men are segregated from white soldiers and regularly relegated to service duties. At Fort Benning, Georgia, First Sergeant Walter Morris’s men serve as guards at The Parachute School, while the white soldiers prepare to be paratroopers. Morris knows that for his men to be treated like soldiers, they have to train and act like them, but would the military elite and politicians recognize the potential of these men as well as their passion for serving their country? Tanya Lee Stone examines the role of African Americans in the military through the history of the Triple Nickles, America’s first black paratroopers, who fought in a little-known attack on the American West by the Japanese. The 555th Parachute Infantry Battalion, in the words of Morris, \"proved that the color of a man had nothing to do with his ability.\"", "From ", "What did it take to be a paratrooper in World War II? Specialized training, extreme physical fitness, courage, and — until the 555th Parachute Infantry Battalion (the Triple Nickles) was formed — white skin.", "It is 1943. Americans are overseas fighting World War II to help keep the world safe from Adolf Hitler’s tyranny, safe from injustice, safe from discrimination. Yet right here at home, people with white skin have rights that people with black skin do not.", "What is courage? What is strength? Perhaps it is being ready to fight for your nation even when your nation isn’t ready to fight for you."], "author": "Tanya Lee Stone", "num_pages": "160", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Grades 6-8 (2016)", "YALSA Award Nominee for Excellence in Nonfiction (2014)", "NCTE Orbis Pictus Honor Book (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-22 00:00:00", "ISBN": "0763651176"},
{"url": "https://www.goodreads.com/book/show/1175905.My_Bondage_and_My_Freedom", "num_ratings": "9,021", "num_reviews": "208", "avg_ratings": 4.32, "genres": ["History", "Biography", "Nonfiction", "Classics", "Autobiography", "Memoir"], "title": "My Bondage and My Freedom", "description": [", by ", ", is part of the ", "series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of ", ":", "New introductions commissio", ", by ", ", is part of the ", "series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of ", ":", "New introductions commissioned from today's top writers and scholars", "Biographies of the authors", "Chronologies of contemporary historical, biographical, and cultural events", "Footnotes and endnotes", "Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work", "Comments by other famous authors", "Study questions to challenge the reader's viewpoints and expectations", "Bibliographies for further reading", "Indices & Glossaries, when appropriate", "All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. ", "pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.", " ", "Born a slave, ", " educated himself, escaped, and became one of the greatest social leaders in American history. Although usually identified with the monumental ", ", Douglass produced two additional autobiographies, the second of which he called ", ".", "A richer, deeper, and far more ambiguous work than the earlier ", ", ", " reveals Douglass’s increased intellectual sophistication and maturity. In the decade that had elapsed since Douglass wrote", ", he had broken away from his antislavery mentors, successfully toured England, and established himself as an inspired speaker and writer. With the publication of ", " in 1855, Douglass became the country’s foremost spokesman for American blacks—free and enslaved—during the tense and politically charged years preceding the Civil War.", "One of the highlights of ", " is the appendix, which contains excerpts from several of Douglass’s speeches, including perhaps his most famous, “What to the Slave Is the Fourth of July?”", " is Associate Professor in the Department of English at Rutgers University. He is the author of ", " (Harvard University Press, 2003) and of numerous articles on twentieth-century African-American literature, contemporary poetry, Francophone Caribbean literature, surrealism, and jazz."], "author": "Frederick Douglass", "num_pages": "432", "awards": [], "places": [], "character_names": ["Frederick Douglass", "Henry Harris"], "language": "English", "publish_date": "2005-01-30 00:00:00", "ISBN": "1593083017"},
{"url": "https://www.goodreads.com/book/show/815441.Emako_Blue", "num_ratings": "689", "num_reviews": "108", "avg_ratings": 4.14, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Childrens", "Middle Grade", "Urban"], "title": "Emako Blue", "description": ["Emako Blue was supposed to be a star. She was beautiful and good-hearted. She was Monterey's best friend. She was the only girl Jamal cared about, the one who saw through his player act. She was the one who understood the burden of Eddie's family. She was the best singer anyone had ever heard, with a voice like vanilla incense, smoky and sweet. She was Savannah's rival, th", "Emako Blue was supposed to be a star. She was beautiful and good-hearted. She was Monterey's best friend. She was the only girl Jamal cared about, the one who saw through his player act. She was the one who understood the burden of Eddie's family. She was the best singer anyone had ever heard, with a voice like vanilla incense, smoky and sweet. She was Savannah's rival, the one who wouldn't play by the rules. She was destined for greatness, already plucked from South Central Los Angeles by the record producers. She was only fifteen when she died."], "author": "Brenda Woods", "num_pages": "128", "awards": ["IRA Children’s and Young Adult’s Book Award for Young Adult–Fiction (2005)", "California Young Readers Medal Nominee for Young Adult (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-12-29 00:00:00", "ISBN": "0142404187"},
{"url": "https://www.goodreads.com/book/show/712218.Nothing_But_Drama", "num_ratings": "296", "num_reviews": "33", "avg_ratings": 4.27, "genres": ["Young Adult", "Christian", "Christian Fiction", "Contemporary"], "title": "Nothing But Drama", "author": "ReShonda Tate Billingsley", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-07 00:00:00", "ISBN": "1416525602"},
{"url": "https://www.goodreads.com/book/show/793777.With_Friends_Like_These", "num_ratings": "142", "num_reviews": "7", "avg_ratings": 4.32, "genres": ["Young Adult", "Christian Fiction", "Christian", "Inspirational"], "title": "With Friends Like These", "description": ["The third book in an exciting and inspiring new series from national bestselling author ReShonda Tate Billingsley ", " ", " In the year since Camille, Alexis, Jasmine, and Angel joined Rachel Jackson's church youth group, the four best friends have bonded over boys, pitched in on community projects, and shared their deepest secrets. There's nothing", "The third book in an exciting and inspiring new series from national bestselling author ReShonda Tate Billingsley ", " ", " In the year since Camille, Alexis, Jasmine, and Angel joined Rachel Jackson's church youth group, the four best friends have bonded over boys, pitched in on community projects, and shared their deepest secrets. There's nothing they don't know about each other -- or is there? When a special guest arrives at Rachel's group and announces auditions for a television talk show, the girls will come to know a side of each other they never knew existed. And they may not like what they see. ", " ", " The race to find the perfect host for KRCP's ", " is heating up -- the competition is fierce, and so are the lies the girlfriends tell about each other in order to win the coveted spot. But more painful than any lies they can concoct is the cold, hard truth: none of them will reach their ultimate dreams if cutting each other down is how they choose to get ahead. Is winning a place in the spotlight worth losing their friendship? ", " Includes a reader's group guide! ", " Be sure to read the previous novels in ReShonda Tate Billingsley's fresh and fun series that looks at the Ten Commandments in a whole new light: ", " and ", " -- now available! ", " is a general assignment reporter for KRIV-TV, the Fox affiliate in Houston, Texas. She is the author of the nonfiction book ", " and three previous adult novels: ", ", for which she received the prestigious Gold Pen Award for Best New Author from the Black Writer's Alliance and the Nova Lee Nation Award from the Greater Dallas Writing Association; the national bestseller ", ", chosen for Library Journal's Best of 2004 list for Christian fiction; and ", ", a Main Selection of the Black Expressions Book Club. Her previous Christian teen novels are ", " and ", ", both available from Pocket Books. She is also a contributor to the story anthology ", ". Visit her website at ", "."], "author": "ReShonda Tate Billingsley", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-10 00:00:00", "ISBN": "1416525629"},
{"url": "https://www.goodreads.com/book/show/1460287.Sweet_Thang", "num_ratings": "57", "num_reviews": "8", "avg_ratings": 3.89, "genres": ["Historical", "Young Adult", "Fiction", "Womens Fiction", "Chick Lit", "Cultural", "African American"], "title": "Sweet Thang", "description": ["Growing up in Philadelphia in 1975, 14-year-old Charmaine Upshaw is obsessed with justice. Unfortunately, she gets none of it in her life: not from her parents, who make her share a room with her tap-dancing brother Leo; not at school, where light-skinned, Barbie-doll-haired Dinah Coverdale steals all the boys’ attention and makes sure dark-skinned Charmaine knows it; and", "Growing up in Philadelphia in 1975, 14-year-old Charmaine Upshaw is obsessed with justice. Unfortunately, she gets none of it in her life: not from her parents, who make her share a room with her tap-dancing brother Leo; not at school, where light-skinned, Barbie-doll-haired Dinah Coverdale steals all the boys’ attention and makes sure dark-skinned Charmaine knows it; and certainly not from Tracy John, her six-year-old cousin who’s taken over the family. When Charmaine is charged with babysitting her spoiled cousin after school, that’s the last straw–something’s gotta give. And when Charmaine cracks, she starts to see the world in a whole new light. Can Charmaine learn to love herself, her mahogany skin, and her attention-starved little cousin? Sometimes when everything falls apart, putting it back together can help you see the truth."], "author": "Allison Whittenberg", "num_pages": "149", "awards": [], "places": ["Philadelphia, Pennsylvania"], "character_names": [], "language": "English", "publish_date": "2009-01-16 00:00:00", "ISBN": "0440420865"},
{"url": "https://www.goodreads.com/book/show/2327727.Getting_Even", "num_ratings": "138", "num_reviews": "11", "avg_ratings": 4.34, "genres": ["Young Adult", "Young Adult", "Teen", "Christian"], "title": "Getting Even", "description": [" ", " "], "author": "ReShonda Tate Billingsley", "num_pages": "175", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-22 00:00:00", "ISBN": "141655873X"},
{"url": "https://www.goodreads.com/book/show/6380296-liar", "num_ratings": "8,211", "num_reviews": "1,603", "avg_ratings": 3.3, "genres": ["Young Adult", "Fantasy", "Fiction", "Mystery", "Fantasy", "Paranormal", "Young Adult", "Teen"], "title": "Liar", "author": "Justine Larbalestier", "num_pages": "376", "awards": ["Ditmar Award Nominee for Best Novel (2010)", "Western Australian Premier's Book Award for Young Adult (2009)", "Children's Book Council of Australia Award Nominee for Older Readers Book of the Year (2010)", "Queensland Premier's Literary Awards Nominee for Young Adult Book Award (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Davitt Award for Best Young Adult Novel (2010)", "The Inky Awards Shortlist for Gold Inky (2010)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "1599903059"},
{"url": "https://www.goodreads.com/book/show/2427846.Fair_Weather_Friends", "num_ratings": "95", "num_reviews": "6", "avg_ratings": 4.36, "genres": ["Young Adult", "Womens Fiction", "Chick Lit"], "title": "Fair-Weather Friends", "description": ["The Theta Ladies are the hottest new high school sorority, and Camille wants in! After seeing the girls perform a fantastic show at her school, Camille's dreaming of donning the pink satin T-shirt of the Thetas... and is beyond flattered when the sorority sisters actually acknowledge her existence. If only she could persuade her best friends - Alexis, Jasmine, and Angel -", "The Theta Ladies are the hottest new high school sorority, and Camille wants in! After seeing the girls perform a fantastic show at her school, Camille's dreaming of donning the pink satin T-shirt of the Thetas... and is beyond flattered when the sorority sisters actually acknowledge her existence. If only she could persuade her best friends - Alexis, Jasmine, and Angel - to join with her...", "Jasmine has always butted heads with Tori Young, the Theta Ladies president, and she wants no part of the exclusive sorority scene. Camille, Alexis, and Angel are excited to be pledging and are up for any challenge. ", "When it is time to announce new members, Camille and Alexis are accepted and Angel's left out in the cold. Despite her disappointment, Angel encourages her friends to enjoy themselves. But when the real reason for Angel's rejection comes to light, Alexis and Camille must choose: Do they break their commitment to their newfound \"sisters\" to take a stand for their sister at heart?"], "author": "ReShonda Tate Billingsley", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-16 00:00:00", "ISBN": "1416558764"},
{"url": "https://www.goodreads.com/book/show/357602.A_Matter_of_Trust", "num_ratings": "3,999", "num_reviews": "427", "avg_ratings": 4.3, "genres": ["Young Adult", "Realistic Fiction", "Fiction"], "title": "A Matter of Trust", "description": ["In grade school, Darcy Wills and Brisana Meeks were friends. But all that changed at Bluford High when Darcy started hanging with \"the zeros\"--a group of students Brisana despises. Now the former friends are bitter rivals, and the tension between them is getting worse. For a while, Darcy tries to stay calm, ignoring her old friend's daily taunts. But when she learns that B", "In grade school, Darcy Wills and Brisana Meeks were friends. But all that changed at Bluford High when Darcy started hanging with \"the zeros\"--a group of students Brisana despises. Now the former friends are bitter rivals, and the tension between them is getting worse. For a while, Darcy tries to stay calm, ignoring her old friend's daily taunts. But when she learns that Brisana is after her boyfriend, Hakeem Randall, Darcy knows she must do something. But what?"], "author": "Anne Schraff", "num_pages": "125", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-12-31 00:00:00", "ISBN": "0944210031"},
{"url": "https://www.goodreads.com/book/show/238016.Double_Dutch", "num_ratings": "1,563", "num_reviews": "167", "avg_ratings": 3.76, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Childrens", "Middle Grade", "Academic", "School"], "title": "Double Dutch", "description": [" ", " Delia loves Double Dutch more than just about anything, and she's really good at it -- so good she and her teammates have a shot at winning the World Double Dutch Championships. Delia would die if she couldn't jump -- but Delia has a secret, and it could keep her off the team next year. ", " Delia's friend Randy has a secret too, one that has him lonely and scared. An", " ", " Delia loves Double Dutch more than just about anything, and she's really good at it -- so good she and her teammates have a shot at winning the World Double Dutch Championships. Delia would die if she couldn't jump -- but Delia has a secret, and it could keep her off the team next year. ", " Delia's friend Randy has a secret too, one that has him lonely and scared. And while Delia and Randy struggle to keep their secrets, their school is abuzz with rumors about what malicious mischief the terrible Tolliver twins -- who just may have a secret of their own -- are planning. ", " Delia and Randy's secrets collide on what should be the happiest day of Delia's life, and the collision threatens to destroy their friendship. Why can't life be as easy for Delia as Double Dutch?"], "author": "Sharon M. Draper", "num_pages": "192", "awards": [], "places": [], "character_names": ["Delia Douglas", "Yolanda Pepper", "Randy Youngblood"], "language": "English", "publish_date": "2004-01-01 00:00:00", "ISBN": "0689842317"},
{"url": "https://www.goodreads.com/book/show/161991.Bucking_the_Sarge", "num_ratings": "1,573", "num_reviews": "176", "avg_ratings": 3.6, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Young Adult", "Teen", "Humor", "Cultural", "African American"], "title": "Bucking the Sarge", "description": ["Luther T. Farrell has got to get out of Flint, Michigan.", "As his best friend Sparky says, “Flint’s nothing but the Titanic.”", "And his mother, a.k.a. the Sarge, says, “Take my advice and stay off the sucker path.”", "The Sarge milked the system to build an empire of slum housing and group homes. Luther’s just one of the many people trapped in the Sarge’s Evil Empire—but he’s about", "Luther T. Farrell has got to get out of Flint, Michigan.", "As his best friend Sparky says, “Flint’s nothing but the Titanic.”", "And his mother, a.k.a. the Sarge, says, “Take my advice and stay off the sucker path.”", "The Sarge milked the system to build an empire of slum housing and group homes. Luther’s just one of the many people trapped in the Sarge’s Evil Empire—but he’s about to bust out.", "If Luther wins the science fair this year, he’ll be on track for college and a future as America’s best-known and best-loved philosopher. All he’s got to do is beat his arch rival Shayla Patrick, the beautiful daughter of Flint’s finest undertaker—and the love of Luther’s life.", "Sparky’s escape plans involve a pit bull named Poofy and the world’s scariest rat. Oh, and Luther. Add to the mix Chester X., Luther’s mysterious roommate; Dontay Gaddy, a lawyer whose phone number is 1-800-SUE’M ALL; and Darnell Dixon, the Sarge’s go-to guy who knows how to break all the rules."], "author": "Christopher Paul Curtis", "num_pages": "288", "awards": [], "places": ["Flint, Michigan"], "character_names": [], "language": "English", "publish_date": "2006-05-09 00:00:00", "ISBN": "0440413311"},
{"url": "https://www.goodreads.com/book/show/261347.Thugs_and_the_Women_Who_Love_Them", "num_ratings": "4,513", "num_reviews": "183", "avg_ratings": 4.59, "genres": ["Urban", "Fiction"], "title": "Thugs and the Women Who Love Them", "description": ["Essence® bestselling author ", " is all too familiar with the terrifying truths of ghetto life. The first novel in her gritty, gripping series takes you on into a world where a wrong choice could be the last choice a person ever makes. ", "In a 'hood boiling over with sex, brutality, and crime, three friends are at a turning point. They can surrender to the streets- an", "Essence® bestselling author ", " is all too familiar with the terrifying truths of ghetto life. The first novel in her gritty, gripping series takes you on into a world where a wrong choice could be the last choice a person ever makes. ", "In a 'hood boiling over with sex, brutality, and crime, three friends are at a turning point. They can surrender to the streets- and the murderous men who rule there- or walk a totally different path. But nothing is simple for women addicted to life on the edge. And everything has consequences. ", "Angel, Jaz, and Kyra are all leading double lives, torn between working hard to leave the ghetto behind- and being dragged back in by the lying, pimping, drug-dealing men they can't seem to let go. From jealous rampages to bloody turf wars to rage-fueled vendettas, a tangled web of sex and violence binds these women to the very place that could destroy them.", "Get ready to enter a heart-pounding world of danger and eroticism mixed with a glimmer of hope."], "author": "Wahida Clark", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-12-01 00:00:00", "ISBN": "0758212860"},
{"url": "https://www.goodreads.com/book/show/7104677-cool-like-that", "num_ratings": "167", "num_reviews": "14", "avg_ratings": 4.34, "genres": ["Fiction", "Young Adult", "Realistic Fiction"], "title": "Cool Like That", "description": ["Carter's charming third book in her inspirational So for Real series follows the smart and witty Gia Stokes, a modern-day Punky Brewster who marches to her own beat as she navigates the tricky halls of high school."], "author": "Nikki Carter", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-01 00:00:00", "ISBN": "0758234422"},
{"url": "https://www.goodreads.com/book/show/6321714-holidaze", "num_ratings": "1,226", "num_reviews": "39", "avg_ratings": 4.67, "genres": ["Romance", "Drama", "Young Adult", "Cultural", "African American"], "title": "Holidaze", "description": ["It's almost Valentine's Day at South Bay High, but romance is the last thing on Jayd Jackson's mind. To protect herself and bring her crew back together, Jayd will need more than her inner strength. She'll need the help of her gifted ancestors."], "author": "L. Divine", "num_pages": "274", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "0758231091"},
{"url": "https://www.goodreads.com/book/show/22295304-shadowshaper", "num_ratings": "7,047", "num_reviews": "1,668", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Paranormal"], "title": "Shadowshaper", "description": ["Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York may", "Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York mayhem is going on.", "Sierra soon discovers a supernatural order called the Shadowshapers, who connect with spirits via paintings, music, and stories. Her grandfather once shared the order's secrets with an anthropologist, Dr. Jonathan Wick, who turned the Caribbean magic to his own foul ends. Now Wick wants to become the ultimate Shadowshaper by killing all the others, one by one. With the help of her friends and the hot graffiti artist Robbie, Sierra must dodge Wick's supernatural creations, harness her own Shadowshaping abilities, and save her family's past, present, and future."], "author": "Daniel José Older", "num_pages": "297", "awards": ["Locus Award Nominee for Best Young Adult Book (2016)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2016)", "Lincoln Award Nominee (2018)", "Andre Norton Award Nominee (2015)", "Kirkus Prize Nominee for Young Readers' Literature (Finalist) (2015)"], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-30 00:00:00", "ISBN": "0545591619"},
{"url": "https://www.goodreads.com/book/show/65335.Selected_Poems", "num_ratings": "6,008", "num_reviews": "208", "avg_ratings": 4.29, "genres": ["Poetry", "Classics", "Cultural", "African American", "Literature"], "title": "Selected Poems", "description": ["With the publication of his first book of poems, ", ", in 1926, Langston Hughes electrified readers and launched a renaissance in black writing in America.  The poems Hughes wrote celebrated the experience of invisible men and women: of slaves who \"rushed the boots of Washington\"; of musicians on Lenox Avenue; of the poor and the lovesick; of losers in \"the raff", "With the publication of his first book of poems, ", ", in 1926, Langston Hughes electrified readers and launched a renaissance in black writing in America.  The poems Hughes wrote celebrated the experience of invisible men and women: of slaves who \"rushed the boots of Washington\"; of musicians on Lenox Avenue; of the poor and the lovesick; of losers in \"the raffle of night.\"  They conveyed that experience in a voice that blended the spoken with the sung, that turned poetic lines into the phrases of jazz and blues, and that ripped through the curtain separating high from popular culture.  They spanned the range from the lyric to the polemic, ringing out \"wonder and pain and terror-- and the marrow of the bone of life.\"", "The poems in this collection were chosen by Hughes himself shortly before his death in 1967 and represent work from his entire career, including \"The Negro Speaks of Rivers,\" \"The Weary Blues,\" \"Still Here,\" \"Song for a Dark Girl,\" \"Montage of a Dream Deferred,\" and \"Refugee in America.\"  It gives us a poet of extraordinary range, directness, and stylistic virtuosity."], "author": "Langston Hughes", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-09-12 00:00:00", "ISBN": "067972818X"},
{"url": "https://www.goodreads.com/book/show/671462.Spellbound", "num_ratings": "200", "num_reviews": "25", "avg_ratings": 3.69, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Young Adult", "Teen", "Cultural", "African American"], "title": "Spellbound", "description": ["Raven never expected to be a mother at sixteen. Is she going to be just another high school dropout, a project girl with few prospects? Could be, except Raven has ambition. Still, when is she going to find the time to finish school? Then her older sister tells her about a spelling bee that promises the winner a scholarship for college. Spelling? There isn't a subject she's", "Raven never expected to be a mother at sixteen. Is she going to be just another high school dropout, a project girl with few prospects? Could be, except Raven has ambition. Still, when is she going to find the time to finish school? Then her older sister tells her about a spelling bee that promises the winner a scholarship for college. Spelling? There isn't a subject she's worse at. But once Raven's got her mind set, nothing gets in her way..."], "author": "Janet McDonald", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-12-01 00:00:00", "ISBN": "014250193X"},
{"url": "https://www.goodreads.com/book/show/272333.The_House_You_Pass_on_the_Way", "num_ratings": "1,364", "num_reviews": "129", "avg_ratings": 3.76, "genres": ["Young Adult", "Lgbt", "Glbt", "Queer", "Fiction", "Realistic Fiction"], "title": "The House You Pass on the Way", "description": ["Staggerlee is used to being alone. As the granddaughter of celebrities and the daughter of an interracial couple in an all-black town, she has become adept at isolating herself from curious neighbors. But then her cousin, Trout, comes to visit. Trout is exactly like Staggerlee wishes she could be: outspoken, sure of herself, beautiful. Finally, Staggerlee has a friend, som", "Staggerlee is used to being alone. As the granddaughter of celebrities and the daughter of an interracial couple in an all-black town, she has become adept at isolating herself from curious neighbors. But then her cousin, Trout, comes to visit. Trout is exactly like Staggerlee wishes she could be: outspoken, sure of herself, beautiful. Finally, Staggerlee has a friend, someone she can share her deepest, most private thoughts with. Someone who will teach her how to be the strong girl she longs to be. But is Trout really the girl Staggerlee thinks she is?"], "author": "Jacqueline Woodson", "num_pages": "128", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (1999)", "Lambda Literary Award for Young Adult / Children's Book (1998)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-10-27 00:00:00", "ISBN": "0142501913"},
{"url": "https://www.goodreads.com/book/show/3112839-kendra", "num_ratings": "1,632", "num_reviews": "168", "avg_ratings": 4.13, "genres": ["Young Adult", "Fiction", "Young Adult", "Teen", "Cultural", "African American", "Realistic Fiction"], "title": "Kendra", "description": ["The acclaimed author of TYRELL returns to PUSH with a striking novel about a mother and daughter who are only fourteen years apart, but need to learn to understand each other before it's too late.", "Kendra's mom, Renee, had her when she was only 14 years old. Renee and her mom made a deal -- Renee could get an education, and Kendra would live with her grandmother. But now Ren", "The acclaimed author of TYRELL returns to PUSH with a striking novel about a mother and daughter who are only fourteen years apart, but need to learn to understand each other before it's too late.", "Kendra's mom, Renee, had her when she was only 14 years old. Renee and her mom made a deal -- Renee could get an education, and Kendra would live with her grandmother. But now Renee's out of grad school and Kendra's in high school ... and getting into some trouble herself. Kendra's grandmother lays down the law: It's time for Renee to take care of her daughter. Kendra wants this badly -- even though Renee keeps disappointing her. Being a mother isn't easy, but being a daughter can be just as hard. Now it's up to Kendra and Renee to make it work."], "author": "Coe Booth", "num_pages": "292", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2008-10-01 00:00:00", "ISBN": "0439925363"},
{"url": "https://www.goodreads.com/book/show/64380.47", "num_ratings": "1,455", "num_reviews": "294", "avg_ratings": 3.71, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fantasy", "Fiction", "Historical", "Cultural", "African American"], "title": "47", "description": ["Mosley deftly weaves historical and speculative fiction into a powerful narrative about the nature of freedom.", "A gripping Young Adult fiction debut by bestselling author Walter Mosley.", "Walter Mosley is one of the best known writers in America. In his first book for young adults, Mosley deftly weaves historical and speculative fiction into a powerful narrative about the natur", "Mosley deftly weaves historical and speculative fiction into a powerful narrative about the nature of freedom.", "A gripping Young Adult fiction debut by bestselling author Walter Mosley.", "Walter Mosley is one of the best known writers in America. In his first book for young adults, Mosley deftly weaves historical and speculative fiction into a powerful narrative about the nature of freedom. 47 is a young slave boy living under the watchful eye of a brutal slave master. His life seems doomed until he meets a mysterious run-away slave, Tall John. Then 47 finds himself swept up in a struggle for his own liberation."], "author": "Walter Mosley", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "0316016357"},
{"url": "https://www.goodreads.com/book/show/6748443-culture-clash", "num_ratings": "1,239", "num_reviews": "38", "avg_ratings": 4.71, "genres": ["Cultural", "African American", "Young Adult"], "title": "Culture Clash", "description": ["Ever since she discovered a love for drag racing, it's full speed ahead for Jayd Jackson. . .Fed up with the way her school's handling Cultural Awareness Day, Jayd and her crew decide to form the first African Student Union. Now some notorious haters are out for blood. But that's not the only multicultural activity Jayd's got cooking. On the boy front, Jayd discovers she l", "Ever since she discovered a love for drag racing, it's full speed ahead for Jayd Jackson. . .Fed up with the way her school's handling Cultural Awareness Day, Jayd and her crew decide to form the first African Student Union. Now some notorious haters are out for blood. But that's not the only multicultural activity Jayd's got cooking. On the boy front, Jayd discovers she loves being behind the wheel of her friends' hot rods, but she can't deny her attraction for Emilio, the new Latino sophomore at South Bay High. Emilio seems to be crushin' hard on Jayd too. And now that Jayd may be South Bay's last virgin, she wonders if it's time to take things to the next level.", "But her magical grandmother thinks Jayd's already moving too fast--and if she doesn't slow down, she's sure to get burned..."], "author": "L. Divine", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-02-01 00:00:00", "ISBN": "0758231113"},
{"url": "https://www.goodreads.com/book/show/852347.Twists_and_Turns", "num_ratings": "57", "num_reviews": "15", "avg_ratings": 3.3, "genres": ["Cultural", "Young Adult", "Teen", "Realistic Fiction", "Cultural", "African American", "Fiction", "Young Adult", "Urban"], "title": "Twists and Turns", "description": ["It may have taken them an extra year or two to do it, but the Washington sisters finally graduated high school, and this definitely calls for a celebration. But after the party ends, then what? The girls have no plans. Unlike their smart best friend Raven Jefferson, who's away at college, and their nerdy best friend Toya Larson,", "It may have taken them an extra year or two to do it, but the Washington sisters finally graduated high school, and this definitely calls for a celebration. But after the party ends, then what? The girls have no plans. Unlike their smart best friend Raven Jefferson, who's away at college, and their nerdy best friend Toya Larson, who's in computer training, and ", "their overall best friend Aisha Ingram, who's rocking in TV commercials, Keeba and Teesha are still hanging out on neighborhood benches as if nothing's changed. Then an older friend convinces the sisters that they, too, have a skill – braiding hair – and why not make a business of it? With a loan from Aisha, the Washingtons open TeeKee's Tresses in a rented storefront, and the future looks pretty solid . . . that is, until a rival's jealousy, a landlord's greed, and a politician's scheme turn the sisters' world upside down.", "Janet McDonald introduces readers to two sisters who discover that all you have to do is stick together to handle life's many twists and turns.", " is a 2004 Bank Street - Best Children's Book of the Year."], "author": "Janet McDonald", "num_pages": "144", "awards": [], "places": ["New York (the state)"], "character_names": [], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "0374400067"},
{"url": "https://www.goodreads.com/book/show/793778.Blessings_in_Disguise", "num_ratings": "183", "num_reviews": "14", "avg_ratings": 4.3, "genres": ["Christian", "Christian Fiction", "Young Adult"], "title": "Blessings in Disguise", "author": "ReShonda Tate Billingsley", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-09 00:00:00", "ISBN": "1416525610"},
{"url": "https://www.goodreads.com/book/show/6322835-keep-it-movin", "num_ratings": "1,369", "num_reviews": "44", "avg_ratings": 4.68, "genres": ["Young Adult", "Cultural", "African American", "Realistic Fiction"], "title": "Keep It Movin'", "description": ["These days, Jayd just can't seem to get a break. Her car is more trouble than it's worth; her girl Mickey is being forced to attend continuation school; and Rah and his ex Sandy are still arguing.", "Despite these dist", "These days, Jayd just can't seem to get a break. Her car is more trouble than it's worth; her girl Mickey is being forced to attend continuation school; and Rah and his ex Sandy are still arguing.", "Despite these distractions, Jayd concentrates on making potions for hair and developing her own signature braid technique, which is getting her a lot of respect and money. But then school starts up again, and with it comes more drama. If Jayd wants to keep it all under control, she'll have to look deep into herself and take her destiny into her own hands. . ."], "author": "L. Divine", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-01 00:00:00", "ISBN": "0758231075"},
{"url": "https://www.goodreads.com/book/show/6069583-hustlin", "num_ratings": "2,058", "num_reviews": "35", "avg_ratings": 4.63, "genres": ["Drama", "Young Adult", "Cultural", "African American"], "title": "Hustlin'", "description": ["L. Divine puts a fresh spin on the Sweet Valley High series with this seventh Drama High novel, in which a young sistah learns that life in the hood is nothing compared to life in high school."], "author": "L. Divine", "num_pages": "210", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-02-01 00:00:00", "ISBN": "0758231059"},
{"url": "https://www.goodreads.com/book/show/2821604-courtin-jayd", "num_ratings": "1,912", "num_reviews": "54", "avg_ratings": 4.63, "genres": ["Young Adult", "Drama"], "title": "Courtin' Jayd", "description": ["Now that both of Jayd's cliques have crossed paths and are getting along, Jayd hopes smooth sailing is ahead. But with problems at home and some beef with Rah, Jayd realizes they don't call her Drama High for nothing."], "author": "L. Divine", "num_pages": "212", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "0758225369"},
{"url": "https://www.goodreads.com/book/show/3332202-friends-til-the-end", "num_ratings": "97", "num_reviews": "7", "avg_ratings": 4.37, "genres": ["Young Adult", "Christian", "Romance", "Womens Fiction", "Chick Lit", "Inspirational", "Romance", "Clean Romance"], "title": "Friends 'til the End", "description": ["The sixth book in ", " series from national bestselling author ", " ", "It's for real - Jasmine's in love! She never thought she'd be boy-crazy like her girlfriends Camille, Alexis, and Angel, but now Jasmine and football star C.J. Taylor are inseparable - they've even been voted the school's cutest couple. And with love in the air, everything se", "The sixth book in ", " series from national bestselling author ", " ", "It's for real - Jasmine's in love! She never thought she'd be boy-crazy like her girlfriends Camille, Alexis, and Angel, but now Jasmine and football star C.J. Taylor are inseparable - they've even been voted the school's cutest couple. And with love in the air, everything seems to be going right: Jasmine's mom has allowed her and C.J. to go out on dates, and even her relationship with her brother Jaquan has improved. Maybe love is contagious!", "But Jasmine's happiness is shattered when a neighborhood gang begins harassing Jaquan - and trouble quickly escalates to tragedy. With C.J. and his family caught in the crossfire of lies and violence, Jasmine will have to hold on tighter than ever to her faith, to the friends who have never let her down... and to the belief that love truly does conquer all."], "author": "ReShonda Tate Billingsley", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-02-10 00:00:00", "ISBN": "1416558772"},
{"url": "https://www.goodreads.com/book/show/272335.The_Dear_One", "num_ratings": "385", "num_reviews": "66", "avg_ratings": 3.94, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Lgbt"], "title": "The Dear One", "description": ["Feni is furious when she finds out that her mother has agreed to take a fifteen-year-old pregnant girl into their home until her baby is born. What kind of girl would let herself get into so much trouble? How can Feni live under the same roof with someone like that? Her worst fears are confirmed when Rebecca arrives: she is mean, bossy, and uneducated. Feni decides she wil", "Feni is furious when she finds out that her mother has agreed to take a fifteen-year-old pregnant girl into their home until her baby is born. What kind of girl would let herself get into so much trouble? How can Feni live under the same roof with someone like that? Her worst fears are confirmed when Rebecca arrives: she is mean, bossy, and uneducated. Feni decides she will have nothing to do with her. But it’s hard not to be curious about a girl so close to her in age who ", " so different. . . ."], "author": "Jacqueline Woodson", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-01-19 00:00:00", "ISBN": "0142501905"},
{"url": "https://www.goodreads.com/book/show/2662604-a-hood-chick-s-story", "num_ratings": "626", "num_reviews": "37", "avg_ratings": 4.46, "genres": ["Urban"], "title": "A Hood Chick's Story", "description": ["Drama is no stranger to Tiara James. When it felt like the world had finally changed the hand that she d been dealt, reality continued to creep up on her. With a mom on the verge of becoming an alcoholic and an alcoholic crack-addicted father who use to beat her mom in front of her, who could blame Tiara for finding a family on the streets. Tiara s loyalty to her friends w", "Drama is no stranger to Tiara James. When it felt like the world had finally changed the hand that she d been dealt, reality continued to creep up on her. With a mom on the verge of becoming an alcoholic and an alcoholic crack-addicted father who use to beat her mom in front of her, who could blame Tiara for finding a family on the streets. Tiara s loyalty to her friends was undeniable. The crew consisted of, Tiara, Tamika, Shavon, Renee, Ke Ke and Karen. They jumped, robbed and fought other girls who stood in their way. When trouble surfaced, the crew had no problems with getting their hands dirty. Tiara was faithful to her crew handling any drama that presented itself. But when jealousy get s the best of friends, things continued to get ugly. With an older brother Tre James wrapped deeply into the streets becoming a drug dealer at 13, their younger brother Sharod had no choice but to admire both Tre and Tiara s lifestyle. Tragedy continued to hit home and Tiara s life continued to go down hill. She lost people who she loved and trusted the most to death, jail or betrayal. From welfare, section 8, jail, drugs, abusive relationships and lies, Tiara s future seems uncertain. Will she finally rise above the drama that meets her at every corner, or remain trapped in the jaws of the hood? Brace yourself as Tiara James takes you on a rollercoaster ride in her footsteps, in her hood, telling her story."], "author": "Lashonda Devaughn", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-11-01 00:00:00", "ISBN": "0615168671"},
{"url": "https://www.goodreads.com/book/show/421338.Tyrell", "num_ratings": "4,345", "num_reviews": "725", "avg_ratings": 4.18, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Young Adult", "Teen", "Urban"], "title": "Tyrell", "description": ["An astonishing new voice in teen literature, writing what is sure to be one of the most talked-about debuts of the year.", "Tyrell is a young, African American teen who can't get a break. He's living (for now) with his spaced-out mother and little brother in a homeless shelter. His father's in jail. His girlfriend supports him, but he doesn't feel good enough for her - and see", "An astonishing new voice in teen literature, writing what is sure to be one of the most talked-about debuts of the year.", "Tyrell is a young, African American teen who can't get a break. He's living (for now) with his spaced-out mother and little brother in a homeless shelter. His father's in jail. His girlfriend supports him, but he doesn't feel good enough for her - and seems to be always on the verge of doing the wrong thing around her. There's another girl at the homeless shelter who is also after him, although the desires there are complicated. Tyrell feels he needs to score some money to make things better. Will he end up following in his father's footsteps?"], "author": "Coe Booth", "num_pages": "310", "awards": ["Los Angeles Times Book Prize for Young Adult Literature (2006)", "James Cook Book Award Nominee (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-01 00:00:00", "ISBN": "0439838797"},
{"url": "https://www.goodreads.com/book/show/169762.The_Pox_Party", "num_ratings": "13,109", "num_reviews": "2,047", "avg_ratings": 3.5, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Young Adult", "Teen"], "title": "The Pox Party", "description": ["It sounds like a fairy tale. He is a boy dressed in silks and white wigs and given the finest of classical educations. Raised by a group of rational philosophers known only by numbers, the boy and his mother -- a princess in exile from a faraway land -- are the only persons in their household assigned names. As the boy's regal mother, Cassiopeia, entertains the house schol", "It sounds like a fairy tale. He is a boy dressed in silks and white wigs and given the finest of classical educations. Raised by a group of rational philosophers known only by numbers, the boy and his mother -- a princess in exile from a faraway land -- are the only persons in their household assigned names. As the boy's regal mother, Cassiopeia, entertains the house scholars with her beauty and wit, young Octavian begins to question the purpose behind his guardians' fanatical studies. Only after he dares to open a forbidden door does he learn the hideous nature of their experiments -- and his own chilling role in them. Set against the disquiet of Revolutionary Boston, M. T. Anderson's extraordinary novel takes place at a time when American Patriots rioted and battled to win liberty while African slaves were entreated to risk their lives for a freedom they would never claim. The first of two parts, this deeply provocative novel reimagines the past as an eerie place that has startling resonance for readers today."], "author": "M.T. Anderson", "num_pages": "359", "awards": ["National Book Award for Young People's Literature (2006)", "Michael L. Printz Award Nominee (2007)", "Boston Globe-Horn Book Award (2006)", "Boston Author's Club Young Reader Award (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "0763624020"},
{"url": "https://www.goodreads.com/book/show/436609.Fallen_Angels", "num_ratings": "8,741", "num_reviews": "1,185", "avg_ratings": 3.99, "genres": ["Historical", "Historical Fiction", "Young Adult", "War", "Fiction", "Historical", "War", "Military Fiction"], "title": "Fallen Angels", "description": ["An exciting, eye-catching repackage of acclaimed author Walter Dean Myers' bestselling paperbacks, to coincide with the publication of SUNRISE OVER FALLUJA in hardcover.", "A coming-of-age tale for young adults set in the trenches of the Vietnam War in the late 1960s, this is the story of Perry, a Harlem teenager who volunteers for the service when his dream of attending colle", "An exciting, eye-catching repackage of acclaimed author Walter Dean Myers' bestselling paperbacks, to coincide with the publication of SUNRISE OVER FALLUJA in hardcover.", "A coming-of-age tale for young adults set in the trenches of the Vietnam War in the late 1960s, this is the story of Perry, a Harlem teenager who volunteers for the service when his dream of attending college falls through. Sent to the front lines, Perry and his platoon come face-to-face with the Vietcong and the real horror of warfare. But violence and death aren't the only hardships. As Perry struggles to find virtue in himself and his comrades, he questions why black troops are given the most dangerous assignments, and why the U.S. is there at all."], "author": "Walter Dean Myers", "num_pages": "320", "awards": ["South Carolina Book Award for Young Adult Book Award (1991)", "Charlotte Award (1992)", "Keystone to Reading Book Award (1994)", "Coretta Scott King Award for Author (1989)"], "places": ["Vietnam"], "character_names": [], "language": "English", "publish_date": "1989-05-01 00:00:00", "ISBN": "0590409433"},
{"url": "https://www.goodreads.com/book/show/20775537-twelve-years-a-slave", "num_ratings": "73,925", "num_reviews": "5,379", "avg_ratings": 4.17, "genres": ["Nonfiction", "History", "Biography", "Classics", "Autobiography", "Memoir"], "title": "Twelve Years a Slave", "description": ["Twelve Years a Slave, sub-title: Narrative of Solomon Northup, citizen of New-York, kidnapped in Washington city in 1841, and rescued in 1853, from a cotton plantation near the Red River in Louisiana, is a memoir by Solomon Northup as told to and edited by David Wilson. It is a slave narrative of a black man who was born free in New York state but kidnapped in Washington,", "Twelve Years a Slave, sub-title: Narrative of Solomon Northup, citizen of New-York, kidnapped in Washington city in 1841, and rescued in 1853, from a cotton plantation near the Red River in Louisiana, is a memoir by Solomon Northup as told to and edited by David Wilson. It is a slave narrative of a black man who was born free in New York state but kidnapped in Washington, D.C., sold into slavery, and kept in bondage for 12 years in Louisiana. He provided details of slave markets in Washington, D.C. and New Orleans, as well as describing at length cotton and sugar cultivation on major plantations in Louisiana."], "author": "Solomon Northup", "num_pages": "248", "awards": [], "places": ["Louisiana"], "character_names": ["Solomon Northup"], "language": "English", "publish_date": "2014-02-01 00:00:00", "ISBN": "1631680021"},
{"url": "https://www.goodreads.com/book/show/32725389-log", "num_ratings": "12", "num_reviews": "5", "avg_ratings": 4.58, "genres": ["Comics", "Superheroes", "Science Fiction"], "title": "LOG: The Legends of Genesis: Not Your Ordinary Heroes", "description": ["The Legends of Genesis (Asian, African, and World mythology) (fantasy, super power, anime, super hero, wuxia, martial arts, philosophy, historical, romance, action, adventure, sci-fi, prehistoric) ", "Imagine a world where people don't age past their prime. Where a person that would labeled as intellectually gifted on Earth is nothing more than average there. A place where the", "The Legends of Genesis (Asian, African, and World mythology) (fantasy, super power, anime, super hero, wuxia, martial arts, philosophy, historical, romance, action, adventure, sci-fi, prehistoric) ", "Imagine a world where people don't age past their prime. Where a person that would labeled as intellectually gifted on Earth is nothing more than average there. A place where the average person is even more powerful than your typical super hero. A place several times more vast and mysterious than earth . and home to over 50 non hybrid races. Just Imagine how far they would have advanced in the time that we have had. Then imagine how far they would have advanced given 10, 100, or even 1000 times longer than we had. Do you imagine large skyscrapers and flying cars as in your common sci fi flicks and novels. Well, they've advanced far past that even. What would their super heroes be like, and the villains that they have to combine forces to fight against. And how would the planet survive the battles between these people. Not to mention what would every day life be like? And with their powers would they feel as gods themselves and not have need to reverence them? ", "In fact the heroes held a contest and after beating many Shenxian, kami, Orishas, and Immortals they believed they were indeed powerful enough to at least compete with the gods. They challenged the supreme gods and the realm gods. After loosing horribly they incurred the supreme goddess' wrath as punishment. However she was not satisfied with just punishing them, as she wanted to destroy them completely. However the supreme god felt that their punishment was enough and that they should be forgiven. Unable to agree they decided to settle it the way gods do. They made bet which would decide whether they would perish or thrive. Six beings would be created, beings much more powerful than any that have ever been created. Two beings would be of light, two would be of darkness, and two neutral ones that would pick a side. The gods would set up challenges for them along the way to train them until the day of the final contest. When that day comes they would fight each other to the death and if light won they would be saved, however if dark won they would all die. Which one would prevail light or darkness? Sounds like your typical fantasy novel right? However what if when they are born they decide not to be pawns in the god's game? Can and will they defy their destiny even when all their moves are being controlled leading them to that end? And if they do defy the gods what will be the retribution for their actions,... and more importantly how will they respond to it? ", "This story follows the lives of the 6 beings. ", "The children of Darkness ", "Titan- (master of dimensions, souls, energy, and matter/anti matter) ", "Nina- (Master of psyche, various elements and forces, space, and the dead) ", "The children of Light ", "Emerald- (elemental master, spirit and sentient, energy, matter and fusion) ", "Sapphire (Master of copying and reversing, Time, and various elements) ", "The neutral children ", "Rage (master of reality, mystic, and various elements.) ", "Dragon (master of magic, various elements, and death) ", "This story has hundreds of characters all with their own goals and interest. Full of unexpected plot twists and turns that will keep you guessing at each turn of the page. Volume 1 deals with the introduction of the main characters but is by no means slow paced. It pulls you right into the ever evolving and expanding world. Filled with action, romance, comedy, and philosophy that will have you rethink everything. This is anything but ordinary, and one thing to keep in mind is that nothing is as it seems."], "author": "Mark McCants", "num_pages": "656", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/294906.What_They_Found", "num_ratings": "541", "num_reviews": "161", "avg_ratings": 3.79, "genres": ["Short Stories", "Young Adult", "Cultural", "African American", "Romance", "Realistic Fiction", "Fiction", "Cultural"], "title": "What They Found: Love on 145th Street", "description": ["WALTER DEAN MYERS returns to the world of ", "to show how love can be found, and thrive, in the most unlikely places. Curtis finds love in Iraq as he struggles to stay alive in a war he doesn't want to fight, and Letha discovers her own beauty in the love of her child. There is the \"good daughter\" who realizes that there's only one way to help her b", "WALTER DEAN MYERS returns to the world of ", "to show how love can be found, and thrive, in the most unlikely places. Curtis finds love in Iraq as he struggles to stay alive in a war he doesn't want to fight, and Letha discovers her own beauty in the love of her child. There is the \"good daughter\" who realizes that there's only one way to help her brother and her family. Other stories center on the daily drama of the Curl-E-Que beauty shop, or capture the slapstick side of passion."], "author": "Walter Dean Myers", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-11 00:00:00", "ISBN": "0385321384"},
{"url": "https://www.goodreads.com/book/show/588890.Autobiography_of_My_Dead_Brother", "num_ratings": "998", "num_reviews": "165", "avg_ratings": 3.86, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Young Adult", "Teen", "Audiobook", "Young Adult", "Coming Of Age"], "title": "Autobiography of My Dead Brother", "description": ["Printz Award winner Walter Dean Myers has written a realistic urban novel that probes a fatal crisis in the life of two boys. Jesse, the book's narrator, and Rise are best friends, but as time passes, Rise grows increasingly alienated and unpredictable. Living in a neighborhood where gang fights and drive-by shootings are almost commonplace, Jesse wonders whether he and hi", "Printz Award winner Walter Dean Myers has written a realistic urban novel that probes a fatal crisis in the life of two boys. Jesse, the book's narrator, and Rise are best friends, but as time passes, Rise grows increasingly alienated and unpredictable. Living in a neighborhood where gang fights and drive-by shootings are almost commonplace, Jesse wonders whether he and his estranged blood brother are already doomed. A powerful novel from the author of ", " and ", "."], "author": "Walter Dean Myers", "num_pages": "224", "awards": ["National Book Award Finalist for Young People's Literature (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-31 00:00:00", "ISBN": "0060582936"},
{"url": "https://www.goodreads.com/book/show/272337.I_Hadn_t_Meant_to_Tell_You_This", "num_ratings": "1,110", "num_reviews": "163", "avg_ratings": 3.88, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Childrens", "Middle Grade", "Cultural", "African American", "Sociology", "Abuse"], "title": "I Hadn't Meant to Tell You This", "description": ["Marie, the only black girl in the eighth grade willing to befriend her white classmate Lena, discovers that Lena's father is doing horrible things to her in private."], "author": "Jacqueline Woodson", "num_pages": "128", "awards": ["Jane Addams Children's Book Award Nominee for Older Children (1995)", "Dorothy Canfield Fisher Children's Book Award Nominee (1996)", "Coretta Scott King Award for Author Honor (1995)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-06-08 00:00:00", "ISBN": "0142405558"},
{"url": "https://www.goodreads.com/book/show/110001.Jayd_s_Legacy", "num_ratings": "1,678", "num_reviews": "71", "avg_ratings": 4.6, "genres": ["Young Adult", "Cultural", "African American", "Contemporary", "Realistic Fiction", "Young Adult", "Teen", "Drama", "Romance"], "title": "Jayd's Legacy", "description": ["Friends and teachers at South Bay High may be hating, but Jayd and Jeremy are falling in lov", "Friends and teachers at South Bay High may be hating, but Jayd and Jeremy are falling in love, and if anyone has a problem with their happiness, especially an ex who's back in Jayd's life aiming to sweep her off her feet--well, that's no surprise. This is Drama High after all. And Jayd is no stranger to controversy--it's in her blood, and it seems it's in her girl Nellie's blood too.", "Homecoming is just around the corner, and South Bay High has never had a black princess, queen, or royalty of any kind for any event. But that's about to change. The Drama Club is sponsoring Nellie to run for the junior class, hoping to give the Cheerleaders and Athletes a run for their money. If Nellie wins, she'll make history. In fact, Nellie is so deep in the zone, Jayd's afraid she'll forget to watch her back because the students of South Bay are serious about their crowns. As Nellie's chances for victory heat up, so does the hostility from the smartass opposition. Nellie may be flying too high to notice, but Jayd can see the drama coming. And as usual, she's on it--with a little help from her magical Mama and her mystical ancestors, of course."], "author": "L. Divine", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-01 00:00:00", "ISBN": "0758216378"},
{"url": "https://www.goodreads.com/book/show/119847.Bang_", "num_ratings": "1,988", "num_reviews": "310", "avg_ratings": 4.19, "genres": ["Young Adult", "Realistic Fiction", "Cultural", "African American", "Young Adult", "Teen", "Fiction", "Family", "Young Adult", "Coming Of Age", "Abandoned", "Contemporary", "Cultural"], "title": "Bang!", "description": ["Mann is only thirteen, yet he has already had to deal with more than most go through in a lifetime. His family is still reeling from the tragic shooting death of his little brother, Jason, each person coping with grief in his or her own way. Mann's mother has stopped eating and is obsessed with preserving Jason's memory, while his father is certain that presenting a hard e", "Mann is only thirteen, yet he has already had to deal with more than most go through in a lifetime. His family is still reeling from the tragic shooting death of his little brother, Jason, each person coping with grief in his or her own way. Mann's mother has stopped eating and is obsessed with preserving Jason's memory, while his father is certain that presenting a hard edge is the only way to keep his remaining son from becoming a statistic. Mann used to paint and ride horseback, but now he's doing everything he can to escape his emotions: getting involved in fights at school, joyriding at midnight, and much worse. His father, at his wit's end, does the only thing he thinks will teach his son how to be a man he abandons him and his friend Kee Lee in the woods, leaving them to navigate their way home, alone."], "author": "Sharon G. Flake", "num_pages": "298", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2005-09-01 00:00:00", "ISBN": "0786818441"},
{"url": "https://www.goodreads.com/book/show/333129.Second_Chance", "num_ratings": "2,116", "num_reviews": "109", "avg_ratings": 4.58, "genres": ["Drama", "Young Adult", "Realistic Fiction", "Romance", "Cultural", "African American", "Young Adult", "Teen", "Contemporary", "Young Adult", "High School"], "title": "Second Chance", "description": ["Back for another dose of high drama, Compton's sassiest, Jayd Jackson, is about to discover it really is a different world when she starts dating South Bay High's finest white boy. . .", "All Jayd Jackson wants is a drama-free year at South Bay High, a.k.a. Drama High. But it doesn't seem she's going to get it. It's only the second week of Junior year and already, Misty, her n", "Back for another dose of high drama, Compton's sassiest, Jayd Jackson, is about to discover it really is a different world when she starts dating South Bay High's finest white boy. . .", "All Jayd Jackson wants is a drama-free year at South Bay High, a.k.a. Drama High. But it doesn't seem she's going to get it. It's only the second week of Junior year and already, Misty, her nemesis, has almost gotten her killed after instigating a fight between Jayd and KJ's girlfriend, Trecee. But it goes with the territory. She's a fire child, and granddaughter to Lynne Mae Williams--Mama--and Mama says that means the drama will follow Jayd wherever she goes. Even so, Jayd just wants to chill, still hoping Junior year can carry on, drama-free. And with Misty and KJ reportedly \"hanging,\" Jayd is ready to move on. But the brother won't stop blowing up Jayd's cellie, and the text-messages keep coming; and the message is clear: KJ wants Jayd back bad.", "But Jayd couldn't care less. She's got a new man to kick-it with now--a half-Jewish white boy from Palos Verdes whose parents are loaded with a capital \"L.\" And Jeremy Weiner's no ordinary white boy--he listens to East Coast rap, he's got a sweet ride, and he's got it bad for Jayd Jackson. But no one at South Bay High will just let a sistah be happy. Misty's back to her usual foolishness, KJ's all over her jock, and the notoriously anti-black teacher Mrs. Bennett is tripping. Jeremy's got her totally sprung, but she's going to have to rely on her brains--and some of Mama's magic, of course--if she's going to survive another week at Drama High.", "But Jayd couldn't care less. She's got a new man to kick-it with now--a half-Jewish white boy from Palos Verdes whose parents are loaded with a capital \"L.\" And Jeremy Weiner's no ordinary white boy--he listens to East Coast rap, he's got a sweet ride, and he's got it bad for Jayd Jackson. But no one at South Bay High will just let a sistah be happy. Misty's back to her usual foolishness, KJ's all over her jock, and the notoriously anti-black teacher Mrs. Bennett is tripping. Jeremy's got her totally sprung, but she's going to have to rely on her brains--and some of Mama's magic, of course--if she's going to survive another week at Drama High.", "L. Divine is at the top of her game in this superb follow-up to the power-packed", ". Look for the next juicy installment, ", ", coming soon."], "author": "L. Divine", "num_pages": "234", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-01 00:00:00", "ISBN": "0758216351"},
{"url": "https://www.goodreads.com/book/show/338877.A_Gangster_s_Girl", "num_ratings": "2,520", "num_reviews": "54", "avg_ratings": 4.45, "genres": ["Urban", "Fiction"], "title": "A Gangster's Girl", "description": ["Leaving the safety of her parents home, a very good girl enters a world of bad boys and fast money and hooks up with a sexy but dangerous man who could be the biggest mistake of her life."], "author": "Chunichi Knott", "num_pages": "258", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "0974363650"},
{"url": "https://www.goodreads.com/book/show/754515.New_Boy", "num_ratings": "432", "num_reviews": "94", "avg_ratings": 3.61, "genres": ["Historical", "Historical Fiction", "Young Adult", "Academic", "School", "Fiction", "Cultural", "African American"], "title": "New Boy", "description": ["Fifteen-year-old Rob Garrett wants nothing more than to escape the segregated South and prove himself. But in late 1950s Virginia, opportunity doesn’t come easily to an African American. So Rob’s parents take the unusual step of enrolling their son in a Connecticut boarding school, where he will have the best education available. He will also be the first student of color", "Fifteen-year-old Rob Garrett wants nothing more than to escape the segregated South and prove himself. But in late 1950s Virginia, opportunity doesn’t come easily to an African American. So Rob’s parents take the unusual step of enrolling their son in a Connecticut boarding school, where he will have the best education available. He will also be the first student of color in the school’s history. No matter—Rob Garrett is on his way. ", "   But times are changing. While Rob is experiencing the privilege and isolation of private school, a movement is rising back home. Men and women are organizing, demanding an end to segregation, and in Rob’s hometown, his friends are on the verge of taking action. There is even talk about sitting in at a lunch counter that refuses to serve black people. How can Rob hope to make a difference when he’s a world away?"], "author": "Julian Houston", "num_pages": "288", "awards": [], "places": ["Connecticut"], "character_names": [], "language": "English", "publish_date": "2005-11-28 00:00:00", "ISBN": "0618432531"},
{"url": "https://www.goodreads.com/book/show/152099.Crystal", "num_ratings": "258", "num_reviews": "50", "avg_ratings": 3.68, "genres": ["Young Adult", "Cultural", "African American", "Realistic Fiction", "Fiction", "Young Adult", "Coming Of Age"], "title": "Crystal", "description": ["Sixteen-year-old Crystal knows she's blessed. She is drop-dead gorgeous and in the beginning stages of a glamorous career as a model in New York City. At first, modeling is exciting. But soon, her life becomes less and less about her, and more and more about her body. Crystal wonders if her new life is worth giving up everything -- her friends, her beliefs, and her self-re", "Sixteen-year-old Crystal knows she's blessed. She is drop-dead gorgeous and in the beginning stages of a glamorous career as a model in New York City. At first, modeling is exciting. But soon, her life becomes less and less about her, and more and more about her body. Crystal wonders if her new life is worth giving up everything -- her friends, her beliefs, and her self-respect."], "author": "Walter Dean Myers", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-05-07 00:00:00", "ISBN": "0064473120"},
{"url": "https://www.goodreads.com/book/show/36529.Narrative_of_the_Life_of_Frederick_Douglass", "num_ratings": "75,676", "num_reviews": "3,218", "avg_ratings": 3.98, "genres": ["Nonfiction", "History", "Classics", "Biography", "Autobiography", "Memoir", "Academic", "School"], "title": "Narrative of the Life of Frederick Douglass", "description": ["Published in the bicentenary year of Frederick Douglass’s birth and in a Black Lives Matter era, this edition of Narrative of the Life of Frederick Douglass presents new research into his life as an activist and an author. A revolutionary reformer who traveled in Scotland, Ireland, England, and Wales as well as the US, Douglass published many foreign-language editions of h", "Published in the bicentenary year of Frederick Douglass’s birth and in a Black Lives Matter era, this edition of Narrative of the Life of Frederick Douglass presents new research into his life as an activist and an author. A revolutionary reformer who traveled in Scotland, Ireland, England, and Wales as well as the US, Douglass published many foreign-language editions of his Narrative. While there have been many Douglasses over the decades and even centuries, the Frederick Douglass we need now is no iconic, mythic, or legendary self-made man but a fallible, mortal, and human individual: a husband, father, brother, and son. His rallying cry inspires today’s activism: “Agitate! Agitate! Agitate!”", "Recognizing that Douglass was bought and sold on the northern abolitionist podium no less than on the southern auction block, this edition introduces readers to Douglass’s multiple declarations of independence. The Narrative appears alongside his private correspondence as well as the early speeches and writings in which he did justice to the “grim horrors of slavery.” This volume also traces Douglass’s activism and authorship in the context of the reformist work of his wife, Anna Murray, and of his daughters and sons."], "author": "Frederick Douglass", "num_pages": "158", "awards": [], "places": ["United States of America", "Maryland"], "character_names": ["Frederick Douglass"], "language": "English", "publish_date": "2004-09-01 00:00:00", "ISBN": "1580495761"},
{"url": "https://www.goodreads.com/book/show/266661.Fire_from_the_Rock", "num_ratings": "1,467", "num_reviews": "226", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Cultural", "African American", "Fiction"], "title": "Fire from the Rock", "description": ["Sylvia Patterson is shocked and confused when she is asked to be one of the first black students to attend Central High School, which is scheduled to be integrated in September 1957, whether the citizens or governor of Arkansas like it or not. Before Sylvia makes her final decision, smoldering racial tension in the town ignites into flame. When the smoke clears, she sees c", "Sylvia Patterson is shocked and confused when she is asked to be one of the first black students to attend Central High School, which is scheduled to be integrated in September 1957, whether the citizens or governor of Arkansas like it or not. Before Sylvia makes her final decision, smoldering racial tension in the town ignites into flame. When the smoke clears, she sees clearly that nothing is going to stop the change from coming. It is up to her generation to make it happen, in as many different ways as there are colors in the world."], "author": "Sharon M. Draper", "num_pages": "231", "awards": [], "places": ["Arkansas"], "character_names": [], "language": "English", "publish_date": "2007-08-16 00:00:00", "ISBN": "0525477209"},
{"url": "https://www.goodreads.com/book/show/294874.Street_Love", "num_ratings": "1,073", "num_reviews": "196", "avg_ratings": 3.75, "genres": ["Young Adult", "Poetry", "Romance", "Cultural", "African American", "Realistic Fiction"], "title": "Street Love", "description": ["A story of star-crossed urban love by two-time National Book Award finalist Walter Dean Myers. Have you ever loved someone from the wrong side of the tracks? Damien has everything going for him. His family wants him to date Roxanne. He falls for Junice, whose life is totally messed up. But Junice tells him that he's the one who needs the reality check. Sometimes the greate", "A story of star-crossed urban love by two-time National Book Award finalist Walter Dean Myers. Have you ever loved someone from the wrong side of the tracks? Damien has everything going for him. His family wants him to date Roxanne. He falls for Junice, whose life is totally messed up. But Junice tells him that he's the one who needs the reality check. Sometimes the greatest obstacle to finding true love is ourselves. Harlem meets Shakespeare in this fresh, original free-verse novel by Michael L. Printz."], "author": "Walter Dean Myers", "num_pages": "134", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "0060280794"},
{"url": "https://www.goodreads.com/book/show/45537.The_Road_to_Paris", "num_ratings": "1,120", "num_reviews": "205", "avg_ratings": 4.01, "genres": ["Realistic Fiction", "Young Adult", "Childrens", "Middle Grade", "Cultural", "African American", "Childrens", "Fiction", "Childrens", "Chapter Books", "Childrens", "Juvenile", "Family Law", "Fostering", "Cultural"], "title": "The Road to Paris", "description": ["Paris has just moved in with the Lincoln family, and isn't thrilled to be in yet another foster home. She has a tough time trusting people, and she misses her brother, who's been sent to a boys' home. Over time, the Lincolns grow on Paris. But no matter how hard she tries to fit in, she can't ignore the feeling that she never will, especially in a town that's mostly white", "Paris has just moved in with the Lincoln family, and isn't thrilled to be in yet another foster home. She has a tough time trusting people, and she misses her brother, who's been sent to a boys' home. Over time, the Lincolns grow on Paris. But no matter how hard she tries to fit in, she can't ignore the feeling that she never will, especially in a town that's mostly white while she is half black. It isn't long before Paris has a big decision to make about where she truly belongs. Nikki Grimes has created a portrait of a young girl who, in the midst of being shuffled back and forth between homes and realizing things about other people and the world around her, gradually embarks on the road to discovering herself."], "author": "Nikki Grimes", "num_pages": "153", "awards": ["Coretta Scott King Award for Author Honor (2007)", "Judy Lopez Memorial Award for Children's Literature Nominee (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-05 00:00:00", "ISBN": "0399245375"},
{"url": "https://www.goodreads.com/book/show/339362.The_Fight", "num_ratings": "3,215", "num_reviews": "243", "avg_ratings": 4.5, "genres": ["Young Adult", "Drama", "Cultural", "African American", "Young Adult", "Teen", "Urban", "Realistic Fiction", "Fiction", "Romance", "Contemporary", "Love"], "title": "The Fight", "description": ["Brimming with the same spirited sense of style and magic as Disney's ", ", ", " introduces a fun, brazen new series featuring a young sistah who's learning that life in the hood is nothing compared to life in high school . . .", "Proudly hailing from Compton, USA, sixteen-year-old Jayd Jackson is no stranger to drive-by shootings or run-ins with the friendly n", "Brimming with the same spirited sense of style and magic as Disney's ", ", ", " introduces a fun, brazen new series featuring a young sistah who's learning that life in the hood is nothing compared to life in high school . . .", "Proudly hailing from Compton, USA, sixteen-year-old Jayd Jackson is no stranger to drive-by shootings or run-ins with the friendly neighborhood crackhead. Street-smart, book-smart, and life-smart, she's nobody's fool--least of all KJ's, the most popular and cutest basketball jock at South Bay High, aka Drama High. Yes, it's a fact, Jayd fell hard for his player ways for a time, but now that KJ's shown his true colors--dumping Jayd because she refused to give up the cookies--she's through with him and his game playing for good.", "Jayd just wants to start her Junior year of high school drama free. But wanting ain't getting, especially at a place like Drama High, a predominately white high school in a wealthy part of Los Angeles, where Jayd and 30 other Compton kids get bussed to daily. Saying race relations aren't what they should be would be putting it mildly, and that's just the beginning of the drama. Jayd's first day back to school, KJ's new girlfriend, Trecee, steps to her wanting to fight. Egged on by Misty, Jayd's former best friend-turned-nemesis, Trecee wants to make Jayd understand that KJ is off limits--even if she has to do it with her fists. With the fight set for Friday, and the sistah drama at an all time high, Jayd is about to learn who's really got her back and more importantly, when she's got to watch it. But at least she can always count on Mama, and her mystical bag of tricks.", "Drama High is a remarkably assured debut, and L. Divine is a tantalizing and refreshing new voice. Jayd and her bold, honest, and laugh-out-loud funny assessment of life, along with her quirky cast of friends, classmates, loves, her magical family and eccentric neighbors make for an irresistible, can't-put-it-down read."], "author": "L. Divine", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-01 00:00:00", "ISBN": "0758216335"},
{"url": "https://www.goodreads.com/book/show/637086.Played", "num_ratings": "1,204", "num_reviews": "145", "avg_ratings": 4.05, "genres": ["Young Adult", "Romance", "Cultural", "African American", "Young Adult", "Teen", "Contemporary"], "title": "Played", "description": ["When one of Ian's boys dares him to get plain-faced Kylie Winship to sleep with him in just three weeks, he thinks it'll be a breeze. Tall and fine, with honey-colored skin and eyes, Ian is used to getting what he wants from girls. And if he succeeds in playing Kylie, he'll be down with the most popular crew in his high school. But this girl, who everyone considers a nobod", "When one of Ian's boys dares him to get plain-faced Kylie Winship to sleep with him in just three weeks, he thinks it'll be a breeze. Tall and fine, with honey-colored skin and eyes, Ian is used to getting what he wants from girls. And if he succeeds in playing Kylie, he'll be down with the most popular crew in his high school. But this girl, who everyone considers a nobody, is turning out to be more surprising than he ever could have imagined."], "author": "Dana  Davidson", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "0786836911"},
{"url": "https://www.goodreads.com/book/show/11337.The_Bluest_Eye", "num_ratings": "130,647", "num_reviews": "5,695", "avg_ratings": 4.0, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Cultural", "African American", "Literature"], "title": "The Bluest Eye", "description": [" is Toni Morrison's first novel, a book heralded for its richness of language and boldness of vision. Set in the author's girlhood hometown of Lorain, Ohio, it tells the story of black, eleven-year-old Pecola Breedlove. Pecola prays for her eyes to turn blue so that she will be as beautiful and beloved as all the blond, blue-eyed children in America. In the a", " is Toni Morrison's first novel, a book heralded for its richness of language and boldness of vision. Set in the author's girlhood hometown of Lorain, Ohio, it tells the story of black, eleven-year-old Pecola Breedlove. Pecola prays for her eyes to turn blue so that she will be as beautiful and beloved as all the blond, blue-eyed children in America. In the autumn of 1941, the year the marigolds in the Breedloves' garden do not bloom. Pecola's life does change- in painful, devastating ways.", "What its vivid evocation of the fear and loneliness at the heart of a child's yearning, and the tragedy of its fulfillment. ", " remains one of Tony Morrisons's most powerful, unforgettable novels- and a significant work of American fiction."], "author": "Toni Morrison", "num_pages": "216", "awards": ["National Book Critics Circle Award"], "places": ["United States of America", "Lorain, Ohio"], "character_names": ["Pauline Breedlove", "Cholly Breedlove", "Pecola Breedlove"], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0452287065"},
{"url": "https://www.goodreads.com/book/show/272347.Behind_You", "num_ratings": "782", "num_reviews": "145", "avg_ratings": 4.04, "genres": ["Young Adult", "Realistic Fiction", "Romance", "Young Adult", "Teen", "Death", "Cultural", "African American"], "title": "Behind You", "description": ["This beautiful sequel to If You Come Softly explores the experiences of those left behind after tragedy. It is a novel in which through hope, understanding and love, healing begins."], "author": "Jacqueline Woodson", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-12-28 00:00:00", "ISBN": "0142403903"},
{"url": "https://www.goodreads.com/book/show/934683.Hip_Hop_High_School", "num_ratings": "790", "num_reviews": "107", "avg_ratings": 4.16, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Music", "Hip Hop", "Young Adult", "High School"], "title": "Hip-Hop High School", "description": ["Theresa Anderson is every kind of smart: too smart-mouthed for her own good, street smart enough to deal with a neighborhood that gets more dangerous every day, and more book smart than anyone knows. But with the example of her super-achieving older brother towering above her, Theresa hasn't even been trying. How can a girl compete against the family favorite, especially w", "Theresa Anderson is every kind of smart: too smart-mouthed for her own good, street smart enough to deal with a neighborhood that gets more dangerous every day, and more book smart than anyone knows. But with the example of her super-achieving older brother towering above her, Theresa hasn't even been trying. How can a girl compete against the family favorite, especially when he's a certified local hero? With her parents and her teachers always on her case, and her best friend pregnant and dropped out of school, Theresa turns to hip-hop for comfort. Her favorite singers seem to understand her when no one else does. ", "Everything changes when a new man comes into Theresa's life: Devon, whose tough-guy reputation conceals a blazing ambition for academic success. Devon helps Theresa face up to her own talent and ambition, and together they set off on a three-year quest to beat the SAT and get into top colleges. But then Devon gets shot in a street fight, leaving Theresa with two piles of unfinished college applications-her own and Dev's-and time running out. . . ."], "author": "Alan Sitomer", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-04-01 00:00:00", "ISBN": "142310644X"},
{"url": "https://www.goodreads.com/book/show/1321542.Frenemies", "num_ratings": "1,786", "num_reviews": "91", "avg_ratings": 4.58, "genres": ["Drama", "Young Adult"], "title": "Frenemies", "description": ["South Bay High wouldn't be such a bad place to go to school if it weren't for all the drama. Not that Jayd Jackson's helping matters. She's right there in the center of it all--whether she wants to be or not. Maybe it just goes with the turf. After all, there's a reason they call this place Drama High. . .", "Jayd doesn't know what's going on with her girl, Nellie. Ever since", "South Bay High wouldn't be such a bad place to go to school if it weren't for all the drama. Not that Jayd Jackson's helping matters. She's right there in the center of it all--whether she wants to be or not. Maybe it just goes with the turf. After all, there's a reason they call this place Drama High. . .", "Jayd doesn't know what's going on with her girl, Nellie. Ever since she got named homecoming princess, she's been acting like Mickey and Jayd aren't her friends anymore, and she's even falling in deeper with Tania and her crew. It's amazing the girl can fit her new crown over that big head of hers.", "And then there's Jayd's boyfriend Jeremy. His aloof attitude is really getting on her nerves. Jayd's even starting to question his commitment, not to mention her own. Especially since lately, all she can think about is Rah--and that surprise kiss he planted on her the other day. . ."], "author": "L. Divine", "num_pages": "218", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-01 00:00:00", "ISBN": "0758225326"},
{"url": "https://www.goodreads.com/book/show/16169867-buck", "num_ratings": "1,551", "num_reviews": "242", "avg_ratings": 4.2, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography", "Cultural", "African American"], "title": "Buck: A Memoir", "description": ["  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But t", "  ", " MK Asante was born in Zimbabwe to American parents: a mother who led the new nation’s dance company and a father who would soon become a revered pioneer in black studies. But things fell apart, and a decade later MK was in America, a teenager lost in a fog of drugs, sex, and violence on the streets of North Philadelphia. Now he was alone—his mother in a mental hospital, his father gone, his older brother locked up in a prison on the other side of the country—and forced to find his own way to survive physically, mentally, and spiritually, by any means necessary.", " is a powerful memoir of how a precocious kid educated himself through the most unconventional teachers—outlaws and eccentrics, rappers and mystic strangers, ghetto philosophers and strippers, and, eventually, an alternative school that transformed his life with a single blank sheet of paper. It’s a one-of-a-kind story about finding your purpose in life, and an inspiring tribute to the power of education, art, and love to heal and redeem us."], "author": "M.K. Asante", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "0812993411"},
{"url": "https://www.goodreads.com/book/show/26832472-ia", "num_ratings": "130", "num_reviews": "87", "avg_ratings": 4.5, "genres": ["Young Adult", "Mystery", "Fiction", "Science Fiction", "Science Fiction Fantasy", "Fantasy"], "title": "IA: B.O.S.S.", "description": [" ", "Supernatural abilities are revealed. A sacrifice is made. A hero is born. ", " is quickly becoming complicated. After losing his best friend to suspicious circumstances, he turns his attention to ruthless gang leader Roffio Styles and the Incubus Apostles. ", "But to get answers, he must summon the world within on", " ", "Supernatural abilities are revealed. A sacrifice is made. A hero is born. ", " is quickly becoming complicated. After losing his best friend to suspicious circumstances, he turns his attention to ruthless gang leader Roffio Styles and the Incubus Apostles. ", "But to get answers, he must summon the world within once more. With his sister Meri's help, he begins to understand his strange experiences are actually telekinesis and telepathy at play--gifts from his forgotten father. ", "When Naz gets too close to the truth and tragedy strikes again, he must unleash his newfound abilities to wield his own unique brand of justice. Will his appetite to avenge his friend's murder lead to his destruction or his destiny? "], "author": "John Darryl Winston", "num_pages": "299", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5927441-just-another-hero", "num_ratings": "1,916", "num_reviews": "210", "avg_ratings": 4.27, "genres": ["Young Adult", "Realistic Fiction", "Cultural", "African American", "Fiction", "Young Adult", "High School"], "title": "Just Another Hero", "description": ["Jericho, November, Arielle, and their friends must step up big time to prevent a deadly school tragedy in this harrowing conclusion to Sharon M. Draper’s Jericho Trilogy.", "Arielle Gresham, disliked and mistrusted by most of the students at her school, has a secret past, an unbelievably complicated present, and a shaky future. But no one knows or cares because she has managed", "Jericho, November, Arielle, and their friends must step up big time to prevent a deadly school tragedy in this harrowing conclusion to Sharon M. Draper’s Jericho Trilogy.", "Arielle Gresham, disliked and mistrusted by most of the students at her school, has a secret past, an unbelievably complicated present, and a shaky future. But no one knows or cares because she has managed to alienate anyone who could help her. She tries to cope with problems at school, but difficulties at home almost break her spirit. Then, as the school tries to deal with an outbreak of false fire alarms, a series of thefts, and Arielle discovers that one classmate is addicted to prescriptions drugs, and another who is a victim on vicious online bullying. Outward appearances are seldom what they seem to be—everyone is dealing with something, it’s all a matter of how you deal with it, Arielle is figuring out. But one kid can’t, and as he starts to crack, could he take the school tumbling down with him?", "A hero is needed. But what makes a hero?"], "author": "Sharon M. Draper", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-23 00:00:00", "ISBN": "1416907009"},
{"url": "https://www.goodreads.com/book/show/568857.Broken_China", "num_ratings": "848", "num_reviews": "91", "avg_ratings": 4.2, "genres": ["Young Adult", "Cultural", "African American", "Urban", "Fiction", "Realistic Fiction", "Young Adult", "Teen", "Sociology", "Abuse"], "title": "Broken China", "description": [" ", " China Cup Cameron might miss school or fall asleep in class sometimes, but she's trying hard to be a good mother to Amina, her two-year-old daughter. When tragedy befalls the small family, China must quit", " ", " China Cup Cameron might miss school or fall asleep in class sometimes, but she's trying hard to be a good mother to Amina, her two-year-old daughter. When tragedy befalls the small family, China must quit school and work full-time to make ends meet. But the only place in town that's willing to hire a fourteen-year-old high-school dropout is Obsidian Queens, a strip club, and China is forced to make some difficult and potentially self-destructive decisions."], "author": "Lori Aurelia Williams", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-01 00:00:00", "ISBN": "1416916180"},
{"url": "https://www.goodreads.com/book/show/238838.Begging_for_Change", "num_ratings": "2,429", "num_reviews": "248", "avg_ratings": 4.23, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Young Adult", "Teen", "Cultural", "African American", "Social Issues", "Poverty", "Academic", "School", "Young Adult", "Coming Of Age", "Family", "Childrens", "Middle Grade"], "title": "Begging for Change", "description": ["Desperate to get her mother out of their rough situation, Raspberry steals money from a friend and now she must deal with the consequences and guilt, fearing that she may be going down the same path as her drug-addicted and thieving father. Reprint."], "author": "Sharon G. Flake", "num_pages": "248", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2004-05-31 00:00:00", "ISBN": "0786814055"},
{"url": "https://www.goodreads.com/book/show/238836.Money_Hungry", "num_ratings": "3,868", "num_reviews": "449", "avg_ratings": 4.08, "genres": ["Young Adult", "Realistic Fiction", "Cultural", "African American", "Fiction", "Young Adult", "Teen"], "title": "Money Hungry", "description": ["All thirteen-year-old Raspberry can think of is making money so that she and her mother never have to worry about living on the streets again."], "author": "Sharon G. Flake", "num_pages": "188", "awards": ["Coretta Scott King Award for Author Honor (2002)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2003-03-03 00:00:00", "ISBN": "0786815035"},
{"url": "https://www.goodreads.com/book/show/368468.Bud_Not_Buddy", "num_ratings": "83,084", "num_reviews": "4,440", "avg_ratings": 3.9, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Childrens", "Middle Grade"], "title": "Bud, Not Buddy", "description": ["It's 1936, in Flint, Michigan. Times may be hard, and ten-year-old Bud may be a motherless boy on the run, but Bud's got a few things going for him:", "He has his own suitcase full of special things.", "He's the author of Bud Caldwell's Rules and Things for Having a Funner Life and Making a Better Liar Out of Yourself.", "His momma never told him who his father was, but she left a clu", "It's 1936, in Flint, Michigan. Times may be hard, and ten-year-old Bud may be a motherless boy on the run, but Bud's got a few things going for him:", "He has his own suitcase full of special things.", "He's the author of Bud Caldwell's Rules and Things for Having a Funner Life and Making a Better Liar Out of Yourself.", "His momma never told him who his father was, but she left a clue: flyers advertising Herman E. Calloway and his famous band, the Dusky Devastators of the Depression!!!!!!", "Bud's got an idea that those flyers will lead him to his father. Once he decides to hit the road and find this mystery man, nothing can stop him--not hunger, not fear, not vampires, not even Herman E. Calloway himself."], "author": "Christopher Paul Curtis", "num_pages": "243", "awards": ["Newbery Medal (2000)", "Book Sense Book of the Year Award Nominee for Children (2000)", "Grand Canyon Reader Award for Teen Book (2002)", "Nene Award (2002)", "Pennsylvania Young Readers' Choice Award for Grades 6-8 (2001)", "Dorothy Canfield Fisher Children's Book Award (2001)", "Coretta Scott King Award for Author (2000)", "Pacific Northwest Library Association Young Reader's Choice Award for Junior (2002)", "IRA Children’s and Young Adult’s Book Award for Older Reader Category (2000)", "New Mexico Land of Enchantment Award for Young Adult (2003)"], "places": ["Flint, Michigan", "Michigan"], "character_names": [], "language": "English", "publish_date": "1999-09-07 00:00:00", "ISBN": "0385323069"},
{"url": "https://www.goodreads.com/book/show/44184.Monster", "num_ratings": "52,439", "num_reviews": "4,939", "avg_ratings": 3.71, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Young Adult", "Teen", "Mystery", "Crime", "Cultural", "African American"], "title": "Monster", "description": ["Sometimes I feel like I have walked into the middle of a movie. Maybe I can make my own movie. The film will be the story of my life. No, not my life, but of this experience. I'll call it what the lady who is the prosecutor called me. ", "Sometimes I feel like I have walked into the middle of a movie. Maybe I can make my own movie. The film will be the story of my life. No, not my life, but of this experience. I'll call it what the lady who is the prosecutor called me. ", "Sixteen-year-old Steve Harmon is on trial for murder. A Harlem drugstore owner was shot and killed in his store, and the word is that Steve served as the lookout.", "Guilty or innocent, Steve becomes a pawn in the hands of \"the system,\" cluttered with cynical authority figures and unscrupulous inmates, who will turn in anyone to shorten their own sentences. For the first time, Steve is forced to think about who he is as he faces prison, where he may spend all the tomorrows of his life.", "As a way of coping with the horrific events that entangle him, Steve, an amateur filmmaker, decides to transcribe his trial into a script, just like in the movies. He writes it all down, scene by scene, the story of how his whole life was turned around in an instant. But despite his efforts, reality is blurred and his vision obscured until he can no longer tell who he is or what is the truth. This compelling novel is Walter Dean Myers's writing at its best."], "author": "Walter Dean Myers", "num_pages": "281", "awards": ["Michael L. Printz Award (2000)", "Coretta Scott King Award for Author Honor (2000)", "Boston Globe-Horn Book Award Nominee for Fiction (1999)", "Lincoln Award Nominee (2005)", "National Book Award Finalist for Young People's Literature (1999)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-12-14 00:00:00", "ISBN": "0064407314"},
{"url": "https://www.goodreads.com/book/show/266668.Romiette_and_Julio", "num_ratings": "5,532", "num_reviews": "700", "avg_ratings": 3.93, "genres": ["Young Adult", "Romance", "Realistic Fiction", "Fiction", "Young Adult", "Teen"], "title": "Romiette and Julio", "description": ["Like Shakespeare's famous star-crossed lovers, Romiette Cappelle and Julio Montague face strong opposition to their budding romance. In their case, a dangerous gang's disapproval of their interracial relationship puts the two in mortal peril."], "author": "Sharon M. Draper", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-05-01 00:00:00", "ISBN": "0613337239"},
{"url": "https://www.goodreads.com/book/show/21471358-ia", "num_ratings": "672", "num_reviews": "335", "avg_ratings": 4.04, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Fiction"], "title": "IA: Initiate", "description": [" ", "One young man with latent supernatural abilities plus one street gang hell-bent on recruiting him equals... IA: Initiate. ", " thing in the world to thirteen-year-old orphan, \"Naz\" Andersen is keeping his little sister safe from the streets of a Chicago/Detroit-like urban ghetto known as the Exclave.", " ", "One young man with latent supernatural abilities plus one street gang hell-bent on recruiting him equals... IA: Initiate. ", " thing in the world to thirteen-year-old orphan, \"Naz\" Andersen is keeping his little sister safe from the streets of a Chicago/Detroit-like urban ghetto known as the Exclave. Naz tries to stay out of the way at his foster parent's home, but he walks in his sleep. He is unable to keep the fact that he hears voices from his therapist. He attempts to go unnoticed at school and in the streets of the Exclave but attracts the attention of friends and bullies alike. ", "Naz is ordinary, or so he thinks. He harbors a secret of which he is unaware. A seemingly random act of gang violence propels Naz on a path that leads to discoveries about his supernatural abilities, abilities that will ultimately decide whether he lives or dies. Now he must navigate his turbulent surroundings and face the full force of the world around him. The only way he can survive is to discover the supernatural world within. "], "author": "John Darryl Winston", "num_pages": "220", "awards": ["Readers' Favorite Book Award (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-03-07 00:02:00", "ISBN": "1946006785"},
{"url": "https://www.goodreads.com/book/show/148769.The_First_Part_Last", "num_ratings": "13,685", "num_reviews": "1,564", "avg_ratings": 3.97, "genres": ["Young Adult", "Realistic Fiction", "Young Adult", "Teen", "Fiction"], "title": "The First Part Last", "description": ["Bobby's a classic urban teenager. He's restless. He's impulsive. But the thing that makes him different is this: He's going to be a father. His girlfriend, Nia, is pregnant, and their lives are about to change forever. Instead of spending time with friends, they'll be spending time with doctors, and next, diapers. They have options: keeping the baby, adoption. They want to", "Bobby's a classic urban teenager. He's restless. He's impulsive. But the thing that makes him different is this: He's going to be a father. His girlfriend, Nia, is pregnant, and their lives are about to change forever. Instead of spending time with friends, they'll be spending time with doctors, and next, diapers. They have options: keeping the baby, adoption. They want to do the right thing. ", " If only it was clear what the right thing was."], "author": "Angela Johnson", "num_pages": "144", "awards": ["Georgia Peach Book Award (2004)", "Michael L. Printz Award (2004)", "Coretta Scott King Award for Author (2004)", "Lincoln Award Nominee (2006)", "Green Mountain Book Award (2006)", "Missouri Gateway Readers Award Nominee (2006)", "Alabama Author Award for Young Adult (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "0689849230"},
{"url": "https://www.goodreads.com/book/show/119832.Forged_by_Fire", "num_ratings": "7,628", "num_reviews": "1,084", "avg_ratings": 4.35, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Young Adult", "Teen", "Contemporary", "Sociology", "Abuse", "Academic", "School", "Cultural", "Childrens", "Middle Grade"], "title": "Forged by Fire", "description": ["When Gerald was a child he was fascinated by fire. But fire is dangerous and powerful, and tragedy strikes. His substance-addicted mother is taken from him. Then he loses the loving generosity of a favorite aunt. A brutal stepfather with a flaming temper and an evil secret makes his life miserable. The one bright light in Gerald's life is his little half sister, Angel, who", "When Gerald was a child he was fascinated by fire. But fire is dangerous and powerful, and tragedy strikes. His substance-addicted mother is taken from him. Then he loses the loving generosity of a favorite aunt. A brutal stepfather with a flaming temper and an evil secret makes his life miserable. The one bright light in Gerald's life is his little half sister, Angel, whom he struggles to protect from her father, Jordan Sparks, who abuses her, and from their mother, whose irresponsible behavior forces Gerald to work hard to keep the family together. As a teenager, Gerald finds success as a member of the Hazelwood Tigers basketball team, while Angel develops her talents as a dancer. Trouble still haunts them, however, and Gerald learns, painfully, that young friends can die and old enemies must be faced. In the end he must stand up to his stepfather alone in a blazing confrontation.", "Sharon M. Draper has interwoven characters and events from her previous novel, Tears of a Tiger, in this unflinchingly realistic portrayal of poverty and child abuse. It is an inspiring story of a young man who rises above the tragic circumstances of his life by drawing on the love and strength of family and friends."], "author": "Sharon M. Draper", "num_pages": "160", "awards": ["Coretta Scott King Award for Author (1998)"], "places": [], "character_names": [], "language": "English", "publish_date": "1998-01-01 00:00:00", "ISBN": "0689818513"},
{"url": "https://www.goodreads.com/book/show/119838.Tears_of_a_Tiger", "num_ratings": "12,622", "num_reviews": "2,112", "avg_ratings": 4.17, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Cultural", "African American", "Young Adult", "Teen"], "title": "Tears of a Tiger", "description": ["After a car accident kills Robert, Andy's best friend and teammate on the Hazelwood High Tigers, Andy doesn't know if he can go on. He's consumed with guilt for driving the night of the accident after a long evening of drinking and partying. With perceptiveness and compassion, ", " portrays an African-American teenager who feels driven to consider suicide in th", "After a car accident kills Robert, Andy's best friend and teammate on the Hazelwood High Tigers, Andy doesn't know if he can go on. He's consumed with guilt for driving the night of the accident after a long evening of drinking and partying. With perceptiveness and compassion, ", " portrays an African-American teenager who feels driven to consider suicide in the wake of a devastating tragedy."], "author": "Sharon M. Draper", "num_pages": "180", "awards": ["John Steptoe New Talent Author Award (1995)"], "places": ["Cincinnati, Ohio"], "character_names": [], "language": "English", "publish_date": "1996-02-01 00:00:00", "ISBN": "0689806981"},
{"url": "https://www.goodreads.com/book/show/266666.November_Blues", "num_ratings": "3,546", "num_reviews": "507", "avg_ratings": 4.3, "genres": ["Young Adult", "Realistic Fiction", "Cultural", "African American", "Young Adult", "Teen", "Contemporary", "Fiction"], "title": "November Blues", "description": ["In this second novel in Sharon M. Draper’s Jericho Trilogy and Coretta Scott King Honor Book, Jericho and November are locked together in pain from the past and fear for the future, and it feels as though there’s no way to escape either.", "When November Nelson loses her boyfriend, Josh, to a pledge stunt gone horribly wrong, she thinks her life can’t possibly get any worse. B", "In this second novel in Sharon M. Draper’s Jericho Trilogy and Coretta Scott King Honor Book, Jericho and November are locked together in pain from the past and fear for the future, and it feels as though there’s no way to escape either.", "When November Nelson loses her boyfriend, Josh, to a pledge stunt gone horribly wrong, she thinks her life can’t possibly get any worse. But Josh left something behind that will change November’s life forever. She’s pregnant and now she’s faced with the biggest decision of her life. How in the world will she tell her mom? And how will Josh’s parents take the news? She’s never needed a friend more.", "Jericho Prescott lost his best friend when he lost his cousin, Josh, and the pain is almost more than he can bear. His world becomes divided into “before” and “after” Josh’s death. He finds the only way he can escape the emptiness he feels is to quit doing the things that made him happy when his cousin was alive, such as playing his beloved trumpet. At the same time, he begins playing football, where he hopes the physical pain will suppress the emotional agony. But will hiding behind shoulder pads really help? And will his gridiron obsession prevent him from being there for his cousin’s girlfriend when she needs him most?"], "author": "Sharon M. Draper", "num_pages": "316", "awards": ["Coretta Scott King Award for Author Honor (2008)", "Missouri Gateway Readers Award Nominee (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-23 00:00:00", "ISBN": "1416906983"},
{"url": "https://www.goodreads.com/book/show/108077.The_Watsons_Go_to_Birmingham_1963", "num_ratings": "51,202", "num_reviews": "4,254", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Historical", "Childrens", "Middle Grade"], "title": "The Watsons Go to Birmingham - 1963", "description": ["The Newbery Honor-winning American classic, ", ", celebrates 20 years with this anniversary edition featuring a special letter from Christopher Paul Curtis and an introduction by noted educator Dr. Pauletta Bracy.", " Enter the hilarious world of ten-year-old Kenny and his family, the Weird Watsons of Flint, Michigan. There's Momma, Dad, little", "The Newbery Honor-winning American classic, ", ", celebrates 20 years with this anniversary edition featuring a special letter from Christopher Paul Curtis and an introduction by noted educator Dr. Pauletta Bracy.", " Enter the hilarious world of ten-year-old Kenny and his family, the Weird Watsons of Flint, Michigan. There's Momma, Dad, little sister Joetta, and brother Byron, who's thirteen and an \"official juvenile delinquent.\" When Momma and Dad decide it's time for a visit to Grandma, Dad comes home with the amazing Ultra-Glide, and the Watsons set out on a trip like no other. They're heading South to Birmingham, Alabama, toward one of the darkest moments in America's history."], "author": "Christopher Paul Curtis", "num_pages": "224", "awards": ["Newbery Medal Nominee (1996)", "Jane Addams Children's Book Award Nominee for Older Children (1996)", "Dorothy Canfield Fisher Children's Book Award Nominee (1997)", "Coretta Scott King Award for Author Honor (1996)", "New Mexico Land of Enchantment Award for Young Adult (2000)", "California Young Readers Medal for Middle School/Junior High (1998)", "Best Children's Books of the Year (Bank Street College of Education) (1995)"], "places": ["Alabama"], "character_names": [], "language": "English", "publish_date": "2000-12-12 00:00:00", "ISBN": "044022800X"},
{"url": "https://www.goodreads.com/book/show/90420.Copper_Sun", "num_ratings": "11,286", "num_reviews": "1,538", "avg_ratings": 4.31, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Cultural", "African American"], "title": "Copper Sun", "author": "Sharon M. Draper", "num_pages": "302", "awards": ["South Carolina Book Award Nominee for Young Adult (2009)", "Coretta Scott King Award for Author (2007)", "Society of Midland Authors Award Nominee for Children's Fiction (2007)", "Missouri Gateway Readers Award Nominee (2009)"], "places": ["Ghana", "United States of America"], "character_names": [], "language": "English", "publish_date": "2006-09-20 00:00:00", "ISBN": "0689821816"}
]