[
{"url": "https://www.goodreads.com/book/show/24445517-maybe-someday", "num_ratings": "137,232", "num_reviews": "15,389", "avg_ratings": 4.31, "genres": ["Romance", "New Adult", "Contemporary", "Young Adult", "Romance", "Contemporary Romance"], "title": "Maybe Someday", "description": ["Contains exclusive content: songs from Griffin Peterson ", "Sydney is living in an idyllic bubble—she's a dedicated student with a steady job on the side. She lives with her best friend, has a great boyfriend, and the music coming from the balcony opposite hers is fast becoming the soundtrack to her life. But when Sydney finds out her boyfriend is cheating on her, the bubble b", "Contains exclusive content: songs from Griffin Peterson ", "Sydney is living in an idyllic bubble—she's a dedicated student with a steady job on the side. She lives with her best friend, has a great boyfriend, and the music coming from the balcony opposite hers is fast becoming the soundtrack to her life. But when Sydney finds out her boyfriend is cheating on her, the bubble bursts. The mysterious and attractive man behind the music, Ridge, gives Sydney hope that she can move on and they begin to write songs together. But moving on is harder than she expects, Sydney can only hope…. ", "Maybe someday… ", "Colleen Hoover draws you in to this passionate tale of music, love and betrayal…"], "author": "Colleen Hoover", "num_pages": "385", "awards": ["Goodreads Choice Award Nominee for Romance (2014)"], "places": [], "character_names": ["Sydney Blake", "Ridge Lawson", "Warren Russell", "Bridgette Cox", "Brennan Lawson"], "language": "English", "publish_date": "2014-03-18 00:00:00"},
{"url": "https://www.goodreads.com/book/show/89359.Phantom_Waltz", "num_ratings": "4,725", "num_reviews": "258", "avg_ratings": 4.19, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Westerns"], "title": "Phantom Waltz", "description": ["One glance. That's all it takes. Wealthy rancher Ryan Kendrick falls hard and fast for lovely Bethany Coulter. A beguiling mix of sass and shyness, naivete and maturity, she shares his passion for horses, has a great", "One glance. That's all it takes. Wealthy rancher Ryan Kendrick falls hard and fast for lovely Bethany Coulter. A beguiling mix of sass and shyness, naivete and maturity, she shares his passion for horses, has a great sense of humor, and can light up a room with her beautiful smile. She's absolutely perfect--in every way but one...", "A long-ago barrel-racing accident has left Bethany confined to a wheelchair. In the years since, she has known both betrayal and heartbreak--and vowed never to open her heart to a man again. She has even accepted the possibility that she'll never be able to enjoy a healthy intimate relationship--or have children of her own. But there's something about handsome Ryan Kendrick. Something that makes her believe she can overcome every obstacle. Something that makes her believe in lifelong, lasting love..."], "author": "Catherine Anderson", "num_pages": "418", "awards": [], "places": ["Crystal Falls, Oregon"], "character_names": ["Bethany Coulter", "Ryan Kendrick"], "language": "English", "publish_date": "2007-01-02 00:00:00", "ISBN": "0451220684"},
{"url": "https://www.goodreads.com/book/show/439288.Speak", "num_ratings": "404,773", "num_reviews": "19,988", "avg_ratings": 4.01, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction"], "title": "Speak", "description": ["\"Speak up for yourself--we want to know what you have to say.\" From the first moment of her freshman year at Merryweather High, Melinda knows this is a big fat lie, part of the nonsense of high school. She is friendless, outcast, because she busted an end-of-summer party by calling the cops, so now nobody will talk to her, let alone listen to her. As time passes, she becom", "\"Speak up for yourself--we want to know what you have to say.\" From the first moment of her freshman year at Merryweather High, Melinda knows this is a big fat lie, part of the nonsense of high school. She is friendless, outcast, because she busted an end-of-summer party by calling the cops, so now nobody will talk to her, let alone listen to her. As time passes, she becomes increasingly isolated and practically stops talking altogether. Only her art class offers any solace, and it is through her work on an art project that she is finally able to face what really happened at that terrible party: she was raped by an upperclassman, a guy who still attends Merryweather and is still a threat to her. Her healing process has just begun when she has another violent encounter with him. But this time Melinda fights back, refuses to be silent, and thereby achieves a measure of vindication. ", "In Laurie Halse Anderson's powerful novel, an utterly believable heroine with a bitterly ironic voice delivers a blow to the hypocritical world of high school. She speaks for many a disenfranchised teenager while demonstrating the importance of speaking up for oneself."], "author": "Laurie Halse Anderson", "num_pages": "208", "awards": ["SCBWI Golden Kite Award for Fiction (1999)", "Edgar Award Nominee for Best Young Adult (2000)", "Michael L. Printz Award Nominee (2000)", "South Carolina Book Award for Young Adult Book Award (2002)", "Dorothy Canfield Fisher Children's Book Award Nominee (2001)", "Evergreen Teen Book Award (2002)", "Boston Globe-Horn Book Award (2000)", "California Young Readers Medal Nominee for Young Adult (2003)", "Lincoln Award Nominee (2005)", "National Book Award Finalist for Young People's Literature (1999)", "Oklahoma Sequoyah Award for YA (2002)"], "places": ["Syracuse, New York"], "character_names": ["Rachel Honeybourne (Beauty)", "Ivy Hall", "Heather", "Nichole Smythe Burnell", "Melinda Sordino", "Andy Evans", "David Petrakis", "Mr. Freeman"], "language": "English", "publish_date": "2001-04-01 00:00:00", "ISBN": "014131088X"},
{"url": "https://www.goodreads.com/book/show/28194.Inkheart", "num_ratings": "316,759", "num_reviews": "10,932", "avg_ratings": 3.86, "genres": ["Fantasy", "Young Adult", "Fiction"], "title": "Inkheart", "description": ["Alternate cover edition: ", "From internationally acclaimed storyteller Cornelia Funke, this bestselling, magical epic is now out in paperback!", "One cruel night, Meggie's father reads aloud from a book called INKHEART-- and an evil ruler escapes the boundaries of fiction and lands in their living room. Suddenly, Meggie is smack in the middle of the kind of adventure", "Alternate cover edition: ", "From internationally acclaimed storyteller Cornelia Funke, this bestselling, magical epic is now out in paperback!", "One cruel night, Meggie's father reads aloud from a book called INKHEART-- and an evil ruler escapes the boundaries of fiction and lands in their living room. Suddenly, Meggie is smack in the middle of the kind of adventure she has only read about in books. Meggie must learn to harness the magic that has conjured this nightmare. For only she can change the course of the story that has changed her life forever.", "This is INKHEART--a timeless tale about books, about imagination, about life. Dare to read it aloud."], "author": "Cornelia Funke", "num_pages": "548", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2004)", "Zilveren Griffel (2006)", "Nene Award (2009)", "Flicker Tale Children's Book Award (2006)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2004)", "Literaturpreis der Jury der jungen Leser for Kinderbuch (2004)"], "places": ["Italy"], "character_names": ["Meggie Folchart", "Mortimer Folchart", "Elinor Loredan", "Farid", "Resa Folchart", "Staubfinger", "Capricorn"], "language": "English", "publish_date": "2005-06-01 00:00:00", "ISBN": "0439709105"},
{"url": "https://www.goodreads.com/book/show/7511070-beastly", "num_ratings": "163,064", "num_reviews": "8,858", "avg_ratings": 3.84, "genres": ["Young Adult", "Fantasy", "Romance", "Fantasy", "Fairy Tales", "Retellings"], "title": "Beastly", "description": ["A modern retelling of \"Beauty and the Beast\" from the point of view of the Beast, a vain Manhattan private school student who is turned into a monster and must find true love before he can return to his human form."], "author": "Alex Flinn", "num_pages": "6", "awards": ["California Young Readers Medal Nominee for Young Adult (2012)", "Lincoln Award Nominee (2012)", "Missouri Gateway Readers Award Nominee (2010)"], "places": ["New York (the state)", "New York City, New York"], "character_names": ["Magda", "Kyle Kingsbury", "Will Fratalli", "Linda \"Lindy\" Owens", "Kendra Hilferty", "Rob Kingsbury", "Mr. Anderson"], "language": "English", "publish_date": "2010-06-30 00:00:00", "ISBN": "1441849661"},
{"url": "https://www.goodreads.com/book/show/25814647-rush", "num_ratings": "3,638", "num_reviews": "543", "avg_ratings": 4.35, "genres": ["Romance", "New Adult", "Contemporary", "Romance", "Contemporary Romance", "Music"], "title": "RUSH", "description": ["To be blind is not miserable; not to be able to bear blindness, that is miserable. --John Milton ", "Charlotte Conroy, Juilliard-trained violinist, was on the cusp of greatness when tragedy swooped down on dark wings, crushing her hopes and breaking her heart. The music that used to sing in her soul has grown quiet, and she feels on the verge of setting down her violin for goo", "To be blind is not miserable; not to be able to bear blindness, that is miserable. --John Milton ", "Charlotte Conroy, Juilliard-trained violinist, was on the cusp of greatness when tragedy swooped down on dark wings, crushing her hopes and breaking her heart. The music that used to sing in her soul has grown quiet, and she feels on the verge of setting down her violin for good. To pay the bills, she accepts a job as a personal assistant to a bitter, angry young man who’s been disabled by a horrific accident … ", "Noah Lake was an extreme sport athlete, journalist and photographer. He roamed the world in search of his next adrenaline high, until a cliff-dive left him in a coma. He awakes to find his career gone, his dreams shattered to pieces, his world an endless blackness that will never lift. ", "Charlotte begins to see that beneath Noah’s angry, brittle exterior is a young man in a pain. She is determined to show him that his life isn’t over, that he has so much to live for, never dreaming that she would become the only light in his darkness, or that he would help her find the music in hers. ", "The life he knew is over. The life she wants is just out of reach. ", "Together, they must face their fears and rediscover what it means to really live."], "author": "Emma   Scott", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/542752.Things_Not_Seen", "num_ratings": "23,459", "num_reviews": "1,795", "avg_ratings": 3.88, "genres": ["Young Adult", "Science Fiction", "Fiction", "Fantasy"], "title": "Things Not Seen", "description": ["Bobby Phillips is an average fifteen-year-old boy. Until the morning he wakes up and can't see himself in the mirror. Not blind, not dreaming. Bobby is just plain invisible...", "There doesn't seem to be any rhyme or reason to Bobby's new condition; even his dad the physicist can't figure it out. For Bobby that means no school, no friends, no life. He's a missing person. Then", "Bobby Phillips is an average fifteen-year-old boy. Until the morning he wakes up and can't see himself in the mirror. Not blind, not dreaming. Bobby is just plain invisible...", "There doesn't seem to be any rhyme or reason to Bobby's new condition; even his dad the physicist can't figure it out. For Bobby that means no school, no friends, no life. He's a missing person. Then he meets Alicia. She's blind, and Bobby can't resist talking to her, trusting her. But people are starting to wonder where Bobby is. Bobby knows that his invisibility could have dangerous consequences for his family and that time is running out. He has to find out how to be seen again before it's too late."], "author": "Andrew Clements", "num_pages": "256", "awards": ["Schneider Family Book Award for Teen Book (2004)", "California Young Readers Medal for Middle School/Junior High (2005)"], "places": [], "character_names": ["Bobby Phillips", "Alicia von Dorn"], "language": "English", "publish_date": "2004-02-24 00:00:00", "ISBN": "0142400769"},
{"url": "https://www.goodreads.com/book/show/350683.Yours_Until_Dawn", "num_ratings": "8,964", "num_reviews": "579", "avg_ratings": 4.09, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Yours Until Dawn", "description": ["Gabriel Fairchild's valor during battle earns him the reputation of hero, but costs him both his sight and his hope for the future. Abandoned by the fiancée he adored, the man who once walked like a prince among London's elite secludes himself in his family's mansion, cursing his way through dark days and darker nights. ", "Gabriel Fairchild's valor during battle earns him the reputation of hero, but costs him both his sight and his hope for the future. Abandoned by the fiancée he adored, the man who once walked like a prince among London's elite secludes himself in his family's mansion, cursing his way through dark days and darker nights. "], "author": "Teresa Medeiros", "num_pages": "373", "awards": ["Maggie Award for Excellence (Georgia Romance Writers) Nominee for Historical Romance (2005)"], "places": ["England"], "character_names": ["Gabriel Fairchild", "Samantha Wickersham"], "language": "English", "publish_date": "2004-07-27 00:00:00", "ISBN": "0060513659"},
{"url": "https://www.goodreads.com/book/show/821611.The_Story_of_My_Life", "num_ratings": "116,518", "num_reviews": "1,965", "avg_ratings": 4.07, "genres": ["Nonfiction", "Biography", "Classics", "Autobiography", "Memoir", "Biography", "Autobiography", "History", "Biography Memoir", "Historical", "Inspirational", "Disability"], "title": "The Story of My Life", "description": ["An American classic rediscovered by each generation, ", " is Helen Keller’s account of her triumph over deafness and blindness. Popularized by the stage play and movie The Miracle Worker, Keller’s story has become a symbol of hope for people all over the world. ", "This book–published when Keller was only twenty-two–portrays the wild child who is locked in the", "An American classic rediscovered by each generation, ", " is Helen Keller’s account of her triumph over deafness and blindness. Popularized by the stage play and movie The Miracle Worker, Keller’s story has become a symbol of hope for people all over the world. ", "This book–published when Keller was only twenty-two–portrays the wild child who is locked in the dark and silent prison of her own body. With an extraordinary immediacy, Keller reveals her frustrations and rage, and takes the reader on the unforgettable journey of her education and breakthroughs into the world of communication. From the moment Keller recognizes the word “water” when her teacher finger-spells the letters, we share her triumph as “that living word awakened my soul, gave it light, hope, joy, set it free!” An unparalleled chronicle of courage, ", " remains startlingly fresh and vital more than a century after its first publication, a timeless testament to an indomitable will."], "author": "Helen Keller", "num_pages": "240", "awards": [], "places": ["Tuscumbia, Alabama", "Boston, Massachusetts", "Alabama"], "character_names": ["Anne Sullivan", "Helen Keller"], "language": "English", "publish_date": "1990-05-01 00:00:00", "ISBN": "0553213873"},
{"url": "https://www.goodreads.com/book/show/119073.The_Name_of_the_Rose", "num_ratings": "247,358", "num_reviews": "6,871", "avg_ratings": 4.11, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Classics", "Historical", "Literature", "Mystery", "Crime", "European Literature", "Italian Literature", "Cultural", "Italy", "Novels"], "title": "The Name of the Rose", "description": ["The year is 1327. Benedictines in a wealthy Italian abbey are suspected of heresy, and Brother William of Baskerville arrives to investigate. When his delicate mission is suddenly overshadowed by seven bizarre deaths, Brother William turns detective. His tools are the logic of Aristotle, the theology of Aquinas, the empirical insights of Roger Bacon—all sharpened to a glis", "The year is 1327. Benedictines in a wealthy Italian abbey are suspected of heresy, and Brother William of Baskerville arrives to investigate. When his delicate mission is suddenly overshadowed by seven bizarre deaths, Brother William turns detective. His tools are the logic of Aristotle, the theology of Aquinas, the empirical insights of Roger Bacon—all sharpened to a glistening edge by wry humor and a ferocious curiosity. He collects evidence, deciphers secret symbols and coded manuscripts, and digs into the eerie labyrinth of the abbey, where “the most interesting things happen at night.”"], "author": "Umberto Eco", "num_pages": "536", "awards": ["إمبيرتو", "Premio Strega (1981)", "Edgar Award Nominee for Best Novel (1984)", "PEN Translation Prize for William Weaver (1984)", "Premio Anghiari (1981)", "Premio Il Libro dell'anno (1981)", "Prix Médicis Etranger (1982)", "このミステリーがすごい！ for Best Translated Mystery Novel of the Year in Japan (1991)"], "places": ["Italian Benedictine monastery", "Italy"], "character_names": ["William of Baskerville", "Adso of Melk"], "language": "English", "publish_date": "1994-09-28 00:00:00", "ISBN": "0156001314"},
{"url": "https://www.goodreads.com/book/show/78433.The_Blind_Assassin", "num_ratings": "119,948", "num_reviews": "6,569", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Cultural", "Canada"], "title": "The Blind Assassin", "description": ["Margaret Atwood takes the art of storytelling to new heights in a dazzling novel that unfolds layer by astonishing layer and concludes in a brilliant and wonderfully satisfying twist. Told in a style that magnificently captures the colloquialisms and clichés of the 1930s and 1940s, The Blind Assassin is a richly layered and uniquely rewarding experience.", "It opens with these", "Margaret Atwood takes the art of storytelling to new heights in a dazzling novel that unfolds layer by astonishing layer and concludes in a brilliant and wonderfully satisfying twist. Told in a style that magnificently captures the colloquialisms and clichés of the 1930s and 1940s, The Blind Assassin is a richly layered and uniquely rewarding experience.", "It opens with these simple, resonant words: \"Ten days after the war ended, my sister drove a car off the bridge.\" They are spoken by Iris, whose terse account of her sister Laura's death in 1945 is followed by an inquest report proclaiming the death accidental. But just as the reader expects to settle into Laura's story, Atwood introduces a novel-within-a- novel. Entitled The Blind Assassin, it is a science fiction story told by two unnamed lovers who meet in dingy backstreet rooms. When we return to Iris, it is through a 1947 newspaper article announcing the discovery of a sailboat carrying the dead body of her husband, a distinguished industrialist.", "For the past twenty-five years, Margaret Atwood has written works of striking originality and imagination. In The Blind Assassin, she stretches the limits of her accomplishments as never before, creating a novel that is entertaining and profoundly serious. The Blind Assassin proves once again that Atwood is one of the most talented, daring, and exciting writers of our time. Like The Handmaid's Tale, it is destined to become a classic."], "author": "Margaret Atwood", "num_pages": "637", "awards": ["Man Booker Prize (2000)", "Orange Prize Nominee for Fiction Shortlist (2001)", "Hammett Prize (2000)", "Puddly Award for New Novel (2001)", "International DUBLIN Literary Award Nominee (2002)"], "places": ["Canada", "Toronto, Ontario", "Southwest Ontario"], "character_names": ["Iris Chase", "Laura Chase", "Alex Thomas", "Richard Griffen"], "language": "English", "publish_date": "2001-09-03 00:00:00", "ISBN": "1860498809"},
{"url": "https://www.goodreads.com/book/show/18143977-all-the-light-we-cannot-see", "num_ratings": "695,847", "num_reviews": "61,150", "avg_ratings": 4.32, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "War"], "title": "All the Light We Cannot See", "description": ["From the highly acclaimed, multiple award-winning Anthony Doerr, the stunningly beautiful instant ", " bestseller about a blind French girl and a German boy whose paths collide in occupied Franc", "From the highly acclaimed, multiple award-winning Anthony Doerr, the stunningly beautiful instant ", " bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.", "Marie-Laure lives in Paris near the Museum of Natural History, where her father works. When she is twelve, the Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo, where Marie-Laure’s reclusive great uncle lives in a tall house by the sea. With them they carry what might be the museum’s most valuable and dangerous jewel.", "In a mining town in Germany, Werner Pfennig, an orphan, grows up with his younger sister, enchanted by a crude radio they find that brings them news and stories from places they have never seen or imagined. Werner becomes an expert at building and fixing these crucial new instruments and is enlisted to use his talent to track down the resistance. Deftly interweaving the lives of Marie-Laure and Werner, Doerr illuminates the ways, against all odds, people try to be good to one another.", "Doerr’s “stunning sense of physical detail and gorgeous metaphors” (", ") are dazzling. Ten years in the writing, a National Book Award finalist, ", " is a magnificent, deeply moving novel from a writer “whose sentences never fail to thrill” (", ")."], "author": "Anthony Doerr", "num_pages": "531", "awards": ["Pulitzer Prize for Fiction (2015)", "Audie Award for Fiction (2015)", "ALA Alex Award (2015)", "Dayton Literary Peace Prize for Fiction (Runner-Up) (2015)", "Ohioana Book Award for Fiction (2015)", "Andrew Carnegie Medal for Fiction (2015)", "Idaho Book of the Year Award (2014)", "National Book Award Finalist for Fiction (2014)", "Goodreads Choice Award for Historical Fiction (2014)", "International DUBLIN Literary Award Nominee (2016)"], "places": ["Paris", "Saint Malo", "Zollverein"], "character_names": ["Werner Pfennig", "Marie-Laure LeBlanc", "Frank Volkheimer", "Etienne LeBlanc", "Frederick (All the Light We Cannot See)", "Jutta Pfennig", "Madame Manec", "Reinhold von Rumpel", "Frau Elena", "Daniel LeBlanc", "Dr. Hauptmann", "Walter Bernd", "Bastian"], "language": "English", "publish_date": "2014-05-06 00:00:00", "ISBN": "1476746583"},
{"url": "https://www.goodreads.com/book/show/22327.The_Miracle_Worker", "num_ratings": "30,488", "num_reviews": "370", "avg_ratings": 4.21, "genres": ["Plays", "Classics", "Biography", "Nonfiction", "Drama"], "title": "The Miracle Worker", "description": ["NO ONE COULD REACH HER.", "Twelve-year-old Helen Keller lived in a prison of silence and darkness. Born deaf, blind, and mute, with no way to express herself or comprehend those around her, she flew into primal rages against anyone who tried to help her, fighting tooth and nail with a strength born of furious, unknowing desperation. ", "Then Annie Sullivan came. Half-blind herself", "NO ONE COULD REACH HER.", "Twelve-year-old Helen Keller lived in a prison of silence and darkness. Born deaf, blind, and mute, with no way to express herself or comprehend those around her, she flew into primal rages against anyone who tried to help her, fighting tooth and nail with a strength born of furious, unknowing desperation. ", "Then Annie Sullivan came. Half-blind herself, but possessing an almost fanatical determination, she would begin a frightening and incredibly moving struggle to tame the wild girl no one could reach, and bring Helen into the world at last...."], "author": "William  Gibson", "num_pages": "128", "awards": [], "places": [], "character_names": ["Anne Sullivan", "Helen Keller"], "language": "English", "publish_date": "2002-06-25 00:00:00", "ISBN": "0743457587"},
{"url": "https://www.goodreads.com/book/show/15733541-speechless", "num_ratings": "1,618", "num_reviews": "278", "avg_ratings": 3.86, "genres": ["Romance", "M M Romance", "Disability", "Romance", "Contemporary", "Short Stories"], "title": "Speechless", "description": ["Travis Miller has a machining job, a cat named Elwood, and a pathetic love life. The one bright spot in his existence is the handsome guitar player he sometimes passes on his way home from work. But when he finally gathers the courage to speak to the man, Travis learns that former novelist Drew Clifton suffers from aphasia: Drew can understand everything Travis says, but h", "Travis Miller has a machining job, a cat named Elwood, and a pathetic love life. The one bright spot in his existence is the handsome guitar player he sometimes passes on his way home from work. But when he finally gathers the courage to speak to the man, Travis learns that former novelist Drew Clifton suffers from aphasia: Drew can understand everything Travis says, but he is unable to speak or write.", "The two lonely men form a friendship that soon blossoms into romance. But communication is only one of their challenges-there's also Travis's inexperience with love and his precarious financial situation. If words are the bridge between two people, what will keep them together?"], "author": "Kim Fielding", "num_pages": "62", "awards": [], "places": ["Portland, Oregon"], "character_names": [], "language": "English", "publish_date": "2012-07-18 00:00:00", "ISBN": "1613727178"},
{"url": "https://www.goodreads.com/book/show/22020052-it-ain-t-me-babe", "num_ratings": "26,319", "num_reviews": "2,916", "avg_ratings": 4.2, "genres": ["Romance", "Dark", "Sociology", "Abuse", "New Adult"], "title": "It Ain't Me, Babe", "description": ["Sinning never felt so good… A fortuitous encounter. A meeting that should never have happened. ", "Many years ago, two children from completely different worlds forged a connection, a fateful connection, an unbreakable bond that would change their lives forever… ", "Salome knows only one way to live—under Prophet David’s rule. In the commune she calls home, Salome knows nothing of", "Sinning never felt so good… A fortuitous encounter. A meeting that should never have happened. ", "Many years ago, two children from completely different worlds forged a connection, a fateful connection, an unbreakable bond that would change their lives forever… ", "Salome knows only one way to live—under Prophet David’s rule. In the commune she calls home, Salome knows nothing of life beyond her strict faith, nor of life beyond the Fence—the fence that cages her, keeps her trapped in an endless cycle of misery. A life she believes she is destined to always lead, until a horrific event sets her free. ", "Fleeing the absolute safety of all she has ever known, Salome is thrust into the world outside, a frightening world full of uncertainty and sin; into the protective arms of a person she believed she would never see again. ", "River ‘Styx’ Nash knows one thing for certain in life—he was born and bred to wear a cut. Raised in a turbulent world of sex, Harleys, and drugs, Styx, unexpectedly has the heavy burden of the Hades Hangmen gavel thrust upon him, and all at the ripe old age of twenty-six—much to his rivals’ delight. ", "Haunted by a crushing speech impediment, Styx quickly learns to deal with his haters. Powerful fists, an iron jaw and the skillful use of his treasured German blade has earned him a fearsome reputation as a man not to be messed with in the shadowy world of outlaw MC’s. A reputation that successfully keeps most people far, far away. ", "Styx has one rule in life—never let anyone get too close. It’s a plan that he has stuck to for years, that is, until a young woman is found injured on his lot… a woman who looks uncannily familiar, a woman who clearly does not belong in his world, yet a woman he feels reluctant to let go…"], "author": "Tillie Cole", "num_pages": "466", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23162673-silence-of-scandal", "num_ratings": "164", "num_reviews": "32", "avg_ratings": 3.76, "genres": ["Romance", "Historical Romance", "Romance", "Did Not Finish", "Historical", "Historical Fiction", "Historical", "Historical", "Regency"], "title": "Silence Of Scandal", "description": ["A Regency Romance. ", "The war is over for the nation but not for the new Duke of Ormond. With death and debt stalking his every waking moment, caught between blackmailers and his brother’s deepest secret, Alexander’s dreams lie in tatters but he never surrendered on the battlefields of the Peninsular and he’s not about to admit defeat now. Even if that means marrying a woman", "A Regency Romance. ", "The war is over for the nation but not for the new Duke of Ormond. With death and debt stalking his every waking moment, caught between blackmailers and his brother’s deepest secret, Alexander’s dreams lie in tatters but he never surrendered on the battlefields of the Peninsular and he’s not about to admit defeat now. Even if that means marrying a woman he has never laid eyes on before. ", "With her father’s warnings still fresh in her mind and her imperfections obvious to any who know her, Elizabeth’s options for freedom are diminishing with every trembling step. Available suitors are few and far between. Marriage to a debt ridden, aging fortune hunter will not be easy but with no other alternatives and destitution threatening she cannot escape her fate. ", "Falling in love hadn't been a possibility Alexander ever considered but one glance at his beautiful bride’s tear filled onyx eyes has his blood surging through his veins, his heart pounding in his chest and he can no longer hide his emotions behind a facade of polite indifference. ", "Elizabeth hadn’t expected him to be handsome. She hadn’t expected him to greet her with a sparkling sapphire gaze. She hadn’t expected gentle fingertips on her skin or her heart to break at the tender words on his lips. ", "With Ormond and the family jewels at stake, Alexander’s resolve to defeat his enemies is soon put to the test as rumour, intrigue and scandal threaten his and Elizabeth’s blossoming affections. There is clearly another plan. There had always been another plan. A plan of greed and vengeance devised to ruin Ormond and its descendants for all time. ", "Silence of Scandal is a light-hearted, easy read suitable for age 16 and upwards. (Contains some swearing and sensual love scenes) "], "author": "Jackie Williams", "num_pages": "349", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/272334.Feathers", "num_ratings": "5,475", "num_reviews": "1,033", "avg_ratings": 3.66, "genres": ["Young Adult", "Historical", "Historical Fiction", "Realistic Fiction", "Childrens", "Middle Grade", "Fiction"], "title": "Feathers", "description": ["\"Hope is the thing with feathers,\" starts the poem Frannie is reading in school. Frannie hasn't thought much about hope. There are so many other things to think about. Each day, her friend Samantha seems a bit more holy. There is a new boy in class everyone is calling the Jesus Boy. And although the new boy looks like a white kid, he says he is not white. Who is he?", "\"Hope is the thing with feathers,\" starts the poem Frannie is reading in school. Frannie hasn't thought much about hope. There are so many other things to think about. Each day, her friend Samantha seems a bit more holy.\u0094 There is a new boy in class everyone is calling the Jesus Boy. And although the new boy looks like a white kid, he says he\u0092 is not white. Who is he?"], "author": "Jacqueline Woodson", "num_pages": "118", "awards": ["Newbery Medal Nominee (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-01 00:00:00", "ISBN": "0399239898"},
{"url": "https://www.goodreads.com/book/show/27425821-blind-chess", "num_ratings": "16", "num_reviews": "3", "avg_ratings": 4.44, "genres": ["Mystery", "Suspense"], "title": "Blind Chess", "description": [" The most dangerous game of all is about to begin. ", "It is supposed to be ", ". Two partners, a team. What happens when a member of this team of Private Investigators is shot, prognosis unknown? ", "As Alexandra Neve lays comatose and defenceless, Ashford Egan must take on their enemy alone, and find the cagiest criminal Scotland Yard has seen in decades. Determined to", " The most dangerous game of all is about to begin.  ", "It is supposed to be ", ". Two partners, a team. What happens when a member of this team of Private Investigators is shot, prognosis unknown? ", "As Alexandra Neve lays comatose and defenceless, Ashford Egan must take on their enemy alone, and find the cagiest criminal Scotland Yard has seen in decades. Determined to succeed, Egan will stop at nothing. He’ll hit on married women, plant bugs, hire hitmen. And he’ll do it all blind, which makes things ten times as difficult. ", "Double-crossed by friends, convinced there is corruption in those sworn to uphold the law, Egan is forced to form unlikely alliances as he moves forward in a game that requires skills, nerves of steel, and a willingness to play against all odds. ", " The Neve & Egan Cases Series eBook Categories:  ", "- Mystery Series ", "- Crime Thrillers ", "- Private Investigator Series ", "- Private Detective Novels ", "- British Mystery & Crime"], "author": "Cristelle Comby", "num_pages": "222", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-11-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22827124-martin-rides-the-moor", "num_ratings": "3", "num_reviews": "2", "avg_ratings": 4.33, "genres": ["Young Adult", "Animals", "Horses"], "title": "Martin Rides the Moor", "description": ["Young adult tale of a boy on Dartmoor and his pony Tuppence."], "author": "Vian Smith", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1974-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23383181-danse-macabre", "num_ratings": "40", "num_reviews": "13", "avg_ratings": 4.3, "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller"], "title": "Danse Macabre", "description": ["Private investigators Alexandra Neve and Ashford Egan are hired to succeed where the police have failed, to safely return home a missing ballerina. With no lead to pursue and no idea who could be behind the young woman’s kidnapping, they soon find themselves at a loss as to what to do. ", "To make matters worse, the heart of England seems to be caught in the middle of a little", "Private investigators Alexandra Neve and Ashford Egan are hired to succeed where the police have failed, to safely return home a missing ballerina. With no lead to pursue and no idea who could be behind the young woman’s kidnapping, they soon find themselves at a loss as to what to do. ", "To make matters worse, the heart of England seems to be caught in the middle of a little Ice Age. With snow endlessly falling and Tube lines either too cramped up to use or out of service, it is a pain to do any legwork in the huge metropolis. ", "Oh, and because trouble never comes alone, there may also be a serial killer on the loose in the streets of East London..."], "author": "Cristelle Comby", "num_pages": "254", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-05 00:00:00", "ISBN": "1502723778"},
{"url": "https://www.goodreads.com/book/show/18633760-ruby-heart", "num_ratings": "47", "num_reviews": "13", "avg_ratings": 3.91, "genres": ["Mystery", "Fiction"], "title": "Ruby Heart", "description": ["When elderly client Doris Hargrave informs private investigator Alexandra Neve that her beloved antique ruby heart necklace has gone missing for the second time in a period of over sixty years, Alexandra knows this is no ordinary jewellery theft. The ruby heart is a family heirloom and the only thing that connects an ailing Mrs Hargrave to her parents, who were murdered du", "When elderly client Doris Hargrave informs private investigator Alexandra Neve that her beloved antique ruby heart necklace has gone missing for the second time in a period of over sixty years, Alexandra knows this is no ordinary jewellery theft. The ruby heart is a family heirloom and the only thing that connects an ailing Mrs Hargrave to her parents, who were murdered during the Holocaust. ", "To solve the case, Alexandra and her business partner, blind history professor Ashford Egan, must sift through obscure Holocaust documents to find out the truth. It’s that way that they learn of a secret World War II-era love affair which could hold the key to all the answers they are looking for. Meanwhile, Egan is under immense pressure from the university to quit his private investigating business, and Alexandra is afraid that a man she trusts will leave her. Again. ", "When Alexandra begins to receive anonymous threats and her flat is vandalised, this all becomes ", ". Knowing that there is someone out there to hurt her, Alexandra vows to find that elusive ruby heart if it’s the last thing she ever does."], "author": "Cristelle Comby", "num_pages": "290", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "1492813435"},
{"url": "https://www.goodreads.com/book/show/14829873-bound-to-you", "num_ratings": "1,083", "num_reviews": "53", "avg_ratings": 3.85, "genres": ["Adult Fiction", "Erotica", "Romance", "Romance", "Contemporary Romance", "Romance", "Erotic Romance", "Contemporary", "Erotica", "Bdsm"], "title": "Bound To You", "description": ["John Corcoran loved the isolation of the Shawnee National Forest with the crisp spring air, the sounds of nature, and the bracing scent of pine. Isolation is what movie star Jennifer Turner craved as well, an escape that only a weekend hike, a long and blissful distance from Hollywood, could provide.", "Yesterday, they were strangers--until a fateful accident, deep in the fore", "John Corcoran loved the isolation of the Shawnee National Forest with the crisp spring air, the sounds of nature, and the bracing scent of pine. Isolation is what movie star Jennifer Turner craved as well, an escape that only a weekend hike, a long and blissful distance from Hollywood, could provide.", "Yesterday, they were strangers--until a fateful accident, deep in the forest and far from civilization, throws them together and plunges them both into darkness. For Jennifer it is as unnerving as the night itself, trapped in such close quarters with a man as mysterious as John. He is alpha: bold, rough, and masculine, but with a scent of firewood and spice she finds intoxicating.", "In the dark, Jennifer's nightmares spring to life. The only way to vanquish them is by submitting to blind, naked need. Now, as intimately close as a man and a woman can be, they find themselves alone, battling fear and vulnerability. Only an unexpected passion will comfort them--a sensual, raw experience from which neither is certain they want to be rescued."], "author": "Bethany Kane", "num_pages": "123", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17590877-russian-dolls", "num_ratings": "111", "num_reviews": "28", "avg_ratings": 3.89, "genres": ["Mystery", "Adult", "Suspense", "Thriller", "Fiction"], "title": "Russian Dolls", "description": ["Alexandra Neve is a student at University College London whose world suddenly falls apart. When her best friend jumps from the university’s rooftop, she can’t stop herself from asking, ‘Why?’ The police rule her friend’s death a suicide and for them the case is closed — so whom can she turn to for help?", "Sometimes the person you need the most is the one you least expect to f", "Alexandra Neve is a student at University College London whose world suddenly falls apart. When her best friend jumps from the university’s rooftop, she can’t stop herself from asking, ‘Why?’ The police rule her friend’s death a suicide and for them the case is closed — so whom can she turn to for help?", "Sometimes the person you need the most is the one you least expect to find, and in this case it’s none other than Ashford Egan, a blind middle-aged history professor, who’s more willing than most to listen to what she has to say. ", "Neve and Egan are as different as they come. She’s restless, careless at times, and fearless when the need arises, while he’s almost the complete opposite: a deep thinker with an analytical mind, a highly rational and collected individual.", "As they enter the violent world of the Russian mafia, they must overcome their differences and learn to work together. It’s their only chance if they want to survive."], "author": "Cristelle Comby", "num_pages": "302", "awards": [], "places": ["London, England"], "character_names": [], "language": "English", "publish_date": "2013-03-08 00:00:00", "ISBN": "148203039X"},
{"url": "https://www.goodreads.com/book/show/1237825.What_the_Deaf_Mute_Heard", "num_ratings": "273", "num_reviews": "37", "avg_ratings": 3.76, "genres": ["Fiction", "Historical", "Historical Fiction", "Book Club"], "title": "What the Deaf-Mute Heard", "description": ["A magical novel whose hero, like Forrest Gump, enchants with his uncanny ability to be a key player in every important event in his small Southern town. Ignored, ridiculed, trapped and empowered by his silence, he sees and hears all. And what the deaf-mute hears are everybody's secrets--except his own."], "author": "G.D. Gearino", "num_pages": "224", "awards": ["Barry Award Nominee for Best First Novel (1997)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1996-01-24 00:00:00", "ISBN": "0684813378"},
{"url": "https://www.goodreads.com/book/show/18768459-a-daddy-for-luke", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 3.67, "genres": [], "title": "A Daddy For Luke (Cottonwood County Chronicles, #1)", "description": ["David Winston’s reputation and fame come from his popular novels. Born to parents who hadn’t planned a family, David was taught to think he wouldn’t amount to anything, so becoming a popular author is a surprise to him. He wants to hang on to his success. Born in Center City, then forced to leave eight years ago, he’s back, but not for long. It’s a gamble just being in tow", "David Winston’s reputation and fame come from his popular novels. Born to parents who hadn’t planned a family, David was taught to think he wouldn’t amount to anything, so becoming a popular author is a surprise to him. He wants to hang on to his success. Born in Center City, then forced to leave eight years ago, he’s back, but not for long. It’s a gamble just being in town: he risks colliding with his past, which could ruin his future. Then he meets Sandy Archer and tempts fate by staying in town a little longer.", "Sandy Archer is content to care for her son Luke, work her way up in her job at the Cottonwood County Chronicle, and stay away from any more disastrous relationships. She has lived in Center City all her life and has adapted well to being legally blind. She’s touched when visiting author, David Winston offers to read his book to her. She discovers a kindred spirit. But her budding relationship is threatened when a relative cautions Sandy that David is not who he seems to be."], "author": "Christy Olesen", "num_pages": "188", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-29 00:00:00", "ISBN": "1493631667"},
{"url": "https://www.goodreads.com/book/show/20649195-because-you-ll-never-meet-me", "num_ratings": "4,228", "num_reviews": "895", "avg_ratings": 4.01, "genres": ["Young Adult", "Contemporary", "Lgbt", "Science Fiction"], "title": "Because You'll Never Meet Me", "description": ["Ollie and Moritz are best friends, but they can never meet. Ollie is allergic to electricity. Contact with it causes debilitating seizures. Moritz’s weak heart is kept pumping by an electronic pacemaker. If they ever did meet, Ollie would seize. But Moritz would die without his pacemaker. Both hermits from society, the boys develop a fierce bond through letters that become", "Ollie and Moritz are best friends, but they can never meet. Ollie is allergic to electricity. Contact with it causes debilitating seizures. Moritz’s weak heart is kept pumping by an electronic pacemaker. If they ever did meet, Ollie would seize. But Moritz would die without his pacemaker. Both hermits from society, the boys develop a fierce bond through letters that become a lifeline during dark times—as Ollie loses his only friend, Liz, to the normalcy of high school and Moritz deals with a bully set on destroying him.", "A story of impossible friendship and hope under strange circumstances, this debut is powerful, dark and humorous in equal measure. These extraordinary voices bring readers into the hearts and minds of two special boys who, like many teens, are just waiting for their moment to shine."], "author": "Leah Thomas", "num_pages": "344", "awards": ["William C. Morris YA Debut Award Nominee (2016)"], "places": [], "character_names": [], "language": null, "publish_date": "2015-07-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10841336-darker-still", "num_ratings": "4,217", "num_reviews": "676", "avg_ratings": 3.63, "genres": ["Young Adult", "Fantasy", "Historical", "Historical Fiction", "Fantasy", "Paranormal", "Romance", "Historical"], "title": "Darker Still", "description": ["It was as if he called to me, demanding I reach out and touch the brushstrokes of color swirled onto the canvas. It was the most exquisite portrait I'd ever seen--everything about Lord Denbury was unbelievable...utterly breathtaking and eerily lifelike.", "There was a reason for that. Because despite what everyone said, Denbury never had committed suicide. He wa", "It was as if he called to me, demanding I reach out and touch the brushstrokes of color swirled onto the canvas. It was the most exquisite portrait I'd ever seen--everything about Lord Denbury was unbelievable...utterly breathtaking and eerily lifelike.", "There was a reason for that. Because despite what everyone said, Denbury never had committed suicide. He was alive. Trapped within his golden frame.", "I've crossed over into his world within the painting, and I've seen what dreams haunt him. They haunt me too. He and I are inextricably linked--bound together to watch the darkness seeping through the gas-lit cobblestone streets of Manhattan. Unless I can free him soon, things will only get "], "author": "Leanna Renee Hieber", "num_pages": "320", "awards": [], "places": ["New York City, New York", "The Painting"], "character_names": ["Natalie Stewart", "Jonathon Whitby, Lord Denbury", "Mrs. Evelyn Northe"], "language": "English", "publish_date": "2011-11-08 00:00:00", "ISBN": "1402260520"},
{"url": "https://www.goodreads.com/book/show/3899622-hands-of-my-father", "num_ratings": "2,074", "num_reviews": "453", "avg_ratings": 4.06, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Hands of My Father: A Hearing Boy, His Deaf Parents, and the Language of Love", "description": ["With candor and humor, Uhlberg recounts a childhood spent largely as a bridge between his parents and the hearing world. Translating from sign language to spoken language and back again, he enables his father to communicate with local shopkeepers, awakens his parents when his baby brother cries, and even interprets at a less-than-glowing parent-teacher conference. At times", "With candor and humor, Uhlberg recounts a childhood spent largely as a bridge between his parents and the hearing world. Translating from sign language to spoken language and back again, he enables his father to communicate with local shopkeepers, awakens his parents when his baby brother cries, and even interprets at a less-than-glowing parent-teacher conference. At times, he's embarrassed by his parents, and hurt that his father is called \"dummy.\" But in the end, his overwhelming love and compassion leaves a lasting effect."], "author": "Myron Uhlberg", "num_pages": "232", "awards": [], "places": ["United States of America"], "character_names": ["Myron Uhlberg", "Louis Uhlberg", "Sarah Uhlberg"], "language": "English", "publish_date": "2009-02-03 00:00:00", "ISBN": "0553806882"},
{"url": "https://www.goodreads.com/book/show/24025830-untamed", "num_ratings": "2,408", "num_reviews": "183", "avg_ratings": 3.98, "genres": ["New Adult", "Romance", "Sociology", "Abuse"], "title": "Untamed", "description": ["No matter how hard I try, I never seem to be able to escape my family’s world. Their madness controls my life, just like insanity consumes my mind.", "Sometimes it’s hard to tell what’s real.", "Sometimes it’s hard to tell who I really am. The person everyone sees? Or the one I keep trapped inside?", "I wonder which person Ryler sees. Just like I wonder who I can trust.", "No matter how hard I try, I never seem to be able to escape my family’s world. Their madness controls my life, just like insanity consumes my mind.", "Sometimes it’s hard to tell what’s real.", "Sometimes it’s hard to tell who I really am. The person everyone sees? Or the one I keep trapped inside?", "I wonder which person Ryler sees. Just like I wonder who I can trust.", "I wonder too much.", "I wish I could just find a way to escape it all and finally be free.", "I live a double life and sometimes I hate myself for it. Watching Emery fall apart—pretending I don’t care—is killing me inside.", "I want to tell her the truth, but I also want a new life.", "I want too much. Sometimes it’s hard to tell what I really desire.", "I wish I could be free from the confusion, free from this life."], "author": "Jessica Sorensen", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/469396.In_This_Sign", "num_ratings": "311", "num_reviews": "42", "avg_ratings": 3.88, "genres": ["Fiction", "Adult Fiction", "Family"], "title": "In This Sign", "description": ["The highly acclaimed novel of a family whose love and courage enable them to survive in the silent world of the deaf."], "author": "Joanne Greenberg", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-09-15 00:00:00", "ISBN": "0805007229"},
{"url": "https://www.goodreads.com/book/show/15831074-sightless-spirits", "num_ratings": "10", "num_reviews": "1", "avg_ratings": 4.9, "genres": ["Reference", "Research"], "title": "Sightless Spirits", "description": ["The solitude of death and the responsibility of the living....", "After a wicked car accident, Julia's brother Aiden walked away unscathed, while she was left in the dark. Not all spirits cross over to the afterlife, willingly. Some are violently torn from this world before their time, left to search for a human with an aura, who can bridge the divide... ", "A year ago, Julia lear", "The solitude of death and the responsibility of the living....", "After a wicked car accident, Julia's brother Aiden walked away unscathed, while she was left in the dark. Not all spirits cross over to the afterlife, willingly. Some are violently torn from this world before their time, left to search for a human with an aura, who can bridge the divide... ", "A year ago, Julia learned how precious her sense of sight was, when she was left to balance between adjusting to blindness and discovering her ability to communicate with the dead. Miraculously, she can see spirits and is the only one who can help them, whether she wants to or not. Unable to block out their pleas, she discovers that the one, who killed them isn't finished killing and won't stop until he's had his fill.", "When evil upsets the balance, Julia must harness her gift to set things right. Can she learn to accept her new life and lead the lost souls to peace? Will continue her descent into the dark, rejoin the living, or become one of the lost souls she's attempting to help?"], "author": "Nicole  Rae", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-05-12 00:00:00", "ISBN": "147912964X"},
{"url": "https://www.goodreads.com/book/show/4418395-www", "num_ratings": "7,082", "num_reviews": "781", "avg_ratings": 3.81, "genres": ["Science Fiction", "Fiction", "Young Adult"], "title": "WWW: Wake", "description": ["Caitlin Decter is young, pretty, feisty, a genius at math, and blind. When she receives an implant to restore her sight, instead of seeing reality she perceives the landscape of the World Wide Web-where she makes contact with a mysterious consciousness existing only in cyberspace. "], "author": "Robert J. Sawyer", "num_pages": "354", "awards": ["Hugo Award Nominee for Best Novel (2010)", "Prix Aurora Award for Best Novel (2010)", "Goodreads Choice Award Nominee for Science Fiction (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-04-07 00:00:00", "ISBN": "0441016790"},
{"url": "https://www.goodreads.com/book/show/28667634-levi", "num_ratings": "217", "num_reviews": "30", "avg_ratings": 3.79, "genres": ["Romance", "Contemporary"], "title": "Levi (Forbidden Desires, #2)", "description": ["Rejection.", "It is not something I'm used to.", "I'm a beautiful woman and I like carefree, no commitment sex. I'm a single man's dream. So when I set my sights on the new bouncer for Forbidden Desires and he doesn't share my enthusiasm for a wild night together, I'm dumbfounded as to why.", "Night after night, Levi ignores me–making me want him even more. I flirt and practically thr", "Rejection.", "It is not something I'm used to.", "I'm a beautiful woman and I like carefree, no commitment sex. I'm a single man's dream. So when I set my sights on the new bouncer for Forbidden Desires and he doesn't share my enthusiasm for a wild night together, I'm dumbfounded as to why.", "Night after night, Levi ignores me–making me want him even more. I flirt and practically throw myself at him, but he's a complete gentleman. His indifference only makes him more desirable. I've made him my next target. He'll be my lover, as soon as I figure out how to wear him down.", "My raw sex appeal isn't working with him and maybe there's a reason. He's hiding something underneath his large muscles and adorable dimples. Levi's keeping secrets from me and one night he reveals one of his secrets–he's vowed to be abstinent.", "What the hell am I going to do now?", "*Recommended for 18+ due to subject matter and sexual content.", "**HEA, no cliffhanger, interconnected stand-alone novel."], "author": "Justine Elvira", "num_pages": "229", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16116760-silence", "num_ratings": "25,390", "num_reviews": "2,167", "avg_ratings": 3.95, "genres": ["Young Adult", "Romance", "Contemporary", "Fiction"], "title": "Silence", "description": ["For eleven years, Oakley Farrell has been silent. At the age of five, she stopped talking, and no one seems to know why. Refusing to communicate beyond a few physical actions, Oakley remains in her own little world. ", "Bullied at school, she has just one friend, Cole Benson. Cole stands by her, refusing to believe that she is not perfect the way she is. Over the years, they h", "For eleven years, Oakley Farrell has been silent. At the age of five, she stopped talking, and no one seems to know why. Refusing to communicate beyond a few physical actions, Oakley remains in her own little world. ", "Bullied at school, she has just one friend, Cole Benson. Cole stands by her, refusing to believe that she is not perfect the way she is. Over the years, they have developed their own version of a normal friendship. However, will it still work as they start to grow even closer? ", "When Oakley is forced to face someone from her past, can she hold her secret in any longer?"], "author": "Natasha Preston", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-19 00:00:00", "ISBN": "1480118516"},
{"url": "https://www.goodreads.com/book/show/18746598-sounds-of-silence", "num_ratings": "14", "num_reviews": "4", "avg_ratings": 4.21, "genres": [], "title": "Sounds of Silence", "description": ["Twelve-year-old Marco Lippa is the star pitcher for his Little League baseball team and does his best to lead his team to victory against their cross-town rivals, reveling in the cheering and applause. ", "After one particular game, he becomes sick and is rushed to the hospital. Treated for meningococcal disease, Marco wakes up to discover that he is deaf—and all of his dreams", "Twelve-year-old Marco Lippa is the star pitcher for his Little League baseball team and does his best to lead his team to victory against their cross-town rivals, reveling in the cheering and applause. ", "After one particular game, he becomes sick and is rushed to the hospital. Treated for meningococcal disease, Marco wakes up to discover that he is deaf—and all of his dreams seem to crumble. ", "Now Marco must come to terms with living in a silent world—and the grief, anger, and loss that seem to go with it. He is enrolled at the state boarding school for the deaf, leaving behind his comfortable home and his family and friends while he re-learns how to communicate and function without his hearing. ", "As if that wasn't hard enough, he quickly discovers that being deaf does not exempt him from the “normal” anxieties he faced at home—bullies, girls, and fitting in. Will he ever find his way back to his dreams?"], "author": "Phillip Tomasso III", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-16 00:00:00", "ISBN": "1935460412"},
{"url": "https://www.goodreads.com/book/show/18926796-she-is-not-invisible", "num_ratings": "4,591", "num_reviews": "963", "avg_ratings": 3.62, "genres": ["Young Adult", "Mystery", "Contemporary", "Fiction", "Realistic Fiction", "Young Adult", "Teen"], "title": "She Is Not Invisible", "description": ["The feeling that coincidences give us tells us they mean something... But what? What do they mean?", "LAURETH PEAK'S father has taught her to look for recurring events, patterns, and numbers - a skill at which she's remarkably talented. When he goes missing while researching coincidence for a new book, Laureth and her younger brother fly from London to New York and must unrave", "The feeling that coincidences give us tells us they mean something... But what? What do they mean?", "LAURETH PEAK'S father has taught her to look for recurring events, patterns, and numbers - a skill at which she's remarkably talented. When he goes missing while researching coincidence for a new book, Laureth and her younger brother fly from London to New York and must unravel a series of cryptic messages to find him. The complication: Laureth is blind. Reliant on her other senses and on her brother to survive, Laureth finds that rescuing her father will take all her skill at spotting the extraordinary, and sometimes dangerous, connections in a world full of darkness.", "From acclaimed storyteller Marcus Sedgwick, ", " is a gripping contemporary thriller threaded with unsettling coincidence and a vivid and convincing portrayal of a young woman living without sight."], "author": "Marcus Sedgwick", "num_pages": "224", "awards": ["North East Teenage Book Award Nominee (2014)"], "places": [], "character_names": ["Stan", "Laureth Peak", "Jack Peak", "Benjamin Peak", "Michael Walker"], "language": null, "publish_date": "2014-04-22 00:00:00", "ISBN": "1596438037"},
{"url": "https://www.goodreads.com/book/show/1371694.Talking_Hands", "num_ratings": "364", "num_reviews": "70", "avg_ratings": 4.0, "genres": ["Nonfiction", "Humanities", "Language", "Humanities", "Linguistics", "Science"], "title": "Talking Hands: What Sign Language Reveals about the Mind", "description": ["Imagine a village where everyone \"speaks\" sign language. Just such a village -- an isolated Bedouin community in Israel with an unusually high rate of deafness -- is at the heart of \"Talking Hands: What Sign Language Reveals About the Mind.\" There, an indigenous sign language has sprung up, used by deaf and hearing villagers alike. It is a language no outsider has been abl", "Imagine a village where everyone \"speaks\" sign language. Just such a village -- an isolated Bedouin community in Israel with an unusually high rate of deafness -- is at the heart of \"Talking Hands: What Sign Language Reveals About the Mind.\" There, an indigenous sign language has sprung up, used by deaf and hearing villagers alike. It is a language no outsider has been able to decode, until now.A \"New York Times\" reporter trained as a linguist, Margalit Fox is the only Western journalist to have set foot in this remarkable village. In \"Talking Hands, \" she follows an international team of scientists that is unraveling this mysterious language.", "Because the sign language of the village has arisen completely on its own, outside the influence of any other language, it is a living demonstration of the \"language instinct,\" man's inborn capacity to create language. If the researchers can decode this language, they will have helped isolate ingredients essential to all human language, signed and spoken. But as \"Talking Hands\" grippingly shows, their work in the village is also a race against time, because the unique language of the village may already be endangered.", "\"Talking Hands\" offers a fascinating introduction to the signed languages of the world -- languages as beautiful, vital and emphatically human as any other -- explaining why they are now furnishing cognitive scientists with long-sought keys to understanding how language works in the mind.", "Written in lyrical, accessible prose, \"Talking Hands\" will captivate anyone interested in language, the human mind and journeys to exotic places."], "author": "Margalit Fox", "num_pages": "354", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-08-01 00:00:00", "ISBN": "0743247124"},
{"url": "https://www.goodreads.com/book/show/21742113-flying-to-the-light", "num_ratings": "66", "num_reviews": "25", "avg_ratings": 4.45, "genres": ["Fantasy", "Thriller", "Fantasy", "Urban Fantasy"], "title": "Flying to the Light", "description": ["Seventeen year old Michael Anderson and his deaf kid brother, Danny, find themselves in mortal danger after their parents are kidnapped. Michael discovers Danny has a special gift—he knows what happens after a person dies—and now others want to know too. The brothers must outwit and outrun Samuel Herrington, a lethal biophysicist, the FBI, and even fellow Americans in a ha", "Seventeen year old Michael Anderson and his deaf kid brother, Danny, find themselves in mortal danger after their parents are kidnapped. Michael discovers Danny has a special gift—he knows what happens after a person dies—and now others want to know too. The brothers must outwit and outrun Samuel Herrington, a lethal biophysicist, the FBI, and even fellow Americans in a harrowing cross-country chase, because whoever gets to Danny first will have the power to rule the world."], "author": "Elyse Salpeter", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1765653.Blind_Sighted", "num_ratings": "125", "num_reviews": "23", "avg_ratings": 3.63, "genres": ["Young Adult", "Realistic Fiction", "Young Adult", "Teen", "Fiction"], "title": "Blind Sighted", "description": ["Just when things start coming together for Kirk Tobak, it looks like everything might fall apart. Fifteen years old, Kirk has always been a loner. He's smart, but does badly in school. He's funny, but never had too many friends. But when he gets demoted into a new English class, things begin to look up: He meets a rock-n-roll slacker, who becomes a real friend; and there's", "Just when things start coming together for Kirk Tobak, it looks like everything might fall apart. Fifteen years old, Kirk has always been a loner. He's smart, but does badly in school. He's funny, but never had too many friends. But when he gets demoted into a new English class, things begin to look up: He meets a rock-n-roll slacker, who becomes a real friend; and there's a girl who likes his writing-she might even like him. And his new job is great: He reads to a dynamic young blind woman who somehow makes him feel good about himself. ", " And that's when the bottom falls out. Kirk comes home one night to a note from his mom on the kitchen table. She's gone off to California with her boyfriend, leaving Kirk alone. Kirk is determined to stay and make it on his own, but he's juggling a lot at once, and he doesn't know how long he can last. Readers will find themselves cheering for Kirk in this funny, touching first novel."], "author": "Peter  Moore", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-09-30 00:00:00", "ISBN": "0670035432"},
{"url": "https://www.goodreads.com/book/show/20559450-night-angel", "num_ratings": "110", "num_reviews": "39", "avg_ratings": 4.3, "genres": ["Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Romance", "Paranormal Romance", "Novella"], "title": "Night Angel", "description": ["\"Lisa Kessler is an up and coming author to remember!\" - ", "When Colin Flynn returns home to Ireland, the immortal Night Walker is not the protector he had once been. Although his flesh has healed, the scars hide a broken spirit.", "Juliana Duffy is a survivor. She owns", "\"Lisa Kessler is an up and coming author to remember!\" - ", "When Colin Flynn returns home to Ireland, the immortal Night Walker is not the protector he had once been. Although his flesh has healed, the scars hide a broken spirit.", "Juliana Duffy is a survivor. She owns a florist shop and continues to play piano in spite of her deafness. Her prophetic dreams warn her of coming death and show her the faces of two men: one a customer and one a handsome stranger.", "After hearing her music, Colin finds himself drawn to this woman who refuses to be defined by her injury. As an ancient enemy emerges and threatens her safety, Colin will need to learn Juliana's secret to overcome his wounds, and regain his strength.", "But falling for a mortal could be the greatest risk of all..."], "author": "Lisa Kessler", "num_pages": "100", "awards": ["PRISM Award by Fantasy, Futuristic and Paranormal Special Interest Chapter of RWA (2015)", "National Excellence in Romance Fiction Award (NERFA) Nominee for Novella (finalist) (2015)", "Readers' Crown Award by RomCon® (Romance Conventions Inc.) (2015)"], "places": ["Ireland"], "character_names": [], "language": "English", "publish_date": "2014-03-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9394010-the-darkest-secret", "num_ratings": "25,841", "num_reviews": "1,014", "avg_ratings": 4.32, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Paranormal", "Demons", "Fantasy"], "title": "The Darkest Secret", "description": [" Lords of the Underworld ", "Keeper of the demon of Secrets, Amun can manipulate the darkest thoughts of anyone nearby. But when the immortal warrior is chained and isolated to protect those he loves, death is his only hope of release—until he meets Haid", " Lords of the Underworld ", "Keeper of the demon of Secrets, Amun can manipulate the darkest thoughts of anyone nearby. But when the immortal warrior is chained and isolated to protect those he loves, death is his only hope of release—until he meets Haidee, a fellow prisoner whose beauty and hidden vulnerability draw him into a reckless test of his loyalty.", "Haidee is a demon-assassin, raised to despise Amun's kind. Yet how can she hate the man whose touch sets her aflame? But to save him, she must give herself body and soul...and face the wrath of a powerful adversary sworn to destroy her."], "author": "Gena Showalter", "num_pages": "410", "awards": [], "places": ["Budapest"], "character_names": ["Amun / Secrets", "Haidee"], "language": "English", "publish_date": "2011-03-29 00:00:00", "ISBN": "0373775490"},
{"url": "https://www.goodreads.com/book/show/13360101-never-seduce-a-scot", "num_ratings": "20,063", "num_reviews": "1,661", "avg_ratings": 4.18, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "Never Seduce a Scot", "description": ["Eveline Armstrong is fiercely loved and protected by her powerful clan, but outsiders consider her “touched.” Beautiful, fey, with a level, intent gaze, she doesn’t speak. No one, not even her family, knows that she cannot hear. Content with her life of seclusion, Eveline has taught herself to read lips and allows the outside world to view her as daft. But when an arranged", "Eveline Armstrong is fiercely loved and protected by her powerful clan, but outsiders consider her “touched.” Beautiful, fey, with a level, intent gaze, she doesn’t speak. No one, not even her family, knows that she cannot hear. Content with her life of seclusion, Eveline has taught herself to read lips and allows the outside world to view her as daft. But when an arranged marriage into a rival clan makes Graeme Montgomery her husband, Eveline accepts her duty—unprepared for the delights to come. Graeme is a rugged warrior with a voice so deep and powerful that his new bride can hear it, and hands and kisses so tender and skilled that he stirs her deepest passions.", "Graeme is intrigued by the mysterious Eveline, whose silent lips are ripe with temptation and whose bright, intelligent eyes can see into his soul. As intimacy deepens, he learns her secret. But when clan rivalries and dark deeds threaten the wife he has only begun to cherish, the Scottish warrior will move heaven and earth to save the woman who has awakened his heart to the beautiful song of a rare and magical love."], "author": "Maya Banks", "num_pages": "372", "awards": [], "places": [], "character_names": ["Eveline Armstrong", "Graeme Montgomery"], "language": "English", "publish_date": "2012-09-25 00:00:00", "ISBN": "0345533232"},
{"url": "https://www.goodreads.com/book/show/13310549-last-kiss-goodnight", "num_ratings": "7,231", "num_reviews": "689", "avg_ratings": 3.84, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Fantasy", "Science Fiction", "Aliens"], "title": "Last Kiss Goodnight", "description": ["The breathtaking first novel in New York Times best selling author Gena Showalter’s new paranormal romance series, Otherworld Assassins, featuring a black ops agent who is captured and enslaved…and the beautiful deaf girl who holds the key to his salvation…", "THE SWEETEST TEMPTATION…", "Black ops agent Solomon Judah awakens caged and bound in a twisted zoo where otherworlders are", "The breathtaking first novel in New York Times best selling author Gena Showalter’s new paranormal romance series, Otherworld Assassins, featuring a black ops agent who is captured and enslaved…and the beautiful deaf girl who holds the key to his salvation…", "THE SWEETEST TEMPTATION…", "Black ops agent Solomon Judah awakens caged and bound in a twisted zoo where otherworlders are the main attraction. Vika Lukas, the owner’s daughter, is tasked with Solo’s care and feeding. The monster inside him yearns to kill her on sight, even though she holds the key to his escape. But the human side of him realizes the beautiful deaf girl is more than she seems—she’s his.", "THE ULTIMATE PRICE…", "Vika endures the captives’ taunts and loathing, hoping to keep them alive even if she can’t free them. Only, Solo is different—he protects her. But as hostility turns to forbidden romance, his feelings for her will be used against him…and he’ll be put to a killer test."], "author": "Gena Showalter", "num_pages": "436", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-26 00:00:00", "ISBN": "1451671598"},
{"url": "https://www.goodreads.com/book/show/8753305-seven-years-to-sin", "num_ratings": "17,140", "num_reviews": "1,061", "avg_ratings": 3.89, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Adult", "Adult Fiction", "Erotica", "Historical", "Historical Fiction"], "title": "Seven Years to Sin", "description": ["The longer the resistance…", "Seven years ago, on the eve of her wedding, proper Lady Jessica Sheffield witnessed a licentious scene no innocent young miss could imagine. Shocked, yet strangely titillated, she’d held her silence regarding scandalous Alistair Caulfield, and walked down the aisle as expected. But through years of serene, unremarkable marriage, Caulfield’s image", "The longer the resistance…", "Seven years ago, on the eve of her wedding, proper Lady Jessica Sheffield witnessed a licentious scene no innocent young miss could imagine. Shocked, yet strangely titillated, she’d held her silence regarding scandalous Alistair Caulfield, and walked down the aisle as expected. But through years of serene, unremarkable marriage, Caulfield’s image remained burned into her imagination, fueling very illicit dreams…", "…the sweeter the reward", "Alistair ran far from the temptation of the prim debutante with the fire of passion in her eyes–all the way to the West Indies. As a successful merchant, he has little in common with the rakehell youth she knew. But when newly widowed Jessica steps aboard his ship for a transatlantic passage, seven years’ worth of denied pleasures are held in check by nothing more than a few layers of silk–and the certainty that surrender will consume them both…"], "author": "Sylvia Day", "num_pages": "352", "awards": [], "places": [], "character_names": ["Jessica Sheffield", "Alistair Lucius Caulfield"], "language": "English", "publish_date": "2011-08-30 00:00:00", "ISBN": "0758231741"},
{"url": "https://www.goodreads.com/book/show/334865.Of_Sound_Mind", "num_ratings": "698", "num_reviews": "106", "avg_ratings": 3.84, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Contemporary"], "title": "Of Sound Mind", "description": ["High school senior Theo is fluent in two languages: spoken English and sign. His parents and brother, Jeremy, are deaf, but Theo can hear, which has over the years cast him in the role of interpreter for his family. Unfortunately, it's not a welcome duty, especially in the case of his mother, Palma. She is a successful sc", "High school senior Theo is fluent in two languages: spoken English and sign. His parents and brother, Jeremy, are deaf, but Theo can hear, which has over the years cast him in the role of interpreter for his family. Unfortunately, it's not a welcome duty, especially in the case of his mother, Palma. She is a successful sculptor who, being deeply suspicious of \"hearies,\" expects Theo to act as her business manager. And Jeremy relies on Theo for company and homework help. It's become especially frustrating lately because Theo has met a fascinating new girl at school, Ivy, with whom he wants to spend as much time as possible. Theo's father, Thomas, is the only one who has never burdened him, but that changes when Thomas has a stroke. Palma, frightened and self-absorbed, cannot bring herself to nurse her husband, leaving Theo with the full burden to bear. But with the help of Ivy and some of her friends, Theo is finally able to change his family's dynamics and find time to plan his future."], "author": "Jean Ferris", "num_pages": "224", "awards": ["California Young Readers Medal Nominee for Young Adult (2005)", "Missouri Gateway Readers Award Nominee (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-02 00:00:00", "ISBN": "0374455848"},
{"url": "https://www.goodreads.com/book/show/7102657-a-hearing-heart", "num_ratings": "879", "num_reviews": "76", "avg_ratings": 3.71, "genres": ["Romance", "Historical Romance", "Historical", "Romance", "Westerns", "Historical", "Historical Fiction", "Disability", "Romance", "Western Romance"], "title": "A Hearing Heart", "description": ["After the death of her fiancé, Catherine Johnson, a New York schoolteacher in 1901, travels to Nebraska to teach a one-room school and escape her sad memories. One afternoon, violence erupts in the sleepy town. Catherine saves deaf stable hand, Jim Kinney, from torture by drunken thugs.", "As she takes charge of his education, teaching him to read and sign, attraction grows be", "After the death of her fiancé, Catherine Johnson, a New York schoolteacher in 1901, travels to Nebraska to teach a one-room school and escape her sad memories. One afternoon, violence erupts in the sleepy town. Catherine saves deaf stable hand, Jim Kinney, from torture by drunken thugs.", "As she takes charge of his education, teaching him to read and sign, attraction grows between them. The warmth and humor in this silent man transcends the need for speech and his eyes tell her all she needs to know about his feelings for her. But the obstacles of class difference and the stigma of his handicap are almost insurmountable barriers to their growing attachment.", "Will Catherine flout society’s rules and allow herself to love again? Can Jim make his way out of poverty as a deaf man in a hearing world? And together will they beat the corrupt robber baron who has a stranglehold on the town?", "Romance, love and sensuality abound in this jam-packed, old-fashioned tale with plenty of heart and some steaming hot sex."], "author": "Bonnie Dee", "awards": [], "places": ["Broughton, Nebraska"], "character_names": ["Catherine Johnson", "Jim Kinney"], "language": "English", "publish_date": "2009-08-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/907382.Train_Go_Sorry", "num_ratings": "943", "num_reviews": "89", "avg_ratings": 3.88, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Train Go Sorry: Inside a Deaf World", "description": ["This portrait of New York's Lafayette School for the Deaf is not just a work of journalism. It is also a memoir, since Leah Hager Cohen grew up on the school's campus and her father is its superintendent. As a hearing person raised among the deaf, Cohen appreciates both the intimate textures of that silent world and the gulf that separates it from our own."], "author": "Leah Hager Cohen", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-04-25 00:00:00", "ISBN": "0679761659"},
{"url": "https://www.goodreads.com/book/show/13164610-insight", "num_ratings": "653", "num_reviews": "69", "avg_ratings": 3.85, "genres": ["Mystery", "Romance", "Romantic Suspense", "Romance", "Suspense", "Fiction"], "title": "InSight", "description": ["Psychologist Abigael Gallant fought her way back from her ex-husband’s brutal attack that killed their daughter and left her blind. Now she “reads” audio books, runs with a guide at a local track, and has a thriving practice that specializes in treating the newly disabled. The last thing she needs is another man in her life.", "Enter Detective Luke McCallister, a cop forced in", "Psychologist Abigael Gallant fought her way back from her ex-husband’s brutal attack that killed their daughter and left her blind. Now she “reads” audio books, runs with a guide at a local track, and has a thriving practice that specializes in treating the newly disabled. The last thing she needs is another man in her life.", "Enter Detective Luke McCallister, a cop forced into counseling a year after a gun blast during a meth lab take-down robbed him of his hearing. Luke is fighting hard to stay on the force, but computer work and fingerprint analysis are not what he has in mind. Initially reluctant to Abby’s therapy, Luke’s barriers tumble because Abby sees deeper into him than anyone ever cared to.", "Though Luke’s lip reading is excellent, he refuses to “listen” to Abby’s warning that his romantic overture jeopardizes her professional ethics. But when break-ins and threatening computer messages escalate into a physical attack on Abby and her guide dog, Luke walks a fine line between cop, protector, and lover. Unable to deny their physical attraction, Abby and Luke tiptoe around their personal baggage and enter into a delicate relationship.", "Then Abby is kidnapped. While Luke puts his life at risk to find her, Abby discovers the ghosts of her past are back to haunt her, and the man she once loved was as much of a victim as she."], "author": "Polly Iyer", "num_pages": "390", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/242344.The_Texan_s_Wager", "num_ratings": "4,568", "num_reviews": "322", "avg_ratings": 3.93, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Romance", "Western Romance", "Historical", "Historical Fiction"], "title": "The Texan's Wager", "description": ["Thrown off a wagon train with two other women and trying to avoid jail for a murder they committed, Bailee Moore agrees to enter a \"wife lottery\"--a ploy concocted by the Cedar Point sheriff to secure wives for the men in the small Texas town.", "For the sensible Bailee, however, marrying Carter McKoy is like exchanging one life sentence for another--especially since her new h", "Thrown off a wagon train with two other women and trying to avoid jail for a murder they committed, Bailee Moore agrees to enter a \"wife lottery\"--a ploy concocted by the Cedar Point sheriff to secure wives for the men in the small Texas town.", "For the sensible Bailee, however, marrying Carter McKoy is like exchanging one life sentence for another--especially since her new husband hasn't even seen fit to utter a single word in her presence. But still, she can't help thinking that something about this strong, silent farmer could be the key to leaving her troubled past behind...and making a worthy wager with her heart."], "author": "Jodi Thomas", "num_pages": "336", "awards": ["RITA Award by Romance Writers of America Nominee for Short Historical Romance (2003)"], "places": ["Texas"], "character_names": ["Carter McKoy", "Bailee Moore"], "language": "English", "publish_date": "2002-10-29 00:00:00", "ISBN": "0515134007"},
{"url": "https://www.goodreads.com/book/show/749273.Wait_Until_Dark", "num_ratings": "1,939", "num_reviews": "25", "avg_ratings": 4.12, "genres": ["Plays", "Drama", "Plays", "Theatre", "Fiction", "Mystery", "Thriller"], "title": "Wait Until Dark", "description": ["Book by Frederick Knott"], "author": "Frederick Knott", "num_pages": "72", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-01-01 00:00:00", "ISBN": "0822212161"},
{"url": "https://www.goodreads.com/book/show/93101.The_Arabian_Nights", "num_ratings": "65,573", "num_reviews": "2,009", "avg_ratings": 4.05, "genres": ["Classics", "Fiction", "Fantasy", "Short Stories", "Literature", "Fantasy", "Fairy Tales", "Fantasy", "Mythology", "Adventure", "Folklore", "Childrens"], "title": "The Arabian Nights", "description": ["The tales of told by Shahrazad over a thousand and one nights to delay her execution by the vengeful King Shahriyar have become among the most popular in both Eastern and Western literature, as recounted by Sir Francis Burton. From the epic adventures of \"Aladdin and the Enchanted Lamp\" to the farcical \"Young Woman and her Five Lovers\" and the social criticism of \"The Tale", "The tales of told by Shahrazad over a thousand and one nights to delay her execution by the vengeful King Shahriyar have become among the most popular in both Eastern and Western literature, as recounted by Sir Francis Burton. From the epic adventures of \"Aladdin and the Enchanted Lamp\" to the farcical \"Young Woman and her Five Lovers\" and the social criticism of \"The Tale of the Hunchback\", the stories depict a fabulous world of all-powerful sorcerers, jinns imprisoned in bottles and enchanting princesses. But despite their imaginative extravagance, the Tales are anchored to everyday life by their realism, providing a full and intimate record of medieval Islam.'"], "author": "Anonymous", "num_pages": "1049", "awards": [], "places": [], "character_names": ["Dunyazad", "Shahryar", "Shah Zaman", "Aladdin", "Ali Baba", "Ali Baba", "Aladdin", "Caliph Haroun Al-Raschid", "Syed Nouman", "Cogia Hassan", "Ali Baba", "Aladdin", "Sinbad"], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "0812972147"},
{"url": "https://www.goodreads.com/book/show/812811.Cockeyed", "num_ratings": "704", "num_reviews": "83", "avg_ratings": 3.77, "genres": ["Autobiography", "Memoir", "Nonfiction", "Disability", "Biography", "Cultural", "Canada", "Biography Memoir"], "title": "Cockeyed: A Memoir of Blindness", "description": ["On his 18th birthday, Ryan Knighton was diagnosed with Retinitis Pigmentosa (RP), a congenital, progressive disease marked by night-blindness, tunnel vision and, eventually, total blindness. In this penetrating, nervy memoir, which ricochets between meditation and black comedy, Knighton tells the story of his fifteen-year descent into blindness while incidentally revealing", "On his 18th birthday, Ryan Knighton was diagnosed with Retinitis Pigmentosa (RP), a congenital, progressive disease marked by night-blindness, tunnel vision and, eventually, total blindness. In this penetrating, nervy memoir, which ricochets between meditation and black comedy, Knighton tells the story of his fifteen-year descent into blindness while incidentally revealing the world of the sighted in all its phenomenal peculiarity. Knighton learns to drive while unseeing; has his first significant relationship—with a deaf woman; navigates the punk rock scene and men's washrooms; learns to use a cane; and tries to pass for seeing while teaching English to children in Korea. Stumbling literally and emotionally into darkness, into love, into couch-shopping at Ikea, into adulthood, and into truce if not acceptance of his identity as a blind man, his writerly self uses his disability to provide a window onto the human condition. His experience of blindness offers unexpected insights into sight and the other senses, culture, identity, language, our fears and fantasies. Cockeyed is not a conventional confessional. Knighton is powerful and irreverent in words and thought and impatient with the preciousness we've come to expect from books on disability. Readers will find it hard to put down this wild ride around their everyday world with a wicked, smart, blind guide at the wheel."], "author": "Ryan Knighton", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-29 00:00:00", "ISBN": "1586483293"},
{"url": "https://www.goodreads.com/book/show/28195.Inkspell", "num_ratings": "95,295", "num_reviews": "3,758", "avg_ratings": 3.91, "genres": ["Fantasy", "Young Adult", "Adventure", "Childrens", "Fantasy", "Magic"], "title": "Inkspell", "description": ["The captivating sequel to INKHEART, the critically acclaimed, international bestseller by Cornelia Funke, an author who is emerging as a truly modern classic writer for children.", "Although a year has passed, not a day goes by without Meggie thinking of INKHEART, the book whose characters became real. But for Dustfinger, the fire-eater brought into being from words, the need", "The captivating sequel to INKHEART, the critically acclaimed, international bestseller by Cornelia Funke, an author who is emerging as a truly modern classic writer for children.", "Although a year has passed, not a day goes by without Meggie thinking of INKHEART, the book whose characters became real. But for Dustfinger, the fire-eater brought into being from words, the need to return to the tale has become desperate. When he finds a crooked storyteller with the ability to read him back, Dustfinger leaves behind his young apprentice Farid and plunges into the medieval world of his past. Distraught, Farid goes in search of Meggie, and before long, both are caught inside the book, too. But the story is threatening to evolve in ways neither of them could ever have imagined."], "author": "Cornelia Funke", "num_pages": "635", "awards": ["Book Sense Book of the Year Award for Children's Literature (2006)"], "places": [], "character_names": ["Meggie Folchart", "Mortimer Folchart", "Dustfinger", "Elinor Loredan", "Farid", "Resa Folchart"], "language": "English", "publish_date": "2005-10-01 00:00:00", "ISBN": "0439554004"},
{"url": "https://www.goodreads.com/book/show/295619.Helen_Keller_s_Teacher", "num_ratings": "1,417", "num_reviews": "73", "avg_ratings": 4.1, "genres": ["Nonfiction", "Biography", "Childrens", "Classics"], "title": "Helen Keller's Teacher", "description": ["The true story of the dedicated woman, Anne Sullivan Macy (April 14, 1866 – October 20, 1936), originally from Tewksbury, Massachusetts, who became Helen Keller's inspirational teacher and lifelong friend."], "author": "Margaret Davidson", "num_pages": "160", "awards": [], "places": [], "character_names": ["Anne Sullivan", "Helen Keller"], "language": "English", "publish_date": "1992-03-01 00:00:00", "ISBN": "0590446525"},
{"url": "https://www.goodreads.com/book/show/16081758-otherbound", "num_ratings": "2,159", "num_reviews": "452", "avg_ratings": 3.74, "genres": ["Fantasy", "Young Adult", "Lgbt", "Science Fiction"], "title": "Otherbound", "description": ["Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Eve", "Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Every time he blinks, he's yanked from his Arizona town into Amara's mind, a world away, which makes even simple things like hobbies and homework impossible. He's spent years as a powerless observer of Amara's life. Amara has no idea . . . until he learns to control her, and they communicate for the first time. Amara is terrified. Then, she's furious.", "All Amara and Nolan want is to be free of each other. But Nolan's breakthrough has dangerous consequences. Now, they'll have to work together to survive--and discover the truth about their connection."], "author": "Corinne Duyvis", "num_pages": "387", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2014)", "Bisexual Book Award for Speculative Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-17 00:00:00", "ISBN": "1419709283"},
{"url": "https://www.goodreads.com/book/show/27160356-endless-possibility", "num_ratings": "953", "num_reviews": "173", "avg_ratings": 4.53, "genres": ["Romance", "Novella", "Contemporary", "New Adult"], "title": "Endless Possibility", "description": ["After the disastrous Planet X party, Noah Lake knows he must to learn to cope with his anger and bitterness, to learn to live as he is and not as he had been. He sets out on an impossible journey, alone, in the hopes of making himself worthy of Charlotte's love, and to slay the demons of an old life that is lost to him.", "As he makes his arduous way across Europe, following C", "After the disastrous Planet X party, Noah Lake knows he must to learn to cope with his anger and bitterness, to learn to live as he is and not as he had been. He sets out on an impossible journey, alone, in the hopes of making himself worthy of Charlotte's love, and to slay the demons of an old life that is lost to him.", "As he makes his arduous way across Europe, following Charlotte's tour, Noah writes of his experiences that will become his memoir, and it is only after reading his words that Charlotte comes to fully understand the hardships Noah endured for their sake; a journey that nearly broke him in mind, body, and spirit. She knows what she must do: show Noah that while she is the light in his darkness, he is the music in her heart, and that without him, she'd be just as lost.", "Endless Possibility is the final chapters in a love story about acceptance, peace, and the bond between two souls who have found their equal in each other, and the happily ever after they both deserve."], "author": "Emma   Scott", "num_pages": "118", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-20 00:00:00", "ISBN": "1517726603"},
{"url": "https://www.goodreads.com/book/show/20504754-transcendence", "num_ratings": "13,961", "num_reviews": "2,430", "avg_ratings": 4.11, "genres": ["Romance", "Science Fiction", "Time Travel", "Historical", "Romance", "Historical Romance", "Fantasy", "Adult", "Historical", "Historical Fiction"], "title": "Transcendence", "description": ["It’s said that women and men are from two different planets when it comes to communication, but how can they overcome the obstacles of prehistoric times when one of them simply doesn’t have the ability to comprehend language?", "Ehd’s a caveman living on his own in a harsh wilderness. He’s strong and intelligent, but completely alone. When he finds a beautiful young woman in h", "It’s said that women and men are from two different planets when it comes to communication, but how can they overcome the obstacles of prehistoric times when one of them simply doesn’t have the ability to comprehend language?", "Ehd’s a caveman living on his own in a harsh wilderness. He’s strong and intelligent, but completely alone. When he finds a beautiful young woman in his pit trap, it’s obvious to him that she is meant to be his mate. He doesn’t know where she came from; she’s wearing some pretty odd clothing, and she makes a lot of noises with her mouth that give him a headache. Still, he’s determined to fulfill his purpose in life – provide for her, protect her, and put a baby in her.", "Elizabeth doesn’t know where she is or exactly how she got there. She’s confused and distressed by her predicament, and there’s a caveman hauling her back to his cavehome. She’s not at all interested in Ehd’s primitive advances, and she just can’t seem to get him to listen. No matter what she tries, getting her point across to this primitive, but beautiful, man is a constant – and often hilarious – struggle. ", "With only each other for company, they must rely on one another to fight the dangers of the wild and prepare for the winter months. As they struggle to coexist, theirs becomes a love story that transcends language and time."], "author": "Shay Savage", "num_pages": "312", "awards": ["Goodreads Choice Award Nominee for Romance (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/437572.Deaf_Like_Me", "num_ratings": "645", "num_reviews": "66", "avg_ratings": 4.0, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Deaf Like Me", "description": ["Deaf Like Me is the moving account of parents coming to terms with their baby girl's profound deafness. The love, hope, and anxieties of all hearing parents of deaf children are expressed here with power and simplicity. In the epilogue, Lynn Spradley as a teenager reflects upon being deaf, her education, her struggle to communicate, and the discovery that she was the focus", "Deaf Like Me is the moving account of parents coming to terms with their baby girl's profound deafness. The love, hope, and anxieties of all hearing parents of deaf children are expressed here with power and simplicity. In the epilogue, Lynn Spradley as a teenager reflects upon being deaf, her education, her struggle to communicate, and the discovery that she was the focus of her father's and uncle's book. At once moving and inspiring, Deaf Like Me is must reading for every parent, relative, and friend of deaf children everywhere."], "author": "Thomas S. Spradley", "num_pages": "285", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-01-01 00:00:00", "ISBN": "0930323114"},
{"url": "https://www.goodreads.com/book/show/885542.The_Piano", "num_ratings": "4,250", "num_reviews": "155", "avg_ratings": 3.93, "genres": ["Fiction", "Historical", "Historical Fiction", "Romance", "Historical"], "title": "The Piano", "description": ["In the award-winning film The Piano, writer/director Jane Campion created a story so original and powerful it fascinated millions of moviegoers. This novel stands independent of the film, exploring the mysteries of Ada's muteness, the secret of her daughter's conception, the reason for her strange marriage and the past lives of Baines and Stewart."], "author": "Jane Campion", "num_pages": "215", "awards": [], "places": ["New Zealand"], "character_names": [], "language": "English", "publish_date": "1995-07-07 00:00:00", "ISBN": "0786880961"},
{"url": "https://www.goodreads.com/book/show/30375.Unspeakable", "num_ratings": "7,116", "num_reviews": "391", "avg_ratings": 3.86, "genres": ["Romance", "Romance", "Romantic Suspense", "Suspense", "Fiction", "Mystery"], "title": "Unspeakable", "description": ["Carl Herbold is a cold-blooded psychopath who has just escaped the penitentiary where he was serving a life sentence. Bent on revenge, he's going back to where he began--Blewer County, Texas... ", "Born deaf, lately widowed, Anna Corbett fights to keep the ranch that is her son's birthright, unaware that she is at the center of Herbold's horrific scheme--and that her world of", "Carl Herbold is a cold-blooded psychopath who has just escaped the penitentiary where he was serving a life sentence. Bent on revenge, he's going back to where he began--Blewer County, Texas... ", "Born deaf, lately widowed, Anna Corbett fights to keep the ranch that is her son's birthright, unaware that she is at the center of Herbold's horrific scheme--and that her world of self-imposed isolation is about to explode... ", "Drifter Jack Sawyer arrives at Anna's ranch asking for work, hoping to protect the innocent woman and her son from Herbold's rage. But Sawyer can't outrun the secrets that stalk him--or the day of reckoning awaiting them all..."], "author": "Sandra Brown", "num_pages": "486", "awards": [], "places": [], "character_names": ["Jack Sawyer", "Anna Corbett"], "language": "English", "publish_date": "2004-11-08 00:00:00", "ISBN": "0340836431"},
{"url": "https://www.goodreads.com/book/show/1540.The_Oedipus_Cycle", "num_ratings": "53,079", "num_reviews": "1,299", "avg_ratings": 3.96, "genres": ["Classics", "Plays", "Drama", "Fiction", "Academic", "School"], "title": "The Oedipus Cycle: Oedipus Rex/Oedipus at Colonus/Antigone", "description": ["(1939 translation)"], "author": "Sophocles", "num_pages": "259", "awards": [], "places": [], "character_names": ["Antigone", "Ismene (sister of Antigone)", "Oedipus"], "language": "English", "publish_date": "2002-11-01 00:00:00", "ISBN": "015602764X"},
{"url": "https://www.goodreads.com/book/show/18478373-forever-scarred", "num_ratings": "211", "num_reviews": "15", "avg_ratings": 4.02, "genres": ["Romance", "Contemporary", "War", "Military Fiction", "Romance", "Contemporary Romance", "Disability", "Romance", "Romantic Suspense", "Realistic Fiction"], "title": "Forever Scarred", "description": ["The long awaited sequel to Running Scarred. ", "Working alongside his ex-veteran friends in the isolated French chateau where he doesn’t have to explain how his face was destroyed, suits Joe perfectly. Barely able look at his own reflection let alone show himself to anyone else, the longer he can remain secluded from the outside world the better he likes it. ", "But Joe wants the", "The long awaited sequel to Running Scarred. ", "Working alongside his ex-veteran friends in the isolated French chateau where he doesn’t have to explain how his face was destroyed, suits Joe perfectly. Barely able look at his own reflection let alone show himself to anyone else, the longer he can remain secluded from the outside world the better he likes it. ", "But Joe wants the same as any man, he same things his friends have found and when a party of salesmen descends upon the chateau for a team building course, Joe’s resolve to keep out of the spotlight is put to its hardest test yet. The chief executive’s beautiful secretary is exactly the woman he is looking for, but he knows that she is unlikely to spare him even a glance. ", "Her life is complicated enough and embarking on any liaison is the last thing on Lucy’s mind but something about the huge ex-soldier has kept her heart pounding and her stomach fluttering from the moment she laid eyes on him. Joe’s scarred face pales into insignificance as she finds his potent strength, his gentle sincerity and his genial mood far too beguiling. ", "Can Lucy escape from her blackmailing boss and take what her heart desires without leaving herself destitute? Will Joe rise above his own crushing insecurities long enough to rescue Lucy not only from her own fears but from her handsome but lecherous employer, or will his lack of self-esteem and long practiced avoidance tactics prevent him from opening his heart and him keep him Forever Scarred? ", "Suitable for young adult upwards. Contains some swear words and beautiful sex."], "author": "Jackie Williams", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-15 00:00:00", "ISBN": "1492187224"},
{"url": "https://www.goodreads.com/book/show/7906105-girl-stolen", "num_ratings": "16,054", "num_reviews": "2,308", "avg_ratings": 4.01, "genres": ["Young Adult", "Mystery", "Realistic Fiction", "Thriller", "Contemporary", "Fiction"], "title": "Girl, Stolen", "description": ["Sixteen-year-old Cheyenne Wilder is sleeping in the back of the car while her stepmom fills a prescription for antibiotics. Before Cheyenne realizes what's happening, the car is being stolen.", "Griffin hadn't meant to kidnap Cheyenne and once he finds out that not only does she have pneumonia, but that she's blind, he really doesn't know what to do. When his dad finds out tha", "Sixteen-year-old Cheyenne Wilder is sleeping in the back of the car while her stepmom fills a prescription for antibiotics. Before Cheyenne realizes what's happening, the car is being stolen.", "Griffin hadn't meant to kidnap Cheyenne and once he finds out that not only does she have pneumonia, but that she's blind, he really doesn't know what to do. When his dad finds out that Cheyenne's father is the president of a powerful corporation, everything changes--now there's a reason to keep her. ", "How will Cheyenne survive this nightmare?"], "author": "April Henry", "num_pages": "213", "awards": ["Missouri Truman Readers Award (2013)"], "places": ["Oregon"], "character_names": [], "language": "English", "publish_date": "2010-12-01 00:00:00", "ISBN": "0805090053"},
{"url": "https://www.goodreads.com/book/show/15698370-blind-faith", "num_ratings": "966", "num_reviews": "93", "avg_ratings": 3.87, "genres": ["Romance", "Sociology", "Abuse", "Contemporary", "New Adult", "Romance", "Contemporary Romance", "Disability"], "title": "Blind Faith", "description": ["Serena was only fifteen when four teenage boys dragged her inside a cold, dark cave and robbed her of her innocence. Although she suffers from night terrors, any memories of the attack and the events leading up to it are locked inside her head. After seven years of hiding from the demons of her past, Serena is forced to confront her fears when she allows her high school cr", "Serena was only fifteen when four teenage boys dragged her inside a cold, dark cave and robbed her of her innocence. Although she suffers from night terrors, any memories of the attack and the events leading up to it are locked inside her head. After seven years of hiding from the demons of her past, Serena is forced to confront her fears when she allows her high school crush, Will Duncan, to rent out the upper floor of her house.", "Having Will in her life is a double edged sword: Serena learns to trust again and discovers an inner strength she never knew she had. But when she falls in love with him, Serena knows the only way they can have a future together is if she rids herself of the past first. As the missing pieces of memory gradually to snap into place, Serena uncovers the trail of lies and deceptions that led to the ultimate betrayal.", "Can Will Duncan help set Serena free or will the secrets he harbors about that night shatter her faith in him forever?"], "author": "Kimberley Reeves", "num_pages": "327", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-03-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22072059-unbeautiful", "num_ratings": "4,072", "num_reviews": "358", "avg_ratings": 3.88, "genres": ["New Adult", "Romance", "Contemporary", "Sociology", "Abuse"], "title": "Unbeautiful", "description": ["You want to know my secrets? What lies beneath the pretty? The scars I can’t let anyone see? The scars tied to my secrets? ", "On the outside I appear normal. Some might even say perfect. ", "They say that I’m a pretty girl. They say I should be happy. They say that I have nothing to be angry about. That I’m popular. A cheerleader. That I’m perfect. ", "You want to know my secrets? What lies beneath the pretty? The scars I can’t let anyone see? The scars tied to my secrets? ", "On the outside I appear normal. Some might even say perfect. ", "They say that I’m a pretty girl. They say I should be happy. They say that I have nothing to be angry about. That I’m popular. A cheerleader. That I’m perfect. ", "But all they see is what’s on the outside. ", "On the inside I’m raw, open, bleeding. Scars that can’t seem to heal the wounds. ", "Carrying dark secrets about who I really am.", "How afraid I am to tell the truth.", "And it’s slowly killing me. ", "Tattoos. Piercing. Scars. The guy who can’t speak. ", "Gothic freak. Mute. Punk. I’ve heard it all. ", "They say that I’m probably dangerous. They say people should stay away from me. ", "But who are they anyway? ", "To decide what I am. ", "They don’t know what’s hidden beneath the scars. Beneath the piercings and tattoos. ", "The secrets I keep hidden beneath the silence.", "Maybe if they knew, they wouldn’t fear me so much. ", "Then again, maybe they’d fear me more."], "author": "Jessica Sorensen", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-23 00:00:00", "ISBN": "149957679X"},
{"url": "https://www.goodreads.com/book/show/1375.The_Iliad_The_Odyssey", "num_ratings": "55,541", "num_reviews": "608", "avg_ratings": 4.03, "genres": ["Classics", "Fiction", "Poetry", "Fantasy", "Mythology", "Literature", "Fantasy", "Historical", "Historical Fiction", "Academic", "School", "Adventure", "Classics", "Classic Literature"], "title": "The Iliad/The Odyssey", "description": ["Gripping listeners and readers for more than 2,700 years, 'The Iliad' is the story of the Trojan War and the rage of Achilles. Combining the skills of a poet and scholar, Robert Fagles brings the energy of contemporary language to this enduring heroic epic. ", "If 'The Iliad' is the world's greatest war story, then 'The Odyssey' is literature's greatest evocation of every man'", "Gripping listeners and readers for more than 2,700 years, 'The Iliad' is the story of the Trojan War and the rage of Achilles. Combining the skills of a poet and scholar, Robert Fagles brings the energy of contemporary language to this enduring heroic epic. ", "If 'The Iliad' is the world's greatest war story, then 'The Odyssey' is literature's greatest evocation of every man's journey through life. Here again, Fagles has performed the translator's task magnificently, giving us an Odyssey to read aloud, to savor, and to treasure for its sheer lyrical mastery. ", "Each volume contains a superb introduction with textual and critical commentary by renowned classicist Bernard Knox."], "author": "Homer", "num_pages": "1556", "awards": [], "places": [], "character_names": ["Odysseus", "Menelaus", "Hector of Troy", "Achilles (Greek hero)", "Agamemnon", "Sarpedon (king of Lycia)", "Patroclus"], "language": "English", "publish_date": "1999-11-01 00:00:00", "ISBN": "0147712556"},
{"url": "https://www.goodreads.com/book/show/973242.Dark_Thirst", "num_ratings": "620", "num_reviews": "58", "avg_ratings": 3.56, "genres": ["Paranormal", "Vampires", "Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Fantasy", "Urban Fantasy", "Romance", "Interracial Romance"], "title": "Dark Thirst", "description": ["When Brandon Noble and Angelina Jones first met, he was an awkward teenager harboring a crush on his tutor's sister. Five years later, Angelina is a streetwise cop who's sure she's seen it all, until Brandon comes back into her life--lean, handsome, possessing a strange, powerful allure. . .and a terrifying secret.", "Brandon is one of the Brethren, an", "When Brandon Noble and Angelina Jones first met, he was an awkward teenager harboring a crush on his tutor's sister. Five years later, Angelina is a streetwise cop who's sure she's seen it all, until Brandon comes back into her life--lean, handsome, possessing a strange, powerful allure. . .and a terrifying secret.", "Brandon is one of the Brethren, an ancient clan of ruthless vampires. Like other Brethren families, the Nobles have accumulated great wealth and prestige, never marrying outside of their kin, never leaving the isolated Kentucky farmlands where they live, undetected, among their prey. Horrified by his birthright, Brandon shunned the ritual of the first kill, earning the Brethren's lasting wrath. But the exhilarating passion he and Angelina share rouses the primitive impulses he has tried so hard to deny. And even if Brandon can protect Angelina from his enemies, can he save her from his own dark thirsts?"], "author": "Sara Reinke", "num_pages": "320", "awards": [], "places": ["United States of America"], "character_names": ["Brandon Noble", "Angelina Jones"], "language": "English", "publish_date": "2007-07-01 00:00:00", "ISBN": "142010053X"},
{"url": "https://www.goodreads.com/book/show/89348.My_Sunshine", "num_ratings": "4,253", "num_reviews": "253", "avg_ratings": 4.18, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary"], "title": "My Sunshine", "description": ["New York Times bestselling author Catherine Anderson's Coulter Family series continues in this poignant story of a love that defies all the odds...", "Five years ago, Laura Townsend’s life was nearly destroyed when a head injury impaired her ability to use language and forced her to abandon a brilliant career. Despite her difficulties, she never lost her vivacious spirit or su", "New York Times bestselling author Catherine Anderson's Coulter Family series continues in this poignant story of a love that defies all the odds...", "Five years ago, Laura Townsend’s life was nearly destroyed when a head injury impaired her ability to use language and forced her to abandon a brilliant career. Despite her difficulties, she never lost her vivacious spirit or sunny disposition. Now she has a great new job at an animal clinic—and a handsome new boss who fills her heart with longing. But veterinarian Isaiah Coulter deserves a woman who can meet all his needs. Battling her feelings, Laura decides that sometimes a woman must love a man enough to walk away…", "When Isaiah hired Laura, he wasn’t expecting her to be such a breath of fresh air. Impressed by her healing touch—and captivated by her dazzling beauty—Isaiah finds himself falling in love. And he’ll move heaven and earth to convince Laura that she’s the woman he needs…"], "author": "Catherine Anderson", "num_pages": "421", "awards": [], "places": ["Crystal Falls, Oregon"], "character_names": ["Laura Townsend", "Isaiah Coulter"], "language": "English", "publish_date": "2005-01-04 00:00:00", "ISBN": "0451213807"},
{"url": "https://www.goodreads.com/book/show/295.Treasure_Island", "num_ratings": "340,911", "num_reviews": "8,927", "avg_ratings": 3.82, "genres": ["Classics", "Fiction", "Adventure", "Young Adult"], "title": "Treasure Island", "description": ["\"For sheer storytelling delight and pure adventure, ", " has never been surpassed. From the moment young Jim Hawkins first encounters the sinister Blind Pew at the Admiral Benbow Inn until the climactic battle for treasure on a tropic isle, the nevel creates scenes and characters that have firetd the imaginations of generations of readers. Written by a superb pr", "\"For sheer storytelling delight and pure adventure, ", " has never been surpassed. From the moment young Jim Hawkins first encounters the sinister Blind Pew at the Admiral Benbow Inn until the climactic battle for treasure on a tropic isle, the nevel creates scenes and characters that have firetd the imaginations of generations of readers. Written by a superb prose stylist, a master of both action and atmosphere, the story centers upon the conflict between good and evil - but in this case a particularly engaging form of evil. It is the villainy of that most ambiguous rogue Long John Silver that sets the tempo of this tale of treachery, greed, and daring. Designed to forever kindle a dream of high romance and distant horizons, ", " is, in the words of G. K. Chesterton, 'the realization of an ideal, that which is promised in its provocative and beckoning map; a vision not only of white skeletons but also green palm trees and sapphire seas.' G. S. Fraser terms it 'an utterly original book' and goes on to write: 'There will always be a place for stories like ", " that can keep boys and old men happy.'"], "author": "Robert Louis Stevenson", "num_pages": "311", "awards": ["Odyssey Award Nominee (2008)", "Prêmio Jabuti Nominee for Adaptação (2017)", "Audie Award for Classic (2008)"], "places": ["Treasure Island", "Cornwall", "Bristol, England"], "character_names": ["Jim Hawkins", "Billy Bones", "Doctor Livesey", "Captain Smollet", "Squire John Trelawney", "Ben Gunn", "Long John Silver"], "language": "English", "publish_date": "2001-09-15 00:00:00", "ISBN": "0753453800"},
{"url": "https://www.goodreads.com/book/show/423156.King_of_the_Wind", "num_ratings": "22,691", "num_reviews": "662", "avg_ratings": 4.19, "genres": ["Animals", "Horses", "Fiction", "Historical", "Historical Fiction", "Animals", "Classics", "Young Adult", "Childrens"], "title": "King of the Wind: The Story of the Godolphin Arabian", "description": ["He was named \"Sham\" for the sun, this golden red stallion born in the Sultan of Morocco's stone stables. Upon his heel was a small white spot, the symbol of speed. But on his chest was the symbol of misfortune. ", "Although he was as swift as the desert winds, Sham's proud pedigree would be scorned all his life by cruel masters and owners.", "This is the classic story of Sham and", "He was named \"Sham\" for the sun, this golden red stallion born in the Sultan of Morocco's stone stables. Upon his heel was a small white spot, the symbol of speed. But on his chest was the symbol of misfortune. ", "Although he was as swift as the desert winds, Sham's proud pedigree would be scorned all his life by cruel masters and owners.", "This is the classic story of Sham and his friend, the stable boy Agba. Their adventures take them from the sands of the Sahara to the royal courts of France and, finally, to the green pastures and stately homes of England. ", "For Sham was the renowned \"Godolphin Arabian\" whose blood flows through the veins of almost every superior Thoroughbred. Sham's speed-like his story-has become legendary."], "author": "Marguerite Henry", "num_pages": "176", "awards": ["Newbery Medal (1949)", "Pacific Northwest Library Association Young Reader's Choice Award (1951)"], "places": ["Morocco", "North Africa"], "character_names": [], "language": "English", "publish_date": "1990-11-01 00:00:00", "ISBN": "0027436292"},
{"url": "https://www.goodreads.com/book/show/136206.Helen_Keller", "num_ratings": "2,028", "num_reviews": "147", "avg_ratings": 4.03, "genres": ["Biography", "Nonfiction", "Childrens", "Classics", "Academic", "School"], "title": "Helen Keller", "description": ["The bestselling biography of Helen Keller and how, with the commitment and lifelong friendship of Anne Sullivan, she learned to talk, read, and eventually graduate from college with honors."], "author": "Margaret Davidson", "num_pages": "96", "awards": [], "places": [], "character_names": ["Helen Keller"], "language": "English", "publish_date": "1989-04-01 00:00:00", "ISBN": "0590424041"},
{"url": "https://www.goodreads.com/book/show/22237290-hawkeye-volume-4", "num_ratings": "6,454", "num_reviews": "547", "avg_ratings": 4.31, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Superheroes", "Marvel", "Comics", "Superheroes", "Graphic Novels Comics", "Comics", "Comic Book", "Fiction"], "title": "Hawkeye, Volume 4: Rio Bravo", "description": ["Reeling from recent events, even Hawkeye wants to know his new status quo. Who’s with him? Who’s against him? Who’s trying to kill him, and why? And just when Clint’s rock bottom couldn’t arrive fast enough, his brother shows up. After a lifetime of bad decisions, Clint and Barney Barton have to realize they have to save one another — If they don’t kill each other first. B", "Reeling from recent events, even Hawkeye wants to know his new status quo. Who’s with him? Who’s against him? Who’s trying to kill him, and why? And just when Clint’s rock bottom couldn’t arrive fast enough, his brother shows up. After a lifetime of bad decisions, Clint and Barney Barton have to realize they have to save one another — If they don’t kill each other first. But when Clown and the Tracksuit Draculas lay siege to their building, round one doesn't go well. Deafened and bloodied, will the Bartons make easy pickings for the Tracksuits? Ever seen Rio Bravo? The brothers Barton double down in a new kind of shoot 'em up! Don't miss it bro."], "author": "Matt Fraction", "num_pages": "160", "awards": ["Will Eisner Comic Industry Awards Nominee for Best Continuing Series (2015)", "Goodreads Choice Award Nominee for Graphic Novels & Comics (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-18 00:00:00", "ISBN": "0785185313"},
{"url": "https://www.goodreads.com/book/show/25538369-song-of-summer", "num_ratings": "526", "num_reviews": "133", "avg_ratings": 3.58, "genres": ["Contemporary", "Young Adult", "Romance", "Disability", "Music"], "title": "Song of Summer", "description": ["The thirteen qualities of Robin’s Perfect Man range from the mildly important “Handsome” to the all-important “Great taste in music.” After all, Westfield’s best high school folk musician can’t go out with some shmuck who only listens to top 40 crap. When hot Carter Paulson walks in the door of Robin’s diner, it looks like the list may have come to life. It’s not until the", "The thirteen qualities of Robin’s Perfect Man range from the mildly important “Handsome” to the all-important “Great taste in music.” After all, Westfield’s best high school folk musician can’t go out with some shmuck who only listens to top 40 crap. When hot Carter Paulson walks in the door of Robin’s diner, it looks like the list may have come to life. It’s not until the end of the meal that she realizes he’s profoundly deaf.", " Carter isn’t looking for a girlfriend. Especially not a hearing one. Not that he has anything against hearing girls, they just don’t speak the same language. But when the cute waitress at Grape Country Dairy makes an effort to talk with him, he takes her out on his yellow Ducati motorcycle.", " Told in first person alternating perspectives, language, music, and culture go along for the ride as Carter and Robin find their song."], "author": "Laura Lee Anderson", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-07-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13450088-the-scourge", "num_ratings": "3,754", "num_reviews": "396", "avg_ratings": 4.03, "genres": ["Young Adult", "Science Fiction", "Dystopia", "Horror", "Zombies", "Fantasy"], "title": "The Scourge", "description": ["Seventeen-year-old Groundling, Fennel, is Sightless. She's never been able to see her lush forest home, but she knows its secrets. She knows how the shadows shift when she passes under a canopy of trees. She knows how to hide in the cool, damp caves when the Scourge comes. She knows how devious and arrogant the Groundlings' tree-dwelling neighbors, the Lofties, can be. ", "And", "Seventeen-year-old Groundling, Fennel, is Sightless. She's never been able to see her lush forest home, but she knows its secrets. She knows how the shadows shift when she passes under a canopy of trees. She knows how to hide in the cool, damp caves when the Scourge comes. She knows how devious and arrogant the Groundlings' tree-dwelling neighbors, the Lofties, can be. ", "And she's always known this day would come—the day she faces the Scourge alone. ", "The Sightless, like Fenn, are mysteriously protected from the Scourge, the gruesome creatures roaming the forests, reeking of festering flesh and consuming anything—and anyone—living. A Sightless Groundling must brave the Scourge and bring fresh water to the people of the forest. Today, that task becomes Fenn's. ", "Fenn will have a Lofty Keeper, Peree, as her companion. Everyone knows the Lofties wouldn’t hesitate to shoot an arrow through the back of an unsuspecting Groundling like Fenn, but Peree seems different. A boy with warm, rough hands who smells like summer, he is surprisingly kind and thoughtful. Although Fenn knows his people are treacherous, she finds herself wanting to trust him. ", "As their forest community teeters on the brink of war, Fenn and Peree must learn to work together to survive the Scourge and ensure their people’s survival. But when Fenn uncovers a secret that shatters her truths, she’s forced to decide who and what to protect—her people, her growing love for Peree, or the elusive dream of lasting peace in the forest."], "author": "A.G. Henley", "num_pages": "242", "awards": ["Next Generation Indie Book Awards Nominee for Young Adult (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/76916.The_Silent_World_of_Nicholas_Quinn", "num_ratings": "3,150", "num_reviews": "146", "avg_ratings": 3.87, "genres": ["Mystery", "Mystery", "Crime", "Fiction", "Mystery", "Detective"], "title": "The Silent World of Nicholas Quinn", "description": ["Nicholas Quinn is deaf, so he considers himself lucky to be appointed to the Foreign Examinations Board at Oxford, which designs tests for students of English around the world. But when someone slips cyanide into Nicholas's sherry, Inspector Morse has a multiple-choice murder. Any one of a tight little group of academics could have killed Quinn. Before Morse is done, all t", "Nicholas Quinn is deaf, so he considers himself lucky to be appointed to the Foreign Examinations Board at Oxford, which designs tests for students of English around the world. But when someone slips cyanide into Nicholas's sherry, Inspector Morse has a multiple-choice murder. Any one of a tight little group of academics could have killed Quinn. Before Morse is done, all their dirty little secrets will be exposed. And a murderer will be cramming for his finals."], "author": "Colin Dexter", "num_pages": "277", "awards": [], "places": ["Oxford, England"], "character_names": ["Inspector Morse", "Sergeant Lewis", "Nicholas Quinn", "Monica Height", "Philip Ogleby", "Donald Martin", "Tom Bartlett", "Christopher Roope"], "language": "English", "publish_date": "1997-05-28 00:00:00", "ISBN": "0804114870"},
{"url": "https://www.goodreads.com/book/show/906396.Louis_Braille", "num_ratings": "459", "num_reviews": "67", "avg_ratings": 4.0, "genres": ["Biography", "Nonfiction", "History", "Childrens", "Historical", "Biography Memoir", "Academic", "Read For School", "Academic", "School", "Disability", "Childrens", "Middle Grade"], "title": "Louis Braille: The Boy Who Invented Books for the Blind", "description": ["A poignant story of the man who developed the Braille system of printing for the blind."], "author": "Margaret Davidson", "num_pages": "80", "awards": [], "places": [], "character_names": ["Louis Braille"], "language": "English", "publish_date": "1991-06-01 00:00:00", "ISBN": "059044350X"},
{"url": "https://www.goodreads.com/book/show/31391.For_the_Sake_of_Elena", "num_ratings": "11,451", "num_reviews": "372", "avg_ratings": 3.99, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "For the Sake of Elena", "description": ["Elena Weaver was a surprise to anyone meeting her for the first time. In her clingy dresses and dangling earrings she exuded a sexuality at odds with the innocence projected by the unicorn posters on her walls. While her embittered mother fretted about her welfare from her home in London, in Cambridge—where Elena was a student at St. Stephen's College—her father and his se", "Elena Weaver was a surprise to anyone meeting her for the first time. In her clingy dresses and dangling earrings she exuded a sexuality at odds with the innocence projected by the unicorn posters on her walls. While her embittered mother fretted about her welfare from her home in London, in Cambridge—where Elena was a student at St. Stephen's College—her father and his second wife each had their own very different image of the girl. As for Elena, she lived a life of casual and intense physical and emotional relationships, with scores to settle and goals to achieve--until someone, lying in wait along the route she ran every morning, bludgeoned her to death.", "Unwilling to turn the killing over to the local police, the university calls in New Scotland Yard. Thus, Detective Inspector Thomas Lynley and his partner, Detective Sergeant Barbara Havers, enter the rarefied world of Cambridge University, where academic gowns often hide murderous intentions.", "For both officers, the true identity of Elena Weaver proves elusive. Each relationship the girl left behind casts new light both on Elena and on those people who appeared to know her best—from an unsavory Swedish-born Shakespearean professor to the brooding head of the Deaf Students Union.", "What's more, Elena's father, a Cambridge professor under consideration for a prestigious post, is a man with his own dark secrets. While his past sins make him neurotically dedicated to Elena and blind to her blacker side, present demons drive him toward betrayal."], "author": "Elizabeth  George", "num_pages": "388", "awards": [], "places": ["Cambridge, England"], "character_names": ["Thomas Lynley", "Barbara Havers"], "language": "English", "publish_date": "1992-08-16 00:00:00", "ISBN": "0340831367"},
{"url": "https://www.goodreads.com/book/show/2526.Blindness", "num_ratings": "150,810", "num_reviews": "12,418", "avg_ratings": 4.09, "genres": ["Science Fiction", "Dystopia", "Horror", "Apocalyptic", "Post Apocalyptic", "Abandoned", "Literary Fiction"], "title": "Blindness", "description": ["A city is hit by an epidemic of \"white blindness\" that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations and assaulting women. There is one eyewitness to this nightmare who guides her c", "A city is hit by an epidemic of \"white blindness\" that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations and assaulting women. There is one eyewitness to this nightmare who guides her charges—among them a boy with no mother, a girl with dark glasses, a dog of tears—through the barren streets, and their procession becomes as uncanny as the surroundings are harrowing. As ", " reclaims the age-old story of a plague, it evokes the vivid and trembling horrors of the twentieth century, leaving readers with a powerful vision of the human spirit that's bound both by weakness and exhilarating strength."], "author": "José Saramago", "num_pages": "326", "awards": ["Premio San Clemente for Novela Estranxeira (1999)"], "places": [], "character_names": ["The doctor (Blindness)", "The doctor's wife", "The girl with the dark glasses", "The first blind man", "The first blind man's wife", "The boy with the squint", "The old man with the black eye patch", "The car thief"], "language": "English", "publish_date": "1999-10-04 00:00:00", "ISBN": "0156007754"},
{"url": "https://www.goodreads.com/book/show/29422120-scarred-horizon", "num_ratings": "148", "num_reviews": "5", "avg_ratings": 4.01, "genres": ["Romance", "Disability", "Contemporary", "War", "Military Fiction", "Action"], "title": "Scarred Horizon", "description": ["Paul’s story. ", "To be blind was bad enough; to question his sanity was a kick in the teeth; to give him a babysitter to monitor his every move was beyond his hard pressed endurance. ", "Kicked out of the army and queuing at the dreaded job centre, unable to even search for employment himself had been humiliating enough. Having to", "Paul’s story. ", "To be blind was bad enough; to question his sanity was a kick in the teeth; to give him a babysitter to monitor his every move was beyond his hard pressed endurance. ", "Kicked out of the army and queuing at the dreaded job centre, unable to even search for employment himself had been humiliating enough. Having to stand there and wait in line while listening to the vile terrorist who had murdered his team and had taken his sight, was more than Paul could take. The warlord had to die. It was a pity that the public didn’t see it that way and a prevented a raging Paul from dishing out his own form of justice. ", "Convincing the assault trial judge to choose an option preferable to prison was going to be an even harder task to perform. Paul’s former army mates are not going to let him be taken down without a fight but making a soft and fragrant minder a condition of his parole was a mortifying possibility that had never once crossed his mind. ", "Amy would do just about anything so see the big, handsome man sitting in the dock regain his pride but she hadn’t reckoned on Paul’s stubborn independence. Blind beyond reason, she just can’t get through to the obstinate blockhead that she only has his best interests in mind. If her good intentions break her own fragile heart then that is something she will just have to conquer but a month of child-minding the uncooperative ex soldier is becoming even more difficult than her generous spirit can survive. ", "With evil about to enter the beautiful château in the French countryside, will Paul open his mind and expose his hidden emotions for long enough to see the beautiful light in his forever darkened world or will his and Amy’s future perish under a viciously Scarred Horizon? ", "Scarred Horizon gently addresses the issues of disability after injuries sustained in battle. It is an uplifting read full of romance and intrigue suitable for age 16 and above. Contains sensual sex and some swearing."], "author": "Jackie Williams", "num_pages": "315", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13366929-what-i-didn-t-say", "num_ratings": "7,365", "num_reviews": "959", "avg_ratings": 3.96, "genres": ["Young Adult", "Romance", "Contemporary"], "title": "What I Didn't Say", "description": ["Getting drunk homecoming night your senior year is never a good idea, but Jake Hayes never expected it all to end with a car crash and a t-post embedded in his throat. His biggest regret about it all? What he never said to Samantha Shay. He's been in love with her for years and never had the guts to tell her. Now it's too late. Because after that night, Jake will never be", "Getting drunk homecoming night your senior year is never a good idea, but Jake Hayes never expected it all to end with a car crash and a t-post embedded in his throat. His biggest regret about it all? What he never said to Samantha Shay. He's been in love with her for years and never had the guts to tell her. Now it's too late. Because after that night, Jake will never be able to talk again. When Jake returns to his small island home, population 5,000, he'll have to learn how to deal with being mute. He also finds that his family isn't limited to his six brothers and sisters, that sometimes an entire island is watching out for you. And when he gets the chance to spend more time with Samantha, she'll help him learn that not being able to talk isn't the worst thing that could ever happen to you. Maybe, if she'll let him, Jake will finally tell her what he didn't say before, even if he can't actually say it."], "author": "Keary Taylor", "num_pages": "336", "awards": [], "places": ["Orcas Island, San Juan Islands, Washington"], "character_names": [], "language": "English", "publish_date": "2012-04-30 00:00:00", "ISBN": "1475156456"},
{"url": "https://www.goodreads.com/book/show/1420000.The_Raging_Quiet", "num_ratings": "3,889", "num_reviews": "343", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Young Adult", "Romance", "Historical", "Fiction", "Fantasy"], "title": "The Raging Quiet", "description": ["A captivating tale of two remarkable and extraordinary young people - Marnie, a courageous young woman, and Raver, a strange and spirited young man - whose only real crimes are that they are different. Set within a chilling world of predjudices and hypocrisy, ignorance and self-righteousness, The Raging Quiet explores the tenderness of love and friendship and the power to", "A captivating tale of two remarkable and extraordinary young people - Marnie, a courageous young woman, and Raver, a strange and spirited young man - whose only real crimes are that they are different. Set within a chilling world of predjudices and hypocrisy, ignorance and self-righteousness, The Raging Quiet explores the tenderness of love and friendship and the power to overcome the injustice of being different. This is the story of two outsiders in medieval times. Both are set apart from their small community: Marnie because she is a newcomer, brought to the seaside village by her new - and much older - husband, and Raver because he is the village lunatic. subsequent isolation pushes her towards Raver - and an important discovery: the villagers have mistaken his deafness for madness. The two outsiders soon develop a rudimentary sign language. But their precious new friendship is cut short when the villagers misconstrue their strange, private communication, and put Marnie on trial for witchcraft... Suspenseful, tender and compassionate, The Raging Quiet effortlessly draws the reader into a chilling world of bigotry, ignorance and self-righteousness. Despite the historical setting, it is a world that is still all too recognisable as our own."], "author": "Sherryl Jordan", "awards": ["Literaturpreis der Jury der jungen Leser for Jugendbuch (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-03-03 00:00:00", "ISBN": "0689836864"},
{"url": "https://www.goodreads.com/book/show/7818683-five-flavors-of-dumb", "num_ratings": "9,474", "num_reviews": "1,074", "avg_ratings": 3.87, "genres": ["Young Adult", "Contemporary", "Music", "Realistic Fiction", "Romance", "Fiction"], "title": "Five Flavors of Dumb", "description": ["The Challenge: Piper has one month to get the rock band Dumb a paying gig.", " The Deal: If she does it, Piper will become the band's manager and get her share of the profits.", " The Catch: How can Piper possibly manage one egomaniacal pretty boy, one talentless piece of eye candy, one crush, one silent rocker, and one angry girl? And how can she do it when she's deaf?", " Piper can'", "The Challenge: Piper has one month to get the rock band Dumb a paying gig.", " The Deal: If she does it, Piper will become the band's manager and get her share of the profits.", " The Catch: How can Piper possibly manage one egomaniacal pretty boy, one talentless piece of eye candy, one crush, one silent rocker, and one angry girl? And how can she do it when she's deaf?", " Piper can't hear Dumb's music, but with growing self-confidence, a budding romance, and a new understanding of the decision her family made to buy a cochlear implant for her deaf baby sister, she discovers her own inner rock star and what it truly means to be a flavor of Dumb."], "author": "Antony John", "num_pages": "338", "awards": ["Schneider Family Book Award for Teen Book (2011)", "Lincoln Award Nominee (2014)", "Missouri Gateway Readers Award Nominee (2013)"], "places": ["Seattle, Washington", "Washington (the state)"], "character_names": [], "language": "English", "publish_date": "2010-11-11 00:00:00", "ISBN": "0803734336"},
{"url": "https://www.goodreads.com/book/show/659600.Annie_s_Song", "num_ratings": "11,348", "num_reviews": "889", "avg_ratings": 4.2, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Historical", "Historical Fiction", "Adult"], "title": "Annie's Song", "description": ["Annie Trimble lives in a solitary world that no one enters or understands. As delicate and beautiful as the tender blossoms of the Oregon spring, she is shunned by a town that misinterprets her affliction. But cruelty cannot destroy the love Annie holds in her heart. ", "Annie Trimble lives in a solitary world that no one enters or understands. As delicate and beautiful as the tender blossoms of the Oregon spring, she is shunned by a town that misinterprets her affliction. But cruelty cannot destroy the love Annie holds in her heart. "], "author": "Catherine Anderson", "num_pages": "410", "awards": [], "places": ["Hooperville, Oregon"], "character_names": ["Alex Montgomery", "Annie Trimble"], "language": "English", "publish_date": "1996-01-16 00:00:00", "ISBN": "0380779617"},
{"url": "https://www.goodreads.com/book/show/11080710-burn-down-the-ground", "num_ratings": "999", "num_reviews": "179", "avg_ratings": 3.9, "genres": ["Autobiography", "Memoir", "Nonfiction", "Biography"], "title": "Burn Down the Ground: A Memoir", "description": ["In this powerful, affecting, and unflinching memoir, a daughter looks back on her unconventional childhood with deaf parents in rural Texas while trying to reconcile her present life—in which her father is serving a twenty-year sentence in a maximum-security prison.", "As a child, Kambri Crews wished that she’d been born deaf so she, too, could fully belong to the tight-knit D", "In this powerful, affecting, and unflinching memoir, a daughter looks back on her unconventional childhood with deaf parents in rural Texas while trying to reconcile her present life—in which her father is serving a twenty-year sentence in a maximum-security prison.", "As a child, Kambri Crews wished that she’d been born deaf so she, too, could fully belong to the tight-knit Deaf community that embraced her parents. Her beautiful mother was a saint who would swiftly correct anyone’s notion that deaf equaled dumb. Her handsome father, on the other hand, was more likely to be found hanging out with the sinners. Strong, gregarious, and hardworking, he managed to turn a wild plot of land into a family homestead complete with running water and electricity. To Kambri, he was Daniel Boone, Frank Lloyd Wright, Ben Franklin, and Elvis all rolled into one. ", "But if Kambri’s dad was Superman, then the hearing world was his kryptonite. The isolation that accompanied his deafness unlocked a fierce temper—a rage that a teenage Kambri witnessed when he attacked her mother, and that culminated fourteen years later in his conviction for another violent crime.  ", "With a smart mix of brutal honesty and blunt humor, Kambri Crews explores her complicated bond with her father—which begins with adoration, moves to fear, and finally arrives at understanding—as she tries to forge a new connection between them while he lives behind bars. ", " is a brilliant portrait of living in two worlds—one hearing, the other deaf; one under the laid-back Texas sun, the other within the energetic pulse of New York City; one mired in violence, the other rife with possibility—and heralds the arrival of a captivating new voice."], "author": "Kambri Crews", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-02-28 00:00:00", "ISBN": "0345516028"},
{"url": "https://www.goodreads.com/book/show/7046495-lover-mine", "num_ratings": "94,931", "num_reviews": "4,018", "avg_ratings": 4.41, "genres": ["Romance", "Paranormal Romance", "Paranormal", "Vampires", "Romance", "Fantasy"], "title": "Lover Mine", "description": ["John Matthew has come a long way since he was found living among humans, his vampire nature unknown to himself and to those around him. After he was taken in by the Brotherhood, no one could guess what his true history was- or his true identity. Indeed, the fallen Brother Darius has returned, but with a different face and a very different destiny. As a vicious personal ven", "John Matthew has come a long way since he was found living among humans, his vampire nature unknown to himself and to those around him. After he was taken in by the Brotherhood, no one could guess what his true history was- or his true identity. Indeed, the fallen Brother Darius has returned, but with a different face and a very different destiny. As a vicious personal vendetta takes John into the heart of the war, he will need to call up on both who he is now and who he once was in order to face off against evil incarnate.", "Xhex, a symphath assassin, has long steeled herself against the attraction between her and John Matthew. Having already lost one lover to madness, she will not allow the male of worth to fall prey to the darkness of her twisted life. When fate intervenes, however, the two discover that love, like destiny, is inevitable between soul mates."], "author": "J.R. Ward", "num_pages": "528", "awards": ["All About Romance (AAR) Annual Reader Poll for Guiltiest Pleasure Romance & Honorable Mention for Best Paranormal Romance (2011)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Vampire Romance (2010)", "Goodreads Choice Award for Romance (2010)"], "places": ["Caldwell, New York"], "character_names": ["John Matthew", "Xhexania", "Qhuinn", "Blaylock", "Lash", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "0451229851"},
{"url": "https://www.goodreads.com/book/show/12938.King_Lear", "num_ratings": "157,709", "num_reviews": "3,540", "avg_ratings": 3.9, "genres": ["Classics", "Plays", "Drama", "Fiction"], "title": "King Lear", "description": ["King Lear, growing old and too tired to reign, decides to divide his realm amongst his three daughters, leaving the largest share to the one who loves him the most. His two eldest daughters, Goneril and Regan, foolish and deceitful children, are rewarded for their insincere flattery. His youngest daughter, Cordelia, however, speaks honestly and truthfully, which enrages th", "King Lear, growing old and too tired to reign, decides to divide his realm amongst his three daughters, leaving the largest share to the one who loves him the most. His two eldest daughters, Goneril and Regan, foolish and deceitful children, are rewarded for their insincere flattery. His youngest daughter, Cordelia, however, speaks honestly and truthfully, which enrages the old king. He disinherits Cordelia, and then drives himself to madness, left to wander the heath with only his Fool, his servant Caius, and the madman Tom O’Bedlam for company. Once reunited with Cordelia, Lear is too late repents his rashness, and must face the tragic consequences of his choices."], "author": "William Shakespeare", "num_pages": "316", "awards": [], "places": [], "character_names": ["Regan", "Cordelia", "Goneril", "Leir of Britain", "Fool", "Duke of Cornwall", "Duke of Albany", "Earl of Kent", "Earl of Gloucester", "Edgar", "Edmund"], "language": "English", "publish_date": "2004-08-16 00:00:00", "ISBN": "074348276X"},
{"url": "https://www.goodreads.com/book/show/37380.The_Heart_Is_a_Lonely_Hunter", "num_ratings": "81,103", "num_reviews": "5,338", "avg_ratings": 3.97, "genres": ["Fiction", "Classics", "Literature"], "title": "The Heart Is a Lonely Hunter", "description": ["An alternate cover for this ISBN can be found ", ".", "Carson McCullers’ prodigious first novel was published to instant acclaim when she was just twenty-three. Set in a small town in the middle of the deep South, it is the story of John Singer, a lonely deaf-mute, and a disparate group of people who are drawn towards his kind, sympathetic nature. The owner of the café where S", "An alternate cover for this ISBN can be found ", ".", "Carson McCullers’ prodigious first novel was published to instant acclaim when she was just twenty-three. Set in a small town in the middle of the deep South, it is the story of John Singer, a lonely deaf-mute, and a disparate group of people who are drawn towards his kind, sympathetic nature. The owner of the café where Singer eats every day, a young girl desperate to grow up, an angry drunkard, a frustrated black doctor: each pours their heart out to Singer, their silent confidant, and he in turn changes their disenchanted lives in ways they could never imagine.", "Contains Chronology, list of Further Reading and Notes."], "author": "Carson McCullers", "num_pages": "368", "awards": [], "places": [], "character_names": ["John Singer", "Spiros Antonapoulos", "Biff Brannon", "Jake Blount", "Mick Kelly", "Benedict Copeland"], "language": "English", "publish_date": "2000-09-08 00:00:00", "ISBN": "0618084746"},
{"url": "https://www.goodreads.com/book/show/16151178-the-sea-of-tranquility", "num_ratings": "71,767", "num_reviews": "9,171", "avg_ratings": 4.33, "genres": ["Young Adult", "Romance", "Contemporary", "Sociology", "Abuse", "Fiction", "New Adult"], "title": "The Sea of Tranquility", "description": ["Former piano prodigy Nastya Kash", "Former piano prodigy Nastya Kashnikov wants two things: to get through high school without anyone learning about her past and to make the boy who took everything from her—her identity, her spirit, her will to live—pay.", "Josh Bennett’s story is no secret: every person he loves has been taken from his life until, at seventeen years old, there is no one left. Now all he wants is be left alone and people allow it because when your name is synonymous with death, everyone tends to give you your space.", "Everyone except Nastya, the mysterious new girl at school who starts showing up and won’t go away until she’s insinuated herself into every aspect of his life. But the more he gets to know her, the more of an enigma she becomes. As their relationship intensifies and the unanswered questions begin to pile up, he starts to wonder if he will ever learn the secrets she’s been hiding—or if he even wants to.", " is a rich, intense, and brilliantly imagined story about a lonely boy, an emotionally fragile girl, and the miracle of second chances."], "author": "Katja Millay", "num_pages": "426", "awards": ["ALA Alex Award (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fiction (2012)"], "places": ["Florida"], "character_names": ["Josh Bennett", "Nastya Kashnikov", "Drew Leighton"], "language": "English", "publish_date": "2012-11-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8853654-his-eyes", "num_ratings": "8,558", "num_reviews": "420", "avg_ratings": 3.77, "genres": ["Young Adult", "Romance", "Contemporary", "Womens Fiction", "Chick Lit", "Realistic Fiction"], "title": "His Eyes", "description": ["Amy Turner's about to graduate from high school and all she wants is a job. Actually, all she wants is to find a way to pay for college. Amy certainly isn't looking for love when she answers an ad to baby-sit a boy-she just needs the cash. But the job has a catch: The boy is blind...and he's her age.", "Tristan Edmund may be hot, but he doesn't want Amy's help. Or so he thinks", "Amy Turner's about to graduate from high school and all she wants is a job. Actually, all she wants is to find a way to pay for college. Amy certainly isn't looking for love when she answers an ad to baby-sit a boy-she just needs the cash. But the job has a catch: The boy is blind...and he's her age.", "Tristan Edmund may be hot, but he doesn't want Amy's help. Or so he thinks. After being blinded in a horse show-jumping competition, Tristan spends his days in the dark, refusing to accept his disability. Much to his annoyance, Amy bursts into his life and drags him into the light. But just as the two begin to see something in each other, Tristan's beautiful ex-girlfriend shows up. Will the temptation be too much, or will Tristan choose the girl who really sees him?"], "author": "Renee Carter", "num_pages": "196", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25460514-resurrection-bay", "num_ratings": "1,024", "num_reviews": "195", "avg_ratings": 3.87, "genres": ["Mystery", "Mystery", "Crime", "Cultural", "Australia", "Fiction"], "title": "Resurrection Bay", "description": ["Caleb Zelic, profoundly deaf since early childhood, has always lived on the outside - watching, picking up telltale signs people hide in a smile, a cough, a kiss. When a childhood friend is murdered, a sense of guilt and a determination to prove his own innocence sends Caleb on a hunt for the killer. But he can’t do it alone. Caleb and his troubled friend Frankie, an ex-co", "Caleb Zelic, profoundly deaf since early childhood, has always lived on the outside - watching, picking up telltale signs people hide in a smile, a cough, a kiss. When a childhood friend is murdered, a sense of guilt and a determination to prove his own innocence sends Caleb on a hunt for the killer. But he can’t do it alone. Caleb and his troubled friend Frankie, an ex-cop, start with one clue: Scott, the last word the murder victim texted to Caleb. But Scott is always one step ahead.", "This gripping, original and fast-paced crime thriller is set between a big city and a small coastal town, Resurrection Bay, where Caleb is forced to confront painful memories. Caleb is a memorable protagonist who refuses to let his deafness limit his opportunities, or his participation in the investigation. But does his persistence border on stubbornness? And at what cost? As he delves deeper into the investigation Caleb uncovers unwelcome truths about his murdered friend – and himself."], "author": "Emma Viskic", "num_pages": "272", "awards": ["Ned Kelly Award for Best First Fiction (2016)", "Davitt Award for Best Adult Novel  (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-09-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10806008-peter-nimble-and-his-fantastic-eyes", "num_ratings": "7,255", "num_reviews": "1,086", "avg_ratings": 4.05, "genres": ["Fantasy", "Childrens", "Middle Grade", "Adventure", "Fiction", "Childrens", "Young Adult"], "title": "Peter Nimble and His Fantastic Eyes", "description": [" is the utterly beguiling tale of a ten-year-old blind orphan who has been schooled in a life of thievery. One fateful afternoon, he steals a box from a mysterious traveling haberdasher—a box that contains three pairs of magical eyes. When he tries the first pair, he is instantly transported to a hidden island where he is presented with a", " is the utterly beguiling tale of a ten-year-old blind orphan who has been schooled in a life of thievery. One fateful afternoon, he steals a box from a mysterious traveling haberdasher—a box that contains three pairs of magical eyes. When he tries the first pair, he is instantly transported to a hidden island where he is presented with a special quest: to travel to the dangerous Vanished Kingdom and rescue a people in need. Along with his loyal sidekick—a knight who has been turned into an unfortunate combination of horse and cat—and the magic eyes, he embarks on an unforgettable, swashbuckling adventure to discover his true destiny."], "author": "Jonathan Auxier", "num_pages": "400", "awards": ["Monica Hughes Award for Science Fiction and Fantasy Nominee (2012)", "Diamond Willow Award (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-01 00:00:00", "ISBN": "1419700251"},
{"url": "https://www.goodreads.com/book/show/6563622-the-shadow-of-the-wind", "num_ratings": "355,571", "num_reviews": "27,679", "avg_ratings": 4.25, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Fantasy"], "title": "The Shadow of the Wind", "description": ["Barcelona, 1945. Just after the war, a great world city lies in shadow, nursing its wounds, and a boy named Daniel awakes on his eleventh birthday to find that he can no longer remember his mother’s face. To console his only child, Daniel’s widowed father, an antiquarian book dealer, initiates him into the secret of the Cemetery of Forgotten Books, a library tended by Barc", "Barcelona, 1945. Just after the war, a great world city lies in shadow, nursing its wounds, and a boy named Daniel awakes on his eleventh birthday to find that he can no longer remember his mother’s face. To console his only child, Daniel’s widowed father, an antiquarian book dealer, initiates him into the secret of the Cemetery of Forgotten Books, a library tended by Barcelona’s guild of rare-book dealers as a repository for books forgotten by the world, waiting for someone who will care about them again. Daniel’s father coaxes him to choose a volume from the spiraling labyrinth of shelves, one that, it is said, will have a special meaning for him. And Daniel so loves the novel he selects, 'The Shadow of the Wind', by one Julian Carax, that he sets out to find the rest of Carax’s work. To his shock, he discovers that someone has been systematically destroying every copy of every book this author has written. In fact, he may have the last one in existence. Before Daniel knows it his seemingly innocent quest has opened a door into one of Barcelona’s darkest secrets, an epic story of murder, magic, madness and doomed love. And before long he realizes that if he doesn’t find out the truth about Julian Carax, he and those closest to him will suffer horribly."], "author": "Carlos Ruiz Zafón", "num_pages": "512", "awards": ["Barry Award for Best First Novel (2005)", "Borders Original Voices Award for Fiction (2004)", "Dilys Award Nominee (2005)", "Humo's Gouden Bladwijzer (2006)", "Prix du Meilleur Livre Étranger for Roman (2004)", "Prix des libraires du Québec for Lauréats hors Québec (2005)", "One Book One San Diego (2015)", "Premi Llibreter de narrativa Nominee (2002)"], "places": ["Spain", "Barcelona, Catalonia"], "character_names": ["Daniel Sempere", "Fermín Romero de Torres", "Julián Carax", "Miquel Moliner", "Nuria Monfort", "Francisco Javier Fumero", "Beatriz Aguilar", "Jorge Aldaya", "Penélope Aldaya", "Antoni Fortuny", "Clara Barceló", "Monsieur Darcieu", "Viçenteta", "Teniente Palacios", "Doña Yvonne Sotoceballos", "Jacinta Coronado", "Gustavo Barceló", "Bernarda", "Fernando Ramos", "Sophie Carax", "Candide (Voltaire)"], "language": "English", "publish_date": "2009-04-16 00:00:00", "ISBN": "0297857134"},
{"url": "https://www.goodreads.com/book/show/18752451-love-in-touch", "num_ratings": "774", "num_reviews": "87", "avg_ratings": 3.96, "genres": ["Romance", "Contemporary", "New Adult", "Disability", "Romance", "Contemporary Romance"], "title": "Love In Touch", "description": ["Kassie has felt adrift ever since her dad died when she was in college. Now 24 and living in Seattle, she gets interested in learning sign language through her roommate, a sign language interpreter. One day at a Deaf community event, she sees a young man sitting off by himself. Kassie feels compelled to try signing to him–the fact that he’s strikingly handsome doesn’t hurt", "Kassie has felt adrift ever since her dad died when she was in college. Now 24 and living in Seattle, she gets interested in learning sign language through her roommate, a sign language interpreter. One day at a Deaf community event, she sees a young man sitting off by himself. Kassie feels compelled to try signing to him–the fact that he’s strikingly handsome doesn’t hurt.", "Jake has been deaf and blind since birth. His disability has cut him off from the world, but beneath his isolated exterior, is a smart, sweet guy with a dry sense of humor. Despite the odds, he’s highly educated, but at 26, he’s gotten stuck in a rut, with few friends and no clear career plans. Until a sweet-smelling girl introduces herself to him unexpectedly, and opens up a whole new world to him.", "Jake is more intelligent, more genuine than anyone she has met before, and for the first time Kassie starts to feel like her life has some direction. But as their friendship deepens into something more, the difficulty in communicating with each other only grows, and it seems like everyone they know thinks their relationship won’t work. How can they come to a deeper understanding of each other, and find a future together?"], "author": "Lucy May Lennox", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-01 00:00:00", "ISBN": "0985826339"},
{"url": "https://www.goodreads.com/book/show/42899.Dark_Lover", "num_ratings": "254,974", "num_reviews": "11,387", "avg_ratings": 4.21, "genres": ["Romance", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Paranormal Romance", "Fantasy"], "title": "Dark Lover", "description": ["In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherhood.", "The only purebred vampire left on earth, Wrath has a score", "In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherhood.", "The only purebred vampire left on earth, Wrath has a score to settle with the slayers who murdered his parents centuries ago. But, when one of his most trusted fighters is killed-leaving his half-breed daughter unaware of his existence or her fate-Wrath must usher her into the world of the undead-a world of sensuality beyond her wildest dreams."], "author": "J.R. Ward", "num_pages": "393", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Alt Reality/Paranormal (2006)", "RITA Award by Romance Writers of America Nominee for Paranormal Romance (2006)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Vampire Romance (2005)", "HOLT Medallion by Virginia Romance Writers Nominee for Paranormal/Time Travel/Futuristic/Fantasy (2006)", "DABWAHA Romance Tournament for Best Paranormal: Vampires, Werewolves, and the Supernatural (2006)"], "places": ["Caldwell, New York", "New York (the state)"], "character_names": ["Mr. X", "Marissa", "Brian O'Neal", "Zsadist", "Vishous", "Fritz Perlmutter", "Phury", "Beth (Elizabeth) Randall", "Tohrment", "Mr. O", "Wellesandra", "Darius", "The Scribe Virgin", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0451216954"},
{"url": "https://www.goodreads.com/book/show/19140611-the-dry", "num_ratings": "127", "num_reviews": "34", "avg_ratings": 4.31, "genres": ["Fantasy", "Historical", "Historical Fiction", "Young Adult", "Fiction", "Science Fiction Fantasy"], "title": "The Dry", "description": ["West Virginia, 1895. A deadly dry spell has left the earth parched and souls desperate. Crops are failing. Cities are starving. A missing newspaper man doesn't account for much in times so terrible, except to the twelve-year-old son he left behind. When Elliot Sweeney discovers the search for his father has been called off, he boards a train alone to find him. His quest le", "West Virginia, 1895. A deadly dry spell has left the earth parched and souls desperate. Crops are failing. Cities are starving. A missing newspaper man doesn't account for much in times so terrible, except to the twelve-year-old son he left behind. When Elliot Sweeney discovers the search for his father has been called off, he boards a train alone to find him. His quest leads Elliot into the depths of an abandoned mine, with a peculiar pocket watch, a blind burro, and a gutsy girl at his side. He discovers a world he never dreamed of, even in his worst nightmares, and lands smack in the middle of a war between two kingdoms. Monstrous insects, smiling villains, and dark riddles are everywhere. Deciding who to trust may prove to be his greatest challenge, while the fate of the world above hangs on Elliot's choice."], "author": "Rebecca Nolen", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-22 00:00:00", "ISBN": "193988912X"},
{"url": "https://www.goodreads.com/book/show/11870085-the-fault-in-our-stars", "num_ratings": "2,832,966", "num_reviews": "146,388", "avg_ratings": 4.25, "genres": ["Young Adult", "Fiction", "Romance", "Contemporary"], "title": "The Fault in Our Stars", "description": ["Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.", "Insightful, bold, irreverent, and raw, The Fault in Our Stars", "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.", "Insightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love."], "author": "John Green", "num_pages": "313", "awards": ["Georgia Peach Book Award (2013)", "Buxtehuder Bulle (2012)", "Odyssey Award (2013)", "Audie Award for Teens (2013)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2013)", "Pennsylvania Young Readers' Choice Award for Young Adults (2013)", "Evergreen Teen Book Award (2015)", "Soaring Eagle Book Award (2014)", "Milwaukee County Teen Book Award (2013)", "Indies Choice Book Award for Young Adult (2013)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2013)", "Amelia Elizabeth Walden Award (2013)", "Dioraphte Jongerenliteratuurprijs for vertaald boek en publieksprijs (2013)", "The Inky Awards for Silver Inky (2012)", "California Young Readers Medal for Young Adult (2015)", "Lincoln Award (2014)", "Luisterboek Award (2015)", "Goodreads Choice Award for Best Young Adult Fiction (2012)", "Green Mountain Book Award (2014)", "The Inky Awards Shortlist for Silver Inky (2012)", "Louisiana Teen Readers' Choice (2015)", "Missouri Gateway Readers Award (2015)", "Oklahoma Sequoyah Award for High School (2015)", "Alabama Author Award for Young Adult (2013)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera independiente (2012)", "FAB Award Nominee (2014)"], "places": ["Indianapolis, Indiana", "Amsterdam"], "character_names": ["Hazel Grace Lancaster", "Augustus Waters", "Isaac"], "language": "English", "publish_date": "2012-01-10 00:00:00", "ISBN": "0525478817"},
{"url": "https://www.goodreads.com/book/show/10210.Jane_Eyre", "num_ratings": "1,364,345", "num_reviews": "34,236", "avg_ratings": 4.11, "genres": ["Classics", "Fiction", "Romance"], "title": "Jane Eyre", "description": [" ", " "], "author": "Charlotte Brontë", "num_pages": "507", "awards": [], "places": ["Thornfield", "England"], "character_names": ["Jane Eyre", "Bertha Mason", "Grace Poole", "Blanche Ingram", "Adele Varens", "St. John Rivers", "Helen Burns", "Richard Mason", "Diana Rivers", "Mary Rivers", "Maria Temple", "Robert Brocklehurst", "Sarah Reed", "Georgiana Reed", "Eliza Reed", "Bessie Lee", "Alice Fairfax", "Rosamond Oliver", "Edward Rochester", "John Eyre", "Celine Varens"], "language": "English", "publish_date": "2003-02-04 00:00:00", "ISBN": "0142437204"},
{"url": "https://www.goodreads.com/book/show/18089551-tall-tatted-and-tempting", "num_ratings": "26,187", "num_reviews": "1,974", "avg_ratings": 4.22, "genres": ["Romance", "Contemporary", "Romance", "Contemporary Romance", "Disability"], "title": "Tall, Tatted and Tempting", "description": ["She’s locked up tight. But he might be the key.", "Logan Reed is tall, tatted and tempting. Kit’s a woman with a mean right hook and a secret.", "Kit wants a tattoo, but Logan sees more than she intends to share in the drawing of the tat she wants. He sees her in ways no one ever has.", "Logan’s not disabled; but he hasn’t spoken in eight years. He hasn’t needed to. Until he meets Kit", "She’s locked up tight. But he might be the key.", "Logan Reed is tall, tatted and tempting. Kit’s a woman with a mean right hook and a secret.", "Kit wants a tattoo, but Logan sees more than she intends to share in the drawing of the tat she wants. He sees her in ways no one ever has.", "Logan’s not disabled; but he hasn’t spoken in eight years. He hasn’t needed to. Until he meets Kit.", "Logan doesn’t know everything about Kit. Kit doesn’t know anything about herself, until she has to sacrifice all she ever wanted to save what’s most important to him."], "author": "Tammy Falkner", "num_pages": "323", "awards": [], "places": ["New York (the state)"], "character_names": ["Logan", "Emily"], "language": "English", "publish_date": "2013-06-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20639274-archer-s-voice", "num_ratings": "67,697", "num_reviews": "8,458", "avg_ratings": 4.43, "genres": ["Romance", "New Adult", "Contemporary", "Romance", "Contemporary Romance"], "title": "Archer's Voice", "description": ["When Bree Prescott arrives in the sleepy, lakeside town of Pelion, Maine, she hopes against hope that this is the place where she will finally find the peace she so desperately seeks. On her first day there, her life collides with Archer Hale, an isola", "When Bree Prescott arrives in the sleepy, lakeside town of Pelion, Maine, she hopes against hope that this is the place where she will finally find the peace she so desperately seeks. On her first day there, her life collides with Archer Hale, an isolated man who holds a secret agony of his own. A man no one else sees.", " is the story of a woman chained to the memory of one horrifying night and the man whose love is the key to her freedom. It is the story of a silent man who lives with an excruciating wound and the woman who helps him find his voice. It is the story of suffering, fate, and the transformative power of love.", "THIS IS A STANDALONE SIGN OF LOVE NOVEL, INSPIRED BY SAGITTARIUS. New Adult Contemporary Romance: Due to strong language and sexual content, this book is not intended for readers under the age of 18."], "author": "Mia Sheridan", "num_pages": "345", "awards": ["Goodreads Choice Award Nominee for Romance (2014)"], "places": ["Maine"], "character_names": ["Archer Hale", "Bree Prescott"], "language": "English", "publish_date": "2014-01-25 00:00:00"}
]