[
{"url": "https://www.goodreads.com/book/show/60931.Kindred", "num_ratings": "60,626", "num_reviews": "7,284", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Science Fiction", "Fantasy", "Science Fiction", "Time Travel"], "title": "Kindred", "description": ["The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into ante", "The first science fiction written by a black woman, ", " has become a cornerstone of black American literature. This combination of slave memoir, fantasy, and historical fiction is a novel of rich literary complexity. Having just celebrated her 26th birthday in 1976 California, Dana, an African-American woman, is suddenly and inexplicably wrenched through time into antebellum Maryland. After saving a drowning white boy there, she finds herself staring into the barrel of a shotgun and is transported back to the present just in time to save her life. During numerous such time-defying episodes with the same young man, she realizes the challenge she’s been given: to protect this young slaveholder until he can father her own great-grandmother."], "author": "Octavia E. Butler", "num_pages": "287", "awards": [], "places": ["Maryland", "Altadena, California"], "character_names": ["Dana Franklin", "Kevin Franklin", "Rufus Weylin", "Tom Weylin", "Margaret Weylin", "Alice Greenwood"], "language": "English", "publish_date": "2004-02-01 00:00:00", "ISBN": "0807083690"},
{"url": "https://www.goodreads.com/book/show/5292853-hunting-ground", "num_ratings": "52,180", "num_reviews": "1,883", "avg_ratings": 4.27, "genres": ["Fantasy", "Fantasy", "Paranormal", "Fantasy", "Urban Fantasy", "Romance", "Romance", "Paranormal Romance", "Shapeshifters", "Werewolves"], "title": "Hunting Ground", "description": ["Anna Latham didn’t know how complicated life could be until she became a werewolf. And until she was mated to Charles Cornick, the son — and enforcer — of Bran, the leader of the North American werewolves, she didn’t know how dangerous it could be either...", "Anna and Charles have just been enlisted to attend a summit to present Bran’s controversial proposition: that the wolv", "Anna Latham didn’t know how complicated life could be until she became a werewolf. And until she was mated to Charles Cornick, the son — and enforcer — of Bran, the leader of the North American werewolves, she didn’t know how dangerous it could be either...", "Anna and Charles have just been enlisted to attend a summit to present Bran’s controversial proposition: that the wolves should finally reveal themselves to humans. But the most feared Alpha in Europe is dead set against the plan — and it seems like someone else might be too. When Anna is attacked by vampires using pack magic, the kind of power only werewolves should be able to draw on, Charles and Anna must combine their talents to hunt down whoever is behind it all — or risk losing everything..."], "author": "Patricia Briggs", "num_pages": "286", "awards": ["Endeavour Award Nominee (2010)"], "places": ["Seattle, Washington"], "character_names": ["Samuel Cornick", "Charles Cornick", "Anna Latham", "Asil \"The Moor\" (Hussan)", "Dana Shea", "Arthur Madden", "Sunny Madden", "Jean Chastel", "Heinrich Postinger", "Bran \"The Marrok\" Cornick"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "044101738X"},
{"url": "https://www.goodreads.com/book/show/47520.Castle_in_the_Air", "num_ratings": "30,126", "num_reviews": "1,849", "avg_ratings": 3.93, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Castle in the Air", "description": ["Far to the south of the land of Ingary, in the Sultanates of Rashpuht, there lived in the city of Zanzib a young and not very prosperous carpet dealer named Abdullah who loved to spend his time daydreaming. He was content with his life and his daydreams until, one day, a stranger sold him a", "Far to the south of the land of Ingary, in the Sultanates of Rashpuht, there lived in the city of Zanzib a young and not very prosperous carpet dealer named Abdullah who loved to spend his time daydreaming. He was content with his life and his daydreams until, one day, a stranger sold him a magic carpet.", "That very night, the carpet flew him to an enchanted garden. There, he met and fell in love with the beauteous princess Flower-in-the-Night, only to have her snatched away, right under his very nose, by a wicked djinn. With only his magic carpet and his wits to help him, Abdullah sets off to rescue his princess...."], "author": "Diana Wynne Jones", "num_pages": "298", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (1992)"], "places": ["Ingary"], "character_names": ["Sophie Hatter", "Calcifer", "Abdullah"], "language": "English", "publish_date": "2001-08-07 00:00:00", "ISBN": "0064473457"},
{"url": "https://www.goodreads.com/book/show/7864587-the-iron-duke", "num_ratings": "14,430", "num_reviews": "1,869", "avg_ratings": 3.86, "genres": ["Science Fiction", "Steampunk", "Romance", "Fantasy", "Romance", "Paranormal Romance", "Horror", "Zombies", "Fantasy", "Paranormal"], "title": "The Iron Duke", "description": ["After the Iron Duke freed England from Horde control, he instantly became a national hero. Now Rhys Trahaearn has built a merchant empire on the power - and fear - of his name. And when a dead body is dropped from an airship onto his doorstep, bringing Detective Inspector Mina Wentworth into his dangerous world, he intends to make her his next possession.", "But when Mina unco", "After the Iron Duke freed England from Horde control, he instantly became a national hero. Now Rhys Trahaearn has built a merchant empire on the power - and fear - of his name. And when a dead body is dropped from an airship onto his doorstep, bringing Detective Inspector Mina Wentworth into his dangerous world, he intends to make her his next possession.", "But when Mina uncovers the victim's identity, she stumbles upon a conspiracy that threatens the lives of everyone in England. To save them, Mina and Rhys must race across zombie-infested wastelands and treacherous oceans-and Mina discovers the danger is not only to her countrymen, as she finds herself tempted to give up everything to the Iron Duke."], "author": "Meljean Brook", "num_pages": "384", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Paranormal Romance & Honorable Mention for Best Romance (2011)", "Romantic Times Reviewers' Choice Award (RT Award) for Paranormal Romance (2010)", "DABWAHA Romance Tournament Nominee for Best Paranormal/Urban Fantasy/Science Fiction (2011)", "Goodreads Choice Award Nominee for Romance (2010)"], "places": [], "character_names": ["Mina Wentworth", "Rhys Trahaearn"], "language": "English", "publish_date": "2010-10-05 00:00:00", "ISBN": "0425236676"},
{"url": "https://www.goodreads.com/book/show/178476.Slave_to_Sensation", "num_ratings": "52,286", "num_reviews": "3,252", "avg_ratings": 4.12, "genres": ["Fantasy", "Paranormal", "Romance", "Romance", "Paranormal Romance", "Fantasy", "Fantasy", "Urban Fantasy", "Paranormal", "Shapeshifters"], "title": "Slave to Sensation", "description": ["Nalini Singh dives into a world torn apart by a powerful race with phenomenal powers of the mind-and none of the heart.", "In a world that denies emotions, where the ruling Psy punish any sign of desire, Sascha Duncan must conceal the feelings that brand her as flawed. To reveal them would be to sentence herself to the horror of \"r", "Nalini Singh dives into a world torn apart by a powerful race with phenomenal powers of the mind-and none of the heart.", "In a world that denies emotions, where the ruling Psy punish any sign of desire, Sascha Duncan must conceal the feelings that brand her as flawed. To reveal them would be to sentence herself to the horror of \"rehabilitation\" - the complete psychic erasure of everything she ever was...", "Both human and animal, Lucas Hunter is a changeling hungry for the very sensations the Psy disdain. After centuries of uneasy coexistence, these two races are now on the verge of war over the brutal murders of several changeling women. Lucas is determined to find the Psy killer who butchered his packmate, and Sascha is his ticket into their closely guarded society. But he soon discovers that this ice-cold Psy is very capable of passion - and that the animal in him is fascinated by her. Caught between their conflicting worlds, Lucas and Sascha must remain bound to their identities - or sacrifice everything for a taste of darkest temptation."], "author": "Nalini Singh", "num_pages": "334", "awards": [], "places": ["San Francisco, California"], "character_names": ["Sascha Duncan", "Lucas Hunter", "Brenna Shane Kincaid", "Judd Lauren", "Clay Bennett", "Mercy Smith", "Hawke Snow", "Walker Lauren", "Sienna Lauren", "Nate Ryder", "Tamsyn Mahaire", "Dorian Christensen", "Kit Monahan", "Nikita Duncan", "Vaughn D'Angelo"], "language": "English", "publish_date": "2006-09-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/58894.Daja_s_Book", "num_ratings": "25,435", "num_reviews": "367", "avg_ratings": 4.08, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Daja's Book", "description": ["Outcast Trader Daja, along with her fellow mages-in-training, journeys from Winding Circle to the Gold Ridge Mountains, where drought threatens widespread famine. There, Daja creates an astonishing object: a living metal vine, and Daja's dealings with her former people reawaken a longing for familiar ways.", "Daja must choose - should s", "Outcast Trader Daja, along with her fellow mages-in-training, journeys from Winding Circle to the Gold Ridge Mountains, where drought threatens widespread famine. There, Daja creates an astonishing object: a living metal vine, and Daja's dealings with her former people reawaken a longing for familiar ways.", "Daja must choose - should she return to the Traders or remain with the Winding Circle folk who have become her family?"], "author": "Tamora Pierce", "num_pages": "232", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2000)"], "places": [], "character_names": ["Rosethorn", "Sandrilene fa Toren", "Trisana Chandler", "Briar Moss", "Daja Kisubo", "Niklaren Goldeye", "Frostpine", "Lark"], "language": "English", "publish_date": "2006-06-24 00:00:00", "ISBN": "0590554107"},
{"url": "https://www.goodreads.com/book/show/7090447-the-red-pyramid", "num_ratings": "267,551", "num_reviews": "11,681", "avg_ratings": 4.07, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Red Pyramid", "description": ["Since his mother's death six years ago, Carter Kane has been living out of a suitcase, traveling the globe with his father, the brilliant Egyptologist, Dr. Julius Kane. But while Carter's been homeschooled, his younger sister, Sadie, has been living with their grandparents in London. Sadie has just what Carter wants—school friends and a chance at a \"normal\" life. But Carte", "Since his mother's death six years ago, Carter Kane has been living out of a suitcase, traveling the globe with his father, the brilliant Egyptologist, Dr. Julius Kane. But while Carter's been homeschooled, his younger sister, Sadie, has been living with their grandparents in London. Sadie has just what Carter wants—school friends and a chance at a \"normal\" life. But Carter has just what Sadie longs for—time with their father. After six years of living apart, the siblings have almost nothing in common. Until now.", "On Christmas Eve, Sadie and Carter are reunited when their father brings them to the British Museum, with a promise that he's going to \"make things right.\" But all does not go according to plan: Carter and Sadie watch as Julius summons a mysterious figure, who quickly banishes their father and causes a fiery explosion.", "Soon Carter and Sadie discover that the gods of Ancient Egypt are waking, and the worst of them—Set—has a frightening scheme. To save their father, they must embark on a dangerous journey—a quest that brings them ever closer to the truth about their family and its links to the House of Life, a secret order that has existed since the time of the pharaohs."], "author": "Rick Riordan", "num_pages": "516", "awards": ["Pennsylvania Young Readers' Choice Award for Grades 6-8 (2012)", "New Mexico Land of Enchantment Award for Young Adult (2012)", "Goodreads Choice Award Nominee for Favorite Book, Young Adult Fantasy (2010)", "Carnegie Medal Nominee (2011)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2011)"], "places": ["London, England", "Cairo", "Phoenix, Arizona", "Duat"], "character_names": ["Bast", "Isis", "Anubis", "Osiris", "Horus (God)", "Carter Kane", "Sadie Kane", "Zia Rashid", "Thoth", "Khufu", "Sekhmet", "Julius Kane", "Geb", "Nut", "Set", "Nephthys", "Serket", "Sobek", "Shu", "Nekhbet", "Apophis", "Philip II of Macedon (The albino crocodile)"], "language": "English", "publish_date": "2010-05-04 00:00:00", "ISBN": "1423113381"},
{"url": "https://www.goodreads.com/book/show/3128411-bone-crossed", "num_ratings": "85,016", "num_reviews": "2,585", "avg_ratings": 4.34, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Shapeshifters", "Werewolves"], "title": "Bone Crossed", "description": ["By day, Mercy is a car mechanic in the sprawling Tri-Cities of Eastern Washington. By night, she explores her preternatural side. As a shapeshifter with some unique talents, Mercy has often found herself having to maintain a tenuous harmony between the human and the not so human. This time she may get more than she bargained for.", "Marsilia, the local Vampire Queen, has learn", "By day, Mercy is a car mechanic in the sprawling Tri-Cities of Eastern Washington. By night, she explores her preternatural side. As a shapeshifter with some unique talents, Mercy has often found herself having to maintain a tenuous harmony between the human and the not so human. This time she may get more than she bargained for.", "Marsilia, the local Vampire Queen, has learned that Mercy crossed her by slaying a member of her clan—and she's out for blood. But since Mercy is protected from direct reprisal by the werewolf pack (and her close relationship with its sexy Alpha), it won't be Mercy's blood Marsilia is after.", "It'll be her friends'."], "author": "Patricia Briggs", "num_pages": "300", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Urban Fantasy (2009)", "P.E.A.R.L. (Paranormal Excellence Award for Romantic Literature) for Best Urban Fantasy Romance (2009)", "Goodreads Choice Award Nominee for Fantasy (2009)"], "places": ["United States of America", "Washington (the state)", "Tri-Cities, Washington", "Spokane, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Darryl Zao", "Warren", "Wulfe", "Kyle Brooks", "Stefan Uccello", "Marsilia", "Elizaveta Arkadyevna Vyshnevetskaya", "Uncle Mike", "Tony Montenegro", "Margi Thompson", "Ben (werewolf)"], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "1841496863"},
{"url": "https://www.goodreads.com/book/show/7507944-akata-witch", "num_ratings": "9,605", "num_reviews": "1,939", "avg_ratings": 4.09, "genres": ["Fantasy", "Young Adult", "Fiction", "Cultural", "Africa", "Childrens", "Middle Grade", "Fantasy", "Magic"], "title": "Akata Witch", "description": [" transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befr", " transports the reader to a magical place where nothing is quite as it seems. Born in New York, but living in Aba, Nigeria, twelve-year old Sunny is understandably a little lost. She is albino and thus, incredibly sensitive to the sun. All Sunny wants to do is be able to play football and get through another day of school without being bullied. But once she befriends Orlu and Chichi, Sunny is plunged in to the world of the Leopard People, where your worst defect becomes your greatest asset. Together, Sunny, Orlu, Chichi and Sasha form the youngest ever Oha Coven. Their mission is to track down Black Hat Otokoto, the man responsible for kidnapping and maiming children. Will Sunny be able to overcome the killer with powers stronger than her own, or will the future she saw in the flames become reality?"], "author": "Nnedi Okorafor", "num_pages": "349", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2011)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)"], "places": ["Nigeria"], "character_names": ["Sunny Nwazue"], "language": "English", "publish_date": "2011-04-14 00:00:00", "ISBN": "0670011967"},
{"url": "https://www.goodreads.com/book/show/84119.The_Horse_and_His_Boy", "num_ratings": "227,145", "num_reviews": "5,558", "avg_ratings": 3.91, "genres": ["Fantasy", "Classics", "Fiction", "Young Adult", "Childrens"], "title": "The Horse and His Boy", "description": [" is a stirring and dramatic fantasy story that finds a young boy named Shasta on the run from his homeland with the talking horse, Bree. When the pair discover a deadly plot by the Calormen people to conquer the land of Narnia, the race is on to warn the inhabitants of the impending danger and to rescue them all from certain death."], "author": "C.S. Lewis", "num_pages": "224", "awards": [], "places": ["Narnia"], "character_names": ["Aslan", "Lucy Pevensie", "Edmund Pevensie", "Aravis", "Peter Pevensie", "Susan Pevensie", "Shasta", "Брий", "Шаста", "Хуин", "Аравис"], "language": "English", "publish_date": "1995-08-16 00:00:00", "ISBN": "0439861365"},
{"url": "https://www.goodreads.com/book/show/7904453-the-broken-kingdoms", "num_ratings": "16,631", "num_reviews": "1,383", "avg_ratings": 4.05, "genres": ["Fantasy", "Fiction", "Romance", "Fantasy", "Epic Fantasy", "Fantasy", "Magic"], "title": "The Broken Kingdoms", "description": ["In the city of Shadow, beneath the World Tree, alleyways shimmer with magic and godlings live hidden among mortalkind. Oree Shoth, a blind artist, takes in a homeless man who glows like a living sun to her strange sight. This act of kindness engulfs Oree in a nightmarish conspiracy. Someone, somehow, is murdering godlings, leaving their desecrated bodies all over the city.", "In the city of Shadow, beneath the World Tree, alleyways shimmer with magic and godlings live hidden among mortalkind. Oree Shoth, a blind artist, takes in a homeless man who glows like a living sun to her strange sight. This act of kindness engulfs Oree in a nightmarish conspiracy. Someone, somehow, is murdering godlings, leaving their desecrated bodies all over the city. ", "Oree's peculiar guest is at the heart of it, his presence putting her in mortal danger -- but is it him the killers want, or Oree? And is the earthly power of the Arameri king their ultimate goal, or have they set their sights on the Lord of Night himself?"], "author": "N.K. Jemisin", "num_pages": "384", "awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Fantasy (2010)"], "places": [], "character_names": ["Lil", "Oree Shoth", "Shiny", "Madding", "Dateh", "Kitr", "Hado", "Serymn", "Nahadoth", "Sieh", "T'vril Arameri", "Yeine Darr/Arameri", "Itempas"], "language": "English", "publish_date": "2010-11-03 00:00:00", "ISBN": "0316043966"},
{"url": "https://www.goodreads.com/book/show/5585788-skinwalker", "num_ratings": "28,326", "num_reviews": "1,731", "avg_ratings": 3.89, "genres": ["Paranormal", "Shapeshifters", "Adult", "Paranormal", "Witches", "Romance"], "title": "Skinwalker", "description": ["Jane Yellowrock is a supernatural skinwalker--one sharing her body with the soul of a mountain lion. When the rogue-vampire hunter is hired to hunt down a particularly nasty vamp, Jane is drawn into the steamy New Orleans vampire society where she learns the ins-and-outs of the \"sane\" vampire culture, more", "Jane Yellowrock is a supernatural skinwalker--one sharing her body with the soul of a mountain lion. When the rogue-vampire hunter is hired to hunt down a particularly nasty vamp, Jane is drawn into the steamy New Orleans vampire society where she learns the ins-and-outs of the \"sane\" vampire culture, more about her own Cherokee heritage, and we are drawn into a rousing, fast-paced thriller."], "author": "Faith Hunter", "num_pages": "320", "awards": [], "places": ["New Orleans, Louisiana"], "character_names": ["Brian Robere", "Brandon Robere", "Jane Yellowrock", "Leo Pellissier", "George \"Bruiser\" Dumas", "Rick (Ricky Bo) LeFleur", "Beast", "Katherine (Katie) Fontaneau", "Tom (Troll)", "Jodi Richoux", "Aggie One Feather"], "language": "English", "publish_date": "2009-07-07 00:00:00", "ISBN": "0451462807"},
{"url": "https://www.goodreads.com/book/show/830.Snow_Crash", "num_ratings": "202,849", "num_reviews": "7,758", "avg_ratings": 4.03, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Cyberpunk"], "title": "Snow Crash", "description": ["In reality, Hiro Protagonist delivers pizza for Uncle Enzo’s CosoNostra Pizza Inc., but in the Metaverse he’s a warrior prince. Plunging headlong into the enigma of a new computer virus that’s striking down hackers everywhere, he races along the neon-lit streets on a search-and-destroy mission for the shadowy virtual villain threatening to bring about infocalypse. Snow Cra", "In reality, Hiro Protagonist delivers pizza for Uncle Enzo’s CosoNostra Pizza Inc., but in the Metaverse he’s a warrior prince. Plunging headlong into the enigma of a new computer virus that’s striking down hackers everywhere, he races along the neon-lit streets on a search-and-destroy mission for the shadowy virtual villain threatening to bring about infocalypse. Snow Crash is a mind-altering romp through a future America so bizarre, so outrageous…you’ll recognize it immediately."], "author": "Neal Stephenson", "num_pages": "438", "awards": ["Arthur C. Clarke Award Nominee (1994)", "British Science Fiction Association Award Nominee (1993)", "Grand Prix de l'Imaginaire for Roman étranger (1997)", "Prometheus Award Nominee for Best Novel (1993)", "Washington State Book Award (1993)"], "places": ["United States of America"], "character_names": ["Hiro Protagonist", "Y.T.", "Da5id Meier", "Juanita Marquez", "Dr. Emanuel Lagos", "Uncle Enzo", "L. Bob Rife", "Dmitri \"Raven\" Ravinoff"], "language": "English", "publish_date": "2000-08-02 00:00:00", "ISBN": "0553380958"},
{"url": "https://www.goodreads.com/book/show/7767021-who-fears-death", "num_ratings": "11,143", "num_reviews": "1,730", "avg_ratings": 3.96, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Dystopia", "Cultural", "Africa"], "title": "Who Fears Death", "description": [" In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, sh", " In a far future, post-nuclear-holocaust Africa, genocide plagues one region. The aggressors, the Nuru, have decided to follow the Great Book and exterminate the Okeke. But when the only surviving member of a slain Okeke village is brutally raped, she manages to escape, wandering farther into the desert. She gives birth to a baby girl with hair and skin the color of sand and instinctively knows that her daughter is different. She names her daughter Onyesonwu, which means \"Who Fears Death?\" in an ancient African tongue.", " Reared under the tutelage of a mysterious and traditional shaman, Onyesonwu discovers her magical destiny – to end the genocide of her people. The journey to fulfill her destiny will force her to grapple with nature, tradition, history, true love, the spiritual mysteries of her culture – and eventually death itself."], "author": "Nnedi Okorafor", "num_pages": "386", "awards": ["Nebula Award Nominee for Best Novel (2010)", "Locus Award Nominee for Best Fantasy Novel (2011)", "World Fantasy Award for Best Novel (2011)", "Grand Prix de l'Imaginaire Nominee for Roman étranger (2014)", "Prix Imaginales for Roman étranger (2014)", "Goodreads Choice Award Nominee for Fantasy (2010)", "James Tiptree Jr. Award Honor List (2010)"], "places": [], "character_names": ["Onyesonwu Ubaid-Ogundimu", "Mwita", "Najeeba", "Aro (Who Fears Death series)", "Luyu", "Binta", "Diti", "Fanasi", "Daib"], "language": "English", "publish_date": "2010-06-01 00:00:00", "ISBN": "075640617X"},
{"url": "https://www.goodreads.com/book/show/9317452-rivers-of-london", "num_ratings": "58,436", "num_reviews": "6,284", "avg_ratings": 3.92, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Mystery", "Fiction", "Mystery", "Crime", "Fantasy", "Paranormal"], "title": "Rivers of London", "description": ["Probationary Constable Peter Grant dreams of being a detective in London’s Metropolitan Police. Too bad his superior plans to assign him to the Case Progression Unit, where the biggest threat he’ll face is a paper cut. But Peter’s prospects change in the aftermath of a puzzling murder, when he gains exclusive information from an eyewitness who happens to be a ghost. Peter’", "Probationary Constable Peter Grant dreams of being a detective in London’s Metropolitan Police. Too bad his superior plans to assign him to the Case Progression Unit, where the biggest threat he’ll face is a paper cut. But Peter’s prospects change in the aftermath of a puzzling murder, when he gains exclusive information from an eyewitness who happens to be a ghost. Peter’s ability to speak with the lingering dead brings him to the attention of Detective Chief Inspector Thomas Nightingale, who investigates crimes involving magic and other manifestations of the uncanny. Now, as a wave of brutal and bizarre murders engulfs the city, Peter is plunged into a world where gods and goddesses mingle with mortals and a long-dead evil is making a comeback on a rising tide of magic."], "author": "Ben Aaronovitch", "num_pages": "392", "awards": ["British Book Award Nominee for New Writer of the Year (2011)", "CityRead London (2015)"], "places": ["London, England"], "character_names": ["Peter Grant"], "language": "English", "publish_date": "2011-01-10 00:00:00", "ISBN": "0575097566"},
{"url": "https://www.goodreads.com/book/show/18423.The_Left_Hand_of_Darkness", "num_ratings": "87,135", "num_reviews": "6,257", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Fantasy", "Classics"], "title": "The Left Hand of Darkness", "description": ["A groundbreaking work of science fiction, ", " tells the story of a lone human emissary to Winter, an alien world whose inhabitants can choose -and change - their gender. His goal is to facilitate Winter's inclusion in a growing intergalactic civilization. But to do so he must bridge the gulf between his own views and those of the completely dissimilar", "A groundbreaking work of science fiction, ", " tells the story of a lone human emissary to Winter, an alien world whose inhabitants can choose -and change - their gender. His goal is to facilitate Winter's inclusion in a growing intergalactic civilization. But to do so he must bridge the gulf between his own views and those of the completely dissimilar culture that he encounters. ", "Embracing the aspects of psychology, society, and human emotion on an alien world, ", " stands as a landmark achievement in the annals of intellectual science fiction."], "author": "Ursula K. Le Guin", "num_pages": "304", "awards": ["Hugo Award for Best Novel (1970)", "Nebula Award for Best Novel (1969)", "James Tiptree Jr. Award for Retrospective"], "places": [], "character_names": ["Genly Ai", "Therem Harth rem ir Estraven", "Argaven XV"], "language": "English", "publish_date": "2000-07-01 00:00:00", "ISBN": "0441007317"},
{"url": "https://www.goodreads.com/book/show/1588709.Here_Kitty_Kitty_", "num_ratings": "13,337", "num_reviews": "547", "avg_ratings": 4.25, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance", "Paranormal", "Shapeshifters"], "title": "Here Kitty, Kitty!", "description": ["What do you do when you’ve got a hillbilly tiger by the tail? Or maybe the question should be: what wouldn’t you do…", "Nikolai Vorislav likes his single life just as it is. Simple, relaxing and quiet. What he doesn’t need is some foul-mouthed Texan hellcat living in his house, eating his food, flirting with his idiot brothers and shooting holes in his home with his granddaddy", "What do you do when you’ve got a hillbilly tiger by the tail? Or maybe the question should be: what wouldn’t you do…", "Nikolai Vorislav likes his single life just as it is. Simple, relaxing and quiet. What he doesn’t need is some foul-mouthed Texan hellcat living in his house, eating his food, flirting with his idiot brothers and shooting holes in his home with his granddaddy’s gun. But those long legs, dark eyes and lethal tongue are making Nik insane and he fears he may be caught in the sexiest animal trap ever.", "Angelina Santiago doesn’t know how she got from Texas to North Carolina in a night or how she ended up in some hillbilly tiger’s house wearing only a sheet. What she does know is that she doesn’t like good ol’ boys with slow, sexy drawls who can’t seem to stop rubbing up against her. Yet in order to protect her friends, Angie has to stay with a cat who seems hellbent on finding all sorts of delicious ways to make her purr."], "author": "Shelly Laurenston", "num_pages": "308", "awards": [], "places": ["North Carolina"], "character_names": ["Sara Morrighan", "Nikolai Vorislav", "Angelina Santiago", "Miki Kendrick"], "language": null, "publish_date": "2007-07-03 00:00:00", "ISBN": "1933874538"},
{"url": "https://www.goodreads.com/book/show/7052533-stormwalker", "num_ratings": "6,105", "num_reviews": "423", "avg_ratings": 3.75, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Fantasy", "Romance", "Fantasy", "Magic", "Fantasy", "Dragons"], "title": "Stormwalker", "description": ["Book One of a the Stormwalker series. Allyson James also writes as NYT Bestselling author Jennifer Ashley", "Half-Navajo Janet Begay possesses extraordinary power which is tied to the storms that waft across the desert. The only person who can control her when she's caught in the storm's evocative power is Mick, a dark-haired, blue-eyed biker Janet can't seem to touch with her", "Book One of a the Stormwalker series. Allyson James also writes as NYT Bestselling author Jennifer Ashley", "Half-Navajo Janet Begay possesses extraordinary power which is tied to the storms that waft across the desert. The only person who can control her when she's caught in the storm's evocative power is Mick, a dark-haired, blue-eyed biker Janet can't seem to touch with her powers. He can wield fire and not get burned, and Janet's never sure where he goes when they're not together. ", "Together they investigate mysterious disappearances, which Janet fears are tied to her mother's people, the mythical gods from below the earth. They are helped along the way by Coyote and Crow, but these shapeshifting gods have their own agendas."], "author": "Allyson James", "num_pages": "330", "awards": ["RITA Award by Romance Writers of America Nominee for Novel with Strong Romantic Elements (2011)"], "places": ["Navajo Nation, Arizona", "Arizona"], "character_names": ["Janet Begay", "Coyote", "Nash Jones", "Mick \"Burns\"", "Maya Medina"], "language": "English", "publish_date": "2010-05-04 00:00:00", "ISBN": "042523469X"},
{"url": "https://www.goodreads.com/book/show/7095831-ship-breaker", "num_ratings": "36,379", "num_reviews": "4,266", "avg_ratings": 3.74, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fiction", "Adventure"], "title": "Ship Breaker", "description": ["In America's Gulf Coast region, where grounded oil tankers are being broken down for parts, Nailer, a teenage boy, works the light crew, scavenging for copper wiring just to make quota--and hopefully live to see another day. But when, by luck or chance, he discovers an exquisite clipper ship beached during a recent hurricane, Nailer faces the most important decision of his", "In America's Gulf Coast region, where grounded oil tankers are being broken down for parts, Nailer, a teenage boy, works the light crew, scavenging for copper wiring just to make quota--and hopefully live to see another day. But when, by luck or chance, he discovers an exquisite clipper ship beached during a recent hurricane, Nailer faces the most important decision of his life: Strip the ship for all it's worth or rescue its lone survivor, a beautiful and wealthy girl who could lead him to a better life..."], "author": "Paolo Bacigalupi", "num_pages": "326", "awards": ["Locus Award for Best Young Adult Book (2011)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Paranormal/Fantasy Novel (2010)", "Michael L. Printz Award (2011)", "Publishers Weekly's Best Children's Books of the Year for Fiction (2010)", "Lincoln Award Nominee (2013)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2010)", "Cybils Award Nominee for Young Adult Fantasy & Science Fiction (2010)", "National Book Award Finalist for Young People's Literature (2010)", "Missouri Gateway Readers Award Nominee (2013)"], "places": ["New Orleans, Louisiana"], "character_names": ["Nailer", "Pima", "Nita Chadhury", "Sadna", "Richard Lopez", "Tool", "Lucky Strike"], "language": "English", "publish_date": "2010-05-01 00:00:00", "ISBN": "0316056219"},
{"url": "https://www.goodreads.com/book/show/772888.Woman_on_the_Edge_of_Time", "num_ratings": "11,866", "num_reviews": "769", "avg_ratings": 3.95, "genres": ["Fiction", "Science Fiction", "Feminism", "Science Fiction", "Time Travel", "Science Fiction", "Dystopia"], "title": "Woman on the Edge of Time", "description": ["Connie Ramos, a woman in her mid-thirties, has been declared insane. But Connie is overwhelmingly sane, merely tuned to the future, and able to communicate with the year 2137. As her doctors persuade her to agree to an operation, Connie struggles to force herself to listen to the future and its lessons for today...."], "author": "Marge Piercy", "num_pages": "376", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "1985-11-12 00:00:00", "ISBN": "0449210820"},
{"url": "https://www.goodreads.com/book/show/6938271-hunting-season", "num_ratings": "4,386", "num_reviews": "291", "avg_ratings": 4.16, "genres": ["Romance", "Paranormal Romance", "Romance", "Fantasy", "Paranormal", "Shapeshifters", "Fantasy", "Urban Fantasy", "Adult Fiction", "Erotica"], "title": "Hunting Season", "description": [" ", "Neecy Lawrence, winged warrior for a Viking goddess and second-in-command of the fierce Crows, doesn’t know what to do with a nice guy. As it is, making up for a past she’d sooner forget leaves her barely polite most days. But Raven leader and loyal Odin warrior, Will Yager, isn’t just", " ", "Neecy Lawrence, winged warrior for a Viking goddess and second-in-command of the fierce Crows, doesn’t know what to do with a nice guy. As it is, making up for a past she’d sooner forget leaves her barely polite most days. But Raven leader and loyal Odin warrior, Will Yager, isn’t just ", ". He’s gorgeous, hot, and a distraction she simply can’t afford.", "Yager has wanted Neecy in his life—and in his bed—for a long time. Not just for a night, but forever. And, like any self-respecting Viking, he’ll stop at nothing to get what he wants. So what if she’s the most difficult, complex, never-gives-him-a-break woman he’s ever known? She’s more than worth the effort. In fact, she’s worth ", ".", "And if it turns out that twenty-four hours of non-stop, any-way-she-wants-it sex doesn’t work with Neecy? Then it looks like he’ll just have to get a little more creative…"], "author": "Shelly Laurenston", "num_pages": "267", "awards": [], "places": ["New Jersey"], "character_names": ["Neecy Lawrence", "Wilhelm Yager"], "language": "English", "publish_date": "2009-10-02 00:00:00", "ISBN": "1605046728"},
{"url": "https://www.goodreads.com/book/show/71409.Midnight_Robber", "num_ratings": "1,952", "num_reviews": "246", "avg_ratings": 3.9, "genres": ["Science Fiction", "Fantasy", "Fiction", "Speculative Fiction"], "title": "Midnight Robber", "description": ["It's Carnival time, and the Carribean-colonized planet of Toussaint is celebrating with music, dance and pageantry. Masked \"Midnight Robbers\" waylay revelers with brandished weapons and spellbinding words. But to young Tan-Tan, the Robber Queen is simply a favourite costume to wear at the festival--until her power-corrupted father commits an unforgivable crime. ", "Suddenly, b", "It's Carnival time, and the Carribean-colonized planet of Toussaint is celebrating with music, dance and pageantry. Masked \"Midnight Robbers\" waylay revelers with brandished weapons and spellbinding words. But to young Tan-Tan, the Robber Queen is simply a favourite costume to wear at the festival--until her power-corrupted father commits an unforgivable crime. ", "Suddenly, both father and daughter are thrust into the brutal world of New Half-Way Tree. Here monstrous creatures from folklore are real, and the humans are violent outcasts in the wilds. Here Tan-Tan must reach into the heart of myth--and become the Robber Queen herself. For only the Robber Queen's legendary powers can save her life...and set her free."], "author": "Nalo Hopkinson", "num_pages": "329", "awards": ["James Tiptree Jr. Award Honor List (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-03-01 00:00:00", "ISBN": "0446675601"},
{"url": "https://www.goodreads.com/book/show/118944.American_Born_Chinese", "num_ratings": "57,615", "num_reviews": "6,640", "avg_ratings": 3.88, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Fiction", "Fantasy"], "title": "American Born Chinese", "description": ["All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...", "Born to rule over all the monkeys in the world, the story of the Monkey K", "All Jin Wang wants is to fit in. When his family moves to a new neighborhood, he suddenly finds that he's the only Chinese American student at his school. Jocks and bullies pick on him constantly, and he has hardly any friends. Then, to make matters worse, he falls in love with an all-American girl...", "Born to rule over all the monkeys in the world, the story of the Monkey King is one of the oldest and greatest Chinese fables. Adored by his subjects, master of the arts of kung-fu, he is the most powerful monkey on earth. But the Monkey King doesn't want to be a monkey. He wants to be hailed as a god...", "Chin-Kee is the ultimate negative Chinese stereotype, and he's ruining his cousin Danny's life. Danny's a popular kid at school, but every year Chin-Kee comes to visit, and every year Danny has to transfer to a new school to escape the shame. This year, though, things quickly go from bad to worse...", "These three apparently unrelated tales come together with an unexpected twist, in a modern fable that is hilarious, poignant and action-packed. ", " is an amazing rise, all the way up to the astonishing climax--and confirms what a growing number of readers already know: Gene Yang is a major talent."], "author": "Gene Luen Yang", "num_pages": "240", "awards": ["Michael L. Printz Award (2007)", "James Cook Book Award Nominee (2007)", "Will Eisner Comic Industry Awards for Best Graphic Album - New (2007)", "National Book Award Finalist for Young People's Literature (2006)", "One Book One San Diego for Young Adult (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "1596431520"},
{"url": "https://www.goodreads.com/book/show/13272713-fire-baptized", "num_ratings": "957", "num_reviews": "237", "avg_ratings": 3.76, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Paranormal", "Shapeshifters", "Fantasy", "Magic", "Romance", "Paranormal Romance", "Fantasy"], "title": "Fire Baptized", "description": ["Since the 1970s humans have forced supernaturals to live in caged cities. Silver brands embedded in their foreheads identify them by species: a full moon for Vampires, a crescent moon for Shifters, a pair of wings for Fairies, and the list goes on, for each supernatural species has been tagged and categorized by humans. ", "Lanore Vesta is marked with a silver X, the brand of", "Since the 1970s humans have forced supernaturals to live in caged cities. Silver brands embedded in their foreheads identify them by species: a full moon for Vampires, a crescent moon for Shifters, a pair of wings for Fairies, and the list goes on, for each supernatural species has been tagged and categorized by humans. ", "Lanore Vesta is marked with a silver X, the brand of Mixbreeds, second-class citizens shunned by society. She stays to herself, revealing her ability to create fire only during emergencies. All she wants to do is graduate college and stop having to steal to survive. But when she stumbles upon a murder in progress, she catches the attention of a supernatural killer. Now all she wants is to stop finding dead bodies in her apartment. ", "Enlisting help from her Were-cheetah ex-boyfriend MeShack and a new mysterious friend named Zulu, she is steered through the habitat s raunchy nightlife. But their presence sometimes proves to be more burden than help, as they fight for her attention. ", "While the corpses pile up, and the scent of blood fills the air, Lanore is left wondering: will she find the psycho or die trying?"], "author": "Kenya Wright", "num_pages": "276", "awards": [], "places": [], "character_names": ["Lanore", "Meshack", "Zulu"], "language": "English", "publish_date": "2012-01-28 00:00:00", "ISBN": "0985023007"},
{"url": "https://www.goodreads.com/book/show/13737.The_Twelve_Kingdoms", "num_ratings": "2,411", "num_reviews": "168", "avg_ratings": 4.2, "genres": ["Fantasy", "Young Adult", "Sequential Art", "Manga", "Fiction", "Novels", "Light Novel"], "title": "The Twelve Kingdoms: Sea of Shadow", "description": ["For high-schooler Yoko Nakajima, life has been fairly ordinary--that is until Keiki, a young man with golden hair, tells Yoko they must return to their kingdom. Once confronted by this mysterious being and whisked away to an unearthly realm, Yoko is left with only a magical sword; a gem; and a million questions about her destiny, the world she's trapped in, and the world s", "For high-schooler Yoko Nakajima, life has been fairly ordinary--that is until Keiki, a young man with golden hair, tells Yoko they must return to their kingdom. Once confronted by this mysterious being and whisked away to an unearthly realm, Yoko is left with only a magical sword; a gem; and a million questions about her destiny, the world she's trapped in, and the world she desperately wants to return to."], "author": "Fuyumi Ono", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-13 00:00:00", "ISBN": "1598169467"},
{"url": "https://www.goodreads.com/book/show/7896345-the-gathering", "num_ratings": "53,652", "num_reviews": "3,282", "avg_ratings": 4.03, "genres": ["Young Adult", "Fantasy", "Paranormal", "Fantasy", "Fantasy", "Urban Fantasy", "Fantasy", "Supernatural"], "title": "The Gathering", "description": ["Sixteen-year-old Maya is just an ordinary teen in an ordinary town. Sure, she doesn't know much about her background - the only thing she really has to cling to is an odd paw-print birthmark on her hip - but she never really put much thought into who her parents were or how she ended up with her adopted parents in this tiny medical-research community on Vancouver Island.", "Sixteen-year-old Maya is just an ordinary teen in an ordinary town. Sure, she doesn't know much about her background - the only thing she really has to cling to is an odd paw-print birthmark on her hip - but she never really put much thought into who her parents were or how she ended up with her adopted parents in this tiny medical-research community on Vancouver Island.", ".", "Strange things have been happening in this claustrophobic town - from the mountain lions that have been approaching Maya to her best friend's hidden talent for \"feeling\" out people and situations, to the sexy new bad boy who makes Maya feel...", ". Combine that with a few unexplained deaths and a mystery involving Maya's biological parents and it's easy to suspect that this town might have more than its share of skeletons in its closet."], "author": "Kelley Armstrong", "num_pages": "359", "awards": ["Canadian Library Association Young Adult Book Award Nominee (2012)", "White Pine Award for Fiction (2012)"], "places": ["Vancouver Island, British Columbia"], "character_names": ["Maya Delaney", "Daniel Bianchi", "Serena", "Rafael \"Rafe\" Martinez", "Nicole Tillson", "Sam Russo", "Corey Carling", "Hayley Morris", "Annie Martinez"], "language": "English", "publish_date": "2011-04-12 00:00:00", "ISBN": "0061797022"},
{"url": "https://www.goodreads.com/book/show/5646082-moribito-ii", "num_ratings": "931", "num_reviews": "112", "avg_ratings": 4.22, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Asian Literature", "Japanese Literature"], "title": "Moribito II: Guardian of the Darkness", "description": ["Balsa returns to her native Kanbal to clear the name of Jiguro, her dear mentor, who saved her life when she was six years old. But what should be a visit of truth and reconciliation becomes a fight for her life when she learns that Jiguro had been a member of King Rogsam's personal bodyguard. After Jiguro fled Kanbal with her, Rogsam sent the other bodyguards after them o", "Balsa returns to her native Kanbal to clear the name of Jiguro, her dear mentor, who saved her life when she was six years old. But what should be a visit of truth and reconciliation becomes a fight for her life when she learns that Jiguro had been a member of King Rogsam's personal bodyguard. After Jiguro fled Kanbal with her, Rogsam sent the other bodyguards after them one by one--Jiguro's best friends, whom he had to kill to protect Balsa. Now, with the help of two Kanbalese children, Balsa must unwind the conspiracy surrounding Jiguro and the mystery of the Guardians of the Dark."], "author": "Nahoko Uehashi", "num_pages": "245", "awards": ["Batchelder Award Nominee (2010)"], "places": ["Kanbal"], "character_names": ["Balsa", "Jiguro", "Kaguro", "Yuguro", "Yuka", "Radalle", "Kassa"], "language": "English", "publish_date": "2009-05-01 00:00:00", "ISBN": "0545102952"},
{"url": "https://www.goodreads.com/book/show/25487847-chameleon", "num_ratings": "176", "num_reviews": "37", "avg_ratings": 4.18, "genres": ["Science Fiction", "Young Adult", "Fantasy", "Science Fiction", "Dystopia"], "title": "Chameleon", "description": ["After Sai's newly awoken psionic power accidentally destroys her apartment complex, she’s thrown into an intensive training program. The only grades are pass or die. ", "Surviving means proving her continued existence isn't a mistake--a task her new mentor, Bastian, takes personally. Her abilities place her in the GNW Enforcer division, which partners her with Domino 12, who i", "After Sai's newly awoken psionic power accidentally destroys her apartment complex, she’s thrown into an intensive training program. The only grades are pass or die. ", "Surviving means proving her continued existence isn't a mistake--a task her new mentor, Bastian, takes personally. Her abilities place her in the GNW Enforcer division, which partners her with Domino 12, who is eerily human for an alien-parasite and psionic hybrid. When her assassination duties are revealed, Sai understands the real reason for her training.", "On a mission to dispatch a dangerous Exiled scientist, she uncovers truths she never thought possible. Sai is unsure who to trust as her next mission might be her last, and a double agent seems to be manipulating both sides."], "author": "K.T. Hanna", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-04 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9520360-the-son-of-neptune", "num_ratings": "346,385", "num_reviews": "13,359", "avg_ratings": 4.44, "genres": ["Fantasy", "Young Adult", "Fantasy", "Mythology"], "title": "The Son of Neptune", "description": [" When he awoke from his long sleep, he didn't know much more than his name. His brain fuzz is lingering, even after the wolf Lupa told him he is a demigod and trained him to fight with the pen/sword in his pocket. Somehow Percy manages to make it to a camp for half-bloods, despite the fact that he has to keep killing monsters along the way. But the camp d", " When he awoke from his long sleep, he didn't know much more than his name. His brain fuzz is lingering, even after the wolf Lupa told him he is a demigod and trained him to fight with the pen/sword in his pocket. Somehow Percy manages to make it to a camp for half-bloods, despite the fact that he has to keep killing monsters along the way. But the camp doesn't ring any bells with him. The only thing he can recall from his past is another name: ", ". ", " When she lived before, she didn't do a very good job of it. Sure, she was an obedient daughter, even when her mother was possessed by greed. But that was the problem—when the Voice took over her mother and commanded Hazel to use her \"gift\" for an evil purpose, Hazel couldn't say no. Now because of her mistake, the future of the world is at risk. Hazel wishes she could ride away from it all on the stallion that appears in her dreams. ", " His grandmother says he is descended from heroes and can be anything he wants to be, but he doesn't see it. He doesn't even know who his father is. He keeps hoping Apollo will claim him, because the only thing he is good at is archery—although not good enough to win camp war games. His bulky physique makes him feel like an ox, especially in front of Hazel, his closest friend at camp. He trusts her completely—enough to share the secret he holds close to his heart. ", "Beginning at the \"other\" camp for half-bloods and extending as far as the land beyond the gods, this breathtaking second installment of the Heroes of Olympus series introduces new demigods, revives fearsome monsters, and features other remarkable creatures, all destined to play a part in the Prophesy of Seven."], "author": "Rick Riordan", "num_pages": "521", "awards": ["Buckeye Children's Book Award for 6-8 (2012)"], "places": ["Oakland, California", "Alaska", "Portland, Oregon", "Seattle, Washington", "Berkeley, California", "North Vancouver, British Columbia", "Anchorage, Alaska", "Seward, Alaska"], "character_names": ["Nico di Angelo", "Octavian", "Hera", "Reyna", "Juno", "Hazel Levesque", "Frank Zhang", "Ella the Harpy", "Percy Jackson"], "language": "English", "publish_date": "2011-10-04 00:00:00", "ISBN": "1423140591"},
{"url": "https://www.goodreads.com/book/show/1541884.Personal_Demon", "num_ratings": "18,919", "num_reviews": "641", "avg_ratings": 4.07, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Fantasy", "Romance", "Romance", "Paranormal Romance", "Fantasy", "Supernatural"], "title": "Personal Demon", "description": ["Tabloid reporter Hope Adams appears to live the life of an ordinary working girl. But in addition to possessing the beauty of a Bolly-wood princess, Hope has other unique traits. For she is a half demon- a human fathered by a demon. And she's inherited not only a gift for seeing the past but a hunter for chaos- along with a talent for finding it wherever she can. Naturally", "Tabloid reporter Hope Adams appears to live the life of an ordinary working girl. But in addition to possessing the beauty of a Bolly-wood princess, Hope has other unique traits. For she is a half demon- a human fathered by a demon. And she's inherited not only a gift for seeing the past but a hunter for chaos- along with a talent for finding it wherever she can. Naturally, when she's chosen by a very dangerous group for a very dangerous mission, she jumps at the chance...", "The head of the powerful Cortez Cabal- a family that makes the mob look like amateurs- has a little problem in Miami: a gang of wealthy, bored offspring of supernaturals is getting out of hand, and Hope is needed to infiltrated. As spells, astral projections, and pheromones soar across South Beach, Hope weaves her way through its elite hot spots, posing as upscale eye candy and reading the auras of the clientele- and potential marks."], "author": "Kelley Armstrong", "num_pages": "371", "awards": [], "places": ["Miami, Florida"], "character_names": ["Paige Winterbourne", "Lucas Cortez", "Hope Adams", "Benicio Cortez", "Karl Marsten", "Sean Nast"], "language": "English", "publish_date": "2008-03-25 00:00:00", "ISBN": "0553806610"},
{"url": "https://www.goodreads.com/book/show/116563.So_You_Want_to_Be_a_Wizard", "num_ratings": "23,818", "num_reviews": "1,044", "avg_ratings": 3.81, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Fantasy", "Urban Fantasy"], "title": "So You Want to Be a Wizard", "description": ["Nita Callahan is at the end of her rope because of the bullies who've been hounding her at school... until she discovers a mysterious library book that promises her the chance to become a wizard. But she has no idea of the difference that taking the Wizard's Oath is going to make in her life. Shortly, in company with fellow beginner-wizard Kit Rodriguez, Nita's catapulted", "Nita Callahan is at the end of her rope because of the bullies who've been hounding her at school... until she discovers a mysterious library book that promises her the chance to become a wizard. But she has no idea of the difference that taking the Wizard's Oath is going to make in her life. Shortly, in company with fellow beginner-wizard Kit Rodriguez, Nita's catapulted into what will be the adventure of a lifetime -- if she and Kit can both live through it. For every wizard's career starts with an Ordeal in which he or she must challenge the one power in the universe that hates wizardry more than anything else: the Lone Power that invented death and turned it loose in the worlds. Plunged into a dark and deadly alternate New York full of the Lone One's creatures, Kit and Nita must venture into the very heart of darkness to find the stolen, legendary Book of Night with Moon. Only with the dangerous power of the wizardly Book do they have a chance to save not just their own lives, but their world..."], "author": "Diane Duane", "num_pages": "323", "awards": [], "places": ["New York City, New York", "Hempstead, New York"], "character_names": ["Christopher \"Kit\" Rodriguez", "Juanita \"Nita\" Callahan", "Khairelikoblepharehglukumeilichephriedosd'enagouni \"Fred\""], "language": "English", "publish_date": "2003-07-01 00:00:00", "ISBN": "0152047387"},
{"url": "https://www.goodreads.com/book/show/43907.Daughter_of_the_Empire", "num_ratings": "28,409", "num_reviews": "652", "avg_ratings": 4.25, "genres": ["Fiction", "Fantasy", "Epic Fantasy", "Fantasy", "Fantasy", "High Fantasy", "Science Fiction Fantasy"], "title": "Daughter of the Empire", "description": ["Set in the mysterious world of Kelewan, an exotic empire encircled by murder and magic and where formal courts mask deadly intrigues, a valiant girl leads her followers through terror and peril - and discovers her own womanhood."], "author": "Raymond E. Feist", "num_pages": "528", "awards": [], "places": ["Kelewan"], "character_names": [], "language": "English", "publish_date": "2000-11-20 00:00:00", "ISBN": "0586074813"},
{"url": "https://www.goodreads.com/book/show/6380296-liar", "num_ratings": "8,211", "num_reviews": "1,603", "avg_ratings": 3.3, "genres": ["Young Adult", "Fantasy", "Fiction", "Mystery", "Fantasy", "Paranormal", "Young Adult", "Teen"], "title": "Liar", "author": "Justine Larbalestier", "num_pages": "376", "awards": ["Ditmar Award Nominee for Best Novel (2010)", "Western Australian Premier's Book Award for Young Adult (2009)", "Children's Book Council of Australia Award Nominee for Older Readers Book of the Year (2010)", "Queensland Premier's Literary Awards Nominee for Young Adult Book Award (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Davitt Award for Best Young Adult Novel (2010)", "The Inky Awards Shortlist for Gold Inky (2010)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "1599903059"},
{"url": "https://www.goodreads.com/book/show/15177.Bridge_of_Birds", "num_ratings": "8,769", "num_reviews": "942", "avg_ratings": 4.29, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Humor", "Historical"], "title": "Bridge of Birds", "description": ["When the children of his village were struck with a mysterious illness, Number Ten Ox sought a wiseman to save them. He found master Li Kao, a scholar with a slight flaw in his character. Together, they set out to find the Great Root of Power, the only possible cure.", "The quest led them to a host of truly memorable characters, multiple wonders, incredible adventures—and stra", "When the children of his village were struck with a mysterious illness, Number Ten Ox sought a wiseman to save them. He found master Li Kao, a scholar with a slight flaw in his character. Together, they set out to find the Great Root of Power, the only possible cure.", "The quest led them to a host of truly memorable characters, multiple wonders, incredible adventures—and strange coincidences, which were really not coincidences at all. And it involved them in an ancient crime that still perturbed the serenity of Heaven. Simply and charmingly told, this is a wry tale, a sly tale, and a story of wisdom delightfully askew. Once read, its marvels and beauty will not easily fade from the mind.", "The author claims that this is a novel of an ancient China that never was. But, oh…it should have been!"], "author": "Barry Hughart", "num_pages": "278", "awards": ["World Fantasy Award for Best Novel (1985)", "Mythopoeic Fantasy Award (1986)"], "places": [], "character_names": [], "language": "English", "publish_date": "1985-04-12 00:00:00", "ISBN": "0345321383"},
{"url": "https://www.goodreads.com/book/show/189022.The_Fox_Woman", "num_ratings": "1,502", "num_reviews": "167", "avg_ratings": 3.86, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Cultural", "Japan", "Romance", "Historical", "Historical Fiction", "Historical Fantasy"], "title": "The Fox Woman", "description": ["Yoshifuji is a man fascinated by foxes, a man discontented and troubled by the meaning of life. A misstep at court forces him to retire to his long-deserted country estate, to rethink his plans and contemplate the next move that might return him to favor and guarantee his family's prosperity.", "Yoshifuji is a man fascinated by foxes, a man discontented and troubled by the meaning of life. A misstep at court forces him to retire to his long-deserted country estate, to rethink his plans and contemplate the next move that might return him to favor and guarantee his family's prosperity."], "author": "Kij Johnson", "num_pages": "380", "awards": ["IAFA William L. Crawford Fantasy Award (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-03 00:00:00", "ISBN": "0312875592"},
{"url": "https://www.goodreads.com/book/show/1212627.The_Shadow_Speaker", "num_ratings": "971", "num_reviews": "163", "avg_ratings": 3.96, "genres": ["Fantasy", "Young Adult", "Fiction", "Science Fiction", "Cultural", "Africa"], "title": "The Shadow Speaker", "description": ["In West Africa in 2070, after fifteen-year-old \"shadow speaker\" Ejii witnesses her father's beheading, she embarks on a dangerous journey across the Sahara to find Jaa, her father's killer, and upon finding her, she also discovers a greater purpose to her life and to the mystical powers she possesses."], "author": "Nnedi Okorafor", "num_pages": "336", "awards": ["CBS Parallax Award", "Andre Norton Award Nominee (2007)", "James Tiptree Jr. Award Honor List (2007)"], "places": [], "character_names": ["Ejimafor Ugabe"], "language": "English", "publish_date": "2007-10-02 00:00:00", "ISBN": "1423100336"},
{"url": "https://www.goodreads.com/book/show/15819028-the-golem-and-the-jinni", "num_ratings": "80,023", "num_reviews": "10,956", "avg_ratings": 4.11, "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Historical", "Magical Realism"], "title": "The Golem and the Jinni", "description": ["In The Golem and the Jinni, a chance meeting between mythical beings takes readers on a dazzling journey through cultures in turn-of-the-century New York. ", "Chava is a golem, a creature made of clay, brought to life by a disgraced rabbi who dabbles in dark Kabbalistic magic and dies at sea on the voyage from Poland. Chava is unmoored and adrift as the ship arrives in New Yor", "In The Golem and the Jinni, a chance meeting between mythical beings takes readers on a dazzling journey through cultures in turn-of-the-century New York. ", "Chava is a golem, a creature made of clay, brought to life by a disgraced rabbi who dabbles in dark Kabbalistic magic and dies at sea on the voyage from Poland. Chava is unmoored and adrift as the ship arrives in New York harbor in 1899. ", "Ahmad is a jinni, a being of fire born in the ancient Syrian desert, trapped in an old copper flask, and released in New York City, though still not entirely free. ", "Ahmad and Chava become unlikely friends and soul mates with a mystical connection. Marvelous and compulsively readable, Helene Wecker's debut novel The Golem and the Jinni weaves strands of Yiddish and Middle Eastern literature, historical fiction and magical fable, into a wondrously inventive and unforgettable tale."], "author": "Helene Wecker", "num_pages": "486", "awards": ["Nebula Award Nominee for Best Novel (2013)", "World Fantasy Award Nominee for Best Novel (2014)", "Mythopoeic Fantasy Award for Adult Literature (2014)", "Cabell First Novelist Award (2014)", "Harold U. Ribalow Prize for Jewish fiction (2014)", "Goodreads Choice Award Nominee for Debut Author, Best Fantasy (2013)", "James Tiptree Jr. Award Honor List (2013)"], "places": ["New York City, New York", "The Syrian Desert"], "character_names": ["Ahmad Al-Hadid", "Chava", "Yehudah Schaalman", "Rabbi Avram Meyer", "Boutros Arbeely", "Maryam Faddoul", "Michael Levy", "Mahmoud Saleh", "Sayeed Faddoul", "Moe Radzin", "Thea Radzin", "Anna Blumberg", "Sophia Winston", "Fadwa al-Hadid"], "language": "English", "publish_date": "2013-04-23 00:00:00", "ISBN": "0062110837"},
{"url": "https://www.goodreads.com/book/show/40445.Altered_Carbon", "num_ratings": "63,533", "num_reviews": "4,290", "avg_ratings": 4.07, "genres": ["Science Fiction", "Science Fiction", "Cyberpunk", "Fiction", "Mystery"], "title": "Altered Carbon", "description": ["It's the twenty-fifth century, and advances in technology have redefined life itself. A person's consciousness can now be stored in the brain and downloaded into a new body (or \"sleeve\"), making death nothing more than a minor blip on a screen. Onetime U.N. Envoy Takeshi Kovacs has been killed before, but his last death was particularly painful. Resleeved into a body in Ba", "It's the twenty-fifth century, and advances in technology have redefined life itself. A person's consciousness can now be stored in the brain and downloaded into a new body (or \"sleeve\"), making death nothing more than a minor blip on a screen. Onetime U.N. Envoy Takeshi Kovacs has been killed before, but his last death was particularly painful. Resleeved into a body in Bay City (formerly San Francisco), Kovacs is thrown into the dark heart of a shady, far-reaching conspiracy that is vicious even by the standards of a society that treats existence as something that can be bought and sold. For Kovacs, the shell that blew a hole in his chest was only the beginning."], "author": "Richard K. Morgan", "num_pages": "526", "awards": ["Philip K. Dick Award (2003)"], "places": ["San Francisco, California"], "character_names": ["Takeshi Kovacs", "Laurens Bancroft", "Miriam Bancroft", "Oumou Prescott", "Lt. Kristen Ortega", "Reileen Kawahara", "Trepp", "Curtis", "Elias Ryker", "Bautista", "Irene Elliot"], "language": "English", "publish_date": "2006-02-28 00:00:00", "ISBN": "0345457692"},
{"url": "https://www.goodreads.com/book/show/836964.China_Mountain_Zhang", "num_ratings": "3,176", "num_reviews": "338", "avg_ratings": 3.93, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Lgbt"], "title": "China Mountain Zhang", "description": ["With this groundbreaking novel, Maureen F. McHugh established herself as one of the decade's best science fiction writers. In its pages, we enter a post-revolution America, moving from the hyper-urbanized eastern seaboard to the Arctic bleakness of Baffin Island; from the new Imperial City to an agricultural commune on Mars. The overlapping lives of cyber-kite fliers, lone", "With this groundbreaking novel, Maureen F. McHugh established herself as one of the decade's best science fiction writers. In its pages, we enter a post-revolution America, moving from the hyper-urbanized eastern seaboard to the Arctic bleakness of Baffin Island; from the new Imperial City to an agricultural commune on Mars. The overlapping lives of cyber-kite fliers, lonely colonists, illicit neural-pressball players, and organic engineers blend into a powerful, taut story of a young man's journey of discovery. This is a macroscopic world of microscopic intensity, one of the most brilliant visions of modern SF."], "author": "Maureen F. McHugh", "num_pages": "313", "awards": ["Nebula Award Nominee for Best Novel (1993)", "Locus Award for Best First Novel (1993)", "James Tiptree Jr. Award (1992)", "Lambda Literary Award for Gay Men's Science Fiction/Fantasy (1993)"], "places": [], "character_names": ["Rafael Zhang"], "language": "English", "publish_date": "1997-04-15 00:00:00", "ISBN": "0312860986"},
{"url": "https://www.goodreads.com/book/show/41536.My_Soul_to_Keep", "num_ratings": "3,643", "num_reviews": "342", "avg_ratings": 4.2, "genres": ["Horror", "Fantasy", "Fiction", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Science Fiction", "Fantasy", "Urban Fantasy"], "title": "My Soul to Keep", "description": ["When Jessica marries David, he is everything she wants in a family man: brilliant, attentive, ever youthful. Yet she still feels something about him is just out of reach. Soon, as people close to Jessica begin to meet violent, mysterious deaths, David makes an unimaginable confession: More than 400 years ago, he and other members of an Ethiopian sect traded their humanity", "When Jessica marries David, he is everything she wants in a family man: brilliant, attentive, ever youthful. Yet she still feels something about him is just out of reach. Soon, as people close to Jessica begin to meet violent, mysterious deaths, David makes an unimaginable confession: More than 400 years ago, he and other members of an Ethiopian sect traded their humanity so they would never die, a secret he must protect at any cost. Now, his immortal brethren have decided David must return and leave his family in Miami. Instead, David vows to invoke a forbidden ritual to keep Jessica and his daughter with him forever. Harrowing, engrossing and skillfully rendered, ", " traps Jessica between the desperation of immortals who want to rob her of her life and a husband who wants to rob her of her soul. With deft plotting and an unforgettable climax, this tour de force reminiscent of early Anne Rice will win Due a new legion of fans."], "author": "Tananarive Due", "num_pages": "346", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-04-08 00:00:00", "ISBN": "006105366X"},
{"url": "https://www.goodreads.com/book/show/70582.War_for_the_Oaks", "num_ratings": "9,038", "num_reviews": "751", "avg_ratings": 4.02, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Fiction", "Young Adult", "Romance", "Fairies", "Fae"], "title": "War for the Oaks", "description": ["Acclaimed by critics and readers on its first publication in 1987, winner of the Locus Award for Best First Novel, Emma Bull's ", " is one of the novels that has defined modern urban fantasy.", "Eddi McCandry sings rock and roll. But she's breaking up with her boyfriend, her band just broke up, and life could hardly be worse. Then, walking home through downtown Min", "Acclaimed by critics and readers on its first publication in 1987, winner of the Locus Award for Best First Novel, Emma Bull's ", " is one of the novels that has defined modern urban fantasy.", "Eddi McCandry sings rock and roll. But she's breaking up with her boyfriend, her band just broke up, and life could hardly be worse. Then, walking home through downtown Minneapolis on a dark night, she finds herself drafted into an invisible war between the faerie folk. Now, more than her own survival is at risk—and her own preferences, musical and personal, are very much beside the point.", "By turns tough and lyrical, fabulous and down-to-earth, ", " is a fantasy novel that's as much about this world as about the other one. It's about real love and loyalty, about real music and musicians, about false glamour and true art. It will change the way you hear and see your own daily life."], "author": "Emma Bull", "num_pages": "336", "awards": ["Locus Award for Best First Novel (1988)", "Mythopoeic Fantasy Award Nominee (1988)"], "places": ["Minneapolis, Minnesota", "Minnesota"], "character_names": ["Eddi McCandry", "The Phouka", "Carla DiAmato", "Willy Silver", "Hedge", "Dan Rochelle"], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "0765349159"},
{"url": "https://www.goodreads.com/book/show/153783.The_Will_of_the_Empress", "num_ratings": "18,646", "num_reviews": "493", "avg_ratings": 4.16, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "The Will of the Empress", "description": ["Sandry, Daja, Briar, and Tris, are older now and back together again, in an exciting and much-awaited, stand-alone novel by everyone's favorite mage, Tamora Pierce.", "For years the Empress of Namorn has pressed her young cousin, Lady Sandrilene fa Toren, to visit her vast lands within the Empire's borders. Sandry has avoided the invitation for as long as it was possible. Now", "Sandry, Daja, Briar, and Tris, are older now and back together again, in an exciting and much-awaited, stand-alone novel by everyone's favorite mage, Tamora Pierce.", "For years the Empress of Namorn has pressed her young cousin, Lady Sandrilene fa Toren, to visit her vast lands within the Empire's borders. Sandry has avoided the invitation for as long as it was possible. Now Sandry has agreed to pay that overdue visit. Sandry's uncle promises guards to accompany her. But they're hardly a group of warriors! They're her old friends from Winding Circle: Daja, Tris, and Briar. Sandry hardly knows them now. They've grown up and grown apart. Sandry isn't sure they'll ever find their old connection again - or if she even wants them to. When they arrive at the pala"], "author": "Tamora Pierce", "num_pages": "550", "awards": [], "places": ["Namorn"], "character_names": ["Sandrilene fa Toren", "Trisana Chandler", "Briar Moss", "Daja Kisubo"], "language": "English", "publish_date": "2006-10-01 00:00:00", "ISBN": "0439441722"},
{"url": "https://www.goodreads.com/book/show/1830755.Mine_to_Possess", "num_ratings": "22,790", "num_reviews": "1,178", "avg_ratings": 4.12, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Fantasy", "Paranormal", "Shapeshifters", "Fantasy", "Urban Fantasy"], "title": "Mine to Possess", "description": ["Clay Bennett is a powerful DarkRiver sentinel, but he grew up in the slums with his human mother, never knowing his changeling father. As a young boy without the bonds of Pack, he tried to stifle his animal nature. He failed...and committed the most extreme act of violence, killing a man and losing his best friend, Talin, in the bloody aftermath. Everything good in him die", "Clay Bennett is a powerful DarkRiver sentinel, but he grew up in the slums with his human mother, never knowing his changeling father. As a young boy without the bonds of Pack, he tried to stifle his animal nature. He failed...and committed the most extreme act of violence, killing a man and losing his best friend, Talin, in the bloody aftermath. Everything good in him died the day he was told that she, too, was dead.", "Talin McKade barely survived a childhood drenched in bloodshed and terror. Now a new nightmare is stalking her life--the street children she works to protect are disappearing and turning up dead. Determined to keep them safe, she unlocks the darkest secret in her heart and returns to ask the help of the strongest man she knows...", "Clay lost Talin once. He will not let her go again, his hunger to possess her, a clawing need born of the leopard within. As they race to save the innocent, Clay and Talin must face the violent truths of their past...or lose everything that ever mattered."], "author": "Nalini Singh", "num_pages": "328", "awards": ["RITA Award by Romance Writers of America Nominee for Paranormal Romance (2009)"], "places": ["United States of America", "California"], "character_names": ["Sascha Duncan", "Lucas Hunter", "Faith Nightstar", "Judd Lauren", "Clay Bennett", "Talin McKade", "Ashaya Aleine", "Devraj Santos", "Katya Haas", "Nate Ryder", "Tamsyn Mahaire", "Dorian Christensen", "Noor Hassan", "Jonquil Duchslaya", "Max Shannon", "Vaughn D'Angelo"], "language": "English", "publish_date": "2008-02-05 00:00:00", "ISBN": "0425220168"},
{"url": "https://www.goodreads.com/book/show/6972157-beast-behaving-badly", "num_ratings": "12,759", "num_reviews": "660", "avg_ratings": 4.4, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance", "Paranormal", "Shapeshifters"], "title": "Beast Behaving Badly", "description": ["Ten years after Blayne Thorpe first encountered Bo Novikov, she still can't get the smooth-talking shifter out of her head. Now he's shadowing her in New York-all seven-plus feet of him-determined to protect her from stalkers who want to use her in shifter dogfights. Even if he has to drag her off to an isolated Maine town where the only neighbors are other bears almost as", "Ten years after Blayne Thorpe first encountered Bo Novikov, she still can't get the smooth-talking shifter out of her head. Now he's shadowing her in New York-all seven-plus feet of him-determined to protect her from stalkers who want to use her in shifter dogfights. Even if he has to drag her off to an isolated Maine town where the only neighbors are other bears almost as crazy as he is...", "Let sleeping dogs lie. Bo knows it's good advice, but he can't leave Blayne be. Blame it on her sweet sexiness -- or his hunch that there's more to this little wolfdog than meets the eye. Blayne has depths he hasn't yet begun to fathom -- much as he'd like to. She may insist Bo's nothing but a pain in her delectable behind, but polar bears have patience in spades. Soon she'll realize how good they can be together. And when she does, animal instinct tells him it'll be worth the wait..."], "author": "Shelly Laurenston", "num_pages": "379", "awards": [], "places": ["New York City, New York", "Ursus County, Maine"], "character_names": ["Blayne Thorpe", "Bold “Bo” Novikov"], "language": "English", "publish_date": "2010-05-25 00:00:00", "ISBN": "0758231687"},
{"url": "https://www.goodreads.com/book/show/13539191-three-parts-dead", "num_ratings": "9,710", "num_reviews": "1,441", "avg_ratings": 3.98, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Fiction", "Science Fiction", "Science Fiction Fantasy"], "title": "Three Parts Dead", "description": ["A god has died, and it’s up to Tara, first-year associate in the international necromantic firm of Kelethres, Albrecht, and Ao, to bring Him back to life before His city falls apart.", "Her client is Kos, recently deceased fire god of the city of Alt Coulumb. Without Him, the metropolis’s steam generators will shut down, its trains will cease running, and its four million citi", "A god has died, and it’s up to Tara, first-year associate in the international necromantic firm of Kelethres, Albrecht, and Ao, to bring Him back to life before His city falls apart.", "Her client is Kos, recently deceased fire god of the city of Alt Coulumb. Without Him, the metropolis’s steam generators will shut down, its trains will cease running, and its four million citizens will riot.", "Tara’s job: resurrect Kos before chaos sets in. Her only help: Abelard, a chain-smoking priest of the dead god, who’s having an understandable crisis of faith.", "When Tara and Abelard discover that Kos was murdered, they have to make a case in Alt Coulumb’s courts—and their quest for the truth endangers their partnership, their lives, and Alt Coulumb’s slim hope of survival.", "Set in a phenomenally built world in which justice is a collective force bestowed on a few, craftsmen fly on lightning bolts, and gargoyles can rule cities, ", " introduces readers to an ethical landscape in which the line between right and wrong blurs."], "author": "Max Gladstone", "num_pages": "336", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-02 00:00:00", "ISBN": "0765333104"},
{"url": "https://www.goodreads.com/book/show/39303.The_Bitten", "num_ratings": "2,586", "num_reviews": "66", "avg_ratings": 4.24, "genres": ["Paranormal", "Vampires", "Fantasy", "Paranormal", "Fantasy", "Urban Fantasy", "Romance", "Paranormal Romance", "Fantasy"], "title": "The Bitten", "description": ["The vampire civil war has been averted, deadly were-demons have been beaten back and now it Damali Richards and Carlos Rivera (now a Council level vampire) will finally have the chance to settle in and explore their deeper, sexier love. But Carlos and Damali should know by now that there is no rest for the saviors of the known world. One of the four topside Master vampires", "The vampire civil war has been averted, deadly were-demons have been beaten back and now it Damali Richards and Carlos Rivera (now a Council level vampire) will finally have the chance to settle in and explore their deeper, sexier love. But Carlos and Damali should know by now that there is no rest for the saviors of the known world. One of the four topside Master vampires has stolen one of the Keys-the living blood of Christ---that opens the sixth seal as foretold in Revelations. He who possesses the Key and the Seal can decide to the outcome of the Final War, a.k.a. Armageddon. With a vampire in possession of the Key, the balance between the Light and the Dark have been thrown off and even Damali is deeply effected. She is now sporting a pair of fangs. In order to retrieve the Key, Carlos and Damali are quickly thrust into a web of vampire politics and intrigue. And when Carlos's secret drug, Oblivion, finds its way into the hands of the enemies, even the seventh level of Hell comes calling."], "author": "L.A. Banks", "num_pages": "435", "awards": [], "places": [], "character_names": ["Damali Richards"], "language": "English", "publish_date": "2005-06-13 00:00:00", "ISBN": "0312324081"},
{"url": "https://www.goodreads.com/book/show/35851712-impermanence", "num_ratings": "47", "num_reviews": "28", "avg_ratings": 4.23, "genres": ["Science Fiction", "Fiction", "Romance", "Christian Romance"], "title": "Impermanence", "description": ["Humanity has discovered the formula for immortality: regular maintenance and replacement of organs, and daily electronic backup of complete brain data. In an infinitely remote future, inhabited solely by women, life flows eternal and serene, seemingly invulnerable to any possible threat. At least until..."], "author": "Daniel Frisano", "awards": [], "places": [], "character_names": [], "language": "English"},
{"url": "https://www.goodreads.com/book/show/6659254-blood-cross", "num_ratings": "19,818", "num_reviews": "705", "avg_ratings": 4.14, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Fantasy", "Magic", "Paranormal", "Shapeshifters"], "title": "Blood Cross", "description": ["The vampire council has hired skinwalker Jane Yellowrock to hunt and kill one of their own who has broken sacred ancient rules — but Jane quickly realizes that in a community that is thousands of years old, loyalties run deep...", "With the help of her witch best friend and local vigilantes, Jane finds", "The vampire council has hired skinwalker Jane Yellowrock to hunt and kill one of their own who has broken sacred ancient rules — but Jane quickly realizes that in a community that is thousands of years old, loyalties run deep...", "With the help of her witch best friend and local vigilantes, Jane finds herself caught between bitter rivalries — and closer than ever to the secret origin of the entire vampire race. But in a city of old grudges and dark magic, Jane will have to fight to protect both sides, even if no one will protect her."], "author": "Faith Hunter", "num_pages": "321", "awards": [], "places": ["New Orleans, Louisiana"], "character_names": ["Molly Trueblood", "Brian Robere", "Brandon Robere", "Jane Yellowrock", "Leo Pellissier", "George \"Bruiser\" Dumas", "Rick (Ricky Bo) LeFleur", "Beast", "Tom (Troll)", "Jodi Richoux", "Aggie One Feather", "Sabina Delgado y Aguilera", "Bettina Rousseau", "Angelina Trueblood", "Evan Trueblood", "Derek Lee", "Evangeline Everhart"], "language": "English", "publish_date": "2010-01-05 00:00:00", "ISBN": "0451463072"},
{"url": "https://www.goodreads.com/book/show/7005878-redemption-in-indigo", "num_ratings": "1,804", "num_reviews": "360", "avg_ratings": 3.85, "genres": ["Fantasy", "Fiction", "Magical Realism", "Fantasy", "Fairy Tales", "Cultural", "Africa", "Speculative Fiction"], "title": "Redemption in Indigo", "description": ["A tale of adventure, magic, and the power of the human spirit. Paama’s husband is a fool and a glutton. Bad enough that he followed her to her parents’ home in the village of Makendha—now he’s disgraced himself by murdering livestock and stealing corn. When Paama leaves him for good, she attracts the attention of the undying ones—the djombi— who present her with a gift: th", "A tale of adventure, magic, and the power of the human spirit. Paama’s husband is a fool and a glutton. Bad enough that he followed her to her parents’ home in the village of Makendha—now he’s disgraced himself by murdering livestock and stealing corn. When Paama leaves him for good, she attracts the attention of the undying ones—the djombi— who present her with a gift: the Chaos Stick, which allows her to manipulate the subtle forces of the world. Unfortunately, a wrathful djombi with indigo skin believes this power should be his and his alone.", "A contemporary fairy tale that is inspired in part by a Senegalese folk tale."], "author": "Karen Lord", "num_pages": "188", "awards": ["World Fantasy Award Nominee for Best Novel (2011)", "Mythopoeic Fantasy Award for Adult Literature (2011)", "IAFA William L. Crawford Fantasy Award (2011)", "Frank Collymore Award (2008)", "OCM Bocas Prize Nominee for Caribbean Literature (2011)", "Carl Brandon Parallax Award (2010)", "The Kitschies for Golden Tentacle (Debut) (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-01 00:00:00", "ISBN": "1931520666"},
{"url": "https://www.goodreads.com/book/show/10429092-the-girl-of-fire-and-thorns", "num_ratings": "67,818", "num_reviews": "6,578", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Did Not Finish"], "title": "The Girl of Fire and Thorns", "description": ["Elisa is the chosen one. ", "But she is also the younger of two princesses, the one who has never done anything remarkable. She can't see how she ever will. ", "Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs the chosen one, not a fa", "Elisa is the chosen one. ", "But she is also the younger of two princesses, the one who has never done anything remarkable. She can't see how she ever will. ", "Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs the chosen one, not a failure of a princess.", "And he's not the only one who seeks her. Savage enemies seething with dark magic are hunting her. A daring, determined revolutionary thinks she could be his people's savior. And he looks at her in a way that no man has ever looked at her before. Soon it is not just her life, but her very heart that is at stake.", "Elisa could be everything to those who need her most. If the prophecy is fulfilled. If she finds the power deep within herself. If she doesn’t die young.", "Most of the chosen do."], "author": "Rae Carson", "num_pages": "423", "awards": ["William C. Morris YA Debut Award Nominee (2012)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)", "Ohioana Book Award for Young Adult (2012)", "Cybils Award Nominee for Fantasy & Science Fiction (Young Adult) (2011)"], "places": [], "character_names": ["Alejandro de Vega", "Lucero-Elisa de Riqueza", "Humberto", "Ximena", "Cosme", "Hector of Ventierra"], "language": "English", "publish_date": "2011-09-20 00:00:00", "ISBN": "0062026488"},
{"url": "https://www.goodreads.com/book/show/5577995-silver-phoenix", "num_ratings": "3,256", "num_reviews": "524", "avg_ratings": 3.57, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Romance"], "title": "Silver Phoenix", "description": ["No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that", "No one wanted Ai Ling. And deep down she is relieved—despite the dishonor she has brought upon her family—to be unbetrothed and free, not some stranger's subservient bride banished to the inner quarters. ", " But now, something is after her. Something terrifying—a force she cannot comprehend. And as pieces of the puzzle start to fit together, Ai Ling begins to understand that her journey to the Palace of Fragrant Dreams isn't only a quest to find her beloved father but a venture with stakes larger than she could have imagined. ", " Bravery, intelligence, the will to fight and fight hard . . . she will need all of these things. Just as she will need the new and mysterious power growing within her. She will also need help. ", " It is Chen Yong who finds her partly submerged and barely breathing at the edge of a deep lake. There is something of unspeakable evil trying to drag her under. On a quest of his own, Chen Yong offers that help . . . and perhaps more."], "author": "Cindy Pon", "num_pages": "340", "awards": [], "places": [], "character_names": ["Ai Ling"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0061730211"},
{"url": "https://www.goodreads.com/book/show/2754510-storm-born", "num_ratings": "27,818", "num_reviews": "1,478", "avg_ratings": 3.9, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Romance", "Romance", "Paranormal Romance", "Fairies", "Fae"], "title": "Storm Born", "description": ["Just typical. No love life to speak of for months, then all at once, every horny creature in the Otherworld wants to get in your pants...", "Eugenie Markham is a powerful shaman who does a brisk trade banishing spirits and fey who cross into the mortal world. Mercenary, yes, but a girl's got to eat. Her most recent case, however, is enough to ruin her appetite. Hired to find a", "Just typical. No love life to speak of for months, then all at once, every horny creature in the Otherworld wants to get in your pants...", "Eugenie Markham is a powerful shaman who does a brisk trade banishing spirits and fey who cross into the mortal world. Mercenary, yes, but a girl's got to eat. Her most recent case, however, is enough to ruin her appetite. Hired to find a teenager who has been taken to the Otherworld, Eugenie comes face to face with a startling prophecy—one that uncovers dark secrets about her past and claims that Eugenie's first-born will threaten the future of the world as she knows it.", "Now Eugenie is a hot target for every ambitious demon and Otherworldy ne'er-do-well, and the ones who don't want to knock her up want her dead. Eugenie handles a Glock as smoothly as she wields a wand, but she needs some formidable allies for a job like this. She finds them in Dorian, a seductive fairy king with a taste for bondage, and Kiyo, a gorgeous shape-shifter who redefines animal attraction. But with enemies growing bolder and time running out, Eugenie realizes that the greatest danger is yet to come, and it lies in the dark powers that are stirring to life within her..."], "author": "Richelle Mead", "num_pages": "361", "awards": [], "places": ["Tucson, Arizona", "Otherworld"], "character_names": ["Eugenie Markham", "Dorian", "Kiyo Marquez", "Volusian", "Jasmine Delaney", "Maiwenn"], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "1420100963"},
{"url": "https://www.goodreads.com/book/show/5931169-santa-olivia", "num_ratings": "7,738", "num_reviews": "798", "avg_ratings": 3.83, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Lgbt", "Science Fiction", "Fiction", "Science Fiction", "Dystopia"], "title": "Santa Olivia", "description": ["Lushly written with rich and vivid characters, SANTA OLIVIA is Jacqueline Carey's take on comic book superheroes and the classic werewolf myth.", " Loup Garron was born and raised in Santa Olivia, an isolated, disenfranchised town next to a US military base inside a DMZ buffer zone between Texas and Mexico. A fugitive \"Wolf-Man\" who had a love affair with a local woman, Loup's", "Lushly written with rich and vivid characters, SANTA OLIVIA is Jacqueline Carey's take on comic book superheroes and the classic werewolf myth.", " Loup Garron was born and raised in Santa Olivia, an isolated, disenfranchised town next to a US military base inside a DMZ buffer zone between Texas and Mexico. A fugitive \"Wolf-Man\" who had a love affair with a local woman, Loup's father was one of a group of men genetically-manipulated and used by the US government as a weapon. The \"Wolf-Men\" were engineered to have superhuman strength, speed, sensory capability, stamina, and a total lack of fear, and Loup, named for and sharing her father's wolf-like qualities, is marked as an outsider.", " After her mother dies, Loup goes to live among the misfit orphans at the parish church, where they seethe from the injustices visited upon the locals by the soldiers. Eventually, the orphans find an outlet for their frustrations: They form a vigilante group to support Loup Garron who, costumed as their patron saint, Santa Olivia, uses her special abilities to avenge the town.", " Aware that she could lose her freedom, and possibly her life, Loup is determined to fight to redress the wrongs her community has suffered. And like the reincarnation of their patron saint, she will bring hope to all of Santa Olivia."], "author": "Jacqueline Carey", "num_pages": "341", "awards": [], "places": [], "character_names": ["Loup Garron"], "language": "English", "publish_date": "2009-05-29 00:00:00", "ISBN": "044619817X"},
{"url": "https://www.goodreads.com/book/show/10215349-the-immortal-rules", "num_ratings": "59,715", "num_reviews": "5,903", "avg_ratings": 4.1, "genres": ["Paranormal", "Vampires", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Science Fiction", "Dystopia"], "title": "The Immortal Rules", "description": ["Allison Sekemoto survives in the Fringe, the outermost circle of a walled-in city. By day, she and her crew scavenge for food. By night, any one of them could be eaten. Some days, all that drives Allie is her hatred of", "—the vampires who keep humans as blood cattle. Until the night Allie herself dies and becomes", "Allison Sekemoto survives in the Fringe, the outermost circle of a walled-in city. By day, she and her crew scavenge for food. By night, any one of them could be eaten. Some days, all that drives Allie is her hatred of", "—the vampires who keep humans as blood cattle. Until the night Allie herself dies and becomes one of the monsters.", "Forced to flee her city, Allie must pass for human as she joins a ragged group of pilgrims seeking a legend—a place that might have a cure for the disease that killed off most of civilization and created the rabids, the bloodthirsty creatures who threaten human and vampire alike. And soon Allie will have to decide what and who is worth dying for\u0085 again.", "Enter Julie Kagawa's dark and twisted world as an unforgettable journey begins."], "author": "Julie Kagawa", "num_pages": "485", "awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)"], "places": [], "character_names": ["Allison Sekemoto", "Stick", "Kanin", "Jackal", "Zeke Crosse"], "language": "English", "publish_date": "2012-04-24 00:00:00", "ISBN": "0373210515"},
{"url": "https://www.goodreads.com/book/show/13376.The_House_of_the_Scorpion", "num_ratings": "69,395", "num_reviews": "5,808", "avg_ratings": 4.1, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fiction"], "title": "The House of the Scorpion", "description": ["With undertones of vampires, Frankenstein, dragons' hoards, and killing fields, Matt's story turns out to be an inspiring tale of friendship, survival, hope, and transcendence. A must-read for teenage fantasy fans.", "At his coming-of-age party, Matteo Alacrán asks El Patrón's bodyguard, \"How old am I?...I know I don't have a birthday like humans, but I was born.\" ", "\"You were ha", "With undertones of vampires, Frankenstein, dragons' hoards, and killing fields, Matt's story turns out to be an inspiring tale of friendship, survival, hope, and transcendence. A must-read for teenage fantasy fans.", "At his coming-of-age party, Matteo Alacrán asks El Patrón's bodyguard, \"How old am I?...I know I don't have a birthday like humans, but I was born.\" ", "\"You were harvested,\" Tam Lin reminds him. \"You were grown in that poor cow for nine months and then you were cut out of her.\" ", "To most people around him, Matt is not a boy, but a beast. A room full of chicken litter with roaches for friends and old chicken bones for toys is considered good enough for him. But for El Patrón, lord of a country called Opium—a strip of poppy fields lying between the U.S. and what was once called Mexico—Matt is a guarantee of eternal life. El Patrón loves Matt as he loves himself for Matt is himself. They share identical DNA."], "author": "Nancy Farmer", "num_pages": "380", "awards": ["Newbery Medal Nominee (2003)", "National Book Award for Young People's Literature (2002)", "Mythopoeic Fantasy Award Nominee for Children's Literature (2003)", "Buxtehuder Bulle (2003)", "Michael L. Printz Award Nominee (2003)", "South Carolina Book Award for Junior Book Award (2006)", "Grand Canyon Reader Award for Teen Book (2005)", "Dorothy Canfield Fisher Children's Book Award Nominee (2004)", "Pacific Northwest Library Association Young Reader's Choice Award for Senior (2005)", "Michigan Library Association Thumbs Up! Award Nominee (2003)", "Lincoln Award Nominee (2008)", "Missouri Gateway Readers Award Nominee (2005)", "Oklahoma Sequoyah Award for YA (2005)"], "places": [], "character_names": ["El Patron", "Tam Lin", "Maria Mendoza", "Chacho", "Fidelito", "Ton-Ton"], "language": "English", "publish_date": "2004-05-16 00:00:00", "ISBN": "0689852231"},
{"url": "https://www.goodreads.com/book/show/3645169-go-fetch", "num_ratings": "14,210", "num_reviews": "640", "avg_ratings": 4.21, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance", "Paranormal", "Shapeshifters"], "title": "Go Fetch!", "description": ["Conall Víga-Feilan, direct descendent of Viking shifters, never thought he’d meet a female strong enough to be his mate. He especially didn’t think a short, viper-tongued human would ever fit the bill. But Miki Kendrick isn’t some average human. With an I", "Conall Víga-Feilan, direct descendent of Viking shifters, never thought he’d meet a female strong enough to be his mate. He especially didn’t think a short, viper-tongued human would ever fit the bill. But Miki Kendrick isn’t some average human. With an IQ off the charts and a special skill with weapons of all kinds, Miki brings the big blond pooch to his knees—and keeps him there.", "Miki’s way too smart to ever believe in love and she knows a guy like Conall could only want one thing from her. But with the Pack’s enemies on her tail and a few days stuck alone with the one man who makes her absolutely wild, Miki is about to discover how persistent one Viking wolf can be."], "author": "Shelly Laurenston", "num_pages": "255", "awards": [], "places": ["California"], "character_names": ["Zach Sheridan", "Sara Morrighan", "Angelina Santiago", "Conall Viga-Feilan", "Miki Kendrick"], "language": "English", "publish_date": "2007-03-06 00:00:00", "ISBN": "1599981416"},
{"url": "https://www.goodreads.com/book/show/248484.Book_of_a_Thousand_Days", "num_ratings": "44,285", "num_reviews": "5,890", "avg_ratings": 3.96, "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Fiction"], "title": "Book of a Thousand Days", "description": ["When Dashti, a maid, and Lady Saren, her mistress, are shut in a tower for seven years because of Saren's refusal to marry a man she despises, the two prepare for a very long and dark imprisonment.", "As food runs low and the days go from broiling hot to freezing cold, it is all Dashti can do to keep them fed and comfortable. With the arrival outside the tower of Saren's two s", "When Dashti, a maid, and Lady Saren, her mistress, are shut in a tower for seven years because of Saren's refusal to marry a man she despises, the two prepare for a very long and dark imprisonment.", "As food runs low and the days go from broiling hot to freezing cold, it is all Dashti can do to keep them fed and comfortable. With the arrival outside the tower of Saren's two suitors--one welcome, the other decidedly less so--the girls are confronted with both hope and great danger, and Dashti must make the desperate choices of a girl whose life is worth more than she knows.", "With Shannon Hale's lyrical language, this little-known classic fairy tale from the Brothers Grimm is reimagined and reset on the central Asian steppes; it is a completely unique retelling filled with adventure and romance, drama and disguise."], "author": "Shannon Hale", "num_pages": "306", "awards": ["Utah Book Award for Children/Young Adults (2007)", "Dorothy Canfield Fisher Children's Book Award Nominee (2009)", "Judy Lopez Memorial Award for Children's Literature Nominee (2008)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2010)"], "places": [], "character_names": ["Dashti", "Lady Saren", "Khan Tegus", "Lord Khasar"], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1599900513"},
{"url": "https://www.goodreads.com/book/show/334176.The_Sparrow", "num_ratings": "48,815", "num_reviews": "6,057", "avg_ratings": 4.17, "genres": ["Science Fiction", "Fiction", "Fantasy", "Religion"], "title": "The Sparrow", "description": ["In 2019, humanity finally finds proof of extraterrestrial life when a listening post in Puerto Rico picks up exquisite singing from a planet that will come to be known as Rakhat. While United Nations diplomats endlessly debate a possible first contact mission, the Society of Jesus quietly organizes an eight-person scientific expedition of its own. What the Jesuits find is", "In 2019, humanity finally finds proof of extraterrestrial life when a listening post in Puerto Rico picks up exquisite singing from a planet that will come to be known as Rakhat. While United Nations diplomats endlessly debate a possible first contact mission, the Society of Jesus quietly organizes an eight-person scientific expedition of its own. What the Jesuits find is a world so beyond comprehension that it will lead them to question what it means to be \"human\"."], "author": "Mary Doria Russell", "num_pages": "516", "awards": ["Arthur C. Clarke Award for Best Novel (1998)", "Kurd-Laßwitz-Preis for Foreign Novel (2001)", "British Science Fiction Association Award for Novel (1997)", "John W. Campbell Memorial Award Nominee for Best Science Fiction Novel (1997)", "James Tiptree Jr. Award (1996)", "Puddly Award for Science Fiction (2001)"], "places": ["Borgo Santo Spirito, Rome", "Arecibo", "Naples", "San Juan", "Rakhat"], "character_names": ["Emilio Sandoz", "Jimmy Quinn", "Vincenzo Giuliani", "John Candotti", "Johannes Voelker", "Edward Behr", "Sofia Mendez", "Anne Edwards", "George Edwards", "Alan Pace", "Felipe Reyes", "D.W. Yarbrough", "Marc Robichaux", "Supaari", "Askama", "Hlavin Kitheri"], "language": "English", "publish_date": "1997-09-08 00:00:00", "ISBN": "0449912558"},
{"url": "https://www.goodreads.com/book/show/81617.Tempting_Danger", "num_ratings": "10,518", "num_reviews": "598", "avg_ratings": 3.78, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Romance", "Romance", "Paranormal Romance", "Fantasy", "Shapeshifters", "Werewolves", "Paranormal", "Shapeshifters", "Fantasy", "Magic"], "title": "Tempting Danger", "description": ["The ", " bestselling author tempts success in this stunning debut novel. ", " National bestselling author Eileen Wilks draws readers into a bold new world where the magical and mundane co-exist in an uneasy alliance--and a cop balanced on her own knife-edged struggle is their only hope against a cold-blooded killer.", "Lily Yu is a San Diego police detective investigating a s", "The ", " bestselling author tempts success in this stunning debut novel. ", " National bestselling author Eileen Wilks draws readers into a bold new world where the magical and mundane co-exist in an uneasy alliance--and a cop balanced on her own knife-edged struggle is their only hope against a cold-blooded killer.", "Lily Yu is a San Diego police detective investigating a series of grisly murders that appear to be the work of a werewolf. To hunt down the killer, she must infiltrate the clans. Only one man can help her--a were named Rule Turner, a prince of the lupi, whose charismatic presence disturbs Lily. Rule has his own reasons for helping the investigation--reasons he doesn't want to share with Lily. Logic and honor demand she keep her distance, but the attraction between them is immediate and devastating-and beyond human reason. Now, in a race to fend off evil, Lily finds herself in uncharted territory, tested as never before, and at her back a man who she's not sure she can trust."], "author": "Eileen Wilks", "num_pages": "301", "awards": [], "places": ["San Diego, California"], "character_names": ["Cullen Seabourne", "Rule Turner", "Lily Yu", "Isen Turner", "Benedict Turner", "Mick Turner"], "language": "English", "publish_date": "2004-10-05 00:00:00", "ISBN": "0425198782"},
{"url": "https://www.goodreads.com/book/show/8680418-moon-over-soho", "num_ratings": "33,114", "num_reviews": "2,442", "avg_ratings": 4.1, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Mystery", "Fiction", "Mystery", "Crime", "Fantasy", "Magic", "Fantasy", "Paranormal"], "title": "Moon Over Soho", "description": ["The song. That’s what London constable and sorcerer’s apprentice Peter Grant first notices when he examines the corpse of Cyrus Wilkins, part-time jazz drummer and full-time accountant, who dropped dead of a heart attack while playing a gig at Soho’s 606 Club. The notes of the old jazz standard are rising from the body—a sure sign that something about the man’s death was n", "The song. That’s what London constable and sorcerer’s apprentice Peter Grant first notices when he examines the corpse of Cyrus Wilkins, part-time jazz drummer and full-time accountant, who dropped dead of a heart attack while playing a gig at Soho’s 606 Club. The notes of the old jazz standard are rising from the body—a sure sign that something about the man’s death was not at all natural but instead supernatural.", "Body and soul. They’re also what Peter will risk as he investigates a pattern of similar deaths in and around Soho. With the help of his superior officer, Detective Chief Inspector Thomas Nightingale, the last registered wizard in England, and the assistance of beautiful jazz aficionado Simone Fitzwilliam, Peter will uncover a deadly magical menace—one that leads right to his own doorstep and to the squandered promise of a young jazz musician: a talented trumpet player named Richard “Lord” Grant—otherwise known as Peter’s dear old dad."], "author": "Ben Aaronovitch", "num_pages": "289", "awards": [], "places": ["London, England"], "character_names": ["Peter Grant"], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "0345524594"},
{"url": "https://www.goodreads.com/book/show/297929.Urban_Shaman", "num_ratings": "13,398", "num_reviews": "765", "avg_ratings": 3.72, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Fantasy", "Magic", "Fiction", "Mystery"], "title": "Urban Shaman", "description": ["Joanne Walker has three days to learn to use her shamanic powers and save the world from the unleashed Wild Hunt.", "No worries. No pressure. Never mind the lack of sleep, the perplexing new talent for healing from fatal wounds, or the cryptic, talking coyote who appears in her dreams.", "And if all that's not bad enough, in the three years Joanne's been a cop, she's never seen a", "Joanne Walker has three days to learn to use her shamanic powers and save the world from the unleashed Wild Hunt.", "No worries. No pressure. Never mind the lack of sleep, the perplexing new talent for healing from fatal wounds, or the cryptic, talking coyote who appears in her dreams.", "And if all that's not bad enough, in the three years Joanne's been a cop, she's never seen a dead body -- but she's just come across her second in three days.", "It's been a bitch of a week. And it isn't over yet."], "author": "C.E. Murphy", "num_pages": "410", "awards": [], "places": ["United States of America"], "character_names": ["Joanne Walker", "Gary", "Coyote", "Cernunnos"], "language": "English", "publish_date": "2005-05-24 00:00:00", "ISBN": "0373802234"},
{"url": "https://www.goodreads.com/book/show/25437891-the-v-girl", "num_ratings": "5,708", "num_reviews": "676", "avg_ratings": 4.01, "genres": ["Romance", "Young Adult", "Young Adult", "Coming Of Age", "Science Fiction", "Dystopia", "Fiction", "Science Fiction"], "title": "The V Girl", "description": ["ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substi", "ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substitute for love.", "Lila’s coping mechanism to deal with her mother’s loss is her secret. A secret that will bring her closer to Aleksey Fürst, a foreign, broody man who she distrusts because of his links to the troops and his rough, yet irresistible appearance. He offers Lila an alternative to her plans, a possibility that terrifies her…and tempts her in spite of herself.", "With threats looming at every turn and no way to escape, Lila fears that falling in love will only lead to more heartache. The consequences of laying down her arms for Aleksey and welcoming hope might destroy more than her heart. They might force her to face the worst of her nightmares becoming a reality. Is love possible in a world that has forgotten what the human touch is?", "NOTES FROM THE AUTHOR", "* This is a book full of romance and anti-rape messages. I didn't write this book to romanticize violence against women but to tell the story of a girl who has to come of age under the most terrible circumstances. ", "* This full-length novel is a stand alone. No cliffhanger", "* Alpha male hero. No cheating. No slut-shaming.", "* Includes a discussion guide for bookclubs", "* Possible triggers for abuse survivors."], "author": "Mya Robarts", "num_pages": "341", "awards": [], "places": ["Starville"], "character_names": ["Lila Velez", "Aleksey Fürst", "Azalea Velez", "Olmo Velez", "Tristan Froh", "Ethan Velez"], "language": "English", "publish_date": "2015-06-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/41538.The_Living_Blood", "num_ratings": "1,833", "num_reviews": "120", "avg_ratings": 4.33, "genres": ["Horror", "Fiction", "Fantasy", "Science Fiction", "Fantasy", "Paranormal"], "title": "The Living Blood", "description": ["Jessica Jacobs-Wolde's life was destroyed when her husband, David Wolde killed both their daughter Kira and Jessica herself--and revived Jessica with his healing blood. David was a Life Brother, member of an ancient, secret, and immortal African clan. Now Jessica, hiding with her surviving daughter in rural Botswana, attempts to make sense of her new existence, and of Fana", "Jessica Jacobs-Wolde's life was destroyed when her husband, David Wolde killed both their daughter Kira and Jessica herself--and revived Jessica with his healing blood. David was a Life Brother, member of an ancient, secret, and immortal African clan. Now Jessica, hiding with her surviving daughter in rural Botswana, attempts to make sense of her new existence, and of Fana's growing abilities. Jessica's only hope of teaching Fana to control her dangerous talents is to travel to Ethiopia and find the Life Brothers' hidden colony. "], "author": "Tananarive Due", "num_pages": "515", "awards": ["American Book Award (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "0671040847"},
{"url": "https://www.goodreads.com/book/show/57891.Battle_Royale", "num_ratings": "44,904", "num_reviews": "4,281", "avg_ratings": 4.25, "genres": ["Fiction", "Science Fiction", "Dystopia", "Horror", "Science Fiction", "Young Adult", "Thriller"], "title": "Battle Royale", "description": ["Koushun Takami's notorious high-octane thriller is based on an irresistible premise: a class of junior high school students is taken to a deserted island where, as part of a ruthless authoritarian program, they are provided arms and forced to kill one another until only one survivor is left standing. Criticized as violent exploitation when first published in Japan - where", "Koushun Takami's notorious high-octane thriller is based on an irresistible premise: a class of junior high school students is taken to a deserted island where, as part of a ruthless authoritarian program, they are provided arms and forced to kill one another until only one survivor is left standing. Criticized as violent exploitation when first published in Japan - where it then proceeded to become a runaway bestseller - Battle Royale is a Lord of the Flies for the 21st century, a potent allegory of what it means to be young and (barely) alive in a dog-eat-dog world. Made into a controversial hit movie of the same name, Battle Royale is already a contemporary Japanese pulp classic, now available for the first time in the English language."], "author": "Koushun Takami", "num_pages": "617", "awards": [], "places": ["Japan"], "character_names": [], "language": "English", "publish_date": "2003-02-26 00:00:00", "ISBN": "156931778X"},
{"url": "https://www.goodreads.com/book/show/633270.The_Ear_the_Eye_and_the_Arm", "num_ratings": "14,358", "num_reviews": "809", "avg_ratings": 3.86, "genres": ["Young Adult", "Science Fiction", "Fantasy", "Fiction", "Adventure"], "title": "The Ear, the Eye, and the Arm", "description": ["General Matsika's children steal out of the house on a forbidden adventure--and disappear. In Zimbabwe, in the year 2194, the children's parents call in Africa's most unusual detectives--the Ear, the Eye and the Arm--who have powers far beyond those of other human beings. The children must avoid the evils of the past, the technology of the future, and a motley assortment o", "General Matsika's children steal out of the house on a forbidden adventure--and disappear. In Zimbabwe, in the year 2194, the children's parents call in Africa's most unusual detectives--the Ear, the Eye and the Arm--who have powers far beyond those of other human beings. The children must avoid the evils of the past, the technology of the future, and a motley assortment of criminals in order to return home safely. 1995 Newbery Honor Book; ALA Notable Book; ALA Best Book for Young Adults."], "author": "Nancy Farmer", "num_pages": "311", "awards": ["Newbery Medal Nominee (1995)", "Golden Duck Award for Hal Clement Award for Young Adult (1995)", "Dorothy Canfield Fisher Children's Book Award Nominee (1996)"], "places": ["Zimbabwe"], "character_names": [], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "0140376410"},
{"url": "https://www.goodreads.com/book/show/2855034-nation", "num_ratings": "28,420", "num_reviews": "2,562", "avg_ratings": 4.06, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure"], "title": "Nation", "description": ["Alone on a desert island — everything and everyone he knows and loves has been washed away in a storm — Mau is the last surviving member of his nation. He’s completely alone — or so he thinks until he finds the ghost girl. She has no toes, wears strange lacy trousers like the grandfather bird, and gives him a stick that can make fire.", "Daphne, sole survivor of the wreck of t", "Alone on a desert island — everything and everyone he knows and loves has been washed away in a storm — Mau is the last surviving member of his nation. He’s completely alone — or so he thinks until he finds the ghost girl. She has no toes, wears strange lacy trousers like the grandfather bird, and gives him a stick that can make fire.", "Daphne, sole survivor of the wreck of the Sweet Judy, almost immediately regrets trying to shoot the native boy. Thank goodness the powder was wet and the gun only produced a spark. She’s certain her father, distant cousin of the Royal family, will come and rescue her but it seems, for now, that all she has for company is the boy and the foul-mouthed ship’s parrot, until other survivors arrive to take refuge on the island. Together, Mau and Daphne discover some remarkable things (including how to milk a pig, and why spitting in beer is a good thing), and start to forge a new nation.", "Encompassing themes of death and nationhood, Terry Pratchett’s new novel is, as can be expected, extremely funny, witty and wise. Mau’s ancestors have something to teach us all. Mau just wishes they would shut up about it and let him get on with saving everyone’s lives!"], "author": "Terry Pratchett", "num_pages": "367", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2009)", "Odyssey Award Nominee (2009)", "Los Angeles Times Book Prize for Young Adult Literature (2008)", "Michael L. Printz Award Nominee (2009)", "Boston Globe-Horn Book Award for Fiction and Poetry (2009)", "Sidewise Award Nominee for Alternate History (2008)", "Carnegie Medal Nominee (2010)"], "places": [], "character_names": ["Mau", "Daphne (Ermintrude Fanshaw)"], "language": "English", "publish_date": "2008-09-30 00:00:00", "ISBN": "0061433012"},
{"url": "https://www.goodreads.com/book/show/60934.Imago", "num_ratings": "8,604", "num_reviews": "567", "avg_ratings": 4.19, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Imago", "description": ["The futures of both humans and Oankali rest in one young being's successful metamorphosis into adulthood."], "author": "Octavia E. Butler", "num_pages": "224", "awards": [], "places": ["Lo, Earth"], "character_names": ["Nikanj", "Jodahs"], "language": "English", "publish_date": "1997-04-01 00:00:00", "ISBN": "0446603635"},
{"url": "https://www.goodreads.com/book/show/116249.Adulthood_Rites", "num_ratings": "9,447", "num_reviews": "609", "avg_ratings": 4.16, "genres": ["Science Fiction", "Fiction", "Fantasy"], "title": "Adulthood Rites", "description": ["In this sequel to Dawn, Lilith Iyapo has given birth to what looks like a normal human boy named Akin. But Akin actually has five parents: a male and female human, a male and female Oankali, and a sexless Ooloi. The Oankali and Ooloi are part of an alien race that rescued humanity from a devastating nuclear war, but the price they exact is a high one the aliens are compell", "In this sequel to Dawn, Lilith Iyapo has given birth to what looks like a normal human boy named Akin. But Akin actually has five parents: a male and female human, a male and female Oankali, and a sexless Ooloi. The Oankali and Ooloi are part of an alien race that rescued humanity from a devastating nuclear war, but the price they exact is a high one the aliens are compelled to genetically merge their species with other races, drastically altering both in the process. ", "On a rehabilitated Earth, this \"new\" race is emerging through human/Oankali/Ooloi mating, but there are also \"pure\" humans who choose to resist the aliens and the salvation they offer.These resisters are sterilized by the Ooloi so that they cannot reproduce the genetic defect that drives humanity to destroy itself, but otherwise they are left alone (unless they become violent). ", "When the resisters kidnap young Akin, the Oankali choose to leave the child with his captors, for he the most \"human\" of the Oankali children will decide whether the resisters should be given back their fertility and freedom, even though they will only destroy themselves again. ", "This is the second volume in Octavia Butler's Xenogenesis series, a powerful tale of alien existence."], "author": "Octavia E. Butler", "num_pages": "277", "awards": [], "places": ["Lo, Earth"], "character_names": ["Lilith lyapo", "Ahajas", "Dichaan", "Nikanj", "Gabriel Rinaldi", "Akin", "Tate"], "language": "English", "publish_date": "1997-04-01 00:00:00", "ISBN": "0446603783"},
{"url": "https://www.goodreads.com/book/show/3115070-hostage-to-pleasure", "num_ratings": "23,653", "num_reviews": "1,107", "avg_ratings": 4.22, "genres": ["Fantasy", "Paranormal", "Romance", "Fantasy", "Romance", "Paranormal Romance", "Paranormal", "Shapeshifters", "Fantasy", "Urban Fantasy"], "title": "Hostage to Pleasure", "description": ["Separated from her son and forced to create a neural implant that will mean the effective enslavement of her psychically gifted race, Ashaya Aleine is the perfect Psy--cool, calm, emotionless...at least on the surface. Inside, she's fighting a desperate battle to save her son and escape the vicious cold of the PsyNet. Yet when escape comes, it leads not to safety, but to t", "Separated from her son and forced to create a neural implant that will mean the effective enslavement of her psychically gifted race, Ashaya Aleine is the perfect Psy--cool, calm, emotionless...at least on the surface. Inside, she's fighting a desperate battle to save her son and escape the vicious cold of the PsyNet. Yet when escape comes, it leads not to safety, but to the lethal danger of a sniper's embrace.", "DarkRiver sniper Dorian Christensen lost his sister to a Psy killer. Though he lacks the changeling ability to shift into animal form, his leopard lives within. And that leopard's rage at the brutal loss is a clawing darkness that hungers for vengeance. Falling for a Psy has never been on Dorian's agenda. But charged with protecting Ashaya and her son, he discovers that passion has a way of changing the rules..."], "author": "Nalini Singh", "num_pages": "330", "awards": [], "places": ["United States of America", "California"], "character_names": ["Sascha Duncan", "Lucas Hunter", "Faith Nightstar", "Judd Lauren", "Clay Bennett", "Talin McKade", "Ashaya Aleine", "Mercy Smith", "Nate Ryder", "Tamsyn Mahaire", "Dorian Christensen", "Amara Aleine", "Kaleb Krycheck", "Vaughn D'Angelo", "Anthony Kyriakus", "Keenan Aleine"], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "0425223256"},
{"url": "https://www.goodreads.com/book/show/13206900-winter", "num_ratings": "138,168", "num_reviews": "20,230", "avg_ratings": 4.48, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Romance"], "title": "Winter", "description": ["Princess Winter is admired by the Lunar people for her grace and kindness, and despite the scars that mark her face, her beauty is said to be even more breathtaking than that of her stepmother, Queen Levana.", "Winter despises her stepmother, and knows Levana won't approve of her feelings for her childhood friend--the handsome palace guard, Jacin. But Winter isn't as weak as L", "Princess Winter is admired by the Lunar people for her grace and kindness, and despite the scars that mark her face, her beauty is said to be even more breathtaking than that of her stepmother, Queen Levana.", "Winter despises her stepmother, and knows Levana won't approve of her feelings for her childhood friend--the handsome palace guard, Jacin. But Winter isn't as weak as Levana believes her to be and she's been undermining her stepmother's wishes for years. Together with the cyborg mechanic, Cinder, and her allies, Winter might even have the power to launch a revolution and win a war that's been raging for far too long.", "Can Cinder, Scarlet, Cress, and Winter defeat Levana and find their happily ever afters? Fans will not want to miss this thrilling conclusion to Marissa Meyer's national bestselling Lunar Chronicles series."], "author": "Marissa Meyer", "num_pages": "827", "awards": ["Pacific Book Review Award for Best Young Adult (2016)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)"], "places": ["Luna"], "character_names": ["Princess Winter", "Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "Carswell Thorne", "Iko", "Crescent Moon \"Cress\" Darnel", "Jacin Clay", "Linh Adri", "Linh Pearl"], "language": "English", "publish_date": "2015-11-10 00:00:00", "ISBN": "0312642989"},
{"url": "https://www.goodreads.com/book/show/39305.Minion", "num_ratings": "5,694", "num_reviews": "523", "avg_ratings": 3.44, "genres": ["Paranormal", "Vampires", "Fantasy", "Urban Fantasy", "Fantasy", "Paranormal", "Fantasy", "Romance", "Paranormal Romance", "Fiction"], "title": "Minion", "description": ["All Damali Richards ever wanted to do was create music and bring it to the people. Now she is a spoken word artist and the top act for Warriors of Light Records. But come nightfall, she hunts vampires and demons—predators that people tend to dismiss as myth or fanta", "All Damali Richards ever wanted to do was create music and bring it to the people. Now she is a spoken word artist and the top act for Warriors of Light Records. But come nightfall, she hunts vampires and demons—predators that people tend to dismiss as myth or fantasy. Damali and her Guardian team cannot afford such delusions, especially now, when a group of rogue vampires has been killing the artists of Warriors of Light and their rival, Blood Music.", "When strange attacks erupt within the club drug-trafficking network and draw the attention of the police, Damali realizes these killings are a bit out of the ordinary, even for vampires. Instead of neat puncture marks in the neck showing where the blood has been drained from the body, these corpses are mutilated beyond recognition, indicating a blood lust and thirst for destruction that surpasses any Damali has encountered before. Soon she discovers that behind these brutal murders is the most powerful vampire Damali has ever met—a seductive beast who is coming for her next…"], "author": "L.A. Banks", "num_pages": "286", "awards": [], "places": [], "character_names": ["Damali Richards"], "language": "English", "publish_date": "2004-05-04 00:00:00", "ISBN": "0312987013"},
{"url": "https://www.goodreads.com/book/show/6472451-ash", "num_ratings": "27,424", "num_reviews": "3,025", "avg_ratings": 3.62, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Fiction"], "title": "Ash", "description": ["In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she bel", "In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she believes that her wish may be granted.", "The day that Ash meets Kaisa, the King's Huntress, her heart begins to change. Instead of chasing fairies, Ash learns to hunt with Kaisa. Though their friendship is as delicate as a new bloom, it reawakens Ash's capacity for love-and her desire to live. But Sidhean has already claimed Ash for his own, and she must make a choice between fairy tale dreams and true love.", "Entrancing, empowering, and romantic, ", " is about the connection between life and love, and solitude and death, where transformation can come from even the deepest grief."], "author": "Malinda Lo", "num_pages": "264", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2010)", "Gaylactic Spectrum Award Nominee for Best Novel (2010)", "William C. Morris YA Debut Award Nominee (2010)", "James Tiptree Jr. Award Nominee for Longlist (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Andre Norton Award Nominee (2009)"], "places": [], "character_names": ["Aisling", "Kaisa", "Sidhean"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0316040096"},
{"url": "https://www.goodreads.com/book/show/9415946-huntress", "num_ratings": "9,287", "num_reviews": "982", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Young Adult", "Young Adult Fantasy", "Adventure", "Fantasy", "Magic"], "title": "Huntress", "description": ["Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, th", "Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, the city of the Fairy Queen. Taisin is a sage, thrumming with magic, and Kaede is of the earth, without a speck of the otherworldly. And yet the two girls' destinies are drawn together during the mission. As members of their party succumb to unearthly attacks and fairy tricks, the two come to rely on each other and even begin to fall in love. But the Kingdom needs only one huntress to save it, and what it takes could tear Kaede and Taisin apart forever.", "The exciting adventure prequel to Malinda Lo's highly acclaimed novel ", "is overflowing with lush Chinese influences and details inspired by the ", ", and is filled with action and romance."], "author": "Malinda Lo", "num_pages": "371", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2012)", "James Tiptree Jr. Award Nominee for Longlist (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "031604007X"},
{"url": "https://www.goodreads.com/book/show/7923006-the-kingdom-of-gods", "num_ratings": "11,578", "num_reviews": "1,085", "avg_ratings": 3.93, "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy", "Romance", "Fantasy", "High Fantasy"], "title": "The Kingdom of Gods", "description": ["For two thousand years the Arameri family has ruled the world by enslaving the very gods that created mortalkind. Now the gods are free, and the Arameris' ruthless grip is slipping. Yet they are all that stands between peace and world-spanning, unending war."], "author": "N.K. Jemisin", "num_pages": "613", "awards": ["Nebula Award Nominee for Best Novel (2011)", "Goodreads Choice Award Nominee for Best Fantasy (2011)"], "places": [], "character_names": ["Yeine Darr/Arameri", "Itempas", "Nahadoth", "Enefa ('post mortem')", "Sieh", "Shahar Arameri", "Deka Arameri", "Nahadoth’s Shadow/Hado/Ahad"], "language": "English", "publish_date": "2011-10-11 00:00:00", "ISBN": "184149819X"},
{"url": "https://www.goodreads.com/book/show/57504.Brown_Girl_in_the_Ring", "num_ratings": "3,299", "num_reviews": "389", "avg_ratings": 3.85, "genres": ["Fantasy", "Fiction", "Science Fiction", "Speculative Fiction", "Fantasy", "Urban Fantasy", "Science Fiction", "Dystopia"], "title": "Brown Girl in the Ring", "description": ["The rich and privileged have fled the city, barricaded it behind roadblocks, and left", "The rich and privileged have fled the city, barricaded it behind roadblocks, and left it to crumble. The inner city has had to rediscover old ways--farming, barter, herb lore. But now the monied need a harvest of bodies, and so they prey upon the helpless of the streets. With nowhere to turn, a young woman must open herself to ancient truths, eternal powers, and the tragic mystery surrounding her mother and grandmother.", "She must bargain with gods, and give birth to new legends."], "author": "Nalo Hopkinson", "num_pages": "256", "awards": ["Locus Award for Best First Novel (1999)", "Warner Aspect First Novel Contest (1997)", "James Tiptree Jr. Award Honor List (1998)"], "places": ["Toronto, Ontario"], "character_names": [], "language": "English", "publish_date": "1998-07-01 00:00:00", "ISBN": "0446674338"},
{"url": "https://www.goodreads.com/book/show/7114825-cold-magic", "num_ratings": "7,947", "num_reviews": "989", "avg_ratings": 3.72, "genres": ["Fantasy", "Science Fiction", "Steampunk", "Young Adult", "Fiction", "Fantasy", "Magic", "Romance"], "title": "Cold Magic", "description": ["As they approach adulthood, Cat Barahal and her cousin Bee think they understand the society they live in and their place within it. At a select academy they study new airship technologies and the dawning Industrial Revolution, but magical forces still rule. And the cousins are about to discover the full ruthlessness of this rule."], "author": "Kate Elliott", "num_pages": "528", "awards": ["DABWAHA Romance Tournament for Best Novel with Romantic Elements/Crossover (2011)"], "places": [], "character_names": ["Catherine “Cat” Hassi Barahal", "Beatrice Hassi Barahal", "Andevai Diarisso Haranwy"], "language": "English", "publish_date": "2010-09-02 00:00:00", "ISBN": "1841498815"},
{"url": "https://www.goodreads.com/book/show/60930.Bloodchild_and_Other_Stories", "num_ratings": "8,969", "num_reviews": "802", "avg_ratings": 4.3, "genres": ["Speculative Fiction", "Science Fiction Fantasy", "Short Stories", "Anthologies", "Feminism"], "title": "Bloodchild and Other Stories", "description": ["A perfect introduction for new readers and a must-have for avid fans, this New York Times Notable Book includes \"Bloodchild,\" winner of both the Hugo and the Nebula awards and \"Speech Sounds,\" winner of the Hugo Award. Appearing in print for the first time, \"Amnesty\" is a story of a woman named Noah who works to negotiate the tense and co-dependent relationship between hum", "A perfect introduction for new readers and a must-have for avid fans, this New York Times Notable Book includes \"Bloodchild,\" winner of both the Hugo and the Nebula awards and \"Speech Sounds,\" winner of the Hugo Award. Appearing in print for the first time, \"Amnesty\" is a story of a woman named Noah who works to negotiate the tense and co-dependent relationship between humans and a species of invaders. Also new to this collection is \"The Book of Martha\" which asks: What would you do if God granted you the ability—and responsibility—to save humanity from itself?", "Like all of Octavia Butler’s best writing, these works of the imagination are parables of the contemporary world. She proves constant in her vigil, an unblinking pessimist hoping to be proven wrong, and one of contemporary literature’s strongest voices."], "author": "Octavia E. Butler", "num_pages": "214", "awards": ["Hugo Award for Best Novelette for \"Bloodchild\" (1985)", "Locus Award for Best Novelette (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-16 00:00:00", "ISBN": "1583226982"},
{"url": "https://www.goodreads.com/book/show/77160.Across_the_Nightingale_Floor", "num_ratings": "31,202", "num_reviews": "1,833", "avg_ratings": 4.06, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Cultural", "Japan", "Young Adult", "Historical"], "title": "Across the Nightingale Floor", "description": ["In his black-walled fortress at Inuyama, the warlord Iida Sadamu surveys his famous nightingale floor. Constructed with exquisite skill, it sings at the tread of each human foot. No assassin can cross it unheard.", "The youth Takeo has been brought up in a remote mountain village among the Hidden, a reclusive and spiritual people who have taught him only the ways of peace. But", "In his black-walled fortress at Inuyama, the warlord Iida Sadamu surveys his famous nightingale floor. Constructed with exquisite skill, it sings at the tread of each human foot. No assassin can cross it unheard.", "The youth Takeo has been brought up in a remote mountain village among the Hidden, a reclusive and spiritual people who have taught him only the ways of peace. But unbeknownst to him, his father was a celebrated assassin and a member of the Tribe, an ancient network of families with extraordinary, preternatural skills. When Takeo's village is pillaged, he is rescued and adopted by the mysterious Lord Otori Shigeru. Under the tutelage of Shigeru, he learns that he too possesses the skills of the Tribe. And, with this knowledge, he embarks on a journey that will lead him across the famed nightingale floor—and to his own unimaginable destiny..."], "author": "Lian Hearn", "num_pages": "305", "awards": ["Wirral Paperback of the Year (2004)", "Peter Pan Award", "Prix Litterature in the La Nuit De Lire", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2004)", "Lincoln Award Nominee (2007)"], "places": [], "character_names": ["Otori Takeo", "Lord Iida"], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "1573223328"},
{"url": "https://www.goodreads.com/book/show/20898019-ms-marvel-vol-1", "num_ratings": "70,177", "num_reviews": "4,927", "avg_ratings": 4.12, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Young Adult", "Comics", "Superheroes", "Fiction"], "title": "Ms. Marvel, Vol. 1: No Normal", "description": [" ", "Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of", " ", "Kamala Khan is an ordinary girl from Jersey City — until she's suddenly empowered with extraordinary gifts. But who truly is the new Ms. Marvel? Teenager? Muslim? Inhuman? Find out as she takes the Marvel Universe by storm! When Kamala discovers the dangers of her newfound powers, she unlocks a secret behind them, as well. Is Kamala ready to wield these immense new gifts? Or will the weight of the legacy before her be too much to bear? Kamala has no idea, either. But she's comin' for you, Jersey! ", "It's history in the making from acclaimed writer G. Willow Wilson (Air, Cairo) and beloved artist Adrian Alphona (RUNAWAYS)! Collecting MS. MARVEL (2014) #1-5 and material from ALL-NEW MARVEL NOW! POINT ONE #1."], "author": "G. Willow Wilson", "num_pages": "120", "awards": ["Hugo Award for Best Graphic Story (2015)", "Harvey Awards Nominee for Best New Series, Best Writer (for G. Willow Wilson) (2015)", "Lincoln Award Nominee (2019)", "Will Eisner Comic Industry Awards Nominee for Best New Series, Best Writer (for G. Willow Wilson), Best Penciller/Inker (for Adrian Alphona), Best Lettering (for Joe Caramagna), Best Cover Artist (for Jamie McKelvie & Matthew Wilson) (2015)", "Goodreads Choice Award Nominee for Graphic Novels & Comics (2014)"], "places": ["Jersey City, New Jersey"], "character_names": ["Steve Rogers", "Carol Danvers", "Kamala Khan", "Tony Stark", "Zoe Zimmer", "Chatty Bob", "Sheik Abdullah", "Doyle", "Thomas Edison (clone)", "Knox", "Bruno Carrelli", "Nakia Badahir", "Yusuf Khan", "Muneeba Khan", "Aamir Khan", "Vittorio \"Vick\" Carrelli", "Josh Richardson"], "language": "English", "publish_date": "2014-10-30 00:00:00", "ISBN": "078519021X"},
{"url": "https://www.goodreads.com/book/show/3819326-angels-blood", "num_ratings": "64,109", "num_reviews": "3,966", "avg_ratings": 4.11, "genres": ["Fantasy", "Paranormal", "Fantasy", "Urban Fantasy", "Romance", "Paranormal Romance", "Romance", "Paranormal", "Angels", "Fantasy", "Paranormal", "Vampires"], "title": "Angels' Blood", "description": ["Nalini Singh introduces readers to a world of beauty and bloodlust, where angels hold sway over vampires.", "Vampire hunter Elena Deveraux is hired by the dangerously beautiful Archangel Raphael. But this time, it’s not a wayward vamp she has to track. It’s an archangel gone bad.", "The job will put Elena in the midst of a killing spree like no other—and pull her to the razor’s ed", "Nalini Singh introduces readers to a world of beauty and bloodlust, where angels hold sway over vampires.", "Vampire hunter Elena Deveraux is hired by the dangerously beautiful Archangel Raphael. But this time, it’s not a wayward vamp she has to track. It’s an archangel gone bad.", "The job will put Elena in the midst of a killing spree like no other—and pull her to the razor’s edge of passion. Even if the hunt doesn’t destroy her, succumbing to Raphael’s seductive touch just may. For when archangels play, mortals break."], "author": "Nalini Singh", "num_pages": "339", "awards": ["All About Romance (AAR) Annual Reader Poll for Most Kickass Heroine (2010)", "Romantic Times Reviewers' Choice Award (RT Award) for Urban Fantasy Protagonist (2009)", "P.E.A.R.L. (Paranormal Excellence Award for Romantic Literature) for Best Fantasy/Magical Romance (2009)"], "places": ["New York City, New York"], "character_names": ["Elena Deveraux", "Raphael (Archangel)", "Illium", "Sara Haziz", "Ransom Winterwolf", "Dmitri", "Jason (Angel)", "Venom (Vampire)", "Michaela (Archangel)"], "language": "English", "publish_date": "2009-03-03 00:00:00", "ISBN": "0425226921"},
{"url": "https://www.goodreads.com/book/show/60932.Parable_of_the_Talents", "num_ratings": "15,239", "num_reviews": "1,206", "avg_ratings": 4.23, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Fantasy"], "title": "Parable of the Talents", "description": ["This Nebula Award-winning sequel to Parable of the Sower continues the story of Lauren Olamina in socially and economically depressed California in the 2030s. Convinced that her community should colonize the stars, Lauren and her followers make preparations. But the collapse of society and rise of fanatics result in Lauren's followers being enslaved, and her daughter stole", "This Nebula Award-winning sequel to Parable of the Sower continues the story of Lauren Olamina in socially and economically depressed California in the 2030s. Convinced that her community should colonize the stars, Lauren and her followers make preparations. But the collapse of society and rise of fanatics result in Lauren's followers being enslaved, and her daughter stolen from her. Now, Lauren must fight back to save the new world order."], "author": "Octavia E. Butler", "num_pages": "448", "awards": ["Nebula Award for Best Novel (1999)", "James Tiptree Jr. Award Honor List (1998)"], "places": ["United States of America"], "character_names": ["Lauren Olamina"], "language": "English", "publish_date": "2001-11-01 00:00:00", "ISBN": "0446610380"},
{"url": "https://www.goodreads.com/book/show/7163862-zoo-city", "num_ratings": "9,048", "num_reviews": "1,340", "avg_ratings": 3.64, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Fiction", "Science Fiction", "Mystery"], "title": "Zoo City", "description": ["Zinzi has a Sloth on her back, a dirty 419 scam habit and a talent for finding lost things. But when a little old lady turns up dead and the cops confiscate her last paycheck, she’s forced to take on her least favourite kind of job – missing persons.", "Being hired by reclusive music producer Odi Huron to find a teenybop pop star should be her ticket out of Zoo City, the feste", "Zinzi has a Sloth on her back, a dirty 419 scam habit and a talent for finding lost things. But when a little old lady turns up dead and the cops confiscate her last paycheck, she’s forced to take on her least favourite kind of job – missing persons.", "Being hired by reclusive music producer Odi Huron to find a teenybop pop star should be her ticket out of Zoo City, the festering slum where the criminal underclass and their animal companions live in the shadow of hell’s undertow.", "Instead, it catapults Zinzi deeper into the maw of a city twisted by crime and magic, where she’ll be forced to confront the dark secrets of former lives – including her own."], "author": "Lauren Beukes", "num_pages": "416", "awards": ["Arthur C. Clarke Award for Best Novel (2011)", "World Fantasy Award Nominee for Best Novel (2011)", "British Science Fiction Association Award Nominee for Novel (2010)", "James Tiptree Jr. Award Nominee for Longlist (2011)", "Tähtivaeltaja Award (2017)", "The Kitschies for Red Tentacle (Novel) (2010)"], "places": ["Johannesburg"], "character_names": ["Zinzi December"], "language": "English", "publish_date": "2010-04-29 00:00:00", "ISBN": "0007327684"},
{"url": "https://www.goodreads.com/book/show/285205.Blood_Bound", "num_ratings": "97,823", "num_reviews": "3,441", "avg_ratings": 4.31, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Shapeshifters", "Werewolves", "Romance", "Romance", "Paranormal Romance"], "title": "Blood Bound", "description": ["Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since", "Mechanic Mercy Thompson has friends in low places-and in dark ones. And now she owes one of them a favor. Since she can shapeshift at will, she agrees to act as some extra muscle when her vampire friend Stefan goes to deliver a message to another of his kind.", "But this new vampire is hardly ordinary-and neither is the demon inside of him."], "author": "Patricia Briggs", "num_pages": "292", "awards": [], "places": ["United States of America", "Washington (the state)", "Tri-Cities, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Charles Cornick", "Darryl Zao", "Warren", "Honey", "Wulfe", "Kyle Brooks", "Stefan Uccello", "Marsilia", "Uncle Mike", "Gabriel Sandoval", "Tony Montenegro", "Bran \"The Marrok\" Cornick", "Ben (werewolf)", "Andre (vampire)"], "language": "English", "publish_date": "2007-01-30 00:00:00", "ISBN": "0441014739"},
{"url": "https://www.goodreads.com/book/show/2355575.Cry_Wolf", "num_ratings": "76,293", "num_reviews": "3,286", "avg_ratings": 4.12, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Romance", "Shapeshifters", "Werewolves", "Romance", "Paranormal Romance"], "title": "Cry Wolf", "description": ["Anna never knew werewolves existed, until the night she survived a violent attack... and became one herself. After three years at the bottom of the pack, she'd learned to keep her head down and never, ever trust dominant males. Then Charles Cornick, the enforcer—and son—of the leader of the North American werewolves, came into her life.", "Charles insists that not only is Anna", "Anna never knew werewolves existed, until the night she survived a violent attack... and became one herself. After three years at the bottom of the pack, she'd learned to keep her head down and never, ever trust dominant males. Then Charles Cornick, the enforcer—and son—of the leader of the North American werewolves, came into her life.", "Charles insists that not only is Anna his mate, but she is also a rare and valued Omega wolf. And it is Anna's inner strength and calming presence that will prove invaluable as she and Charles go on the hunt in search of a rogue werewolf—a creature bound in magic so dark that it could threaten all of the pack."], "author": "Patricia Briggs", "num_pages": "294", "awards": ["P.E.A.R.L. (Paranormal Excellence Award for Romantic Literature) (2008)", "DABWAHA Romance Tournament for Best Paranormal/Urban Fantasy/SF Romance (2009)"], "places": ["Montana"], "character_names": ["Samuel Cornick", "Charles Cornick", "Anna Latham", "Asil \"The Moor\" (Hussan)", "Mariposa", "Blue Jay Woman", "Walter Rice", "Colin Taggart", "Bran \"The Marrok\" Cornick"], "language": "English", "publish_date": "2008-08-01 00:00:00", "ISBN": "0441016154"},
{"url": "https://www.goodreads.com/book/show/60926.Lilith_s_Brood", "num_ratings": "11,394", "num_reviews": "844", "avg_ratings": 4.32, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Lilith's Brood", "description": ["Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny", "Lilith Iyapo is in the Andes, mourning the death of her family, when war destroys Earth. Centuries later, she is resurrected -- by miraculously powerful unearthly beings, the Oankali. Driven by an irresistible need to heal others, the Oankali are rescuing our dying planet by merging genetically with mankind. But Lilith and all humanity must now share the world with uncanny, unimaginably alien creatures: their own children. This is their story..."], "author": "Octavia E. Butler", "num_pages": "746", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-06-01 00:00:00", "ISBN": "0446676101"},
{"url": "https://www.goodreads.com/book/show/9275658-legend", "num_ratings": "354,355", "num_reviews": "25,467", "avg_ratings": 4.18, "genres": ["Young Adult", "Romance", "Fantasy", "Science Fiction", "Fiction"], "title": "Legend", "description": ["What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal.", "What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal. But his motives may not be as malicious as they seem.", "From very different worlds, June and Day have no reason to cross paths—until the day June's brother, Metias, is murdered and Day becomes the prime suspect. Caught in the ultimate game of cat and mouse, Day is in a race for his family's survival, while June seeks to avenge Metias's death. But in a shocking turn of events, the two uncover the truth of what has really brought them together, and the sinister lengths their country will go to keep its secrets."], "author": "Marie Lu", "num_pages": "305", "awards": ["Milwaukee County Teen Book Award Nominee (2013)", "The Inky Awards Nominee for Silver Inky (2012)", "California Young Readers Medal Nominee for Young Adult (2015)", "Lincoln Award Nominee (2014)", "Missouri Truman Readers Award (2014)", "Goodreads Choice Award Nominee for Young Adult Fantasy and Science Fiction (2012)", "Rebecca Caudill Young Readers' Book Award (2015)"], "places": ["Los Angeles, The Republic of America"], "character_names": ["June Iparis", "Daniel Altan Wing", "Metias Iparis", "Commander Jameson", "Thomas Bryant", "Tess", "Kaede"], "language": "English", "publish_date": "2011-11-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1412138.Iron_Kissed", "num_ratings": "94,727", "num_reviews": "3,251", "avg_ratings": 4.36, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Shapeshifters", "Werewolves", "Paranormal", "Vampires", "Romance", "Romance", "Paranormal Romance"], "title": "Iron Kissed", "description": ["Mechanic Mercy Thompson can shift her shape - but not her loyalty. When her former boss and mentor is a", "Mechanic Mercy Thompson can shift her shape - but not her loyalty. When her former boss and mentor is arrested for murder and left to rot behind bars by his own kind, it's up to Mercy to clear his name, whether he wants her to or not.", "Mercy's loyalty is under pressure from other directions, too. Werewolves are not known for their patience, and if Mercy can't decide between the two she cares for, Sam and Adam may make the choice for her..."], "author": "Patricia Briggs", "num_pages": "287", "awards": ["DABWAHA Romance Tournament for Best Romance of the Year & Best Novel with Romantic Elements (2009)"], "places": ["Kennewick", "Umatilla (Fae) Reservation", "Kennewick, Washington"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Tim", "Warren", "Honey", "Kyle Brooks", "Uncle Mike", "Gabriel Sandoval", "Gray Lords", "Ben (werewolf)"], "language": "English", "publish_date": "2008-01-02 00:00:00", "ISBN": "0441015662"},
{"url": "https://www.goodreads.com/book/show/2986865-eon", "num_ratings": "50,254", "num_reviews": "4,122", "avg_ratings": 3.98, "genres": ["Fantasy", "Young Adult", "Fantasy", "Dragons", "Fantasy", "Magic"], "title": "Eon: Dragoneye Reborn", "description": ["Also Known As: Two Pearls of Wisdom, Eon: Rise of the Dragoneye, and Eon (All the same book just published with different publishers)", "Twelve-year-old Eon has been in training for years. His intensive study of Dragon Magic, based on East Asian astrology, involves two kinds of skills: sword-work and magical aptitude.", "Also Known As: Two Pearls of Wisdom, Eon: Rise of the Dragoneye, and Eon (All the same book just published with different publishers)", "Twelve-year-old Eon has been in training for years. His intensive study of Dragon Magic, based on East Asian astrology, involves two kinds of skills: sword-work and magical aptitude. He and his master hope that he will be chosen as a Dragoneye--an apprentice to one of the twelve energy dragons of good fortune. ", "But Eon has a dangerous secret. He is actually Eona, a sixteen-year-old girl who has been masquerading as a boy for the chance to become a Dragoneye. Females are forbidden to use Dragon Magic; if anyone discovers she has been hiding in plain sight, her death is assured.", "When Eon's secret threatens to come to light, she and her allies are plunged into grave danger and a deadly struggle for the Imperial throne. Eon must find the strength and inner power to battle those who want to take her magic...and her life."], "author": "Alison Goodman", "num_pages": "531", "awards": ["Victorian Premier's Literary Award Nominee for Young Adult Fiction Prize (2009)", "Aurealis Award for Best Fantasy Novel & Nominee for Young Adult Novel (2008)", "The Inky Awards Nominee for Gold Inky (2009)", "James Tiptree Jr. Award Honor List (2008)"], "places": [], "character_names": ["Dillon Walsh", "Eona", "Rilla", "Chart", "Ryoko", "Lady Jila", "Lord Ido"], "language": "English", "publish_date": "2008-12-26 00:00:00", "ISBN": "0670062278"},
{"url": "https://www.goodreads.com/book/show/60929.Dawn", "num_ratings": "19,895", "num_reviews": "1,953", "avg_ratings": 4.11, "genres": ["Science Fiction", "Fiction", "Fantasy", "Science Fiction Fantasy"], "title": "Dawn", "description": ["Lilith Iyapo has just lost her husband and son when atomic fire consumes Earth—the last stage of the planet’s final war. Hundreds of years later Lilith awakes, deep in the hold of a massive alien spacecraft piloted by the Oankali—who arrived just in time to save humanity from extinction. They have kept Lilith and other survivors asleep for centuries, as they learned whatev", "Lilith Iyapo has just lost her husband and son when atomic fire consumes Earth—the last stage of the planet’s final war. Hundreds of years later Lilith awakes, deep in the hold of a massive alien spacecraft piloted by the Oankali—who arrived just in time to save humanity from extinction. They have kept Lilith and other survivors asleep for centuries, as they learned whatever they could about Earth. Now it is time for Lilith to lead them back to her home world, but life among the Oankali on the newly resettled planet will be nothing like it was before.", "The Oankali survive by genetically merging with primitive civilizations—whether their new hosts like it or not. For the first time since the nuclear holocaust, Earth will be inhabited. Grass will grow, animals will run, and people will learn to survive the planet’s untamed wilderness. But their children will not be human. Not exactly."], "author": "Octavia E. Butler", "num_pages": "248", "awards": [], "places": [], "character_names": ["Lilith lyapo", "Ahajas", "Dichaan", "Tediin", "Nikanj", "Kahguyaht", "Peter Van Weerden", "Jean Pelerin", "Gabriel Rinaldi", "Curt Loehr", "Celene Ivers", "Ray Ordway", "Victor Dominic", "Beatrice Dwyer", "Allison Zeigler", "Hillary Ballard", "Jdahya", "Tate"], "language": "English", "publish_date": "1997-04-16 00:00:00", "ISBN": "0446603775"},
{"url": "https://www.goodreads.com/book/show/60925.Fledgling", "num_ratings": "15,020", "num_reviews": "2,109", "avg_ratings": 3.89, "genres": ["Fantasy", "Fiction", "Paranormal", "Vampires", "Science Fiction", "Horror", "Fantasy", "Paranormal", "Science Fiction Fantasy", "Speculative Fiction", "Fantasy", "Supernatural", "Fantasy", "Urban Fantasy"], "title": "Fledgling", "description": [", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wa", ", Octavia Butler's new novel after a seven year break, is the story of an apparently young, amnesiac girl whose alarmingly inhuman needs and abilities lead her to a startling conclusion: She is in fact a genetically modified, 53-year-old vampire. Forced to discover what she can about her stolen former life, she must at the same time learn who wanted - and still wants - to destroy her and those she cares for and how she can save herself. ", " is a captivating novel that tests the limits of \"otherness\" and questions what it means to be truly human."], "author": "Octavia E. Butler", "num_pages": "320", "awards": ["Endeavour Award Nominee (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-02 00:00:00", "ISBN": "0446696161"},
{"url": "https://www.goodreads.com/book/show/2767052-the-hunger-games", "num_ratings": "5,448,058", "num_reviews": "159,973", "avg_ratings": 4.33, "genres": ["Young Adult", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Science Fiction", "Romance", "Adventure", "Young Adult", "Teen", "Apocalyptic", "Post Apocalyptic", "Action"], "title": "The Hunger Games", "description": ["The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as t", "The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory.", "When 16-year-old Katniss's young sister, Prim, is selected as District 12's female representative, Katniss volunteers to take her place. She and her male counterpart Peeta, are pitted against bigger, stronger representatives, some of whom have trained for this their whole lives. , she sees it as a death sentence. But Katniss has been close to death before. For her, survival is second nature."], "author": "Suzanne Collins", "num_pages": "374", "awards": ["Georgia Peach Book Award (2009)", "Buxtehuder Bulle (2009)", "Golden Duck Award for Hal Clement Award for Young Adult (2009)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2012)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2010)", "Red House Children's Book Award for Older Readers & Overall (2010)", "South Carolina Book Award for Junior and Young Adult Book (2011)", "Charlotte Award (2010)", "Colorado Blue Spruce Young Adult Book Award (2010)", "Teen Buckeye Book Award (2009)", "Pennsylvania Young Readers' Choice Award for Young Adults (2010)", "Rhode Island Teen Book Award (2010)", "Dorothy Canfield Fisher Children's Book Award (2010)", "Evergreen Teen Book Award (2011)", "Soaring Eagle Book Award (2009)", "Milwaukee County Teen Book Award Nominee (2010)", "Sakura Medal for Middle School Book (2010)", "Michigan Library Association Thumbs Up! Award (2009)", "Florida Teens Read (2009)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2010)", "Iowa High School Book Award (2011)", "New Mexico Land of Enchantment Award for Young Adult (2011)", "Eliot Rosewater Indiana High School Book Award (2010)", "The Inky Awards for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2011)", "Lincoln Award (2011)", "Kinderboekwinkelprijs (2010)", "Missouri Truman Readers Award (2011)", "Cybils Award for Young Adult Fantasy & Science Fiction (2008)", "Literaturpreis der Jury der jungen Leser for Jugendbuch (2010)", "The Inky Awards Shortlist for Silver Inky (2009)", "Prix Et-lisez-moi (2011)", "Missouri Gateway Readers Award (2011)", "Oklahoma Sequoyah Award for High School and Intermediate (2011)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2009)", "Rebecca Caudill Young Readers' Book Award (2011)"], "places": ["District 12, Panem", "Capitol, Panem", "Panem"], "character_names": ["Katniss Everdeen", "Peeta Mellark", "Cato (Hunger Games)", "Primrose Everdeen", "Gale Hawthorne", "Effie Trinket", "Haymitch Abernathy", "Cinna", "President Coriolanus Snow", "Rue", "Venia", "Flavius", "Lavinia (Hunger Games)", "Marvel", "Glimmer", "Clove", "Foxface", "Thresh", "Greasy Sae", "Madge Undersee", "Caesar Flickerman", "Claudius Templesmith", "Octavia (Hunger Games)", "Portia (hunger Games)"], "language": "English", "publish_date": "2008-09-14 00:00:00", "ISBN": "0439023483"},
{"url": "https://www.goodreads.com/book/show/15704307-saga-vol-1", "num_ratings": "178,636", "num_reviews": "10,253", "avg_ratings": 4.23, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Fantasy", "Science Fiction", "Fiction"], "title": "Saga, Vol. 1", "description": ["When two soldiers from opposite sides of a never-ending galactic war fall in love, they risk everything to bring a fragile new life into a dangerous old universe. ", "From bestselling writer Brian K. Vaughan, ", " is the sweeping tale of one young family fighting to find their place in the worlds. Fantasy and science fiction are wed like never before in this sexy, subversive d", "When two soldiers from opposite sides of a never-ending galactic war fall in love, they risk everything to bring a fragile new life into a dangerous old universe. ", "From bestselling writer Brian K. Vaughan, ", " is the sweeping tale of one young family fighting to find their place in the worlds. Fantasy and science fiction are wed like never before in this sexy, subversive drama for adults. ", ": ", " 1-6"], "author": "Brian K. Vaughan", "num_pages": "176", "awards": ["Hugo Award for Best Graphic Story (2013)", "Harvey Awards for Best Continuing or Limited Series, Best New Series, Best Single Issue or Story (Saga #1), Best Writer (for Brian K. Vaughan), Best Artist (for Fiona Staples), Best Colorist (for Fiona Staples) AND nominated for Best Cover Artist (for Fiona Staples) (2013)", "Will Eisner Comic Industry Awards for Best New Series, Best Continuing Series, Best Writer (for Brian K. Vaughan) (2013)", "Goodreads Choice Award for Best Graphic Novels & Comics Nominee (2012)"], "places": [], "character_names": ["Marko", "The Will (Saga)", "The Stalk", "Alana (Saga)", "Hazel (Saga)", "Prince Robot IV", "Izabel", "Klara (Saga)", "Barr (Saga)"], "language": "English", "publish_date": "2012-10-23 00:00:00", "ISBN": "1607066017"},
{"url": "https://www.goodreads.com/book/show/52318.Wild_Seed", "num_ratings": "13,004", "num_reviews": "1,220", "avg_ratings": 4.21, "genres": ["Science Fiction", "Fantasy", "Fiction", "Speculative Fiction"], "title": "Wild Seed", "description": ["Doro is an entity who changes bodies like clothes, killing his hosts by reflex or design. He fears no one until he meets Anyanwu. Anyanwu is a shapeshifter who can absorb bullets and heal with a kiss and savage anyone who threatens her. She fears no one until she meets Doro. Together they weave a pattern of destiny (from Africa to the New World) unimaginable to mortals."], "author": "Octavia E. Butler", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-04-01 00:00:00", "ISBN": "0446676977"},
{"url": "https://www.goodreads.com/book/show/2744.Anansi_Boys", "num_ratings": "166,972", "num_reviews": "8,617", "avg_ratings": 4.01, "genres": ["Fantasy", "Fiction", "Fantasy", "Urban Fantasy", "Fantasy", "Mythology"], "title": "Anansi Boys", "description": ["Fat Charlie Nancy's normal life ended the moment his father dropped dead on a Florida karaoke stage. Charlie didn't know his dad was a god. And he never knew he had a brother. ", "Now brother Spider's on his doorstep -- about to make Fat Charlie's life more interesting... and a lot more dangerous."], "author": "Neil Gaiman", "num_pages": "387", "awards": ["Locus Award for Best Fantasy Novel (2006)", "Mythopoeic Fantasy Award for Adult Literature (2006)", "ALA Alex Award (2006)", "British Fantasy Award for Best Novel (2006)"], "places": ["London, England", "Florida"], "character_names": ["Fat Charlie", "Rosie", "Spider", "Mrs. Higgler", "Mrs. Noah", "Mrs. Dunwiddy", "Graham Coates", "Maeve Livingston", "Daisy Day", "Mr. Nancy"], "language": "English", "publish_date": "2006-09-26 00:00:00", "ISBN": "0060515198"},
{"url": "https://www.goodreads.com/book/show/13642.A_Wizard_of_Earthsea", "num_ratings": "185,126", "num_reviews": "6,669", "avg_ratings": 4.0, "genres": ["Fantasy", "Fiction", "Young Adult", "Classics"], "title": "A Wizard of Earthsea", "description": ["Ged, the greatest sorcerer in all Earthsea, was called Sparrowhawk in his reckless youth. ", "Hungry for power and knowledge, Sparrowhawk tampered with long-held secrets and loosed a terrible shadow upon the world. This is the tale of his testing, how he mastered the mighty words of power, tamed an ancient dragon, and crossed death's threshold to restore the balance."], "author": "Ursula K. Le Guin", "num_pages": "183", "awards": ["Lewis Carroll Shelf Award (1979)", "Boston Globe-Horn Book Award for Fiction (1969)", "Złota Sepulka for Książka autora zagranicznego (1984)"], "places": ["Earthsea Realm"], "character_names": ["Ged"], "language": "English", "publish_date": "2004-09-28 00:00:00", "ISBN": "0553383043"},
{"url": "https://www.goodreads.com/book/show/36381037-cinder", "num_ratings": "537,762", "num_reviews": "46,012", "avg_ratings": 4.15, "genres": ["Young Adult", "Fantasy", "Science Fiction", "Science Fiction", "Dystopia"], "title": "Cinder", "description": [", a gifted mechanic in New Beijing, is also a cyborg. She's reviled by her stepmother and blamed for her stepsister's sudden illness. But when her life becomes entwined with the handsome Prince Kai's, she finds herself at the centre of a violent struggle between the desires of an evil queen - an", ", a gifted mechanic in New Beijing, is also a cyborg. She's reviled by her stepmother and blamed for her stepsister's sudden illness. But when her life becomes entwined with the handsome Prince Kai's, she finds herself at the centre of a violent struggle between the desires of an evil queen - and a dangerous temptation.", "Cinder is caught between duty and freedom, loyalty and betrayal. Now she must uncover secrets about her mysterious past in order to protect Earth's future."], "author": "Marissa Meyer", "num_pages": "400", "awards": ["Kalbacher Klapperschlange for Altersgruppe 7. - 9. Klasse (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2014)", "California Young Readers Medal for Young Adult (2016)", "Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2012)", "Rebecca Caudill Young Readers' Book Award Nominee (2016)"], "places": ["New Beijing"], "character_names": ["Linh Cinder", "Queen Levana", "Emperor Kai", "Iko", "Crescent Moon \"Cress\" Darnel", "Dr. Dmitri Erland", "Sybil Mira", "Linh Adri", "Linh Peony", "Linh Pearl"], "language": "English", "publish_date": "2012-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/52397.Parable_of_the_Sower", "num_ratings": "35,611", "num_reviews": "3,530", "avg_ratings": 4.15, "genres": ["Science Fiction", "Fiction", "Science Fiction", "Dystopia", "Fantasy", "Apocalyptic", "Post Apocalyptic"], "title": "Parable of the Sower", "description": ["In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a cul", "In 2025, with the world descending into madness and anarchy, one woman begins a fateful journey toward a better future", "Lauren Olamina and her family live in one of the only safe neighborhoods remaining on the outskirts of Los Angeles. Behind the walls of their defended enclave, Lauren’s father, a preacher, and a handful of other citizens try to salvage what remains of a culture that has been destroyed by drugs, disease, war, and chronic water shortages. While her father tries to lead people on the righteous path, Lauren struggles with hyperempathy, a condition that makes her extraordinarily sensitive to the pain of others.", "When fire destroys their compound, Lauren’s family is killed and she is forced out into a world that is fraught with danger. With a handful of other refugees, Lauren must make her way north to safety, along the way conceiving a revolutionary idea that may mean salvation for all mankind."], "author": "Octavia E. Butler", "num_pages": "345", "awards": [], "places": ["California"], "character_names": ["Lauren Olamina"], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "0446675504"},
{"url": "https://www.goodreads.com/book/show/6437061-the-hundred-thousand-kingdoms", "num_ratings": "38,000", "num_reviews": "4,171", "avg_ratings": 3.82, "genres": ["Fantasy", "Fiction", "Romance", "Fantasy", "High Fantasy", "Fantasy", "Epic Fantasy"], "title": "The Hundred Thousand Kingdoms", "description": ["Yeine Darr is an outcast from the barbarian north. But when her mother dies under mysterious circumstances, she is summoned to the majestic city of Sky. There, to her shock, Yeine is named an heiress to the king. But the throne of the Hundred Thousand Kingdoms is not easily won, and Yeine is thrust into a vicious power struggle."], "author": "N.K. Jemisin", "num_pages": "427", "awards": ["Hugo Award Nominee for Best Novel (2011)", "Nebula Award Nominee for Best Novel (2010)", "Locus Award for Best First Novel (2011)", "World Fantasy Award Nominee for Best Novel (2011)", "Goodreads Choice Award Nominee for Fantasy (2010)", "James Tiptree Jr. Award Honor List (2010)", "Prix Elbakin.net for Meilleur roman fantasy traduit (2011)"], "places": [], "character_names": ["Dekarta Arameri", "Kinneth Arameri (post mortem)", "Yeine Darr/Arameri", "Scimina Arameri", "Relad Arameri", "Itempas", "Nahadoth", "Enefa ('post mortem')", "Sieh", "T'vril Arameri"], "language": "English", "publish_date": "2010-02-25 00:00:00", "ISBN": "0316043915"},
{"url": "https://www.goodreads.com/book/show/4407.American_Gods", "num_ratings": "606,858", "num_reviews": "32,072", "avg_ratings": 4.11, "genres": ["Fantasy", "Fiction", "Fantasy", "Urban Fantasy", "Fantasy", "Mythology", "Science Fiction"], "title": "American Gods", "description": ["Days before his release from prison, Shadow's wife, Laura, dies in a mysterious car crash. Numbly, he makes his way back home. On the plane, he encounters the enigmatic Mr Wednesday, who claims to be a refugee from a distant war, a former god and the king of America.", "Together they embark on a profoundly strange journey across the heart of the USA, whilst all around them a s", "Days before his release from prison, Shadow's wife, Laura, dies in a mysterious car crash. Numbly, he makes his way back home. On the plane, he encounters the enigmatic Mr Wednesday, who claims to be a refugee from a distant war, a former god and the king of America.", "Together they embark on a profoundly strange journey across the heart of the USA, whilst all around them a storm of preternatural and epic proportions threatens to break.", "Scary, gripping and deeply unsettling, ", " takes a long, hard look into the soul of America. You'll be surprised by what - and who - it finds there..."], "author": "Neil Gaiman", "num_pages": "635", "awards": ["Bram Stoker Award for Best Novel (2001)", "Hugo Award for Best Novel (2002)", "Nebula Award for Best Novel (2002)", "Locus Award for Best Fantasy Novel (2002)", "International Horror Guild Award Nominee for Best Novel (2001)", "World Fantasy Award Nominee for Best Novel (2002)", "SFX Award for Best Novel (2002)", "Geffen Award (2003)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2002)", "Prix Bob Morane for roman traduit (2003)"], "places": ["United States of America", "Chicago, Illinois", "Chattanooga, Tennessee", "Minnesota", "Wisconsin", "Illinois"], "character_names": ["Shadow Moon", "Mr. Wednesday", "Spider", "Laura Moon", "Hinzelmann", "Easter", "Whiskey Jack", "Loki", "Odin", "Mr. Ibis", "Samantha Black Crow", "Bilquis", "Media", "Mad Sweeney", "Czernobog", "Mr. Jacquel", "Mr. Nancy", "Chad Mulligan", "Margaret Black Crow", "Mr. Town", "Mr. World", "Technical Boy"], "language": "English", "publish_date": "2005-03-04 00:00:00", "ISBN": "0747263744"},
{"url": "https://www.goodreads.com/book/show/71811.Moon_Called", "num_ratings": "148,700", "num_reviews": "7,107", "avg_ratings": 4.18, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Shapeshifters", "Werewolves", "Romance"], "title": "Moon Called", "description": ["Mercedes Thompson, aka Mercy, is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot li", "Mercedes Thompson, aka Mercy, is a talented Volkswagen mechanic living in the Tri-Cities area of Washington. She also happens to be a walker, a magical being with the power to shift into a coyote at will. Mercy's next-door neighbor is a werewolf. Her former boss is a gremlin. And she's fixing a bus for a vampire. This is the world of Mercy Thompson, one that looks a lot like ours but is populated by those things that go bump in the night. And Mercy's connection to those things is about to get her into some serious hot water..."], "author": "Patricia Briggs", "num_pages": "288", "awards": [], "places": ["Tri-Cities, Washington", "Washington (the state)", "United States of America"], "character_names": ["Adam Hauptman", "Samuel Cornick", "Zee", "Mercy Thompson", "Jesse Hauptman", "Leah", "Charles Cornick", "Darryl Zao", "Warren", "Kyle Brooks", "Stefan Uccello", "Alan MacKenzie Frazier", "Marsilia", "Auriele Zao", "Elizaveta Arkadyevna Vyshnevetskaya", "Gabriel Sandoval", "Tony Montenegro", "David Christiansen", "Bran \"The Marrok\" Cornick", "Ben (werewolf)"], "language": "English", "publish_date": "2006-02-01 00:00:00", "ISBN": "0441013813"}
]