[
{"url": "https://www.goodreads.com/book/show/9777.The_God_of_Small_Things", "num_ratings": "201,449", "num_reviews": "10,762", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Contemporary"], "title": "The God of Small Things", "description": ["The year is 1969. In the state of Kerala, on the southernmost tip of India, fraternal twins Esthappen and Rahel fashion a childhood for themselves in the shade of the wreck that is their family. Their lonely, lovely mother, Ammu, (who loves b", "The year is 1969. In the state of Kerala, on the southernmost tip of India, fraternal twins Esthappen and Rahel fashion a childhood for themselves in the shade of the wreck that is their family. Their lonely, lovely mother, Ammu, (who loves by night the man her children love by day), fled an abusive marriage to live with their blind grandmother, Mammachi (who plays Handel on her violin), their beloved uncle Chacko (Rhodes scholar, pickle baron, radical Marxist, bottom-pincher), and their enemy, Baby Kochamma (ex-nun and incumbent grandaunt). When Chacko's English ex-wife brings their daughter for a Christmas visit, the twins learn that things can change in a day, that lives can twist into new, ugly shapes, even cease forever, beside their river..."], "author": "Arundhati Roy", "num_pages": "340", "awards": ["Man Booker Prize (1997)"], "places": ["Kerala", "Aymanam"], "character_names": ["Rahel", "Ammu", "Mammachi", "Chacko", "Estha", "Velutha", "Baby Kochamma"], "language": "English", "publish_date": "1997-08-16 00:00:00", "ISBN": "0679457313"},
{"url": "https://www.goodreads.com/book/show/32739596-caged", "num_ratings": "55", "num_reviews": "34", "avg_ratings": 3.38, "genres": ["Fiction", "Fantasy", "Paranormal"], "title": "Caged", "description": ["\"Keep your mind right, put your body in action and let your spirit guide you.”", "These are the words keeping her sane after her husband takes her into isolation in northern Canada. But after three months with only a servant, a television and the screams of another captive keeping her company, she begins to lose touch with reality - even forgetting her own name.", "With the help o", "\"Keep your mind right, put your body in action and let your spirit guide you.”", "These are the words keeping her sane after her husband takes her into isolation in northern Canada. But after three months with only a servant, a television and the screams of another captive keeping her company, she begins to lose touch with reality - even forgetting her own name.", "With the help of an unexpected ally, she discovers an inner strength and powers previously unknown; changing her perspective and realigning her past, present and future."], "author": "Onaiza Khan", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-11-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/95186.The_Inheritance_of_Loss", "num_ratings": "42,972", "num_reviews": "3,609", "avg_ratings": 3.42, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction"], "title": "The Inheritance of Loss", "description": ["In a crumbling, isolated house at the foot of Mount Kanchenjunga in the Himalayas lives an embittered judge who wants only to retire in peace, when his orphaned granddaughter, Sai, arrives on his doorstep. The judge’s cook watches over her distractedly, for his thoughts are often on his son, Biju, who is hopscotching from one gritty New York restaurant to another. Kiran De", "In a crumbling, isolated house at the foot of Mount Kanchenjunga in the Himalayas lives an embittered judge who wants only to retire in peace, when his orphaned granddaughter, Sai, arrives on his doorstep. The judge’s cook watches over her distractedly, for his thoughts are often on his son, Biju, who is hopscotching from one gritty New York restaurant to another. Kiran Desai’s brilliant novel, published to huge acclaim, is a story of joy and despair. Her characters face numerous choices that majestically illuminate the consequences of colonialism as it collides with the modern world."], "author": "Kiran Desai", "num_pages": "357", "awards": ["Man Booker Prize (2006)", "Orange Prize Nominee for Fiction Shortlist (2007)", "National Book Critics Circle Award for Fiction (2006)", "Kiriyama Prize Nominee for Fiction (2007)", "Crossword Book Award for Popular (2006)", "Βραβείο Λογοτεχνικής Μετάφρασης ΕΚΕΜΕΛ Nominee for Αγγλόφωνη Λογοτεχνία (2008)", "International DUBLIN Literary Award Nominee (2008)"], "places": ["Kalimpong"], "character_names": ["Jemubhai Patel"], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0802142818"},
{"url": "https://www.goodreads.com/book/show/7029668-purge", "num_ratings": "10,889", "num_reviews": "943", "avg_ratings": 3.87, "genres": ["Fiction", "Historical", "Historical Fiction", "European Literature", "Finnish Literature"], "title": "Purge", "description": ["An international sensation, Sofi Oksanen's award-winning novel ", " is a breathtakingly suspenseful tale of two women dogged by their own shameful pasts and the dark, unspoken history that binds them. ", "When Aliide Truu, an older woman living alone in the Estonian countryside, finds a disheveled girl huddled in her front yard, she suppresses her misgivings and offers her sh", "An international sensation, Sofi Oksanen's award-winning novel ", " is a breathtakingly suspenseful tale of two women dogged by their own shameful pasts and the dark, unspoken history that binds them. ", "When Aliide Truu, an older woman living alone in the Estonian countryside, finds a disheveled girl huddled in her front yard, she suppresses her misgivings and offers her shelter. Zara is a young sex-trafficking victim on the run from her captors, but a photo she carries with her soon makes it clear that her arrival at Aliide's home is no coincidence. Survivors both, Aliide and Zara engage in a complex arithmetic of suspicion and revelation to distill each other's motives; gradually, their stories emerge, the culmination of a tragic family drama of rivalry, lust, and loss that played out during the worst years of Estonia's Soviet occupation. ", "Sofi Oksanen establishes herself as one the most important voices of her generation with this intricately woven tale, whose stakes are almost unbearably high from the first page to the last. ", " is a fiercely compelling and damning novel about the corrosive effects of shame, and of life in a time and place where to survive is to be implicated."], "author": "Sofi Oksanen", "num_pages": "390", "awards": ["Prix Femina for Étranger (2010)", "Nordisk Raads Litteraturpris (Nordic Council Literature Prize) (2010)", "Kalevi Jäntin palkinto (2008)", "European Book Prize for Fiction (2010)", "Finlandia Prize (2008)", "Varjo-Finlandia (2008)", "Runeberg-palkinto (2009)", "Prix du roman Fnac (2010)"], "places": ["Estonia"], "character_names": ["Aliide Truu", "Zara Pekk"], "language": "English", "publish_date": "2010-04-06 00:00:00", "ISBN": "0802170773"},
{"url": "https://www.goodreads.com/book/show/8980058-the-pillow-book-of-sei-shonagon", "num_ratings": "4,867", "num_reviews": "425", "avg_ratings": 4.02, "genres": ["Cultural", "Japan", "Classics", "Nonfiction", "Asian Literature", "Japanese Literature", "History"], "title": "The Pillow Book of Sei Shonagon: The Diary of a Courtesan in Tenth Century Japan", "description": ["Japan in the 10th century stood physically and culturally isolated from the rest of the world. Inside this bubble, a subtle and beautiful world was in operation, and its inhabitants were tied to the moment, having no interest in the future and disdain for the past.", " was a product of a tenth-century courtier's experiences in the palace of Empre", "Japan in the 10th century stood physically and culturally isolated from the rest of the world. Inside this bubble, a subtle and beautiful world was in operation, and its inhabitants were tied to the moment, having no interest in the future and disdain for the past.", " was a product of a tenth-century courtier's experiences in the palace of Empress Teishi. A common custom of the time period, courtiers used to keep notes or a diary in a wooden pillow with a drawer. This \"pillow book\" reflects the confident aesthetic judgments of Shonagon and her ability to create prose that crossed into the realm of the poetic. ", " is one of the earliest examples of diary literature whose passages chronicle the events of the court calendar, the ceremonies and celebrations specific to Teishi's court, and the vignettes that provide brilliantly drawn glimpses into the manners and foibles of the aristocracy.", "A contemporary of Murasaki Shikibu, the author of ", ", this small diary brings an added dimension to Murasaki's timeless and seminal work.", "Arthur Waley's elegant translation of ", " captures the beauty of its prose and the vitality of Shonagon's narrative voice, as well as her quirky personality traits. In a place and time where poetry was as important as knowledge and beauty was highly revered, Sei Shonagon's private writings give the reader a charming and intimate glimpse into a time of isolated innocence and pale beauty."], "author": "Sei Shōnagon", "num_pages": "127", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-10 00:00:00", "ISBN": "4805311088"},
{"url": "https://www.goodreads.com/book/show/762390.The_Hour_of_the_Star", "num_ratings": "10,902", "num_reviews": "864", "avg_ratings": 3.98, "genres": ["Fiction", "Cultural", "Brazil", "Classics"], "title": "The Hour of the Star", "description": [", Clarice Lispector's consummate final novel, may well be her masterpiece. Narrated by the cosmopolitan Rodrigo S.M., this brief, strange, and haunting tale is the story of Macabéa, one of life's unfortunates. Living in the slums of Rio and eking out a poor living as a typist, Macabéa loves movies, Coca-Cola, and her rat of a boyfriend; she would like t", ", Clarice Lispector's consummate final novel, may well be her masterpiece. Narrated by the cosmopolitan Rodrigo S.M., this brief, strange, and haunting tale is the story of Macabéa, one of life's unfortunates. Living in the slums of Rio and eking out a poor living as a typist, Macabéa loves movies, Coca-Cola, and her rat of a boyfriend; she would like to be like Marylin Monroe, but she is ugly, underfed, sickly, and unloved. Rodrigo recoils from her wretchedness, and yet he cannot avoid realization that for all her outward misery, Macabéa is inwardly free. She doesn't seem to know how unhappy she should be. Lispector employs her pathetic heroine against her urbane, empty narrator--edge of despair to edge of despair--and, working them like a pair of scissors, she cuts away the reader's preconceived notions about poverty, identity, love, and the art of fiction. In her last book she takes readers close to the true mystery of life and leaves us deep in Lispector territory indeed."], "author": "Clarice Lispector", "num_pages": "96", "awards": [], "places": ["Rio de Janeiro"], "character_names": [], "language": "English", "publish_date": "1992-02-17 00:00:00", "ISBN": "0811211908"},
{"url": "https://www.goodreads.com/book/show/822115.The_Complete_Poems_of_Anna_Akhmatova", "num_ratings": "6,394", "num_reviews": "72", "avg_ratings": 4.44, "genres": ["Poetry", "Cultural", "Russia", "Literature", "Russian Literature", "Classics"], "title": "The Complete Poems of Anna Akhmatova", "description": ["Initially published in 1990, when the New York Times Book Review named it one of fourteen \"Best Books of the Year,\" Judith Hemschemeyer's translation of The Complete Poems of Anna Akhmatova is the definitive edition, and has sold over 13,000 copies, making it one of the most successful poetry titles of recent years.", "This reissued and revised printing features a new biograph", "Initially published in 1990, when the New York Times Book Review named it one of fourteen \"Best Books of the Year,\" Judith Hemschemeyer's translation of The Complete Poems of Anna Akhmatova is the definitive edition, and has sold over 13,000 copies, making it one of the most successful poetry titles of recent years.", "This reissued and revised printing features a new biographical essay as well as expanded notes to the poems, both by Roberta Reeder, project editor and author of Anna Akhmatova: Poet and Prophet (St. Martin's Press, 1994). Encyclopedic in scope, with more than 800 poems, 100 photographs, a historical chronology, index of first lines, and bibliography. The Complete Poems will be the definitive English language collection of Akhmatova for many years to come."], "author": "Anna Akhmatova", "num_pages": "948", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-01 00:00:00", "ISBN": "0939010275"},
{"url": "https://www.goodreads.com/book/show/43944.Suite_Fran_aise", "num_ratings": "53,308", "num_reviews": "5,958", "avg_ratings": 3.82, "genres": ["Historical", "Historical Fiction", "Cultural", "France", "War", "World War II", "War", "Historical"], "title": "Suite Française", "description": ["By the early l940s, when Ukrainian-born Irène Némirovsky began working on what would become Suite Française—the first two parts of a planned five-part novel—she was already a highly successful writer liv", "By the early l940s, when Ukrainian-born Irène Némirovsky began working on what would become Suite Française—the first two parts of a planned five-part novel—she was already a highly successful writer living in Paris. But she was also a Jew, and in 1942 she was arrested and deported to Auschwitz: a month later she was dead at the age of thirty-nine. Two years earlier, living in a small village in central France—where she, her husband, and their two small daughters had fled in a vain attempt to elude the Nazis—she'd begun her novel, a luminous portrayal of a human drama in which she herself would become a victim. When she was arrested, she had completed two parts of the epic, the handwritten manuscripts of which were hidden in a suitcase that her daughters would take with them into hiding and eventually into freedom. Sixty-four years later, at long last, we can read Némirovsky's literary masterpiece ", "The first part, \"A Storm in June,\" opens in the chaos of the massive 1940 exodus from Paris on the eve of the Nazi invasion during which several families and individuals are thrown together under circumstances beyond their control. They share nothing but the harsh demands of survival—some trying to maintain lives of privilege, others struggling simply to preserve their lives—but soon, all together, they will be forced to face the awful exigencies of physical and emotional displacement, and the annihilation of the world they know. In the second part, \"Dolce,\" we enter the increasingly complex life of a German-occupied provincial village. Coexisting uneasily with the soldiers billeted among them, the villagers—from aristocrats to shopkeepers to peasants—cope as best they can. Some choose resistance, others collaboration, and as their community is transformed by these acts, the lives of these these men and women reveal nothing less than the very essence of humanity.", "Suite Française is a singularly piercing evocation—at once subtle and severe, deeply compassionate and fiercely ironic—of life and death in occupied France, and a brilliant, profoundly moving work of art."], "author": "Irène Némirovsky", "num_pages": "431", "awards": ["Magnesia Litera for Translation (Litera za překladovou knihu) (2012)", "Prix Renaudot (2004)", "PEN Translation Prize for Sandra Smith (2007)", "French-American Foundation Translation Prize for Fiction (2006)", "Jewish Quarterly-Wingate Prize Nominee (2007)"], "places": [], "character_names": ["Charlotte Péricand", "Hubert Péricand", "Philippe Péricand", "Gabriel Corte", "Charles Langelet", "Maurice Michaud", "Jeanne Michaud", "Jean-Marie Michaud", "Madeleine Sabarie"], "language": "English", "publish_date": "2007-04-10 00:00:00", "ISBN": "1400096278"},
{"url": "https://www.goodreads.com/book/show/14569052-purple-hibiscus", "num_ratings": "44,222", "num_reviews": "4,231", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili and her older brother Jaja lead a privileged life in Enugu, Nigeria. They live in a beautiful house, with a caring family, and attend an exclusive missionary school. They're completely shielded from the troubles of the world. Yet, as Kambili reveals in her tender-voiced account, things are less perfect than they appear. Although her Papa is generou", "Fifteen-year-old Kambili and her older brother Jaja lead a privileged life in Enugu, Nigeria. They live in a beautiful house, with a caring family, and attend an exclusive missionary school. They're completely shielded from the troubles of the world. Yet, as Kambili reveals in her tender-voiced account, things are less perfect than they appear. Although her Papa is generous and well respected, he is fanatically religious and tyrannical at home—a home that is silent and suffocating.", " As the country begins to fall apart under a military coup, Kambili and Jaja are sent to their aunt, a university professor outside the city, where they discover a life beyond the confines of their father’s authority. Books cram the shelves, curry and nutmeg permeate the air, and their cousins’ laughter rings throughout the house. When they return home, tensions within the family escalate, and Kambili must find the strength to keep her loved ones together.", " is an exquisite novel about the emotional turmoil of adolescence, the powerful bonds of family, and the bright promise of freedom."], "author": "Chimamanda Ngozi Adichie", "num_pages": "336", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2012-04-17 00:00:00", "ISBN": "1616202416"},
{"url": "https://www.goodreads.com/book/show/164006.Memoirs_of_a_Dutiful_Daughter", "num_ratings": "7,056", "num_reviews": "565", "avg_ratings": 4.11, "genres": ["Nonfiction", "Biography", "Feminism", "Autobiography", "Memoir", "Cultural", "France"], "title": "Memoirs of a Dutiful Daughter", "description": ["A superb autobiography by one of the great literary figures of the twentieth century, Simone de Beauvoir's Memoirs of a Dutiful Daughter offers an intimate picture of growing up in a bourgeois French family, rebelling as an adolescent against the conventional expectations of her class, and striking out on her own with an intellectual and existential ambition exceedingly ra", "A superb autobiography by one of the great literary figures of the twentieth century, Simone de Beauvoir's Memoirs of a Dutiful Daughter offers an intimate picture of growing up in a bourgeois French family, rebelling as an adolescent against the conventional expectations of her class, and striking out on her own with an intellectual and existential ambition exceedingly rare in a young woman in the 1920s.", "She vividly evokes her friendships, love interests, mentors, and the early days of the most important relationship of her life, with fellow student Jean-Paul Sartre, against the backdrop of a turbulent political time."], "author": "Simone de Beauvoir", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "0060825197"},
{"url": "https://www.goodreads.com/book/show/171091.Poems_of_Akhmatova", "num_ratings": "957", "num_reviews": "69", "avg_ratings": 4.32, "genres": ["Poetry", "Cultural", "Russia", "Literature", "Russian Literature"], "title": "Poems of Akhmatova", "description": ["In her finely crafted translations Coffin has been uniquely successful in reproducing the directness and striking effects characteristic of Akhmatova's poetry, and she is the first to remain true to Akhmatova's rhyme and cadence. The poems are prefaced by a thoughful introduction by the poet Joseph Brodsky, a friend of Akhmatova in her later years."], "author": "Anna Akhmatova", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-05-30 00:00:00", "ISBN": "0395860032"},
{"url": "https://www.goodreads.com/book/show/19302.Pippi_Longstocking", "num_ratings": "141,816", "num_reviews": "2,978", "avg_ratings": 4.12, "genres": ["Childrens", "Classics", "Fiction"], "title": "Pippi Longstocking", "description": ["Tommy and his sister Annika have a new neighbor, and her name is Pippi Longstocking. She has crazy red pigtails, no parents to tell her what to do, a horse that lives on her porch, and a flair for the outrageous that seems to lead to one adventure after another!", "--back cover"], "author": "Astrid Lindgren", "num_pages": "160", "awards": ["Lewis Carroll Shelf Award (1973)"], "places": ["Sweden"], "character_names": ["Tommy Settergren", "Pippi Långstrump", "Annika Gannec", "Mrs. Settergren", "Mr. Nilsson the monkey"], "language": "English", "publish_date": "2005-04-21 00:00:00", "ISBN": "0142402494"},
{"url": "https://www.goodreads.com/book/show/111050.July_s_People", "num_ratings": "5,468", "num_reviews": "433", "avg_ratings": 3.54, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Historical", "Historical Fiction", "Novels"], "title": "July's People", "description": ["For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable lo", "For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable look into the terrifying, tacit understandings and misunderstandings between blacks and whites."], "author": "Nadine Gordimer", "num_pages": "160", "awards": ["Premio Grinzane Cavour Nominee for Narrativa Straniera (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "1982-07-29 00:00:00", "ISBN": "0140061401"},
{"url": "https://www.goodreads.com/book/show/11206.In_the_Time_of_the_Butterflies", "num_ratings": "47,144", "num_reviews": "3,437", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Fiction"], "title": "In the Time of the Butterflies", "description": ["Set during the waning days of the Trujillo dictatorship in the Dominican Republic in 1960, this extraordinary novel tells the story of the Mirabal sisters, three young wives and mothers who are assassinated after visiting their jailed husbands. ", "From the author of ", " comes this tale of courage and sisterhood set in the Dominican Republic", "Set during the waning days of the Trujillo dictatorship in the Dominican Republic in 1960, this extraordinary novel tells the story of the Mirabal sisters, three young wives and mothers who are assassinated after visiting their jailed husbands. ", "From the author of ", " comes this tale of courage and sisterhood set in the Dominican Republic during the rise of the Trujillo dictatorship. A skillful blend of fact and fiction, ", " is inspired by the true story of the three Mirabal sisters who, in 1960, were murdered for their part in an underground plot to overthrow the government. Alvarez breathes life into these historical figures--known as \"las mariposas,\" or \"the butterflies,\" in the underground--as she imagines their teenage years, their gradual involvement with the revolution, and their terror as their dissentience is uncovered. ", " Alvarez's controlled writing perfectly captures the mounting tension as \"the butterflies\" near their horrific end. The novel begins with the recollections of Dede, the fourth and surviving sister, who fears abandoning her routines and her husband to join the movement. Alvarez also offers the perspectives of the other sisters: brave and outspoken Minerva, the family's political ringleader; pious Patria, who forsakes her faith to join her sisters after witnessing the atrocities of the tyranny; and the baby sister, sensitive Maria Teresa, who, in a series of diaries, chronicles her allegiance to Minerva and the physical and spiritual anguish of prison life. ", " is an American Library Association Notable Book and a 1995 National Book Critics Circle Award nominee."], "author": "Julia Alvarez", "num_pages": "324", "awards": ["National Book Critics Circle Award Nominee for Fiction (1994)"], "places": ["Dominican Republic"], "character_names": ["Patria Mirabal de Gonzalez", "Minerva Mirabal de Tavarez", "Maria Teresa Mirabal de Guzman", "Bélgica Adela Mirabal de Reyes"], "language": "English", "publish_date": "1995-08-16 00:00:00", "ISBN": "0452274427"},
{"url": "https://www.goodreads.com/book/show/6217.Kristin_Lavransdatter", "num_ratings": "7,062", "num_reviews": "921", "avg_ratings": 4.28, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Historical", "European Literature", "Scandinavian Literature"], "title": "Kristin Lavransdatter", "description": ["In her great historical epic ", ", set in fourteenth-century Norway, Nobel laureate Sigrid Undset tells the life story of one passionate and headstrong woman. Painting a richly detailed backdrop, Undset immerses readers in the day-to-day life, social conventions, and political and religious undercurrents of the period. Now in one volume, Tiina Nunnally's a", "In her great historical epic ", ", set in fourteenth-century Norway, Nobel laureate Sigrid Undset tells the life story of one passionate and headstrong woman. Painting a richly detailed backdrop, Undset immerses readers in the day-to-day life, social conventions, and political and religious undercurrents of the period. Now in one volume, Tiina Nunnally's award-winning definitive translation brings this remarkable work to life with clarity and lyrical beauty. "], "author": "Sigrid Undset", "num_pages": "1144", "awards": ["PEN Translation Prize for Tiina Nunnally (2001)"], "places": ["Norway"], "character_names": ["Kristin Lavransdattar"], "language": "English", "publish_date": "2005-09-27 00:00:00", "ISBN": "0143039164"},
{"url": "https://www.goodreads.com/book/show/159604.Woman_at_Point_Zero", "num_ratings": "7,188", "num_reviews": "1,005", "avg_ratings": 3.99, "genres": ["Feminism", "Fiction", "Northern Africa", "Egypt", "Cultural", "Africa"], "title": "Woman at Point Zero", "description": ["From her prison cell, Firdaus, sentenced to die for having killed a pimp in a Cairo street, tells of her life from village childhood to city prostitute. Society's retribution for her act of defiance - death - she welcomes as the only way she can finally be free."], "author": "Nawal El-Saadawi", "num_pages": "112", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1997-09-15 00:00:00", "ISBN": "0862321107"},
{"url": "https://www.goodreads.com/book/show/11093751-mr-fox", "num_ratings": "6,956", "num_reviews": "1,169", "avg_ratings": 3.59, "genres": ["Fiction", "Magical Realism", "Fantasy", "Literary Fiction", "Contemporary"], "title": "Mr. Fox", "description": ["Fairy-tale romances end with a wedding, and the fairy tales don't get complicated. In this book, the celebrated writer Mr. Fox can't stop himself from killing off the heroines of his novels, and neither can his wife, Daphne. It's not until Mary, his muse, comes to life and tra", "Fairy-tale romances end with a wedding, and the fairy tales don't get complicated. In this book, the celebrated writer Mr. Fox can't stop himself from killing off the heroines of his novels, and neither can his wife, Daphne. It's not until Mary, his muse, comes to life and transforms him from author into subject that his story begins to unfold differently.", "Mary challenges Mr. Fox to join her in stories of their own devising; and in different times and places, the two of them seek each other, find each other, thwart each other, and try to stay together, even when the roles they inhabit seem to forbid it. Their adventures twist the fairy tale into nine variations, exploding and teasing conventions of genre and romance, and each iteration explores the fears that come with accepting a lifelong bond. Meanwhile, Daphne becomes convinced that her husband is having an affair, and finds her way into Mary and Mr. Fox's game. And so Mr. Fox is offered a choice: Will it be a life with the girl of his dreams, or a life with an all-too-real woman who delights him more than he cares to admit?", "The extraordinarily gifted Helen Oyeyemi has written a love story like no other. ", " is a magical book, endlessly inventive, as witty and charming as it is profound in its truths about how we learn to be with one another."], "author": "Helen Oyeyemi", "num_pages": "325", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2011)", "Hurston/Wright Legacy Award for Fiction (2012)"], "places": ["New York City, New York"], "character_names": ["St John Fox", "Daphne Fox", "Mary Foxe"], "language": "English", "publish_date": "2011-09-29 00:00:00", "ISBN": "159448807X"},
{"url": "https://www.goodreads.com/book/show/8745.Desert_Flower", "num_ratings": "14,623", "num_reviews": "911", "avg_ratings": 4.11, "genres": ["Nonfiction", "Biography", "Cultural", "Africa", "Autobiography", "Memoir", "Biography", "Autobiography", "Feminism", "Eastern Africa", "Somalia", "Biography Memoir", "Womens", "Contemporary"], "title": "Desert Flower", "description": ["Waris Dirie ran away from her oppressive life in the African desert when she was barely in her teens, illiterate and impoverished, with nothing to her name but a tattered shawl. She traveled alone across the dangerous Somali desert to Mogadishu—the first leg of a remarkable journey that would take her to London, where she worked as a house servant; then to nearly every cor", "Waris Dirie ran away from her oppressive life in the African desert when she was barely in her teens, illiterate and impoverished, with nothing to her name but a tattered shawl. She traveled alone across the dangerous Somali desert to Mogadishu—the first leg of a remarkable journey that would take her to London, where she worked as a house servant; then to nearly every corner of the globe as an internationally renowned fashion model; and ultimately to New York City, where she became a human rights ambassador for the U.N. ", " is her extraordinary story."], "author": "Waris Dirie", "num_pages": "240", "awards": ["Corine Internationaler Buchpreis for Sachbuch (2002)"], "places": ["Mogadishu"], "character_names": [], "language": "English", "publish_date": "2011-03-15 00:00:00", "ISBN": "0688172377"},
{"url": "https://www.goodreads.com/book/show/1225688.The_Women_s_Decameron", "num_ratings": "207", "num_reviews": "25", "avg_ratings": 3.94, "genres": ["Short Stories", "Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Literature", "Womens"], "title": "The Women's Decameron", "description": ["Like Boccacio's famous Florentines, Julia Voznesenskaya's Russian women are cunning and savvy—about all facets of the Soviet system. They know how to beat it and how to endure. Quarantined in a Leningrad maternity ward after giving birth, ten women from all walks of Soviet life amuse themselves by telling stories—stories that provide an astonishingly intimate and dramatic", "Like Boccacio's famous Florentines, Julia Voznesenskaya's Russian women are cunning and savvy—about all facets of the Soviet system. They know how to beat it and how to endure. Quarantined in a Leningrad maternity ward after giving birth, ten women from all walks of Soviet life amuse themselves by telling stories—stories that provide an astonishingly intimate and dramatic insight into the lives of Russia today.", "The women recount one hundred stories—one story told each day by each of the ten women for ten days—on such themes as love, jealousy, infidelity, seduction, farcical sex, money, revenge, and finally, happiness. Beneath their gossip runs the stark reality of a society torn apart by suicide, divorce, and alcoholism; by the difficulties of finding food and a place to live; by the threat of harrowing imprisonment. Voznesenskaya writes vividly about everyday Soviet life as well as politics, and her revealing book conveys a passionate belief in the spiritual strength of the Russian woman, to which readers everywhere will respond with sympathy and shocks of recognition."], "author": "Julia Voznesenskaya", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1986-08-16 00:00:00", "ISBN": "0704325551"},
{"url": "https://www.goodreads.com/book/show/2050213.The_Appointment", "num_ratings": "2,466", "num_reviews": "375", "avg_ratings": 3.41, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Romania", "European Literature", "German Literature", "Literature"], "title": "The Appointment", "author": "Herta Müller", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-09-13 00:00:00", "ISBN": "080506012X"},
{"url": "https://www.goodreads.com/book/show/16005704-the-murder-of-halland", "num_ratings": "478", "num_reviews": "81", "avg_ratings": 3.26, "genres": ["Fiction", "Mystery", "Cultural", "Denmark", "Mystery", "Crime", "European Literature", "Danish", "Novels"], "title": "The Murder of Halland", "description": ["Bess and Halland live in a small town, where everyone knows everyone else. When Halland is found murdered in the main square the police encounter only riddles. For Bess bereavement marks the start of a journey that leads her to a reassessment of first friends, then family."], "author": "Pia Juul", "num_pages": "189", "awards": ["Independent Foreign Fiction Prize Nominee for Longlist (2013)", "Danske Banks Litteraturpris (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-15 00:00:00", "ISBN": "1908670053"},
{"url": "https://www.goodreads.com/book/show/1412847.Die_Apothekerin", "num_ratings": "856", "num_reviews": "26", "avg_ratings": 3.72, "genres": ["European Literature", "German Literature", "Fiction", "Mystery", "Crime", "Mystery"], "title": "Die Apothekerin", "description": [" Genial ist der Mord schon, den Ingrid Noll in ihrem Roman ", " verüben lässt. Das Gift wird einem Herzkranken in sein Gebiss geschmuggelt, ein Zahn wird damit präpariert und die nächste Mahlzeit ist absolut tödlich. Der Hausarzt merkt nichts und der fröhlichen Erbschaft steht nichts mehr im Wege.", " Genial ist der Mord schon, den Ingrid Noll in ihrem Roman ", " verüben lässt. Das Gift wird einem Herzkranken in sein Gebiss geschmuggelt, ein Zahn wird damit präpariert und die nächste Mahlzeit ist absolut tödlich. Der Hausarzt merkt nichts und der fröhlichen Erbschaft steht nichts mehr im Wege."], "author": "Ingrid Noll", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1994-08-28 00:00:00", "ISBN": "3257060173"},
{"url": "https://www.goodreads.com/book/show/65714.Kallocain", "num_ratings": "3,853", "num_reviews": "219", "avg_ratings": 3.8, "genres": ["Classics", "Science Fiction", "Dystopia", "Science Fiction", "European Literature", "Swedish Literature", "Fiction"], "title": "Kallocain", "description": ["This is a novel of the future, profoundly sinister in its vision of a drab terror. Ironic and detached, the author shows us the totalitarian World-state through the eyes of a product of that state, scientist Leo Kall. Kall has invented a drug, kallocain, which denies the privacy of thought and is the final step towards the transmutation of the individual human being into a", "This is a novel of the future, profoundly sinister in its vision of a drab terror. Ironic and detached, the author shows us the totalitarian World-state through the eyes of a product of that state, scientist Leo Kall. Kall has invented a drug, kallocain, which denies the privacy of thought and is the final step towards the transmutation of the individual human being into a \"happy, healthy cell in the state organism.\" For, says Leo, \"from thoughts and feelings, words and actions are born. How then could these thoughts and feelings belong to the individual? Doesn't the whole fellow-soldier belong to the state? To whom should his thoughts and feelings belong then, if not to the state?\"", "As the first-person record of Leo Kall, scientist, fellow-soldier too late disillusioned to undo his previous actions, Kallocain achieves a chilling power and veracity that place it among the finest novels to emerge from the strife-torn Europe of the twentieth century."], "author": "Karin Boye", "num_pages": "193", "awards": ["Hugo Award Nominee for Best Novel (Retro 1941) (2016)"], "places": [], "character_names": ["Leo Kall"], "language": "English", "publish_date": "2002-04-02 00:00:00", "ISBN": "0299038947"},
{"url": "https://www.goodreads.com/book/show/99089.La_B_tarde", "num_ratings": "544", "num_reviews": "49", "avg_ratings": 4.15, "genres": ["Cultural", "France", "Fiction", "Lgbt", "Glbt", "Queer", "European Literature", "French Literature"], "title": "La Bâtarde", "description": ["An obsessive and revealing self-portrait of a remarkable woman humiliated by the circumstances of her birth and by her physical appearance, ", " relates Violette Leduc's long search for her own identity through a series of agonizing and passionate love affairs with both men and women. When first published, ", " earned Violette Leduc comparisons to Jean Genet fo", "An obsessive and revealing self-portrait of a remarkable woman humiliated by the circumstances of her birth and by her physical appearance, ", " relates Violette Leduc's long search for her own identity through a series of agonizing and passionate love affairs with both men and women. When first published, ", " earned Violette Leduc comparisons to Jean Genet for the frank depiction of her sexual escapades and immoral behavior. A confession that contains portraits of several famous French authors, this book is more than just a scintillating memoir. Like that of Henry Miller, Leduc's brilliant writing style and attention to language transform this autobiography into a work of art."], "author": "Violette Leduc", "num_pages": "488", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-07-01 00:00:00", "ISBN": "1564782891"},
{"url": "https://www.goodreads.com/book/show/17883925-dust", "num_ratings": "795", "num_reviews": "180", "avg_ratings": 3.76, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Kenya", "Historical", "Historical Fiction", "Literature", "African Literature", "Contemporary"], "title": "Dust", "description": ["From a breathtaking new voice, a novel about a splintered family in Kenya—a story of power and deceit, unrequited love, survival and sacrifice.", " Odidi Oganda, running for his life, is gunned down in the streets of Nairobi. His grief-stricken sister, Ajany, just returned from Brazil, and their father bring his body back to their crumbling home in the Kenyan drylands, seeking", "From a breathtaking new voice, a novel about a splintered family in Kenya—a story of power and deceit, unrequited love, survival and sacrifice.", " Odidi Oganda, running for his life, is gunned down in the streets of Nairobi. His grief-stricken sister, Ajany, just returned from Brazil, and their father bring his body back to their crumbling home in the Kenyan drylands, seeking some comfort and peace. But the murder has stirred memories long left untouched and unleashed a series of unexpected events: Odidi and Ajany’s mercurial mother flees in a fit of rage; a young Englishman arrives at the Ogandas’ house, seeking his missing father; a hardened policeman who has borne witness to unspeakable acts reopens a cold case; and an all-seeing Trader with a murky identity plots an overdue revenge. In scenes stretching from the violent upheaval of contemporary Kenya back through a shocking political assassination in 1969 and the Mau Mau uprisings against British colonial rule in the 1950s, we come to learn the secrets held by this parched landscape, buried deep within the shared past of the family and of a conflicted nation. ", " Here is a spellbinding novel about a brother and sister who have lost their way; about how myths come to pass, history is written, and war stains us forever."], "author": "Yvonne Adhiambo Owuor", "num_pages": "369", "awards": ["Folio Prize Nominee (2015)"], "places": ["Kenya"], "character_names": [], "language": "English", "publish_date": "2014-01-28 00:00:00", "ISBN": "0307961206"},
{"url": "https://www.goodreads.com/book/show/348632.The_Blood_of_Flowers", "num_ratings": "14,574", "num_reviews": "1,735", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "Iran"], "title": "The Blood of Flowers", "description": ["In the fabled city of Isfahan, in seventeenth-century Persia, a young woman confronts a dismal fate: Her beloved father had died and left her without a dowry. Forced to work as a servant in the home of her uncle, a rich rug designer in the court of the Shah, the young woman blossoms as a brilliant designer of carpets. But while her talent flourishes, her prospects for a ha", "In the fabled city of Isfahan, in seventeenth-century Persia, a young woman confronts a dismal fate: Her beloved father had died and left her without a dowry. Forced to work as a servant in the home of her uncle, a rich rug designer in the court of the Shah, the young woman blossoms as a brilliant designer of carpets. But while her talent flourishes, her prospects for a happy marriage grow dim, and she finds herself faced with a daunting decision--to forsake her own dignity or to risk everything in an effort to maintain it.", "Both a sweeping love story and a luminous portrait of a city, THE BLOOD OF FLOWERS is the mesmerizing historical novel of an ill-fated young woman whose gift as a rug designer transforms her life. Illuminated with glorious detail of Persian rug-making, and brilliantly bringing to life the sights sounds and life of 17th-century Isfahan, THE BLOOD OF FLOWERS has captured readers' imaginations everywhere as a timeless tale of one woman's struggle to live a life of her choosing."], "author": "Anita Amirrezvani", "num_pages": "368", "awards": ["Orange Prize Nominee for Fiction Longlist (2008)"], "places": ["Isfahan", "Persia", "Iran, Islamic Republic of"], "character_names": [], "language": "English", "publish_date": "2007-06-05 00:00:00", "ISBN": "0316065765"},
{"url": "https://www.goodreads.com/book/show/8965997-lyrics-alley", "num_ratings": "1,071", "num_reviews": "188", "avg_ratings": 3.69, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Northern Africa", "Sudan", "Northern Africa", "Egypt", "Literature", "African Literature"], "title": "Lyrics Alley", "description": [" is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades. ", "Their fortune threatened by shifting powers in Sudan and their heir's debilitating accident, a powerful family under the leadership of Mahmoud Bey is torn between the traditional and mode", " is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades. ", "Their fortune threatened by shifting powers in Sudan and their heir's debilitating accident, a powerful family under the leadership of Mahmoud Bey is torn between the traditional and modern values of Mahmoud's two wives and his son's efforts to break with cultural limits."], "author": "Leila Aboulela", "num_pages": "310", "awards": ["Orange Prize Nominee for Fiction Longlist (2011)", "Scottish Trust Book Award for Fiction"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "0802119514"},
{"url": "https://www.goodreads.com/book/show/18465930-last-words-from-montmartre", "num_ratings": "527", "num_reviews": "83", "avg_ratings": 3.8, "genres": ["Fiction", "Lgbt", "Glbt", "Queer"], "title": "Last Words from Montmartre", "description": ["When the pioneering Taiwanese novelist Qiu Miaojin committed suicide in 1995 at age twenty-six, she left behind her unpublished masterpiece, ", ". Unfolding through a series of letters written by an unnamed narrator, ", " tells the story of a passionate relationship between two young women—their sexual awakening, their gradual breakup, and the d", "When the pioneering Taiwanese novelist Qiu Miaojin committed suicide in 1995 at age twenty-six, she left behind her unpublished masterpiece, ", ". Unfolding through a series of letters written by an unnamed narrator, ", " tells the story of a passionate relationship between two young women—their sexual awakening, their gradual breakup, and the devastating aftermath of their broken love. In a style that veers between extremes, from self-deprecation to pathos, compulsive repetition to rhapsodic musings, reticence to vulnerability, Qiu’s genre-bending novel is at once a psychological thriller, a sublime romance, and the author’s own suicide note.", "The letters (which, Qiu tells us, can be read in any order) leap between Paris, Taipei, and Tokyo. They display wrenching insights into what it means to live between cultures, languages, and genders—until the genderless character Zoë appears, and the narrator’s spiritual and physical identity is transformed. As powerfully raw and transcendent as Mishima’s ", ", Goethe’s ", ", and Theresa Cha’s ", ", to name but a few,", " proves Qiu Miaojin to be one of the finest experimentalists and modernist Chinese-language writers of our generation."], "author": "Qiu Miaojin", "num_pages": "161", "awards": ["BTBA Best Translated Book Award Nominee for Fiction Longlist (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-03 00:00:00", "ISBN": "1590177258"},
{"url": "https://www.goodreads.com/book/show/31115.The_Farming_of_Bones", "num_ratings": "6,668", "num_reviews": "630", "avg_ratings": 4.07, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels"], "title": "The Farming of Bones", "description": [" begins in 1937 in a village on the Dominican side of the river that separates the country from Haiti. Amabelle Desir, Haitian-born and a faithful maidservant to the Dominican family that took her in when she was orphaned, and her lover Sebastien, an itinerant sugarcane cutter, decide they will marry and return to Haiti at the end of the cane season. Ho", " begins in 1937 in a village on the Dominican side of the river that separates the country from Haiti. Amabelle Desir, Haitian-born and a faithful maidservant to the Dominican family that took her in when she was orphaned, and her lover Sebastien, an itinerant sugarcane cutter, decide they will marry and return to Haiti at the end of the cane season. However, hostilities toward Haitian laborers find a vitriolic spokesman in the ultra-nationalist Generalissimo Trujillo who calls for an ethnic cleansing of his Spanish-speaking country. As rumors of Haitian persecution become fact, as anxiety turns to terror, Amabelle and Sebastien's dreams are leveled to the most basic human desire: to endure. Based on a little-known historical event, this extraordinarily moving novel memorializes the forgotten victims of nationalist madness and the deeply felt passion and grief of its survivors."], "author": "Edwidge Danticat", "num_pages": "312", "awards": ["American Book Award (1999)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-09-01 00:00:00", "ISBN": "0140280499"},
{"url": "https://www.goodreads.com/book/show/67859.G_sta_Berling_s_Saga", "num_ratings": "2,524", "num_reviews": "139", "avg_ratings": 3.71, "genres": ["Classics", "Fiction", "European Literature", "Swedish Literature", "Cultural", "Sweden", "European Literature", "Scandinavian Literature"], "title": "Gösta Berling's Saga", "description": ["The first woman to receive the Nobel Prize for literature, Lagerlöf assured her place in Swedish letters with this 1891 novel. The eponymous hero, a country pastor whose appetite for alcohol and indiscretions ends his career, falls in with a dozen vagrant Swedish cavaliers and enters into a power struggle with the richest woman in the province.", "The book has a Faustian theme", "The first woman to receive the Nobel Prize for literature, Lagerlöf assured her place in Swedish letters with this 1891 novel. The eponymous hero, a country pastor whose appetite for alcohol and indiscretions ends his career, falls in with a dozen vagrant Swedish cavaliers and enters into a power struggle with the richest woman in the province.", "The book has a Faustian theme revolving around a possible deal with the Devil. It also deals with social issues such as poverty and depression, as well as mixing in elements of myths and humorous love stories."], "author": "Selma Lagerlöf", "num_pages": "368", "awards": [], "places": [], "character_names": ["Gösta Berling", "Margareta Samzelius", "Sintram på Fors", "Marianne Sinclaire"], "language": "English", "publish_date": "2004-06-18 00:00:00", "ISBN": "0486433870"},
{"url": "https://www.goodreads.com/book/show/474968.The_Bridge_of_Beyond", "num_ratings": "433", "num_reviews": "59", "avg_ratings": 4.15, "genres": ["Fiction", "Cultural", "France", "Historical", "Historical Fiction"], "title": "The Bridge of Beyond", "description": ["Tells of the survival power of the women of Guadeloupe who live in conditions of extreme poverty and deprivation and yet are filled with courage and love for life."], "author": "Simone Schwarz-Bart", "num_pages": "174", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1982-01-01 00:00:00", "ISBN": "0435987704"},
{"url": "https://www.goodreads.com/book/show/8638226-visitation", "num_ratings": "1,544", "num_reviews": "275", "avg_ratings": 3.79, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Germany", "European Literature", "German Literature", "Historical", "Contemporary"], "title": "Visitation", "description": ["A house on the forested bank of a Brandenburg lake outside Berlin (once belonging to Erpenbeck’s grandparents) is the focus of this compact, beautiful novel. Encompassing over one hundred years of German history, from the nineteenth century to the Weimar Republic, from World War II to the Socialist German Democratic Republic, and finally reunification and its aftermath, ", "A house on the forested bank of a Brandenburg lake outside Berlin (once belonging to Erpenbeck’s grandparents) is the focus of this compact, beautiful novel. Encompassing over one hundred years of German history, from the nineteenth century to the Weimar Republic, from World War II to the Socialist German Democratic Republic, and finally reunification and its aftermath, ", " offers the life stories of twelve individuals who seek to make their home in this one magical little house. The novel breaks into the everyday life of the house and shimmers through it, while relating the passions and fates of its inhabitants. Elegant and poetic, ", " forms a literary mosaic of the last century, tearing open wounds and offering moments of reconciliation, with its drama and its exquisite evocation of a landscape no political upheaval can truly change."], "author": "Jenny Erpenbeck", "num_pages": "151", "awards": ["BTBA Best Translated Book Award Nominee for Fiction shortlist (2011)", "Independent Foreign Fiction Prize Nominee (2011)", "Angelus Nominee for Shortlist (2011)", "Preis der Leipziger Buchmesse Nominee for Belletristik (2008)", "Jewish Quarterly-Wingate Prize Nominee (2011)", "Literaturpreis der Jury der jungen Leser for Cover (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-30 00:00:00", "ISBN": "081121835X"},
{"url": "https://www.goodreads.com/book/show/15857983-the-goddess-chronicle", "num_ratings": "1,622", "num_reviews": "237", "avg_ratings": 3.65, "genres": ["Fantasy", "Fiction", "Cultural", "Japan", "Fantasy", "Mythology", "Asian Literature", "Japanese Literature"], "title": "The Goddess Chronicle", "description": [" ", "Two sisters, Namima and Kamiku, born to the family of the oracle, are separated as children. Kamiku begins her training to become the next oracle, while Namima becomes Priestess of the Night. ", "The Goddess Chronicle—a retelling of the ancient Japanese myth of Izanami and Izan", " ", "Two sisters, Namima and Kamiku, born to the family of the oracle, are separated as children. Kamiku begins her training to become the next oracle, while Namima becomes Priestess of the Night. ", "The Goddess Chronicle—a retelling of the ancient Japanese myth of Izanami and Izanagi—pulls the reader deep into the realm of the undead. ", "Japanese crime queen Natsuo Kirino’s dark, twisted tale is a fantastical, fabulous tour-de-force. It is a dazzling story of sex, death, gods and revenge that will draw the reader in and won’t let go until the exhilarating end."], "author": "Natsuo Kirino", "num_pages": "309", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-03 00:00:00", "ISBN": "1847673023"},
{"url": "https://www.goodreads.com/book/show/7945052-hygiene-and-the-assassin", "num_ratings": "8,014", "num_reviews": "632", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "France", "Contemporary", "Novels", "European Literature", "French Literature"], "title": "Hygiene and the Assassin", "description": ["Prétextat Tach, Nobel Prize winner and one of the world's most renowned novelists, has two months to live. He has been in seclusion for years, refusing interviews and public appearances. But as news of his impending death becomes public, intrepid journalists from around the globe flock to his home in pursuit of an interview with the elusive author. One after the other they", "Prétextat Tach, Nobel Prize winner and one of the world's most renowned novelists, has two months to live. He has been in seclusion for years, refusing interviews and public appearances. But as news of his impending death becomes public, intrepid journalists from around the globe flock to his home in pursuit of an interview with the elusive author. One after the other they discover that, far from being the literary luminary they imagined, Tach has become an obese misogynist, a petulant bigot, an embittered, disgusting madman. The world's most famous author turns out to be the worst misanthrope imaginable.", "But Nina, the final journalist and the only female to interview Tach, calls the celebrated author's bluff and beats him at his own game. Her questions and the author's biting responses fly in a triumph of brilliant repartee, and Tach is led to a definitive confrontation with his past, while Nina discovers that in love nothing is ever as straightforward as it seems.", "Amélie Nothomb is one of Europe's most successful and controversial authors. She wrote ", ", her first published novel, when she was only twenty-five, and it became an instant bestseller across Europe. Winner of the Fournier and René-Fallet prizes, ", " is now published in English for the first time."], "author": "Amélie Nothomb", "num_pages": "167", "awards": ["BTBA Best Translated Book Award Nominee for Fiction longlist (2011)", "Prix Alain-Fournier (1993)", "Prix René Fallet (1993)"], "places": [], "character_names": ["Prétextat Tach"], "language": "English", "publish_date": "2010-10-26 00:00:00", "ISBN": "193337277X"},
{"url": "https://www.goodreads.com/book/show/7468920-lust", "num_ratings": "1,084", "num_reviews": "91", "avg_ratings": 3.3, "genres": ["Fiction", "Feminism", "European Literature", "German Literature", "Novels"], "title": "Lust", "description": ["In a quaint Austrian ski resort, things are not quite what they seem. Hermann, the manager of a paper mill, has decided that sexual gratification begins at home. Which means Gerti - his wife and property. Gerti is not asked how she feels about the use Hermann puts her to. She is a receptacle into which Hermann pours his juices, nastily, briefly, brutally. The long-sufferin", "In a quaint Austrian ski resort, things are not quite what they seem. Hermann, the manager of a paper mill, has decided that sexual gratification begins at home. Which means Gerti - his wife and property. Gerti is not asked how she feels about the use Hermann puts her to. She is a receptacle into which Hermann pours his juices, nastily, briefly, brutally. The long-suffering and battered Gerti thinks she has found her saviour and love in Michael, a student who rescues her after a day of vigorous use by her husband. But Michael is on his way up the Austrian political ladder, and he is, after all, a man. In Elfriede Jelinek's mitteleuropa, love is as distant from sex as the Alps are from the sea, and the everyday mechanics of husband, wife, and child become a loveless horror. Both a condemnation of the myth of romantic love and an angry defence of women's sexuality, Lust is pornography for pessimists. A bestseller throughout Europe, Lust confirms Elfriede Jelinek as the most challenging writer - female or male - in Europe today. It is a dark, dazzling performance."], "author": "Elfriede Jelinek", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1993-04-28 00:00:00", "ISBN": "1615549501"},
{"url": "https://www.goodreads.com/book/show/19312.The_Brothers_Lionheart", "num_ratings": "23,585", "num_reviews": "714", "avg_ratings": 4.36, "genres": ["Fantasy", "Childrens", "Classics", "Fiction"], "title": "The Brothers Lionheart", "description": ["The Brothers Lionheart (Swedish: Bröderna Lejonhjärta) is a children's fantasy novel written by Astrid Lindgren. It was published in the autumn of 1973 and has been translated into 46 languages. Many of its themes are unusually dark and heavy for the children's book genre. Disease, death, tyranny, betrayal and rebellion are some of the dark themes that permeate the story.", "The Brothers Lionheart (Swedish: Bröderna Lejonhjärta) is a children's fantasy novel written by Astrid Lindgren. It was published in the autumn of 1973 and has been translated into 46 languages. Many of its themes are unusually dark and heavy for the children's book genre. Disease, death, tyranny, betrayal and rebellion are some of the dark themes that permeate the story. The lighter themes of the book involve platonic love, loyalty, hope, courage and pacifism.", "The two main characters are two brothers; the older Jonatan and the younger Karl. The two brothers' surname was originally Lion, but they are generally known as Lionheart. Karl's nickname is Skorpan (Rusky) since Jonatan likes these typical Swedish toasts or crusts.", "In Nangijala, a land in \"the campfires and storytelling days\", the brothers experience adventures. Together with a resistance group they lead the struggle against the evil Tengil, who rules with the aid of the fearsome fire-breathing dragon, Katla."], "author": "Astrid Lindgren", "num_pages": "231", "awards": ["Zilveren Griffel (1975)", "Wilhelm-Hauff-Preis (1979)", "Międzynarodowa Nagroda Literacka im. Janusza Korczaka (1979)", "Premio Bancarelino (1978)"], "places": ["Nangijala"], "character_names": ["Sofia", "Karl Lionheart", "Jonatan Lionheart"], "language": "English", "publish_date": "2004-12-31 00:00:00", "ISBN": "1930900244"},
{"url": "https://www.goodreads.com/book/show/5730888-the-unit", "num_ratings": "6,611", "num_reviews": "1,063", "avg_ratings": 3.72, "genres": ["Fiction", "Science Fiction", "Dystopia", "Science Fiction"], "title": "The Unit", "description": ["One day in early spring, Dorrit Weger is checked into the Second Reserve Bank Unit for biological material. She is promised a nicely furnished apartment inside the Unit, where she will make new friends, enjoy the state of the art recreation facilities, and live the few remaining days of her life in comfort with people who are just like her. Here, women over the age of fift", "One day in early spring, Dorrit Weger is checked into the Second Reserve Bank Unit for biological material. She is promised a nicely furnished apartment inside the Unit, where she will make new friends, enjoy the state of the art recreation facilities, and live the few remaining days of her life in comfort with people who are just like her. Here, women over the age of fifty and men over sixty-single, childless, and without jobs in progressive industries--are sequestered for their final few years; they are considered outsiders.", "In the Unit they are expected to contribute themselves for drug and psychological testing, and ultimately donate their organs, little by little, until the final donation. Despite the ruthless nature of this practice, the ethos of this near-future society and the Unit is to take care of others, and Dorrit finds herself living under very pleasant conditions: well-housed, well-fed, and well-attended. She is resigned to her fate and discovers her days there to be rather consoling and peaceful.", "But when she meets a man inside the Unit and falls in love, the extraordinary becomes a reality and life suddenly turns unbearable. Dorrit is faced with compliance or escape, and...well, then what?"], "author": "Ninni Holmqvist", "num_pages": "268", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-09 00:00:00", "ISBN": "1590513134"},
{"url": "https://www.goodreads.com/book/show/47780.Hunting_and_Gathering", "num_ratings": "14,231", "num_reviews": "1,151", "avg_ratings": 4.1, "genres": ["Fiction", "Cultural", "France", "Literary Fiction"], "title": "Hunting and Gathering", "author": "Anna Gavalda", "num_pages": "488", "awards": [], "places": ["Paris"], "character_names": ["Camille", "Franck", "Philibert", "Paulette"], "language": "English", "publish_date": "2007-04-03 00:00:00", "ISBN": "159448144X"},
{"url": "https://www.goodreads.com/book/show/25365.Out", "num_ratings": "18,814", "num_reviews": "2,122", "avg_ratings": 3.93, "genres": ["Fiction", "Cultural", "Japan", "Mystery", "Thriller", "Asian Literature", "Japanese Literature", "Mystery", "Crime", "Horror"], "title": "Out", "description": ["Natsuo Kirino's novel tells a story of random violence in the staid Tokyo suburbs, as a young mother who works a night shift making boxed lunches brutally strangles her deadbeat husband and then seeks the help of her co-workers to dispose of the body and cover up her crime.", "The ringleader of this cover-up, Masako Katori, emerges as the emotional heart of ", " and as one of t", "Natsuo Kirino's novel tells a story of random violence in the staid Tokyo suburbs, as a young mother who works a night shift making boxed lunches brutally strangles her deadbeat husband and then seeks the help of her co-workers to dispose of the body and cover up her crime.", "The ringleader of this cover-up, Masako Katori, emerges as the emotional heart of ", " and as one of the shrewdest, most clear-eyed creations in recent fiction. Masako's own search for a way out of the straitjacket of a dead-end life leads her, too, to take drastic action.", "The complex yet riveting narrative seamlessly combines a convincing glimpse into the grimy world of Japan's yakuza with a brilliant portrayal of the psychology of a violent crime and the ensuing game of cat-and-mouse between seasoned detectives and a group of determined but inexperienced criminals. Kirino has mastered a Thelma and Louise kind of graveyard humor that illuminates her stunning evocation of the pressures and prejudices that drive women to extreme deeds and the friendship that bolsters them in the aftermath."], "author": "Natsuo Kirino", "num_pages": "400", "awards": ["Naoki Prize 直木三十五賞 Nominee (1997)", "Edgar Award Nominee for Best Novel (2004)", "日本推理作家協会賞 for Best Novel (1998)", "このミステリーがすごい！ for Best Japanese Mystery Novel of the Year (1998)"], "places": ["Japan", "Tokyo"], "character_names": ["Masako", "Yayoi", "Kuniko", "Yoshie"], "language": "English", "publish_date": "2005-01-04 00:00:00", "ISBN": "1400078377"},
{"url": "https://www.goodreads.com/book/show/492239.The_Claudine_Novels", "num_ratings": "1,237", "num_reviews": "80", "avg_ratings": 4.18, "genres": ["Fiction", "Classics", "Cultural", "France", "Literature", "European Literature", "French Literature", "Womens"], "title": "The Claudine Novels", "description": ["Seldom have the experiences of a young girl growing to maturity been evoked with such lyricism and candour, and in Colette's hands Claudine emerges as a true original, first and most beguiling of this century's emancipated women."], "author": "Colette", "num_pages": "560", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-06-01 00:00:00", "ISBN": "0140183221"},
{"url": "https://www.goodreads.com/book/show/837460.The_Pure_and_the_Impure", "num_ratings": "1,282", "num_reviews": "92", "avg_ratings": 3.74, "genres": ["Fiction", "Cultural", "France", "Classics", "European Literature", "French Literature"], "title": "The Pure and the Impure", "description": ["When this work of Colette's first appeared in France, it carried the title of ", " and the pleasures to which Colette was referring were those \"which are lightly called physical,\" meaning, Miss Flanner says, \"it was Colette's desire to add to the limited treasure of truthful insights into love, into the mysteries of love in its many forms. And in ", "When this work of Colette's first appeared in France, it carried the title of ", " and the pleasures to which Colette was referring were those \"which are lightly called physical,\" meaning, Miss Flanner says, \"it was Colette's desire to add to the limited treasure of truthful insights into love, into the mysteries of love in its many forms. And in ", " she used her customary semifictional formula to report on the behavior, the ", ", reflexes, instincts of women, especially as sentient, desiring creatures drawn to similarities and event to substitutes.\""], "author": "Colette", "num_pages": "175", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1967-08-16 00:00:00", "ISBN": "0374506922"},
{"url": "https://www.goodreads.com/book/show/230514.The_Notebook_The_Proof_The_Third_Lie", "num_ratings": "6,333", "num_reviews": "659", "avg_ratings": 4.38, "genres": ["Fiction", "War", "Cultural", "Hungary", "Contemporary", "Literature"], "title": "The Notebook, The Proof, The Third Lie: Three Novels", "description": ["These three internationally acclaimed novels have confirmed Agota Kristof's reputation as one of the most provocative exponents of new-wave European fiction. With all the stark simplicity of a fractured fairy tale, the trilogy tells the story of twin brothers, Claus and Lucas, locked in an agonizing bond that becomes a gripping allegory of the forces that have divided \"bro", "These three internationally acclaimed novels have confirmed Agota Kristof's reputation as one of the most provocative exponents of new-wave European fiction. With all the stark simplicity of a fractured fairy tale, the trilogy tells the story of twin brothers, Claus and Lucas, locked in an agonizing bond that becomes a gripping allegory of the forces that have divided \"brothers\" in much of Europe since World War II. Kristof's postmodern saga begins with The Notebook, in which the brothers are children, lost in a country torn apart by conflict, who must learn every trick of evil and cruelty merely to survive. In The Proof, Lucas is challenging to prove his own identity and the existence of his missing brother, a defector to the \"other side.\" The Third Lie, which closes the trilogy, is a biting parable of Eastern and Western Europe today and a deep exploration into the nature of identity, storytelling, and the truths and untruths that lie at the heart of them all. \"Stark and haunting.\" - The San Francisco Chronicle; \"A vision of considerable depth and complexity, a powerful portrait of the nobility and perversity of the human heart.\" - The Christian Science Monitor."], "author": "Ágota Kristóf", "num_pages": "480", "awards": ["Premi Llibreter de narrativa Nominee (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-06-23 00:00:00", "ISBN": "0802135064"},
{"url": "https://www.goodreads.com/book/show/626685.Selected_Poems", "num_ratings": "5,530", "num_reviews": "86", "avg_ratings": 4.35, "genres": ["Poetry", "Cultural", "Russia", "Literature", "Russian Literature", "Classics"], "title": "Selected Poems", "description": ["An admired contemporary of Rilke, Akhmatova, and Mandelstam, Russian poet Marina Tsvetayeva bore witness to the turmoil and devastation of the Revolution, and chronicled her difficult life in exile, sustained by the inspiration and power of her modern verse.", "The poems in this selection are drawn from eleven volumes published over thirty years."], "author": "Marina Tsvetaeva", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-01-01 00:00:00", "ISBN": "0140187596"},
{"url": "https://www.goodreads.com/book/show/23209971-girl-at-war", "num_ratings": "19,360", "num_reviews": "2,327", "avg_ratings": 3.99, "genres": ["Historical", "Historical Fiction", "Fiction", "War", "Historical"], "title": "Girl at War", "description": ["Zagreb, summer of 1991. Ten-year-old Ana Jurić is a carefree tomboy who runs the streets of Croatia's capital with her best friend, Luka, takes care of her baby sister, Rahela, and idolizes her father. But as civil war breaks out across Yugoslavia, soccer games and school lessons are supplanted by sniper fire and air raid drills. When tragedy suddenly strikes, Ana is lost", "Zagreb, summer of 1991. Ten-year-old Ana Jurić is a carefree tomboy who runs the streets of Croatia's capital with her best friend, Luka, takes care of her baby sister, Rahela, and idolizes her father. But as civil war breaks out across Yugoslavia, soccer games and school lessons are supplanted by sniper fire and air raid drills. When tragedy suddenly strikes, Ana is lost to a world of guerilla warfare and child soldiers; a daring escape plan to America becomes her only chance for survival.", "Ten years later Ana is a college student in New York. She's been hiding her past from her boyfriend, her friends, and most especially herself. Haunted by the events that forever changed her family, she returns alone to Croatia, where she must rediscover the place that was once her home and search for the ghosts of those she's lost."], "author": "Sara Nović", "num_pages": "320", "awards": ["ALA Alex Award (2016)", "Women's Prize for Fiction Nominee for Longlist (2016)", "The Center for Fiction First Novel Prize Nominee for Longlist (2015)", "Goodreads Choice Award Nominee for Fiction, and for Goodreads Debut Author (2015)"], "places": ["Croatia", "New York City, New York", "Pennsylvania"], "character_names": ["Ana Jurić"], "language": "English", "publish_date": "2015-05-12 00:00:00", "ISBN": "0812996348"},
{"url": "https://www.goodreads.com/book/show/153421.Selected_Cr_nicas", "num_ratings": "196", "num_reviews": "17", "avg_ratings": 4.24, "genres": ["Writing", "Essays", "Fiction", "Short Stories", "Cultural", "Brazil"], "title": "Selected Crônicas", "description": ["\"In 1967, Brazil's leading newspaper asked the avant-garde writer Lispector to write a weekly column on any topic she wished. For almost seven years, Lispector showed Brazilian readers just how vast and passionate her interests were. This beautifully translated collection of selected columns, or ", ", is just as immediately stimulating today and ably reinforces her rep", "\"In 1967, Brazil's leading newspaper asked the avant-garde writer Lispector to write a weekly column on any topic she wished. For almost seven years, Lispector showed Brazilian readers just how vast and passionate her interests were. This beautifully translated collection of selected columns, or ", ", is just as immediately stimulating today and ably reinforces her reputation as one of Brazil's greatest writers. Indeed, these columns should establish her as being among the era's most brilliant essayists. She is masterful, even reminiscent of Montaigne, in her ability to spin the mundane events of life into moments of clarity that reveal greater truths.\"—"], "author": "Clarice Lispector", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-11-17 00:00:00", "ISBN": "0811213404"},
{"url": "https://www.goodreads.com/book/show/261423.The_Ministry_of_Pain", "num_ratings": "1,033", "num_reviews": "111", "avg_ratings": 3.77, "genres": ["Fiction", "Contemporary", "Novels"], "title": "The Ministry of Pain", "description": ["Having fled the violent breakup of Yugoslavia, Tanja Lucic is now a professor of literature at the University of Amsterdam, where she teaches a class filled with other young Yugoslav exiles, most of whom earn meager wages assembling leather and rubber S&M clothing at a sweatshop they call the \"Ministry.\" Abandoning literature, Tanja encourages her students to indulge t", "Having fled the violent breakup of Yugoslavia, Tanja Lucic is now a professor of literature at the University of Amsterdam, where she teaches a class filled with other young Yugoslav exiles, most of whom earn meager wages assembling leather and rubber S&M clothing at a sweatshop they call the \"Ministry.\" Abandoning literature, Tanja encourages her students to indulge their \"Yugonostalgia\" in essays about their personal experiences during their homeland's cultural and physical disintegration. But Tanja's act of academic rebellion incites the rage of one renegade member of her class—and pulls her dangerously close to another—which, in turn, exacerbates the tensions of a life in exile that has now begun to spiral seriously out of control."], "author": "Dubravka Ugrešić", "num_pages": "272", "awards": ["Independent Foreign Fiction Prize Nominee for Shortlist (2006)", "Angelus Nominee (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-27 00:00:00", "ISBN": "0060825855"},
{"url": "https://www.goodreads.com/book/show/354364.The_Princesse_de_Cl_ves", "num_ratings": "8,080", "num_reviews": "384", "avg_ratings": 3.44, "genres": ["Classics", "Cultural", "France", "Fiction", "Historical", "Historical Fiction", "European Literature", "French Literature"], "title": "The Princesse de Clèves", "description": ["This new translation of ", " also includes two shorter works also attributed to Mme de Lafayette, ", " and ", "."], "author": "Madame de La Fayette", "num_pages": "288", "awards": [], "places": [], "character_names": ["Henri II of France", "Jacques de Savoie, duke of Nemours", "The Princess of Clèves", "Mary, Queen of Scots", "Catherine de' Medici"], "language": "English", "publish_date": "1999-11-11 00:00:00", "ISBN": "0192837265"},
{"url": "https://www.goodreads.com/book/show/7468918-women-as-lovers", "num_ratings": "1,647", "num_reviews": "158", "avg_ratings": 3.66, "genres": ["Fiction", "Nobel Prize", "Literature", "European Literature", "German Literature", "Feminism"], "title": "Women as Lovers", "description": ["The setting is an idyllic Alpine village where a women's underwear factory nestles in the woods. Two factory workers, Brigitte and Paula, dream and talk about finding happiness, a comfortable home and a good man. They realise that their quest will be as hard as work at the factory. Brigitte subordinates her feelings and goes for Heinz, a young, plump, up-and-coming busines", "The setting is an idyllic Alpine village where a women's underwear factory nestles in the woods. Two factory workers, Brigitte and Paula, dream and talk about finding happiness, a comfortable home and a good man. They realise that their quest will be as hard as work at the factory. Brigitte subordinates her feelings and goes for Heinz, a young, plump, up-and-coming businessman. With Paula, feelings and dreams become confused. She gets pregnant by Erich, the forestry worker. He's handsome, so they marry. Brigitte gets it right. Paula gets it wrong."], "author": "Elfriede Jelinek", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-07-15 00:00:00", "ISBN": "1615607757"},
{"url": "https://www.goodreads.com/book/show/177404.The_Waiting_Years", "num_ratings": "1,294", "num_reviews": "114", "avg_ratings": 3.93, "genres": ["Cultural", "Japan", "Asian Literature", "Japanese Literature", "Fiction", "Historical", "Historical Fiction", "Cultural", "Asia"], "title": "The Waiting Years", "description": ["The beautiful, immature girl whom she took home to her husband was a maid only in name. Tomo's real mission had been to find him a mistress. Nor did her secret humiliation end there. The web that his insatiable lust spun about him soon trapped another young woman, and another ... and the relationships between the women thus caught were to form, over the years, a subtle, sh", "The beautiful, immature girl whom she took home to her husband was a maid only in name. Tomo's real mission had been to find him a mistress. Nor did her secret humiliation end there. The web that his insatiable lust spun about him soon trapped another young woman, and another ... and the relationships between the women thus caught were to form, over the years, a subtle, shifting pattern in which they all played a part. There was Suga, the innocent, introspective girl from a respectable but impoverished family; the outgoing, cheerful, almost boyish Yumi; the flirtatious, seductive Miya, who soon found her father-in-law more dependable as a man than his brutish son.... And at the center, rejected yet dominating them all, the near tragic figure of the wife Tomo, whose passionate heart was always, until that final day, held in check by an old-fashioned code.", "In a series of colorful, unforgettable scenes, Enchi brilliantly handles the human interplay within the ill-fated Shirakawa family. Japan's leading woman novelist and a member of the prestigious Art Academy, she combines a graceful, evocative style that consciously echoes the ", " with keen insight and an impressive ability to develop her characters over a long period of time. Her work is rooted deep in the female psychology, and it is her women above all-so clearly differentiated yet all so utterly feminine-who live in the memory. With ", ", a new and important literary figure makes her debut in the Western world."], "author": "Fumiko Enchi", "num_pages": "203", "awards": ["Noma Literary Prize 野間文芸賞 (1957)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-09-13 00:00:00", "ISBN": "477002889X"},
{"url": "https://www.goodreads.com/book/show/153386.Gigi_and_The_Cat", "num_ratings": "1,426", "num_reviews": "110", "avg_ratings": 3.78, "genres": ["Fiction", "Classics", "Cultural", "France", "Short Stories", "European Literature", "French Literature", "Literature"], "title": "Gigi and The Cat", "description": ["GIGI TRANSLATED BY ROGER SENHOUSE, THE CAT TRANSLATED BY ANTONIA WHITE", "Gigi's days are filled with cigars, lobster, lace and superstitions: the education of a future courtesan. Bored and unconvinced by what she's taught, Gigi surprises all with her approach to love. In this classic turn-of-the-century novella, Colette unveils Gigi's journey into womanhood in rich and supple", "GIGI TRANSLATED BY ROGER SENHOUSE, THE CAT TRANSLATED BY ANTONIA WHITE", "Gigi's days are filled with cigars, lobster, lace and superstitions: the education of a future courtesan. Bored and unconvinced by what she's taught, Gigi surprises all with her approach to love. In this classic turn-of-the-century novella, Colette unveils Gigi's journey into womanhood in rich and supple prose.", "In 'The Cat', a story of burgeoning sexuality and blossoming love, an exquisite strong-minded Russian Blue is struggling for mastery of Alain with his seductive fiancée, Camille."], "author": "Colette", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-06-01 00:00:00", "ISBN": "0140183191"},
{"url": "https://www.goodreads.com/book/show/5186.Breath_Eyes_Memory", "num_ratings": "24,402", "num_reviews": "1,198", "avg_ratings": 3.87, "genres": ["Fiction", "Historical", "Historical Fiction"], "title": "Breath, Eyes, Memory", "description": ["At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new novelists, a writer who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.  ", "At the age of twelve, Sophie Caco is sent from her imp", "At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new novelists, a writer who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.  ", "At the age of twelve, Sophie Caco is sent from her impoverished village of Croix-des-Rosets to New York, to be reunited with a mother she barely remembers. There she discovers secrets that no child should ever know, and a legacy of shame that can be healed only when she returns to Haiti--to the women who first reared her. What ensues is a passionate journey through a landscape charged with the supernatural and scarred by political violence, in a novel that bears witness to the traditions, suffering, and wisdom of an entire people."], "author": "Edwidge Danticat", "num_pages": "234", "awards": [], "places": ["Haiti", "New York (the state)"], "character_names": [], "language": "English", "publish_date": "1998-05-18 00:00:00", "ISBN": "037570504X"},
{"url": "https://www.goodreads.com/book/show/15985815-in-the-shadow-of-the-banyan", "num_ratings": "15,976", "num_reviews": "2,256", "avg_ratings": 4.04, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Asia", "War", "Historical"], "title": "In the Shadow of the Banyan", "description": ["For seven-year-old Raami, the shattering end of childhood begins with the footsteps of her father returning home in the early dawn hours bringing details of the civil war that has overwhelmed the streets of Phnom Penh, Cambodia’s capital. Soon the family’s world of carefully guarded royal privilege is swept up in the chaos of revolution and forced exodus.", "Over the next four", "For seven-year-old Raami, the shattering end of childhood begins with the footsteps of her father returning home in the early dawn hours bringing details of the civil war that has overwhelmed the streets of Phnom Penh, Cambodia’s capital. Soon the family’s world of carefully guarded royal privilege is swept up in the chaos of revolution and forced exodus.", "Over the next four years, as she endures the deaths of family members, starvation, and brutal forced labor, Raami clings to the only remaining vestige of childhood—the mythical legends and poems told to her by her father. In a climate of systematic violence where memory is sickness and justification for execution, Raami fights for her improbable survival.", "Displaying the author’s extraordinary gift for language, ", " is testament to the transcendent power of narrative and a brilliantly wrought tale of human resilience."], "author": "Vaddey Ratner", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-09-01 00:00:00", "ISBN": "1849837597"},
{"url": "https://www.goodreads.com/book/show/9516.Persepolis", "num_ratings": "131,716", "num_reviews": "7,505", "avg_ratings": 4.24, "genres": ["Sequential Art", "Graphic Novels", "Nonfiction", "Autobiography", "Memoir", "Sequential Art", "Comics", "Biography"], "title": "Persepolis: The Story of a Childhood", "description": ["A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, ye", "A ", " Notable Book", "A ", " “Best Comix of the Year”", "A ", "and ", " Best-seller", "Wise, funny, and heartbreaking, ", " is Marjane Satrapi’s memoir of growing up in Iran during the Islamic Revolution. In powerful black-and-white comic strip images, Satrapi tells the story of her life in Tehran from ages six to fourteen, years that saw the overthrow of the Shah’s regime, the triumph of the Islamic Revolution, and the devastating effects of war with Iraq. The intelligent and outspoken only child of committed Marxists and the great-granddaughter of one of Iran’s last emperors, Marjane bears witness to a childhood uniquely entwined with the history of her country.", " paints an unforgettable portrait of daily life in Iran and of the bewildering contradictions between home life and public life. Marjane’s child’s-eye view of dethroned emperors, state-sanctioned whippings, and heroes of the revolution allows us to learn as she does the history of this fascinating country and of her own extraordinary family. Intensely personal, profoundly political, and wholly original, ", " is at once a story of growing up and a reminder of the human cost of war and political repression. It shows how we carry on, with laughter and tears, in the face of absurdity. And, finally, it introduces us to an irresistible little girl with whom we cannot help but fall in love."], "author": "Marjane Satrapi", "num_pages": "153", "awards": ["Harvey Awards for Best US Edition of Foreign Material (2004)", "ALA Alex Award (2004)", "Prix du Festival d'Angoulême for Alph-art du coup de coeur (2001)"], "places": ["Iran, Islamic Republic of", "Tehran", "Persia"], "character_names": [], "language": "English", "publish_date": "2004-06-01 00:00:00", "ISBN": "037571457X"},
{"url": "https://www.goodreads.com/book/show/13165142-the-hunger-angel", "num_ratings": "3,270", "num_reviews": "423", "avg_ratings": 3.89, "genres": ["Fiction", "Historical", "Historical Fiction", "European Literature", "German Literature", "Nobel Prize", "Cultural", "Romania"], "title": "The Hunger Angel", "description": ["It was an icy morning in January 1945 when the patrol came for seventeen-year-old Leo Auberg to deport him to a camp in the Soviet Union. Leo would spend the next five years in a coke processing plant, shoveling coal, lugging bricks, mixing mortar, and battling the relentless calculus of hunger that governed the labor colony: one shovel load of coal is worth one gram of br", "It was an icy morning in January 1945 when the patrol came for seventeen-year-old Leo Auberg to deport him to a camp in the Soviet Union. Leo would spend the next five years in a coke processing plant, shoveling coal, lugging bricks, mixing mortar, and battling the relentless calculus of hunger that governed the labor colony: one shovel load of coal is worth one gram of bread.", "In her new novel, Nobel laureate Herta Müller calls upon her unique combination of poetic intensity and dispassionate precision to conjure the distorted world of the labor camp in all its physical and moral absurdity. She has given Leo the language to express the inexpressible, as hunger sharpens his senses into an acuity that is both hallucinatory and profound. In scene after disorienting scene, the most ordinary objects accrue tender poignancy as they acquire new purpose—a gramophone box serves as a suitcase, a handkerchief becomes a talisman, an enormous piece of casing pipe functions as a lovers' trysting place. The heart is reduced to a pump, the breath mechanized to the rhythm of a swinging shovel, and coal, sand, and snow have a will of their own. Hunger becomes an insatiable angel who haunts the camp, but also a bare-knuckled sparring partner, delivering blows that keep Leo feeling the rawest connection to life.", "Müller has distilled Leo's struggle into words of breathtaking intensity that take us on a journey far beyond the Gulag and into the depths of one man's soul."], "author": "Herta Müller", "num_pages": "304", "awards": ["BTBA Best Translated Book Award Nominee for Fiction shortlist (2013)", "Magnesia Litera for Translation (Litera za překladovou knihu) (2011)", "Deutscher Buchpreis (German Book Prize) Nominee for Shortlist (2009)", "Franz-Werfel-Menschenrechtspreis (2009)", "Oxford-Weidenfeld Translation Prize (2013)", "ALTA National Translation Award for Prose Poetry for Philip Boehm (2013)", "International DUBLIN Literary Award Nominee (2014)", "Mikael Agricola -palkinto (2011)"], "places": ["Sibiu", "Horlivka"], "character_names": [], "language": "English", "publish_date": "2012-04-24 00:00:00", "ISBN": "080509301X"},
{"url": "https://www.goodreads.com/book/show/6495110-the-true-deceiver", "num_ratings": "2,932", "num_reviews": "405", "avg_ratings": 3.84, "genres": ["Fiction", "European Literature", "Scandinavian Literature"], "title": "The True Deceiver", "description": ["A New York Review Books Original", "The lies we tell ourselves and the lies we tell others—is the subject of this, Tove Jansson’s most unnerving and unpredictable novel. Here Jansson takes a darker look at the subjects that animate the best of her work, from her sensitive tale of island life, ", ", to her famous Moomin stories: solitude and community, art and life,", "A New York Review Books Original", "The lies we tell ourselves and the lies we tell others—is the subject of this, Tove Jansson’s most unnerving and unpredictable novel. Here Jansson takes a darker look at the subjects that animate the best of her work, from her sensitive tale of island life, ", ", to her famous Moomin stories: solitude and community, art and life, love and hate.", " ", "Snow has been falling on the village all winter long. It covers windows and piles up in front of doors. The sun rises late and sets early, and even during the day there is little to do but trade tales. This year everybody’s talking about Katri Kling and Anna Aemelin. Katri is a yellow-eyed outcast who lives with her simpleminded brother and a dog she refuses to name. She has no use for the white lies that smooth social intercourse, and she can see straight to the core of any problem. Anna, an elderly children’s book illustrator, appears to be Katri’s opposite: a respected member of the village, if an aloof one. Anna lives in a large empty house, venturing out in the spring to paint exquisitely detailed forest scenes. But Anna has something Katri wants, and to get it Katri will take control of Anna’s life and livelihood. By the time spring arrives, the two women are caught in a conflict of ideals that threatens to strip them of their most cherished illusions."], "author": "Tove Jansson", "num_pages": "181", "awards": ["BTBA Best Translated Book Award for Fiction (2011)", "Valtion kirjallisuuspalkinto (1983)"], "places": [], "character_names": ["Anna Aemelin", "Katri Kling", "Mats Kling"], "language": "English", "publish_date": "2009-12-08 00:00:00", "ISBN": "1590173295"},
{"url": "https://www.goodreads.com/book/show/600404.Krik_Krak_", "num_ratings": "6,431", "num_reviews": "543", "avg_ratings": 4.11, "genres": ["Fiction", "Short Stories", "Historical", "Historical Fiction", "Literature", "Cultural", "African American"], "title": "Krik? Krak!", "description": ["At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new writers. She is an artist who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.", "When Haitians tell a story, they say \"Krik?\" and t", "At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new writers. She is an artist who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.", "When Haitians tell a story, they say \"Krik?\" and the eager listeners answer \"Krak!\" In ", " Danticat establishes herself as the latest heir to that narrative tradition with nine stories that encompass both the cruelties and the high ideals of Haitian life. They tell of women who continue loving behind prison walls and in the face of unfathomable loss; of a people who resist the brutality of their rulers through the powers of imagination. The result is a collection that outrages, saddens, and transports the reader with its sheer beauty."], "author": "Edwidge Danticat", "num_pages": "224", "awards": ["National Book Award Finalist for Fiction (1995)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-04-02 00:00:00", "ISBN": "067976657X"},
{"url": "https://www.goodreads.com/book/show/17851885-i-am-malala", "num_ratings": "291,136", "num_reviews": "16,826", "avg_ratings": 4.09, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Feminism"], "title": "I Am Malala: The Story of the Girl Who Stood Up for Education and Was Shot by the Taliban", "description": ["When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at p", "When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at point-blank range while riding the bus home from school, and few expected her to survive. ", "Instead, Malala's miraculous recovery has taken her on an extraordinary journey from a remote valley in northern Pakistan to the halls of the United Nations in New York. At sixteen, she has become a global symbol of peaceful protest and the youngest-ever Nobel Peace Prize laureate.", " is the remarkable tale of a family uprooted by global terrorism, of the fight for girls' education, of a father who, himself a school owner, championed and encouraged his daughter to write and attend school, and of brave parents who have a fierce love for their daughter in a society that prizes sons."], "author": "Malala Yousafzai", "num_pages": "327", "awards": ["Lincoln Award Nominee (2017)", "Goodreads Choice Award for Memoir & Autobiography (2013)"], "places": ["Lembah Swat"], "character_names": ["Malala Yousafzai"], "language": "English", "publish_date": "2013-10-08 00:00:00", "ISBN": "0316322407"},
{"url": "https://www.goodreads.com/book/show/704178.The_Slynx", "num_ratings": "3,051", "num_reviews": "241", "avg_ratings": 3.8, "genres": ["Fiction", "Cultural", "Russia", "Science Fiction", "Science Fiction", "Dystopia"], "title": "The Slynx", "description": ["In what remains of Moscow some two hundred years after the “Blast,” a community persists in primitive, ridiculous, and often brutal circumstances. Mice are the current source of food, clothes, and commerce, as well as a source of humor for Tatyana Tolstaya. Owning books in this society is prohibited by the tyrant, who plagiarizes the old masters, becoming his people’s sole", "In what remains of Moscow some two hundred years after the “Blast,” a community persists in primitive, ridiculous, and often brutal circumstances. Mice are the current source of food, clothes, and commerce, as well as a source of humor for Tatyana Tolstaya. Owning books in this society is prohibited by the tyrant, who plagiarizes the old masters, becoming his people’s sole writer. One of the tyrant’s scribes, Benedikt, is the main narrator of The Slynx. He is in love with books as objects but is unable to derive any meaning or moral benefit from them. Like the imagined, feared animal of this rollicking satirical novel’s title, Benedikt represents lust, cruelty, egotism, and ignorance. The Slynx and Benedikt are one.", " As Pearl K. Bell wrote of Tolstaya’s stories on the cover of the New York Times Book Review, “The blazing vitality of [her] imagination, the high-spirited playfulness . . . place her in that uniquely Russian line of satirists and surrealists.” David Remnick has called her “the most promising of all the ‘post-Soviet’ writers . . . She sounds like no one else.”"], "author": "Tatyana Tolstaya", "num_pages": "278", "awards": ["Премия «Триумф» (2001)"], "places": [], "character_names": ["Benedikt"], "language": "English", "publish_date": "2003-01-15 00:00:00", "ISBN": "0618124977"},
{"url": "https://www.goodreads.com/book/show/828469.Nervous_Conditions", "num_ratings": "9,179", "num_reviews": "651", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Eastern Africa", "Zimbabwe", "Feminism"], "title": "Nervous Conditions", "description": ["Tambudzai dreams of education, but her hopes only materialise after her brother's death, when she goes to live with her uncle. At his mission school, her critical faculties develop rapidly, bringing her face to face with a new set of conflicts involving her uncle, his education and his family. Tsitsi Dangarembga's quietly devastating first novel offers a portrait of Zimbab", "Tambudzai dreams of education, but her hopes only materialise after her brother's death, when she goes to live with her uncle. At his mission school, her critical faculties develop rapidly, bringing her face to face with a new set of conflicts involving her uncle, his education and his family. Tsitsi Dangarembga's quietly devastating first novel offers a portrait of Zimbabwe, where enlightenment brings its own profound dilemmas."], "author": "Tsitsi Dangarembga", "num_pages": "223", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1989)"], "places": ["Rhodesia", "Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2004-01-10 00:00:00", "ISBN": "0954702336"},
{"url": "https://www.goodreads.com/book/show/586852.The_Wall", "num_ratings": "4,122", "num_reviews": "477", "avg_ratings": 3.99, "genres": ["Fiction", "Science Fiction", "European Literature", "German Literature", "Science Fiction", "Dystopia", "Apocalyptic", "Post Apocalyptic", "Classics"], "title": "The Wall", "description": ["First published to acclaim in Germany, ", " chronicles the life of the last surviving human on earth, an ordinary middle-aged woman who awakens one morning to find that everyone else has vanished. Assuming her isolation to be the result of a military experiment gone awry, she begins the terrifying work of survival and self-renewal. This novel is at once a simple and mo", "First published to acclaim in Germany, ", " chronicles the life of the last surviving human on earth, an ordinary middle-aged woman who awakens one morning to find that everyone else has vanished. Assuming her isolation to be the result of a military experiment gone awry, she begins the terrifying work of survival and self-renewal. This novel is at once a simple and moving tale and a disturbing meditation on humanity."], "author": "Marlen Haushofer", "num_pages": "240", "awards": [], "places": ["The Alps", "Austria"], "character_names": ["\"Cat\"", "an unnamed woman", "her dog", "cow"], "language": "English", "publish_date": "1999-11-16 00:00:00", "ISBN": "1573440949"},
{"url": "https://www.goodreads.com/book/show/505222.The_Heptameron", "num_ratings": "820", "num_reviews": "52", "avg_ratings": 3.67, "genres": ["Classics", "Fiction", "Short Stories", "Cultural", "France", "European Literature", "French Literature", "Historical", "Medieval", "Literature", "16th Century"], "title": "The Heptameron", "description": ["In the early 1500s five men and five women find themselves trapped by floods and compelled to take refuge in an abbey high in the Pyrenees. When told they must wait days for a bridge to be repaired, they are inspired - by recalling Boccaccio's Decameron - to pass the time in a cultured manner by each telling a story every day. The stories, however, soon degenerate into a v", "In the early 1500s five men and five women find themselves trapped by floods and compelled to take refuge in an abbey high in the Pyrenees. When told they must wait days for a bridge to be repaired, they are inspired - by recalling Boccaccio's Decameron - to pass the time in a cultured manner by each telling a story every day. The stories, however, soon degenerate into a verbal battle between the sexes, as the characters weave tales of corrupt friars, adulterous noblemen and deceitful wives. From the cynical Saffredent to the young idealist Dagoucin or the moderate Parlamente - believed to express De Navarre's own views - The Heptameron provides a fascinating insight into the minds and passions of the nobility of sixteenth century France."], "author": "Marguerite de Navarre", "num_pages": "544", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-02-23 00:00:00", "ISBN": "014044355X"},
{"url": "https://www.goodreads.com/book/show/25489025-the-vegetarian", "num_ratings": "56,809", "num_reviews": "8,400", "avg_ratings": 3.58, "genres": ["Fiction", "Contemporary", "Literary Fiction"], "title": "The Vegetarian", "description": ["Before the nightmare, Yeong-hye and her husband lived an ordinary life. But when splintering, blood-soaked images start haunting her thoughts, Yeong-hye decides to purge her mind and renounce eating meat. In a country where societal mores are strictly obeyed, Yeong-hye's decision to embrace a more “plant-like” existence is a shocking act of subversion. And as her passive r", "Before the nightmare, Yeong-hye and her husband lived an ordinary life. But when splintering, blood-soaked images start haunting her thoughts, Yeong-hye decides to purge her mind and renounce eating meat. In a country where societal mores are strictly obeyed, Yeong-hye's decision to embrace a more “plant-like” existence is a shocking act of subversion. And as her passive rebellion manifests in ever more extreme and frightening forms, scandal, abuse, and estrangement begin to send Yeong-hye spiraling deep into the spaces of her fantasy. In a complete metamorphosis of both mind and body, her now dangerous endeavor will take Yeong-hye—impossibly, ecstatically, tragically—far from her once-known self altogether."], "author": "Han Kang", "num_pages": "188", "awards": ["Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee for Ki-Hyang Lee (2017)", "PEN Translation Prize Nominee for Deborah Smith (2017)", "Man Booker International Prize (2016)", "Frankfurt Book Fair LiBeraturpreis Nominee (2017)"], "places": ["Seoul (in South Korea)"], "character_names": ["Kim Yeong-hye", "Kim In-hye"], "language": "English", "publish_date": "2016-02-02 00:00:00", "ISBN": "0553448188"},
{"url": "https://www.goodreads.com/book/show/79549.Finn_Family_Moomintroll", "num_ratings": "9,012", "num_reviews": "492", "avg_ratings": 4.3, "genres": ["Fantasy", "Childrens", "Fiction", "Classics"], "title": "Finn Family Moomintroll", "description": ["It is spring in the valley and the Moomins are ready for adventure Moomintroll and his friends Snufkin and Sniff find the Hobgoblin's top hat, all shiny and new and just waiting to be taken home. They soon realize that his is no ordinary hat; it can turn anything--or anyone--into something else"], "author": "Tove Jansson", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-09-01 00:00:00", "ISBN": "0374423075"},
{"url": "https://www.goodreads.com/book/show/17573205-near-to-the-wild-heart", "num_ratings": "2,787", "num_reviews": "315", "avg_ratings": 4.05, "genres": ["Fiction", "Cultural", "Brazil", "Classics", "Novels", "Cultural", "Latin American"], "title": "Near to the Wild Heart", "description": ["Clarice Lispector's sensational, prize-winning debut novel ", " was published when she was just twenty-three and earned her the name 'Hurricane Clarice'. It tells the story of Joana, from her wild, creative childhood, as the 'little egg' who writes poems for her father, through her marriage to the faithless Otávio and on to her decision to make her own wa", "Clarice Lispector's sensational, prize-winning debut novel ", " was published when she was just twenty-three and earned her the name 'Hurricane Clarice'. It tells the story of Joana, from her wild, creative childhood, as the 'little egg' who writes poems for her father, through her marriage to the faithless Otávio and on to her decision to make her own way in the world. As Joana, endlessly mutable, moves through different emotional states, different inner lives and different truths, this impressionistic, dreamlike and fiercely intelligent novel asks if any of us ever really know who we are."], "author": "Clarice Lispector", "num_pages": "194", "awards": ["PEN Translation Prize Nominee for Alison Entrekin (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-02 00:00:00", "ISBN": "014119734X"},
{"url": "https://www.goodreads.com/book/show/6617921-primeval-and-other-times", "num_ratings": "1,926", "num_reviews": "126", "avg_ratings": 4.21, "genres": ["European Literature", "Polish Literature", "Fiction", "Cultural", "Poland", "Magical Realism", "Fantasy"], "title": "Primeval and Other Times", "description": ["Set in the mythical Polish village of Primeval, a microcosm of the world populated by eccentric, archetypal characters and guarded by four archangels, the novel chronicles the lives of the inhabitants over the course of the feral 20th century in prose that is forceful, direct, and the stylistic cousin of the magic realism in Gabriel García Márquez's ", "Set in the mythical Polish village of Primeval, a microcosm of the world populated by eccentric, archetypal characters and guarded by four archangels, the novel chronicles the lives of the inhabitants over the course of the feral 20th century in prose that is forceful, direct, and the stylistic cousin of the magic realism in Gabriel García Márquez's ", " Told in short bursts of \"Time,\" the narrative takes the form of a stylized fable, an epic allegory about the inexorable grind of time and the clash between modernity (the masculine) and nature (the feminine) in which Poland's tortured political history from 1914 to the contemporary era and the episodic brutality visited on ordinary village life is played out. A novel of universal dimension that does not dwell on the parochial, ", " was awarded the Koscielski Foundation Prize in 1997, which established Tokarczuk as one of the leading voices in Polish letters, and it has been translated into many languages the world over.", "Tokarczuk has said of the novel: \"I always wanted to write a book such as this. One that creates and describes a world. It is the story of a world that, like all things living, is born, develops, and then dies.\" Kitchens, bedrooms, childhood memories, dreams and insomnia, reminiscences, and amnesia — these are part of the existential and acoustic spaces from which the voices of Tokarczuk's tale come, her \"boxes in boxes.\""], "author": "Olga Tokarczuk", "num_pages": "248", "awards": ["Nike Literary Award (Nagroda Literacka Nike) for Audience (1997)", "Paszporty Polityki (1996)"], "places": [], "character_names": [], "language": "English", "publish_date": "2010-01-20 00:00:00", "ISBN": "8086264351"},
{"url": "https://www.goodreads.com/book/show/15852479-we-need-new-names", "num_ratings": "14,827", "num_reviews": "2,013", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Africa", "Eastern Africa", "Zimbabwe", "Contemporary", "Literary Fiction"], "title": "We Need New Names", "description": ["An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by", "An exciting literary debut: the unflinching and powerful story of a young girl's journey out of Zimbabwe and to America.", "Darling is only ten years old, and yet she must navigate a fragile and violent world. In Zimbabwe, Darling and her friends steal guavas, try to get the baby out of young Chipo's belly, and grasp at memories of Before. Before their homes were destroyed by paramilitary policemen, before the school closed, before the fathers left for dangerous jobs abroad.", "But Darling has a chance to escape: she has an aunt in America. She travels to this new land in search of America's famous abundance only to find that her options as an immigrant are perilously few. NoViolet Bulawayo's debut calls to mind the great storytellers of displacement and arrival who have come before her--from Junot Diaz to Zadie Smith to J.M. Coetzee--while she tells a vivid, raw story all her own."], "author": "NoViolet Bulawayo", "num_pages": "298", "awards": ["Man Booker Prize Nominee (2013)", "Guardian First Book Award Nominee (2013)", "PEN/Hemingway Foundation Award (2014)", "Internationaler Literaturpreis – Haus der Kulturen der Welt Nominee (2015)", "Hurston/Wright Legacy Award Nominee for Fiction (2014)", "Betty Trask Award (2014)"], "places": ["Tsholotsho", "Detroit, Michigan", "bulawayo"], "character_names": [], "language": "English", "publish_date": "2013-05-21 00:00:00", "ISBN": "0316230812"},
{"url": "https://www.goodreads.com/book/show/346955.Babette_s_Feast_and_Other_Anecdotes_of_Destiny", "num_ratings": "1,276", "num_reviews": "111", "avg_ratings": 4.04, "genres": ["Fiction", "Short Stories", "Classics", "Food and Drink", "Food"], "title": "Babette's Feast and Other Anecdotes of Destiny", "description": ["In the classic \"Babette's Feast,\" a mysterious Frenchwoman prepares a sumptuous feast for a gathering of religious ascetics and, in doing so, introduces them to the true essence of grace. In \"The Immortal Story,\" a miserly old tea-trader living in Canton wishes for power and finds redemption as he turns an oft-told sailors' tale into reality for a young man and woman. And", "In the classic \"Babette's Feast,\" a mysterious Frenchwoman prepares a sumptuous feast for a gathering of religious ascetics and, in doing so, introduces them to the true essence of grace. In \"The Immortal Story,\" a miserly old tea-trader living in Canton wishes for power and finds redemption as he turns an oft-told sailors' tale into reality for a young man and woman. And in the magnificent novella ", ", Dinesen tells of the powerful yet restrained rapport between a noble Wagnerian beauty and a rakish artist. ", "Hauntingly evoked and sensuously realized, the five stories read and novella collected here have the hold of \"fairy stories read in childhood . . . of dreams . . . and of our life as dreams\" (", ")."], "author": "Isak Dinesen", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-06-01 00:00:00", "ISBN": "039475929X"},
{"url": "https://www.goodreads.com/book/show/7574245-ru", "num_ratings": "10,080", "num_reviews": "1,174", "avg_ratings": 3.74, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Ru", "description": ["Une femme voyage à travers le désordre des souvenirs : l'enfance dans sa cage d'or à Saigon, l'arrivée du communisme dans le Sud-Vietnam apeuré, la fuite dans le ventre d'un bateau au large du golfe de Siam, l'internement dans un camp de réfugiés en Malaisie, les premiers frissons dans le froid du Québec. Récit entre la guerre et la paix, ru dit le vide et le trop-plein, l", "Une femme voyage à travers le désordre des souvenirs : l'enfance dans sa cage d'or à Saigon, l'arrivée du communisme dans le Sud-Vietnam apeuré, la fuite dans le ventre d'un bateau au large du golfe de Siam, l'internement dans un camp de réfugiés en Malaisie, les premiers frissons dans le froid du Québec. Récit entre la guerre et la paix, ru dit le vide et le trop-plein, l'égarement et la beauté. De ce tumulte, des incidents tragi-comiques, des objets ordinaires émergent comme autant de repères d'un parcours. En évoquant un bracelet en acrylique rempli de diamants, des bols bleus cerclés d'argent ou la puissance d'une odeur d'assouplissant, Kim Thúy restitue le Vietnam d'hier et d'aujourd'hui avec la maîtrise d'un grand écrivain.", "A runaway bestseller in Quebec, with foreign rights sold to 15 countries around the world, Kim Thúy's Governor General's Literary Award-winning ", " is a lullaby for Vietnam and a love letter to a new homeland.", "Ru. In Vietnamese it means lullaby; in French it is a small stream, but also signifies a flow - of tears, blood, money. Kim Thúy's ", " is literature at its most crystalline: the flow of a life on the tides of unrest and on to more peaceful waters. In vignettes of exquisite clarity, sharp observation and sly wit, we are carried along on an unforgettable journey from a palatial residence in Saigon to a crowded and muddy Malaysian refugee camp, and onward to a new life in Quebec. There, the young girl feels the embrace of a new community, and revels in the chance to be part of the American Dream. As an adult, the waters become rough again: now a mother of two sons, she must learn to shape her love around the younger boy's autism. Moving seamlessly from past to present, from history to memory and back again, ", " is a book that celebrates life in all its wonder: its moments of beauty and sensuality, brutality and sorrow, comfort and comedy."], "author": "Kim Thúy", "num_pages": "144", "awards": ["Grand Prix RTL-Lire (2010)", "Scotiabank Giller Prize Nominee (2012)", "Man Asian Literary Prize Nominee (2012)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Romans et nouvelles (2010)", "Grand Prix littéraire Archambault (2011)", "CBC Canada Reads (2015)", "Premio Mondello for Multiculturalism (2011)"], "places": [], "character_names": ["Nguyễn An Tịnh"], "language": "French", "publish_date": "2010-01-05 00:00:00", "ISBN": "286746532X"},
{"url": "https://www.goodreads.com/book/show/1396642.Heat_And_Dust", "num_ratings": "6,337", "num_reviews": "306", "avg_ratings": 3.55, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction"], "title": "Heat And Dust", "description": ["A profound and powerful novel, winner of the Booker Prize", "Set in colonial India during the 1920s, Heat and Dust tells the story of Olivia, a beautiful woman suffocated by the propriety and social constraints of her position as the wife of an important English civil servant. Longing for passion and independence, Olivia is drawn into the spell of the Nawab, a minor Indian pri", "A profound and powerful novel, winner of the Booker Prize", "Set in colonial India during the 1920s, Heat and Dust tells the story of Olivia, a beautiful woman suffocated by the propriety and social constraints of her position as the wife of an important English civil servant. Longing for passion and independence, Olivia is drawn into the spell of the Nawab, a minor Indian prince deeply involved in gang raids and criminal plots. She is intrigued by the Nawab's charm and aggressive courtship, and soon begins to spend most of her days in his company. But then she becomes pregnant, and unsure of the child's paternity, she is faced with a wrenching dilemma. Her reaction to the crisis humiliates her husband and outrages the British community, breeding a scandal that lives in collective memory long after her death."], "author": "Ruth Prawer Jhabvala", "num_pages": "181", "awards": ["Man Booker Prize (1975)"], "places": [], "character_names": [], "language": "English", "publish_date": "1994-07-28 00:00:00", "ISBN": "0140237046"},
{"url": "https://www.goodreads.com/book/show/151374.So_Long_a_Letter", "num_ratings": "5,441", "num_reviews": "453", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Senegal", "Literature", "African Literature", "Cultural", "France", "Feminism"], "title": "So Long a Letter", "description": ["This novel is in the form of a letter, written by the widowed Ramatoulaye and describing her struggle for survival. It is the winner of the Noma Award."], "author": "Mariama Bâ", "num_pages": "90", "awards": ["Noma Award for Publishing in Africa (1980)"], "places": ["Senegal"], "character_names": ["Ramatoulaye", "Aissatou", "Mawdo Ba", "Modou Fall", "Binetou"], "language": "English", "publish_date": "1989-06-28 00:00:00", "ISBN": "0435905554"},
{"url": "https://www.goodreads.com/book/show/152057.All_Men_Are_Mortal", "num_ratings": "3,174", "num_reviews": "232", "avg_ratings": 4.1, "genres": ["Fiction", "Philosophy", "Classics", "Cultural", "France", "European Literature", "French Literature", "Novels", "Literature"], "title": "All Men Are Mortal", "description": ["He becomes thoroughly attached to her and confides a terrifying truth: he is immortal. But having been resuscitated into enjoying life again, he soon starts breaking free from her grasp and all notions of mortality."], "author": "Simone de Beauvoir", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-05-17 00:00:00", "ISBN": "0393308456"},
{"url": "https://www.goodreads.com/book/show/49584.The_Ten_Thousand_Things", "num_ratings": "890", "num_reviews": "176", "avg_ratings": 3.78, "genres": ["Fiction", "Magical Realism", "Cultural", "Asia"], "title": "The Ten Thousand Things", "description": [" is a novel of shimmering strangeness—the story of Felicia, who returns with her baby son from Holland to the Spice Islands of Indonesia, to the house and garden that were her birthplace, over which her powerful grandmother still presides. There Felicia finds herself wedded to an uncanny and dangerous world, full of mystery and violence, where object", " is a novel of shimmering strangeness—the story of Felicia, who returns with her baby son from Holland to the Spice Islands of Indonesia, to the house and garden that were her birthplace, over which her powerful grandmother still presides. There Felicia finds herself wedded to an uncanny and dangerous world, full of mystery and violence, where objects tell tales, the dead come and go, and the past is as potent as the present. First published in Holland in 1955, Maria Dermoût's novel was immediately recognized as a magical work, like nothing else Dutch—or European—literature had seen before. ", " is an entranced vision of a far-off place that is as convincingly real and intimate as it is exotic, a book that is at once a lament and an ecstatic ode to nature and life."], "author": "Maria Dermoût", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-31 00:00:00", "ISBN": "159017013X"},
{"url": "https://www.goodreads.com/book/show/93.Heidi", "num_ratings": "160,395", "num_reviews": "3,000", "avg_ratings": 3.98, "genres": ["Classics", "Childrens", "Fiction"], "title": "Heidi", "description": ["Orphaned Heidi lives with her gruff but caring grandfather on the side of Swiss mountain, where she befriends young Peter the goat-herd. She leads an idyllic life, until she is forced to leave the mountain she has always known to go and live with a sickly girl in the city. Will Heidi ever see her grandfather again? A classic tale of a young girl's coming-of-age, of friends", "Orphaned Heidi lives with her gruff but caring grandfather on the side of Swiss mountain, where she befriends young Peter the goat-herd. She leads an idyllic life, until she is forced to leave the mountain she has always known to go and live with a sickly girl in the city. Will Heidi ever see her grandfather again? A classic tale of a young girl's coming-of-age, of friendship, and familial love."], "author": "Johanna Spyri", "num_pages": "352", "awards": [], "places": ["Switzerland"], "character_names": [], "language": "English", "publish_date": "2002-11-15 00:00:00", "ISBN": "0753454947"},
{"url": "https://www.goodreads.com/book/show/1165062.The_Land_of_Green_Plums", "num_ratings": "3,621", "num_reviews": "481", "avg_ratings": 3.64, "genres": ["Fiction", "Cultural", "Romania", "Nobel Prize", "European Literature", "German Literature", "Historical", "Historical Fiction", "Literature"], "title": "The Land of Green Plums", "description": ["Set in Romania at the height of Ceauescu's reign of terror, \"The Land of Green Plums\" tells the story of a group of young people who leave the impoverished province for the city in search of better prospects and camaraderie. But their hopes are ravaged, because the city, no less than the countryside, bears everywhere the mark of the dictatorship's corrosive touch. All the", "Set in Romania at the height of Ceauescu's reign of terror, \"The Land of Green Plums\" tells the story of a group of young people who leave the impoverished province for the city in search of better prospects and camaraderie. But their hopes are ravaged, because the city, no less than the countryside, bears everywhere the mark of the dictatorship's corrosive touch. All the narrator's friends--teachers and students of vaguely dissident allegiance--betray her, do away with themselves, or both. As they do so, we see the way the totalitarian state comes to inhabit every human realm and how everyone, even the strongest, must either bend to the oppressors or resist them and thereby perish.", "Herta Muller, herself a survivor of Ceausescu's police state, speaks from intimate experience. Scene by scene, in language at once harsh and poetic, she constructs a devastating picture of a society and a generation ruined by fear. In simple images of hieroglyphic power--policeman filling their pockets and mouths with green plums; girls sleeping with abattoir workers for bags of offal; a docile proletariat making things no one wants--\"tin sheep and wooden watermelons\"--Muller anatomizes a country and its citizens and the corruption that has rotted the core of both."], "author": "Herta Müller", "num_pages": "242", "awards": ["Aristeion Prize (1995)", "Kleist-Preis (1994)", "International DUBLIN Literary Award (1998)", "Mikael Agricola -palkinto (1997)"], "places": ["Romania"], "character_names": ["Edgar", "Kurt", "Georg", "Lola", "Ich", "Hauptmann Pjele"], "language": "English", "publish_date": "1996-11-15 00:00:00", "ISBN": "0805042954"},
{"url": "https://www.goodreads.com/book/show/16527.Daughter_of_Fortune", "num_ratings": "101,828", "num_reviews": "3,424", "avg_ratings": 3.89, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance"], "title": "Daughter of Fortune", "description": ["Orphaned at birth, Eliza Sommers is raised in the British colony of Valparaíso, Chile, by the well-intentioned Victorian spinster Miss Rose and her more rigid brother Jeremy. Just as she meets and falls in love with the wildly inappropriate Joaquín Andieta, a lowly clerk who works for Jeremy, gold is discovered in the hills of northern California. By 1849, Chileans of ever", "Orphaned at birth, Eliza Sommers is raised in the British colony of Valparaíso, Chile, by the well-intentioned Victorian spinster Miss Rose and her more rigid brother Jeremy. Just as she meets and falls in love with the wildly inappropriate Joaquín Andieta, a lowly clerk who works for Jeremy, gold is discovered in the hills of northern California. By 1849, Chileans of every stripe have fallen prey to feverish dreams of wealth. Joaquín takes off for San Francisco to seek his fortune, and Eliza, pregnant with his child, decides to follow him.", "As we follow her spirited heroine on a perilous journey north in the hold of a ship to the rough-and-tumble world of San Francisco and northern California, we enter a world whose newly arrived inhabitants are driven mad by gold fever. A society of single men and prostitutes among whom Eliza moves--with the help of her good friend and savior, the Chinese doctor Tao Chien--California opens the door to a new life of freedom and independence for the young Chilean. Her search for the elusive Joaquín gradually turns into another kind of journey that transforms her over time, and what began as a search for love ends up as the conquest of personal freedom."], "author": "Isabel Allende", "num_pages": "432", "awards": ["Premio de traducción literaria Valle Inclán Nominee for Margaret Sayers Peden (2000)"], "places": ["California", "Valparaíso"], "character_names": ["Eliza Sommers", "Rose Sommers", "Joaquín Andieta", "Jacob Todd", "Tao Chi'en"], "language": "English", "publish_date": "2006-05-02 00:00:00", "ISBN": "0061120251"},
{"url": "https://www.goodreads.com/book/show/3181564-the-housekeeper-and-the-professor", "num_ratings": "22,359", "num_reviews": "3,769", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Japan", "Contemporary", "Cultural", "Asia", "Literary Fiction"], "title": "The Housekeeper and the Professor", "description": ["He is a brilliant math Professor with a peculiar problem--ever since a traumatic head injury, he has lived with only eighty minutes of short-term memory. ", "She is an astute young Housekeeper, with a ten-year-old son, who is hired to care for him. ", "And every morning, as the Professor and the Housekeeper are introduced to each other anew, a strange and beautiful relationship bl", "He is a brilliant math Professor with a peculiar problem--ever since a traumatic head injury, he has lived with only eighty minutes of short-term memory. ", "She is an astute young Housekeeper, with a ten-year-old son, who is hired to care for him. ", "And every morning, as the Professor and the Housekeeper are introduced to each other anew, a strange and beautiful relationship blossoms between them. Though he cannot hold memories for long (his brain is like a tape that begins to erase itself every eighty minutes), the Professor’s mind is still alive with elegant equations from the past. And the numbers, in all of their articulate order, reveal a sheltering and poetic world to both the Housekeeper and her young son. The Professor is capable of discovering connections between the simplest of quantities--like the Housekeeper’s shoe size--and the universe at large, drawing their lives ever closer and more profoundly together, even as his memory slips away. ", "The Housekeeper and the Professor is an enchanting story about what it means to live in the present, and about the curious equations that can create a family."], "author": "Yōko Ogawa", "num_pages": "180", "awards": ["Independent Foreign Fiction Prize Nominee for Longlist (2010)", "Yomiuri Prize 読売文学賞 for Fiction (2003)", "本屋大賞 for 1st place (2004)"], "places": ["Hiroshima"], "character_names": ["The Housekeeper", "The Professor", "Root"], "language": "English", "publish_date": "2009-02-03 00:00:00", "ISBN": "0312427808"},
{"url": "https://www.goodreads.com/book/show/357486.Voices_from_Chernobyl", "num_ratings": "14,128", "num_reviews": "2,224", "avg_ratings": 4.43, "genres": ["Nonfiction", "History", "Cultural", "Russia", "Nobel Prize", "Science"], "title": "Voices from Chernobyl: The Oral History of a Nuclear Disaster", "description": ["On April 26, 1986, the worst nuclear reactor accident in history occurred in Chernobyl and contaminated as much as three quarters of Europe. ", " is the first book to present personal accounts of the tragedy. Journalist Svetlana Alexievich interviewed hundreds of people affected by the meltdown---from innocent citizen", "On April 26, 1986, the worst nuclear reactor accident in history occurred in Chernobyl and contaminated as much as three quarters of Europe. ", " is the first book to present personal accounts of the tragedy. Journalist Svetlana Alexievich interviewed hundreds of people affected by the meltdown---from innocent citizens to firefighters to those called in to clean up the disaster---and their stories reveal the fear, anger, and uncertainty with which they still live. Composed of interviews in monologue form, ", " is a crucially important work, unforgettable in its emotional power and honesty."], "author": "Svetlana Alexievich", "num_pages": "236", "awards": ["National Book Critics Circle Award for General Nonfiction (2005)", "Leipzig Book Award for European Understanding (1998)"], "places": ["Prypiat", "Chernobyl", "Belarus", "Kiev Oblast", "Moscow", "Chernobyl Exclusion Zone"], "character_names": [], "language": "English", "publish_date": "2006-04-18 00:00:00", "ISBN": "0312425848"},
{"url": "https://www.goodreads.com/book/show/153426.The_Passion_According_to_G_H_", "num_ratings": "3,850", "num_reviews": "376", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Brazil", "Novels"], "title": "The Passion According to G.H.", "description": ["Aficionados of South American fiction as well as literary critics will welcome this posthumous translation of a nearly plotless novel by one of Brazil's foremost writers. Availing herself of a single character, Lispector transforms a banal situation—a woman at home, alone—into an amphitheater for philosophical investigations. The first-person narration jousts with language", "Aficionados of South American fiction as well as literary critics will welcome this posthumous translation of a nearly plotless novel by one of Brazil's foremost writers. Availing herself of a single character, Lispector transforms a banal situation—a woman at home, alone—into an amphitheater for philosophical investigations. The first-person narration jousts with language, playfully but forcefully examining the ambiguous nature of words, with results ranging from the profound to the pretentious: \"Prehuman divine life is a life of singeing nowness\" or \"The world interdepended with me, and I am not understanding what I say, never! never again shall I understand what I say. For how will I be able to speak without the word lying for me?\" These linguistic games frame existential and experiential crises that Lispector savors and overcomes. Although this idiosyncratic novel will not have wide appeal, those with academic or markedly erudite tastes should like it very much."], "author": "Clarice Lispector", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-09-15 00:00:00", "ISBN": "0816617120"},
{"url": "https://www.goodreads.com/book/show/497499.The_Door", "num_ratings": "11,286", "num_reviews": "1,514", "avg_ratings": 4.06, "genres": ["Fiction", "Cultural", "Hungary", "Historical", "Historical Fiction", "European Literature", "Hungarian Literature", "Novels"], "title": "The Door", "description": ["A busy young writer struggling to cope with domestic chores, hires a housekeeper recommended by a friend. The housekeeper's reputation is one built on dependable efficiency, though she is something of an oddity. Stubborn, foul-mouthed and with a flagrant disregard for her employer's opinions she may even be crazy. She allows no-one to set foot inside her house; she masks h", "A busy young writer struggling to cope with domestic chores, hires a housekeeper recommended by a friend. The housekeeper's reputation is one built on dependable efficiency, though she is something of an oddity. Stubborn, foul-mouthed and with a flagrant disregard for her employer's opinions she may even be crazy. She allows no-one to set foot inside her house; she masks herself with a veil and is equally guarded about her personal life. And yet Emerence is revered as much as she is feared. As the story progresses her energy and passion to help becomes clear, extinguishing any doubts arising out of her bizarre behaviour. A stylishly told tale which recounts a strange relationship built up over 20 years between a writer and her housekeeper. After an unpromising and caustic start benign feelings develop and ultimately the writer benefits from what becomes an inseparable relationship. Simultaneously we learn Emerence's tragic past which is revealed in snapshots throughout the book."], "author": "Magda Szabó", "num_pages": "272", "awards": ["Prix Femina for Étranger (2003)", "Independent Foreign Fiction Prize Nominee for Shortlist (2006)", "Oxford-Weidenfeld Translation Prize (2006)"], "places": ["Hungary"], "character_names": [], "language": "English", "publish_date": "2005-10-20 00:00:00", "ISBN": "1843431939"},
{"url": "https://www.goodreads.com/book/show/189123.Love_in_a_Fallen_City", "num_ratings": "1,704", "num_reviews": "188", "avg_ratings": 3.87, "genres": ["Short Stories", "Cultural", "China", "Fiction", "Classics", "Cultural", "Asia", "Asian Literature", "Chinese Literature"], "title": "Love in a Fallen City", "description": ["Eileen Chang is one of the great writers of twentieth-century China, where she enjoys a passionate following both on the mainland and in Taiwan. At the heart of Chang's achievement is her short fiction—tales of love, longing, and the shifting and endlessly treacherous shoals of family life. Written when Chang was still in her twenties, these extraordinary stories combine a", "Eileen Chang is one of the great writers of twentieth-century China, where she enjoys a passionate following both on the mainland and in Taiwan. At the heart of Chang's achievement is her short fiction—tales of love, longing, and the shifting and endlessly treacherous shoals of family life. Written when Chang was still in her twenties, these extraordinary stories combine an unsettled, probing, utterly contemporary sensibility, keenly alert to sexual politics and psychological ambiguity, with an intense lyricism that echoes the classics of Chinese literature. ", ", the first collection in English of this dazzling body of work, introduces American readers to the stark and glamorous vision of a modern master."], "author": "Eileen Chang", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-10-10 00:00:00", "ISBN": "1590171780"},
{"url": "https://www.goodreads.com/book/show/7042.The_Tale_of_Genji", "num_ratings": "8,639", "num_reviews": "762", "avg_ratings": 3.71, "genres": ["Classics", "Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Historical", "Historical Fiction"], "title": "The Tale of Genji", "description": ["See an alternate cover edition ", ".", "Written in the eleventh century, this portrait of courtly life in medieval Japan is widely celebrated as the world's first novel. ", " is a very long romance, running to fifty-four chapters and describing the court life of Heian Japan, from the tenth century into the eleventh."], "author": "Murasaki Shikibu", "num_pages": "1182", "awards": [], "places": ["Japan"], "character_names": ["Genji", "Fujitsubo", "To no Chujo", "Murasaki", "Yugiri"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "014243714X"},
{"url": "https://www.goodreads.com/book/show/19528.The_Mandarins", "num_ratings": "3,500", "num_reviews": "244", "avg_ratings": 4.12, "genres": ["Fiction", "Classics", "Cultural", "France", "Philosophy", "Feminism"], "title": "The Mandarins", "description": ["In her most famous novel, Simone de Beauvoir does not flinch in her look at Parisian intellectual society at the end of World War II. Drawing on those surrounding her -- Jean-Paul Sartre, Albert Camus, Arthur Koestler -- and her passionate love affair with Nelson Algren, Beauvoir dissects the emotional and philosophical currents of her time. At once an engrossing drama and", "In her most famous novel, Simone de Beauvoir does not flinch in her look at Parisian intellectual society at the end of World War II. Drawing on those surrounding her -- Jean-Paul Sartre, Albert Camus, Arthur Koestler -- and her passionate love affair with Nelson Algren, Beauvoir dissects the emotional and philosophical currents of her time. At once an engrossing drama and an intriguing political tale, ", " is the emotional odyssey of a woman torn between her inner desire and her public life.", " won France's highest literary prize, the Prix Goncourt."], "author": "Simone de Beauvoir", "num_pages": "752", "awards": ["Prix Goncourt (1954)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-05-03 00:00:00", "ISBN": "0007203942"},
{"url": "https://www.goodreads.com/book/show/50144.Kitchen", "num_ratings": "35,784", "num_reviews": "2,780", "avg_ratings": 3.84, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Short Stories", "Contemporary"], "title": "Kitchen", "description": ["Banana Yoshimoto's novels have made her a sensation in Japan and all over the world, and ", ", the dazzling English-language debut that is still her best-loved book, is an enchantingly original and deeply affecting book about mothers, love, tragedy, and the power of the kitchen and home in the lives of a pair of free-spirited young women in contemporary Japan. Mikage, t", "Banana Yoshimoto's novels have made her a sensation in Japan and all over the world, and ", ", the dazzling English-language debut that is still her best-loved book, is an enchantingly original and deeply affecting book about mothers, love, tragedy, and the power of the kitchen and home in the lives of a pair of free-spirited young women in contemporary Japan. Mikage, the heroine of ", ", is an orphan raised by her grandmother, who has passed away. Grieving, she is taken in by her friend Yoichi and his mother (who was once his father), Eriko. As the three of them form an improvised family that soon weathers its own tragic losses, Yoshimoto spins a lovely, evocative tale that recalls early Marguerite Duras. ", " and its companion story, \"Moonlight Shadow,\" are elegant tales whose seeming simplicity is the ruse of a writer whose voice echoes in the mind and the soul."], "author": "Banana Yoshimoto", "num_pages": "152", "awards": ["Nihon University Department of Arts Prize (1986)", "Kaien magazine New Writer Prize (1987)", "Mishima Yukio Prize 三島由紀夫賞 Nominee (1988)"], "places": ["Tokyo", "Izu", "Isehara"], "character_names": ["Mikage Sakurai", "Yūichi", "Eriko"], "language": "English", "publish_date": "2006-04-17 00:00:00", "ISBN": "0802142443"},
{"url": "https://www.goodreads.com/book/show/9763.Wild_Swans", "num_ratings": "74,421", "num_reviews": "4,810", "avg_ratings": 4.24, "genres": ["Nonfiction", "Cultural", "China", "History", "Biography", "Autobiography", "Memoir", "Cultural", "Asia"], "title": "Wild Swans: Three Daughters of China", "description": ["A new edition of one of the best-selling and best-loved books of recent years, with a new introduction by the author. The publication of Wild Swans in 1991 was a worldwide phenomenon. Not only did it become the best-selling non-fiction book in British publishing history, with sales of well over two million, it was received with unanimous critical acclaim, and was named the", "A new edition of one of the best-selling and best-loved books of recent years, with a new introduction by the author. The publication of Wild Swans in 1991 was a worldwide phenomenon. Not only did it become the best-selling non-fiction book in British publishing history, with sales of well over two million, it was received with unanimous critical acclaim, and was named the winner of the 1992 NCR Book Award and the 1993 British Book of the Year Award. Few books have ever had such an impact on their readers. Through the story of three generations of women -- grandmother, mother and daughter -- Wild Swans tells nothing less than the whole tumultuous history of China's tragic twentieth century, from sword-bearing warlords to Chairman Mao, from the Manchu Empire to the Cultural Revolution. At times terrifying, at times astonishing, always deeply moving, Wild Swans is a book in a million, a true story with all the passion and grandeur of a great novel. For this new edition, Jung Chang has written a new introduction, bringing her own story up to date, and describing the effect Wild Swans' success has had on her life."], "author": "Jung Chang", "num_pages": "666", "awards": ["NCR Book Award (1992)", "British Book Award (1993)"], "places": ["China"], "character_names": [], "language": "English", "publish_date": "2004-04-05 00:00:00", "ISBN": "0007176155"},
{"url": "https://www.goodreads.com/book/show/764953.The_Piano_Teacher", "num_ratings": "7,285", "num_reviews": "703", "avg_ratings": 3.54, "genres": ["Fiction", "Nobel Prize", "European Literature", "German Literature"], "title": "The Piano Teacher", "description": ["\"", ", [winner of the 2004 Nobel Prize in Literature,] is an exploration of fascism, not so much in the political sense as in the personal. In Joachim Neugroschel's excellent translation, the language is simple yet full of imaginative, often-funny metaphors, the view of the world original, if at times almost painfully bizarre.\"-", "\"", ", [winner of the 2004 Nobel Prize in Literature,] is an exploration of fascism, not so much in the political sense as in the personal. In Joachim Neugroschel's excellent translation, the language is simple yet full of imaginative, often-funny metaphors, the view of the world original, if at times almost painfully bizarre.\"-", "\"A brilliant, bitter, wonderful portrait of mother and daughter, artist and lover.\"-John Hawkes", "was born in Austria in 1946 and grew up in Vienna where she attended the famous Music Conservatory. The leading Austrian writer of her generation, she has been awarded the Heinrich Boll Prize for her contribution to German-language literature. This edition was translated by Joachim Neugroschel."], "author": "Elfriede Jelinek", "num_pages": "288", "awards": [], "places": ["Vienna"], "character_names": ["Erika Kohut", "Walter Klemmer"], "language": "English", "publish_date": "2001-11-08 00:00:00", "ISBN": "1852427507"},
{"url": "https://www.goodreads.com/book/show/2967752-the-elegance-of-the-hedgehog", "num_ratings": "127,905", "num_reviews": "16,164", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "France", "Philosophy", "Contemporary"], "title": "The Elegance of the Hedgehog", "description": ["A moving, funny, triumphant novel that exalts the quiet victories of the inconspicuous among us.", "We are in the center of Paris, in an elegant apartment building inhabited by bourgeois families. Renée, the concierge, is witness to the lavish but vacuous lives of her numerous employers. Outwardly she conforms to every stereotype of the concierge: fat, cantankerous, addicted t", "A moving, funny, triumphant novel that exalts the quiet victories of the inconspicuous among us.", "We are in the center of Paris, in an elegant apartment building inhabited by bourgeois families. Renée, the concierge, is witness to the lavish but vacuous lives of her numerous employers. Outwardly she conforms to every stereotype of the concierge: fat, cantankerous, addicted to television. Yet, unbeknownst to her employers, Renée is a cultured autodidact who adores art, philosophy, music, and Japanese culture. With humor and intelligence she scrutinizes the lives of the building's tenants, who for their part are barely aware of her existence. ", "Then there's Paloma, a twelve-year-old genius. She is the daughter of a tedious parliamentarian, a talented and startlingly lucid child who has decided to end her life on the sixteenth of June, her thirteenth birthday. Until then she will continue behaving as everyone expects her to behave: a mediocre pre-teen high on adolescent subculture, a good but not an outstanding student, an obedient if obstinate daughter. ", "Paloma and Renée hide both their true talents and their finest qualities from a world they suspect cannot or will not appreciate them. They discover their kindred souls when a wealthy Japanese man named Ozu arrives in the building. Only he is able to gain Paloma's trust and to see through Renée's timeworn disguise to the secret that haunts her. This is a moving, funny, triumphant novel that exalts the quiet victories of the inconspicuous among us."], "author": "Muriel Barbery", "num_pages": "325", "awards": ["BTBA Best Translated Book Award Nominee for Fiction Longlist (2009)", "Prix des Libraires (2007)", "Brive-La-Gaillarde Readers Prize (2007)", "French-American Foundation Translation Prize Nominee for Fiction (2008)", "Prix Georges Brassens (2006)", "International DUBLIN Literary Award for Shortlist (2010)"], "places": ["France"], "character_names": ["Renée Michel", "Paloma Josse", "Kakuro Ozu"], "language": "English", "publish_date": "2008-09-02 00:00:00", "ISBN": "1933372605"},
{"url": "https://www.goodreads.com/book/show/991197.The_Complete_Persepolis", "num_ratings": "89,753", "num_reviews": "6,206", "avg_ratings": 4.38, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "The Complete Persepolis", "description": ["Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.", " is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years", "Here, in one volume: Marjane Satrapi's best-selling, internationally acclaimed graphic memoir.", " is the story of Satrapi's unforgettable childhood and coming of age within a large and loving family in Tehran during the Islamic Revolution; of the contradictions between private life and public life in a country plagued by political upheaval; of her high school years in Vienna facing the trials of adolescence far from her family; of her homecoming--both sweet and terrible; and, finally, of her self-imposed exile from her beloved homeland. It is the chronicle of a girlhood and adolescence at once outrageous and familiar, a young life entwined with the history of her country yet filled with the universal trials and joys of growing up.", "Edgy, searingly observant, and candid, often heartbreaking but threaded throughout with raw humor and hard-earned wisdom--", " is a stunning work from one of the most highly regarded, singularly talented graphic artists at work today."], "author": "Marjane Satrapi", "num_pages": "341", "awards": [], "places": ["Vienna", "Iran", "Tehran"], "character_names": ["Rezā Shāh", "Marjane Satrapi", "Taji Chaltchi Satrapi", "Ebi Satrapi", "Grandma Chaltchi", "Anoosh Satrapi", "Taher Chaltchi", "Siamak Jari", "Mohsen Shakjiba", "Laly Jari", "Ahmadi", "Fereydoon Satrapi", "Kaveh", "Entezami", "Mali (Persepolis)", "Mehri", "Hossein (Bee Gees)", "Mrs. Nasrine", "Peyman", "Shahab", "Tinoosh", "Dr. Fathi", "Khosro (Persepolis)", "Niloufar", "Mardana", "Neda Baba-Levy", "Sherrie", "Zozo (Persepolis)"], "language": "English", "publish_date": "2007-10-30 00:00:00", "ISBN": "0375714839"},
{"url": "https://www.goodreads.com/book/show/61672.Bonjour_tristesse", "num_ratings": "20,233", "num_reviews": "1,347", "avg_ratings": 3.63, "genres": ["Fiction", "Cultural", "France", "Classics", "European Literature", "French Literature"], "title": "Bonjour tristesse", "description": ["La villa est magnifique, l'été brûlant, la Méditerranée toute proche. Cécile a dix-sept ans. Elle ne connaît de l'amour que des baisers, des rendez-vous, des lassitudes. Pas pour longtemps. Son père, veuf, est un adepte joyeux des liaisons passagères et sans importance. Ils s'amusent, ils n'ont besoin de personne, ils sont heureux. La visite d'une femme de cœur, intelligen", "La villa est magnifique, l'été brûlant, la Méditerranée toute proche. Cécile a dix-sept ans. Elle ne connaît de l'amour que des baisers, des rendez-vous, des lassitudes. Pas pour longtemps. Son père, veuf, est un adepte joyeux des liaisons passagères et sans importance. Ils s'amusent, ils n'ont besoin de personne, ils sont heureux. La visite d'une femme de cœur, intelligente et calme, vient troubler ce délicieux désordre. Comment écarter la menace ? Dans la pinède embrasée, un jeu cruel se prépare.", "C'était l'été 1954. On entendait pour la première fois la voix sèche et rapide d'un « charmant petit monstre » qui allait faire scandale. la deuxième moitié du XXe siècle commençait. Elle serait à l'image de cette adolescente déchirée entre le remords et le culte du plaisir."], "author": "Françoise Sagan", "num_pages": "153", "awards": ["Prix des Critiques (1954)"], "places": ["Riviera, France"], "character_names": ["Elsa Mackenbourg", "Anne Larsen", "Cécile", "Raymond", "Cyril"], "language": "French", "publish_date": "2002-09-16 00:00:00", "ISBN": "2266127748"},
{"url": "https://www.goodreads.com/book/show/13586707-my-brilliant-friend", "num_ratings": "117,729", "num_reviews": "12,655", "avg_ratings": 3.9, "genres": ["Historical", "Historical Fiction", "Abandoned", "European Literature", "Italian Literature", "Novels"], "title": "My Brilliant Friend", "description": ["The story begins in the 1950s, in a poor but vibrant neighborhood on the outskirts of Naples. Growing up on these tough streets the two girls learn to rely on each other ahead of anyone or anything else. As they grow, as their paths repeatedly diverge and converge, Elena and Lila remain best friends whose respective destinies are reflected and refracted in the other. They", "The story begins in the 1950s, in a poor but vibrant neighborhood on the outskirts of Naples. Growing up on these tough streets the two girls learn to rely on each other ahead of anyone or anything else. As they grow, as their paths repeatedly diverge and converge, Elena and Lila remain best friends whose respective destinies are reflected and refracted in the other. They are likewise the embodiments of a nation undergoing momentous change. Through the lives of these two women, Ferrante tells the story of a neighborhood, a city, and a country as it is transformed in ways that, in turn, also transform the relationship between her protagonists, the unforgettable Elena and Lila."], "author": "Elena Ferrante", "num_pages": "331", "awards": ["Waterstones Book of the Year Nominee (2015)", "Jarl Hellemann -palkinto (2016)"], "places": ["Italy", "Naples"], "character_names": ["Raffaella Cerullo (Lila)", "Elena Greco (Lenuccia)", "Rino Cerullo", "Stefano Carracci", "Pasquale Peluso", "Carmela Peluso", "Ada Cappuccio", "Antonio Cappuccio", "Nino Sarratore", "Enzo Scanno", "Marcello Solara", "Michele Solara"], "language": "English", "publish_date": "2012-09-25 00:00:00", "ISBN": "1609450787"},
{"url": "https://www.goodreads.com/book/show/12172.Memoirs_of_Hadrian", "num_ratings": "13,938", "num_reviews": "1,089", "avg_ratings": 4.25, "genres": ["Historical", "Historical Fiction", "Classics", "Cultural", "France", "Historical", "European Literature", "French Literature"], "title": "Memoirs of Hadrian", "description": ["Both an exploration of character and a reflection on the meaning of history, ", " has received international acclaim since its first publication in France in 1951. In it, Marguerite Yourcenar reimagines the Emperor Hadrian's arduous boyhood, his triumphs and reversals, and finally, as emperor, his gradual reordering of a war-torn world, writing with the imagi", "Both an exploration of character and a reflection on the meaning of history, ", " has received international acclaim since its first publication in France in 1951. In it, Marguerite Yourcenar reimagines the Emperor Hadrian's arduous boyhood, his triumphs and reversals, and finally, as emperor, his gradual reordering of a war-torn world, writing with the imaginative insight of a great writer of the twentieth century while crafting a prose style as elegant and precise as those of the Latin stylists of Hadrian's own era."], "author": "Marguerite Yourcenar", "num_pages": "347", "awards": ["Prix Femina Vacaresco (1952)"], "places": ["Rome", "Athens", "Alexandria"], "character_names": ["Antinoüs", "Trajan (emperor)", "Emperor Hadrian", "Vibia Sabina"], "language": "English", "publish_date": "2005-05-18 00:00:00", "ISBN": "0374529264"},
{"url": "https://www.goodreads.com/book/show/275.The_Lover", "num_ratings": "28,337", "num_reviews": "1,967", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "France", "Classics", "Romance", "European Literature", "French Literature"], "title": "The Lover", "description": ["Set in the prewar Indochina of Marguerite Duras’s childhood, this is the haunting tale of a tumultuous affair between an adolescent French girl and her Chinese lover. In spare yet luminous prose, Duras evokes life on the margins of Saigon in the waning days of France’s colonial empire, and its representation in the passionate relationship between two unforgettable outcasts", "Set in the prewar Indochina of Marguerite Duras’s childhood, this is the haunting tale of a tumultuous affair between an adolescent French girl and her Chinese lover. In spare yet luminous prose, Duras evokes life on the margins of Saigon in the waning days of France’s colonial empire, and its representation in the passionate relationship between two unforgettable outcasts."], "author": "Marguerite Duras", "num_pages": "117", "awards": ["Prix Goncourt (1984)", "PEN Translation Prize for Prose for Barbara Bray (1986)", "Prix Ritz-Paris-Hemingway (1986)", "Scott Moncrieff Prize for Barbara Bray (1986)"], "places": ["Indochina", "Vietnam"], "character_names": [], "language": "English", "publish_date": "1998-09-08 00:00:00", "ISBN": "0375700528"},
{"url": "https://www.goodreads.com/book/show/781787.Out_of_Africa", "num_ratings": "27,903", "num_reviews": "1,561", "avg_ratings": 3.96, "genres": ["Nonfiction", "Cultural", "Africa", "Classics", "Autobiography", "Memoir", "Biography"], "title": "Out of Africa", "description": [" is Isak Dinesen's memoir of her years in Africa, from 1914 to 1931, on a four-thousand-acre coffee plantation in the hills near Nairobi. She had come to Kenya from Denmark with her husband, and when they separated she stayed on to manage the farm by herself, visited frequently by her lover, the big-game hunter Denys Finch-Hatton, for whom she would make up st", " is Isak Dinesen's memoir of her years in Africa, from 1914 to 1931, on a four-thousand-acre coffee plantation in the hills near Nairobi. She had come to Kenya from Denmark with her husband, and when they separated she stayed on to manage the farm by herself, visited frequently by her lover, the big-game hunter Denys Finch-Hatton, for whom she would make up stories \"like Scheherazade.\" In Africa, \"I learned how to tell tales,\" she recalled many years later. \"The natives have an ear still. I told stories constantly to them, all kinds.\" Her account of her African adventures, written after she had lost her beloved farm and returned to Denmark, is that of a master storyteller, a woman whom John Updike called \"one of the most picturesque and flamboyant literary personalities of the century.\""], "author": "Isak Dinesen", "num_pages": "399", "awards": [], "places": ["Africa", "Nairobi", "Kenya"], "character_names": ["Gustav Mohr", "Isak Dinesen"], "language": "English", "publish_date": "1992-08-16 00:00:00", "ISBN": "0679600213"},
{"url": "https://www.goodreads.com/book/show/79550.The_Summer_Book", "num_ratings": "12,288", "num_reviews": "1,596", "avg_ratings": 4.1, "genres": ["Fiction", "Short Stories", "European Literature", "Scandinavian Literature"], "title": "The Summer Book", "description": ["An elderly artist and her six-year-old granddaughter while away a summer together on a tiny island in the gulf of Finland. Gradually, the two learn to adjust to each other's fears, whims and yearnings for independence, and a fierce yet understated love emerges - one that encompasses not only the summer inhabitants but the island itself, with its mossy rocks, windswept firs", "An elderly artist and her six-year-old granddaughter while away a summer together on a tiny island in the gulf of Finland. Gradually, the two learn to adjust to each other's fears, whims and yearnings for independence, and a fierce yet understated love emerges - one that encompasses not only the summer inhabitants but the island itself, with its mossy rocks, windswept firs and unpredictable seas.", "Full of brusque humour and wisdom, ", " is a profoundly life-affirming story. Tove Jansson captured much of her own experience and spirit in the book, which was her favourite of the novels she wrote for adults. This new edition sees the return of a European literary gem - fresh, authentic and deeply humane."], "author": "Tove Jansson", "num_pages": "172", "awards": [], "places": ["Finland"], "character_names": [], "language": "English", "publish_date": "2003-05-29 00:00:00", "ISBN": "0954221710"},
{"url": "https://www.goodreads.com/book/show/15796700-americanah", "num_ratings": "169,639", "num_reviews": "16,436", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Feminism", "Literary Fiction"], "title": "Americanah", "description": ["Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a d", "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London. Fifteen years later, they reunite in a newly democratic Nigeria, and reignite their passion—for each other and for their homeland.", "Source: chimamanda.com"], "author": "Chimamanda Ngozi Adichie", "num_pages": "477", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0307271080"},
{"url": "https://www.goodreads.com/book/show/6952.Like_Water_for_Chocolate", "num_ratings": "297,606", "num_reviews": "7,299", "avg_ratings": 3.94, "genres": ["Fiction", "Romance", "Magical Realism", "Historical", "Historical Fiction", "Classics", "Fantasy", "Food and Drink", "Food"], "title": "Like Water for Chocolate", "description": ["Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico became a best-selling phenomenon with its winning blend of poignant romance and bittersweet wit.", "The number one bestseller in Mexico and America for almost two years, and subsequently a bestseller around the world, ", " is a romantic, poignant tale, touched with", "Earthy, magical, and utterly charming, this tale of family life in turn-of-the-century Mexico became a best-selling phenomenon with its winning blend of poignant romance and bittersweet wit.", "The number one bestseller in Mexico and America for almost two years, and subsequently a bestseller around the world, ", " is a romantic, poignant tale, touched with moments of magic, graphic earthiness, bittersweet wit - and recipes. ", "A sumptuous feast of a novel, it relates the bizarre history of the all-female De La Garza family. Tita, the youngest daughter of the house, has been forbidden to marry, condemned by Mexican tradition to look after her mother until she dies. But Tita falls in love with Pedro, and he is seduced by the magical food she cooks. In desperation, Pedro marries her sister Rosaura so that he can stay close to her, so that Tita and Pedro are forced to circle each other in unconsummated passion. Only a freakish chain of tragedies, bad luck and fate finally reunite them against all the odds."], "author": "Laura Esquivel", "num_pages": "221", "awards": ["Prêmio Jabuti for Tradução (1994)", "American Booksellers Book Of The Year  Award for Adult Trade (1994)"], "places": ["Mexico"], "character_names": ["Tita de la Garza", "Gertrudis de la Garza", "Rosaura de la Garza", "Mamá Elena", "Pedro Muzquiz", "John Brown", "Nacha", "Chencha", "Juan Alejandrez"], "language": "English", "publish_date": "1996-10-01 00:00:00", "ISBN": "0552995878"},
{"url": "https://www.goodreads.com/book/show/48855.The_Diary_of_a_Young_Girl", "num_ratings": "2,254,414", "num_reviews": "23,243", "avg_ratings": 4.12, "genres": ["Nonfiction", "Classics", "History", "Biography", "Autobiography", "Memoir"], "title": "The Diary of a Young Girl", "description": ["Anne Frank's extraordinary diary, written in the Amsterdam attic where she and her family hid from the Nazis for two years, has become a world classic and a timeless testament to the human spirit. Now, in a new edition enriched by many passages originally withheld by her father, we meet an Anne more real, more human, and more vital than ever. Here she is first and foremost", "Anne Frank's extraordinary diary, written in the Amsterdam attic where she and her family hid from the Nazis for two years, has become a world classic and a timeless testament to the human spirit. Now, in a new edition enriched by many passages originally withheld by her father, we meet an Anne more real, more human, and more vital than ever. Here she is first and foremost a teenage girl—stubbornly honest, touchingly vulnerable, in love with life. She imparts her deeply secret world of soul-searching and hungering for affection, rebellious clashes with her mother, romance and newly discovered sexuality, and wry, candid observations of her companions. Facing hunger, fear of discovery and death, and the petty frustrations of such confined quarters, Anne writes with adult wisdom and views beyond her years. Her story is that of every teenager, lived out in conditions few teenagers have ever known."], "author": "Anne Frank", "num_pages": "283", "awards": ["Luisterboek Award (2008)"], "places": ["Amsterdam"], "character_names": ["Anne Frank", "Otto Frank", "Petronella Van Daan", "Hermann Van Daan", "Margot Frank", "Peter Van Daan", "Edith Frank", "Miep Gies", "Albert Dussel"], "language": "English", "publish_date": "1993-07-16 00:00:00", "ISBN": "0553296981"},
{"url": "https://www.goodreads.com/book/show/457264.The_Second_Sex", "num_ratings": "23,541", "num_reviews": "976", "avg_ratings": 4.11, "genres": ["Feminism", "Nonfiction", "Philosophy", "Classics", "Gender"], "title": "The Second Sex", "description": ["Newly translated and unabridged in English for the first time, Simone de Beauvoir’s masterwork is a powerful analysis of the Western notion of “woman,” and a groundbreaking exploration of inequality and otherness.  This long-awaited new edition reinstates significant portions of the original French text that were cut in the first English translation. Vital and groundbreaki", "Newly translated and unabridged in English for the first time, Simone de Beauvoir’s masterwork is a powerful analysis of the Western notion of “woman,” and a groundbreaking exploration of inequality and otherness.  This long-awaited new edition reinstates significant portions of the original French text that were cut in the first English translation. Vital and groundbreaking, Beauvoir’s pioneering and impressive text remains as pertinent today as it was sixty years ago, and will continue to provoke and inspire generations of men and women to come."], "author": "Simone de Beauvoir", "num_pages": "746", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-12-17 00:00:00", "ISBN": "0679724516"},
{"url": "https://www.goodreads.com/book/show/18749.Half_of_a_Yellow_Sun", "num_ratings": "69,512", "num_reviews": "6,171", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21", "Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed. ", "With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another. ", "Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had."], "author": "Chimamanda Ngozi Adichie", "num_pages": "433", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "1400044162"},
{"url": "https://www.goodreads.com/book/show/9331.The_House_of_the_Spirits", "num_ratings": "153,058", "num_reviews": "6,035", "avg_ratings": 4.21, "genres": ["Fiction", "Magical Realism", "Historical", "Historical Fiction", "Classics", "Fantasy"], "title": "The House of the Spirits", "description": ["Here, in an astonishing debut by a gifted storyteller, is the magnificent saga of proud and passionate men and women and the turbulent times through which they suffer and triumph. They are the Truebas. And theirs is a world you will not want to leave, and one you will not forget.", "Esteban -- The patriarch, a volatile and proud man whose lust for land is legendary and who is", "Here, in an astonishing debut by a gifted storyteller, is the magnificent saga of proud and passionate men and women and the turbulent times through which they suffer and triumph. They are the Truebas. And theirs is a world you will not want to leave, and one you will not forget.", "Esteban -- The patriarch, a volatile and proud man whose lust for land is legendary and who is haunted by his tyrannical passion for the wife he can never completely possess.", "Clara -- The matriarch, elusive and mysterious, who foretells family tragedy and shapes the fortunes of the house of the Truebas.", "Blanca -- Their daughter, soft-spoken yet rebellious, whose shocking love for the son of her father's foreman fuels Esteban's everlasting contempt... even as it produces the grandchild he adores.", "Alba -- The fruit of Blanca's forbidden love, a luminous bearty, a fiery and willful woman... the family's break with the past and link to the future."], "author": "Isabel Allende", "num_pages": "433", "awards": ["Deutscher Hörbuchpreis for Beste Fiktion (2011)", "Prix du Grand Roman d'évasion (1984)"], "places": ["Chile"], "character_names": ["Esteban Trueba", "Clara del Valle", "Férula Trueba", "Blanca Trueba", "Jaime Trueba", "Nicolàs Trueba", "Pedro Tercero Garcia", "Alba Trueba", "Esteban Garcia"], "language": "English", "publish_date": "1986-08-01 00:00:00", "ISBN": "0553273914"}
]