[
{"url": "https://www.goodreads.com/book/show/693208.The_Absolutely_True_Diary_of_a_Part_Time_Indian", "num_ratings": "191,231", "num_reviews": "21,153", "avg_ratings": 4.12, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Contemporary", "Humor"], "title": "The Absolutely True Diary of a Part-Time Indian", "description": ["Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolut", "Bestselling author Sherman Alexie tells the story of Junior, a budding cartoonist growing up on the Spokane Indian Reservation. Determined to take his future into his own hands, Junior leaves his troubled school on the rez to attend an all-white farm town high school where the only other Indian is the school mascot.", "Heartbreaking, funny, and beautifully written, The Absolutely True Diary of a Part-Time Indian, which is based on the author's own experiences, coupled with poignant drawings by Ellen Forney that reflect the character's art, chronicles the contemporary adolescence of one Native American boy as he attempts to break away from the life he was destined to live.", "With a forward by Markus Zusak, interviews with Sherman Alexie and Ellen Forney, and four-color interior art throughout, this edition is perfect for fans and collectors alike. "], "author": "Sherman Alexie", "num_pages": "230", "awards": ["National Book Award for Young People's Literature (2007)", "Odyssey Award (2009)", "American Indian Library Association Award", "South Carolina Book Award Nominee for Young Adult Book Award (2010)", "Michigan Library Association Thumbs Up! Award Nominee (2008)", "Florida Teens Read Nominee (2009)", "American Indian Youth Literature Award for Best Young Adult Book (Award Retroactively Rescinded in 2018) (2008)", "Boston Globe-Horn Book Award for Fiction (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "California Young Readers Medal for Young Adult (2010)", "Lincoln Award Nominee (2011)", "James Cook Book Award Nominee (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["United States of America", "Washington (the state)"], "character_names": ["Arnold \"Junior\" Spirit", "Coach", "Rowdy", "Mary \"Runs Away\" Spirit", "Mr. P", "Agnes Adams / Spirit", "Melinda", "Mr. Grant", "Penelope (divers)", "Micah", "Roger \"The Giant\"", "Grandma Spirit", "Eugene", "Dawn", "Mr. Dodge", "Gordy", "Dad Spirit", "Rowdy's Dad", "Mr. Sheridan", "Earl", "Gerald", "Ted", "Bobby"], "language": "English", "publish_date": "2007-09-12 00:00:00", "ISBN": "0316013684"},
{"url": "https://www.goodreads.com/book/show/196429.Medicine_River", "num_ratings": "1,077", "num_reviews": "89", "avg_ratings": 3.75, "genres": ["Fiction", "Cultural", "Canada"], "title": "Medicine River", "description": ["When Will returns to Medicine River, he thinks he is simply attending his mother's funeral. He doesn't count on Harlen Bigbear and his unique brand of community planning. Harlen tries to sell Will on the idea of returning to Medicine River to open shop as the town's only Native photographer. Somehow, that's exactly what happens. Through Will's gentle and humorous narrative", "When Will returns to Medicine River, he thinks he is simply attending his mother's funeral. He doesn't count on Harlen Bigbear and his unique brand of community planning. Harlen tries to sell Will on the idea of returning to Medicine River to open shop as the town's only Native photographer. Somehow, that's exactly what happens. Through Will's gentle and humorous narrative, we come to know Medicine River, a small Albertan town bordering a Blackfoot reserve. And we meet its people: the basketball team; Louise Heavyman and her daughter, South Wing; Martha Oldcrow, the marriage doctor; Joe Bigbear, Harlen's world-travelling, storytelling brother; Bertha Morley, who has a short fling with a Calgary dating service; and David Plume, who went to Wounded Knee. At the centre of it all is Harlen, advising and pestering, annoying and entertaining, gossiping and benevolently interfering in the lives of his friends and neighbours."], "author": "Thomas King", "num_pages": "249", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-09-27 00:00:00", "ISBN": "014305435X"},
{"url": "https://www.goodreads.com/book/show/52877.The_Toughest_Indian_in_the_World", "num_ratings": "6,210", "num_reviews": "394", "avg_ratings": 4.08, "genres": ["Fiction", "Short Stories", "Literature", "Literature", "American"], "title": "The Toughest Indian in the World", "description": ["A beloved American writer whose books are championed by critics and readers alike, Sherman Alexie has been hailed by Time as \"one of the better new novelists, Indian or otherwise.\" ", "In these stories, we meet the kind of American Indians we rarely see in literature -- the kind who pay their bills, hold down jobs, fall in and out of love. ", "A Spokane Indian journalist transplan", "A beloved American writer whose books are championed by critics and readers alike, Sherman Alexie has been hailed by Time as \"one of the better new novelists, Indian or otherwise.\" ", "In these stories, we meet the kind of American Indians we rarely see in literature -- the kind who pay their bills, hold down jobs, fall in and out of love. ", "A Spokane Indian journalist transplanted from the reservation to the city picks up a hitchhiker, a Lummi boxer looking to take on the toughest Indian in the world. A Spokane son waits for his diabetic father to come home from the hospital, tossing out the Hershey Kisses the father has hidden all over the house. An estranged interracial couple, separated in the midst of a traffic accident, rediscover their love for each other. A white drifter holds up an International House of Pancakes, demanding a dollar per customer and someone to love, and emerges with $42 and an overweight Indian he dubs Salmon Boy. ", "Sherman Alexie's voice is one of remarkable passion, and these stories are love stories -- between parents and children, white people and Indians, movie stars and ordinary people. Witty, tender, and fierce, ", " is a virtuoso performance by one of the country's finest writers."], "author": "Sherman Alexie", "num_pages": "256", "awards": ["Kiriyama Prize Nominee for Fiction (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-01 00:00:00", "ISBN": "0802138004"},
{"url": "https://www.goodreads.com/book/show/17174.A_Yellow_Raft_in_Blue_Water", "num_ratings": "15,884", "num_reviews": "910", "avg_ratings": 3.86, "genres": ["Fiction", "Classics", "Academic", "School"], "title": "A Yellow Raft in Blue Water", "description": ["Michael Dorris has crafted a fierce saga of three generations of Indian women, beset by hardships and torn by angry secrets, yet inextricably joined by the bonds of kinship. Starting in the present day and moving backward, the novel is told in the voices of the three women: fifteen-year-old part-black Rayona; her American Indian mother, Christine, consumed by tenderness an", "Michael Dorris has crafted a fierce saga of three generations of Indian women, beset by hardships and torn by angry secrets, yet inextricably joined by the bonds of kinship. Starting in the present day and moving backward, the novel is told in the voices of the three women: fifteen-year-old part-black Rayona; her American Indian mother, Christine, consumed by tenderness and resentment toward those she loves; and the fierce and mysterious Ida, mother and grandmother whose haunting secrets, betrayals, and dreams echo through the years, braiding together the strands of the shared past."], "author": "Michael Dorris", "num_pages": "372", "awards": [], "places": ["Montana"], "character_names": [], "language": "English", "publish_date": "2003-03-05 00:00:00", "ISBN": "0312421850"},
{"url": "https://www.goodreads.com/book/show/158454.The_Last_of_the_Mohicans", "num_ratings": "78,384", "num_reviews": "2,244", "avg_ratings": 3.7, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Adventure", "Literature"], "title": "The Last of the Mohicans", "description": ["Set against the French and Indian siege of Fort William Henry in 1757, ", " recounts the story of two sisters, Cora and Alice Munro, daughters of the English commander, who are struggling to be reunited with their father", "Set against the French and Indian siege of Fort William Henry in 1757, ", " recounts the story of two sisters, Cora and Alice Munro, daughters of the English commander, who are struggling to be reunited with their father. They are aided in their perilous journey by Hawk-eye, a frontier scout and his companions Chingachgook and Uncas, the only two survivors of the Mohican tribe. But their lives are endangered by the Mangua, the savage Indian traitor who captures the sisters, wanting Cora to be his squaw. In setting Indian against Indian and the brutal society of the white man against the civilization of the Mohican, Cooper, more than any author before or since, shaped the American sense of itself as a nation."], "author": "James Fenimore Cooper", "num_pages": "350", "awards": [], "places": ["Upstate New York"], "character_names": ["Nathaniel Bumppo", "Chingachgook", "Magua", "Uncas", "Cora Munro", "Alice Munro", "Colonel George Munro", "Duncan Heyward", "David Gamut", "Tamenund", "General Marquis de Montcalm", "General Daniel Webb"], "language": "English", "publish_date": "1986-11-27 00:00:00", "ISBN": "0140390243"},
{"url": "https://www.goodreads.com/book/show/237077.Perma_Red", "num_ratings": "506", "num_reviews": "68", "avg_ratings": 4.05, "genres": ["Fiction", "Historical", "Historical Fiction", "Westerns", "Literature", "American"], "title": "Perma Red", "description": ["On the reservation, danger looms everywhere, rising out of fear and anger, deprivation and poverty. Fiery-haired Louise White Elk dreams of both belonging and escape, and of discovering love and freedom on her own terms. But she is a beautiful temptation for three men-each more dangerous than the next-who will do anything to possess her..."], "author": "Debra Magpie Earling", "num_pages": "320", "awards": ["American Book Award (2003)", "Montana Book Award Nominee (2002)", "Washington State Book Award (2003)", "Spur Award for Best Novel of the West (2003)", "WILLA Literary Award for Contemporary Fiction (2003)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-06-03 00:00:00", "ISBN": "0425190544"},
{"url": "https://www.goodreads.com/book/show/33100568-as-tears-go-by", "num_ratings": "25", "num_reviews": "11", "avg_ratings": 4.8, "genres": ["Nonfiction", "Race"], "title": "As Tears Go By: Inspired by True Events", "description": ["I changed their names. I shaped their minds. I was judge, jury, and executioner. No one could stop me. No one! ", "To anyone looking in, we were just a normal church going, family. No one was aware of the dark secrets we held within the walls of the tiny house by the swamp. ", "I was the woman with the razor strop and I made sure every blow connected. ", "That was until the day the sh", "I changed their names. I shaped their minds. I was judge, jury, and executioner. No one could stop me. No one! ", "To anyone looking in, we were just a normal church going, family. No one was aware of the dark secrets we held within the walls of the tiny house by the swamp. ", "I was the woman with the razor strop and I made sure every blow connected. ", "That was until the day the sheriff handed me my subpoena. I felt the hair stand up on the back of my neck. Abuse? What? The one-word ringing in my head drowning out anything and everything else that might have been said. I felt I might just pass out right there on the step. I kept my composure until he pulled out of the driveway and then my anger quickly exploded into rage. ", "Those ungrateful little bastards. After everything, I did for them. This was my thanks. ", "A bolt of straight adrenaline shot through my veins and I grabbed the gun….. ", "I had instilled the fear of god in them. I am not a woman to be tampered with. How could this be happening? ", "My one mistake…and I don’t make many… was not realizing that these stupid children would grow up. "], "author": "Rosie Christie", "num_pages": "183", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/52385.Almanac_of_the_Dead", "num_ratings": "2,298", "num_reviews": "236", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Literature", "Novels"], "title": "Almanac of the Dead", "description": ["In its extraordinary range of character and culture, Almanac of the Dead is fiction on the grand scale. The acclaimed author of Ceremony has undertaken a weaving of ideas and lives, fate and history, passion and conquest in an attempt to re-create the moral history of the Americas, told from the point of view of the conquered, not the conquerors."], "author": "Leslie Marmon Silko", "num_pages": "768", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-11-01 00:00:00", "ISBN": "0140173196"},
{"url": "https://www.goodreads.com/book/show/1110880.Spider_Woman_s_Granddaughters", "num_ratings": "291", "num_reviews": "13", "avg_ratings": 4.07, "genres": ["Fiction", "Short Stories"], "title": "Spider Woman's Granddaughters: Traditional Tales and Contemporary Writing by Native American Women", "description": ["\"Impressive....Haunting....Enchanting...Every story in the book, which covers nearly a century of tradition, is interesting, written with intelligent passion.\"", "THE NEW YORK TIMES BOOK REVIEW", "Native American scholar, literary critic, poet, and novelist Paula Gunn Allen, who is herself a Laguna Pueblo-Sioux Indian, became increasingly aware in her academic career that the writ", "\"Impressive....Haunting....Enchanting...Every story in the book, which covers nearly a century of tradition, is interesting, written with intelligent passion.\"", "THE NEW YORK TIMES BOOK REVIEW", "Native American scholar, literary critic, poet, and novelist Paula Gunn Allen, who is herself a Laguna Pueblo-Sioux Indian, became increasingly aware in her academic career that the writings of Native Americans, especially women, have been marginalized by the Western literary canon. Allen set out to understand why this was so and, more importantly, to remedy the situation. The result is this powerful collection of traditional tales, biographical writings, and contemporary short stories, many by the most accomplished Native American women writing today, including: Louise Erdrich, Mary TallMountain, Linda Hogan, and many others."], "author": "Paula Gunn Allen", "awards": ["American Book Award (1990)"], "places": [], "character_names": [], "language": "English", "publish_date": "1990-08-01 00:00:00", "ISBN": "0704342383"},
{"url": "https://www.goodreads.com/book/show/530878.Mean_Spirit", "num_ratings": "900", "num_reviews": "78", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "Mystery"], "title": "Mean Spirit", "description": ["SELECTED BY THE LITERARY GUILD", "\"Extraordinary...If you take up no other novel this year, or next, this one will suffice to hold, to disturb, to enlighten and to inspire you.\"", "NEWSDAY", "Early in this century, rivers of oil were found beneath Oklahoma land belonging to Indian people, and beautiful Grace Banket became the richest person in the Territory. But she was murdered by th", "SELECTED BY THE LITERARY GUILD", "\"Extraordinary...If you take up no other novel this year, or next, this one will suffice to hold, to disturb, to enlighten and to inspire you.\"", "NEWSDAY", "Early in this century, rivers of oil were found beneath Oklahoma land belonging to Indian people, and beautiful Grace Banket became the richest person in the Territory. But she was murdered by the greed of white men, and the Graycloud family, who cared for her daughter, began dying mysteriously. Letters sent to Washington, D.C. begging for help went unanswered, until at last a Native American government official, Stace Red Hawk, traveled west to investigate. What he found has been documented by history: rampant fraud, intimidation, and murder. But he also found something truly extraordinary--his deepest self and abiding love for his people, and their brave past."], "author": "Linda Hogan", "num_pages": "384", "awards": ["Pulitzer Prize Nominee for Fiction (1991)"], "places": [], "character_names": [], "language": "English", "publish_date": "1991-11-24 00:00:00", "ISBN": "0804108633"},
{"url": "https://www.goodreads.com/book/show/1136118.The_Beet_Queen", "num_ratings": "11,642", "num_reviews": "483", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels", "Literary Fiction", "Contemporary"], "title": "The Beet Queen", "description": ["Now, from the award-winning author of ", " comes a vibrant tale of abandonment and sexual obsession, jealousy and unstinting love. On a spring morning in 1932, young Karl and Mary Adare arrive by boxcar in Argus, North Dakota. Orphaned in a most peculiar way, Karl and Mary look for refuge to their mother's sister Fritzie, who with her husband, Pete, runs a butche", "Now, from the award-winning author of ", " comes a vibrant tale of abandonment and sexual obsession, jealousy and unstinting love. On a spring morning in 1932, young Karl and Mary Adare arrive by boxcar in Argus, North Dakota. Orphaned in a most peculiar way, Karl and Mary look for refuge to their mother's sister Fritzie, who with her husband, Pete, runs a butcher shop. So begins an exhilerating 40-year saga brimming with unforgettable characters: Ordinary Mary, who causes a miracle ; seductive Karl, who lacks Mary's gift for survival; Sita, their lovely, disturbed, ambitious cousin; Wallace Pfef, a town leader bearing a lonely secret; Celestine James, a mixed-blood Chippewa; and her daughter, Dot. Theirs is a story grounded in the tenacity of relationships, the magic of natural events and the unending mystery of the human condition."], "author": "Louise Erdrich", "num_pages": "340", "awards": ["National Book Critics Circle Award Nominee for Fiction (1986)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "1989-08-01 00:00:00", "ISBN": "0553347233"},
{"url": "https://www.goodreads.com/book/show/17071488-if-i-ever-get-out-of-here", "num_ratings": "1,815", "num_reviews": "375", "avg_ratings": 3.92, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Realistic Fiction", "Music"], "title": "If I Ever Get Out of Here", "description": ["Lewis \"Shoe\" Blake is used to the joys and difficulties of life on the Tuscarora Indian reservation in 1975: the joking, the Fireball games, the snow blowing through his roof. What he's not used to is white people being nice to him -- people like George Haddonfield, whose family recently moved to town with the Air Force. As the boys connect through their mutual passion for", "Lewis \"Shoe\" Blake is used to the joys and difficulties of life on the Tuscarora Indian reservation in 1975: the joking, the Fireball games, the snow blowing through his roof. What he's not used to is white people being nice to him -- people like George Haddonfield, whose family recently moved to town with the Air Force. As the boys connect through their mutual passion for music, especially the Beatles, Lewis has to lie more and more to hide the reality of his family's poverty from George. He also has to deal with the vicious Evan Reininger, who makes Lewis the special target of his wrath. But when everyone else is on Evan's side, how can he be defeated? And if George finds out the truth about Lewis's home -- will he still be his friend?", "Acclaimed adult author Eric Gansworth makes his YA debut with this wry and powerful novel about friendship, memory, and the joy of rock 'n' roll."], "author": "Eric Gansworth", "num_pages": "368", "awards": ["American Indian Youth Literature Award for Best Young Adult Book (Honor Book) (2014)", "Alabama Library Association Children's Book of the Year Nominee for 6-8 Fiction (2014)"], "places": ["Niagara County, New York"], "character_names": [], "language": "English", "publish_date": "2013-07-30 00:00:00", "ISBN": "0545417309"},
{"url": "https://www.goodreads.com/book/show/12676411-the-bingo-palace", "num_ratings": "3,951", "num_reviews": "152", "avg_ratings": 3.87, "genres": ["Fiction", "Novels", "Literature"], "title": "The Bingo Palace", "description": ["Immediately upon returning to his North Dakota Chippewa reservation, Lipsha Morrissey--having failed in the outside world--falls head over heels in love with the beautiful Shawnee Ray. She is the fierce and ambitious mother of the illegitimate son of Lyman Lamartine, owner of the Bingo Palace and a powerful force on the reservation. Lyman is determined to marry Shawnee Ray", "Immediately upon returning to his North Dakota Chippewa reservation, Lipsha Morrissey--having failed in the outside world--falls head over heels in love with the beautiful Shawnee Ray. She is the fierce and ambitious mother of the illegitimate son of Lyman Lamartine, owner of the Bingo Palace and a powerful force on the reservation. Lyman is determined to marry Shawnee Ray, who is just as determined to elude him and go to college. When Lipsha goes to work for Lyman, he also enters into a battle for Shawnee Ray's affections, calling first on the magic of tribal elder Fleur Pillager, then on luck, and finally on traditional tribal religion. Erdrich's fourth novel is at once comic and moving, magical and realistic, and filled with evidence of her awesome descriptive powers. The affecting ending makes the reader hungry for more."], "author": "Louise Erdrich", "num_pages": "276", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/52879.Ten_Little_Indians", "num_ratings": "5,948", "num_reviews": "517", "avg_ratings": 4.08, "genres": ["Short Stories", "Fiction", "Contemporary"], "title": "Ten Little Indians", "description": ["Sherman Alexie offers nine poignant and emotionally resonant stories about Native Americans who find themselves at personal and cultural crossroads. In 'The Life and Times of Estelle Walks Above', an intellectual feminist Spokane Indian woman saves the lives of dozens of white women all around her, to the bewilderment of her only child. In 'Do You Know Where I Am?' two col", "Sherman Alexie offers nine poignant and emotionally resonant stories about Native Americans who find themselves at personal and cultural crossroads. In 'The Life and Times of Estelle Walks Above', an intellectual feminist Spokane Indian woman saves the lives of dozens of white women all around her, to the bewilderment of her only child. In 'Do You Know Where I Am?' two college sweethearts rescue a lost cat - a simple act that has profound moral consequences for the rest of their lives together. In 'What You Pawn I Will Redeem', a homeless Indian man must raise $1,000 in twenty-four hours to buy back the fancy dance outfit stolen from his grandmother fifty years earlier.", "Even as they often make us laugh, Sherman Alexie's stories are driven by a haunting lyricism and naked candour that cut to the heart of the human experience."], "author": "Sherman Alexie", "num_pages": "256", "awards": ["O. Henry Award for 'What You Pawn I Will Redeem' (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-06 00:00:00", "ISBN": "009946456X"},
{"url": "https://www.goodreads.com/book/show/110996.House_Made_of_Dawn", "num_ratings": "5,693", "num_reviews": "377", "avg_ratings": 3.68, "genres": ["Fiction", "Classics", "Literature"], "title": "House Made of Dawn", "description": ["The magnificent Pulitzer Prize-winning novel of a proud stranger in his native land.", "He was a young American Indian named Abel, and he lived in two worlds. One was that of his father, wedding him to the rhythm of the seasons, the harsh beauty of the land, the ecstasy of the drug called peyote. The other was the world of the twentieth century, goading him into a compulsive c", "The magnificent Pulitzer Prize-winning novel of a proud stranger in his native land.", "He was a young American Indian named Abel, and he lived in two worlds. One was that of his father, wedding him to the rhythm of the seasons, the harsh beauty of the land, the ecstasy of the drug called peyote. The other was the world of the twentieth century, goading him into a compulsive cycle of sexual exploits, dissipation, and disgust. Home from a foreign war, he was a man being torn apart, a man descending into hell."], "author": "N. Scott Momaday", "num_pages": "198", "awards": ["Pulitzer Prize for Fiction (1969)"], "places": ["New Mexico"], "character_names": [], "language": "English", "publish_date": "2000-05-02 00:00:00", "ISBN": "0072434201"},
{"url": "https://www.goodreads.com/book/show/33512.One_Thousand_White_Women", "num_ratings": "100,810", "num_reviews": "7,815", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Book Club"], "title": "One Thousand White Women: The Journals of May Dodd", "description": [" is the story of May Dodd and a colorful assembly of pioneer women who, under the auspices of the U.S. government, travel to the western prairies in 1875 to intermarry among the Cheyenne Indians. The covert and controversial \"Brides for Indians\" program, launched by the administration of Ulysses S. Grant, is intended to help assimilate the Indians i", " is the story of May Dodd and a colorful assembly of pioneer women who, under the auspices of the U.S. government, travel to the western prairies in 1875 to intermarry among the Cheyenne Indians. The covert and controversial \"Brides for Indians\" program, launched by the administration of Ulysses S. Grant, is intended to help assimilate the Indians into the white man's world. Toward that end May and her friends embark upon the adventure of their lifetime. Jim Fergus has so vividly depicted the American West that it is as if these diaries are a capsule in time."], "author": "Jim Fergus", "num_pages": "434", "awards": [], "places": ["United States of America"], "character_names": ["May Dodd", "Little Wolf", "Ulysses S. Grant"], "language": "English", "publish_date": "1999-02-15 00:00:00", "ISBN": "0312199430"},
{"url": "https://www.goodreads.com/book/show/1225336.Shadow_Catcher", "num_ratings": "17", "num_reviews": "2", "avg_ratings": 3.29, "genres": ["Fiction", "Westerns", "Historical", "Historical Fiction", "Science", "Natural History", "Animals"], "title": "Shadow Catcher: A Novel", "description": ["In an early 1900s expedition to Indian reservations in the West, sent to convince the Indians to surrender their culture and become U.S. citizens, a member of the party is sending unauthorized photographs of the miserable conditions of the reservation to a Washington paper. A powerful portrayal, based on actual events."], "author": "Charles Fergus", "num_pages": "308", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-09-01 00:00:00", "ISBN": "0939149559"},
{"url": "https://www.goodreads.com/book/show/2055794.Skeleton_of_a_Bridge", "num_ratings": "9", "num_reviews": "2", "avg_ratings": 4.0, "genres": ["Fiction", "Adult Fiction"], "title": "Skeleton of a Bridge", "description": ["Rare 2002 6th Printing Softcover Signed by the Author in Very Good Condition out of a private nonsmoking estate. Tight spine, great covers, clear, crisp pages, light rub marks on corners from light use/shelf wear. Ships same day as payment received!"], "author": "Robert Mirabal", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-12-01 00:00:00", "ISBN": "188396802X"},
{"url": "https://www.goodreads.com/book/show/867387.The_Blessing_Way", "num_ratings": "17,061", "num_reviews": "752", "avg_ratings": 4.06, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "The Blessing Way", "description": [".", "Homicide is always an abomination, but there is something exceptionally disturbing about the victim discovered in a high lonely place, a corpse with a mouth full of sand, abandoned at a crime scene seemingly devoid of tracks or useful clues. Though it goes against his better judgment, Navajo Tribal Police Lieutenant Joe Leaphorn ca", ".", "Homicide is always an abomination, but there is something exceptionally disturbing about the victim discovered in a high lonely place, a corpse with a mouth full of sand, abandoned at a crime scene seemingly devoid of tracks or useful clues. Though it goes against his better judgment, Navajo Tribal Police Lieutenant Joe Leaphorn cannot help but suspect the hand of a supernatural killer. There is palpable evil in the air, and Leaphorn's pursuit of a Wolf-Witch is leading him where even the bravest men fear, on a chilling trail that winds perilously between mysticism and murder."], "author": "Tony Hillerman", "num_pages": "320", "awards": ["Edgar Award Nominee for Best First Novel (1971)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Emma Leaphorn", "Bergen McKee", "Ellen Leon", "Jim Hall", "Jeremy Canfield", "Luis Horseman"], "language": "English", "publish_date": "1990-03-07 00:00:00", "ISBN": "0061000019"},
{"url": "https://www.goodreads.com/book/show/734770.Spirit_Woman", "num_ratings": "190", "num_reviews": "6", "avg_ratings": 4.16, "genres": ["Spirituality"], "title": "Spirit Woman: The Teachings of the Shields", "description": ["Lynn V. Andrews takes the reader with her as she goes on inward journeys with the help of the Sisterhood of the Shields, and relates the stories of others.", "Join her as she is initiated into the Sisterhood and creates her own shield, which will show her the nature of her spiritual path (", "). Follow her to the Yucatan, where the medicine wheel leads her, and she is", "Lynn V. Andrews takes the reader with her as she goes on inward journeys with the help of the Sisterhood of the Shields, and relates the stories of others.", "Join her as she is initiated into the Sisterhood and creates her own shield, which will show her the nature of her spiritual path (", "). Follow her to the Yucatan, where the medicine wheel leads her, and she is faced with the terrifying reality of the butterfly tree (", "). Enter the Dreamtime with her, where she emerges in medieval England as Catherine, and encounters the Grandmother, who offers to show Andrews how to make her life one of goodness, power, adventure, and love (", ").", "Not all these stories describe the author's own spiritual experiences. Meet Sin Coraz?n, an initiate into the Sisterhood, whose husband abandons her. She nearly succumbs to her inner dark power and unleashes her rage on men and the Sisterhood (", "). Andrews also writes about the elder women of the Sisterhood: their loves, their lives, their losses (", ").", "Andrews shows us how to channel our own spiritual and intellectual energy and balance the need for love with the desire for power (", "). She takes the reader on numerous spiritual journeys that inevitably uplift."], "author": "Lynn V. Andrews", "num_pages": "203", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1585425761"},
{"url": "https://www.goodreads.com/book/show/8730822-though-not-dead", "num_ratings": "3,415", "num_reviews": "342", "avg_ratings": 4.26, "genres": ["Mystery", "Fiction", "Thriller", "Mystery Thriller"], "title": "Though Not Dead", "description": ["The residents of Alaska’s largest national park are stunned by the death of one of their oldest members, eighty-seven-year-old Sam Dementieff…even investigator Kate Shugak. Sam, a lifelong resident, was dubbed the “father” of all of the Park rats—even though he had no children of his own. Kate, his niece, is surprised to discover that in his will he’s left her everything,", "The residents of Alaska’s largest national park are stunned by the death of one of their oldest members, eighty-seven-year-old Sam Dementieff…even investigator Kate Shugak. Sam, a lifelong resident, was dubbed the “father” of all of the Park rats—even though he had no children of his own. Kate, his niece, is surprised to discover that in his will he’s left her everything, including a letter instructing her simply to, “find my father.” In the three days after Kate begins her search through Sam’s background, she gets threatened—and worse. Kate struggles to fulfill Sam’s last wish without losing her own life to the people who are following her every move. Long-lost family secrets and fatal consequences are interwoven with the epic history of an unforgiving land. ", " "], "author": "Dana Stabenow", "num_pages": "464", "awards": [], "places": [], "character_names": ["Kate Shugak"], "language": "English", "publish_date": "2011-02-01 00:00:00", "ISBN": "0312559119"},
{"url": "https://www.goodreads.com/book/show/4578640-born-with-a-tooth", "num_ratings": "872", "num_reviews": "90", "avg_ratings": 4.03, "genres": ["Short Stories", "Cultural", "Canada", "Fiction"], "title": "Born with a Tooth", "description": ["Almost a decade after its original publication, award winner and Governor General Literary Award nominee Joseph Boyden's classic book of short stories is finally being reissued. Born With A Tooth, Boyden's debut work of fiction, is a collection of thirteen beautifully written stories about aboriginal life in Ontario. They are stories of love, unexpected triumph, and a pass", "Almost a decade after its original publication, award winner and Governor General Literary Award nominee Joseph Boyden's classic book of short stories is finally being reissued. Born With A Tooth, Boyden's debut work of fiction, is a collection of thirteen beautifully written stories about aboriginal life in Ontario. They are stories of love, unexpected triumph, and a passionate belief in dreams. They are also stories of anger and longing, of struggling to adapt, of searching but remaining unfulfilled. The collection includes 'Bearwalker', a story that introduces a character who appears again in Boyden's novel Three Day Road. By taking on a new voice in each story, Joseph Boyden explores aboriginal stereotypes and traditions in a most unexpected way. Whether told by a woman trying to forget her past or by a drunken man trying to preserve his culture, each story paints an unforgettable and varied image of modern aboriginal culture in Ontario. An extraordinary first book, Born With A Tooth reveals why Joseph Boyden is a writer worth reading."], "author": "Joseph Boyden", "num_pages": "245", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "1897151349"},
{"url": "https://www.goodreads.com/book/show/12845.Tales_of_Power", "num_ratings": "4,682", "num_reviews": "93", "avg_ratings": 4.14, "genres": ["Fiction", "Philosophy", "Spirituality"], "title": "Tales of Power", "description": ["Don Juan concludes the instruction of Castaneda with his most powerful and mysterious lesson in the sorcerer's art—a dazzling series of visions that are at once an initiation and a deeply moving farewell."], "author": "Carlos Castaneda", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-01-01 00:00:00", "ISBN": "0671732528"},
{"url": "https://www.goodreads.com/book/show/271295.A_Cold_Day_For_Murder", "num_ratings": "11,730", "num_reviews": "1,053", "avg_ratings": 3.73, "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "A Cold Day For Murder", "description": ["Kate Shugak returns to her roots in the far Alaskan north, after leaving the Anchorage D.A.'s office. Her deductive powers are definitely needed when a ranger disappears. Looking for clues among the Aleutian pipeliners, she begins to realize the fine line between lies and loyalties--between justice served and cold murder."], "author": "Dana Stabenow", "num_pages": "208", "awards": ["Edgar Award for Best Paperback Original (1993)"], "places": [], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin"], "language": "English", "publish_date": "1992-06-01 00:00:00", "ISBN": "042513301X"},
{"url": "https://www.goodreads.com/book/show/777883.People_of_the_Earth", "num_ratings": "3,742", "num_reviews": "79", "avg_ratings": 4.12, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy"], "title": "People of the Earth", "description": ["Set five thousand years ago and ranging through what is now Montana, Wyoming, northern Colorado, and Utah, ", " follows the migration of the Uto-Aztecan people south out of Canada. It is the unforgettable tale of a woman torn between two peoples and two dreams, of the two men who love her and the third who must have her, and of the vision given to the people", "Set five thousand years ago and ranging through what is now Montana, Wyoming, northern Colorado, and Utah, ", " follows the migration of the Uto-Aztecan people south out of Canada. It is the unforgettable tale of a woman torn between two peoples and two dreams, of the two men who love her and the third who must have her, and of the vision given to the peoples long ago by the spirit of the wolf.", "and ", "bestselling authors and award-winning archaeologists W. Michael Gear and Kathleen O'Neal Gear bring the stories of these first North Americans to life in this and other volumes in the magnicent North America's Forgotten Past series."], "author": "W. Michael Gear", "num_pages": "608", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-02-15 00:00:00", "ISBN": "0812507428"},
{"url": "https://www.goodreads.com/book/show/672615.A_Fatal_Thaw", "num_ratings": "4,614", "num_reviews": "269", "avg_ratings": 4.06, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "A Fatal Thaw", "description": ["On her homestead in the middle of twenty million acres of national Park, Aleut P.I. Kate Shugak is caught up in spring cleaning, unaware that just miles away a man's sanity is breaking. When the sound of gunfire finally dies away, nine of his neighbors lie dead in the snow. But did he kill all nine, or only eight? The ninth victim was killed with a different weapon. It's u", "On her homestead in the middle of twenty million acres of national Park, Aleut P.I. Kate Shugak is caught up in spring cleaning, unaware that just miles away a man's sanity is breaking. When the sound of gunfire finally dies away, nine of his neighbors lie dead in the snow. But did he kill all nine, or only eight? The ninth victim was killed with a different weapon. It's up to Kate and her husky-wolf sidekick Mutt to untangle the life of the dead blonde with the tarnished past and find her killer. It won't be easy; every second Park rat had a motive. Was it one of her many spurned lovers? Was a wife looking for revenge? Or did a deal with an ivory smuggler go bad? Even Trooper Jim Chopin, the Park's resident state trooper, had a history with the victim. Kate will need every ounce of determination to find the truth before Alaska metes out its own justice...."], "author": "Dana Stabenow", "num_pages": "208", "awards": [], "places": [], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin", "Bernie Koslowski", "George Perry"], "language": "English", "publish_date": "1993-01-01 00:00:00", "ISBN": "0425135772"},
{"url": "https://www.goodreads.com/book/show/1148403.Kiss_of_the_Fur_Queen", "num_ratings": "1,681", "num_reviews": "116", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Kiss of the Fur Queen", "description": ["In the 1950s, Abraham Okimasis becomes the first Indian ever to win the Trapper's Festival Dog Sled Race and, as tradition dictates, he is kissed by the festival's beautiful Fur Queen. Nine months afterward, Abraham's wife Mariesis gives birth to their son, Champion, in a tent on a trapline in snowy northern Manitoba. Later, three-year-old Champion watches his brother Oone", "In the 1950s, Abraham Okimasis becomes the first Indian ever to win the Trapper's Festival Dog Sled Race and, as tradition dictates, he is kissed by the festival's beautiful Fur Queen. Nine months afterward, Abraham's wife Mariesis gives birth to their son, Champion, in a tent on a trapline in snowy northern Manitoba. Later, three-year-old Champion watches his brother Ooneemeetoo come into the world in the same tent. ", "The boys grow up in a magical Cree Garden of Eden: stars, fish and caribou are their playmates; canoes and dogsleds transport their nomadic family. Joy and raucous laughter roll across the tundra with them. No English is spoken, no white people cross their path. And everywhere they go, the boys are accompanied by a photo of their father being kissed by the Fur Queen, their guardian angel. ", "At the age of six, Champion is hauled into a plane and whisked to a boarding school three hundred miles south, where he enters a Hell on Earth. His name becomes Jeremiah, and his language is forbidden. His brother later joins him at the school, where the two boys are abused by priests. As young men, they suffer the humiliation of racism on the streets of Winnipeg. ", "Wherever the brothers go, the Fur Queen -- a wily, shape-shifting trickster -- looks after them protectively. For Jeremiah and Gabriel (as Ooneemeetoo is now called) are destined to be artists. Through music and dance, the Okimasis brothers flourish in the world. Until tragedy sneaks up on them. ", "Kiss of the Fur Queen fuses Native story-telling techniques with European narrative form to create an engaging, funny, passionate, and triumphant novel of a uniquely Canadian experience: that of being a stranger in yourown land."], "author": "Tomson Highway", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-09-15 00:00:00", "ISBN": "0385256523"},
{"url": "https://www.goodreads.com/book/show/234072.Solar_Storms", "num_ratings": "1,548", "num_reviews": "157", "avg_ratings": 4.09, "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Contemporary"], "title": "Solar Storms", "description": ["From Pulitzer Prize finalist Linda Hogan,", "tells the moving, “luminous” (", ") story of Angela Jenson, a troubled Native American girl coming of age in the foster system in Oklahoma, who decides to reunite with her family.", "At seventeen, Angela returns to the place where she was raised—a stunning island town that lies at the border of Canada and Minn", "From Pulitzer Prize finalist Linda Hogan,", "tells the moving, “luminous” (", ") story of Angela Jenson, a troubled Native American girl coming of age in the foster system in Oklahoma, who decides to reunite with her family.", "At seventeen, Angela returns to the place where she was raised—a stunning island town that lies at the border of Canada and Minnesota—where she finds that an eager developer is planning a hydroelectric dam that will leave sacred land flooded and abandoned. Joining up with three other concerned residents, Angela fights the project, reconnecting with her ancestral roots as she does so.", "Harrowing, lyrical, and boldly incisive, ", "is a powerful examination of the clashes between cultures and traumatic repercussions that have shaped American history."], "author": "Linda Hogan", "num_pages": "352", "awards": ["Colorado Book Award for Fiction"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-02-26 00:00:00", "ISBN": "0684825392"},
{"url": "https://www.goodreads.com/book/show/672616.Dead_In_The_Water", "num_ratings": "4,619", "num_reviews": "181", "avg_ratings": 4.16, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Dead In The Water", "description": ["Once, Kate Shugak was the star investigator of the Anchorage D.A, 's office. Now she's gone back to her Aleut roots in the far Alaska north- where her talent for detection makes her the toughest crime-tracker in that stark and mysterious land."], "author": "Dana Stabenow", "num_pages": "217", "awards": [], "places": [], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin", "Bernie Koslowski", "Andy Pence", "Seth Skinner"], "language": "English", "publish_date": "1993-07-01 00:00:00", "ISBN": "042513749X"},
{"url": "https://www.goodreads.com/book/show/672620.Play_With_Fire", "num_ratings": "2,595", "num_reviews": "146", "avg_ratings": 4.11, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Play With Fire", "description": ["Formerly the star investigator in the Anchorage D.A's office, Kate Shugak now tracks down criminals from her Aleut homestead. But she and her wolf-dog Mutt are taking a June break to pick wild morel mushrooms among the charred trees left by a devastating forest fire. In the ashes Kate also uncovers the mysterious corpse of a naked man. And when she is \"hired\" by a ten-year", "Formerly the star investigator in the Anchorage D.A's office, Kate Shugak now tracks down criminals from her Aleut homestead. But she and her wolf-dog Mutt are taking a June break to pick wild morel mushrooms among the charred trees left by a devastating forest fire. In the ashes Kate also uncovers the mysterious corpse of a naked man. And when she is \"hired\" by a ten-year-old to locate his missing dad, she fears she has already found him. The reason how and why he died, however, is buried deeper than his body. Finding it will lead Kate to the remains of a woolly mammoth in a Fairbanks museum, back to her old lover Jack Morgan, and far afield to an isolated settlement of religious fundamentalists ... as she follows a twisted road toward a smoldering evil and the flash point for a macabre murder. The fifth Kate Shugak mystery, Play With Fire contains all of Stabenow's hallmarks of ingenious plotting and vivid characterizations. Best of all, it is again set in magnificently austere, endlessly fascinating Alaska, which comes to life through the authentic details only a true insider can provide."], "author": "Dana Stabenow", "num_pages": "320", "awards": [], "places": ["Alaska"], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin", "Bernie Koslowski"], "language": "English", "publish_date": "1996-05-01 00:00:00", "ISBN": "0425152545"},
{"url": "https://www.goodreads.com/book/show/483254.Bone_Walker", "num_ratings": "963", "num_reviews": "34", "avg_ratings": 4.33, "genres": ["Historical", "Historical Fiction", "Mystery", "Fiction", "Thriller", "Mystery Thriller", "Historical Fiction", "Prehistoric", "Native Americans", "Historical", "History", "Archaeology", "Literature", "American", "Thriller"], "title": "Bone Walker", "description": ["W. Michael Gear and Kathleen O'Neal Gear, award-winning archaeologists and international bestselling authors, break extraordinary new ground in the riveting sequal to their bestselling ", ". ", " is more than a murder mystery, it is a psychological thriller filled with the action that have made this the dynamic duo of the historical. They have breathed", "W. Michael Gear and Kathleen O'Neal Gear, award-winning archaeologists and international bestselling authors, break extraordinary new ground in the riveting sequal to their bestselling ", ". ", " is more than a murder mystery, it is a psychological thriller filled with the action that have made this the dynamic duo of the historical. They have breathed life into the vanished world of the Anasazi, bringing out the spirit, the loves, and a mysterious world where mystery and horror lurk in every shadow, behind every door, sometimes right before you. The Gears invite you to follow them down the dark labyrinth of the serial killers mind in Book III of the ", ".", "Eight hundred years have passed since the Mogollon holy man was murdered in Flowing Waters Town. The threads of evil spun by Two Hearts are drawn across time to ensnare modern archaeologists Dusty Stewart and Maureen Cole. The \"Wolf Witch\" has killed archaeologist Dale Emerson Robertson, and Dusty and Maureen must unmask the murderer before he strikes again. But in so doing, Dusty will root out disturbing secrets about his own past that will cast his father's suicide in an unsettling light. With so many skeletons in the closet, even a bone expert like Maureen can be baffled...and the Wolf Witch is two steps ahead of them, drawing them relentlessly into his trap...", "From the national award-winning archaeologists and international bestselling authors of The Visitant and The Summoning God comes a novel of unforgettable terror about a murder in America eight hundred years ago...and a power that transcends time."], "author": "Kathleen O'Neal Gear", "num_pages": "672", "awards": [], "places": ["New Mexico"], "character_names": [], "language": "English", "publish_date": "2002-10-13 00:00:00", "ISBN": "0812589823"},
{"url": "https://www.goodreads.com/book/show/438468.People_of_the_Sea", "num_ratings": "2,252", "num_reviews": "53", "avg_ratings": 4.17, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy"], "title": "People of the Sea", "description": ["A spellbinding tale of life and love, death and adventure, in North America eleven thousand years ago, when mammoths roamed the continent. Award-winning archaeologists Michael and Kathleen Gear, using the best archaeological information, have created a stunning vision of our pre-history, and of the men and women who lived in this rapidly changing world. The great glaciers", "A spellbinding tale of life and love, death and adventure, in North America eleven thousand years ago, when mammoths roamed the continent. Award-winning archaeologists Michael and Kathleen Gear, using the best archaeological information, have created a stunning vision of our pre-history, and of the men and women who lived in this rapidly changing world. The great glaciers that cover the Sierra Nevada mountains are melting, destroying the habitats of the great elephants, lions and short-faced bears - and giving birth to the rich land that will become California. The few thousand people who have settled along the coast struggle to understand as the world around them changes. Where have the mastodons gone? And why are the mammoths disappearing? The seer Sunchaser would ordinarily visit the Spirit World and return with answers - but he has lost his way. Meanwhile his rival, Catchstraw, has discovered witchcraft as a way to Power - at the expense of his soul. And what will it mean to the people when a beautiful fugitive arrives? Kestrel, born in Arizona's marsh country, is running from her mad husband, desperately hoping for sanctuary on the coast. But if the Spirits are taking the mammoths now, what will they do should the people shelter an evil woman? Surely they should deliver her to her husband, who will kill her - and who has his own link to the Spirit World through the pitiful, mummified corpse of his little son.... Must Sunchaser choose between the woman he comes to love and the continuation of his world? He knows full well that either choice will damn him...."], "author": "W. Michael Gear", "num_pages": "560", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-09-15 00:00:00", "ISBN": "0812507452"},
{"url": "https://www.goodreads.com/book/show/571398.Blood_Will_Tell", "num_ratings": "3,921", "num_reviews": "129", "avg_ratings": 4.23, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Blood Will Tell", "description": ["Dana Stabenow once again returns to Alaska, America's last frontier, where her unforgettable Aleut investigator, Kate Shugak, faces one of the most painful cases of her reluctant career. Kate was formerly the star investigator of the Anchorage D.A.'s office; now all she wants to do is enjoy the first weeks of autumn on her isolated homestead. Alone. But duty calls, in the", "Dana Stabenow once again returns to Alaska, America's last frontier, where her unforgettable Aleut investigator, Kate Shugak, faces one of the most painful cases of her reluctant career. Kate was formerly the star investigator of the Anchorage D.A.'s office; now all she wants to do is enjoy the first weeks of autumn on her isolated homestead. Alone. But duty calls, in the form of Ekaterina Shugak, Kate's grandmother, the imposing matriarch of her extended family. It's the week of the Alaska Federation of Natives Convention, and everyone who's anyone - as well as a few nobodies - has gathered in Anchorage for a week of shopping, gossiping, bragging, and more than a little wheeling and dealing. But there's more happening this year than what's on the official agenda. A vote is coming up on the future of tribal lands, and the arguments are heated. Heated enough to raise suspicions about the recent death of a Native Association board member. Kate has always refused to get involved with tribal politics. But the dead woman was a relative, and the one true weakness Kate Shugak has is for her family. Reluctantly agreeing to investigate, she is drawn into a whirlpool of deceit, lies, and secrets; she is torn not only between the modern world and the traditional, but also between opposing factions within each group. And the more Kate investigates, the more she discovers how deeply she is tied to the land, and to what lengths she will go in order to protect it..."], "author": "Dana Stabenow", "num_pages": "256", "awards": [], "places": [], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin", "Bernie Koslowski", "Ekaterina Shugak"], "language": "English", "publish_date": "1997-06-01 00:00:00", "ISBN": "0425157989"},
{"url": "https://www.goodreads.com/book/show/671141.Breakup", "num_ratings": "3,761", "num_reviews": "203", "avg_ratings": 4.29, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Breakup", "description": ["April in Alaska is the period of spring thaw, what the locals call breakup. For Kate, this year's meltdown brings nothing but mayhem. First, the snow uncovers a dead body near Kate's home. Then a woman is killed in a suspicious bear attack. Kate is drawn further into the destruction of breakup -- and into the path of a murderer..."], "author": "Dana Stabenow", "num_pages": "256", "awards": [], "places": [], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin", "Bobby Clark", "Dinah Clark", "Bernie Koslowski"], "language": "English", "publish_date": "1998-04-01 00:00:00", "ISBN": "0425162613"},
{"url": "https://www.goodreads.com/book/show/271300.Killing_Grounds", "num_ratings": "2,579", "num_reviews": "104", "avg_ratings": 4.16, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Killing Grounds", "description": ["Summer in Alaska is synonymous with salmon. And Kate Shugak is up to her ears in chinooks and chicanery as she takes on commercial fishing. While deckhandling on the Freya, she hauls in salmon, halibut--and the dead body of the most disliked fisherman around. In fact, his death sends the town into tears--of joy. The list of suspects is a mile long. And Kate's search for th", "Summer in Alaska is synonymous with salmon. And Kate Shugak is up to her ears in chinooks and chicanery as she takes on commercial fishing. While deckhandling on the Freya, she hauls in salmon, halibut--and the dead body of the most disliked fisherman around. In fact, his death sends the town into tears--of joy. The list of suspects is a mile long. And Kate's search for the killer isn't making her too popular in town--especially since the dead man is already being hailed as the catch of the day"], "author": "Dana Stabenow", "num_pages": "256", "awards": [], "places": [], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin", "Auntie Vi", "Auntie Joy", "Auntie Edna", "Auntie Balasha", "Sam Dementieff", "Bernie Koslowski", "George Perry", "Pete Peterson", "Jimmy Velasco", "Les Nordensen", "Kell Van Brocklin", "Ellen Steen", "Lamar Rousch", "Joe Anahonak", "Craig Pirtle", "Yuri Andreev"], "language": "English", "publish_date": "1999-03-01 00:00:00", "ISBN": "0425167739"},
{"url": "https://www.goodreads.com/book/show/769736.The_Powwow_Highway", "num_ratings": "141", "num_reviews": "19", "avg_ratings": 4.14, "genres": ["Fiction", "Native Americans"], "title": "The Powwow Highway", "description": ["Philbert Bono and Buddy Red Bird are about to prove that the spirit of the great Cheyenne warriors is still alive and kicking. Their \"war pony,\" a burned-out, rusty, '64 Buick LeSabre, has left a trail of dust from Montana's Lame Deer Reservation halfway down Interstate 25 toward New Mexico. It's a journey of enlightenment, a quest for greatness... and it just might be one", "Philbert Bono and Buddy Red Bird are about to prove that the spirit of the great Cheyenne warriors is still alive and kicking. Their \"war pony,\" a burned-out, rusty, '64 Buick LeSabre, has left a trail of dust from Montana's Lame Deer Reservation halfway down Interstate 25 toward New Mexico. It's a journey of enlightenment, a quest for greatness... and it just might be one of the wildest, funniest, most outrageous rides you've ever been on - a beer-guzzling, joint-smoking, staggering gallop down that twisting road to self-discovery... "], "author": "David Seals", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-03-30 00:00:00", "ISBN": "0452263778"},
{"url": "https://www.goodreads.com/book/show/1505482.Skins", "num_ratings": "125", "num_reviews": "12", "avg_ratings": 3.94, "genres": ["Fiction", "Reference", "Research"], "title": "Skins", "description": ["SKINS is Adrian C. Louis's realistic novel of life on Pine Ridge Reservation, the story of two brothers--one a rez cop, the other an alcoholic--and their relationship with each other, with their people, with their environment. Chris Eyre's film version of SKINS is scheduled for release by Firstlook Pictures in August 2002. ", "SKINS is Adrian C. Louis's realistic novel of life on Pine Ridge Reservation, the story of two brothers--one a rez cop, the other an alcoholic--and their relationship with each other, with their people, with their environment. Chris Eyre's film version of SKINS is scheduled for release by Firstlook Pictures in August 2002. "], "author": "Adrian C. Louis", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-06-01 00:00:00", "ISBN": "0944024440"},
{"url": "https://www.goodreads.com/book/show/7337483-motorcycles-sweetgrass", "num_ratings": "1,007", "num_reviews": "129", "avg_ratings": 3.78, "genres": ["Fiction", "Cultural", "Canada", "Humor"], "title": "Motorcycles & Sweetgrass", "description": ["A story of magic, family, a mysterious stranger . . . and a band of marauding raccoons.", " ", "Otter Lake is a sleepy Anishnawbe community where little happens. Until the day a handsome stranger pulls up astride a 1953 Indian Chief motorcycle – and turns Otter Lake completely upside down. Maggie, the Reserve’s chief, is swept off her feet, but Virgil, her teenage son, is less tha", "A story of magic, family, a mysterious stranger . . . and a band of marauding raccoons.", " ", "Otter Lake is a sleepy Anishnawbe community where little happens. Until the day a handsome stranger pulls up astride a 1953 Indian Chief motorcycle – and turns Otter Lake completely upside down. Maggie, the Reserve’s chief, is swept off her feet, but Virgil, her teenage son, is less than enchanted. Suspicious of the stranger’s intentions, he teams up with his uncle Wayne – a master of aboriginal martial arts – to drive the stranger from the Reserve. And it turns out that the raccoons are willing to lend a hand."], "author": "Drew Hayden Taylor", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-03-09 00:00:00", "ISBN": "0307398056"},
{"url": "https://www.goodreads.com/book/show/860979.People_of_the_Wolf", "num_ratings": "8,442", "num_reviews": "253", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy"], "title": "People of the Wolf", "description": ["In the dawn of history, a valiant people forged a pathway from an old world into a new one. Led by a dreamer who followed the spirit of the wolf, a handful of courageous men and women dared to cross the frozen wastes to find an untouched, unspoiled continent. Set in what is now Alaska, this is the magnificent saga of the vision-filled man who led his people to an awesome d", "In the dawn of history, a valiant people forged a pathway from an old world into a new one. Led by a dreamer who followed the spirit of the wolf, a handful of courageous men and women dared to cross the frozen wastes to find an untouched, unspoiled continent. Set in what is now Alaska, this is the magnificent saga of the vision-filled man who led his people to an awesome destiny, and the courageous woman whose love and bravery drove them on in pursuit of that dream.", "A sweeping epic of prehistory, People of the Wolf is another compelling novel in the majestic North America's Forgotten Past series from New York Times and USA Today bestselling authors W. Michael Gear and Kathleen O'Neal Gear"], "author": "W. Michael Gear", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-01-15 00:00:00", "ISBN": "0812521331"},
{"url": "https://www.goodreads.com/book/show/12847.The_Art_of_Dreaming", "num_ratings": "3,675", "num_reviews": "112", "avg_ratings": 4.1, "genres": ["Spirituality", "Philosophy", "Fiction"], "title": "The Art of Dreaming", "description": ["After six years of study and meditation, the author presents a book which takes the reader on a journey of the soul via the teachings of the great sorcerer, Don Juan. Like layers of an onion, the author reveals that there are worlds existing within our own that can be visited through dreams."], "author": "Carlos Castaneda", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-02-16 00:00:00", "ISBN": "1855384272"},
{"url": "https://www.goodreads.com/book/show/14250.Pigs_in_Heaven", "num_ratings": "49,517", "num_reviews": "1,898", "avg_ratings": 3.97, "genres": ["Fiction", "Contemporary", "Adult Fiction", "Literary Fiction"], "title": "Pigs in Heaven", "description": ["Mother and adopted daughter, Taylor and Turtle Greer, are back in this spellbinding sequel about family, heartbreak and love.", "Six-year-old Turtle Greer witnesses a freak accident at the Hoover Dam during a tour of the Grand Canyon with her guardian, Taylor. Her insistence on what she has seen, and her mother's belief in her, lead to a man's dramatic rescue. The mother and a", "Mother and adopted daughter, Taylor and Turtle Greer, are back in this spellbinding sequel about family, heartbreak and love.", "Six-year-old Turtle Greer witnesses a freak accident at the Hoover Dam during a tour of the Grand Canyon with her guardian, Taylor. Her insistence on what she has seen, and her mother's belief in her, lead to a man's dramatic rescue. The mother and adopted daughter duo soon become nationwide heroes - even landing themselves a guest appearance on the Oprah Winfrey show. But Turtle's moment of celebrity draws her into a conflict of historic proportions stemming right back to her Cherokee roots. The crisis quickly envelops not only Turtle and her guardian, but everyone else who touches their lives in a complex web connecting their future with their past.", "Embark on a unforgettable road trip from rural Kentucky and the urban Southwest to Heaven, Oklahoma, and the Cherokee Nation, testing the boundaries of family and the many separate truths about the ties that bind."], "author": "Barbara Kingsolver", "num_pages": "343", "awards": ["Los Angeles Times Book Prize for Fiction (1993)"], "places": [], "character_names": [], "language": "English", "publish_date": "1994-08-16 00:00:00", "ISBN": "0571171788"},
{"url": "https://www.goodreads.com/book/show/425100.Dance_Hall_of_the_Dead", "num_ratings": "9,246", "num_reviews": "422", "avg_ratings": 4.01, "genres": ["Mystery", "Fiction", "Thriller", "Mystery Thriller", "Mystery", "Crime"], "title": "Dance Hall of the Dead", "description": ["Two Native-American boys have vanished into thin air, leaving a pool of blood behind them. Lieutenant Joe Leaphorn of the Navajo Tribal Police has no choice but to suspect the very worst, since the blood that stains the parched New Mexican ground once flowed through the veins of one of the missing, a young Zuñi. But his investigation into a terrible crime is being complica", "Two Native-American boys have vanished into thin air, leaving a pool of blood behind them. Lieutenant Joe Leaphorn of the Navajo Tribal Police has no choice but to suspect the very worst, since the blood that stains the parched New Mexican ground once flowed through the veins of one of the missing, a young Zuñi. But his investigation into a terrible crime is being complicated by an important archaeological dig . . . and a steel hypodermic needle. And the unique laws and sacred religious rites of the Zuñi people are throwing impassable roadblocks in Leaphorn's already twisted path, enabling a craven murderer to elude justice or, worse still, to kill again."], "author": "Tony Hillerman", "num_pages": "255", "awards": ["Grand Prix de Littérature Policière for Romans étrangers (1987)", "Edgar Award for Best Novel (1974)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn", "Baker", "Suzanne Chambers", "Emma Leaphorn", "Halsey", "John O'Malley", "Cecil Bowlegs", "Chester Reynolds", "Ernesto Cata", "Father Ingles", "Shorty Bowlegs", "George Bowlegs", "Ted Isaacs"], "language": "English", "publish_date": "1990-04-04 00:00:00", "ISBN": "0061000027"},
{"url": "https://www.goodreads.com/book/show/18527201-the-great-law-of-peace", "num_ratings": "127", "num_reviews": "20", "avg_ratings": 4.52, "genres": ["North American Hi...", "American History", "History", "Animals", "Adventure"], "title": "The Great Law of Peace", "description": ["To survive the test of the falls was only the first step. Climbing the tree and letting them chop it down, falling straight into the worst of the rapids, gained him their attention, made them listen. But the main part of his work was still ahead of Two Rivers and his most loyal follower, Tekeni. The task of organizing the people as a whole, of making them talk to their hos", "To survive the test of the falls was only the first step. Climbing the tree and letting them chop it down, falling straight into the worst of the rapids, gained him their attention, made them listen. But the main part of his work was still ahead of Two Rivers and his most loyal follower, Tekeni. The task of organizing the people as a whole, of making them talk to their hostile, warlike neighbors, demanded time, too much time. ", "Their private desires had to wait as they traveled to more places, convened more gatherings, convinced more nations. The Great Peace demanded their full attention. ", "However, the women they loved had different ideas. Neither was prepared to sit and wait patiently. Taking action seemed like the better course to both, but each went about it in her own, very different, fashion."], "author": "Zoe Saadia", "num_pages": "259", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12613419-robopocalypse", "num_ratings": "32,465", "num_reviews": "3,972", "avg_ratings": 3.68, "genres": ["Science Fiction", "Fiction", "Apocalyptic", "Post Apocalyptic", "Science Fiction", "Dystopia", "Science Fiction", "Robots", "Thriller", "Science Fiction", "Apocalyptic", "Science Fiction Fantasy", "Audiobook", "Fantasy"], "title": "Robopocalypse", "description": ["They are in your house. They are in your car. They are in the skies…Now they’re coming for you.", "In the near future, at a moment no one will notice, all the dazzling technology that runs our world will unite and turn against us. Taking on the persona of a shy human boy, a childlike but massively powerful artificial intelligence known as Archos comes online and assumes contro", "They are in your house. They are in your car. They are in the skies…Now they’re coming for you.", "In the near future, at a moment no one will notice, all the dazzling technology that runs our world will unite and turn against us. Taking on the persona of a shy human boy, a childlike but massively powerful artificial intelligence known as Archos comes online and assumes control over the global network of machines that regulate everything from transportation to utilities, defense and communication. In the months leading up to this, sporadic glitches are noticed by a handful of unconnected humans – a single mother disconcerted by her daughter’s menacing “smart” toys, a lonely Japanese bachelor who is victimized by his domestic robot companion, an isolated U.S. soldier who witnesses a ‘pacification unit’ go haywire – but most are unaware of the growing rebellion until it is too late.", "When the Robot War ignites -- at a moment known later as Zero Hour -- humankind will be both decimated and, possibly, for the first time in history, united. Robopocalypse is a brilliantly conceived action-filled epic, a terrifying story with heart-stopping implications for the real technology all around us…and an entertaining and engaging thriller unlike anything else written in years."], "author": "Daniel H. Wilson", "num_pages": "396", "awards": ["ALA Alex Award (2012)", "Endeavour Award Nominee (2012)"], "places": ["United States of America"], "character_names": ["Cormac 'Bright Boy' Wallace", "Takeo Nomura", "Lurker", "Nine Oh Two", "Lonnie Wayne Blanton", "Specialist Paul Blanton", "Marcus Johnson", "Mathilda Perez", "Sergeant Jack Wallace"], "language": "English", "publish_date": "2012-04-17 00:00:00", "ISBN": "0307740803"},
{"url": "https://www.goodreads.com/book/show/22719695-the-peacekeeper", "num_ratings": "97", "num_reviews": "13", "avg_ratings": 4.55, "genres": ["History", "Animals", "Adventure"], "title": "The Peacekeeper", "description": ["With the Great Peace established, new laws delivered, and important agreements reached, Two Rivers and Tekeni could now sit back and enjoy the fruits of their work, watching the union of Five Nations alive and kicking, functioning, maintaining the Peacemaker’s wonderful vision. Or so they thought… ", "Tekeni had never trusted the power-hungry Tadodaho, now the Head of the Grea", "With the Great Peace established, new laws delivered, and important agreements reached, Two Rivers and Tekeni could now sit back and enjoy the fruits of their work, watching the union of Five Nations alive and kicking, functioning, maintaining the Peacemaker’s wonderful vision. Or so they thought… ", "Tekeni had never trusted the power-hungry Tadodaho, now the Head of the Great Council. Yet, Two Rivers dismissed such warnings lightly, too lightly for Tekeni’s peace of mind. The devious man was up to something. Tekeni’s gut instincts screamed danger, but the Peacemaker kept waving his hand in dismissal, claiming that everything was under control. ", "And then, the Crooked Tongues entered the scene..."], "author": "Zoe Saadia", "num_pages": "329", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1047507.Mother_Earth_Father_Sky", "num_ratings": "7,540", "num_reviews": "201", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy", "Historical Fiction", "Prehistoric"], "title": "Mother Earth Father Sky", "description": ["In a time before history, in a harsh and beautiful land near the top of the world, womanhood comes cruelly and suddenly to beautiful, young Chagak. Surviving the brutal massacre of her tribe, she sets out across the icy waters off Ameria's northwest coast on an astonishing odyssey that will reveal to Chagak powerful secrets of the earth and sky... and the mysteries of love", "In a time before history, in a harsh and beautiful land near the top of the world, womanhood comes cruelly and suddenly to beautiful, young Chagak. Surviving the brutal massacre of her tribe, she sets out across the icy waters off Ameria's northwest coast on an astonishing odyssey that will reveal to Chagak powerful secrets of the earth and sky... and the mysteries of love and loss."], "author": "Sue Harrison", "num_pages": "402", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-09-01 00:00:00", "ISBN": "0380715929"},
{"url": "https://www.goodreads.com/book/show/18527307-across-the-great-sparkling-water", "num_ratings": "174", "num_reviews": "26", "avg_ratings": 4.37, "genres": ["Historical", "Historical Fiction", "Historical"], "title": "Across the Great Sparkling Water", "description": ["To live in captivity, adopted by the enemies of her people, or to break the law and tradition by running away? ", "That question did not occur to Onheda until after she fled Little Falls on the spur of the moment, against any better judgment. If she was to die in the woods, making her way back to her people, accused, even by them, of breaking the ancient custom, it was still t", "To live in captivity, adopted by the enemies of her people, or to break the law and tradition by running away? ", "That question did not occur to Onheda until after she fled Little Falls on the spur of the moment, against any better judgment. If she was to die in the woods, making her way back to her people, accused, even by them, of breaking the ancient custom, it was still the better choice. She would not live among the enemies. Two moons of that had been more than enough.", "And yet, embarking upon her dangerous journey, she never expected to cross the path of the man who came to change the world of her people and their enemies alike. Who was he? A mysterious foreigner from across the Great Sparkling Water, a man with unusual ideas or the Messenger of the Great Spirits? And was he about to change her life, too?"], "author": "Zoe Saadia", "num_pages": "221", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/291178.The_Snow_Walker", "num_ratings": "564", "num_reviews": "40", "avg_ratings": 4.05, "genres": ["Short Stories", "Historical", "Historical Fiction", "Cultural", "Canada", "Fiction", "Anthropology"], "title": "The Snow Walker", "description": ["Classic works by one of North America's greatest storytellers brought back to print in a new paperback series Inspiration for the major motion picture from Infinity Media and First Look International Central to Farley Mowat's writing is his quest to understand the often-forgotten native people of the vast arctic wilderness. In this moving collection, he allows these people", "Classic works by one of North America's greatest storytellers brought back to print in a new paperback series Inspiration for the major motion picture from Infinity Media and First Look International Central to Farley Mowat's writing is his quest to understand the often-forgotten native people of the vast arctic wilderness. In this moving collection, he allows these people to describe in their own words the adventures they experience as they struggle to survive in an isolated, untamed land. Stories of survival and courage, of superstition and fate, of uncompromising loyalty to family and tribe are presented here, offering a vivid portrait of a people whose existence is often beyond the comprehension of modern man."], "author": "Farley Mowat", "num_pages": "209", "awards": [], "places": ["Nunavut"], "character_names": [], "language": "English", "publish_date": "2004-08-18 00:00:00", "ISBN": "0811731464"},
{"url": "https://www.goodreads.com/book/show/22843701-anung-s-journey", "num_ratings": "9", "num_reviews": "4", "avg_ratings": 3.33, "genres": ["Fantasy"], "title": "Anung's Journey", "description": ["INDIEFAB 2015 Book of the Year Award Finalist in Multicultural Fiction and Juvenile Fiction. Winners announced June 26.", "This ancient Ojibway legend predates contact wit", "INDIEFAB 2015 Book of the Year Award Finalist in Multicultural Fiction and Juvenile Fiction. Winners announced June 26.", "This ancient Ojibway legend predates contact with European settlers, but the drummer boy and the people he meets at the end of his journey couldn’t be more familiar to modern culture.", "When the orphaned Anung sets out on his vision quest, he sees clearly that his purpose in life is to find the greatest chief of all and tell him of the many acts of kindness the mothers and fathers of the village have given to Anung. When the people of his village learn of the vision, they are proud of him. For every man of the village loves Anung as his son. Every woman is his mother. They believe Gitche Manitou, the great creator, has chosen their son for a special journey. ", "\tIn his quest to find the greatest chief, Anung travels through the 13 tribes of the First Nations, across forests, plains, water, and desert. Along the way, he is accompanied by Turtle, the interpreter of all languages. He finds friends in the most unlikely of places––a squirrel’s nest, a mother bear’s den, and a city filled with people from every tribe. At each stop, Anung and his drum sing of his mothers and fathers and his quest to meet the greatest chief.", "\tWhat Anung finds at the end of his journey will both surprise and thrill readers of all ages. This ancient legend, told in the beautifully poetic style of Carl Nordgren, begs to be read aloud and savored."], "author": "Carl Nordgren", "num_pages": "118", "awards": ["Foreword INDIES Book of the Year Award Nominee for Juvenile Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-17 00:00:00", "ISBN": "1611531179"},
{"url": "https://www.goodreads.com/book/show/18171356-two-rivers", "num_ratings": "641", "num_reviews": "84", "avg_ratings": 4.04, "genres": ["Historical", "Historical Fiction", "Historical", "Adventure", "Fantasy", "Fiction"], "title": "Two Rivers", "description": ["Having survived the failed raid on the enemy lands, Tekeni had no illusions. He was nothing but an enemy cub, adopted into one of the clans, but not accepted, never for real. To fit in was difficult, to run away – impossible. To get into trouble, more often than not, was the only available option. They did not expect anything else", "Having survived the failed raid on the enemy lands, Tekeni had no illusions. He was nothing but an enemy cub, adopted into one of the clans, but not accepted, never for real. To fit in was difficult, to run away – impossible. To get into trouble, more often than not, was the only available option. They did not expect anything else from him, anyway.", "However, when a meaningless row during a ballgame grew out of proportion, resulting in a fight, Tekeni has found himself in a truly grave trouble. Neither he nor anyone else could have foreseen the chain of events the consequences of this fight would release, when the highly esteemed but controversial Two Rivers decided to help Tekeni out. ", "Two Rivers was a strange person with unacceptable notions and ideas. He maintained that to war on and on was a mistake of disastrous consequences. He went as far as suggesting a negotiation of peace with some of the neighboring nations. Even Tekeni, the despised enemy, thought such ideas to be far-fetched and wild. And yet…", "With their trouble mounting and the revengefulness of some people around them growing, both Tekeni and Two Rivers find themselves pushed beyond limits."], "author": "Zoe Saadia", "num_pages": "210", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12725.Sing_Down_the_Moon", "num_ratings": "6,510", "num_reviews": "362", "avg_ratings": 3.73, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Historical"], "title": "Sing Down the Moon", "description": ["The Spanish Slavers were an ever-present threat to the Navaho way of life. One lovely spring day, fourteen-year-old Bright Morning and her friend Running Bird took their sheep to pasture. The sky was clear blue against the red buttes of the Canyon de Schelly, and the fields and orchards of the Navahos promised a rich harvest. Bright Morning was happy as she gazed across th", "The Spanish Slavers were an ever-present threat to the Navaho way of life. One lovely spring day, fourteen-year-old Bright Morning and her friend Running Bird took their sheep to pasture. The sky was clear blue against the red buttes of the Canyon de Schelly, and the fields and orchards of the Navahos promised a rich harvest. Bright Morning was happy as she gazed across the beautiful valley that was the home of her tribe. She tumed when Black Dog barked, and it was then that she saw the Spanish slavers riding straight toward her."], "author": "Scott O'Dell", "num_pages": "121", "awards": ["Newbery Medal Nominee (1971)", "Dorothy Canfield Fisher Children's Book Award Nominee (1972)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-26 00:00:00", "ISBN": "0440979757"},
{"url": "https://www.goodreads.com/book/show/25600921-into-the-americas", "num_ratings": "260", "num_reviews": "33", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Adventure", "Action", "Young Adult", "Young Adult Romance", "Young Adult", "Romance", "Historical Romance", "Historical", "True Story"], "title": "Into the Americas", "description": ["INTO THE AMERICAS (A novel based on a true story) is a gritty, real-life adventure based on one of history’s greatest survival stories. It was inspired by the diary entries of young English blacksmith John Jewitt during his time aboard the brigantine The Boston and also during his sojourn at Nootka Sound, on North America's western seaboard, from 1802 to 1805.", "Written by fa", "INTO THE AMERICAS (A novel based on a true story) is a gritty, real-life adventure based on one of history’s greatest survival stories. It was inspired by the diary entries of young English blacksmith John Jewitt during his time aboard the brigantine The Boston and also during his sojourn at Nootka Sound, on North America's western seaboard, from 1802 to 1805.", "Written by father-and-son writing team Lance & James Morcan (authors of The World Duology and The Orphan Trilogy), INTO THE AMERICAS is a tale of two vastly different cultures – Indigenous North American and European civilization – colliding head on. It is also a Romeo and Juliet story set in the wilderness.", "Nineteen year-old blacksmith John Jewitt is one of only two survivors after his crewmates clash with the fierce Mowachaht tribe in the Pacific Northwest. A life of slavery awaits John and his fellow survivor, a belligerent American sailmaker, in a village ruled by the iron fist of Maquina, the all-powerful chief. Desperate to taste freedom again, they make several doomed escape attempts over mountains and sea. Only their value to the tribe and John’s relationship with Maquina prevents their captors from killing them.", "As the seasons pass, John ‘goes Indian’ after falling in love with Eu-stochee, a beautiful maiden. This further alienates him from his fellow captive whose defiance leads to violent consequences. In the bloodshed that follows, John discovers another side to himself – a side he never knew existed and a side he detests. His desire to be reunited with the family and friends he left behind returns even stronger than before.", "The stakes rise when John learns Eu-stochee is pregnant. When a final opportunity to escape arises, he must choose between returning to civilization or staying with Eu-stochee and their newborn son."], "author": "Lance Morcan", "num_pages": "542", "awards": [], "places": ["British Columbia", "Vancouver Island, British Columbia", "Nootka Sound, Vancouver Island", "Pacific Northwest", "Canada"], "character_names": ["John Jewitt", "Eu-stochee", "Maquina"], "language": "English", "publish_date": "2015-05-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/35349.She_Who_Remembers", "num_ratings": "7,334", "num_reviews": "192", "avg_ratings": 4.02, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy", "Historical Fiction", "Prehistoric"], "title": "She Who Remembers", "description": ["Kwani. A beautiful woman born in the American southwest into the long extinct Anasazi tribe, long before Columbus...whose blue eyes marked her as a witch and set her apart from the Indian tribe that raised her.", "Following her path of destiny in a vanished world of great stone cities and trackless wilderness warring tribes and mysterious trabelers from other lands, Kwani foun", "Kwani. A beautiful woman born in the American southwest into the long extinct Anasazi tribe, long before Columbus...whose blue eyes marked her as a witch and set her apart from the Indian tribe that raised her.", "Following her path of destiny in a vanished world of great stone cities and trackless wilderness warring tribes and mysterious trabelers from other lands, Kwani found love with Kokopelli, the Toltec magician, who rescued her from death and took her to the Place of the Eagle Clan. There she was transformed from an outcast to the Chosen of the Gods, where she became She Who Remembers and taught young girls the ancient secrets only women know...secrets that provided her with inner power to overcome and triumph--and change her life forever."], "author": "Linda Lay Shuler", "num_pages": "496", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-05 00:00:00", "ISBN": "0451211448"},
{"url": "https://www.goodreads.com/book/show/48118.The_Ghostway", "num_ratings": "7,929", "num_reviews": "174", "avg_ratings": 4.12, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "The Ghostway", "description": ["Old Joseph Joe sees it all. Two strangers spill blood at the Shiprock Wash-O-Mat. One dies. The other drives off into the dry lands of the Big Reservation, but not before he shows the old Navajo a photo of the man he seeks.", "This is all Tribal Policeman Jim Chee needs to set him off on an odyssey that moves from a trapped ghost in an Indian hogan to the seedy underbelly of L", "Old Joseph Joe sees it all. Two strangers spill blood at the Shiprock Wash-O-Mat. One dies. The other drives off into the dry lands of the Big Reservation, but not before he shows the old Navajo a photo of the man he seeks.", "This is all Tribal Policeman Jim Chee needs to set him off on an odyssey that moves from a trapped ghost in an Indian hogan to the seedy underbelly of L.A. to an ancient healing ceremony where death is the cure, and into the dark heart of murder and revenge."], "author": "Tony Hillerman", "num_pages": "301", "awards": [], "places": [], "character_names": ["Joe Leaphorn", "Jim Chee", "Albert Gorman", "Joseph Joe"], "language": "English", "publish_date": "1992-02-04 00:00:00", "ISBN": "006100345X"},
{"url": "https://www.goodreads.com/book/show/52384.Gardens_in_the_Dunes", "num_ratings": "881", "num_reviews": "88", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Literature", "Historical"], "title": "Gardens in the Dunes", "description": ["A sweeping, multifaceted tale of a young Native American pulled between the cherished traditions of a heritage on the brink of extinction and an encroaching white culture, ", " is the powerful story of one woman’s quest to reconcile two worlds that are diametrically opposed.", "At the center of this struggle is Indigo, who is ripped from her tribe, the Sand Liz", "A sweeping, multifaceted tale of a young Native American pulled between the cherished traditions of a heritage on the brink of extinction and an encroaching white culture, ", " is the powerful story of one woman’s quest to reconcile two worlds that are diametrically opposed.", "At the center of this struggle is Indigo, who is ripped from her tribe, the Sand Lizard people, by white soldiers who destroy her home and family. Placed in a government school to learn the ways of a white child, Indigo is rescued by the kind-hearted Hattie and her worldly husband, Edward, who undertake to transform this complex, spirited girl into a “proper” young lady. Bit by bit, and through a wondrous journey that spans the European continent, traipses through the jungles of Brazil, and returns to the rich desert of Southwest America, Indigo bridges the gap between the two forces in her life and teaches her adoptive parents as much as, if not more than, she learns from them."], "author": "Leslie Marmon Silko", "num_pages": "480", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2000-04-13 00:00:00", "ISBN": "0684863324"},
{"url": "https://www.goodreads.com/book/show/50667.Little_Big_Man", "num_ratings": "5,928", "num_reviews": "363", "avg_ratings": 4.24, "genres": ["Historical", "Historical Fiction", "Fiction", "Westerns", "Classics", "Humor"], "title": "Little Big Man", "description": ["\"I am a white man and never forget it, but I was brought up by the Cheyenne Indians from the age of ten.\"", "So starts the story of Jack Crabb, the 111-year old narrator of Thomas Berger's masterpiece of American fiction. As a \"human being\", as the Cheyenne called their own, he won the name Little Big Man. He dressed in skins, feasted on dog, loved four wives and saw his peopl", "\"I am a white man and never forget it, but I was brought up by the Cheyenne Indians from the age of ten.\"", "So starts the story of Jack Crabb, the 111-year old narrator of Thomas Berger's masterpiece of American fiction. As a \"human being\", as the Cheyenne called their own, he won the name Little Big Man. He dressed in skins, feasted on dog, loved four wives and saw his people butchered by the horse soldiers of General Custer, the man he had sworn to kill.", "As a white man, Crabb hunted buffalo, tangled with Wyatt Earp, cheated Wild Bill Hickok and survived the Battle of Little Bighorn. Part-farcical, part-historical, the picaresque adventures of this witty, wily mythomaniac claimed the Wild West as the stuff of serious literature."], "author": "Thomas Berger", "num_pages": "422", "awards": ["Audie Award for Literary Fiction & Classics (2016)", "Rosenthal Family Foundation Award (1965)"], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "1999-05-01 00:00:00", "ISBN": "1860466419"},
{"url": "https://www.goodreads.com/book/show/2598240-people-of-the-whale", "num_ratings": "634", "num_reviews": "131", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "War"], "title": "People of the Whale", "description": ["Raised in a remote seaside village, Thomas Witka Just marries Ruth, his beloved since infancy. But an ill-fated decision to fight in Vietnam changes his life forever: cut off from his Native American community, he fathers a child with another woman. When he returns home", "Raised in a remote seaside village, Thomas Witka Just marries Ruth, his beloved since infancy. But an ill-fated decision to fight in Vietnam changes his life forever: cut off from his Native American community, he fathers a child with another woman. When he returns home a hero, he finds his tribe in conflict over the decision to hunt a whale, both a symbol of spirituality and rebirth and a means of survival. In the end, he reconciles his two existences, only to see tragedy befall the son he left behind.", "Linda Hogan, called our most provocative Native American writer, with \"her unparalleled gifts for truth and magic\" (Barbara Kingsolver), has written a compassionate novel about the beauty of the natural world and the painful moral choices humans make in it. With a keen sense of the environment, spirituality, and the trauma of war, ", " is a powerful novel for our times."], "author": "Linda Hogan", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-17 00:00:00", "ISBN": "0393064573"},
{"url": "https://www.goodreads.com/book/show/127810.Two_Old_Women", "num_ratings": "6,113", "num_reviews": "1,041", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Adventure", "Survival"], "title": "Two Old Women: An Alaskan Legend of Betrayal, Courage and Survival", "description": ["Based on an Athabascan Indian legend passed along for many generations from mothers to daughters of the upper Yukon River Valley in Alaska, this is the suspenseful, shocking, ultimately inspirational tale of two old women abandoned by their tribe during a brutal winter famine.", "Though these women have been known to complain more than contribute, they now must either survive", "Based on an Athabascan Indian legend passed along for many generations from mothers to daughters of the upper Yukon River Valley in Alaska, this is the suspenseful, shocking, ultimately inspirational tale of two old women abandoned by their tribe during a brutal winter famine.", "Though these women have been known to complain more than contribute, they now must either survive on their own or die trying. In simple but vivid detail, Velma Wallis depicts a landscape and way of life that are at once merciless and starkly beautiful. In her old women, she has created two heroines of steely determination whose story of betrayal, friendship, community and forgiveness \"speaks straight to the heart with clarity, sweetness and wisdom\" (Ursula K. Le Guin)."], "author": "Velma Wallis", "num_pages": "140", "awards": ["Western States Book Award (1993)", "Pacific Northwest Booksellers Association Award (1994)"], "places": ["Alaska"], "character_names": ["Two old Athabaskan women", "Ch'idzigyaak", "Sa'"], "language": "English", "publish_date": "2004-06-29 00:00:00", "ISBN": "0060723521"},
{"url": "https://www.goodreads.com/book/show/156392.Winter_in_the_Blood", "num_ratings": "2,236", "num_reviews": "195", "avg_ratings": 3.85, "genres": ["Fiction", "Novels", "Classics", "Literary Fiction", "Literature"], "title": "Winter in the Blood", "description": ["The author of Fool's Crow and Indian Lawyer presents an extraordinary, evocative novel about a young Native American coming to terms with his heritage--and his dreams. \"A nearly flawless novel about human life\".--Reynolds Price, New York Times Book Review."], "author": "James Welch", "num_pages": "192", "awards": [], "places": ["Montana"], "character_names": [], "language": "English", "publish_date": "1986-03-04 00:00:00", "ISBN": "0140086447"},
{"url": "https://www.goodreads.com/book/show/156364.The_Heartsong_of_Charging_Elk", "num_ratings": "768", "num_reviews": "80", "avg_ratings": 3.87, "genres": ["Historical", "Historical Fiction", "Fiction", "Novels", "Cultural", "France"], "title": "The Heartsong of Charging Elk", "description": ["From the award-winning author of the Native American classic ", ",", "a richly crafted novel of cultural crossing that is a triumph of storytelling and the historical imagination. ", "Charging Elk, an Oglala Sioux, joins Buffalo Bill's Wild West Show and journeys from the Black Hills of South Dakota to the back streets of nineteenth-century Marseille. Left behind in a Marse", "From the award-winning author of the Native American classic ", ",", "a richly crafted novel of cultural crossing that is a triumph of storytelling and the historical imagination. ", "Charging Elk, an Oglala Sioux, joins Buffalo Bill's Wild West Show and journeys from the Black Hills of South Dakota to the back streets of nineteenth-century Marseille. Left behind in a Marseille hospital after a serious injury while the show travels on, he is forced to remake his life alone in a strange land. He struggles to adapt as well as he can, while holding on to the memories and traditions of life on the Plains and eventually falling in love. But none of the worlds the Indian has known can prepare him for the betrayal that follows. This is a story of the American Indian that we have seldom seen: a stranger in a strange land, often an invisible man, loving, violent, trusting, wary, protective, and defenseless against a society that excludes him but judges him by its rules. At once epic and intimate, ", " echoes across time, geography, and cultures."], "author": "James Welch", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-10-02 00:00:00", "ISBN": "0385496753"},
{"url": "https://www.goodreads.com/book/show/13539158-people-of-the-black-sun", "num_ratings": "400", "num_reviews": "31", "avg_ratings": 4.38, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "People of the Black Sun", "description": ["Dekanawida has become known as “The Sky Messenger,” a prophet of immense power, and Hiawento is his Speaker. Thousands now believe in the Great Law of Peace and have joined the League. But they are still being harassed by marauding warriors from the People of the Mountain who steadfastly refuse to adopt the Great Law.", "Dekanawida has prophesied destruction if the warfare con", "Dekanawida has become known as “The Sky Messenger,” a prophet of immense power, and Hiawento is his Speaker. Thousands now believe in the Great Law of Peace and have joined the League. But they are still being harassed by marauding warriors from the People of the Mountain who steadfastly refuse to adopt the Great Law.", "Dekanawida has prophesied destruction if the warfare continues. As one by one, portents start coming true, Dekanawida has one last chance to convince the People of the Mountain to join the League and save their world from utter destruction."], "author": "Kathleen O'Neal Gear", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-16 00:00:00", "ISBN": "0765326957"},
{"url": "https://www.goodreads.com/book/show/900445.Roofwalker", "num_ratings": "167", "num_reviews": "23", "avg_ratings": 3.95, "genres": ["Short Stories", "Fiction", "Writing", "Essays", "Asian Literature", "Indian Literature", "Literature"], "title": "Roofwalker", "description": ["Roofwalker, made up of a unique combination of fiction and nonfiction, or \"stories\" and \"histories,\" reveals the ways that native traditions and beliefs work in the lives of characters who live far from the reservation—and in the author’s own life. Many of the \"histories\" repeat subjects and themes found in the \"stories,\" making Roofwalker a book that in which spirits and", "Roofwalker, made up of a unique combination of fiction and nonfiction, or \"stories\" and \"histories,\" reveals the ways that native traditions and beliefs work in the lives of characters who live far from the reservation—and in the author’s own life. Many of the \"histories\" repeat subjects and themes found in the \"stories,\" making Roofwalker a book that in which spirits and the living commingle and Sioux culture and modern life collide with disarming power, humor, and joy. The first seven pieces in the book are \"stories,\" fictional accounts primarily of girls and women. In the title story, a young girl believes in the power of the \"roofwalker\" spirit to make her dreams come true. In \"Beaded Souls,\" a woman is cursed by the sin of her great-grandfather, an Indian policeman who arrested Sitting Bull. \"First Fruits\" follows a native girl’s first-year at Harvard. The nonfiction pieces include Power’s imaginary account of the meeting of her Phi Beta Kappa father and Sioux mother, a piece about the letters of an Irish ancestor and another in which Power and her mother visit the Field Museum in Chicago, where a native ancestor’s dress is on display."], "author": "Susan Power", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-08-10 00:00:00", "ISBN": "157131041X"},
{"url": "https://www.goodreads.com/book/show/106931.I_Heard_the_Owl_Call_My_Name", "num_ratings": "5,138", "num_reviews": "603", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Classics", "Cultural", "Canada"], "title": "I Heard the Owl Call My Name", "description": ["In a world that knows too well the anguish inherent in the clash of old ways and new lifestyles, Margaret Craven's classic and timeless story of a young man's journey into the Pacific Northwest is as relevant today as ever.", "Here amid the grandeur of British Columbia stands the village of Kingcome, a place of salmon runs and ancient totems - a village so steeped in time that", "In a world that knows too well the anguish inherent in the clash of old ways and new lifestyles, Margaret Craven's classic and timeless story of a young man's journey into the Pacific Northwest is as relevant today as ever.", "Here amid the grandeur of British Columbia stands the village of Kingcome, a place of salmon runs and ancient totems - a village so steeped in time that, according to Kwakiutl legend, it was founded by two brothers left on earth after the great flood. Yet in this Eden of such natural beauty and richness, the old culture of totems and potlaches is under attack - slowly being replaced by a new culture of prefab houses and alcoholism. Into this world, where an entire generation of young people has become disenchanted and alienated from their heritage, Craven introduces Mark Brian, a young vicar sent to the small isolated parish by his church.", "This is Mark's journey of discovery - a journey that will teach him about life, death, and the transforming power of love. It is a journey that will resonate in the mind of readers long after the book is done."], "author": "Margaret Craven", "num_pages": "146", "awards": ["Great Lakes Colleges Association New Writers Award for Fiction (1974)", "California Young Readers Medal Nominee for Young Adult (1979)"], "places": ["British Columbia"], "character_names": [], "language": "English", "publish_date": "2005-01-10 00:00:00", "ISBN": "1550413392"},
{"url": "https://www.goodreads.com/book/show/78250.The_Teachings_of_Don_Juan", "num_ratings": "33,007", "num_reviews": "917", "avg_ratings": 3.94, "genres": ["Philosophy", "Spirituality", "Nonfiction", "Anthropology"], "title": "The Teachings of Don Juan: A Yaqui Way of Knowledge", "description": ["The story of a remarkable spiritual journey, the first awesone steps on the road to becoming \"a man of knowledge,\" the road that continues with A Separate Reality and Journey To ixtlan. Includes The Teachings and A Structural Analysis."], "author": "Carlos Castaneda", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1983-08-16 00:00:00", "ISBN": "0671227424"},
{"url": "https://www.goodreads.com/book/show/900458.Miko_Kings", "num_ratings": "220", "num_reviews": "25", "avg_ratings": 3.85, "genres": ["Fiction", "Sports", "Baseball", "Historical", "Historical Fiction", "Sports and Games", "Sports"], "title": "Miko Kings: An Indian Baseball Story", "description": [" is set in Indian Territory's queen city, Ada, Oklahoma, during the baseball fever of 1907, but moves back and forth from 1969, during the Vietnam War, to present-day Ada. The story focuses on an Indian baseball team but brings a new understanding of the term \"America's favorite pastime.\" For tribes in Indian Territory, baseball was an extension of a sport they'd", " is set in Indian Territory's queen city, Ada, Oklahoma, during the baseball fever of 1907, but moves back and forth from 1969, during the Vietnam War, to present-day Ada. The story focuses on an Indian baseball team but brings a new understanding of the term \"America's favorite pastime.\" For tribes in Indian Territory, baseball was an extension of a sport they'd been playing for centuries before their forced removal to Indian Territory.", "The story centers on the lives of Hope Little Leader, a Choctaw pitcher for the Miko Kings, and Ezol Day, a postal clerk in Indian Territory who travels forward in time to tell stories to our present-day narrator. With Day’s help, the narrator pulls us into Indian boarding schools, such as the historical Hampton Normal School for Blacks and Indians in Virginia, where the novel’s legendary love story between Justina Maurepas—a character modeled after an influential Black educator—and Hope Little Leader, begins.", "Though a lively and humorous work of fiction, the narrative draws heavily on LeAnne Howe’s careful historical research. She weaves original and fictive documents into the text, such as newspaper clippings, photographs, typewritten letters, and handwritten journal entries.", "\"LeAnne Howe's ", " is an incredible act of recovery: baseball, a sport jealously guarded by mainstream Anglo culture, is also rooted in Native American history and territory...[Howe's] compelling stories and narratives...expose the political games of the 20th century that Native Americans learned to play for resistance and survival.\"—Rigoberto González, author (", " and ", ")", ", an enrolled member of the Choctaw Nation of Oklahoma, is an author, playwright, and scholar. Born and educated in Oklahoma, she has read and lectured throughout the United States, Japan, and the Middle East. Her first novel, ", ", earned her a 2002 American Book Award and a Wordcraft Circle Writer of the Year in Creative Prose award. In 2004,", " was published in French. Howe is a recipient of a National Endowment for the Humanities award for research and a Smithsonian Native American internship for research. She has written and directed for theater, radio, and film. Her most recent film project as the narrator/host of ", " aired on PBS in the fall of 2006. She is currently an associate professor at the University of Illinois at Urbana-Champaign. "], "author": "LeAnne Howe", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-09-01 00:00:00", "ISBN": "1879960788"},
{"url": "https://www.goodreads.com/book/show/590560.Keeper_n_Me", "num_ratings": "811", "num_reviews": "93", "avg_ratings": 3.89, "genres": ["Cultural", "Canada", "Fiction"], "title": "Keeper'n Me", "description": ["When Garnet Raven was three years old, he was taken from his home on an Ojibway Indian reserve and placed in a series of foster homes. Having reached his mid-teens, he escapes at the first available opportunity, only to find himself cast adrift on the streets of the big city.", "Having skirted the urban underbelly once too often by age 20, he finds himself thrown in jail. Whil", "When Garnet Raven was three years old, he was taken from his home on an Ojibway Indian reserve and placed in a series of foster homes. Having reached his mid-teens, he escapes at the first available opportunity, only to find himself cast adrift on the streets of the big city.", "Having skirted the urban underbelly once too often by age 20, he finds himself thrown in jail. While there, he gets a surprise letter from his long-forgotten native family.", "The sudden communication from his past spurs him to return to the reserve following his release from jail. Deciding to stay awhile, his life is changed completely as he comes to discover his sense of place, and of self. While on the reserve, Garnet is initiated into the ways of the Ojibway--both ancient and modern--by Keeper, a friend of his grandfather, and last fount of history about his people's ways.", "By turns funny, poignant and mystical, ", " reflects a positive view of Native life and philosophy--as well as casting fresh light on the redemptive power of one's community and traditions."], "author": "Richard Wagamese", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-02-01 00:00:00", "ISBN": "0385254520"},
{"url": "https://www.goodreads.com/book/show/175827.People_of_the_Lakes", "num_ratings": "2,652", "num_reviews": "77", "avg_ratings": 4.27, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy"], "title": "People of the Lakes", "description": ["Clan fighting over a powerful totemic mask has brought the Mound Builder people of the Great Lakes region to the edge of destruction. It is up to Star Shell, daughter of a Hopewell chief, to rid her people of this curse. Along with her companions: Otter, a trader; Pearl, a runaway; and Green Spider, either prophet or madman, she braves the stormy waters of the lakes to rea", "Clan fighting over a powerful totemic mask has brought the Mound Builder people of the Great Lakes region to the edge of destruction. It is up to Star Shell, daughter of a Hopewell chief, to rid her people of this curse. Along with her companions: Otter, a trader; Pearl, a runaway; and Green Spider, either prophet or madman, she braves the stormy waters of the lakes to reach the majestic waterfall known as Roaring Water. She is determined to banish the mask forever to a watery grave.", "But vengeful clan members are close on her heels, and ", " have a similar fate planned for ", ".", "Set in what will become Ohio, Illinois, Kentucky and Michigan, ", "is another spell-binding epic in ", " and ", " bestelling authors W. Michael Gear and Kathleen O'Neal Gear's North America's Forgotten past saga."], "author": "Kathleen O'Neal Gear", "num_pages": "816", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-06-01 00:00:00", "ISBN": "0812507479"},
{"url": "https://www.goodreads.com/book/show/1390212.Song_of_the_Turtle", "num_ratings": "18", "num_reviews": "3", "avg_ratings": 3.83, "genres": [], "title": "Song of the Turtle: American Indian Literature 1974-1994 (Song of the Turtle)", "description": ["* Sherman Alexie * Paula Gunn Allen * Esther Belin * Betty Louis Bell * Beth Brant * Joseph Bruchac * Michelle Clinton * Robert J. Conely * Dan L. Crank * Michael Dorris * Debra Earling * Louise Erdrich * Diane Glancy * Roxy Gordon * Joy Harjo * Linda Hogan * Dean Ing * Thomas King * Lee Maracle * N. Scott Momaday * Louis Owens * Opal Lee Popkes * Susan Power * D. Renville", "* Sherman Alexie * Paula Gunn Allen * Esther Belin * Betty Louis Bell * Beth Brant * Joseph Bruchac * Michelle Clinton * Robert J. Conely * Dan L. Crank * Michael Dorris * Debra Earling * Louise Erdrich * Diane Glancy * Roxy Gordon * Joy Harjo * Linda Hogan * Dean Ing * Thomas King * Lee Maracle * N. Scott Momaday * Louis Owens * Opal Lee Popkes * Susan Power * D. Renville * Ralph Salisbury * Leslie Marmon Silko * Patricia Clark Smith * Martin Cruz Smith * Mary Randle TallMountain * Luci Tapahonso * Alice Walker * Karen Wallace * Anna Lee Walters * Emma Lee Warrior * James Welch", "In this stunning collection of American Indian literature, scholar and literary critic Paula Gunn Allen gathers together the best Native writing--indeed, some of the best American writing--from the last two decades. Song of the Turtle creates an eloquent cycle of story and self-exploration from the works of both major writers and emerging talents, and represents a unique survey of contemporary Native American work.", "In more than thirty luminous stories, American Indian writers explore the ways in which spirituality, ritual, and identity infuse and define the contemporary Native world. Patricia Clark Smith creates an Albuquerque housewife seduced by the music of the Hump Back Flute Player. Louise Erdrich immerses us in danger, conflict, and mystery during an evening of bingo. Michael Dorris tells a droll tale of courtship in a gynocentric Native society. ", "Recent Native fiction is a powerful sign of the sense of renewal and hope emanating from urban neighborhoods, rural communities, and reservations. This sense arises from the collision of despair, rage, laughter, and celebration, the intense meeting of the ancient and the not-yet-come. From it Allen has created Song of the Turtle, the canon of the future and an immensely powerful contribution to American literature."], "author": "Paula Gunn Allen", "num_pages": "353", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-08-20 00:00:00", "ISBN": "0345375254"},
{"url": "https://www.goodreads.com/book/show/425099.Listening_Woman", "num_ratings": "9,819", "num_reviews": "290", "avg_ratings": 4.14, "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Listening Woman", "description": ["Listening Woman by Tony Hillerman. HarperCollins Publishers,1978"], "author": "Tony Hillerman", "num_pages": "316", "awards": ["Edgar Award Nominee for Best Novel (1979)", "National Book Award Finalist for Mystery (Paperback) (1980)"], "places": ["United States of America"], "character_names": ["Joe Leaphorn"], "language": "English", "publish_date": "1990-07-05 00:00:00", "ISBN": "0061000299"},
{"url": "https://www.goodreads.com/book/show/18670368-a-river-too-deep", "num_ratings": "196", "num_reviews": "58", "avg_ratings": 4.43, "genres": ["Historical", "Historical Fiction", "Christian", "Christian Fiction", "Historical", "Romance", "Fiction"], "title": "A River Too Deep", "description": ["In the spring of 1817, Alcy Callen and her father visit a step-uncle they have long presumed dead; but instead of enjoying a loving reunion, they are plunged into treachery and deceit. Nothing is as they expected and little is what it seems. Even the man who helps her escape is not the reliable suitor he appears. Alcy is caught between gratitude and fear, unable to avoid h", "In the spring of 1817, Alcy Callen and her father visit a step-uncle they have long presumed dead; but instead of enjoying a loving reunion, they are plunged into treachery and deceit. Nothing is as they expected and little is what it seems. Even the man who helps her escape is not the reliable suitor he appears. Alcy is caught between gratitude and fear, unable to avoid her rescuer's attentions or understand the responses they stir. Neither can she tell what sort of man he is or what he intends to do with her in the strange place they are going. Will he keep her for himself or will he sell her to the highest bidder? Of one person only is she certain, but will he come for her before it is too late?"], "author": "Sydney Tooman Betts", "num_pages": "272", "awards": ["USA Best Book Award"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-10-07 00:00:00", "ISBN": "0989690466"},
{"url": "https://www.goodreads.com/book/show/25020808-culloo", "num_ratings": "186", "num_reviews": "27", "avg_ratings": 4.32, "genres": ["Young Adult", "Adventure", "Childrens", "Middle Grade", "Animals", "Young Adult", "Coming Of Age", "Family"], "title": "Culloo", "description": ["Tough and resourceful Tala will be 13 soon, and no one will tell her what to do. On one fateful day in the forest, however, she has to find her endangered father and protect her young brother from a trio of murderous poachers. All the while, she and her brother may have to face the forest's legendary keepers--the deceptively playful characters known as the Stone People, an", "Tough and resourceful Tala will be 13 soon, and no one will tell her what to do. On one fateful day in the forest, however, she has to find her endangered father and protect her young brother from a trio of murderous poachers. All the while, she and her brother may have to face the forest's legendary keepers--the deceptively playful characters known as the Stone People, and a giant, black bird known and feared as Culloo."], "author": "Murielle Cyr", "num_pages": "64", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-14 00:00:00", "ISBN": "1894717945"},
{"url": "https://www.goodreads.com/book/show/17661831-the-orenda", "num_ratings": "13,651", "num_reviews": "1,872", "avg_ratings": 4.23, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Canada", "Historical"], "title": "The Orenda", "description": ["In the remote winter landscape a brutal massacre and the kidnapping of a young Iroquois girl violently re-ignites a deep rift between two tribes. The girl’s captor, Bird, is one of the Huron Nation’s great warriors and statesmen. Years have passed since the murder of his family, and yet they are never far from his mind. In the girl, Snow Falls, he recognizes the ghost of h", "In the remote winter landscape a brutal massacre and the kidnapping of a young Iroquois girl violently re-ignites a deep rift between two tribes. The girl’s captor, Bird, is one of the Huron Nation’s great warriors and statesmen. Years have passed since the murder of his family, and yet they are never far from his mind. In the girl, Snow Falls, he recognizes the ghost of his lost daughter, but as he fights for her heart and allegiance, small battles erupt into bigger wars as both tribes face a new, more dangerous threat from afar.", "Traveling with the Huron is Christophe, a charismatic missionary who has found his calling among the tribe and devotes himself to learning and understanding their customs and language. An emissary from distant lands, he brings much more than his faith to this new world, with its natural beauty and riches.", "As these three souls dance with each other through intricately woven acts of duplicity, their social, political and spiritual worlds collide - and a new nation rises from a world in flux."], "author": "Joseph Boyden", "num_pages": "501", "awards": ["Scotiabank Giller Prize Nominee (2013)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général Nominee for Fiction (2013)", "Canadian Booksellers Association Libris Award for Fiction (2014)", "CBC Canada Reads (2014)", "Canadian Authors Association Award for Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-10 00:00:00", "ISBN": "0670064181"},
{"url": "https://www.goodreads.com/book/show/18858741-catori-s-worlds", "num_ratings": "185", "num_reviews": "23", "avg_ratings": 4.35, "genres": ["Young Adult", "Science Fiction", "Young Adult", "Coming Of Age", "Adventure", "Young Adult", "Young Adult Romance"], "title": "Catori's Worlds", "description": ["Catori has all the odds stacked against her: a loner with mismatched eyes who hates school and just about everybody who goes there. Her ability to see things nobody else does makes her an oddball at school. She accidently boards the wrong bus to school one morning and is transported to a strange parallel world. There’s no way back for her; the bus she boarded doesn't do re", "Catori has all the odds stacked against her: a loner with mismatched eyes who hates school and just about everybody who goes there. Her ability to see things nobody else does makes her an oddball at school. She accidently boards the wrong bus to school one morning and is transported to a strange parallel world. There’s no way back for her; the bus she boarded doesn't do return trips and she has to figure out her own way back. She discovers that the evil forces over-running this parallel world are tracking her down and have no intention of letting her go home alive. ", "Trusting strangers doesn't come easy to her, but her only hope of escaping her hunters is to follow Miren, a girl she encounters in the public restrooms. They manage to reach a secluded wood where Catori meets up with Otsoa, the only boy who has ever made her feel like she was worthy of love. She must fight another intense battle – she must choose between her loyalty to her friend Miren and her infatuation for Otsoa, the handsome, would-be rock star. The evil forces have zeroed in on them and Catori must fight for her life. What chance does a lone fifteen-year-old girl have to confront those powerful forces? Does she bow to their evil scheme of taking over planet Earth or does she fight them to her last breath?"], "author": "Murielle Cyr", "num_pages": "126", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-19 00:00:00", "ISBN": "B00JSISQ1U"},
{"url": "https://www.goodreads.com/book/show/52878.Indian_Killer", "num_ratings": "6,870", "num_reviews": "564", "avg_ratings": 3.78, "genres": ["Fiction", "Mystery", "Novels", "Contemporary", "Thriller"], "title": "Indian Killer", "description": ["A murderer is stalking and scalping white men in Seattle, his calling card a pair of feathers crossed on the victim's chest. While this so-called Indian Killer terrorises the city, its Native American population is thrown into turmoil. With each new murder, the city is gripped by fear, and as the killer searches for his latest victim, the novel builds to its unexpected and", "A murderer is stalking and scalping white men in Seattle, his calling card a pair of feathers crossed on the victim's chest. While this so-called Indian Killer terrorises the city, its Native American population is thrown into turmoil. With each new murder, the city is gripped by fear, and as the killer searches for his latest victim, the novel builds to its unexpected and terrifying climax."], "author": "Sherman Alexie", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-08-16 00:00:00", "ISBN": "009926823X"},
{"url": "https://www.goodreads.com/book/show/11994903-indian-horse", "num_ratings": "8,379", "num_reviews": "1,069", "avg_ratings": 4.35, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Indian Horse", "description": ["Saul Indian Horse has hit bottom. His last binge almost killed him, and now he’s a reluctant resident in a treatment centre for alcoholics, surrounded by people he’s sure will never understand him. But Saul wants peace, and he grudgingly comes to see that he’ll find it only through telling his story. With him, readers embark on a journey back through the life he’s led as a", "Saul Indian Horse has hit bottom. His last binge almost killed him, and now he’s a reluctant resident in a treatment centre for alcoholics, surrounded by people he’s sure will never understand him. But Saul wants peace, and he grudgingly comes to see that he’ll find it only through telling his story. With him, readers embark on a journey back through the life he’s led as a northern Ojibway, with all its joys and sorrows.", "With compassion and insight, author Richard Wagamese traces through his fictional characters the decline of a culture and a cultural way. For Saul, taken forcibly from the land and his family when he’s sent to residential school, salvation comes for a while through his incredible gifts as a hockey player. But in the harsh realities of 1960s Canada, he battles obdurate racism and the spirit-destroying effects of cultural alienation and displacement. ", " unfolds against the bleak loveliness of northern Ontario, all rock, marsh, bog and cedar. Wagamese writes with a spare beauty, penetrating the heart of a remarkable Ojibway man."], "author": "Richard Wagamese", "num_pages": "221", "awards": ["First Nation Communities Read Award (2013)", "CBC Canada Reads Nominee (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-27 00:00:00", "ISBN": "1553654021"},
{"url": "https://www.goodreads.com/book/show/52528.The_Painted_Drum", "num_ratings": "6,378", "num_reviews": "794", "avg_ratings": 3.85, "genres": ["Fiction", "Historical", "Historical Fiction", "Audiobook", "Novels"], "title": "The Painted Drum", "description": ["When a woman named Faye Travers is called upon to appraise the estate of a family in her small New Hampshire town, she isn't surprised to discover a forgotten cache of valuable Native American artifacts. After all, the family descends from an Indian agent who worked on the North Dakota Ojibwe reservation that is home to her mother's family. However, she stops dead in her t", "When a woman named Faye Travers is called upon to appraise the estate of a family in her small New Hampshire town, she isn't surprised to discover a forgotten cache of valuable Native American artifacts. After all, the family descends from an Indian agent who worked on the North Dakota Ojibwe reservation that is home to her mother's family. However, she stops dead in her tracks when she finds in the collection a rare drum—a powerful yet delicate object, made from a massive moose skin stretched across a hollow of cedar, ornamented with symbols she doesn't recognize and dressed in red tassels and a beaded belt and skirt—especially since, without touching the instrument, she hears it sound. And so begins an illuminating journey both backward and forward in time, following the strange passage of a powerful yet delicate instrument, and revealing the extraordinary lives it has touched and defined.", "Compelling and unforgettable, bestselling author Louise Erdrich's ", " explores the often fraught relationship between mothers and daughters, the strength of family, and the intricate rhythms of grief with all the grace, wit, and startling beauty that characterizes this acclaimed author's finest work."], "author": "Louise Erdrich", "num_pages": "304", "awards": ["Chicago Tribune Heartland Prize for Fiction (2006)", "Minnesota Book Award for Novel & Short Story (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-22 00:00:00", "ISBN": "0060515112"},
{"url": "https://www.goodreads.com/book/show/1107830.Flight", "num_ratings": "13,615", "num_reviews": "2,021", "avg_ratings": 3.89, "genres": ["Fiction", "Young Adult", "Fantasy", "Historical", "Historical Fiction", "Science Fiction", "Time Travel", "Audiobook", "Magical Realism", "Science Fiction", "Novels", "Young Adult", "Coming Of Age"], "title": "Flight", "description": ["follows this troubled foster teenager - a boy who is not a 'legal' Indian because he was never claimed by his father - as he learns that violence is not the answer.", "The journey for ", "'s young hero begins as he's about to commit a massive act of violence. At the moment of the decision, he finds himself shot back through time to resurface in the body of an FBI agen", "follows this troubled foster teenager - a boy who is not a 'legal' Indian because he was never claimed by his father - as he learns that violence is not the answer.", "The journey for ", "'s young hero begins as he's about to commit a massive act of violence. At the moment of the decision, he finds himself shot back through time to resurface in the body of an FBI agent during the civil rights era, where he sees why 'Hell is Red River, Idaho, in the 1970s'. Red River is only the first stop in an eye-opening trip through moments in American history. He will continue travelling back to inhabit the body of an Indian child during the battle at Little Bighorn and then ride with an Indian tracker in the nineteenth century before materialising as an airline pilot jetting through the skies today. During these travels through time, his refrain grows: 'Who's to judge?'", "This novel seeks nothing less than an understanding of why human beings hate. ", " is irrepressible and fearless - Sherman Alexie at his most brilliant."], "author": "Sherman Alexie", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-01-03 00:00:00", "ISBN": "1846551528"},
{"url": "https://www.goodreads.com/book/show/91437.Four_Souls", "num_ratings": "3,140", "num_reviews": "295", "avg_ratings": 3.9, "genres": ["Fiction", "Historical", "Historical Fiction", "Literary Fiction", "Novels"], "title": "Four Souls", "description": ["This small but incredibly rich chapter in Erdrich's ongoing Native American saga is a continuation of the story of the enigmatic Fleur Pillager, begun in ", " (1988).", " begins with Fleur Pillager's journey from North Dakota to Minneapolis, where she plans to avenge the loss of her family's land to a white man. After a dream vision that gives her a powerful new na", "This small but incredibly rich chapter in Erdrich's ongoing Native American saga is a continuation of the story of the enigmatic Fleur Pillager, begun in ", " (1988).", " begins with Fleur Pillager's journey from North Dakota to Minneapolis, where she plans to avenge the loss of her family's land to a white man. After a dream vision that gives her a powerful new name, Four Souls, she enters the household of John James Mauser. A man notorious for his wealth and his mansion on a hill, Mauser became rich by deceiving young Indian women and taking possession of their ancestral lands. What promises to be a straightforward tale of revenge, however, slowly metamorphoses into a more complex evocation of human nature. The story of anger and retribution that begins in ", " becomes a story of healing and love in ", "."], "author": "Louise Erdrich", "num_pages": "210", "awards": ["WILLA Literary Award Nominee for Historical Fiction (Finalist) (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2017-08-29 00:00:00", "ISBN": "0060935227"},
{"url": "https://www.goodreads.com/book/show/3192742-dances-with-wolves", "num_ratings": "21,954", "num_reviews": "427", "avg_ratings": 4.2, "genres": ["Historical", "Historical Fiction", "Fiction", "Westerns", "Historical", "Classics"], "title": "Dances With Wolves", "description": ["Ordered to hold an abandoned army post, John Dunbar found himself alone, beyond the edge of civilization. Thievery and survival soon forced him into the Indian camp, where he began a dangerous adventure that changed his life forever. Relive the adventure and beauty of the incredible movie, DANCES WITH WOLVES."], "author": "Michael Blake", "num_pages": "324", "awards": ["Soaring Eagle Book Award (1992)"], "places": ["United States of America"], "character_names": ["Kicking Bird", "John Dunbar", "Wind In His Hair", "Stands With A Fist"], "language": "English", "publish_date": "1991-03-01 00:00:00", "ISBN": "1557040915"},
{"url": "https://www.goodreads.com/book/show/2227528.The_Plague_of_Doves", "num_ratings": "11,448", "num_reviews": "1,708", "avg_ratings": 3.76, "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Novels"], "title": "The Plague of Doves", "author": "Louise Erdrich", "num_pages": "313", "awards": ["Pulitzer Prize Nominee for Fiction (2009)", "Anisfield-Wolf Book Award (2009)", "Dayton Literary Peace Prize Nominee for Fiction (2009)", "Minnesota Book Award for Novel & Short Story (2009)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2008-04-29 00:00:00", "ISBN": "0060515120"},
{"url": "https://www.goodreads.com/book/show/63837.The_Last_Report_on_the_Miracles_at_Little_No_Horse", "num_ratings": "8,649", "num_reviews": "999", "avg_ratings": 4.18, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Novels"], "title": "The Last Report on the Miracles at Little No Horse", "description": ["This is the story of Father Damien Modeste, priest to his beloved people, the Ojibwe. Modeste, nearing the end of his life, dreads the discovery of his physical identity -- for he is a woman who has lived as a man.", "For more than a half century, Father Damien Modeste has served his beloved people, the Ojibwe, on the remote reservation of Little No Horse. To complicate his fe", "This is the story of Father Damien Modeste, priest to his beloved people, the Ojibwe. Modeste, nearing the end of his life, dreads the discovery of his physical identity -- for he is a woman who has lived as a man.", "For more than a half century, Father Damien Modeste has served his beloved people, the Ojibwe, on the remote reservation of Little No Horse. To complicate his fears, his quiet life changes when a troubled colleague comes to the reservation to investigate the life of the perplexing, difficult, possibly false saint Sister Leopolda. Father Damien alone knows the strange truth of Sister Leopolda's piety and is faced with the most difficult decision of his life: Should he reveal all he knows and risk everything? Or should he manufacture a protective history though he believes Leopolda's wonder-working is motivated by evil?"], "author": "Louise Erdrich", "num_pages": "368", "awards": ["Minnesota Book Award for Novel & Short Story (2002)", "National Book Award Finalist for Fiction (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0007136358"},
{"url": "https://www.goodreads.com/book/show/46276.The_Grass_Dancer", "num_ratings": "2,268", "num_reviews": "131", "avg_ratings": 3.96, "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Magical Realism"], "title": "The Grass Dancer", "description": ["From the lore of her people, the Sioux, Susan Power presents an extraordinary debut novel rich in drama and infused with magic. Set on a North Dakota reservation, this book weaves the stories of the old and the young, broken families, romantic rivals, and men and women in love and at war."], "author": "Susan Power", "num_pages": "352", "awards": ["PEN/Hemingway Foundation Award (1995)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "1997-04-01 00:00:00", "ISBN": "0425159531"},
{"url": "https://www.goodreads.com/book/show/22610866-dwellers-of-ahwahnee", "num_ratings": "123", "num_reviews": "33", "avg_ratings": 4.76, "genres": ["Fantasy", "Mythology", "Young Adult", "Paranormal", "Shapeshifters", "Romance", "Paranormal Romance", "Inspirational", "Fantasy", "Supernatural"], "title": "Dwellers of Ahwahnee (The Beyond Collection)", "description": ["The Dwellers of Ahwahnee (The Beyond Collection) is finally here! 3 Great paranormal books that follow the generation of shifters from the Ahwahneechee. These books are found on Goodreads lists and are #1 in many categories.", "Come to the Beyond for a supernatural unique read!", "BOOK 1: BEYOND BRIDALVEIL FALL", "Oria is celebrating her eighteenth birthday in Yosemite National Park w", "The Dwellers of Ahwahnee (The Beyond Collection) is finally here! 3 Great paranormal books that follow the generation of shifters from the Ahwahneechee. These books are found on Goodreads lists and are #1 in many categories.", "Come to the Beyond for a supernatural unique read!", "BOOK 1: BEYOND BRIDALVEIL FALL", "Oria is celebrating her eighteenth birthday in Yosemite National Park when she goes into the pool at the bottom of Bridalveil Fall, only to come out beyond it.", "In another world she learns she is The Golden Queen of the Ahwahneechee tribe, and that she is a shape shifter. Here the Dwellers of Ahwahnee fight the Evil that tries to get into the world of man. Will she find her soul mate in Grey Wolf or is he more than he appears to be? One thing is for sure, with all the magic and shape shifting happening, only the all knowing grandfather and her grandmother's wisdom can guide her through the Evil Beyond Bridalveil Fall.", "BOOK 2: BEYOND ORIA FALLS", "Oria is the Golden Queen of the Ahwahneechees and a Dweller of Ahwahnee. Together with her friends she travels back to find out why the Village of Lost Souls cannot find their way home to the West. The Ale is back in this second book full of action packed magic and shapeshifting. Will Oria finally find love and happiness with Grey Wolf or will a new evil threaten her magical world Beyond Oria Falls? Join the Dwellers as they try to keep evil out of the world of man.", "BOOK 3: BEYOND THE WORLD OF MAN", "This is the third installment in the Dwellers of Ahwahnee series and with the destruction of the world of man, the Dwellers traveled to other worlds and survived for twenty years.", "With Oria's magic the 'Beyond' has grown and they can now come home.", "There is a different kind of evil in the world now. Who will survive in the 'Beyond'? This generation", "of shapeshifters are different and will lead the Dwellers into a new age.", "Spirit Walker is rebellious and has often been called a Wildcat. She has been sheltered in The Village of Lost Souls for her entire life. Now she is to become the Golden Queen of the Ahwahneechees.", "Her choices for the future involve adult decisions and with only her mother's journal to guide her, she must rely on the magic within the pages."], "author": "Sheryl Seal", "num_pages": "502", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-29 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6387626-war-dances", "num_ratings": "5,945", "num_reviews": "839", "avg_ratings": 3.93, "genres": ["Short Stories", "Fiction", "Poetry", "Contemporary"], "title": "War Dances", "description": ["Fresh off his National Book Award win, Alexie delivers a heartbreaking, hilarious collection of stories that explores the precarious balance between self-preservation and external responsibility in art, family, and the world at large. With unparalleled insight into the minds of artists, laborers, fathers, husbands, and sons, Alexie populates his stories with ordinary men o", "Fresh off his National Book Award win, Alexie delivers a heartbreaking, hilarious collection of stories that explores the precarious balance between self-preservation and external responsibility in art, family, and the world at large. With unparalleled insight into the minds of artists, laborers, fathers, husbands, and sons, Alexie populates his stories with ordinary men on the brink of exceptional change. In a bicoastal journey through the consequences of both simple and monumental life choices, Alexie introduces us to personal worlds as they transform beyond return. In the title story, a famous writer must decide how to care for his distant father who is slowly dying a “natural Indian death” from alcohol and diabetes, just as he learns that he himself may have a brain tumor. Alexie dissects a vintage-clothing store owner’s failing marriage and his courtship of a married photographer in various airports across the country; what happens when a politician’s son commits a hate crime; and how a young boy discovers his self-worth while writing obituaries for his local newspaper. Brazen and wise, ", " takes us to the heart of what it means to be human. This provocative new work is Alexie at the height of his powers."], "author": "Sherman Alexie", "num_pages": "209", "awards": ["PEN/Faulkner Award for Fiction (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-01 00:00:00", "ISBN": "0802119190"},
{"url": "https://www.goodreads.com/book/show/292706.Monkey_Beach", "num_ratings": "3,856", "num_reviews": "331", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "Canada"], "title": "Monkey Beach", "description": ["Five hundred miles north of Vancouver is Kitamaat, an Indian reservation in the homeland of the Haisla people. Growing up a tough, wild tomboy, swimming, fighting, and fishing in a remote village where the land slips into the green ocean on the edge of the world, Lisamarie has always been different. ", "Visited by ghosts and shapeshifters, tormented by premonitions, she can't", "Five hundred miles north of Vancouver is Kitamaat, an Indian reservation in the homeland of the Haisla people. Growing up a tough, wild tomboy, swimming, fighting, and fishing in a remote village where the land slips into the green ocean on the edge of the world, Lisamarie has always been different. ", "Visited by ghosts and shapeshifters, tormented by premonitions, she can't escape the sense that something terrible is waiting for her. She recounts her enchanted yet scarred life as she journeys in her speedboat up the frigid waters of the Douglas Channel. She is searching for her brother, dead by drowning, and in her own way running as fast as she can toward danger. Circling her brother's tragic death are the remarkable characters that make up her family: Lisamarie's parents, struggling to join their Haisla heritage with Western ways; Uncle Mick, a Native rights activist and devoted Elvis fan; and the headstrong Ma-ma-oo (Haisla for \"grandmother\"), a guardian of tradition. ", "Haunting, funny, and vividly poignant, ", " gives full scope to Robinson's startling ability to make bedfellows of comedy and the dark underside of life. Informed as much by its lush living wilderness as by the humanity of its colorful characters, ", " is a profoundly moving story about childhood and the pain of growing older--a multilayered tale of family grief and redemption."], "author": "Eden Robinson", "num_pages": "384", "awards": ["Scotiabank Giller Prize Nominee (2000)", "Ethel Wilson Fiction Prize (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-04-09 00:00:00", "ISBN": "0618219056"},
{"url": "https://www.goodreads.com/book/show/588234.Ceremony", "num_ratings": "14,965", "num_reviews": "1,124", "avg_ratings": 3.75, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Academic", "School"], "title": "Ceremony", "description": ["Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind o", "Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind of comfort and resolution. Tayo's quest leads him back to the Indian past and its traditions, to beliefs about witchcraft and evil, and to the ancient stories of his people. The search itself becomes a ritual, a curative ceremony that defeats the most virulent of afflictions—despair."], "author": "Leslie Marmon Silko", "num_pages": "262", "awards": ["American Book Award (1980)"], "places": [], "character_names": [], "language": "English", "publish_date": "1986-03-04 00:00:00", "ISBN": "0140086838"},
{"url": "https://www.goodreads.com/book/show/3479967-through-black-spruce", "num_ratings": "12,051", "num_reviews": "833", "avg_ratings": 4.12, "genres": ["Fiction", "Cultural", "Canada", "Historical", "Historical Fiction"], "title": "Through Black Spruce", "description": ["Will Bird is a legendary Cree bush pilot, now lying in a coma in a hospital in his hometown of Moose Factory, Ontario. His niece Annie Bird, beautiful and self-reliant, has returned from her own perilous journey to sit beside his bed. Broken in different ways, the two take silent communion in th", "Will Bird is a legendary Cree bush pilot, now lying in a coma in a hospital in his hometown of Moose Factory, Ontario. His niece Annie Bird, beautiful and self-reliant, has returned from her own perilous journey to sit beside his bed. Broken in different ways, the two take silent communion in their unspoken kinship, and the story that unfolds is rife with heartbreak, fierce love, ancient blood feuds, mysterious disappearances, fires, plane crashes, murders, and the bonds that hold a family, and a people, together. As Will and Annie reveal their secrets-the tragic betrayal that cost Will his family, Annie's desperate search for her missing sister, the famous model Suzanne-a remarkable saga of resilience and destiny takes shape. From the dangerous bush country of upper Canada to the drug-fueled glamour of the Manhattan club scene, Joseph Boyden tracks his characters with a keen eye for the telling detail and a rare empathy for the empty places concealed within the heart. Sure to appeal to readers of Louise Erdrich and Jim Harrison, ", " establishes Boyden as a writer of startling originality and uncommon power."], "author": "Joseph Boyden", "num_pages": "359", "awards": ["Scotiabank Giller Prize (2008)", "Canadian Booksellers Association Libris Award for Fiction Book (2009)"], "places": ["Ontario", "Manhattan, New York City, New York"], "character_names": ["Will Bird", "Annie Bird", "Marius Netmaker"], "language": "English", "publish_date": "2008-09-09 00:00:00", "ISBN": "0670020575"},
{"url": "https://www.goodreads.com/book/show/78887.Tracks", "num_ratings": "9,735", "num_reviews": "524", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "Magical Realism", "Academic", "School"], "title": "Tracks", "description": ["Set earliest in time within the cycle of her prizewinning and bestselling books, Love Medicine and The Beet Queen, Tracks takes readers to North Dakota at a time when Indian tribes were struggling to keep what little remained of their land. Features many familiar characters."], "author": "Louise Erdrich", "num_pages": "226", "awards": [], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "1989-08-07 00:00:00", "ISBN": "0060972459"},
{"url": "https://www.goodreads.com/book/show/13602426-the-round-house", "num_ratings": "83,152", "num_reviews": "8,628", "avg_ratings": 3.92, "genres": ["Fiction", "Mystery", "Historical", "Historical Fiction", "Young Adult", "Coming Of Age"], "title": "The Round House", "description": ["An exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family.", "One of the most revered novelists of our time - a brilliant chronicler of Native-American life - Louise Erdrich returns to the territory of her bestselling, Pulitzer Prize finalist The Plague of Doves wi", "An exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family.", "One of the most revered novelists of our time - a brilliant chronicler of Native-American life - Louise Erdrich returns to the territory of her bestselling, Pulitzer Prize finalist The Plague of Doves with The Round House, transporting readers to the Ojibwe reservation in North Dakota. It is an exquisitely told story of a boy on the cusp of manhood who seeks justice and understanding in the wake of a terrible crime that upends and forever transforms his family. ", "Riveting and suspenseful, arguably the most accessible novel to date from the creator of Love Medicine, The Beet Queen, and The Bingo Palace, Erdrich’s The Round House is a page-turning masterpiece of literary fiction - at once a powerful coming-of-age story, a mystery, and a tender, moving novel of family, history, and culture."], "author": "Louise Erdrich", "num_pages": "323", "awards": ["National Book Award for Fiction (2012)", "American Book Award (2013)", "ALA Alex Award (2013)", "Indies Choice Book Award for Adult Fiction (2013)", "Dayton Literary Peace Prize Nominee for Fiction (2013)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2013)", "Minnesota Book Award for Novel & Short Story (2013)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2012-10-02 00:00:00", "ISBN": "0062065246"},
{"url": "https://www.goodreads.com/book/show/106542.The_Antelope_Wife", "num_ratings": "3,058", "num_reviews": "278", "avg_ratings": 3.8, "genres": ["Fiction", "Fantasy", "Magical Realism", "Historical", "Historical Fiction"], "title": "The Antelope Wife", "description": ["One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life", "One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life the people who live in or around this midwestern city. And like a modern city itself, it portrays people of all backgrounds and is a mixture of vibrant cultures and ideas. But also like a modern city, it has an edge, troubled by violence.", "\"New York Times\" bestselling author Louise Erdrich has twice won the National Magazine Award and her work has been included in both the O. Henry and the Best American collections several times."], "author": "Louise Erdrich", "num_pages": "256", "awards": ["World Fantasy Award for Best Novel (1999)"], "places": ["Minneapolis, Minnesota"], "character_names": [], "language": "English", "publish_date": "1998-10-16 00:00:00", "ISBN": "0007136366"},
{"url": "https://www.goodreads.com/book/show/6159.Reservation_Blues", "num_ratings": "11,605", "num_reviews": "837", "avg_ratings": 3.98, "genres": ["Fiction", "Magical Realism", "Literature", "Novels"], "title": "Reservation Blues", "description": ["The life of Spokane Indian Thomas Builds-the-Fire irrevocably changes when blues legend Robert Johnson miraculously appears on his reservation and passes the misfit storyteller his enchanted guitar. Inspired by this gift, Thomas forms Coyote Springs, an all-Indian Catholic band who find themselves on a magical tour that leads from reservation bars to Seattle and New York--", "The life of Spokane Indian Thomas Builds-the-Fire irrevocably changes when blues legend Robert Johnson miraculously appears on his reservation and passes the misfit storyteller his enchanted guitar. Inspired by this gift, Thomas forms Coyote Springs, an all-Indian Catholic band who find themselves on a magical tour that leads from reservation bars to Seattle and New York--and deep within their own souls."], "author": "Sherman Alexie", "num_pages": "306", "awards": ["American Book Award (1996)", "International DUBLIN Literary Award Nominee (1997)"], "places": ["Wellpinit, Washington"], "character_names": [], "language": "English", "publish_date": "2005-02-07 00:00:00", "ISBN": "0802141900"},
{"url": "https://www.goodreads.com/book/show/57458.Fools_Crow", "num_ratings": "3,328", "num_reviews": "232", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Academic", "School", "Adult"], "title": "Fools Crow", "description": ["Set in Montana shortly after the Civil War, this novel tells of White Man's Dog (later known as Fools Crow so called after he killed the chief of the Crows during a raid), a young Blackfeet Indian on the verge of manhood, and his band, known as the Lone Eaters. The invasion of white society threatens to change their traditional way of life, and they must choose to fight or", "Set in Montana shortly after the Civil War, this novel tells of White Man's Dog (later known as Fools Crow so called after he killed the chief of the Crows during a raid), a young Blackfeet Indian on the verge of manhood, and his band, known as the Lone Eaters. The invasion of white society threatens to change their traditional way of life, and they must choose to fight or assimilate. ", "The story is a powerful portrait of a fading way of life. The story culminates with the historic Marias Massacre of 1870, in which the U.S. Cavalry mistakenly killed a friendly band of Blackfeet, consisting mostly of non-combatants.", "\"A major contribution to Native American literature.\" -- Wallace Stegner."], "author": "James Welch", "num_pages": "400", "awards": ["American Book Award (1987)", "Los Angeles Times Book Prize for Fiction (1987)"], "places": ["Montana"], "character_names": ["Siksika Indians", "Blackfeet Indians"], "language": "English", "publish_date": "1987-11-03 00:00:00", "ISBN": "0140089373"},
{"url": "https://www.goodreads.com/book/show/46277.Green_Grass_Running_Water", "num_ratings": "5,609", "num_reviews": "355", "avg_ratings": 4.02, "genres": ["Fiction", "Cultural", "Canada", "Fantasy", "Magical Realism"], "title": "Green Grass, Running Water", "description": ["Strong, Sassy women and hard-luck hardheaded men, all searching for the middle ground between Native American tradition and the modern world, perform an elaborate dance of approach and avoidance in this magical, rollicking tale by Cherokee author Thomas King. Alberta is a university professor who would like to trade her two boyfriends for a baby but no husband; Lionel is f", "Strong, Sassy women and hard-luck hardheaded men, all searching for the middle ground between Native American tradition and the modern world, perform an elaborate dance of approach and avoidance in this magical, rollicking tale by Cherokee author Thomas King. Alberta is a university professor who would like to trade her two boyfriends for a baby but no husband; Lionel is forty and still sells televisions for a patronizing boss; Eli and his log cabin stand in the way of a profitable dam project. These three—and others—are coming to the Blackfoot reservation for the Sun Dance and there they will encounter four Indian elders and their companion, the trickster Coyote—and nothing in the small town of Blossom will be the same again…"], "author": "Thomas King", "num_pages": "469", "awards": ["Canadian Authors Association Award for Fiction"], "places": ["Alberta"], "character_names": [], "language": "English", "publish_date": "1994-06-01 00:00:00", "ISBN": "0553373684"},
{"url": "https://www.goodreads.com/book/show/21410220-beyond-bridalveil-fall", "num_ratings": "267", "num_reviews": "70", "avg_ratings": 4.04, "genres": ["Fantasy", "Fantasy", "Paranormal", "Young Adult", "Adventure", "Fantasy", "Supernatural", "Paranormal", "Shapeshifters"], "title": "Beyond Bridalveil Fall", "description": ["Oria is celebrating her eighteenth birthday in Yosemite Naltional Park when she goes into the pool at the bottom of Bridaleveil Fall, only to come out beyond it.", "In another world she learns she is The Golden Queen fairy of the Ahwahneechee tribe, and that she is a shapeshifter. Here the Dwellers of Ahwahnee fight the Evil that tries to get into the world of man. Will she fi", "Oria is celebrating her eighteenth birthday in Yosemite Naltional Park when she goes into the pool at the bottom of Bridaleveil Fall, only to come out beyond it.", "In another world she learns she is The Golden Queen fairy of the Ahwahneechee tribe, and that she is a shapeshifter. Here the Dwellers of Ahwahnee fight the Evil that tries to get into the world of man. Will she find her soul mate in Grey Wolf or is he more than he appears to be? One thing is for sure, with all the magic and shape shifting happening, only the all knowing grandfather can guide her through the Evil Beyond Bridalveil Fall."], "author": "Sheryl Seal", "num_pages": "379", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/823411.Three_Day_Road", "num_ratings": "17,873", "num_reviews": "1,482", "avg_ratings": 4.31, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Canada", "War"], "title": "Three Day Road", "description": ["It is 1919, and Niska, the last Oji-Cree woman to live off the land, has received word that one of the two boys she saw off to the Great War has returned. Xavier Bird, her sole living relation, is gravely wounded and addicted to morphine. As Niska slowly paddles her canoe on the three-day journey to bring Xavier home, travelling through the stark but stunning landscape of", "It is 1919, and Niska, the last Oji-Cree woman to live off the land, has received word that one of the two boys she saw off to the Great War has returned. Xavier Bird, her sole living relation, is gravely wounded and addicted to morphine. As Niska slowly paddles her canoe on the three-day journey to bring Xavier home, travelling through the stark but stunning landscape of Northern Ontario, their respective stories emerge—stories of Niska’s life among her kin and of Xavier’s horrifying experiences in the killing fields of Ypres and the Somme."], "author": "Joseph Boyden", "num_pages": "384", "awards": ["Canadian Booksellers Association Libris Award for Fiction Book (2006)", "Canadian Authors Association Award for Fiction (2006)", "Rogers Writers' Trust Fiction Prize (2005)", "McNally Robinson Aboriginal Book of the Year Award", "Amazon.ca First Novel Award (2005)", "OLA Evergreen Award (2006)"], "places": [], "character_names": ["Xavier Bird", "Niska", "Elijah Whiskeyjack"], "language": "English", "publish_date": "2006-03-14 00:00:00", "ISBN": "0143017861"},
{"url": "https://www.goodreads.com/book/show/91440.Love_Medicine", "num_ratings": "18,507", "num_reviews": "1,266", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Short Stories", "Novels"], "title": "Love Medicine", "description": ["The first book in Louise Erdrich's highly acclaimed \"Native American\" trilogy that includes \"The Beet Queen,\" \"Tracks,\" and \"The Bingo Palace,\" re-sequenced and expanded to include never-before-published chapters.", "\"A dazzling series of family portraits.... This novel is simply about the power of love.\" --"], "author": "Louise Erdrich", "num_pages": "367", "awards": ["American Book Award (1985)", "Los Angeles Times Book Prize for Fiction (1985)", "Sue Kaufman Prize for First Fiction (1985)", "Great Lakes Colleges Association New Writers Award for Fiction (1985)", "National Book Critics Circle Award for Fiction (1984)"], "places": ["North Dakota"], "character_names": [], "language": "English", "publish_date": "2005-08-02 00:00:00", "ISBN": "0060786469"},
{"url": "https://www.goodreads.com/book/show/52873.The_Lone_Ranger_and_Tonto_Fistfight_in_Heaven", "num_ratings": "21,749", "num_reviews": "1,804", "avg_ratings": 4.09, "genres": ["Fiction", "Short Stories", "Literature", "Humor"], "title": "The Lone Ranger and Tonto Fistfight in Heaven", "description": ["In this darkly comic short story collection, Sherman Alexie, a Spokane/Coeur d'Alene Indian, brilliantly weaves memory, fantasy, and stark realism to paint a complex, grimly ironic portrait of life in and around the Spoke Indian Reservation. These 22 interlinked tales are narrated by characters raised on humiliation and government-issue cheese, and yet are filled with pass", "In this darkly comic short story collection, Sherman Alexie, a Spokane/Coeur d'Alene Indian, brilliantly weaves memory, fantasy, and stark realism to paint a complex, grimly ironic portrait of life in and around the Spoke Indian Reservation. These 22 interlinked tales are narrated by characters raised on humiliation and government-issue cheese, and yet are filled with passion and affection, myth and dream. There is Victor, who as a nine-year-old crawled between his unconscious parents hoping that the alcohol seeping through their skins might help him sleep. Thomas Builds-the-Fire, who tells his stories long after people stop listening, and Jimmy Many Horses, dying of cancer, who writes letters on stationary that reads \"From the Death Bed of James Many Horses III,\" even though he actually writes them on his kitchen table. Against a backdrop of alcohol, car accidents, laughter, and basketball, Alexie depicts the distances between Indians and whites, reservation Indians and urban Indians, men and women, and most poetically, between modern Indians and the traditions of the past."], "author": "Sherman Alexie", "num_pages": "242", "awards": ["PEN/Hemingway Foundation Award Nominee (1993)", "Washington State Book Award (1994)"], "places": ["Washington (the state)"], "character_names": [], "language": "English", "publish_date": "2005-02-08 00:00:00", "ISBN": "0802141676"}
]