[
{"url": "https://www.goodreads.com/book/show/11486.The_Color_Purple", "num_ratings": "435,722", "num_reviews": "11,087", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "295", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2004-04-01 00:00:00", "ISBN": "0671727796"},
{"url": "https://www.goodreads.com/book/show/17751274-ascension", "num_ratings": "1,098", "num_reviews": "246", "avg_ratings": 3.55, "genres": ["Science Fiction", "Lgbt", "Glbt", "Queer", "Fiction", "Romance"], "title": "Ascension", "description": ["Alana Quick is the best damned sky surgeon in Heliodor City, but repairing starship engines barely pays the bills. When the desperate crew of a cargo vessel stops by her shipyard looking for her spiritually advanced sister Nova, Alana stows away. Maybe her boldness will land her a long-term gig on the crew. But the ", " proves to be more than star-watching and plas", "Alana Quick is the best damned sky surgeon in Heliodor City, but repairing starship engines barely pays the bills. When the desperate crew of a cargo vessel stops by her shipyard looking for her spiritually advanced sister Nova, Alana stows away. Maybe her boldness will land her a long-term gig on the crew. But the ", " proves to be more than star-watching and plasma coils. The chief engineer thinks he's a wolf. The pilot fades in and out of existence. The captain is all blond hair, boots, and ego . . . and Alana can't keep her eyes off her. But there's little time for romance: Nova's in danger and someone will do anything--even destroying planets--to get their hands on her."], "author": "Jacqueline Koyanagi", "num_pages": "331", "awards": ["James Tiptree Jr. Award Honor List (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-04 00:00:00", "ISBN": "1607014017"},
{"url": "https://www.goodreads.com/book/show/13422218-sbf-seeking", "num_ratings": "33", "num_reviews": "8", "avg_ratings": 3.67, "genres": ["Glbt", "Lesbian", "Lgbt", "Novels"], "title": "SBF Seeking", "description": ["Four months before her wedding, Yvette Thurman realizes this might be her last chance to have a sexual fling with a white man. But she never thought placing a personal ad would lead her to discover she was a lesbian. ", " Yvette's small town life in eastern North Carolina never prepared her for the personal journey she undertakes as she struggles to find her heart's path. ", " Thr", "Four months before her wedding, Yvette Thurman realizes this might be her last chance to have a sexual fling with a white man. But she never thought placing a personal ad would lead her to discover she was a lesbian. ", " Yvette's small town life in eastern North Carolina never prepared her for the personal journey she undertakes as she struggles to find her heart's path. ", " Through personal ads and late night visits to an adult bookstore, Yvette learns more about her own personal desires than she ever did when she was engaged to be married. If she embraces her true self, can she find acceptance and love from her family and friends? Or will she be forced to hide who she really is from those she cares about the most?"], "author": "LaToya Hankins", "num_pages": "234", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-22 00:00:00", "ISBN": "1468030108"},
{"url": "https://www.goodreads.com/book/show/272333.The_House_You_Pass_on_the_Way", "num_ratings": "1,364", "num_reviews": "129", "avg_ratings": 3.76, "genres": ["Young Adult", "Lgbt", "Glbt", "Queer", "Fiction", "Realistic Fiction"], "title": "The House You Pass on the Way", "description": ["Staggerlee is used to being alone. As the granddaughter of celebrities and the daughter of an interracial couple in an all-black town, she has become adept at isolating herself from curious neighbors. But then her cousin, Trout, comes to visit. Trout is exactly like Staggerlee wishes she could be: outspoken, sure of herself, beautiful. Finally, Staggerlee has a friend, som", "Staggerlee is used to being alone. As the granddaughter of celebrities and the daughter of an interracial couple in an all-black town, she has become adept at isolating herself from curious neighbors. But then her cousin, Trout, comes to visit. Trout is exactly like Staggerlee wishes she could be: outspoken, sure of herself, beautiful. Finally, Staggerlee has a friend, someone she can share her deepest, most private thoughts with. Someone who will teach her how to be the strong girl she longs to be. But is Trout really the girl Staggerlee thinks she is?"], "author": "Jacqueline Woodson", "num_pages": "128", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (1999)", "Lambda Literary Award for Young Adult / Children's Book (1998)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-10-27 00:00:00", "ISBN": "0142501913"},
{"url": "https://www.goodreads.com/book/show/16081758-otherbound", "num_ratings": "2,159", "num_reviews": "452", "avg_ratings": 3.74, "genres": ["Fantasy", "Young Adult", "Lgbt", "Science Fiction"], "title": "Otherbound", "description": ["Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Eve", "Amara is never alone. Not when she's protecting the cursed princess she unwillingly serves. Not when they're fleeing across dunes and islands and seas to stay alive. Not when she's punished, ordered around, or neglected.", "She ", " be alone, because a boy from another world experiences all that alongside her, looking through her eyes.", "Nolan longs for a life uninterrupted. Every time he blinks, he's yanked from his Arizona town into Amara's mind, a world away, which makes even simple things like hobbies and homework impossible. He's spent years as a powerless observer of Amara's life. Amara has no idea . . . until he learns to control her, and they communicate for the first time. Amara is terrified. Then, she's furious.", "All Amara and Nolan want is to be free of each other. But Nolan's breakthrough has dangerous consequences. Now, they'll have to work together to survive--and discover the truth about their connection."], "author": "Corinne Duyvis", "num_pages": "387", "awards": ["James Tiptree Jr. Award Nominee for Longlist (2014)", "Bisexual Book Award for Speculative Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-17 00:00:00", "ISBN": "1419709283"},
{"url": "https://www.goodreads.com/book/show/2109487.Choices", "num_ratings": "493", "num_reviews": "44", "avg_ratings": 4.43, "genres": ["Glbt", "Lesbian", "Lgbt", "Adult", "Glbt", "Queer", "Fiction"], "title": "Choices", "description": ["Four friends; Lena, who is engaged to a basketball superstar, Denise, who is hoping that she will be the first in her family to graduate college, Freedom, who lives up to her name and Carmen, who needs to work on her self-esteem--lean on each other during their days at Freedom University."], "author": "Skyy", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2007-08-31 00:00:00", "ISBN": "097144899X"},
{"url": "https://www.goodreads.com/book/show/5966335-i-can-t-think-straight", "num_ratings": "4,513", "num_reviews": "163", "avg_ratings": 4.16, "genres": ["Lgbt", "Romance", "Glbt", "Lesbian", "Fiction", "Glbt", "Queer", "Contemporary"], "title": "I Can't Think Straight", "description": ["Tala, a London-based Palestinian, is preparing for her elaborate Middle Eastern wedding when she meets Leyla, a young British Indian woman who is dating her best friend.", "Spirited Christian Tala and shy Muslim Leyla could not be more different from each other, but the attraction is immediate and goes deeper than friendship. As Tala’s wedding day approaches, simmering tension", "Tala, a London-based Palestinian, is preparing for her elaborate Middle Eastern wedding when she meets Leyla, a young British Indian woman who is dating her best friend.", "Spirited Christian Tala and shy Muslim Leyla could not be more different from each other, but the attraction is immediate and goes deeper than friendship. As Tala’s wedding day approaches, simmering tensions come to boiling point and the pressure mounts for Tala to be true to herself.", "Moving between the vast enclaves of Middle Eastern high society and the stunning backdrop of London’s West End, I Can’t Think Straight explores the clashes between East and West, love and marriage, conventions and individuality, creating a humorous and tender story of unexpected love and unusual freedoms."], "author": "Shamim Sarif", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-11-11 00:00:00", "ISBN": "0956031617"},
{"url": "https://www.goodreads.com/book/show/28220826-when-the-moon-was-ours", "num_ratings": "4,306", "num_reviews": "1,215", "avg_ratings": 3.96, "genres": ["Young Adult", "Fantasy", "Magical Realism", "Lgbt"], "title": "When the Moon Was Ours", "description": ["To everyone who knows them, best friends Miel and Sam are as strange as they are inseparable. Roses grow out of Miel’s wrist, and rumors say that she spilled out of a water tower when she was five. Sam is known for the moons he paints and hangs in the trees, and for how little anyone knows about his life before he and his mother moved to town. But as odd as everyone consid", "To everyone who knows them, best friends Miel and Sam are as strange as they are inseparable. Roses grow out of Miel’s wrist, and rumors say that she spilled out of a water tower when she was five. Sam is known for the moons he paints and hangs in the trees, and for how little anyone knows about his life before he and his mother moved to town. But as odd as everyone considers Miel and Sam, even they stay away from the Bonner girls, four beautiful sisters rumored to be witches. Now they want the roses that grow from Miel’s skin, convinced that their scent can make anyone fall in love. And they’re willing to use every secret Miel has fought to protect to make sure she gives them up."], "author": "Anna-Marie McLemore", "num_pages": "288", "awards": ["Stonewall Book Award Nominee for Children’s and Young Adult Literature (2017)", "James Tiptree Jr. Award (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-04 00:00:00", "ISBN": "125005866X"},
{"url": "https://www.goodreads.com/book/show/6342382-consequences", "num_ratings": "416", "num_reviews": "25", "avg_ratings": 4.53, "genres": ["Glbt", "Lesbian", "Lgbt"], "title": "Consequences", "description": ["The crew is back! This fast paced sequel to \"Choices\" will take you on an emotioal roller coaster you won't want to get off... School's back in and there's a lot of unfinished business to handle. As Lena prepares for her wedding day, she can't help but think about Denise, her sexy b-ball roommate, who almost stole her away. A summer isn't enough time to get over a true lov", "The crew is back! This fast paced sequel to \"Choices\" will take you on an emotioal roller coaster you won't want to get off... School's back in and there's a lot of unfinished business to handle. As Lena prepares for her wedding day, she can't help but think about Denise, her sexy b-ball roommate, who almost stole her away. A summer isn't enough time to get over a true love. Denise just can't shake the feelings she developed for soon-to-be-married Lena. Should she go for what she wants, or leave well enough alone? Cooley let Misha walk away, but quickly realized she couldn't give up that easily. Will her determination to win back her first love bring Misha back, or push her further away? Carmen found her perfect mate in Nic...but will insecurities about her past relationships ruin her future love?"], "author": "Skyy", "num_pages": "294", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-02-14 00:00:00", "ISBN": "0615229689"},
{"url": "https://www.goodreads.com/book/show/24271389-otros-valles", "num_ratings": "31", "num_reviews": "11", "avg_ratings": 4.74, "genres": ["Lgbt", "Fiction", "Lgbt", "Transgender", "Glbt", "Queer"], "title": "Otros valles", "description": ["Moving cyclically, shifting with the changing of the weather, the novel is composed of story fragments that follow half a year in the life of a trans Latina living on the Texas/Tamaulipas border. It is, at turns: a literary novel that reflects on the act of writing poetry; a sci-fi novel that describes the unreal consequences of the surveillance and militarization of the b", "Moving cyclically, shifting with the changing of the weather, the novel is composed of story fragments that follow half a year in the life of a trans Latina living on the Texas/Tamaulipas border. It is, at turns: a literary novel that reflects on the act of writing poetry; a sci-fi novel that describes the unreal consequences of the surveillance and militarization of the border; a trans lesbian erotic novel and catalog of fantasies; a trans woman's memoir that relates her struggles to be accepted by her family, find community in the deep South, and untangle the shame around her body and her nonbinary identity; a political novel that critically examines the role of race in the narrator's communities and in her own life as a non-Black Latina learning about anti-Blackness; a Latin@ slice-of-life novel that is steeped in the culture, folklore, and supernatural reality of a Mexican family living on the border."], "author": "Jamie Berrout", "num_pages": "151", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19368898-k-rho", "num_ratings": "15", "num_reviews": "6", "avg_ratings": 4.4, "genres": [], "title": "K-Rho: The Sweet Taste of Sisterhood", "description": ["K-Rho: The Sweet Taste of Sisterhood chronicles the strength of sorority life for three Copper Road University sophomores. Track star Kiara Michaels didn’t expect to find two lifelong friends at her sorority membership interview. But life had other plans, leading her to meet Donna—a Bible quoting straight talker—and Gloria—a loquacious high achiever. ", "In the semesters follo", "K-Rho: The Sweet Taste of Sisterhood chronicles the strength of sorority life for three Copper Road University sophomores. Track star Kiara Michaels didn’t expect to find two lifelong friends at her sorority membership interview. But life had other plans, leading her to meet Donna—a Bible quoting straight talker—and Gloria—a loquacious high achiever. ", "In the semesters following membership induction, Kiara confesses a festering secret, Donna steers a bumpy course with her unfaithful boyfriend, and Gloria can’t find a love match. When a lustful encounter and brutal assault turn Kiara’s collegiate experience upside down, the two friends are her saving grace. ", "Fast–forward ten years later and Kiara can’t balance life’s increasing responsibilities, Donna has departed a broken marriage, and Gloria can’t reconcile feelings of attraction for a close friend. ", "Join Kiara, Donna, and Gloria on a dark, clear night at Copper Road to discover how these friends find happiness through sorority redemption, relationship forgiveness, and best friend intervention as you savor the sweet taste of sisterhood."], "author": "La Toya Hankins", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3195325-a-map-of-home", "num_ratings": "1,159", "num_reviews": "201", "avg_ratings": 3.68, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Lgbt", "Glbt", "Queer"], "title": "A Map of Home", "description": ["Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where s", "Nidali narrates the story of her childhood in Kuwait, her teenage years in Egypt, and her family’s last flight to Texas, offering a humorous, sharp but loving portrait of an eccentric middle-class family.", "Nidali, the rebellious daughter of an Egyptian-Greek mother and a Palestinian father, narrates the story of her childhood in Kuwait, her teenage years in Egypt (to where she and her family fled the 1990 Iraqi invasion), and her family’s last flight to Texas. Nidali mixes humor with a sharp, loving portrait of an eccentric middle-class family, and this perspective keeps her buoyant through the hardships she encounters: the humiliation of going through a checkpoint on a visit to her father’s home in the West Bank; the fights with her father, who wants her to become a famous professor and stay away from boys; the end of her childhood as Iraq invades Kuwait on her thirteenth birthday; and the scare she gives her family when she runs away from home. ", "Funny, charming, and heartbreaking, A Map of Home is the kind of book Tristram Shandy or Huck Finn would have narrated had they been born Egyptian-Palestinian and female in the 1970s."], "author": "Randa Jarrar", "num_pages": "304", "awards": ["Hopwood Award", "Arab American Book Award for Fiction (2009)", "Million Writers Award", "Geoffrey James Gosling Prize"], "places": ["Kuwait"], "character_names": [], "language": "English", "publish_date": "2008-09-02 00:00:00", "ISBN": "1590512723"},
{"url": "https://www.goodreads.com/book/show/21805654-the-paths-of-marriage", "num_ratings": "46", "num_reviews": "12", "avg_ratings": 4.15, "genres": ["Lgbt", "Fiction", "Glbt", "Queer"], "title": "The Paths of Marriage", "description": ["Lakshmi, a bright student who grew up in poverty, marries and immigrates to the United States from India to provide a better life for herself and her family. Clinging to her cultural realities, she forces her American daughter, Pooja, into an arranged marriage, creating a rift of resentment. Pooja's daughter, Deepa, is an out lesbian to everyone but her family. The woman D", "Lakshmi, a bright student who grew up in poverty, marries and immigrates to the United States from India to provide a better life for herself and her family. Clinging to her cultural realities, she forces her American daughter, Pooja, into an arranged marriage, creating a rift of resentment. Pooja's daughter, Deepa, is an out lesbian to everyone but her family. The woman Deepa loves presents an ultimatum—come out to Pooja or break up—and Deepa is forced to confront her greatest fear.", " ", "Three generations of Indian and Indian-American women navigate the harsh slums of Chennai to the bustle of New York City, struggling through a cathartic generational collision to try to come together as a family."], "author": "Mala  Kumar", "num_pages": "334", "awards": [], "places": ["Chennai", "New Orleans, Louisiana", "New York City, New York", "Orlando, Florida", "Bangalore"], "character_names": [], "language": "English", "publish_date": "2014-10-01 00:00:00", "ISBN": "1939562589"},
{"url": "https://www.goodreads.com/book/show/12260480-crossroads", "num_ratings": "350", "num_reviews": "22", "avg_ratings": 4.47, "genres": ["Lgbt", "Glbt", "Lesbian"], "title": "Crossroads", "description": ["From a highly praised author whose fiction blurs the lines between lesbian and straight communities comes a fast-paced story about the lives and relationships of three former college friends."], "author": "Skyy", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-01-01 00:00:00", "ISBN": "1601623275"},
{"url": "https://www.goodreads.com/book/show/1208294.Bliss", "num_ratings": "261", "num_reviews": "17", "avg_ratings": 4.16, "genres": ["Romance", "Glbt", "Queer", "Fiction", "Lgbt", "Adult Fiction", "Erotica"], "title": "Bliss", "description": ["From the outside, Bliss Sinclair's life seems very glamorous--a high-profile job with a publishing house, a fashionable boyfriend who looks good on her arm, and ultra-chic parties where the come-ons are as hot and thrilling at night as they are empty as an air-kiss greeting the next day. It's a world Bliss wanders through with", "From the outside, Bliss Sinclair's life seems very glamorous--a high-profile job with a publishing house, a fashionable boyfriend who looks good on her arm, and ultra-chic parties where the come-ons are as hot and thrilling at night as they are empty as an air-kiss greeting the next day. It's a world Bliss wanders through with blinders on, all the while craving more. And she finds it in the most unlikely of places.", "Embarking on a series of carnal adventures with a notorious bad girl as her guide, Bliss opens herself to every new experience and every taboo. In abandoned warehouses, private fetish clubs, even her own office, Bliss is skating on the thin ice of desire--until her world comes crashing in.", "Now, broken and wanting, Bliss decides to spend a summer in her birthplace, Jamaica, where she hopes to reconcile with her estranged father and rediscover herself. There, in a land of lush ripeness, of heat, warm breezes, easy smiles, and the family she left behind, Bliss will discover what she didn't know was missing. It's a journey that will awaken every one of her senses and take her to the edge of known pleasure and far beyond it, to a love that is as sexy as it gets, as real as can be, and more surprising than she can imagine--a place of total bliss."], "author": "Fiona Zedde", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-08-01 00:00:00", "ISBN": "0758209193"},
{"url": "https://www.goodreads.com/book/show/59921.The_Telling", "num_ratings": "4,636", "num_reviews": "388", "avg_ratings": 3.89, "genres": ["Science Fiction", "Fiction", "Fantasy", "Speculative Fiction"], "title": "The Telling", "description": ["Once a culturally rich world, the planet Aka has been utterly transformed by technology. Records of the past have been destroyed, and citizens are strictly monitored. But an official observer from Earth named Sutty has learned of a group of outcasts who live in the wilderness. They still believe in the ancient ways and still practice its lost religion - the Telling.", "Intrigu", "Once a culturally rich world, the planet Aka has been utterly transformed by technology. Records of the past have been destroyed, and citizens are strictly monitored. But an official observer from Earth named Sutty has learned of a group of outcasts who live in the wilderness. They still believe in the ancient ways and still practice its lost religion - the Telling.", "Intrigued by their beliefs, Sutty joins them on a sacred pilgrimage into the mountains...and into the dangerous terrain of her own heart, mind, and soul."], "author": "Ursula K. Le Guin", "num_pages": "231", "awards": ["Locus Award for Best Science Fiction Novel (2001)", "Tähtivaeltaja Award Nominee (2010)", "Endeavour Award (2001)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-08-01 00:00:00", "ISBN": "0441011233"},
{"url": "https://www.goodreads.com/book/show/10359696-parties-in-congress", "num_ratings": "550", "num_reviews": "58", "avg_ratings": 4.02, "genres": ["Romance", "Glbt", "Lesbian", "Politics", "Lgbt", "Lesbian", "Lesbian Fiction", "Romance", "Lesbian Romance"], "title": "Parties in Congress", "description": ["They say politics makes strange bedfellows...", "Elated to secure her first paid political staff position, Bijal Rao is eager to focus her efforts on the election of her candidate to U.S. Congress. However, Bijal's first unforeseen obstacle is her profound and unexpected attraction to their opponent—incumbent Congresswoman Colleen O'Bannon¬—who is outspoken, charismatic, and o", "They say politics makes strange bedfellows...", "Elated to secure her first paid political staff position, Bijal Rao is eager to focus her efforts on the election of her candidate to U.S. Congress. However, Bijal's first unforeseen obstacle is her profound and unexpected attraction to their opponent—incumbent Congresswoman Colleen O'Bannon¬—who is outspoken, charismatic, and openly lesbian.", "An even greater hurdle is the subterfuge and pretense that pervades the climate in Washington, D.C., where small missteps are readily painted as major gaffes, and lies are explained away as \"in the public's best interest.\" During the heated campaign, both Bijal and Colleen struggle not to cross the lines of propriety—and perhaps more importantly, their party lines."], "author": "Colette Moody", "num_pages": "264", "awards": [], "places": [], "character_names": ["Bijal Rao", "Colleen O'Bannon"], "language": "English", "publish_date": "2011-02-15 00:00:00", "ISBN": "1602822026"},
{"url": "https://www.goodreads.com/book/show/26107792-bodies-in-motion", "num_ratings": "12", "num_reviews": "0", "avg_ratings": 3.67, "genres": ["Glbt", "Queer"], "title": "Bodies in Motion", "description": ["How often does a woman get to rewrite her past and stake a claim to her future in one fell swoop? ", "Gorgeous Shondra Frazier gets that chance. It all starts at the “40 Under 40” reception for high achievers under the age of 40. Even though she really doesn’t want the attention, she is honored because she is the first African-American woman to be named manager of one of the c", "How often does a woman get to rewrite her past and stake a claim to her future in one fell swoop? ", "Gorgeous Shondra Frazier gets that chance. It all starts at the “40 Under 40” reception for high achievers under the age of 40. Even though she really doesn’t want the attention, she is honored because she is the first African-American woman to be named manager of one of the city’s top tourist attractions. ", "At the reception she unexpectedly reunites with her still beautiful college ex-girlfriend who broke Shondra’s heart many years ago. Lynette Johnson is a former cheerleader who can still make male and female heads turn. As Lynette walks away promising to be in touch soon, Shondra spots Denyse Gabriel, one of the few African-American female PhD physicists in the world and a fellow “40 Under 40” honoree. Shondra realizes attention from Denyse, with her long black hair and high collar tweed jacket, is what she wants. This beautiful scientist, however, is heading to a months-long project in Antarctica, but Lynette is sticking around and is more than willing to keep Shondra company. Shondra has to decide whether she will stay safe and start up again with her long lost college love or if she will wait for Denyse to return. Shondra can’t stop thinking about Denyse, but Shondra isn’t even that sure, after only one night of passion, whether the sexy physicist will want to see her when she comes back from the ice. ", " is the fourth book in the Lesbian Light Reads series, but each book can stand alone. This lesbian contemporary love story includes graphic sex and is intended for adults only. ", " ", "We kissed again, wrapping our arms around each other easily. The tweed fabric of her jacket was soft. Her lips radiated warmth. We fit together seamlessly. We were in a perfect groove. For a few minutes, we just kissed, explored each other’s lips, tongues and mouths. I giggled a little. She had swept her tongue with just the right, delicate pressure along my bottom lip. ", " “What’s so funny?” she asked, her arms still wrapped around me. ", " “It tickled when you did that,” I said. We had started swaying together slowly. ", "She narrowed her eyes. “When I did what? When I did this?” She kissed me deeply once more and ended the kiss again by delicately tracing my bottom lip with her tongue. She held me tightly as I started giggling. “I like this,” she said. ", "I took her hand and tugged. “Follow me.”"], "author": "Elizabeth Andre", "num_pages": "45", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17736248-the-blind-side-of-love", "num_ratings": "816", "num_reviews": "103", "avg_ratings": 4.6, "genres": ["Lgbt", "Romance", "Glbt", "Lesbian"], "title": "The Blind Side of Love", "description": ["A second draft of a not yet published romance novel The Blind Side of Love, about love between an artist Kristina Milano (21) and a famous actress Julianne Franqui (25).", "Themes: Romance, lesbian. Length: approx. 195,000 words"], "author": "Ingrid Díaz", "num_pages": "559", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24531375-yellow-rose", "num_ratings": "31", "num_reviews": "9", "avg_ratings": 3.65, "genres": ["Lgbt", "Short Stories", "Cultural", "Japan", "Glbt", "Queer", "Classics", "Asian Literature", "Japanese Literature"], "title": "Yellow Rose", "description": ["Yoshiya Nobuko’s short-story series Flower Stories (Hana monogatari) is widely known for launching the genre of shōjo fiction--stories expressly written for girls and young women. For the first time in English, one of the most ardent and influential of the collection, “Yellow Rose,” is published with a translator’s introduction, era-specific design and list of further read", "Yoshiya Nobuko’s short-story series Flower Stories (Hana monogatari) is widely known for launching the genre of shōjo fiction--stories expressly written for girls and young women. For the first time in English, one of the most ardent and influential of the collection, “Yellow Rose,” is published with a translator’s introduction, era-specific design and list of further readings. It will appeal to all readers of fine fiction, especially those with an interest in women’s writings, genre fiction, youth culture, queer writings, and twentieth-century modernist styles."], "author": "Nobuko Yoshiya", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16211479-me-and-you-and-daisies", "num_ratings": "255", "num_reviews": "16", "avg_ratings": 4.37, "genres": ["Lgbt", "Glbt", "Lesbian", "Glbt", "Queer", "Romance", "Fiction"], "title": "Me and You and Daisies", "description": ["Maybe 'happily ever afters' don't exist. Maybe they're fragmented and sprinkled throughout our lives to remind us to keep moving forward. Maybe, if we look from the right angle and maneuver the pieces just so, they become a masterpiece we keep adding to until the day we die. "], "author": "Lily R. Mason", "num_pages": "542", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/179022.Against_the_Tide_of_Years", "num_ratings": "4,100", "num_reviews": "141", "avg_ratings": 4.02, "genres": ["Science Fiction", "Alternate History", "Science Fiction", "Fantasy", "Fiction", "Science Fiction", "Time Travel", "Historical", "Historical Fiction"], "title": "Against the Tide of Years", "description": ["In the years since the Event, the Republic of Nantucket has done its best to recreate the better ideas of the modern age. But the evils of its time resurface in the person of William Walker, renegade Coast Guard officer, who is busy building an empire for himself based on conquest by technology. When Walker reaches Greece and recruits several of their greater kinglets to h", "In the years since the Event, the Republic of Nantucket has done its best to recreate the better ideas of the modern age. But the evils of its time resurface in the person of William Walker, renegade Coast Guard officer, who is busy building an empire for himself based on conquest by technology. When Walker reaches Greece and recruits several of their greater kinglets to his cause, the people of Nantucket have no choice. If they are to save the primitive world from being plunged into bloodshed on a twentieth-century scale, they must defeat Walker at his own game: war."], "author": "S.M. Stirling", "num_pages": "454", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-05-01 00:00:00", "ISBN": "0451457439"},
{"url": "https://www.goodreads.com/book/show/12506433-lunatic-fringe", "num_ratings": "452", "num_reviews": "64", "avg_ratings": 3.37, "genres": ["Lgbt", "Glbt", "Lesbian", "Fantasy", "Glbt", "Queer", "Fiction", "Shapeshifters", "Werewolves", "Fantasy", "Paranormal", "Fantasy", "Urban Fantasy"], "title": "Lunatic Fringe", "description": ["New author Allison Moon indulges the feminine wild by giving the classic werewolf myth a lesbian twist. Lexie Clarion's first night at college, she falls in with a pack of radical feminist werewolf hunters. The next morning, she falls for a mysterious woman who may be among the hunted. As Lexie's new lover and the Pack battle for Lexie's allegiance, the waxing moon illumin", "New author Allison Moon indulges the feminine wild by giving the classic werewolf myth a lesbian twist. Lexie Clarion's first night at college, she falls in with a pack of radical feminist werewolf hunters. The next morning, she falls for a mysterious woman who may be among the hunted. As Lexie's new lover and the Pack battle for Lexie's allegiance, the waxing moon illuminates old hatreds, new enemies, and a secret from Lexie's childhood that will change her life forever."], "author": "Allison Moon", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-29 00:00:00", "ISBN": "0983830916"},
{"url": "https://www.goodreads.com/book/show/2526076.Speaking_in_Whispers", "num_ratings": "8", "num_reviews": "1", "avg_ratings": 3.75, "genres": ["Short Stories", "Lgbt", "Adult Fiction", "Erotica", "Glbt", "Lesbian", "Glbt", "Queer"], "title": "Speaking in Whispers: African-American Lesbian Erotica", "description": ["Exaltation of lesbian sexuality and sensuality in its varied, technicolor forms, challenging the concept of politically correct lesbian sex. Speaking in Whispers utters the language of lesbian loving -- sometimes poetic euphemism, sometimes raw and crude, sometimes fun and laughter filled. \"Kathleen E Morris takes us where we want to go\". -- Jewelle Gomez"], "author": "Kathleen E. Morris", "num_pages": "161", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-10-01 00:00:00", "ISBN": "1879427281"},
{"url": "https://www.goodreads.com/book/show/38094614-the-teacher-is-my-lesbian-slave", "num_ratings": "13", "num_reviews": "1", "avg_ratings": 3.46, "genres": [], "title": "The Teacher Is My Lesbian Slave: Lesbian Blackmail & BDSM", "description": ["Warning!!! contains intense lesbian domination & erotica ", "A student finds out a secret about her teacher but the question is, what will the teacher do to make sure the student doesn't tell anybody? ", "Unfortunately for the teacher, the student has been fantasising about her teacher for quite some time."], "author": "Alicia Castelle", "num_pages": "54", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-01-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/40770129-passionate-starred-lovers", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 5.0, "genres": [], "title": "Passionate-Starred Lovers", "description": ["This romantic tale is about Aurora and Viviane. They were two lovers who were sharing their lives together. The couple went on a beautiful romance together where their lives intertwined. They shared their lives and all of their experiences together. The lovers embraced life and their future that they had together. They took everything as it came at them together. This was", "This romantic tale is about Aurora and Viviane. They were two lovers who were sharing their lives together. The couple went on a beautiful romance together where their lives intertwined. They shared their lives and all of their experiences together. The lovers embraced life and their future that they had together. They took everything as it came at them together. This was an epic love story that shook and moved both of their lives for the better. This is about a marriage between two lovers. This is a story of an enduring love between two lesbians."], "author": "Courtney Asunmaa", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/29760778-the-tiger-s-daughter", "num_ratings": "1,093", "num_reviews": "350", "avg_ratings": 3.76, "genres": ["Fantasy", "Lgbt", "Young Adult", "Fiction", "Did Not Finish"], "title": "The Tiger's Daughter", "description": ["The Hokkaran empire has conquered every land within their bold reach―but failed to notice a lurking darkness festering within the people. Now, their border walls begin to crumble, and villages fall to demons swarming out of the forests.", "Away on the silver steppes, the remaining tribes of nomadic Qorin retreat and protect their own, having bartered a", "The Hokkaran empire has conquered every land within their bold reach―but failed to notice a lurking darkness festering within the people. Now, their border walls begin to crumble, and villages fall to demons swarming out of the forests.", "Away on the silver steppes, the remaining tribes of nomadic Qorin retreat and protect their own, having bartered a treaty with the empire, exchanging inheritance through the dynasties. It is up to two young warriors, raised together across borders since their prophesied birth, to save the world from the encroaching demons.", "This is the story of an infamous Qorin warrior, Barsalayaa Shefali, a spoiled divine warrior empress, O-Shizuka, and a power that can reach through time and space to save a land from a truly insidious evil."], "author": "K. Arsenault Rivera", "num_pages": "526", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-03 00:00:00", "ISBN": "0765392534"},
{"url": "https://www.goodreads.com/book/show/40613705-lost-found", "num_ratings": "25", "num_reviews": "2", "avg_ratings": 4.04, "genres": [], "title": "Lost & Found", "description": ["Piper Tate is twenty-two and content with her life and family. The last thing she expects is for her foster brother and the story of a missing toddler to turn her life upside down. ", "Selma Flores has been helping Karen and Derek Bering search for their missing daughter for years. She isn't prepared when some sensationalist air time on a show about missing children actually b", "Piper Tate is twenty-two and content with her life and family. The last thing she expects is for her foster brother and the story of a missing toddler to turn her life upside down. ", "Selma Flores has been helping Karen and Derek Bering search for their missing daughter for years. She isn't prepared when some sensationalist air time on a show about missing children actually bears fruit. ", "Even less expected is how drawn Piper and Selma become to one another amidst a slew of family drama..."], "author": "Raquel De Leon", "num_pages": "203", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2018-06-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/27130422-weekend", "num_ratings": "92", "num_reviews": "22", "avg_ratings": 3.7, "genres": ["Fiction", "Glbt", "Queer", "Lgbt", "Disability", "Glbt", "Lesbian"], "title": "Weekend", "description": ["On her fiftieth birthday, crazy-in-love Ajax visits her mercurial lover Logan, who trails their tarnished reputation like a lapsed halo. Logan has secrets, but so does Ajax, and during their weekend getaway to Ontario's cottage country, some of these secrets will prove explosive.", "In the next cottage, long-term couple Joe and Elliot are having their own challenges as the par", "On her fiftieth birthday, crazy-in-love Ajax visits her mercurial lover Logan, who trails their tarnished reputation like a lapsed halo. Logan has secrets, but so does Ajax, and during their weekend getaway to Ontario's cottage country, some of these secrets will prove explosive.", "In the next cottage, long-term couple Joe and Elliot are having their own challenges as the parents of a newborn baby girl. Joe isn't sure if Elliot loves her or even if Elliot wanted a baby at all. Can she make it through a weekend feeling as she does, let alone the rest of her life?", "Jane Eaton Hamilton's ninth book is an intimate, sexy queer romance.'Weekend' is a bold and heartbreaking consideration of the true nature of love at the cusp of middle age--about trust, negotiation, and what's worth keeping in the end."], "author": "Jane Eaton Hamilton", "num_pages": "294", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-05-31 00:00:00", "ISBN": "1551526352"},
{"url": "https://www.goodreads.com/book/show/34380219-america-vol-1", "num_ratings": "921", "num_reviews": "195", "avg_ratings": 3.47, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Superheroes", "Marvel", "Comics", "Superheroes", "Lgbt", "Young Adult"], "title": "America, Vol. 1: The Life and Times of America Chavez", "description": ["At last! Everyone's favorite no-nonsense powerhouse, America Chavez, gets her own series! Critically acclaimed young-adult novelist Gabby Rivera and all-star artist Joe Quinones unite to shine a solo spotlight on America's high-octane and hard-hitting adventures! She was a Young Avenger. She leads the Ultimates. And now she officially claims her place as the preeminent but", "At last! Everyone's favorite no-nonsense powerhouse, America Chavez, gets her own series! Critically acclaimed young-adult novelist Gabby Rivera and all-star artist Joe Quinones unite to shine a solo spotlight on America's high-octane and hard-hitting adventures! She was a Young Avenger. She leads the Ultimates. And now she officially claims her place as the preeminent butt-kicker of the entire Marvel Universe! But what's a super-powered teenager to do when she's looking for a little personal fulfi llment? She goes to college! America just has to stop an interdimensional monster or two first and shut down a pesky alien cult that's begun worshipping her exploits before work can begin. Then she can get on with her first assignment: a field trip to the front lines of World War II - with Captain America as her wingman!", " AMERICA 1-6"], "author": "Gabby Rivera", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-31 00:00:00", "ISBN": "1302908812"},
{"url": "https://www.goodreads.com/book/show/33991800-the-resignation-letter", "num_ratings": "26", "num_reviews": "11", "avg_ratings": 3.69, "genres": ["Fantasy", "Lgbt"], "title": "The Resignation Letter", "description": ["Amalthea has always broken the rules. She applied for the Academy of Mages. Once there, she broke their taboo on studying certain magics. Then, she falls in love with the Empress. But when the Empress asks her to break the rules of her own ethics, Amalthea must make a difficult choice."], "author": "Dax Murray", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-01-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18854738-moon-at-nine", "num_ratings": "736", "num_reviews": "167", "avg_ratings": 3.83, "genres": ["Young Adult", "Lgbt", "Historical", "Historical Fiction", "Fiction", "Romance"], "title": "Moon at Nine", "description": ["Fifteen-year-old Farrin has many secrets. Although she goes to a school for gifted girls in Tehran, as the daughter of an aristocratic mother and wealthy father, Farrin must keep a low profile. It is 1988; ever since the Shah was overthrown, the deeply conservative and religious government controls every facet of life in Iran. If the Revolutionary Guard finds out about her", "Fifteen-year-old Farrin has many secrets. Although she goes to a school for gifted girls in Tehran, as the daughter of an aristocratic mother and wealthy father, Farrin must keep a low profile. It is 1988; ever since the Shah was overthrown, the deeply conservative and religious government controls every facet of life in Iran. If the Revolutionary Guard finds out about her mother’s Bring Back the Shah activities, her family could be thrown in jail, or worse.", "The day she meets Sadira, Farrin’s life changes forever. Sadira is funny, wise, and outgoing; the two girls become inseparable. But as their friendship deepens into romance, the relationship takes a dangerous turn. It is against the law to be gay in Iran; the punishment is death. Despite their efforts to keep their love secret, the girls are discovered and arrested. Separated from Sadira, Farrin can only pray as she awaits execution. Will her family find a way to save them both?", "Based on real-life events, multi-award winning author Deborah Ellis’s new book is a tense and riveting story about a world where homosexuality is considered so abhorrent that it is punishable by death."], "author": "Deborah Ellis", "num_pages": "224", "awards": ["Ruth and Sylvia Schwartz Children's Book Award Nominee (2015)", "Canadian Library Association Young Adult Book Award (2015)", "Snow Willow Award Nominee (2015)", "Manitoba Young Readers' Choice Award Nominee (2015)", "Quill & Quire Book of the Year (2014)", "BC Teen Readers' Choice Stellar Award Nominee (2016)"], "places": ["Tehran"], "character_names": [], "language": "English", "publish_date": "2014-04-01 00:00:00", "ISBN": "1927485576"},
{"url": "https://www.goodreads.com/book/show/31378298-state-of-emergency", "num_ratings": "6", "num_reviews": "1", "avg_ratings": 4.17, "genres": ["Lgbt", "Romance"], "title": "State of Emergency (State of Emergency #1)", "description": ["Sweden, Present Day: Idun Tyr receives a warning from her sister, and army lieutenant, telling her to hide and not come out no matter what she hears. By the time she re-emerges, the world has changed. Her phone has no signal, the internet and televisions aren’t working, and her town is empty of people. Everyone is gone. She sets out to find her missing girlfriend, Mercedes", "Sweden, Present Day: Idun Tyr receives a warning from her sister, and army lieutenant, telling her to hide and not come out no matter what she hears. By the time she re-emerges, the world has changed. Her phone has no signal, the internet and televisions aren’t working, and her town is empty of people. Everyone is gone. She sets out to find her missing girlfriend, Mercedes and embarks on a long journey, learning to survive in this new reality. A dystopian lesbian novel about a country torn apart by a vicious disease, following three women on different sides: military, vigilante and prisoner."], "author": "Kathy L. Salt", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30306869-far-from-home", "num_ratings": "740", "num_reviews": "174", "avg_ratings": 3.94, "genres": ["Romance", "Lgbt", "Contemporary", "Glbt", "Lesbian", "Glbt", "Queer"], "title": "Far from Home", "description": ["My name is Rachel. I’m straight . . . I think. I also have a mountain of student loans and a smart mouth. I wasn’t serious when I told Pari Sadashiv I’d marry her. It was only party banter! Except Pari needs a green card, and she’s willing to give me a breather from drowning in debt.", "My off-the-cuff idea might not be so terrible. We get along as friends. She’s really romant", "My name is Rachel. I’m straight . . . I think. I also have a mountain of student loans and a smart mouth. I wasn’t serious when I told Pari Sadashiv I’d marry her. It was only party banter! Except Pari needs a green card, and she’s willing to give me a breather from drowning in debt.", "My off-the-cuff idea might not be so terrible. We get along as friends. She’s really romantically cautious, which I find heartbreaking. She deserves someone to laugh with. She’s kind. And calm. And gorgeous. A couple of years with her actually sounds pretty good. If some of Pari’s kindness and calmness rubs off on me, that’d be a bonus, because I’m a mess -- anorexia is not a pretty word -- and my little ways of keeping control of myself, of the world, aren’t working anymore.", "And, if I slip up, Pari will see my cracks. Then I’ll crack. Which means I gotta get out, quick, before I fall in love with my wife."], "author": "Lorelie Brown", "num_pages": "208", "awards": ["RITA Award by Romance Writers of America Nominee for Contemporary Romance: Short (2017)"], "places": ["Laguna Beach, California"], "character_names": [], "language": "English", "publish_date": "2016-08-01 00:00:00", "ISBN": "1626494517"},
{"url": "https://www.goodreads.com/book/show/18278652-fairytales-for-lost-children", "num_ratings": "164", "num_reviews": "34", "avg_ratings": 4.27, "genres": ["Short Stories", "Lgbt", "Cultural", "Africa", "Glbt", "Queer", "Literature", "African Literature"], "title": "Fairytales for Lost Children", "description": [" is narrated by people constantly on the verge of self-revelation. These characters - young, gay and lesbian Somalis - must navigate the complexities of family, identity and the immigrant experience as they tumble towards freedom. ", "Using a unique idiom rooted in hip-hop, graphic illustrations, Arabic calligraphy and folklore studded with Kiswahil", " is narrated by people constantly on the verge of self-revelation. These characters - young, gay and lesbian Somalis - must navigate the complexities of family, identity and the immigrant experience as they tumble towards freedom. ", "Using a unique idiom rooted in hip-hop, graphic illustrations, Arabic calligraphy and folklore studded with Kiswahili and Somali slang, these stories mark the arrival of a singular new voice in contemporary fiction."], "author": "Diriye Osman", "num_pages": "156", "awards": ["Polari First Book Prize (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-01 00:00:00", "ISBN": "0956971946"},
{"url": "https://www.goodreads.com/book/show/16148208-full-fathom-five", "num_ratings": "3,172", "num_reviews": "359", "avg_ratings": 4.12, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Fiction", "Science Fiction", "Science Fiction", "Steampunk"], "title": "Full Fathom Five", "description": ["The third novel set in the addictive and compelling fantasy world of ", ".", "On the island of Kavekana, Kai builds gods to order, then hands them to others to maintain. Her creations aren’t conscious and lack their own wills and voices, but they accept sacrifices, and protect their worshippers from other gods—perfect vehicles for Craftsmen and Craftswomen operatin", "The third novel set in the addictive and compelling fantasy world of ", ".", "On the island of Kavekana, Kai builds gods to order, then hands them to others to maintain. Her creations aren’t conscious and lack their own wills and voices, but they accept sacrifices, and protect their worshippers from other gods—perfect vehicles for Craftsmen and Craftswomen operating in the divinely controlled Old World. When Kai sees one of her creations dying and tries to save her, she’s grievously injured—then sidelined from the business entirely, her near-suicidal rescue attempt offered up as proof of her instability. But when Kai gets tired of hearing her boss, her coworkers, and her ex-boyfriend call her crazy, and starts digging into the reasons her creations die, she uncovers a conspiracy of silence and fear—which will crush her, if Kai can’t stop it first."], "author": "Max Gladstone", "num_pages": "382", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-15 00:00:00", "ISBN": "0765335743"},
{"url": "https://www.goodreads.com/book/show/25990375-tiastelai", "num_ratings": "3", "num_reviews": "3", "avg_ratings": 3.67, "genres": ["Lgbt", "Young Adult"], "title": "Tiastelai", "description": ["Ellis Morse is no longer human.", "The day her girlfriend breaks up with her, she discovers that her hair and skin have turned stark white.", "At first, she's scared. And then she's livid.", "She shaves her head and begins to hunt for answers—what is happening to her, and why?", "But she might not like the answers she finds, especially when they point her to the mysterious killer of one o", "Ellis Morse is no longer human.", "The day her girlfriend breaks up with her, she discovers that her hair and skin have turned stark white.", "At first, she's scared. And then she's livid.", "She shaves her head and begins to hunt for answers—what is happening to her, and why?", "But she might not like the answers she finds, especially when they point her to the mysterious killer of one of her classmates, and then to the stars."], "author": "Elizabeth Paulsen", "num_pages": "203", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-02-04 00:00:00", "ISBN": "1329881273"},
{"url": "https://www.goodreads.com/book/show/1294993.The_Growing", "num_ratings": "59", "num_reviews": "9", "avg_ratings": 4.14, "genres": ["Lgbt", "Glbt", "Lesbian", "Fantasy", "Magic", "Romance", "Apocalyptic", "Post Apocalyptic"], "title": "The Growing", "description": ["It's 2012. Do you know where your androids are? In the near future, the world will grow complacent and a brilliant, if misguided, mind will seek to capitalize on that complacency by providing the common man and royalty alike with just the convenience he needs to aid him in his day to day labors. But what if suddenly those companions were to turn on their masters, sowing th", "It's 2012. Do you know where your androids are? In the near future, the world will grow complacent and a brilliant, if misguided, mind will seek to capitalize on that complacency by providing the common man and royalty alike with just the convenience he needs to aid him in his day to day labors. But what if suddenly those companions were to turn on their masters, sowing the seeds of destruction and death across the land? What if man's helper became his killer, and no one knew why or how to stop it? The Growing is the story of such a post-apocalyptic vision, and of the brave men and women who give everything they have to save the world from its eventual destruction. It is also the story of two lonely hearts, bitter enemies at first, who learn to trust and to love again in a world falling down all around them. Koda Rivers is a Lakota veterinarian and shaman whose roots run deep in her culture and in the soil of her native Black Hills. Kirsten King, Ph.D., is a brilliant cyberscientist and the sole surviving member of President Hillary Clinton's Cabinet. Each drawn by her own mission to destroy the androids, they meet in fire and blood at the North Dakota facility where the insurgent machines are manufactured. The Growing has all the bells and whistles of a classical epic: sweeping battles, a heroic love story, Amazon warriors, a blind bard, the gods of the land and a monster or two. The challenges present are met by our two heroes and their companions. These include Dakota's remarkable father and her warrior brother, Tacoma; Maggie Allen, USAF Colonel and crack pilot; an extraordinary German Shepherd named Asimov; and the spirits of the land in their various forms."], "author": "Susanne M. Beck", "num_pages": "652", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2007)", "Lesbian Fiction Readers' Choice Award for Favorite Lesbian Speculative Fiction/Sci-Fi/Fantasy Book (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-21 00:00:00", "ISBN": "0975436694"},
{"url": "https://www.goodreads.com/book/show/26107631-sweet-lesbian-love-stories", "num_ratings": "15", "num_reviews": "2", "avg_ratings": 3.27, "genres": ["Lgbt", "Romance", "Fiction", "Slash Fiction", "Femslash", "Short Stories", "Glbt", "Lesbian"], "title": "Sweet Lesbian Love Stories", "description": ["Seven sweet stories of lesbian love by award-winning queer author Giselle Renarde. ", "Need a break from hot and spicy romance? Find original lesbian fiction between this book’s clean covers, as well as tales that have been featured in prestigious collections such as Best Lesbian Romance and Best Lesbian Love Stories. ", "Opposites attract after two volunteers get off to a rocky s", "Seven sweet stories of lesbian love by award-winning queer author Giselle Renarde. ", "Need a break from hot and spicy romance? Find original lesbian fiction between this book’s clean covers, as well as tales that have been featured in prestigious collections such as Best Lesbian Romance and Best Lesbian Love Stories. ", "Opposites attract after two volunteers get off to a rocky start in Beginning Badly. In Flash Freeze, Lauren falls hard for Zarina—so hard she smacks her head on the sidewalk. Hailey doesn’t know how to tell Sashi her biggest secret in When Hailey Met Sashi, but Yvonne and Deva live happily ever after (after saving a man’s life on their wedding day!) in Going to the Chapel.", "Seven sweet lesbian love stories sealed with a kiss!"], "author": "Giselle Renarde", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-13 00:00:00", "ISBN": "151683108X"},
{"url": "https://www.goodreads.com/book/show/22557352-jam-on-the-vine", "num_ratings": "646", "num_reviews": "150", "avg_ratings": 3.82, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "African American", "Lgbt", "Historical", "Glbt", "Queer"], "title": "Jam on the Vine", "description": ["Ivoe Williams, the precocious daughter of a Muslim cook and a metalsmith from central-east Texas, first ignites her lifelong obsession with journalism when she steal", "Ivoe Williams, the precocious daughter of a Muslim cook and a metalsmith from central-east Texas, first ignites her lifelong obsession with journalism when she steals a newspaper from her mother’s white employer. Living in the poor, segregated quarter of Little Tunis, Ivoe immerses herself in printed matter as an escape from her dour surroundings. She earns a scholarship to the prestigious Willetson College in Austin, only to return over-qualified to the menial labor offered by her hometown’s racially-biased employers.", "Ivoe eventually flees the Jim Crow South with her family and settles in Kansas City, where she and her former teacher and lover, Ona, found the first female-run African American newspaper, ", ". In the throes of the Red Summer—the 1919 outbreak of lynchings and race riots across the Midwest—Ivoe risks her freedom, and her life, to call attention to the atrocities of segregation in the American prison system.", "Skillfully interweaving Ivoe’s story with those of her family members, LaShonda Katrice Barnett’s ", " is both an epic vision of the hardships and injustices that defined an era and a moving and compelling story of a complicated history we only thought we knew. "], "author": "LaShonda Katrice Barnett", "num_pages": "336", "awards": ["Stonewall Book Award Nominee for Literature (2016)"], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-03 00:00:00", "ISBN": "0802123341"},
{"url": "https://www.goodreads.com/book/show/24972115-love-s-perfect-vintage", "num_ratings": "23", "num_reviews": "4", "avg_ratings": 3.57, "genres": ["Glbt", "Lesbian", "Romance", "Lesbian Romance", "Glbt", "Queer", "Lesbian", "Lesbian Fiction", "Contemporary"], "title": "Love's Perfect Vintage", "description": ["Would you let your mother find your next girlfriend? Beautiful thirty-two year old African-American Aisha Watson works hard all week as a budget analyst and plays hard all weekend as a competitive longsword fighter. But her heart was recently broken, and she’s not even so sure she wants to be in love again after a series of dating disasters. Aisha’s mother decides to find", "Would you let your mother find your next girlfriend? Beautiful thirty-two year old African-American Aisha Watson works hard all week as a budget analyst and plays hard all weekend as a competitive longsword fighter. But her heart was recently broken, and she’s not even so sure she wants to be in love again after a series of dating disasters. Aisha’s mother decides to find her a nice girl and introduces her to Kris Donnelly. ", "Kris, with long chestnut brown hair and vibrant green eyes, is Aisha’s former high school classmate who is all grown up and become one of Chicago’s leading sommeliers. In between choosing fine wines, she’s just getting back into dating as Aisha is leaving the scene, but Aisha is about to learn that her mother may be right about something. Could Kris be the woman for whom she’s been searching? "], "author": "Elizabeth Andre", "num_pages": "28", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23614090-code-name-nanette", "num_ratings": "32", "num_reviews": "7", "avg_ratings": 3.84, "genres": ["Historical", "Historical Fiction"], "title": "Code Name Nanette", "description": ["\"A guilty pleasure.... The story-telling in this book is amazing.\" -Ingrid Hall", "\"Exciting and soul-searching.\" -ABNA Review", "“… a fresh voice, a great writer, I literally couldn't put the book down…. This was one of the strongest books and best written I’ve read for a long time – by any author!” —Royal Palm Literary Award Judge", "ROYAL PALM LITERARY AWARD WINNER", "\"I AM NANETTE. I", "\"A guilty pleasure.... The story-telling in this book is amazing.\" -Ingrid Hall", "\"Exciting and soul-searching.\" -ABNA Review", "“… a fresh voice, a great writer, I literally couldn't put the book down…. This was one of the strongest books and best written I’ve read for a long time – by any author!” —Royal Palm Literary Award Judge", "ROYAL PALM LITERARY AWARD WINNER", "\"I AM NANETTE. I BREAK ALL THE RULES. During the war I was a spy for the British and helped save the world. I’ve kept my secrets for fifty years. But now I’m ready to talk.”", "THEIR MISSION: Gather intelligence behind Nazi lines in World War II.", "AT RISK: The future of the Free World.", "THEIR MEANS: Whatever it takes.", "But the lines blur and the war heats up when Nanette and her spy partner, code name Regina, are forced to choose between their hearts and their duty.", "SEXY, SASSY, AND THOUGHT PROVOKING. Joe Parker’s search for his grandfather leads him to a former spy who worked with his grandmother in France during World War II. She still chain smokes, drinks her whisky straight, and loves erotic stories. He’ll never see women, young or old, the same way again.", "INSPIRED BY REAL WOMEN WHO HELPED SAVE THE WORLD. \"Code Name Nanette\" is a quirky, erotic, character-driven love story that honors the British and American female resistance fighters in France during World War II, who loved and fought behind enemy lines as intensely as their male counterparts, but whose names and achievements remain largely unheralded to this day. It opens a window into the hearts and the minds of women who take on new roles and risk everything for love, freedom, or just plain adventure. The result is more than a history lesson. It's a revealing and touching triumph of courage, love, and hope against all odds.", "WAR ALWAYS GETS PERSONAL. Wars are not epic tales recounting the monumental achievements of larger-than-life heroes. They are bloody, devastating battles fought by discrete individuals who are swept up in the tides of history and forced to make personal life-and-death decisions on a daily basis. Each has a story. Most of them never get told. This is Nanette's."], "author": "M.E. Dawson", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23291700-my-last-season-with-you", "num_ratings": "152", "num_reviews": "49", "avg_ratings": 3.94, "genres": ["Glbt", "Lesbian", "Romance", "New Adult", "Lgbt"], "title": "My Last Season With You", "description": ["“Dealing with your own terminal illness is easier than telling your best friend that you’re in love with her. Just sayin’.” – Regina Callahan", "Reggie Callahan has come to terms with her prognosis of less than a year to live. She’s been dealing with it all summer thanks to blacking out and falling off her horse back home in Wisconsin. Instead of starting her junior year, she’", "“Dealing with your own terminal illness is easier than telling your best friend that you’re in love with her. Just sayin’.” – Regina Callahan", "Reggie Callahan has come to terms with her prognosis of less than a year to live. She’s been dealing with it all summer thanks to blacking out and falling off her horse back home in Wisconsin. Instead of starting her junior year, she’s only back at New York University to tie up loose ends. One of them is breaking the news to her childhood friend, actress and model, Desi St. Clair. For Reggie, telling her that she is sick, and leaving the city is harder than learning you’re going to die.", "Until Desi kisses her.", "This isn’t a story about gender preference or about living with cancer. Plain and simple, it’s about love and what people are willing to endure to live without regrets and savor every moment.", "Portion of all sales will go to Free2Luv, a non-profit charity that supports anti-bullying & the freedom of expression. ", "**This is a STANDALONE novella. It is not part of a series, and does not contain a cliffhanger. This book is intended for mature audiences. Does NOT contain explicit or graphic sexual scenes. **"], "author": "S.V.C. Ricketts", "num_pages": "130", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-15 00:00:00", "ISBN": "1502506602"},
{"url": "https://www.goodreads.com/book/show/22735855-scale-bright", "num_ratings": "245", "num_reviews": "57", "avg_ratings": 3.8, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Fantasy", "Mythology", "Fiction", "Novella", "Lgbt"], "title": "Scale-Bright", "description": ["Julienne’s aunts are the archer who shot down the suns and the woman who lives on the moon. They teach her that there’s more to the city of her birth than meets the eye – that beneath the modern chrome and glass of Hong Kong there are demons, gods, and the seethe of ancient feuds. As a mortal Julienne is to give them wide berth, for unlike her divine aunts she is painfully", "Julienne’s aunts are the archer who shot down the suns and the woman who lives on the moon. They teach her that there’s more to the city of her birth than meets the eye – that beneath the modern chrome and glass of Hong Kong there are demons, gods, and the seethe of ancient feuds. As a mortal Julienne is to give them wide berth, for unlike her divine aunts she is painfully vulnerable, and choice prey for any demon.", "Until one day, she comes across a wounded, bleeding woman no one else can see, and is drawn into an old, old story of love, snake women, and the deathless monk who hunts them."], "author": "Benjanun Sriduangkaew", "num_pages": "98", "awards": [], "places": ["Hong Kong"], "character_names": [], "language": "English", "publish_date": "2014-08-16 00:00:00", "ISBN": "0956392490"},
{"url": "https://www.goodreads.com/book/show/16008827-taking-the-long-way", "num_ratings": "502", "num_reviews": "40", "avg_ratings": 4.18, "genres": ["Glbt", "Lesbian", "Lgbt", "Romance", "Glbt", "Queer"], "title": "Taking the Long Way", "description": ["One woman's journey towards self-acceptance through love, loss, family, friends, and career."], "author": "Lily R. Mason", "num_pages": "745", "awards": [], "places": ["Blank ", "Ohio", "New England"], "character_names": [], "language": "English", "publish_date": "2012-09-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22719283-under-the-lights", "num_ratings": "985", "num_reviews": "253", "avg_ratings": 3.75, "genres": ["Lgbt", "Contemporary", "Young Adult", "Romance", "New Adult", "Glbt", "Queer"], "title": "Under the Lights", "description": ["Josh Chester loves being a Hollywood bad boy, coasting on his good looks, his parties, his parents' wealth, and the occasional modeling gig. But his laid-back lifestyle is about to change. To help out his best friend, Liam, he joins his hit teen TV show, ", " ... opposite Vanessa Park, the one actor immune to his charms. (Not that he's trying to charm her, of cou", "Josh Chester loves being a Hollywood bad boy, coasting on his good looks, his parties, his parents' wealth, and the occasional modeling gig. But his laid-back lifestyle is about to change. To help out his best friend, Liam, he joins his hit teen TV show, ", " ... opposite Vanessa Park, the one actor immune to his charms. (Not that he's trying to charm her, of course.) Meanwhile, his drama-queen mother blackmails him into a new family reality TV show, with Josh in the starring role. Now that he's in the spotlight—on everyone's terms but his own—Josh has to decide whether a life as a superstar is the one he really wants.", "Vanessa Park has always been certain about her path as an actor, despite her parents' disapproval. But with all her relationships currently in upheaval, she's painfully ", "certain about everything else. When she meets her new career handler, Brianna, Van is relieved to have found someone she can rely on, now that her BFF, Ally, is at college across the country. But as feelings unexpectedly evolve beyond friendship, Van's life reaches a whole new level of confusing. And she'll have to choose between the one thing she's always loved ... and the person she never imagined she could."], "author": "Dahlia Adler", "num_pages": "279", "awards": [], "places": [], "character_names": ["Vanessa Park", "Josh Chester"], "language": "English", "publish_date": "2015-06-30 00:00:00", "ISBN": "1633920178"},
{"url": "https://www.goodreads.com/book/show/19326023-tastes-like-cherry", "num_ratings": "37", "num_reviews": "12", "avg_ratings": 4.0, "genres": ["Glbt", "Lesbian"], "title": "Tastes Like Cherry", "description": ["Sherry “Cherry” Milton has had six months to get over Anya Prye, her ex-fiancé. Six months to accept that what they had was over and that she needed to move on with her life. Cherry was certain she had done so, until Anya reappears. ", "Anya Prye has come to the realization that life was not complete unless she had the love of her life to share it with. Six months ago, she mad", "Sherry “Cherry” Milton has had six months to get over Anya Prye, her ex-fiancé. Six months to accept that what they had was over and that she needed to move on with her life. Cherry was certain she had done so, until Anya reappears. ", "Anya Prye has come to the realization that life was not complete unless she had the love of her life to share it with. Six months ago, she made a decision that changed everything and now she’s back to make amends. Can she convince Cherry that they were meant to be together? What will it take to prove it? Or is it too late?"], "author": "Renee Cronin", "num_pages": "211", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13587105-the-pyramid-waltz", "num_ratings": "759", "num_reviews": "84", "avg_ratings": 3.76, "genres": ["Fantasy", "Lgbt", "Glbt", "Lesbian", "Romance", "Glbt", "Queer", "Romance", "Lesbian Romance"], "title": "The Pyramid Waltz", "description": ["To most, Princess Katya Nar Umbriel is a rogue and a layabout; she parties, she hunts and she breaks women’s hearts. But when the festival lights go down and the palace slumbers, Katya chases traitors to the crown and protects the kingdom’s greatest secret: the royal Umbriels are part Fiend. When Katya thwarts an attempt to expose the king’s monstrous side, she uncovers a", "To most, Princess Katya Nar Umbriel is a rogue and a layabout; she parties, she hunts and she breaks women’s hearts. But when the festival lights go down and the palace slumbers, Katya chases traitors to the crown and protects the kingdom’s greatest secret: the royal Umbriels are part Fiend. When Katya thwarts an attempt to expose the king’s monstrous side, she uncovers a plot to let the Fiends out to play.", "Starbride has no interest in being a courtier. Ignoring her mother’s order to snare an influential spouse, she comes to court only to study law. But a flirtatious rake of a princess proves hard to resist, and Starbride is pulled into a world of secrets that leaves little room for honesty or love, a world neither woman may survive."], "author": "Barbara Ann Wright", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-17 00:00:00", "ISBN": "1602827419"},
{"url": "https://www.goodreads.com/book/show/99702.Island_in_the_Sea_of_Time", "num_ratings": "6,670", "num_reviews": "388", "avg_ratings": 4.01, "genres": ["Science Fiction", "Science Fiction", "Alternate History", "Fantasy", "Science Fiction", "Time Travel", "Fiction", "Historical", "Historical Fiction"], "title": "Island in the Sea of Time", "description": ["It's spring on Nantucket and everything is perfectly normal, until a sudden storm blankets the entire island. When the weather clears, the island's inhabitants find that they are no longer in the late twentieth century...but", "It's spring on Nantucket and everything is perfectly normal, until a sudden storm blankets the entire island. When the weather clears, the island's inhabitants find that they are no longer in the late twentieth century...but have been transported instead to the Bronze Age! Now they must learn to survive with suspicious, warlike peoples they can barely understand and deal with impending disaster, in the shape of a would-be conqueror from their own time."], "author": "S.M. Stirling", "num_pages": "608", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-03-01 00:00:00", "ISBN": "0451456750"},
{"url": "https://www.goodreads.com/book/show/17561148-hungry-ghost", "num_ratings": "141", "num_reviews": "17", "avg_ratings": 3.77, "genres": ["Glbt", "Lesbian", "Lgbt", "Fiction", "Fantasy", "Paranormal", "Glbt", "Queer", "Shapeshifters", "Werewolves", "Fantasy", "Urban Fantasy", "Fantasy"], "title": "Hungry Ghost", "description": ["Strange is the new normal for college freshman Lexie Clarion. She could be writing papers and going to frat parties like a normal girl, but Lexie is no normal girl. She spends each full moon fighting against the beast that threatens to escape her body, and the rest of the time mooning over her alpha ex-girlfriend. ", "When Lexie discovers the eviscerated body of a fellow stude", "Strange is the new normal for college freshman Lexie Clarion. She could be writing papers and going to frat parties like a normal girl, but Lexie is no normal girl. She spends each full moon fighting against the beast that threatens to escape her body, and the rest of the time mooning over her alpha ex-girlfriend. ", "When Lexie discovers the eviscerated body of a fellow student, she knows the violent full-blood Rare wolves are back on the prowl. But with no proof, no plan, and no allies, Lexie and the Pack have to decide how to fight back. And they have to do so fast, before all the women of Milton become prey."], "author": "Allison Moon", "num_pages": "298", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-04-09 00:00:00", "ISBN": "0983830932"},
{"url": "https://www.goodreads.com/book/show/6957067-in-keisha-s-shadow", "num_ratings": "17", "num_reviews": "3", "avg_ratings": 3.71, "genres": ["Glbt", "Lesbian", "Romance", "Glbt", "Queer", "Lesbian", "Butch Femme"], "title": "In Keisha's Shadow", "description": ["Dumped by her high school sweetheart for not being out and proud, bi-racial Tori Kahl struggles with college life, her demanding mother, and the legacy of her dead sister Keisha. Her only escapes are riding her horse, drinking, and cutting herself. Then Ashley, the brash and flirty new boarder, shows up at the stables and not only challenges Tori's top rider status, but sh", "Dumped by her high school sweetheart for not being out and proud, bi-racial Tori Kahl struggles with college life, her demanding mother, and the legacy of her dead sister Keisha. Her only escapes are riding her horse, drinking, and cutting herself. Then Ashley, the brash and flirty new boarder, shows up at the stables and not only challenges Tori's top rider status, but shakes her world of self-pity as they cope with the pains of growing up."], "author": "Sandra Barret", "num_pages": "204", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-02-13 00:00:00", "ISBN": "1934452092"},
{"url": "https://www.goodreads.com/book/show/92936.Red_Azalea", "num_ratings": "7,493", "num_reviews": "538", "avg_ratings": 3.84, "genres": ["Cultural", "China", "Autobiography", "Memoir", "Nonfiction", "Biography", "Cultural", "Asia"], "title": "Red Azalea", "description": [" is Anchee Min’s celebrated memoir of growing up in the last years of Mao’s China. As a child, she was asked to publicly humiliate a teacher; at seventeen, she was sent to work at a labor collective. Forbidden to speak, dress, read, write, or love as she pleased, she found a lifeline in a secret love affair with another woman. Miraculously selected for the film v", " is Anchee Min’s celebrated memoir of growing up in the last years of Mao’s China. As a child, she was asked to publicly humiliate a teacher; at seventeen, she was sent to work at a labor collective. Forbidden to speak, dress, read, write, or love as she pleased, she found a lifeline in a secret love affair with another woman. Miraculously selected for the film version of one of Madame Mao’s political operas, Min’s life changed overnight. Then Chairman Mao suddenly died, taking with him an entire world. A revelatory and disturbing portrait of China, Anchee Min’s memoir is exceptional for its candor, its poignancy, its courage, and for its prose."], "author": "Anchee Min", "num_pages": "306", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-11 00:00:00", "ISBN": "1400096987"},
{"url": "https://www.goodreads.com/book/show/16047488-daisuki", "num_ratings": "60", "num_reviews": "20", "avg_ratings": 3.77, "genres": ["Romance", "Glbt", "Lesbian", "Lgbt", "Adult Fiction", "Erotica", "Adult", "Cultural", "Japan"], "title": "\"Daisuki.\"", "description": ["Aiko and Reina have been together for almost 20 years, yet one thing remains unsaid between them: \"Daisuki,\" or, \"I love you.\" As they approach their anniversary, their relationship comes to an impasse as Aiko the Japanese housewife begins demanding \"I love you\" with a side of marriage and romance.", "But Reina doesn't understand complex concepts like \"love\" or other heavy emo", "Aiko and Reina have been together for almost 20 years, yet one thing remains unsaid between them: \"Daisuki,\" or, \"I love you.\" As they approach their anniversary, their relationship comes to an impasse as Aiko the Japanese housewife begins demanding \"I love you\" with a side of marriage and romance.", "But Reina doesn't understand complex concepts like \"love\" or other heavy emotions. She's spent years supporting her girlfriend via a soul-sucking salary job and tending to their mutual needs in the bedroom. Isn’t that sufficient? In a culture demanding Reina choose between the \"feminine\" and the \"masculine\" worlds, it's bad enough she's trying to find her role without Aiko adding extra pressure.", "Some words need not saying, but \"I love you\" is about to destroy a relationship already surviving strange side-lovers and even stranger exploits."], "author": "Hildred Billings", "num_pages": "170", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/31576121-two-moons", "num_ratings": "34", "num_reviews": "24", "avg_ratings": 3.97, "genres": ["Short Stories", "Glbt", "Queer", "Lgbt", "Glbt", "Lesbian", "Fantasy", "Speculative Fiction", "Adult", "Fiction"], "title": "Two Moons: Stories", "description": ["A splendid debut collection of speculative fiction that traverses the connections between earth and the heavens, the living and the spectral, human and animal.", "In “Cosmic,” a former drug addict has a chance to redeem herself and restore honor to her family’s name. In “Harvest,” a woman tasked with providing for her community ponders her inability to bear live children. In t", "A splendid debut collection of speculative fiction that traverses the connections between earth and the heavens, the living and the spectral, human and animal.", "In “Cosmic,” a former drug addict has a chance to redeem herself and restore honor to her family’s name. In “Harvest,” a woman tasked with providing for her community ponders her inability to bear live children. In the title story, “Two Moons,” a young woman falls in love with the moon, and is astonished by the moon’s response. In “What the Heart Wants,” a rejected lover discovers that her physical and emotional desires are incongruent with the organ pumping blood through her veins.", "Sensitive, ethereal, humorous, and at times, heart-breaking, Smith’s collection of speculative fiction signals the arrival of an exceptionally talented writer with a promising career ahead of her."], "author": "Krystal A. Smith", "num_pages": "164", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2018-03-20 00:00:00", "ISBN": "0997243902"},
{"url": "https://www.goodreads.com/book/show/15702832-brooklyn-s-journey", "num_ratings": "34", "num_reviews": "9", "avg_ratings": 3.91, "genres": ["Lgbt"], "title": "BrookLyn's Journey", "description": ["Self-proclaimed nerd, BrookLyn Scott, is an eighteen-year-old high school senior in upstate New York who has never held a boy’s hand let alone one’s interest. She has some friends at school and church but is never far from the watchful eye of her abusive parents. BrookLyn’s plan is to escape the abuse by excelling in high school and running safely to college just as her ol", "Self-proclaimed nerd, BrookLyn Scott, is an eighteen-year-old high school senior in upstate New York who has never held a boy’s hand let alone one’s interest. She has some friends at school and church but is never far from the watchful eye of her abusive parents. BrookLyn’s plan is to escape the abuse by excelling in high school and running safely to college just as her older siblings did. Her plan is derailed after she’s invited and attends her first party. By the end of the night, BrookLyn finds out that church friend, Gabriella Michaels wants more than a friendship, and although her head says no, her heart thinks of the possibility. BrookLyn is focused on her escape plan while flying under the radar of her father’s swinging belt when she is thrust onto an emotional roller coaster. The question is, when the ride ends, where will BrookLyn stand?"], "author": "Coffey Brown", "num_pages": "254", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18927584-heart-block", "num_ratings": "1,734", "num_reviews": "97", "avg_ratings": 4.12, "genres": ["Romance", "Glbt", "Lesbian", "Lgbt", "Romance", "Lesbian Romance", "Lesbian", "Lesbian Fiction", "Contemporary"], "title": "Heart Block", "description": ["Happily ever after is easier said than done…", "Sarah Matamoros can’t complain. After immigrating from Mexico when she was nine years old, she’s content with the life she’s made for herself in sunny San Diego. She works hard at her mother’s housecleaning service by day and spends the evenings with her quirky eight-year-old daughter, Grace.", "From a very young age, Emory Owen had", "Happily ever after is easier said than done…", "Sarah Matamoros can’t complain. After immigrating from Mexico when she was nine years old, she’s content with the life she’s made for herself in sunny San Diego. She works hard at her mother’s housecleaning service by day and spends the evenings with her quirky eight-year-old daughter, Grace.", "From a very young age, Emory Owen had several concepts drilled into her head. Success is everything. Be the best. Fight your way to the top. Expectations were high in the Owen household and the world was watching. Born into a high society family, Emory never wanted for anything…at least anything money could buy. When she meets Sarah, hired to sort her mother’s home, her sterile life suddenly sparks into color.", "But when the emotional logistics of combining two very different worlds proves to be too much, a terrifying turn of events spurs the question: If love exists, can it really find a way?"], "author": "Melissa Brayden", "num_pages": "264", "awards": ["Golden Crown Literary Award for Traditional Romance (2013)"], "places": [], "character_names": ["Sarah Matamoros", "Emory Owen"], "language": "English", "publish_date": "2012-11-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/529493.The_Necessary_Hunger", "num_ratings": "394", "num_reviews": "52", "avg_ratings": 3.81, "genres": ["Lgbt", "Young Adult", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Sports and Games", "Sports"], "title": "The Necessary Hunger", "author": "Nina Revoyr", "num_pages": "365", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-15 00:00:00", "ISBN": "0312181426"},
{"url": "https://www.goodreads.com/book/show/27213163-another-brooklyn", "num_ratings": "20,896", "num_reviews": "3,203", "avg_ratings": 3.86, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Coming Of Age", "Young Adult", "Adult", "Adult Fiction"], "title": "Another Brooklyn", "description": ["Running into a long-ago friend sets memories from the 1970s in motion for August, transporting her to a time and a place where friendship was everything—until it wasn’t. For August and her girls, sharing confidences as they ambled through neighborhood streets, Brooklyn was a place where they believed that they were beautiful, talented, brilliant—a part of a future that bel", "Running into a long-ago friend sets memories from the 1970s in motion for August, transporting her to a time and a place where friendship was everything—until it wasn’t. For August and her girls, sharing confidences as they ambled through neighborhood streets, Brooklyn was a place where they believed that they were beautiful, talented, brilliant—a part of a future that belonged to them.", "But beneath the hopeful veneer, there was another Brooklyn, a dangerous place where grown men reached for innocent girls in dark hallways, where ghosts haunted the night, where mothers disappeared. A world where madness was just a sunset away and fathers found hope in religion."], "author": "Jacqueline Woodson", "num_pages": "177", "awards": ["Los Angeles Times Book Prize Nominee for Christopher Isherwood Prize for Autobiographical Prose (2016)", "Hurston/Wright Legacy Award Nominee for Fiction (2017)", "Andrew Carnegie Medal Nominee for Fiction (2017)", "National Book Award Finalist (2016)", "Goodreads Choice Award Nominee for Fiction (2016)"], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2016-08-09 00:00:00", "ISBN": "0062359983"},
{"url": "https://www.goodreads.com/book/show/23258917-rise-of-the-gorgon", "num_ratings": "22", "num_reviews": "6", "avg_ratings": 3.91, "genres": ["Romance", "Lgbt", "Science Fiction", "War", "Military Fiction", "Thriller"], "title": "Rise of the Gorgon", "description": ["When a friend and troubled army veteran kills himself, independent Internet journalist Elle Pharell goes to Kuwait to investigate the mysterious private security firm he strangely does not remember working for until the day of his suicide. Elle hires brilliant interpreter Cass Hunt to help navigate the area. In a remote desert village, they find everything abandoned and no", "When a friend and troubled army veteran kills himself, independent Internet journalist Elle Pharell goes to Kuwait to investigate the mysterious private security firm he strangely does not remember working for until the day of his suicide. Elle hires brilliant interpreter Cass Hunt to help navigate the area. In a remote desert village, they find everything abandoned and no one to tell the story of what happened save one crazed local. Elle discovers a conspiracy involving the testing of biochemical weapons on civilians turning them into zombies.", "Cass Hunt is the Gorgon, a mind control assassin sent by a shadowy corporation to thwart Elle’s investigation, to even kill her if she gets too close to the truth. What Cass’s handlers did not expect is an unexplainable attraction to her target. Together they must decide if it is safe to expose the truth or remain silent."], "author": "Tanai Walker", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-08-11 00:00:00", "ISBN": "1626393672"},
{"url": "https://www.goodreads.com/book/show/29904219-not-your-sidekick", "num_ratings": "3,134", "num_reviews": "710", "avg_ratings": 3.93, "genres": ["Young Adult", "Lgbt", "Fantasy", "Science Fiction"], "title": "Not Your Sidekick", "description": ["Welcome to Andover… where superpowers are common, but internships are complicated. Just ask high school nobody, Jessica Tran. Despite her heroic lineage, Jess is resigned to a life without superpowers and is merely looking to beef-up her college applications when she stumbles upon the perfect (paid!) internship—only it turns out to be for the town’s most heinous supervilla", "Welcome to Andover… where superpowers are common, but internships are complicated. Just ask high school nobody, Jessica Tran. Despite her heroic lineage, Jess is resigned to a life without superpowers and is merely looking to beef-up her college applications when she stumbles upon the perfect (paid!) internship—only it turns out to be for the town’s most heinous supervillain. On the upside, she gets to work with her longtime secret crush, Abby, who Jess thinks may have a secret of her own. Then there’s the budding attraction to her fellow intern, the mysterious “M,” who never seems to be in the same place as Abby. But what starts as a fun way to spite her superhero parents takes a sudden and dangerous turn when she uncovers a plot larger than heroes and villains altogether."], "author": "C.B. Lee", "num_pages": "283", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-09-08 00:00:00", "ISBN": "1945053038"},
{"url": "https://www.goodreads.com/book/show/2042764.When_Fox_Is_a_Thousand", "num_ratings": "314", "num_reviews": "39", "avg_ratings": 3.8, "genres": ["Fantasy", "Fiction", "Lgbt", "Glbt", "Queer", "Magical Realism", "Cultural", "Canada"], "title": "When Fox Is a Thousand", "description": ["When Fox is a Thousand is a lyrical, magical novel, rich with poetry and folklore and elements of the fairytale. Larissa Lai interweaves three narrative voices and their attendant cultures: an elusive fox growing toward wisdom and her 1000 birthday, the ninth-century Taoist poet/nun Yu Hsuan-Chi (a real person executed in China for murder), and the oddly named Artemis, a y", "When Fox is a Thousand is a lyrical, magical novel, rich with poetry and folklore and elements of the fairytale. Larissa Lai interweaves three narrative voices and their attendant cultures: an elusive fox growing toward wisdom and her 1000 birthday, the ninth-century Taoist poet/nun Yu Hsuan-Chi (a real person executed in China for murder), and the oddly named Artemis, a young Asian-American woman living in contemporary Vancouver.With beautiful and enchanting prose, and a sure narrative hand, Lai combines Chinese mythology, the sexual politics of medieval China, and modern-day Vancouver to masterfully revise the myth of the Fox (a figure who can inhibit women’s bodies in order to cause mischief). Her potent imagination and considerable verbal skill result in a tale that continues to haunt long after the story is told.First published to wide acclaim in 1995 and out of print since 2001, this new edition of When Fox is a Thousand, published by Arsenal Pulp Press for the first time, features a new foreword by the author.Praise for When Fox is a Thousand:“A sure-footed writer and teller of tales, Lai takes the reader on a magnificent journey through layers of time, myth, and imagery.”—Susan Crean“A particularly acute pleasure.”—The AdvocateLarissa Lai was born in La Jolla, California and lives in Calgary where she is completing a Ph.D. in English at the University of Calgary. She was awarded an Astraea Foundation Emerging Writers Award in 1995. She is also the author of the novel Salt Fish Girl (2002)."], "author": "Larissa Lai", "num_pages": "236", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "0889740410"},
{"url": "https://www.goodreads.com/book/show/16286376-the-summer-we-got-free", "num_ratings": "1,098", "num_reviews": "155", "avg_ratings": 4.34, "genres": ["Fiction", "Glbt", "Queer", "Lgbt", "Cultural", "African American", "Feminism"], "title": "The Summer We Got Free", "description": ["At one time a wild young girl and a brilliant artist, Ava Delaney changes dramatically after a violent event that rocks her entire family. Once loved and respected in their community and in their church, they are ostracized by their neighbors, led by their church leader, and a seventeen-year feud between the Delaneys and the church ensues. Ava and her family are displaced", "At one time a wild young girl and a brilliant artist, Ava Delaney changes dramatically after a violent event that rocks her entire family. Once loved and respected in their community and in their church, they are ostracized by their neighbors, led by their church leader, and a seventeen-year feud between the Delaneys and the church ensues. Ava and her family are displaced from the community even as they continue to live within it, trapped inside their creaky, shadowy old house.", "When a mysterious woman arrives unexpectedly for a visit, her presence stirs up the past and ghosts and other restless things begin to emerge. And something is reignited in Ava: the indifferent woman she has become begins to give way to the wild girl, and the passionate artist, she used to be. But not without a struggle that threatens her well-being and, ultimately, her life.", "Mia McKenzie is a winner of the Astraea Foundation's Writers Fund Award and the Leeway Foundation's Transformation Award. She describes herself as \"a black feminist and a freaking queer.\" Her work has been recommended by ", " and ", " among others. She is the creator of the blog BlackGirlDangerous.org."], "author": "Mia McKenzie", "num_pages": "242", "awards": ["Lambda Literary Award for LGBT Debut Fiction (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-11-19 00:00:00", "ISBN": "0988628600"},
{"url": "https://www.goodreads.com/book/show/10215999-a-pirate-s-heart", "num_ratings": "452", "num_reviews": "45", "avg_ratings": 3.98, "genres": ["Lgbt", "Adventure", "Pirates", "Romance", "Glbt", "Lesbian", "Historical", "Historical Fiction", "Historical", "Romance", "Lesbian Romance"], "title": "A Pirate's Heart", "description": ["Four women, a long-lost treasure, and more than one “thief of hearts” share a destiny beyond time.", "To foil a map thief, librarian Emma Boyd searches for a pirate's long-lost treasure map. She’s aided in her search by investigator Randi Marx, who proves to be as frustrating as she is beautiful. The treasure map Emma and Randi seek belonged to Thomasina Farris, a pirate who d", "Four women, a long-lost treasure, and more than one “thief of hearts” share a destiny beyond time.", "To foil a map thief, librarian Emma Boyd searches for a pirate's long-lost treasure map. She’s aided in her search by investigator Randi Marx, who proves to be as frustrating as she is beautiful. The treasure map Emma and Randi seek belonged to Thomasina Farris, a pirate who disappeared from the Caribbean in 1715. Did Captain Tommy steal an entire treasure from a Spanish galleon and escape? Was she convicted of piracy and hanged by her neck? Did she die of a broken heart when she lost the woman she loved?", "In her race to find the map, Emma learns that pirates not only steal treasure, but they also steal hearts. When Emma discovers Captain Tommy’s fate, she must decide her own as well, choosing between romance...or revenge."], "author": "Catherine Friend", "num_pages": "320", "awards": ["Lambda Literary Award Nominee for Lesbian Romance (2008)", "Golden Crown Literary Award for Historical Romance (2009)"], "places": [], "character_names": [], "language": "Hungarian", "publish_date": "2008-11-01 00:00:00", "ISBN": "1602823812"},
{"url": "https://www.goodreads.com/book/show/565006.Gold_Mountain", "num_ratings": "19", "num_reviews": "1", "avg_ratings": 3.79, "genres": ["Lesbian", "Lesbian Fiction", "Drama", "Glbt", "Lesbian", "Mystery"], "title": "Gold Mountain", "description": ["Gold Mountain has a unique and distinctive Canadian flavour which embraces the cultural diversity found in Canada today. It is the story of two women, not only on opposite ends of our cultural scale but also on opposite ends of our Justice scale. It is the story of Kelly, the daughter of the concubine of a Chinese immigrant to Canada, and her struggle to find her place in", "Gold Mountain has a unique and distinctive Canadian flavour which embraces the cultural diversity found in Canada today. It is the story of two women, not only on opposite ends of our cultural scale but also on opposite ends of our Justice scale. It is the story of Kelly, the daughter of the concubine of a Chinese immigrant to Canada, and her struggle to find her place in both the Caucasian and Chinese world, both of which prefer their women heterosexual. It is the story of Jane, a woman who appears to have found her place in the world, but in fact her place is waiting to be discovered. Discovering for Jane and a place for Kelly comes as a result of the night that Kelly's half-brother, her father's only son, an indulged young man, is murdered. The author is skilled at writing both Kelly and Jane's voices and the impact is considerable. Easily, the reader is led from one POV to the other solely by how the voices are written."], "author": "Anne Azel", "num_pages": "124", "awards": ["Golden Crown Literary Award for Lesbian Dramatic/General Fiction (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-01 00:00:00", "ISBN": "1933720042"},
{"url": "https://www.goodreads.com/book/show/24828900-all-the-little-moments", "num_ratings": "705", "num_reviews": "96", "avg_ratings": 4.26, "genres": ["Glbt", "Lesbian", "Romance", "Lgbt", "Medical", "Romance", "Lesbian Romance", "Contemporary"], "title": "All the Little Moments", "description": ["A successful anaesthetist, Anna is focused on herself, her career, and her girlfriend. Everything changes abruptly when her brother’s and sister-in-law’s deaths devastate her and her family. Left responsible for her young niece and nephew, Anna finds herself dumped and alone in Melbourne, a city she doesn’t even like. She tries to navigate the shock of looking after two ch", "A successful anaesthetist, Anna is focused on herself, her career, and her girlfriend. Everything changes abruptly when her brother’s and sister-in-law’s deaths devastate her and her family. Left responsible for her young niece and nephew, Anna finds herself dumped and alone in Melbourne, a city she doesn’t even like. She tries to navigate the shock of looking after two children battling with their grief while managing her own. ", "Filled with self-doubt, Anna feels as if she’s making a mess of the entire thing, especially when she collides with a long-legged stranger. Anna barely has time to brush her teeth in the morning, let alone to date a woman—least of all one who has no idea about the two kids under her care. ", "Just when Anna finally starts to feel as if she’s getting some control of the situation, the biggest fight begins and Anna really has to step up once and for all."], "author": "G. Benson", "num_pages": "370", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-08-12 00:00:00", "ISBN": "3955333418"},
{"url": "https://www.goodreads.com/book/show/57498.The_Salt_Roads", "num_ratings": "1,340", "num_reviews": "188", "avg_ratings": 3.83, "genres": ["Fantasy", "Fiction", "Historical", "Historical Fiction", "Magical Realism", "Glbt", "Queer", "Lgbt"], "title": "The Salt Roads", "description": ["A landmark work by a brilliant young author, THE SALT ROADS transports readers across centuries and civilizations as it fearlessly explores the relationships women have with their lovers, their people, and the divine. Jeanne Duval, the ginger-colored entertainer, struggles with her lover poet Charles Baudelaire...Mer, plantation slave and doctor, both hungers for and dread", "A landmark work by a brilliant young author, THE SALT ROADS transports readers across centuries and civilizations as it fearlessly explores the relationships women have with their lovers, their people, and the divine. Jeanne Duval, the ginger-colored entertainer, struggles with her lover poet Charles Baudelaire...Mer, plantation slave and doctor, both hungers for and dreads liberation...and Thais, a dark-skinned beauty from Alexandria, is impelled to seek a glorious revelation-as Ezili, a being born of hope, unites them all. Interweaving acts of brutality with passionate unions of spirit and flesh, this is a narrative that shocks, entertains, and dazzles-from an award-winning writer who dares to redefine the art of storytelling.", "A Nebula Award nominee -- A Locus Magazine recommended book"], "author": "Nalo Hopkinson", "num_pages": "416", "awards": ["Gaylactic Spectrum Award for Best Novel (2004)", "Hurston/Wright Legacy Award Nominee for Debut Fiction (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "0446677132"},
{"url": "https://www.goodreads.com/book/show/8525600-boyfriends-with-girlfriends", "num_ratings": "2,907", "num_reviews": "293", "avg_ratings": 3.56, "genres": ["Lgbt", "Young Adult", "Romance", "Glbt", "Queer", "Contemporary"], "title": "Boyfriends with Girlfriends", "description": ["Lance has always known he was gay, but he's never had a real boyfriend. Sergio is bisexual, but his only real relationship was with a girl. When the two of them meet, they have an instant connection--but will it be enough to overcome their differences? ", "Allie's been in a relationship with a guy for the last two years--but when she meets Kimiko, she can't get her out of her", "Lance has always known he was gay, but he's never had a real boyfriend. Sergio is bisexual, but his only real relationship was with a girl. When the two of them meet, they have an instant connection--but will it be enough to overcome their differences? ", "Allie's been in a relationship with a guy for the last two years--but when she meets Kimiko, she can't get her out of her mind. Does this mean she's gay? Does it mean she's bi? Kimiko, falling hard for Allie, and finding it impossible to believe that a gorgeous girl like Allie would be into her, is willing to stick around and help Allie figure it out. ", " is Alex Sanchez at his best, writing with a sensitive hand to portray four very real teens striving to find their places in the world--and with each other."], "author": "Alex   Sanchez", "num_pages": "217", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-19 00:00:00", "ISBN": "1416937730"},
{"url": "https://www.goodreads.com/book/show/23569447-under-my-skin", "num_ratings": "230", "num_reviews": "40", "avg_ratings": 4.48, "genres": ["Lgbt", "Romance", "Lgbt", "Transgender", "Glbt", "Queer", "Cultural", "Australia"], "title": "Under My Skin", "description": ["Min Lee is a workaholic who can’t say no. She substitutes sleep with Red Bull and, through a combination of repression and bad habits, has managed to score herself a luxury apartment, a fabulous boyfriend and the approval of her billionaire CEO. Things are looking pretty awesome… well, apart from those body image issues that constantly plague her. ", "But Min thinks she's got", "Min Lee is a workaholic who can’t say no. She substitutes sleep with Red Bull and, through a combination of repression and bad habits, has managed to score herself a luxury apartment, a fabulous boyfriend and the approval of her billionaire CEO. Things are looking pretty awesome… well, apart from those body image issues that constantly plague her. ", "But Min thinks she's got everything worked out. She's arranged her comfort zone and has zero desire to look outside of it… or, so she tells herself. ", "It’s not until a troubled schoolgirl tracks her down from the Internet, stalks her to her home and noses her way into life that Min begins to admit that something is wrong in her perfect world. Something that she's never thought about before, and doesn’t even want to think about. Something that has the power to ruin all her relationships and dismantle everything in her life she’s worked so very hard for. ", "What if ‘she’ isn’t the right word for Min at all?"], "author": "A.E. Dooland", "num_pages": "688", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25898552-24-7", "num_ratings": "58", "num_reviews": "18", "avg_ratings": 3.66, "genres": ["Lgbt", "Lesbian", "Lesbian Fiction", "Glbt", "Lesbian", "Romance", "Lesbian Romance", "Adventure", "Mystery", "Crime", "Suspense", "Romance"], "title": "24/7", "description": ["Finn Chamberlain is a travel writer with more passport stamps than friends. Her career keeps her constantly on the go, leaving her precious little time for relationships. And that’s just the way she likes it—until a charged encounter with a beautiful stranger causes her to call her unsettled life into question.", "Luisa Moreno is an officer with the Mexican Federal Police. Her", "Finn Chamberlain is a travel writer with more passport stamps than friends. Her career keeps her constantly on the go, leaving her precious little time for relationships. And that’s just the way she likes it—until a charged encounter with a beautiful stranger causes her to call her unsettled life into question.", "Luisa Moreno is an officer with the Mexican Federal Police. Her chance meeting with Finn Chamberlain was supposed to be a one-time thing, but it leaves her wanting more. When Finn’s life is threatened, it’s up to Luisa to save her. Will Luisa’s rescue attempt be successful, or will she lose much more than her heart in the process?"], "author": "Yolanda Wallace", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-15 00:00:00", "ISBN": "1626396191"},
{"url": "https://www.goodreads.com/book/show/25449303-a-harvest-of-ripe-figs", "num_ratings": "168", "num_reviews": "42", "avg_ratings": 4.29, "genres": ["Fantasy", "Glbt", "Lesbian", "Lgbt", "Glbt", "Queer", "Lgbt", "Transgender", "Fiction", "Young Adult"], "title": "A Harvest of Ripe Figs", "description": ["Esther of the Singing Hands is Perach's Sweetheart, a young and beautiful musician with a Girl Next Door image. When her violin is stolen after a concert in the capital city, she doesn't expect the queen herself to show up, intent upon solving the mystery. But Queen Shulamit -- lesbian, intellectual, and mother of the six-month-old crown princess -- loves to play detective", "Esther of the Singing Hands is Perach's Sweetheart, a young and beautiful musician with a Girl Next Door image. When her violin is stolen after a concert in the capital city, she doesn't expect the queen herself to show up, intent upon solving the mystery. But Queen Shulamit -- lesbian, intellectual, and mother of the six-month-old crown princess -- loves to play detective. With the help of her legendary bodyguard Rivka and her dragon, and with the support of her partner Aviva the Chef, Shulamit turns her mind toward the solution -- which she quickly begins to suspect involves the use of illegal magic that could threaten the safety of her citizens."], "author": "Shira Glassman", "num_pages": "228", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-21 00:00:00", "ISBN": "161040873X"},
{"url": "https://www.goodreads.com/book/show/23719408-under-the-udala-trees", "num_ratings": "4,427", "num_reviews": "719", "avg_ratings": 3.95, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Lgbt", "Glbt", "Queer", "Western Africa", "Nigeria"], "title": "Under the Udala Trees", "description": ["Inspired by Nigeria's folktales and its war, Under the Udala Trees is a deeply searching, powerful debut about the dangers of living and loving openly.", "Ijeoma comes of age as her nation does; born before independence, she is eleven when civil war breaks out in the young republic of Nigeria. Sent away to safety, she meets another displaced child and they, star-crossed, fall", "Inspired by Nigeria's folktales and its war, Under the Udala Trees is a deeply searching, powerful debut about the dangers of living and loving openly.", "Ijeoma comes of age as her nation does; born before independence, she is eleven when civil war breaks out in the young republic of Nigeria. Sent away to safety, she meets another displaced child and they, star-crossed, fall in love. They are from different ethnic communities. They are also both girls. ", "When their love is discovered, Ijeoma learns that she will have to hide this part of herself. But there is a cost to living inside a lie. ", "As Edwidge Danticat has made personal the legacy of Haiti's political coming of age, Okparanta's Under the Udala Trees uses one woman's lifetime to examine the ways in which Nigerians continue to struggle toward selfhood. Even as their nation contends with and recovers from the effects of war and division, Nigerian lives are also wrecked and lost from taboo and prejudice. This story offers a glimmer of hope — a future where a woman might just be able to shape her life around truth and love."], "author": "Chinelo Okparanta", "num_pages": "328", "awards": ["Lambda Literary Award for Lesbian General Fiction (2016)", "Hurston/Wright Legacy Award Nominee for Fiction (2016)", "The Center for Fiction First Novel Prize Nominee for Longlist (2015)", "International DUBLIN Literary Award Nominee for Shortlist (2017)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2015-09-22 00:00:00", "ISBN": "0544003446"},
{"url": "https://www.goodreads.com/book/show/23430483-cam-girl", "num_ratings": "1,625", "num_reviews": "448", "avg_ratings": 3.73, "genres": ["New Adult", "Contemporary", "Romance", "Lgbt", "Fiction"], "title": "Cam Girl", "description": ["Vada Bergen is broke, the black sheep of her family, and moving a thousand miles away from home for grad school, but she’s got the two things she loves most: her art and her best friend—and sometimes more—Ellis Carraway. Ellis and Vada have a friendship so consuming it’s hard to tell where one girl ends and the other begins. It’s intense. It’s a little codependent. And not", "Vada Bergen is broke, the black sheep of her family, and moving a thousand miles away from home for grad school, but she’s got the two things she loves most: her art and her best friend—and sometimes more—Ellis Carraway. Ellis and Vada have a friendship so consuming it’s hard to tell where one girl ends and the other begins. It’s intense. It’s a little codependent. And nothing can tear them apart.", "Until an accident on an icy winter road changes everything.", "Vada is left deeply scarred, both emotionally and physically. Her once-promising art career is cut short. And Ellis pulls away, unwilling to talk about that night. Everything Vada loved is gone.", "She’s got nothing left to lose.", "So when she meets some smooth-talking entrepreneurs who offer to set her up as a cam girl, she can’t say no. All Vada has to do is spend a couple hours each night stripping on webcam, and the “tips” come pouring in.", "It’s just a kinky escape from reality until a client gets serious. “Blue” is mysterious, alluring, and more interested in Vada’s life than her body. Online, they chat intimately. Blue helps her heal. And he pays well, but he wants her all to himself. No more cam shows. It’s an easy decision: she’s starting to fall for him. But the steamier it gets, the more she craves the real man behind the keyboard. So Vada pops the question:", "Blue agrees, on one condition. A condition that brings back a ghost from her past. Now Vada must confront the devastating secrets she's been running from—those of others, and those she's been keeping from herself..."], "author": "Elliot Wake", "num_pages": "422", "awards": [], "places": ["Portland, Maine"], "character_names": [], "language": "English", "publish_date": "2015-11-03 00:00:00", "ISBN": "1501114999"},
{"url": "https://www.goodreads.com/book/show/19062502-lucky-loser", "num_ratings": "159", "num_reviews": "15", "avg_ratings": 3.64, "genres": ["Glbt", "Lesbian", "Sports and Games", "Sports", "Romance", "Lgbt", "Romance", "Lesbian Romance", "Lesbian", "Lesbian Fiction"], "title": "Lucky Loser", "description": ["In the high stakes world of women’s tennis, love means nothing. Or at least that’s how Sinjin Smythe sees it. Then she begins to fall for her friend and former doubles partner Laure Fortescue. Having had her heart broken by one player, Sinjin isn’t willing to have it happen again. The talented but oft-injured Brit enters Wimbledon fighting her feelings—and struggling to re", "In the high stakes world of women’s tennis, love means nothing. Or at least that’s how Sinjin Smythe sees it. Then she begins to fall for her friend and former doubles partner Laure Fortescue. Having had her heart broken by one player, Sinjin isn’t willing to have it happen again. The talented but oft-injured Brit enters Wimbledon fighting her feelings—and struggling to resurrect her career.", "Laure Fortescue has fame, fortune, and a ranking inside the top ten. She has everything she ever wanted. Everything except Sinjin Smythe. As a rule, Laure doesn’t date other players. A rule she would gladly break if it means winning Sinjin’s heart.", "Both women reach Wimbledon desperate to claim tennis’s crown jewel—Sinjin because it would be her greatest victory, Laure because it could be her last.", "Where does love fit in a game that only one can win?"], "author": "Yolanda Wallace", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-11-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22546578-not-otherwise-specified", "num_ratings": "1,483", "num_reviews": "328", "avg_ratings": 3.79, "genres": ["Young Adult", "Lgbt", "Contemporary", "Glbt", "Queer", "Fiction", "Health", "Mental Health"], "title": "Not Otherwise Specified", "description": ["From the award-winning author of ", "and ", " comes a raw and honest exploration of complicated identities in a novel about a girl living on the fringe of every fringe group in her small town.", "Etta is tired of dealing with all of the labels and categories that seem so important to everyone else in her small Nebraska hometown.", "Everywhere she turns, someone feels she’s too", "From the award-winning author of ", "and ", " comes a raw and honest exploration of complicated identities in a novel about a girl living on the fringe of every fringe group in her small town.", "Etta is tired of dealing with all of the labels and categories that seem so important to everyone else in her small Nebraska hometown.", "Everywhere she turns, someone feels she’s too fringe for the fringe. Not gay enough for the Dykes, her ex-clique, thanks to a recent relationship with a boy; not tiny and white enough for ballet, her first passion; not sick enough to look anorexic (partially thanks to recovery). Etta doesn’t fit anywhere—until she meets Bianca, the straight, white, Christian, and seriously sick girl in Etta’s therapy group. Both girls are auditioning for Brentwood, a prestigious New York theater academy that is so not Nebraska. Bianca might be Etta’s salvation…but can Etta be saved by a girl who needs saving herself?"], "author": "Hannah Moskowitz", "num_pages": "304", "awards": ["Bisexual Book Award for Teen/YA Fiction (2015)"], "places": ["Nebraska"], "character_names": [], "language": "English", "publish_date": "2015-03-03 00:00:00", "ISBN": "1481405950"},
{"url": "https://www.goodreads.com/book/show/22613717-climbing-the-date-palm", "num_ratings": "221", "num_reviews": "45", "avg_ratings": 4.22, "genres": ["Fantasy", "Lgbt", "Glbt", "Queer", "Romance", "Glbt", "Lesbian", "Literature", "Jewish"], "title": "Climbing the Date Palm", "description": ["Prince Kaveh, the youngest son of the king of the City of Red Clay, is bisexual, and is completely besotted with Farzin, the engineer his father hired to oversee the improvements to the city's roads and bridges. However, the king doesn't share his positive feelings. After Farzin ends up at the head of the protest that ensues when the workers are only paid a third of their", "Prince Kaveh, the youngest son of the king of the City of Red Clay, is bisexual, and is completely besotted with Farzin, the engineer his father hired to oversee the improvements to the city's roads and bridges. However, the king doesn't share his positive feelings. After Farzin ends up at the head of the protest that ensues when the workers are only paid a third of their promised wages, he's thrown in prison and is scheduled to be executed.", "Queen Shulamit, who rules over the neighboring nation of Perach, is eager to assist the desperate prince. She, too, loves justice and has a same-sex partner. She's also hoping Kaveh, with his royal blood, is willing to give her and her sweetheart a legitimate heir in exchange. But can she find a peaceful solution that will pacify the king next door, get his workers fairly paid, and free Farzin, or will she and her dragon-riding bodyguard Rivka have to go to war?"], "author": "Shira Glassman", "num_pages": "241", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-02 00:00:00"},
{"url": "https://www.goodreads.com/book/show/27969087-labyrinth-lost", "num_ratings": "6,363", "num_reviews": "1,687", "avg_ratings": 3.76, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fantasy", "Paranormal", "Fiction"], "title": "Labyrinth Lost", "description": ["Alex is a bruja, the most powerful witch in a generation…and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo she can’t trust, but who may be Alex’s only chance at saving her family", "Alex is a bruja, the most powerful witch in a generation…and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo she can’t trust, but who may be Alex’s only chance at saving her family."], "author": "Zoraida Córdova", "num_pages": "324", "awards": [], "places": ["Los Lagos realm, Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2017-08-01 00:00:00", "ISBN": "1492623164"},
{"url": "https://www.goodreads.com/book/show/18607160-lies-my-girlfriend-told-me", "num_ratings": "3,985", "num_reviews": "475", "avg_ratings": 3.7, "genres": ["Lgbt", "Young Adult", "Contemporary", "Romance", "Fiction", "Glbt", "Lesbian"], "title": "Lies My Girlfriend Told Me", "description": ["When Alix's charismatic girlfriend, Swanee, dies from sudden cardiac arrest, Alix is overcome with despair. As she searches Swanee's room for mementos of their relationship, she finds Swanee's cell phone, pinging with dozens of texts sent from a mysterious contact, L.T. The most recent text reads: \"Please tell me what I did. Please, Swan. Te amo. I love you.\"", "Shocked and be", "When Alix's charismatic girlfriend, Swanee, dies from sudden cardiac arrest, Alix is overcome with despair. As she searches Swanee's room for mementos of their relationship, she finds Swanee's cell phone, pinging with dozens of texts sent from a mysterious contact, L.T. The most recent text reads: \"Please tell me what I did. Please, Swan. Te amo. I love you.\"", "Shocked and betrayed, Alix learns that Swanee has been leading a double life--secretly dating a girl named Liana the entire time she's been with Alix. Alix texts Liana from Swanee's phone, pretending to be Swanee in order to gather information before finally meeting face-to-face to break the news.", "Brought together by Swanee's lies, Alix and Liana become closer than they'd thought possible. But Alix is still hiding the truth from Liana. Alix knows what it feels like to be lied to--but will coming clean to Liana mean losing her, too?"], "author": "Julie Anne Peters", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-06-10 00:00:00", "ISBN": "0316234974"},
{"url": "https://www.goodreads.com/book/show/15814530-happiness-like-water", "num_ratings": "961", "num_reviews": "142", "avg_ratings": 4.02, "genres": ["Short Stories", "Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "Lgbt", "Literature", "African Literature", "Glbt", "Queer"], "title": "Happiness, Like Water", "description": ["Here are Nigerian women at home and transplanted to the United States, building lives out of longing and hope, faith and doubt, the struggle to stay and the mandate to leave, the burden and strength of love. Here are characters faced with dangerous decisions, children slick with oil from the river, a woman in love with another despite the penalties. Here is a world marked", "Here are Nigerian women at home and transplanted to the United States, building lives out of longing and hope, faith and doubt, the struggle to stay and the mandate to leave, the burden and strength of love. Here are characters faced with dangerous decisions, children slick with oil from the river, a woman in love with another despite the penalties. Here is a world marked by electricity outages, lush landscapes, folktales, buses that break down and never start up again. Here is a portrait of Nigerians that is surprising, shocking, heartrending, loving, and across social strata, dealing in every kind of change. Here are stories filled with language to make your eyes pause and your throat catch. ", "introduces a true talent, a young writer with a beautiful heart and a capacious imagination."], "author": "Chinelo Okparanta", "num_pages": "196", "awards": ["New York Public Library Young Lions Fiction Award Nominee (2014)", "Lambda Literary Award for Lesbian General Fiction (2014)", "Society of Midland Authors Award Nominee for Adult Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-13 00:00:00", "ISBN": "0544003454"},
{"url": "https://www.goodreads.com/book/show/18465930-last-words-from-montmartre", "num_ratings": "527", "num_reviews": "83", "avg_ratings": 3.8, "genres": ["Fiction", "Lgbt", "Glbt", "Queer"], "title": "Last Words from Montmartre", "description": ["When the pioneering Taiwanese novelist Qiu Miaojin committed suicide in 1995 at age twenty-six, she left behind her unpublished masterpiece, ", ". Unfolding through a series of letters written by an unnamed narrator, ", " tells the story of a passionate relationship between two young women—their sexual awakening, their gradual breakup, and the d", "When the pioneering Taiwanese novelist Qiu Miaojin committed suicide in 1995 at age twenty-six, she left behind her unpublished masterpiece, ", ". Unfolding through a series of letters written by an unnamed narrator, ", " tells the story of a passionate relationship between two young women—their sexual awakening, their gradual breakup, and the devastating aftermath of their broken love. In a style that veers between extremes, from self-deprecation to pathos, compulsive repetition to rhapsodic musings, reticence to vulnerability, Qiu’s genre-bending novel is at once a psychological thriller, a sublime romance, and the author’s own suicide note.", "The letters (which, Qiu tells us, can be read in any order) leap between Paris, Taipei, and Tokyo. They display wrenching insights into what it means to live between cultures, languages, and genders—until the genderless character Zoë appears, and the narrator’s spiritual and physical identity is transformed. As powerfully raw and transcendent as Mishima’s ", ", Goethe’s ", ", and Theresa Cha’s ", ", to name but a few,", " proves Qiu Miaojin to be one of the finest experimentalists and modernist Chinese-language writers of our generation."], "author": "Qiu Miaojin", "num_pages": "161", "awards": ["BTBA Best Translated Book Award Nominee for Fiction Longlist (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-06-03 00:00:00", "ISBN": "1590177258"},
{"url": "https://www.goodreads.com/book/show/1585299.The_World_Unseen", "num_ratings": "1,778", "num_reviews": "96", "avg_ratings": 4.07, "genres": ["Lgbt", "Fiction", "Historical", "Historical Fiction", "Glbt", "Queer", "Glbt", "Lesbian", "Romance"], "title": "The World Unseen", "description": ["Miriam is the traditional young Indian mother, hardworking and self-effacing. When she meets the rebellious Amina who confounds the Indian community by driving a taxi and setting up a cafe with a black man, her world is turned upside down."], "author": "Shamim Sarif", "num_pages": "344", "awards": ["Betty Trask Award (2002)"], "places": [], "character_names": [], "language": "English", "publish_date": "2004-06-07 00:00:00", "ISBN": "075532191X"},
{"url": "https://www.goodreads.com/book/show/18667779-everything-leads-to-you", "num_ratings": "23,150", "num_reviews": "2,559", "avg_ratings": 3.88, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "Everything Leads to You", "description": ["  ", " A wunderkind young set designer, Emi has already started to find her way in the competitive Hollywood film world.", "  ", " Emi is a film buff and a true romantic, but her real-life relationships are a mess. She has desperately gone back to the s", "  ", " A wunderkind young set designer, Emi has already started to find her way in the competitive Hollywood film world.", "  ", " Emi is a film buff and a true romantic, but her real-life relationships are a mess. She has desperately gone back to the same girl too many times to mention. But then a mysterious letter from a silver screen legend leads Emi to Ava. Ava is unlike anyone Emi has ever met. She has a tumultuous, not-so-glamorous past, and lives an unconventional life. She’s enigmatic…. She’s beautiful. And she is about to expand Emi’s understanding of family, acceptance, and true romance.", "  "], "author": "Nina LaCour", "num_pages": "307", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2014)"], "places": ["Venice, California"], "character_names": ["Emi Price", "Charlotte Young", "Ava Wilder"], "language": "English", "publish_date": "2014-05-15 00:00:00", "ISBN": "0525425888"},
{"url": "https://www.goodreads.com/book/show/36035175-republic-s-chosen", "num_ratings": "29", "num_reviews": "18", "avg_ratings": 4.17, "genres": ["Lgbt"], "title": "Republic's Chosen", "description": ["The world had never seen utopias until the Latin Republic was established. Equality, respect, humane treatment – all of those drive the society's philosophy after the Great Disaster. ", "Yet humanity has not learned to leave war behind. When the Republic sends summons to Liana, she knows it’s illegal. Her immigrant status forbids her from fighting in the army, but the country’", "The world had never seen utopias until the Latin Republic was established. Equality, respect, humane treatment – all of those drive the society's philosophy after the Great Disaster. ", "Yet humanity has not learned to leave war behind. When the Republic sends summons to Liana, she knows it’s illegal. Her immigrant status forbids her from fighting in the army, but the country’s leaders want control over her and they won’t stop at anything to get it. ", "Under the pressure of a tough training regime, threatened by a complicated political plot she must quickly untangle, it is no surprise Liana’s marriage begins to crumble. Tossed in a training campus and immediately involved in its intrigue, Liana needs allies quickly, but all she wants to do is crush the system which holds her hostage. With each passing day, it’s becoming harder to reconcile the need to hide her real identity and the desire to protect her immigrant countryfolk from harm. ", "An old friend returns to her life just in time to give her the leverage she needs. There is no chance she’s ever coming back to her peaceful life in hiding. ", "A strong bisexual lead, a secret identity, Special Forces soldiers, true friendship, and a headstrong trauma survivor trying to accept her role in saving the world."], "author": "Rori I.", "num_pages": "649", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1242745.Down_to_the_Bone", "num_ratings": "2,761", "num_reviews": "140", "avg_ratings": 3.97, "genres": ["Young Adult", "Lgbt", "Glbt", "Queer", "Glbt", "Lesbian", "Fiction"], "title": "Down to the Bone", "description": ["What if you don't follow the rules and it radically alters the course of your life?", "What if you get kicked out of the house and lose all your friends and everyone you love? ", "Will you turn the corner into a world filled with unusual friends and create a new kind of family or self-destruct?", "BOOKLIST *STARRED* REVIEW"], "author": "Mayra Lazara Dole", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25414982-out-of-order", "num_ratings": "74", "num_reviews": "34", "avg_ratings": 3.84, "genres": ["Young Adult", "Contemporary", "Lgbt", "Romance", "Glbt", "Queer"], "title": "Out of Order", "description": ["Corinna “Corey” Nguyen’s life seems perfectly average for a closeted bisexual whiz kid with her eyes on college and a budding romance with her friend Kate. Sixteen and navigating senior year with her tight-knit group of best friends through crushes, breakups, and pregnancy scares, Corey mistakenly believes that running for valedictorian and choosing the right college are t", "Corinna “Corey” Nguyen’s life seems perfectly average for a closeted bisexual whiz kid with her eyes on college and a budding romance with her friend Kate. Sixteen and navigating senior year with her tight-knit group of best friends through crushes, breakups, and pregnancy scares, Corey mistakenly believes that running for valedictorian and choosing the right college are the worst of her worries. That is, until prom night, when she’s left alone and in shock, hiding inside a diner restroom, the only witness to a multiple homicide.", "With graduation looming, the pressure is on for Corey to identify the killer and ensure that the crime that has changed her life forever will not go unpunished."], "author": "Casey Lawrence", "num_pages": "180", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-21 00:00:00", "ISBN": "1634760123"},
{"url": "https://www.goodreads.com/book/show/765811.The_Women_of_Brewster_Place", "num_ratings": "16,195", "num_reviews": "543", "avg_ratings": 4.14, "genres": ["Fiction", "Short Stories", "Cultural", "African American", "Classics", "Historical", "Historical Fiction", "Contemporary", "Literature"], "title": "The Women of Brewster Place", "author": "Gloria Naylor", "num_pages": "192", "awards": ["National Book Award for First Novel (1983)"], "places": [], "character_names": [], "language": "English", "publish_date": "1983-06-30 00:00:00", "ISBN": "014006690X"},
{"url": "https://www.goodreads.com/book/show/27969081-labyrinth-lost", "num_ratings": "6,361", "num_reviews": "1,687", "avg_ratings": 3.76, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fantasy", "Paranormal", "Fiction"], "title": "Labyrinth Lost", "description": ["▶ ", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whos", "▶ ", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whose intentions are as dark as the strange marks on his skin.", "The only way to get her family back is to travel with Nova to Los Lagos, a land in-between, as dark as Limbo and as strange as Wonderland..."], "author": "Zoraida Córdova", "num_pages": "324", "awards": [], "places": ["Los Lagos realm, Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2016-09-06 00:00:00", "ISBN": "1492620947"},
{"url": "https://www.goodreads.com/book/show/22750181-honey-girl", "num_ratings": "324", "num_reviews": "90", "avg_ratings": 3.19, "genres": ["Lgbt", "Young Adult", "Historical", "Historical Fiction", "Contemporary", "Glbt", "Queer", "Historical"], "title": "Honey Girl", "description": ["The year is 1972. Fifteen-year-old Haunani “Nani” Grace Nuuhiwa is transplanted from her home in Hawaii to Santa Monica, California after her father’s fatal heart attack. Now the proverbial fish-out-of-water, Nani struggles to adjust to", "The year is 1972. Fifteen-year-old Haunani “Nani” Grace Nuuhiwa is transplanted from her home in Hawaii to Santa Monica, California after her father’s fatal heart attack. Now the proverbial fish-out-of-water, Nani struggles to adjust to her new life with her alcoholic white (", ") mother and the lineup of mean girls who rule State Beach.", "Following “The Rules”—an unspoken list of dos and don’ts—Nani makes contact with Rox, the leader of the lineup. Through a harrowing series of initiations, Nani not only gets accepted into the lineup, she gains the attention of surf god, Nigel McBride. But maintaining stardom is harder than achieving it. Nani is keeping several secrets that, if revealed, could ruin everything she’s worked so hard to achieve. Secret #1: She’s stolen her dad’s ashes and hidden them from her mom. Secret #2: In order to get in with Rox and her crew, she spied on them and now knows far more than they could ever let her get away with. And most deadly of all, Secret #3: She likes girls, and may very well be in love with Rox."], "author": "Lisa  Freeman", "num_pages": "288", "awards": [], "places": ["Santa Monica, California"], "character_names": [], "language": null, "publish_date": "2015-03-17 00:00:00", "ISBN": "1632204258"},
{"url": "https://www.goodreads.com/book/show/1063142.The_Gilda_Stories", "num_ratings": "1,129", "num_reviews": "130", "avg_ratings": 3.96, "genres": ["Fantasy", "Lgbt", "Paranormal", "Vampires", "Historical", "Historical Fiction", "Horror", "Fiction"], "title": "The Gilda Stories", "description": ["The winner of two Lambda Literary Awards (fiction and science fiction) ", " is a very American odyssey. Escaping from slavery in the 1850s Gilda's longing for kinship and community grows over two hundred years. Her induction into a family of benevolent vampires takes her on an adventurous and dangerous journey full of loud laughter and subtle terror."], "author": "Jewelle L. Gómez", "num_pages": "252", "awards": ["Lambda Literary Award for Lesbian Fiction and Lesbian Science Fiction/Fantasy/Horror (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "1991-04-01 00:00:00", "ISBN": "093237994X"},
{"url": "https://www.goodreads.com/book/show/18369509-the-second-mango", "num_ratings": "634", "num_reviews": "151", "avg_ratings": 3.75, "genres": ["Fantasy", "Lgbt", "Glbt", "Queer", "Romance", "Young Adult"], "title": "The Second Mango", "description": ["Queen Shulamit never expected to inherit the throne of the tropical land of Perach so young. At twenty, grief-stricken and fatherless, she's also coping with being the only lesbian she knows after her sweetheart ran off for an unknown reason. Not to mention, she's the victim of severe digestive problems that everybody think she's faking. When she meets Rivka, an athletic a", "Queen Shulamit never expected to inherit the throne of the tropical land of Perach so young. At twenty, grief-stricken and fatherless, she's also coping with being the only lesbian she knows after her sweetheart ran off for an unknown reason. Not to mention, she's the victim of severe digestive problems that everybody think she's faking. When she meets Rivka, an athletic and assertive warrior from the north who wears a mask and pretends to be a man, she finds the source of strength she needs so desperately.", "Unfortunately for her, Rivka is straight, but that's okay -- Shulamit needs a surrogate big sister just as much as she needs a girlfriend. Especially if the warrior's willing to take her around the kingdom on the back of her dragon in search of other women who might be open to same-sex romance. The real world outside the palace is full of adventure, however, and the search for a royal girlfriend quickly turns into a rescue mission when they discover a temple full of women turned to stone by an evil sorcerer."], "author": "Shira Glassman", "num_pages": "165", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "1610405196"},
{"url": "https://www.goodreads.com/book/show/20579291-lies-we-tell-ourselves", "num_ratings": "9,232", "num_reviews": "1,498", "avg_ratings": 4.11, "genres": ["Historical", "Historical Fiction", "Young Adult", "Lgbt", "Historical", "Fiction"], "title": "Lies We Tell Ourselves", "description": ["In 1959 Virginia, the lives of two girls on opposite sides of the battle for civil rights will be changed forever.", "Sarah Dunbar is one of the first black students to attend the previously all-white Jefferson High School. An honors student at her old school, she is put into remedial classes, spit on and tormented daily.", "Linda Hairston is the daughter of one of the town's most", "In 1959 Virginia, the lives of two girls on opposite sides of the battle for civil rights will be changed forever.", "Sarah Dunbar is one of the first black students to attend the previously all-white Jefferson High School. An honors student at her old school, she is put into remedial classes, spit on and tormented daily.", "Linda Hairston is the daughter of one of the town's most vocal opponents of school integration. She has been taught all her life that the races should be kept separate but equal.", "Forced to work together on a school project, Sarah and Linda must confront harsh truths about race, power and how they really feel about one another.", "Boldly realistic and emotionally compelling, Lies We Tell Ourselves is a brave and stunning novel about finding truth amid the lies, and finding your voice even when others are determined to silence it."], "author": "Robin Talley", "num_pages": "368", "awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2016)", "Lambda Literary Award Nominee (2015)", "Goodreads Choice Award Nominee for Young Adult Fiction (2014)", "Carnegie Medal Nominee (2016)"], "places": ["Virginia"], "character_names": [], "language": "English", "publish_date": "2014-09-30 00:00:00", "ISBN": "0373211333"},
{"url": "https://www.goodreads.com/book/show/5931169-santa-olivia", "num_ratings": "7,738", "num_reviews": "798", "avg_ratings": 3.83, "genres": ["Fantasy", "Fantasy", "Urban Fantasy", "Lgbt", "Science Fiction", "Fiction", "Science Fiction", "Dystopia"], "title": "Santa Olivia", "description": ["Lushly written with rich and vivid characters, SANTA OLIVIA is Jacqueline Carey's take on comic book superheroes and the classic werewolf myth.", " Loup Garron was born and raised in Santa Olivia, an isolated, disenfranchised town next to a US military base inside a DMZ buffer zone between Texas and Mexico. A fugitive \"Wolf-Man\" who had a love affair with a local woman, Loup's", "Lushly written with rich and vivid characters, SANTA OLIVIA is Jacqueline Carey's take on comic book superheroes and the classic werewolf myth.", " Loup Garron was born and raised in Santa Olivia, an isolated, disenfranchised town next to a US military base inside a DMZ buffer zone between Texas and Mexico. A fugitive \"Wolf-Man\" who had a love affair with a local woman, Loup's father was one of a group of men genetically-manipulated and used by the US government as a weapon. The \"Wolf-Men\" were engineered to have superhuman strength, speed, sensory capability, stamina, and a total lack of fear, and Loup, named for and sharing her father's wolf-like qualities, is marked as an outsider.", " After her mother dies, Loup goes to live among the misfit orphans at the parish church, where they seethe from the injustices visited upon the locals by the soldiers. Eventually, the orphans find an outlet for their frustrations: They form a vigilante group to support Loup Garron who, costumed as their patron saint, Santa Olivia, uses her special abilities to avenge the town.", " Aware that she could lose her freedom, and possibly her life, Loup is determined to fight to redress the wrongs her community has suffered. And like the reincarnation of their patron saint, she will bring hope to all of Santa Olivia."], "author": "Jacqueline Carey", "num_pages": "341", "awards": [], "places": [], "character_names": ["Loup Garron"], "language": "English", "publish_date": "2009-05-29 00:00:00", "ISBN": "044619817X"},
{"url": "https://www.goodreads.com/book/show/2418888.Skim", "num_ratings": "10,273", "num_reviews": "1,070", "avg_ratings": 3.79, "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Lgbt", "Fiction"], "title": "Skim", "description": ["Heartbreakingly funny, moving and vibrantly drawn, ", " is an extraordinary book--a smart and sensitive graphic novel of the highest literary and artistic quality, by and about young women.", "\"Skim\" is Kimberly Keiko Cameron, a not-slim, would-be Wiccan goth who goes to a private girls' school. When Skim's classmate Katie Matthews is dumped by her boyfriend, who then kills hi", "Heartbreakingly funny, moving and vibrantly drawn, ", " is an extraordinary book--a smart and sensitive graphic novel of the highest literary and artistic quality, by and about young women.", "\"Skim\" is Kimberly Keiko Cameron, a not-slim, would-be Wiccan goth who goes to a private girls' school. When Skim's classmate Katie Matthews is dumped by her boyfriend, who then kills himself, the entire school goes into mourning overdrive. As concerned guidance counselors provide lectures on the \"cycle of grief,\" and the popular clique starts a new club (Girls Celebrate Life!) to bolster school spirit, Skim sinks into an ever-deepening depression. ", "And falling in love only makes things worse...", "Suicide, depression, love, being gay or not, crushes, cliques, and finding a way to be your own fully human self--are all explored in this brilliant collaboration by cousins Mariko and Jillian Tamaki. An edgy, keenly observed and poignant glimpse into the heartache of being young."], "author": "Mariko Tamaki", "num_pages": "143", "awards": ["Ignatz Award for Outstanding Graphic Novel (2008)", "The Inky Awards Nominee for Silver Inky (2009)", "Doug Wright Award for Best Book (2009)", "The Inky Awards Shortlist for Silver Inky (2009)"], "places": ["Toronto, Ontario"], "character_names": ["Kimberly Keiko Cameron, aka \"Skim\"", "Lisa Soor", "Ms. Archer"], "language": "English", "publish_date": "2008-01-01 00:00:00", "ISBN": "0888997531"},
{"url": "https://www.goodreads.com/book/show/6472451-ash", "num_ratings": "27,424", "num_reviews": "3,025", "avg_ratings": 3.62, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Fiction"], "title": "Ash", "description": ["In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she bel", "In the wake of her father's death, Ash is left at the mercy of her cruel stepmother. Consumed with grief, her only joy comes by the light of the dying hearth fire, rereading the fairy tales her mother once told her. In her dreams, someday the fairies will steal her away, as they are said to do. When she meets the dark and dangerous fairy Sidhean, she believes that her wish may be granted.", "The day that Ash meets Kaisa, the King's Huntress, her heart begins to change. Instead of chasing fairies, Ash learns to hunt with Kaisa. Though their friendship is as delicate as a new bloom, it reawakens Ash's capacity for love-and her desire to live. But Sidhean has already claimed Ash for his own, and she must make a choice between fairy tale dreams and true love.", "Entrancing, empowering, and romantic, ", " is about the connection between life and love, and solitude and death, where transformation can come from even the deepest grief."], "author": "Malinda Lo", "num_pages": "264", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (2010)", "Gaylactic Spectrum Award Nominee for Best Novel (2010)", "William C. Morris YA Debut Award Nominee (2010)", "James Tiptree Jr. Award Nominee for Longlist (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Andre Norton Award Nominee (2009)"], "places": [], "character_names": ["Aisling", "Kaisa", "Sidhean"], "language": "English", "publish_date": "2009-09-01 00:00:00", "ISBN": "0316040096"},
{"url": "https://www.goodreads.com/book/show/606095.Coffee_Will_Make_You_Black", "num_ratings": "4,397", "num_reviews": "183", "avg_ratings": 4.04, "genres": ["Fiction", "Cultural", "African American", "Historical", "Historical Fiction", "Lgbt", "Glbt", "Queer", "Young Adult", "Historical"], "title": "Coffee Will Make You Black", "description": ["Set on Chicago's Southside in the mid-to-late 60s, ", " is the moving and entertaining tale of Jean \"Stevie\" Stevenson, a young black woman growing up through the Civil Rights and Black Power movements. The novel opens at a time when, for black families, seeing a black person on television was an event; when expressions like \"I don't want nothing blac", "Set on Chicago's Southside in the mid-to-late 60s, ", " is the moving and entertaining tale of Jean \"Stevie\" Stevenson, a young black woman growing up through the Civil Rights and Black Power movements. The novel opens at a time when, for black families, seeing a black person on television was an event; when expressions like \"I don't want nothing black but a Cadillac\" and \"Coffee will make you black\" were handed down from one generation to the next without comment. Stevie is a bookworm, yet she longs to fit in with the cool crowd. Fighting her mother every step of the way, she begins to experiment with talkin' trash, \"kicking butt,\" and boys. With the assassination of Dr. King she gains a new political awareness, which makes her decide to wear her hair in a 'fro instead of straightened, to refuse to use skin bleach, and to confront the prejudice she observes in blacks as well as whites. April Sinclair writes frankly about a young black woman's sexuality, and about the confusion Stevie faces when she realizes she's more attracted to the school nurse -- who is white -- than her teenage boyfriend. As readers follow Stevie's at times harrowing, at times hilarious story, they will learn what it was like to be black before black was beautiful."], "author": "April Sinclair", "num_pages": "256", "awards": [], "places": ["Chicago, Illinois"], "character_names": [], "language": "English", "publish_date": "2007-01-30 00:00:00", "ISBN": "0380724596"},
{"url": "https://www.goodreads.com/book/show/17302571-if-you-could-be-mine", "num_ratings": "6,680", "num_reviews": "1,021", "avg_ratings": 3.74, "genres": ["Young Adult", "Lgbt", "Romance", "Fiction", "Contemporary", "Glbt", "Queer"], "title": "If You Could Be Mine", "description": ["Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged f", "Seventeen-year-old Sahar has been in love with her best friend, Nasrin, since they were six. They’ve shared stolen kisses and romantic promises. But Iran is a dangerous place for two girls in love—Sahar and Nasrin could be beaten, imprisoned, even executed if their relationship came to light.", "So they carry on in secret—until Nasrin’s parents announce that they’ve arranged for her marriage. Nasrin tries to persuade Sahar that they can go on as they have been, only now with new comforts provided by the decent, well-to-do doctor Nasrin will marry. But Sahar dreams of loving Nasrin exclusively—and openly.", "Then Sahar discovers what seems like the perfect solution. In Iran, homosexuality may be a crime, but to be a man trapped in a woman’s body is seen as nature’s mistake, and sex reassignment is legal and accessible. As a man, Sahar could be the one to marry Nasrin. Sahar will never be able to love the one she wants, in the body she wants to be loved in, without risking her life. Is saving her love worth sacrificing her true self?"], "author": "Sara Farizan", "num_pages": "256", "awards": ["Edmund White Award for Debut Fiction (2014)", "Ferro-Grumley Award for LGBT Fiction (2014)", "Lambda Literary Award for Debut Lesbian Fiction (2014)", "Lincoln Award Nominee (2016)"], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-08-20 00:00:00", "ISBN": "1616202513"},
{"url": "https://www.goodreads.com/book/show/9415946-huntress", "num_ratings": "9,287", "num_reviews": "982", "avg_ratings": 3.78, "genres": ["Fantasy", "Young Adult", "Lgbt", "Romance", "Glbt", "Queer", "Fiction", "Glbt", "Lesbian", "Young Adult", "Young Adult Fantasy", "Adventure", "Fantasy", "Magic"], "title": "Huntress", "description": ["Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, th", "Nature is out of balance in the human world. The sun hasn't shone in years, and crops are failing. Worse yet, strange and hostile creatures have begun to appear. The people's survival hangs in the balance.", "To solve the crisis, the oracle stones are cast, and Kaede and Taisin, two seventeen-year-old girls, are picked to go on a dangerous and unheard-of journey to Tanlili, the city of the Fairy Queen. Taisin is a sage, thrumming with magic, and Kaede is of the earth, without a speck of the otherworldly. And yet the two girls' destinies are drawn together during the mission. As members of their party succumb to unearthly attacks and fairy tricks, the two come to rely on each other and even begin to fall in love. But the Kingdom needs only one huntress to save it, and what it takes could tear Kaede and Taisin apart forever.", "The exciting adventure prequel to Malinda Lo's highly acclaimed novel ", "is overflowing with lush Chinese influences and details inspired by the ", ", and is filled with action and romance."], "author": "Malinda Lo", "num_pages": "371", "awards": ["Gaylactic Spectrum Award Nominee for Best Novel (2012)", "James Tiptree Jr. Award Nominee for Longlist (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-05 00:00:00", "ISBN": "031604007X"},
{"url": "https://www.goodreads.com/book/show/395220.Zami", "num_ratings": "10,752", "num_reviews": "464", "avg_ratings": 4.23, "genres": ["Feminism", "Autobiography", "Memoir", "Nonfiction", "Glbt", "Queer", "Lgbt"], "title": "Zami: A New Spelling of My Name", "description": ["ZAMI is a fast-moving chronicle. From the author's vivid childhood memories in Harlem to her coming of age in the late 1950s, the nature of Audre Lorde's work is cyclical. It especially relates the linkage of women who have shaped her . . . Lorde brings into play her craft of lush description and characterization. It keeps unfolding page after page.", "--"], "author": "Audre Lorde", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1982-01-01 00:00:00", "ISBN": "0895941228"},
{"url": "https://www.goodreads.com/book/show/18428423-the-children-of-gavrilek", "num_ratings": "87", "num_reviews": "19", "avg_ratings": 3.94, "genres": ["Fantasy", "Glbt", "Queer", "Historical", "Historical Fiction", "Lgbt", "Science Fiction", "Did Not Finish"], "title": "The Children of Gavrilek", "description": ["Sailing aboard a storm-thrashed vessel from America to Cuba, a young woman (Audrianna) and her mysterious son (Devon) are shipwrecked and left for dead. They survive thanks to the mystical efforts of a small community located on the coast of 1920s Georgia. While in the care of this unique group and its beautiful and loving leader, Kendis, Audrianna comes to discover the se", "Sailing aboard a storm-thrashed vessel from America to Cuba, a young woman (Audrianna) and her mysterious son (Devon) are shipwrecked and left for dead. They survive thanks to the mystical efforts of a small community located on the coast of 1920s Georgia. While in the care of this unique group and its beautiful and loving leader, Kendis, Audrianna comes to discover the secrets of her son's cognitive powers, his (and Kendis's) otherworldly origins, and an enthralling, Earth-changing \"game\" that threatens the existences of both the alien descendants of Gavrilek and the unsuspecting inhabitants of Earth. The key to the universe's survival lies in the unraveling of Audrianna's conflicted past and desires, as well as in the seemingly motley collection of castoffs that Kendis has nurtured and trained. Invigorated by mesmerizing prose and fervid imagination, The Children of Gavrilek weaves together world history, science fiction, and romance to unleash a powerful story of wrenching emotion and unexpected relevancy for today's age. Its author is at the height of her narrative powers and her creation will keep you captivated from the opening pages until the last sentence."], "author": "Julie Kirton Chandler", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-22 00:00:00", "ISBN": "0985017309"}
]