[
{"url": "https://www.goodreads.com/book/show/18782475-a-day-in-the-life-of-a-muslim-child", "num_ratings": "76", "num_reviews": "4", "avg_ratings": 4.14, "genres": ["Religion", "Islam", "Religion", "Childrens", "Picture Books", "Childrens"], "title": "A Day in the Life of a Muslim Child", "description": ["This beautiful book describes a day in the life of a Muslim Child. From waking up to going to bed at night it goes over all the basic dua's that should be recited in our daily lives. It includes dua's for waking up, leaving/entering the restroom, before/after eating and those needed through out the day."], "author": "Abdul Malik Mujahid", "num_pages": "31", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/469251.If_I_Should_Speak", "num_ratings": "702", "num_reviews": "90", "avg_ratings": 4.13, "genres": ["Religion", "Islam", "Fiction", "Religion", "Novels"], "title": "If I Should Speak", "description": ["Now in its second printing, ", " has changed the face of spiritual writing forever. Months after it was released, it quickly became a bestseller. Used in college classrooms and in book clubs, readers express the profound impact the story has had on their lives."], "author": "Umm Zakiyyah", "num_pages": "198", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-08-16 00:00:00", "ISBN": "097076670X"},
{"url": "https://www.goodreads.com/book/show/17436580-berjalan-di-atas-cahaya", "num_ratings": "1,065", "num_reviews": "123", "avg_ratings": 4.03, "genres": ["Travel", "Nonfiction", "Religion", "Islam", "Asian Literature", "Indonesian Literature", "Inspirational", "Religion", "Adventure", "Romance", "Biography", "Autobiography", "Travel", "Travelogue"], "title": "Berjalan di Atas Cahaya", "description": ["Ivano terduduk. Kepalanya tertunduk di depan pintu gereja. Sudah tak terhitung berapa orang turis di katedral Palermo yang berjubel-jubel harus menabrak tubuhnya yang menghalangi sebagian badan jalan masuk gereja. Tapi Ivano bergeming. Dia masih terus menatap pilar putih di depan katedral kota para mafioso Eropa itu. Semua yang dikatakan Raghi benar adanya.", "Ivano menangis m", "Ivano terduduk. Kepalanya tertunduk di depan pintu gereja. Sudah tak terhitung berapa orang turis di katedral Palermo yang berjubel-jubel harus menabrak tubuhnya yang menghalangi sebagian badan jalan masuk gereja. Tapi Ivano bergeming. Dia masih terus menatap pilar putih di depan katedral kota para mafioso Eropa itu. Semua yang dikatakan Raghi benar adanya.", "Ivano menangis membaca tulisan berwibawa itu. Kali ini sirna sudah kebenciannya atas Sisilia dan Raja Roger. Tiba-tiba ia menyesali semua prasangka buruk tentang nestapa negerinya. Terbaca jelas tulisan yang terukir di pilar katedral Palermo: "], "author": "Hanum Salsabiela Rais", "num_pages": "224", "awards": ["Anugerah Pembaca Indonesia for Penulis dan Buku Non-Fiksi Terfavorit (2013)"], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2013-03-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/5950949-realities-of-submission", "num_ratings": "88", "num_reviews": "12", "avg_ratings": 4.17, "genres": ["Religion", "Islam", "Young Adult", "Realistic Fiction", "Slice Of Life", "Young Adult", "Coming Of Age"], "title": "Realities of Submission", "description": ["In this novel, internationally acclaimed author of If I Should Speak, A Voice, and Footsteps introduces us to the heart, mind, and life of Renee Morris, the narrator of this reflective tale. Told in three parts, Renee's story tells of a stringent childhood in her father's church and her ultimate submission to the religion of her nature in young adulthood. As Renee embraces", "In this novel, internationally acclaimed author of If I Should Speak, A Voice, and Footsteps introduces us to the heart, mind, and life of Renee Morris, the narrator of this reflective tale. Told in three parts, Renee's story tells of a stringent childhood in her father's church and her ultimate submission to the religion of her nature in young adulthood. As Renee embraces Islam wholeheartedly, the spiritual tranquility of her initial conversion begins to wane as she faces the often painful realities of navigating the terrains of the Muslim experience itself. At times humorous and at times painful, the story touches the reader's deepest thoughts and incites the familiar questioning of the human soul."], "author": "Umm Zakiyyah", "num_pages": "344", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-01 00:00:00", "ISBN": "0970766742"},
{"url": "https://www.goodreads.com/book/show/18782550-golden-stories-of-accepted-prayers", "num_ratings": "43", "num_reviews": "1", "avg_ratings": 4.65, "genres": [], "title": "Golden Stories of Accepted Prayers", "description": ["What are invocations? In a real sense these are requests which come from the bottom of our hearts to Allah Almighty. Allah is always ready and happy to receive prayers from anyone at any time. ", "If you're facing any difficulties or trouble you should immediately turn to Allah for help. The best invocations are those narrated by the Prophet (S). If you don't speak Arabic, you", "What are invocations? In a real sense these are requests which come from the bottom of our hearts to Allah Almighty. Allah is always ready and happy to receive prayers from anyone at any time. ", "If you're facing any difficulties or trouble you should immediately turn to Allah for help. The best invocations are those narrated by the Prophet (S). If you don't speak Arabic, you can pray in your mother tongue. ", "When we pray we should feel assured that Allah will accept our requests. We should do so with complete sincerity and devotion. ", "Prayers can be made at any time, but there is a greater possibility our prayers will be accepted if we do so at specific times..."], "author": "Darussalam", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18782459-how-to-make-most-of-ramadan", "num_ratings": "40", "num_reviews": "0", "avg_ratings": 4.68, "genres": ["Religion", "Islam"], "title": "How to make most of Ramadan", "description": ["Narrated Abu Hurairah: Allah's Apostle (pbuh) said, \"When the month of Ramadan starts, the gates of the heaven are opened and the gates of Hell are closed and the devils are chained.\" (Sahih Bukhari - Volume 3, Book 31, Number 123) ", "Narrated Abu Hurairah: Allah's Apostle (pbuh) said: \"Whoever establishes prayers during the nights of Ramadan faithfully out of sincere faith a", "Narrated Abu Hurairah: Allah's Apostle (pbuh) said, \"When the month of Ramadan starts, the gates of the heaven are opened and the gates of Hell are closed and the devils are chained.\" (Sahih Bukhari - Volume 3, Book 31, Number 123) ", "Narrated Abu Hurairah: Allah's Apostle (pbuh) said: \"Whoever establishes prayers during the nights of Ramadan faithfully out of sincere faith and hoping to attain Allah's rewards (not for showing off), all his past sins will be forgiven.\" (Sahih Bukhari - Volume 1, Book 2, Number 36) ", "After completing his bachelor of science with a major in engineering, Sheikh Omar El-Banna began his extensive journey in the gaining of Islamic knowledge. He has memorised the Qur'an along with the principles and rules involved in its recitation and obtained an Ijaza in teaching the Qur'an. For eight years he has devoted his time to the extensive study of Islamic knowledge under prominent scholars in Egypt gaining a wide knowledge base. Sheikh Omar studied at Al-Azhar University in Cairo, Faculty of Shariah, Islamic Jurisprudence. He also studied Islamic Studies at the American Open University in Cairo. Sheikh Omar is currently completing his Masters in Islamic Studies at the University of New England (New South Wales). Having been involved in Dawah for the past 10 years, Sheikh Omar is now concentrating his efforts on Dawah in Australia, working with Muslim youth."], "author": "Darussalam", "num_pages": "36", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18782432-be-steadfast", "num_ratings": "28", "num_reviews": "1", "avg_ratings": 4.46, "genres": ["Religion", "Islam"], "title": "Be Steadfast", "description": ["Everyday we faced the threats that shake us just a bit or rock us from the foundation of our being at other times. Such sections make us wonder whether we can remain steadfast and much on! ", "Narrated Sufyaan Ibn Abdullah (R.A): \" I said to Messenger of Allah, 'Messenger of Allah, tell me something to which i should hold fast. He said: 'Affirm' My Lord is Allah' and then be s", "Everyday we faced the threats that shake us just a bit or rock us from the foundation of our being at other times. Such sections make us wonder whether we can remain steadfast and much on! ", "Narrated Sufyaan Ibn Abdullah (R.A): \" I said to Messenger of Allah, 'Messenger of Allah, tell me something to which i should hold fast. He said: 'Affirm' My Lord is Allah' and then be steadfast'. then I said: 'Messenger of Allah, what is that you are most afraid of in my case? He took hold of his tongue and said: 'of this'. \"(Tirmidhee)\" ", "This book, Insha Allah, gives a concise insight into what it means to be steadfast, the king of sections that necessitate being steadfast and the various ways and means of keeping steadfast in our faith."], "author": "Darussalam", "num_pages": "62", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22374443-bulan-terbelah-di-langit-amerika", "num_ratings": "1,671", "num_reviews": "236", "avg_ratings": 4.21, "genres": ["Novels", "Religion", "Islam", "Asian Literature", "Indonesian Literature", "Fiction", "Religion"], "title": "Bulan Terbelah di Langit Amerika", "description": ["Amerika dan Islam. Sejak 11 September 2001, hubungan keduanya berubah.", "Semua orang berbondong-bondong membenturkan mereka. Mengakibatkan banyak korban berjatuhan; saling curiga, saling tuding, dan menyudutkan banyak pihak.", "Ini adalah kisah perjalanan spiritual di balik malapetaka yang mengguncang kemanusiaan. Kisah yang diminta rembulan kepada Tuhan. Kisah yang disaksikan bu", "Amerika dan Islam. Sejak 11 September 2001, hubungan keduanya berubah.", "Semua orang berbondong-bondong membenturkan mereka. Mengakibatkan banyak korban berjatuhan; saling curiga, saling tuding, dan menyudutkan banyak pihak.", "Ini adalah kisah perjalanan spiritual di balik malapetaka yang mengguncang kemanusiaan. Kisah yang diminta rembulan kepada Tuhan. Kisah yang disaksikan bulan dan dia menginginkan Tuhan membelah dirinya sekali lagi sebagai keajaiban.", "Namun, bulan punya pendirian. Ini untuk terakhir kalinya. Selanjutnya, jika dia bersujud kepada Tuhan agar dibelah lagi, itu bukan untuk keajaiban, melainkan agar dirinya berhenti menyaksikan pertikaian antarmanusia di dunia.", "Kisah petualangan Hanum dan Rangga dalam 99 Cahaya di Langit Eropa berlanjut hingga Amerika. Kini mereka diberi dua misi berbeda. Namun, Tuhan menggariskan mereka untuk menceritakan kisah yang dimohonkan rembulan. Lebih daripada sekadar misi. Tugas mereka kali ini akan menyatukan belahan bulan yang terpisah. Tugas yang menyerukan bahwa tanpa Islam, dunia akan haus kedamaian."], "author": "Hanum Salsabiela Rais", "num_pages": "352", "awards": ["Anugerah Pembaca Indonesia for Buku dan Penulis Fiksi Terfavorit (2014)"], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2014-06-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18715729-i-want-to-eat-my-food", "num_ratings": "24", "num_reviews": "0", "avg_ratings": 4.25, "genres": ["Religion", "Islam"], "title": "I Want to Eat My Food", "description": ["The present book which is written in a straightforward style, teaches younger children some basic 'Islamic manners' and reminds them of Allah's blessings."], "author": "Darussalam", "num_pages": "11", "awards": [], "places": [], "character_names": [], "language": "English"},
{"url": "https://www.goodreads.com/book/show/47870.Emlyn_s_Moon", "num_ratings": "1,457", "num_reviews": "69", "avg_ratings": 3.76, "genres": ["Fantasy", "Childrens", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Emlyn's Moon", "author": "Jenny Nimmo", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-01-01 00:00:00", "ISBN": "043993009X"},
{"url": "https://www.goodreads.com/book/show/2854962-charlie-bone-and-the-shadow", "num_ratings": "14,501", "num_reviews": "288", "avg_ratings": 4.02, "genres": ["Fantasy", "Young Adult", "Fiction", "Childrens"], "title": "Charlie Bone and the Shadow", "author": "Jenny Nimmo", "num_pages": "429", "awards": [], "places": ["Bloor's Academy"], "character_names": [], "language": "English", "publish_date": "2008-09-30 00:00:00", "ISBN": "0439846692"},
{"url": "https://www.goodreads.com/book/show/6554666-charlie-bone-and-the-red-knight", "num_ratings": "7,683", "num_reviews": "321", "avg_ratings": 4.12, "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Childrens"], "title": "Charlie Bone and the Red Knight", "description": ["Dark forces are gathering at Bloor's Academy as the Bloors search for a lost box containing a hidden will- a will that reveals the true destiny of the Red King's heirs. And the Bloors are determined to keep Charlie Bone from finding it first. But Charlie is also facing the lord of the sea, who is trying to drown his parents, and a deadly expert swordsman from another centu", "Dark forces are gathering at Bloor's Academy as the Bloors search for a lost box containing a hidden will- a will that reveals the true destiny of the Red King's heirs. And the Bloors are determined to keep Charlie Bone from finding it first. But Charlie is also facing the lord of the sea, who is trying to drown his parents, and a deadly expert swordsman from another century. The Red Knight might be the only hope. But who is the mysterious Red Kinight? And can he help Charlie and his friends defeat the evil magic for good?"], "author": "Jenny Nimmo", "num_pages": "423", "awards": [], "places": ["Bloor's Academy"], "character_names": [], "language": "English", "publish_date": "2009-09-07 00:00:00", "ISBN": "1405248238"},
{"url": "https://www.goodreads.com/book/show/22467006-sand", "num_ratings": "21", "num_reviews": "13", "avg_ratings": 4.52, "genres": [], "title": "Sand", "description": ["Sand", "Originally published as \"Sandstorm\" in The Riyadh Daily in 1987-8 as a serialized novel, this frightening novel is an eclectic work combining surreal events and naturalistic description. Heavily censored by Saudi officials when it first appeared, it is here published uncensored in its original form for the first time.", "A neo-Gothic novel written in the tradition of the m", "Sand", "Originally published as \"Sandstorm\" in The Riyadh Daily in 1987-8 as a serialized novel, this frightening novel is an eclectic work combining surreal events and naturalistic description. Heavily censored by Saudi officials when it first appeared, it is here published uncensored in its original form for the first time.", "A neo-Gothic novel written in the tradition of the modern Arabesque and psychological Grotesque genres, \"Sand\" is a direct appeal to the reader's ethical judgment.", "A possible threat to the wife of an American oil magnate brings an incognito investigator from the Institute for the Promotion of Virtue and Prevention of Vice to the InterHo hotel. At the Institute, he is secretly involved with a jihadist brotherhood that includes Osama bin Laden. At the same time, “the Author” observes and comments on the story as a character at the hotel. Sand is a snapshot album of Riyadh in the late 1980s."], "author": "Paul  Majkut", "num_pages": "470", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13260207-my-country-tis-of-thee", "num_ratings": "94", "num_reviews": "14", "avg_ratings": 3.79, "genres": ["Autobiography", "Memoir", "Politics", "Religion", "Religion", "Islam", "Nonfiction", "Biography", "Biography", "Autobiography", "Race"], "title": "My Country 'Tis of Thee", "description": [" As a former Catholic who converted to Islam, Keith Ellison, is the first Muslim elected to Congress—from a district with fewer than 1 percent Muslims and 11 percent Blacks. With his unique perspective on uniting a disparate community and speaking to a common g", " As a former Catholic who converted to Islam, Keith Ellison, is the first Muslim elected to Congress—from a district with fewer than 1 percent Muslims and 11 percent Blacks. With his unique perspective on uniting a disparate community and speaking to a common goal, Ellison takes a provocative look at America and what needs to change to accommodate different races and beliefs.", "Filled with anecdotes, statistics, and social commentary, Ellison touches on everything from the Tea Party to Obama, from race to the immigration debate and more. He also draws some very clear distinctions between parties and shows why the deep polarization is unhealthy for America. Deeply patriotic, with ", ", Ellison strives to help define what it means to be an American today."], "author": "Keith Ellison", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/157127.Master_of_the_Jinn", "num_ratings": "304", "num_reviews": "50", "avg_ratings": 3.92, "genres": ["Fiction", "Religion", "Islam", "Novels", "Religion", "Fantasy"], "title": "Master of the Jinn: A Sufi Novel", "description": ["Here is a tale set on the Path of the Heart, a beautifully written mystical adventure wherein a modern-day Sufi Master sends seven companions on a perilous quest for the greatest treasure of the ancient world - King Solomon's ring. The legendary seal ring is said to control the Jinn, those terrifying demons of living fire, and in seeking it the companions discover not only", "Here is a tale set on the Path of the Heart, a beautifully written mystical adventure wherein a modern-day Sufi Master sends seven companions on a perilous quest for the greatest treasure of the ancient world - King Solomon's ring. The legendary seal ring is said to control the Jinn, those terrifying demons of living fire, and in seeking it the companions discover not only the truth of the Jinn, but also the path of Love and the infinite mercy of God."], "author": "Irving Karchmar", "num_pages": "226", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-12-01 00:00:00", "ISBN": "1594577234"},
{"url": "https://www.goodreads.com/book/show/18715719-umar-bin-abdul-aziz", "num_ratings": "41", "num_reviews": "1", "avg_ratings": 4.68, "genres": ["Religion", "Islam", "Biography", "History", "Religion"], "title": "Umar Bin Abdul Aziz", "description": ["This book describes, among other things, the principles based upon which 'Umar ibn Abd Al-Aziz governed the Muslims during his caliphate: among those principles were mutual consultation, justice, equality among people, and honoring of freedoms. ", "With the turn of every page, the reader will come to appreciate the fact that 'Umar was exceptional in his Faith, distinguished in", "This book describes, among other things, the principles based upon which 'Umar ibn Abd Al-Aziz governed the Muslims during his caliphate: among those principles were mutual consultation, justice, equality among people, and honoring of freedoms. ", "With the turn of every page, the reader will come to appreciate the fact that 'Umar was exceptional in his Faith, distinguished in his knowledge, profoundly wise in his thinking, remarkable in his eloquence, noble in his manners and great in the contribution he made to this Nation. ", "English readers have long been deprived of the life story of this outstanding Islamic hero and exemplar. While there are some short and scattered accounts about his general life, this is the first book to deal specifically with 'Umar bin 'Abd al-Aziz's reforms, which is surprising given that he has been attributed the title of Mujaddid (Reformer; Reviver) within Islamic scholarship, in great detail."], "author": "Darussalam", "num_pages": "483", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17925835-fire-clay", "num_ratings": "18", "num_reviews": "6", "avg_ratings": 4.5, "genres": ["Fantasy", "Fiction", "Science Fiction"], "title": "Fire & Clay", "description": ["Banished from her clan for being a Muslim, a 400 year-old jinn named Zamar is hiding from her past. But an ancient evil is about to surface, unearthing her secrets and carrying painful reminders of the life she once lived. Ages ago, Zamar had lived in solitary exile along the banks of the Senegal River. Then a lone man entered her world, altering it forever. Spanning sever", "Banished from her clan for being a Muslim, a 400 year-old jinn named Zamar is hiding from her past. But an ancient evil is about to surface, unearthing her secrets and carrying painful reminders of the life she once lived. Ages ago, Zamar had lived in solitary exile along the banks of the Senegal River. Then a lone man entered her world, altering it forever. Spanning several centuries, book one of Fire & Clay, pulls you into the unseen world of mankind's distant cousins, the jinn. Like humans, these beings were given the gift of free will. And like us there are a few that choose the way of good, some that choose the way of evil, and many that live their lives torn between the two. But what happens when the lives of creatures cast from smokeless fire, and those shaped from the clay of the Earth become intertwined? The story told here takes readers on a journey of mystery, imagination, and magic to search for the answers. It plunges into the depths of jealousy, fear, and greed-as well as violence, sorrow, and loss. But it also scales the heights of love and faith, hope and deliverance. This story may be fictional, but it is true. Its truths are about what it means to be human, what it means to have the power to choose. Fire & Clay is no mere fairytale. What we can see, touch, and taste is only a narrow sliver of reality. There is a war being fought all around us, even within us. And sooner than we might think, our final battle is coming."], "author": "Kaaronica Evans-Ware", "num_pages": "333", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-05-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7138998-cross-border-transfer-pricing-untuk-tujuan-perpajakan", "num_ratings": "12", "num_reviews": "0", "avg_ratings": 4.83, "genres": [], "title": "Cross-Border Transfer Pricing untuk Tujuan Perpajakan", "description": ["Dalam perdagangan yang telah memasuki era globalisasi ini, masalah transfer pricing menjadi sorotan utama dalam dunia perpajakan. Isu transfer pricing yang merupakan isu penting baik bagi Direktorat Jenderal Pajak maupun Wajib Pajak.", "Di tengah langkanya buku perpajakan yang membahas isu transfer pricing, buku ini merupakan buku yang membahas transfer pricing secara tuntas.", "Dalam perdagangan yang telah memasuki era globalisasi ini, masalah transfer pricing menjadi sorotan utama dalam dunia perpajakan. Isu transfer pricing yang merupakan isu penting baik bagi Direktorat Jenderal Pajak maupun Wajib Pajak.", "Di tengah langkanya buku perpajakan yang membahas isu transfer pricing, buku ini merupakan buku yang membahas transfer pricing secara tuntas. Materi yang diberikan dalam buku ini dipaparkan secara detil. Mulai dari definisi-definisi yang terkait dengan transfer pricing dibahas berdasarkan sumber-sumber yang terpercaya disertai dengan beberapa perbandingan dengan negara. Buku ini juga memberikan beberapa studi kasus untuk lebih memberikan pemahaman lebih dalam kepada pembacanya."], "author": "Darussalam", "num_pages": "299", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4930075-a-biographical-dictionary-of-negara-brunei-darussalam-1841-1998", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 5.0, "genres": [], "title": "A Biographical Dictionary of Negara Brunei Darussalam, 1841-1998", "author": "A.V.M. Horton", "num_pages": "2", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1999-01-01 00:00:00", "ISBN": "1900789256"},
{"url": "https://www.goodreads.com/book/show/18783662-the-principle-of-leadership", "num_ratings": "28", "num_reviews": "1", "avg_ratings": 4.46, "genres": [], "title": "The Principle of Leadership", "description": ["Dr. Yusef bin Huzaim is an administrator and economist, Born in 1964 CE, he obtained his Bachelor’s degree in Political Science in 1987 CE, earned a postgraduate diploma in 1992 CE, his Master’s degree in Banking and Finance in 1997 CE and his doctorate in Economics Philsophy in 2004 CE. ", "Dr. Huzaym has held a number of high-level administrative posts in the private sector,", "Dr. Yusef bin Huzaim is an administrator and economist, Born in 1964 CE, he obtained his Bachelor’s degree in Political Science in 1987 CE, earned a postgraduate diploma in 1992 CE, his Master’s degree in Banking and Finance in 1997 CE and his doctorate in Economics Philsophy in 2004 CE. ", "Dr. Huzaym has held a number of high-level administrative posts in the private sector, the most important of which was Director of the Marketing Department, then director of the Training Department in Al Rajhi Banking and Investment Corporation, He has also worked as Vice President, then Regional Director, for the Faisal Islamic Bank, Bahrain, finally, he worked as General Secretary for the Princess al-‘Unood Charitable Institute and head of al-‘Unood Investment Co. He is also a member of the executive Committee of energy Co. (a joint-stock company). ", "Dr. Huzaym has worked as a consultant in a number of specialized fields, such as strategic planning, marketing, sales and real estate investment management, He also played role in establishing a number of charitable organization and restructuring of major companies in the private and public sectors. ", "Dr. Huzaym is Professor Emeritus of Saudi Economics at Yamamah College; Professor of Banking at the Imam Muhammad ibn Sa’ood Islamic University, professional trainer in leadership, Islamic banking, sales and customer service excellence; hi is also a licensed agent of the American DEI company. ", "Dr. Huzaym has written ten books, the most important of which are: ", "Arkaan al-Qiyaadah (Fundamentals of Leadership) ", "Tahawwul al-Masral al-Markazi al-Taqlidi ila Masraf Markazi Islami (Transfer from Traditional Central Banking to Islamic Central Banking) ", "Khamsat ‘Ashar Mabda’li’l-Qiyaadah ‘indaal-Malik ‘Abdal-‘Azeez (Fifteen Principles of Leadership of King ‘Abd al-‘Azeez) ", "Imra’ah Istithna’iyyah Zawjat Malik (An Exceptional Woman: The Wife of A King) ", "Sharh al-Wasaa’il al-Mufeedah li’l-Hayaat al-Sa’eedah (Beneficial Mean of Living A Happy Life)."], "author": "Darussalam", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18493701-strategies-of-prophet-muhammad", "num_ratings": "113", "num_reviews": "3", "avg_ratings": 4.5, "genres": ["Religion", "Islam", "Religion", "Islam", "Muslims", "Poetry"], "title": "Strategies of Prophet Muhammad", "description": ["Muhammad’s (Peace Be Upon Him) life is a rewarding subject for any sophisticated, intelligent and curious mind because of the impact he has had on world history. Not only did he change the world-view of a society, he practically moulded a nation out of a disparate group of warring tribes such that today, after 1400 years, more than 1.6 billion Muslims now live all over the", "Muhammad’s (Peace Be Upon Him) life is a rewarding subject for any sophisticated, intelligent and curious mind because of the impact he has had on world history. Not only did he change the world-view of a society, he practically moulded a nation out of a disparate group of warring tribes such that today, after 1400 years, more than 1.6 billion Muslims now live all over the world and try to follow in his foot-steps in their daily routines. Many demographers calculate that Islam will become’s the world’s largest religion by 2050. This amazing growth trajectory owes a great deal to the strategies pursued by him."], "author": "Omar Khayyám", "num_pages": "556", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/47881.Charlie_Bone_and_the_Hidden_King", "num_ratings": "20,580", "num_reviews": "316", "avg_ratings": 3.99, "genres": ["Fantasy", "Young Adult", "Fiction", "Childrens", "Childrens", "Middle Grade", "Fantasy", "Magic", "Adventure", "Childrens", "Juvenile", "Young Adult", "Young Adult Fantasy", "Mystery"], "title": "Charlie Bone and the Hidden King", "description": ["  Format: Hardcover \n   Publication Date: 5/1/2006 \n   Pages: 464 \n   Reading Level: Age 8 and Up \n "], "author": "Jenny Nimmo", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-01 00:00:00", "ISBN": "0439545307"},
{"url": "https://www.goodreads.com/book/show/106129.Charlie_Bone_and_the_Invisible_Boy", "num_ratings": "20,768", "num_reviews": "403", "avg_ratings": 3.9, "genres": ["Fantasy", "Young Adult", "Childrens", "Fiction"], "title": "Charlie Bone and the Invisible Boy", "description": ["The third book in the Children of the Red King series, CHARLIE BONE AND THE INVISIBLE BOY offers more magical fantasy that is fast paced and easy to read. ", "This semester at Bloor's Academy brings a few changes. There is a new art teacher, Mr. Boldova, and a new student named Belle, who lives with the Yewbeam aunts and seems to have strange power over them. Emma and Charlie", "The third book in the Children of the Red King series, CHARLIE BONE AND THE INVISIBLE BOY offers more magical fantasy that is fast paced and easy to read. ", "This semester at Bloor's Academy brings a few changes. There is a new art teacher, Mr. Boldova, and a new student named Belle, who lives with the Yewbeam aunts and seems to have strange power over them. Emma and Charlie soon discover Mr. Boldova's secret identity: He is the older brother of Ollie Sparks, the boy who lives in the attic of Bloor's Academy. Ollie had always been prying into matters that didn't concern him, so Ezekiel Bloor had made him invisible. When Charlie and his friends find him, Ollie is alone and hungry, so they promise to help him become visible again."], "author": "Jenny Nimmo", "num_pages": "408", "awards": [], "places": ["Bloor's Academy"], "character_names": [], "language": "English", "publish_date": "2004-07-01 00:00:00", "ISBN": "0439545269"},
{"url": "https://www.goodreads.com/book/show/47878.Charlie_Bone_and_the_Beast", "num_ratings": "17,725", "num_reviews": "283", "avg_ratings": 3.93, "genres": ["Fantasy", "Young Adult", "Fiction", "Childrens", "Fantasy", "Magic"], "title": "Charlie Bone and the Beast", "description": ["Things are never simple for Charlie Bone. His parents have been reunited but Charlie can't resist the call of danger when the parents of a kidnapped classmate plead for help. Asa, the missing student, is being held by Manfred in a cave. To free his former enemy and escape capture himself, Charlie must enlist the help of the Flames. An exciting fantasy adventure for boys an", "Things are never simple for Charlie Bone. His parents have been reunited but Charlie can't resist the call of danger when the parents of a kidnapped classmate plead for help. Asa, the missing student, is being held by Manfred in a cave. To free his former enemy and escape capture himself, Charlie must enlist the help of the Flames. An exciting fantasy adventure for boys and girls."], "author": "Jenny Nimmo", "num_pages": "389", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-29 00:00:00", "ISBN": "043984665X"},
{"url": "https://www.goodreads.com/book/show/17125980-black-sheep", "num_ratings": "46", "num_reviews": "13", "avg_ratings": 4.15, "genres": [], "title": "Black Sheep", "description": ["Dwayne, 16, meets high-flying, uni-bound Misha, and sparks fly. To Misha it feels like true love, but her mum is adamant that Dwayne is bad news and forbids her to see him. When Misha decides to follow her heart, the web of secrets and lies begins to tighten. For Dwayne is not quite who he says he is. And as he struggles to turn his life around while hiding his darker side", "Dwayne, 16, meets high-flying, uni-bound Misha, and sparks fly. To Misha it feels like true love, but her mum is adamant that Dwayne is bad news and forbids her to see him. When Misha decides to follow her heart, the web of secrets and lies begins to tighten. For Dwayne is not quite who he says he is. And as he struggles to turn his life around while hiding his darker side from Misha, his ties with Trigger, Jukkie and the rest of his boys draw him deeper and deeper into gang violence, more serious and bloody than any he has ever seen. One night, Dwayne’s two lives collide, with devastating consequences."], "author": "Na'ima B. Robert", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-25 00:00:00", "ISBN": "1847802354"},
{"url": "https://www.goodreads.com/book/show/36371421-the-princess-who-wanted-to-be-poor", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 5.0, "genres": [], "title": "The Princess Who Wanted to be Poor", "description": ["The author of this book is not dead. The book tells the story of a princess who preferred the joys of her horse and nature to silly stuck up princes."], "author": "Juwairiah Simpson", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/13153264-evel-knievel-days", "num_ratings": "244", "num_reviews": "68", "avg_ratings": 3.68, "genres": ["Fiction", "Literary Fiction", "Adult Fiction", "Contemporary"], "title": "Evel Knievel Days", "description": ["   Khosi Saqr has always felt a bit out of place in Butte, Montana, hometown of motorcycle daredevil Evel Knievel.  Half-Egyptian, full of nervous habits, raised by a single mother, owner o", "   Khosi Saqr has always felt a bit out of place in Butte, Montana, hometown of motorcycle daredevil Evel Knievel.  Half-Egyptian, full of nervous habits, raised by a single mother, owner of a name that no one can pronounce -- Khosi has never quite managed to fit in. But when a mysterious stranger arrives in town (and Khosi's longtime love uses Butte's annual festival, Evel Knievel Days, as a time to announce her impending marriage to someone else), Khosi takes his first daredevil like risk, and travels to Egypt to find his father -- and a connection to his heritage. ", "   What he discovers, in Cairo, is much more startling than he'd imagined it could be. The city is a thrilling mix of contradictions -- and locating his father turns out to be the easy part. Through mistaken identity, delicious food, and near tragedy, Khosi and his parents rediscover what it means to be connected to each other, to a family, and to a culture.", "   The timely story of a young man searching for his roots, and along the way finding his identity, ", " is Khosi’s charming and funny journey to learn where he came from, and who he is.", "“A funny, heart-warming, compulsively readable novel about the unbreakable bonds of family — and baklava.”    ", "—Garth Stein, ", " bestselling author of "], "author": "Pauls Toutonghi", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-17 00:00:00", "ISBN": "030738215X"},
{"url": "https://www.goodreads.com/book/show/358846.Death_and_the_Dervish", "num_ratings": "5,789", "num_reviews": "189", "avg_ratings": 4.54, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction"], "title": "Death and the Dervish", "description": [" is an acclaimed novel by Bosnian writer Mesa Selimovic. It recounts the story of Sheikh Nuruddin, a dervish residing in an Islamic monastery in Sarajevo in the eighteenth century during the Ottoman Turk hegemony over the Balkans. When his brother is arrested, he must descend into the Kafkaesque world of the Turkish authorities in his search to discove", " is an acclaimed novel by Bosnian writer Mesa Selimovic. It recounts the story of Sheikh Nuruddin, a dervish residing in an Islamic monastery in Sarajevo in the eighteenth century during the Ottoman Turk hegemony over the Balkans. When his brother is arrested, he must descend into the Kafkaesque world of the Turkish authorities in his search to discover what happened to him. He narrates his story in the form of an elaborate suicide note, regularly misquoting the Koran. In time, he begins to question his relations with society as a whole and, eventually, his life choices in general. Hugely successful when published in the 1960s,", "is an enduring classic from twentieth-century Yugoslavia. "], "author": "Meša Selimović", "num_pages": "473", "awards": ["ANVOY Award (1970)", "NIN Prize (1966)"], "places": ["Sarajevo"], "character_names": ["Ahmed Nuruddin"], "language": "English", "publish_date": "1996-08-14 00:00:00", "ISBN": "0810112973"},
{"url": "https://www.goodreads.com/book/show/653547.The_Princess_Who_Wanted_to_Be_Poor", "num_ratings": "6", "num_reviews": "0", "avg_ratings": 4.83, "genres": [], "title": "The Princess Who Wanted to Be Poor", "description": ["A fascinating story about a young princess who loved God and His creatures, and judged people not by their worldly status, but by their moral character"], "author": "Juwairiah J. Simpson", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1987-06-01 00:00:00", "ISBN": "0892591048"},
{"url": "https://www.goodreads.com/book/show/36184740-seven-is-special", "num_ratings": "6", "num_reviews": "4", "avg_ratings": 4.67, "genres": [], "title": "Seven Is Special", "description": ["\"Assalamu alaykum (Peace be upon you) or Hi!", "My name is Maryam, and as you have probably guessed, I am seven years old. Seven is a special age for Muslims; children start learning to pray regularly at this age, so that includes me, too! There are a lot of things to figure out when learning to pray, like where is the right place to pray? Do you have what it takes to put your", "\"Assalamu alaykum (Peace be upon you) or Hi!", "My name is Maryam, and as you have probably guessed, I am seven years old. Seven is a special age for Muslims; children start learning to pray regularly at this age, so that includes me, too! There are a lot of things to figure out when learning to pray, like where is the right place to pray? Do you have what it takes to put your foot in a sink without falling flat on your back? Now that’s a tricky one! Also what should you pray for, and how do you do it correctly? And why should you pray five times a day? This one takes some figuring out, but it feels great when you know the answer! Read on to discover just how special seven really is!\""], "author": "Shagufta Malik", "num_pages": "128", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/207227.Ambiguous_Adventure", "num_ratings": "714", "num_reviews": "64", "avg_ratings": 3.67, "genres": ["Fiction", "Cultural", "Africa", "Cultural", "France", "Western Africa", "Senegal", "Literature", "African Literature", "Philosophy"], "title": "Ambiguous Adventure", "description": ["This novel is about a Senegalese man's experiences in France."], "author": "Cheikh Hamidou Kane", "num_pages": "186", "awards": ["Grand prix littéraire d'Afrique noire de l'ADELF (1962)"], "places": [], "character_names": [], "language": "English", "publish_date": "1972-01-01 00:00:00", "ISBN": "0435901192"},
{"url": "https://www.goodreads.com/book/show/4318.Monsieur_Ibrahim_and_The_Flowers_of_the_Qur_an", "num_ratings": "8,808", "num_reviews": "583", "avg_ratings": 3.81, "genres": ["Fiction", "Cultural", "France", "Academic", "School", "Contemporary"], "title": "Monsieur Ibrahim and The Flowers of the Qur'an", "description": ["Internationally acclaimed play of cross-cultural friendship", "Paris in the 1960s. Thirteen-year-old Moses lives in the shadow of his less-than loving father. When he's caught stealing from wise old shopkeeper Monsieur Ibrahim, he discovers an unlikely friend and a whole new world. Together they embark on a journey that takes them from the streets of Paris to the whirling derv", "Internationally acclaimed play of cross-cultural friendship", "Paris in the 1960s. Thirteen-year-old Moses lives in the shadow of his less-than loving father. When he's caught stealing from wise old shopkeeper Monsieur Ibrahim, he discovers an unlikely friend and a whole new world. Together they embark on a journey that takes them from the streets of Paris to the whirling dervishes of the Golden Crescent.", "This delightful, moving play has already been a huge hit in Paris and New York. Performed in thirteen countries and published in twelve languages, it is also an award-winning film starring Omar Sharif.", "Monsieur Ibrahim and the Flowers of the Qur'an received its UK premiere at the Bush Theatre on 17 January 2006."], "author": "Éric-Emmanuel Schmitt", "num_pages": "42", "awards": ["Deutscher Bücherpreis for Publikumspreis (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-01-17 00:00:00", "ISBN": "0413775909"},
{"url": "https://www.goodreads.com/book/show/38467211-a-question-of-precedence-and-other-middle-east-stories-by-marmaduke-pick", "num_ratings": "3", "num_reviews": "2", "avg_ratings": 4.33, "genres": [], "title": "A Question of Precedence and Other Middle East Stories by Marmaduke Pickthall", "description": ["Pickthall is a wonderful storyteller. He brings us straight into the narrative, with sharply drawn personalities, dealing with dilemmas to which we can relate. He builds a picture of the physical environment – buildings, flowers, the landscape – that is convincing. His central characters may be rogues and cheats, religious fanatics, bandits or hypocrites, but they are all", "Pickthall is a wonderful storyteller. He brings us straight into the narrative, with sharply drawn personalities, dealing with dilemmas to which we can relate. He builds a picture of the physical environment – buildings, flowers, the landscape – that is convincing. His central characters may be rogues and cheats, religious fanatics, bandits or hypocrites, but they are all drawn as the result of acute observation. We see the world from the perspective of an Egyptian soldier, a Syrian peasant, an Ottoman official.", "His use of language is remarkable. In his Middle East fiction, novels and stories, he uses an archaic English, comprehensible but unfamiliar. It is as if the world he is reproducing is alien, and needs to be clothed in words and phrases that take the reader right away from his or her world.", "The lands in which Pickthall’s stories are set, have since his time, undergone changes that have been violent and unprecedented. Wars, revolutions, displacement and emigration, voluntary and forced, have been the lot of Syrians, Palestinians, Egyptians and Turks since Pickthall’s time. These people are the grandchildren and great-grandchildren of the men and women among whom Pickthall travelled, whom he loved and whose lives he has reconstructed for our enlightenment and delight."], "author": "Marmaduke William Pickthall", "num_pages": "364", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-11-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/30745159-sunshine", "num_ratings": "1", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "Sunshine", "description": ["Shame grips Maryam Jones, a fifteen-year-old Freshman, who is unsure how to deal with a bully ridiculing her Islamic faith. Her father, Mark Jones, is consumed with guilt and grief over the death of his wife. Set in the fictitious, coastal town of Sunshine, Oregon, this is the story of a Muslim family trying to cope with loss, humiliation, and acceptance in the community.", "Shame grips Maryam Jones, a fifteen-year-old Freshman, who is unsure how to deal with a bully ridiculing her Islamic faith. Her father, Mark Jones, is consumed with guilt and grief over the death of his wife. Set in the fictitious, coastal town of Sunshine, Oregon, this is the story of a Muslim family trying to cope with loss, humiliation, and acceptance in the community. ", "Sunshine is the first story in the Islamic fiction series, Ocean Avenue."], "author": "Kelsey Rea", "num_pages": "143", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-06-21 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25634338-the-broken-half", "num_ratings": "23", "num_reviews": "12", "avg_ratings": 4.78, "genres": ["Religion", "Islam", "Drama", "Religion"], "title": "The Broken Half", "description": ["Sahar Abdulaziz’s new Women’s Contemporary Fiction novel, The Broken Half, is the harrowing story of a young American Muslim woman, Zahra, whose marriage has been anything but peaceful. Faced with the difficult and dangerous choice to either stay in her abusive marriage or leave, Zahra soon realizes each step she takes towards freedom is riddled with risky and uncertain re", "Sahar Abdulaziz’s new Women’s Contemporary Fiction novel, The Broken Half, is the harrowing story of a young American Muslim woman, Zahra, whose marriage has been anything but peaceful. Faced with the difficult and dangerous choice to either stay in her abusive marriage or leave, Zahra soon realizes each step she takes towards freedom is riddled with risky and uncertain repercussions. Feeling trapped, alone, and without the support she so desperately needs, Zahra is almost out of options. While the threat of danger continues to escalate around her, will Zahra ultimately choose to fix her broken marriage or will escaping become a life or death decision?"], "author": "Sahar Abdulaziz", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-22 00:00:00", "ISBN": "1620159457"},
{"url": "https://www.goodreads.com/book/show/26143530-israfil-and-the-city-of-islam", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Israfil and the City of Islam: A Sufi Tale of the Conquest of Constantinople", "description": ["In the summer of 1448, the young Israfil is called to take his hereditary place in the cavalry of the Osmanli Sultan Murad II. He is immediately enmeshed in dueling ambitions. On one side: the crusading armies of the West, determined to push the Osmanli from Europe. On the other side: the young Osmanli Prince Mehmed, determined to build a City of Islam on European soil to", "In the summer of 1448, the young Israfil is called to take his hereditary place in the cavalry of the Osmanli Sultan Murad II. He is immediately enmeshed in dueling ambitions. On one side: the crusading armies of the West, determined to push the Osmanli from Europe. On the other side: the young Osmanli Prince Mehmed, determined to build a City of Islam on European soil to rival the great cities of Cairo, Damascus and Baghdad. ", "At the center of these dueling ambitions is the city of Constantinople. Once the center of a great empire, by the 1400s Constantinople had been reduced to being a center of intrigue, plotted assassinations and continuous calls for crusades. The West was determined to keep Constantinople as a thorn in the side of the Osmanli. Prince Mehmed was determined to make Constantinople great again—but this time as a City of Islam; or, in the Turkish language: Islambul. ", "At the passing of Sultan Murad II and the coronation of Prince Mehmed, all knew the inevitable clash of ambitions would come. ", "And like Constantinople, the young Israfil found himself at the center of this clash. ", "From his first battle, a skirmish along the Danube River against the Wallachian Prince Vlad Dracula, to the Conquest of Constantinople in 1453, Israfil is mentored by one of the greatest warriors ever to ride for the House of Osman, Ulubatli Hasan. Through the gloriously gory battles scenes of war and the sublimely picturesque ceremonies of the Whirling Dervishes, Ulubatli Hasan not only protects Israfil, but guides him in the Sufi path of self-discovery."], "author": "M. J. Frost", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/21545359-after-the-storm", "num_ratings": "20", "num_reviews": "5", "avg_ratings": 4.0, "genres": [], "title": "After the Storm", "description": ["Everybody has a past. The question is, what does it taste like to you?", "Tragedy - For years Balqis tries to forget that dark tragedy,with the hope that she'll be able to lead a normal life again. But since then, she’s not the same person anymore. She has changed. Everyone around her realizes that she has changed. If there’s one thing that she loathes the most, it will defini", "Everybody has a past. The question is, what does it taste like to you?", "Tragedy - For years Balqis tries to forget that dark tragedy,with the hope that she'll be able to lead a normal life again. But since then, she’s not the same person anymore. She has changed. Everyone around her realizes that she has changed. If there’s one thing that she loathes the most, it will definitely be “Men”.", "Lost - As a successful magazine editor, Maria leads a happy life with her family. She was over the moon when a dashing CEO of a well-known oil company proposed to her. Alas it turns out that her perfectly built marriage is like a sinking ship. Lost between love and reality, she’s torn between the two.", "Love – After his father died, Suleyman struggles to put his family back back on track. However, it’s not as crystal clear as he thought it would be, until he meets the girl of his dream. Will he risk it all for an arrogant girl or let her go? ", " tells the story of three individuals in a battle to find courage, justice and true love."], "author": "Diyar Harraz", "num_pages": "450", "awards": ["POPULAR-The Star Readers’ Choice Awards Nominee for Fiction (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-05-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513781-description-of-paradise-in-the-glorious-qur-an", "num_ratings": "96", "num_reviews": "2", "avg_ratings": 4.48, "genres": ["Religion", "Islam"], "title": "Description of Paradise in the Glorious Qur'an", "description": ["Writing about Paradise is of great importance in view of its significance in the belief of a Muslim. This belief makes him eligible for enjoyment of the bliss and the happiness of the Hereafter. It is not a belief that is limited to the life of this finite and ephemeral world only as compared to the everlasting Hereafter.", "Rather, it is a great creed that links the life of m", "Writing about Paradise is of great importance in view of its significance in the belief of a Muslim. This belief makes him eligible for enjoyment of the bliss and the happiness of the Hereafter. It is not a belief that is limited to the life of this finite and ephemeral world only as compared to the everlasting Hereafter.", "Rather, it is a great creed that links the life of man in this world to that of the Hereafter so that his vision will not be restricted to this world alone but extends to the Hereafter.", "Belief in Paradise is one of the fundamentals of faith. The Messenger of Allah, blessings and peace of Allah be upon him, was asked about faith and he answered, “Faith is to believe in Allah, in His angels, in His Books, in His Messenger and in the Last Day; and to believe in pre-decree, its good and bad.”"], "author": "Abdul Halim Ibn Muhammad Nassae As-Salafi", "num_pages": "241", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513789-early-days", "num_ratings": "85", "num_reviews": "1", "avg_ratings": 4.36, "genres": ["Religion", "Islam", "History", "Religion"], "title": "Early Days", "description": ["Darussalam is proud to present the abridged English translation of the classic work. The book starts by describing the beginning of creation - from the Throne and the Kursi, the Universe and all that is in it, such as the angels, the Jinn and humans. The book also recounts stories from the lives of the Prophets and their nations, up to the times of the Children of Isra'eel", "Darussalam is proud to present the abridged English translation of the classic work. The book starts by describing the beginning of creation - from the Throne and the Kursi, the Universe and all that is in it, such as the angels, the Jinn and humans. The book also recounts stories from the lives of the Prophets and their nations, up to the times of the Children of Isra'eel and the Days of Ignorance, which ended with the advent of the final Prophet, Muhammad (peace and blessings be upon him).", "Al-Bidayah wan Nihayah (The Beginning and The End) by the renowned scholar Abu Al-Fida, 'Imad ad-Deen Isma'eel bin 'Umar bin Katheer (Ibn Katheer), is considered one of the most authoritative sources on Islamic history. A unique feature of the book is that it not only deals with past events, but also talks about future events mentioned by Prophet Muhammad (peace and blessings be upon him) until the Day of Judgment."], "author": "Ibn Kathir", "num_pages": "332", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513827-fast-according-to-sunna", "num_ratings": "50", "num_reviews": "0", "avg_ratings": 4.6, "genres": ["Religion", "Islam"], "title": "Fast According to Sunna", "description": ["In the terminology of the Shari’ah, the word saūm means to abstain from food, drink and sexual activity from dawn to sunset, with the intention of doing so sincerely and solely for Allah, the Exalted. This is because fasting purifies the soul and cleanses it from the evil that might cause it to become a miser and their ill behavior."], "author": "Muhammad Zulfiqar", "num_pages": "235", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18513814-don-t-become-angry", "num_ratings": "92", "num_reviews": "2", "avg_ratings": 4.47, "genres": ["Religion", "Islam", "Religion"], "title": "Don't Become Angry", "description": ["Much of the flaws that afflict the individual and the community stem from the singular defect of Anger. Allah (Glorified and Exalted is He). and His Messenger (Peace be upon him) have given us instructions regarding the malady and advised us to keep it in check. This work is an extensive discussion on these instructions. We hope that this concise work will aid the one who", "Much of the flaws that afflict the individual and the community stem from the singular defect of Anger. Allah (Glorified and Exalted is He). and His Messenger (Peace be upon him) have given us instructions regarding the malady and advised us to keep it in check. This work is an extensive discussion on these instructions. We hope that this concise work will aid the one who is afflicted with this flaw to find cure in, Insha Allah; while the one who is free of it will find enough incentives to keep his emotions under control."], "author": "Darussalam", "num_pages": "51", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18715732-golden-stories-of-sayida-khadija", "num_ratings": "71", "num_reviews": "4", "avg_ratings": 4.45, "genres": ["Religion", "Islam", "Womens", "Biography"], "title": "Golden Stories of Sayida Khadija (R.A)", "description": ["Khadijah (R.A), the first wife of Muhammad (P.B.U.H), is a shinning example to all Muslim men and Women. Even during pre-Islamic times, she was known as Tahirah- the pure and righteous. ", "This collection of authentic accounts, highlights her intelligence, commitment to religion, sincere belief in God and perseverance under the most difficult of circumstances. it literally tr", "Khadijah (R.A), the first wife of Muhammad (P.B.U.H), is a shinning example to all Muslim men and Women. Even during pre-Islamic times, she was known as Tahirah- the pure and righteous. ", "This collection of authentic accounts, highlights her intelligence, commitment to religion, sincere belief in God and perseverance under the most difficult of circumstances. it literally transports the reader back in time to the very beginning of Islam, providing deep insights into her life and those of her children and grandchildren. ", "this book is a wonderful, well-researched addition to the body of biographical work encompassing the lives of the Prophet (P.B.U.H), his family, companions and followers."], "author": "Abdul Malik Mujahid", "num_pages": "196", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12252878-99-cahaya-di-langit-eropa", "num_ratings": "5,534", "num_reviews": "581", "avg_ratings": 4.21, "genres": ["Novels", "Religion", "Islam", "Travel"], "title": "99 Cahaya di Langit Eropa: Perjalanan Menapak Jejak Islam di Eropa", "description": ["Aku mengucek-ucek mata. Lukisan Bunda Maria dan Bayi Yesus itu terlihat biasa saja. Jika sedikit lagi saja hidungku menyentuh permukaan lukisan, alarm di Museum Louvre akan berdering-dering. Aku menyerah. Aku tidak bisa menemukan apa yang aneh pada lukisan itu. \"Percaya atau tidak, pinggiran hijab Bunda Maria itu bertahtakan kalimat tauhid ", ", Hanum,\" ungk", "Aku mengucek-ucek mata. Lukisan Bunda Maria dan Bayi Yesus itu terlihat biasa saja. Jika sedikit lagi saja hidungku menyentuh permukaan lukisan, alarm di Museum Louvre akan berdering-dering. Aku menyerah. Aku tidak bisa menemukan apa yang aneh pada lukisan itu. \"Percaya atau tidak, pinggiran hijab Bunda Maria itu bertahtakan kalimat tauhid ", ", Hanum,\" ungkap Marion akhirnya.", "***", "Apa yang Anda bayangkan jika mendengar \"Eropa\"? Eiffel? Colosseum? San Siro? Atau Tembok Berlin?", "Bagi saya, Eropa adalah sejuta misteri tentang sebuah peradaban yang sangat luhur, peradaban keyakinan saya, Islam.", "Buku ini bercerita tentang perjalanan sebuah \"pencarian\". Pencarian 99 cahaya kesempurnaan yang pernah dipancarkan Islam di benua ini.", "Dalam perjalanan itu saya bertemu dengan orang-orang yang mengajari saya, apa itu Islam ", ". Perjalanan yang mempertemukan saya dengan para pahlawan Islam pada masa lalu. Perjalanan yang merengkuh dan mendamaikan kalbu dan keberadaan diri saya.", "Pada akhirnya, di buku ini Anda akan menemukan bahwa Eropa tak sekadar Eiffel atau Colosseum. Lebih... sungguh lebih daripada itu."], "author": "Hanum Salsabiela Rais", "num_pages": "424", "awards": [], "places": [], "character_names": [], "language": "Indonesian", "publish_date": "2011-07-16 00:00:00", "ISBN": "9792272741"},
{"url": "https://www.goodreads.com/book/show/18782487-the-quran-and-modern-science", "num_ratings": "565", "num_reviews": "38", "avg_ratings": 4.46, "genres": ["Religion", "Islam", "Religion"], "title": "The Quran and Modern Science", "description": ["Ever since the dawn of human life on this planet, Man has always sought to understand Nature, his own place in the scheme of Creation and the purpose of Life itself. In this quest for Truth, spanning many centuries and diverse civilizations, organized religion has shaped human life and determined to a large extent, the course of history. While some religions have been base", "Ever since the dawn of human life on this planet, Man has always sought to understand Nature, his own place in the scheme of Creation and the purpose of Life itself. In this quest for Truth, spanning many centuries and diverse civilizations, organized religion has shaped human life and determined to a large extent, the course of history. While some religions have been based on books, claimed by their adherents to be divinely inspired, others have relied solely on human experience. ", "Al-Qur'an, the main source of the Islamic faith, is a book believed by Muslims, to be of completely Divine origin. Muslims also believe that it contains Divine guidance for all humankind. Since the message of the Qur'an is believed to be for all times, it should be relevant to every age. Does the Qur'an pass this test? In this booklet, I intend to give an objective analysis of the Muslim belief regarding the Divine origin of the Qur'an, in the light of established scientific discoveries. ", "There was a time, in the history of world civilization, when 'miracles', or what was perceived to be a miracle, took precedence over human reason and logic. But how do we define the term 'miracle'? A miracle is anything that takes place out of the normal course of life and for which humankind has no explanation. However, we must be careful before we accept something as a miracle. An article in `The Times of India', Mumbai, in 1993 reported that 'a saint' by the name 'Baba Pilot' claimed to have stayed continuously submerged under water in a tank for three consecutive days and nights. ", "However, when reporters wanted to examine the base of the tank of water where he claimed to have performed this 'miraculous' feat, he refused to let them do so. He argued by asking as to how one could examine the womb of a mother that gives birth to a child. The `Baba' was hiding something. It as a gimmick simply to gain publicity. ", "Surely, no modern man with even the slightest inkling towards rational thinking would accept such a 'miracle'. If such false miracles are the tests of divinity, then we would have to accept Mr. P.C. Sorcar, the world famous magician known for his ingenious magical tricks and illusions, as the best god-man. ", "A book, claiming Divine origin, is in effect, claiming to be a miracle. Such a claim should be easily verifiable in any age, according to the standards of that age. Muslims believe, that the Qur'an is the last and final revelation of God, the miracle of miracles revealed as a mercy to humankind. This book Quran and Modern Science will investigate the veracity of this belief written by great scholar Dr. Zakir Naik."], "author": "Zakir Naik", "num_pages": "44", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-12-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/227778.Charlie_Bone_and_the_Time_Twister", "num_ratings": "20,713", "num_reviews": "529", "avg_ratings": 3.89, "genres": ["Fantasy", "Young Adult", "Childrens", "Fiction"], "title": "Charlie Bone and the Time Twister", "description": ["Time is running out for Charlie Bone . . . ", "Charlies hopes that the new term at Bloor's Academy will hold no nasty surprises. But then Henry Yewbeam appears, twisted through time from the icy winter of 1916.", "With the scheming Yewbeam aunts on the prowl, and the Bloors out to catch him, Henry will need Charlie's help just to stay alive. Bloor's Academy can be a very dangerous", "Time is running out for Charlie Bone . . . ", "Charlies hopes that the new term at Bloor's Academy will hold no nasty surprises. But then Henry Yewbeam appears, twisted through time from the icy winter of 1916.", "With the scheming Yewbeam aunts on the prowl, and the Bloors out to catch him, Henry will need Charlie's help just to stay alive. Bloor's Academy can be a very dangerous place . . .", "Book Two in The Children of the Red King series!"], "author": "Jenny Nimmo", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-09-09 00:00:00", "ISBN": "0807218987"},
{"url": "https://www.goodreads.com/book/show/18786641-o-my-son", "num_ratings": "30", "num_reviews": "2", "avg_ratings": 4.53, "genres": [], "title": "O My Son", "description": ["One of the duties parents owe their children is to guide them aright by educating them. They should correct their children's errors and most importantly guide them to live a life that is pleasing to Allah and teach them a means of achieving it. Allah points these duties to parents, particularly the fathers, In His book (the Qur'aan) when he gave the example of Luqmaan and", "One of the duties parents owe their children is to guide them aright by educating them. They should correct their children's errors and most importantly guide them to live a life that is pleasing to Allah and teach them a means of achieving it. Allah points these duties to parents, particularly the fathers, In His book (the Qur'aan) when he gave the example of Luqmaan and his son. ", "'And (remember) when Luqmaan said to his while he was advising him: \"O my son! join not in worship others with Allah. Verily! joining others in worship with Allah is a great Zulm (wrong) indeed. \"Luqmaan (31:13). ", "Our success as parents is determined largely by how well we are able to discharge those responsibilities Allah has placed on us regarding out children. this book explains different aspects of the advice of Luqmaan to his son and its significance for a successful life."], "author": "Darussalam", "num_pages": "63", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-11-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19228987-an-exceptional-woman", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 5.0, "genres": ["Religion", "Islam"], "title": "An Exceptional Woman", "description": ["This book is not just a biography; it is also a complete authentic work that speaks of a life that began with good, did good and ended with good, by Allah’s leave. And the goodness is continuing with the efforts of her sons and grandsons, their Royal Highnesses the Princes Muhammad, Saud, Sultan and Khaled and Princess Latifah.", "This book begins with a biography of this nobl", "This book is not just a biography; it is also a complete authentic work that speaks of a life that began with good, did good and ended with good, by Allah’s leave. And the goodness is continuing with the efforts of her sons and grandsons, their Royal Highnesses the Princes Muhammad, Saud, Sultan and Khaled and Princess Latifah.", "This book begins with a biography of this noble character, may Allah forgive her and cause her and her father, His Highness Prince Abd Al-'Aziz bin Musaed, and her paternal aunt, Her Highness Princess al-Jawharah bint Musaed, and her mother, Her Highness Princess Tarfat Al-Battaal to dwell in the vastness of His Paradise.", "The story could not have been told in full without the family of Âl Jalawi and what they embody of courage, pride, unyielding strength, high calibre, modesty and love of country. This book also quotes her will which was written by one of the most prominent modern scholars, His Excellency Shaykh Abd Al-'Aziz bin Abdullah bin Baz (may Allah have mercy on him), on 12/8/1387 AH, in Al-Madinah Al-Munawwarah.", "Then we discuss the contents of the will, followed by a discussion of the foundation that carries her name and its achievements over the last eight years. The book ends with a word for the future and is a guide which any young man or woman may follow; simply put, it is a guide that shows the safe road and safe consequences, by Allah’s Leave."], "author": "Yousef Othman Al Huzaim", "num_pages": "71", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/6659796-the-size-of-a-mustard-seed", "num_ratings": "55", "num_reviews": "11", "avg_ratings": 4.35, "genres": ["Fiction", "Religion", "Islam", "Literature", "Did Not Finish"], "title": "The Size of a Mustard Seed", "description": ["Sullivan ushers in a new era of fiction--urban Islamic fiction--with this tale about Jameelah, a 27-year-old Muslim woman born to what appears to be one of the inner-city's stronger blended American-Muslim families."], "author": "Umm Juwayriyah", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-01 00:00:00", "ISBN": "0976786141"},
{"url": "https://www.goodreads.com/book/show/29930577-the-yard", "num_ratings": "40", "num_reviews": "26", "avg_ratings": 4.18, "genres": ["Fiction"], "title": "The Yard", "description": ["A story of love and redemption, set in Trinidad, that exposes the fault lines in Indo-Muslim culture. Behrooz is brought to a familial complex, The Yard, to live with a devout and extended family, where he struggles to belong. He forms a childish alliance with Maya, a wilful and rebellious girl, and his guardian’s daughter. After they share a night of adolescent tenderness", "A story of love and redemption, set in Trinidad, that exposes the fault lines in Indo-Muslim culture. Behrooz is brought to a familial complex, The Yard, to live with a devout and extended family, where he struggles to belong. He forms a childish alliance with Maya, a wilful and rebellious girl, and his guardian’s daughter. After they share a night of adolescent tenderness, Maya, fearing retribution, flees to London. Behrooz painstakingly rebuilds his life and marries another. When tragedy strikes, Maya returns to her childhood home. There, she and Behrooz must face up to old demons. Can their love endure? Even after Maya is dealt the most “righteous” blow of all?"], "author": "Aliyyah Eniath", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-04-10 00:00:00", "ISBN": "9385755080"},
{"url": "https://www.goodreads.com/book/show/977824.Echoes", "num_ratings": "43", "num_reviews": "11", "avg_ratings": 4.4, "genres": ["Fiction"], "title": "Echoes", "description": ["Joshua Adams has always been a wild child. He graduated from reckless childhood accidents to girls and alcohol. By the time he is twenty-three he has three children and a failing marriage. He leaves his wife, after yet another argument, and moves in with some Muslim guys he knows. With the patient encouragement of his friends, Joshua begins to study Islam. Six months later", "Joshua Adams has always been a wild child. He graduated from reckless childhood accidents to girls and alcohol. By the time he is twenty-three he has three children and a failing marriage. He leaves his wife, after yet another argument, and moves in with some Muslim guys he knows. With the patient encouragement of his friends, Joshua begins to study Islam. Six months later he becomes a Muslim and looks forward to starting a new life. But his fresh start is overshadowed by echoes from his past. First Joshua must conquer the old habits which haunt him after the initial excitement of his conversion has worn off. He must continue his new life as a practicing Muslim while facing difficulties from his past life: a bitter ex-wife, three children whom he abandoned, and strained relationships with his mother and two older brothers. Joshua makes the greatest jihad-the jihad of the self-as he struggles to overcome his past and become a true Muslim. Echoes, the first book in the Echoes Series, is a story of determination and love."], "author": "Jamilah Kolocotronis", "num_pages": "284", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-06-01 00:00:00", "ISBN": "0976786192"},
{"url": "https://www.goodreads.com/book/show/1136625.Isabella_A_Girl_of_Muslim_Spain", "num_ratings": "50", "num_reviews": "6", "avg_ratings": 4.32, "genres": ["Fiction", "Childrens"], "title": "Isabella A Girl of Muslim Spain", "description": ["Isabella. A young girl, Isabella, in Muslim Spain wants to learn more about Islam after hearing two Muslims speaking in a garden. This book is fast paced and a great reading experience. Now, while it is unfortunate that Muslim students do not have the opportunity to read Islamic literature in school, giving Isabella to a teenager at home is a great way to get them to read", "Isabella. A young girl, Isabella, in Muslim Spain wants to learn more about Islam after hearing two Muslims speaking in a garden. This book is fast paced and a great reading experience. Now, while it is unfortunate that Muslim students do not have the opportunity to read Islamic literature in school, giving Isabella to a teenager at home is a great way to get them to read the classics, Islamic classics"], "author": "Yahiya Emerick", "num_pages": "120", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1998-01-28 00:00:00", "ISBN": "1889720070"},
{"url": "https://www.goodreads.com/book/show/17856468-romance-quartet", "num_ratings": "20", "num_reviews": "4", "avg_ratings": 4.2, "genres": ["Fiction", "Cultural", "Pakistan"], "title": "Romance Quartet", "description": ["Balzeeb, the ultimate emblem of beauty and wisdom, is the object of love for two doctors, friends both: Haroon and Latif. While in deep mourning at the death of her third husband, in a Khanaspur cemetery, Balzeeb meets Haroon. Latif and Haroon simultaneously grow closer and apart as they share their pursuit of “The Princess,” as she is known. The spools of mystery surround", "Balzeeb, the ultimate emblem of beauty and wisdom, is the object of love for two doctors, friends both: Haroon and Latif. While in deep mourning at the death of her third husband, in a Khanaspur cemetery, Balzeeb meets Haroon. Latif and Haroon simultaneously grow closer and apart as they share their pursuit of “The Princess,” as she is known. The spools of mystery surrounding Balzeeb are woven majestically around the myth of the serpent, tragically unaware of her true nature.", "Romance Quartet is a weaver's dream, exploring its depths ranging from paranormal to metaphysical and unfolding during the War of Independence which split the continent of Hind into India and Pakistan. Transcending all religions and impaling the heart, this story’s message is eternal, endearing and not one you will soon forget."], "author": "Farzana Moon", "num_pages": "204", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-06-11 00:00:00", "ISBN": "1939897017"},
{"url": "https://www.goodreads.com/book/show/16061802-a-friendship-promise", "num_ratings": "50", "num_reviews": "8", "avg_ratings": 3.56, "genres": ["Spirituality"], "title": "A Friendship Promise", "description": ["Ruby Moore, better known as Umm Zakiyyah, internationally acclaimed author of the ", " trilogy, introduces readers to a new genre in her debut young adult story ", ". Maryam, the main character of this short novel, is the daughter of strict Pakistani-American parents who decide to bend their rules to help a divorced American convert to Islam, w", "Ruby Moore, better known as Umm Zakiyyah, internationally acclaimed author of the ", " trilogy, introduces readers to a new genre in her debut young adult story ", ". Maryam, the main character of this short novel, is the daughter of strict Pakistani-American parents who decide to bend their rules to help a divorced American convert to Islam, whose free-spirited daughter Samira is in need of Muslim friends. Maryam, along with her African-American friend Latifah, tries to find common ground with Samira, but when Samira convinces Maryam to disobey their parents, Maryam is worried they may have gone too far. ", "Though written for young adults, the story is sure to captivate readers of all ages; and, like the inspirational novels for which the author is worldly renowned, the story promises to stay with readers long after the book is closed."], "author": "Ruby Moore", "num_pages": "140", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-16 00:00:00", "ISBN": "0970766718"},
{"url": "https://www.goodreads.com/book/show/7068484-many-voices-one-faith-ii---islamic-fiction-stories", "num_ratings": "11", "num_reviews": "2", "avg_ratings": 4.55, "genres": [], "title": "Many Voices, One Faith II - Islamic Fiction Stories", "description": ["Today's world is indeed a global village. The wonders of technology in communication and travel have cut through the distant miles which used to separate us from one another. Many Voices, One Faith II - Islamic Fiction Stories is a literary example of the small world we are all a part of, showcasing the writing and artistic talents of the Islamic Writers Alliance membershi", "Today's world is indeed a global village. The wonders of technology in communication and travel have cut through the distant miles which used to separate us from one another. Many Voices, One Faith II - Islamic Fiction Stories is a literary example of the small world we are all a part of, showcasing the writing and artistic talents of the Islamic Writers Alliance membership which reach around the globe in their respective residences and origins. From the cover design of one of the beautiful names of Allah, beautiful and original interior illustrations, and the unique story-telling talent of the authors, their original stories combine the diversity and flavor of their backgrounds. You will find almost every region of the world exemplified in these wonderful Islamic fiction stories which skillfully and creatively present the importance of Islam in our daily lives. Many Voices, One Faith II -Islamic Fiction Stories is an enjoyable, entertaining, and enlightening read for non-Muslims as well as Muslims. Many Voices, One Faith II -Islamic Fiction Stories is the ultimate in the variety of selections written by some of the best Islamic Fiction authors in today's fiction book markets."], "author": "Islamic Writers Alliance", "num_pages": "236", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-12 00:00:00", "ISBN": "0981977014"},
{"url": "https://www.goodreads.com/book/show/107824.The_Translator", "num_ratings": "1,350", "num_reviews": "226", "avg_ratings": 3.54, "genres": ["Fiction", "Cultural", "Africa", "Northern Africa", "Sudan", "Romance", "Novels", "Cultural", "Scotland"], "title": "The Translator", "description": ["American readers were introduced to the award-winning Sudanese author Leila Aboulela with ", ", a delicate tale of a privileged young African Muslim woman adjusting to her new life as a maid in London. Now, for the first time in North America, we step back to her extraordinarily assured debut about a widowed Muslim mother living in Aberdeen who falls in love with a Scot", "American readers were introduced to the award-winning Sudanese author Leila Aboulela with ", ", a delicate tale of a privileged young African Muslim woman adjusting to her new life as a maid in London. Now, for the first time in North America, we step back to her extraordinarily assured debut about a widowed Muslim mother living in Aberdeen who falls in love with a Scottish secular academic. Sammar is a Sudanese widow working as an Arabic translator at a Scottish university. Since the sudden death of her husband, her young son has gone to live with family in Khartoum, leaving Sammar alone in cold, gray Aberdeen, grieving and isolated. But when she begins to translate for Rae, a Scottish Islamic scholar, the two develop a deep friendship that awakens in Sammar all the longing for life she has repressed. As Rae and Sammar fall in love, she knows they will have to address his lack of faith in all that Sammar holds sacred. An exquisitely crafted meditation on love, both human and divine, ", " is ultimately the story of one woman’s courage to stay true to her beliefs, herself, and her newfound love."], "author": "Leila Aboulela", "num_pages": "208", "awards": ["Orange Prize Nominee for Fiction Longlist (2000)", "أمريكان بوكر (2000)", "Saltire Society Literary Award Nominee for Scottish First Book of the Year (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-14 00:00:00", "ISBN": "0802170269"},
{"url": "https://www.goodreads.com/book/show/206227.Minaret", "num_ratings": "1,969", "num_reviews": "254", "avg_ratings": 3.52, "genres": ["Fiction", "Northern Africa", "Sudan", "Religion", "Cultural", "Africa", "Religion", "Islam", "Islam", "Muslims", "Novels"], "title": "Minaret", "description": ["Leila Aboulela's American debut is a provocative, timely, and engaging novel about a young Muslim woman -- once privileged and secular in her native land and now impoverished in London -- gradually embracing her orthodox faith. ", "With her Muslim hijab and down-turned gaze, Najwa is invisible to most eyes, especially to the rich families whose houses she cleans in London. Twe", "Leila Aboulela's American debut is a provocative, timely, and engaging novel about a young Muslim woman -- once privileged and secular in her native land and now impoverished in London -- gradually embracing her orthodox faith. ", "With her Muslim hijab and down-turned gaze, Najwa is invisible to most eyes, especially to the rich families whose houses she cleans in London. Twenty years ago, Najwa, then at university in Khartoum, would never have imagined that one day she would be a maid. An upper-class Westernized Sudanese, her dreams were to marry well and raise a family. But a coup forces the young woman and her family into political exile in London. Soon orphaned, she finds solace and companionship within the Muslim community. Then Najwa meets Tamer, the intense, lonely younger brother of her employer. They find a common bond in faith and slowly, silently, begin to fall in love. ", "Written with directness and force, ", " is a lyric and insightful novel about Islam and an alluring glimpse into a culture Westerners are only just beginning to understand."], "author": "Leila Aboulela", "num_pages": "288", "awards": ["Orange Prize Nominee for Fiction Longlist (2006)"], "places": [], "character_names": ["Najwa"], "language": "English", "publish_date": "2005-08-19 00:00:00", "ISBN": "0802170145"},
{"url": "https://www.goodreads.com/book/show/18258203-hard-kill", "num_ratings": "135", "num_reviews": "33", "avg_ratings": 4.24, "genres": [], "title": "Hard Kill", "description": ["Novel Ideas Book of the Year 2013.", "Top Ten in Goodreads Listopia Espionage.", "Number One in Goodreads Listopia Spy Romance.", "London. The city is reeling from a series of deadly attacks by a new radical terrorist group. One man is on the front-line.", "Rizwan Sabir.", "A former al-Qaeda operative, he was lifted by Counter-Terrorism Command - and now battles his old comrades. ", "Terror has a", "Novel Ideas Book of the Year 2013.", "Top Ten in Goodreads Listopia Espionage.", "Number One in Goodreads Listopia Spy Romance.", "London. The city is reeling from a series of deadly attacks by a new radical terrorist group. One man is on the front-line.", "Rizwan Sabir.", "A former al-Qaeda operative, he was lifted by Counter-Terrorism Command - and now battles his old comrades. ", "Terror has a new enemy - and he's taking no prisoners. ", "Working above the law and below government radars, Riz must lead a dangerous double life with the help of Holly \"Bang-Bang\" Kirpachi, a Burlesque dancer and internet hacker with a talent for breaking codes - and bones.", "With time running out, Riz must put his life on the line to identify the terrorists. ", "And silence them forever - before he is silenced himself.", "'Hard Kill' is a tough, realistic thriller that will grip readers from the first page. It is perfect for fans of Andy McNab, Robert Ludlum and Tom Clancy. ", "Hard Kill was originally published as 'Riz'."], "author": "Charlie Flowers", "num_pages": "197", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11351943-hearts-we-lost", "num_ratings": "128", "num_reviews": "17", "avg_ratings": 4.18, "genres": ["Novels"], "title": "Hearts We Lost", "description": ["In this novel that spans the Atlantic, from Saudi Arabia to America, internationally acclaimed author of the If I Should Speak trilogy and the novel Realities of Submission shares with readers a heart-moving tale of faith, betrayal, and affection. Sharif, the main character of this novel, after completing his undergraduate studies in America, is asked by family and friends", "In this novel that spans the Atlantic, from Saudi Arabia to America, internationally acclaimed author of the If I Should Speak trilogy and the novel Realities of Submission shares with readers a heart-moving tale of faith, betrayal, and affection. Sharif, the main character of this novel, after completing his undergraduate studies in America, is asked by family and friends to leave the comfort of the land he has known since childhood to study at a prestigious Islamic university in Riyadh. Haunted by the sudden death of his father who would have wanted this opportunity for his son, Sharif reluctantly agrees to the proposition and to assuming the position as imam over the small suburban Maryland masjid where his father once held the same post. After his six-year study abroad, Sharif returns to America changed in ways he cannot fully comprehend. Now doubting his engagement to his childhood friend, Sharif is confounded by questions of marriage and how he should practice the Islamic faith. As he searches for answers to spiritual perplexities and the deeper affairs of the heart, he finds guidance in a vision he sees while asleep, a vision that is made all the more perplexing when it manifests itself in real life. Navigating the enigmatic world of dreams and the mystery of the human soul, Hearts We Lost is by far the author's most powerful novel to date, and the most unforgettable."], "author": "Umm Zakiyyah", "num_pages": "369", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-04-03 00:00:00", "ISBN": "0970766750"},
{"url": "https://www.goodreads.com/book/show/11532356-duizend-schitterende-zonnen", "num_ratings": "950,043", "num_reviews": "46,564", "avg_ratings": 4.35, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "Duizend schitterende zonnen", "description": ["Tegen de achtergrond van Afghanistan vanaf 1960 tot nu (vooral de roerige tijden van de Sovjet-overheersing en de Taliban-dictatuur) ontrollen zich de levens van twee vrouwen."], "author": "Khaled Hosseini", "num_pages": "396", "awards": ["British Book Award for Best Read of the Year (2008)", "Book Sense Book of the Year Award for Adult Fiction (2008)", "California Book Award for Fiction (Silver) (2007)", "Exclusive Books Boeke Prize Nominee (2007)", "Lincoln Award Nominee (2011)"], "places": ["Afghanistan", "Kabul", "Herat"], "character_names": ["Laila", "Mariam", "Rasheed", "Tariq"], "language": "Dutch", "publish_date": "2010-06-16 00:00:00", "ISBN": "9023463188"},
{"url": "https://www.goodreads.com/book/show/6546668-the-gift", "num_ratings": "10", "num_reviews": "3", "avg_ratings": 3.4, "genres": ["Religion", "Islam"], "title": "The Gift", "description": ["This tender Islamic love story is set in exotic Malaysia. The Gift is a story about a mother's last wish for her son - a new love and a new life. Her efforts open old wounds and unresolved pasts that are overdue for healing. The gift that comes from a mother's heart brings two people's hearts together while their memories of a mother's love lives with them forever."], "author": "Zaipah Ibrahim", "num_pages": "292", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-03-26 00:00:00", "ISBN": "0979357772"},
{"url": "https://www.goodreads.com/book/show/3352999-from-somalia-with-love", "num_ratings": "265", "num_reviews": "39", "avg_ratings": 3.88, "genres": ["Young Adult", "Cultural", "Africa", "Fiction", "Religion", "Islam", "Poetry"], "title": "From Somalia with Love", "description": ["My name is Safia Dirie. My family has always been my mum, Hoyo, and my two older brothers, Ahmed and Abdullahi. I don't really remember Somalia - I'm an East London girl, through and through. But now Abo, my father, is coming from Somalia to live with us, after 12 long years. How am I going to cope? Safia knows that there will be changes ahead but nothing has prepared her", "My name is Safia Dirie. My family has always been my mum, Hoyo, and my two older brothers, Ahmed and Abdullahi. I don't really remember Somalia - I'm an East London girl, through and through. But now Abo, my father, is coming from Somalia to live with us, after 12 long years. How am I going to cope? Safia knows that there will be changes ahead but nothing has prepared her for the reality of dealing with Abo's cultural expectations, her favourite brother Ahmed's wild ways, and the temptation of her cousin Firdous's party-girl lifestyle. Safia must come to terms with who she is - as a Muslim, as a teenager, as a poet, as a friend, but most of all as a daughter to a father she has never known. Safia must find her own place in the world, so both father and daughter can start to build the relationship they both long for. ", " is one girl's quest to discover who she is - a story that, while rooted in Somali and Muslim life, strikes a chord with young people everywhere."], "author": "Na'ima B. Robert", "num_pages": "160", "awards": ["United Kingdom Literacy Association Award Nominee (0)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-01-01 00:00:00", "ISBN": "1845078322"},
{"url": "https://www.goodreads.com/book/show/7713541-the-reluctant-mullah", "num_ratings": "108", "num_reviews": "25", "avg_ratings": 3.48, "genres": ["Cultural", "Pakistan", "Fiction", "Religion", "Islam", "Literature", "English Literature"], "title": "The Reluctant Mullah", "description": ["In a moment of idle curiosity, Musa tries on the modest garb of a Muslim woman to experience for himself what it's like to be veiled. While this cause much mirht among his fellow students at the Madrasah, the elders are not amused, viewing Musa's experimentation as a prank too far.", "Back at home he must conform to family life and face the prospect of an arranged marriage. Cl", "In a moment of idle curiosity, Musa tries on the modest garb of a Muslim woman to experience for himself what it's like to be veiled. While this cause much mirht among his fellow students at the Madrasah, the elders are not amused, viewing Musa's experimentation as a prank too far.", "Back at home he must conform to family life and face the prospect of an arranged marriage. Cleverly, the family patriarch, Dadaji, offers him a deal: a month of days to find himself a bride or else Musa must accept Dadaji's own choice.", "And so the race is on for Musa, a devout Muslim and gentle idealist, who dreams of a perfect companion but despairs of ever finding her. When his siblings and friends step in to help, their efforts lead both to hilarity and outrage but soon the dark side of tradition rears its ugly head..."], "author": "Sagheer Afzal", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-08-16 00:00:00", "ISBN": "190555916X"},
{"url": "https://www.goodreads.com/book/show/6692041-mornings-in-jenin", "num_ratings": "15,487", "num_reviews": "2,681", "avg_ratings": 4.36, "genres": ["Historical", "Historical Fiction", "Fiction", "Novels", "War", "Historical", "Politics", "Cultural", "Israel", "Contemporary", "Cultural", "Asia", "Literature"], "title": "Mornings in Jenin", "description": ["Forcibly removed from the ancient village of Ein Hod by the newly formed state of Israel in 1948, the Abulhejas are moved into the Jenin refugee camp. There, exiled from his beloved olive groves, the family patriarch languishes of a broken heart, his eldest son", "Forcibly removed from the ancient village of Ein Hod by the newly formed state of Israel in 1948, the Abulhejas are moved into the Jenin refugee camp. There, exiled from his beloved olive groves, the family patriarch languishes of a broken heart, his eldest son fathers a family and falls victim to an Israeli bullet, and his grandchildren struggle against tragedy toward freedom, peace, and home. This is the Palestinian story, told as never before, through four generations of a single family. ", "The very precariousness of existence in the camps quickens life itself. Amal, the patriarch's bright granddaughter, feels this with certainty when she discovers the joys of young friendship and first love and especially when she loses her adored father, who read to her daily as a young girl in the quiet of the early dawn. Through Amal we get the stories of her twin brothers, one who is kidnapped by an Israeli soldier and raised Jewish; the other who sacrifices everything for the Palestinian cause. Amal’s own dramatic story threads between the major Palestinian-Israeli clashes of three decades; it is one of love and loss, of childhood, marriage, and parenthood, and finally of the need to share her history with her daughter, to preserve the greatest love she has. ", "Previously published in a hardcover edition with a limited run under the title ", ", this powerful novel is now available in a fully revised, newly titled paperback edition. The deep and moving humanity of ", "forces us to take a fresh look at one of the defining political conflicts of our lifetimes."], "author": "Susan Abulhawa", "num_pages": "352", "awards": [], "places": ["Palestinian Territory, Occupied", "Pennsylvania", "Beirut"], "character_names": ["Yousef, Amal, David/Ismael"], "language": "English", "publish_date": "2010-02-15 00:00:00", "ISBN": "1608190463"},
{"url": "https://www.goodreads.com/book/show/469253.Footsteps", "num_ratings": "146", "num_reviews": "13", "avg_ratings": 4.16, "genres": ["Novels", "Fiction"], "title": "Footsteps", "description": ["The journey began in If I Should Speak with Tamika Douglass's path of spiritual growth and direction, treaded at the hands of her college roommates, Aminah and Dee, two Muslims on opposite ends of their strength in Islam. Footsteps, the third in a trilogy to follow Umm Zakiyyah's A Voice, is a story that stands on its own in both impact and inspiration. At the heart of the", "The journey began in If I Should Speak with Tamika Douglass's path of spiritual growth and direction, treaded at the hands of her college roommates, Aminah and Dee, two Muslims on opposite ends of their strength in Islam. Footsteps, the third in a trilogy to follow Umm Zakiyyah's A Voice, is a story that stands on its own in both impact and inspiration. At the heart of the novel is the story of Ismael, a forty-seven-year-old biracial son of a White mother and Black father, and Sarah, a forty-nine-year-old White daughter of the racist South. Married for twenty-six years and having accepted Islam on a journey they took together, the Ali pair has what every partnership hopes to achieve. Stability, dedication, and a comfortable life. As the story unfolds, the hairline fractures in their marriage become visible, and the fractures become splintering cracks as Sarah discovers a detrimental secret her husband has kept from her for four months. In the face of his wife's discovery, Ismael is torn between the love and security of his marriage, and the natural inclinations any man must temper in a world full of choices, and devastating consequences. Forming the thread that weaves the characters' lives together is Alika Mitchell, a strikingly beautiful daughter of a mulatto mother and half-Nigerian father, who is conducting a multicultural research for her master's, and who inspires in the reader questions that one is left to ponder long after the book is closed."], "author": "Umm Zakiyyah", "num_pages": "318", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-09 00:00:00", "ISBN": "0970766734"},
{"url": "https://www.goodreads.com/book/show/1780680.Cairo", "num_ratings": "1,993", "num_reviews": "296", "avg_ratings": 3.78, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Fantasy", "Fiction", "Graphic Novels Comics"], "title": "Cairo", "description": [" interweaves the fates of a drug runner, a down-on-his-luck journalist, an American expatriate, a troubled young student, and an Israeli soldier as they race through bustling present-", " interweaves the fates of a drug runner, a down-on-his-luck journalist, an American expatriate, a troubled young student, and an Israeli soldier as they race through bustling present-day Cairo to find an artifact of unimaginable power, one protected by a dignified ", " and sought by a wrathful gangster-magician. But the vastness of Africa's legendary City of Victory extends into a spiritual realm—the Undernile—and even darker powers lurk there..."], "author": "G. Willow Wilson", "num_pages": "160", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "2007-11-07 00:00:00", "ISBN": "1401211402"},
{"url": "https://www.goodreads.com/book/show/13239822-alif-the-unseen", "num_ratings": "13,923", "num_reviews": "2,407", "avg_ratings": 3.84, "genres": ["Fantasy", "Fiction", "Science Fiction", "Fantasy", "Urban Fantasy"], "title": "Alif the Unseen", "description": ["In an unnamed Middle Eastern security state, a young Arab-Indian hacker shields his clients—dissidents, outlaws, Islamists, and other watched groups—from surveillance and tries to stay out of trouble. He goes by Alif—the first letter of the Arabic alphabet, and a convenient handle to hide behind. The aristocratic woman Alif loves has jilted him for a prince chosen by her p", "In an unnamed Middle Eastern security state, a young Arab-Indian hacker shields his clients—dissidents, outlaws, Islamists, and other watched groups—from surveillance and tries to stay out of trouble. He goes by Alif—the first letter of the Arabic alphabet, and a convenient handle to hide behind. The aristocratic woman Alif loves has jilted him for a prince chosen by her parents, and his computer has just been breached by the state’s electronic security force, putting his clients and his own neck on the line. Then it turns out his lover’s new fiancé is the \"Hand of God,\" as they call the head of state security, and his henchmen come after Alif, driving him underground. ", "When Alif discovers ", ", the secret book of the jinn, which both he and the Hand suspect may unleash a new level of information technology, the stakes are raised and Alif must struggle for life or death, aided by forces seen and unseen."], "author": "G. Willow Wilson", "num_pages": "433", "awards": ["Locus Award Nominee for Best First Novel (2013)", "World Fantasy Award for Best Novel (2013)", "Hammett Prize Nominee (2012)", "John W. Campbell Memorial Award Nominee (2013)", "Grand Prix de l'Imaginaire Nominee for Roman étranger (2014)", "Women's Prize for Fiction Nominee for Longlist (2013)", "The Center for Fiction First Novel Prize Nominee (2012)"], "places": ["Middle East"], "character_names": ["Dina", "Alif", "Vikram", "Abdullah", "Intisar", "Sheikh Bilal", "Princess Farukhauz", "The convert", "Prince Abu Talib Al Mukhtar ibn Hamza", "Abbas Al Shehab", "The marid"], "language": "English", "publish_date": "2012-06-19 00:00:00", "ISBN": "0802120202"},
{"url": "https://www.goodreads.com/book/show/8959964-boy-vs-girl", "num_ratings": "191", "num_reviews": "36", "avg_ratings": 3.85, "genres": ["Realistic Fiction", "Young Adult", "Fiction"], "title": "Boy vs. Girl", "description": ["Farhana and Faraz are twins, born 6 minutes apart. Both are in turmoil as they approach the holy time of Ramadan. Farhana has to decide whether her faith is strong enough for her to wear the hijab at school and whether she can give up her relationship with handsome Malik. Faraz has fallen in with a street gang headed by unscrupulour Skrooz, when all he really wants is to c", "Farhana and Faraz are twins, born 6 minutes apart. Both are in turmoil as they approach the holy time of Ramadan. Farhana has to decide whether her faith is strong enough for her to wear the hijab at school and whether she can give up her relationship with handsome Malik. Faraz has fallen in with a street gang headed by unscrupulour Skrooz, when all he really wants is to combine his faith and his talent for art. Both teenagers have life-changing choices to make, against the peaceful backdrop of Ramadan. Do Farhana and Faraz have enough courage to do the right thing? And can they help each other - or will one of them draw the other towards catastrophe? When Faraz finally says no to the drug-dealing demands of Skrooz, it sets off a dangerous chain of events. This powerful novel explores ideas of right and wrong, and honour, and what they mean to different generations of Muslim families living in the west."], "author": "Na'ima B. Robert", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "1847801501"},
{"url": "https://www.goodreads.com/book/show/16066887-painted-hands", "num_ratings": "334", "num_reviews": "83", "avg_ratings": 3.96, "genres": ["Fiction", "Religion", "Womens Fiction", "Chick Lit", "Islam", "Muslims", "Romance", "Feminism"], "title": "Painted Hands", "description": ["Muslim bad girl Zainab Mir has just landed a job working for a post-feminist, Republican Senate candidate. Her best friend Amra Abbas is about to make partner at a top Boston law firm. Together they’ve thwarted proposal-slinging aunties, cultural expectations, and the occasional bigot to succeed in their careers. What they didn’t count on? Unlikely men and geopolitical fir", "Muslim bad girl Zainab Mir has just landed a job working for a post-feminist, Republican Senate candidate. Her best friend Amra Abbas is about to make partner at a top Boston law firm. Together they’ve thwarted proposal-slinging aunties, cultural expectations, and the occasional bigot to succeed in their careers. What they didn’t count on? Unlikely men and geopolitical firestorms.", "When a handsome childhood friend reappears, Amra makes choices that Zainab considers so 1950s—choices that involve the perfect ", "silk dress and a four-bedroom house in the suburbs. After hiding her long work hours during their courtship, Amra struggles to balance her demanding job and her unexpectedly traditional new husband.", "Zainab has her own problems. She generates controversy in the Muslim community with a suggestive magazine spread and friendship with a gay reporter. Her rising profile also inflames neocons like Chase Holland, the talk radio host who attacks her religion publicly but privately falls for her hard. When the political fallout from a terrorist attempt jeopardizes Zainab's job and protests surrounding a woman-led Muslim prayer service lead to violence, Amra and Zainab must decide what they’re willing to risk for their principles, their friendship, and love."], "author": "Jennifer Zobair", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-06-11 00:00:00", "ISBN": "1250027012"},
{"url": "https://www.goodreads.com/book/show/469252.A_Voice", "num_ratings": "247", "num_reviews": "26", "avg_ratings": 4.32, "genres": ["Novels", "Religion", "Islam", "Fiction"], "title": "A Voice", "description": ["From the author of the internationally acclaimed novel If I Should Speak comes the anxiously awaited sequel. In this deft second book, Umm Zakiyyah again takes us through the lives of Tamika and those who brush her life. Now Muslim, Tamika must face her Christian mother who instilled in her a love for Christ and made church the heartbeat of the family. Torn between her ded", "From the author of the internationally acclaimed novel If I Should Speak comes the anxiously awaited sequel. In this deft second book, Umm Zakiyyah again takes us through the lives of Tamika and those who brush her life. Now Muslim, Tamika must face her Christian mother who instilled in her a love for Christ and made church the heartbeat of the family. Torn between her dedication to Islam, the longing of her soul, and her mother, the longing of her heart-her \"lifeline,\" Tamika struggles to find peace somewhere in between. But she finds that something must give. A story of faith, determination, and love, A Voice penetrates the heart and moves the reader like no other, as the reader is transported from fiction to a reality so profound that one feels part of it."], "author": "Umm Zakiyyah", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-04-17 00:00:00", "ISBN": "0970766726"}
]