[
{"url": "https://www.goodreads.com/book/show/4268157-perfect-chemistry", "num_ratings": "219,772", "num_reviews": "10,247", "avg_ratings": 4.07, "genres": ["Romance", "Young Adult", "Contemporary", "Romance", "Contemporary Romance"], "title": "Perfect Chemistry", "description": ["When Brittany Ellis walks into chemistry class on the first day of senior year, she has no clue that her carefully created 'perfect' life is about to unravel before her eyes. She's forced to be lab partners with Alex Fuentes, a gang member from the other side of town, and he is about to threaten everything she", "When Brittany Ellis walks into chemistry class on the first day of senior year, she has no clue that her carefully created 'perfect' life is about to unravel before her eyes. She's forced to be lab partners with Alex Fuentes, a gang member from the other side of town, and he is about to threaten everything she's worked so hard for: her flawless reputation, her relationship with her boyfriend, and the secret that her home life is anything but perfect. ", "Alex is a bad boy and he knows it. So when he makes a bet with his friends to lure Brittany into his life, he thinks nothing of it. But soon Alex realizes Brittany is a real person with real problems, and suddenly the bet he made in arrogance turns into something much more."], "author": "Simone Elkeles", "num_pages": "368", "awards": ["RITA Award by Romance Writers of America for Best Young Adult Romance (2010)", "Pennsylvania Young Readers' Choice Award for Young Adults (2011)", "Lincoln Award Nominee (2011)"], "places": ["Chicago, Illinois", "Illinois"], "character_names": ["Alex Fuentes", "Brittany Ellis"], "language": "English", "publish_date": "2008-12-23 00:00:00", "ISBN": "0802798233"},
{"url": "https://www.goodreads.com/book/show/23118840-liliana", "num_ratings": "50", "num_reviews": "8", "avg_ratings": 3.74, "genres": ["Young Adult"], "title": "Liliana", "description": ["Book 1 of the Liliana series", "Boom!", "That deafening sound changed Liliana’s life forever.", "Her mother sits dead besides her, shot to death on the streets of Chicago.", "Within weeks, Liliana is sent to live with a father she doesn’t know in Colombia - a foreign land filled with challenges for Liliana. While working to pay off her father’s debt, she meets the love of her life, who fr", "Book 1 of the Liliana series", "Boom!", "That deafening sound changed Liliana’s life forever.", "Her mother sits dead besides her, shot to death on the streets of Chicago.", "Within weeks, Liliana is sent to live with a father she doesn’t know in Colombia - a foreign land filled with challenges for Liliana. While working to pay off her father’s debt, she meets the love of her life, who frees her from her father’s illusory home, only to bring her into a new world of twisted surprises, dangers, and deceit."], "author": "Neva Squires-Rodriguez", "num_pages": "119", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-18 00:00:00", "ISBN": "1311059164"},
{"url": "https://www.goodreads.com/book/show/17822565-girl-z", "num_ratings": "29", "num_reviews": "12", "avg_ratings": 3.9, "genres": ["Horror", "Zombies", "Horror", "Young Adult", "Science Fiction", "Dystopia"], "title": "Girl Z: My Life As A Teenage Zombie", "description": ["This book is a Young Adult (YA) science fiction Zombie book", "Life can suck when you're sixteen. It can suck even worse when you're not- quite- dead.", "Sixteen-year-old Rebecca Herrera Hayes faces every teenager's biggest nightmares: bad skin, bad hair, and worse . . . turning into one of the living dead.", "Becca's life changes forever when her cousin Spence comes back to their sma", "This book is a Young Adult (YA) science fiction Zombie book", "Life can suck when you're sixteen. It can suck even worse when you're not- quite- dead.", "Sixteen-year-old Rebecca Herrera Hayes faces every teenager's biggest nightmares: bad skin, bad hair, and worse . . . turning into one of the living dead.", "Becca's life changes forever when her cousin Spence comes back to their small Wisconsin town carrying a deadly secret—he's becoming a zombie, a fate he shares with her through an accidental scratch.", "The Z infection, however, has mutated, affecting younger persons like her, or those treated early enough, differently. Now she must cope with weird physical changes and habits no girl wants to be noticed for. Then she meets Gabe, a good-looking part-Z like her, and fears falling for him. After all, how can he, who shows hardly any Z symptoms, be interested in someone like her?", "But time is running out... Becca needs his help as she and her cousin Carm search for their missing mothers and fight off hungry Zs.", "Most of all, she needs to find something, anything, to stop this deadly transformation before it is forever too late.."], "author": "Christine Verstraete", "num_pages": "206", "awards": [], "places": ["Wisconsin"], "character_names": [], "language": "English", "publish_date": "2013-08-01 00:00:00", "ISBN": "0979478898"},
{"url": "https://www.goodreads.com/book/show/421175.Chicana_Falsa", "num_ratings": "359", "num_reviews": "36", "avg_ratings": 4.07, "genres": ["Poetry", "Fiction"], "title": "Chicana Falsa", "description": ["An award-winning Mexican-American poet presents her first collection of poetry and stories of Latina life in America."], "author": "Michele Serros", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-06-01 00:00:00", "ISBN": "1573226858"},
{"url": "https://www.goodreads.com/book/show/10431.Cuba_15", "num_ratings": "1,035", "num_reviews": "150", "avg_ratings": 3.44, "genres": ["Young Adult", "Realistic Fiction", "Young Adult", "Teen", "Cultural", "Fiction", "Childrens", "Middle Grade", "Young Adult", "Coming Of Age", "Humor", "Academic", "School", "Young Adult", "High School"], "title": "Cuba 15", "description": ["Violet Paz has just turned 15, a pivotal birthday in the eyes of her Cuban grandmother. Fifteen is the age when a girl enters womanhood, traditionally celebrating the occasion with a quinceañero. But while Violet is half Cuban, she’s also half Polish, and more importantly, she feels 100% American. Except for her zany family’s passion for playing dominoes, smoking cigars, a", "Violet Paz has just turned 15, a pivotal birthday in the eyes of her Cuban grandmother. Fifteen is the age when a girl enters womanhood, traditionally celebrating the occasion with a quinceañero. But while Violet is half Cuban, she’s also half Polish, and more importantly, she feels 100% American. Except for her zany family’s passion for playing dominoes, smoking cigars, and dancing to Latin music, Violet knows little about Cuban culture, nada about quinces, and only tidbits about the history of Cuba. So when Violet begrudgingly accepts Abuela’s plans for a quinceañero–and as she begins to ask questions about her Cuban roots–cultures and feelings collide. The mere mention of Cuba and Fidel Castro elicits her grandparents’ sadness and her father’s anger. Only Violet’s aunt Luz remains open-minded. With so many divergent views, it’s not easy to know what to believe. All Violet knows is that she’s got to form her own opinions, even if this jolts her family into unwanted confrontations. After all, a quince girl is supposed to embrace responsibility–and to Violet that includes understanding the Cuban heritage that binds her to a homeland she’s never seen. This is Nancy Osa’s first novel."], "author": "Nancy Osa", "num_pages": "304", "awards": ["Pura Belpré Award Nominee for Narrative (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-08 00:00:00", "ISBN": "0385732333"},
{"url": "https://www.goodreads.com/book/show/642709.The_Tequila_Worm", "num_ratings": "1,289", "num_reviews": "242", "avg_ratings": 3.81, "genres": ["Young Adult", "Cultural", "Realistic Fiction", "Fiction", "Family", "Young Adult", "Coming Of Age"], "title": "The Tequila Worm", "description": ["Sofia comes from a family of storytellers. Here are her tales of growing up in the barrio, full of the magic and mystery of family traditions: making Easter ", ", celebrating ", "preparing for ", "rejoicing in the Christmas ", ", and curing homesickness by eating the tequila worm. When Sofia is singled out to receive a scholarship to", "Sofia comes from a family of storytellers. Here are her tales of growing up in the barrio, full of the magic and mystery of family traditions: making Easter ", ", celebrating ", "preparing for ", "rejoicing in the Christmas ", ", and curing homesickness by eating the tequila worm. When Sofia is singled out to receive a scholarship to an elite boarding school, she longs to explore life beyond the barrio, even though it means leaving her family to navigate a strange world of rich, privileged kids. It's a different ", ", but one where Sofia's traditions take on new meaning and illuminate her path."], "author": "Viola Canales", "num_pages": "208", "awards": ["Judy Lopez Memorial Award for Children's Literature Nominee (2006)", "Pura Belpré Award for Narrative (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-13 00:00:00", "ISBN": "0375840893"},
{"url": "https://www.goodreads.com/book/show/2284976.Lady_Q", "num_ratings": "1,356", "num_reviews": "160", "avg_ratings": 4.17, "genres": ["Nonfiction", "Biography", "Autobiography", "Memoir", "Crime", "True Crime"], "title": "Lady Q: The Rise and Fall of a Latin Queen", "description": ["This is a raw and powerful memoir not only of one woman’s struggle to survive the streets but also of her ascent to the top ranks of the new mafia, where the only people more dangerous than rival gangs were members of her own. At age five Sonia Rodriguez’s stepfather began to abuse her; at 10 she was molested by her uncle and beaten by her mother when she told on him; and", "This is a raw and powerful memoir not only of one woman’s struggle to survive the streets but also of her ascent to the top ranks of the new mafia, where the only people more dangerous than rival gangs were members of her own. At age five Sonia Rodriguez’s stepfather began to abuse her; at 10 she was molested by her uncle and beaten by her mother when she told on him; and by 13 her home had become a hangout for the Latin Kings and Queens who were friends with her older sister. Threatened by rival gang members at school, Sonia turned away from her education and extracurricular activities in favor of a world of drugs and violence. The Latin Kings, one of the largest and most notorious street gangs in America, became her refuge, but its violence cost her friends, freedom, self-respect, and nearly her life. As a Latin Queen, she experienced the exhilarating highs and unbelievable lows of gang life. From being shot at by her own gang and kicked out at age 18 with an infant daughter to rejoining the gang and distinguishing herself as a leader, her legacy as Lady Q was cemented both for her willingness to commit violence and for her role as a drug mule. For the first time, a woman’s perspective on gang life is presented."], "author": "Reymundo Sánchez", "num_pages": "288", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2008-07-01 00:00:00", "ISBN": "1556527225"},
{"url": "https://www.goodreads.com/book/show/563483.Sofi_Mendoza_s_Guide_to_Getting_Lost_in_Mexico", "num_ratings": "288", "num_reviews": "66", "avg_ratings": 3.68, "genres": ["Young Adult", "Romance", "Contemporary", "Fiction", "Realistic Fiction", "Travel"], "title": "Sofi Mendoza's Guide to Getting Lost in Mexico", "description": ["\"Do you guys have Internet?..\".\"How about TiVo?..\".\"You do get American TV?\" The house was dark. \"Wait a minute -- do they even have electricity?\"Even though Sofi Mendoza was born in Mexico, she's spent most of her life in California -- the closest she gets to a south-of-the-border experience is eating at Taco Bell. But when Sofi and her friends sneak off for a weekend in", "\"Do you guys have Internet?..\".\"How about TiVo?..\".\"You do get American TV?\" The house was dark. \"Wait a minute -- do they even have electricity?\"Even though Sofi Mendoza was born in Mexico, she's spent most of her life in California -- the closest she gets to a south-of-the-border experience is eating at Taco Bell. But when Sofi and her friends sneak off for a weekend in Tijuana, she gets in real trouble. To Sofi's shock, the border patrol says that her green card is counterfeit. Until her parents can sort out the paperwork and legal issues, Sofi is stuck in Mexico.", "In the meantime, Sofi's parents arrange for her to stay with long-lost relatives in rural Baja. It's bad enough that Sofi has to miss senior prom and even graduation, but her aunt, uncle, and cousins live on a ranch with no indoor plumbing! As the weeks pass, though, she finds herself adapting to her surroundings. Sofi starts helping out on the ranch, getting along with her bratty cousins, and she even meets a guy with more potential than anyone from school. Through the unexpected crash course in her heritage, Sofi comes to appreciate that she has a home on both sides of the border."], "author": "Malin Alegria", "num_pages": "291", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "0689878117"},
{"url": "https://www.goodreads.com/book/show/7383845-beyond-the-gardens", "num_ratings": "20", "num_reviews": "18", "avg_ratings": 3.75, "genres": ["Romance", "Fiction", "New Adult"], "title": "Beyond the Gardens", "description": ["She was a shy artist, who was afraid to blossom into the beautiful flower she was meant to grow into. ", "At the age of 18, Esperanza Ignacio begins her college years at an upscale Los Angeles art school, where she studies to fulfill her long-term dream in Animation. But she soon learns the truth to the old folktale: \"you can take the girl out of the barrio, but you can't take", "She was a shy artist, who was afraid to blossom into the beautiful flower she was meant to grow into. ", "At the age of 18, Esperanza Ignacio begins her college years at an upscale Los Angeles art school, where she studies to fulfill her long-term dream in Animation. But she soon learns the truth to the old folktale: \"you can take the girl out of the barrio, but you can't take the barrio out of the girl.\" Even though she's getting financial aid, Esperanza works a part-time job during her break from classes just to make ends meet. Her roommate, Anna, is what she calls a \"chicana from Beverly Hills\" because of the rich daddy and the new car she got for her quinceaera. ", "Things get a little confusing for Esperanza when an old friend comes ", "looking for her, hoping to start a meaningful relationship. But is Carlos ", "the right guy for her? She never even considered him to be anything more than a friend since high school. Then comes Jake, a gorgeous mechanic, who shares her passion for books and loves her for who she is. What's a girl to do? ", "Strength and determination help pave the way for the future. And, as she approaches her graduation, she is faced with a difficult decision: should she leave Los Angeles and leave behind her family, her home, and everything she's known? Ever since she was born in the California barrio of Hawaiian Gardens, she's always had to look over the fence, wondering what she's been missing. Now she's taking a flying leap over to see what's beyond the little barrio. What's beyond her family, her friends, and her past? What's beyond the little nothing town, where dreams don't exist? What's beyond The Gardens? Is it life, love, a future? The story of Esperanza is finally concluded in this wildly entertaining and heart-warming sequel."], "author": "Sandra C. Lopez", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-27 00:00:00", "ISBN": "1432746987"},
{"url": "https://www.goodreads.com/book/show/17170503-with-love-the-argentina-family", "num_ratings": "63", "num_reviews": "22", "avg_ratings": 4.02, "genres": ["Autobiography", "Memoir", "Literature", "Jewish", "Biography", "Young Adult", "Coming Of Age", "Nonfiction"], "title": "With Love, The Argentina Family: Memories of Tango and Kugel; Mate with Knishes", "description": ["With Love, The Argentina Family ~ Memories of Tango and Kugel; Mate with Knishes is a unique account, enlightening and inspirational with its autobiographical genuineness. The story unfolds in \"die goldene medina\" -America- sharing the insecurities and confusion of a young, immigrant girl. With a mother that never stops crying about The Argentina Family and a father who pr", "With Love, The Argentina Family ~ Memories of Tango and Kugel; Mate with Knishes is a unique account, enlightening and inspirational with its autobiographical genuineness. The story unfolds in \"die goldene medina\" -America- sharing the insecurities and confusion of a young, immigrant girl. With a mother that never stops crying about The Argentina Family and a father who procures employment with an international airline, her life is divided in between her adopted country and her native land. ", "Dramas and \"simchas\" (delights, joys) abound with a long distance, whirlwind relationship unfolding in the aftermath of Argentina's \"Dirty War\", including a frightening interrogation with the Argentine Police and an astonishing encounter at the American Consulate. ", "Follow the sometimes comical, sometimes poignant trials and tribulations of a girl coming to terms with her Jewish heritage, her Argentine traditions and her fierce American patriotism."], "author": "Mirta Ines Trupp", "num_pages": "386", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-16 00:00:00", "ISBN": "1478205458"},
{"url": "https://www.goodreads.com/book/show/34091699-the-victoria-in-my-head", "num_ratings": "209", "num_reviews": "55", "avg_ratings": 3.94, "genres": ["Contemporary", "Young Adult", "Romance", "Music"], "title": "The Victoria in My Head", "description": ["Victoria Cruz inhabits two worlds: In one, she is a rock star, thrashing the stage with her husky voice and purple-streaked hair. In the other, currently serving as her reality, Victoria is a shy teenager with overprotective Cuban parents, who sleepwalks through her life at the prestigious Evanston Academy. Unable to overcome the whole paralyzing-stage-fright thing, Victor", "Victoria Cruz inhabits two worlds: In one, she is a rock star, thrashing the stage with her husky voice and purple-streaked hair. In the other, currently serving as her reality, Victoria is a shy teenager with overprotective Cuban parents, who sleepwalks through her life at the prestigious Evanston Academy. Unable to overcome the whole paralyzing-stage-fright thing, Victoria settles for living inside her fantasies, where nothing can go wrong and everything is set to her expertly crafted music playlists.", "But after a chance encounter with an unattainably gorgeous boy named Strand, whose band seeks a lead singer, Victoria is tempted to turn her fevered daydreams into reality. To do that, she must confront her insecurities and break away from the treadmill that is her life. Suddenly, Victoria is faced with the choice of staying on the path she’s always known and straying off-course to find love, adventure, and danger.", "From debut author Janelle Milanes comes a hilarious and heartfelt tale of the spectacular things that can happen when you go after what you really want."], "author": "Janelle Milanes", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-19 00:00:00", "ISBN": "1481480898"},
{"url": "https://www.goodreads.com/book/show/23390134-the-love-story-that-shouldn-t-have-been", "num_ratings": "73", "num_reviews": "5", "avg_ratings": 3.86, "genres": ["Romance", "Contemporary", "Young Adult", "Fiction", "Mental Health", "Mental Illness", "Health", "Mental Health"], "title": "The Love Story That Shouldn't Have Been", "description": ["In only a few months, comic book artist and local novelty, Dellia Sanchez, had been nicknamed a blood sucking “chupacabra” by her hoodie loving classmate. Of course, she had punched him in the face, and tackled him at the principal’s office. Her objective was to keep everyone at a distance, and up until now, she had done a good job. Her dream for the future entailed a lone", "In only a few months, comic book artist and local novelty, Dellia Sanchez, had been nicknamed a blood sucking “chupacabra” by her hoodie loving classmate. Of course, she had punched him in the face, and tackled him at the principal’s office. Her objective was to keep everyone at a distance, and up until now, she had done a good job. Her dream for the future entailed a lonely life in Antarctica, with a life-sized replica of her superhero Mr. Jalapeno to keep her company. A slow death and excruciating death would follow it, and then she would eventually become victim of a Penguin buffet. This is until she meets the golden-haired football player of her dreams, because every YA heroine needs her stereotypical, misunderstood athlete. So, join our hero on her quest to love…or should I say, join our anti-hero as she runs away from her first true love. Follow the most unlikable, young woman you’ll ever have the displeasure of reading about, and pray that at the end, her total hatred for the whole world won’t have soured your soul. Maybe through her journey of self-discovery, you’ll find that your cold heart has started to beat again."], "author": "Melissa Grijalva", "num_pages": "233", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/22032788-when-reason-breaks", "num_ratings": "864", "num_reviews": "215", "avg_ratings": 3.75, "genres": ["Young Adult", "Contemporary", "Health", "Mental Health", "Mental Health", "Mental Illness", "Fiction", "Realistic Fiction"], "title": "When Reason Breaks", "description": [" meets the poetry of Emily Dickinson in this gripping debut novel perfect for fans of Sara Zarr or Jennifer Brown.", "A Goth girl with an attitude problem, Elizabeth Davis must learn to control her anger before it destroys her. Emily Delgado appears to be a smart, sweet girl, with a normal life, but as depression clutches at her, she struggles to feel normal. Bot", " meets the poetry of Emily Dickinson in this gripping debut novel perfect for fans of Sara Zarr or Jennifer Brown.", "A Goth girl with an attitude problem, Elizabeth Davis must learn to control her anger before it destroys her. Emily Delgado appears to be a smart, sweet girl, with a normal life, but as depression clutches at her, she struggles to feel normal. Both girls are in Ms. Diaz’s English class, where they connect to the words of Emily Dickinson. Both are hovering on the edge of an emotional precipice. One of them will attempt suicide. And with Dickinson’s poetry as their guide, both girls must conquer their personal demons to ever be happy.", "In an emotionally taut novel with a richly diverse cast of characters, readers will relish in the poetry of Emily Dickinson and be completely swept up in the turmoil of two girls grappling with demons beyond their control."], "author": "Cindy L.  Rodriguez", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-10 00:00:00", "ISBN": "1619634120"},
{"url": "https://www.goodreads.com/book/show/24034941-the-kaleidoscope", "num_ratings": "40", "num_reviews": "10", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Philosophy", "Futurism"], "title": "The Kaleidoscope: The Gift of Madness", "description": ["The rise of Alec Helena's most ambitious dream creates an existential shift tainted by an imperfect god. The first generation of life beyond humanity will be riddled with inherit contradictions. Every new life will have its own challenges and strive to find meaning. When androids become the next unwelcome native immigrants, they will be faced with humanity's foreign and do", "The rise of Alec Helena's most ambitious dream creates an existential shift tainted by an imperfect god. The first generation of life beyond humanity will be riddled with inherit contradictions. Every new life will have its own challenges and strive to find meaning. When androids become the next unwelcome native immigrants, they will be faced with humanity's foreign and domestic failures. Can the oppressed forgive their oppressors, or are the scars of such trespasses too deeply ingrained?"], "author": "Adrian Mendoza", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-22 00:00:00", "ISBN": "1505209358"},
{"url": "https://www.goodreads.com/book/show/6234369-we-were-here", "num_ratings": "2,303", "num_reviews": "441", "avg_ratings": 4.1, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Contemporary", "Young Adult", "Teen"], "title": "We Were Here", "description": ["When it happened, Miguel was sent to Juvi. The judge gave him a year in a group home—said he had to write in a journal so some counselor could try to figure out how he thinks. The judge had no idea that he actually did Miguel a favor. Ever since it happened, his mom can’t even look at him in the face. ", "home besides hi", "When it happened, Miguel was sent to Juvi. The judge gave him a year in a group home—said he had to write in a journal so some counselor could try to figure out how he thinks. The judge had no idea that he actually did Miguel a favor. Ever since it happened, his mom can’t even look at him in the face. ", "home besides his would be a better place to live.", "But Miguel didn’t bet on meeting Rondell or Mong or on any of what happened after they broke out. He only thought about Mexico and getting to the border to where he could start over. Forget his mom. Forget his brother. Forget himself.", "Life usually doesn’t work out how you think it will, though. And most of the time, running away is the quickest path right back to what you’re running from."], "author": "Matt de la Pena", "num_pages": "368", "awards": ["Missouri Gateway Readers Award Nominee (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2009-10-13 00:00:00", "ISBN": "0385906226"},
{"url": "https://www.goodreads.com/book/show/2620652-mexican-high", "num_ratings": "334", "num_reviews": "58", "avg_ratings": 3.52, "genres": ["Fiction", "Young Adult"], "title": "Mexican High", "description": ["The daughter of an American diplomat, Mila has spent her childhood moving from country to country. When her mother is reassigned to Mexico City for Mila’s senior year of high school, Mila has no idea what to expect. Mexico seems to be a country with the ultimate freedoms: the wealthy students at her private international school—the sons and daughters of Mexico’s ruling cla", "The daughter of an American diplomat, Mila has spent her childhood moving from country to country. When her mother is reassigned to Mexico City for Mila’s senior year of high school, Mila has no idea what to expect. Mexico seems to be a country with the ultimate freedoms: the wealthy students at her private international school—the sons and daughters of Mexico’s ruling class—party hard at exclusive clubs, dress in expensive clothing, and see more of their housekeepers than they do of their globe-trotting parents. But Mila has more in common with them than they know: her father, whose identity has been kept from her, is a high-ranking politician with whom Mila’s mother had a one-night stand in her hippie days. Now Mila is determined to discover who he is, whatever the cost may be.", " is a coming-of-age story about identity, belonging, and first love. In a setting rife with sex, drugs, and political corruption, it is also a revealing look at elite Mexican society and its freedoms, dangers, and excesses. Monroy’s flawless evocation of the brink of adulthood, in many ways mirrored by the turmoil of Mexico City itself, makes this a truly memorable debut."], "author": "Liza Monroy", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-10 00:00:00", "ISBN": "0385523599"},
{"url": "https://www.goodreads.com/book/show/8621850-the-queen-of-water", "num_ratings": "2,723", "num_reviews": "529", "avg_ratings": 4.11, "genres": ["Young Adult", "Historical", "Historical Fiction", "Fiction", "Realistic Fiction"], "title": "The Queen of Water", "description": ["In this poignant novel based on a true story, Virginia's story will speak to anyone who has ever struggled to find his or her place in the world. It will make you laugh and cry, and ultimately, it will fill you with hope.", "Born in an Andean village in Ecuador, Virginia lives with her large family in a small, earthen-walled dwelling. In her village of indígenas, it is not unc", "In this poignant novel based on a true story, Virginia's story will speak to anyone who has ever struggled to find his or her place in the world. It will make you laugh and cry, and ultimately, it will fill you with hope.", "Born in an Andean village in Ecuador, Virginia lives with her large family in a small, earthen-walled dwelling. In her village of indígenas, it is not uncommon to work in the fields all day, even as a child, or to be called a longa tonta - stupid Indian - by members of the ruling class of mestizos, or Spanish descendants. When seven-year-old Virginia is taken from her village to be a servant to a mestizo couple, she has no idea what the future holds.", "In this poignant novel based on a true story, acclaimed author Laura Resau has collaborated with María Virginia Farinango to recount one girl's unforgettable journey to self-discovery."], "author": "Laura Resau", "num_pages": "368", "awards": ["Colorado Book Award Nominee for Young Adult Literature (Finalist) (2012)", "Américas Award"], "places": ["Ecuador"], "character_names": [], "language": "English", "publish_date": "2011-03-08 00:00:00", "ISBN": "0385738978"},
{"url": "https://www.goodreads.com/book/show/34051730-coco", "num_ratings": "58", "num_reviews": "12", "avg_ratings": 3.88, "genres": ["Fantasy", "Childrens"], "title": "Coco: The Junior Novelization (Disney/Pixar Coco)", "description": [" retells the whole exciting movie and features eight pages of full-color scenes in this paperback novel. Despite his family's baffling generations-old ban on music, Miguel (voice of newcomer Anthony Gonzalez) dreams of becoming an accompli", " retells the whole exciting movie and features eight pages of full-color scenes in this paperback novel. Despite his family's baffling generations-old ban on music, Miguel (voice of newcomer Anthony Gonzalez) dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz (voice of Benjamin Bratt). Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector (voice of Gael Garcia Bernal), and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history. Directed by Lee Unkrich (", "), co-directed by Adrian Molina (story artist ", "), and produced by Darla K. Anderson (", "), Disney/Pixar's ", " opens in U.S. theaters on November 22, 2017."], "author": "Angela Cervantes", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-10-10 00:00:00", "ISBN": "0736438068"},
{"url": "https://www.goodreads.com/book/show/24893361-in-too-deep", "num_ratings": "22", "num_reviews": "2", "avg_ratings": 4.27, "genres": [], "title": "In Too Deep", "description": ["In Too Deep ", "Book 2 of the Liliana series ", "by Neva Squires-Rodriguez ", "Liliana Valencia begins a new chapter of her life. Now the wife of Antonio Valencia, Jr., she learns that there are certain requirements in being a member of the Valencia family– more specifically, Antonio’s wife. ", "Just when Liliana is supposed to be experiencing the happy feelings of a new bride, she finds", "In Too Deep ", "Book 2 of the Liliana series ", "by Neva Squires-Rodriguez ", "Liliana Valencia begins a new chapter of her life. Now the wife of Antonio Valencia, Jr., she learns that there are certain requirements in being a member of the Valencia family– more specifically, Antonio’s wife. ", "Just when Liliana is supposed to be experiencing the happy feelings of a new bride, she finds herself in a very difficult predicament. Her husband isn't the perfect man that she thought he was and she finds herself alone as her life shatters around her. ", "She becomes lost in a world of deceit and she struggles with the knowledge that her life with Antonio will never be the same. ", "With nowhere else to go but up, Liliana finds her hidden strength in a place that she never realized existed. But nothing in the world can prepare her for an unimaginable secret that is bestowed upon her. How will she ever learn to forgive and continue with her life? ", "PRE-RELEASE REVIEW ", "Loving the Liliana Series! ", "reviewed by Shay Norgaard-Melton ", "This review is from a gifted ebook reviewer copy. ", "“I love the way the main characters feel so real, like people one might know as neighbors, friends, and family. Ms. Squires-Rodriguez gives Liliana a voice and personality that simply embraces the reader, involving them into the intertwined drama in In Too Deep.” "], "author": "Neva Squires-Rodriguez", "num_pages": "146", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/654222.Cool_Salsa", "num_ratings": "358", "num_reviews": "56", "avg_ratings": 3.82, "genres": ["Poetry", "Young Adult", "European Literature", "Spanish Literature", "Humanities", "Language"], "title": "Cool Salsa: Bilingual Poems on Growing Up Latino in the United States", "description": ["\"Poetry with a distinct flavor: a skillfully mixed appetizer.\"", "--Kirkus Reviews (starred)", "Here are the sights, sounds, and smells of Latino culture in America in thirty-six vibrant, moving, angry, beautiful and varied voices, including Alicia Gaspar de Alba, Ana Castillo, Sandra Cisneros, Luis J. Rodríguez, Gary Soto, and Martín Espada.", "Presented in both English and Spanish,", "\"Poetry with a distinct flavor: a skillfully mixed appetizer.\"", "--Kirkus Reviews (starred)", "Here are the sights, sounds, and smells of Latino culture in America in thirty-six vibrant, moving, angry, beautiful and varied voices, including Alicia Gaspar de Alba, Ana Castillo, Sandra Cisneros, Luis J. Rodríguez, Gary Soto, and Martín Espada.", "Presented in both English and Spanish, each poem helps us to discover the stories behind the mangoes and memories, prejudice and fear, love and life--how it was and is to grow up Hispanic in America....", "\"The subtle but singing lyrics frequently have a colloquial tone that will speak to many young readers.\"", "--The Bulletin of the Center for Children's Books (starred)", "\"Excellent enrichment...Whether discussing the immigrant's frustration at not being able to speak English...the familiar adolescent desire to belong, or celebrating the simple joys of life, these fine poems are incisive and photographic in their depiction of a moment.\"", "--School Library Journal (starred)"], "author": "Lori Marie Carlson", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-04-01 00:00:00", "ISBN": "044970436X"},
{"url": "https://www.goodreads.com/book/show/13377.The_House_of_the_Scorpion", "num_ratings": "69,395", "num_reviews": "5,808", "avg_ratings": 4.1, "genres": ["Young Adult", "Science Fiction", "Science Fiction", "Dystopia", "Fiction"], "title": "The House of the Scorpion", "description": ["At his coming-of-age party, Matteo Alacrán asks El Patrón's bodyguard, \"How old am I? ... I know I don't have a birthday like humans, but I was born.\" ", "\"You were harvested,\" Tam Lin reminds him. \"You were grown in that poor cow for nine months and then you were cut out of her.\" ", "To most people around him, Matt is not a boy, but a beast. But for El Patrón, lord of a country c", "At his coming-of-age party, Matteo Alacrán asks El Patrón's bodyguard, \"How old am I? ... I know I don't have a birthday like humans, but I was born.\" ", "\"You were harvested,\" Tam Lin reminds him. \"You were grown in that poor cow for nine months and then you were cut out of her.\" ", "To most people around him, Matt is not a boy, but a beast. But for El Patrón, lord of a country called Opium--a strip of poppy field lying between the U.S. and what was once called Mexico--Matt is a guarantee of eternal life. El Patrón loves Matt as he loves himself, for Matt is himself. They share identical DNA. ", "As Matt struggles to understand his existence, he is threatened by a sinister, grasping cast of characters, including El Patrón's power-hungry family. He is surrounded by a dangerous army of bodyguards and by the mindless slaves of Opium, brain-deadened 'eejits' who toil in the poppy fields. ", "Escape from the Alacrán Estate is no guarantee of freedom because Matt is marked by his difference in ways he doesn't even suspect. Around every turn in this vivid, futuristic adventure is a new, heart-stopping surprise."], "author": "Nancy Farmer", "num_pages": "380", "awards": ["Newbery Medal Nominee (2003)", "National Book Award for Young People's Literature (2002)", "Mythopoeic Fantasy Award Nominee for Children's Literature (2003)", "Buxtehuder Bulle (2003)", "Michael L. Printz Award Nominee (2003)", "South Carolina Book Award for Junior Book Award (2006)", "Grand Canyon Reader Award for Teen Book (2005)", "Dorothy Canfield Fisher Children's Book Award Nominee (2004)", "Pacific Northwest Library Association Young Reader's Choice Award for Senior (2005)", "Michigan Library Association Thumbs Up! Award Nominee (2003)", "Lincoln Award Nominee (2008)", "Missouri Gateway Readers Award Nominee (2005)", "Oklahoma Sequoyah Award for YA (2005)"], "places": [], "character_names": ["El Patron", "Tam Lin", "Maria Mendoza", "Chacho", "Fidelito", "Ton-Ton"], "language": "English", "publish_date": "2002-08-16 00:00:00", "ISBN": "0439579295"},
{"url": "https://www.goodreads.com/book/show/17277833-cable-x-force-classic-volume-1", "num_ratings": "35", "num_reviews": "6", "avg_ratings": 3.46, "genres": ["Sequential Art", "Comics", "Superheroes", "Marvel", "Marvel", "X Men"], "title": "Cable & X-Force Classic, Volume 1", "description": ["Cable and X-Force are united under the pen of blockbuster writer Jeph Loeb! A new era begins as Cable revamps his mutant strike team and relocates to the X-Mansion - where Cannonball \"graduates\" to the X-Men, and Boomer gets unhealthily attached to the murderous prisoner named Sabretooth! But when Cable's wife Aliya returns from the future with a dire warning, he'll be swe", "Cable and X-Force are united under the pen of blockbuster writer Jeph Loeb! A new era begins as Cable revamps his mutant strike team and relocates to the X-Mansion - where Cannonball \"graduates\" to the X-Men, and Boomer gets unhealthily attached to the murderous prisoner named Sabretooth! But when Cable's wife Aliya returns from the future with a dire warning, he'll be swept up in a time-traveling battle to save his younger self from his arch-nemesis Stryfe! Plus: Cable's mentor Blaquesmith debuts, Caliban and the Mimic return, Grizzly goes bad, and Deadpool helps Siryn escape from...a mental hospital? ", ": Cable (1993) 21-28, X-Force (1991) 44-48"], "author": "Jeph Loeb", "num_pages": "344", "awards": [], "places": [], "character_names": ["Caliban", "Nathan Christopher Charles Summers", "Neena Thurman", "Samuel \"Sam\" Guthrie", "Jenskot"], "language": "English", "publish_date": "2013-06-04 00:00:00", "ISBN": "0785184325"},
{"url": "https://www.goodreads.com/book/show/25223115-just-visiting", "num_ratings": "636", "num_reviews": "171", "avg_ratings": 3.78, "genres": ["Contemporary", "Young Adult", "Romance", "New Adult"], "title": "Just Visiting", "description": ["Reagan Forrester wants out—out of her trailer park, out of reach of her freeloading mother, and out of the shadow of the relationship that made her the pariah of Charytan, Kansas. ", "Victoria Reyes wants in—in to a fashion design program, in to the arms of a cute guy who doesn’t go to Charytan High, and in to a city where she won’t stand out for being Mexican. ", "One thing the p", "Reagan Forrester wants out—out of her trailer park, out of reach of her freeloading mother, and out of the shadow of the relationship that made her the pariah of Charytan, Kansas. ", "Victoria Reyes wants in—in to a fashion design program, in to the arms of a cute guy who doesn’t go to Charytan High, and in to a city where she won’t stand out for being Mexican. ", "One thing the polar-opposite best friends do agree on is that wherever they go, they’re staying together. But when they set off on a series of college visits at the start of their senior year, they quickly see that the future doesn’t look quite like they expected. After two years of near-solitude following the betrayal of the ex-boyfriend who broke her heart, Reagan falls hard and fast for a ", "-loving, brilliant smile-sporting pre-med prospective…only to learn she’s set herself up for heartbreak all over again. Meanwhile, Victoria runs full-speed toward all the things she thinks she wants…only to realize everything she’s looking for might be in the very place they’ve sworn to leave. ", "As both Reagan and Victoria struggle to learn who they are and what they want in the present, they discover just how much they don’t know about each other’s pasts. And when each learns what the other’s been hiding, they’ll have to decide whether their friendship has a future."], "author": "Dahlia Adler", "num_pages": "407", "awards": [], "places": ["Kansas"], "character_names": [], "language": "English", "publish_date": "2015-11-17 00:00:00", "ISBN": "1633920534"},
{"url": "https://www.goodreads.com/book/show/25614788-no-turning-back", "num_ratings": "25", "num_reviews": "2", "avg_ratings": 4.36, "genres": [], "title": "No Turning Back", "description": ["The devastating secret Liliana learns pushes her to search for answers from her father, El Jefe. But, nothing can prepare her for the tragedy that will come of her relationship with her father... or the priceless opportunity that will come from it. Less"], "author": "Neva Squires-Rodriguez", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-05-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23121547-the-romantic", "num_ratings": "41", "num_reviews": "28", "avg_ratings": 4.29, "genres": ["Fiction"], "title": "The Romantic", "description": ["The Romantic is a love story about friendship, passion, and the echo of unrequited love.", "Hadriel Alighieri has harbored a secret love in his heart for his entire life. It began in his youth, when he fell in love with his best friend, Sophia Paula. After Sophia leaves for America and is later betrothed to Joshua Abrams, Hadriel is devastated, but he is a hopeless romantic.", "In", "The Romantic is a love story about friendship, passion, and the echo of unrequited love.", "Hadriel Alighieri has harbored a secret love in his heart for his entire life. It began in his youth, when he fell in love with his best friend, Sophia Paula. After Sophia leaves for America and is later betrothed to Joshua Abrams, Hadriel is devastated, but he is a hopeless romantic.", "In the winter of his life he is haunted by the memory of Sophia Paula. When the Angel of Death comes for Hadriel, the journey begins. From his deathbed, he travels to the day he fell in love. He retraces the steps of his life in search of his unrequited love. For she too harbors a secret love in her heart. But what begins as a journey to fulfill a promise turns into a discovery of the only emotion that defines our lives.", "Did she wait for him?"], "author": "Felix Alexander", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17336490-unraveled", "num_ratings": "66", "num_reviews": "32", "avg_ratings": 4.03, "genres": ["Young Adult", "Mystery", "Thriller", "Fiction", "Thriller", "Mystery Thriller"], "title": "Unraveled", "description": ["Sixteen year old math whiz, Autumn, spends her days reading about serial killers and dreaming of becoming an FBI Profiler. She never dreams her first case will be so personal. Her world is shattered when she comes home from school and discovers her murdered sister’s body on the living room floor. When the initial evidence points to a burglary gone wrong, Autumn challenges", "Sixteen year old math whiz, Autumn, spends her days reading about serial killers and dreaming of becoming an FBI Profiler. She never dreams her first case will be so personal. Her world is shattered when she comes home from school and discovers her murdered sister’s body on the living room floor. When the initial evidence points to a burglary gone wrong, Autumn challenges the police’s theory because of the personal nature of the crime. Thinking that finding the killer will bring her family back together, she conducts her own investigation using her affinity for math and forensics, but her plan backfires and her obsession with the case further splinters her family.", "When her investigation reveals the killer is someone she knows, Autumn offers herself up as bait and sets a dangerous trap to unmask his true nature and to obtain a confession for her sister’s murder."], "author": "S.X. Bradley", "num_pages": "276", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/574267.What_Night_Brings", "num_ratings": "446", "num_reviews": "57", "avg_ratings": 4.15, "genres": ["Fiction", "Lgbt", "Glbt", "Queer", "Young Adult", "Glbt", "Lesbian", "Historical", "Historical Fiction"], "title": "What Night Brings", "description": ["Marci Cruz wants God to do two things: change her into a boy, and get rid of her father. What Night Brings is the unforgettable story of Marci's struggle to find and maintain her identity against all odds - a perilous home life, an incomprehensible Church, and a largely indifferent world. Winner of the Miguel Marmol prize focusing on human rights, the Paterson Fiction Priz", "Marci Cruz wants God to do two things: change her into a boy, and get rid of her father. What Night Brings is the unforgettable story of Marci's struggle to find and maintain her identity against all odds - a perilous home life, an incomprehensible Church, and a largely indifferent world. Winner of the Miguel Marmol prize focusing on human rights, the Paterson Fiction Prize, the Latino Literary Foundation Latino Book Award, the Bronze Medal from Foreword Magazine, and Honorable Mention for the Gustavus Meyers Books Award. Also shortlisted for a Lambda Literary Award."], "author": "Carla Trujillo", "num_pages": "242", "awards": ["Lambda Literary Award Nominee for Lesbian Fiction (2005)"], "places": [], "character_names": [], "language": "English", "publish_date": "2003-04-01 00:00:00", "ISBN": "1880684942"},
{"url": "https://www.goodreads.com/book/show/17306140-run-the-day", "num_ratings": "39", "num_reviews": "12", "avg_ratings": 3.69, "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Business", "Amazon"], "title": "Run the Day", "description": ["Evil books...Ancient powers...Zombie pigs?", "Thomas Grey - curmudgeon, recluse, mage - is having a terrible day. Down on his luck and facing a looming electrical bill, he is hired by the supernatural overlord of his hometown to track down a magical book of sinister evil: The Libro Nihil. The hunt leads Thomas on an adventure across the sleepy cow town of Hanford steeped with", "Evil books...Ancient powers...Zombie pigs?", "Thomas Grey - curmudgeon, recluse, mage - is having a terrible day. Down on his luck and facing a looming electrical bill, he is hired by the supernatural overlord of his hometown to track down a magical book of sinister evil: The Libro Nihil. The hunt leads Thomas on an adventure across the sleepy cow town of Hanford steeped with mystery, magic, monsters, and an absurd amount of mayhem.", "Aided by his geriatric, spell-slinging mentor as well as his friend and sometimes bodyguard, Thomas encounters a bizarre and terrifying conspiracy to awaken a sleeping evil of cosmic proportions that promises to push his magical prowess and threshold for pain to their limits.", "It looks like a bad, bad day to have gotten out of bed. But a guy’s got to get paid."], "author": "Matthew C. Davis", "num_pages": "104", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12306694-the-knife-and-the-butterfly", "num_ratings": "272", "num_reviews": "86", "avg_ratings": 3.72, "genres": ["Young Adult", "Mystery", "Realistic Fiction", "Contemporary", "Fiction", "Young Adult", "Teen", "Thriller", "Mystery Thriller", "Urban", "Cultural"], "title": "The Knife and the Butterfly", "description": ["After a marijuana-addled brawl with a rival gang, 16-year-old Azael wakes up to find himself surrounded by a familiar set of concrete walls and a locked door. Juvie again, he thinks. But he can't really remember what happened or how he got picked up. He knows his MS13 boys faced off with some punks from Crazy Crew. There were bats, bricks, chains. A knife. But he can't rem", "After a marijuana-addled brawl with a rival gang, 16-year-old Azael wakes up to find himself surrounded by a familiar set of concrete walls and a locked door. Juvie again, he thinks. But he can't really remember what happened or how he got picked up. He knows his MS13 boys faced off with some punks from Crazy Crew. There were bats, bricks, chains. A knife. But he can't remember anything between that moment and when he woke behind bars. ", " Azael knows prison, and something isn't right about this lockup. No phone call. No lawyer. No news about his brother or his homies. The only thing they make him do is watch some white girl in some cell. Watch her and try to remember. ", " Lexi Allen would love to forget the brawl, would love for it to disappear back into the Xanax fog it came from. And her mother and her lawyer hope she chooses not to remember too much about the brawl--at least when it's time to testify. ", " Lexi knows there's more at stake in her trial than her life alone, though. She's connected to him, and he needs the truth. The knife cut, but somehow it also connected."], "author": "Ashley Hope Pérez", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-02-01 00:00:00", "ISBN": "0761361561"},
{"url": "https://www.goodreads.com/book/show/12823016-the-chick-friends-rules-sophomore-year", "num_ratings": "18", "num_reviews": "4", "avg_ratings": 4.06, "genres": [], "title": "The Chick Friends Rules! Sophomore Year", "description": ["*Friends with benefits is a good idea, in theory. ", "*A chick friend scorned is a scary thing. ", "*Ugly girls need love too. ", "The second installment to the Chick friends series in this edgy coming of age story. ", "It's sophomore year! Grant's drama continues and he's added some new friends to his life. Aubrey, is his FWB. Fatima, is his partner in crime (literally). And Ugly Emma, i", "*Friends with benefits is a good idea, in theory. ", "*A chick friend scorned is a scary thing. ", "*Ugly girls need love too. ", "The second installment to the Chick friends series in this edgy coming of age story. ", "It's sophomore year! Grant's drama continues and he's added some new friends to his life. Aubrey, is his FWB. Fatima, is his partner in crime (literally). And Ugly Emma, is his nemesis. He has established himself at Plainfield High and his popularity has grown ever more when he joins the school newspaper with his hot new column \"Chick Friendz\" which explores a boy's perspective on the relationship he has with his female friends. His column is a good distraction from the torch he still carries for Marta. And yes, he's still in the \"friend zone\". But this year he has a breakthrough, or does he?"], "author": "Vici Howard", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2011-07-30 00:00:00", "ISBN": "0983398925"},
{"url": "https://www.goodreads.com/book/show/36308919-the-competition", "num_ratings": "5", "num_reviews": "5", "avg_ratings": 4.0, "genres": ["Young Adult", "Drama", "Realistic Fiction", "Mental Health", "Mental Illness"], "title": "The Competition", "description": ["For Mary Sofia, The Penultimate writing competition is more than a chance at a free college education; she wants to show her younger siblings that they can all rise above their violent family history. For Raiden, the pressure to succeed comes from within, although he knows that family traditions play a part in his determination. For Camara, writing fiction is almost compul", "For Mary Sofia, The Penultimate writing competition is more than a chance at a free college education; she wants to show her younger siblings that they can all rise above their violent family history. For Raiden, the pressure to succeed comes from within, although he knows that family traditions play a part in his determination. For Camara, writing fiction is almost compulsive, but her own dark secret may be the best story she can ever tell. For Michael, swimming and writing fit his introverted personality perfectly, but meeting a smart and beautiful girl at The Penultimate makes stepping outside of his comfort zone easy. All four will compete against each other along with 96 other high school juniors for the chance of a lifetime: a full scholarship to a prestigious private college. Some students will do anything to win, but others may pay the price.", "The second YA title from award-winning, best selling author Cecily Wolfe tells the story of four teens with friendships in the making and futures in the balance - but who will win The Penultimate?"], "author": "Cecily Wolfe", "awards": [], "places": [], "character_names": [], "language": "English"},
{"url": "https://www.goodreads.com/book/show/32353.New_Mutants_Classic_Vol_1", "num_ratings": "608", "num_reviews": "33", "avg_ratings": 3.76, "genres": ["Sequential Art", "Comics", "Sequential Art", "Graphic Novels", "Superheroes", "Marvel", "Marvel", "X Men", "Comics", "Superheroes", "Comics", "Comic Book"], "title": "New Mutants Classic, Vol. 1", "description": ["Cannonball. Sunspot. Moonstar. Karma. Rahne. Teenagers, thrown together by the one thing they had in common -- the X-Factor in their genes that made them different, made them mutants. Relive the adventures of the team that will come to be known as X-Force... if they survive. Collects Marvel Graphic Novel #4, New Mutants #1-7 and Uncanny X-Men #167."], "author": "Chris Claremont", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-03 00:00:00", "ISBN": "0785121943"},
{"url": "https://www.goodreads.com/book/show/29752046-becoming-malka", "num_ratings": "49", "num_reviews": "26", "avg_ratings": 4.43, "genres": ["Historical", "Historical Fiction", "Science Fiction", "Time Travel", "Literature", "Jewish", "Cultural", "Russia", "Fiction", "Cultural", "Ukraine"], "title": "Becoming Malka", "description": ["In pursuit of her Master's degree in Imperial Russian History, 24 year-old Molly Abramovitz is heading to Moscow for a week long seminar. Never one to miss an opportunity for genealogical research;methodical and meticulous Molly plans a side trip to Ukraine. Intriguingly, her mother, Judith, evokes a favorite Yiddish proverb, 'Man plans and God laughs.' ", "If Judith had her w", "In pursuit of her Master's degree in Imperial Russian History, 24 year-old Molly Abramovitz is heading to Moscow for a week long seminar. Never one to miss an opportunity for genealogical research;methodical and meticulous Molly plans a side trip to Ukraine. Intriguingly, her mother, Judith, evokes a favorite Yiddish proverb, 'Man plans and God laughs.' ", "If Judith had her way, her daughter would still be dressing up in fairy wings and princess crowns- collecting wild flowers and connecting with her spiritual energy, but for Molly; making plans and compiling data came as second nature. She and her father had delighted in spending long, cozy, afternoons cuddled in the library studying ancient family history. David Abramovitz began recounting tales of great-grandparents trekking across Mother Russia when his daughter was still quite young. Captivated, Molly learned how her relatives boarded a ship and sailed across the ocean to reach the shores of Argentina. ", "Now, at last, Molly's plans are coming to fruition. Her trek to her ancestral home leads her to an accidental discovery of a mythical tarot card. Will the life lessons revealed on this enchanted journey shake up her staid and uncomplicated life? Only time will tell."], "author": "Mirta Ines Trupp", "num_pages": "332", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-31 00:00:00", "ISBN": "1530502225"},
{"url": "https://www.goodreads.com/book/show/1931915.Bruiser", "num_ratings": "14,183", "num_reviews": "2,110", "avg_ratings": 4.04, "genres": ["Young Adult", "Fantasy", "Fantasy", "Paranormal", "Romance", "Fiction", "Realistic Fiction"], "title": "Bruiser", "description": ["When Brontë starts dating Brewster “Bruiser” Rawlins – the guy voted “Most Likely to Get the Death Penalty” her twin brother, Tennyson, isn’t", "When Brontë starts dating Brewster “Bruiser” Rawlins – the guy voted “Most Likely to Get the Death Penalty” her twin brother, Tennyson, isn’t surprised. But then strange things begin to occur. Tennyson and Brontë’s scrapes heal unnaturally fast, and cuts disappear before their eyes. What at first seems like their good fortune turns out to be more than they bargained for…much more."], "author": "Neal Shusterman", "num_pages": "328", "awards": ["Audie Award Nominee for Multi-Voiced Performance (2012)", "Milwaukee County Teen Book Award Nominee (2011)", "Lincoln Award Nominee (2013)", "Peggy Miller Award (2011)"], "places": [], "character_names": ["Brewster Rawlins", "Brontë Sternberger", "Tennyson Sternberger"], "language": "English", "publish_date": "2011-10-01 00:00:00", "ISBN": "0061134104"},
{"url": "https://www.goodreads.com/book/show/32765117-these-savage-bones", "num_ratings": "10", "num_reviews": "6", "avg_ratings": 4.1, "genres": ["Historical", "Fantasy", "Mystery", "Murder Mystery", "Historical", "Historical Fiction"], "title": "These Savage Bones", "description": ["Mexico, 1875. Twenty-three-year old Esperanza de la Rosa knows more about steam engines and electromagnetics than a proper lady should. Fiercely independent, she’s more interested in science and superstition than finding a suitable husband. ", "When Esperanza’s uncle is murdered during the Day of the Dead, her world is shaken. To catch the killer, she must accept the help of t", "Mexico, 1875. Twenty-three-year old Esperanza de la Rosa knows more about steam engines and electromagnetics than a proper lady should. Fiercely independent, she’s more interested in science and superstition than finding a suitable husband. ", "When Esperanza’s uncle is murdered during the Day of the Dead, her world is shaken. To catch the killer, she must accept the help of the last person she wants to see—her ex-fiancé Alejandro Valladares, a gentleman turned bounty hunter with a troubled past. ", "Thrust into a tangled web of secrets and lies that threaten to destroy everything she thought she knew, Esperanza must uncover the truth in order to bring her uncle’s murderer to justice or her failure will haunt her forever. ", "THESE SAVAGE BONES is a Young Adult novella."], "author": "Kaitlin Hillerich", "num_pages": "103", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-10-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1755866.Suckerpunch", "num_ratings": "264", "num_reviews": "58", "avg_ratings": 3.56, "genres": ["Young Adult", "Realistic Fiction", "Young Adult", "Teen", "Fiction", "Contemporary"], "title": "Suckerpunch", "description": ["It's the summer before senior year, and Marcus ", " be hanging out, filling his sketchbook, maybe asking a girl out for once. So why is he in a car with his brother, his brother's girl, and the pistol, headed straight toward his dad?", "David Hernandez writes with striking lyricism and unfaltering poise. ", " marks the debut of a superb and important new literary tale", "It's the summer before senior year, and Marcus ", " be hanging out, filling his sketchbook, maybe asking a girl out for once. So why is he in a car with his brother, his brother's girl, and the pistol, headed straight toward his dad?", "David Hernandez writes with striking lyricism and unfaltering poise. ", " marks the debut of a superb and important new literary talent."], "author": "David Hernandez", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-12-26 00:00:00", "ISBN": "0061173304"},
{"url": "https://www.goodreads.com/book/show/29339707-i-ll-be-yours", "num_ratings": "2,001", "num_reviews": "262", "avg_ratings": 4.18, "genres": ["Young Adult", "Contemporary", "Romance", "Sports and Games", "Sports", "Christian Fiction"], "title": "I'll Be Yours", "description": ["The day Andrew Levin arrives at Washington High, Harper O’Malley knows he’ll make the perfect starter boyfriend. The school’s newest band geek is totally in Harper’s league, yet completely out of this late-bloomer’s reach. Between fitting in with a new family, scoring the first chair in band, and rescuing dogs for the local animal shelter, Harper’s never had the opportunit", "The day Andrew Levin arrives at Washington High, Harper O’Malley knows he’ll make the perfect starter boyfriend. The school’s newest band geek is totally in Harper’s league, yet completely out of this late-bloomer’s reach. Between fitting in with a new family, scoring the first chair in band, and rescuing dogs for the local animal shelter, Harper’s never had the opportunity to hone her dating skills. But even though Harper’s love life is far from perfect, she’s got the perfect plan.", "Harper knows she’s insane to agree to tutor Ridley Estes, a notorious heartbreaker and the star of her high school’s football team—but in exchange, he’s offered to school her in the game of love. Just when she sees promise with her crush, a football scandal rocks her family, her town, and Ridley’s entire future. Harper suddenly has everything to lose—her family, friends, and even her heart. When the dust of the scandal settles, nothing will be the same. Including the girl who asked the most popular jock to teach her about love."], "author": "Jenny B. Jones", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23306936-a-tempest-soul", "num_ratings": "179", "num_reviews": "21", "avg_ratings": 3.76, "genres": ["Historical", "Historical Fiction"], "title": "A Tempest Soul", "description": ["Seventeen year old Gina Falcone has been alone for much of her life. Her father passed away while she was young. Her un-affectionate mother eventually leaves her to care for herself when she is only thirteen. ", "Though her epic journey begins in 1920 by an almost deadly mistake, Gina will find many of her hearts desires in the most unlikely of places. The loss of everything i", "Seventeen year old Gina Falcone has been alone for much of her life. Her father passed away while she was young. Her un-affectionate mother eventually leaves her to care for herself when she is only thirteen. ", "Though her epic journey begins in 1920 by an almost deadly mistake, Gina will find many of her hearts desires in the most unlikely of places. The loss of everything is the catalyst that brings her to an unimagined level of accomplishment in her life. ", "Yet Gina soon realizes it is the same events that brought her success that may also bring everything crashing down around her. The new life she has built soon beckons for something she left behind. Now the new woman must find a way to dance through a life she could have never dreamed of. "], "author": "Oliver Phipps", "num_pages": "251", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/23444024-rodeo-finn", "num_ratings": "6", "num_reviews": "2", "avg_ratings": 5.0, "genres": ["Literature", "American", "Animals", "Horses", "Young Adult", "Travel", "Sports and Games", "Sports", "Environment", "Nature"], "title": "Rodeo Finn", "description": ["Finn Dwyer, aged fifteen, is growing up on a dairy farm in Ireland, her thoughts of horses and friendships. When she is challenged in the worst way, she doesn't know how to go forward in life. ", "Summer on her uncle's ranch in Arizona with her cousin Sean and a beautiful black mare Juana gives Finn the chance to let go of her unhappiness. Not only does she explore the Sonora", "Finn Dwyer, aged fifteen, is growing up on a dairy farm in Ireland, her thoughts of horses and friendships. When she is challenged in the worst way, she doesn't know how to go forward in life. ", "Summer on her uncle's ranch in Arizona with her cousin Sean and a beautiful black mare Juana gives Finn the chance to let go of her unhappiness. Not only does she explore the Sonora Desert, she learns trail riding, cattle roping and rodeo skills. ", "When her strength and decisiveness are called upon however, will Finn prove herself? ", "Another atmospheric story of young adults, horses and challenges from the author of SHOW JUMPING TEAM."], "author": "Clare O'Beara", "num_pages": "105", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-22 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24600770-annie-gomez-and-the-gigantic-foot-of-doom", "num_ratings": "12", "num_reviews": "4", "avg_ratings": 3.92, "genres": ["Young Adult"], "title": "Annie Gomez and the Gigantic Foot of Doom", "description": ["This YA sci-fi/fantasy adventure portrays the \"teen condition\" with more than a bit of humor, a la Terry Pratchett's Tiffany Aching. It features Annie Gomez and her \"coterie\" of fellow outcasts. Annie Gomez, having just completed 10th grade, wrestles with being the smartest person she knows (and probably the smartest person ever) and yet having to deal with absurd parents,", "This YA sci-fi/fantasy adventure portrays the \"teen condition\" with more than a bit of humor, a la Terry Pratchett's Tiffany Aching. It features Annie Gomez and her \"coterie\" of fellow outcasts. Annie Gomez, having just completed 10th grade, wrestles with being the smartest person she knows (and probably the smartest person ever) and yet having to deal with absurd parents, thick classmates, and saving the world from aliens (or possibly fairies.) Fortunately, Annie isn't quite totally alone. Her circle of carefully chosen friends include Andy, half Inuit, half African-American, who once played Anne Frank on stage; Johnny, a shy Romany boy who loves history; Naomi, a sophisticated, mature woman of the world (ok, 16 year old of the world); Justin, who still looks like a 6th grader (and a golden retriever) but plays trombone with a world-class jazz band and is the high schools leading expert in exobiology - the study of alien life; and finally Aaron, whose brilliant mind is beyond the ken of ordinary humans. Aaron is autistic, rarely speaks, and spends his time in realms that are imaginary. Or are they? On the last day of the school year Annie's biology teacher warns her that he believes aliens are trying to take over her mind. \"Why not?\" she shrugs. \"Everyone else is.\" Yet as she continues to lose her grip on reality over the next weeks, she has no choice but to accept the possibility. As events unfold, Annie finds that not one but two different alien races are trying to contact her. One is trying to help. One is trying to destroy humanity. But which is which? Feeling totally helpless for the first time in her life, Annie is pulled first by one and then the other into strange and dangerous landscapes. And her friends (except Aaron, mysteriously disappears) are pulled with her, which is probably a good thing, she figures. A fortune teller told her that she had to learn to trust others (\"yeah, right\") but that in the end she would have to depend on her own resources (\"hey, can't someone help me out here?\"). At the last minute she makes her final effort, deploying her secret weapon, only to be used when there are no other options. And it fails. With no hope left she finds herself locked in mortal, hand-to-hand combat with a terrifying, powerful alien, a battle that will determine whether humanity survives. Her strength failing, she faces the very real probability of her own death and please don't tell this to ANYONE but she realizes she really loves her parents. Will she prevail at the last minute? Where has Aaron been this whole time? What happens when you fall in love with someone from a parallel dimension? And what can stop that gigantic foot descending from the sky"], "author": "Jay Cutts", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-15 00:00:00", "ISBN": "1507557337"},
{"url": "https://www.goodreads.com/book/show/3729525-the-secret-story-of-sonia-rodriguez", "num_ratings": "934", "num_reviews": "196", "avg_ratings": 4.15, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Family", "Cultural"], "title": "The Secret Story of Sonia Rodriguez", "description": ["Sonia Rodriguez was born in the United States, but her parents are Mexican immigrants who came to California before she was born. Her father has three Social Security numbers, her mother is pregnant (again), and neither of them speak English. Sonia's mother spends most of her time in bed, watching soap operas, and letting Sonia clean up after her brothers. Sonia's father w", "Sonia Rodriguez was born in the United States, but her parents are Mexican immigrants who came to California before she was born. Her father has three Social Security numbers, her mother is pregnant (again), and neither of them speak English. Sonia's mother spends most of her time in bed, watching soap operas, and letting Sonia clean up after her brothers. Sonia's father works dutifully to support his family, but he knows that his daughter's dreams are bigger than making ", " for family get-togethers. When Sonia attempts to put school work before her ", ", her mother decides that it's time for Sonia to visit her grandmother in Mexico to learn \"the ways of the old world.\" While in Mexico, Sonia spends time with her wise grandmother and her cousin Maria who teach her that while ", " is important, the most important thing is to follow your heart. Sonia returns to the States determined to succeed in school, but the birth of her new twin siblings, inappropriate advances from her drunk uncle (Drunkle), and a forbidden relationship with an El Salvadorian boy push school to the back burner. If only Sonia can find the time to cook dinner, secretly meet with her boyfriend, avoid her Drunkle, AND finish her homework, she just might be able to graduate from high school..."], "author": "Alan Sitomer", "num_pages": "312", "awards": ["Florida Teens Read Nominee (2010)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-09-30 00:00:00", "ISBN": "1423110722"},
{"url": "https://www.goodreads.com/book/show/16114088-atom-heart-john-beloved", "num_ratings": "292", "num_reviews": "73", "avg_ratings": 3.89, "genres": ["Romance", "M M Romance", "Glbt", "Gay", "Young Adult", "Romance", "Lgbt", "Young Adult", "Coming Of Age"], "title": "Atom Heart John Beloved", "description": ["Rainbow Award winner Atom Heart John Beloved chronicles the lives of two boys who become friends at age thirteen. The story is told by eighteen-year-old John, who quietly whispers to his best friend one night in bed, \"Do me.\" This novel is a breathtaking love story and an intense coming of age story that resembles no other book. John's narrative voice is one of the most un", "Rainbow Award winner Atom Heart John Beloved chronicles the lives of two boys who become friends at age thirteen. The story is told by eighteen-year-old John, who quietly whispers to his best friend one night in bed, \"Do me.\" This novel is a breathtaking love story and an intense coming of age story that resembles no other book. John's narrative voice is one of the most unique in gay literature. Atom Heart John Beloved is literate, intimate, erotic, and delightful, delivering unexpected moments of grace."], "author": "Luke Hartwell", "num_pages": "278", "awards": [], "places": [], "character_names": ["John Parker", "Nathan Cernoch"], "language": "English", "ISBN": "0615722350"},
{"url": "https://www.goodreads.com/book/show/23705603-antonio-s-will", "num_ratings": "26", "num_reviews": "7", "avg_ratings": 4.19, "genres": ["Fiction", "Novels"], "title": "Antonio's Will", "description": ["A child emigrates from Spain to Puerto Rico in 1870, adapts to a new culture, and strives through hurricanes, disease and war to become a prominent tobacco planter. With high hopes, he sends his son Antonio to Albany Law School in New York, but the young man loses his will, commits an atrocious crime, and is executed on the electric chair at the Sing Sing penitentiary. Ant", "A child emigrates from Spain to Puerto Rico in 1870, adapts to a new culture, and strives through hurricanes, disease and war to become a prominent tobacco planter. With high hopes, he sends his son Antonio to Albany Law School in New York, but the young man loses his will, commits an atrocious crime, and is executed on the electric chair at the Sing Sing penitentiary. Antonio's spirit returns one hundred years later to persuade a family member, who is also a lawyer and amateur genealogist, to uncover his wrongful execution. Amid a historical, cultural and legal backdrop spanning three countries and over a century, Antonio’s Will exposes the tragic events: the murder, the trial errors, the desolation at the Sing Sing prison, the pleas of an entire island to save him, and his unjust execution. This is Antonio’s story, but it is also a call for equal justice for all people."], "author": "Yasmin Tirado-Chiodini", "num_pages": "297", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-06 00:00:00", "ISBN": "0981730779"},
{"url": "https://www.goodreads.com/book/show/23128246-the-romantic", "num_ratings": "41", "num_reviews": "28", "avg_ratings": 4.29, "genres": ["Fiction"], "title": "The Romantic", "description": ["The Romantic is a love story about friendship, passion, and the echo of unrequited love.", "Hadriel Alighieri has harbored a secret love in his heart for his entire life. It began in his youth, when he fell in love with his best friend, Sophia Paula. After Sophia leaves for America and is later betrothed to Joshua Abrams, Hadriel is devastated, but he is a hopeless romantic.", "In", "The Romantic is a love story about friendship, passion, and the echo of unrequited love.", "Hadriel Alighieri has harbored a secret love in his heart for his entire life. It began in his youth, when he fell in love with his best friend, Sophia Paula. After Sophia leaves for America and is later betrothed to Joshua Abrams, Hadriel is devastated, but he is a hopeless romantic.", "In the winter of his life he is haunted by the memory of Sophia Paula. When the Angel of Death comes for Hadriel, the journey begins. From his deathbed, he travels to the day he fell in love. He retraces the steps of his life in search of his unrequited love. For she too harbors a secret love in her heart. But what begins as a journey to fulfill a promise turns into a discovery of the only emotion that defines our lives.", "Did she wait for him?"], "author": "Felix Alexander", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-29 00:00:00", "ISBN": "1500760994"},
{"url": "https://www.goodreads.com/book/show/22940679-blind-in-justice", "num_ratings": "9", "num_reviews": "5", "avg_ratings": 4.33, "genres": ["Lgbt", "Science Fiction Fantasy", "Space", "Space Opera"], "title": "Blind in Justice", "description": ["In the distant future, Earth is no more. A community of Latinxs aboard a space colony called Justice is all that remains of the human race. Under merciless rule and heavy control, they live in poverty, tirelessly working to please their rulers in the Citadel. ", "This is life, and none are the wiser until an unfortunate event robs everyone of their sight, except for a young ma", "In the distant future, Earth is no more. A community of Latinxs aboard a space colony called Justice is all that remains of the human race. Under merciless rule and heavy control, they live in poverty, tirelessly working to please their rulers in the Citadel. ", "This is life, and none are the wiser until an unfortunate event robs everyone of their sight, except for a young man named Beto. He is the last of his people able to see. In the wake of great devastation, it is up to him to find a solution to help his community reclaim their vision. In doing so, he quickly comes to realize that the cause of the blindness has left great terrors for him to discover and defeat, both externally and internally.", "In blindness, a greater vision waits to be discovered.", "“Blind in Justice is a story with symbolic themes that tackles issues effecting minority groups. Subjects include corrupt government, racism, police brutality, and the LGBT+ community’s fight for acceptance.“"], "author": "Gume Laurel III", "num_pages": "130", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-16 00:00:00", "ISBN": "1500314595"},
{"url": "https://www.goodreads.com/book/show/22890535-uncovered", "num_ratings": "9", "num_reviews": "5", "avg_ratings": 4.44, "genres": ["Young Adult", "Thriller", "Mystery Thriller"], "title": "Uncovered (An Autumn Covarrubias Mystery Book 2)", "description": ["Last year sixteen-year-old Autumn solved her sister’s murder. This year, she is part of a high school forensic dream team that assists the police when teens arekidnapped. When it’s discovered the kidnappings are part of a secret online survivor game, the police and team focus on the game maker—the man behind the game. ", "The focus of the investigation shifts when Autumn is si", "Last year sixteen-year-old Autumn solved her sister’s murder. This year, she is part \u2028of a high school forensic dream team that assists the police when teens are\u2028kidnapped. When it’s discovered the kidnappings are part of a secret online survivor game, the police and team focus on the game maker—the man behind the game. ", "The focus of the investigation shifts when Autumn is singled out and \u2028becomes the target of the Game Maker’s sick game. Through \u2028encrypted messages hidden in steganographs, Autumn must discover who the last \u2028kidnapping victim is if she hopes to save him in time."], "author": "S.X. Bradley", "num_pages": "268", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-08 00:00:00", "ISBN": "177130961X"},
{"url": "https://www.goodreads.com/book/show/1242745.Down_to_the_Bone", "num_ratings": "2,761", "num_reviews": "140", "avg_ratings": 3.97, "genres": ["Young Adult", "Lgbt", "Glbt", "Queer", "Glbt", "Lesbian", "Fiction"], "title": "Down to the Bone", "description": ["What if you don't follow the rules and it radically alters the course of your life?", "What if you get kicked out of the house and lose all your friends and everyone you love? ", "Will you turn the corner into a world filled with unusual friends and create a new kind of family or self-destruct?", "BOOKLIST *STARRED* REVIEW"], "author": "Mayra Lazara Dole", "num_pages": "264", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-07-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18806523-darksoul", "num_ratings": "893", "num_reviews": "107", "avg_ratings": 3.81, "genres": ["Paranormal", "Angels", "Fantasy", "Paranormal", "Fantasy", "Romance", "Paranormal Romance", "Young Adult"], "title": "Darksoul", "description": [" Or two. Or three. ", " A lover of piercings with tan skin and a posh British accent, he’s spunky, fun, dirty-mouthed...and clearly more than what he seems. ", " Cold. Infuriating. Unreadable. He knows just how to work her last nerve. But und", " Or two. Or three. ", " A lover of piercings with tan skin and a posh British accent, he’s spunky, fun, dirty-mouthed...and clearly more than what he seems. ", " Cold. Infuriating. Unreadable. He knows just how to work her last nerve. But under his calm, impassive mask, he’s hiding a terrible secret of his own.", "Hunter and Ash are the least of Hazel’s worries. Someone is out to kill her, and she has no idea why. Monsters seem to come from left and right. Invisible wings follow her everywhere she goes. There’s a voice, soft and strangely familiar, inside her head. After a series of scary encounters, Hazel doesn't know who or what to believe."], "author": "Eveline Hunt", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-08-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18303891-nuclear-winter", "num_ratings": "5", "num_reviews": "0", "avg_ratings": 3.4, "genres": ["Science Fiction", "Dystopia"], "title": "Nuclear Winter", "description": ["When World War III ends with a nuclear clash of apocalyptic proportions, Amy must use a set of recently-discovered abilities to help her friends and family survive their new, chaotic world and its ensuing nuclear winter—an indefinite period of time in which the earth, covered by lingering smoke and ash, receives little to no sunlight and undergoes dramatic", "When World War III ends with a nuclear clash of apocalyptic proportions, Amy must use a set of recently-discovered abilities to help her friends and family survive their new, chaotic world and its ensuing nuclear winter—an indefinite period of time in which the earth, covered by lingering smoke and ash, receives little to no sunlight and undergoes dramatic climate changes. But cooler temperatures are the least of Amy’s worries.", "With the United States and its government all but obliterated, a seemingly well-intentioned military general takes the helm as the chancellor of the New Republic of America while offering the promise of a better future for the small number of the nation’s survivors. Amy quickly discovers, however, that her abilities—and her less than ideal method of using them—are the key to protecting the hopeless survivors around her from the chancellor’s true, sinister intentions.", "From action/suspense novelist Guy Harrison, author of the unique and action-packed Agents of Change Trilogy, comes his young adult fiction debut set in the year 2031. Offering flashes of action and romance with surprises at every turn, Nuclear Winter will appeal to fans of Harrison’s signature series and new readers alike."], "author": "Guy  Harrison", "awards": [], "places": ["Arizona"], "character_names": [], "language": "English", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18085920-the-fifth-sun", "num_ratings": "8", "num_reviews": "3", "avg_ratings": 3.63, "genres": [], "title": "The Fifth Sun", "description": ["Toltec, the old Aztec Emperor, is devastated. He has lost his three sons in a horrific battle against their enemies. Without an heir, who will take over when the Emperor dies? Against all odds, the Sun God decrees that Toltec's wife will bear a child who will become the most-revered emperor of the Aztec nation. But instead, the Empress gives birth to twin boys. One of them", "Toltec, the old Aztec Emperor, is devastated. He has lost his three sons in a horrific battle against their enemies. Without an heir, who will take over when the Emperor dies? Against all odds, the Sun God decrees that Toltec's wife will bear a child who will become the most-revered emperor of the Aztec nation. But instead, the Empress gives birth to twin boys. One of them, according to the Aztec Book of Destinies, will become a courageous warrior; the second, born under an unfavorable sign, is banished and sent to be raised by witches. Yet, as their stories unfold, the reader soon discovers that things are not always as they seem."], "author": "K.S. Miranda", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-06-01 00:00:00", "ISBN": "0615832318"},
{"url": "https://www.goodreads.com/book/show/17730019-peculiar-inc", "num_ratings": "12", "num_reviews": "4", "avg_ratings": 3.42, "genres": ["Fantasy", "Comics", "Superheroes", "Christian", "Novels"], "title": "Peculiar, INC", "description": ["After graduating high school in the small town of Brunswick, Georgia, Kimberly Hamilton prays that her future in Atlanta will bring something interesting and not-so-perfect. ", "Moments after graduation, Kim finds herself at the crossroads of life and eternity. But accepting God's offer to continue her life on earth leaves her body capable of things she's only seen in movies.", "After graduating high school in the small town of Brunswick, Georgia, Kimberly Hamilton prays that her future in Atlanta will bring something interesting and not-so-perfect. ", "Moments after graduation, Kim finds herself at the crossroads of life and eternity. But accepting God's offer to continue her life on earth leaves her body capable of things she's only seen in movies. Discovering several similarly powered individuals, some mysterious and some malevolent, Kim and her friends set out, from the streets of Atlanta to the skies above Annapolis, to discover what it means to be blessed, cursed, or maybe just…peculiar."], "author": "C.S.R. Calloway", "num_pages": "456", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/17184137-santa-muerte", "num_ratings": "33", "num_reviews": "5", "avg_ratings": 3.61, "genres": ["Horror", "Mystery", "Young Adult"], "title": "Santa Muerte", "description": ["WINNER 2014 International Latino Book Award - Best Young Adult Fiction - English", "I am your salvation. I am your beginning. Your end. Your life. Your death. All death.", "You can run, but you can never hide from SANTA MUERTE", "Ariana Molina is a high school student in Chicago and life is quiet until her father, Reynaldo Molina, the lead federal investigator in Mexico targeting crim", "WINNER 2014 International Latino Book Award - Best Young Adult Fiction - English", "I am your salvation. I am your beginning. Your end. Your life. Your death. All death.", "You can run, but you can never hide from SANTA MUERTE", "Ariana Molina is a high school student in Chicago and life is quiet until her father, Reynaldo Molina, the lead federal investigator in Mexico targeting criminal organizations arrives on her door step. After her father is involved in a mysterious car accident that leaves one person dead, Ari begins to have visions of a veiled skeletal figure that asks for her father.", "Struggling with gruesome ghosts, and being suspicious of suspected gang members that have moved in across the street, Ari soon becomes the target of the drug cartels and their black magic cult of Santa Muerte."], "author": "Cynthia Pelayo", "num_pages": "223", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-22 00:00:00", "ISBN": "0615744621"},
{"url": "https://www.goodreads.com/book/show/3416685-the-holy-tortilla-and-a-pot-of-beans", "num_ratings": "33", "num_reviews": "5", "avg_ratings": 4.03, "genres": ["Cultural", "Fiction"], "title": "The Holy Tortilla and a Pot of Beans", "description": ["As a helping of “down-home magical realism,” this collection of 16 short stories explores the human spirit inherent in the bilingual, bicultural world of the Texas-Mexico border. With a fresh sense of humor and human understanding, these stories skillfully bridge the gap between miracles and tragedies, prejudice and transcendence, and oppression and liberation. From the co", "As a helping of “down-home magical realism,” this collection of 16 short stories explores the human spirit inherent in the bilingual, bicultural world of the Texas-Mexico border. With a fresh sense of humor and human understanding, these stories skillfully bridge the gap between miracles and tragedies, prejudice and transcendence, and oppression and liberation. From the comical exploration of the hypocrisy expressed at funerals to the spiritual mission of a magical tortilla, the collection draws upon a wide range of emotions but comes together in a singular, powerful voice that reflects the holiness found in everyday life."], "author": "Carmen Tafolla", "num_pages": "128", "awards": ["Tomás Rivera Mexican American Children’s Book Award (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-05-01 00:00:00", "ISBN": "0916727491"},
{"url": "https://www.goodreads.com/book/show/16143306-the-things-they-didn-t-bury", "num_ratings": "34", "num_reviews": "12", "avg_ratings": 4.03, "genres": ["New Adult", "Romance", "Historical Romance", "Romance", "War", "Historical", "Historical Fiction"], "title": "The Things They Didn't Bury", "description": ["The war took everything. Except the truth. When Liliana and her family move back to Argentina after seeking refuge in the States during La Guerra Sucia, a lifetime's worth of wondering comes to a head, reigniting the search for what really happened to her mother, one of the thousands of los desaparecidos—the disappeared.", "With the help of a young Flamenco player who saw the", "The war took everything. Except the truth. When Liliana and her family move back to Argentina after seeking refuge in the States during La Guerra Sucia, a lifetime's worth of wondering comes to a head, reigniting the search for what really happened to her mother, one of the thousands of los desaparecidos—the disappeared.", "With the help of a young Flamenco player who saw the atrocities committed by the military firsthand, Liliana not only makes the devastating discovery of what really happened to her mother but by forcing open the country's old wounds as well as her own she also learns a disturbing truth about her origins that will reconstruct the lives of the people she loves most.", "Seamlessly alternating between the voices of mother and daughter—one trying to survive the rising chaos of The Dirty War and the other sifting through its aftermath, The Things They Didn’t Bury is a novel about forbidden love and family secrets.", "Gripping, heartbreaking and lyrical this is not a story about war or about the secrets still buried beneath its wreckage but it is a story about the things they didn't bury, intangible and infinite—love, truth, and family."], "author": "Laekan Zea Kemp", "num_pages": "229", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-12-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13632901-fancy", "num_ratings": "108", "num_reviews": "38", "avg_ratings": 4.2, "genres": ["Young Adult"], "title": "Fancy", "description": ["Maribel \"Fancy\" Alvarez is a trendy socialite who has it all: enviable looks, popularity and a closet full of designer threads. She lives an amazing life. At least that's what she's led everyone to believe. Fancy goes to great lengths to keep up a facade of perfection, but when a series of unfortunate events rattles her world, everything begins to fall apart. ", "She's always", "Maribel \"Fancy\" Alvarez is a trendy socialite who has it all: enviable looks, popularity and a closet full of designer threads. She lives an amazing life. At least that's what she's led everyone to believe. Fancy goes to great lengths to keep up a facade of perfection, but when a series of unfortunate events rattles her world, everything begins to fall apart. ", "She's always been taught to use what she's got to get what she wants but deep down inside Fancy knows there is truly more to her than just a beautiful face and perfect body. Will she abandon the superficial lifestyle she's come to know or succumb to the temptation of the almighty dollar? ", "Fancy chronicles the life of a woman torn between the person she is and the person she wants to be. This iconic story will resonate with readers who, like Fancy, have battled issues within, as well as outside influences, while struggling to find themselves amidst a world of chaos. ", "\"This urban drama tells the all too familiar story of Fancy, a gorgeous tastemaker who has always used what she has to get what she wants. For today's women who struggle to keep up the illusion of their superficial lifestyles, Fancy hits home like no other.\" - Shabe Allah-Cleare, Source Magazine ", "\"I recently read Fancy by Vanna B. If you have not copped a copy, WHY? I absolutely love this book! With my busy schedule, I usually take a week to read a book. I read this book in two days. I couldn't put it down for anything.\" - Daja Marie Greer, Hype Magazine ", "\"The author did an excellent job the first go around with the potential to only climb in her career.\" - Readers With Attitude Book Club ", "\"Everything and everyone are not what they appear...Fancy experiences a series of dramas that inspires great change for her life.\" - Vanessa Irvin Morris, StreetLiterature.com ", "\"I loved that the main character was a Latina, however, every female can relate to this tale.\" - Bad Girl of Urban Lit"], "author": "Vanna B.", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-08-16 00:00:00", "ISBN": "0985351500"},
{"url": "https://www.goodreads.com/book/show/11752846-the-chick-friends-rules-freshman-year", "num_ratings": "33", "num_reviews": "7", "avg_ratings": 4.18, "genres": ["Young Adult", "Young Adult", "Teen"], "title": "The Chick Friends Rules! Freshman Year", "description": ["*Friends with benefits is a good idea, in theory. ", "*A chick friend scorned is a scary thing. ", "*Ugly girls need love too. ", "The second installment to the Chick friends series in this edgy coming of age story. ", "It's sophomore year! Grant's drama continues and he's added some new friends to his life. Aubrey, is his FWB. Fatima, is his partner in crime (literally). And Ugly Emma, i", "*Friends with benefits is a good idea, in theory. ", "*A chick friend scorned is a scary thing. ", "*Ugly girls need love too. ", "The second installment to the Chick friends series in this edgy coming of age story. ", "It's sophomore year! Grant's drama continues and he's added some new friends to his life. Aubrey, is his FWB. Fatima, is his partner in crime (literally). And Ugly Emma, is his nemesis. He has established himself at Plainfield High and his popularity has grown ever more when he joins the school newspaper with his hot new column \"Chick Friendz\" which explores a boy's perspective on the relationship he has with his female friends. His column is a good distraction from the torch he still carries for Marta. And yes, he's still in the \"friend zone\". But this year he has a breakthrough, or does he?"], "author": "Vici Howard", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-06-15 00:00:00", "ISBN": "0983398909"},
{"url": "https://www.goodreads.com/book/show/3021244-rogelia-s-house-of-magic", "num_ratings": "69", "num_reviews": "20", "avg_ratings": 3.51, "genres": ["Fantasy", "Young Adult", "Paranormal", "Witches", "Young Adult", "Teen"], "title": "Rogelia's House of Magic", "description": ["IN ", "three different 15-year-old girls find friendship and special powers as they are trained in the ways of the curandera by a wise old woman.", "When Rogelia becomes a maid at Marina Peralta’s home, it’s obvious to Marina and her friend Fern that they have a real mystic on their hands. Soon Rogelia agrees to teach the girls the magic of their ancestor", "IN ", "three different 15-year-old girls find friendship and special powers as they are trained in the ways of the curandera by a wise old woman.", "When Rogelia becomes a maid at Marina Peralta’s home, it’s obvious to Marina and her friend Fern that they have a real mystic on their hands. Soon Rogelia agrees to teach the girls the magic of their ancestors, much as she taught her granddaughters, Xochitl and Gracielia. Even though Marina and Fern are thrilled to have this chance to understand and use their powers, Xochitl isn’t happy about sharing such a sacred thing with anyone but her sister, who perished in a car accident. Besides, magic has let Xochitl down before. Why wouldn’t it now? But, as the girls will eventually discover, at Rogelia’s House of Magic anything is possible."], "author": "Jamie Martinez Wood", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-06-10 00:00:00", "ISBN": "0385734778"},
{"url": "https://www.goodreads.com/book/show/239952.In_Between_Men", "num_ratings": "98", "num_reviews": "14", "avg_ratings": 3.51, "genres": ["Romance", "Womens Fiction", "Chick Lit"], "title": "In Between Men", "description": ["What else could go wrong for 29-year-old ESL teacher and single mom Isa Avellan after she's been voted the un-sexiest woman alive by the entire student body?", "Well . . .", "She could be knocked unconscious by a well-kicked soccer ball and wind up saddled with a guardian angel who looks and sounds a lot like Joan Collins.", "She could have to endure the on-air ravings of her ", " ex", "What else could go wrong for 29-year-old ESL teacher and single mom Isa Avellan after she's been voted the un-sexiest woman alive by the entire student body?", "Well . . .", "She could be knocked unconscious by a well-kicked soccer ball and wind up saddled with a guardian angel who looks and sounds a lot like Joan Collins.", "She could have to endure the on-air ravings of her ", " ex-husband as he reveals every intimate, humiliating detail of their sex life to an infamous shock-jock . . . ", "Or she could take matters into her own hands and submit to a total makeover, from lipstick to toenail polish to lacy lingerie. And with the help of some well-meaning (if slightly ", ") ", ", she could become L.A.'s most ravishing reborn sex goddess, say ", " to the past, and see about capturing the attention of a hot new man. But the new Isa is about to find out that it's not so easy juggling motherhood, career, and sex-symbol status. It could, however, turn out to be a whole lot of fun."], "author": "Mary Castillo", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-21 00:00:00", "ISBN": "0060766824"},
{"url": "https://www.goodreads.com/book/show/440121.Isabel", "num_ratings": "5,222", "num_reviews": "123", "avg_ratings": 3.69, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Childrens", "Middle Grade", "Childrens"], "title": "Isabel: Jewel of Castilla, Spain, 1466", "description": ["While waiting anxiously for others to choose a husband for her, Isabella, the future Queen of Spain, keeps a diary account of her life as a member of the royal family."], "author": "Carolyn Meyer", "num_pages": "205", "awards": [], "places": ["Spain"], "character_names": ["Isabella I of Castile"], "language": "English", "publish_date": "2000-07-16 00:00:00", "ISBN": "0439078059"},
{"url": "https://www.goodreads.com/book/show/398813.Adios_to_My_Old_Life", "num_ratings": "204", "num_reviews": "29", "avg_ratings": 3.72, "genres": ["Young Adult", "Music", "Contemporary", "Romance", "Romance", "Contemporary Romance", "Music", "Musicians"], "title": "Adios to My Old Life", "description": [" ", " "], "author": "Barbara Caridad Ferrer", "num_pages": "246", "awards": ["RITA Award by Romance Writers of America for Best Contemporary Single Title & Nominee for First Book (2007)", "Florida Book Award for Young Adult - Bronze (2006)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-04 00:00:00", "ISBN": "1416524738"},
{"url": "https://www.goodreads.com/book/show/491735.The_Dirty_Girls_Social_Club", "num_ratings": "12,008", "num_reviews": "706", "avg_ratings": 3.46, "genres": ["Womens Fiction", "Chick Lit", "Fiction"], "title": "The Dirty Girls Social Club", "description": ["Inseparable since their days at Boston University almost ten years before, six friends form the Dirty Girls Social Club, a mutual support and (mostly) admiration society that no matter what happens to each of them (and a lot does), meets regularly to dish, dine and compare notes on the bumpy course of life and love.", "Las sucias are:", "--Lauren, the resident “caliente” columnist", "Inseparable since their days at Boston University almost ten years before, six friends form the Dirty Girls Social Club, a mutual support and (mostly) admiration society that no matter what happens to each of them (and a lot does), meets regularly to dish, dine and compare notes on the bumpy course of life and love.", "Las sucias are:", "--Lauren, the resident “caliente” columnist for the local paper, which advertises her work with the line “her casa is su casa, Boston”, but whose own home life has recently involved hiding in her boyfriend’s closet to catch him in the act", "--Sara, the perfect wife and mother who always knew exactly the life she wanted and got it, right down to the McMansion in the suburbs and two boisterious boys, but who is paying a hefty price", "--Amber, the most idealistic and artistic member of the club, who was raised a valley girl without a word of Spanish and whose increasing attachment to her Mexica roots coincides with a major record label’s interest in her rock ‘n’ roll", "--Elizabeth, the stunning black Latina whose high profile job as a morning television anchor conflicts with her intensely private personal life, which would explain why the dates the other dirty girls set her up on never work out", "--Rebecca, intense and highly controlled, who flawlessly runs Ella, the magazine she created for Latinas, but who can’t explain why she didn’t understand the man she married and now doesn’t even share a room with; and", "--Usnavys, irrepressible and larger than life, whose agenda to land the kind of man who can keep her in Manolo Blahniks and platanos almost prevents her seeing true love when it lands in her lap.", "There’s a lot of catching up to do.", "A vibrant, can’t-put-it-down novel of six friends—each one an unforgettable Latina woman in her late ‘20s—and the complications and triumphs in their lives."], "author": "Alisa Valdes", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-05-13 00:00:00", "ISBN": "0312313829"},
{"url": "https://www.goodreads.com/book/show/588402._Scandalosa_", "num_ratings": "59", "num_reviews": "10", "avg_ratings": 3.68, "genres": ["Young Adult"], "title": "¡Scandalosa!", "description": ["In this sassy sequel to Honey Blonde Chica, Evie finally has it all: a sweet boyfriend, two mejor amigas, and an upcoming sixteenera thats the talk of the school. Too bad reality has a way of ruining things."], "author": "Michele Serros", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-10-09 00:00:00", "ISBN": "1416915931"},
{"url": "https://www.goodreads.com/book/show/7992873-the-trouble-with-half-a-moon", "num_ratings": "283", "num_reviews": "79", "avg_ratings": 3.87, "genres": ["Young Adult", "Realistic Fiction", "Contemporary", "Childrens", "Middle Grade", "Fiction", "Sociology", "Abuse"], "title": "The Trouble With Half a Moon", "description": ["Ever since her brother's death, Dellie's life has been quiet and sad. Her mother cries all the time and Dellie lives with the horrible guilt that the accident that killed her brother may have been all her fault.", "But Dellie's world begins to change when new neighbors move into her housing project building. Suddenly men are fighting on the stoop and gunfire is sounding off in", "Ever since her brother's death, Dellie's life has been quiet and sad. Her mother cries all the time and Dellie lives with the horrible guilt that the accident that killed her brother may have been all her fault.", "But Dellie's world begins to change when new neighbors move into her housing project building. Suddenly men are fighting on the stoop and gunfire is sounding off in the night. In the middle of all that trouble is Corey, an abused five-year-old boy, who's often left home alone and hungry. Dellie strikes up a dangerous friendship with this little boy who reminds her so much of her brother. She wonders if she can do for Corey what she couldn't do for her brother-save him.", "Starkly and affectingly written, ", " is a sparkling and memorable debut."], "author": "Danette Vigilante", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-06 00:00:00", "ISBN": "0399251596"},
{"url": "https://www.goodreads.com/book/show/2007465.The_Brothers_Torres", "num_ratings": "669", "num_reviews": "127", "avg_ratings": 3.92, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Romance"], "title": "The Brothers Torres", "description": ["Frankie Towers has always looked up to his older brother, Steve, and with good reason. Steve is a popular senior who always gets what he wants: girls, a soccer scholarship, and--lately--street cred. Frankie, on the other hand, spends his time shooting off fireworks with his best friend Zach, working at his parents' restaurant, and obsessing about his longtime crush, Rebecc", "Frankie Towers has always looked up to his older brother, Steve, and with good reason. Steve is a popular senior who always gets what he wants: girls, a soccer scholarship, and--lately--street cred. Frankie, on the other hand, spends his time shooting off fireworks with his best friend Zach, working at his parents' restaurant, and obsessing about his longtime crush, Rebecca Sanchez. ", "Frankie has reservations about Steve's crusade to win the respect of the local ", ". He doesn't think about them, though, until he gets into a fist fight John Dalton the richest, preppiest kid in his New Mexican high school, and longtime nemesis of Steve. After the fight, Steve takes Frankie under his wing and Frankie's social currency begins to rise. The ", "who used to ignore him start to recognize him; he even lands a date to Homecoming with Rebecca. ", "The situation with Dalton continues to simmer, and after another incident Steve is bent on retaliating. Frankie starts to think that his brother is taking this respect thing too far. He may have to choose between respecting his brother and respecting himself.", "In an honest and humorous debut novel, Coert Voorhees uses a coming of age story to look at where loyalty ends and the self begins."], "author": "Coert Voorhees", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-29 00:00:00", "ISBN": "1423103041"},
{"url": "https://www.goodreads.com/book/show/5322474-damas-dramas-and-ana-ruiz", "num_ratings": "68", "num_reviews": "22", "avg_ratings": 3.59, "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Adult Fiction", "Cultural", "Latin American"], "title": "Damas, Dramas, and Ana Ruiz", "description": ["All Ana Ruiz wanted was to have a traditional quinceañera for her daughter, Carmen. She wanted a nice way to mark this milestone year in her daughter's life. But Carmen was not interested in celebrating. Hurt and bitter over her father Esteban's departure, she blamed Ana for destroying their happy family, as did everyone else. A good man is hard to find, especially at your", "All Ana Ruiz wanted was to have a traditional quinceañera for her daughter, Carmen. She wanted a nice way to mark this milestone year in her daughter's life. But Carmen was not interested in celebrating. Hurt and bitter over her father Esteban's departure, she blamed Ana for destroying their happy family, as did everyone else. A good man is hard to find, especially at your age Ana was told. Why not forgive his one indiscretion? Despite everything, Ana didn't want to tarnish Carmen's childlike devotion to her beloved father. But Ana knows that growing up sometimes means facing hard truths. In the end, Ana discovers that if she's going to teach Carmen anything about what it means to be a woman, it will take more than simply a fancy party to do it... ", "\"Belinda Acosta's ", " delivers all its title promises and more: it's a book about damas of all ages, from teenage girls to the struggling mothers of those teenage girls; it's packed with drama so you don't want to stop reading; it's a novel that deeply and honestly tells the story of Ana Ruiz, her own coming of age as a woman and as a mother. Belinda Acosta is up to all of the challenges of such a rich panorama of characters and events. She's sassy, she's smart, she makes it look easy! But it takes a lot of hard work and a pile of talent to write such an engaging, touching book. A wonderful quinceañera of a novel!\"", " --- Julia Alvarez, author of Once Upon a Quinceañera: Coming of Age in the USA and Return to Sender", "\"Lively and perceptive... Acosta empathically captures the innermost feelings of her characters.\" ", " --- Booklist"], "author": "Belinda Acosta", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-08-11 00:00:00", "ISBN": "044654051X"},
{"url": "https://www.goodreads.com/book/show/239053.How_to_Be_a_Chicana_Role_Model", "num_ratings": "282", "num_reviews": "26", "avg_ratings": 3.89, "genres": ["Humor", "Nonfiction", "Contemporary"], "title": "How to Be a Chicana Role Model", "description": ["Book by Serros, Michele M."], "author": "Michele Serros", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-07-01 00:00:00", "ISBN": "1573228249"},
{"url": "https://www.goodreads.com/book/show/12850610-crossing-the-line", "num_ratings": "173", "num_reviews": "32", "avg_ratings": 3.91, "genres": ["Young Adult", "Fiction", "Contemporary"], "title": "Crossing the Line", "author": "Malin Alegria", "num_pages": "180", "awards": [], "places": ["Texas"], "character_names": [], "language": "English", "publish_date": "2012-05-01 00:00:00", "ISBN": "0545402409"},
{"url": "https://www.goodreads.com/book/show/106453.Haters", "num_ratings": "1,147", "num_reviews": "138", "avg_ratings": 3.72, "genres": ["Young Adult", "Fiction", "Young Adult", "High School", "Romance", "Womens Fiction", "Chick Lit", "Contemporary"], "title": "Haters", "description": ["From the fist day at her new Southern California high school, Pasquala Rumalda Quintana de Archuleta (\"Paski\") learns that the popular students may be diverse in ethnicity but are alike in their cruelty. While Paski tries to concentrate on mountain biking and not thinking too much about ultra-hot Chris Cabrera, she is troubled by the beautiful and wicked Jessica Nguyen. He", "From the fist day at her new Southern California high school, Pasquala Rumalda Quintana de Archuleta (\"Paski\") learns that the popular students may be diverse in ethnicity but are alike in their cruelty. While Paski tries to concentrate on mountain biking and not thinking too much about ultra-hot Chris Cabrera, she is troubled by the beautiful and wicked Jessica Nguyen. Here at Aliso Niguel High, money is everything and the Haters rule."], "author": "Alisa Valdes", "num_pages": "351", "awards": [], "places": ["Southern California"], "character_names": [], "language": "English", "publish_date": "2009-08-01 00:00:00", "ISBN": "0316013072"},
{"url": "https://www.goodreads.com/book/show/563478.Estrella_s_Quinceanera", "num_ratings": "399", "num_reviews": "79", "avg_ratings": 3.8, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Romance", "Young Adult", "Teen"], "title": "Estrella's Quinceanera", "description": ["For as long as Estrella Alvarez can remember, her mother has been planning to throw her an elaborate quinceañera for her fifteenth birthday -- complete with a mariachi band, cheesy decorations, and a hideous dress. Just thinking about her quince makes Estrella cringe. But her mother insists that it's tradition. ", " Estrella has other things on her mind, anyway -- like dating", "For as long as Estrella Alvarez can remember, her mother has been planning to throw her an elaborate quinceañera for her fifteenth birthday -- complete with a mariachi band, cheesy decorations, and a hideous dress. Just thinking about her quince makes Estrella cringe. But her mother insists that it's tradition. ", " Estrella has other things on her mind, anyway -- like dating Speedy. Does it matter that her new friends -- and her parents -- would never approve of a guy from el barrio? Estrella's almost fifteen and wants to start making her own decisions. But is she ready to find out who she is -- and who she really wants to be?"], "author": "Malin Alegria", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "0689878109"},
{"url": "https://www.goodreads.com/book/show/588401.Honey_Blonde_Chica", "num_ratings": "168", "num_reviews": "30", "avg_ratings": 3.6, "genres": ["Young Adult", "Fiction", "Contemporary", "Realistic Fiction"], "title": "Honey Blonde Chica", "author": "Michele Serros", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-06-05 00:00:00", "ISBN": "1416915923"},
{"url": "https://www.goodreads.com/book/show/3885097-esperanza", "num_ratings": "10", "num_reviews": "7", "avg_ratings": 4.4, "genres": ["Young Adult"], "title": "Esperanza: A Latina Story", "description": ["Fourteen-year old Esperanza Ignacio could only think of a few words to sum up her life: crap, crap, crap! She was born into a poor Latino family living in a small crummy apartment in the barrio side of town, where the graffiti chiseled more the souls and character of the residents than it impacted the exterior looks of the buildings. Her father was a drunken, gambler, and", "Fourteen-year old Esperanza Ignacio could only think of a few words to sum up her life: crap, crap, crap! She was born into a poor Latino family living in a small crummy apartment in the barrio side of town, where the graffiti chiseled more the souls and character of the residents than it impacted the exterior looks of the buildings. Her father was a drunken, gambler, and wife-beater who, one cold night, got arrested after a violent intrusion. Her entire circle of relatives consisted of nothing but formers-former drug-addicts, former gangsters and gang-bangers, former alcoholics, former everything. Yep, her life was nothing but a huge load of crap. And she hadn't even started high school yet. After surviving a scorching summer heat, Esperanza enters the unfamiliar world of high-school with a tight knot in her stomach. On the very first day, she is sucked into a blunder of catastrophic events beginning with accidentally running into the world's BIGGEST bully. Now, she has made herself the prime target for a main course. And, to top it all off, she has to see this girl everyday in P.E! P.E.-the one class Esperanza truly despises the most. Could life be any worse for her? Well, her family could take in a relative hopped up on drugs, a probable shooting can take place right in front of her, and Esperanza could also sit and listen to the crazed ranting of her loud psychotic mother. Oh, wait, all that does happen. To make things even easier, her best friend, Carla, won't stop trying to marry her off to her twin brother, Carlos. And she has these two puny siblings constantly vying for her attention. God, it's a wonder she doesn't strap herself in a straight jacket and pretend to be Elvis. Nonetheless, Esperanza attempts to get through it all. She is a smart and ambitious young kid struggling to survive her life while fighting to make her mark on the world. Her story is filled with pain, strength, and too much loud bickering. It carries a voice enriched with barrio slang and sarcastic humor. Esperanza illustrates what persistent Latino youth can achieve when they get back up after a fall and keep on walking straight into college. \"Esperanza is an admirable and too real story of many Latino youths lacking role models, who find themselves lost and isolated in the paved jungles of the inner cities and overwhelmed by the dissonance of barrio life. Sandra C. Lopez has created a resilient and likeable character, Esperanza, who seems closer to a naked truth-seeker than to a barrio kid-desperately trying to get out of a crappy world, but not knowing exactly where she was going to. Highly Recommended.\" Andrea Alessandra, University of California, Berkeley \"Sandra Lopez is a fresh and resonant voice from the Hispanic rainbow.\" Ray Michael Baca Author-\"Brotherhood of the Light\""], "author": "Sandra C. Lopez", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-15 00:00:00", "ISBN": "0979645786"},
{"url": "https://www.goodreads.com/book/show/25437891-the-v-girl", "num_ratings": "5,708", "num_reviews": "676", "avg_ratings": 4.01, "genres": ["Romance", "Young Adult", "Young Adult", "Coming Of Age", "Science Fiction", "Dystopia", "Fiction", "Science Fiction"], "title": "The V Girl", "description": ["ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substi", "ROMANCE SET IN A DYSTOPIAN FUTURE", "In post-apocalyptic North America, sexual slavery is legal. Lila Velez desperately wants to lose her virginity before the troops visit her town and take it away by force. She makes plans to seduce her only friend. Lila does not love him, but he is the only man who has shown her true affection, an affection she is willing to take as a substitute for love.", "Lila’s coping mechanism to deal with her mother’s loss is her secret. A secret that will bring her closer to Aleksey Fürst, a foreign, broody man who she distrusts because of his links to the troops and his rough, yet irresistible appearance. He offers Lila an alternative to her plans, a possibility that terrifies her…and tempts her in spite of herself.", "With threats looming at every turn and no way to escape, Lila fears that falling in love will only lead to more heartache. The consequences of laying down her arms for Aleksey and welcoming hope might destroy more than her heart. They might force her to face the worst of her nightmares becoming a reality. Is love possible in a world that has forgotten what the human touch is?", "NOTES FROM THE AUTHOR", "* This is a book full of romance and anti-rape messages. I didn't write this book to romanticize violence against women but to tell the story of a girl who has to come of age under the most terrible circumstances. ", "* This full-length novel is a stand alone. No cliffhanger", "* Alpha male hero. No cheating. No slut-shaming.", "* Includes a discussion guide for bookclubs", "* Possible triggers for abuse survivors."], "author": "Mya Robarts", "num_pages": "341", "awards": [], "places": ["Starville"], "character_names": ["Lila Velez", "Aleksey Fürst", "Azalea Velez", "Olmo Velez", "Tristan Froh", "Ethan Velez"], "language": "English", "publish_date": "2015-06-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10429092-the-girl-of-fire-and-thorns", "num_ratings": "67,818", "num_reviews": "6,578", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Did Not Finish"], "title": "The Girl of Fire and Thorns", "description": ["Elisa is the chosen one. ", "But she is also the younger of two princesses, the one who has never done anything remarkable. She can't see how she ever will. ", "Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs the chosen one, not a fa", "Elisa is the chosen one. ", "But she is also the younger of two princesses, the one who has never done anything remarkable. She can't see how she ever will. ", "Now, on her sixteenth birthday, she has become the secret wife of a handsome and worldly king—a king whose country is in turmoil. A king who needs the chosen one, not a failure of a princess.", "And he's not the only one who seeks her. Savage enemies seething with dark magic are hunting her. A daring, determined revolutionary thinks she could be his people's savior. And he looks at her in a way that no man has ever looked at her before. Soon it is not just her life, but her very heart that is at stake.", "Elisa could be everything to those who need her most. If the prophecy is fulfilled. If she finds the power deep within herself. If she doesn’t die young.", "Most of the chosen do."], "author": "Rae Carson", "num_pages": "423", "awards": ["William C. Morris YA Debut Award Nominee (2012)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)", "Ohioana Book Award for Young Adult (2012)", "Cybils Award Nominee for Fantasy & Science Fiction (Young Adult) (2011)"], "places": [], "character_names": ["Alejandro de Vega", "Lucero-Elisa de Riqueza", "Humberto", "Ximena", "Cosme", "Hector of Ventierra"], "language": "English", "publish_date": "2011-09-20 00:00:00", "ISBN": "0062026488"},
{"url": "https://www.goodreads.com/book/show/25752919-the-conjurors-collection", "num_ratings": "93", "num_reviews": "18", "avg_ratings": 4.19, "genres": ["Fantasy", "Business", "Amazon", "Young Adult"], "title": "The Conjurors Collection", "description": ["Belief is a powerful magic. ", "Valerie Diaz has a power that she can't contain, and it's killing her. Bounced between foster homes and the streets, she only has time to concentrate on staying alive. But a visit from the imaginary friend of her childhood opens a world of possibilities, including a new life half a universe away on a planet that is bursting with magic. ", "The first", "Belief is a powerful magic. ", "Valerie Diaz has a power that she can't contain, and it's killing her. Bounced between foster homes and the streets, she only has time to concentrate on staying alive. But a visit from the imaginary friend of her childhood opens a world of possibilities, including a new life half a universe away on a planet that is bursting with magic. ", "The first three books of The Conjurors Series follow Valerie on a journey that straddles two worlds. In order to survive, she must travel many light years away to a realm where anything is possible. But choosing to embrace her potential will set Valerie on a treacherous course - one filled with true love, adventure and perilous danger. ", "This collection includes the first three novels in this young adult fantasy series: The Society of Imaginary Friends, Knights of Light, and Guardians of the Boundary. Purchased individually, the ebooks would cost $10. The fourth and final book in the series, Edge of Pathos, is available on Amazon but not included in this collection."], "author": "Kristen Pham", "num_pages": "919", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20734002-the-weight-of-feathers", "num_ratings": "3,753", "num_reviews": "889", "avg_ratings": 3.8, "genres": ["Young Adult", "Fantasy", "Magical Realism", "Romance", "Contemporary", "Fiction"], "title": "The Weight of Feathers", "description": ["For twenty years, the Palomas and the Corbeaus have been rivals and enemies, locked in an escalating feud for over a generation. Both families make their living as traveling performers in competing shows—the Palomas swimming in mermaid exhibitions, the Corbeaus, former tightrope walkers, performing in the tallest trees they can find. ", "Lace Paloma may be new to her family’s", "For twenty years, the Palomas and the Corbeaus have been rivals and enemies, locked in an escalating feud for over a generation. Both families make their living as traveling performers in competing shows—the Palomas swimming in mermaid exhibitions, the Corbeaus, former tightrope walkers, performing in the tallest trees they can find. ", "Lace Paloma may be new to her family’s show, but she knows as well as anyone that the Corbeaus are pure magia negra, black magic from the devil himself. Simply touching one could mean death, and she's been taught from birth to keep away. But when disaster strikes the small town where both families are performing, it’s a Corbeau boy, Cluck, who saves Lace’s life. And his touch immerses her in the world of the Corbeaus, where falling for him could turn his own family against him, and one misstep can be just as dangerous on the ground as it is in the trees. ", "Beautifully written, and richly imaginative, ", " is an utterly captivating young adult novel by a talented new voice."], "author": "Anna-Marie McLemore", "num_pages": "320", "awards": ["William C. Morris YA Debut Award Nominee (2016)"], "places": [], "character_names": ["Lace Paloma", "Cluck Corbeau"], "language": null, "publish_date": "2015-09-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/9449401-what-can-t-wait", "num_ratings": "594", "num_reviews": "123", "avg_ratings": 3.8, "genres": ["Young Adult", "Realistic Fiction", "Contemporary", "Romance", "Fiction", "Family", "Cultural", "Young Adult", "Teen", "Young Adult", "High School", "Young Adult", "Young Adult Contemporary"], "title": "What Can(t) Wait", "description": ["Marissa has smarts and plenty of promise, but she's marooned in a broken-down Houston neighborhood--and in a Mexican immigrant family where making ends meet matters much more than making it to college. When her home life becomes unbearable, Marissa seeks comfort elsewhere--and suddenly neither her best friend or boyfriend can get through to her. ", " tells the s", "Marissa has smarts and plenty of promise, but she's marooned in a broken-down Houston neighborhood--and in a Mexican immigrant family where making ends meet matters much more than making it to college. When her home life becomes unbearable, Marissa seeks comfort elsewhere--and suddenly neither her best friend or boyfriend can get through to her. ", " tells the story of one girl's survival in a world in which family trumps individual success and independence, and self-reliance the only key that can unlock the door to the future."], "author": "Ashley Hope Pérez", "num_pages": "234", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "0761361553"},
{"url": "https://www.goodreads.com/book/show/25734013-edge-of-pathos", "num_ratings": "82", "num_reviews": "18", "avg_ratings": 4.62, "genres": ["Fantasy", "Young Adult"], "title": "Edge of Pathos", "description": ["Valerie thought she understood loss. Her entire life has been defined by it. But now, she is facing the most frightening loss of all. Her own mind is slipping away, consumed by the power that burns through her every time she saves a life.", "As the Fractus sweep across Earth, using the strength of their magic to subjugate t", "Valerie thought she understood loss. Her entire life has been defined by it. But now, she is facing the most frightening loss of all. Her own mind is slipping away, consumed by the power that burns through her every time she saves a life.", "As the Fractus sweep across Earth, using the strength of their magic to subjugate the powerless, Valerie struggles to lead the resistance, constantly one step behind her enemy. When Reaper taps into a powerful new source of magic, Valerie knows that solutions that worked in the past won't be enough to defeat him. She'll have to reimagine how magic can be harnessed in order to combat a force dark enough to dark enough to enslave all of humankind.", "In the final novel of ", ", Valerie must bury her pain and uncertainty deep inside of her and make the hardest decisions of her life with no one to guide her. The fate of two worlds depends on it."], "author": "Kristen Pham", "num_pages": "410", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-06-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/8715787-luminous", "num_ratings": "908", "num_reviews": "128", "avg_ratings": 3.27, "genres": ["Fantasy", "Young Adult", "Fantasy", "Paranormal", "Fantasy", "Magic", "Fantasy", "Urban Fantasy"], "title": "Luminous", "description": ["As reality slips and time stands still, Consuela finds herself thrust into the world of the Flow. Removed from all she loves into this shifting world overlapping our own, Consuela quickly discovers she has the power to step out of her earthly skin and cloak herself in new ones—skins made from the world around her, crafted from water, fire, air. She is joined by other teens", "As reality slips and time stands still, Consuela finds herself thrust into the world of the Flow. Removed from all she loves into this shifting world overlapping our own, Consuela quickly discovers she has the power to step out of her earthly skin and cloak herself in new ones—skins made from the world around her, crafted from water, fire, air. She is joined by other teens with extraordinary abilities, bound together to safeguard a world they can affect, but where they no longer belong.", "When murder threatens to undo the Flow, the Watcher charges Consuela and elusive, attractive V to stop the killer. But the psychopath who threatens her new world may also hold the only key to Consuela’s way home."], "author": "Dawn Metcalf", "num_pages": "371", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-06-30 00:00:00", "ISBN": "0525422471"},
{"url": "https://www.goodreads.com/book/show/22295304-shadowshaper", "num_ratings": "7,047", "num_reviews": "1,668", "avg_ratings": 3.8, "genres": ["Fantasy", "Young Adult", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Paranormal"], "title": "Shadowshaper", "description": ["Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York may", "Sierra Santiago was looking forward to a fun summer of making art, hanging out with her friends, and skating around Brooklyn. But then a weird zombie guy crashes the first party of the season. Sierra's near-comatose abuelo begins to say \"Lo siento\" over and over. And when the graffiti murals in Bed-Stuy start to weep.... Well, something stranger than the usual New York mayhem is going on.", "Sierra soon discovers a supernatural order called the Shadowshapers, who connect with spirits via paintings, music, and stories. Her grandfather once shared the order's secrets with an anthropologist, Dr. Jonathan Wick, who turned the Caribbean magic to his own foul ends. Now Wick wants to become the ultimate Shadowshaper by killing all the others, one by one. With the help of her friends and the hot graffiti artist Robbie, Sierra must dodge Wick's supernatural creations, harness her own Shadowshaping abilities, and save her family's past, present, and future."], "author": "Daniel José Older", "num_pages": "297", "awards": ["Locus Award Nominee for Best Young Adult Book (2016)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2016)", "Lincoln Award Nominee (2018)", "Andre Norton Award Nominee (2015)", "Kirkus Prize Nominee for Young Readers' Literature (Finalist) (2015)"], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-30 00:00:00", "ISBN": "0545591619"},
{"url": "https://www.goodreads.com/book/show/23621674-guardians-of-the-boundary", "num_ratings": "43", "num_reviews": "7", "avg_ratings": 4.28, "genres": ["Fantasy", "Young Adult", "The United States Of America"], "title": "Guardians of the Boundary", "description": ["The battle is over. Now it’s war.", "Valerie’s entire life has been spent fighting for survival. But now, the stakes have never been higher, and her enemies have never been more powerful.", "The Fractus have proven that they won’t hesitate to kill those who stand in their way, including the people Valerie loves. And their path of destruction is growing—on Earth and the Globe. With", "The battle is over. Now it’s war.", "Valerie’s entire life has been spent fighting for survival. But now, the stakes have never been higher, and her enemies have never been more powerful.", "The Fractus have proven that they won’t hesitate to kill those who stand in their way, including the people Valerie loves. And their path of destruction is growing—on Earth and the Globe. With Reaper always one step ahead, Valerie must find a way to change the game, or risk never catching up to an enemy with the conviction and power to upset the delicate balance that protects those without magic from being exploited.", "As the Fractus grow in number and strength, can Valerie convince enough Conjurors to fight by her side against a menace that could upend the universe?", "In the third novel of The Conjurors Series, Valerie has the life she’s always dreamed of—a family, a budding romance, and powerful magic that she is finally learning to harness. She also has an enemy determined to rip it all away from her."], "author": "Kristen Pham", "num_pages": "298", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-25 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7356333-sisters-strangers-and-starting-over", "num_ratings": "50", "num_reviews": "11", "avg_ratings": 3.64, "genres": ["Cultural"], "title": "Sisters, Strangers, and Starting Over", "description": ["Sometimes the family you've lost can lead you to the family you need...", "When Beatriz Sánchez-Milligan turned her back on her troubled sister, she ushered in a lifetime of regret. So when the niece Beatriz never knew she had appears on her doorstep--announcing that her mother has died--she can't help but see fourteen-year-old Celeste as a chance to redo the past . . . despit", "Sometimes the family you've lost can lead you to the family you need...", "When Beatriz Sánchez-Milligan turned her back on her troubled sister, she ushered in a lifetime of regret. So when the niece Beatriz never knew she had appears on her doorstep--announcing that her mother has died--she can't help but see fourteen-year-old Celeste as a chance to redo the past . . . despite her own family's objections.", "But Celeste is skittish around her new family. She can feel the tension radiating from her uncle and cousins and, despite her aunt's enthusiasm, is hesitant to share her dreams of the traditional quinceañera she and her mother had been planning. Overwhelmed, Celeste does what her mom did years ago: she vanishes. Terrified the past is repeating itself, Beatriz scrambles to uncover the mystery surrounding her sister's life and death?and build a future in which the niece she dearly loves is truly part of her family."], "author": "Belinda Acosta", "num_pages": "306", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2010-07-20 00:00:00", "ISBN": "0446540528"},
{"url": "https://www.goodreads.com/book/show/27969081-labyrinth-lost", "num_ratings": "6,361", "num_reviews": "1,687", "avg_ratings": 3.76, "genres": ["Fantasy", "Young Adult", "Lgbt", "Fantasy", "Paranormal", "Fiction"], "title": "Labyrinth Lost", "description": ["▶ ", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whos", "▶ ", "Nothing says Happy Birthday like summoning the spirits of your dead relatives.", "Alex is a bruja, the most powerful witch in a generation...and she hates magic. At her Deathday celebration, Alex performs a spell to rid herself of her power. But it backfires. Her whole family vanishes into thin air, leaving her alone with Nova, a brujo boy she can't trust. A boy whose intentions are as dark as the strange marks on his skin.", "The only way to get her family back is to travel with Nova to Los Lagos, a land in-between, as dark as Limbo and as strange as Wonderland..."], "author": "Zoraida Córdova", "num_pages": "324", "awards": [], "places": ["Los Lagos realm, Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2016-09-06 00:00:00", "ISBN": "1492620947"},
{"url": "https://www.goodreads.com/book/show/21444806-knights-of-light", "num_ratings": "52", "num_reviews": "17", "avg_ratings": 4.31, "genres": ["Fantasy", "Young Adult", "Adventure"], "title": "Knights of Light", "description": ["Leading means taking mortal risks. Hiding is not an option. ", "With a tumultuous year behind her, Valerie is ready to start a life that doesn’t include running from enemies and risking her life. Too bad someone wants her dead. ", "No matter how much she resists, Valerie is thrust into a position where it is up to her to lead the Conjurors against the power-hungry Fractus or suffe", "Leading means taking mortal risks. Hiding is not an option. ", "With a tumultuous year behind her, Valerie is ready to start a life that doesn’t include running from enemies and risking her life. Too bad someone wants her dead. ", "No matter how much she resists, Valerie is thrust into a position where it is up to her to lead the Conjurors against the power-hungry Fractus or suffer the consequences of two worlds ruled by those who wield magic as a weapon. But the clashes don’t stop on the battlefield. As Valerie finds herself torn between her new love and her best friend, it will be up to her to figure out who she can’t live without. ", "In the fast-paced second novel of The Conjurors Series, Valerie searches for the father she thought was long dead and begins to come to grips with the immensity of her new power. ", "The battle has begun."], "author": "Kristen Pham", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/353900.What_the_Moon_Saw", "num_ratings": "750", "num_reviews": "153", "avg_ratings": 4.18, "genres": ["Young Adult", "Fiction", "Realistic Fiction", "Childrens", "Middle Grade", "Cultural", "Family"], "title": "What the Moon Saw", "description": ["Clara Luna's name means \"clear moon\" in Spanish. But lately, her head has felt anything but clear. One day a letter comes from Mexico, written in Spanish: ", ". ", "Fourteen-year-old Clara has never met her father's parents", "Clara Luna's name means \"clear moon\" in Spanish. But lately, her head has felt anything but clear. One day a letter comes from Mexico, written in Spanish: ", ". ", "Fourteen-year-old Clara has never met her father's parents. She knows he snuck over the border from Mexico as a teenager, but beyond that, she knows almost nothing about his childhood. When she agrees to go, she's stunned by her grandparents' life: they live in simple shacks in the mountains of southern Mexico, where most people speak not only Spanish, but an indigenous language, Mixteco.", "The village of Yucuyoo holds other surprises, too-- like the spirit waterfall, which is heard but never seen. And Pedro, an intriguing young goatherder who wants to help Clara find the waterfall. Hearing her grandmother’s adventurous tales of growing up as a healer awakens Clara to the magic in Yucuyoo, and in her own soul. ", " is an enchanting story of discovering your true self in the most unexpected place."], "author": "Laura Resau", "num_pages": "272", "awards": ["Arizona YA Book Award", "Colorado Book Award for Young Adult (2007)", "Américas Award", "Colorado Authors’ League (CAL) Writing Awards for Middle Grade/Young Adult (2007)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "0385733437"},
{"url": "https://www.goodreads.com/book/show/19163433-the-society-of-imaginary-friends", "num_ratings": "193", "num_reviews": "57", "avg_ratings": 3.93, "genres": ["Fantasy", "Young Adult"], "title": "The Society of Imaginary Friends", "description": ["Belief is a powerful magic. ", "Valerie Diaz has a power that she can't contain, and it's killing her. ", "Bounced between foster homes and the streets, she only has time to concentrate on staying alive. But a visit from the imaginary friend of her childhood opens a world of possibilities, including a new life half", "Belief is a powerful magic. ", "Valerie Diaz has a power that she can't contain, and it's killing her. ", "Bounced between foster homes and the streets, she only has time to concentrate on staying alive. But a visit from the imaginary friend of her childhood opens a world of possibilities, including a new life half a universe away on a planet that is bursting with magic. ", "The Society of Imaginary Friends follows Valerie on a journey that straddles two worlds. In order to survive, she must travel many light years away to a realm where anything is possible. ", "On the Globe, imaginary friends come to life, the last of the unicorns rules the realm, and magic seeps from the pores of all the Conjurors who live there. ", "But choosing to embrace her potential will set Valerie on a treacherous course – one filled with true love, adventure and perilous danger."], "author": "Kristen Pham", "num_pages": "286", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-11 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26722944-future-shock", "num_ratings": "978", "num_reviews": "280", "avg_ratings": 3.76, "genres": ["Science Fiction", "Time Travel", "Young Adult", "Science Fiction", "Romance"], "title": "Future Shock", "description": ["Elena Martinez has street smarts, the ability for perfect recall, and a deadline: if she doesn’t find a job before she turns eighteen, she’ll be homeless. But then she gets an unexpected offer from Aether Corporation, the powerful Los Angeles tech giant. Along with four oth", "Elena Martinez has street smarts, the ability for perfect recall, and a deadline: if she doesn’t find a job before she turns eighteen, she’ll be homeless. But then she gets an unexpected offer from Aether Corporation, the powerful Los Angeles tech giant. Along with four other recruits—Adam, Chris, Trent, and Zoe—Elena is being sent on a secret mission to bring back data from the future. All they have to do is get Aether the information they need, and the five of them will be set for life. It’s an offer Elena can’t refuse.", "But something goes wrong when the time travelers arrive in the future. And they are forced to break the only rule they were given—not to look into their own fates. Now they have twenty-four hours to get back to the present and find a way to stop a seemingly inevitable future—and a murder—from happening. But changing the timeline has deadly consequences too. Who can Elena trust as she fights to save her life?", "The first book in an unforgettable series about rewriting your destiny in the city of dreams."], "author": "Elizabeth Briggs", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-01 00:00:00", "ISBN": "0807526827"},
{"url": "https://www.goodreads.com/book/show/18465852-the-book-of-unknown-americans", "num_ratings": "28,956", "num_reviews": "3,731", "avg_ratings": 3.87, "genres": ["Fiction", "Contemporary", "Audiobook"], "title": "The Book of Unknown Americans", "description": ["A dazzling, heartbreaking page-turner destined for breakout status: a novel that gives voice to millions of Americans as it tells the story of the love between a Panamanian boy and a Mexican girl: teenagers living in an apartment block of immigrant families like their own.", "After their daughter Maribel suffers a near-fatal accident, the Riveras leave México and come to Ameri", "A dazzling, heartbreaking page-turner destined for breakout status: a novel that gives voice to millions of Americans as it tells the story of the love between a Panamanian boy and a Mexican girl: teenagers living in an apartment block of immigrant families like their own.", "After their daughter Maribel suffers a near-fatal accident, the Riveras leave México and come to America. But upon settling at Redwood Apartments, a two-story cinderblock complex just off a highway in Delaware, they discover that Maribel's recovery--the piece of the American Dream on which they've pinned all their hopes--will not be easy. Every task seems to confront them with language, racial, and cultural obstacles.", "At Redwood also lives Mayor Toro, a high school sophomore whose family arrived from Panamá fifteen years ago. Mayor sees in Maribel something others do not: that beyond her lovely face, and beneath the damage she's sustained, is a gentle, funny, and wise spirit. But as the two grow closer, violence casts a shadow over all their futures in America.", "Peopled with deeply sympathetic characters, this poignant yet unsentimental tale of young love tells a riveting story of unflinching honesty and humanity that offers a resonant new definition of what it means to be an American. An instant classic is born."], "author": "Cristina Henriquez", "num_pages": "286", "awards": ["Andrew Carnegie Medal Nominee for Fiction (2015)", "Goodreads Choice Award Nominee for Fiction (2014)"], "places": [], "character_names": ["Arturo", "Mayor", "Maribel"], "language": "English", "publish_date": "2014-06-03 00:00:00", "ISBN": "0385350848"},
{"url": "https://www.goodreads.com/book/show/12902757-making-you-mine", "num_ratings": "9,374", "num_reviews": "389", "avg_ratings": 4.2, "genres": ["Romance", "New Adult", "Contemporary", "Romance", "Contemporary Romance"], "title": "Making You Mine", "description": ["New Adult/ Contemporary Romance", "Always in control, the meticulous and professional Salvador Moreno is thrown for a loop when the newly hired bartender Grace Zendejas suddenly invades his family’s restaurant, and infuriatingly, his every thought. For the first time in his life, Sal is fumbling. But after recovering from a few blunders he discovers his feelings for Grace run", "New Adult/ Contemporary Romance", "Always in control, the meticulous and professional Salvador Moreno is thrown for a loop when the newly hired bartender Grace Zendejas suddenly invades his family’s restaurant, and infuriatingly, his every thought. For the first time in his life, Sal is fumbling. But after recovering from a few blunders he discovers his feelings for Grace run much deeper.", "Things begin to heat up between him and Grace, but then the ever-perfect Sal does something even his brothers never did—screws up royally. Now he’s scrambling to cover up a mistake he knows could cost him dearly. As his relationship with Grace grows even more serious, Sal's secret is a ticking bomb, threatening to destroy the one thing he now lives and breathes for—his relationship with the love of his life—Grace."], "author": "Elizabeth Reyes", "num_pages": "372", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-12-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/19542841-more-happy-than-not", "num_ratings": "24,119", "num_reviews": "4,970", "avg_ratings": 4.07, "genres": ["Young Adult", "Lgbt", "Contemporary", "Fiction"], "title": "More Happy Than Not", "description": ["Part Eternal Sunshine of the Spotless Mind, part Aristotle and Dante Discover the Secrets of the Universe, Adam Silvera's extraordinary debut confronts race, class, and sexuality during one charged near-future summer in the Bronx. ", "Sixteen-year-old Aaron Soto is struggling to find happiness after a family tragedy leaves him reeling. He's slowly remembering what happiness mi", "Part Eternal Sunshine of the Spotless Mind, part Aristotle and Dante Discover the Secrets of the Universe, Adam Silvera's extraordinary debut confronts race, class, and sexuality during one charged near-future summer in the Bronx. ", "Sixteen-year-old Aaron Soto is struggling to find happiness after a family tragedy leaves him reeling. He's slowly remembering what happiness might feel like this summer with the support of his girlfriend Genevieve, but it's his new best friend, Thomas, who really gets Aaron to open up about his past and confront his future.", "As Thomas and Aaron get closer, Aaron discovers things about himself that threaten to shatter his newfound contentment. A revolutionary memory-alteration procedure, courtesy of the Leteo Institute, might be the way to straighten himself out. But what if it means forgetting who he truly is?"], "author": "Adam Silvera", "num_pages": "295", "awards": ["Goodreads Choice Award Nominee for Young Adult Fiction (2015)"], "places": ["Bronx, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2015-06-02 00:00:00", "ISBN": "1616955600"},
{"url": "https://www.goodreads.com/book/show/8427989-illegal", "num_ratings": "560", "num_reviews": "133", "avg_ratings": 3.76, "genres": ["Young Adult", "Realistic Fiction", "Young Adult", "Teen", "Cultural", "Fiction", "Contemporary"], "title": "Illegal", "description": ["Instead, Nora is on a desperate journey far away from home. When her father leaves their beloved Mexico in search of work, Nora stays behind. She fights to make sense of her loss while living in poverty—waiting for her father's return and a better day. When the letters and money stop co", "Instead, Nora is on a desperate journey far away from home. When her father leaves their beloved Mexico in search of work, Nora stays behind. She fights to make sense of her loss while living in poverty—waiting for her father's return and a better day. When the letters and money stop coming, Nora decides that she and her mother must look for him in Texas. After a frightening experience crossing the border, the two are all alone in a strange place. Now, Nora must find the strength to survive while aching for small comforts: friends, a new school, and her precious ", ".", "Bettina Restrepo's gripping, deeply hopeful debut novel captures the challenges of one girl's unique yet universal immigrant experience."], "author": "Bettina Restrepo", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-08 00:00:00", "ISBN": "0061953423"},
{"url": "https://www.goodreads.com/book/show/12026145-romero", "num_ratings": "7,186", "num_reviews": "318", "avg_ratings": 4.12, "genres": ["Romance", "New Adult", "Romance", "Contemporary Romance", "Contemporary"], "title": "Romero", "description": ["New Adult / Contemporary romance.", "Prim and proper middle school teacher Isabel Montenegro always runs the opposite direction from men like Ramon Romero. A foul-mouthed, uneducated, loose cannon has no place in her careful plans. But instead of running away, Isabel is completely captivated. The intensi", "New Adult / Contemporary romance.", "Prim and proper middle school teacher Isabel Montenegro always runs the opposite direction from men like Ramon Romero. A foul-mouthed, uneducated, loose cannon has no place in her careful plans. But instead of running away, Isabel is completely captivated. The intensity of his nature, while a bit daunting, mesmerizes her in ways she can’t begin to understand. She’s unwilling to walk away—even when her instincts are screaming at her to run.", "Romero has no idea what he's getting himself into when he first kisses Isabel. Shocked at the passion she invokes in him, he believes he can keep his usual short fuse under wraps. Falling fast and hard for someone so flawlessly sweet only makes him more aware that he’s far from perfect. If she is ever witness to his biggest imperfection, he’s sure she’ll bail. But when her meddling sister does the worst thing imaginable—bring other men between him and his Izzy—that fuse is lit and all bets are off.", "Can two people who are worlds apart teach each other how to love, or will the reality of their differences drive them apart?"], "author": "Elizabeth Reyes", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-10-24 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2815261-mexican-whiteboy", "num_ratings": "3,459", "num_reviews": "694", "avg_ratings": 3.89, "genres": ["Young Adult", "Sports and Games", "Sports", "Realistic Fiction", "Fiction", "Cultural", "Contemporary"], "title": "Mexican Whiteboy", "description": ["Danny's tall and skinny. Even though he’s not built, his arms are long enough to give his pitch a power so fierce any college scout would sign him on the spot. Ninety-five mile an hour fastball, but the boy’s not even on a team. Every time he gets up on the mound he loses it.", "But at his private school, they don’t expect much else from him. Danny’ s brown. Half-Mexican brown", "Danny's tall and skinny. Even though he’s not built, his arms are long enough to give his pitch a power so fierce any college scout would sign him on the spot. Ninety-five mile an hour fastball, but the boy’s not even on a team. Every time he gets up on the mound he loses it.", "But at his private school, they don’t expect much else from him. Danny’ s brown. Half-Mexican brown. And growing up in San Diego that close to the border means everyone else knows exactly who he is before he even opens his mouth. Before they find out he can’t speak Spanish, and before they realize his mom has blond hair and blue eyes, they’ve got him pegged. But it works the other way too. And Danny’s convinced it’s his whiteness that sent his father back to Mexico. ", "That’s why he’s spending the summer with his dad’s family. Only, to find himself, he may just have to face the demons he refuses to see--the demons that are right in front of his face. And open up to a friendship he never saw coming.", "Set in the alleys and on the ball fields of San Diego County, ", " is a story of friendship, acceptance, and the struggle to find your identity in a world of definitions."], "author": "Matt de la Pena", "num_pages": "249", "awards": ["Lincoln Award Nominee (2012)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-12 00:00:00", "ISBN": "0385733100"},
{"url": "https://www.goodreads.com/book/show/11480837-always-been-mine", "num_ratings": "10,724", "num_reviews": "421", "avg_ratings": 4.03, "genres": ["Romance", "New Adult", "Romance", "Contemporary Romance", "Contemporary", "Young Adult"], "title": "Always Been Mine", "description": ["New Adult/ Contemporary Romantic suspense: Contains adult content", "After one heartache too many, Valerie Zuniga vows to never let Alex Moreno hurt her again. A year later, she is forced to reunite with him at a party where one unexpected sizzling kiss tells her she’s far from over him. No way will she allow herself to get sucked back into that torment. She’ll resist him even", "New Adult/ Contemporary Romantic suspense: Contains adult content", "After one heartache too many, Valerie Zuniga vows to never let Alex Moreno hurt her again. A year later, she is forced to reunite with him at a party where one unexpected sizzling kiss tells her she’s far from over him. No way will she allow herself to get sucked back into that torment. She’ll resist him even if that means using the one thing that’ll stop Alex dead in his tracks: another man. ", "Alex is coming off one of the worst years of his life. He spent so much time wallowing in self-pity, he never realized how much he’d missed Valerie. That is, until that kiss. Now, he’s determined to get her back one way or another, and no other man will stand in his way. Especially after discovering that Valerie may be in danger, a danger he blames himself for."], "author": "Elizabeth Reyes", "num_pages": "372", "awards": [], "places": [], "character_names": ["Sarah Parker", "Angel Moreno", "Eric Diego", "Sofia Moreno", "Alex Moreno", "Ramon Romero", "Valerie Zuniga", "Sal Moreno"], "language": "English", "publish_date": "2011-05-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12286734-sweet-sofie", "num_ratings": "7,650", "num_reviews": "275", "avg_ratings": 3.89, "genres": ["Romance", "New Adult", "Young Adult", "Romance", "Contemporary Romance"], "title": "Sweet Sofie", "description": ["Her entire life Sofia Moreno has dealt with her overprotective brothers. With three overbearing brothers always lurking, no boy would dare reach out to her. Luckily for Sofia the one boy she's got her heart set on has always been within reach: her brothers best friend Eric. Even though his loyalty to her brothers runs deep, Sofia knows there is only so much he can do befor", "Her entire life Sofia Moreno has dealt with her overprotective brothers. With three overbearing brothers always lurking, no boy would dare reach out to her. Luckily for Sofia the one boy she's got her heart set on has always been within reach: her brothers best friend Eric. Even though his loyalty to her brothers runs deep, Sofia knows there is only so much he can do before giving in to her.", "Two years older than her, Eric Diego has always known there would be hell to pay if he messed with his best friend's kid sister Sofia. Through the years he watches as she blooms into a beautiful young lady right before his eyes. With teenage hormones raging and Sofia more than willing, Eric agrees to the unthinkable. A forbidden secret romance. Feeling emotions and a feverish passion that's new to them both, neither is ready for how quickly their romance spins out of control."], "author": "Elizabeth Reyes", "num_pages": "223", "awards": [], "places": [], "character_names": ["Sarah Parker", "Angel Moreno", "Eric Diego", "Sofia Moreno", "Alex Moreno", "Ramon Romero", "Valerie Zuniga", "Sal Moreno"], "language": "English", "publish_date": "2011-08-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/89763.Esperanza_Rising", "num_ratings": "56,269", "num_reviews": "5,255", "avg_ratings": 3.94, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Childrens", "Middle Grade", "Childrens", "Cultural"], "title": "Esperanza Rising", "description": ["Esperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance", "Esperanza thought she'd always live with her family on their ranch in Mexico--she'd always have fancy dresses, a beautiful home, and servants. But a sudden tragedy forces Esperanza and Mama to flee to California during the Great Depression, and to settle in a camp for Mexican farm workers. Esperanza isn't ready for the hard labor, financial struggles, or lack of acceptance she now faces. When their new life is threatened, Esperanza must find a way to rise above her difficult circumstances--Mama's life, and her own, depend on it."], "author": "Pam Muñoz Ryan", "num_pages": "304", "awards": ["Jane Addams Children's Book Award for Older Children (2001)", "California Young Readers Medal Nominee for Middle School/Junior High (2003)", "Judy Lopez Memorial Award for Children's Literature (2001)", "Pura Belpré Award for Narrative (2002)"], "places": ["Aguascalientes", "California"], "character_names": [], "language": "English", "publish_date": "2002-09-27 00:00:00", "ISBN": "043912042X"},
{"url": "https://www.goodreads.com/book/show/9279734-forever-mine", "num_ratings": "22,806", "num_reviews": "1,033", "avg_ratings": 3.87, "genres": ["Romance", "Young Adult", "Contemporary", "Romance", "Contemporary Romance"], "title": "Forever Mine", "description": ["Seventeen-year old Sarah’s life is turned upside down when her single mom is sent to jail. She’s forced to move, leaving behind everything she’s ever known, including her best friend Sydney. Lost and bitter in a new school, her one goal is to save money and move back home. Then she meets Angel Moreno.", "Enigmatic but gorgeous, Angel is almost too good to be true. Except for o", "Seventeen-year old Sarah’s life is turned upside down when her single mom is sent to jail. She’s forced to move, leaving behind everything she’s ever known, including her best friend Sydney. Lost and bitter in a new school, her one goal is to save money and move back home. Then she meets Angel Moreno.", "Enigmatic but gorgeous, Angel is almost too good to be true. Except for one thing, his archaic belief that guys and girls can never be “just friends”. The problem? Sarah’s best friend Sydney is not a girl.", "With their unexpected romance intensifying to places neither ever experienced, how long can Sarah keep Angel in the dark about the guy waiting for her back home?", "And you haven't already, read the ", " on my blog!"], "author": "Elizabeth Reyes", "num_pages": "334", "awards": [], "places": ["La Jolla, San Diego, California"], "character_names": ["Sarah Parker", "Angel Moreno", "Eric Diego", "Sofia Moreno", "Alex Moreno", "Ramon Romero", "Valerie Zuniga", "Sal Moreno"], "language": "English", "publish_date": "2010-09-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12000020-aristotle-and-dante-discover-the-secrets-of-the-universe", "num_ratings": "159,127", "num_reviews": "23,968", "avg_ratings": 4.35, "genres": ["Young Adult", "Lgbt", "Contemporary", "Romance"], "title": "Aristotle and Dante Discover the Secrets of the Universe", "description": ["Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this fr", "Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be."], "author": "Benjamin Alire Sáenz", "num_pages": "359", "awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2013)", "Michael L. Printz Award Nominee (2016)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2015)", "Lambda Literary Award for LGBT Children's/Young Adult (2013)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2015)", "Amelia Elizabeth Walden Award Nominee (2013)", "Lincoln Award Nominee (2016)", "Pura Belpré Award for Narrative (2013)", "Les Incorruptibles (2017)"], "places": ["El Paso, Texas", "Texas"], "character_names": ["Aristotle \"Ari\" Mendoza", "Dante Quintana"], "language": "English", "publish_date": "2012-02-21 00:00:00", "ISBN": "1442408928"},
{"url": "https://www.goodreads.com/book/show/8662836-chain-reaction", "num_ratings": "55,928", "num_reviews": "2,748", "avg_ratings": 4.1, "genres": ["Young Adult", "Romance", "Contemporary", "Realistic Fiction"], "title": "Chain Reaction", "description": ["Luis Fuentes is a good boy who doesn't live with the angst that his big brothers, Alex and Carlos, have always lived with. Luis is smart, funny, and has big dreams of becoming an astronaut. But when he falls for the wrong girl, ", "Luis enters a dark world he's never known, and just when he thinks he's got life all figured out, learns some disturbing news about his family that", "Luis Fuentes is a good boy who doesn't live with the angst that his big brothers, Alex and Carlos, have always lived with. Luis is smart, funny, and has big dreams of becoming an astronaut. But when he falls for the wrong girl, ", "Luis enters a dark world he's never known, and just when he thinks he's got life all figured out, learns some disturbing news about his family that destroys his positive outlook on life. Will that Fuentes bad boy streak come out with a vengeance and lure Luis to live on the edge like his new girlfriend and his own father?"], "author": "Simone Elkeles", "num_pages": "319", "awards": ["Goodreads Choice Award Nominee for Best Young Adult Fiction (2011)"], "places": [], "character_names": ["Luis Fuentes", "Nikki Cruz"], "language": "English", "publish_date": "2011-08-16 00:00:00", "ISBN": "0802720870"},
{"url": "https://www.goodreads.com/book/show/7137775-rules-of-attraction", "num_ratings": "75,827", "num_reviews": "3,787", "avg_ratings": 4.21, "genres": ["Young Adult", "Romance", "Contemporary", "Realistic Fiction"], "title": "Rules of Attraction", "description": ["Carlos Fuentes doesn't want any part of the life his older brother, Alex, has laid out for him in Boulder, Colorado. He wants to keep living on the edge, and carve his own path-just like Alex did. Unfortunately, his ties to a Mexican gang aren't easy to break, and he soon finds himself being set up by a drug lord. ", "When Alex arranges for Carlos to live with his former profe", "Carlos Fuentes doesn't want any part of the life his older brother, Alex, has laid out for him in Boulder, Colorado. He wants to keep living on the edge, and carve his own path-just like Alex did. Unfortunately, his ties to a Mexican gang aren't easy to break, and he soon finds himself being set up by a drug lord. ", "When Alex arranges for Carlos to live with his former professor and his family to keep him from being sent to jail, Carlos feels completely out of place. He's even more thrown by his strong feelings for the professor's daughter, Kiara, who is nothing like the girls he's usually drawn to. But Carlos and Kiara soon discover that in matters of the heart, the rules of attraction overpower the social differences that conspire to keep them apart.", "As the danger grows for Carlos, he's shocked to discover that it's this seemingly All-American family who can save him. But is he willing to endanger their safety for a chance at the kind of life he's never even dreamed possible?"], "author": "Simone Elkeles", "num_pages": "336", "awards": ["RITA Award by Romance Writers of America Nominee for Young Adult Romance (2011)", "Goodreads Choice Award Nominee for Young Adult Fiction (2010)", "Missouri Gateway Readers Award Nominee (2013)"], "places": ["Boulder, Colorado"], "character_names": ["Carlos Fuentes", "Kiara Westford", "Richard Westford", "Brandon Westford", "Alex Fuentes"], "language": "English", "publish_date": "2010-04-13 00:00:00", "ISBN": "0802720854"}
]