[
{"url": "https://www.goodreads.com/book/show/77203.The_Kite_Runner", "num_ratings": "2,054,984", "num_reviews": "63,991", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "The Kite Runner", "description": ["Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amid", "Amir is the son of a wealthy Kabul merchant, a member of the ruling caste of Pashtuns. Hassan, his servant and constant companion, is a Hazara, a despised and impoverished caste. Their uncommon bond is torn by Amir's choice to abandon his friend amidst the increasing ethnic, religious, and political tensions of the dying years of the Afghan monarchy, wrenching them far apart. But so strong is the bond between the two boys that Amir journeys back to a distant world, to try to right past wrongs against the only true friend he ever had.", "The unforgettable, heartbreaking story of the unlikely friendship between a wealthy boy and the son of his father’s servant, ", " is a beautifully crafted novel set in a country that is in the process of being destroyed. It is about the power of reading, the price of betrayal, and the possibility of redemption; and an exploration of the power of fathers over sons—their love, their sacrifices, their lies.", "A sweeping story of family, love, and friendship told against the devastating backdrop of the history of Afghanistan over the last thirty years, ", " is an unusual and powerful novel that has become a beloved, one-of-a-kind classic."], "author": "Khaled Hosseini", "num_pages": "371", "awards": ["Borders Original Voices Award for Fiction (2003)", "Humo's Gouden Bladwijzer (2008)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Puddly Award for Fiction (2006)", "Lincoln Award Nominee (2006)", "Prix des libraires du Québec for Lauréats hors Québec (2006)"], "places": ["Kabul", "Fremont, California", "Afghanistan", "Peshawar"], "character_names": ["Amir", "Hassan", "Assef", "Bába", "Sohrab", "Soraya", "Rahim Khan"], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "1594480001"},
{"url": "https://www.goodreads.com/book/show/178460.Slave", "num_ratings": "6,574", "num_reviews": "518", "avg_ratings": 4.3, "genres": ["Nonfiction", "Cultural", "Africa", "Biography", "Autobiography", "Memoir", "Biography", "Autobiography"], "title": "Slave: My True Story", "description": ["Mende Nazer lost her childhood at age twelve, when she was sold into slavery. It all began one horrific night in 1993, when Arab raiders swept through her Nuba village, murdering the adults and rounding up thirty-one children, including Mende.", " Mende was sold to a wealthy Arab family who lived in Sudan's capital city, Khartoum. So began her dark years of enslavement. Her Ar", "Mende Nazer lost her childhood at age twelve, when she was sold into slavery. It all began one horrific night in 1993, when Arab raiders swept through her Nuba village, murdering the adults and rounding up thirty-one children, including Mende.", " Mende was sold to a wealthy Arab family who lived in Sudan's capital city, Khartoum. So began her dark years of enslavement. Her Arab owners called her \"Yebit,\" or \"black slave.\" She called them \"master.\" She was subjected to appalling physical, sexual, and mental abuse. She slept in a shed and ate the family leftovers like a dog. She had no rights, no freedom, and no life of her own.", " Normally, Mende's story never would have come to light. But seven years after she was seized and sold into slavery, she was sent to work for another master—a diplomat working in the United Kingdom. In London, she managed to make contact with other Sudanese, who took pity on her. In September 2000, she made a dramatic break for freedom.", " is a story almost beyond belief. It depicts the strength and dignity of the Nuba tribe. It recounts the savage way in which the Nuba and their ancient culture are being destroyed by a secret modern-day trade in slaves. Most of all, it is a remarkable testimony to one young woman's unbreakable spirit and tremendous courage."], "author": "Mende Nazer", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-27 00:00:00", "ISBN": "1586483188"},
{"url": "https://www.goodreads.com/book/show/905710.Funny_Boy", "num_ratings": "3,994", "num_reviews": "329", "avg_ratings": 3.92, "genres": ["Fiction", "Lgbt", "Historical", "Historical Fiction", "Glbt", "Queer", "Cultural", "Canada"], "title": "Funny Boy: A Novel in Six Stories", "description": ["In the world of his large family, affluent Tamils living in Colombo, Arjie is an oddity, a 'funny boy' who prefers dressing as a girl to playing cricket with his brother. In FUNNY BOY we follow the life of the family through Arjie's eyes, as he comes to terms both with his own homo-sexuality and with the racism of the society in which he lives. In the north of Sri Lanka th", "In the world of his large family, affluent Tamils living in Colombo, Arjie is an oddity, a 'funny boy' who prefers dressing as a girl to playing cricket with his brother. In FUNNY BOY we follow the life of the family through Arjie's eyes, as he comes to terms both with his own homo-sexuality and with the racism of the society in which he lives. In the north of Sri Lanka there is a war going on between the army and the Tamil Tigers, and gradually it begins to encroach on the family's comfortable life. Sporadic acts of violence flare into full scale riots and lead, ultimately, to tragedy. Written in clear, simple prose, Syam Selvadurai's first novel is masterly in its mingling of the personal and political."], "author": "Shyam Selvadurai", "awards": ["Scotiabank Giller Prize Nominee (1994)", "Lambda Literary Award for Gay Men's Fiction (1997)", "Amazon.ca First Novel Award (1994)"], "places": [], "character_names": [], "language": "English", "publish_date": "1995-10-05 00:00:00", "ISBN": "0099459213"},
{"url": "https://www.goodreads.com/book/show/288644.Q_A", "num_ratings": "27,969", "num_reviews": "2,709", "avg_ratings": 3.98, "genres": ["Cultural", "India", "Contemporary", "Cultural", "Asia", "Drama", "Fiction", "Novels", "Audiobook", "Media Tie In", "Movies", "Adult Fiction", "Asian Literature", "Indian Literature"], "title": "Q & A", "description": [" spectacular debut novel opens in a jail cell in Mumbai, India, where Ram Mohammad Thomas is being held after correctly answering all twelve questions on India's biggest quiz show, Who Will Win a Billion? It is hard to believe that a poor orphan who has never read a newspaper or gone to school could win such a contest. But through a series of exhilarating tal", " spectacular debut novel opens in a jail cell in Mumbai, India, where Ram Mohammad Thomas is being held after correctly answering all twelve questions on India's biggest quiz show, Who Will Win a Billion? It is hard to believe that a poor orphan who has never read a newspaper or gone to school could win such a contest. But through a series of exhilarating tales Ram explains to his lawyer how episodes in his life gave him the answer to each question.", "Ram takes us on an amazing review of his own history - from the day he was found as a baby in the clothes donation box of a Delhi church to his employment by a faded Bollywood star to his adventure with a security-crazed Australian army colonel to his career as an overly creative tour guide at the Taj Mahal.", " is a beguiling blend of high comedy, drama, and romance that reveals how we know what we know - not just about trivia, but about life itself. Cutting across humanity in all its squalor and glory, ", " presents a kaleidoscopic vision of the struggle between good and evil - and what happens when one boy has no other choice in life but to survive."], "author": "Vikas Swarup", "num_pages": "318", "awards": ["Exclusive Books Boeke Prize (2006)"], "places": ["India"], "character_names": ["Ram Mohammad Thomas"], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0739467042"},
{"url": "https://www.goodreads.com/book/show/30289588-go-clown---acchedin-for-comedy", "num_ratings": "110", "num_reviews": "66", "avg_ratings": 3.7, "genres": [], "title": "Go Clown - #AccheDin for Comedy", "description": ["When Baby Kiriti arrived in this world, he was like a lost butterfly in a sea of white. A baby who is born and thrust into the huge sea of humanity called India, rides and steers his destiny ship, as he constantly grapples with the Clown inside him, who meanwhile brings out his own set of funny oars in these troubled waters. ", "The Clown's journey continues on from a Karma-Gu", "When Baby Kiriti arrived in this world, he was like a lost butterfly in a sea of white. A baby who is born and thrust into the huge sea of humanity called India, rides and steers his destiny ship, as he constantly grapples with the Clown inside him, who meanwhile brings out his own set of funny oars in these troubled waters. ", "The Clown's journey continues on from a Karma-Guru to a trader of special water from Europe (thanks to his Made-in-China friend!), and from a music director (the Bad-Boy theme!) to the founder of a school, and a dirty sock to a sex-crazed, horny bunch of young fellas. The colors of the Clown's comedy are different but he always plays to the circus of life. As Kiriti encounters a wide array of characters from the length and breadth of India, a land as rich as its flavours, the carefree years full of joy and young hopes come to an end, with the sweet smell of Ganja still lingering under the starry nights. The philosophy of Meaning is preached, after a session of holy smokes, on the sides of a dusty highway which sees blood and grime daily. ", "And finally with the Mystical Game which casts a shadow on Kiriti's life having been won, everything is laid to rest under a blanket of white, only to be stumbled upon by a Sherpa on the peaks of the mighty Himalayas that wakes up something inside of his adorable son! ", "Is it a Thief, his Dream or the Clown? ", "And there is a 2000 year old Surprise Gift with the Novel! (Any Guesses?)", "The Following are Reviews from Amazon India & Amazon (International):", "One Five Star Review", "\"This Novel 'Go Clown'- #AccheDin for Comedy, was sent to one of my colleagues for a possible review and I picked it up as I remember reading the author's words somewhere online (who apparently contributes to Times of India, Faking News & Huffington Post) - 'Life is like a meandering stream, and I am like a free butterfly hovering around it.'", "Anyway coming to the book 'Go Clown'. It was a blast! Fasten your seat belts and get ready for this hilarious ride! I would especially recommend the train scene (Nirvana in Indian Railways!), the weed/Ganja scene, the College part, the NRI Stuff, the ad and on and on which I could so well relate to. It was reliving my collage days and the fond and the occasional bitter memories. You are going to Laugh and then cry (again with Laughter!)", "The story and the way the magical realism turns out is plain amazing. And nothing which has ever been written has described the colours of an Indian Life so closely and in such a comedic way. And the free gift in the novel was a pleasant surprise (the Go game)! As someone interested in geopolitics and strategies I took an instant liking for the game.", "After Amish and Chetan everyone has been trying to directly or indirectly copy a fantasy theme or a love story. They have mass produced thousands of such books killing the Indian Readers taste. I think 'Go Clown\", a comedy, has added some new tinge to Indian fiction.", "Disclaimer: In this generation of authors getting reviews from friends and family I would suggest you better read their free excerpt/Sample chapter on their website so you figure it out on your own!", "No wonder they proclaim on their website that they got 5000 hits for their sample on the first day it was put up, and 2,50,000 views for their official trailer on Facebook & YouTube.\"", "One Four Star Review:", "\"A copy of the novel \"GoClown - AccheDin for Comedy\" was sent to our college literary club which a friend suggested I read. So I took it on flight to spend time when travelling from Darjeeling to Delhi. On the flight I started laughing hysterically. An elderly woman seated beside me initially gave a stern look as if I was being deliberately loud. I explained to her that it was the book.", "This book is like the sweet smell of earth after the first rains (a line from GoClown - #AccheDin for Comedy). My #AccheDin did start! The college part left me in tears (with laughter), and not to forget the passion scene (GoClown also explains the body's reaction in a very comedic way!).", "Above all it is like an ocean of Comedy with islands in it, all of which are in shapes of different letters, that sum up to form a brilliant story! The Game and the strategy was mind-blowing!\"", "One Five Star Review", "\"Go Clown is an hilarious Odyssey spanning across two continents Asia and America.", "Kiriti the protagonist and The Clown his true \"side kick\" speak to every human soul , for such is its universality.", "This blissful tale can be juxtaposed in any setting. Be it Boston, Berlin, Beijing , Bangalore or Bogota.", "Go Clown is set in the theater of Life where Charles Dickens works with Mark Twain, to present a mirthful narrative to the reader.", "A must read.\""], "author": "Shatrugna Vadwlas", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-08-20 00:00:00", "ISBN": "9384439835"},
{"url": "https://www.goodreads.com/book/show/24034941-the-kaleidoscope", "num_ratings": "40", "num_reviews": "10", "avg_ratings": 4.05, "genres": ["Science Fiction", "Fiction", "Philosophy", "Futurism"], "title": "The Kaleidoscope: The Gift of Madness", "description": ["The rise of Alec Helena's most ambitious dream creates an existential shift tainted by an imperfect god. The first generation of life beyond humanity will be riddled with inherit contradictions. Every new life will have its own challenges and strive to find meaning. When androids become the next unwelcome native immigrants, they will be faced with humanity's foreign and do", "The rise of Alec Helena's most ambitious dream creates an existential shift tainted by an imperfect god. The first generation of life beyond humanity will be riddled with inherit contradictions. Every new life will have its own challenges and strive to find meaning. When androids become the next unwelcome native immigrants, they will be faced with humanity's foreign and domestic failures. Can the oppressed forgive their oppressors, or are the scars of such trespasses too deeply ingrained?"], "author": "Adrian Mendoza", "num_pages": "184", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-22 00:00:00", "ISBN": "1505209358"},
{"url": "https://www.goodreads.com/book/show/17925536-no-surrender-soldier", "num_ratings": "129", "num_reviews": "45", "avg_ratings": 3.94, "genres": ["Young Adult", "Fiction", "Historical", "Historical", "Historical Fiction", "War"], "title": "No Surrender Soldier", "description": ["A young man, an old soldier , and a terrible injustice. Should the punishment be death?", "Growing up on Guam in 1972, fifteen-year-old Kiko is beset by worries: He’s never kissed a girl, and he thinks it’s possible he never will. The popular guys get all the attention, but the worst part is that Kiko has serious problems at home. His older brother is missing in Vietnam; his g", "A young man, an old soldier , and a terrible injustice. Should the punishment be death?", "Growing up on Guam in 1972, fifteen-year-old Kiko is beset by worries: He’s never kissed a girl, and he thinks it’s possible he never will. The popular guys get all the attention, but the worst part is that Kiko has serious problems at home. His older brother is missing in Vietnam; his grandfather is losing it to dementia; he just learned that his mother was raped in World War II by a Japanese soldier. It all comes together when he discovers an old man, a Japanese soldier, hiding in the jungle behind his house. It’s not the same man who raped his mother, but, in his rage, Kiko cares only about protecting his family and avenging his mom – no matter what it takes. And so, a shy, peaceable boy begins to plan a murder. But how far will Kiko go to prove to himself that he’s a man ? Based on a historical incident, No Surrender Soldier is the story of a boy grappling with ancient questions of courage and manhood before he can move on."], "author": "Christine Kohler", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-01-01 00:00:00", "ISBN": "1440565619"},
{"url": "https://www.goodreads.com/book/show/7141642-the-thousand-autumns-of-jacob-de-zoet", "num_ratings": "45,548", "num_reviews": "5,455", "avg_ratings": 4.03, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Japan", "Historical", "Literary Fiction"], "title": "The Thousand Autumns of Jacob de Zoet", "description": ["In 1799, Jacob de Zoet disembarks on the tiny island of Dejima, the Dutch East India Company’s remotest trading post in a Japan otherwise closed to the outside world. A junior clerk, his task is to uncover evidence of the previous Chief Resident’s corruption.", "Cold-shouldered by his compatriots, Jacob earns the trust of a local interpreter and, more dangerously, becomes intr", "In 1799, Jacob de Zoet disembarks on the tiny island of Dejima, the Dutch East India Company’s remotest trading post in a Japan otherwise closed to the outside world. A junior clerk, his task is to uncover evidence of the previous Chief Resident’s corruption.", "Cold-shouldered by his compatriots, Jacob earns the trust of a local interpreter and, more dangerously, becomes intrigued by a rare woman—a midwife permitted to study on Dejima under the company physician. He cannot foresee how disastrously each will be betrayed by someone they trust, nor how intertwined and far-reaching the consequences.", "Duplicity and integrity, love and lust, guilt and faith, cold murder and strange immortality stalk the stage in this enthralling novel, which brings to vivid life the ordinary—and extraordinary—people caught up in a tectonic shift between East and West."], "author": "David Mitchell", "num_pages": "479", "awards": ["Man Booker Prize Nominee for Longlist (2010)", "James Tait Black Memorial Prize Nominee for Fiction (2010)", "Macavity Award Nominee for Sue Feder Historical Mystery (2011)", "Commonwealth Writers' Prize for Best Book in South Asia and Europe (2011)", "Walter Scott Prize Nominee (2011)", "Goodreads Choice Award Nominee for Favorite Book, Fiction (2010)", "Europese Literatuurprijs Nominee (2011)"], "places": ["Dejima"], "character_names": ["Jacob de Zoet"], "language": "English", "publish_date": "2010-06-29 00:00:00", "ISBN": "1400065453"},
{"url": "https://www.goodreads.com/book/show/39242.The_Milagro_Beanfield_War", "num_ratings": "8,941", "num_reviews": "332", "avg_ratings": 4.09, "genres": ["Fiction", "Magical Realism", "Historical", "Historical Fiction", "Humor", "Novels"], "title": "The Milagro Beanfield War", "author": "John     Nichols", "num_pages": "456", "awards": [], "places": ["New Mexico"], "character_names": [], "language": "English", "publish_date": "2000-02-15 00:00:00", "ISBN": "0805063749"},
{"url": "https://www.goodreads.com/book/show/30861.Woman_Hollering_Creek_and_Other_Stories", "num_ratings": "7,821", "num_reviews": "386", "avg_ratings": 4.03, "genres": ["Short Stories", "Fiction", "Feminism", "Poetry", "Literature"], "title": "Woman Hollering Creek and Other Stories", "description": ["From the author of the widely acclaimed The House on Mango Street comes a story collection of breathtaking range and authority, whose characters give voice to the vibrant and varied life on both sides of the Mexican border. The women in these stories offer tales of pure discovery, filled with moments of infinite and intimate wisdom."], "author": "Sandra Cisneros", "num_pages": "192", "awards": ["Anisfield-Wolf Book Award (1993)"], "places": [], "character_names": [], "language": "English", "publish_date": "1992-03-03 00:00:00", "ISBN": "0679738568"},
{"url": "https://www.goodreads.com/book/show/19661.Family_Matters", "num_ratings": "18,901", "num_reviews": "872", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "India", "Asian Literature", "Indian Literature", "Cultural", "Canada"], "title": "Family Matters", "description": ["Rohinton Mistry’s enthralling novel is at once a domestic drama and an intently observed portrait of present-day Bombay in all its vitality and corruption. At the age of seventy-nine, Nariman Vakeel, already suffering from Parkinson’s disease, breaks an ankle and finds himself wholly dependent on his family. His step-children, Coomy and Jal, have a spacious apartment (in t", "Rohinton Mistry’s enthralling novel is at once a domestic drama and an intently observed portrait of present-day Bombay in all its vitality and corruption. At the age of seventy-nine, Nariman Vakeel, already suffering from Parkinson’s disease, breaks an ankle and finds himself wholly dependent on his family. His step-children, Coomy and Jal, have a spacious apartment (in the inaptly named Chateau Felicity), but are too squeamish and resentful to tend to his physical needs.", "Nariman must now turn to his younger daughter, Roxana, her husband, Yezad, and their two sons, who share a small, crowded home. Their decision will test not only their material resources but, in surprising ways, all their tolerance, compassion, integrity, and faith. Sweeping and intimate, tragic and mirthful, ", " is a work of enormous emotional power."], "author": "Rohinton Mistry", "num_pages": "500", "awards": ["Man Booker Prize Nominee (2002)", "James Tait Black Memorial Prize Nominee for Fiction (2002)", "Canadian Authors Association Award for Fiction (2003)", "Kiriyama Prize for Fiction (2002)", "Premi Llibreter de narrativa Nominee (2003)"], "places": ["Mumbai"], "character_names": [], "language": "English", "publish_date": "2003-11-18 00:00:00", "ISBN": "037570342X"},
{"url": "https://www.goodreads.com/book/show/6149.Beloved", "num_ratings": "265,879", "num_reviews": "8,680", "avg_ratings": 3.79, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Literature", "Magical Realism"], "title": "Beloved", "description": ["Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by", "Staring unflinchingly into the abyss of slavery, this spellbinding novel transforms history into a story as powerful as Exodus and as intimate as a lullaby. ", "Sethe was born a slave and escaped to Ohio, but eighteen years later she is still not free. She has too many memories of Sweet Home, the beautiful farm where so many hideous things happened. Her new home is haunted by the ghost of her baby, who died nameless and whose tombstone is engraved with a single word: Beloved. ", "Filled with bitter poetry and suspense as taut as a rope, ", " is a towering achievement by Nobel Prize laureate Toni Morrison."], "author": "Toni Morrison", "num_pages": "324", "awards": ["Pulitzer Prize for Fiction (1988)", "American Book Award (1988)", "Anisfield-Wolf Book Award (1988)", "National Book Critics Circle Award Nominee for Fiction (1987)", "Frederic G. Melcher Book Award (1988)", "National Book Award Finalist for Fiction (1987)"], "places": ["Delaware", "Ohio", "Kentucky"], "character_names": ["Baby Suggs", "Sethe", "Beloved", "Paul D Garner", "Denver"], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "1400033411"},
{"url": "https://www.goodreads.com/book/show/16066887-painted-hands", "num_ratings": "334", "num_reviews": "83", "avg_ratings": 3.96, "genres": ["Fiction", "Religion", "Womens Fiction", "Chick Lit", "Islam", "Muslims", "Romance", "Feminism"], "title": "Painted Hands", "description": ["Muslim bad girl Zainab Mir has just landed a job working for a post-feminist, Republican Senate candidate. Her best friend Amra Abbas is about to make partner at a top Boston law firm. Together they’ve thwarted proposal-slinging aunties, cultural expectations, and the occasional bigot to succeed in their careers. What they didn’t count on? Unlikely men and geopolitical fir", "Muslim bad girl Zainab Mir has just landed a job working for a post-feminist, Republican Senate candidate. Her best friend Amra Abbas is about to make partner at a top Boston law firm. Together they’ve thwarted proposal-slinging aunties, cultural expectations, and the occasional bigot to succeed in their careers. What they didn’t count on? Unlikely men and geopolitical firestorms.", "When a handsome childhood friend reappears, Amra makes choices that Zainab considers so 1950s—choices that involve the perfect ", "silk dress and a four-bedroom house in the suburbs. After hiding her long work hours during their courtship, Amra struggles to balance her demanding job and her unexpectedly traditional new husband.", "Zainab has her own problems. She generates controversy in the Muslim community with a suggestive magazine spread and friendship with a gay reporter. Her rising profile also inflames neocons like Chase Holland, the talk radio host who attacks her religion publicly but privately falls for her hard. When the political fallout from a terrorist attempt jeopardizes Zainab's job and protests surrounding a woman-led Muslim prayer service lead to violence, Amra and Zainab must decide what they’re willing to risk for their principles, their friendship, and love."], "author": "Jennifer Zobair", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2013-06-11 00:00:00", "ISBN": "1250027012"},
{"url": "https://www.goodreads.com/book/show/19000.The_Constant_Gardener", "num_ratings": "18,114", "num_reviews": "1,137", "avg_ratings": 3.78, "genres": ["Fiction", "Thriller", "Mystery", "Cultural", "Africa", "Spy Thriller", "Espionage"], "title": "The Constant Gardener", "description": [" ", " is a magnificent exploration of the new world order by one of the most compelling and elegant storytellers of our time. The novel opens in northern Kenya with the gruesome murder of Tessa Quayle--young, beautiful, and dearly beloved to husband Justi", " ", " is a magnificent exploration of the new world order by one of the most compelling and elegant storytellers of our time. The novel opens in northern Kenya with the gruesome murder of Tessa Quayle--young, beautiful, and dearly beloved to husband Justin. When Justin sets out on a personal odyssey to uncover the mystery of her death, what he finds could make him not only a suspect among his own colleagues, but a target for Tessa's killers as well. ", " A master chronicler of the betrayals of ordinary people caught in political conflict, John le Carre portrays the dark side of unbridled capitalism as only he can. In ", " he tells a compelling, complex story of a man elevated through tragedy as Justin Quayle--amateur gardener, aging widower, and ineffectual bureaucrat--discovers his own natural resources and the extraordinary courage of the woman he barely had time to love."], "author": "John le Carré", "num_pages": "496", "awards": [], "places": ["Nairobi", "London, England"], "character_names": ["Tessa Quayle", "Justin Quayle", "Sandy Woodrow", "Arnold Bluhm"], "language": "English", "publish_date": "2005-08-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/139253.The_House_on_Mango_Street", "num_ratings": "98,014", "num_reviews": "8,146", "avg_ratings": 3.6, "genres": ["Fiction", "Young Adult", "Classics", "Short Stories", "Academic", "School"], "title": "The House on Mango Street", "description": ["Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up", "Acclaimed by critics, beloved by readers of all ages, taught everywhere from inner-city grade schools to universities across the country, and translated all over the world, ", " is the remarkable story of Esperanza Cordero. ", "Told in a series of vignettes – sometimes heartbreaking, sometimes deeply joyous–it is the story of a young Latina girl growing up in Chicago, inventing for herself who and what she will become. Few other books in our time have touched so many readers."], "author": "Sandra Cisneros", "num_pages": "110", "awards": ["American Book Award (1985)", "George C. Stone Center for Children's Books Recognition of Merit Award (1994)"], "places": ["Chicago, Illinois"], "character_names": ["Esperanza", "Nenny"], "language": "English", "publish_date": "2009-04-03 00:00:00", "ISBN": "0679734775"},
{"url": "https://www.goodreads.com/book/show/533465.Balzac_and_the_Little_Chinese_Seamstress", "num_ratings": "46,720", "num_reviews": "3,837", "avg_ratings": 3.63, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia", "Writing", "Books About Books", "Novels"], "title": "Balzac and the Little Chinese Seamstress", "description": ["In this enchanting tale about the magic of reading and the wonder of romantic awakening, two hapless city boys are exiled to a remote mountain village for reeducation during China's infamous Cultural Revolution. There they meet the daughter of the local tailor and discover a hidden stash of Western classics in Chinese translation. As they flirt with the seamstress and secr", "In this enchanting tale about the magic of reading and the wonder of romantic awakening, two hapless city boys are exiled to a remote mountain village for reeducation during China's infamous Cultural Revolution. There they meet the daughter of the local tailor and discover a hidden stash of Western classics in Chinese translation. As they flirt with the seamstress and secretly devour these banned works, they find transit from their grim surroundings to worlds they never imagined."], "author": "Dai Sijie", "num_pages": "184", "awards": ["Independent Foreign Fiction Prize Nominee for Shortlist (2002)", "IMPAC Award Nominee (2003)", "Prix des libraires du Québec for Lauréats hors Québec (2001)", "Prix Relay du Roman d'Evasion (2000)", "Scott Moncrieff Prize for Ina Rilke (2002)", "Premi Llibreter de narrativa Nominee (2001)"], "places": ["China"], "character_names": [], "language": "English", "publish_date": "2002-10-29 00:00:00", "ISBN": "0385722206"},
{"url": "https://www.goodreads.com/book/show/8965997-lyrics-alley", "num_ratings": "1,071", "num_reviews": "188", "avg_ratings": 3.69, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Northern Africa", "Sudan", "Northern Africa", "Egypt", "Literature", "African Literature"], "title": "Lyrics Alley", "description": [" is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades. ", "Their fortune threatened by shifting powers in Sudan and their heir's debilitating accident, a powerful family under the leadership of Mahmoud Bey is torn between the traditional and mode", " is the evocative story of an affluent Sudanese family shaken by the shifting powers in their country and the near-tragedy that threatens the legacy they've built for decades. ", "Their fortune threatened by shifting powers in Sudan and their heir's debilitating accident, a powerful family under the leadership of Mahmoud Bey is torn between the traditional and modern values of Mahmoud's two wives and his son's efforts to break with cultural limits."], "author": "Leila Aboulela", "num_pages": "310", "awards": ["Orange Prize Nominee for Fiction Longlist (2011)", "Scottish Trust Book Award for Fiction"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "0802119514"},
{"url": "https://www.goodreads.com/book/show/1172955.Mister_Pip", "num_ratings": "15,890", "num_reviews": "1,943", "avg_ratings": 3.67, "genres": ["Historical", "Historical Fiction", "War", "Young Adult", "Contemporary"], "title": "Mister Pip", "description": ["On a remote South Pacific island, threatened by uprising, Matilda and her classmates find their lives surprisingly intertwined with those of a boy called Pip, and a man named Mr Dickens."], "author": "Lloyd Jones", "num_pages": "223", "awards": ["Man Booker Prize Nominee (2007)", "ALA Alex Award (2008)", "Commonwealth Writers' Prize for Best Book Overall (2007)", "Kiriyama Prize for Fiction (2008)", "Ockham New Zealand Book Awards for Montana Medal for Fiction or Poetry (Montana NZ Awards) (2007)"], "places": ["Papua New Guinea"], "character_names": ["Matilda", "Mr. Watts"], "language": "English", "publish_date": "2007-08-01 00:00:00", "ISBN": "0719564565"},
{"url": "https://www.goodreads.com/book/show/5186.Breath_Eyes_Memory", "num_ratings": "24,402", "num_reviews": "1,198", "avg_ratings": 3.87, "genres": ["Fiction", "Historical", "Historical Fiction"], "title": "Breath, Eyes, Memory", "description": ["At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new novelists, a writer who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.  ", "At the age of twelve, Sophie Caco is sent from her imp", "At an astonishingly young age, Edwidge Danticat has become one of our most celebrated new novelists, a writer who evokes the wonder, terror, and heartache of her native Haiti--and the enduring strength of Haiti's women--with a vibrant imagery and narrative grace that bear witness to her people's suffering and courage.  ", "At the age of twelve, Sophie Caco is sent from her impoverished village of Croix-des-Rosets to New York, to be reunited with a mother she barely remembers. There she discovers secrets that no child should ever know, and a legacy of shame that can be healed only when she returns to Haiti--to the women who first reared her. What ensues is a passionate journey through a landscape charged with the supernatural and scarred by political violence, in a novel that bears witness to the traditions, suffering, and wisdom of an entire people."], "author": "Edwidge Danticat", "num_pages": "234", "awards": [], "places": ["Haiti", "New York (the state)"], "character_names": [], "language": "English", "publish_date": "1998-05-18 00:00:00", "ISBN": "037570504X"},
{"url": "https://www.goodreads.com/book/show/16130324-children-of-the-jacaranda-tree", "num_ratings": "2,531", "num_reviews": "486", "avg_ratings": 3.45, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Iran", "Historical"], "title": "Children of the Jacaranda Tree", "description": ["A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. ", "We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of", "A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. ", "We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of a guard appear at the cell door one day and, simply, take her away. Omid, at age three, witnesses the arrests of his political activist parents from his perch at their kitchen table, yogurt dripping from his fingertips. More than twenty years after the violent, bloody purge that took place inside Tehran's prisons, Sheida learns that her father was one of those executed, that the silent void firmly planted between her and her mother all these years was not just the sad loss that comes with death, but the anguish and the horror of murder. ", "Neda, Omid, and Sheida are just three of the many unforgettable characters in Sahar Delijani's startling debut novel, Children of the Jacaranda Tree. Set in post-revolutionary Iran, from 1983 to 2011, it follows a group of mothers, fathers, children, and lovers, some connected by family, others brought together by the tide of history that forces its way into their lives. Finally, years later, it is the next generation that is left with the burden of the past and their country's tenuous future as a new wave of protest and political strife begins. ", "Based on the harrowing experiences of Delijani, her family, and friends, Children of the Jacaranda Tree is a moving, timely drama about three generations of men and women moved by love, inspired by poetry, and motivated by dreams of justice and freedom. For fans of The Kite Runner and In the Shadow of the Banyan, it is a stunningly evocative look at the intimate side of revolution and a brilliant tribute to anyone who has answered the call of history."], "author": "Sahar Delijani", "num_pages": "282", "awards": [], "places": ["Iran"], "character_names": [], "language": "English", "publish_date": "2013-06-18 00:00:00", "ISBN": "1476709092"},
{"url": "https://www.goodreads.com/book/show/6818019-i-am-nujood-age-10-and-divorced", "num_ratings": "16,401", "num_reviews": "2,415", "avg_ratings": 3.8, "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Feminism"], "title": "I Am Nujood, Age 10 and Divorced", "description": [" ", "Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's han", " ", "Nujood Ali's childhood came to an abrupt end in 2008 when her father arranged for her to be married to a man three times her age. With harrowing directness, Nujood tells of abuse at her husband's hands and of her daring escape. With the help of local advocates and the press, Nujood obtained her freedom—an extraordinary achievement in Yemen, where almost half of all girls are married under the legal age. Nujood's courageous defiance of both Yemeni customs and her own family has inspired other young girls in the Middle East to challenge their marriages. Hers is an unforgettable story of tragedy, triumph, and courage."], "author": "Nujood Ali", "num_pages": "188", "awards": [], "places": ["Yemen"], "character_names": [], "language": "English", "publish_date": "2010-03-02 00:00:00", "ISBN": "0307589676"},
{"url": "https://www.goodreads.com/book/show/9987870-the-girl-who-fell-from-the-sky", "num_ratings": "24,205", "num_reviews": "3,440", "avg_ratings": 3.6, "genres": ["Fiction", "Young Adult", "Historical", "Historical Fiction", "Cultural", "African American", "Young Adult", "Coming Of Age"], "title": "The Girl Who Fell from the Sky", "description": ["Rachel, the daughter of a Danish mother and a black G.I., becomes the sole survivor of a family tragedy after a fateful morning on their Chicago rooftop. ", " Forced to move to a new city, with her strict African American grandmother as her guardian, Rachel is thrust for the first time into a mostly black community, where her light brown skin, blue eyes, and beauty bring a con", "Rachel, the daughter of a Danish mother and a black G.I., becomes the sole survivor of a family tragedy after a fateful morning on their Chicago rooftop. ", " Forced to move to a new city, with her strict African American grandmother as her guardian, Rachel is thrust for the first time into a mostly black community, where her light brown skin, blue eyes, and beauty bring a constant stream of attention her way. It's there, as she grows up and tries to swallow her grief, that she comes to understand how the mystery and tragedy of her mother might be connected to her own uncertain identity. ", " This searing and heartwrenching portrait of a young biracial girl dealing with society's ideas of race and class is the winner of the Bellwether Prize for best fiction manuscript addressing issues of social justice."], "author": "Heidi W. Durrow", "num_pages": "300", "awards": ["Goodreads Choice Award Nominee for Debut Author (2010)", "Carnegie Medal Nominee (2011)", "PEN/Bellwether Prize for Socially Engaged Fiction (2008)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-01-11 00:00:00", "ISBN": "1616200375"},
{"url": "https://www.goodreads.com/book/show/1421470.The_Brief_Wondrous_Life_Of_Oscar_Wao", "num_ratings": "200,113", "num_reviews": "17,901", "avg_ratings": 3.9, "genres": ["Fiction", "Contemporary", "Magical Realism", "Novels"], "title": "The Brief Wondrous Life Of Oscar Wao", "description": ["Things have never been easy for Oscar, a sweet but disastrously overweight ghetto nerd, a New Jersey romantic who dreams of becoming the Dominican J. R. R. Tolkien and, most of all, of finding love. But he may never get what he wants, thanks to the fukú–the ancient curse that has haunted Oscar's family for generations, dooming them to prison, torture, tragic accidents, and", "Things have never been easy for Oscar, a sweet but disastrously overweight ghetto nerd, a New Jersey romantic who dreams of becoming the Dominican J. R. R. Tolkien and, most of all, of finding love. But he may never get what he wants, thanks to the fukú–the ancient curse that has haunted Oscar's family for generations, dooming them to prison, torture, tragic accidents, and, above all, ill-starred love. Oscar, still dreaming of his first kiss, is only its most recent victim–until the fateful summer that he decides to be its last.", "With dazzling energy and insight, Junot Díaz immerses us in the uproarious lives of our hero Oscar, his runaway sister Lola, and their ferocious beauty-queen mother Belicia, and in the family's epic journey from Santo Domingo to Washington Heights to New Jersey's Bergenline and back again. Rendered with uncommon warmth and humor, THE BRIEF WONDROUS LIFE OF OSCAR WAO presents an astonishing vision of the contemporary American experience and the endless human capacity to persevere–and to risk it all–in the name of love. A true literary triumph, this novel confirms Junot Díaz as one of the best and most exciting writers of our time."], "author": "Junot Díaz", "num_pages": "13", "awards": ["Pulitzer Prize for Fiction (2008)", "Anisfield-Wolf Book Award (2008)", "Massachusetts Book Award for Fiction (2008)", "Dayton Literary Peace Prize for Fiction (2008)", "National Book Critics Circle Award for Fiction (2007)", "Hurston/Wright Legacy Award for Fiction (2008)", "The Rooster - The Morning News Tournament of Books (2008)", "The Center for Fiction First Novel Prize (2007)"], "places": ["Dominican Republic", "Washington Heights, New York", "Paterson, New Jersey"], "character_names": ["Oscar de León", "Lola de León", "Hypatía Belicia \"Beli\" Cabral de León", "La Inca", "Yunior de Las Casas", "Ybón Pimentel", "Dr Abelard Luis Cabral"], "language": "English", "publish_date": "2007-09-06 00:00:00", "ISBN": "0143142801"},
{"url": "https://www.goodreads.com/book/show/13054033-royal-enigma", "num_ratings": "7", "num_reviews": "4", "avg_ratings": 3.43, "genres": ["Literature", "Travel", "Contemporary"], "title": "Royal Enigma", "description": ["The unsettling politics of India and Nepal as a backdrop, where the popular leaders have to be assassinated mostly, Nawin lives through the Maoist-war in the country, bearing the hardship it caused to the ordinary people like him. He finally discovers how much his step-mother had helped him, when his mother has died recently, when he and his brother were too young. He also", "The unsettling politics of India and Nepal as a backdrop, where the popular leaders have to be assassinated mostly, Nawin lives through the Maoist-war in the country, bearing the hardship it caused to the ordinary people like him. He finally discovers how much his step-mother had helped him, when his mother has died recently, when he and his brother were too young. He also feels his helplessness for not being to support her, in her efforts to maintain her mentally-invalid son, at a late age. Also is described the rule of monarchy in Nepal, when it held the absolute power, and the royal massacre, which eliminated the entire family of the king. During the Maoist-war, the violence unleashed by them and counter-violence by the security forces too is dealt in fair-details. This book is an effort to define the socio-politics of the Indian subcontinent, through fiction, which has been remarkably violent--as far as one could remember.", "\t Epic and dramatic", "Nepal is an enigma to outsiders but a new novel opens a stunning window into the country and its society. The Royal Enigma uniquely mixes fiction and fact to tell the epic story of the 2001 assassination of the Nepalese royal family and its ongoing impact on the people of Nepal. Chapters detailing actual events alternate with the fictional life of Nawin, his life a personal mirror on the larger tragic national events. The Royal Enigma tells a real life story in a very different and appealing way. For years, Nepal was savaged by a civil war. On one side were the King and the democratically elected government (not quite the same thing), on the other side were brutal Maoist revolutionaries who terrorized the countryside. After years of war, one night most of the Nepalese royal family was assassinated. The official story? The Crown Prince shot all of them and then himself because he could not marry the woman he loved. The story most Nepalese believe? The King was assassinated because he was secretly working with the Maoists to destroy the democratically elected government. The Royal Enigma presents all the known facts and theories behind the assassinations. It is a great novel for anyone interested in real life political conspiracies! The story of the civil war is paralleled by chapters focusing on the disruption and corruption it brought to Nepalese society. That story is personified in Nawin and his family and friends. He leaves his family responsibilities of looking after his step-mother and disabled half-brother, and instead becomes a pharmaceutical salesperson working from Kathmandu. Nawin and the colourful people he meets illustrate traditional Nepalese culture along with the intrusion of outside elements. The two stories are epic and dramatic, spanning decades.", "Victor Schwartzman"], "author": "K.B.", "num_pages": "214", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-09-28 00:00:00"},
{"url": "https://www.goodreads.com/book/show/201114.Sold", "num_ratings": "42,339", "num_reviews": "5,289", "avg_ratings": 4.2, "genres": ["Young Adult", "Realistic Fiction", "Fiction", "Poetry", "Sociology", "Abuse"], "title": "Sold", "description": ["Although Lakshmi's family is desperately poor her life still contains simple pleasures; but, when the harsh Himalayan monsoons wash away all the family’s crops, Lakshmi’s stepfather sends her away to take a job to support her family. When she arrives at “Happiness House”, full of hope, she learns the unthinkable truth: she has been sold into prostitution. An exceptional no", "Although Lakshmi's family is desperately poor her life still contains simple pleasures; but, when the harsh Himalayan monsoons wash away all the family’s crops, Lakshmi’s stepfather sends her away to take a job to support her family. When she arrives at “Happiness House”, full of hope, she learns the unthinkable truth: she has been sold into prostitution. An exceptional novel suitable for teens and adults.", "Lakshmi is a thirteen-year-old girl who lives with her family in a small hut in the mountains of Nepal. Her family is desperately poor, but her life is full of simple pleasures, like raising her black-and-white speckled goat, and having her mother brush her hair by the light of an oil lamp. But when the harsh Himalayan monsoons wash away all that remains of the family’s crops, Lakshmi’s stepfather says she must leave home and take a job to support her family. ", "He introduces her to a glamorous stranger who tells her she will find her a job as a maid working for a wealthy woman in the city. Glad to be able to help, Lakshmi undertakes the long journey to India and arrives at “Happiness House” full of hope. But she soon learns the unthinkable truth: she has been sold into prostitution. ", "An old woman named Mumtaz rules the brothel with cruelty and cunning. She tells Lakshmi that she is trapped there until she can pay off her family’s debt – then cheats Lakshmi of her meager earnings so that she can never leave. ", "Lakshmi’s life becomes a nightmare from which she cannot escape. Still, she lives by her mother’s words – “Simply to endure is to triumph” – and gradually, she forms friendships with the other girls that enable her to survive in this terrifying new world. Then the day comes when she must make a decision – will she risk everything for a chance to reclaim her life? ", "Written in spare and evocative vignettes, this powerful novel renders a world that is as unimaginable as it is real, and a girl who not only survives but triumphs. ", "To research Sold, Patricia McCormick traveled to India and Nepal where she interviewed the women of Calcutta’s red-light district and girls who have been rescued from the sex trade. She is the author of the acclaimed novels Cut and My Brother’s Keeper."], "author": "Patricia McCormick", "num_pages": "268", "awards": ["South Carolina Book Award Nominee for Young Adult Book Award (2009)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2009)", "California Young Readers Medal for Young Adult (2009)", "Lincoln Award Nominee (2009)", "James Cook Book Award Nominee (2007)", "National Book Award Finalist for Young People's Literature (2006)", "Missouri Gateway Readers Award Nominee (2009)"], "places": ["Nepal"], "character_names": [], "language": "English", "publish_date": "2006-09-15 00:00:00", "ISBN": "0786851716"},
{"url": "https://www.goodreads.com/book/show/2722.Cities_of_Salt", "num_ratings": "3,045", "num_reviews": "469", "avg_ratings": 4.06, "genres": ["Fiction", "Historical", "Historical Fiction", "Novels"], "title": "Cities of Salt", "description": ["Set in an unnamed Persian Gulf kingdom in the 1930s, this remarkable novel tells the story of the disruption and diaspora of a poor oasis community following the discovery of oil there. The meeting of Arabs and the Americans who, in essence, colonized the remote region is a cultural confrontation in which religion, history, superstition, and mutual incomprehension all play", "Set in an unnamed Persian Gulf kingdom in the 1930s, this remarkable novel tells the story of the disruption and diaspora of a poor oasis community following the discovery of oil there. The meeting of Arabs and the Americans who, in essence, colonized the remote region is a cultural confrontation in which religion, history, superstition, and mutual incomprehension all play a part.", "Powerful political fiction that it is, ", " has been banned in several Arab countries, including Saudi Arabia. The novel, the first volume in a trilogy, has been translated from the Arabic to English by Peter Theroux."], "author": "Abdul Rahman Munif", "num_pages": "627", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-07-17 00:00:00", "ISBN": "039475526X"},
{"url": "https://www.goodreads.com/book/show/16132844-nothing-comes-close", "num_ratings": "46", "num_reviews": "13", "avg_ratings": 3.8, "genres": ["Christian Fiction", "Western Africa", "Nigeria"], "title": "Nothing Comes Close", "description": ["Confident, sassy, career girl, Lola meets cool, handsome, unpredictable hunk, Wole at a party in London. He pushes all the right buttons for her, and sparks fly. Wole is also irresistibly drawn to Lola, and before long, they get together in a wonderful romance. But Wole is not all that he seems, and he is holding back some dark secrets.", "Things start to unravel when Wole’s p", "Confident, sassy, career girl, Lola meets cool, handsome, unpredictable hunk, Wole at a party in London. He pushes all the right buttons for her, and sparks fly. Wole is also irresistibly drawn to Lola, and before long, they get together in a wonderful romance. But Wole is not all that he seems, and he is holding back some dark secrets.", "Things start to unravel when Wole’s past begins to catch up with him and Lola has to decide if Wole is worth the trouble that threatens to overwhelm her. Find out in this captivating book if their love will overcome the trials of a murder investigation, an arrest, a meddling relative and a trip halfway across the world, or whether they both give up and go their separate ways."], "author": "Tolulope Popoola", "num_pages": "302", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2012-10-31 00:00:00", "ISBN": "0957186606"},
{"url": "https://www.goodreads.com/book/show/24728342-the-lost-tribes", "num_ratings": "43", "num_reviews": "17", "avg_ratings": 4.12, "genres": ["Science Fiction", "Adventure", "Childrens", "Childrens", "Middle Grade", "Fiction", "Young Adult", "Did Not Finish"], "title": "The Lost Tribes", "description": ["Five friends are in a race against time in this action-adventure story involving ancient tribal artifacts that hold the fate of the universe in the balance. None of these trailblazers imagined their ordinary parents as scientists on a secret mission. But when their parents go missing, they are forced into unfathomable circumstances and learn of a history that is best left", "Five friends are in a race against time in this action-adventure story involving ancient tribal artifacts that hold the fate of the universe in the balance. None of these trailblazers imagined their ordinary parents as scientists on a secret mission. But when their parents go missing, they are forced into unfathomable circumstances and learn of a history that is best left unknown, for they are catalysts in an ancient score that must be settled. As the chaos unfolds, opportunities arise that involve cracking codes and anticipating their next moves. This book unfolds sturdy, accurate scientific facts and history knowledge where readers will surely become participants."], "author": "C. Taylor-Butler", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-25 00:00:00", "ISBN": "0985481080"},
{"url": "https://www.goodreads.com/book/show/20774576-omoo", "num_ratings": "744", "num_reviews": "55", "avg_ratings": 3.48, "genres": ["Fiction", "Classics", "Adventure", "Literature", "Literature", "American", "Travel", "Literature", "19th Century"], "title": "Omoo: A Narrative of Adventures in the South Seas", "description": ["\"Omoo is a fascinating book; picaresque, rascally, roving. Melville, as a bit of a beachcomber. The crazy ship Julia sails to Tahiti, and the mutinous crew are put ashore. Put in the Tahitian prison. It is good reading. Perhaps Melville is at his best, his happiest, in Omoo. For once he is really reckless. For once he takes life as it comes. For once he is the gallant rasc", "\"Omoo is a fascinating book; picaresque, rascally, roving. Melville, as a bit of a beachcomber. The crazy ship Julia sails to Tahiti, and the mutinous crew are put ashore. Put in the Tahitian prison. It is good reading. Perhaps Melville is at his best, his happiest, in Omoo. For once he is really reckless. For once he takes life as it comes. For once he is the gallant rascally epicurean, eating the world like a snipe, dirt and all baked into one bonne bouche. For once he is really careless, roving with that scamp, Doctor Long Ghost. For once he is careless of his actions, careless of his morals, careless of his ideals... That is good about Melville: he never repents. Whatever he did, in Typee or in Doctor Long Ghost's wicked society, he never repented.\" - D.H. Lawrence"], "author": "Herman Melville", "num_pages": "190", "awards": [], "places": ["Tahiti", "Pacific Ocean"], "character_names": [], "language": null, "publish_date": "2014-02-05 00:00:00", "ISBN": "1495445844"},
{"url": "https://www.goodreads.com/book/show/28160431-shanghai-nobody", "num_ratings": "56", "num_reviews": "14", "avg_ratings": 3.57, "genres": ["Cultural", "China", "Cultural", "Asia"], "title": "Shanghai Nobody", "description": ["INTRODUCTION ", "Shanghai Nobody is book one of the fiction series, Master Shanghai. It is the story of one young Chinese man's adventure to find love and purposes in the 21st century Chinese metropolis. ", "Written in humorous tone, author Vann Chow brought to you a satire of urban life in China. Her story explores cultural phenomenons", "INTRODUCTION ", "Shanghai Nobody is book one of the fiction series, Master Shanghai. It is the story of one young Chinese man's adventure to find love and purposes in the 21st century Chinese metropolis. ", "Written in humorous tone, author Vann Chow brought to you a satire of urban life in China. Her story explores cultural phenomenons such as China's gender imbalance, selfish generation, new rich, migrant workers, digital loneliness and Capitalist tyranny, reflecting on the glamorous and not-so-glamorous side of the rise of a modern nation through the eyes of one nobody of Shanghai. ", "PREVIEW ", "The problem is, there are simply way to many Chinese men on this side of the world. ", "After years of killing off --- I am not going to spare your sensitivity because it is what it is --- baby girls and let live the baby boys in Mainland China by the ignorant bunch, there are officially way too many Chinese males in the country for each of us to have a fair chance of being in a heterosexual marriage. This means, I am stat out of a girlfriend, wife and a lifelong companion. ", "The good news is that not having a girlfriend at the age of thirty, which is way above the average marriage age for Chinese men for the past five thousand years, has nothing to do with you, or me, per se. It is just all circumstances."], "author": "Vann Chow", "num_pages": "190", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-12-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/20774127-typee", "num_ratings": "3,748", "num_reviews": "307", "avg_ratings": 3.53, "genres": ["Adventure", "Travel", "Classics", "Literature", "Novels", "Historical", "Historical Fiction"], "title": "Typee: A Romance of the South Seas, with Sequel: The Story of Toby", "description": ["*Watersgreen House Classic Editions' Herman Melville Collection places Melville's early novels in the canon of gay literature. *\"Melville has the strange, uncanny magic of sea-creatures, and some of their repulsiveness. He isn't quite a land animal. There is something slithery about him. Something always half-seas-over. In his life they said he was mad - or crazy. He was n", "*Watersgreen House Classic Editions' Herman Melville Collection places Melville's early novels in the canon of gay literature. *\"Melville has the strange, uncanny magic of sea-creatures, and some of their repulsiveness. He isn't quite a land animal. There is something slithery about him. Something always half-seas-over. In his life they said he was mad - or crazy. He was neither mad nor crazy. But he was over the border. ...There he is then, in Typee, among the dreaded cannibal savages. And they are gentle and generous with him, and he is truly in a sort of Eden. Here at last is Rousseau's Child of Nature and Chateaubriand's Noble Savage called upon and found at home. Yes, Melville loves his savage hosts. He finds them gentle, laughing lambs compared to the ravening wolves of his white brothers, left behind in America and on an American whaleship. The ugliest beast on earth is the white man, says Melville. In short, Herman found in Typee the paradise he was looking for. It is true, the Marquesans were 'immoral', but he rather liked that. Morality was too white a trick to take him in. ...There they are, these South Sea Islanders, beautiful big men with their golden limbs and their laughing, graceful laziness. And they will call you brother, choose you as a brother.\" - D.H. Lawrence Typee, a semi-autobiographical work, is Melville's first novel. Like all his work, it is infused with a latent homoeroticism and is important not only as literature but as philosophical, psychological, and anthropological commentary. Most of all, however, it is a fine story that captured the public's imagination and remained one of Melville's most popular works throughout his lifetime."], "author": "Herman Melville", "num_pages": "246", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-02-03 00:00:00", "ISBN": "1495424685"},
{"url": "https://www.goodreads.com/book/show/27854760-awakening-kali", "num_ratings": "28", "num_reviews": "16", "avg_ratings": 4.57, "genres": ["Fiction", "Medicine", "Psychiatry", "Mental Health", "Mental Illness", "Health", "Mental Health"], "title": "Awakening Kali", "description": ["It's the 1930s. A small house in Bengal houses a shadow. Chhaya is the youngest daughter in a family that doesn't want her. Shunned for her gender and dark skin, she has no choice but to conceal her feelings. Imprison herself. Shackle herself into a life that has no proper outlet for emotion, whether it be sadness, joy, or unrepentant rage.", "An unexpected marriage to a stran", "It's the 1930s. A small house in Bengal houses a shadow. Chhaya is the youngest daughter in a family that doesn't want her. Shunned for her gender and dark skin, she has no choice but to conceal her feelings. Imprison herself. Shackle herself into a life that has no proper outlet for emotion, whether it be sadness, joy, or unrepentant rage.", "An unexpected marriage to a stranger turns Chhaya's life around. Suddenly, she is wanted, loved, and cherished. Arun is a man with the patience and the vision to understand that Chhaya is much more than the darkness for which she is named. Most importantly, however, Arun is able to coax Chhaya out of her prison. Slowly. Gently. But the world is an unruly place. War and famine bring heartache to Chhaya, Arun, and their family.", "The ancient goddess Kali is a symbol of destruction and creation. Chhaya has always been drawn to this symbol of power. And it is this power that calls to her. As the trials of an already difficult life become even more taxing, something awakens in Chhaya. Something terrible. Something unimaginable. Chhaya always believed she was cursed. Which begs the question: is she?", "Editorial Review:", "\"Awakening Kali is a sad tale, beautifully told with deep compassion and understanding. It is a tale that will make readers ponder the sometimes devastating effects of social injustice, gender bias, and cultural bondage. The author exposes the tragic impact of mental illness on sufferers and their loved ones in a tale that is deeply evocative ― a novel you will struggle to put down.", "Lorraine Cobcroft, Reviewer for Readers' Favorite"], "author": "T.S. Ghosh", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-01-07 00:00:00", "ISBN": "1943549435"},
{"url": "https://www.goodreads.com/book/show/23575043-fountains-in-the-sand", "num_ratings": "21", "num_reviews": "9", "avg_ratings": 3.52, "genres": ["Northern Africa", "Tunisia", "Travel", "Cultural", "Africa", "Classics", "Fiction"], "title": "Fountains in the Sand", "description": ["\"The proposition tempted me; it is not every day that one is invited in such gentlemanly fashion to wallow on all fours with young Arabs.\"", "\"The traveller Temple was struck, at Nefta, with the beauty of its 'desart nymphs, whose eyes are all fire and brilliancy,' and he might have said the same of the boys.\"", "As the above quotations from Norman Douglas's Fountains in the Sand", "\"The proposition tempted me; it is not every day that one is invited in such gentlemanly fashion to wallow on all fours with young Arabs.\"", "\"The traveller Temple was struck, at Nefta, with the beauty of its 'desart nymphs, whose eyes are all fire and brilliancy,' and he might have said the same of the boys.\"", "As the above quotations from Norman Douglas's Fountains in the Sand attest, one need not strain one's eyes too much reading between the lines to find the homoerotic in his travel writing. An Austrian-born Scott, Douglas spent much of his adult life traveling the world partially to see it and partially to escape the law in whatever country he recently had departed.", "Although he married his cousin in 1898 and fathered two sons (the marriage later ended in divorce), the year before that marriage he was having an affair not only with a mistress but also her fifteen-year-old brother. In 1916, Douglas fled England to, in his own words, \"avoid persecution for kissing a boy and giving him some cakes and a shilling.\" The sixteen-year-old boy in question described the matter less innocently to police, leading Douglas to be charged with indecent assault. Douglas settled in Capri. His book of travel Together, published in 1923, finds him traveling with a companion he refers to as \"Mr R,\" who in fact was a fifteen-year-old Italian boy who went by the name of René.", "Douglas was admired by E.M. Forster and Lytton Strachey (\"the thrill that only you can give goes down my back,\" Strachey wrote to him after reading Together), and more recently by Paul Fussell, who likens him to Nabokov. D.H. Lawrence was fascinated with Douglas enough to base the character James Argyle on him in Aaron's Rod. Indeed, Lawrence uses Argyle to make one of his more profound statements on love between men, the same sort of statement found in the final pages of Women in Love. Addressing the Marchesse, Argyle says, \"A man is drawn or driven. Driven, I've found it. Ah, my dear fellow, what is life but a search for a friend-that sums it up.\" The Marchesse smiles and adds, \"Or a lover,\" to which Argyle rejoins, \"Same thing, same thing...\"", "An even more intriguing characterization of Douglas is found in Roger Williams's Lunch with Elizabeth David. The book is written from the point of view of twelve-year-old Eric Wolton, a working class boy Douglas took with him through Calabria. In Julie Gray's review of the book for the New York Times (13 Aug 2000), she writes, \"The question at the novel's center concerns Douglas: Is he, as one character puts it, 'a monster, the pedophile of the century,' or is he, as Eric says, a great man who had led him into a 'warm and sensuous world of adventures and light'?\" Eric, no doubt, would insist he should have the final word.", "As for Douglas, his final words, after intentionally taking an overdose of pills to end a prolonged illness, are reported to have been: \"Get those fucking nuns away from me.\""], "author": "Norman Douglas", "num_pages": "136", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-10-01 00:00:00", "ISBN": "1502560119"},
{"url": "https://www.goodreads.com/book/show/22452138-paris-in-april", "num_ratings": "11", "num_reviews": "2", "avg_ratings": 3.91, "genres": ["Fiction", "Romance", "Interracial Romance"], "title": "Paris in April", "description": ["Canada's greatest military disaster gave rise to Canada's greatest love affair. A biracial romance during the Second World War --- centered around Canadian participation in the Raid on Dieppe, France (August 19, 1942) --- between a young man from Essex County (Canada), Aiken Day, and one beautiful Black woman, Paris Chase. Racism is an underlying theme."], "author": "Allan Dare Pearce", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-03-01 00:00:00", "ISBN": "098684330X"},
{"url": "https://www.goodreads.com/book/show/17445481-the-unheralded-king-of-preston-plains-middle", "num_ratings": "14", "num_reviews": "9", "avg_ratings": 3.79, "genres": ["Young Adult", "Drama", "Contemporary"], "title": "The Unheralded King of Preston Plains Middle", "description": ["From irascible patriarch Alonzo Grandpa Tuke Tooker on down, the Hopkins family altruistic Dottie, dissatisfied Chester, and their sons Langston and Trajan are no typical residents of the Thames River Valley town of Preston, Connecticut. This is perhaps most true of Langston, a boy whose peers declare him to be the King of Pres", "From irascible patriarch Alonzo Grandpa Tuke Tooker on down, the Hopkins family altruistic Dottie, dissatisfied Chester, and their sons Langston and Trajan are no typical residents of the Thames River Valley town of Preston, Connecticut. This is perhaps most true of Langston, a boy whose peers declare him to be the King of Preston Plains Middle School: a vibrant young man dedicated to his dream of competing in Olympic-level Tae Kwon Do, as well as to his growing passion for his beautiful classmate Angelica Chu. Yet when a terrible accident brings Langston s Olympic dreams to an abrupt close, Trajan Hopkins, the family s youngest son, must learn to cope alone with the coming trials of adult life: his slowly changing relationship with self-destructing childhood friends, his initiation into the world of women at the hands of a former teacher, and his growing awareness of the risky world outside his family s circle within the shadow of a Haitian drug lord s operation and the often-threatening local police who watch over it. Jedah Mayberry s The Unheralded King of Preston Plains Middle marks the debut of a striking new voice in American fiction: intelligent, richly cadenced, slyly funny, and deeply thoughtful about what it means to be a son, a father, and a man."], "author": "Jedah Mayberry", "num_pages": "330", "awards": ["International Book Awards for Fiction: African-American (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "1938416139"},
{"url": "https://www.goodreads.com/book/show/93516.Mandala", "num_ratings": "852", "num_reviews": "77", "avg_ratings": 3.61, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Classics", "Cultural", "Asia", "Novels"], "title": "Mandala", "description": ["News reaches Maharana Prince Jagat and his wife, Moti, that their only son, Jai, has been killed by the Chinese in a border skirmish. An inconsolable Moti sends Jagat out to bring the boy's spirit home. On the journey, the prince becomes involved with a beautiful and mysterious young American woman. Thus begins the fatal attraction between Eastern and Western ways, one bou", "News reaches Maharana Prince Jagat and his wife, Moti, that their only son, Jai, has been killed by the Chinese in a border skirmish. An inconsolable Moti sends Jagat out to bring the boy's spirit home. On the journey, the prince becomes involved with a beautiful and mysterious young American woman. Thus begins the fatal attraction between Eastern and Western ways, one bound by rigid custom, the other temptingly ripe with freethinking."], "author": "Pearl S. Buck", "num_pages": "362", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-01-01 00:00:00", "ISBN": "1559210370"},
{"url": "https://www.goodreads.com/book/show/106542.The_Antelope_Wife", "num_ratings": "3,058", "num_reviews": "278", "avg_ratings": 3.8, "genres": ["Fiction", "Fantasy", "Magical Realism", "Historical", "Historical Fiction"], "title": "The Antelope Wife", "description": ["One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life", "One of America's most celebrated authors offers a powerful story suffused with a Native American sense of magic. Originally an important hunting ground for the Ojibway, the city of Minneapolis draws from nearby reservations many Native people, people who infuse the city with a strong and ongoing Native presence as well as a potent indigenous past. This story brings to life the people who live in or around this midwestern city. And like a modern city itself, it portrays people of all backgrounds and is a mixture of vibrant cultures and ideas. But also like a modern city, it has an edge, troubled by violence.", "\"New York Times\" bestselling author Louise Erdrich has twice won the National Magazine Award and her work has been included in both the O. Henry and the Best American collections several times."], "author": "Louise Erdrich", "num_pages": "256", "awards": ["World Fantasy Award for Best Novel (1999)"], "places": ["Minneapolis, Minnesota"], "character_names": [], "language": "English", "publish_date": "1998-10-16 00:00:00", "ISBN": "0007136366"},
{"url": "https://www.goodreads.com/book/show/14648.East_Wind", "num_ratings": "4,329", "num_reviews": "321", "avg_ratings": 3.99, "genres": ["Fiction", "Cultural", "China", "Classics", "Historical", "Historical Fiction", "Cultural", "Asia", "Romance"], "title": "East Wind: West Wind", "description": ["East Wind: West Wind is told from the eyes of a traditional Chinese girl, Kwei-lan, married to a Chinese medical doctor, educated abroad. The story follows Kwei-lan as she begins to accept different points of view from the western world, and re-discovers her sense of self through this coming-of-age narrative."], "author": "Pearl S. Buck", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-04-05 00:00:00", "ISBN": "1559210869"},
{"url": "https://www.goodreads.com/book/show/111050.July_s_People", "num_ratings": "5,468", "num_reviews": "433", "avg_ratings": 3.54, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Historical", "Historical Fiction", "Novels"], "title": "July's People", "description": ["For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable lo", "For years, it had been what is called a “deteriorating situation.” Now all over South Africa the cities are battlegrounds. The members of the Smales family—liberal whites—are rescued from the terror by their servant, July, who leads them to refuge in his village. What happens to the Smaleses and to July—the shifts in character and relationships—gives us an unforgettable look into the terrifying, tacit understandings and misunderstandings between blacks and whites."], "author": "Nadine Gordimer", "num_pages": "160", "awards": ["Premio Grinzane Cavour Nominee for Narrativa Straniera (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "1982-07-29 00:00:00", "ISBN": "0140061401"},
{"url": "https://www.goodreads.com/book/show/11208.How_the_Garc_a_Girls_Lost_Their_Accents", "num_ratings": "20,423", "num_reviews": "1,405", "avg_ratings": 3.63, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult"], "title": "How the García Girls Lost Their Accents", "description": ["Uprooted from their family home in the Dominican Republic, the four Garcia sisters - Carla, Sandra, Yolanda, and Sofia - arrive in New York City in 1960 to find a life far different from the genteel existence of maids, manicures, and extended family they left behind. What they have lost - and what they find - is revealed in the fifteen interconnected stories that make up t", "Uprooted from their family home in the Dominican Republic, the four Garcia sisters - Carla, Sandra, Yolanda, and Sofia - arrive in New York City in 1960 to find a life far different from the genteel existence of maids, manicures, and extended family they left behind. What they have lost - and what they find - is revealed in the fifteen interconnected stories that make up this exquisite novel from one of the premier novelists of our time."], "author": "Julia Alvarez", "num_pages": "304", "awards": [], "places": ["New York City, New York"], "character_names": [], "language": "English", "publish_date": "2005-10-04 00:00:00", "ISBN": "0452287073"},
{"url": "https://www.goodreads.com/book/show/5941033-let-the-great-world-spin", "num_ratings": "83,495", "num_reviews": "8,566", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "New York", "Book Club"], "title": "Let the Great World Spin", "description": ["In the dawning light of a late-summer morning, the people of lower Manhattan stand hushed, staring up in disbelief at the Twin Towers. It is August 1974, and a mysterious tightrope walker is running, dancing, leaping between the towers, suspended a quarter mile above the ground. In the streets below, a slew of ordinary lives become extraordinary in bestselling novelist Col", "In the dawning light of a late-summer morning, the people of lower Manhattan stand hushed, staring up in disbelief at the Twin Towers. It is August 1974, and a mysterious tightrope walker is running, dancing, leaping between the towers, suspended a quarter mile above the ground. In the streets below, a slew of ordinary lives become extraordinary in bestselling novelist Colum McCann’s stunningly intricate portrait of a city and its people.", " is the critically acclaimed author’s most ambitious novel yet: a dazzlingly rich vision of the pain, loveliness, mystery, and promise of New York City in the 1970s.", "Corrigan, a radical young Irish monk, struggles with his own demons as he lives among the prostitutes in the middle of the burning Bronx. A group of mothers gather in a Park Avenue apartment to mourn their sons who died in Vietnam, only to discover just how much divides them even in grief. A young artist finds herself at the scene of a hit-and-run that sends her own life careening sideways. Tillie, a thirty-eight-year-old grandmother, turns tricks alongside her teenage daughter, determined not only to take care of her family but to prove her own worth.", "Elegantly weaving together these and other seemingly disparate lives, McCann’s powerful allegory comes alive in the unforgettable voices of the city’s people, unexpectedly drawn together by hope, beauty, and the “artistic crime of the century.” A sweeping and radical social novel, ", " captures the spirit of America in a time of transition, extraordinary promise, and, in hindsight, heartbreaking innocence. Hailed as a “fiercely original talent” (San Francisco Chronicle), award-winning novelist McCann has delivered a triumphantly American masterpiece that awakens in us a sense of what the novel can achieve, confront, and even heal."], "author": "Colum McCann", "num_pages": "351", "awards": ["National Book Award for Fiction (2009)", "Ambassador Book Award for Fiction (2010)", "NAIBA Book of the Year for Fiction (2010)", "Goodreads Choice Award Nominee for Fiction (2009)", "International DUBLIN Literary Award (2011)"], "places": ["New York City, New York", "Bronx, New York City, New York"], "character_names": ["Philippe Petit"], "language": "English", "publish_date": "2009-06-23 00:00:00", "ISBN": "1400063736"},
{"url": "https://www.goodreads.com/book/show/28920.A_Pale_View_of_Hills", "num_ratings": "13,953", "num_reviews": "1,321", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "Japan", "Historical", "Historical Fiction", "Asian Literature", "Japanese Literature"], "title": "A Pale View of Hills", "description": ["In his highly acclaimed debut, A Pale View of Hills, Kazuo Ishiguro tells the story of Etsuko, a Japanese woman now living alone in England, dwelling on the recent suicide of her daughter. Retreating into the past, she finds herself reliving one particular hot summer in Nagasaki, when she and her friends struggled to rebuild their lives after the war. But then as she recal", "In his highly acclaimed debut, A Pale View of Hills, Kazuo Ishiguro tells the story of Etsuko, a Japanese woman now living alone in England, dwelling on the recent suicide of her daughter. Retreating into the past, she finds herself reliving one particular hot summer in Nagasaki, when she and her friends struggled to rebuild their lives after the war. But then as she recalls her strange friendship with Sachiko - a wealthy woman reduced to vagrancy - the memories take on a disturbing cast."], "author": "Kazuo Ishiguro", "num_pages": "183", "awards": ["Winifred Holtby Memorial Prize (1982)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-03 00:00:00", "ISBN": "0571225373"},
{"url": "https://www.goodreads.com/book/show/65249.A_Dry_White_Season", "num_ratings": "2,976", "num_reviews": "184", "avg_ratings": 4.04, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "South Africa", "Historical", "Historical Fiction"], "title": "A Dry White Season", "description": ["As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple", "As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple, apolitical man, he believes in the essential fairness of the South African government and its policies—until the sudden arrest and subsequent \"suicide\" of a black janitor from Du Toit's school. Haunted by new questions and desperate to believe that the man's death was a tragic accident, Du Toit undertakes an investigation into the terrible affair—a quest for the truth that will have devastating consequences for the teacher and his family, as it draws him into a lethal morass of lies, corruption, and murder."], "author": "André Brink", "num_pages": "316", "awards": ["Prix Médicis Etranger (1980)"], "places": ["Johannesburg"], "character_names": [], "language": "English", "publish_date": "2006-09-19 00:00:00", "ISBN": "0061138630"},
{"url": "https://www.goodreads.com/book/show/321543.East_West", "num_ratings": "5,438", "num_reviews": "372", "avg_ratings": 3.57, "genres": ["Fiction", "Short Stories", "Cultural", "India", "Magical Realism"], "title": "East, West: Stories", "description": ["From the Booker Prize-winning author of ", " comes nine stories that reveal the oceanic distances and the unexpected intimacies between East and West. Daring, extravagant, comical and humane, this book renews Rushdie's stature as a storyteller who can enthrall and instruct us with the same sentence."], "author": "Salman Rushdie", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1995-12-23 00:00:00", "ISBN": "0679757899"},
{"url": "https://www.goodreads.com/book/show/109335.Hullabaloo_in_the_Guava_Orchard", "num_ratings": "4,614", "num_reviews": "426", "avg_ratings": 3.43, "genres": ["Fiction", "Cultural", "India", "Asian Literature", "Indian Literature", "Humor"], "title": "Hullabaloo in the Guava Orchard", "description": ["Sampath Chawla was born in a time of drought that ended with a vengeance the night of his birth. All signs being auspicious, the villagers triumphantly assured Sampath's proud parents that their son was destined for greatness. ", "Twenty years of failure later, that unfortunately does not appear to be the case. A sullen government worker, Sampath is inspired only when in searc", "Sampath Chawla was born in a time of drought that ended with a vengeance the night of his birth. All signs being auspicious, the villagers triumphantly assured Sampath's proud parents that their son was destined for greatness. ", "Twenty years of failure later, that unfortunately does not appear to be the case. A sullen government worker, Sampath is inspired only when in search of a quiet place to take his nap. \"But the world is round,\" his grandmother says. \"Wait and see Even if it appears he is going downhill, he will come up the other side. Yes, on top of the world. He is just taking a longer route.\" No one believes her until, one day, Sampath climbs into a guava tree and becomes unintentionally famous as a holy man, setting off a series of events that spin increasingly out of control. A delightfully sweet comic novel that ends in a raucous bang, ", " is as surprising and entertaining as it is beautifully wrought."], "author": "Kiran Desai", "num_pages": "224", "awards": ["Betty Trask Award (1998)"], "places": ["India"], "character_names": [], "language": null, "publish_date": "1999-05-18 00:00:00", "ISBN": "0385493703"},
{"url": "https://www.goodreads.com/book/show/762476.Kokoro", "num_ratings": "12,996", "num_reviews": "1,036", "avg_ratings": 4.0, "genres": ["Cultural", "Japan", "Fiction", "Asian Literature", "Japanese Literature", "Classics", "Literature"], "title": "Kokoro", "description": ["Hailed by The New Yorker as ", " Kokoro — ", " — is the work of one of Japan's most popular authors. This thought-provoking trilogy of stories explores the very essence of loneliness and stands as a stirring introduction to modern Japanese literature."], "author": "Sōseki Natsume", "num_pages": "248", "awards": [], "places": ["Kamakura", "Tokyo"], "character_names": [], "language": "English", "publish_date": "1996-07-01 00:00:00", "ISBN": "0809260956"},
{"url": "https://www.goodreads.com/book/show/50144.Kitchen", "num_ratings": "35,784", "num_reviews": "2,780", "avg_ratings": 3.84, "genres": ["Fiction", "Cultural", "Japan", "Asian Literature", "Japanese Literature", "Short Stories", "Contemporary"], "title": "Kitchen", "description": ["Banana Yoshimoto's novels have made her a sensation in Japan and all over the world, and ", ", the dazzling English-language debut that is still her best-loved book, is an enchantingly original and deeply affecting book about mothers, love, tragedy, and the power of the kitchen and home in the lives of a pair of free-spirited young women in contemporary Japan. Mikage, t", "Banana Yoshimoto's novels have made her a sensation in Japan and all over the world, and ", ", the dazzling English-language debut that is still her best-loved book, is an enchantingly original and deeply affecting book about mothers, love, tragedy, and the power of the kitchen and home in the lives of a pair of free-spirited young women in contemporary Japan. Mikage, the heroine of ", ", is an orphan raised by her grandmother, who has passed away. Grieving, she is taken in by her friend Yoichi and his mother (who was once his father), Eriko. As the three of them form an improvised family that soon weathers its own tragic losses, Yoshimoto spins a lovely, evocative tale that recalls early Marguerite Duras. ", " and its companion story, \"Moonlight Shadow,\" are elegant tales whose seeming simplicity is the ruse of a writer whose voice echoes in the mind and the soul."], "author": "Banana Yoshimoto", "num_pages": "152", "awards": ["Nihon University Department of Arts Prize (1986)", "Kaien magazine New Writer Prize (1987)", "Mishima Yukio Prize 三島由紀夫賞 Nominee (1988)"], "places": ["Tokyo", "Izu", "Isehara"], "character_names": ["Mikage Sakurai", "Yūichi", "Eriko"], "language": "English", "publish_date": "2006-04-17 00:00:00", "ISBN": "0802142443"},
{"url": "https://www.goodreads.com/book/show/33600.Shantaram", "num_ratings": "126,752", "num_reviews": "11,196", "avg_ratings": 4.27, "genres": ["Fiction", "Cultural", "India", "Travel", "Adventure"], "title": "Shantaram", "description": ["\"It took me a long time and most of the world to learn what I know about love and fate and the choices we make, but the heart of it came to me in an instant, while I was chained to a wall and being tortured.\"", "So begins this epic, mesmerizing first novel set in the underworld of contemporary Bombay. Shantaram is narrated by Lin, an escaped convict with a false passport who f", "\"It took me a long time and most of the world to learn what I know about love and fate and the choices we make, but the heart of it came to me in an instant, while I was chained to a wall and being tortured.\"", "So begins this epic, mesmerizing first novel set in the underworld of contemporary Bombay. Shantaram is narrated by Lin, an escaped convict with a false passport who flees maximum security prison in Australia for the teeming streets of a city where he can disappear.", "Accompanied by his guide and faithful friend, Prabaker, the two enter Bombay's hidden society of beggars and gangsters, prostitutes and holy men, soldiers and actors, and Indians and exiles from other countries, who seek in this remarkable place what they cannot find elsewhere.", "As a hunted man without a home, family, or identity, Lin searches for love and meaning while running a clinic in one of the city's poorest slums, and serving his apprenticeship in the dark arts of the Bombay mafia. The search leads him to war, prison torture, murder, and a series of enigmatic and bloody betrayals. The keys to unlock the mysteries and intrigues that bind Lin are held by two people. The first is Khader Khan: mafia godfather, criminal-philosopher-saint, and mentor to Lin in the underworld of the Golden City. The second is Karla: elusive, dangerous, and beautiful, whose passions are driven by secrets that torment her and yet give her a terrible power.", "Burning slums and five-star hotels, romantic love and prison agonies, criminal wars and Bollywood films, spiritual gurus and mujaheddin guerrillas – this huge novel has the world of human experience in its reach, and a passionate love for India at its heart. Based on the life of the author, it is by any measure the debut of an extraordinary voice in literature."], "author": "Gregory David Roberts", "num_pages": "936", "awards": ["Commonwealth Writers' Prize Nominee for Best First Book (the Pacific Region) (2004)"], "places": ["Bombay", "Afghanistan"], "character_names": ["Lin Ford", "Karla Saraanen", "Lisa", "Prabaker", "Abdel Khader Khan", "Abdullah Taheri", "Nazeer", "Didier"], "language": "English", "publish_date": "2004-08-16 00:00:00", "ISBN": "192076920X"},
{"url": "https://www.goodreads.com/book/show/15796700-americanah", "num_ratings": "169,639", "num_reviews": "16,436", "avg_ratings": 4.28, "genres": ["Fiction", "Cultural", "Africa", "Contemporary", "Feminism", "Literary Fiction"], "title": "Americanah", "description": ["Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a d", "Ifemelu and Obinze are young and in love when they depart military-ruled Nigeria for the West. Beautiful, self-assured Ifemelu heads for America, where despite her academic success, she is forced to grapple with what it means to be black for the first time. Quiet, thoughtful Obinze had hoped to join her, but with post-9/11 America closed to him, he instead plunges into a dangerous, undocumented life in London. Fifteen years later, they reunite in a newly democratic Nigeria, and reignite their passion—for each other and for their homeland.", "Source: chimamanda.com"], "author": "Chimamanda Ngozi Adichie", "num_pages": "477", "awards": ["Chicago Tribune Heartland Prize for Fiction (2013)", "National Book Critics Circle Award for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal Nominee for Fiction (Shortlist) (2014)", "Goodreads Choice Award Nominee for Fiction (2013)", "International DUBLIN Literary Award Nominee for Shortlist (2015)", "Go On Girl! Book Club Award for Author of the Year (2016)"], "places": ["Lagos", "London, England", "Princeton, New Jersey"], "character_names": ["Ifemelu", "Obinze"], "language": "English", "publish_date": "2013-05-14 00:00:00", "ISBN": "0307271080"},
{"url": "https://www.goodreads.com/book/show/12555.The_Bonesetter_s_Daughter", "num_ratings": "108,747", "num_reviews": "3,108", "avg_ratings": 3.98, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia"], "title": "The Bonesetter's Daughter", "description": ["Ruth Young and her widowed mother, LuLing, have always had a tumultuous relationship. Now, before she succumbs to forgetfulness, LuLing gives Ruth some of her writings, which reveal a side of LuLing that Ruth has never known. . . .", "In a remote mountain village where ghosts and tradition rule, LuLing grows up in the care of her mute Precious Auntie as the family endures a cu", "Ruth Young and her widowed mother, LuLing, have always had a tumultuous relationship. Now, before she succumbs to forgetfulness, LuLing gives Ruth some of her writings, which reveal a side of LuLing that Ruth has never known. . . .", "In a remote mountain village where ghosts and tradition rule, LuLing grows up in the care of her mute Precious Auntie as the family endures a curse laid upon a relative known as the bonesetter. When headstrong LuLing rejects the marriage proposal of the coffinmaker, a shocking series of events are set in motion–all of which lead back to Ruth and LuLing in modern San Francisco. The truth that Ruth learns from her mother’s past will forever change her perception of family, love, and forgiveness."], "author": "Amy Tan", "num_pages": "368", "awards": ["Orange Prize Nominee for Fiction Longlist (2001)"], "places": ["China", "San Francisco, California"], "character_names": ["Ruth Young", "LuLing", "Bibi Tersayang", "GaoLing"], "language": "English", "publish_date": "2003-02-04 00:00:00", "ISBN": "0345457374"},
{"url": "https://www.goodreads.com/book/show/5849.A_House_for_Mr_Biswas", "num_ratings": "15,646", "num_reviews": "723", "avg_ratings": 3.82, "genres": ["Fiction", "Cultural", "India", "Novels", "Nobel Prize"], "title": "A House for Mr Biswas", "description": ["Mohun Biswas has spent his 46 years of life striving for independence. Shuttled from one residence to another after the drowning of his father, he yearns for a place he can call home. He marries into the Tulsi family, on whom he becomes dependent, but rebels and takes on a succession of occupations in a struggle to weaken their hold over him."], "author": "V.S. Naipaul", "num_pages": "623", "awards": [], "places": ["Trinidad and Tobago"], "character_names": ["Mohun Biswas", "Shama"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0330487191"},
{"url": "https://www.goodreads.com/book/show/177869.Bellefleur", "num_ratings": "1,999", "num_reviews": "158", "avg_ratings": 3.74, "genres": ["Fiction", "Gothic", "Historical", "Historical Fiction", "Horror", "Fantasy"], "title": "Bellefleur", "description": ["A wealthy and notorious clan, the Bellefleurs live in a region not unlike the Adirondacks, in an enormous mansion on the shores of mythic Lake Noir. They own vast lands and profitable businesses, they employ their neighbors, and they influence the government. A prolific and eccentric group, they include several millionaires, a mass murderer, a spiritual seeker who climbs i", "A wealthy and notorious clan, the Bellefleurs live in a region not unlike the Adirondacks, in an enormous mansion on the shores of mythic Lake Noir. They own vast lands and profitable businesses, they employ their neighbors, and they influence the government. A prolific and eccentric group, they include several millionaires, a mass murderer, a spiritual seeker who climbs into the mountains looking for God, a wealthy noctambulist who dies of a chicken scratch.", "Bellefleur traces the lives of several generations of this unusual family. At its center is Gideon Bellefleur and his imperious, somewhat psychic, very beautiful wife, Leah, their three children (one with frightening psychic abilities), and the servants and relatives, living and dead, who inhabit the mansion and its environs. Their story offers a profound look at the world's changeableness, time and eternity, space and soul, pride and physicality versus love. Bellefleur is an allegory of caritas versus cupiditas, love and selflessness versus pride and selfishness. It is a novel of change, baffling complexity, mystery.", "Written with a voluptuousness and startling immediacy that transcends Joyce Carol Oates's early works, Bellefleur is widely regarded as a masterwork—a feat of literary genius."], "author": "Joyce Carol Oates", "num_pages": "592", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-09-13 00:00:00", "ISBN": "0452267943"},
{"url": "https://www.goodreads.com/book/show/669780.Season_of_Migration_to_the_North", "num_ratings": "15,293", "num_reviews": "1,931", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Northern Africa", "Sudan", "Literature"], "title": "Season of Migration to the North", "description": ["After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into", "After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into his confidence, telling him the story of his own years in London, of his brilliant career as an economist, and of the series of fraught and deadly relationships with European women that led to a terrible public reckoning and his return to his native land.", "But what is the meaning of Mustafa’s shocking confession? Mustafa disappears without explanation, leaving the young man—whom he has asked to look after his wife—in an unsettled and violent no-man’s-land between Europe and Africa, tradition and innovation, holiness and defilement, and man and woman, from which no one will escape unaltered or unharmed.", "Season of Migration to the North is a rich and sensual work of deep honesty and incandescent lyricism. In 2001 it was selected by a panel of Arab writers and critics as the most important Arab novel of the twentieth century."], "author": "Tayeb Salih", "num_pages": "176", "awards": [], "places": ["North Africa"], "character_names": [], "language": "English", "publish_date": "1970-01-01 00:00:00", "ISBN": "0435900668"},
{"url": "https://www.goodreads.com/book/show/9503.Saving_Fish_from_Drowning", "num_ratings": "27,237", "num_reviews": "2,726", "avg_ratings": 3.42, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia"], "title": "Saving Fish from Drowning", "description": ["San Francisco art patron Bibi Chen has planned a journey of the senses along the famed Burma Road for eleven lucky friends. But after her mysterious death, Bibi watches aghast from her ghostly perch as the travelers veer off her itinerary and embark on a trail paved with cultural gaffes and tribal curses, Buddhist illusions and romantic desires. On Christmas morning, the t", "San Francisco art patron Bibi Chen has planned a journey of the senses along the famed Burma Road for eleven lucky friends. But after her mysterious death, Bibi watches aghast from her ghostly perch as the travelers veer off her itinerary and embark on a trail paved with cultural gaffes and tribal curses, Buddhist illusions and romantic desires. On Christmas morning, the tourists cruise across a misty lake and disappear.", "With picaresque characters and mesmerizing imagery, ", " gives us a voice as idiosyncratic, sharp, and affectionate as the mothers of ", ". Bibi is the observant eye of human nature–the witness of good intentions and bad outcomes, of desperate souls and those who wish to save them. In the end, Tan takes her readers to that place in their own heart where hope is found."], "author": "Amy Tan", "num_pages": "472", "awards": ["Asian/Pacific American Award for Literature for Adult Fiction Honor (2005)"], "places": ["Myanmar", "Burma"], "character_names": ["Bibi Chen"], "language": "English", "publish_date": "2006-09-26 00:00:00", "ISBN": "034546401X"},
{"url": "https://www.goodreads.com/book/show/26237327-the-secret-life-of-winnie-cox", "num_ratings": "551", "num_reviews": "76", "avg_ratings": 3.9, "genres": ["Historical", "Historical Fiction", "Romance", "Historical"], "title": "The Secret Life of Winnie Cox", "description": ["1910, South America. A time of racial tension and poverty. A time where forbidden love must remain a secret.", "Winnie Cox lives a privileged life of dances and dresses on her father’s sugar cane plantation. Life is sweet in the kingdom of sugar and Winnie along with her sister Johanna, have neither worries nor responsibilities, they are birds of paradise, protected from the p", "1910, South America. A time of racial tension and poverty. A time where forbidden love must remain a secret.", "Winnie Cox lives a privileged life of dances and dresses on her father’s sugar cane plantation. Life is sweet in the kingdom of sugar and Winnie along with her sister Johanna, have neither worries nor responsibilities, they are birds of paradise, protected from the poverty in the world around them. ", "But everything can change in a heartbeat ... ", "When Winnie falls in love with George Quint, the post-office boy, a ‘darkie’ from the other side, she soon finds herself slipping into a double life. And as she withdraws from her family, she discovers a shocking secret about those whom are closest to her. Now, more than ever, Winnie is determined to prove her love for George, whatever price she must pay and however tragic the consequences might be. ", "A breath-taking love story of two people fighting to be together, in a world determined to break them apart.", "Acclaim for Sharon Maas:", "'A terrific writer.’ - Barbara Erskine ", "'A page-turning story, full of humanity, crossing cultures and continents, reminiscent of Andrea Levy.’ - Katie Fforde ", "'A beautiful story about tragic love and ultimately about forgiveness ... with powerful messages about love, life and learning to let things go in order to be happy.’ ", " - Life With Joy", "'Rich in detail and emotion and has the most beautiful and real description of loss I have ever read.’ - Shaz’s Book blog ", "'Wow what a very touching story that was filled with super characters and important real-life issues ...’ ", " - AJ Book Review Club", "'If you are fond of family dramas that span generations, continents, and cultures, you will find this to be a worthwhile read. I found the shift in attitudes toward gender and ethnicity across generations and cultures to be particularly interesting.' - janetursel.com"], "author": "Sharon Maas", "num_pages": "420", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-10-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1332481.Shame", "num_ratings": "9,408", "num_reviews": "470", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "India", "Magical Realism", "Literature"], "title": "Shame", "description": ["The novel that set the stage for his modern classic, ", ", ", " is Salman Rushdie’s phantasmagoric epic of an unnamed country that is “not quite Pakistan.” In this dazzling tale of an ongoing duel between the families of two men–one a celebrated wager of war, the other a debauched lover of pleasure–Rushdie brilliantly portrays a world caught between honor an", "The novel that set the stage for his modern classic, ", ", ", " is Salman Rushdie’s phantasmagoric epic of an unnamed country that is “not quite Pakistan.” In this dazzling tale of an ongoing duel between the families of two men–one a celebrated wager of war, the other a debauched lover of pleasure–Rushdie brilliantly portrays a world caught between honor and humiliation–“shamelessness, shame: the roots of violence.” ", " is an astonishing story that grows more timely by the day."], "author": "Salman Rushdie", "num_pages": "320", "awards": ["Man Booker Prize Nominee (1983)", "Prix du Meilleur Livre Étranger for Roman (1985)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-03-11 00:00:00", "ISBN": "0812976703"},
{"url": "https://www.goodreads.com/book/show/20872557-once-upon-a-mulberry-field", "num_ratings": "51", "num_reviews": "18", "avg_ratings": 4.18, "genres": ["Historical", "Historical Fiction", "Abandoned"], "title": "Once upon a Mulberry Field", "description": ["As Roger Connors, a widower with no children, ponders whether to pursue aggressive treatment for his cancer, a cryptic note arrives from a long-lost USAF buddy announcing the visit of an acquaintance from Vietnam. The startling news resurrects ghosts of fallen comrades and haunting memories of the great love he once knew.", "Shocking revelations from his visitor uncover a miss", "As Roger Connors, a widower with no children, ponders whether to pursue aggressive treatment for his cancer, a cryptic note arrives from a long-lost USAF buddy announcing the visit of an acquaintance from Vietnam. The startling news resurrects ghosts of fallen comrades and haunting memories of the great love he once knew.", "Shocking revelations from his visitor uncover a missing part of Roger’s life he never dreamed possible. Peeling back one layer at a time, he delves into a decades-old secret in search of answers and traces of a passion unfulfilled.", "From the jungles of Vietnam through the minefields of the heart, \"Once upon a Mulberry Field\" follows one man’s journey to self-discovery, fraught with disillusionment and despair but ultimately redeemed by the power of love."], "author": "C.L. Hoang", "num_pages": "392", "awards": ["Eric Hoffer Book Award Nominee for General Fiction (2015)", "Writer's Digest Self-Published Book Competition Nominee for Genre Fiction (2014)", "Readers' Favorite Book Award for Fiction - Cultural (Bronze) (2015)", "Kindle Book Award Nominee for Romance (Semi-Finalist) (2014)", "Global Ebook Awards (2014)", "National Indie Excellence Awards Nominee for Historical Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-14 00:00:00", "ISBN": "0989975673"},
{"url": "https://www.goodreads.com/book/show/5845.A_Bend_in_the_River", "num_ratings": "13,432", "num_reviews": "750", "avg_ratings": 3.77, "genres": ["Cultural", "Africa", "Classics", "Literature"], "title": "A Bend in the River", "description": ["When Salim, a young Indian man, is offered a small business in Central Africa, he accepts. As he strives to establish himself, he becomes closely involved with the fluid and dangerous politics of the newly-dependent state."], "author": "V.S. Naipaul", "num_pages": "326", "awards": ["Man Booker Prize Nominee (1979)"], "places": ["Africa"], "character_names": ["Salim", "Metty", "Zabeth", "Ferdinand (A Bend in the River)", "Nazruddin", "Mahesh", "Shoba", "Father Huismans", "Indar", "Raymond (A Bend in the River)", "Yvette (A Bend in the River)"], "language": "English", "publish_date": "2002-05-10 00:00:00", "ISBN": "0330487140"},
{"url": "https://www.goodreads.com/book/show/8655013-the-silver-king", "num_ratings": "3", "num_reviews": "1", "avg_ratings": 5.0, "genres": [], "title": "The Silver King: A Novel", "description": ["The Silver King portrays the intrigue within the underground movement of the Contras seeking the first democracy for Nicaragua. This miracle of freedom is shaped by Sheridan Quince, an American pilot and fisherman, who aspires to catch-and-release a world-record tarpon, or silver king, with a fly rod in the Caribbean Sea. After meeting at the Key Largo Bar in San Jose, Cos", "The Silver King portrays the intrigue within the underground movement of the Contras seeking the first democracy for Nicaragua. This miracle of freedom is shaped by Sheridan Quince, an American pilot and fisherman, who aspires to catch-and-release a world-record tarpon, or silver king, with a fly rod in the Caribbean Sea. After meeting at the Key Largo Bar in San Jose, Costa Rica, Elsa Paraiso leads him underground into the power struggle between the US-backed Contras and Sandinistas, financed by the USSR. The players are Ronald Reagan, Oliver North, Fidel Castro, Oscar Arias, Daniel Ortega and Violeta Chamorro, who seeks election as one of the first women Presidents of a nation in the Western Hemisphere. ", "The Silver King is a tale of political power plays and high finance among the tropical rainforests, beaches and money centers of Central America. The story traverses San Jose, the Caribbean, Panama and Managua under siege. The Silver King chronicles the genesis of democracy in our time. It is a worthy tale about the value of a free society to a nation of four million people gripped in a desperate struggle to build one."], "author": "David B. Lentz", "num_pages": "280", "awards": [], "places": ["Parismina"], "character_names": ["Oliver North", "Daniel Ortega", "Sheridan Quince", "Victor Quince", "Elsa Paraiso", "Humberto Ortega", "Francisco Paraiso", "Violetta Chamorro", "Oscar Arias", "President Ronald Reagan"], "language": "English", "publish_date": "2010-07-26 00:00:00", "ISBN": "1452895937"},
{"url": "https://www.goodreads.com/book/show/16091194-the-officer-s-bride", "num_ratings": "12", "num_reviews": "3", "avg_ratings": 4.0, "genres": ["Fiction", "Cultural", "African American", "Literature", "African Literature"], "title": "The Officer's Bride", "description": ["Love in the midst of mayhem?", "It’s the nineties and a violent dictator rules Nigeria with an iron fist. Nafisah knows firsthand the chaos that results from this type of rule, so when she meets Eddy, an aide to the current leader, and a top member of the Nigerian intelligence service, she believes her situation just went from bad to worse. But Eddy completely contradicts her", "Love in the midst of mayhem?", "It’s the nineties and a violent dictator rules Nigeria with an iron fist. Nafisah knows firsthand the chaos that results from this type of rule, so when she meets Eddy, an aide to the current leader, and a top member of the Nigerian intelligence service, she believes her situation just went from bad to worse. But Eddy completely contradicts her expectations, and she finds herself falling for him, only to discover that he carries a secret that could just about topple the nation"], "author": "Lara Daniels", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "2012-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7005479-island-beneath-the-sea", "num_ratings": "27,377", "num_reviews": "2,830", "avg_ratings": 4.03, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Magical Realism"], "title": "Island Beneath the Sea", "description": [" ", " ", " ", "Translated from the Spanish by Margaret Sayers Peden."], "author": "Isabel Allende", "num_pages": "457", "awards": [], "places": ["Saint-Domingue"], "character_names": ["Jean Lafitte", "Zarité Sedella", "Toulouse Valmorain", "Violette Boisier", "Sancho García del Solar", "Maurice Valmorain", "Rosette Sedella", "Tante Rose", "Dr. Parmentier", "Loula"], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "0061988243"},
{"url": "https://www.goodreads.com/book/show/33508951-a-girl-in-traffick", "num_ratings": "114", "num_reviews": "18", "avg_ratings": 4.15, "genres": ["Fiction"], "title": "A Girl In Traffick", "description": ["Twelve-year-old Juhi Gupta loves her simple life in a remote Indian village. She and her mother and father might be poor, but they’re happy. Then one day, everything changes.", "Her father goes to the doctor for a simple procedure—the removal of a rotten tooth—but instead, his kidney is stolen and sold on the black market. Juhi and her parents are kidnapped and dropped in a Ne", "Twelve-year-old Juhi Gupta loves her simple life in a remote Indian village. She and her mother and father might be poor, but they’re happy. Then one day, everything changes.", "Her father goes to the doctor for a simple procedure—the removal of a rotten tooth—but instead, his kidney is stolen and sold on the black market. Juhi and her parents are kidnapped and dropped in a New Delhi slum. Separated from her parents, Juhi must quickly learn to survive. ", "Luckily, she has a rare skill that’s greatly in demand, especially in the slums: she knows how to read and write. At first, her quick wits allow her to thrive, but soon they attract unwanted attention, and she’s faced with impossible decisions and desperate choices.", "Meanwhile, in the United States, Kevin Whitman is dying. No American doctor can help him, so he ventures to India for treatment. He has no idea that in so doing, he’ll change Juhi’s life forever."], "author": "Mamta Jain Valderrama", "num_pages": "289", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-12-15 00:00:00"},
{"url": "https://www.goodreads.com/book/show/28162590-the-white-man-and-the-pachinko-girl", "num_ratings": "29", "num_reviews": "3", "avg_ratings": 3.62, "genres": ["Cultural", "Japan", "Mystery"], "title": "The White Man and the Pachinko Girl", "description": ["Synopsis:", "An American businessman who liked to linger in Pachinko parlor every night in his lonely life as a foreigner in the city of Tokyo met Misa, a young Japanese hostess that worked at a Pachinko parlor by chance. Knowing her personal woes, he gave her his winning as an exchange for Japanese lessons. That large sum of money incriminated them to false accuse of sex trad", "Synopsis:", "An American businessman who liked to linger in Pachinko parlor every night in his lonely life as a foreigner in the city of Tokyo met Misa, a young Japanese hostess that worked at a Pachinko parlor by chance. Knowing her personal woes, he gave her his winning as an exchange for Japanese lessons. That large sum of money incriminated them to false accuse of sex trade. Meanwhile, an ex-adult film producer investigated the death of a French movie producer of cult status who happened to have filmed Misa in his last legendary work in Japan, in which she was seemingly strangled to death. ", "Motivation: ", "Japan has always fascinates me, yet the more I learnt about it, the more I have come to realize that this amazing country with its unique cultures and rich history often times offered so much distraction through its dazzling, energetic, relentless representations in anime, movies, pop music and world-class innovations that they masked the diverse voices of the people behind. ", "On the surface, The White Man and the Pachinko Girl is a murder mystery. In fact, I tried to use this work to explores many human rights issues such as gender inequality, hyper sexualization of teens, homosexual discrimination, racial discrimination and workplace bullying among others in Japan through the eyes of a foreigner with his friends from different walks of lives and professions. Through the protagonists' adventures, we can experience first hand the alienation, the suppression, the abuse, the emotional struggle that they, and a lot of Japanese, are going through."], "author": "Vann Chow", "num_pages": "390", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-12-08 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24791787-kaya-abaniah-and-the-father-of-the-forest", "num_ratings": "21", "num_reviews": "4", "avg_ratings": 4.71, "genres": ["Fantasy", "Fiction", "Science Fiction", "Science Fiction Fantasy", "Young Adult"], "title": "Kaya Abaniah and the Father of the Forest", "description": ["LEGENDS ARE IMMORTAL DREAMS MADE FLESH...", "Kaya Abaniah believes he’s an ordinary fourteen-year-old college student. He lives with his mother on the Caribbean island of Trinidad; he’s passionate about wildlife conservation and has a crush on the prettiest girl in his class. However, one fateful day, Kaya’s life is changed forever when he encounters Papa Bois, a folklore char", "LEGENDS ARE IMMORTAL DREAMS MADE FLESH...", "Kaya Abaniah believes he’s an ordinary fourteen-year-old college student. He lives with his mother on the Caribbean island of Trinidad; he’s passionate about wildlife conservation and has a crush on the prettiest girl in his class. However, one fateful day, Kaya’s life is changed forever when he encounters Papa Bois, a folklore character similar to the Greek god, Pan.", "Kaya learns he has the talent. He’s a telepath, and he’s not alone. He discovers that men in black are constantly watching him, Soucouyant, the shape-shifting vampire wants his blood, and his packed lunch is never safe.", "Will Kaya succeed in protecting his relatives and friends from the supernatural evils that lurk on the tropic isle? Can he reveal the shape-shifter’s secret identity? And, why on Earth is the most gorgeous girl, he’s ever known, so interested in him?", "Follow Kaya’s struggles with love, rivalry, and academic life, as he confronts the terrifying creatures of Trinidad and Tobago’s folklore, and unlocks the shocking mystery of Papa Bois, the father of the forest.", "About the Author:", "Wayne Gerard Trotman is a British/Trinidadian writer, blogger, filmmaker, artist, photographer, composer and producer of electronic music."], "author": "Wayne Gerard Trotman", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-31 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18392905-jumping-ship", "num_ratings": "50", "num_reviews": "27", "avg_ratings": 4.4, "genres": [], "title": "Jumping Ship", "description": ["JUMPING SHIP: AN INTRODUCTORY NOVELLA", "The year was nineteen seventy-five. Barren couple, Pearl and Edward Riley stumbled upon a newborn baby girl. Her cries could only be heard by a true mother, which Pearl immediately became. Bundled up with their new child, they discovered a parcel of artifacts and a scribbled note that read: Sakkara. Pregnant seamstress, Petrina Dugal, b", "JUMPING SHIP: AN INTRODUCTORY NOVELLA", "The year was nineteen seventy-five. Barren couple, Pearl and Edward Riley stumbled upon a newborn baby girl. Her cries could only be heard by a true mother, which Pearl immediately became. Bundled up with their new child, they discovered a parcel of artifacts and a scribbled note that read: Sakkara. Pregnant seamstress, Petrina Dugal, became a runaway at the age of twenty-six. She ran away from a brutish husband, Roger, and a well-loved South American home in Georgetown, Guyana; at the heart of her rebellion – an enigmatic lover named Michael Chen. Pet and Mikey, as they became affectionately known, allowed love to blossom in front of her police officer husband and an intrusive community. Were they not aware of the dangers? Or did the pursuit of love trump obligations?", "Sakkara Riley grew up with two loving parents – adoptive parents to be exact. She never knew the circumstances surrounding her discovery, until the age of sixteen. She embarks on a journey.", "Jumping Ship is an introductory novella to the Island Hopping Series. There are 7 planned books - representing each of the islands that Sakkara will visit along the way.", "Book Trailer: "], "author": "Janice  Ross", "num_pages": "90", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-16 00:00:00", "ISBN": "1492255475"},
{"url": "https://www.goodreads.com/book/show/19003.The_Little_Drummer_Girl", "num_ratings": "8,208", "num_reviews": "358", "avg_ratings": 3.95, "genres": ["Fiction", "Thriller", "Spy Thriller", "Espionage", "Mystery"], "title": "The Little Drummer Girl", "description": ["John le Carre's classic novels deftly navigate readers through the intricate shadow worlds of international espionage with unsurpassed skill and knowledge, and have earned him unprecedented worldwide acclaim.", "In this thrilling and thought-provoking novel of Middle Eastern intrigue, Charlie, a brilliant and beautiful young English actress, is lured into \"the theatre of the r", "John le Carre's classic novels deftly navigate readers through the intricate shadow worlds of international espionage with unsurpassed skill and knowledge, and have earned him unprecedented worldwide acclaim.", "In this thrilling and thought-provoking novel of Middle Eastern intrigue, Charlie, a brilliant and beautiful young English actress, is lured into \"the theatre of the real\" by an Israeli intelligence officer. Forced to play her ultimate role, she is plunged into a deceptive and delicate trap set to ensnare an elusive Palestinian terrorist."], "author": "John le Carré", "num_pages": "672", "awards": ["Edgar Award Nominee for Best Novel (1984)", "Japan Adventure Fiction Association Prize 日本冒険小説協会大賞特別賞 for Best Translated Novel (1983)"], "places": [], "character_names": ["Martin Kurtz"], "language": "English", "publish_date": "2000-04-01 00:00:00", "ISBN": "0671042785"},
{"url": "https://www.goodreads.com/book/show/45783.The_Tailor_of_Panama", "num_ratings": "5,969", "num_reviews": "314", "avg_ratings": 3.46, "genres": ["Fiction", "Thriller", "Spy Thriller", "Espionage", "Mystery"], "title": "The Tailor of Panama", "author": "John le Carré", "num_pages": "332", "awards": [], "places": ["Panama"], "character_names": [], "language": "English", "publish_date": "1996-10-14 00:00:00", "ISBN": "0679454462"},
{"url": "https://www.goodreads.com/book/show/52877.The_Toughest_Indian_in_the_World", "num_ratings": "6,210", "num_reviews": "394", "avg_ratings": 4.08, "genres": ["Fiction", "Short Stories", "Literature", "Literature", "American"], "title": "The Toughest Indian in the World", "description": ["A beloved American writer whose books are championed by critics and readers alike, Sherman Alexie has been hailed by Time as \"one of the better new novelists, Indian or otherwise.\" ", "In these stories, we meet the kind of American Indians we rarely see in literature -- the kind who pay their bills, hold down jobs, fall in and out of love. ", "A Spokane Indian journalist transplan", "A beloved American writer whose books are championed by critics and readers alike, Sherman Alexie has been hailed by Time as \"one of the better new novelists, Indian or otherwise.\" ", "In these stories, we meet the kind of American Indians we rarely see in literature -- the kind who pay their bills, hold down jobs, fall in and out of love. ", "A Spokane Indian journalist transplanted from the reservation to the city picks up a hitchhiker, a Lummi boxer looking to take on the toughest Indian in the world. A Spokane son waits for his diabetic father to come home from the hospital, tossing out the Hershey Kisses the father has hidden all over the house. An estranged interracial couple, separated in the midst of a traffic accident, rediscover their love for each other. A white drifter holds up an International House of Pancakes, demanding a dollar per customer and someone to love, and emerges with $42 and an overweight Indian he dubs Salmon Boy. ", "Sherman Alexie's voice is one of remarkable passion, and these stories are love stories -- between parents and children, white people and Indians, movie stars and ordinary people. Witty, tender, and fierce, ", " is a virtuoso performance by one of the country's finest writers."], "author": "Sherman Alexie", "num_pages": "256", "awards": ["Kiriyama Prize Nominee for Fiction (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2001-02-01 00:00:00", "ISBN": "0802138004"},
{"url": "https://www.goodreads.com/book/show/21474432-of-marriageable-age", "num_ratings": "1,962", "num_reviews": "175", "avg_ratings": 4.17, "genres": ["Cultural", "India", "Fiction", "Historical", "Historical Fiction", "Historical"], "title": "Of Marriageable Age", "description": [" intuitive and charismatic, grows up among the servants of a pre-war English household in Madras. But the traditional customs of her Brahmin family clash against English upper-class prejudice, threatening her love for the privileged son of the house.", ", raised a", " intuitive and charismatic, grows up among the servants of a pre-war English household in Madras. But the traditional customs of her Brahmin family clash against English upper-class prejudice, threatening her love for the privileged son of the house.", ", raised as the son of an idealistic doctor in rural South India, finds life in London heady, with girls and grass easily available… until he is summoned back home to face raw reality."], "author": "Sharon Maas", "num_pages": "548", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-03-14 00:00:00", "ISBN": "1909490237"},
{"url": "https://www.goodreads.com/book/show/667712.Disgrace", "num_ratings": "69,575", "num_reviews": "5,064", "avg_ratings": 3.84, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Novels", "Literature"], "title": "Disgrace", "description": ["A divorced, middle-aged English professor finds himself increasingly unable to resist affairs with his female students. When discovered by the college authorities, he is expected to apologise and repent in an effort to save his job, but he refuses to become a scapegoat in what he see as as a show trial designed to reinforce a stringent political correctness. ", "He preempts th", "A divorced, middle-aged English professor finds himself increasingly unable to resist affairs with his female students. When discovered by the college authorities, he is expected to apologise and repent in an effort to save his job, but he refuses to become a scapegoat in what he see as as a show trial designed to reinforce a stringent political correctness. ", "He preempts the authorities and leaves his job, and the city, to spend time with his grown-up lesbian daughter on her remote farm. Things between them are strained - there is much from the past they need to reconcile - and the situation becomes critical when they are the victims of a brutal and horrifying attack. ", "In spectacularly powerful and lucid prose, J.M. Coetzee uses all his formidable skills to engage with a post-apartheid culture in unexpected and revealing ways. This examination into the sexual and political lawlessness of modern South Africa as it tries desperately to start a fresh page in its history is chilling, uncompromising and unforgettable."], "author": "J.M. Coetzee", "num_pages": "220", "awards": ["Man Booker Prize (1999)", "National Book Critics Circle Award Nominee for Fiction (1999)", "Commonwealth Writers' Prize for Best Book Overall (2000)", "The Best of the Booker Nominee (2008)"], "places": ["South Africa", "Cape Town"], "character_names": ["David Lurie", "Lucy Lurie", "Petrus", "Bev Shaw", "Melanie Isaacs"], "language": "English", "publish_date": "1999-08-16 00:00:00", "ISBN": "0670887315"},
{"url": "https://www.goodreads.com/book/show/7244.The_Poisonwood_Bible", "num_ratings": "591,565", "num_reviews": "20,959", "avg_ratings": 4.04, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Classics"], "title": "The Poisonwood Bible", "description": [" is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is", " is a story told by the wife and four daughters of Nathan Price, a fierce, evangelical Baptist who takes his family and mission to the Belgian Congo in 1959. They carry with them everything they believe they will need from home, but soon find that all of it -- from garden seeds to Scripture -- is calamitously transformed on African soil. What follows is a suspenseful epic of one family's tragic undoing and remarkable reconstruction over the course of three decades in postcolonial Africa."], "author": "Barbara Kingsolver", "num_pages": "546", "awards": ["Pulitzer Prize Nominee for Fiction (1999)", "Orange Prize Nominee for Fiction Shortlist (1999)", "Book Sense Book of the Year Award for Adult (2000)", "PEN/Faulkner Award for Fiction Nominee (1999)", "Independent Publisher Book Award (IPPY) for Audio Fiction - Unabridged (1999)", "Exclusive Books Boeke Prize (2000)", "Puddly Award for Novel (2001)"], "places": ["Bethlehem, Georgia", "Kilanga", "Sanderling Island, Georgia", "Leopoldville"], "character_names": ["Orleanna Price", "Ruth May Price", "Rachel Rebeccah Price", "Leah Price", "Nathan Price", "Dr Bud Wharton", "Adah Price", "Reverend & Mrs. Underdown"], "language": "English", "publish_date": "2005-07-05 00:00:00", "ISBN": "0060786507"},
{"url": "https://www.goodreads.com/book/show/9118135-state-of-wonder", "num_ratings": "146,953", "num_reviews": "15,372", "avg_ratings": 3.86, "genres": ["Fiction", "Contemporary", "Book Club", "Literary Fiction", "Adult Fiction"], "title": "State of Wonder", "description": ["As Dr. Marina Singh embarks upon an uncertain odyssey into the insect-infested Amazon, she will be forced to surrender herself to the lush but forbidding world that awaits within the jungle. Charged with finding her former mentor Dr. Annick Swenson, a researcher who has disappeared while working on a valuable new drug, she will have to confront her own memories of tragedy", "As Dr. Marina Singh embarks upon an uncertain odyssey into the insect-infested Amazon, she will be forced to surrender herself to the lush but forbidding world that awaits within the jungle. Charged with finding her former mentor Dr. Annick Swenson, a researcher who has disappeared while working on a valuable new drug, she will have to confront her own memories of tragedy and sacrifice as she journeys into the unforgiving heart of darkness."], "author": "Ann Patchett", "num_pages": "353", "awards": ["Orange Prize Nominee for Fiction Shortlist (2012)", "Audie Award for Literary Fiction (2012)", "Wellcome Book Prize Nominee for Shortlist (2011)"], "places": ["Amazon Rainforest", "Minneapolis-St. Paul, Minnesota"], "character_names": ["Dr. Marina Singh", "Dr. Annick Swenson", "Dr. Anders Eckman"], "language": "English", "publish_date": "2011-06-07 00:00:00", "ISBN": "0062049801"},
{"url": "https://www.goodreads.com/book/show/1774836.The_Palace_of_Illusions", "num_ratings": "21,744", "num_reviews": "2,185", "avg_ratings": 4.13, "genres": ["Fiction", "Cultural", "India", "Fantasy", "Mythology", "Historical", "Historical Fiction", "Fantasy"], "title": "The Palace of Illusions", "description": ["A reimagining of the world-famous Indian epic, the Mahabharat—told from the point of view of an amazing woman.", "Relevant to today’s war-torn world, ", " takes us back to a time that is half history, half myth, and wholly magical. Narrated by Panchaali, the wife of the legendary Pandavas brothers in the Mahabharat, the novel gives us a new interpretation of", "A reimagining of the world-famous Indian epic, the Mahabharat—told from the point of view of an amazing woman.", "Relevant to today’s war-torn world, ", " takes us back to a time that is half history, half myth, and wholly magical. Narrated by Panchaali, the wife of the legendary Pandavas brothers in the Mahabharat, the novel gives us a new interpretation of this ancient tale. ", "The novel traces the princess Panchaali's life, beginning with her birth in fire and following her spirited balancing act as a woman with five husbands who have been cheated out of their father’s kingdom. Panchaali is swept into their quest to reclaim their birthright, remaining at their side through years of exile and a terrible civil war involving all the important kings of India. Meanwhile, we never lose sight of her strategic duels with her mother-in-law, her complicated friendship with the enigmatic Krishna, or her secret attraction to the mysterious man who is her husbands' most dangerous enemy. Panchaali is a fiery female redefining for us a world of warriors, gods, and the ever-manipulating hands of fate."], "author": "Chitra Banerjee Divakaruni", "num_pages": "360", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "2008-02-12 00:00:00", "ISBN": "0385515995"},
{"url": "https://www.goodreads.com/book/show/106931.I_Heard_the_Owl_Call_My_Name", "num_ratings": "5,138", "num_reviews": "603", "avg_ratings": 3.94, "genres": ["Fiction", "Historical", "Historical Fiction", "Young Adult", "Classics", "Cultural", "Canada"], "title": "I Heard the Owl Call My Name", "description": ["In a world that knows too well the anguish inherent in the clash of old ways and new lifestyles, Margaret Craven's classic and timeless story of a young man's journey into the Pacific Northwest is as relevant today as ever.", "Here amid the grandeur of British Columbia stands the village of Kingcome, a place of salmon runs and ancient totems - a village so steeped in time that", "In a world that knows too well the anguish inherent in the clash of old ways and new lifestyles, Margaret Craven's classic and timeless story of a young man's journey into the Pacific Northwest is as relevant today as ever.", "Here amid the grandeur of British Columbia stands the village of Kingcome, a place of salmon runs and ancient totems - a village so steeped in time that, according to Kwakiutl legend, it was founded by two brothers left on earth after the great flood. Yet in this Eden of such natural beauty and richness, the old culture of totems and potlaches is under attack - slowly being replaced by a new culture of prefab houses and alcoholism. Into this world, where an entire generation of young people has become disenchanted and alienated from their heritage, Craven introduces Mark Brian, a young vicar sent to the small isolated parish by his church.", "This is Mark's journey of discovery - a journey that will teach him about life, death, and the transforming power of love. It is a journey that will resonate in the mind of readers long after the book is done."], "author": "Margaret Craven", "num_pages": "146", "awards": ["Great Lakes Colleges Association New Writers Award for Fiction (1974)", "California Young Readers Medal Nominee for Young Adult (1979)"], "places": ["British Columbia"], "character_names": [], "language": "English", "publish_date": "2005-01-10 00:00:00", "ISBN": "1550413392"},
{"url": "https://www.goodreads.com/book/show/11206.In_the_Time_of_the_Butterflies", "num_ratings": "47,144", "num_reviews": "3,437", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Fiction"], "title": "In the Time of the Butterflies", "description": ["Set during the waning days of the Trujillo dictatorship in the Dominican Republic in 1960, this extraordinary novel tells the story of the Mirabal sisters, three young wives and mothers who are assassinated after visiting their jailed husbands. ", "From the author of ", " comes this tale of courage and sisterhood set in the Dominican Republic", "Set during the waning days of the Trujillo dictatorship in the Dominican Republic in 1960, this extraordinary novel tells the story of the Mirabal sisters, three young wives and mothers who are assassinated after visiting their jailed husbands. ", "From the author of ", " comes this tale of courage and sisterhood set in the Dominican Republic during the rise of the Trujillo dictatorship. A skillful blend of fact and fiction, ", " is inspired by the true story of the three Mirabal sisters who, in 1960, were murdered for their part in an underground plot to overthrow the government. Alvarez breathes life into these historical figures--known as \"las mariposas,\" or \"the butterflies,\" in the underground--as she imagines their teenage years, their gradual involvement with the revolution, and their terror as their dissentience is uncovered. ", " Alvarez's controlled writing perfectly captures the mounting tension as \"the butterflies\" near their horrific end. The novel begins with the recollections of Dede, the fourth and surviving sister, who fears abandoning her routines and her husband to join the movement. Alvarez also offers the perspectives of the other sisters: brave and outspoken Minerva, the family's political ringleader; pious Patria, who forsakes her faith to join her sisters after witnessing the atrocities of the tyranny; and the baby sister, sensitive Maria Teresa, who, in a series of diaries, chronicles her allegiance to Minerva and the physical and spiritual anguish of prison life. ", " is an American Library Association Notable Book and a 1995 National Book Critics Circle Award nominee."], "author": "Julia Alvarez", "num_pages": "324", "awards": ["National Book Critics Circle Award Nominee for Fiction (1994)"], "places": ["Dominican Republic"], "character_names": ["Patria Mirabal de Gonzalez", "Minerva Mirabal de Tavarez", "Maria Teresa Mirabal de Guzman", "Bélgica Adela Mirabal de Reyes"], "language": "English", "publish_date": "1995-08-16 00:00:00", "ISBN": "0452274427"},
{"url": "https://www.goodreads.com/book/show/11291491-the-far-pavilions", "num_ratings": "36,674", "num_reviews": "1,145", "avg_ratings": 4.2, "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "India", "Romance", "Historical", "Classics", "Adventure"], "title": "The Far Pavilions", "description": ["A magnificent romantic/historical/adventure novel set in India at the time of mutiny. The Far Pavilions is a story of 19th Century India, when the thin patina of English rule held down dangerously turbulent undercurrents. It is a story about and English man - Ashton Pelham-Martyn - brought up as a Hindu and his passionate, but dangerous love for an Indian princess. It's a", "A magnificent romantic/historical/adventure novel set in India at the time of mutiny. The Far Pavilions is a story of 19th Century India, when the thin patina of English rule held down dangerously turbulent undercurrents. It is a story about and English man - Ashton Pelham-Martyn - brought up as a Hindu and his passionate, but dangerous love for an Indian princess. It's a story of divided loyalties, of tender camaraderie, of greedy imperialism and of the clash between east and west. To the burning plains and snow-capped mountains of this great, humming continent, M.M. Kaye brings her quite exceptional gift of immediacy and meticulous historical accuracy, plus her insight into the human heart."], "author": "M.M. Kaye", "num_pages": "964", "awards": [], "places": ["India"], "character_names": [], "language": "English", "publish_date": "1997-10-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12557.The_Kitchen_God_s_Wife", "num_ratings": "65,924", "num_reviews": "1,908", "avg_ratings": 3.99, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Cultural", "Asia", "Contemporary"], "title": "The Kitchen God's Wife", "description": ["Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside", "Winnie and Helen have kept each other's worst secrets for more than fifty years. Now, because she believes she is dying, Helen wants to expose everything. And Winnie angrily determines that she must be the one to tell her daughter, Pearl, about the past—including the terrible truth even Helen does not know. And so begins Winnie's story of her life on a small island outside Shanghai in the 1920s, and other places in China during World War II, and traces the happy and desperate events that led to Winnie's coming to America in 1949."], "author": "Amy Tan", "num_pages": "416", "awards": [], "places": ["United States of America"], "character_names": ["Winnie", "Auntie Helen", "Pearl Bright", "Mary", "Frank Russell", "Roger \"Bao Bao\"", "Doug Cheu", "Phil Brandt", "Tessa Russo", "Cleo", "Mimi Wong", "Loy Fong", "Edna Fong", "New Aunt", "Old Aunt", "Wen Fu", "Huazheng \"Peanut\"", "Uncle Henry"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038109"},
{"url": "https://www.goodreads.com/book/show/4834.The_Satanic_Verses", "num_ratings": "46,453", "num_reviews": "3,278", "avg_ratings": 3.71, "genres": ["Fiction", "Magical Realism", "Classics", "Literature", "Cultural", "India", "Fantasy"], "title": "The Satanic Verses", "description": ["Just before dawn one winter's morning a hijacked jumbo-jet blows apart high above the English Channel. Through the debris of limbs, drinks trolleys, memories, blankets and oxygen masks, two figures fall towards the sea without benefit of parachutes: Gibreel Farishta, India's legendary movie star, and Saladin Chamcha, the man", "Just before dawn one winter's morning a hijacked jumbo-jet blows apart high above the English Channel. Through the debris of limbs, drinks trolleys, memories, blankets and oxygen masks, two figures fall towards the sea without benefit of parachutes: Gibreel Farishta, India's legendary movie star, and Saladin Chamcha, the man of a thousand voices, self-made self and Anglophile supreme. Clinging to each other, singing rival songs, they plunge downward, and are finally washed up, alive, on the snow-covered sands of an English beach. A miracle; but an ambiguous one, because it soon becomes apparent that curious changes are coming over them. Gibreel seems to have acquired a halo, while, to Saladin's dismay, his legs grow hairier, his feet turn into hoofs, and there are bumps burgeoning at his temples.", "So begins ", ", Salman Rushdie's first novel for five years.", "Gibreel and Saladin have been chosen (by whom?) as protagonists in the eternal wrestling match between Good and Evil. But which is which? Can demons be angelic? Can angels be devils in disguise? As the two men tumble through their tale, through time as well as space, towards their final confrontation, we are witnesses to a cycle of extraordinary stories, tales of love and passion, of betrayal and faith: the story of Ayesha, the butterfly-shrouded visionary who leads an Indian village on an impossible pilgrimage; of Allie, the mountain-climber haunted by a ghost who urges her to attempt the ultimate feat — a solo ascent of Everest; of murders, metamorphoses and riots in a London \"visible but unseen\"; and, centrally, the story of Mahound, the Prophet of Jahilia, the city of sand — Mahound, the recipient of a revelation in which satanic verses mingle with divine.", "In this great wheel of a book, where the past and the future chase each other furiously, Salman Rushdie takes us on an epic journey, a journey of tears and laughter, of wonderful stories and astonishing flights of the imagination, a journey towards the evil and the good that lie inseparably entwined within the hearts of women and of men.", "--front flap"], "author": "Salman Rushdie", "num_pages": "549", "awards": ["Man Booker Prize Nominee (1988)", "Whitbread Award for Novel (1988)"], "places": ["London, England", "Bombay"], "character_names": ["Gibreel Farishta", "Saladin Chamcha"], "language": "English", "publish_date": "1989-08-16 00:00:00", "ISBN": "0670825379"},
{"url": "https://www.goodreads.com/book/show/3711.White_Teeth", "num_ratings": "100,338", "num_reviews": "6,009", "avg_ratings": 3.76, "genres": ["Fiction", "Contemporary", "Novels", "European Literature", "British Literature"], "title": "White Teeth", "description": ["One of the most talked about fictional debuts ever, White Teeth is a funny, generous, big-hearted novel, adored by critics and readers alike. Dealing - among many other things - with friendship, love, war, three cultures and three families over three generations, one brown mouse, and the tricky way the past has of coming back and biting you on the ankle, it is a life-affir", "One of the most talked about fictional debuts ever, White Teeth is a funny, generous, big-hearted novel, adored by critics and readers alike. Dealing - among many other things - with friendship, love, war, three cultures and three families over three generations, one brown mouse, and the tricky way the past has of coming back and biting you on the ankle, it is a life-affirming, riotous must-read of a book."], "author": "Zadie Smith", "num_pages": "448", "awards": ["Orange Prize Nominee for Fiction Shortlist (2000)", "Guardian First Book Award (2000)", "James Tait Black Memorial Prize for Fiction (2000)", "Whitbread Award for First Novel (2000)", "John Llewellyn Rhys Prize Nominee (2000)", "Puddly Award for Debut Novel (2001)", "National Book Critics Circle Award Nominee for Fiction (2000)", "Commonwealth Writers' Prize for Best First Book Overall (2001)", "Sunday Times/Peters Fraser + Dunlop Young Writer of the Year Award (2001)", "Betty Trask Award (2001)"], "places": [], "character_names": ["Alfred Archibald Jones", "Samad Miah Iqbal", "Clara Jones", "Alsana Begum", "Irie Ambrosia Jones", "Millat Zulfikar Iqbal"], "language": "English", "publish_date": "2001-06-12 00:00:00", "ISBN": "0375703861"},
{"url": "https://www.goodreads.com/book/show/50365.A_Suitable_Boy", "num_ratings": "37,675", "num_reviews": "1,883", "avg_ratings": 4.11, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Asian Literature", "Indian Literature"], "title": "A Suitable Boy", "description": ["Vikram Seth's novel is, at its core, a love story: Lata and her mother, Mrs. Rupa Mehra, are both trying to find—through love or through exacting maternal appraisal—a suitable boy for Lata to marry. Set in the early 1950s, in an India newly independent and struggling through a time of crisis, ", " takes us into the richly imagined world of four large extended fam", "Vikram Seth's novel is, at its core, a love story: Lata and her mother, Mrs. Rupa Mehra, are both trying to find—through love or through exacting maternal appraisal—a suitable boy for Lata to marry. Set in the early 1950s, in an India newly independent and struggling through a time of crisis, ", " takes us into the richly imagined world of four large extended families and spins a compulsively readable tale of their lives and loves. A sweeping panoramic portrait of a complex, multiethnic society in flux, ", " remains the story of ordinary people caught up in a web of love and ambition, humor and sadness, prejudice and reconciliation, the most delicate social etiquette and the most appalling violence."], "author": "Vikram Seth", "num_pages": "1474", "awards": ["WH Smith Literary Award (1994)", "Commonwealth Writers' Prize for Best Book Overall (1994)"], "places": ["Delhi", "Kanpur", "Calcutta", "Brahmapur"], "character_names": ["Lata Mehra", "Rupa Mehra", "Savita Mehra", "Arun Mehra", "Varun Mehra", "Pran Kapoor", "Maan Kapoor", "Amit Chatterji", "Meenakshi Mehra (née Chatterji)"], "language": "English", "publish_date": "2005-10-04 00:00:00", "ISBN": "0060786523"},
{"url": "https://www.goodreads.com/book/show/9328.The_House_of_the_Spirits", "num_ratings": "153,042", "num_reviews": "6,035", "avg_ratings": 4.21, "genres": ["Fiction", "Magical Realism", "Historical", "Historical Fiction", "Classics", "Fantasy"], "title": "The House of the Spirits", "description": ["In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. ", "Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherwor", "In one of the most important and beloved Latin American works of the twentieth century, Isabel Allende weaves a luminous tapestry of three generations of the Trueba family, revealing both triumphs and tragedies. ", "Here is patriarch Esteban, whose wild desires and political machinations are tempered only by his love for his ethereal wife, Clara, a woman touched by an otherworldly hand. Their daughter, Blanca, whose forbidden love for a man Esteban has deemed unworthy infuriates her father, yet will produce his greatest joy: his granddaughter Alba, a beautiful, ambitious girl who will lead the family and their country into a revolutionary future.", " is an enthralling saga that spans decades and lives, twining the personal and the political into an epic novel of love, magic, and fate."], "author": "Isabel Allende", "num_pages": "448", "awards": ["Deutscher Hörbuchpreis for Beste Fiktion (2011)", "Prix du Grand Roman d'évasion (1984)"], "places": ["Chile"], "character_names": ["Esteban Trueba", "Clara del Valle", "Férula Trueba", "Blanca Trueba", "Jaime Trueba", "Nicolàs Trueba", "Pedro Tercero Garcia", "Alba Trueba", "Esteban Garcia"], "language": "English", "publish_date": "2005-08-30 00:00:00", "ISBN": "0553383809"},
{"url": "https://www.goodreads.com/book/show/14836.Midnight_s_Children", "num_ratings": "91,008", "num_reviews": "5,382", "avg_ratings": 3.99, "genres": ["Fiction", "Cultural", "India", "Magical Realism", "Classics", "Historical", "Historical Fiction", "Fantasy", "Literature"], "title": "Midnight's Children", "description": ["Saleem Sinai was born at midnight, the midnight of India's independence, and found himself mysteriously \"handcuffed to history\" by the coincidence. He is one of 1,001 children born at the midnight hour, each of them endowed with an extraordinary talent - and whose privilege and curse it is to be both master and victims of their times. Through Saleem's gifts - inner ear and", "Saleem Sinai was born at midnight, the midnight of India's independence, and found himself mysteriously \"handcuffed to history\" by the coincidence. He is one of 1,001 children born at the midnight hour, each of them endowed with an extraordinary talent - and whose privilege and curse it is to be both master and victims of their times. Through Saleem's gifts - inner ear and wildly sensitive sense of smell - we are drawn into a fascinating family saga set against the vast, colourful background of the India of the 20th century."], "author": "Salman Rushdie", "num_pages": "647", "awards": ["Man Booker Prize (1981)", "James Tait Black Memorial Prize for Fiction (1981)", "The Booker of Bookers Prize (1993)", "The Best of the Booker (2008)", "Премія імені Максима Рильського (2010)"], "places": ["India", "Pakistan"], "character_names": ["Saleem Sinai"], "language": "English", "publish_date": "1995-05-01 00:00:00", "ISBN": "0099578514"},
{"url": "https://www.goodreads.com/book/show/3591262-cutting-for-stone", "num_ratings": "304,871", "num_reviews": "23,928", "avg_ratings": 4.28, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Book Club", "Eastern Africa", "Ethiopia", "Health", "Medicine"], "title": "Cutting for Stone", "description": ["An unforgettable journey into one man's remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others set in 1960s & 1970s Ethiopia and 1980s America.", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon at a mission hospital in Addis Ababa. Orphaned by", "An unforgettable journey into one man's remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others set in 1960s & 1970s Ethiopia and 1980s America.", "Marion and Shiva Stone are twin brothers born of a secret union between a beautiful Indian nun and a brash British surgeon at a mission hospital in Addis Ababa. Orphaned by their mother’s death in childbirth and their father’s disappearance, bound together by a preternatural connection and a shared fascination with medicine, the twins come of age as Ethiopia hovers on the brink of revolution. Yet it will be love, not politics—their passion for the same woman—that will tear them apart and force Marion, fresh out of medical school, to flee his homeland. He makes his way to America, finding refuge in his work as an intern at an underfunded, overcrowded New York City hospital. When the past catches up to him—nearly destroying him—Marion must entrust his life to the two men he thought he trusted least in the world: the surgeon father who abandoned him and the brother who betrayed him. ", "An unforgettable journey into one man’s remarkable life, and an epic story about the power, intimacy, and curious beauty of the work of healing others."], "author": "Abraham Verghese", "num_pages": "541", "awards": ["PEN/Hemingway Foundation Award Nominee (2010)", "Exclusive Books Boeke Prize Nominee (2011)", "Indies Choice Book Award for Adult Fiction (2010)", "Dayton Literary Peace Prize Nominee for Fiction (2010)", "Wellcome Book Prize Nominee for Shortlist (2009)", "Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Addis Ababa"], "character_names": ["Thomas Stone", "Sister Mary Joseph Praise", "Marion Stone", "Shiva Stone"], "language": "English", "publish_date": "2009-02-03 00:00:00", "ISBN": "0375414495"},
{"url": "https://www.goodreads.com/book/show/235773.Waiting", "num_ratings": "17,209", "num_reviews": "1,591", "avg_ratings": 3.5, "genres": ["Fiction", "Cultural", "China", "Historical", "Historical Fiction", "Cultural", "Asia"], "title": "Waiting", "description": ["In ", " PEN/Hemingway Award-winning author Ha Jin draws on his intimate knowledge of contemporary China to create a novel of unexpected richness and feeling. This is the story of Lin Kong, a man living in two worlds, struggling with the conflicting claims of two utterly different women as he moves through the political minefields of a society designed to regulate his e", "In ", " PEN/Hemingway Award-winning author Ha Jin draws on his intimate knowledge of contemporary China to create a novel of unexpected richness and feeling. This is the story of Lin Kong, a man living in two worlds, struggling with the conflicting claims of two utterly different women as he moves through the political minefields of a society designed to regulate his every move and stifle the promptings of his innermost heart.", "For more than seventeen years, this devoted and ambitious doctor has been in love with an educated, clever, modern woman, Manna Wu. But back in the traditional world of his home village lives the wife his family chose for him when he was young--a humble and touchingly loyal woman, whom he visits in order to ask, again and again, for a divorce. In a culture in which the ancient ties of tradition and family still hold sway and where adultery discovered by the Party can ruin lives forever, Lin's passionate love is stretched ever more taut by the passing years. Every summer, his compliant wife agrees to a divorce but then backs out. This time, Lin promises, will be different.", "Tracing these lives through their summer of decision and beyond, Ha Jin vividly conjures the texture of daily life in a place where the demands of human longing must contend with the weight of centuries of custom. Waiting charms and startles us with its depiction of a China that remains hidden to Western eyes even as it moves us with its piercing vision of the universal", "complications of love."], "author": "Ha Jin", "num_pages": "310", "awards": ["Pulitzer Prize Nominee for Fiction (2000)", "National Book Award for Fiction (1999)", "PEN/Faulkner Award for Fiction (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-19 00:00:00", "ISBN": "0375706410"},
{"url": "https://www.goodreads.com/book/show/126381.Purple_Hibiscus", "num_ratings": "44,222", "num_reviews": "4,231", "avg_ratings": 4.14, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Western Africa", "Nigeria"], "title": "Purple Hibiscus", "description": ["Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her bro", "Fifteen-year-old Kambili’s world is circumscribed by the high walls and frangipani trees of her family compound. Her wealthy Catholic father, under whose shadow Kambili lives, while generous and politically active in the community, is repressive and fanatically religious at home.", "When Nigeria begins to fall apart under a military coup, Kambili’s father sends her and her brother away to stay with their aunt, a University professor, whose house is noisy and full of laughter. There, Kambili and her brother discover a life and love beyond the confines of their father’s authority. The visit will lift the silence from their world and, in time, give rise to devotion and defiance that reveal themselves in profound and unexpected ways. ", "This is a book about the promise of freedom; about the blurred lines between childhood and adulthood; between love and hatred, between the old gods and the new."], "author": "Chimamanda Ngozi Adichie", "num_pages": "307", "awards": ["Man Booker Prize Nominee for Longlist (2004)", "Orange Prize Nominee for Fiction Shortlist (2004)", "John Llewellyn Rhys Prize Nominee (2004)", "Hurston/Wright Legacy Award for Debut Fiction (2004)", "Commonwealth Writers' Prize for Best First Book Overall (2005)"], "places": ["Nigeria"], "character_names": ["Kambili", "Jaja", "Eugene", "Beatrice..."], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0007189885"},
{"url": "https://www.goodreads.com/book/show/824694.One_Hundred_Years_of_Solitude", "num_ratings": "623,513", "num_reviews": "23,999", "avg_ratings": 4.05, "genres": ["Fiction", "Classics", "Magical Realism", "Literature", "Novels", "Fantasy", "Historical", "Historical Fiction", "European Literature", "Spanish Literature", "Abandoned", "Cultural", "Latin American"], "title": "One Hundred Years of Solitude", "description": ["A classic of world literature for all time--and probably Marquez's most famous work. The first piece of literature since the Book of Genesis that should be required reading for the entire human race . . . with more lucidity, wit, wisdom, and poetry than is expected from 100 years of novelists, let alone one man.--Washington Post Book World."], "author": "Gabriel García Márquez", "num_pages": "422", "awards": ["Premio Internacional de Novela Rómulo Gallegos (1972)", "Prix du Meilleur Livre Étranger for Roman (1969)"], "places": ["Macondo"], "character_names": ["Úrsula Iguarán", "Remedios Moscote", "Remedios, la bella", "Fernanda del Carpio", "Aureliano Buendía", "José Arcadio Buendía", "Amaranta Buendía", "Amaranta Úrsula Buendía", "Aureliano Babilonia", "José Arcadio Segundo", "Aureliano Segundo", "Aureliano José", "Pilar Ternera", "Rebeca Buendía", "Santa Sofía de la Piedad", "Arcadio Buendía", "José Arcadio Buendía, hijo", "Meme Buendía", "Petra Cotes", "Pietro Crespi", "Melquiades"], "language": "English", "publish_date": "1970-08-16 00:00:00", "ISBN": "0060114185"},
{"url": "https://www.goodreads.com/book/show/9777.The_God_of_Small_Things", "num_ratings": "201,449", "num_reviews": "10,762", "avg_ratings": 3.92, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Contemporary"], "title": "The God of Small Things", "description": ["The year is 1969. In the state of Kerala, on the southernmost tip of India, fraternal twins Esthappen and Rahel fashion a childhood for themselves in the shade of the wreck that is their family. Their lonely, lovely mother, Ammu, (who loves b", "The year is 1969. In the state of Kerala, on the southernmost tip of India, fraternal twins Esthappen and Rahel fashion a childhood for themselves in the shade of the wreck that is their family. Their lonely, lovely mother, Ammu, (who loves by night the man her children love by day), fled an abusive marriage to live with their blind grandmother, Mammachi (who plays Handel on her violin), their beloved uncle Chacko (Rhodes scholar, pickle baron, radical Marxist, bottom-pincher), and their enemy, Baby Kochamma (ex-nun and incumbent grandaunt). When Chacko's English ex-wife brings their daughter for a Christmas visit, the twins learn that things can change in a day, that lives can twist into new, ugly shapes, even cease forever, beside their river..."], "author": "Arundhati Roy", "num_pages": "340", "awards": ["Man Booker Prize (1997)"], "places": ["Kerala", "Aymanam"], "character_names": ["Rahel", "Ammu", "Mammachi", "Chacko", "Estha", "Velutha", "Baby Kochamma"], "language": "English", "publish_date": "1997-08-16 00:00:00", "ISBN": "0679457313"},
{"url": "https://www.goodreads.com/book/show/1522567.Kim", "num_ratings": "29,264", "num_reviews": "1,501", "avg_ratings": 3.72, "genres": ["Classics", "Fiction", "Cultural", "India", "Historical", "Historical Fiction", "Adventure"], "title": "Kim", "description": ["One of the great adventure books of all time, ", " first published in 1901, is Kipling's last major work about India, a farewell look brimming with all the color and sound, squalor and splendor of that exotic land. Kim, the orphaned son of an Irish soldier, is a mischievous worldly imp growing up in the walled city of Lahore. A secret mission for the British and a heartfe", "One of the great adventure books of all time, ", " first published in 1901, is Kipling's last major work about India, a farewell look brimming with all the color and sound, squalor and splendor of that exotic land. Kim, the orphaned son of an Irish soldier, is a mischievous worldly imp growing up in the walled city of Lahore. A secret mission for the British and a heartfelt bond with a Tibetan lama in search of a sacred river soon lead Kim into a life of spies and secrets, danger and high excitement. But", "is more than a boy's adventure. Written by the laureate of the British Empire, it is also a profound look at the differences between East and West. For the first time, a British writer understood India in all its complexity, mystery, and spirituality. Here we enter the harems; mingle with thieves, jugglers, and beggars; and experience all that is India in one of literature's most magical and moving masterpieces."], "author": "Rudyard Kipling", "num_pages": "265", "awards": [], "places": ["India"], "character_names": ["Kimball O'Hara (Kim)", "Teshoo Lama"], "language": "English", "publish_date": "1983-04-01 00:00:00", "ISBN": "0553213326"},
{"url": "https://www.goodreads.com/book/show/1078.The_Good_Earth", "num_ratings": "203,900", "num_reviews": "8,855", "avg_ratings": 3.97, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Cultural", "China", "Literature", "Historical", "Cultural", "Asia", "Novels", "Academic", "School", "Classics", "Classic Literature"], "title": "The Good Earth", "description": ["This tells the poignant tale of a Chinese farmer and his family in old agrarian China. The humble Wang Lung glories in the soil he works, nurturing the land as it nurtures him and his family. Nearby, the nobles of the House of Hwang consider themselves above the land and its workers; but they will soon meet their own downfall.", "Hard times come upon Wang Lung and his family w", "This tells the poignant tale of a Chinese farmer and his family in old agrarian China. The humble Wang Lung glories in the soil he works, nurturing the land as it nurtures him and his family. Nearby, the nobles of the House of Hwang consider themselves above the land and its workers; but they will soon meet their own downfall.", "Hard times come upon Wang Lung and his family when flood and drought force them to seek work in the city. The working people riot, breaking into the homes of the rich and forcing them to flee. When Wang Lung shows mercy to one noble and is rewarded, he begins to rise in the world, even as the House of Hwang falls."], "author": "Pearl S. Buck", "num_pages": "418", "awards": ["Pulitzer Prize for Novel (1932)", "William Dean Howells Medal (1935)"], "places": ["China"], "character_names": ["Wang Lung", "O-lan"], "language": "English", "publish_date": "2009-03-04 00:00:00", "ISBN": "1416500189"},
{"url": "https://www.goodreads.com/book/show/243714.Interpreter_of_Maladies", "num_ratings": "138,491", "num_reviews": "9,035", "avg_ratings": 4.13, "genres": ["Short Stories", "Fiction", "Cultural", "India"], "title": "Interpreter of Maladies", "description": ["Winner of the 2000 Pulitzer Prize for fiction, this stunning debut collection unerringly charts the emotional journeys of characters seeking love beyond the barriers of nations and generations. \"A writer of uncommon sensitivity and restraint...Ms. Lahiri expertly captures the out-of-context lives of immigrants, expatriates, and first-generation Americans\" (", "Winner of the 2000 Pulitzer Prize for fiction, this stunning debut collection unerringly charts the emotional journeys of characters seeking love beyond the barriers of nations and generations. \"A writer of uncommon sensitivity and restraint...Ms. Lahiri expertly captures the out-of-context lives of immigrants, expatriates, and first-generation Americans\" (", "). In stories that travel from India to America and back again, Lahiri speaks with universal eloquence to everyone who has ever felt like a foreigner. Honored as \"Debut of the Year\" by ", " and winner of the PEN/Hemingway Award, ", " introduces a young writer of astonishing maturity and insight who \"breathes unpredictable life into the page\" (", ").", "~from back cover"], "author": "Jhumpa Lahiri", "num_pages": "198", "awards": ["Pulitzer Prize for Fiction (2000)", "PEN/Hemingway Foundation Award (2000)", "Puddly Award for Short Stories (2001)"], "places": ["Boston, Massachusetts", "Kolkata", "Odisha", "Connecticut"], "character_names": ["Dev", "Elliot", "Miranda", "Shobha", "Lilia", "Shukumar", "Mr. Pirzada", "Mr. Das", "Mrs. Das", "Mr. Kapasi", "Boori Maa", "Mrs. Dalal", "Laxmi", "Mrs. Sen", "Sanjeev", "Twinkle"], "language": "English", "publish_date": "1999-06-01 00:00:00", "ISBN": "039592720X"},
{"url": "https://www.goodreads.com/book/show/1690327.The_English_Patient", "num_ratings": "98,396", "num_reviews": "3,732", "avg_ratings": 3.88, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Romance", "Historical"], "title": "The English Patient", "description": ["With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs ro", "With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs room and whose memories of passion, betrayal,and rescue illuminates this book like flashes of heat lightening."], "author": "Michael Ondaatje", "num_pages": "302", "awards": ["Man Booker Prize (1992)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (1992)", "Commonwealth Writers' Prize for Best Book in Caribbean and Canada (1993)", "Trillium Book Award (1993)", "Golden Man Booker Prize (2018)"], "places": ["Italy", "North Africa", "Sahara Desert", "Tuscany", "Fiesole, Tuscany", "Cairo", "Florence"], "character_names": ["Kip", "Hana", "Geoffrey Clifton", "Katharine Clifton", "David Caravaggio", "Ladislaus de Almásy"], "language": "English", "publish_date": "1992-08-16 00:00:00", "ISBN": "0679416781"},
{"url": "https://www.goodreads.com/book/show/22556641-the-color-purple", "num_ratings": "435,738", "num_reviews": "11,087", "avg_ratings": 4.18, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Feminism"], "title": "The Color Purple", "description": [" is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken", " is a classic. With over a million copies sold in the UK alone, it is hailed as one of the all-time 'greats' of literature, inspiring generations of readers.", "Set in the deep American South between the wars, it is the tale of Celie, a young black girl born into poverty and segregation. Raped repeatedly by the man she calls 'father', she has two children taken away from her, is separated from her beloved sister Nettie and is trapped into an ugly marriage. But then she meets the glamorous Shug Avery, singer and magic-maker - a woman who has taken charge of her own destiny. Gradually, Celie discovers the power and joy of her own spirit, freeing her from her past and reuniting her with those she loves."], "author": "Alice Walker", "num_pages": "308", "awards": ["Pulitzer Prize for Fiction (1983)", "National Book Award for Fiction (Hardcover) (1983)", "National Book Critics Circle Award Nominee for Fiction (1982)", "Townsend Prize for Fiction (1984)"], "places": ["Georgia"], "character_names": ["Nettie", "Albert", "Celie", "Shug Avery", "Miss Millie"], "language": "English", "publish_date": "2014-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18749.Half_of_a_Yellow_Sun", "num_ratings": "69,512", "num_reviews": "6,171", "avg_ratings": 4.3, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Africa", "Western Africa", "Nigeria", "War", "Historical"], "title": "Half of a Yellow Sun", "description": ["Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21", "Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed.", "A masterly, haunting new novel from a writer heralded by The Washington Post Book World as “the 21st-century daughter of Chinua Achebe,” Half of a Yellow Sun re-creates a seminal moment in modern African history: Biafra’s impassioned struggle to establish an independent republic in Nigeria in the 1960s, and the chilling violence that followed. ", "With astonishing empathy and the effortless grace of a natural storyteller, Chimamanda Ngozi Adichie weaves together the lives of three characters swept up in the turbulence of the decade. Thirteen-year-old Ugwu is employed as a houseboy for a university professor full of revolutionary zeal. Olanna is the professor’s beautiful mistress, who has abandoned her life of privilege in Lagos for a dusty university town and the charisma of her new lover. And Richard is a shy young Englishman in thrall to Olanna’s twin sister, an enigmatic figure who refuses to belong to anyone. As Nigerian troops advance and the three must run for their lives, their ideals are severely tested, as are their loyalties to one another. ", "Epic, ambitious, and triumphantly realized, Half of a Yellow Sun is a remarkable novel about moral responsibility, about the end of colonialism, about ethnic allegiances, about class and race—and the ways in which love can complicate them all. Adichie brilliantly evokes the promise and the devastating disappointments that marked this time and place, bringing us one of the most powerful, dramatic, and intensely emotional pictures of modern Africa that we have ever had."], "author": "Chimamanda Ngozi Adichie", "num_pages": "433", "awards": ["Orange Prize for Fiction (2007)", "James Tait Black Memorial Prize Nominee for Fiction (2006)", "Anisfield-Wolf Book Award for Fiction (2007)", "PEN Open Book Award (2007)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Hurston/Wright Legacy Award Nominee for Fiction (2007)"], "places": ["Nigeria", "Biafra"], "character_names": ["Ugwu", "Olanna", "Odenigbo", "Kainene"], "language": "English", "publish_date": "2006-09-12 00:00:00", "ISBN": "1400044162"},
{"url": "https://www.goodreads.com/book/show/1768603.The_White_Tiger", "num_ratings": "135,359", "num_reviews": "8,852", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "India", "Contemporary", "Asian Literature", "Indian Literature"], "title": "The White Tiger", "description": ["Introducing a major literary talent, The White Tiger offers a story of coruscating wit, blistering suspense, and questionable morality, told by the most volatile, captivating, and utterly inimitable narrator that this millennium has yet seen. ", "Balram Halwai is a complicated man. Servant. Philosopher. Entrepreneur. Murderer. Over the course of seven nights, by the scattered", "Introducing a major literary talent, The White Tiger offers a story of coruscating wit, blistering suspense, and questionable morality, told by the most volatile, captivating, and utterly inimitable narrator that this millennium has yet seen. ", "Balram Halwai is a complicated man. Servant. Philosopher. Entrepreneur. Murderer. Over the course of seven nights, by the scattered light of a preposterous chandelier, Balram tells us the terrible and transfixing story of how he came to be a success in life—having nothing but his own wits to help him along. ", "Born in the dark heart of India, Balram gets a break when he is hired as a driver for his village's wealthiest man, two house Pomeranians (Puddles and Cuddles), and the rich man's (very unlucky) son. From behind the wheel of their Honda City car, Balram's new world is a revelation. While his peers flip through the pages of Murder Weekly (\"Love -- Rape -- Revenge!\"), barter for girls, drink liquor (Thunderbolt), and perpetuate the Great Rooster Coop of Indian society, Balram watches his employers bribe foreign ministers for tax breaks, barter for girls, drink liquor (single-malt whiskey), and play their own role in the Rooster Coop. Balram learns how to siphon gas, deal with corrupt mechanics, and refill and resell Johnnie Walker Black Label bottles (all but one). He also finds a way out of the Coop that no one else inside it can perceive. ", "Balram's eyes penetrate India as few outsiders can: the cockroaches and the call centers; the prostitutes and the worshippers; the ancient and Internet cultures; the water buffalo and, trapped in so many kinds of cages that escape is (almost) impossible, the white tiger. And with a charisma as undeniable as it is unexpected, Balram teaches us that religion doesn't create virtue, and money doesn't solve every problem -- but decency can still be found in a corrupt world, and you can get what you want out of life if you eavesdrop on the right conversations. ", "The White Tiger recalls The Death of Vishnu and Bangkok 8 in ambition, scope, and narrative genius, with a mischief and personality all its own. Amoral, irreverent, deeply endearing, and utterly contemporary, this novel is an international publishing sensation —and a startling, provocative debut."], "author": "Aravind Adiga", "num_pages": "320", "awards": ["Man Booker Prize (2008)", "John Llewellyn Rhys Prize Nominee (2008)", "PEN/Robert W. Bingham Prize Nominee (2009)", "Galaxy British Book Awards for Author of the Year (0)", "Shakti Bhatt First Book Prize Nominee (2008)"], "places": ["Laxmangarh", "Bihar", "New Delhi"], "character_names": ["Balram Halwai", "Ashok", "Kishan", "Kusum", "Stork"], "language": "English", "publish_date": "2008-08-16 00:00:00", "ISBN": "1416562591"},
{"url": "https://www.goodreads.com/book/show/5211.A_Fine_Balance", "num_ratings": "111,042", "num_reviews": "7,771", "avg_ratings": 4.35, "genres": ["Fiction", "Cultural", "India", "Historical", "Historical Fiction"], "title": "A Fine Balance", "description": ["With a compassionate realism and narrative sweep that recall the work of Charles Dickens, this magnificent novel captures all the cruelty and corruption, dignity and heroism, of India. ", "The time is 1975. The place is an unnamed city by the sea. The government has just declared a State of Emergency, in whose upheavals four strangers--a spirited widow, a young student uproote", "With a compassionate realism and narrative sweep that recall the work of Charles Dickens, this magnificent novel captures all the cruelty and corruption, dignity and heroism, of India. ", "The time is 1975. The place is an unnamed city by the sea. The government has just declared a State of Emergency, in whose upheavals four strangers--a spirited widow, a young student uprooted from his idyllic hill station, and two tailors who have fled the caste violence of their native village--will be thrust together, forced to share one cramped apartment and an uncertain future. ", "As the characters move from distrust to friendship and from friendship to love, ", " creates an enduring panorama of the human spirit in an inhuman state."], "author": "Rohinton Mistry", "num_pages": "603", "awards": ["Man Booker Prize Nominee (1996)", "Winifred Holtby Memorial Prize (1996)", "Scotiabank Giller Prize (1995)", "Los Angeles Times Book Prize for Fiction (1996)", "Commonwealth Writers' Prize for Best Book Overall (1996)", "CBC Canada Reads Nominee (2002)", "International DUBLIN Literary Award Nominee (1997)"], "places": ["India", "Bombay"], "character_names": ["Maneck Kohlah", "Omprakash Darji", "Ishvar Darji", "Dina Dalal", "Rustom Dalal", "Nusswan Shroff", "Vasantrao Valmik", "Thakur Dharamsi", "Ashraf Chacha", "Rajaram", "Shankar", "Beggar Master"], "language": "English", "publish_date": "2001-11-30 00:00:00", "ISBN": "140003065X"},
{"url": "https://www.goodreads.com/book/show/7763.The_Joy_Luck_Club", "num_ratings": "548,448", "num_reviews": "7,390", "avg_ratings": 3.91, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Cultural", "China", "Contemporary"], "title": "The Joy Luck Club", "description": ["In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her se", "In 1949, four Chinese women, recent immigrants to San Francisco, begin meeting to eat dim sum, play mahjong, and talk. United in shared loss and hope, they call themselves the Joy Luck Club. With wit and wisdom, Amy Tan examines the sometimes painful, often tender, and always deep connection between these four women and their American-born daughters. As each reveals her secrets, trying to unravel the truth about her life, the strings become more tangled, more entwined..."], "author": "Amy Tan", "num_pages": "288", "awards": ["California Book Award for Fiction (Gold) (1989)", "Los Angeles Times Book Prize Nominee for Fiction (1989)", "Northern California Book Awards for Fiction (1989)", "National Book Critics Circle Award Nominee for Fiction (1989)", "National Book Award Finalist for Fiction (1989)"], "places": ["San Francisco, California", "China"], "character_names": ["Suyuan Woo", "June Woo", "Lindo Jong", "Waverly Jong", "An-Mei Hsu", "Rose Hsu Jordan", "Ying-Ying St. Clair", "Lena St. Clair"], "language": "English", "publish_date": "2006-09-21 00:00:00", "ISBN": "0143038095"},
{"url": "https://www.goodreads.com/book/show/37781.Things_Fall_Apart", "num_ratings": "236,327", "num_reviews": "11,136", "avg_ratings": 3.63, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Academic", "School", "Literature"], "title": "Things Fall Apart", "description": ["THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict betw", "THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict between the individual and society. ", "The second story, which is as modern as the first is ancient, and which elevates the book to a tragic plane, concerns the clash of cultures and the destruction of Okonkwo's world through the arrival of aggressive, proselytizing European missionaries. These twin dramas are perfectly harmonized, and they are modulated by an awareness capable of encompassing at once the life of nature, human history, and the mysterious compulsions of the soul. THINGS FALL APART is the most illuminating and permanent monument we have to the modern African experience as seen from within."], "author": "Chinua Achebe", "num_pages": "209", "awards": [], "places": ["Africa"], "character_names": ["Okonkwo"], "language": "English", "publish_date": "1994-09-01 00:00:00", "ISBN": "0385474547"},
{"url": "https://www.goodreads.com/book/show/4214.Life_of_Pi", "num_ratings": "1,136,844", "num_reviews": "44,550", "avg_ratings": 3.89, "genres": ["Fiction", "Fantasy", "Adventure", "Classics"], "title": "Life of Pi", "description": ["Life of Pi is a fantasy adventure novel by Yann Martel published in 2001. The protagonist, Piscine Molitor \"Pi\" Patel, a Tamil boy from Pondicherry, explores issues of spirituality and practicality from an early age. He survives 227 days after a shipwreck while stranded on a boat in the Pacific Ocean with a Bengal tiger named Richard Parker."], "author": "Yann Martel", "num_pages": "460", "awards": ["Man Booker Prize (2002)", "Bollinger Everyman Wodehouse Prize Nominee for Comic Fiction (2003)", "Exclusive Books Boeke Prize (2003)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général Nominee for Fiction (2001)", "Lincoln Award Nominee (2005)", "Deutscher Bücherpreis for Belletristik (2004)", "CBC Canada Reads Nominee (2003)", "Luisterboek Award Nominee (2015)", "QWF (Quebec Writer's Federation) Awards for Paragraphe Hugh MacLennan Prize for Fiction (2001)", "Asian/Pacific American Award for Literature for Adult Fiction (2003)"], "places": ["Pacific Ocean", "Pondicherry", "Toronto, Ontario", "Tomatlan"], "character_names": ["Pi Patel", "Richard Parker"], "language": "English", "publish_date": "2006-08-29 00:00:00", "ISBN": "0770430074"},
{"url": "https://www.goodreads.com/book/show/128029.A_Thousand_Splendid_Suns", "num_ratings": "949,941", "num_reviews": "46,560", "avg_ratings": 4.35, "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "A Thousand Splendid Suns", "description": [" is a breathtaking story set against the volatile events of Afghanistan's last thirty years—from the Soviet invasion to the reign of the Taliban to post-Taliban rebuilding—that puts the violence, fear, hope, and faith of this country in intimate, human terms. It is a tale of two generations of characters brought jarringly together by the tragic swee", " is a breathtaking story set against the volatile events of Afghanistan's last thirty years—from the Soviet invasion to the reign of the Taliban to post-Taliban rebuilding—that puts the violence, fear, hope, and faith of this country in intimate, human terms. It is a tale of two generations of characters brought jarringly together by the tragic sweep of war, where personal lives—the struggle to survive, raise a family, find happiness—are inextricable from the history playing out around them.", "Propelled by the same storytelling instinct that made ", " a beloved classic, ", " is at once a remarkable chronicle of three decades of Afghan history and a deeply moving account of family and friendship. It is a striking, heart-wrenching novel of an unforgiving time, an unlikely friendship, and an indestructible love—a stunning accomplishment."], "author": "Khaled Hosseini", "num_pages": "372", "awards": ["British Book Award for Best Read of the Year (2008)", "Book Sense Book of the Year Award for Adult Fiction (2008)", "California Book Award for Fiction (Silver) (2007)", "Exclusive Books Boeke Prize Nominee (2007)", "Lincoln Award Nominee (2011)"], "places": ["Afghanistan", "Kabul", "Herat"], "character_names": ["Laila", "Mariam", "Rasheed", "Tariq"], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "1594489505"}
]