[
{"url": "https://www.goodreads.com/book/show/37781.Things_Fall_Apart", "num_ratings": "236,327", "num_reviews": "11,136", "avg_ratings": 3.63, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Historical", "Historical Fiction", "Academic", "School", "Literature"], "title": "Things Fall Apart", "description": ["THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict betw", "THINGS FALL APART tells two overlapping, intertwining stories, both of which center around Okonkwo, a “strong man” of an Ibo village in Nigeria. The first of these stories traces Okonkwo's fall from grace with the tribal world in which he lives, and in its classical purity of line and economical beauty it provides us with a powerful fable about the immemorial conflict between the individual and society. ", "The second story, which is as modern as the first is ancient, and which elevates the book to a tragic plane, concerns the clash of cultures and the destruction of Okonkwo's world through the arrival of aggressive, proselytizing European missionaries. These twin dramas are perfectly harmonized, and they are modulated by an awareness capable of encompassing at once the life of nature, human history, and the mysterious compulsions of the soul. THINGS FALL APART is the most illuminating and permanent monument we have to the modern African experience as seen from within."], "author": "Chinua Achebe", "num_pages": "209", "awards": [], "places": ["Africa"], "character_names": ["Okonkwo"], "language": "English", "publish_date": "1994-09-01 00:00:00", "ISBN": "0385474547"},
{"url": "https://www.goodreads.com/book/show/947853.Living_Loving_and_Lying_Awake_at_Night", "num_ratings": "71", "num_reviews": "12", "avg_ratings": 3.89, "genres": ["Short Stories", "Southern Africa", "South Africa", "Cultural", "Africa", "Fiction", "Academic", "School"], "title": "Living, Loving and Lying Awake at Night", "description": ["This series is designed to bring to North American readers the once-unheard voices of writers who have achieved wide acclaim at home, but are not recognized beyond the borders of their native lands. With special emphasis on women writers, Interlink's Emerging Voices series publishes the best of the world's contemporary literature in translation or original English."], "author": "Sindiwe Magona", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-02-01 00:00:00", "ISBN": "1566561477"},
{"url": "https://www.goodreads.com/book/show/939743.Les_Soleils_des_ind_pendances", "num_ratings": "363", "num_reviews": "17", "avg_ratings": 3.71, "genres": ["Cultural", "Africa", "Fiction", "Cultural", "France", "Literature", "African Literature", "Contemporary"], "title": "Les Soleils des indépendances", "description": ["Quel sera le sort de Fama, authentique prince malinké, aux temps de l'indépendance et du parti unique ? L'ancien et le nouveau s'affrontent en un duel tout à la fois tragique et dérisoire tandis que passe l'histoire, avec son cortège de joies et de souffrances. ", "Au-delà de la fable politique, Ahmadou Kourouma restitue comme nul autre toute la profondeur de la vie africaine,", "Quel sera le sort de Fama, authentique prince malinké, aux temps de l'indépendance et du parti unique ? L'ancien et le nouveau s'affrontent en un duel tout à la fois tragique et dérisoire tandis que passe l'histoire, avec son cortège de joies et de souffrances. ", "Au-delà de la fable politique, Ahmadou Kourouma restitue comme nul autre toute la profondeur de la vie africaine, mêlant le quotidien et le mythe dans une langue réinventée au plus près de la condition humaine. Dès sa parution en 1970, ce livre s'est imposé comme un des grands classiques de la littérature africaine."], "author": "Ahmadou Kourouma", "num_pages": "195", "awards": [], "places": [], "character_names": [], "language": "French", "publish_date": "1995-10-03 00:00:00", "ISBN": "2020259214"},
{"url": "https://www.goodreads.com/book/show/545293.Last_Harmattan_of_Alusine_Dunbar", "num_ratings": "18", "num_reviews": "0", "avg_ratings": 3.94, "genres": ["Cultural", "Africa", "Western Africa", "Sierra Leone", "Literature", "African Literature"], "title": "Last Harmattan of Alusine Dunbar: A Novel of Magical Vision", "description": ["In a chimerical world of illusion and truth, fired by a language that challenges the imagination, this book tells the story of a Sierra Leone-like country, from the time of the freed black American slaves who returned to Africa."], "author": "Syl Cheney-Coker", "num_pages": "398", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1991)"], "places": [], "character_names": [], "language": "English", "publish_date": "1991-01-01 00:00:00", "ISBN": "0435905724"},
{"url": "https://www.goodreads.com/book/show/11428451-zayni-barakat-i-misteri-del-cairo", "num_ratings": "3,146", "num_reviews": "315", "avg_ratings": 3.96, "genres": ["Novels"], "title": "Zayni Barakat. I misteri del Cairo", "description": ["Gli affascinanti scenari del Cairo, popolati di mercanti e profittatori, studenti provenienti da ogni angolo dell'Islam, fomatori di hashish, cantastorie, spie al servizio della terribile polizia segreta, donne di piacere e viaggiatori, fanno da sfondo a un romanzo sui meccanismi del potere e della corruzione. Nella lotta praticata con qualsiasi strumento lecito e illecito", "Gli affascinanti scenari del Cairo, popolati di mercanti e profittatori, studenti provenienti da ogni angolo dell'Islam, fomatori di hashish, cantastorie, spie al servizio della terribile polizia segreta, donne di piacere e viaggiatori, fanno da sfondo a un romanzo sui meccanismi del potere e della corruzione. Nella lotta praticata con qualsiasi strumento lecito e illecito tra lo Zayni Barakat e il capo della Polizia segreta Zakarìya, Ghitani rappresenta le aberrazioni e le sopraffazioni messe in atto da chi, per dominare ad ogni costo, piega al suo volere la religione, lo Stato, le passioni umane. Lo scrittore egiziano Gamal Ghitani è vincitore del Premio Grinzane Cavour 2006 nella Sezione Narrativa Straniera."], "author": "Gamal al-Ghitani", "num_pages": "352", "awards": [], "places": ["Egypt", "Cairo"], "character_names": [], "language": "Italian", "publish_date": "2006-08-16 00:00:00", "ISBN": "8809047826"},
{"url": "https://www.goodreads.com/book/show/256373.Le_Pass_Simple", "num_ratings": "176", "num_reviews": "13", "avg_ratings": 3.57, "genres": ["Fiction", "Northern Africa", "Morocco", "Cultural", "Africa", "Literature", "African Literature"], "title": "Le Passé Simple", "description": ["Lors de sa parution en 1954, ce livre fit l'effet d'une véritable bombe, tant en France qu'au Maroc qui luttait pour son indépendance. Avec une rare violence, il projetait le roman maghrébin d'expression française vers des thèmes majeurs : poids de l'Islam, condition féminine dans la société arabe, identité culturelle, conflit des civilisations. Vilipendé au début, comment", "Lors de sa parution en 1954, ce livre fit l'effet d'une véritable bombe, tant en France qu'au Maroc qui luttait pour son indépendance. Avec une rare violence, il projetait le roman maghrébin d'expression française vers des thèmes majeurs : poids de l'Islam, condition féminine dans la société arabe, identité culturelle, conflit des civilisations. Vilipendé au début, commenté par des générations de lecteurs, il est enseigné depuis quelques années dans les universités marocaines."], "author": "Driss Chraïbi", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1986-04-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1411409.Anowa", "num_ratings": "87", "num_reviews": "7", "avg_ratings": 3.72, "genres": ["Plays", "Literature", "African Literature", "Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Drama", "Academic", "Read For School"], "title": "Anowa", "author": "Ama Ata Aidoo", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2004-04-19 00:00:00", "ISBN": "0582818958"},
{"url": "https://www.goodreads.com/book/show/328504.Maps", "num_ratings": "670", "num_reviews": "68", "avg_ratings": 3.76, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Somalia", "Literature", "African Literature", "Historical", "Historical Fiction", "Literature"], "title": "Maps", "description": ["This first novel in Nuruddin Farah's Blood in the Sun trilogy tells the story of Askar, a man coming of age in the turmoil of modern Africa. With his father a victim of the bloody Ethiopian civil war and his mother dying the day of his birth, Askar is taken in and raised by a man named Misra amid the scandal, gossip, and ritual of a small African village. As an adolescent,", "This first novel in Nuruddin Farah's Blood in the Sun trilogy tells the story of Askar, a man coming of age in the turmoil of modern Africa. With his father a victim of the bloody Ethiopian civil war and his mother dying the day of his birth, Askar is taken in and raised by a man named Misra amid the scandal, gossip, and ritual of a small African village. As an adolescent, Askar goes to live in Somalia's capital, where he strives to find himself just as Somalia struggles for national identity."], "author": "Nuruddin Farah", "num_pages": "259", "awards": [], "places": ["Somalia"], "character_names": [], "language": "English", "publish_date": "2000-11-01 00:00:00", "ISBN": "0140296433"},
{"url": "https://www.goodreads.com/book/show/836746.A_Grain_of_Wheat", "num_ratings": "3,068", "num_reviews": "170", "avg_ratings": 3.83, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Kenya", "Historical", "Historical Fiction", "Literature", "African Literature"], "title": "A Grain of Wheat", "description": ["Set in the wake of the Mau Mau rebellion and on the cusp of Kenya's independence from Britain, A Grain of Wheat follows a group of villagers whose lives have been transformed by the 1952–1960 Emergency. At the center of it all is the reticent Mugo, the village's chosen hero and a man haunted by a terrible secret. As we learn of the villagers' tangled histories in a narrati", "Set in the wake of the Mau Mau rebellion and on the cusp of Kenya's independence from Britain, A Grain of Wheat follows a group of villagers whose lives have been transformed by the 1952–1960 Emergency. At the center of it all is the reticent Mugo, the village's chosen hero and a man haunted by a terrible secret. As we learn of the villagers' tangled histories in a narrative interwoven with myth and peppered with allusions to real-life leaders, including Jomo Kenyatta, a masterly story unfolds in which compromises are forced, friendships are betrayed, and loves are tested."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "247", "awards": [], "places": ["East Africa"], "character_names": [], "language": "English", "publish_date": "1994-01-01 00:00:00", "ISBN": "0435909878"},
{"url": "https://www.goodreads.com/book/show/371397.A_Question_of_Power", "num_ratings": "661", "num_reviews": "76", "avg_ratings": 3.76, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "Botswana"], "title": "A Question of Power", "description": ["\"Your mother was insane. If you're not careful you'll get insane just like your mother. Your mother was a white woman. They had to lock her up, as she was having a child by the stable boy who was a native.\" It is never clear to Elizabeth whether the mission school principal's cruel revelation of her origins is at the bottom of her mental breakdown. She has left South Afric", "\"Your mother was insane. If you're not careful you'll get insane just like your mother. Your mother was a white woman. They had to lock her up, as she was having a child by the stable boy who was a native.\" It is never clear to Elizabeth whether the mission school principal's cruel revelation of her origins is at the bottom of her mental breakdown. She has left South Africa with her son and is living in the village of Motabeng, the place of sand, in Botswana where there are no street lights at night. In the darkness of this country where people turn and look at her with vague curiosity as an outsider she establishes an entirely abnormal relationship with two men. A mind-bending book which takes the reader in and out of sanity."], "author": "Bessie Head", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-05-11 00:00:00", "ISBN": "0435907204"},
{"url": "https://www.goodreads.com/book/show/1392419.The_Invention_of_Africa", "num_ratings": "102", "num_reviews": "7", "avg_ratings": 3.97, "genres": ["Cultural", "Africa", "Philosophy", "History", "Nonfiction"], "title": "The Invention of Africa: Gnosis, Philosophy, and the Order of Knowledge", "description": ["..\". groundbreaking... clear, straightforward, and economical.... seminal... \" --American Anthropologist", "\"This is a challenging book... a remarkable contribution to African intellectual history.\" --International Journal of African Historical Studies", "\"Mudimbe's description of the struggles over Africa's self-invention are vivid and rewarding. From Blyden to Sartre, Temples to", "..\". groundbreaking... clear, straightforward, and economical.... seminal... \" --American Anthropologist", "\"This is a challenging book... a remarkable contribution to African intellectual history.\" --International Journal of African Historical Studies", "\"Mudimbe's description of the struggles over Africa's self-invention are vivid and rewarding. From Blyden to Sartre, Temples to Senghor, Mudimbe provides a bold and versatile resume of Africa's literary inventors.\" --Village Voice Literary Supplement", "..\". a landmark achievement in African studies.\" --Journal of Religion in Africa", "In this unique and provocative book, Zairean philosopher and writer V. Y. Mudimbe addresses the multiple scholarly discourses that exist--African and non-African--concerning the meaning of Africa and being African."], "author": "V.Y. Mudimbe", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1988-05-01 00:00:00", "ISBN": "0253204682"},
{"url": "https://www.goodreads.com/book/show/748164.Sleepwalking_Land", "num_ratings": "2,031", "num_reviews": "155", "avg_ratings": 4.06, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Mozambique", "Magical Realism", "Literature", "African Literature", "Literature", "European Literature", "Portuguese Literature", "Romance", "Novels", "Literary Fiction"], "title": "Sleepwalking Land", "description": ["As the civil war rages in 1980s Mozambique, an old man and a young boy, refugees from the war, seek shelter in a burnt-out bus. Among the effects of a dead passenger, they come across a set of notebooks that tell of his life. As the boy reads the story to his elderly companion, this story and their own develop in tandem. Written in 1992, Mia Couto’s first novel is a powerf", "As the civil war rages in 1980s Mozambique, an old man and a young boy, refugees from the war, seek shelter in a burnt-out bus. Among the effects of a dead passenger, they come across a set of notebooks that tell of his life. As the boy reads the story to his elderly companion, this story and their own develop in tandem. Written in 1992, Mia Couto’s first novel is a powerful indictment of the suffering war brings."], "author": "Mia Couto", "num_pages": "256", "awards": ["Camões Prize (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-02-21 00:00:00", "ISBN": "185242897X"},
{"url": "https://www.goodreads.com/book/show/7964595-mamy-wata-and-the-monster", "num_ratings": "5", "num_reviews": "1", "avg_ratings": 3.0, "genres": ["Womens", "Childrens", "Literature", "African Literature", "Childrens", "Picture Books"], "title": "Mamy Wata and the Monster (English)", "description": ["When Mamy Wata, the queen of all waters, finds a supposedly frightening monster crying in his cave, she is touched by his tears and wonders how she can make him happy again."], "author": "Véronique Tadjo", "num_pages": "24", "awards": [], "places": ["West Africa"], "character_names": [], "language": "English", "publish_date": "2000-01-01 00:00:00", "ISBN": "184059263X"},
{"url": "https://www.goodreads.com/book/show/505556.Death_and_the_King_s_Horseman", "num_ratings": "2,546", "num_reviews": "161", "avg_ratings": 3.75, "genres": ["Plays", "Drama", "Cultural", "Africa", "Fiction", "Literature", "African Literature", "Western Africa", "Nigeria", "Plays", "Theatre", "Classics", "Academic", "School", "Nobel Prize"], "title": "Death and the King's Horseman: A Play", "description": ["Based on events that took place in Oyo, an ancient Yoruba city of Nigeria, in 1946, Wole Soyinka's powerful play concerns the intertwined lives of Elesin Oba, the king's chief horseman; his son, Olunde, now studying medicine in England; and Simon Pilkings, the colonial district officer. The king has died and Elesin, his chief horseman, is expected by law and custom to comm", "Based on events that took place in Oyo, an ancient Yoruba city of Nigeria, in 1946, Wole Soyinka's powerful play concerns the intertwined lives of Elesin Oba, the king's chief horseman; his son, Olunde, now studying medicine in England; and Simon Pilkings, the colonial district officer. The king has died and Elesin, his chief horseman, is expected by law and custom to commit suicide and accompany his ruler to heaven. The stage is set for a dramatic climax when Pilkings learns of the ritual and decides to intervene and Elesin's son arrives home."], "author": "Wole Soyinka", "num_pages": "80", "awards": ["Premio letterario Giuseppe Acerbi (1993)"], "places": ["Oyo"], "character_names": [], "language": "English", "publish_date": "2002-04-17 00:00:00", "ISBN": "0393322998"},
{"url": "https://www.goodreads.com/book/show/758659.The_Seed_Is_Mine", "num_ratings": "36", "num_reviews": "2", "avg_ratings": 4.39, "genres": ["Nonfiction", "Cultural", "Africa", "Southern Africa", "South Africa", "Biography", "History"], "title": "The Seed Is Mine: The Life of Kas Maine, a South African Sharecropper, 1894-1985", "description": ["A bold and innovative social history, \"The Seed is Mine\" concerns the disenfranchised blacks who did so much to shape the destiny of South Africa. After years of interviews with Kas Maine and his neighbors, employers, friends, and family -- a rare triumph of collaborative courage and dedication -- Charles van Onselen has re-created the entire life of a man who struggled to", "A bold and innovative social history, \"The Seed is Mine\" concerns the disenfranchised blacks who did so much to shape the destiny of South Africa. After years of interviews with Kas Maine and his neighbors, employers, friends, and family -- a rare triumph of collaborative courage and dedication -- Charles van Onselen has re-created the entire life of a man who struggled to maintain his family in a world dedicated to enriching whites and impoverishing blacks, while South Africa was tearing them apart."], "author": "Charles van Onselen", "num_pages": "672", "awards": ["Alan Paton Award (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-31 00:00:00", "ISBN": "0809015943"},
{"url": "https://www.goodreads.com/book/show/129268.In_My_Father_s_House", "num_ratings": "151", "num_reviews": "11", "avg_ratings": 3.95, "genres": ["Philosophy", "Cultural", "Africa", "Nonfiction", "Anthropology", "History", "Western Africa", "Ghana"], "title": "In My Father's House: Africa in the Philosophy of Culture", "description": ["Africa's intellectuals have long been engaged in a conversation among themselves and with Europeans and Americans about what it means to be African. At the heart of these debates on African identity are the seminal works of politicians, creative writers, and philosophers from Africa and its diaspora. In this book, Appiah asks how we should think about the cultural situatio", "Africa's intellectuals have long been engaged in a conversation among themselves and with Europeans and Americans about what it means to be African. At the heart of these debates on African identity are the seminal works of politicians, creative writers, and philosophers from Africa and its diaspora. In this book, Appiah asks how we should think about the cultural situation of these intellectuals, reading their works in the context both of European and American ideas and of Africa's own indigenous traditions. Appiah draws on his experiences as a Ghanaian in the New World to explore the writings of African and African-American thinkers. In the process, he contributes his own vision of the possibilities and pitfalls of an African identity in the late twentieth century. Setting out to dismantle the specious oppositions between \"us\" and \"them, \" the West and the Rest, that have governed so much of the cultural debate about Africa in the modern world, Appiah maintains that all of us, wherever we live on the planet, must explore together the relations between our local cultures and an increasingly global civilization. Appiah combines philosophical analysis with more personal reflections, addressing the major issues in the philosophy of culture through an exploration of the contemporary African predicament."], "author": "Kwame Anthony Appiah", "num_pages": "256", "awards": ["Anisfield-Wolf Book Award (1993)", "James Russell Lowell Prize Nominee (1992)"], "places": [], "character_names": [], "language": "English", "publish_date": "1993-08-16 00:00:00", "ISBN": "0195068521"},
{"url": "https://www.goodreads.com/book/show/7568133-the-struggle-for-mozambique", "num_ratings": "9", "num_reviews": "0", "avg_ratings": 4.44, "genres": ["Cultural", "Africa", "Nonfiction", "Literature", "African Literature"], "title": "The Struggle For Mozambique", "author": "Eduardo Mondlane", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1969-05-01 00:00:00", "ISBN": "0140410287"},
{"url": "https://www.goodreads.com/book/show/757232.Native_Life_in_South_Africa", "num_ratings": "26", "num_reviews": "0", "avg_ratings": 3.62, "genres": ["Southern Africa", "South Africa", "Politics", "History", "Literature", "African Literature"], "title": "Native Life in South Africa", "description": ["A work of impassioned political propaganda, exposing the plight of black South Africans under the whites-only government'"], "author": "Sol T. Plaatje", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-02-01 00:00:00", "ISBN": "1406831557"},
{"url": "https://www.goodreads.com/book/show/1233373.Beyond_the_Masks", "num_ratings": "8", "num_reviews": "0", "avg_ratings": 4.25, "genres": ["Feminism", "Womens", "Nonfiction", "Literature", "African Literature", "Cultural", "Africa"], "title": "Beyond the Masks: Race, Gender and Subjectivity", "description": ["Psychology has had a number of things to say about black and coloured people and some of which have reinforced stereotyped and derogatory images. This text is an account of black psychology, exploring key theoretical issues in race and gender. It examines the history of racist psychology and of the implicit racism throughout the discipline. The text also offers a theoretic", "Psychology has had a number of things to say about black and coloured people and some of which have reinforced stereotyped and derogatory images. This text is an account of black psychology, exploring key theoretical issues in race and gender. It examines the history of racist psychology and of the implicit racism throughout the discipline. The text also offers a theoretical perspective, and should appeal to all those involved with ethnic minorities, gender politics and questions of identity."], "author": "Amina Mama", "num_pages": "216", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-08-25 00:00:00", "ISBN": "0415035449"},
{"url": "https://www.goodreads.com/book/show/3065945-histoire-de-l-afrique-noire", "num_ratings": "3", "num_reviews": "0", "avg_ratings": 4.33, "genres": ["Nonfiction", "Literature", "African Literature", "Cultural", "Africa"], "title": "Histoire De L'afrique Noire: D'hier à Demain", "description": ["Ce travail très documenté se veut simple contribution, simple point de départ pour investir et ouvrir l'avenir. Le propos de Ki-Zerbo est donc double. Loin de rester statique, son autopsie du passé africain s'articule sur le projet collectif de l'avenir d'un continent pour en orienter l'évolution et en maîtriser le cours. Souci qui amène l'auteur à définir la seconde signi", "Ce travail très documenté se veut simple contribution, simple point de départ pour investir et ouvrir l'avenir. Le propos de Ki-Zerbo est donc double. Loin de rester statique, son autopsie du passé africain s'articule sur le projet collectif de l'avenir d'un continent pour en orienter l'évolution et en maîtriser le cours. Souci qui amène l'auteur à définir la seconde signification de son projet en des termes aussi vifs qu'imagés : \" C'est une bouteille à la mer, avec l'espoir que son message sera recueilli surtout par les jeunes et contribuera à dessiner en traits authentiques le visage si peu connu, si méconnu, de l'Afrique d'hier, fournissant ainsi les bases d'une plus saine approche et d'une plus farouche détermination pour bâtir celle de demain \". Afrique d'hier, Afrique d'aujourd'hui, Afrique de demain : Ki-Zerbo les présente, tout au long de l'ouvrage, dans leur continuum non exempt de crises et de cassures, mais indissolublement liées... C'est un précieux outil de référence et de travail ; au langage simple ; facile à manipuler, qui aidera certainement de nombreux lycéens, étudiants, professeurs et tous ceux qui, en Afrique et en dehors d'Afrique, veulent connaître ce continent. J.P N'Diaye Jeune Afrique Ce volumineux ouvrage est le résultat de plus de dix années de travaux. Qualifié de \" vigoureux \" par le professeur Fernand Braudel, qui l'a amicalement préfacé, ce texte est le premier, dans lequel un historien africain traite de l'histoire du continent noir dans son ensemble... Sans verser dans les excès de certaines études historiques contemporaines, que leur ardeur anticolonialiste apparente étroitement au pamphlet, c'est en militant pourtant que Joseph Ki-Zerbo a conçu son travail, pensant, à juste titre, que \" la vision du passé peut nous aider à mieux concevoir le panafricanisme \"... En tout état de cause, le grand public appréciera la clarté d'un ensemble au sein duquel se distinguent les pages consacrées par Joseph Ki-Zerbo aux \" problèmes africains d'aujourd'hui \", intéressante mise au point d'un homme représentatif d'une certaine élite intellectuelle africaine, soucieuse de définir sur de nouvelles bases les rapports entre l'Afrique et les anciennes puissances coloniales. Quant aux experts, ils ne manqueront pas de rendre un hommage mérité aux conceptions personnelles de l'auteur, concernant la méthodologie historique et les traditions orales... Ph. D. Le Monde"], "author": "Joseph Ki-Zerbo", "num_pages": "729", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1994-12-23 00:00:00", "ISBN": "2218041766"},
{"url": "https://www.goodreads.com/book/show/287041.Facing_Mount_Kenya", "num_ratings": "254", "num_reviews": "22", "avg_ratings": 3.78, "genres": ["Cultural", "Africa", "History", "Nonfiction", "Eastern Africa", "Kenya", "Anthropology", "Literature", "African Literature", "Literature", "20th Century"], "title": "Facing Mount Kenya", "description": ["With an Introduction by Bronislav Malinkowski, ", "is a central document of the highest distinction in anthropological literature, an invaluable key to the structure of African society and the nature of the African mind. ", " is not only a formal study of life and death, work and play, sex and the family in one of the greatest tribes of contemp", "With an Introduction by Bronislav Malinkowski, ", "is a central document of the highest distinction in anthropological literature, an invaluable key to the structure of African society and the nature of the African mind. ", " is not only a formal study of life and death, work and play, sex and the family in one of the greatest tribes of contemporary Africa, but a work of considerable literary merit. The very sight and sound of Kikuyu tribal life presented here are at once comprehensive and intimate, and as precise as they are compassionate."], "author": "Jomo Kenyatta", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1962-02-12 00:00:00", "ISBN": "0394702107"},
{"url": "https://www.goodreads.com/book/show/1848903.The_History_of_the_Yorubas", "num_ratings": "35", "num_reviews": "7", "avg_ratings": 4.14, "genres": ["Cultural", "Africa", "History", "Nonfiction", "Literature", "African Literature"], "title": "The History of the Yorubas", "description": ["First published in 1921, and cited on the Africa's Best 100 Books List, this is a standard work on the history of theYorubas from the earliest times to the beginning of the British Protectorate. The first part of the book discusses the people, theircountry and language, religion, government, land law, manners and customs. The second part is divided into four periods, deali", "First published in 1921, and cited on the Africa's Best 100 Books List, this is a standard work on the history of theYorubas from the earliest times to the beginning of the British Protectorate. The first part of the book discusses the people, theircountry and language, religion, government, land law, manners and customs. The second part is divided into four periods, dealing first with mytheological kings and deified heroes; with the growth, prosperity and oppression of the Yoruba people; the time of revolutionary wars and disruption; and, finally, the arrest of disintegration, inter-tribal wars, and the coming of the British. There are two appendices, on dealing with treaties and agreements, the other giving tables of Yoruba kings, rulers, and chiefs. The book also includes an index and map of the Yoruba country."], "author": "Samuel Johnson", "num_pages": "740", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-12-29 00:00:00", "ISBN": "978322929X"},
{"url": "https://www.goodreads.com/book/show/18549967-sur-la-philosophie-africaine", "num_ratings": "21", "num_reviews": "3", "avg_ratings": 3.52, "genres": ["Cultural", "Africa", "Philosophy", "Nonfiction", "Literature", "African Literature"], "title": "Sur La Philosophie Africaine", "description": ["Many contemporary African writers remain trapped in the quest for a worldview, philosophy, supposing a single African demesne to explain the entire continent, referring to a mythical past. Paulin Hountondji shows how these strange conceptual constructions have played a positive role in the resistance led by intellectuals of colonial rule: they responded to the negation of", "Many contemporary African writers remain trapped in the quest for a worldview, philosophy, supposing a single African demesne to explain the entire continent, referring to a mythical past. Paulin Hountondji shows how these strange conceptual constructions have played a positive role in the resistance led by intellectuals of colonial rule: they responded to the negation of the oppression that it comprised of, but it was an ambiguous answer, especially because it was built on the principles derived from the works of European ethnologists, particularly the Pere Tempels. Independence opened a new historical period; these philosophical elaborations changed direction: once an expression of anti-colonial resistance, they are nowadays an ideology that justifies and reinforces the dominance of the contemporary state; the intellectuals who create them are today only the griots of the regimes in place. Analysing without complacency the work of Nkrumah, of the Cameroonian Towa, and of the Rwandan Kagame, amongst others, Hountondji exposes and denounces this antagonism. To him, the critical project proposed in this book seems a necessary step on the way to the liberation of theoretical creativity, the peoples of Africa and their full participation in the universal intellectual debate!\""], "author": "Paulin J. Hountondji", "num_pages": "246", "awards": [], "places": ["Ghana"], "character_names": [], "language": null, "publish_date": "2013-08-28 00:00:00", "ISBN": "1299817319"},
{"url": "https://www.goodreads.com/book/show/4565781-ethiopia-unbound", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 4.0, "genres": ["Cultural", "Africa", "Western Africa", "Ghana", "Politics"], "title": "Ethiopia Unbound: Studies in Race Emancipation: Studies in Race Emancipation", "description": ["First Published in 1969. Routledge is an imprint of Taylor & Francis, an informa company."], "author": "J.E. Casley Hayford", "num_pages": "260", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1969-07-25 00:00:00", "ISBN": "0714617539"},
{"url": "https://www.goodreads.com/book/show/3052094-cutting-the-rose", "num_ratings": "7", "num_reviews": "0", "avg_ratings": 4.0, "genres": ["Cultural", "Africa", "Anthropology", "Sociology", "Womens"], "title": "Cutting the Rose: Female Genital Mutilation: The Practice and Its Prevention", "description": ["There is growing international interest in Female Genital Mutilation. This is partly due to the exposure of the subject by human rights activists and organizations and partly due to the emergence of the practice in the West. Given that Female Genital Mutilation has a negative effect on both the physical and psychological health of millions of women, not just in Africa but", "There is growing international interest in Female Genital Mutilation. This is partly due to the exposure of the subject by human rights activists and organizations and partly due to the emergence of the practice in the West. Given that Female Genital Mutilation has a negative effect on both the physical and psychological health of millions of women, not just in Africa but also in Europe, North America and other parts of the world, what must be done to eradicate this practice? What are the lessons to be learned from past experience of work in this area? How can international interest be guided towards positive change? In order to answer these questions, Efua Dorkenoo presents the facts about Female Genital Mutilation. From her research in the field and her work in Britain, she then gives a comprehensive update on work in Africa together with models of good practice to show how best to deal with the very diverse experiences found in different parts of the world. Only from such models is it fully possible to explore such issues as the rights of women and of children, of the part which the well-being of women plays in the health of a nation, and also the strengths and weaknesses of the various international campaigns on the subject. By offering much new information and clarifying many grey areas, Efua Dorkenoo shows the importance of offering professional advice which is prolonged, well-monitored and co-ordinated. This, in turn, should be supported with practical help, which is underpinned by the aid of local and international bodies."], "author": "Efua Dorkenoo", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-01-01 00:00:00", "ISBN": "1873194609"},
{"url": "https://www.goodreads.com/book/show/1797568.Kiswahili", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 5.0, "genres": ["Cultural", "Africa", "Nonfiction", "Literature", "African Literature"], "title": "Kiswahili: Past, Present, And Future Horizons", "description": ["Kiswahili is the fastest growing African language. The author, Professor of Kiswahili at Egerton University, here describes this growth and examines Kiswahili as an alternative to European languages in East Africa and as an international language for Africa. He covers the controversial theories of the origination and development of Kiswahili, the effects of the use of Engl", "Kiswahili is the fastest growing African language. The author, Professor of Kiswahili at Egerton University, here describes this growth and examines Kiswahili as an alternative to European languages in East Africa and as an international language for Africa. He covers the controversial theories of the origination and development of Kiswahili, the effects of the use of English as the language of instruction in Kenya and the status of Kiswahili in trade, religion and politics in East and Central Africa, within a continental context. A country analysis of Tanzania, Kenya and Uganda reveals the spread of Kiswahili as a mother tongue and second language; its use in creative writing and music, and its status in language policies. The argument for Kiswahili as the language of Africa is also discussed."], "author": "Rocha M. Chimerah", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-01-01 00:00:00", "ISBN": "9966846352"},
{"url": "https://www.goodreads.com/book/show/3128810-unity-and-struggle", "num_ratings": "51", "num_reviews": "3", "avg_ratings": 3.98, "genres": ["Cultural", "Africa", "Politics", "History", "Nonfiction"], "title": "Unity and Struggle", "description": ["Cabral is among the great figures of our time -- these texts provide the evidence."], "author": "Amilcar Cabral", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1979-01-01 00:00:00", "ISBN": "0853456259"},
{"url": "https://www.goodreads.com/book/show/21411131-os-nacionalismos-africanos", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Os nacionalismos africanos", "author": "Mário Coelho Pinto de Andrade", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/534519.Male_Daughters_Female_Husbands", "num_ratings": "46", "num_reviews": "7", "avg_ratings": 3.61, "genres": ["Anthropology", "Cultural", "Africa", "Feminism", "History", "Gender", "Nonfiction", "Literature", "African Literature", "Western Africa", "Nigeria"], "title": "Male Daughters, Female Husbands: Gender and Sex in an African Society", "description": ["Challenging the received orthodoxies of social anthropology, Ifi Amadiume argues that in precolonial society, sex and gender did not necessarily coincide. Examining the structures that enabled women to achieve power, she shows that roles were neither rigidly masculinized nor feminized.", "Economic changes in colonial times undermined women’s status and reduced their political", "Challenging the received orthodoxies of social anthropology, Ifi Amadiume argues that in precolonial society, sex and gender did not necessarily coincide. Examining the structures that enabled women to achieve power, she shows that roles were neither rigidly masculinized nor feminized.", "Economic changes in colonial times undermined women’s status and reduced their political role and Dr Amadiume maintains, patriarchal tendencies introduced by colonialism persist today, to the detriment of women.Critical of the chauvinist stereotypes established by colonial anthropology, the author stresses the importance of recognizing women’s economic activities as as essential basis of their power. She is also critical of those western feminists who, when relating to African women, tend to accept the same outmoded projections."], "author": "Ifi Amadiume", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-01-01 00:00:00", "ISBN": "0862325951"},
{"url": "https://www.goodreads.com/book/show/21411121-amal-ezulu", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 5.0, "genres": ["Literature", "African Literature", "Cultural", "Africa"], "title": "Amal'eZulu", "author": "Benedict Wallet Vilakazi", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/1043774.Accumulation_on_a_World_Scale", "num_ratings": "16", "num_reviews": "3", "avg_ratings": 4.0, "genres": ["Politics", "Economics", "Nonfiction", "Literature", "African Literature"], "title": "Accumulation on a World Scale: A Critique of the Theory of Underdevelopment (2 Volumes)", "author": "Samir Amin", "num_pages": "666", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1978-02-01 00:00:00", "ISBN": "0853454302"},
{"url": "https://www.goodreads.com/book/show/15811165-n-s-os-do-makulusu", "num_ratings": "22", "num_reviews": "0", "avg_ratings": 3.86, "genres": ["Cultural", "Africa", "Central Africa", "Angola", "Literature", "African Literature"], "title": "Nós, os do Makulusu", "author": "José Luandino Vieira", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "Portuguese", "publish_date": "2008-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/4381443-mauvais-sang-suivi-de-feu-de-brousse-et-a-triche-c-ur", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": ["Literature", "African Literature", "Cultural", "Africa"], "title": "mauvais sang ; suivi de Feu de brousse ; et, A triche-cœur", "author": "Tchicaya U Tam'si", "num_pages": "137", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1978-07-11 00:00:00", "ISBN": "2858020841"},
{"url": "https://www.goodreads.com/book/show/1498894.La_vie_et_demie", "num_ratings": "87", "num_reviews": "13", "avg_ratings": 3.86, "genres": ["Cultural", "Africa", "Novels", "Fiction"], "title": "La vie et demie", "description": ["Grandeur et décadence de la Katamalanasie, immense pays d'Afrique noire soumis à la plus sanglante, mais aussi la plus absurde des dictatures. Les morts n'y meurent jamais tout à fait, juste retour des choses puisque les vivants n'ont guère le droit d'y vivre. Si le constat de Sony Labou Tansi, pour drôle et réjouissant qu'il soit, peut paraître pessimiste, c'est qu'il déc", "Grandeur et décadence de la Katamalanasie, immense pays d'Afrique noire soumis à la plus sanglante, mais aussi la plus absurde des dictatures. Les morts n'y meurent jamais tout à fait, juste retour des choses puisque les vivants n'ont guère le droit d'y vivre. Si le constat de Sony Labou Tansi, pour drôle et réjouissant qu'il soit, peut paraître pessimiste, c'est qu'il décrit, au-delà du continent africain, le monde du prochain siècle : \"Au fond, la terre n'est plus ronde. Elle ne le sera jamais plus. La Vie et demie devient cette fable qui voit demain avec des yeux d'aujourd'hui.\""], "author": "Sony Labou Tansi", "num_pages": "191", "awards": ["French-American Foundation Translation Prize Nominee for Fiction (2011)"], "places": [], "character_names": [], "language": "French", "publish_date": "1998-10-14 00:00:00", "ISBN": "2020353067"},
{"url": "https://www.goodreads.com/book/show/21411107-utenzi-wa-vita-vya-uhuru", "num_ratings": "1", "num_reviews": "0", "avg_ratings": 5.0, "genres": [], "title": "Utenzi wa vita vya uhuru", "author": "Shaaban Bin Robert", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/545416.Third_World_Express", "num_ratings": "2", "num_reviews": "0", "avg_ratings": 4.0, "genres": ["Cultural", "Africa", "Literature", "African Literature", "Fiction"], "title": "Third World Express", "author": "Mongane Serote", "num_pages": "40", "awards": ["Noma Award for Publishing in Africa (1993)"], "places": [], "character_names": [], "language": null, "publish_date": "1992-12-31 00:00:00", "ISBN": "0864862407"},
{"url": "https://www.goodreads.com/book/show/435084.Oeuvre_poetique", "num_ratings": "115", "num_reviews": "5", "avg_ratings": 3.93, "genres": ["Poetry", "Cultural", "France", "Cultural", "Africa", "Western Africa", "Senegal"], "title": "Oeuvre poetique", "author": "Léopold Sédar Senghor", "num_pages": "425", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1990-10-15 00:00:00", "ISBN": "2020121069"},
{"url": "https://www.goodreads.com/book/show/10102733-a-gera-o-da-utopia", "num_ratings": "193", "num_reviews": "8", "avg_ratings": 4.18, "genres": ["Cultural", "Africa", "Central Africa", "Angola"], "title": "A Geração da Utopia", "description": ["A Geração da Utopia é o retrato desapiedado dos angolanos a quem ficou a dever-se a epopeia das lutas pela independência e da guerra civil que logo lhe sucedeu, das glórias e das sombras que marcaram esses longos anos de permanente conflito, e do descontentamento e da indiferença que insidiosamente se tornou o estigma de tantos desses homens e mulheres que fizeram, apesar", "A Geração da Utopia é o retrato desapiedado dos angolanos a quem ficou a dever-se a epopeia das lutas pela independência e da guerra civil que logo lhe sucedeu, das glórias e das sombras que marcaram esses longos anos de permanente conflito, e do descontentamento e da indiferença que insidiosamente se tornou o estigma de tantos desses homens e mulheres que fizeram, apesar de tudo, um novo país. Internacionalmente conhecido como uma dsa mais representativas figuras das letras angolanas, pepetela é autor de uma obra já extensa, de entre a qual se destacam, para além do presente romance, Muana Puó, Mayombe, O Cão e os Caluandas, Yaka e Lueji, todos editados nesta mesma colecção."], "author": "Pepetela", "num_pages": "369", "awards": [], "places": [], "character_names": [], "language": "Portuguese", "publish_date": "2007-10-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16681000-song-of-lawino", "num_ratings": "4", "num_reviews": "1", "avg_ratings": 3.75, "genres": [], "title": "Song of Lawino =: Canción de Lawino", "author": "Okot p'Bitek", "num_pages": "367", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "2011-01-01 00:00:00", "ISBN": "8477858969"},
{"url": "https://www.goodreads.com/book/show/1274972.The_Old_Man_and_the_Medal", "num_ratings": "205", "num_reviews": "16", "avg_ratings": 3.55, "genres": ["Cultural", "Africa", "Fiction", "Literature", "African Literature", "Central Africa", "Cameroon", "Literature"], "title": "The Old Man and the Medal", "description": ["Takes a satirical look at colonialism and the situations it promotes. By the author of Houseboy."], "author": "Ferdinand Oyono", "num_pages": "167", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1969-01-01 00:00:00", "ISBN": "0435900390"},
{"url": "https://www.goodreads.com/book/show/14881048-labyrinths", "num_ratings": "56", "num_reviews": "6", "avg_ratings": 3.91, "genres": ["Poetry", "Cultural", "Africa", "Fiction", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "Labyrinths", "author": "Christopher Okigbo", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-06-01 00:00:00", "ISBN": "0435045695"},
{"url": "https://www.goodreads.com/book/show/1145259.Un_atti_k_pour_Elgass", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Un attiéké pour Elgass", "author": "Tierno Monénembo", "num_pages": "170", "awards": [], "places": [], "character_names": [], "language": "French", "publish_date": "1993-08-16 00:00:00", "ISBN": "2020196042"},
{"url": "https://www.goodreads.com/book/show/3256787-the-rich-man-of-pietermaritzburg", "num_ratings": "9", "num_reviews": "1", "avg_ratings": 3.78, "genres": ["Literature", "African Literature", "Cultural", "Africa", "Fiction"], "title": "The Rich Man of Pietermaritzburg", "description": ["Translated for the first time from Africa's native Zulu language, this novel set in apartheid-era rural South Africa follows an urban swindler as he attempts to take advantage of well-meaning but naive villagers, claiming to be on a mission of salvation--but in truth looking for instant riches. Both hilarious and tender, it explores the fateful confrontation between pastor", "Translated for the first time from Africa's native Zulu language, this novel set in apartheid-era rural South Africa follows an urban swindler as he attempts to take advantage of well-meaning but naive villagers, claiming to be on a mission of salvation--but in truth looking for instant riches. Both hilarious and tender, it explores the fateful confrontation between pastoral benevolence and urban slyness in a peasant countryside that is being destroyed by the rapid loss of land and liberties."], "author": "Sibusiso Nyembezi", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "0955233992"},
{"url": "https://www.goodreads.com/book/show/863234.The_House_of_Hunger", "num_ratings": "455", "num_reviews": "41", "avg_ratings": 3.96, "genres": ["Cultural", "Africa", "Fiction", "Short Stories", "Literature", "African Literature", "Eastern Africa", "Zimbabwe"], "title": "The House of Hunger", "description": ["Winner of the Guardian fiction prize, this novella and nine short stories describe life in a Zimbabwean township. They are about the brutalization of the individual's mental processes, until madness, violence and despair become the normal state of affairs for families in black urban areas."], "author": "Dambudzo Marechera", "num_pages": "160", "awards": ["Guardian Fiction Award (1979)"], "places": [], "character_names": [], "language": "English", "publish_date": "1993-12-07 00:00:00", "ISBN": "043590986X"},
{"url": "https://www.goodreads.com/book/show/3401631-ualalapi", "num_ratings": "34", "num_reviews": "1", "avg_ratings": 3.79, "genres": ["Literature", "African Literature", "Cultural", "Africa", "Eastern Africa", "Mozambique"], "title": "Ualalapi", "author": "Ungulani Ba Ka Khosa", "num_pages": "125", "awards": [], "places": [], "character_names": [], "language": "Portuguese", "publish_date": "1991-08-16 00:00:00", "ISBN": "9722105698"},
{"url": "https://www.goodreads.com/book/show/914523.Die_Swerfjare_van_Poppie_Nongena", "num_ratings": "115", "num_reviews": "10", "avg_ratings": 3.79, "genres": ["Cultural", "Africa", "History", "Southern Africa", "South Africa"], "title": "Die Swerfjare van Poppie Nongena", "description": ["Elsa Joubert se strak joernalistieke beskrywing van die lewe van die swartvrou Poppie Nongena is 'n aangrypend menslike portret en tegelyk ook 'n belangrike stuk hedendaagse geskiedskrywing. Van die boek is gese dat die Afrikaner hierna nooit weer sal kan se: Maar ons het nie geweet nie!"], "author": "Elsa Joubert", "num_pages": "292", "awards": ["Winifred Holtby Memorial Prize (1980)", "CNA Literary Award", "Louis Luyt-prys"], "places": [], "character_names": [], "language": null, "publish_date": "1996-01-08 00:00:00", "ISBN": "0624023338"},
{"url": "https://www.goodreads.com/book/show/1418467.Bones", "num_ratings": "89", "num_reviews": "7", "avg_ratings": 3.71, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Literature", "African Literature", "Literature"], "title": "Bones (African Writers)", "description": ["Bones is a poetic novel about the guerilla fight for freedom in Zimbabwe, but unlike a conventional novel, all the action is interior monologues -- some by specific characters, others by representatives of certain types produced by colonial history, or by spirits. The story involves a mother's love, and a lover's yearning, for a young man who has joined the freedom fighter", "Bones is a poetic novel about the guerilla fight for freedom in Zimbabwe, but unlike a conventional novel, all the action is interior monologues -- some by specific characters, others by representatives of certain types produced by colonial history, or by spirits. The story involves a mother's love, and a lover's yearning, for a young man who has joined the freedom fighters. Hove captures the ambivalence and conflicts of loyalties in the attitude of the peasants towards the guerillas, and underscores the state's indifference to the lives of ordinary people."], "author": "Chenjerai Hove", "num_pages": "113", "awards": ["Noma Award for Publishing in Africa (1989)"], "places": [], "character_names": [], "language": "English", "publish_date": "1990-07-16 00:00:00", "ISBN": "0435905767"},
{"url": "https://www.goodreads.com/book/show/8403186-wrath-of-the-ancestors", "num_ratings": "24", "num_reviews": "1", "avg_ratings": 3.5, "genres": [], "title": "Wrath of the Ancestors", "description": ["Archibald Campbell Mzolisa Jordan was born on a mission in the Transkei and studied literary Xhosa at the University of Cape Town. ", "His classic Xhosa novel, Ingqumbo Yezinyanya (1940) was later translated by the author and his wife, Phyllis Ntantala, into English as The Wrath of the Ancestors (1980). This novel, considered as one of the masterpieces of Xhosa writing and Sou", "Archibald Campbell Mzolisa Jordan was born on a mission in the Transkei and studied literary Xhosa at the University of Cape Town. ", "His classic Xhosa novel, Ingqumbo Yezinyanya (1940) was later translated by the author and his wife, Phyllis Ntantala, into English as The Wrath of the Ancestors (1980). This novel, considered as one of the masterpieces of Xhosa writing and South African literature, was translated into Afrikaans as Die Toorn van die Voorvaders, published in 1990, and a Dutch translation, De Wraak van het Voorgeslacht, appearing in the classic African Writers Series in the Netherlands in 1999. The novel tells a gripping epic-tragic tale of the conflicting forces of Western education and Xhosa traditional beliefs amongst the “School people” and the “Ochre people” of the Mpondomise people."], "author": "A.C. Jordan", "num_pages": "285", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2004-03-01 00:00:00", "ISBN": "0868522287"},
{"url": "https://www.goodreads.com/book/show/2507342.N_s_Mat_mos_o_C_o_Tinhoso", "num_ratings": "122", "num_reviews": "13", "avg_ratings": 3.97, "genres": ["Cultural", "Africa", "Literature", "African Literature", "Short Stories", "Eastern Africa", "Mozambique", "Fiction", "European Literature", "Portuguese Literature"], "title": "Nós Matámos o Cão Tinhoso", "description": ["This book is currently out of stock with a ready about date of September 30, 1999The title story, which like the others is set in Mozambique, Lewis Nkosi has been described as, \"...a hauntingly beautiful story, whose simplicity of narrative conceals an extraordinary sharp poetic insight into the theme of life and death, the impulses of love and violence...\""], "author": "Luís Bernardo Honwana", "num_pages": "144", "awards": [], "places": [], "character_names": [], "language": "Portuguese", "publish_date": "2000-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/431736.Blood_Knot", "num_ratings": "52", "num_reviews": "5", "avg_ratings": 3.85, "genres": ["Plays"], "title": "Blood Knot", "description": ["A play about two brothers who lose themselves in illusory hopes and dreams. Naive optimism and self-delusion finally give way to self-reflection and consciousness, and the brothers abandon their role-playing and embrace their brotherhood."], "author": "Athol Fugard", "num_pages": "81", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1989-01-01 00:00:00", "ISBN": "0573640033"},
{"url": "https://www.goodreads.com/book/show/468273.Murambi_The_Book_of_Bones", "num_ratings": "302", "num_reviews": "40", "avg_ratings": 4.01, "genres": ["Cultural", "Africa", "Eastern Africa", "Rwanda", "Western Africa", "Senegal", "Fiction", "Cultural", "France"], "title": "Murambi, The Book of Bones", "description": ["\"[W]hat is true of Rwanda is true in each of us; we all share in Africa.\" --L'Harmattan", "\"[This novel] comes closer than have many political scientists or historians to trying to understand why this small country... sank in such appalling violence.\" --Radio France International", "In April of 1994, nearly a million Rwandans were killed in what would prove to be one of the swifte", "\"[W]hat is true of Rwanda is true in each of us; we all share in Africa.\" --L'Harmattan", "\"[This novel] comes closer than have many political scientists or historians to trying to understand why this small country... sank in such appalling violence.\" --Radio France International", "In April of 1994, nearly a million Rwandans were killed in what would prove to be one of the swiftest, most terrifying killing sprees of the 20th century. In Murambi, The Book of Bones, Boubacar Boris Diop comes face to face with the chilling horror and overwhelming sadness of the tragedy. Now, the power of Diop's acclaimed novel is available to English-speaking readers through Fiona Mc Laughlin's crisp translation. The novel recounts the story of a Rwandan history teacher, Cornelius Uvimana, who was living and working in Djibouti at the time of the massacre. He returns to Rwanda to try to comprehend the death of his family and to write a play about the events that took place there. As the novel unfolds, Cornelius begins to understand that it is only our humanity that will save us, and that as a writer, he must bear witness to the atrocities of the genocide.", "From the novel:", "\"If only by the way people are walking, you can see that tension is mounting by the minute. I can feel it almost physically. Everyone is running or at least hurrying about. I meet more and more passersby who seem to be walking around in circles. There seems to be another light in their eyes. I think of the fathers who have to face the anguished eyes of their children and who can't tell them anything. For them, the country has become an immense trap in the space of just a few hours. Death is on the prowl. They can't even dream of defending themselves. Everything has been meticulously prepared for a long time: the administration, the army, and the [militia] are going to combine forces to kill, if possible, every last one of them.\""], "author": "Boubacar Boris Diop", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "0253218527"},
{"url": "https://www.goodreads.com/book/show/152571.Les_Contes_d_Amadou_Koumba", "num_ratings": "69", "num_reviews": "4", "avg_ratings": 4.06, "genres": ["Cultural", "Africa", "Western Africa", "Senegal"], "title": "Les Contes d'Amadou Koumba", "description": ["Les nouveaux contes d'amadou koumba"], "author": "Birago Diop", "num_pages": "187", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1998-12-31 00:00:00", "ISBN": "2708701673"},
{"url": "https://www.goodreads.com/book/show/17567582", "num_ratings": "48", "num_reviews": "9", "avg_ratings": 4.17, "genres": [], "title": "ثلاثية محمد ديب، النول، الحريق، الدار الكبيرة", "description": ["ثلاث روايات للأديب الجزائري محمد ديب، تم جمعها في مؤلف واحد وهي تضم أحداث ووقائع جرت في الجزائر إبان الإستعمار الفرنسي ..", "معلومات عن الثلاثية من موقع : مجلة دليل الكتاب", "صور محمد ديب في ثلاثيته La grande maison (الدار الكبيرة)،L’incendie الحريق،Le métier a tisser (النول)، مرحلة من تاريخ الجزائر بين سنتي 1939-1942. فتجري الأحداث في الجزء الأول بإحدى دور مدينة تلمسان وهي دار سب", "ثلاث روايات للأديب الجزائري محمد ديب، تم جمعها في مؤلف واحد وهي تضم أحداث ووقائع جرت في الجزائر إبان الإستعمار الفرنسي ..", "معلومات عن الثلاثية من موقع : مجلة دليل الكتاب", "صور محمد ديب في ثلاثيته La grande maison (الدار الكبيرة)،L’incendie الحريق،Le métier a tisser (النول)، مرحلة من تاريخ الجزائر بين سنتي 1939-1942. فتجري الأحداث في الجزء الأول بإحدى دور مدينة تلمسان وهي دار سبيطار التي تقطنها العديد من العائلات الجزائرية. بينما ينقلنا في الجزء الثاني إلى عالم الفلاحين بقرية مجاورة لتلمسان وهي بني بوربلان ويصل بنا أخيراً إلى أحد مصانع النسيج ليبين آلام وآمال عماله.", " تشكلت صورة الجزائر في الثلاثية من خلال شخوصها الذين أذلهم المستعمر وسلبهم كرامتهم وإنسانيتهم وأراضيهم ليصبحوا أجراء في أراضيهم، إضافة إلى سياسة التفقير التي مارسها المستعمر على الشعب الجزائري. والتي عبر عنها ديب بالخبز Le pain إذ تكون الشخصيات في رحلة بحث عن الخبز. أو الجوع بمفهومه القريب والبعيد. ويستهل روايته الدار الكبيرة بجملة \" أعطني قطعة خبز\"(11). وهكذا يتابع الأطفال في المدرسة رحلة بحثهم عن الخبز، منبهرين بما يخبرهم به الفتى صاحب المكانة العالية إدريس خوجا عن أكله، فيقول الكاتب:\" كان الأطفال يقفون زائغي الأبصار مبهوتين وهم يستمعون إلى حديثه المليء بذكر هاته الأطعمة.. إن الأعين كلها تشخص إليه وتفحصه تفحصاً غريباً ويسأله أحدهم: أكلت وحدك قطعة كبيرة من اللحم هكذا؟ أكلتُ وحدي قطعة من اللحم هكذا. وخوخا مجففا؟ وخوخا مجففا..\"(12). لقد قتل الجوع في أولئك الأطفال أحلامهم التي لم تعد تتعدى الحصول على قطعة خبز. وبمقابل حديث إدريس عن الأطعمة المختلفة، نجد عيني والدة عمر بطل الرواية \" تصب في طبق معدني كبير الحساء المغلي، وهو حساء بالشعيرية المفتتة والخضار ولا شيء غير هذا.. ويبلغ الأمر في كثير من الأحيان أن تكتفي بصب الماء في الحلة، فيظل يغلي لغاية ما يأخذ الكرى بأجفان أطفالها، وكانت تلجأ لها نساء كثيرات.. وبهذا كانت أُسر الدار الكبيرة تخادع الجوع ويخادعها الجوع مرات عديدة، فحياتهم تنقضي في خداع الجوع..\"(13). إنها الإنسانية المهانة من الاستعمار فإذا الشخصيات في دار سبيطار تتحول إلى كائنات بلا كيان، حلمها وشبحها هو الخبز وكيفية الحصول عليه. ولأنهم لا يحصلون عليه فهم يتحايلون عليه. يقول:\" كانت عيني فيما مضى من زمان، تستطيع أن تهدئهم بحيلة ماكرة، كانوا يومئذ صغاراً كان يكفي أن يكون عندها قليل من فحم عند المساء حتى تملأ الحلة ماء وتدع الماء يغلي على النار وتطلب إلى أولادها الذين ينتظرون بفارغ الصبر أن يهدأ وتقول لهم : اصبروا قليلا.. فيغلبهم نعاس لا حيلة لهم فيه\"(14). وتواصل الشخصيات صراعها مع الجوع ومخططاتها لكي تهزمه عن طريق التقشف في المال الزهيد الذي تجنيه مريم وعيوشة. يقول ديب:\"ربما استطعنا أن نشتري قليلاً من اللحم من حين لآخر أليس كذلك يا أمي؟ ربما نستطيع أن نشتري بيضاً إنه أرخص ثمناً من اللحم ما رأيكم أنتم؟\"(15). ويواصل الروائي رحلته مع عائلة (عيني) التي تحاول التصرف بذاك المبلغ البسيط من المال، فيبرز رأي عمر ووالدته (عيني) اللذان يرفضان رأي الفتاتين فيقول ديب:\" لكن عيني وإبنها عمر يرفضان رأي الفتاتين ويصران على أن ضآلة المبلغ الذي يجنيانه من عملهما لا يكاد يغطي مصاريف الدقيق الواجب شراؤه كل يوم. والخبز عند عمر كل شيء ويجب الحصول عليه.. إن أحلامه لا تذهب إلى أبعد من هذا..\"(16). وهكذا شكل الجوع مدار الجزء الأول من ثلاثية ديب ليبدأ الجزء الثاني (الحريق) عام 1954. إنه عام الثورة وهو أيضا عام لم يخل من الجوع، إذ يستهل الروائي هذا الجزء بالحديث عن الجوع فتسأل (ماما) زوجة (قارة الثري) عمر\"أأنت جائع؟ نعم\"(17). وهكذا يقدم ديب الوضع العام للفلاحين وهم يقدمون خيرات أرضهم للمستعمر كما يصف حالة فقرهم الذي تبينه أكواخهم. ويظل الجوع يطاردهم وهم يعملون بأجور زهيدة جداً ويبدأ الحديث عن الجوع يضمحل في الجزء الثالث (النول) رغم الفقر الذي يستمر بين العمال حيث\" تبدو ظاهرة الفقر مرسومة على ملامح عمال النسيج بالرغم من حصولهم على الأجرة كل شهر.. فهل استطاع أحدهم أن يغير من حالته المادية منذ دخل مصنع النسيج؟ دخل فقيراً معدما ولايزال فقيراً وقد بلغت رأفة العمال على ما هم فيه من عوز أن راح بعضهم ينظر إلى عمر نظرة إشفاق واحتقار يوم دخل المصنع فهم يعلمون مسبقا أن مصير عمر يشبه مصيرهم، سيظل فقيراً مثلما دخل فقيرا\"(18). فقد تركعمر الدراسة ليلتحق بالعمل في المصنع في سن مبكرة. إنه الجوع مرة أخرى يهدد الكبار والصغار. وقد برع ديب في تصوير بؤس العمال. هذا البؤس الذي ارتبط بمحاولات المستعمر للقضاء على شخصية الجزائريين من خلال سياسة التجويع والقهر الدائمين. ومن خلال عمال مصنع النسيج، تتواصل المطالبة بالشخصية الوطنية والبحث عن الهوية فيصرخ أحد العمال حمدوش: \"أنتم الشعب. الشعب الذي يصنع كل شيء ويعلم كل شيء\"(19). لقد صارت هذه الشخصيات أكثر وعياً بمصيرها ومطالبها التي تتعدى الحصول على الخبز. بل هو الوطن المغتصب الذي على الجميع أن يسعى لاستعادته.", " وهكذا فإن صورة الجزائر في ثلاثية محمد ديب لم تكتمل إلا بحديثه عن هويتها وعن الشعور بالوطنية الذي أظهرته شخصيات الثلاثية. يقول ديب:\".. وما السر في اختيار عنوان الدرس والوطن. لماذا اغتاظ عمر عندما سمع إبراهيم ينطلق كالببغاء، فرنسا هي أمنا الوطن. هل كان يعلم أن فرنسا ليست بوطنه الحقيقي؟\"(20). لقد أراد ديب أن يبين مدى تمسك الجزائريين بهويتهم وبوطنهم. يقول:\" قال المعلم حسن: الوطن هو أرض الآباء، هو البلد الذي نسكنه منذ أجيال، هو كل ما على هذه الأرض من سكان وكل ما يوجد فيها بوجه الإجمال. ذلك هو الوطن وتلك هي شروط الوطنية فهل لعمر وطن وأين هو؟\"(21). إن المعلم حسن يسعى لإيضاح مفهوم الوطن للأطفال، فشخصيات ديب صارت أكثر نضجا وإيمانا بأن الشعب وحده القادر على التغيير وإخراج المستعمر. إنها ثقته التي وضعها في شخصياته مصوراً بطولتها وهذا يجعل صورة البطولة في الثلاثية جماعية.", " ومن هنا فقد كتب محمد ديب ثلاثيته محاولاً إبراز موقفه من ظروف الجزائر أثناء الفترة الاستعمارية راصداً الحالة الاجتماعية والسياسية آنذاك.", "ومن الدلائل التي تؤكد الروح العربية والجزائرية للثلاثية، توظيف الروائي للعديد من التعابير العربية بلغة فرنسية. هذه العربية التي أراد الاستعمار وسعى كثيراً إلى القضاء عليها بكل الطرق. يقول ديب:\" Maudite .maudis.tes père et mère \"(22). (ملعونة. لعن الله أباك وأمك). ويقول:\"La fièvre noire t’emporte \"(23). (الحمة السوداء تأخذك). ويضيف أيضاً العديد من الكلمات والمصطلحات الجزائرية ومنها:\"Tfou\"(24). (لفظ يطلق للبصاق).و\"Bouh\"(25). (لفظ يدل على التحسر في اللهجة الجزائرية). و\"Si\"(26). (لفظ للدلالة على السيادة يستعمل في دول المغرب العربي). و\"couscous\"(27). Burnous\"(28).Haik... \"(29). (أسماء أكل وألبسة شائعة بالجزائر). كما يظهر في الثلاثية تجاهل ديب للحديث عن المستعمر.", " ورغم اتخاذه من الفرنسية وسيلة للتعبير، إلا أن روح الثلاثية كانت عربية. وقد أشاد بالثلاثية كل الذين تناولوها بالدراسة مؤكدين على روحها العربية، تقول يمنى العيد : \" إنها أجمل ما كتب ديب في الأدب الروائي الجزائري بل من أجمل الروايات في الأدب الواقعي. أقول العربية لأن الثلاثية وإن توسلت الفرنسية لغة، فهي في المنطق وفي روحية التعبير، رواية عربية. لذا لا أجد أي حرج في تقويمها كواحدة من الروايات العربية\"(30). لقد غاص محمد ديب في الواقع الجزائري رغم اللغة الفرنسية التي لم يكتب إلا بها مؤكداً أنها ليست انتماء لفرنسا. إنها مجرد وسيلة تعبير، استطاع من خلالها تصوير ظروف الجزائر في فترة حالكة من تاريخها تحت وطأة الاستعمار الفرنسي بكل جبروته .", " إن ثلاثية محمد ديب تظل من النصوص الروائية الهامة في الأدب الجزائري، وتظل أيضاً دليلاً على انتمائها لهذا الأدب رغم توظيفها للغة الفرنسية. ويبقى الأدب الجزائري المكتوب بالفرنسية رافداً هاما للثقافة الجزائرية."], "author": "Mohammed Dib", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "Arabic", "publish_date": "1985-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13012359-karingana-ua-karingana", "num_ratings": "11", "num_reviews": "1", "avg_ratings": 4.73, "genres": ["Cultural", "Africa", "Eastern Africa", "Mozambique", "Poetry", "Literature", "African Literature"], "title": "Karingana ua Karingana", "description": ["Poemas de José Craveirinha."], "author": "José Craveirinha", "num_pages": "159", "awards": [], "places": [], "character_names": [], "language": "Portuguese", "publish_date": "1995-08-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2294151.Riwan_ou_le_chemin_de_sable", "num_ratings": "28", "num_reviews": "1", "avg_ratings": 3.71, "genres": ["Western Africa", "Senegal", "Cultural", "Africa", "Literature", "African Literature"], "title": "Riwan ou le chemin de sable", "description": ["Dans un récit bouleversant et puisé aux sources d'un vécu authentique, ce livre raconte des destins croisés de femmes africaines prises dans des relations monogamiques \"modernes\" ou polygamiques \"traditionnelles\". Intellectuelle, \"évoluée\" sans vraiment être heureuse de l'être, malgré de grandes illusions initiales, la Narratrice-Personnage devient la 28ème épouse d'un mar", "Dans un récit bouleversant et puisé aux sources d'un vécu authentique, ce livre raconte des destins croisés de femmes africaines prises dans des relations monogamiques \"modernes\" ou polygamiques \"traditionnelles\". Intellectuelle, \"évoluée\" sans vraiment être heureuse de l'être, malgré de grandes illusions initiales, la Narratrice-Personnage devient la 28ème épouse d'un marabout dont elle s'était d'abord prise d'amitié et qui habite un village quelque part dans le centre du Sénégal. Mariage qui ne sera rompu que par la mort de ce dernier. A travers la quête éperdue du personnage central pour retrouver une identité reconstruite, apaisée et réconciliée avec elle-même, il y a pour la première fois une réflexion lucide et sans complaisance sur le féminisme. Beaucoup de préjugés, d'opinions reçues sur la condition des femmes africaines sont bousculés, disséqués sans pitié. Dans ce Chemin de sable dont l'auteur nous invite à suivre la trace, il y a une réflexion paradoxale et courageuse sur les traditions africaines, sur la polygamie, sur la monogamie, l'aliénation, la séduction, la vie et la mort. Qu'il soit ravi ou offusqué, aucun lecteur ne sort intact de cette lecture, car jamais une romancière africaine n'est allée aussi loin dans l'assomption totale de sa féminité. Que ce livre flamboyant, alerte et sans fioritures, ait pu être écrit par une femme africaine, est déjà en soi un événement."], "author": "Ken Bugul", "num_pages": "230", "awards": ["Grand prix littéraire d'Afrique noire de l'ADELF (1999)"], "places": [], "character_names": [], "language": "French", "publish_date": "1999-08-16 00:00:00", "ISBN": "2708706918"},
{"url": "https://www.goodreads.com/book/show/396933.The_Poor_Christ_of_Bomba", "num_ratings": "204", "num_reviews": "22", "avg_ratings": 3.78, "genres": ["Cultural", "Africa", "Central Africa", "Cameroon", "Fiction", "Literature", "African Literature", "Cultural", "France"], "title": "The Poor Christ of Bomba", "description": ["In Bomba the girls who are being prepared for Christian marriage live together in the women's camp. Gradually it becomes apparent that the local church men have been using the local girls for their own purposes. This novel is a biting critique of colonial life and missionary activity."], "author": "Mongo Beti", "num_pages": "219", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2005-07-29 00:00:00", "ISBN": "1577664183"},
{"url": "https://www.goodreads.com/book/show/152595.The_Fortunes_of_Wangrin", "num_ratings": "161", "num_reviews": "15", "avg_ratings": 3.93, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Mali", "Literature", "African Literature"], "title": "The Fortunes of Wangrin", "description": ["The Fortunes of Wangrin", "Amadou Hampâté Bâ", "Translated by Aina Pavolini Taylor with an Introduction by F. Abiola Irele", "Winner of the Grand Prix Litteraire de l'Afrique Noire", "\"I think this is perhaps the best African novel on colonialism and it draws very richly on various modes of oral literature.\" --Ralph Austen, University of Chicago", "\"It is a wonderful introduction to colonial", "The Fortunes of Wangrin", "Amadou Hampâté Bâ", "Translated by Aina Pavolini Taylor with an Introduction by F. Abiola Irele", "Winner of the Grand Prix Litteraire de l'Afrique Noire", "\"I think this is perhaps the best African novel on colonialism and it draws very richly on various modes of oral literature.\" --Ralph Austen, University of Chicago", "\"It is a wonderful introduction to colonial rule as experienced by Africans, and in particular, to the rule of African middlemen.\" --Martin A. Klein, University of Toronto", "\"The Fortunes of Wangrin is not only a wonderful novel by one of Africa's most renowned intellectuals, it is also literally filled with information about French colonization and its impact on traditional African societies, African resistance and collaboration to colonization, the impact of French education in Africa, and a host of other subjects of interest.\" --Francois Manchuelle, New York University", "Wangrin is a rogue and an operator, hustling both the colonial French and his own people. He is funny, outrageous, corrupt, traditional, and memorable. Ba's book bridges the chasm between oral and written literature. The stories about Wangrin are drawn from oral sources, but in the hands of this gifted writer these materials become transformed through the power of artistic imagination and license.", "The Fortunes of Wangrin is a classic in Franchophone African literature.", "Amadou Hampate Ba was a distinguished Malian poet and scholar of African oral tradition and precolonial history.", "Aina Pavolini Taylor is an independent translator with wide experience of Africa, now living and working in Italy.", "F. Abiola Irele is a professor in the Department of Black Studies at Ohio State University."], "author": "Amadou Hampâté Bâ", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-03-01 00:00:00", "ISBN": "025321226X"},
{"url": "https://www.goodreads.com/book/show/4909286-stories-from-a-shona-childhood", "num_ratings": "10", "num_reviews": "3", "avg_ratings": 3.6, "genres": ["Cultural", "Africa"], "title": "Stories from a Shona Childhood", "author": "Charles Mungoshi", "num_pages": "55", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-01-01 00:00:00", "ISBN": "0908311133"},
{"url": "https://www.goodreads.com/book/show/21410927-adventures-of-a-breath", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "Adventures of a Breath", "author": "Hayam Abbas Al-Homi", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/74700.Fantasia", "num_ratings": "757", "num_reviews": "76", "avg_ratings": 3.66, "genres": ["Fiction", "Cultural", "Africa", "Northern Africa", "Algeria", "Cultural", "France", "Historical", "Historical Fiction", "Literature"], "title": "Fantasia: An Algerian Cavalcade", "description": ["In this stunning novel, Assia Djebar intertwines the history of her native Algeria with episodes from the life of a young girl in a story stretching from the French conquest in 1830 to the War of Liberation of the 1950s. The girl, growing up in the old Roman coastal town of Cherchel, sees her life in contrast to that of a neighboring French family, and yearns for more than", "In this stunning novel, Assia Djebar intertwines the history of her native Algeria with episodes from the life of a young girl in a story stretching from the French conquest in 1830 to the War of Liberation of the 1950s. The girl, growing up in the old Roman coastal town of Cherchel, sees her life in contrast to that of a neighboring French family, and yearns for more than law and tradition allow her to experience. Headstrong and passionate, she escapes from the cloistered life of her family to join her brother in the maquis' fight against French domination. Djebar's exceptional descriptive powers bring to life the experiences of girls and women caught up in the dual struggle for independence--both their own and Algeria's."], "author": "Assia Djebar", "num_pages": "227", "awards": [], "places": ["Algeria"], "character_names": [], "language": "English", "publish_date": "1996-07-20 00:00:00", "ISBN": "0704326108"},
{"url": "https://www.goodreads.com/book/show/1156023.Ghana", "num_ratings": "104", "num_reviews": "11", "avg_ratings": 4.08, "genres": ["Cultural", "Africa", "Western Africa", "Ghana", "Biography", "Biography", "Autobiography", "History", "Politics", "Nonfiction"], "title": "Ghana: The Autobiography of Kwame Nkrumah", "description": ["A personal account of the African liberation struggle, this book was first published on March 6, 1957, to mark the day of Ghana's Independence, a day which signalled the launching of the wider Pan-African struggle for the liberation of the entire African continent. As the leader of the movement for independence, Nkrumah provides an illuminating discussion of the problems a", "A personal account of the African liberation struggle, this book was first published on March 6, 1957, to mark the day of Ghana's Independence, a day which signalled the launching of the wider Pan-African struggle for the liberation of the entire African continent. As the leader of the movement for independence, Nkrumah provides an illuminating discussion of the problems and conflicts along the way to political freedom, and the new prospects beyond. This book is essential for understanding the genesis of the African Revolution and the maturing of one of its outstanding leaders."], "author": "Kwame Nkrumah", "num_pages": "256", "awards": [], "places": ["Ghana"], "character_names": ["Kwame Nkrumah"], "language": "English", "publish_date": "2001-01-28 00:00:00", "ISBN": "0717802949"},
{"url": "https://www.goodreads.com/book/show/63675.Country_of_My_Skull", "num_ratings": "2,297", "num_reviews": "183", "avg_ratings": 4.09, "genres": ["Nonfiction", "Cultural", "Africa", "Southern Africa", "South Africa", "History", "Politics", "Autobiography", "Memoir"], "title": "Country of My Skull: Guilt, Sorrow, and the Limits of Forgiveness in the New South Africa", "description": ["Ever since Nelson Mandela dramatically walked out of prison in 1990 after twenty-seven years behind bars, South Africa has been undergoing a radical transformation. In one of the most miraculous events of the century, the oppressive system of apartheid was dismantled. Repressive laws mandating separation of the races were thrown out. The country, which had been carved into", "Ever since Nelson Mandela dramatically walked out of prison in 1990 after twenty-seven years behind bars, South Africa has been undergoing a radical transformation. In one of the most miraculous events of the century, the oppressive system of apartheid was dismantled. Repressive laws mandating separation of the races were thrown out. The country, which had been carved into a crazy quilt that reserved the most prosperous areas for whites and the most desolate and backward for blacks, was reunited. The dreaded and dangerous security force, which for years had systematically tortured, spied upon, and harassed people of color and their white supporters, was dismantled. But how could this country--one of spectacular beauty and promise--come to terms with its ugly past? How could its people, whom the oppressive white government had pitted against one another, live side by side as friends and neighbors?", "To begin the healing process, Nelson Mandela created the Truth and Reconciliation Commission, headed by the renowned cleric Archbishop Desmond Tutu. Established in 1995, the commission faced the awesome task of hearing the testimony of the victims of apartheid as well as the oppressors. Amnesty was granted to those who offered a full confession of any crimes associated with apartheid. Since the commission began its work, it has been the central player in a drama that has riveted the country. In this book, Antjie Krog, a South African journalist and poet who has covered the work of the commission, recounts the drama, the horrors, the wrenching personal stories of the victims and their families. Through the testimonies of victims of abuse and violence, from the appearance of Winnie Mandela to former South African president P. W. Botha's extraordinary courthouse press conference, this award-winning poet leads us on an amazing journey.", " captures the complexity of the Truth Commission's work. The narrative is often traumatic, vivid, and provocative. Krog's powerful prose lures the reader actively and inventively through a mosaic of insights, impressions, and secret themes. This compelling tale is Antjie Krog's profound literary account of the mending of a country that was in colossal need of change."], "author": "Antjie Krog", "num_pages": "432", "awards": ["Alan Paton Award (1999)"], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "2000-08-08 00:00:00", "ISBN": "0812931297"},
{"url": "https://www.goodreads.com/book/show/21411001-al-mawt-ala-al-asfalt", "num_ratings": "0", "num_reviews": "0", "avg_ratings": 0.0, "genres": [], "title": "al-Mawt `ala al-asfalt", "author": "ʻAbd al-Raḥmān Abnūdī", "awards": [], "places": [], "character_names": [], "language": null},
{"url": "https://www.goodreads.com/book/show/1159190.Sosu_s_Call", "num_ratings": "67", "num_reviews": "21", "avg_ratings": 4.04, "genres": ["Cultural", "Africa", "Childrens", "Picture Books", "Western Africa", "Ghana", "Cultural", "International", "Disability"], "title": "Sosu's Call", "description": ["Winner of the 1999 UNESCO prize and IBBY's Outstanding Books for Young People with Disabilities award, Sosu's Call by Ghanaian author/illustrator Meshack Asare is a story of heroism and resolve. Sosu is all alone in his family's compound when disaster strikes. The waters are rising, and most of the people of the village are in the fields. The only ones left are the very ol", "Winner of the 1999 UNESCO prize and IBBY's Outstanding Books for Young People with Disabilities award, Sosu's Call by Ghanaian author/illustrator Meshack Asare is a story of heroism and resolve. Sosu is all alone in his family's compound when disaster strikes. The waters are rising, and most of the people of the village are in the fields. The only ones left are the very old and the very young. And Sosu, who cannot walk. Somehow he manages to make his way through the rising waters up the hill to the drum shed, where he sounds the alarm and saves the village.A book about differences, about acceptance, about what it means to be normal. A book about the people and the lives that take place on the other side of the world, and in our own backyard."], "author": "Meshack Asare", "num_pages": "37", "awards": [], "places": ["Ghana", "West Africa"], "character_names": [], "language": "English", "publish_date": "2002-03-01 00:00:00", "ISBN": "1929132212"},
{"url": "https://www.goodreads.com/book/show/509216.Down_Second_Avenue", "num_ratings": "245", "num_reviews": "35", "avg_ratings": 3.73, "genres": ["Cultural", "Africa", "Nonfiction", "Southern Africa", "South Africa"], "title": "Down Second Avenue: Growing Up in a South African Ghetto", "description": ["   ", " Nominated for the Nobel Prize in 1969, Es’kia Mphahlele is considered the Dean of African Letters and the father of black South African writing. ", " is a landmark book that describes Mphahlele’s experience growing up in segregated South Afr", "   ", " Nominated for the Nobel Prize in 1969, Es’kia Mphahlele is considered the Dean of African Letters and the father of black South African writing. ", " is a landmark book that describes Mphahlele’s experience growing up in segregated South Africa. Vivid, graceful, and unapologetic, it details a daily life of severe poverty and brutal police surveillance under the subjugation of an apartheid regime. Banned in South Africa after its original 1959 publication for its protest against apartheid, ", " is a foundational work of literature that continues to inspire activists today. "], "author": "Ezekiel Mphahlele", "num_pages": "222", "awards": [], "places": ["South Africa"], "character_names": [], "language": "English", "publish_date": "1990-01-01 00:00:00", "ISBN": "084464451X"},
{"url": "https://www.goodreads.com/book/show/822751.The_Colonizer_and_the_Colonized", "num_ratings": "914", "num_reviews": "60", "avg_ratings": 4.12, "genres": ["Nonfiction", "History", "Politics", "Philosophy", "Cultural", "Africa", "Race"], "title": "The Colonizer and the Colonized", "description": ["First published in English in 1965, this timeless classic explores the psychological effects of colonialism on colonized and colonizers alike."], "author": "Albert Memmi", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-07-08 00:00:00", "ISBN": "0807003018"},
{"url": "https://www.goodreads.com/book/show/1419087.The_Soul_Of_The_White_Ant", "num_ratings": "136", "num_reviews": "16", "avg_ratings": 4.35, "genres": ["Nonfiction", "Science", "Cultural", "Africa", "Animals", "Science", "Natural History"], "title": "The Soul Of The White Ant", "description": ["THE SOUL OF THE WHITE ANT by Eugène Marais is a passionate, insightful account into the world of termites. It is a meticulously researched expose of their complex, highly structured community life. Originally translated into English in 1937, the quality of research remains as relevant today as it was when it was first published. This illuminating account will not only appe", "THE SOUL OF THE WHITE ANT by Eugène Marais is a passionate, insightful account into the world of termites. It is a meticulously researched expose of their complex, highly structured community life. Originally translated into English in 1937, the quality of research remains as relevant today as it was when it was first published. This illuminating account will not only appeal to those with a scientific interest in termites, but will similarly enthrall readers who are new to their captivating world. An exceptional feature of his detailed research is the extraordinary psychological life of the termite. ", "While the studies are based in South Africa, the extensive research includes the termites of Magnetic Island, Australia. You will be taken on an exciting journey into the amazing life of termites, as their astonishing world of hierarchy and roles within their community is revealed in captivating detail. ", "His years of unceasing work on the veld led Eugène Marais to formulate his theory that the termite nest is similar in every respect to the organism of an animal. He observed that the workers and soldiers resemble red and white blood cells, while the fungus gardens are the digestive organ. The queen functions as the brain, controlling the collective mind, and the sexual flight of the kings and queens is similar in every aspect to the escape of spermatozoa and ova."], "author": "Eugène N. Marais", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1970-09-24 00:00:00", "ISBN": "0140036229"},
{"url": "https://www.goodreads.com/book/show/66422.Citizen_and_Subject", "num_ratings": "189", "num_reviews": "8", "avg_ratings": 4.13, "genres": ["Cultural", "Africa", "History", "Nonfiction", "Politics", "Literature", "Post Colonial"], "title": "Citizen and Subject: Contemporary Africa and the Legacy of Late Colonialism", "description": ["In this provocative analysis of the obstacles to democratization in post-independence Africa, Mahmood Mandani offers a bold, insightful account of colonialism's legacy: a bifurcated power that mediated racial domination through tribally organized local authorities, reproducing racial identity in citizens and ethnic identity in subjects. By tapping authoritarian possibiliti", "In this provocative analysis of the obstacles to democratization in post-independence Africa, Mahmood Mandani offers a bold, insightful account of colonialism's legacy: a bifurcated power that mediated racial domination through tribally organized local authorities, reproducing racial identity in citizens and ethnic identity in subjects. By tapping authoritarian possibilities in culture, and by giving culture an authoritative bent, British indirect rule (decentralized despotism) set the pace for Africa; other colonial powers followed suit, South Africa being the last. Apartheid, Mamdani maintains, was actually the generic form of the colonial state in Africa."], "author": "Mahmood Mamdani", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-04-21 00:00:00", "ISBN": "0691027935"},
{"url": "https://www.goodreads.com/book/show/625893.The_African_Origin_of_Civilization", "num_ratings": "1,015", "num_reviews": "43", "avg_ratings": 4.53, "genres": ["History", "Cultural", "Africa", "Nonfiction", "Anthropology", "History", "Ancient History"], "title": "The African Origin of Civilization: Myth or Reality", "description": ["Now in its 30th printing, this classic presents historical, archaeological, and anthropological evidence to support the theory that ancient Egypt was a black civilization.", "N.B", " (translation of sections of Antériorité des civilisations négres and Nations nègres et culture)"], "author": "Cheikh Anta Diop", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-07-01 00:00:00", "ISBN": "1556520727"},
{"url": "https://www.goodreads.com/book/show/989504.Nedjma", "num_ratings": "371", "num_reviews": "36", "avg_ratings": 3.64, "genres": ["Fiction", "Cultural", "Africa", "Northern Africa", "Algeria", "Cultural", "France"], "title": "Nedjma", "description": ["Nedjma is a masterpiece of North African writing. Its intricate plot involves four men in love with the beautiful woman whose name serves as the title of the novel. Nedjma is the central figure of this disorienting novel, but more than the unfortunate wife of a man she does not love, more than the unwilling cause of rivalry among many suitors, Nedjma is the symbol of Alger", "Nedjma is a masterpiece of North African writing. Its intricate plot involves four men in love with the beautiful woman whose name serves as the title of the novel. Nedjma is the central figure of this disorienting novel, but more than the unfortunate wife of a man she does not love, more than the unwilling cause of rivalry among many suitors, Nedjma is the symbol of Algeria. Kateb has crafted a novel that is the saga of the founding ancestors of Algeria through the conquest of Numidia by the Romans, the expansion of the Ottoman Empire, and French colonial conquest. Nedjma is symbolic of the rich and sometimes bloody past of Algeria, of its passions, of its tenderness; it is the epic story of a human quest for freedom and happiness."], "author": "Yacine Kateb", "num_pages": "388", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1991-08-29 00:00:00", "ISBN": "0813913136"},
{"url": "https://www.goodreads.com/book/show/857005.The_Beggars_Strike", "num_ratings": "231", "num_reviews": "23", "avg_ratings": 3.83, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Senegal", "Literature", "African Literature", "Cultural", "France", "Africa", "Western Africa"], "title": "The Beggars' Strike", "description": ["The sight of disease-ridden beggars in the streets is giving the town a bad name, and the tourists are starting to stay away. If the Director of Public Health and Hygiene can get rid of them he will have done a great service to the health and economy of the nation - not to mention his own promotion prospects. A plan of military precision is put into action to rid the stree", "The sight of disease-ridden beggars in the streets is giving the town a bad name, and the tourists are starting to stay away. If the Director of Public Health and Hygiene can get rid of them he will have done a great service to the health and economy of the nation - not to mention his own promotion prospects. A plan of military precision is put into action to rid the streets of these verminous scroungers.", "But the beggars are organized, too.", "They know that giving alms is a divine obligation and that Allah's good will is vital to worldly promotion. So when the beggars withdraw their charitable service, the pious city civil servants and businessmen start to panic. "], "author": "Aminata Sow Fall", "num_pages": "104", "awards": ["Grand prix littéraire d'Afrique noire de l'ADELF (1980)"], "places": ["Senegal"], "character_names": [], "language": "English", "publish_date": "1986-12-28 00:00:00", "ISBN": "0582002435"},
{"url": "https://www.goodreads.com/book/show/545399.Indaba_My_Children", "num_ratings": "199", "num_reviews": "20", "avg_ratings": 4.45, "genres": ["Cultural", "Africa", "Nonfiction", "History", "Religion", "Fantasy", "Mythology", "Folklore"], "title": "Indaba My Children", "description": ["As a young man, Vusamazulu Credo Mutwa, a Zulu from the South African province of Natal, was determined to follow in the footsteps of his grandfather and become a tribal historian in order to keep the rich oral tradition of his culture alive. In this book, begun in response to the injustices against Africans and their culture, he sets these legends down in writing. He begi", "As a young man, Vusamazulu Credo Mutwa, a Zulu from the South African province of Natal, was determined to follow in the footsteps of his grandfather and become a tribal historian in order to keep the rich oral tradition of his culture alive. In this book, begun in response to the injustices against Africans and their culture, he sets these legends down in writing. He begins with the creation myth, when Ninavanhu-Ma, the Great Mother, created the human race. From there, an epic unfolds, an intricate and vivid cultural tapestry populated by gods and mortals, cattle herders and supreme kings, witch doctors, lovers, grave diggers, warriors, and handmaidens. The story continues all the way up to the colonial era, when a Portuguese Kapitanoh and his crew arrive on the African shore. Indaba, My Children is a classic and indispensable resource for anyone interested in the cultural life of Africa and the human experience as it is filtered into myth."], "author": "Vusamazulu Credo Mutwa", "num_pages": "696", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-08-16 00:00:00", "ISBN": "0862417589"},
{"url": "https://www.goodreads.com/book/show/159334.Devil_on_the_Cross", "num_ratings": "1,016", "num_reviews": "86", "avg_ratings": 3.89, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Novels", "Eastern Africa", "Kenya", "Literature"], "title": "Devil on the Cross", "description": ["This remarkable and symbolic novel centers on Wariinga's tragedy and uses it to tell a story of contemporary Kenya."], "author": "Ngũgĩ wa Thiong'o", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-10-23 00:00:00", "ISBN": "0435908448"},
{"url": "https://www.goodreads.com/book/show/2282466.Soundjata_ou_L_pop_e_mandingue_Djibril_Tamsir_Niane", "num_ratings": "1,858", "num_reviews": "143", "avg_ratings": 3.6, "genres": ["Cultural", "Africa", "History", "Classics", "Fantasy", "Mythology", "Academic", "School", "Literature"], "title": "Soundjata, ou, L'épopée mandingue / Djibril Tamsir Niane", "description": ["Retold by generations of griots - the guardians of African culture - this oral tradition has been handed down from the thirteenth century and captures all the mystery and majesty of medieval African kingship. It is an epic - part history, part legend - and a great adventure story."], "author": "Djibril Tamsir Niane", "num_pages": "153", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2000-01-01 00:00:00", "ISBN": "2708700782"},
{"url": "https://www.goodreads.com/book/show/1101837.Chaka", "num_ratings": "332", "num_reviews": "40", "avg_ratings": 3.7, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "Lesotho", "Historical", "Historical Fiction"], "title": "Chaka", "description": ["Tells the classic story of the Zulu hero Chaka."], "author": "Thomas Mofolo", "num_pages": "168", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1983-01-01 00:00:00", "ISBN": "0435902296"},
{"url": "https://www.goodreads.com/book/show/1200940.The_Last_Will_Testament_of_Senhor_da_Silva_Ara_jo", "num_ratings": "254", "num_reviews": "40", "avg_ratings": 3.55, "genres": ["Western Africa", "Cabo Verde", "Fiction", "Cultural", "Africa", "Literature", "African Literature"], "title": "The Last Will & Testament of Senhor da Silva Araújo", "description": [" Everyone in Cape Verde knows Señor da Silva. Successful entrepreneur, owner of the island's first automobile, a most serious, upright, and self-made businessman, Señor da Silva is the local", " Everyone in Cape Verde knows Señor da Silva. Successful entrepreneur, owner of the island's first automobile, a most serious, upright, and self-made businessman, Señor da Silva is the local success story. Born an orphan, he never married, he never splurged; one good suit was good enough for him; and he never wandered from the straight and narrow. "], "author": "Germano Almeida", "num_pages": "152", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-07-17 00:00:00", "ISBN": "0811215652"},
{"url": "https://www.goodreads.com/book/show/420464.Butterfly_Burning", "num_ratings": "372", "num_reviews": "39", "avg_ratings": 3.69, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Zimbabwe", "Literature", "African Literature", "Feminism", "Womens"], "title": "Butterfly Burning", "description": [" brings the brilliantly poetic voice of Zimbabwean writer Yvonne Vera to American readers for the first time. Set in Makokoba, a black township, in the late 1940s, the novel is an intensely bittersweet love story. When Fumbatha, a construction worker, meets the much younger Phephelaphi, he\"wants her like the land beneath his feet from which birth had sever", " brings the brilliantly poetic voice of Zimbabwean writer Yvonne Vera to American readers for the first time. Set in Makokoba, a black township, in the late 1940s, the novel is an intensely bittersweet love story. When Fumbatha, a construction worker, meets the much younger Phephelaphi, he\"wants her like the land beneath his feet from which birth had severed him.\" He in turn fills her \"with hope larger than memory.\" But Phephelaphi is not satisfied with their \"one-room\" love alone. The qualities that drew Fumbatha to her, her sense of independence and freedom, end up separating them. And the closely woven fabric of township life, where everyone knows everyone else, has a mesh too tight and too intricate to allow her to escape her circumstances on her own.", "Vera exploits language to peel away the skin of public and private lives. In ", " she captures the ebullience and the bitterness of township life, as well as the strength and courage of her unforgettable heroine."], "author": "Yvonne Vera", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-12 00:00:00", "ISBN": "0374291861"},
{"url": "https://www.goodreads.com/book/show/17347680-forest-of-a-thousand-daemons", "num_ratings": "139", "num_reviews": "18", "avg_ratings": 4.02, "genres": ["Western Africa", "Nigeria", "Cultural", "Africa", "Fantasy", "Classics", "Literature", "African Literature", "Fiction"], "title": "Forest of a Thousand Daemons: A Hunter's Saga", "description": ["\"His total conviction in multiple existences within our physical world is as much an inspiration to some of the most brilliant fiction in Yoruba writing as it is a deeply felt urge to 'justify the ways of God to man.'\"—", ", translator and Nobel Laureate", "A classic work of African literature, ", " is the first novel to be written in the Yoruba", "\"His total conviction in multiple existences within our physical world is as much an inspiration to some of the most brilliant fiction in Yoruba writing as it is a deeply felt urge to 'justify the ways of God to man.'\"—", ", translator and Nobel Laureate", "A classic work of African literature, ", " is the first novel to be written in the Yoruba language. First published in Nigeria in 1939, it is one of that country's most revered and widely read works, and its influence on Nigerian literature is profound, most notably in the works of Amos Tutuola.", "A triumph of the mythic imagination, the narrative unfolds in a landscape where, true to Yoruba cosmology, human, natural, and supernatural beings are compellingly and wonderfully alive at once: a world of warriors, sages and kings; magical trees and snake people; spirits, Ghommids, and bog-trolls. Here are the adventures of Akara-ogun—son of a brave warrior and wicked witch—as he journeys into the forest, encountering and dealing with all-too-real unforeseen forces, engaging in dynamic spiritual and moral relationships with personifications of his fate, projections of the terrors that haunt man.", "Distinguished Nobel Prize–winning author Wole Soyinka offers a supple and elegant translation and provides an essay on the special challenges of translating Fagunwa from the Yoruba into English, along with a glossary of Yoruba and unfamiliar words.", "With illustrations by acclaimed Nigerian printmaker Bruce Onobrakpeya.", "Daniel Orowole Fagunwa was born in western Nigeria in 1903. He died in a motorcycle accident in 1963.", "“A deep tale of the spirit; a classic of the African imagination.”—", "\"Fagunwa is as important to the Nigerian imagination as Grimm’s tales to the Western imagination. Except that Fagunwa’s book is not a collection of oral tales, but an original modern novel, one that sets out to test the limits of the form of the novel, the range of myth and its overlap into daily life. Soyinka offers us not a simple translation but a complex and truly respectful re-rendering. With this tender touch by Soyinka, Fagunwa’s book comes alive - reanimated in this new language. Beautiful, important and endlessly fascinating. A must read.\"—", ", author of ", " and ", "\"The work of Fagunwa stands at the head of creative writing in the Yorùbá language and exerts the most pervasive influence on every category of Yorùbá literary expression. . . . He responded early to the need for a literature in the vernacular, at a moment when a new cultural consciousness began to emerge out of changing social conditions.”—", " scholar of African literature", "“Among the Africans who deserve some kind of secular sainthood is Wole Soyinka.”", "“Mr. Onobrakpeya . . . is one of the best known and most prolific African printmakers.”—"], "author": "D.O. Fagunwa", "num_pages": "153", "awards": ["Premio Grinzane Cavour Nominee for Narrativa Straniera (1986)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "0872866300"},
{"url": "https://www.goodreads.com/book/show/526927.Burger_s_Daughter", "num_ratings": "1,560", "num_reviews": "140", "avg_ratings": 3.55, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa"], "title": "Burger's Daughter", "description": ["As a depiction of South Africa, this novel is more revealing than a thousand news dispatches as it tells the story of a young woman cast in the role of a young revolutionary, trying to uphold a heritage handed on by martyred parents while carving out a sense of self."], "author": "Nadine Gordimer", "num_pages": "361", "awards": [], "places": ["South Africa", "France"], "character_names": [], "language": "English", "publish_date": "1980-11-20 00:00:00", "ISBN": "0140055932"},
{"url": "https://www.goodreads.com/book/show/123773.The_Dark_Child", "num_ratings": "1,291", "num_reviews": "104", "avg_ratings": 3.65, "genres": ["Cultural", "Africa", "Nonfiction", "Cultural", "France", "Autobiography", "Memoir"], "title": "The Dark Child", "author": "Camara Laye", "num_pages": "192", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1954-01-01 00:00:00", "ISBN": "080901548X"},
{"url": "https://www.goodreads.com/book/show/37774.Arrow_of_God", "num_ratings": "3,965", "num_reviews": "302", "avg_ratings": 3.81, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Classics", "Western Africa", "Nigeria", "Historical", "Historical Fiction", "Literature", "Novels", "Literature", "20th Century", "Literary Fiction"], "title": "Arrow of God", "description": ["Set in the Igbo heartland of eastern Nigeria, one of Africa's best-known writers describes the conflict between old and new in its most poignant aspect: the personal struggle between father and son.", "Ezeulu, the headstrong chief priest of the god Ulu, is worshipped by the six villages of Umuaro. But his authority is increasingly under threat—from rivals within his tribe, fro", "Set in the Igbo heartland of eastern Nigeria, one of Africa's best-known writers describes the conflict between old and new in its most poignant aspect: the personal struggle between father and son.", "Ezeulu, the headstrong chief priest of the god Ulu, is worshipped by the six villages of Umuaro. But his authority is increasingly under threat—from rivals within his tribe, from functionaries of the colonial government, and even from his own family members. Yet he believes himself to be untouchable: surely he is an arrow in the bow of his God? Armed with this belief, he is prepared to lead his people, even if it is towards their own destruction. But his people will not be dominated so easily.", "Spare and powerful, Arrow of God is an unforgettable portrayal of the loss of faith, and the downfall of a man in a society forever altered by colonialism."], "author": "Chinua Achebe", "num_pages": "230", "awards": ["Jock Campbell-New Statesman Award (1965)"], "places": ["Nigeria"], "character_names": ["Ezeulu", "Obika", "Oduche"], "language": "English", "publish_date": "1989-01-01 00:00:00", "ISBN": "0385014805"},
{"url": "https://www.goodreads.com/book/show/383997.Abyssinian_Chronicles", "num_ratings": "610", "num_reviews": "51", "avg_ratings": 3.55, "genres": ["Cultural", "Africa", "Fiction", "Eastern Africa", "Uganda", "Literature"], "title": "Abyssinian Chronicles", "description": ["Like Salman Rushdie's ", "and Gabriel Garcia Marquez's ", ", Moses Isegawa's ", " tells a riveting story of twentieth-century Africa that is passionate in vision and breathtaking in scope.", "At the center of this unforgettable tale is Mugezi, a young man who manages to make it through the hellish reign of Idi Amin and", "Like Salman Rushdie's ", "and Gabriel Garcia Marquez's ", ", Moses Isegawa's ", " tells a riveting story of twentieth-century Africa that is passionate in vision and breathtaking in scope.", "At the center of this unforgettable tale is Mugezi, a young man who manages to make it through the hellish reign of Idi Amin and experiences firsthand the most crushing aspects of Ugandan society: he withstands his distant father's oppression and his mother's cruelty in the name of Catholic zeal, endures the ravages of war, rape, poverty, and AIDS, and yet he is able to keep a hopeful and even occasionally amusing outlook on life. Mugezi's hard-won observations form a cri de coeur for a people shaped by untold losses."], "author": "Moses Isegawa", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-11-13 00:00:00", "ISBN": "0375705775"},
{"url": "https://www.goodreads.com/book/show/944103.The_Palm_Wine_Drinkard", "num_ratings": "1,586", "num_reviews": "159", "avg_ratings": 3.86, "genres": ["Fiction", "Cultural", "Africa", "Fantasy", "Western Africa", "Nigeria", "Literature", "African Literature"], "title": "The Palm-Wine Drinkard", "description": ["When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African (Nigeria) Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages", "When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African (Nigeria) Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages and has come to be regarded as a masterwork of one of Africa's most influential writers."], "author": "Amos Tutuola", "num_pages": "125", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1977-08-16 00:00:00", "ISBN": "0571049966"},
{"url": "https://www.goodreads.com/book/show/210722.The_Joys_of_Motherhood", "num_ratings": "3,782", "num_reviews": "282", "avg_ratings": 4.06, "genres": ["Fiction", "Cultural", "Africa", "Literature", "African Literature", "Western Africa", "Nigeria", "Feminism"], "title": "The Joys of Motherhood", "description": ["Nnu Ego is a woman who gives all her energy, money and everything she has to raising her children - leaving her little time to make friends."], "author": "Buchi Emecheta", "num_pages": "224", "awards": [], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1994-02-04 00:00:00", "ISBN": "043590972X"},
{"url": "https://www.goodreads.com/book/show/264587.The_Beautyful_Ones_Are_Not_Yet_Born", "num_ratings": "2,122", "num_reviews": "150", "avg_ratings": 3.91, "genres": ["Cultural", "Africa", "Fiction", "Western Africa", "Ghana", "Literature", "African Literature", "Historical", "Historical Fiction"], "title": "The Beautyful Ones Are Not Yet Born", "description": ["A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after i", "A railway freight clerk in Ghana attempts to hold out against the pressures that impel him toward corruption in both his family and his country. ", " is the novel that catapulted Ayi Kwei Armah into the limelight. The novel is generally a satirical attack on the Ghanaian society during Kwame Nkrumah’s regime and the period immediately after independence in the 1960s. It is often claimed to rank with \"Things Fall Apart\" as one of the high points of post-colonial African Literature. ", "A quote from Chapter 6: ", "\"And where is my solid ground these days? Let us say just that the cycle from birth to decay has been short. Short, brief. But otherwise not at all unusual. And even in the decline into the end there are things that remind the longing mind of old beginnings and hold out the promise of new ones, things even like your despair itself. I have heard this pain before, only then it was multiplied many, many times, but that may only be because at that time I was not so alone, so far apart. Maybe there are other lonely voices despairing now. I will not be entranced by the voice, even if it should swell as it did in the days of hope. I will not be entranced, since I have seen the destruction of the promises it made. But I shall not resist it either. I will be like a cork. It is so surprising, is it not, how even the worst happenings of the past acquire a sweetness in the memory. Old harsh distresses are now merely pictures and tastes which hurt no more, like itching scars which can only give pleasure now. Strange, because when I can think soberly about it all, with out pushing any later joys into the deepr past, I can remember that things were terrible then. When the war was over the soldiers came back to homes broken in their absence and they themselves brought murder in their hearts and gave it to those nearest them. I saw it, not very clearly, because I had no way of understanding it, but it frightened me. We had gone on marches of victory and I do not think there was anyone mean enough in spirit to ask whether we knew what we were celebrating. Whose victory? Ours? It did not matter. We marched, and only a dishonest fool will look back on his boyhood and say he knew even then that there was no meaning in any of it. It is so funny now, to remember that we all thought we were welcoming victory. Or perhaps there is nothing funny here at all, and it is only that victory itself happens to be the identical twin of defeat. \""], "author": "Ayi Kwei Armah", "num_pages": "191", "awards": [], "places": ["Ghana"], "character_names": [], "language": "English", "publish_date": "1989-10-23 00:00:00", "ISBN": "0435905406"},
{"url": "https://www.goodreads.com/book/show/159604.Woman_at_Point_Zero", "num_ratings": "7,188", "num_reviews": "1,005", "avg_ratings": 3.99, "genres": ["Feminism", "Fiction", "Northern Africa", "Egypt", "Cultural", "Africa"], "title": "Woman at Point Zero", "description": ["From her prison cell, Firdaus, sentenced to die for having killed a pimp in a Cairo street, tells of her life from village childhood to city prostitute. Society's retribution for her act of defiance - death - she welcomes as the only way she can finally be free."], "author": "Nawal El-Saadawi", "num_pages": "112", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "1997-09-15 00:00:00", "ISBN": "0862321107"},
{"url": "https://www.goodreads.com/book/show/2567.Ak_", "num_ratings": "1,227", "num_reviews": "90", "avg_ratings": 3.92, "genres": ["Cultural", "Africa", "Nonfiction", "Western Africa", "Nigeria", "Autobiography", "Memoir", "Literature", "African Literature"], "title": "Aké: The Years of Childhood", "description": ["A dazzling memoir of an African childhood from Nobel Prize-winning Nigerian novelist, playwright, and poet Wole Soyinka. ", "\"Aké: The Years of Childhood\" gives us the story of Soyinka's boyhood before and during World War II in a Yoruba village in western Nigeria called Aké. A relentlessly curious child who loved books and getting into trouble, Soyinka grew up on a parsonage", "A dazzling memoir of an African childhood from Nobel Prize-winning Nigerian novelist, playwright, and poet Wole Soyinka. ", "\"Aké: The Years of Childhood\" gives us the story of Soyinka's boyhood before and during World War II in a Yoruba village in western Nigeria called Aké. A relentlessly curious child who loved books and getting into trouble, Soyinka grew up on a parsonage compound, raised by Christian parents and by a grandfather who introduced him to Yoruba spiritual traditions. His vivid evocation of the colorful sights, sounds, and aromas of the world that shaped him is both lyrically beautiful and laced with humor and the sheer delight of a child's-eye view.", "A classic of African autobiography, \"Aké\" is also a transcendantly timeless portrait of the mysteries of childhood."], "author": "Wole Soyinka", "num_pages": "230", "awards": ["Anisfield-Wolf Book Award (1983)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1989-10-23 00:00:00", "ISBN": "0679725407"},
{"url": "https://www.goodreads.com/book/show/65249.A_Dry_White_Season", "num_ratings": "2,976", "num_reviews": "184", "avg_ratings": 4.04, "genres": ["Cultural", "Africa", "Fiction", "Southern Africa", "South Africa", "Historical", "Historical Fiction"], "title": "A Dry White Season", "description": ["As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple", "As startling and powerful as when first published more than two decades ago, André Brink's classic novel, ", ", is an unflinching and unforgettable look at racial intolerance, the human condition, and the heavy price of morality.", "Ben Du Toit is a white schoolteacher in suburban Johannesburg in a dark time of intolerance and state-sanctioned apartheid. A simple, apolitical man, he believes in the essential fairness of the South African government and its policies—until the sudden arrest and subsequent \"suicide\" of a black janitor from Du Toit's school. Haunted by new questions and desperate to believe that the man's death was a tragic accident, Du Toit undertakes an investigation into the terrible affair—a quest for the truth that will have devastating consequences for the teacher and his family, as it draws him into a lethal morass of lies, corruption, and murder."], "author": "André Brink", "num_pages": "316", "awards": ["Prix Médicis Etranger (1980)"], "places": ["Johannesburg"], "character_names": [], "language": "English", "publish_date": "2006-09-19 00:00:00", "ISBN": "0061138630"},
{"url": "https://www.goodreads.com/book/show/123748.God_s_Bits_of_Wood", "num_ratings": "2,062", "num_reviews": "117", "avg_ratings": 3.92, "genres": ["Cultural", "Africa", "Fiction", "Historical", "Historical Fiction", "Western Africa", "Senegal"], "title": "God's Bits of Wood", "description": ["In 1947-48 the workers on the Dakar-Niger railway staged a strike. In this vivid, timeless novel, Ousmane Sembène envinces the color, passion, and tragedy of those formative years in the history of West Africa."], "author": "Ousmane Sembène", "num_pages": "252", "awards": [], "places": ["Senegal"], "character_names": [], "language": "English", "publish_date": "2008-08-11 00:00:00", "ISBN": "0435909592"},
{"url": "https://www.goodreads.com/book/show/101094.The_Famished_Road", "num_ratings": "9,613", "num_reviews": "658", "avg_ratings": 3.73, "genres": ["Fiction", "Cultural", "Africa", "Magical Realism", "Fantasy", "Western Africa", "Nigeria", "Novels", "Literature", "African Literature", "Literary Fiction", "Literature", "20th Century", "Classics"], "title": "The Famished Road", "description": ["In the decade since it won the Booker Prize, Ben Okri's ", " has become a classic. Like Salman Rushdie's ", " or Gabriel Garcia Marquez's ", ", it combines brilliant narrative technique with a fresh vision to create an essential work of world literature.", "The narrator, Azaro, is an ", ", a spirit child, who in the Yoruba trad", "In the decade since it won the Booker Prize, Ben Okri's ", " has become a classic. Like Salman Rushdie's ", " or Gabriel Garcia Marquez's ", ", it combines brilliant narrative technique with a fresh vision to create an essential work of world literature.", "The narrator, Azaro, is an ", ", a spirit child, who in the Yoruba tradition of Nigeria exists between life and death. The life he foresees for himself and the tale he tells is full of sadness and tragedy, but inexplicably he is born with a smile on his face. Nearly called back to the land of the dead, he is resurrected. But in their efforts to save their child, Azaro's loving parents are made destitute. The tension between the land of the living, with its violence and political struggles, and the temptations of the carefree kingdom of the spirits propels this latter-day Lazarus's story."], "author": "Ben Okri", "num_pages": "512", "awards": ["Man Booker Prize (1991)", "Premio Grinzane Cavour Nominee for Narrativa Straniera (1994)"], "places": ["Nigeria"], "character_names": [], "language": "English", "publish_date": "1993-06-01 00:00:00", "ISBN": "0385425139"},
{"url": "https://www.goodreads.com/book/show/158674.Nervous_Conditions", "num_ratings": "9,179", "num_reviews": "651", "avg_ratings": 3.94, "genres": ["Fiction", "Cultural", "Africa", "Historical", "Historical Fiction", "Eastern Africa", "Zimbabwe", "Feminism"], "title": "Nervous Conditions", "description": ["A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousn", "A modern classic in the African literary canon and voted in the Top Ten Africa's 100 Best Books of the 20th Century, this novel brings to the politics of decolonization theory the energy of women's rights. An extraordinarily well-crafted work, this book is a work of vision. Through its deft negotiation of race, class, gender and cultural change, it dramatizes the 'nervousness' of the 'postcolonial' conditions that bedevil us still. In Tambu and the women of her family, we African women see ourselves, whether at home or displaced, doing daily battle with our changing world with a mixture of tenacity, bewilderment and grace."], "author": "Tsitsi Dangarembga", "num_pages": "204", "awards": ["Commonwealth Writers' Prize for Best Book in Africa (1989)"], "places": ["Rhodesia", "Zimbabwe"], "character_names": [], "language": "English", "publish_date": "2004-11-29 00:00:00", "ISBN": "1580051340"},
{"url": "https://www.goodreads.com/book/show/6193.Life_and_Times_of_Michael_K", "num_ratings": "13,514", "num_reviews": "784", "avg_ratings": 3.85, "genres": ["Fiction", "Cultural", "Africa", "Southern Africa", "South Africa"], "title": "Life and Times of Michael K", "description": [" On the way there she dies, leaving him alone in an anarchic world of brutal roving armies. Imprisoned, Michael is unable to bear confinement and escapes, determined to live with dignity. ", "goes to the centre of human experience - the need for an inte", " On the way there she dies, leaving him alone in an anarchic world of brutal roving armies. Imprisoned, Michael is unable to bear confinement and escapes, determined to live with dignity. ", "goes to the centre of human experience - the need for an interior, spiritual life, for some connections to the world in which we live, and for purity of vision."], "author": "J.M. Coetzee", "num_pages": "192", "awards": ["Man Booker Prize (1983)", "Prix Femina for Étranger (1985)", "Βραβείο Λογοτεχνικής Μετάφρασης ΕΚΕΜΕΛ for Αγγλόφωνη Λογοτεχνία (2007)"], "places": ["Capetown", "Prince Albert"], "character_names": ["Michael K"], "language": "English", "publish_date": "2004-09-02 00:00:00", "ISBN": "009947915X"},
{"url": "https://www.goodreads.com/book/show/5488.The_Cairo_Trilogy", "num_ratings": "3,258", "num_reviews": "247", "avg_ratings": 4.46, "genres": ["Fiction", "Northern Africa", "Egypt", "Historical", "Historical Fiction", "Classics", "Cultural", "Africa", "Literature"], "title": "The Cairo Trilogy: Palace Walk / Palace of Desire / Sugar Street", "description": ["Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patri", "Naguib Mahfouz’s magnificent epic trilogy of colonial Egypt appears here in one volume for the first time. The Nobel Prize-winning writer's masterwork is the engrossing story of a Muslim family in Cairo during Britain's occupation of Egypt in the early decades of the twentieth century.", "The novels of ", " trace three generations of the family of tyrannical patriarch Al-Sayyid Ahmad Abd al-Jawad, who rules his household with a strict hand while living a secret life of self-indulgence. ", " introduces us to his gentle, oppressed wife, Amina, his cloistered daughters, Aisha and Khadija, and his three sons–the tragic and idealistic Fahmy, the dissolute hedonist Yasin, and the soul-searching intellectual Kamal. Al-Sayyid Ahmad’s rebellious children struggle to move beyond his domination in ", ", as the world around them opens to the currents of modernity and political and domestic turmoil brought by the 1920s. ", " brings Mahfouz’s vivid tapestry of an evolving Egypt to a dramatic climax as the aging patriarch sees one grandson become a Communist, one a Muslim fundamentalist, and one the lover of a powerful politician.", "Throughout the trilogy, the family's trials mirror those of their turbulent country during the years spanning the two World Wars, as change comes to a society that has resisted it for centuries. Filled with compelling drama, earthy humor, and remarkable insight, ", " is the achievement of a master storyteller."], "author": "Naguib Mahfouz", "num_pages": "1313", "awards": [], "places": ["Cairo"], "character_names": [], "language": "English", "publish_date": "2001-10-16 00:00:00", "ISBN": "0375413316"},
{"url": "https://www.goodreads.com/book/show/151374.So_Long_a_Letter", "num_ratings": "5,441", "num_reviews": "453", "avg_ratings": 3.88, "genres": ["Fiction", "Cultural", "Africa", "Western Africa", "Senegal", "Literature", "African Literature", "Cultural", "France", "Feminism"], "title": "So Long a Letter", "description": ["This novel is in the form of a letter, written by the widowed Ramatoulaye and describing her struggle for survival. It is the winner of the Noma Award."], "author": "Mariama Bâ", "num_pages": "90", "awards": ["Noma Award for Publishing in Africa (1980)"], "places": ["Senegal"], "character_names": ["Ramatoulaye", "Aissatou", "Mawdo Ba", "Modou Fall", "Binetou"], "language": "English", "publish_date": "1989-06-28 00:00:00", "ISBN": "0435905554"},
{"url": "https://www.goodreads.com/book/show/318431.Long_Walk_to_Freedom", "num_ratings": "51,804", "num_reviews": "2,896", "avg_ratings": 4.32, "genres": ["History", "Cultural", "Africa", "Nonfiction", "Politics", "Autobiography", "Memoir", "Biography"], "title": "Long Walk to Freedom", "description": ["Nelson Mandela is one of the great moral and political leaders of our time: an international hero whose lifelong dedication to the fight against racial oppression in South Africa won him the Nobel Peace Prize and the presidency of his country. Since his triumphant release in 1990 from more th", "Nelson Mandela is one of the great moral and political leaders of our time: an international hero whose lifelong dedication to the fight against racial oppression in South Africa won him the Nobel Peace Prize and the presidency of his country. Since his triumphant release in 1990 from more than a quarter-century of imprisonment, Mandela has been at the center of the most compelling and inspiring political drama in the world. As president of the African National Congress and head of South Africa's antiapartheid movement, he was instrumental in moving the nation toward multiracial government and majority rule. He is revered everywhere as a vital force in the fight for human rights and racial equality.", "LONG WALK TO FREEDOM is his moving and exhilarating autobiography, destined to take its place among the finest memoirs of history's greatest figures. Here for the first time, Nelson Rolihlahla Mandela tells the extraordinary story of his life--an epic of struggle, setback, renewed hope, and ultimate triumph."], "author": "Nelson Mandela", "num_pages": "656", "awards": ["Alan Paton Award (1995)"], "places": [], "character_names": ["Nelson Mandela"], "language": "English", "publish_date": "1995-10-01 00:00:00", "ISBN": "0316548189"},
{"url": "https://www.goodreads.com/book/show/669780.Season_of_Migration_to_the_North", "num_ratings": "15,293", "num_reviews": "1,931", "avg_ratings": 3.71, "genres": ["Fiction", "Cultural", "Africa", "Novels", "Northern Africa", "Sudan", "Literature"], "title": "Season of Migration to the North", "description": ["After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into", "After years of study in Europe, the young narrator of Season of Migration to the North returns to his village along the Nile in the Sudan. It is the 1960s, and he is eager to make a contribution to the new postcolonial life of his country. Back home, he discovers a stranger among the familiar faces of childhood—the enigmatic Mustafa Sa’eed. Mustafa takes the young man into his confidence, telling him the story of his own years in London, of his brilliant career as an economist, and of the series of fraught and deadly relationships with European women that led to a terrible public reckoning and his return to his native land.", "But what is the meaning of Mustafa’s shocking confession? Mustafa disappears without explanation, leaving the young man—whom he has asked to look after his wife—in an unsettled and violent no-man’s-land between Europe and Africa, tradition and innovation, holiness and defilement, and man and woman, from which no one will escape unaltered or unharmed.", "Season of Migration to the North is a rich and sensual work of deep honesty and incandescent lyricism. In 2001 it was selected by a panel of Arab writers and critics as the most important Arab novel of the twentieth century."], "author": "Tayeb Salih", "num_pages": "176", "awards": [], "places": ["North Africa"], "character_names": [], "language": "English", "publish_date": "1970-01-01 00:00:00", "ISBN": "0435900668"}
]