[
{"url": "https://www.goodreads.com/book/show/480204.The_Phantom_of_the_Opera", "num_ratings": "172,783", "num_reviews": "5,212", "avg_ratings": 3.97, "genres": ["Classics", "Fiction", "Horror", "Romance"], "title": "The Phantom of the Opera", "description": ["First published in French as a serial in 1909, ", " is a riveting story that revolves around the young, Swedish Christine Daaé. Her father, a famous musician, dies, and she is raised in the Paris Opera House with his dying promise of a protective angel of music to guide her. After a time at the opera house, she begins hearing a voice, who eventually tea", "First published in French as a serial in 1909, ", " is a riveting story that revolves around the young, Swedish Christine Daaé. Her father, a famous musician, dies, and she is raised in the Paris Opera House with his dying promise of a protective angel of music to guide her. After a time at the opera house, she begins hearing a voice, who eventually teaches her how to sing beautifully. All goes well until Christine's childhood friend Raoul comes to visit his parents, who are patrons of the opera, and he sees Christine when she begins successfully singing on the stage. The voice, who is the deformed, murderous 'ghost' of the opera house named Erik, however, grows violent in his terrible jealousy, until Christine suddenly disappears. The phantom is in love, but it can only spell disaster.", "Leroux's work, with characters ranging from the spoiled prima donna Carlotta to the mysterious Persian from Erik's past, has been immortalized by memorable adaptations. Despite this, it remains a remarkable piece of Gothic horror literature in and of itself, deeper and darker than any version that follows."], "author": "Gaston Leroux", "num_pages": "360", "awards": [], "places": ["Paris", "Bretagne"], "character_names": ["Erik", "Christine Daaé", "Raoul de Chagny", "M. le Vicomte Raoul de Chagny", "La Carlotta", "\"The Persian\"", "Count Phillippe de Chagny"], "language": "English", "publish_date": "1987-12-30 00:00:00", "ISBN": "0060809248"},
{"url": "https://www.goodreads.com/book/show/360259.Flowers_from_the_Storm", "num_ratings": "11,702", "num_reviews": "1,165", "avg_ratings": 4.1, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency", "Fiction"], "title": "Flowers from the Storm", "description": ["The Duke of Jervaulx was brilliant - and dangerous. Considered dissolute, reckless, and extravagant, he was transparently referred to as the \"D of J\" in scandal sheets. But sometimes the most womanizing rakehell can be irresistible, and even his most causal attentions fascinated the sheltered Maddy Timms. ", "Then one fateful day she receives the shocking news - the duke is lo", "The Duke of Jervaulx was brilliant - and dangerous. Considered dissolute, reckless, and extravagant, he was transparently referred to as the \"D of J\" in scandal sheets. But sometimes the most womanizing rakehell can be irresistible, and even his most causal attentions fascinated the sheltered Maddy Timms. ", "Then one fateful day she receives the shocking news - the duke is lost to the world. And Maddy knows it is her destiny to help him and her only chance to find the true man behind the wicked facade. ", "But she never dreamed her gentle, healing touch would alter his life and her own so completely - and bind them together in need, desire...and love."], "author": "Laura Kinsale", "num_pages": "533", "awards": ["RITA Award by Romance Writers of America Nominee for Best Romance of the Year (1993)", "Romance Readers Anonymous (RRA) Award (1996)"], "places": ["London, England", "Wales"], "character_names": ["Christian Langland, Duke of Jervaulx", "Maddy Timms"], "language": "English", "publish_date": "2003-05-27 00:00:00", "ISBN": "0380761327"},
{"url": "https://www.goodreads.com/book/show/17402018-running-scarred", "num_ratings": "492", "num_reviews": "44", "avg_ratings": 3.7, "genres": ["Romance", "War", "Military Fiction", "Military Fiction", "Military Romance", "Contemporary", "Disability"], "title": "Running Scarred", "description": ["For three years ex-soldier, Patrick Reeves has avoided his once comfortable world. Unable to accept his terrible injuries, he moves to a secluded cottage in France and hides from everyone, most of all himself.", "But when a bright, beautiful woman, who stirs his blood and steals his heart, discovers the ruined Chateau and estate on which home stands, it's more than his unerrin", "For three years ex-soldier, Patrick Reeves has avoided his once comfortable world. Unable to accept his terrible injuries, he moves to a secluded cottage in France and hides from everyone, most of all himself.", "But when a bright, beautiful woman, who stirs his blood and steals his heart, discovers the ruined Chateau and estate on which home stands, it's more than his unerring control can bear. for her to flinch from his wounds would be terrible, but for to pity him would be the final insult. His only option is to ensure that she never sees him at all.", "Ellen doesn't give a damn what Patrick looks like. One glimpse of his shaded figure, one hint of his masculine scent and she is his forever. She ends her engagement and follows her heart, buying the Chateau to fulfil a dream that has been her only wish since her brother was blown up in Afghanistan. If she can capture the elusive Patrick while attaining her goals, her world will be complete.", "But Patrick is hiding from more than himself. Ellen is Devastated when he abandons her for a flame haired beauty and when her ex-fiance reappears, determined that he is surrendering neither Ellen or her fortune, she discovers that she is in danger of not only losing her lover but her life.", "Can Patrick escape in time to save the woman who loves and accepts him exactly as he is or will she be lost to him forever while he has been Running Scarred for far too long."], "author": "Jackie Williams", "num_pages": "242", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-01-19 00:00:00", "ISBN": "148190406X"},
{"url": "https://www.goodreads.com/book/show/18490.Frankenstein", "num_ratings": "961,799", "num_reviews": "23,354", "avg_ratings": 3.77, "genres": ["Classics", "Fiction", "Horror", "Science Fiction"], "title": "Frankenstein", "description": [" began writing ", " when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, ", " tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles", " began writing ", " when she was only eighteen. At once a Gothic thriller, a passionate romance, and a cautionary tale about the dangers of science, ", " tells the story of committed science student Victor Frankenstein. Obsessed with discovering the cause of generation and life and bestowing animation upon lifeless matter, Frankenstein assembles a human being from stolen body parts but; upon bringing it to life, he recoils in horror at the creature's hideousness. Tormented by isolation and loneliness, the once-innocent creature turns to evil and unleashes a campaign of murderous revenge against his creator, Frankenstein.", ", an instant bestseller and an important ancestor of both the horror and science fiction genres, not only tells a terrifying story, but also raises profound, disturbing questions about the very nature of life and the place of humankind within the cosmos: What does it mean to be human? What responsibilities do we have to each other? How far can we go in tampering with Nature? In our age, filled with news of organ donation genetic engineering, and bio-terrorism, these questions are more relevant than ever."], "author": "Mary Wollstonecraft Shelley", "num_pages": "273", "awards": [], "places": ["Geneva", "Ingolstadt", "Orkney Islands, Scotland", "Ireland", "Switzerland"], "character_names": ["Victor Frankenstein", "Elizabeth Lavenza", "William Frankenstein", "Robert Walton", "Henry Clerval", "Frankenstein's monster", "Alphonse Frankenstein", "Caroline Beaufort Frankenstein", "Ernest Frankenstein", "Justine Moritz", "Monsieur de Lacy", "Safiye"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0141439475"},
{"url": "https://www.goodreads.com/book/show/6591064-in-the-eye-of-the-beholder", "num_ratings": "100", "num_reviews": "22", "avg_ratings": 3.72, "genres": ["Romance", "Historical", "Historical Fiction", "Fiction", "Adult Fiction", "Erotica", "Fan Fiction", "Romance", "Historical Romance"], "title": "In The Eye of The Beholder:  A Novel of The Phantom of the Opera", "description": ["When French equestrian Claire Delacroix loses her fiance in a tragic accident, she comes to live at the Paris Opera during its 1890s heyday. Whilst working at the opera, she meets a mysterious, masked stranger: Erik. Is it possible that the two of them will heal the pain of each other's past?"], "author": "Sharon E. Cathcart", "num_pages": "234", "awards": [], "places": ["Paris"], "character_names": ["Claire Delacroix", "Erik LeMaitre", "Gilbert Rochambeau", "Joseph Merrick"], "language": "English", "publish_date": "2009-07-04 00:00:00", "ISBN": "0956188478"},
{"url": "https://www.goodreads.com/book/show/21787.The_Princess_Bride", "num_ratings": "677,601", "num_reviews": "17,003", "avg_ratings": 4.25, "genres": ["Fantasy", "Fiction", "Classics", "Romance", "Humor", "Young Adult", "Adventure"], "title": "The Princess Bride", "description": ["What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams?", "As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, ", ". But as a grown-up he discovered that the boring parts were left out of good old Dad's recitat", "What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams?", "As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, ", ". But as a grown-up he discovered that the boring parts were left out of good old Dad's recitation, and only the \"good parts\" reached his ears.", "Now Goldman does Dad one better. He's reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere.", "What's it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex.", "In short, it's about everything."], "author": "William Goldman", "num_pages": "398", "awards": [], "places": [], "character_names": ["Buttercup", "Westley", "Prince Humperdinck", "Inigo Montoya", "Fezzik", "Vizzini", "Count Rugen", "Miracle Max", "The Dread Pirate Roberts", "Ty Cobb"], "language": "English", "publish_date": "2003-07-15 00:00:00", "ISBN": "0345418263"},
{"url": "https://www.goodreads.com/book/show/13496.A_Game_of_Thrones", "num_ratings": "1,631,774", "num_reviews": "49,063", "avg_ratings": 4.45, "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy"], "title": "A Game of Thrones", "description": ["Here is the first volume in George R. R. Martin’s magnificent cycle of novels that includes A Clash of Kings and A Storm of Swords. As a whole, this series comprises a genuine masterpiece of modern fantasy, bringing together the best the genre has to offer. Magic, mystery, intrigue, romance, and adventure fill these pages and transport us to a world unlike any we have ever", "Here is the first volume in George R. R. Martin’s magnificent cycle of novels that includes A Clash of Kings and A Storm of Swords. As a whole, this series comprises a genuine masterpiece of modern fantasy, bringing together the best the genre has to offer. Magic, mystery, intrigue, romance, and adventure fill these pages and transport us to a world unlike any we have ever experienced. Already hailed as a classic, George R. R. Martin’s stunning series is destined to stand as one of the great achievements of imaginative fiction.", "A GAME OF THRONES", "Long ago, in a time forgotten, a preternatural event threw the seasons out of balance. In a land where summers can last decades and winters a lifetime, trouble is brewing. The cold is returning, and in the frozen wastes to the north of Winterfell, sinister and supernatural forces are massing beyond the kingdom’s protective Wall. At the center of the conflict lie the Starks of Winterfell, a family as harsh and unyielding as the land they were born to. Sweeping from a land of brutal cold to a distant summertime kingdom of epicurean plenty, here is a tale of lords and ladies, soldiers and sorcerers, assassins and bastards, who come together in a time of grim omens.", "Here an enigmatic band of warriors bear swords of no human metal; a tribe of fierce wildlings carry men off into madness; a cruel young dragon prince barters his sister to win back his throne; and a determined woman undertakes the most treacherous of journeys. Amid plots and counterplots, tragedy and betrayal, victory and terror, the fate of the Starks, their allies, and their enemies hangs perilously in the balance, as each endeavors to win that deadliest of conflicts: the game of thrones.", "source: georgerrmartin.com"], "author": "George R.R. Martin", "num_pages": "848", "awards": ["Nebula Award Nominee for Best Novel (1997)", "Locus Award for Best Fantasy Novel (1997)", "World Fantasy Award Nominee for Best Novel (1997)", "Premio Ignotus for Novela extranjera (2003)"], "places": ["The Lands of Ice and Fire"], "character_names": ["Brandon Stark", "Catelyn Stark", "Tyrion Lannister", "Daenerys Targaryen", "Eddard Stark", "Theon Greyjoy", "Robb Stark", "Arya Stark", "Jaime Lannister", "Joffrey Baratheon", "Robert Baratheon", "Tywin Lannister", "Lysa Arryn", "Petyr Baelish", "Sansa Stark", "Viserys Targaryen", "Varys", "Hodor", "Beric Dondarrion", "Thoros of Myr", "Sandor Clegane", "Samwell Tarly", "Pyp", "Tommen Baratheon", "Stannis Baratheon", "Grenn", "Mace Tyrell", "Septa Mordane", "Jon Snow", "Cersei Lannister", "Jorah Mormont"], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "0553588486"},
{"url": "https://www.goodreads.com/book/show/2498983.The_Darkest_Kiss", "num_ratings": "47,544", "num_reviews": "1,701", "avg_ratings": 4.26, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Fantasy", "Paranormal", "Demons"], "title": "The Darkest Kiss", "description": ["Though she has lived for centuries, Anya, goddess of Anarchy, has never known pleasure. Until Lucien, the incarnation of death--a warrior eternally doomed to take souls to the hereafter. He draws her like no other. And Anya will risk anything to have him.", "But when the merciless Lord of the Underworld is ordered", "Though she has lived for centuries, Anya, goddess of Anarchy, has never known pleasure. Until Lucien, the incarnation of death--a warrior eternally doomed to take souls to the hereafter. He draws her like no other. And Anya will risk anything to have him.", "But when the merciless Lord of the Underworld is ordered by the gods to claim Anya herself, their uncontrollable attraction becomes an anguished pursuit. Now they must defeat the unconquerable forces that control them, before their thirst for one another demands a sacrifice of love beyond imagining..."], "author": "Gena Showalter", "num_pages": "368", "awards": [], "places": ["Budapest"], "character_names": ["Anya - Goddess of Anarchy", "Lucien / Death", "William (Lords of the Underworld)"], "language": "English", "publish_date": "2008-05-20 00:00:00", "ISBN": "0373772327"},
{"url": "https://www.goodreads.com/book/show/5554803-to-beguile-a-beast", "num_ratings": "11,003", "num_reviews": "569", "avg_ratings": 4.04, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Fairy Tales", "Beauty and The Beast", "Historical", "Historical Fiction"], "title": "To Beguile a Beast", "description": ["CAN A WOUNDED BEAST . . . ", "Reclusive Sir Alistair Munroe has hidden in his castle ever since returning from the Colonies, scarred inside and out. But when a mysterious beauty arrives at his door, the passions he's kept suppressed for years begin to awaken. ", "TRUST A BEAUTY WITH A PAST . . . ", "Running from past mistakes has taken legendary beauty Helen Fitzwilliam from the luxur", "CAN A WOUNDED BEAST . . . ", "Reclusive Sir Alistair Munroe has hidden in his castle ever since returning from the Colonies, scarred inside and out. But when a mysterious beauty arrives at his door, the passions he's kept suppressed for years begin to awaken. ", "TRUST A BEAUTY WITH A PAST . . . ", "Running from past mistakes has taken legendary beauty Helen Fitzwilliam from the luxury of the ton to a crumbling Scottish castle . . . and a job as a housekeeper. Yet Helen is determined to start a new life and she won't let dust-or a beast of a man-scare her away. ", "TO TAME HIS MOST SECRET DESIRES? ", "Beneath Helen's beautiful façade, Alistair finds a courageous and sensual woman. A woman who doesn't back away from his surliness-or his scars. But just as he begins to believe in true love, Helen's secret past threatens to tear them apart. Now both Beast and Beauty must fight for the one thing neither believed they could ever find-a happy ever after."], "author": "Elizabeth Hoyt", "num_pages": "333", "awards": ["RITA Award by Romance Writers of America Nominee for Historical Romance (2011)"], "places": ["Castle Greaves, Scotland", "London, England"], "character_names": ["Sir Alistair Munroe", "Helen Fitzwilliam"], "language": "English", "publish_date": "2009-05-01 00:00:00", "ISBN": "0446406937"},
{"url": "https://www.goodreads.com/book/show/5098079-lover-avenged", "num_ratings": "96,673", "num_reviews": "3,707", "avg_ratings": 4.38, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Fantasy"], "title": "Lover Avenged", "description": ["Rehvenge has always kept his distance from the Brotherhood—even though his sister is married to a member, for he harbors a deadly secret that could make him a huge liability in their war against the lessers. As plots within and outside of the Brotherhood threaten to reveal the truth about Rehvenge, he turns to the only source of light in his darkening world, Ehlena, a vamp", "Rehvenge has always kept his distance from the Brotherhood—even though his sister is married to a member, for he harbors a deadly secret that could make him a huge liability in their war against the lessers. As plots within and outside of the Brotherhood threaten to reveal the truth about Rehvenge, he turns to the only source of light in his darkening world, Ehlena, a vampire untouched by the corruption that has its hold on him—and the only thing standing between him and eternal destruction."], "author": "J.R. Ward", "num_pages": "527", "awards": ["All About Romance (AAR) Annual Reader Poll for Guiltiest Pleasure Romance & Honorable Mention for Best Paranormal Romance (2010)", "P.E.A.R.L. (Paranormal Excellence Award for Romantic Literature) for Best Overall Paranormal Romance AND Best Vampire Romance (2009)"], "places": ["Caldwell, New York"], "character_names": ["Beth (Elizabeth) Randall", "John Matthew", "Xhexania", "Qhuinn", "Blaylock", "Tohrment", "Ehlena", "Rehvenge", "Wrath (Blind King)"], "language": "English", "publish_date": "2009-04-28 00:00:00", "ISBN": "0451225856"},
{"url": "https://www.goodreads.com/book/show/5805.V_for_Vendetta", "num_ratings": "229,996", "num_reviews": "4,570", "avg_ratings": 4.25, "genres": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Fiction", "Science Fiction", "Dystopia", "Science Fiction"], "title": "V for Vendetta", "description": ["A frightening and powerful tale of the loss of freedom and identity in a chillingly believable totalitarian world, ", " stands as one of the highest achievements of the comics medium and a defining work for creators Alan Moore and David Lloyd.", "Set in an imagined future England that has given itself over to fascism, this", "A frightening and powerful tale of the loss of freedom and identity in a chillingly believable totalitarian world, ", " stands as one of the highest achievements of the comics medium and a defining work for creators Alan Moore and David Lloyd.", "Set in an imagined future England that has given itself over to fascism, this groundbreaking story captures both the suffocating nature of life in an authoritarian police state and the redemptive power of the human spirit which rebels against it. Crafted with sterling clarity and intelligence, ", " brings an unequaled depth of characterization and verisimilitude to its unflinching account of oppression and resistance."], "author": "Alan Moore", "num_pages": "296", "awards": ["Prometheus Hall of Fame Award (2006)", "Harvey Awards Nominee for Best Continuing or Limited Series & Best Writer (for Alan Moore) (1989)"], "places": ["United Kingdom"], "character_names": ["Evey Hammond", "Adam Susan", "Eric Finch", "Lewis Prothero", "V"], "language": "English", "publish_date": "2005-11-01 00:00:00", "ISBN": "1401207928"},
{"url": "https://www.goodreads.com/book/show/7046495-lover-mine", "num_ratings": "94,931", "num_reviews": "4,018", "avg_ratings": 4.41, "genres": ["Romance", "Paranormal Romance", "Paranormal", "Vampires", "Romance", "Fantasy"], "title": "Lover Mine", "description": ["John Matthew has come a long way since he was found living among humans, his vampire nature unknown to himself and to those around him. After he was taken in by the Brotherhood, no one could guess what his true history was- or his true identity. Indeed, the fallen Brother Darius has returned, but with a different face and a very different destiny. As a vicious personal ven", "John Matthew has come a long way since he was found living among humans, his vampire nature unknown to himself and to those around him. After he was taken in by the Brotherhood, no one could guess what his true history was- or his true identity. Indeed, the fallen Brother Darius has returned, but with a different face and a very different destiny. As a vicious personal vendetta takes John into the heart of the war, he will need to call up on both who he is now and who he once was in order to face off against evil incarnate.", "Xhex, a symphath assassin, has long steeled herself against the attraction between her and John Matthew. Having already lost one lover to madness, she will not allow the male of worth to fall prey to the darkness of her twisted life. When fate intervenes, however, the two discover that love, like destiny, is inevitable between soul mates."], "author": "J.R. Ward", "num_pages": "528", "awards": ["All About Romance (AAR) Annual Reader Poll for Guiltiest Pleasure Romance & Honorable Mention for Best Paranormal Romance (2011)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Vampire Romance (2010)", "Goodreads Choice Award for Romance (2010)"], "places": ["Caldwell, New York"], "character_names": ["John Matthew", "Xhexania", "Qhuinn", "Blaylock", "Lash", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2010-04-27 00:00:00", "ISBN": "0451229851"},
{"url": "https://www.goodreads.com/book/show/84145.Dance_with_the_Devil", "num_ratings": "56,475", "num_reviews": "1,828", "avg_ratings": 4.39, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Fantasy", "Paranormal", "Vampires"], "title": "Dance with the Devil", "author": "Sherrilyn Kenyon", "num_pages": "343", "awards": ["All About Romance (AAR) Annual Reader Poll for Most Tortured Hero (2004)", "HOLT Medallion by Virginia Romance Writers Nominee for Paranormal/Time Travel/Futuristic  (2004)", "Desert Rose Golden Quill Award for Best Paranormal (2003)", "Booksellers' Best Award for Best Paranormal (2003)", "RIO Award of Excellence by Reviewers International Organization for Favorite Paranormal (2003)", "PRISM Award by Fantasy, Futuristic and Paranormal Special Interest Chapter of RWA for Best Dark Paranormal (2004)"], "places": ["Alaska"], "character_names": ["Zarek of Moesia", "Simi", "Artemis Agrotera", "Astrid (Dream Warrior)", "William Jessup Brady (Sundown)", "Sasha (Dance with the Devil)", "Syra (Dance with the Devil)", "Callyx (Dance with the Devil)", "Otto Carvalletti", "Clotho (mythology)", "Lachesis (mythology)", "Atropos (mythology)", "M’Adoc", "Lucian (Spawn)", "Goddess Themis"], "language": "English", "publish_date": "2003-11-28 00:00:00", "ISBN": "0312984839"},
{"url": "https://www.goodreads.com/book/show/28863.The_Raven_Prince", "num_ratings": "16,755", "num_reviews": "1,096", "avg_ratings": 3.98, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "The Raven Prince", "description": ["Widowed Anna Wren is having a wretched day. After an arrogant male on horseback nearly squashes her, she arrives home to learn that she is in dire financial straits.", "The Earl of Swartingham is in a quandary. Having frightened off two secretaries, Edward de Raaf needs someone who can withstand his bad t", "Widowed Anna Wren is having a wretched day. After an arrogant male on horseback nearly squashes her, she arrives home to learn that she is in dire financial straits.", "The Earl of Swartingham is in a quandary. Having frightened off two secretaries, Edward de Raaf needs someone who can withstand his bad temper and boorish behavior.", "When Anna becomes the earl's secretary, it would seem that ", " their problems are solved. Then she discovers he plans to visit the most notorious brothel in London for his \"manly\" needs. Well! Anna sees red—and decides to assuage her \"womanly\" desires...with the earl as her unknowing lover."], "author": "Elizabeth Hoyt", "num_pages": "392", "awards": ["All About Romance (AAR) Annual Reader Poll for Most Luscious Love Story & Honorable Mention for Best Buried Treasure (2007)", "Romantic Times Reviewers' Choice Award (RT Award) for Sensual Historical Romance (2006)"], "places": ["Little Battleford, England"], "character_names": ["Anna Wren", "Edward de Raaf, Earl of Swartingham"], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "0446618470"},
{"url": "https://www.goodreads.com/book/show/5981872-the-madness-of-lord-ian-mackenzie", "num_ratings": "24,596", "num_reviews": "2,146", "avg_ratings": 4.06, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Adult"], "title": "The Madness of Lord Ian Mackenzie", "description": ["The year is 1881. Meet the Mackenzie family—rich, powerful, dangerous, eccentric. A lady couldn't be seen with them without ruin. Rumors surround them—of tragic violence, of their mistresses, of their dark appetites, of scandals that set England and Scotland abuzz. ", "The youngest brother, Ian, known as the Mad Mackenzie, spent most of his young life in an asylum, and everyon", "The year is 1881. Meet the Mackenzie family—rich, powerful, dangerous, eccentric. A lady couldn't be seen with them without ruin. Rumors surround them—of tragic violence, of their mistresses, of their dark appetites, of scandals that set England and Scotland abuzz. ", "The youngest brother, Ian, known as the Mad Mackenzie, spent most of his young life in an asylum, and everyone agrees he is decidedly odd. He's also hard and handsome and has a penchant for Ming pottery and beautiful women. ", "Beth Ackerley, widow, has recently come into a fortune. She has decided that she wants no more drama in her life. She was raised in drama—an alcoholic father who drove them into the workhouse, a frail mother she had to nurse until her death, a fussy old lady she became constant companion to. No, she wants to take her money and find peace, to travel, to learn art, to sit back and fondly remember her brief but happy marriage to her late husband. ", "And then Ian Mackenzie decides he wants her. ", "The first of a new historical series."], "author": "Jennifer Ashley", "num_pages": "320", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Romance & Most Tortured Hero & Best Historical Set in the U.K. & Best Love Scenes & Honorable Mention for Best Romance Heroine (2010)", "Romantic Times Reviewers' Choice Award (RT Award) for Most Innovative Historical Romance (2009)", "DABWAHA Romance Tournament for Best Historical Romance (2010)", "Readers' Crown Award by RomCon® (Romance Conventions Inc.) for Best Historical Romance (2010)"], "places": ["London, England", "Paris", "Castle Kilmorgan, Scotland"], "character_names": ["Lord Ian Mackenzie", "Beth (Ackerley) Mackenzie", "Isabella (Scranton) Mackenzie", "Daniel Mackenzie", "Hart Mackenzie, Duke of Kilmorgan", "Lord Cameron Mackenzie", "Lord Roland \"Mac\" Mackenzie", "Lloyd Fellows"], "language": "English", "publish_date": "2009-05-01 00:00:00", "ISBN": "0843960434"},
{"url": "https://www.goodreads.com/book/show/40158.The_Queen_of_Attolia", "num_ratings": "29,201", "num_reviews": "2,860", "avg_ratings": 4.22, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure", "Romance"], "title": "The Queen of Attolia", "description": ["When Eugenides, the Thief of Eddis, stole Hamiathes's Gift, the Queen of Attolia lost more than a mythical relic. She lost face. Everyone knew that Eugenides had outwitted and escaped her. To restore her reputation and reassert her power, the Queen of Attolia will go to any length and accept any help that is offered...she will risk her country to execute the perfect", "When Eugenides, the Thief of Eddis, stole Hamiathes's Gift, the Queen of Attolia lost more than a mythical relic. She lost face. Everyone knew that Eugenides had outwitted and escaped her. To restore her reputation and reassert her power, the Queen of Attolia will go to any length and accept any help that is offered...she will risk her country to execute the perfect revenge.", "Eugenides can steal anything. And he taunts the Queen of Attolia, moving through her strongholds seemingly at will. So Attolia waits, secure in the knowledge that the Thief will slip, that he will haunt her palace one too many times.", "When Eugenides finds his small mountain country at war with Attolia, he must steal a man, he must steal a queen, he must steal peace. But his greatest triumph, and his greatest loss, comes in capturing something that the Queen of Attolia thought she had sacrificed long ago..."], "author": "Megan Whalen Turner", "num_pages": "362", "awards": ["Mythopoeic Fantasy Award for Children’s Literature (2011)"], "places": [], "character_names": ["Eugenides", "Attolia", "The Magus", "Eddis"], "language": "English", "publish_date": "2006-01-24 00:00:00", "ISBN": "0060841826"},
{"url": "https://www.goodreads.com/book/show/61881.Legacy", "num_ratings": "6,843", "num_reviews": "332", "avg_ratings": 3.79, "genres": ["Fantasy", "Romance", "Fiction", "Science Fiction Fantasy", "Romance", "Fantasy Romance"], "title": "Legacy", "description": ["Newlywed Fawn Bluefield, clever farmer, and Dag Redwing Hickory, seasoned Lakewalker soldier-sorcerer, meet opposition at his home settlement. Some threaten to exile Dag, until his patrol is called to a nearby attack by evil ", "."], "author": "Lois McMaster Bujold", "num_pages": "384", "awards": [], "places": [], "character_names": ["Fawn Bluefield", "Dag Redwing Hickory Oleana"], "language": "English", "publish_date": "2007-06-26 00:00:00", "ISBN": "006113905X"},
{"url": "https://www.goodreads.com/book/show/8563824-the-many-sins-of-lord-cameron", "num_ratings": "11,549", "num_reviews": "759", "avg_ratings": 4.09, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "The Many Sins of Lord Cameron", "description": ["Cameron Mackenzie is a man who loves only horses and women—in that order—or so his mistresses say.", "Ainsley Douglas is a woman with a strong sense of justice and the desire to help others—even if that means sneaking around a rakish man's bedchamber.", "Which is exactly where Cam finds her—six years after he caught her the firs", "Cameron Mackenzie is a man who loves only horses and women—in that order—or so his mistresses say.", "Ainsley Douglas is a woman with a strong sense of justice and the desire to help others—even if that means sneaking around a rakish man's bedchamber.", "Which is exactly where Cam finds her—six years after he caught her the first time. Only then, she convinced Cam she was seeking a liaison, but couldn't go through with it because of her husband. Now a widow, she's on a mission to retrieve letters that could prove embarrassing to the queen. Cam has no interest in Ainsley's subterfuge, but he vows to finish what they started those many years ago. One game, one kiss at a time, he plans to seduce her. And what starts out as a lusty diversion may break Cam's own rules—and heal the scars of a dark and damaging past..."], "author": "Jennifer Ashley", "num_pages": "298", "awards": ["RITA Award by Romance Writers of America Nominee for Historical Romance (2012)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Innovative Historical Romance (2011)", "Australian Romance Readers Association (ARRA) Award Nominee for Favourite Historical Romance (2011)"], "places": ["London, England", "Paris", "Monte Carlo", "Scottish Highlands"], "character_names": ["Lord Ian Mackenzie", "Beth (Ackerley) Mackenzie", "Isabella (Scranton) Mackenzie", "Ainsley (Douglas) Mackenzie", "Daniel Mackenzie", "Hart Mackenzie, Duke of Kilmorgan", "Lord Cameron Mackenzie", "Lord Roland \"Mac\" Mackenzie"], "language": "English", "publish_date": "2011-08-02 00:00:00", "ISBN": "0425240495"},
{"url": "https://www.goodreads.com/book/show/227636.Lord_Carew_s_Bride", "num_ratings": "2,125", "num_reviews": "124", "avg_ratings": 3.9, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Regency", "Historical", "Historical", "Historical Fiction", "Historical Romance", "Regency Romance"], "title": "Lord Carew's Bride", "description": ["Samantha Newman is getting older, but though she is beautiful and courted by a large number of gentlemen, she is restless and unhappy. While she is staying in the country with her friends Jennifer and Gabriel, she takes a walk alone and wanders onto the property of the reclusive Marquess of Carew. She meets him far from the house and mistakes him for a landscape designer.", "Samantha Newman is getting older, but though she is beautiful and courted by a large number of gentlemen, she is restless and unhappy. While she is staying in the country with her friends Jennifer and Gabriel, she takes a walk alone and wanders onto the property of the reclusive Marquess of Carew. She meets him far from the house and mistakes him for a landscape designer. He is an ordinary-looking man and is half crippled. He is also friendly and unassuming, and Samantha soon relaxes into a warm friendship with him. It is only much later, back in London, when she is again threatened by the man who broke her heart years ago during her come-out Season, that Samantha discovers who her friend really is. And this time she is tempted to settle for the contentment of friendship in order to escape the pain of love."], "author": "Mary Balogh", "num_pages": "224", "awards": ["RITA Award by Romance Writers of America Nominee for Regency Romance (1996)"], "places": [], "character_names": ["Samantha Newman", "Hartley Wade"], "language": "English", "publish_date": "1995-06-01 00:00:00", "ISBN": "0451185528"},
{"url": "https://www.goodreads.com/book/show/2526.Blindness", "num_ratings": "150,810", "num_reviews": "12,418", "avg_ratings": 4.09, "genres": ["Science Fiction", "Dystopia", "Horror", "Apocalyptic", "Post Apocalyptic", "Abandoned", "Literary Fiction"], "title": "Blindness", "description": ["A city is hit by an epidemic of \"white blindness\" that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations and assaulting women. There is one eyewitness to this nightmare who guides her c", "A city is hit by an epidemic of \"white blindness\" that spares no one. Authorities confine the blind to an empty mental hospital, but there the criminal element holds everyone captive, stealing food rations and assaulting women. There is one eyewitness to this nightmare who guides her charges—among them a boy with no mother, a girl with dark glasses, a dog of tears—through the barren streets, and their procession becomes as uncanny as the surroundings are harrowing. As ", " reclaims the age-old story of a plague, it evokes the vivid and trembling horrors of the twentieth century, leaving readers with a powerful vision of the human spirit that's bound both by weakness and exhilarating strength."], "author": "José Saramago", "num_pages": "326", "awards": ["Premio San Clemente for Novela Estranxeira (1999)"], "places": [], "character_names": ["The doctor (Blindness)", "The doctor's wife", "The girl with the dark glasses", "The first blind man", "The first blind man's wife", "The boy with the squint", "The old man with the black eye patch", "The car thief"], "language": "English", "publish_date": "1999-10-04 00:00:00", "ISBN": "0156007754"},
{"url": "https://www.goodreads.com/book/show/6434773-to-desire-a-devil", "num_ratings": "5,765", "num_reviews": "402", "avg_ratings": 3.81, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency"], "title": "To Desire a Devil", "description": ["Reynaud St. Aubyn has spent the last seven years in hellish captivity. Now half mad with fever he bursts into his ancestral home and demands his due. Can this wild-looking man truly be the last earl's heir, thought murdered by Indians years ago? ", "Beatrice Corning, the niece of the present earl, is a proper English miss. But she has a", "Reynaud St. Aubyn has spent the last seven years in hellish captivity. Now half mad with fever he bursts into his ancestral home and demands his due. Can this wild-looking man truly be the last earl's heir, thought murdered by Indians years ago? ", "Beatrice Corning, the niece of the present earl, is a proper English miss. But she has a secret: No real man has ever excited her more than the handsome youth in the portrait in her uncle's home. Suddenly, that very man is here, ", "—and luring her into his bed. ", "Only Beatrice can see past Reynaud's savagery to the noble man inside. For his part, Reynaud is drawn to this lovely lady, even as he is suspicious of her loyalty to her uncle. But can Beatrice's love tame a man who will stop at nothing to regain his title—even if it means sacrificing her innocence?"], "author": "Elizabeth Hoyt", "num_pages": "340", "awards": [], "places": ["London, England"], "character_names": ["Reynaud St. Aubyn", "Beatrice Corning"], "language": "English", "publish_date": "2009-11-01 00:00:00", "ISBN": "0446406945"},
{"url": "https://www.goodreads.com/book/show/31548.Of_Human_Bondage", "num_ratings": "41,320", "num_reviews": "2,766", "avg_ratings": 4.12, "genres": ["Classics", "Fiction", "Literature"], "title": "Of Human Bondage", "description": ["The first and most autobiographical of Maugham's masterpieces. It is the story of Philip Carey, an orphan eager for life, love and adventure. After a few months studying in Heidelberg, and a brief spell in Paris as a would-be artist, he settles in London to train as a doctor where he meets Mildred, the loud but irresistible waitress with whom he plunges into a tortured and", "The first and most autobiographical of Maugham's masterpieces. It is the story of Philip Carey, an orphan eager for life, love and adventure. After a few months studying in Heidelberg, and a brief spell in Paris as a would-be artist, he settles in London to train as a doctor where he meets Mildred, the loud but irresistible waitress with whom he plunges into a tortured and masochistic affair."], "author": "W. Somerset Maugham", "num_pages": "684", "awards": [], "places": ["Blackstable, Kent, England", "Heidelberg", "Paris", "London, England"], "character_names": ["Philip Carey", "Mildred Rogers", "Norah Nesbitt", "Thorpe Athelny", "Sally Athelny", "Hayward", "Miss Wilkinson", "Louisa Carey", "Dr. South", "Harry Griffiths", "Fanny Price (Of Human Bondage)"], "language": "English", "publish_date": "2007-01-02 00:00:00", "ISBN": "0451530179"},
{"url": "https://www.goodreads.com/book/show/12936.Gathering_Blue", "num_ratings": "137,819", "num_reviews": "10,161", "avg_ratings": 3.81, "genres": ["Science Fiction", "Dystopia", "Fiction", "Childrens", "Middle Grade"], "title": "Gathering Blue", "description": ["In her strongest work to date, Lois Lowry once again creates a mysterious but plausible future world. It is a society ruled by savagery and deceit that shuns and discards the weak. Left orphaned and physically flawed, young Kira faces a frightening, uncertain future. Blessed with an almost magical talent that keeps her alive, she struggles with ever broadening responsibili", "In her strongest work to date, Lois Lowry once again creates a mysterious but plausible future world. It is a society ruled by savagery and deceit that shuns and discards the weak. Left orphaned and physically flawed, young Kira faces a frightening, uncertain future. Blessed with an almost magical talent that keeps her alive, she struggles with ever broadening responsibilities in her quest for truth, discovering things that will change her life forever.", "As she did in ", ", Lowry challenges readers to imagine what our world could become, and what will be considered valuable. Every reader will be taken by Kira's plight and will long ponder her haunting world and the hope for the future."], "author": "Lois Lowry", "num_pages": "240", "awards": ["Massachusetts Book Award Nominee for Young Adult Literature (2001)"], "places": [], "character_names": ["Helena", "Dan", "Singer", "Thomas", "Mar", "Marlena", "Branch", "Christopher", "Kira", "Jamison", "Solora", "Annabella", "Vandara", "Camilla (diverse 1)", "Matt", "Katrina (Gathering Blue)", "Jo (Gathering Blue)"], "language": "English", "publish_date": "2000-09-25 00:00:00", "ISBN": "0385732562"},
{"url": "https://www.goodreads.com/book/show/425374.Miss_Wonderful", "num_ratings": "4,497", "num_reviews": "344", "avg_ratings": 3.68, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Miss Wonderful", "description": ["Due to his history of expensive romantic entanglements, Alistair Carsington now has six months to find either a useful occupation or a wealthy heiress to wed. To prove he is not an idle fop only concerned with sartorial pleasures, Alistair agrees to help his old friend, Lord Gordmor, by traveling to the wilds of Derbyshire to convince Gordmor's neighbors to support the nob", "Due to his history of expensive romantic entanglements, Alistair Carsington now has six months to find either a useful occupation or a wealthy heiress to wed. To prove he is not an idle fop only concerned with sartorial pleasures, Alistair agrees to help his old friend, Lord Gordmor, by traveling to the wilds of Derbyshire to convince Gordmor's neighbors to support the nobleman's proposal to build a canal. ", "Upon arriving, Alistair, a famous war hero and eligible bachelor, finds everyone couldn't be nicer, everyone except for respectable, practical, spinsterish Mirabel Oldridge. The last thing Mirabel wants is for her tranquil little corner of England to be destroyed by a noisy, nasty canal, and she is prepared to use every weapon at her disposal--including her disheveled coiffure and unstylish wardrobe--to stop Alistair."], "author": "Loretta Chase", "num_pages": "352", "awards": [], "places": ["Derbyshire, England"], "character_names": ["Alistair Carsington", "Mirabel Oldridge"], "language": "English", "publish_date": "2004-03-02 00:00:00", "ISBN": "0425194833"},
{"url": "https://www.goodreads.com/book/show/476692.Born_of_the_Night", "num_ratings": "23,330", "num_reviews": "1,493", "avg_ratings": 4.2, "genres": ["Romance", "Romance", "Paranormal Romance", "Science Fiction", "Fantasy", "Paranormal", "Fantasy"], "title": "Born of the Night", "description": ["Awakened from a drugged sleep in a cold cell, the Princess Kiara finds herself a prisoner of the merciless marauders who threaten her father's planetary kingdom. Miraculously, a rescuer appears, but behind his fearsome mask is the handsome face of a dark avenger whose outlaw touch sets her very soul aflame."], "author": "Sherrilyn Kenyon", "num_pages": "560", "awards": [], "places": [], "character_names": ["Caillen Dagan", "Syn Wade", "Nykyrian Quiakides", "Kiara Zamir", "Jayne", "Pitala", "Askel Quiakides", "Arast Quiakides", "Hauk", "Keifer Zamir"], "language": "English", "publish_date": "1996-08-16 00:00:00", "ISBN": "0759550212"},
{"url": "https://www.goodreads.com/book/show/343.Perfume", "num_ratings": "253,461", "num_reviews": "11,308", "avg_ratings": 4.01, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Horror", "Mystery"], "title": "Perfume: The Story of a Murderer", "description": ["An acclaimed bestseller and international sensation, Patrick Suskind's classic novel provokes a terrifying examination of what happens when one man's indulgence in his greatest passion - his sense of smell - leads to murder.", "In the slums of eighteenth-century France, the infant Jean-Baptiste Grenouille is born with one sublime gift - an absolute sense of smell. As a boy, he", "An acclaimed bestseller and international sensation, Patrick Suskind's classic novel provokes a terrifying examination of what happens when one man's indulgence in his greatest passion - his sense of smell - leads to murder.", "In the slums of eighteenth-century France, the infant Jean-Baptiste Grenouille is born with one sublime gift - an absolute sense of smell. As a boy, he lives to decipher the odors of Paris, and apprentices himself to a prominent perfumer who teaches him the ancient art of mixing precious oils and herbs. But Grenouille's genius is such that he is not satisfied to stop there, and he becomes obsessed with capturing the smells of objects such as brass doorknobs and fresh-cut wood. Then one day he catches a hint of a scent that will drive him on an ever-more-terrifying quest to create the \"ultimate perfume\" - the scent of a beautiful young virgin. Told with dazzling narrative brillance, Perfume is a hauntingly powerful tale of murder and sensual depravity."], "author": "Patrick Süskind", "num_pages": "263", "awards": ["World Fantasy Award for Best Novel (1987)", "PEN Translation Prize for John E. Woods (1987)"], "places": ["Paris"], "character_names": ["Jean-Baptiste Grenouille", "Giuseppe Baldini", "Madame Gaillard", "Jeanne Bussie", "Father Terrier", "Grimal", "The Plum Girl", "Chénier", "Taillade-Espinasse", "Madame Arnulfi", "Dominique Druot", "Antoine Richis", "Laure Richis"], "language": "English", "publish_date": "1987-08-16 00:00:00", "ISBN": "0140120831"},
{"url": "https://www.goodreads.com/book/show/12985.The_Tempest", "num_ratings": "148,838", "num_reviews": "3,244", "avg_ratings": 3.81, "genres": ["Classics", "Plays", "Drama", "Fiction"], "title": "The Tempest", "description": ["Alternate Cover/publisher Edition ISBN 0743482832 (ISBN13: 9780743482837)", "Each edition includes:", "• Freshly edited text based on the best early printed version of the play", "• Full explanatory notes conveniently placed on pages facing the text of the play", "• Scene-by-scene plot summaries", "• A key to famous lines and phrases", "• An introduction to reading Shakespeare's language", "• An essa", "Alternate Cover/publisher Edition ISBN 0743482832 (ISBN13: 9780743482837)", "Each edition includes:", "• Freshly edited text based on the best early printed version of the play", "• Full explanatory notes conveniently placed on pages facing the text of the play", "• Scene-by-scene plot summaries", "• A key to famous lines and phrases", "• An introduction to reading Shakespeare's language", "• An essay by an outstanding scholar providing a modern perspective on the play", "• Illustrations from the Folger Shakespeare Library's vast holdings of rare books"], "author": "William Shakespeare", "num_pages": "218", "awards": [], "places": [], "character_names": ["Prospero", "Miranda", "Ariel", "Caliban", "Ferdinand", "Alonso", "Antonio", "Sebastian", "Gonzalo", "Trinculo & Stephano", "Boatswain"], "language": "English", "publish_date": "2004-07-16 00:00:00"},
{"url": "https://www.goodreads.com/book/show/203288.The_Ship_Who_Sang", "num_ratings": "20,480", "num_reviews": "385", "avg_ratings": 4.01, "genres": ["Science Fiction", "Fantasy", "Fiction", "Science Fiction Fantasy"], "title": "The Ship Who Sang", "description": ["Helva had been born human, but only her brain had been saved and implanted into the titanium body of an intergalactic scout ship. But first she had to choose a human partner, to soar with her through the daring adventures and exhilarating escapades in space."], "author": "Anne McCaffrey", "num_pages": "248", "awards": [], "places": [], "character_names": ["Helva"], "language": "English", "publish_date": "1985-12-12 00:00:00", "ISBN": "0345334310"},
{"url": "https://www.goodreads.com/book/show/1502191.Untouched", "num_ratings": "2,795", "num_reviews": "290", "avg_ratings": 3.77, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency"], "title": "Untouched", "description": ["Beautiful Grace Paget has no reason not to believe these words. After all, she was kidnapped, spirited away to a remote country manor, and told she is to grant this man his every desire . . . or lose her life. But Grace is no common trollop. So she risks everything to save her virtue by planning a daring escap", "Beautiful Grace Paget has no reason not to believe these words. After all, she was kidnapped, spirited away to a remote country manor, and told she is to grant this man his every desire . . . or lose her life. But Grace is no common trollop. So she risks everything to save her virtue by planning a daring escape, even though she finds herself tempted by this handsome man. There is something in his eyes that makes her wonder if he is as dangerous as he would have her believe.", "Sheene knew nothing of the plan to bring him this woman. Locked up as a prisoner, called \"mad\" by all of the world, he will do anything to reclaim his life, and Grace's sensuous beauty has distracted him from his goals. And although he finds her irresistible, he is horrified to hold her against her will. Now, together, they must both revolt against the strange set of circumstances that have forced them together—for only then will Grace truly surrender to him . . . forever."], "author": "Anna Campbell", "num_pages": "373", "awards": ["RITA Award by Romance Writers of America Nominee for Regency Historical Romance (2008)"], "places": ["Somerset, England"], "character_names": ["Grace Paget", "Matthew Lansdowne, Marquess of Sheene"], "language": "English", "publish_date": "2009-01-01 00:00:00", "ISBN": "0061234923"},
{"url": "https://www.goodreads.com/book/show/68428.The_Final_Empire", "num_ratings": "279,464", "num_reviews": "19,044", "avg_ratings": 4.44, "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy"], "title": "The Final Empire", "description": ["In a world where ash falls from the sky, and mist dominates the night, an evil cloaks the land and stifles all life. The future of the empire rests on the shoulders of a troublemaker and his young apprentice. Together, can they fill the world with color once more?", "In Brandon Sanderson's intriguing tale of love, loss, despair and hope, a new kind of magic enters the stage —", "In a world where ash falls from the sky, and mist dominates the night, an evil cloaks the land and stifles all life. The future of the empire rests on the shoulders of a troublemaker and his young apprentice. Together, can they fill the world with color once more?", "In Brandon Sanderson's intriguing tale of love, loss, despair and hope, a new kind of magic enters the stage — Allomancy, a magic of the metals."], "author": "Brandon Sanderson", "num_pages": "541", "awards": ["Prix Elbakin.net for Meilleur roman fantasy traduit (2010)"], "places": ["Luthadel"], "character_names": ["Marsh", "Vin", "Elend Venture", "Sazed", "Kelsier", "Dockson", "Hammond", "Breeze", "Clubs", "Spook", "The Lord Ruler", "Lord Renoux", "Yeden", "OreSeur"], "language": "English", "publish_date": "2006-07-25 00:00:00", "ISBN": "076531178X"},
{"url": "https://www.goodreads.com/book/show/693018.Midnight_Angel", "num_ratings": "5,290", "num_reviews": "286", "avg_ratings": 3.65, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "Midnight Angel", "author": "Lisa Kleypas", "num_pages": "373", "awards": [], "places": ["London, England"], "character_names": ["Lucas Stokehurst", "Anastasia Kaptereva"], "language": "English", "publish_date": "1995-01-01 00:00:00", "ISBN": "0380773538"},
{"url": "https://www.goodreads.com/book/show/50718.This_Is_All_I_Ask", "num_ratings": "3,624", "num_reviews": "219", "avg_ratings": 4.28, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Medieval", "Science Fiction", "Time Travel", "Historical", "Historical Fiction", "Fiction", "Historical Romance", "Medieval Romance", "Fantasy", "Romance", "Clean Romance"], "title": "This Is All I Ask", "description": ["Gillian of Warewick knows no other treatment than the terrible physical and mental abuse issued by her father. When he arranges a match for Gillian with Christopher of Blackmour, she is fearful: Blackmour is rumored to be an evil sorcerer. When Gillian meets him, he proves to be far more of a man than her father is, yet he is unwilling to be a lover to Gillian. She finds t", "Gillian of Warewick knows no other treatment than the terrible physical and mental abuse issued by her father. When he arranges a match for Gillian with Christopher of Blackmour, she is fearful: Blackmour is rumored to be an evil sorcerer. When Gillian meets him, he proves to be far more of a man than her father is, yet he is unwilling to be a lover to Gillian. She finds that Blackmour has as many psychological scars to heal as she has physical scars."], "author": "Lynn Kurland", "num_pages": "432", "awards": [], "places": ["England"], "character_names": ["Gillian of Warewick", "Christopher Blackmour"], "language": "English", "publish_date": "2000-10-01 00:00:00", "ISBN": "0425180336"},
{"url": "https://www.goodreads.com/book/show/61880.Memory", "num_ratings": "13,282", "num_reviews": "611", "avg_ratings": 4.44, "genres": ["Science Fiction", "Fiction", "Space", "Space Opera"], "title": "Memory", "description": ["Forced to abandon his undercover role as leader of the Dendarii Mercenaries, Miles Vorkosigan persuades Emperor Gregor to appoint him Imperial Auditor so he can penetrate Barrayar’s intelligence and security operations (ImpSec). Simon Illyan, head of ImpSec and Miles’ former boss, is failing physically and mentally, and Miles sets out to find out why -- and who, if anyone,", "Forced to abandon his undercover role as leader of the Dendarii Mercenaries, Miles Vorkosigan persuades Emperor Gregor to appoint him Imperial Auditor so he can penetrate Barrayar’s intelligence and security operations (ImpSec). Simon Illyan, head of ImpSec and Miles’ former boss, is failing physically and mentally, and Miles sets out to find out why -- and who, if anyone, is behind Illyan’s rapid decline. Library Journal calls Miles “one of the genre’s most enterprising and engaging heroes”. A Hugo and Nebula Award finalist."], "author": "Lois McMaster Bujold", "num_pages": "509", "awards": ["Hugo Award Nominee for Best Novel (1997)", "Nebula Award Nominee for Best Novel (1997)", "Locus Award Nominee for Best SF Novel (1997)", "HOMer Award Nominee for Best Novel (1997)"], "places": [], "character_names": ["Ivan VorPatril", "Simon Illyan", "Gregor Vorbarra", "Alys Vorpatril", "Miles Vorkosigan"], "language": "English", "publish_date": "2005-08-16 00:00:00", "ISBN": "2290052302"},
{"url": "https://www.goodreads.com/book/show/13927.Son_of_the_Shadows", "num_ratings": "25,287", "num_reviews": "1,209", "avg_ratings": 4.32, "genres": ["Fantasy", "Romance", "Historical", "Historical Fiction", "Fiction", "Historical"], "title": "Son of the Shadows", "description": ["After years of comparative peace, darkness has fallen upon Ulster. Trouble is brewing and even those in the heart of the forest are not safe. Niamh, elder daughter of Sorcha, is required to make a strategic marriage, while her sister Liadan, who has the gift of Sight and her mother’s talent for healing, finds herself drawn into the shadowy world of the Painted Man and his", "After years of comparative peace, darkness has fallen upon Ulster. Trouble is brewing and even those in the heart of the forest are not safe. Niamh, elder daughter of Sorcha, is required to make a strategic marriage, while her sister Liadan, who has the gift of Sight and her mother’s talent for healing, finds herself drawn into the shadowy world of the Painted Man and his warrior band. There Liadan begins a journey that is to transform her life."], "author": "Juliet Marillier", "num_pages": "608", "awards": [], "places": [], "character_names": ["Hugh of Harrowfield", "Bran", "Sorcha", "Fat Janis", "Niamh", "Ciaran", "Liadan"], "language": "English", "publish_date": "2002-06-17 00:00:00", "ISBN": "0765343266"},
{"url": "https://www.goodreads.com/book/show/1583470.Predatory_Game", "num_ratings": "9,231", "num_reviews": "249", "avg_ratings": 4.31, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance"], "title": "Predatory Game", "description": [" ", " Saber Wynter is running from her past when she meets ex-Navy SEAL and Ghostwalker Jess Calhoun. But the riddles of both their pasts are about to collide, shattering the promise of their future with the ultimate betrayal."], "author": "Christine Feehan", "num_pages": "352", "awards": [], "places": ["United States of America"], "character_names": ["Saber Wynter", "Jess Calhoun"], "language": "English", "publish_date": "2008-02-26 00:00:00", "ISBN": "0515144282"},
{"url": "https://www.goodreads.com/book/show/799268.Tapestry", "num_ratings": "840", "num_reviews": "84", "avg_ratings": 3.75, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Fairy Tales", "Beauty and The Beast", "Historical", "Regency"], "title": "Tapestry", "description": ["For Lady Laura Blake, there is only one man in the world: Alex, the Earl of Cardiff. Yet ever since he was wounded in battle, Alex has locked himself away in his great stone castle at Heddon Hall. Believing himself to be less than a man, he conceals his ravaged face behind a leather mask...and hides his scarred soul beneath an icy aloofness.", "A mere child when he went off to", "For Lady Laura Blake, there is only one man in the world: Alex, the Earl of Cardiff. Yet ever since he was wounded in battle, Alex has locked himself away in his great stone castle at Heddon Hall. Believing himself to be less than a man, he conceals his ravaged face behind a leather mask...and hides his scarred soul beneath an icy aloofness.", "A mere child when he went off to war, Laura has blossomed into a beautiful young woman Alex scarcely recognizes. The compassion and desire he sees shining out of her eyes tempts him to ease his pain in her sweet, sensual embrace. But as need flames into uncontrollable passion, an evil fate conspires against them both, weaving a web of treachery and betrayal that could bring heartbreak or happiness to those who dare to love."], "author": "Karen Ranney", "num_pages": "380", "awards": [], "places": [], "character_names": ["Lady Laura Blake", "Alex, the Earl of Cardiff"], "language": "English", "publish_date": "1995-04-01 00:00:00", "ISBN": "0821749021"},
{"url": "https://www.goodreads.com/book/show/63038.The_Man_Who_Laughs", "num_ratings": "7,885", "num_reviews": "460", "avg_ratings": 4.22, "genres": ["Classics", "Fiction", "Cultural", "France", "Historical", "Historical Fiction", "European Literature", "French Literature"], "title": "The Man Who Laughs", "description": ["Victor Hugo's ", " (first published under the French title ", " in April 1869) is a sad and sordid tale -- not the sort of tale of the moment Hugo was known for. It starts on the night of January 29, 1690, a ten-year-old boy abandoned -- the stern men who've kept him since infancy have wearied of him. The boy wanders, barefoot and starving, through", "Victor Hugo's ", " (first published under the French title ", " in April 1869) is a sad and sordid tale -- not the sort of tale of the moment Hugo was known for. It starts on the night of January 29, 1690, a ten-year-old boy abandoned -- the stern men who've kept him since infancy have wearied of him. The boy wanders, barefoot and starving, through a snowstorm to reach a gibbet bearing the corpse of a hanged criminal. Beneath the gibbet is a ragged woman, frozen to death. The boy is about to move onward when he hears a sound within the woman's garments: He discovers an infant girl, barely alive, clutching the woman's breast. A single drop of frozen milk, resembling a pearl, is on the woman's lifeless breast..."], "author": "Victor Hugo", "num_pages": "672", "awards": [], "places": [], "character_names": ["Dea", "Gwynplaine", "Ursus"], "language": "English", "publish_date": "2006-08-19 00:00:00", "ISBN": "1934169005"},
{"url": "https://www.goodreads.com/book/show/61898.Beguilement", "num_ratings": "9,913", "num_reviews": "822", "avg_ratings": 3.73, "genres": ["Romance", "Fiction", "Science Fiction Fantasy", "Fantasy", "Magic"], "title": "Beguilement", "description": ["Alternate Cover edition ", ".", "Troubled young Fawn Bluefield seeks a life beyond her family's farm. Enroute to the city, she encounters a patrol of Lakewalkers. The necromancers armed with human bone knives fight \"malices\", immortal entities that draw out life, enslaving humans and animals. Dag saves Fawn from a malice - at a devastating cost. Their fates are now bound in a", "Alternate Cover edition ", ".", "Troubled young Fawn Bluefield seeks a life beyond her family's farm. Enroute to the city, she encounters a patrol of Lakewalkers. The necromancers armed with human bone knives fight \"malices\", immortal entities that draw out life, enslaving humans and animals. Dag saves Fawn from a malice - at a devastating cost. Their fates are now bound in a remarkable journey."], "author": "Lois McMaster Bujold", "num_pages": "372", "awards": [], "places": [], "character_names": ["Fawn Bluefield", "Dag Redwing Hickory Oleana"], "language": "English", "publish_date": "2011-09-27 00:00:00", "ISBN": "0061139076"},
{"url": "https://www.goodreads.com/book/show/10806008-peter-nimble-and-his-fantastic-eyes", "num_ratings": "7,255", "num_reviews": "1,086", "avg_ratings": 4.05, "genres": ["Fantasy", "Childrens", "Middle Grade", "Adventure", "Fiction", "Childrens", "Young Adult"], "title": "Peter Nimble and His Fantastic Eyes", "description": [" is the utterly beguiling tale of a ten-year-old blind orphan who has been schooled in a life of thievery. One fateful afternoon, he steals a box from a mysterious traveling haberdasher—a box that contains three pairs of magical eyes. When he tries the first pair, he is instantly transported to a hidden island where he is presented with a", " is the utterly beguiling tale of a ten-year-old blind orphan who has been schooled in a life of thievery. One fateful afternoon, he steals a box from a mysterious traveling haberdasher—a box that contains three pairs of magical eyes. When he tries the first pair, he is instantly transported to a hidden island where he is presented with a special quest: to travel to the dangerous Vanished Kingdom and rescue a people in need. Along with his loyal sidekick—a knight who has been turned into an unfortunate combination of horse and cat—and the magic eyes, he embarks on an unforgettable, swashbuckling adventure to discover his true destiny."], "author": "Jonathan Auxier", "num_pages": "400", "awards": ["Monica Hughes Award for Science Fiction and Fantasy Nominee (2012)", "Diamond Willow Award (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-01 00:00:00", "ISBN": "1419700251"},
{"url": "https://www.goodreads.com/book/show/896625.A_Rose_in_Winter", "num_ratings": "9,101", "num_reviews": "466", "avg_ratings": 4.15, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Fiction"], "title": "A Rose in Winter", "description": ["A HEART TORMENTED ", "Erienne's father had given her hand to the richest suitor. She was now Lady Saxton, mistress of a great manor all but ruined by fire, wife to a man whose mysteriously shrouded form aroused fear and pity. Yet even as she fell in love with her adoring husband, Erienne despaired of freeing her heart from the dashingly handsome Yankee who couldn't forget her.", "A HEART TORMENTED ", "Erienne's father had given her hand to the richest suitor. She was now Lady Saxton, mistress of a great manor all but ruined by fire, wife to a man whose mysteriously shrouded form aroused fear and pity. Yet even as she fell in love with her adoring husband, Erienne despaired of freeing her heart from the dashingly handsome Yankee who couldn't forget her. The beautiful Erienne, once filled with young dreams of romance, was now a wife and woman ... torn between the two men she loved."], "author": "Kathleen E. Woodiwiss", "num_pages": "567", "awards": [], "places": ["England"], "character_names": ["Christopher Seton", "Erienne Fleming"], "language": "English", "publish_date": "1983-10-16 00:00:00", "ISBN": "0380844001"},
{"url": "https://www.goodreads.com/book/show/17343.Till_We_Have_Faces", "num_ratings": "43,609", "num_reviews": "3,526", "avg_ratings": 4.18, "genres": ["Fiction", "Fantasy", "Classics", "Fantasy", "Mythology", "Christian", "Religion"], "title": "Till We Have Faces", "description": ["In this timeless tale of two mortal princesses- one beautiful and one unattractive- C.S. Lewis reworks the classical myth of Cupid and Psyche into an enduring piece of contemporary fiction. This is the story of Orual, Psyche's embittered and ugly older sister, who posessively and harmfully loves Psyche. Much to Orual's frustration, Psyche is loved by Cupid, the god of love", "In this timeless tale of two mortal princesses- one beautiful and one unattractive- C.S. Lewis reworks the classical myth of Cupid and Psyche into an enduring piece of contemporary fiction. This is the story of Orual, Psyche's embittered and ugly older sister, who posessively and harmfully loves Psyche. Much to Orual's frustration, Psyche is loved by Cupid, the god of love himself, setting the troubled Orual on a path of moral development.", "Set against the backdrop of Glome, a barbaric, pre-Christian world, the struggles between sacred and profane love are illuminated as Orual learns that we cannot understand the intent of the gods \"till we have faces\" and sincerity in our souls and selves."], "author": "C.S. Lewis", "num_pages": "313", "awards": ["Tähtifantasia Award Nominee (2014)"], "places": ["Glome"], "character_names": ["Psyche (mythology)", "Orual"], "language": "English", "publish_date": "2006-08-06 00:00:00", "ISBN": "0156904365"},
{"url": "https://www.goodreads.com/book/show/13872.Geek_Love", "num_ratings": "47,834", "num_reviews": "5,304", "avg_ratings": 3.98, "genres": ["Fiction", "Horror", "Fantasy", "Contemporary"], "title": "Geek Love", "description": [" is the story of the Binewskis, a carny family whose mater- and paterfamilias set out–with the help of amphetamine, arsenic, and radioisotopes–to breed their own exhibit of human oddities. There’s Arturo the Aquaboy, who has flippers for limbs and a megalomaniac ambition worthy of Genghis Khan . . . Iphy and Elly, the lissome Siamese twins . . . albino hunchback O", " is the story of the Binewskis, a carny family whose mater- and paterfamilias set out–with the help of amphetamine, arsenic, and radioisotopes–to breed their own exhibit of human oddities. There’s Arturo the Aquaboy, who has flippers for limbs and a megalomaniac ambition worthy of Genghis Khan . . . Iphy and Elly, the lissome Siamese twins . . . albino hunchback Oly, and the outwardly normal Chick, whose mysterious gifts make him the family’s most precious–and dangerous–asset. ", "As the Binewskis take their act across the backwaters of the U.S., inspiring fanatical devotion and murderous revulsion; as its members conduct their own Machiavellian version of sibling rivalry,", " throws its sulfurous light on our notions of the freakish and the normal, the beautiful and the ugly, the holy and the obscene. Family values will never be the same."], "author": "Katherine Dunn", "num_pages": "348", "awards": ["National Book Award Finalist for Fiction (1989)"], "places": ["Oregon"], "character_names": ["Olympia \"Oly\" Binewski", "Arturo \"Arty\" Binewski", "Al Binewski"], "language": "English", "publish_date": "2002-06-11 00:00:00", "ISBN": "0375713344"},
{"url": "https://www.goodreads.com/book/show/22290.Invisible_Monsters", "num_ratings": "106,406", "num_reviews": "4,984", "avg_ratings": 4.0, "genres": ["Fiction", "Contemporary", "Novels"], "title": "Invisible Monsters", "description": ["She's a catwalk model who has everything: a boyfriend, a career, a loyal best friend. But when a sudden motor 'accident' leaves her disfigured and incapable of speech, she goes from being the beautiful centre of attention to being an invisible monster, so hideous that no one will acknowledge she exists.", "Enter Brandy Alexander, Queen Supreme, one operation away from being a", "She's a catwalk model who has everything: a boyfriend, a career, a loyal best friend. But when a sudden motor 'accident' leaves her disfigured and incapable of speech, she goes from being the beautiful centre of attention to being an invisible monster, so hideous that no one will acknowledge she exists.", "Enter Brandy Alexander, Queen Supreme, one operation away from being a real woman, who will teach her that reinventing yourself means erasing your past and making up something better, and that salvation hides in the last place you'll ever want to look.", "The narrator must exact revenge upon Evie, her best friend and fellow model; kidnap Manus, her two-timing ex-boyfriend; and hit the road with Brandy in search of a brand-new past, present and future."], "author": "Chuck Palahniuk", "num_pages": "297", "awards": [], "places": [], "character_names": ["Shannon McFarland", "Brandy Alexander", "Evie Cottrell", "Manus Kelley", "The Rhea Sisters"], "language": "English", "publish_date": "2000-08-16 00:00:00", "ISBN": "0099285444"},
{"url": "https://www.goodreads.com/book/show/959745.The_Spymaster_s_Lady", "num_ratings": "6,048", "num_reviews": "739", "avg_ratings": 4.02, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Fiction", "Spy Thriller", "Espionage"], "title": "The Spymaster's Lady", "description": ["She's braved battlefields, stolen dispatches, played roles from worldly to naive, lady to boy. But Annique Villiers, elusive spy Fox Cub, is thrown in prison with British spymaster Robert Grey, ordered to enter France and bring her back. Their uneasy alliance holds, but passion builds as they flee."], "author": "Joanna Bourne", "num_pages": "373", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Romance & Best Historical Set in the U.K. & Best Romance Couple & Best Romance Hero & Best Romance Heroine (2009)", "RITA Award by Romance Writers of America Nominee for Historical Romance (2009)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Historical Romantic Adventure (2008)", "DABWAHA Romance Tournament for Best Historical Romance (2009)"], "places": [], "character_names": ["Annique Villiers", "Robert Greyson Fordham"], "language": "English", "publish_date": "2008-01-02 00:00:00", "ISBN": "0425219607"},
{"url": "https://www.goodreads.com/book/show/5246.Ethan_Frome", "num_ratings": "93,773", "num_reviews": "4,576", "avg_ratings": 3.37, "genres": ["Classics", "Fiction", "Literature", "Academic", "School"], "title": "Ethan Frome", "description": ["Ethan Frome works his unproductive farm and struggles to maintain a bearable existence with his difficult, suspicious, and hypochondriac wife, Zeena. But when Zeena's vivacious cousin enters their household as a \"hired girl\", Ethan finds himself obsessed with her and with the possibilities for happiness she comes to represent. ", "In one of American fiction's finest and most i", "Ethan Frome works his unproductive farm and struggles to maintain a bearable existence with his difficult, suspicious, and hypochondriac wife, Zeena. But when Zeena's vivacious cousin enters their household as a \"hired girl\", Ethan finds himself obsessed with her and with the possibilities for happiness she comes to represent. ", "In one of American fiction's finest and most intense narratives, Edith Wharton moves this ill-starred trio toward their tragic destinies. Different in both tone and theme from Wharton's other works, Ethan Frome has become perhaps her most enduring and most widely read novel."], "author": "Edith Wharton", "num_pages": "191", "awards": [], "places": ["Starkfield, Massachusetts", "New England", "Massachusetts"], "character_names": ["Ethan Frome", "Mrs. Hale", "Zeena Frome", "Mattie Silver", "Mrs. Ned Hale", "Denis Eady", "Jotham Powell", "Harmon Gow", "Michael Eady", "Lawyer Varnum", "Ned Hale", "Orin Silver", "Andrew Hale", "Aunt Martha Pierce", "Mrs. Frome", "Mrs. Homan", "Dr. Buck", "Eliza Spears", "Aunt Philura Maple", "Daniel Byrne", "Dr. Kidder", "Mrs. Varnum"], "language": "English", "publish_date": "2006-09-28 00:00:00", "ISBN": "0142437808"},
{"url": "https://www.goodreads.com/book/show/61899.A_Civil_Campaign", "num_ratings": "13,807", "num_reviews": "646", "avg_ratings": 4.43, "genres": ["Science Fiction", "Romance", "Fiction", "Space", "Space Opera"], "title": "A Civil Campaign", "description": ["Miles Vorkosigan has a problem: unrequited love for the beautiful widow Ekaterin Vorsoisson, violently allergic to marriage after her first exposure. If a frontal assault won't do, Miles thinks, try subterfuge. He has a cunning plan... Lord Mark Vorkosigan, Miles' brother, also has a problem: his love has just become unrequited again. But he has a cunning plan... Lord Ivan", "Miles Vorkosigan has a problem: unrequited love for the beautiful widow Ekaterin Vorsoisson, violently allergic to marriage after her first exposure. If a frontal assault won't do, Miles thinks, try subterfuge. He has a cunning plan... Lord Mark Vorkosigan, Miles' brother, also has a problem: his love has just become unrequited again. But he has a cunning plan... Lord Ivan Vorpatril, Mile's cousin, has a problem: unrequited love in general. But he too has a cunning plan... ", "A complex story, as the various members of Miles' family attempt to find their one true love, and a measure of destiny. This against a background of domestic political squabbles and an earnest attempt at capitalist enterprise."], "author": "Lois McMaster Bujold", "num_pages": "544", "awards": ["Hugo Award Nominee (2000)", "Nebula Award Nominee for Best Novel (2000)", "Locus Award Nominee for Best Science Fiction Novel (2000)", "James Tiptree Jr. Award Nominee for Longlist (1999)"], "places": ["Barrayar"], "character_names": ["Miles Vorkosigan"], "language": "English", "publish_date": "2000-08-01 00:00:00", "ISBN": "0671578855"},
{"url": "https://www.goodreads.com/book/show/68427.Elantris", "num_ratings": "126,491", "num_reviews": "7,470", "avg_ratings": 4.17, "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy"], "title": "Elantris", "description": ["Elantris was the capital of Arelon: gigantic, beautiful, literally radiant, filled with benevolent beings who used their powerful magical abilities for the benefit of all. Yet each of these demigods was once an ordinary person until touched by the mysterious transforming power of the Shaod. Ten years ago, without warning, the magic failed. Elantrians became wizened, leper-", "Elantris was the capital of Arelon: gigantic, beautiful, literally radiant, filled with benevolent beings who used their powerful magical abilities for the benefit of all. Yet each of these demigods was once an ordinary person until touched by the mysterious transforming power of the Shaod. Ten years ago, without warning, the magic failed. Elantrians became wizened, leper-like, powerless creatures, and Elantris itself dark, filthy, and crumbling.", "Arelon's new capital, Kae, crouches in the shadow of Elantris. Princess Sarene of Teod arrives for a marriage of state with Crown Prince Raoden, hoping -- based on their correspondence -- to also find love. She finds instead that Raoden has died and she is considered his widow. Both Teod and Arelon are under threat as the last remaining holdouts against the imperial ambitions of the ruthless religious fanatics of Fjordell. So Sarene decides to use her new status to counter the machinations of Hrathen, a Fjordell high priest who has come to Kae to convert Arelon and claim it for his emperor and his god.", "But neither Sarene nor Hrathen suspect the truth about Prince Raoden. Stricken by the same curse that ruined Elantris, Raoden was secretly exiled by his father to the dark city. His struggle to help the wretches trapped there begins a series of events that will bring hope to Arelon, and perhaps reveal the secret of Elantris itself.", "A rare epic fantasy that doesn't recycle the classics and that is a complete and satisfying story in one volume, Elantris is fleet and fun, full of surprises and characters to care about. It's also the wonderful debut of a welcome new star in the constellation of fantasy."], "author": "Brandon Sanderson", "num_pages": "622", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-05-30 00:00:00", "ISBN": "0765350378"},
{"url": "https://www.goodreads.com/book/show/544891.Beastly", "num_ratings": "163,064", "num_reviews": "8,858", "avg_ratings": 3.84, "genres": ["Young Adult", "Fantasy", "Romance", "Fantasy", "Fairy Tales", "Retellings"], "title": "Beastly", "description": ["I am a beast.", "A beast. Not quite wolf or bear, gorilla or dog but a horrible new creature who walks upright—a creature with fangs and claws and hair springing from every pore. I am a monster.", "You think I'm talking fairy tales? No way. The place is New York City. The time is now. It's no deformity, no disease. And I'll stay this way forever—ruined—unless I can break the spell", "I am a beast.", "A beast. Not quite wolf or bear, gorilla or dog but a horrible new creature who walks upright—a creature with fangs and claws and hair springing from every pore. I am a monster.", "You think I'm talking fairy tales? No way. The place is New York City. The time is now. It's no deformity, no disease. And I'll stay this way forever—ruined—unless I can break the spell.", "Yes, the spell, the one the witch in my English class cast on me. Why did she turn me into a beast who hides by day and prowls by night? I'll tell you. I'll tell you how I used to be Kyle Kingsbury, the guy you wished you were, with money, perfect looks, and the perfect life. And then, I'll tell you how I became perfectly . . . beastly."], "author": "Alex Flinn", "num_pages": "304", "awards": ["California Young Readers Medal Nominee for Young Adult (2012)", "Lincoln Award Nominee (2012)", "Missouri Gateway Readers Award Nominee (2010)"], "places": ["New York (the state)", "New York City, New York"], "character_names": ["Magda", "Kyle Kingsbury", "Will Fratalli", "Linda \"Lindy\" Owens", "Kendra Hilferty", "Rob Kingsbury", "Mr. Anderson"], "language": "English", "publish_date": "2007-10-02 00:00:00", "ISBN": "0060874163"},
{"url": "https://www.goodreads.com/book/show/110391.The_Duke_and_I", "num_ratings": "68,670", "num_reviews": "2,978", "avg_ratings": 4.1, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency"], "title": "The Duke and I", "description": ["By all accounts, ", " is on the verge of proposing to his best friend’s sister, the lovely—and almost-on-the-shelf—", ". But the two of them know the truth—it’s all an elaborate plan to keep Simon free from marriage-minded", "By all accounts, ", " is on the verge of proposing to his best friend’s sister, the lovely—and almost-on-the-shelf—", ". But the two of them know the truth—it’s all an elaborate plan to keep Simon free from marriage-minded society mothers. And as for Daphne, surely she will attract some worthy suitors now that it seems a duke has declared her desirable.", "But as Daphne waltzes across ballroom after ballroom with Simon, it’s hard to remember that their courtship is a complete sham. Maybe it’s his devilish smile, certainly it’s the way his eyes seem to burn every time he looks at her… but somehow Daphne is falling for the dashing duke… for real! And now she must do the impossible and convince the handsome rogue that their clever little scheme deserves a slight alteration, and that nothing makes quite as much sense as falling in love…"], "author": "Julia Quinn", "num_pages": "384", "awards": ["RITA Award by Romance Writers of America Nominee for Short Historical Romance (2001)"], "places": ["London, England"], "character_names": ["Daphne Bridgerton", "Simon Basset, Duke of Hastings"], "language": "English", "publish_date": "2006-06-27 00:00:00", "ISBN": "0380800829"},
{"url": "https://www.goodreads.com/book/show/61884.Komarr", "num_ratings": "12,296", "num_reviews": "444", "avg_ratings": 4.29, "genres": ["Science Fiction", "Fiction", "Space", "Space Opera", "Romance"], "title": "Komarr", "description": ["Komarr could be a garden with a thousand more years' work, or an uninhabitable wasteland if the terraforming fails. Now, the solar mirror vital to the terraforming of the conquered planet has been shattered by a ship hurtling off course. The Emperor of Barrayar sends his newest imperial auditor, Lord Miles Vorkosigan, to find out why. The choice is not a popular one on Kom", "Komarr could be a garden with a thousand more years' work, or an uninhabitable wasteland if the terraforming fails. Now, the solar mirror vital to the terraforming of the conquered planet has been shattered by a ship hurtling off course. The Emperor of Barrayar sends his newest imperial auditor, Lord Miles Vorkosigan, to find out why. The choice is not a popular one on Komarr, where a betrayal a generation before drenched the name of Vorkosigan in blood. Thus, the Komarrans surrounding Miles could be loyal subjects, potential hostages, innocent victims, or rebels ready for revenge. Lies within lies, treachery within treachery, Miles is caught in a race against time to stop a plot that could exile him from Barrayar forever. His burning hope lies in an unexpected ally, one with wounds as deep and honor as beleaguered as his own."], "author": "Lois McMaster Bujold", "num_pages": "384", "awards": ["Minnesota Book Award for Fantasy & Science Fiction (1999)"], "places": [], "character_names": ["Miles Vorkosigan"], "language": "English", "publish_date": "1999-04-01 00:00:00", "ISBN": "0671578081"},
{"url": "https://www.goodreads.com/book/show/8089.Rose_Daughter", "num_ratings": "17,459", "num_reviews": "1,040", "avg_ratings": 3.77, "genres": ["Fantasy", "Fantasy", "Fairy Tales", "Young Adult", "Romance", "Fiction", "Retellings"], "title": "Rose Daughter", "description": ["It is the heart of this place, and it is dying, says the Beast. And it is true; the center of the Beast's palace, the glittering glasshouse that brings Beauty both comfort and delight in her strange new environment, is filled with leafless brown rosebushes. But deep within this enchanted world, new life, at once subtle and strong, is about to awaken.", "Twenty years ago, Robin", "It is the heart of this place, and it is dying, says the Beast. And it is true; the center of the Beast's palace, the glittering glasshouse that brings Beauty both comfort and delight in her strange new environment, is filled with leafless brown rosebushes. But deep within this enchanted world, new life, at once subtle and strong, is about to awaken.", "Twenty years ago, Robin McKinley dazzled readers with the power of her novel ", ". Now this extraordinarily gifted novelist returns to the story of Beauty and the Beast with a fresh perspective, ingenuity, and mature insight. With ", ", she presents her finest and most deeply felt work--a compelling, richly imagined, and haunting exploration of the transformative power of love."], "author": "Robin McKinley", "num_pages": "304", "awards": ["Mythopoeic Fantasy Award Nominee for Children's Literature (1998)"], "places": [], "character_names": [], "language": "English", "publish_date": "1998-12-01 00:00:00", "ISBN": "0441005837"},
{"url": "https://www.goodreads.com/book/show/51606.Johnny_Got_His_Gun", "num_ratings": "29,893", "num_reviews": "1,948", "avg_ratings": 4.16, "genres": ["Fiction", "Classics", "War", "Historical", "Historical Fiction", "Literature", "Horror"], "title": "Johnny Got His Gun", "description": ["This was no ordinary war. This was a war to make the world safe for democracy. And if democracy was made safe, then nothing else mattered--not the millions of dead bodies, nor the thousands of ruined lives... This is no ordinary novel. This is a novel that never takes the easy way out: it is shocking, violent, terrifying, horrible, uncompromising, brutal, remorseless and g", "This was no ordinary war. This was a war to make the world safe for democracy. And if democracy was made safe, then nothing else mattered--not the millions of dead bodies, nor the thousands of ruined lives... This is no ordinary novel. This is a novel that never takes the easy way out: it is shocking, violent, terrifying, horrible, uncompromising, brutal, remorseless and gruesome... but so is war. Winner of the National Book Award", "\"Mr. Trumbo sets this story down almost without pause or punctuation and with a fury amounting to eloquence.\"-- \"The New York Times\"", "\"It is hard to imaging a more persuasive argument for staying out of war than this smooth, savage, brilliant tale.\"-- \"Chicago Daily News\""], "author": "Dalton Trumbo", "num_pages": "309", "awards": ["National Book Award for Most Original Book (1939)"], "places": [], "character_names": ["Joe Bonham"], "language": "English", "publish_date": "2000-08-01 00:00:00", "ISBN": "0806512814"},
{"url": "https://www.goodreads.com/book/show/3585344-kiss-of-a-demon-king", "num_ratings": "35,165", "num_reviews": "1,200", "avg_ratings": 4.35, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Fantasy", "Paranormal", "Demons"], "title": "Kiss of a Demon King", "description": ["From ", " bestselling author Kresley Cole comes this spellbinding story of a demon king trapped by an enchantress for her wanton purposes -- and the scorching aftermath that follows when he turns the tables and claims her as his captive.", "Sabine, Sorceress of Illusions: the evil beauty who surrenders her body, but not her heart.", "Rydstr", "From ", " bestselling author Kresley Cole comes this spellbinding story of a demon king trapped by an enchantress for her wanton purposes -- and the scorching aftermath that follows when he turns the tables and claims her as his captive.", "Sabine, Sorceress of Illusions: the evil beauty who surrenders her body, but not her heart.", "Rydstrom Woede: the ruthless warrior who vows to keep her at all costs.", "With each smoldering encounter, their shared hunger only increases. If they can defeat the sinister enemy that stands between them, will Sabine make the ultimate sacrifice for her demon? Or will the proud king lay down his crown and arms to save his sorceress?"], "author": "Kresley Cole", "num_pages": "417", "awards": ["RITA Award by Romance Writers of America for Best Paranormal Romance (2010)", "Goodreads Choice Award Nominee for Romance (2009)"], "places": ["Rothkalina"], "character_names": ["Rydstrom Woede", "Sabine, Queen of Illusions"], "language": "English", "publish_date": "2009-01-20 00:00:00", "ISBN": "1416580948"},
{"url": "https://www.goodreads.com/book/show/68483.The_Vor_Game", "num_ratings": "18,007", "num_reviews": "631", "avg_ratings": 4.28, "genres": ["Science Fiction", "Space", "Space Opera", "Fiction"], "title": "The Vor Game", "description": ["Hugo Award Winner! Miles Vorkosigan graduates from the Academy, joins a mutiny, is placed under house arrest, goes on a secret mission, reconnects with his loyal Dendarii Mercenaries, rescues his Emperor, and thwarts an interstellar war. Situation normal, if you're Miles."], "author": "Lois McMaster Bujold", "num_pages": "346", "awards": ["Hugo Award for Best Novel (1991)"], "places": [], "character_names": ["Miles Vorkosigan"], "language": "English", "publish_date": "2002-04-30 00:00:00", "ISBN": "0671720147"},
{"url": "https://www.goodreads.com/book/show/190507.Phantom", "num_ratings": "10,460", "num_reviews": "769", "avg_ratings": 4.33, "genres": ["Fiction", "Historical", "Historical Fiction", "Romance", "Historical", "Fantasy", "Horror"], "title": "Phantom", "description": ["This incredible portrait of Erik--the Phantom--recreates his entire life, from his survival as a child in a carnival freak show to his creative genius behind the Paris Opera House--and its labyrinthine world below--to his discovery of love."], "author": "Susan  Kay", "num_pages": "468", "awards": ["Romantic Novel of the Year (RoNa's) Award (1991)"], "places": ["Paris"], "character_names": [], "language": "English", "publish_date": "2006-03-15 00:00:00", "ISBN": "1933626046"},
{"url": "https://www.goodreads.com/book/show/816870.Johnny_Tremain", "num_ratings": "35,440", "num_reviews": "2,046", "avg_ratings": 3.63, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Young Adult", "Childrens", "Historical"], "title": "Johnny Tremain", "description": ["Johnny Tremain, a young apprentice silversmith, is caught up in the danger and excitement of 1775 Boston, just before the Revolutionary War. But even more gripping than living through the drama of Revolutionary Boston is the important discovery Johnny makes in his own life."], "author": "Esther Forbes", "num_pages": "322", "awards": ["Newbery Medal (1944)"], "places": ["Boston, Massachusetts", "Massachusetts"], "character_names": ["John Hancock", "Mrs. Lapham", "Dove", "Johnny Tremain", "Cilla Lapham", "Isannah Lapham", "Dorcas Lapham", "Madge Lapham", "Dusty Miller", "Lavinia Lyte", "Sam Adams", "Paul Revere", "Rab Silsbee", "James Otis"], "language": "English", "publish_date": "1987-04-01 00:00:00", "ISBN": "0440442508"},
{"url": "https://www.goodreads.com/book/show/833923.England_s_Perfect_Hero", "num_ratings": "5,781", "num_reviews": "282", "avg_ratings": 4.08, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical Romance", "Regency Romance", "Historical", "Historical Fiction"], "title": "England's Perfect Hero", "description": ["Lucinda Barrett's best friends ended up married to the men to whom they delivered their \"lessons in love.\" So Lucinda decides to choose someone who definitely needs lessons, but someone who will not complicate her life. And that person is definitely not Robert Carroway.", "Robert is nothing if not complicated, and though he is the brother of a viscount, he rarely goes about so", "Lucinda Barrett's best friends ended up married to the men to whom they delivered their \"lessons in love.\" So Lucinda decides to choose someone who definitely needs lessons, but someone who will not complicate her life. And that person is definitely not Robert Carroway.", "Robert is nothing if not complicated, and though he is the brother of a viscount, he rarely goes about society, and finds the weather and hat fashions ludicrous subjects for discussion. Robert is attracted to Lucinda's unpretentious ways, her serenity and her kindness. When she chooses someone for her love lessons, Robert offers to help her deliver her lessons, but sets out to convince the woman he has fallen for to take a chance on love... and on him."], "author": "Suzanne Enoch", "num_pages": "374", "awards": [], "places": [], "character_names": ["Lucinda Barrett", "Robert Carroway"], "language": "English", "publish_date": "2004-02-24 00:00:00", "ISBN": "0060543132"},
{"url": "https://www.goodreads.com/book/show/31242.Bleak_House", "num_ratings": "83,588", "num_reviews": "3,455", "avg_ratings": 4.0, "genres": ["Classics", "Fiction", "Literature", "Literature", "19th Century"], "title": "Bleak House", "description": ["Bleak House is a novel by Charles Dickens, published in 20 monthly installments between March 1852 and September 1853. It is held to be one of Dickens's finest novels, containing one of the most vast, complex and engaging arrays of minor characters and sub-plots in his entire canon.", "At the novel's core is long-running litigation in England's Court of Chancery, Jarndyce v Ja", "Bleak House is a novel by Charles Dickens, published in 20 monthly installments between March 1852 and September 1853. It is held to be one of Dickens's finest novels, containing one of the most vast, complex and engaging arrays of minor characters and sub-plots in his entire canon.", "At the novel's core is long-running litigation in England's Court of Chancery, Jarndyce v Jarndyce, which has far-reaching consequences for all involved. The litigation, which already has taken many years and consumed between £60,000 and £70,000 in court costs, is emblematic of the failure of Chancery.", "Though Chancery lawyers and judges criticised Dickens's portrait of Chancery as exaggerated and unmerited, his novel helped to spur an ongoing movement that culminated in the enactment of legal reform in the 1870s."], "author": "Charles Dickens", "num_pages": "1017", "awards": [], "places": ["United Kingdom"], "character_names": ["Esther Summerson", "Lady Dedlock", "John Jarndyce", "Sir Leicester Dedlock"], "language": "English", "publish_date": "2006-01-06 00:00:00", "ISBN": "0143037617"},
{"url": "https://www.goodreads.com/book/show/1746470.Dream_Chaser", "num_ratings": "25,863", "num_reviews": "748", "avg_ratings": 4.2, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Fantasy", "Paranormal", "Vampires"], "title": "Dream Chaser", "description": ["8 hours, 7 minutes", "From #1 New York Times best-selling Author Sherrilyn Kenyon", "The spellbinding Dream-Hunter series continues!", "Hades doesn't often give second chances....", "Xypher has one month on Earth to redeem himself through one good deed or be condemned to eternal torture in Tarturus. But redemption means little to a demigod who only wants vengeance on the one who caused hi", "8 hours, 7 minutes", "From #1 New York Times best-selling Author Sherrilyn Kenyon", "The spellbinding Dream-Hunter series continues!", "Hades doesn't often give second chances....", "Xypher has one month on Earth to redeem himself through one good deed or be condemned to eternal torture in Tarturus. But redemption means little to a demigod who only wants vengeance on the one who caused his downfall.Until one day in a cemetery....", "Simone Dubois is a medical examiner with a real knack for the job. Those who are wrongfully killed appear to her and help her find the evidence the police need to convict their killers. But when a man appears and tells her that she's more than just a psychic, she's convinced he's insane.Now the fate of the world hangs in her hands....", "It was bad enough when just the dead relied on her. Now's there's the seductive Dream-Hunter Xypher who needs Simone's help in opening a portal to the Atlantean hell realm to fight insatiable demons. The future of mankind is at stake - and so is her life. The only question now is: Who is the bigger threat: the demons out to kill her, or the man who has left her forever changed?", "©2008 Sherrilyn Kenyon; (P)2012 Macmillan Audio"], "author": "Sherrilyn Kenyon", "num_pages": "369", "awards": [], "places": ["New Orleans, Louisiana"], "character_names": ["Xypher Oneroi Skotos", "Simone Dubois"], "language": "English", "publish_date": "2008-02-05 00:00:00", "ISBN": "0312938829"},
{"url": "https://www.goodreads.com/book/show/7234908-whole", "num_ratings": "189", "num_reviews": "24", "avg_ratings": 3.26, "genres": ["Romance", "Disability", "Young Adult", "Romance", "Contemporary Romance", "Fiction", "Contemporary"], "title": "Whole", "description": ["\"A young man wanting to be whole; a young woman certain she can never be. A uniquely conflicted love- suspenseful, provocative and deeply moving.\"", " -Shelley Berman Elizabeth Foster is a young woman with a promising future. She has a perfect family in a nice neighborhood and she is getting ready to graduate from high school and begin her life. The only problem is a dark secr", "\"A young man wanting to be whole; a young woman certain she can never be. A uniquely conflicted love- suspenseful, provocative and deeply moving.\"", " -Shelley Berman Elizabeth Foster is a young woman with a promising future. She has a perfect family in a nice neighborhood and she is getting ready to graduate from high school and begin her life. The only problem is a dark secret that she has kept hidden all her life. No one would ever guess that the quiet and shy girl has a rare sexuality. She is only attracted to men with physical disabilities.", "When she meets the paraplegic man of her dreams she tries to keep him from finding out the truth about her interest, but she can't lie to him forever.", "Stewart Masterson was once a champion surfer until he lost the use of his legs. He came to Massachusetts to leave behind his past. He is making a new life for himself when he meets Elizabeth. Together they begin a terrifying journey of self-discovery.", "Will Elizabeth and Stewart learn to accept the broken parts in themselves and each other? Will they be able to re-define what it means to be whole or will fear and guilt drive them apart?"], "author": "Ruth Madison", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-04-01 00:00:00", "ISBN": "144013541X"},
{"url": "https://www.goodreads.com/book/show/6278019-heart-s-blood", "num_ratings": "12,392", "num_reviews": "1,247", "avg_ratings": 4.09, "genres": ["Fantasy", "Romance", "Fantasy", "Fairy Tales", "Young Adult", "Retellings", "Historical", "Historical Fiction", "Fantasy", "Magic"], "title": "Heart's Blood", "description": ["Whistling Tor is a place of secrets, a mysterious, wooded hill housing the crumbling fortress of a chieftain whose name is spoken throughout the district in tones of revulsion and bitterness. A curse lies over Anluan's family and his people; those woods hold a perilous force whose every whisper threatens doom.", "For young scribe Caitrin it is a safe haven. This place where no", "Whistling Tor is a place of secrets, a mysterious, wooded hill housing the crumbling fortress of a chieftain whose name is spoken throughout the district in tones of revulsion and bitterness. A curse lies over Anluan's family and his people; those woods hold a perilous force whose every whisper threatens doom.", "For young scribe Caitrin it is a safe haven. This place where nobody else is prepared to go seems exactly what she needs, for Caitrin is fleeing her own demons. As Caitrin comes to know Anluan and his home in more depth she realizes that it is only through her love and determination that the curse can be broken and Anluan and his people set free."], "author": "Juliet Marillier", "num_pages": "405", "awards": ["Aurealis Award Nominee for Best Fantasy Novel (2010)", "Sir Julius Vogel Award (2010)"], "places": [], "character_names": ["Tomás Carreño", "Aislinn", "Irial", "Magnus", "Anluan", "Caitrin", "Rioghan", "Cillian", "Ita", "Eichri", "Mella", "Nechtan", "Olcan", "Cathaír", "Líoch", "Orna", "Maraid", "Gearróg", "Conan (Heart's Blood)"], "language": "English", "publish_date": "2009-10-02 00:00:00", "ISBN": "0230017916"},
{"url": "https://www.goodreads.com/book/show/92517.The_Glass_Menagerie", "num_ratings": "98,750", "num_reviews": "2,079", "avg_ratings": 3.68, "genres": ["Plays", "Classics", "Drama", "Fiction", "Plays", "Theatre"], "title": "The Glass Menagerie", "description": ["The story of a mother, her son and daughter, and her daughter's suitor that brings to life human beings who cling to a dream world that can so easily be shattered into jagged pieces."], "author": "Tennessee Williams", "num_pages": "104", "awards": ["New York Drama Critics' Circle Award for Best American Play (1945)"], "places": ["United States of America", "St. Louis, Missouri"], "character_names": ["Amanda Wingfield", "Laura Wingfield", "Jim O'Connor", "Tom Wingfield"], "language": "English", "publish_date": "1999-06-17 00:00:00", "ISBN": "0811214044"},
{"url": "https://www.goodreads.com/book/show/2294528.Howl_s_Moving_Castle", "num_ratings": "159,484", "num_reviews": "10,644", "avg_ratings": 4.3, "genres": ["Fantasy", "Young Adult", "Fiction", "Romance", "Fantasy", "Magic"], "title": "Howl's Moving Castle", "description": ["Sophie has the great misfortune of being the eldest of three daughters, destined to fail miserably should she ever leave home to seek her fate. But when she unwittingly attracts the ire of the Witch of the Waste, Sophie finds herself under a horrid spell that transforms her into an old lady. Her only chance at breaking it lies in the ever-moving castle in the hills: the Wi", "Sophie has the great misfortune of being the eldest of three daughters, destined to fail miserably should she ever leave home to seek her fate. But when she unwittingly attracts the ire of the Witch of the Waste, Sophie finds herself under a horrid spell that transforms her into an old lady. Her only chance at breaking it lies in the ever-moving castle in the hills: the Wizard Howl's castle. To untangle the enchantment, Sophie must handle the heartless Howl, strike a bargain with a fire demon, and meet the Witch of the Waste head-on. Along the way, she discovers that there's far more to Howl—and herself—than first meets the eye."], "author": "Diana Wynne Jones", "num_pages": "429", "awards": ["Phoenix Award (Children's Literature Association) (2006)", "Boston Globe-Horn Book Award (1987)"], "places": ["Ingary", "Porthaven", "Wales"], "character_names": ["Michael", "Wizard Howl", "Sophie Hatter", "Calcifer", "Witch of the Waste", "Lily Angorian"], "language": "English", "publish_date": "2008-04-22 00:00:00", "ISBN": "0061478784"},
{"url": "https://www.goodreads.com/book/show/89359.Phantom_Waltz", "num_ratings": "4,725", "num_reviews": "258", "avg_ratings": 4.19, "genres": ["Romance", "Romance", "Contemporary Romance", "Contemporary", "Westerns"], "title": "Phantom Waltz", "description": ["One glance. That's all it takes. Wealthy rancher Ryan Kendrick falls hard and fast for lovely Bethany Coulter. A beguiling mix of sass and shyness, naivete and maturity, she shares his passion for horses, has a great", "One glance. That's all it takes. Wealthy rancher Ryan Kendrick falls hard and fast for lovely Bethany Coulter. A beguiling mix of sass and shyness, naivete and maturity, she shares his passion for horses, has a great sense of humor, and can light up a room with her beautiful smile. She's absolutely perfect--in every way but one...", "A long-ago barrel-racing accident has left Bethany confined to a wheelchair. In the years since, she has known both betrayal and heartbreak--and vowed never to open her heart to a man again. She has even accepted the possibility that she'll never be able to enjoy a healthy intimate relationship--or have children of her own. But there's something about handsome Ryan Kendrick. Something that makes her believe she can overcome every obstacle. Something that makes her believe in lifelong, lasting love..."], "author": "Catherine Anderson", "num_pages": "418", "awards": [], "places": ["Crystal Falls, Oregon"], "character_names": ["Bethany Coulter", "Ryan Kendrick"], "language": "English", "publish_date": "2007-01-02 00:00:00", "ISBN": "0451220684"},
{"url": "https://www.goodreads.com/book/show/18765.I_Claudius", "num_ratings": "45,873", "num_reviews": "2,102", "avg_ratings": 4.27, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Historical", "Literature"], "title": "I, Claudius", "description": ["From the Autobiography of Tiberius Claudius, Born 10 B.C., Murdered and Deified A.D. 54. ", "Set in the first century A.D. in Rome and written as an autobiographical memoir, this colorful story of the life of the Roman emperor Claudius stands as one of the modern classics of historical fiction.", "Physically weak and afflicted with stuttering, Claudius is initially despised and di", "From the Autobiography of Tiberius Claudius, Born 10 B.C., Murdered and Deified A.D. 54. ", "Set in the first century A.D. in Rome and written as an autobiographical memoir, this colorful story of the life of the Roman emperor Claudius stands as one of the modern classics of historical fiction.", "Physically weak and afflicted with stuttering, Claudius is initially despised and dismissed as an idiot. Shunted to the background of imperial affairs by his embarrassed royal family, he becomes a scholar and historian, while palace intrigues and murders surround him. Observing these dramas from beyond the public eye, Claudius escapes the cruelties inflicted on the rest of the royal family by its own members and survives to become emperor of Rome in A.D. 41."], "author": "Robert Graves", "num_pages": "468", "awards": ["James Tait Black Memorial Prize for Fiction (1934)", "Hawthornden Prize (1935)", "Audie Award for Audio Drama (2012)"], "places": ["Rome", "Italy", "Roman Empire"], "character_names": ["Nero (emperor)", "Caligula", "Livia Drusa", "Tiberius Claudius Drusus Nero Germanicus", "Agrippina the Elder", "Tiberius Claudius Caesar", "Augustus", "Valeria Messalina"], "language": "English", "publish_date": "1989-10-23 00:00:00", "ISBN": "067972477X"},
{"url": "https://www.goodreads.com/book/show/107772.The_Prize", "num_ratings": "24,015", "num_reviews": "580", "avg_ratings": 4.22, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Medieval", "Historical", "Historical Fiction"], "title": "The Prize", "description": ["In the resplendence of William the Conqueror's London court, the lovely Saxon captive Lady Nicholaa was forced to choose a husband from the assembled Norman nobles. She chose Royce, a baron warrior whose fierce demeanor could not conceal his chivalrous and tender heart. A resourceful, rebellious and utterly", "In the resplendence of William the Conqueror's London court, the lovely Saxon captive Lady Nicholaa was forced to choose a husband from the assembled Norman nobles. She chose Royce, a baron warrior whose fierce demeanor could not conceal his chivalrous and tender heart. A resourceful, rebellious and utterly naive, Nicholaa vowed to bend Royce to her will despite the whirlwind of feelings he aroused in her. Ferocious in battle, seasoned in passion, Royce was surprised by the depth of his emotion whenever he caressed his charming bride.", "In a climate of utmost treachery, where Saxons still intrigued against their Norman invaders, Royce and Nicholaa revelled in their precious new love ... a fervent bond soon to be disrupted by the call of blood, kin and country!"], "author": "Julie Garwood", "num_pages": "408", "awards": [], "places": ["England"], "character_names": ["Nicholaa", "Royce Melborn"], "language": "English", "publish_date": "1991-08-01 00:00:00", "ISBN": "0671702513"},
{"url": "https://www.goodreads.com/book/show/420780.If_You_Deceive", "num_ratings": "10,477", "num_reviews": "439", "avg_ratings": 4.17, "genres": ["Romance", "Historical Romance", "Romance", "Historical"], "title": "If You Deceive", "description": ["Burning vengeance... ", "Ethan MacCarrick was a heartbreakingly handsome rake until a powerful nobleman ordered him brutally beaten and his face scarred for a crime he didn't commit. Ethan's reprisal -- bankrupting the nobleman and forcing his exile -- does little to appease his wrath. Ten years later, a haughty, mysterious beauty enchants Ethan -- the daughter of his enemy. A", "Burning vengeance... ", "Ethan MacCarrick was a heartbreakingly handsome rake until a powerful nobleman ordered him brutally beaten and his face scarred for a crime he didn't commit. Ethan's reprisal -- bankrupting the nobleman and forcing his exile -- does little to appease his wrath. Ten years later, a haughty, mysterious beauty enchants Ethan -- the daughter of his enemy. At last, Ethan will have the revenge he's craved; he'll promise her marriage, seduce her, then cast her aside. ", "Bitter hardships... ", "When Madeleine van Rowen's family was suddenly plunged into destitution and dishonor, she steeled herself against further heartache. She never weakened, never trusted, until a towering, scarred Highlander relentlessly pursues her, breaking down her defenses. ", "At what price forgiveness? ", "The passion between them burns hotter than Ethan's fury, and soon he finds he can't let her go. But when Madeleine uncovers the truth about him, can Ethan convince her to accept all he now offers -- when he once destroyed everything she had?"], "author": "Kresley Cole", "num_pages": "356", "awards": [], "places": ["London, England", "Paris"], "character_names": ["Maddie Moody", "Ethan MacCarrick"], "language": "English", "publish_date": "2007-05-22 00:00:00", "ISBN": "1416503617"},
{"url": "https://www.goodreads.com/book/show/659600.Annie_s_Song", "num_ratings": "11,348", "num_reviews": "889", "avg_ratings": 4.2, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Westerns", "Historical", "Historical Fiction", "Adult"], "title": "Annie's Song", "description": ["Annie Trimble lives in a solitary world that no one enters or understands. As delicate and beautiful as the tender blossoms of the Oregon spring, she is shunned by a town that misinterprets her affliction. But cruelty cannot destroy the love Annie holds in her heart. ", "Annie Trimble lives in a solitary world that no one enters or understands. As delicate and beautiful as the tender blossoms of the Oregon spring, she is shunned by a town that misinterprets her affliction. But cruelty cannot destroy the love Annie holds in her heart. "], "author": "Catherine Anderson", "num_pages": "410", "awards": [], "places": ["Hooperville, Oregon"], "character_names": ["Alex Montgomery", "Annie Trimble"], "language": "English", "publish_date": "1996-01-16 00:00:00", "ISBN": "0380779617"},
{"url": "https://www.goodreads.com/book/show/367689.Ravished", "num_ratings": "14,262", "num_reviews": "647", "avg_ratings": 4.01, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Ravished", "description": ["The New York Times bestselling author of Rendezvous presents a spellbinding new Regency historical destined to be a hot beach read this summer. Moving from the cozy confines of a tiny seaside village named Upper Biddleton to the glittering crush of a fashionable London soiree, Quick offers an enthralling tale of a mismatched couple poised to discover the rapture of love.", "Th", "The New York Times bestselling author of Rendezvous presents a spellbinding new Regency historical destined to be a hot beach read this summer. Moving from the cozy confines of a tiny seaside village named Upper Biddleton to the glittering crush of a fashionable London soiree, Quick offers an enthralling tale of a mismatched couple poised to discover the rapture of love.", "There was no doubt about it. What Miss Harriet Pomeroy needed was a man. Someone powerful and clever who could help her rout the unscrupulous thieves who were using her beloved caves to hide their loot. But when Harriet summoned Gideon Westbrook, Viscount St. Justin, to her aid, she could not know that she was summoning the devil himself. . . . ", "Dubbed the Beast of Blackthorne Hall for his scarred face and lecherous past, Gideon was strong and fierce and notoriously menacing. Yet Harriet could not find it in her heart to fear him. For in his tawny gaze she sensed a savage pain she longed to soothe . . . and a searing passion she yearned to answer. Now, caught up in the Beast’s clutches, Harriet must find a way to win his heart–and evade the deadly trap of a scheming villain who would see them parted for all time.", "RAVISHED is a retelling of the classic tale, Beauty and the Beast."], "author": "Amanda Quick", "num_pages": "385", "awards": [], "places": ["London, England", "Upper Biddleton, England"], "character_names": ["Harriet Pomeroy", "Gideon Westbrook, Viscount St. Justin"], "language": "English", "publish_date": "2005-12-16 00:00:00", "ISBN": "0553588699"},
{"url": "https://www.goodreads.com/book/show/71644.Simply_Love", "num_ratings": "5,839", "num_reviews": "364", "avg_ratings": 3.95, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Simply Love", "description": [" ...", "Anne first spied him in the deepening dusk of a Wales evening—a lone figure of breathtaking strength, his handsome face branded by a secret pain.", " ...", "Anne first spied him in the deepening dusk of a Wales evening—a lone figure of breathtaking strength, his handsome face branded by a secret pain. For teacher and single mother Anne Jewell, Sydnam Butler is a man whose sorrows—and passions—run deeper than she could have ever imagined. As steward of a remote seaside manor, Sydnam lives a reclusive existence. Yet he senses in Anne a kindred soul, and between these two wary hearts, desire stirs. Unable to resist the passion that has rescued them both, Anne and Sydnam share an afternoon of exquisite lovemaking. As scandal looms, suddenly the unwed mother and the war-scarred veteran must make a decision that could forever alter their lives ..."], "author": "Mary Balogh", "num_pages": "418", "awards": [], "places": [], "character_names": ["Anne Jewell", "Sydnam Butler"], "language": "English", "publish_date": "2007-02-27 00:00:00", "ISBN": "0440241979"},
{"url": "https://www.goodreads.com/book/show/674220.Again_the_Magic", "num_ratings": "28,162", "num_reviews": "1,300", "avg_ratings": 4.05, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction"], "title": "Again the Magic", "description": ["Lady Aline Marsden was brought up for one reason: to make an advantageous marriage to a member of her own class. Instead, she willingly gave her innocence to John McKenna, a servant on her father's estate. Their passionate transgression was unforgivable—John was sent away, and Aline was left to live in the countryside... an exile from London soci", "Lady Aline Marsden was brought up for one reason: to make an advantageous marriage to a member of her own class. Instead, she willingly gave her innocence to John McKenna, a servant on her father's estate. Their passionate transgression was unforgivable—John was sent away, and Aline was left to live in the countryside... an exile from London society.", "Now McKenna has made his fortune, and he has returned—more boldly handsome and more mesmerizing than before. His ruthless plan is to take revenge on the woman who shattered his dreams of love. But the magic between them burns as bright as ever. And now he must decide whether to let vengeance take its toll…or risk everything for his first, and only, love."], "author": "Lisa Kleypas", "num_pages": "391", "awards": [], "places": ["Hampshire, England", "England"], "character_names": ["John McKenna", "Aline Marsden", "Gideon Shaw", "Livia Marsden", "Marcus Marsden, Earl of Westcliff"], "language": "English", "publish_date": "2015-05-26 00:00:00", "ISBN": "0380811081"},
{"url": "https://www.goodreads.com/book/show/61906.The_Warrior_s_Apprentice", "num_ratings": "19,764", "num_reviews": "1,047", "avg_ratings": 4.29, "genres": ["Science Fiction", "Space", "Space Opera", "Fiction"], "title": "The Warrior's Apprentice", "description": ["Between the seemingly impossible tasks of living up to his warrior-father's legend and surmounting his own physical limitations, Miles Vorkosigan faces some truly daunting challenges. ", "Shortly after his arrival on Beta Colony, Miles unexpectedly finds himself the owner of an obsolete freighter and in more debt than he ever thought possible. Propelled by his manic \"forward m", "Between the seemingly impossible tasks of living up to his warrior-father's legend and surmounting his own physical limitations, Miles Vorkosigan faces some truly daunting challenges. ", "Shortly after his arrival on Beta Colony, Miles unexpectedly finds himself the owner of an obsolete freighter and in more debt than he ever thought possible. Propelled by his manic \"forward momentum,\" the ever-inventive Miles creates a new identity for himself as the commander of his own mercenary fleet to obtain a lucrative cargo; a shipment of weapons destined for a dangerous warzone."], "author": "Lois McMaster Bujold", "num_pages": "372", "awards": [], "places": [], "character_names": ["Miles Vorkosigan"], "language": "English", "publish_date": "2003-08-16 00:00:00", "ISBN": "0743468406"},
{"url": "https://www.goodreads.com/book/show/8449698-when-beauty-tamed-the-beast", "num_ratings": "19,800", "num_reviews": "1,759", "avg_ratings": 4.06, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency", "Fantasy", "Fairy Tales"], "title": "When Beauty Tamed the Beast", "description": ["Miss Linnet Berry Thrynne is a Beauty . . . Naturally, she's betrothed to a Beast.", "Piers Yelverton, Earl of Marchant, lives in a castle in Wales where, it is rumored, his bad temper flays everyone he crosses. And rumor also has it that a wound has left the earl immune to the charms of any woman.", "Linnet is not just any woman.", "She is more than merely lovely: her wit and charm b", "Miss Linnet Berry Thrynne is a Beauty . . . Naturally, she's betrothed to a Beast.", "Piers Yelverton, Earl of Marchant, lives in a castle in Wales where, it is rumored, his bad temper flays everyone he crosses. And rumor also has it that a wound has left the earl immune to the charms of any woman.", "Linnet is not just any woman.", "She is more than merely lovely: her wit and charm brought a prince to his knees. She estimates the earl will fall madly in love—in just two weeks.", "Yet Linnet has no idea of the danger posed to her own heart by a man who may never love her in return.", "If she decides to be very wicked indeed . . . what price will she pay for taming his wild heart?"], "author": "Eloisa James", "num_pages": "372", "awards": ["All About Romance (AAR) Annual Reader Poll for Biggest Tearjerker (2012)", "RITA Award by Romance Writers of America Nominee for Regency Historical Romance (2012)"], "places": [], "character_names": ["Linnet Berry Thrynne", "Piers Yelverton, Earl of Marchant"], "language": "English", "publish_date": "2011-01-25 00:00:00", "ISBN": "0062021273"},
{"url": "https://www.goodreads.com/book/show/10964.Outlander", "num_ratings": "657,798", "num_reviews": "39,763", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Romance", "Fantasy", "Fiction", "Science Fiction", "Time Travel", "Historical", "Romance", "Historical Romance"], "title": "Outlander", "description": ["The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743.", "Hurled back in ti", "The year is 1945. Claire Randall, a former combat nurse, is just back from the war and reunited with her husband on a second honeymoon when she walks through a standing stone in one of the ancient circles that dot the British Isles. Suddenly she is a Sassenach—an “outlander”—in a Scotland torn by war and raiding border clans in the year of Our Lord...1743.", "Hurled back in time by forces she cannot understand, Claire is catapulted into the intrigues of lairds and spies that may threaten her life, and shatter her heart. For here James Fraser, a gallant young Scots warrior, shows her a love so absolute that Claire becomes a woman torn between fidelity and desire—and between two vastly different men in two irreconcilable lives."], "author": "Diana Gabaldon", "num_pages": "850", "awards": ["RITA Award by Romance Writers of America for Best Romance of 1991 & nominee for Best First Book & nominee for Single Title Historical Romance (1992)", "Puddly Award for Romance (2001)"], "places": ["Lallybroch, Scotland", "Scottish Highlands", "Inverness, Scotland", "Scotland"], "character_names": ["Jamie Fraser", "Ian Murray", "Claire Randall Fraser", "Jonathan Randall", "Dougal MacKenzie", "Colum MacKenzie", "Geillis Duncan", "Jenny Murray", "Frank Randall", "Laoghaire MacKenzie", "Murtagh Fraser"], "language": "English", "publish_date": "2005-07-26 00:00:00", "ISBN": "0440242940"},
{"url": "https://www.goodreads.com/book/show/11713.The_English_Patient", "num_ratings": "98,393", "num_reviews": "3,732", "avg_ratings": 3.88, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Romance", "Historical"], "title": "The English Patient", "description": ["With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs ro", "With ravishing beauty and unsettling intelligence, Michael Ondaatje's Booker Prize-winning novel traces the intersection of four damaged lives in an Italian villa at the end of World War II. Hana, the exhausted nurse; the maimed thief, Caravaggio; the wary sapper, Kip: each is haunted by the riddle of the English patient, the nameless, burned man who lies in an upstairs room and whose memories of passion, betrayal, and rescue illuminate this book like flashes of heat lightning."], "author": "Michael Ondaatje", "num_pages": "320", "awards": ["Man Booker Prize (1992)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (1992)", "Commonwealth Writers' Prize for Best Book in Caribbean and Canada (1993)", "Trillium Book Award (1993)", "Golden Man Booker Prize (2018)"], "places": ["Italy", "North Africa", "Sahara Desert", "Tuscany", "Fiesole, Tuscany", "Cairo", "Florence"], "character_names": ["Kip", "Hana", "Geoffrey Clifton", "Katharine Clifton", "David Caravaggio", "Ladislaus de Almásy"], "language": "English", "publish_date": "2006-04-18 00:00:00", "ISBN": "0771068719"},
{"url": "https://www.goodreads.com/book/show/350683.Yours_Until_Dawn", "num_ratings": "8,964", "num_reviews": "579", "avg_ratings": 4.09, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Regency", "Historical", "Historical Fiction"], "title": "Yours Until Dawn", "description": ["Gabriel Fairchild's valor during battle earns him the reputation of hero, but costs him both his sight and his hope for the future. Abandoned by the fiancée he adored, the man who once walked like a prince among London's elite secludes himself in his family's mansion, cursing his way through dark days and darker nights. ", "Gabriel Fairchild's valor during battle earns him the reputation of hero, but costs him both his sight and his hope for the future. Abandoned by the fiancée he adored, the man who once walked like a prince among London's elite secludes himself in his family's mansion, cursing his way through dark days and darker nights. "], "author": "Teresa Medeiros", "num_pages": "373", "awards": ["Maggie Award for Excellence (Georgia Romance Writers) Nominee for Historical Romance (2005)"], "places": ["England"], "character_names": ["Gabriel Fairchild", "Samantha Wickersham"], "language": "English", "publish_date": "2004-07-27 00:00:00", "ISBN": "0060513659"},
{"url": "https://www.goodreads.com/book/show/1611656.Dark_Needs_at_Night_s_Edge", "num_ratings": "41,143", "num_reviews": "1,275", "avg_ratings": 4.32, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Paranormal", "Vampires", "Fantasy"], "title": "Dark Needs at Night's Edge", "description": ["A RAVEN-HAIRED TEMPTRESS OF THE DARK...", "Naomi Laress, a famous ballerina from a past century, became a phantom the night she was murdered. Imbued with otherworldly", "A RAVEN-HAIRED TEMPTRESS OF THE DARK...", "Naomi Laress, a famous ballerina from a past century, became a phantom the night she was murdered. Imbued with otherworldly powers but invisible to the living, she haunts her beloved home, scaring away trespassers -- until she encounters a ruthless ", "A VAMPIRE WARRIOR CONSUMED BY MADNESS...", "To prevent him from harming others, Conrad Wroth's brothers imprison him in an abandoned manor. But there, a female only he can see seems determined to drive him further into madness. The exquisite creature torments him with desire, leaving his body racked with lust and his soul torn as he finds himself coveting her for his own.", "HOW FAR WILL HE GO TO CLAIM HER?", "Yet even if Conrad can win Naomi, evil still surrounds her. Once he returns to the brutality of his past to protect her, will he succumb to the dark needs seething inside him?"], "author": "Kresley Cole", "num_pages": "368", "awards": [], "places": ["Louisiana", "New Orleans, Louisiana"], "character_names": ["Conrad Wroth", "Néomi Laress", "Phenïx \"Nïx\", The Ever-Knowing", "King Kristoff", "Sebastian Wroth", "Nikolai Wroth"], "language": "English", "publish_date": "2008-04-29 00:00:00", "ISBN": "141654707X"},
{"url": "https://www.goodreads.com/book/show/2595138-the-gargoyle", "num_ratings": "39,643", "num_reviews": "5,251", "avg_ratings": 3.97, "genres": ["Fiction", "Fantasy", "Romance", "Historical", "Historical Fiction"], "title": "The Gargoyle", "description": ["An extraordinary debut novel of love that survives the fires of hell and transcends the boundaries of time.", "The narrator of The Gargoyle is a very contemporary cynic, physically beautiful and sexually adept, who dwells in the moral vacuum that is modern life. As the book opens, he is driving along a dark road when he is distracted by what seems to be a flight of arrows. He", "An extraordinary debut novel of love that survives the fires of hell and transcends the boundaries of time.", "The narrator of The Gargoyle is a very contemporary cynic, physically beautiful and sexually adept, who dwells in the moral vacuum that is modern life. As the book opens, he is driving along a dark road when he is distracted by what seems to be a flight of arrows. He crashes into a ravine and suffers horrible burns over much of his body. As he recovers in a burn ward, undergoing the tortures of the damned, he awaits the day when he can leave the hospital and commit carefully planned suicide—for he is now a monster in appearance as well as in soul. ", "A beautiful and compelling, but clearly unhinged, sculptress of gargoyles by the name of Marianne Engel appears at the foot of his bed and insists that they were once lovers in medieval Germany. In her telling, he was a badly injured mercenary and she was a nun and scribe in the famed monastery of Engelthal who nursed him back to health. As she spins their tale in Scheherazade fashion and relates equally mesmerizing stories of deathless love in Japan, Iceland, Italy, and England, he finds himself drawn back to life—and, finally, in love. He is released into Marianne's care and takes up residence in her huge stone house. But all is not well. For one thing, the pull of his past sins becomes ever more powerful as the morphine he is prescribed becomes ever more addictive. For another, Marianne receives word from God that she has only twenty-seven sculptures left to complete—and her time on earth will be finished. ", "Already an international literary sensation, the Gargoyle is an Inferno for our time. It will have you believing in the impossible."], "author": "Andrew Davidson", "num_pages": "465", "awards": ["Sunburst Award for Adult (2009)"], "places": ["North America", "Germany", "Japan", "England", "Italy", "Iceland"], "character_names": ["Marianne Engel"], "language": "English", "publish_date": "2008-08-05 00:00:00", "ISBN": "0385524943"},
{"url": "https://www.goodreads.com/book/show/42060.Richard_III", "num_ratings": "37,751", "num_reviews": "1,351", "avg_ratings": 3.93, "genres": ["Classics", "Plays", "Drama", "Fiction", "Historical", "Historical Fiction", "Plays", "Theatre", "Literature", "Academic", "School", "Poetry", "Historical"], "title": "Richard III", "description": ["Each edition includes:", "Freshly edited text based on the best early printed version of the play ", " Full explanatory notes conveniently placed on pages facing the text of the play ", " Scene-by-scene plot summaries ", " A key to famous lines and phrases ", " An introduction to reading Shakespeare's language ", " An essay by an outstanding scholar providing a modern perspective on the play ", "Illu", "Each edition includes:", "Freshly edited text based on the best early printed version of the play ", " Full explanatory notes conveniently placed on pages facing the text of the play ", " Scene-by-scene plot summaries ", " A key to famous lines and phrases ", " An introduction to reading Shakespeare's language ", " An essay by an outstanding scholar providing a modern perspective on the play ", "Illustrations from the Folger Shakespeare Library's vast holdings of rare books ", " Essay by Phyllis Rackin ", " The Folger Shakespeare Library in Washington, D.C., is home to the world's largest collection of Shakespeare's printed works, and a magnet for Shakespeare scholars from around the globe. In addition to exhibitions open to the public throughout the year, the Folger offers a full calendar of performances and programs. For more information, visit ", "."], "author": "William Shakespeare", "num_pages": "369", "awards": [], "places": [], "character_names": ["Elizabeth of York", "Elizabeth Woodville", "Henry VII of England", "Richard III of England", "Henry VI of England", "Edward IV of England", "Jane Shore", "Edward V of England", "Margaret of Anjou", "George Plantagenet, 1st Duke of Clarence", "Richard of Shrewsbury, 1st Duke of York", "Cecily Neville, Duchess of York", "Anthony Woodville, 2nd Earl Rivers", "Sir Thomas Grey, Marquess of Dorset", "Sir Richard Grey, Lord Grey", "Sir Thomas Vaughan", "Edward Plantagenet", "Lady Anne Neville", "William, Lord Hastings", "Thomas, Lord Stanley, Earl of Derby", "John de Vere, 13th Earl of Oxford", "Sir James Blunt", "Sir Walter Herbert", "Sir William Brandon", "Henry Stafford, 2nd Duke of Buckingham", "John Howard, 1st Duke of Norfolk", "Sir Richard Ratcliffe", "Sir William Catesby", "Sir James Tyrrel", "Francis Lovell, 9th Baron Lovell, 6th Baron Holand", "Thomas Howard, Earl of Surrey", "1st Murderer (Richard III)", "2nd Murderer (Richard III)", "Page to Richard III", "Cardinal Thomas Bourchier, Archbishop of Canterbury", "Thomas Rotherham, Archbishop of York", "John Morton, Bishop of Ely", "Sir Christopher Urswick", "John, a Priest", "Sir Robert Brakenbury", "Keeper of the Tower", "Edmund Shaa, Lord Mayor of London", "Scrivener", "Pursuivant", "Sheriff (Richard III)", "Tressel, gentleman attending Lady Anne", "Berkeley, gentleman attending Lady Anne", "Edward Plantagenet, Earl of Warwick", "Margaret Plantagenet", "John Dighton", "Miles Forrest", "1st Citizen (Richard III)", "2nd Citizen (Richard III)", "Third Citizen (Richard III)"], "language": "English", "publish_date": "2004-07-01 00:00:00", "ISBN": "0743482840"},
{"url": "https://www.goodreads.com/book/show/18373.Flowers_for_Algernon", "num_ratings": "382,483", "num_reviews": "13,212", "avg_ratings": 4.09, "genres": ["Fiction", "Classics", "Science Fiction", "Young Adult"], "title": "Flowers for Algernon", "description": ["The story of a mentally disabled man whose experimental quest for intelligence mirrors that of Algernon, an extraordinary lab mouse. In diary entries, Charlie tells how a brain operation increases his IQ and changes his life. As the experimental procedure takes effect, Charlie's intelligence expands until it surpasses that of the doctors who engineered his metamorphosis. T", "The story of a mentally disabled man whose experimental quest for intelligence mirrors that of Algernon, an extraordinary lab mouse. In diary entries, Charlie tells how a brain operation increases his IQ and changes his life. As the experimental procedure takes effect, Charlie's intelligence expands until it surpasses that of the doctors who engineered his metamorphosis. The experiment seems to be a scientific breakthrough of paramount importance--until Algernon begins his sudden, unexpected deterioration. Will the same happen to Charlie?"], "author": "Daniel Keyes", "num_pages": "311", "awards": ["Hugo Award Nominee for Best Novel (1967)", "Nebula Award for Best Novel (1966)", "Locus Award Nominee for All-Time Best Novel (1975)"], "places": ["New York City, New York"], "character_names": ["Charlie Gordon", "Alice Kinnian"], "language": "English", "publish_date": "2005-05-01 00:00:00", "ISBN": "0156030306"},
{"url": "https://www.goodreads.com/book/show/348914.Wuthering_Heights", "num_ratings": "1,106,470", "num_reviews": "28,954", "avg_ratings": 3.83, "genres": ["Classics", "Fiction", "Romance", "Literature"], "title": "Wuthering Heights", "description": ["Lockwood, the new tenant of Thrushcross Grange, situated on the bleak Yorkshire moors, is forced to seek shelter one night at Wuthering Heights, the home of his landlord. There he discovers the history of the tempestuous events that took place years before; of the intense relationship between the gypsy foundling Heathcliff", "Lockwood, the new tenant of Thrushcross Grange, situated on the bleak Yorkshire moors, is forced to seek shelter one night at Wuthering Heights, the home of his landlord. There he discovers the history of the tempestuous events that took place years before; of the intense relationship between the gypsy foundling Heathcliff and Catherine Earnshaw; and how Catherine, forced to choose between passionate, tortured Heathcliff and gentle, well-bred Edgar Linton, surrendered to the expectations of her class. As Heathcliff's bitterness and vengeance at his betrayal is visited upon the next generation, their innocent heirs must struggle to escape the legacy of the past.", "Emily Brontë's only novel, a work of tremendous and far-reaching influence, the Penguin Classics edition of Wuthering Heights is the definitive edition of the text, edited with an introduction by Pauline Nestor. In this edition, a new preface by Lucasta Miller, author of The Brontë Myth, looks at the ways in which the novel has been interpreted, from Charlotte Brontë onwards. This complements Pauline Nestor's introduction, which discusses changing critical receptions of the novel, as well as Emily Brontë's influences and background.", "Emily Brontë (1818-48), along with her sisters, Charlotte and Anne, was one of the most significant literary figures of the 19th century. She wrote just one strikingly innovative novel, Wuthering Heights, but was also a gifted and intense poet.", "'Wuthering Heights is commonly thought of as \"romantic\", but try rereading it without being astonished by the comfortableness with which Brontë's characters subject one another to extremes of physical and psychological violence'", "Jeanette Winterson", "'As a first novel, there is very little that can compare to it. Even Shakespeare took over a decade to reach the clifftop extremities of King Lear'", "Sarah Waters"], "author": "Emily Brontë", "num_pages": "354", "awards": [], "places": ["Yorkshire Dales, England"], "character_names": ["Heathcliff", "Catherine Earnshaw", "Edgar Linton", "Isabella Linton", "Hindley Earnshaw", "Ellen (Nelly) Dean", "Mr. Lockwood", "Hareton Earnshaw", "Catherine Linton", "Linton Heathcliff"], "language": "English", "publish_date": "2003-01-29 00:00:00", "ISBN": "0141439556"},
{"url": "https://www.goodreads.com/book/show/2712967-the-darkest-pleasure", "num_ratings": "41,219", "num_reviews": "1,209", "avg_ratings": 4.28, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Paranormal", "Demons", "Fantasy"], "title": "The Darkest Pleasure", "description": ["Reyes is a man possessed. Bound by the demon of pain, he is forbidden to know pleasure. Yet he craves a mortal woman, Danika Ford, more than breath and will do anything to claim her--even defy the gods.Danika is on the run. For months she's eluded the Lords of the Underworld, immortal warriors who won't rest until she and her family have been destroyed. But her dreams are", "Reyes is a man possessed. Bound by the demon of pain, he is forbidden to know pleasure. Yet he craves a mortal woman, Danika Ford, more than breath and will do anything to claim her--even defy the gods.Danika is on the run. For months she's eluded the Lords of the Underworld, immortal warriors who won't rest until she and her family have been destroyed. But her dreams are haunted by Reyes, the warrior whose searing touch she can't forget. Yet a future together could mean death to all they both hold dear...."], "author": "Gena Showalter", "num_pages": "368", "awards": [], "places": ["Budapest"], "character_names": ["Reyes / Pain", "Danika Ford"], "language": "English", "publish_date": "2008-06-17 00:00:00", "ISBN": "0373773102"},
{"url": "https://www.goodreads.com/book/show/1618.The_Curious_Incident_of_the_Dog_in_the_Night_Time", "num_ratings": "994,449", "num_reviews": "38,720", "avg_ratings": 3.86, "genres": ["Fiction", "Mystery", "Young Adult", "Contemporary"], "title": "The Curious Incident of the Dog in the Night-Time", "description": ["Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. And he detests the color yellow.", "Although gifted with a superbly logical brain, for fifteen-year-old Christopher everyday interactions and admonishment", "Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. And he detests the color yellow.", "Although gifted with a superbly logical brain, for fifteen-year-old Christopher everyday interactions and admonishments have little meaning. He lives on patterns, rules, and a diagram kept in his pocket. Then one day, a neighbor's dog, Wellington, is killed and his carefully constructive universe is threatened. Christopher sets out to solve the murder in the style of his favourite (logical) detective, Sherlock Holmes. What follows makes for a novel that is funny, poignant and fascinating in its portrayal of a person whose curse and blessing are a mind that perceives the world entirely literally."], "author": "Mark Haddon", "num_pages": "226", "awards": ["Man Booker Prize Nominee for Longlist (2003)", "James Tait Black Memorial Prize Nominee for Fiction (2003)", "Whitbread Award for Novel and Book of the Year (2003)", "Guardian Children's Fiction Prize (2003)", "McKitterick Prize (2004)", "Los Angeles Times Book Prize for Art Seidenbaum Award for First Fiction (2003)", "Exclusive Books Boeke Prize (2004)", "ALA Alex Award (2004)", "Zilveren Zoen (2004)", "Lincoln Award Nominee (2006)", "Commonwealth Writers' Prize for Best First Book Overall (2004)", "North East Teenage Book Award Nominee (2004)", "Dolly Gray Children's Literature Award (2004)"], "places": ["Swindon, England", "London, England", "England"], "character_names": ["Christopher John Francis Boone", "Toby", "Siobhan", "Mr. Jeavons", "Mrs. Alexander", "Ed Boone", "Judy Boone", "Mr. Roger Shears", "Mrs. Eileen Shears", "Rhodri", "Wellington"], "language": "English", "publish_date": "2004-05-18 00:00:00", "ISBN": "1400032717"},
{"url": "https://www.goodreads.com/book/show/41424.Beauty", "num_ratings": "63,985", "num_reviews": "4,713", "avg_ratings": 4.05, "genres": ["Fantasy", "Fantasy", "Fairy Tales", "Romance", "Young Adult", "Retellings"], "title": "Beauty: A Retelling of the Story of Beauty and the Beast", "description": ["A strange imprisonment...", "Beauty has never liked her nickname. She is thin and awkward; it is her two sisters who are the beautiful ones. But what she lacks in looks, she can perhaps make up for in courage.", "When her father comes home with the tale of an enchanted castle in the forest and the terrible promise he had to make to the Beast who lives there, Beauty knows she must", "A strange imprisonment...", "Beauty has never liked her nickname. She is thin and awkward; it is her two sisters who are the beautiful ones. But what she lacks in looks, she can perhaps make up for in courage.", "When her father comes home with the tale of an enchanted castle in the forest and the terrible promise he had to make to the Beast who lives there, Beauty knows she must go to the castle, a prisoner of her own free will. Her father protests that he will not let her go, but she answers, \"Cannot a Beast be tamed?\"", "Robin McKinley's beloved telling illuminates the unusual love story of a most unlikely couple, ", "."], "author": "Robin McKinley", "num_pages": "256", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (1980)"], "places": [], "character_names": ["Beast (Beauty)", "Beauty/Honour Huston", "Grace Huston", "Molly Honeybourne", "Hope Huston-Woodhouse", "Lydia (Beauty)", "Bessie (Beauty)", "Mercy Woodhouse", "Richard Woodhouse", "Ruth (Beauty)", "Lady Marguerite", "Robert Tucker", "Gervain Woodhouse", "Roderick Huston", "Tom Black", "Greatheart", "Tom Bradley", "Melinda Honeybourne", "Ferdy (Beauty)", "Pat Lawrey", "Nick Callaway", "John Honeybourne", "Cider (Beauty)", "Frewen (Beauty)", "Orpheus/Phooey", "Odysseus (Beauty)"], "language": "English", "publish_date": "1993-06-30 00:00:00", "ISBN": "0064404773"},
{"url": "https://www.goodreads.com/book/show/15638.Cyrano_de_Bergerac", "num_ratings": "65,860", "num_reviews": "1,706", "avg_ratings": 4.06, "genres": ["Classics", "Plays", "Fiction", "Drama", "Cultural", "France", "Romance"], "title": "Cyrano de Bergerac", "description": ["This is Edmond Rostand's immortal play in which chivalry and wit, bravery and love are forever captured in the timeless spirit of romance. Set in Louis XIII's reign, it is the moving and exciting drama of one of the finest swordsmen in France, gallant soldier, brilliant wit, tragic poet-lover with the face of a clown. Rostand's extraordinary lyric powers gave birth to a un", "This is Edmond Rostand's immortal play in which chivalry and wit, bravery and love are forever captured in the timeless spirit of romance. Set in Louis XIII's reign, it is the moving and exciting drama of one of the finest swordsmen in France, gallant soldier, brilliant wit, tragic poet-lover with the face of a clown. Rostand's extraordinary lyric powers gave birth to a universal hero--Cyrano de Bergerac--and ensured his own reputation as author of one of the best-loved plays in the literature of the stage. This translation, by the American poet Brian *****, is nearly as famous as the original play itself, and is generally considered to be one of the finest English verse translations ever written."], "author": "Edmond Rostand", "num_pages": "240", "awards": [], "places": ["France"], "character_names": ["Cyrano de Bergerac", "Roxane", "Christian de Neuvillette"], "language": "English", "publish_date": "2003-08-05 00:00:00", "ISBN": "0451528921"},
{"url": "https://www.goodreads.com/book/show/330721.Dreaming_of_You", "num_ratings": "28,787", "num_reviews": "1,338", "avg_ratings": 4.21, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Regency"], "title": "Dreaming of You", "description": ["In the shelter of her country cottage, Sara Fielding puts pen to paper to create dreams. But curiosity has enticed the prim, well-bred gentlewoman out of her safe haven—and into Derek Craven's dangerous world.", "A handsome, tough and tenacious Cockney, he rose from poverty to become lord of London's most exclusive gamb", "In the shelter of her country cottage, Sara Fielding puts pen to paper to create dreams. But curiosity has enticed the prim, well-bred gentlewoman out of her safe haven—and into Derek Craven's dangerous world.", "A handsome, tough and tenacious Cockney, he rose from poverty to become lord of London's most exclusive gambling house—a struggle that has left Derek Craven fabulously wealthy, but hardened and suspicious. And now duty demands he allow Sara Fielding into his world—with her impeccable manners and her infuriating innocence. But here, in a perilous shadow-realm of ever-shifting fortunes, even a proper \"mouse\" can be transformed into a breathtaking enchantress—and a world-weary gambler can be shaken to his cynical core by the power of passion...and the promise of love."], "author": "Lisa Kleypas", "num_pages": "373", "awards": [], "places": ["England"], "character_names": ["Derek Craven", "Sara Fielding"], "language": "English", "publish_date": "2015-06-30 00:00:00", "ISBN": "038077352X"},
{"url": "https://www.goodreads.com/book/show/1814627.Texas_Destiny", "num_ratings": "4,937", "num_reviews": "391", "avg_ratings": 4.02, "genres": ["Romance", "Historical Romance", "Romance", "Westerns", "Historical", "Romance", "Western Romance", "Historical", "Historical Fiction"], "title": "Texas Destiny", "description": ["Arriving on the Fort Worth train, Miss Amelia Carson, mail-order bride, had never met Dallas Leigh, the Texan she promised to marry. The tall cowboy at the station wasn't Dallas. He was Houston, Dallas's brother, sent to escort her on the rugged three-week trek to the ranch where Dallas waited. Brought up in war-ravaged Georgia, Amelia thought", "Arriving on the Fort Worth train, Miss Amelia Carson, mail-order bride, had never met Dallas Leigh, the Texan she promised to marry. The tall cowboy at the station wasn't Dallas. He was Houston, Dallas's brother, sent to escort her on the rugged three-week trek to the ranch where Dallas waited. Brought up in war-ravaged Georgia, Amelia thought Dallas's letters made Texas sound like heaven, a place for her dreams to grow with the right man beside her.", "By all appearances, Houston Leigh would hardly be considered the \"right man.\" The war he survived had scarred him inside and out, and he was little competition for his handsome brother. But from the moment Houston met Amelia, he knew she possessed the courage this wild land needed. She had eyes that could see past his wounded face to his soul. And he would fight any man—except his brother—for her heart. Now he and Amelia were riding down dangerous trails, sleeping under the stars, and God help them, they were falling in love."], "author": "Lorraine Heath", "num_pages": "384", "awards": ["Texas Gold Award", "Desert Rose Golden Quill Award", "Camões Prize"], "places": ["Texas"], "character_names": ["Houston Leigh", "Amelia Carson"], "language": "English", "publish_date": "1997-06-01 00:00:00", "ISBN": "0451407520"},
{"url": "https://www.goodreads.com/book/show/18478373-forever-scarred", "num_ratings": "211", "num_reviews": "15", "avg_ratings": 4.02, "genres": ["Romance", "Contemporary", "War", "Military Fiction", "Romance", "Contemporary Romance", "Disability", "Romance", "Romantic Suspense", "Realistic Fiction"], "title": "Forever Scarred", "description": ["The long awaited sequel to Running Scarred. ", "Working alongside his ex-veteran friends in the isolated French chateau where he doesn’t have to explain how his face was destroyed, suits Joe perfectly. Barely able look at his own reflection let alone show himself to anyone else, the longer he can remain secluded from the outside world the better he likes it. ", "But Joe wants the", "The long awaited sequel to Running Scarred. ", "Working alongside his ex-veteran friends in the isolated French chateau where he doesn’t have to explain how his face was destroyed, suits Joe perfectly. Barely able look at his own reflection let alone show himself to anyone else, the longer he can remain secluded from the outside world the better he likes it. ", "But Joe wants the same as any man, he same things his friends have found and when a party of salesmen descends upon the chateau for a team building course, Joe’s resolve to keep out of the spotlight is put to its hardest test yet. The chief executive’s beautiful secretary is exactly the woman he is looking for, but he knows that she is unlikely to spare him even a glance. ", "Her life is complicated enough and embarking on any liaison is the last thing on Lucy’s mind but something about the huge ex-soldier has kept her heart pounding and her stomach fluttering from the moment she laid eyes on him. Joe’s scarred face pales into insignificance as she finds his potent strength, his gentle sincerity and his genial mood far too beguiling. ", "Can Lucy escape from her blackmailing boss and take what her heart desires without leaving herself destitute? Will Joe rise above his own crushing insecurities long enough to rescue Lucy not only from her own fears but from her handsome but lecherous employer, or will his lack of self-esteem and long practiced avoidance tactics prevent him from opening his heart and him keep him Forever Scarred? ", "Suitable for young adult upwards. Contains some swear words and beautiful sex."], "author": "Jackie Williams", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-08-15 00:00:00", "ISBN": "1492187224"},
{"url": "https://www.goodreads.com/book/show/1240662.Lover_Enshrined", "num_ratings": "97,479", "num_reviews": "3,924", "avg_ratings": 4.12, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Fantasy"], "title": "Lover Enshrined", "description": ["Fiercely loyal to the Black Dagger Brotherhood, Phury has sacrificed himself for the good of", "Fiercely loyal to the Black Dagger Brotherhood, Phury has sacrificed himself for the good of the race, becoming the male responsible for keeping the Brotherhood's bloodlines alive. As Primale of the Chosen, he is obligated to father the sons and daughters who will ensure that the traditions of the race survive, and that there are warriors to fight those who want all vampires extinguished. ", "As his first mate, the Chosen Cormia wants to win not only his body, but his heart for herself. She is drawn to the noble responsibility behind the emotionally scarred male. But Phury has never allowed himself to know pleasure or joy. As the war with the Lessening Society grows grim, tragedy looms over the Brotherhood's mansion, and Phury must decide between duty and love...."], "author": "J.R. Ward", "num_pages": "534", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Paranormal Romance (2009)", "P.E.A.R.L. (Paranormal Excellence Award for Romantic Literature) for Best Vampire Romance (2008)"], "places": ["Caldwell, New York"], "character_names": ["Zsadist", "Bella Soang", "Phury", "Cormia", "John Matthew", "Xhexania", "Qhuinn", "Blaylock", "Tohrment", "Rehvenge", "Lash", "The Scribe Virgin", "Mr. D", "Nalla", "Wrath (Blind King)"], "language": "English", "publish_date": "2008-06-03 00:00:00", "ISBN": "0451222725"},
{"url": "https://www.goodreads.com/book/show/14384.A_Hunger_Like_No_Other", "num_ratings": "57,301", "num_reviews": "2,864", "avg_ratings": 4.21, "genres": ["Romance", "Paranormal Romance", "Fantasy", "Paranormal", "Romance", "Paranormal", "Vampires", "Fantasy"], "title": "A Hunger Like No Other", "description": ["In ", "and ", "bestselling author Kresley Cole’s sizzling series, a fierce werewolf and a bewitching vampire become unlikely soul mates whose passion will test the boundaries of life and death.", "After enduring years of torture from the vampire horde, Lachlain MacRieve, leader of the Lykae Clan, is enraged to find the predestined mate he’s waited millennia fo", "In ", "and ", "bestselling author Kresley Cole’s sizzling series, a fierce werewolf and a bewitching vampire become unlikely soul mates whose passion will test the boundaries of life and death.", "After enduring years of torture from the vampire horde, Lachlain MacRieve, leader of the Lykae Clan, is enraged to find the predestined mate he’s waited millennia for is a vampire. Or partly one. Emmaline Troy is a small, ethereal half Valkyrie/half vampire, who somehow begins to soothe the fury burning within him.", "Sheltered Emmaline finally sets out to uncover the truth about her deceased parents—until a powerful Lykae claims her as his mate and forces her back to his ancestral Scottish castle. There, her fear of the Lykae—and their notorious dark desires—ebbs as he begins a slow, wicked seduction to sate her own dark cravings.", "Yet when an ancient evil from her past resurfaces, will their desire deepen into a love that can bring a proud warrior to his knees and turn a gentle beauty into the fighter she was born to be?"], "author": "Kresley Cole", "num_pages": "356", "awards": ["RITA Award by Romance Writers of America for Best Paranormal Romance (2007)", "HOLT Medallion by Virginia Romance Writers for Paranormal/Time Travel/Futuristic/Fantasy (2007)", "Maggie Award for Excellence (Georgia Romance Writers) Nominee for Contemporary Single Title Romance (2007)"], "places": ["Paris", "New Orleans, Louisiana", "Scottish Highlands"], "character_names": ["Lachlain MacRieve", "Emmaline Troy", "Phenïx \"Nïx\", The Ever-Knowing", "King Kristoff"], "language": "English", "publish_date": "2006-04-01 00:00:00", "ISBN": "1416509879"},
{"url": "https://www.goodreads.com/book/show/37442.Wicked", "num_ratings": "535,778", "num_reviews": "23,585", "avg_ratings": 3.52, "genres": ["Fantasy", "Fiction", "Adult"], "title": "Wicked: The Life and Times of the Wicked Witch of the West", "description": ["When Dorothy triumphed over the Wicked Witch of the West in L. Frank Baum's classic tale we heard only her side of the story. But what about her arch-nemesis, the mysterious Witch? Where did she come from? How did she become so wicked? And what is the true nature of evil?", "Gregory Maguire creates a fantasy world so rich and vivid that we will never look at Oz the same way ag", "When Dorothy triumphed over the Wicked Witch of the West in L. Frank Baum's classic tale we heard only her side of the story. But what about her arch-nemesis, the mysterious Witch? Where did she come from? How did she become so wicked? And what is the true nature of evil?", "Gregory Maguire creates a fantasy world so rich and vivid that we will never look at Oz the same way again. ", " is about a land where animals talk and strive to be treated like first-class citizens, Munchkinlanders seek the comfort of middle-class stability, and the Tin Man becomes a victim of domestic violence. And then there is the little green-skinned girl named Elphaba, who will grow up to become the infamous Wicked Witch of the West, a smart, prickly, and misunderstood creature who challenges all our preconceived notions about the nature of good and evil.", "An astonishingly rich re-creation of the land of Oz, this book retells the story of Elphaba, the Wicked Witch of the West, who wasn't so wicked after all. Taking readers past the yellow brick road and into a phantasmagoric world rich with imagination and allegory, Gregory Maguire just might change the reputation of one of the most sinister characters in literature."], "author": "Gregory Maguire", "num_pages": "406", "awards": ["Tähtifantasia Award Nominee (2009)"], "places": [], "character_names": ["Elphaba Thropp", "Liir", "Glinda Upland", "Galinda Upland", "Madam Morrible", "Nessarose Thropp", "Fiyero Tigelaar", "The Wizard of Oz"], "language": "English", "publish_date": "2000-08-16 00:00:00", "ISBN": "0060987103"},
{"url": "https://www.goodreads.com/book/show/304027.Lover_Unbound", "num_ratings": "110,063", "num_reviews": "4,500", "avg_ratings": 4.33, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Paranormal", "Vampires", "Romance", "Fantasy"], "title": "Lover Unbound", "description": ["The ruthless and brilliant brother Vishous possesses a destructive curse and a frightening ability to see the future. As a member of the Brotherhood, he has no interest in love or emotion, only the battle with the Lessening Society. But when a mortal injury puts him in the care of a human surgeon, Dr. Jane Whitcomb compels him to reveal his inner pain and taste true pleasu", "The ruthless and brilliant brother Vishous possesses a destructive curse and a frightening ability to see the future. As a member of the Brotherhood, he has no interest in love or emotion, only the battle with the Lessening Society. But when a mortal injury puts him in the care of a human surgeon, Dr. Jane Whitcomb compels him to reveal his inner pain and taste true pleasure for the first time-until a destiny he didn't choose takes him into a future that does not include her..."], "author": "J.R. Ward", "num_pages": "502", "awards": ["All About Romance (AAR) Annual Reader Poll for Most Tortured Hero & Honorable Mention for Guiltiest Pleasure Romance (2008)", "Romantic Times Reviewers' Choice Award (RT Award) for Vampire Romance (2007)"], "places": ["Caldwell, New York"], "character_names": ["Mary Luce", "Marissa", "Brian O'Neal", "Zsadist", "Bella Soang", "Vishous", "Jane Whitcomb", "Phury", "Cormia", "Beth (Elizabeth) Randall", "John Matthew", "Qhuinn", "Blaylock", "Tohrment", "The Scribe Virgin", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2007-10-01 00:00:00", "ISBN": "0451222350"},
{"url": "https://www.goodreads.com/book/show/40159.The_King_of_Attolia", "num_ratings": "27,845", "num_reviews": "2,383", "avg_ratings": 4.36, "genres": ["Fantasy", "Young Adult", "Fiction", "Adventure"], "title": "The King of Attolia", "description": ["By scheming and theft, the Thief of Eddis has become King of Attolia. Eugenides wanted the queen, not the crown, but he finds himself trapped in a web of his own making.", "Then he drags a naive young guard into the center of the political maelstrom. Poor Costis knows he is the victim of the king's caprice, but his contempt for Eugenides slowly turns to grudging respect. Thoug", "By scheming and theft, the Thief of Eddis has become King of Attolia. Eugenides wanted the queen, not the crown, but he finds himself trapped in a web of his own making.", "Then he drags a naive young guard into the center of the political maelstrom. Poor Costis knows he is the victim of the king's caprice, but his contempt for Eugenides slowly turns to grudging respect. Though struggling against his fate, the newly crowned king is much more than he appears. Soon the corrupt Attolian court will learn that its subtle and dangerous intrigue is no match for Eugenides."], "author": "Megan Whalen Turner", "num_pages": "387", "awards": ["Mythopoeic Fantasy Award for Children’s Literature (2011)", "Dorothy Canfield Fisher Children's Book Award Nominee (2008)", "Andre Norton Award Nominee (2006)"], "places": [], "character_names": ["Eugenides", "Costis", "Attolia", "Relius", "Teleus"], "language": "English", "publish_date": "2006-01-24 00:00:00", "ISBN": "006083577X"},
{"url": "https://www.goodreads.com/book/show/30597.The_Hunchback_of_Notre_Dame", "num_ratings": "147,251", "num_reviews": "3,689", "avg_ratings": 3.98, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Cultural", "France"], "title": "The Hunchback of Notre-Dame", "description": ["This extraordinary historical novel, set in Medieval Paris under the twin towers of its greatest structure and supreme symbol, the cathedral of Notre-Dame, is the haunting drama of Quasimodo, the hunchback; Esmeralda, the gypsy dancer; and Claude Frollo, the priest tortured by the specter of his own damnation. Shaped by a profound sense of tragic irony, it is a work that g", "This extraordinary historical novel, set in Medieval Paris under the twin towers of its greatest structure and supreme symbol, the cathedral of Notre-Dame, is the haunting drama of Quasimodo, the hunchback; Esmeralda, the gypsy dancer; and Claude Frollo, the priest tortured by the specter of his own damnation. Shaped by a profound sense of tragic irony, it is a work that gives full play to Victor Hugo's brilliant historical imagination and his remarkable powers of description."], "author": "Victor Hugo", "num_pages": "510", "awards": [], "places": ["Paris"], "character_names": ["Quasimodo", "Claude Frollo", "La Esmerelda", "Gringoire", "Captain Phoebus de Chateaupers"], "language": "English", "publish_date": "2001-04-10 00:00:00", "ISBN": "0451527887"},
{"url": "https://www.goodreads.com/book/show/42899.Dark_Lover", "num_ratings": "254,974", "num_reviews": "11,387", "avg_ratings": 4.21, "genres": ["Romance", "Fantasy", "Paranormal", "Paranormal", "Vampires", "Romance", "Paranormal Romance", "Fantasy"], "title": "Dark Lover", "description": ["In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherhood.", "The only purebred vampire left on earth, Wrath has a score", "In the shadows of the night in Caldwell, New York, there's a deadly turf war going on between vampires and their slayers. There exists a secret band of brothers like no other-six vampire warriors, defenders of their race. Yet none of them relishes killing more than Wrath, the leader of The Black Dagger Brotherhood.", "The only purebred vampire left on earth, Wrath has a score to settle with the slayers who murdered his parents centuries ago. But, when one of his most trusted fighters is killed-leaving his half-breed daughter unaware of his existence or her fate-Wrath must usher her into the world of the undead-a world of sensuality beyond her wildest dreams."], "author": "J.R. Ward", "num_pages": "393", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Alt Reality/Paranormal (2006)", "RITA Award by Romance Writers of America Nominee for Paranormal Romance (2006)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Vampire Romance (2005)", "HOLT Medallion by Virginia Romance Writers Nominee for Paranormal/Time Travel/Futuristic/Fantasy (2006)", "DABWAHA Romance Tournament for Best Paranormal: Vampires, Werewolves, and the Supernatural (2006)"], "places": ["Caldwell, New York", "New York (the state)"], "character_names": ["Mr. X", "Marissa", "Brian O'Neal", "Zsadist", "Vishous", "Fritz Perlmutter", "Phury", "Beth (Elizabeth) Randall", "Tohrment", "Mr. O", "Wellesandra", "Darius", "The Scribe Virgin", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0451216954"},
{"url": "https://www.goodreads.com/book/show/3003.The_Secret_Garden", "num_ratings": "755,587", "num_reviews": "14,685", "avg_ratings": 4.12, "genres": ["Classics", "Fiction", "Childrens", "Young Adult"], "title": "The Secret Garden", "description": ["This timeless classic is a poignant tale of Mary, a lonely orphaned girl sent to a Yorkshire mansion at the edge of a vast lonely moor. At first, she is frightened by this gloomy place until she meets a local boy, Dickon, who's earned the trust of the moor's wild animals, the invalid Colin, an unhappy boy terrified of life, and a mysterious, abandoned garden..."], "author": "Frances Hodgson Burnett", "num_pages": "281", "awards": ["Lewis Carroll Shelf Award (1958)"], "places": ["Yorkshire, England"], "character_names": ["Mary Lennox", "Colin Craven", "Dickon Sowerby", "Martha Sowerby", "Ben Weatherstaff", "Archibald Craven", "Lilias Craven", "Susan Sowerby", "Mrs. Medlock", "Dr. Craven"], "language": "English", "publish_date": "2003-07-01 00:00:00", "ISBN": "0451528832"},
{"url": "https://www.goodreads.com/book/show/10210.Jane_Eyre", "num_ratings": "1,364,345", "num_reviews": "34,236", "avg_ratings": 4.11, "genres": ["Classics", "Fiction", "Romance"], "title": "Jane Eyre", "description": [" ", " "], "author": "Charlotte Brontë", "num_pages": "507", "awards": [], "places": ["Thornfield", "England"], "character_names": ["Jane Eyre", "Bertha Mason", "Grace Poole", "Blanche Ingram", "Adele Varens", "St. John Rivers", "Helen Burns", "Richard Mason", "Diana Rivers", "Mary Rivers", "Maria Temple", "Robert Brocklehurst", "Sarah Reed", "Georgiana Reed", "Eliza Reed", "Bessie Lee", "Alice Fairfax", "Rosamond Oliver", "Edward Rochester", "John Eyre", "Celine Varens"], "language": "English", "publish_date": "2003-02-04 00:00:00", "ISBN": "0142437204"},
{"url": "https://www.goodreads.com/book/show/42900.Lover_Awakened", "num_ratings": "148,688", "num_reviews": "6,237", "avg_ratings": 4.45, "genres": ["Fantasy", "Paranormal", "Romance", "Paranormal Romance", "Romance", "Paranormal", "Vampires", "Fantasy", "Urban Fantasy"], "title": "Lover Awakened", "description": ["A former blood slave, the vampire Zsadist still bears the scars from a pas", "A former blood slave, the vampire Zsadist still bears the scars from a past filled with suffering and humiliation. Renowned for his unquenchable fury and sinister deeds, he is a savage feared by humans and vampires alike. Anger is his only companion, and terror is his only passion—until he rescues a beautiful aristocrat from the evil Lessening Society.", "Bella is instantly entranced by the seething power Zsadist possesses. But even as their desire for one another begins to overtake them both, Zsadist’s thirst for vengeance against Bella’s tormentors drives him to the brink of madness. Now, Bella must help her lover overcome the wounds of his tortured past, and find a future with her…"], "author": "J.R. Ward", "num_pages": "448", "awards": ["All About Romance (AAR) Annual Reader Poll for Best Romance & Best Paranormal & Most Tortured Hero & Strongest Heroine & Best Villain & Most-Hanky Read  & Honorable Mention for Best Couple (2007)", "Romantic Times Reviewers' Choice Award (RT Award) for Vampire Romance (2006)"], "places": ["Caldwell, New York"], "character_names": ["Mary Luce", "Marissa", "Brian O'Neal", "Zsadist", "Bella Soang", "Vishous", "Phury", "Beth (Elizabeth) Randall", "John Matthew", "Tohrment", "Rehvenge", "Wellesandra", "The Scribe Virgin", "Rhage", "Wrath (Blind King)"], "language": "English", "publish_date": "2006-09-05 00:00:00", "ISBN": "0451219368"}
]