[
{"url": "https://www.goodreads.com/book/show/773191.Dateline_Toronto", "num_ratings": "29", "num_reviews": "0", "avg_ratings": 4.1, "genres": ["Writing", "Journalism"], "title": "Dateline Toronto: The Complete Toronto Star Dispatches 1920-24", "description": ["Los artículos que Hemingway escribió para el ", " entre 1920 y 1924 son en su mayoría anteriores a la carrera literaria del autor. Cuando empezó a escribirlos era un perfecto desconocido, y cuando terminó ya había publicado unos cuantos relatos y novelas breves en ediciones de corta tirada. Sus reportajes para el ", " y el ", " le permi", "Los artículos que Hemingway escribió para el ", " entre 1920 y 1924 son en su mayoría anteriores a la carrera literaria del autor. Cuando empezó a escribirlos era un perfecto desconocido, y cuando terminó ya había publicado unos cuantos relatos y novelas breves en ediciones de corta tirada. Sus reportajes para el ", " y el ", " le permitieron ganarse la vida con la escritura y ver el mundo, en especial Europa, cuando aún era un joven impresionable. En ellos ya se vislumbra lo que sería el estilo del autor: su dominio de los diálogos y algunos temas que serán recurrentes en su obra, de tal manera que, como afirma William White -el especialista en Hemingway encargado de esta selección de artículos-, <>."], "author": "Ernest Hemingway", "num_pages": "478", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1985-12-31 00:00:00", "ISBN": "0684185156"},
{"url": "https://www.goodreads.com/book/show/386299.The_Old_Man_and_the_Sea", "num_ratings": "650,741", "num_reviews": "19,128", "avg_ratings": 3.74, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "The Old Man and the Sea", "description": ["It is the story of an old Cuban fisherman and his supreme ordeal: a relentless, agonizing battle with a giant marlin far out in the Gulf Stream. Using the simple, powerful language of a fable, Hemingway takes the timeless themes of courage in the face of defeat and personal triumph won from loss and transforms them into a magnificent twentieth-century classic."], "author": "Ernest Hemingway", "num_pages": "128", "awards": ["Pulitzer Prize for Fiction (1953)", "Premio Bancarella (1953)", "National Book Award Finalist for Fiction (1953)"], "places": ["Cuba"], "character_names": ["Santiago", "Manolin"], "language": "English", "publish_date": "1995-05-05 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3925233-the-hemingway-reader", "num_ratings": "43", "num_reviews": "5", "avg_ratings": 4.14, "genres": ["Fiction", "Short Stories", "Classics"], "title": "The Hemingway Reader", "description": ["1953 Charles Scribners Sons trade paperback, too early for ISBN. Ernest Hemingway (A Farewell To Arms;the Nick Adams Stories). ", "A collection of the author's best-and shortest- work."], "author": "Ernest Hemingway", "num_pages": "652", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1953-01-01 00:00:00", "ISBN": "0023534001"},
{"url": "https://www.goodreads.com/book/show/37420.The_Short_Stories_of_Ernest_Hemingway", "num_ratings": "7,040", "num_reviews": "211", "avg_ratings": 4.27, "genres": ["Fiction", "Short Stories", "Classics", "Literature"], "title": "The Short Stories of Ernest Hemingway", "description": ["At the age of twenty-two, Ernest Hemingway wrote his first short story, \"Up in Michigan.\" Seventeen years and forty-eight titles later, he was the undisputed master of the short-story form and the leading American man of letters. ", " introduced here with a revealing preface by the author, chronicles Hemingway's development as a writer, from his earliest atte", "At the age of twenty-two, Ernest Hemingway wrote his first short story, \"Up in Michigan.\" Seventeen years and forty-eight titles later, he was the undisputed master of the short-story form and the leading American man of letters. ", " introduced here with a revealing preface by the author, chronicles Hemingway's development as a writer, from his earliest attempts in the chapbook ", " published in Paris in 1923, to his more mature accomplishments in ", " Originally published in 1938 along with ", " this collection premiered \"The Capital of the World\" and \"Old Man at the Bridge,\" which derive from Hemingway's experiences in Spain, as well as \"The Short Happy Life of Francis Macomber\" and \"The Snows of Kilimanjaro,\" which figure among the finest of Hemingway's short fictions."], "author": "Ernest Hemingway", "num_pages": "499", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1987-03-01 00:00:00", "ISBN": "0020518609"},
{"url": "https://www.goodreads.com/book/show/2930301-the-essential-hemingway", "num_ratings": "313", "num_reviews": "30", "avg_ratings": 3.8, "genres": ["Fiction", "Classics", "Short Stories", "Literature"], "title": "The Essential Hemingway", "description": ["It has been said of Ernest Hemingway that half the writers of the twentieth century have tried to imitate him and the other half have tried not to. A towering figure in the pantheon of American letters, the leading voice of the 'lost generation', winner of the Nobel Prize for literature and a Pulitzer Prize, Hemingway is known around the world for the brilliance of his wri", "It has been said of Ernest Hemingway that half the writers of the twentieth century have tried to imitate him and the other half have tried not to. A towering figure in the pantheon of American letters, the leading voice of the 'lost generation', winner of the Nobel Prize for literature and a Pulitzer Prize, Hemingway is known around the world for the brilliance of his writing. The Essential Hemmingway is the perfect introduction to his astonishing, wide-ranging body of work. This impressive collection includes the full text of Fiesta, Hemingway's first major novel; long extracts from his three greatest works of fiction, A Farewell to Arms, To Have and Have Not and For Whom the Bell Tolls; twenty-five complete stories; and the breathtaking epilogue to Death in the Afternoon."], "author": "Ernest Hemingway", "num_pages": "461", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1983-08-12 00:00:00", "ISBN": "0586044736"},
{"url": "https://www.goodreads.com/book/show/114240.The_Torrents_of_Spring", "num_ratings": "2,768", "num_reviews": "244", "avg_ratings": 3.17, "genres": ["Fiction", "Classics", "Literature", "Literature", "American", "Novels"], "title": "The Torrents of Spring", "description": ["First published in 1926, ", " is a hilarious parody of the Chicago school of literature. Poking fun at that \"great race\" of writers, it depicts a vogue that Hemingway himself refused to follow. In style and substance, ", " is a burlesque of Sherwood Anderson's ", " but in the course of the narrative, other literary tendencies a", "First published in 1926, ", " is a hilarious parody of the Chicago school of literature. Poking fun at that \"great race\" of writers, it depicts a vogue that Hemingway himself refused to follow. In style and substance, ", " is a burlesque of Sherwood Anderson's ", " but in the course of the narrative, other literary tendencies associated with American and British writers akin to Anderson -- such as D. H. Lawrence, James Joyce, and John Dos Passos -- come in for satirical comment. A highly entertaining story, ", " offers a rare glimpse into Hemingway's early career as a storyteller and stylist."], "author": "Ernest Hemingway", "num_pages": "96", "awards": [], "places": [], "character_names": ["Yogi Johnson", "Scripps O'Neill"], "language": "English", "publish_date": "2004-08-12 00:00:00", "ISBN": "0684839075"},
{"url": "https://www.goodreads.com/book/show/184808.The_Dangerous_Summer", "num_ratings": "1,601", "num_reviews": "77", "avg_ratings": 3.66, "genres": ["Classics", "Fiction", "Literature", "American", "Literature", "Cultural", "Spain"], "title": "The Dangerous Summer", "description": [" is Hemingway's firsthand chronicle of a brutal season of bullfights. In this vivid account, Hemingway captures the exhausting pace and pressure of the season, the camaraderie and pride of the matadors, and the mortal drama as in fight after fight the rival matadors try to outdo each other with ever more daring performances. At the same time Hemingway o", " is Hemingway's firsthand chronicle of a brutal season of bullfights. In this vivid account, Hemingway captures the exhausting pace and pressure of the season, the camaraderie and pride of the matadors, and the mortal drama as in fight after fight the rival matadors try to outdo each other with ever more daring performances. At the same time Hemingway offers an often complex and deeply personal self-portrait that reveals much about one of the twentieth century's preeminent writers."], "author": "Ernest Hemingway", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-08-12 00:00:00", "ISBN": "0684837897"},
{"url": "https://www.goodreads.com/book/show/10776.Green_Hills_of_Africa", "num_ratings": "8,074", "num_reviews": "511", "avg_ratings": 3.56, "genres": ["Fiction", "Classics", "Cultural", "Africa", "Travel", "Literature"], "title": "Green Hills of Africa", "description": ["Green Hills of Africa is Ernest Hemingway's lyrical journal of a month on safari in the great game country of East Africa, where he and his wife Pauline journeyed in December 1933. Hemingway's well-known interest in - and fascination with - big-game hunting is magnificently captured in this evocative account of his trip. It is an examination of the lure of the hunt and an", "Green Hills of Africa is Ernest Hemingway's lyrical journal of a month on safari in the great game country of East Africa, where he and his wife Pauline journeyed in December 1933. Hemingway's well-known interest in - and fascination with - big-game hunting is magnificently captured in this evocative account of his trip. It is an examination of the lure of the hunt and an impassioned portrait of the glory of the African landscape and of the beauty of a wilderness that was, even then, being threatened by the incursions of man."], "author": "Ernest Hemingway", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-03-04 00:00:00", "ISBN": "0099460955"},
{"url": "https://www.goodreads.com/book/show/133595.True_At_First_Light", "num_ratings": "2,225", "num_reviews": "155", "avg_ratings": 3.32, "genres": ["Fiction", "Classics", "Cultural", "Africa"], "title": "True At First Light: A Fictional Memoir", "description": ["Both a revealing self-portrait and dramatic fictional chronicle of his final African safari. Written in 1953, edited and first published by son, Patrick, in 1999.", "Both a revealing self-portrait and dramatic fictional chronicle of his final African safari, Ernest Hemingway's last unpublished work was written when he returned from Kenya in 1953. Edited by his son Patrick, who", "Both a revealing self-portrait and dramatic fictional chronicle of his final African safari. Written in 1953, edited and first published by son, Patrick, in 1999.", "Both a revealing self-portrait and dramatic fictional chronicle of his final African safari, Ernest Hemingway's last unpublished work was written when he returned from Kenya in 1953. Edited by his son Patrick, who accompanied his father on the safari, True at First Light offers rare insights into the legendary American writer in the year of the hundredth anniversary of his birth.", "A blend of autobiography and fiction, the book opens on the day his close friend Pop, a celebrated hunter, leaves Ernest in charge of the safari camp and news arrives of a potential attack from a hostile tribe. Drama continues to build as his wife, Mary, pursues the great black-maned lion that has become her obsession. Spicing his depictions of human longings with sharp humor, Hemingway captures the excitement of big-game hunting and the unparalleled beauty of the scenery -- the green plains covered with gray mist, zebra and gazelle traversing the horizon, cool dark nights broken by the sounds of the hyena's cry. ", "As the group at camp help Mary track her prize, she and Ernest suffer the \"incalculable casualties of marriage,\" and their attempts to love each other well are marred by cruelty, competition and infidelity. Ernest has become involved with Debba, an African girl whom he supposedly plans to take as a second bride. Increasingly enchanted by the local African community, he struggles between the attraction of these two women and the wildly different cultures they represent. ", "In True at First Light, Hemingway also chronicles his exploits -- sometimes hilarious and sometimes poignant -- among the African men with whom he has become very close, reminisces about encounters with other writers and his days in Paris and Spain and satirizes, among other things, the role of organized religion in Africa. He also muses on the act of writing itself and the author's role in determining the truth. What is fact and what is fiction? This is a question that was posed by Hemingway's readers throughout his career and is one of his principal subjects here. ", "Equally adept at evoking the singular textures of the landscape, the thrill of the hunt and the complexities of married life, Hemingway weaves a tale that is rich in laughter, beauty and profound insight. True at First Light is an extraordinary publishing event -- a breathtaking final work from one of America's most beloved and important writers."], "author": "Ernest Hemingway", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-07-06 00:00:00", "ISBN": "0684865726"},
{"url": "https://www.goodreads.com/book/show/42683.Ernest_Hemingway_on_Writing", "num_ratings": "2,672", "num_reviews": "230", "avg_ratings": 4.06, "genres": ["Language", "Writing", "Nonfiction", "Literature"], "title": "Ernest Hemingway on Writing", "description": ["An assemblage of reflections on the nature of writing and the writer from one the greatest American writers of the twentieth century.", "Throughout Hemingway’s career as a writer, he maintained that it was bad luck to talk about writing—that it takes off “whatever butterflies have on their wings and the arrangement of hawk’s feathers if you show it or talk about it.”", "Despite th", "An assemblage of reflections on the nature of writing and the writer from one the greatest American writers of the twentieth century.", "Throughout Hemingway’s career as a writer, he maintained that it was bad luck to talk about writing—that it takes off “whatever butterflies have on their wings and the arrangement of hawk’s feathers if you show it or talk about it.”", "Despite this belief, by the end of his life he had done just what he intended not to do. In his novels and stories, in letters to editors, friends, fellow artists, and critics, in interviews and in commissioned articles on the subject, Hemingway wrote often about writing. And he wrote as well and as incisively about the subject as any writer who ever lived…", "This book contains Hemingway’s reflections on the nature of the writer and on elements of the writer’s life, including specific and helpful advice to writers on the craft of writing, work habits, and discipline. The Hemingway personality comes through in general wisdom, wit, humor, and insight, and in his insistence on the integrity of the writer and of the profession itself.", "—From the Preface by Larry W. Phillips"], "author": "Ernest Hemingway", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-08-12 00:00:00", "ISBN": "0684854295"},
{"url": "https://www.goodreads.com/book/show/4633.Islands_in_the_Stream", "num_ratings": "11,611", "num_reviews": "554", "avg_ratings": 3.87, "genres": ["Fiction", "Classics", "Literature"], "title": "Islands in the Stream", "description": ["First published in 1970, nine years after Ernest Hemingway's death, ", " is the story of an artist and adventurer — a man much like Hemingway himself. Rich with the uncanny sense of life and action characteristic of his writing — from his earliest stories ", " to his last novella ", " — this compelling novel contains both the", "First published in 1970, nine years after Ernest Hemingway's death, ", " is the story of an artist and adventurer — a man much like Hemingway himself. Rich with the uncanny sense of life and action characteristic of his writing — from his earliest stories ", " to his last novella ", " — this compelling novel contains both the warmth of recollection that inspired ", " and a rare glimpse of Hemingway's rich and relaxed sense of humor, which enlivens scene after scene. ", " Beginning in the 1930s, ", " follows the fortunes of Thomas Hudson from his experiences as a painter on the Gulf Stream island of Bimini, where his loneliness is broken by the vacation visit of his three young sons, to his antisubmarine activities off the coast of Cuba during World War II. The greater part of the story takes place in a Havana bar, where a wildly diverse cast of characters — including an aging prostitute who stands out as one of Hemingway's most vivid creations — engages in incomparably rich dialogue. A brilliant portrait of the inner life of a complex and endlessly intriguing man, ", " is Hemingway at his mature best."], "author": "Ernest Hemingway", "num_pages": "448", "awards": [], "places": [], "character_names": ["Thomas Hudson"], "language": "English", "publish_date": "2003-07-22 00:00:00", "ISBN": "0743253426"},
{"url": "https://www.goodreads.com/book/show/4648.Death_in_the_Afternoon", "num_ratings": "6,690", "num_reviews": "340", "avg_ratings": 3.71, "genres": ["Classics", "Nonfiction", "Literature", "Cultural", "Spain"], "title": "Death in the Afternoon", "description": ["Still considered one of the best books ever written about bullfighting, \"Death in the Afternoon\" is an impassioned look at the sport by one of its true aficionados. It reflects Hemingway's conviction that bullfighting was more than mere sport and reveals a rich source of inspiration for his art. The unrivaled drama of bullfighting, with its rigorous combination of athletic", "Still considered one of the best books ever written about bullfighting, \"Death in the Afternoon\" is an impassioned look at the sport by one of its true aficionados. It reflects Hemingway's conviction that bullfighting was more than mere sport and reveals a rich source of inspiration for his art. The unrivaled drama of bullfighting, with its rigorous combination of athleticism and artistry, and its requisite display of grace under pressure, ignited Hemingway's imagination. Here he describes and explains the technical aspects of this dangerous ritual and \"the emotional and spiritual intensity and pure classic beauty that can be produced by a man, an animal, and a piece of scarlet serge draped on a stick.\" Seen through his eyes, bullfighting becomes a richly choreographed ballet, with performers who range from awkward amateurs to masters of great elegance and cunning. "], "author": "Ernest Hemingway", "num_pages": "496", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10778.Across_the_River_and_into_the_Trees", "num_ratings": "6,192", "num_reviews": "422", "avg_ratings": 3.34, "genres": ["Fiction", "Classics", "Literature", "Literature", "American"], "title": "Across the River and into the Trees", "description": ["In the fall of 1948, Ernest Hemingway made his first extended visit to Italy in thirty years. His reacquaintance with Venice, a city he loved, provided the inspiration for ", " the story of Richard Cantwell, a war-ravaged American colonel stationed in Italy at the close of the Second World War, and his love for a young Italian countess. A po", "In the fall of 1948, Ernest Hemingway made his first extended visit to Italy in thirty years. His reacquaintance with Venice, a city he loved, provided the inspiration for ", " the story of Richard Cantwell, a war-ravaged American colonel stationed in Italy at the close of the Second World War, and his love for a young Italian countess. A poignant, bittersweet homage to love that overpowers reason, to the resilience of the human spirit, and to the worldweary beauty and majesty of Venice, ", " stands as Hemingway's statement of defiance in response to the great dehumanizing atrocities of the Second World War. Hemingway's last full-length novel published in his lifetime, it moved John O'Hara in ", " to call him \"the most important author since Shakespeare.\""], "author": "Ernest Hemingway", "num_pages": "272", "awards": [], "places": ["Venice"], "character_names": [], "language": "English", "publish_date": "1998-04-15 00:00:00", "ISBN": "0684844648"},
{"url": "https://www.goodreads.com/book/show/10775.The_Garden_of_Eden", "num_ratings": "14,886", "num_reviews": "954", "avg_ratings": 3.74, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "The Garden of Eden", "description": ["A sensational bestseller when it appeared in 1986, ", " is the last uncompleted novel of Ernest Hemingway, which he worked on intermittently from 1946 until his death in 1961. Set on the Côte d'Azur in the 1920s, it is the story of a young American writer, David Bourne, his glamorous wife, Catherine, and the dangerous, erotic game they play when they fall in", "A sensational bestseller when it appeared in 1986, ", " is the last uncompleted novel of Ernest Hemingway, which he worked on intermittently from 1946 until his death in 1961. Set on the Côte d'Azur in the 1920s, it is the story of a young American writer, David Bourne, his glamorous wife, Catherine, and the dangerous, erotic game they play when they fall in love with the same woman. \"A lean, sensuous narrative...taut, chic, and strangely contemporary,\" ", " represents vintage Hemingway, the master \"doing what nobody did better\" (R. Z. Sheppard, "], "author": "Ernest Hemingway", "num_pages": "248", "awards": [], "places": [], "character_names": ["David Bourne", "Catherine Bourne", "Marita"], "language": "English", "publish_date": "2003-08-12 00:00:00", "ISBN": "0684804522"},
{"url": "https://www.goodreads.com/book/show/4630.To_Have_and_Have_Not", "num_ratings": "20,924", "num_reviews": "1,238", "avg_ratings": 3.56, "genres": ["Fiction", "Classics", "Literature"], "title": "To Have and Have Not", "description": [" is the dramatic story of Harry Morgan, an honest man who is forced into running contraband between Cuba and Key West as a means of keeping his crumbling family financially afloat. His adventures lead him into the world of the wealthy and dissipated yachtsmen who throng the region, and involve him in a strange and unlikely love affair.", "Harshly realistic,", " is the dramatic story of Harry Morgan, an honest man who is forced into running contraband between Cuba and Key West as a means of keeping his crumbling family financially afloat. His adventures lead him into the world of the wealthy and dissipated yachtsmen who throng the region, and involve him in a strange and unlikely love affair.", "Harshly realistic, yet with one of the most subtle and moving relationships in the Hemingway oeuvre, ", " is literary high adventure at its finest."], "author": "Ernest Hemingway", "num_pages": "176", "awards": [], "places": ["Havana", "Key West, Florida", "Florida"], "character_names": ["Harry Morgan"], "language": "English", "publish_date": "1999-08-12 00:00:00", "ISBN": "0684859238"},
{"url": "https://www.goodreads.com/book/show/4625.The_Complete_Short_Stories", "num_ratings": "31,538", "num_reviews": "738", "avg_ratings": 4.29, "genres": ["Short Stories", "Fiction", "Classics", "Literature"], "title": "The Complete Short Stories", "description": [" ", " In this definitive collection of Ernest Hemingway's short stories, readers will delight in the author's most beloved classics such as ", " and ", " and will discover seven new tales published for the first time in this collection. F", " ", " In this definitive collection of Ernest Hemingway's short stories, readers will delight in the author's most beloved classics such as ", " and ", " and will discover seven new tales published for the first time in this collection. For Hemingway fans ", " is an invaluable treasury."], "author": "Ernest Hemingway", "num_pages": "650", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-08-03 00:00:00", "ISBN": "0684843323"},
{"url": "https://www.goodreads.com/book/show/4631.A_Moveable_Feast", "num_ratings": "98,457", "num_reviews": "6,875", "avg_ratings": 4.04, "genres": ["Classics", "Nonfiction", "Autobiography", "Memoir", "Biography", "Travel"], "title": "A Moveable Feast", "description": ["Hemingway's memories of his life as an unknown writer living in Paris in the twenties are deeply personal, warmly affectionate and full of wit. Looking back not only at his own much younger self, but also at the other writers who shared Paris with him - James Joyce, Wyndham Lewis, Scott and Zelda Fitzgerald - he recalls the time when, poor, happy and writing in cafes, he d", "Hemingway's memories of his life as an unknown writer living in Paris in the twenties are deeply personal, warmly affectionate and full of wit. Looking back not only at his own much younger self, but also at the other writers who shared Paris with him - James Joyce, Wyndham Lewis, Scott and Zelda Fitzgerald - he recalls the time when, poor, happy and writing in cafes, he discovered his vocation. Written during the last years of Hemingway's life, his memoir is a lively and powerful reflection of his genius that scintillates with the romance of the city."], "author": "Ernest Hemingway", "num_pages": "192", "awards": [], "places": ["Paris"], "character_names": ["F. Scott Fitzgerald", "Ezra Pound", "Aleister Crowley", "Gertrude Stein", "Wyndham Lewis", "Hadley Richardson Hemingway", "Blaise Cendrars"], "language": "English", "publish_date": "2012-09-06 00:00:00", "ISBN": "0099285045"},
{"url": "https://www.goodreads.com/book/show/46170.For_Whom_the_Bell_Tolls", "num_ratings": "220,084", "num_reviews": "5,153", "avg_ratings": 3.96, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction", "War", "Novels", "Literature", "American", "Cultural", "Spain", "Classics", "Classic Literature", "Literature", "20th Century"], "title": "For Whom the Bell Tolls", "author": "Ernest Hemingway", "num_pages": "471", "awards": [], "places": ["Spain"], "character_names": ["Mariecke", "Pilar", "Robert Jordan", "Anselmo", "El Sordo", "Pablo Saler"], "language": "English", "publish_date": "1995-08-12 00:00:00", "ISBN": "0684803356"},
{"url": "https://www.goodreads.com/book/show/3876.The_Sun_Also_Rises", "num_ratings": "323,565", "num_reviews": "10,742", "avg_ratings": 3.82, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "The Sun Also Rises", "description": ["The quintessential novel of the Lost Generation, ", " is one of Ernest Hemingway's masterpieces and a classic example of his spare but powerful writing style. A poignant look at the disillusionment and angst of the post-World War I generation, the novel introduces two of Hemingway's most unforgettable characters: Jake Barnes and Lady Brett Ashley. The story f", "The quintessential novel of the Lost Generation, ", " is one of Ernest Hemingway's masterpieces and a classic example of his spare but powerful writing style. A poignant look at the disillusionment and angst of the post-World War I generation, the novel introduces two of Hemingway's most unforgettable characters: Jake Barnes and Lady Brett Ashley. The story follows the flamboyant Brett and the hapless Jake as they journey from the wild nightlife of 1920s Paris to the brutal bullfighting rings of Spain with a motley group of expatriates. It is an age of moral bankruptcy, spiritual dissolution, unrealized love, and vanishing illusions. First published in 1926, ", " helped to establish Hemingway as one of the greatest writers of the twentieth century."], "author": "Ernest Hemingway", "num_pages": "189", "awards": [], "places": ["Paris", "Pamplona", "San Sebastián", "Madrid"], "character_names": ["Jake Barnes", "Brett Ashley", "Robert Cohn", "Michael Campbell", "Bill Gorton", "Pedro Romero"], "language": "English", "publish_date": "1957-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/10799.A_Farewell_to_Arms", "num_ratings": "224,001", "num_reviews": "7,859", "avg_ratings": 3.79, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "War", "Literature"], "title": "A Farewell to Arms", "description": [" is the unforgettable story of an American ambulance driver on the Italian front and his passion for a beautiful English nurse. Set against the looming horrors of the battlefield—weary, demoralized men marching in the rain during the German attack on Caporetto; the profound struggle between loyalty and desertion—this gripping, semiautobiographical work ca", " is the unforgettable story of an American ambulance driver on the Italian front and his passion for a beautiful English nurse. Set against the looming horrors of the battlefield—weary, demoralized men marching in the rain during the German attack on Caporetto; the profound struggle between loyalty and desertion—this gripping, semiautobiographical work captures the harsh realities of war and the pain of lovers caught in its inexorable sweep. Ernest Hemingway famously said that he rewrote the ending to ", " thirty-nine times to get the words right."], "author": "Ernest Hemingway", "num_pages": "293", "awards": [], "places": ["Italy", "Milan"], "character_names": ["Frederic Henry", "Catherine Barkley", "Rinaldi"], "language": "English", "publish_date": "2004-08-12 00:00:00", "ISBN": "0099910101"},
{"url": "https://www.goodreads.com/book/show/2165.The_Old_Man_and_the_Sea", "num_ratings": "650,736", "num_reviews": "19,128", "avg_ratings": 3.74, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "The Old Man and the Sea", "description": ["It is the story of an old Cuban fisherman and his supreme ordeal: a relentless, agonizing battle with a giant marlin far out in the Gulf Stream. Using the simple, powerful language of a fable, Hemingway takes the timeless themes of courage in the face of defeat and personal triumph won from loss and transforms them into a magnificent twentieth-century classic."], "author": "Ernest Hemingway", "num_pages": "132", "awards": ["Pulitzer Prize for Fiction (1953)", "Premio Bancarella (1953)", "National Book Award Finalist for Fiction (1953)"], "places": ["Cuba"], "character_names": ["Santiago", "Manolin"], "language": "English", "publish_date": "1996-08-12 00:00:00", "ISBN": "0684830493"}
]