[
{"url": "https://www.goodreads.com/book/show/98160.Gertrude_and_Claudius", "num_ratings": "1,895", "num_reviews": "188", "avg_ratings": 3.54, "genres": ["Fiction", "Historical", "Historical Fiction", "Literature", "Literature", "American"], "title": "Gertrude and Claudius", "description": ["Using details of the ancient Scandinavian legends that were the inspiration for Hamlet, John Updike brings to life Gertrude's girlhood as the daughter of King Rorik, her arranged marriage to the man who becomes King Hamlet, and her middle-aged affair with her husband's younger brother. As only he could, Updike recasts a tale of medieval violence and presents the case for i", "Using details of the ancient Scandinavian legends that were the inspiration for Hamlet, John Updike brings to life Gertrude's girlhood as the daughter of King Rorik, her arranged marriage to the man who becomes King Hamlet, and her middle-aged affair with her husband's younger brother. As only he could, Updike recasts a tale of medieval violence and presents the case for its central couple that Shakespeare only hinted at. Gertrude's warmth and lucidity, Claudius's soldierly yet peaceable powers of command are seen afresh against a background of fond intentions and familial dysfunction, on a stage darkened by the ominous shadow of a sullen, disaffected prince."], "author": "John Updike", "num_pages": "224", "awards": [], "places": [], "character_names": ["Hamlet", "Polonius", "Gertrude", "Claudius"], "language": "English", "publish_date": "2001-07-05 00:00:00", "ISBN": "0140290907"},
{"url": "https://www.goodreads.com/book/show/1872588.The_Women_Who_Got_Away", "num_ratings": "256", "num_reviews": "23", "avg_ratings": 3.18, "genres": ["Fiction", "Short Stories", "Literature", "20th Century", "Classics", "Romance"], "title": "The Women Who Got Away", "description": ["In the small town of Pierce Junction adultery is the popular pastime and pillow talk the common currency. Martin knows the women he hasn’t yet seduced hold his attention for the longest, and Winifred, married to his own wife’s lover, stirs him in ways he never expects.", "United by the theme of love, the writings in the Great Loves series span over two thousand years and vastl", "In the small town of Pierce Junction adultery is the popular pastime and pillow talk the common currency. Martin knows the women he hasn’t yet seduced hold his attention for the longest, and Winifred, married to his own wife’s lover, stirs him in ways he never expects.", "United by the theme of love, the writings in the Great Loves series span over two thousand years and vastly different worlds. Readers will be introduced to love’s endlessly fascinating possibilities and extremities: romantic love, platonic love, erotic love, gay love, virginal love, adulterous love, parental love, filial love, nostalgic love, unrequited love, illicit love, not to mention lost love, twisted and obsessional love…"], "author": "John Updike", "num_pages": "106", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-08-02 00:00:00", "ISBN": "0141032936"},
{"url": "https://www.goodreads.com/book/show/4648.Death_in_the_Afternoon", "num_ratings": "6,690", "num_reviews": "340", "avg_ratings": 3.71, "genres": ["Classics", "Nonfiction", "Literature", "Cultural", "Spain"], "title": "Death in the Afternoon", "description": ["Still considered one of the best books ever written about bullfighting, \"Death in the Afternoon\" is an impassioned look at the sport by one of its true aficionados. It reflects Hemingway's conviction that bullfighting was more than mere sport and reveals a rich source of inspiration for his art. The unrivaled drama of bullfighting, with its rigorous combination of athletic", "Still considered one of the best books ever written about bullfighting, \"Death in the Afternoon\" is an impassioned look at the sport by one of its true aficionados. It reflects Hemingway's conviction that bullfighting was more than mere sport and reveals a rich source of inspiration for his art. The unrivaled drama of bullfighting, with its rigorous combination of athleticism and artistry, and its requisite display of grace under pressure, ignited Hemingway's imagination. Here he describes and explains the technical aspects of this dangerous ritual and \"the emotional and spiritual intensity and pure classic beauty that can be produced by a man, an animal, and a piece of scarlet serge draped on a stick.\" Seen through his eyes, bullfighting becomes a richly choreographed ballet, with performers who range from awkward amateurs to masters of great elegance and cunning. "], "author": "Ernest Hemingway", "num_pages": "496", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-09-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11326.Love", "num_ratings": "7,850", "num_reviews": "514", "avg_ratings": 3.72, "genres": ["Fiction", "Cultural", "African American", "Literary Fiction", "Novels"], "title": "Love", "description": ["Nobel Prize laureate Toni Morrison’s spellbinding new novel is a Faulknerian symphony of passion and hatred, power and perversity, color and class that spans three generations of black women in a fading beach town.", "In life, Bill Cosey enjoyed the affections of many women, who would do almost anything to gain his favor. In death his hold on them may be even stronger. Wife, d", "Nobel Prize laureate Toni Morrison’s spellbinding new novel is a Faulknerian symphony of passion and hatred, power and perversity, color and class that spans three generations of black women in a fading beach town.", "In life, Bill Cosey enjoyed the affections of many women, who would do almost anything to gain his favor. In death his hold on them may be even stronger. Wife, daughter, granddaughter, employee, mistress: As Morrison’s protagonists stake their furious claim on Cosey’s memory and estate, using everything from intrigue to outright violence, she creates a work that is shrewd, funny, erotic, and heartwrenching."], "author": "Toni Morrison", "num_pages": "224", "awards": ["Orange Prize Nominee for Fiction Longlist (2004)", "Ohioana Book Award for Fiction (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-01-04 00:00:00", "ISBN": "1400078474"},
{"url": "https://www.goodreads.com/book/show/50696.The_Ghost_Writer", "num_ratings": "8,384", "num_reviews": "610", "avg_ratings": 3.82, "genres": ["Fiction", "Novels", "Literature", "American", "Literature", "Literary Fiction"], "title": "The Ghost Writer", "description": ["When talented young writer Nathan Zuckerman makes his pilgrimage to sit at the feet of his hero, the reclusive master of American Literature, E. I. Lonoff, he soon finds himself enmeshed in the great Jewish writer's domestic life, with all its complexity, artifice and drive for artistic truth. As Nathan sits in breathlessly awkward conversation with his idol, a glimpse of", "When talented young writer Nathan Zuckerman makes his pilgrimage to sit at the feet of his hero, the reclusive master of American Literature, E. I. Lonoff, he soon finds himself enmeshed in the great Jewish writer's domestic life, with all its complexity, artifice and drive for artistic truth. As Nathan sits in breathlessly awkward conversation with his idol, a glimpse of a dark-haired beauty through a closing doorway leaves him reeling. He soon learns that the entrancing vision is Amy Bellette, but her position in the Lonoff household - student? mistress? - remains tantalisingly unclear. Over a disturbed and confusing dinner, Nathan gleans snippets of Amy's haunting Jewish background, and begins to draw his own fantastical conclusions..."], "author": "Philip Roth", "num_pages": "179", "awards": ["Pulitzer Prize Nominee for Fiction (1980)", "National Book Critics Circle Award Nominee for Fiction (1979)", "National Book Award Finalist for Fiction (Hardcover) (1980)"], "places": ["Massachusetts"], "character_names": ["Nathan Zuckerman", "E.I. Lonoff", "Hope Lonoff", "Amy Bellette", "Felix Abravanel"], "language": "English", "publish_date": "2005-08-12 00:00:00", "ISBN": "0099477572"},
{"url": "https://www.goodreads.com/book/show/15923811-the-legend-of-sleepy-hollow-and-other-stories", "num_ratings": "48,817", "num_reviews": "557", "avg_ratings": 3.94, "genres": ["Literature", "American", "Literature", "19th Century", "Mystery", "Classics", "Fantasy", "Supernatural"], "title": "The Legend of Sleepy Hollow and Other Stories", "description": [" ", " "], "author": "Washington Irving", "num_pages": "407", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-10-19 00:00:00", "ISBN": "0007920660"},
{"url": "https://www.goodreads.com/book/show/8732.The_Red_Pony", "num_ratings": "42,964", "num_reviews": "1,731", "avg_ratings": 3.43, "genres": ["Classics", "Fiction", "Literature", "Young Adult", "Animals"], "title": "The Red Pony", "description": ["Raised on a ranch in northern California, Jody is well-schooled in the hard work and demands of a rancher's life. He is used to the way of horses, too; but nothing has prepared him for the special connection he will forge with Gabilan, a hot-tempered pony his father gives him. With Billy Buck, the hired hand, Jody tends and trains his horse, restlessly anticipating the mom", "Raised on a ranch in northern California, Jody is well-schooled in the hard work and demands of a rancher's life. He is used to the way of horses, too; but nothing has prepared him for the special connection he will forge with Gabilan, a hot-tempered pony his father gives him. With Billy Buck, the hired hand, Jody tends and trains his horse, restlessly anticipating the moment he will sit high upon Gabilan's saddle. But when Gabilan falls ill, Jody discovers there are still lessons he must learn about the ways of nature and, particularly, the ways of man."], "author": "John Steinbeck", "num_pages": "95", "awards": [], "places": [], "character_names": ["Jody Tiflin", "Billy Buck", "Carl Tiflin", "Gitano"], "language": null, "publish_date": "2011-03-03 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13634710-scheepsberichten", "num_ratings": "117,382", "num_reviews": "4,367", "avg_ratings": 3.84, "genres": ["Fiction", "Contemporary", "Literature"], "title": "Scheepsberichten", "description": ["When Quoyle's two-timing wife meets her just desserts, he retreats with his two daughters to his ancestral home on the starkly beautiful Newfoundland coast, where a rich cast of local characters and family members all play a part in Quoyle's struggle to reclaim his life. As Quoyle confronts his private demons--and the unpredictable forces of nature and society--he begins t", "When Quoyle's two-timing wife meets her just desserts, he retreats with his two daughters to his ancestral home on the starkly beautiful Newfoundland coast, where a rich cast of local characters and family members all play a part in Quoyle's struggle to reclaim his life. As Quoyle confronts his private demons--and the unpredictable forces of nature and society--he begins to see the possibility of love without pain or misery. A vigorous, darkly comic, and at times magical portrait of the contemporary North American family, ", " shows why Annie Proulx is recognized as one of the most gifted and original writers in America today."], "author": "Annie Proulx", "num_pages": "400", "awards": ["Pulitzer Prize for Fiction (1994)", "National Book Award for Fiction (1993)", "Irish Times International Fiction Prize (1993)", "Chicago Tribune Heartland Prize for Fiction (1993)", "National Book Critics Circle Award Nominee for Fiction (1993)"], "places": ["Newfoundland", "Canada"], "character_names": [], "language": "Dutch", "publish_date": "1995-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12678476-the-confidence-man", "num_ratings": "2,265", "num_reviews": "217", "avg_ratings": 3.67, "genres": ["Fiction", "Classics", "Literature", "American", "Literature", "Novels"], "title": "The Confidence-Man", "description": ["Male, female, deft, fraudulent, constantly shifting: which of the masquerade of passengers on the Mississippi steamboat Fidele is the confidence man? The central motif of Melville's last and most modern novel can be seen as a symbol of American cultural history."], "author": "Herman Melville", "num_pages": "362", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12660356-the-scarlet-letter-and-selected-tales", "num_ratings": "169", "num_reviews": "6", "avg_ratings": 3.76, "genres": ["Fiction", "Classics", "Short Stories", "Literature", "American"], "title": "The Scarlet Letter and Selected Tales", "description": ["The Scarlet Letter and Selected Tales"], "author": "Nathaniel Hawthorne", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1970-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2930301-the-essential-hemingway", "num_ratings": "313", "num_reviews": "30", "avg_ratings": 3.8, "genres": ["Fiction", "Classics", "Short Stories", "Literature"], "title": "The Essential Hemingway", "description": ["It has been said of Ernest Hemingway that half the writers of the twentieth century have tried to imitate him and the other half have tried not to. A towering figure in the pantheon of American letters, the leading voice of the 'lost generation', winner of the Nobel Prize for literature and a Pulitzer Prize, Hemingway is known around the world for the brilliance of his wri", "It has been said of Ernest Hemingway that half the writers of the twentieth century have tried to imitate him and the other half have tried not to. A towering figure in the pantheon of American letters, the leading voice of the 'lost generation', winner of the Nobel Prize for literature and a Pulitzer Prize, Hemingway is known around the world for the brilliance of his writing. The Essential Hemmingway is the perfect introduction to his astonishing, wide-ranging body of work. This impressive collection includes the full text of Fiesta, Hemingway's first major novel; long extracts from his three greatest works of fiction, A Farewell to Arms, To Have and Have Not and For Whom the Bell Tolls; twenty-five complete stories; and the breathtaking epilogue to Death in the Afternoon."], "author": "Ernest Hemingway", "num_pages": "461", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1983-08-12 00:00:00", "ISBN": "0586044736"},
{"url": "https://www.goodreads.com/book/show/12675603-requiem-for-a-nun", "num_ratings": "823", "num_reviews": "79", "avg_ratings": 3.56, "genres": ["Fiction", "Classics", "Literature", "Novels", "Literature", "20th Century"], "title": "Requiem for a Nun", "description": ["Nancy, a negro nursemaid, is about to be hanged for killing her mistress's baby: her lawyer, Gavin Stevens, compels the mistress to confess the reason for Nancy's crime. The law takes its course; but justice, in Faulkner's sense, has been done."], "author": "William Faulkner", "num_pages": "240", "awards": ["National Book Award Finalist for Fiction (1952)"], "places": ["Yoknapatawpha County, Mississippi"], "character_names": ["Gavin Stevens", "Gowan Stevens", "Temple Drake"], "language": "English", "publish_date": "1981-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/58544.Snopes", "num_ratings": "648", "num_reviews": "43", "avg_ratings": 4.37, "genres": ["Fiction", "Classics", "Literature", "Novels"], "title": "Snopes", "description": ["Here, published in a single volume as Faulkner always hoped they would be, are the three novels that comprise the famous Snopes trilogy, a saga that stands as perhaps the greatest feat of Faulkner's imagination. ", "the first book of the series chronicling the advent and rise of the grasping Snopes family in mythical Yoknapatawpha County, is a work that Cleanth Bro", "Here, published in a single volume as Faulkner always hoped they would be, are the three novels that comprise the famous Snopes trilogy, a saga that stands as perhaps the greatest feat of Faulkner's imagination. ", "the first book of the series chronicling the advent and rise of the grasping Snopes family in mythical Yoknapatawpha County, is a work that Cleanth Brooks called \"one of the richest novels in the Faulkner canon.\" It recounts how the wily, cunning Flem Snopes dominates the rural community of Frenchman's Bend - and claims the voluptuous Eula Varner as his bride. ", " the second novel, records Flem's ruthless struggle to take over the county seat of Jefferson, Mississippi. Finally, ", "tells of Mink Snopes, whose archaic sense of honor brings about the downfall of his cousin Flem. \"For all his concerns with the South, Faulkner was actually seeking out the nature of man,\" noted Ralph Ellison. \"Thus we must turn to him for that continuity of moral purpose which made for the greatness of our classics.\""], "author": "William Faulkner", "num_pages": "1072", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-03-15 00:00:00", "ISBN": "0679600922"},
{"url": "https://www.goodreads.com/book/show/10804.Collected_Stories", "num_ratings": "687", "num_reviews": "71", "avg_ratings": 4.22, "genres": ["Short Stories", "Fiction"], "title": "Collected Stories", "description": ["In a literary career spanning more than fifty years, Wallace Stegner created a remarkable record of the history and culture of twentieth-century America. Each of the thirty-one stories contained in this volume embody some of the best virtues and values to be found in contemporary fiction, demonstrating why the author is acclaimed as one of America's master storytellers.", "The", "In a literary career spanning more than fifty years, Wallace Stegner created a remarkable record of the history and culture of twentieth-century America. Each of the thirty-one stories contained in this volume embody some of the best virtues and values to be found in contemporary fiction, demonstrating why the author is acclaimed as one of America's master storytellers.", "The traveler --", "Buglesong --", "Beyond the glass mountain --", "The berry patch --", "The women on the wall --", "Balance his, swing yours --", "Saw gang --", "Goin' to town --", "The view from the balcony --", "Volcano --", "Two rivers --", "Hostage --", "In the twilight --", "Butcher bird --", "The double corner --", "The colt --", "The Chink --", "Chip off the old block --", "The sweetness of the twisted apples --", "The blue-winged teal --", "Pop goes the alley cat --", "Maiden in a tower --", "Impasse --", "The volunteer --", "A field guide to the western birds --", "Something spurious from the Mindanao Deep --", "Genesis --", "The wolfer --", "Carrion spring --", "He who spits at the sky --", "The city of the living."], "author": "Wallace Stegner", "num_pages": "576", "awards": ["National Book Critics Circle Award Nominee for Fiction (1990)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-07-25 00:00:00", "ISBN": "0143039792"},
{"url": "https://www.goodreads.com/book/show/5668391-my-father-s-tears-and-other-stories", "num_ratings": "1,190", "num_reviews": "190", "avg_ratings": 3.69, "genres": ["Short Stories", "Fiction", "Literature", "American"], "title": "My Father's Tears and Other Stories", "description": ["John Updike’s first collection of new short fiction since the year 2000, ", " finds the author in a valedictory mood as he mingles narratives of his native Pennsylvania with stories of New England suburbia and of foreign travel.", "“Personal Archaeology” considers life as a sequence of half-buried layers, and “The Full Glass” distills a lifetime’s happiness into o", "John Updike’s first collection of new short fiction since the year 2000, ", " finds the author in a valedictory mood as he mingles narratives of his native Pennsylvania with stories of New England suburbia and of foreign travel.", "“Personal Archaeology” considers life as a sequence of half-buried layers, and “The Full Glass” distills a lifetime’s happiness into one brimming moment of an old man’s bedtime routine. High-school class reunions, in “The Walk with Elizanne” and “The Road Home,” restore their hero to youth’s commonwealth where, as the narrator of the title story confides, “the self I value is stored, however infrequently I check on its condition.” Exotic locales encountered in the journeys of adulthood include Morocco, Florida, Spain, Italy, and India. The territory of childhood, with its fundamental, formative mysteries, is explored in “The Guardians,” “The Laughter of the Gods,” and “Kinderszenen.” Love’s fumblings among the bourgeoisie yield the tart comedy of “Free,” “Delicate Wives,” “The Apparition,” and “Outage.”", "In sum, American experience from the Depression to the aftermath of 9/11 finds reflection in these glittering pieces of observation, remembrance, and imagination."], "author": "John Updike", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2009-06-02 00:00:00", "ISBN": "0307271560"},
{"url": "https://www.goodreads.com/book/show/703.The_Plot_Against_America", "num_ratings": "33,118", "num_reviews": "2,942", "avg_ratings": 3.73, "genres": ["Fiction", "Historical", "Historical Fiction", "Science Fiction", "Alternate History", "Literature"], "title": "The Plot Against America", "description": ["When the renowned aviation hero and rabid isolationist Charles A. Lindbergh defeated Franklin Roosevelt by a landslide in the 1940 presidential election, fear invaded every Jewish household in America."], "author": "Philip Roth", "num_pages": "391", "awards": ["WH Smith Literary Award (2005)", "James Fenimore Cooper Prize (2005)", "Tähtivaeltaja Award Nominee (2006)", "Sidewise Award for Long Form (2004)"], "places": ["Newark, New Jersey", "New Jersey"], "character_names": [], "language": "English", "publish_date": "2005-09-27 00:00:00", "ISBN": "1400079497"},
{"url": "https://www.goodreads.com/book/show/267215.A_Shooting_Star", "num_ratings": "451", "num_reviews": "79", "avg_ratings": 3.34, "genres": ["Fiction", "Literary Fiction", "Literature", "Novels"], "title": "A Shooting Star", "description": ["Sabrina Castro, an attractive woman with a strong New England heritage, is married to a wealthy, older California physician who no longer fulfills her dreams. An almost accidental misstep leads her down the slow descent of moral disintegration, until there is no place for her to go but up and out. How Sabrina comes to terms with her life is the theme of this absorbing pers", "Sabrina Castro, an attractive woman with a strong New England heritage, is married to a wealthy, older California physician who no longer fulfills her dreams. An almost accidental misstep leads her down the slow descent of moral disintegration, until there is no place for her to go but up and out. How Sabrina comes to terms with her life is the theme of this absorbing personal drama, played out against the background of an old Peninsula estate where her mother lives among her servants, her memories of Boston, and her treasured family archives. ", "displays the storytelling powers that Wallace Stagner's fans have enjoyed for more than half a century."], "author": "Wallace Stegner", "num_pages": "448", "awards": ["California Book Award for Fiction (Silver) (1960)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-11-01 00:00:00", "ISBN": "014025241X"},
{"url": "https://www.goodreads.com/book/show/11045.The_Spectator_Bird", "num_ratings": "4,609", "num_reviews": "499", "avg_ratings": 3.98, "genres": ["Fiction", "Classics", "Literary Fiction", "Literature", "Audiobook"], "title": "The Spectator Bird", "description": ["This tour-de-force of American literature and a winner of the National Book Award is a profound, intimate, affecting novel from one of the most esteemed literary minds of the last century and a beloved chronicler of the West. ", "Joe Allston is a cantankerous, retired literary agent who is, in his own words, \"just killing time until time gets around to killing me\". His parents", "This tour-de-force of American literature and a winner of the National Book Award is a profound, intimate, affecting novel from one of the most esteemed literary minds of the last century and a beloved chronicler of the West. ", "Joe Allston is a cantankerous, retired literary agent who is, in his own words, \"just killing time until time gets around to killing me\". His parents and his only son are long dead, leaving him with neither ancestors nor descendants, tradition nor ties. His job, trafficking the talent of others, has not been his choice. He has passed through life as a spectator, before retreating to the woods of California in the 1970s with only his wife, Ruth, by his side. ", "When an unexpected postcard from a long-lost friend arrives, Allston returns to the journals of a trip he has taken years before, a journey to his mother's birthplace where he once sought a link with his past. Uncovering this history floods Allston with memories, both grotesque and poignant, and finally vindicates him of his past and lays bare that Joe Allston has never been quite spectator enough."], "author": "Wallace Stegner", "num_pages": "214", "awards": ["National Book Award for Fiction (1977)", "California Book Award for Fiction (Silver) (1976)"], "places": ["Denmark", "Copenhagen", "California"], "character_names": ["Joe Allston", "Ruth Allston", "Astrid"], "language": "English", "publish_date": "1990-11-01 00:00:00", "ISBN": "0140139400"},
{"url": "https://www.goodreads.com/book/show/9820.Crossing_to_Safety", "num_ratings": "31,325", "num_reviews": "4,240", "avg_ratings": 4.16, "genres": ["Fiction", "Classics", "Literary Fiction", "Novels", "Book Club"], "title": "Crossing to Safety", "description": ["Called a \"magnificently crafted story . . . brimming with wisdom\" by Howard Frank Mosher in ", " has, since its publication in 1987, established itself as one of the greatest and most cherished American novels of the twentieth century. Tracing the lives, loves, and", "﻿Called a \"magnificently crafted story . . . brimming with wisdom\" by Howard Frank Mosher in ", " has, since its publication in 1987, established itself as one of the greatest and most cherished American novels of the twentieth century. Tracing the lives, loves, and aspirations of two couples who move between Vermont and Wisconsin, it is a work of quiet majesty, deep compassion, and powerful insight into the alchemy of friendship and marriage."], "author": "Wallace Stegner", "num_pages": "368", "awards": ["National Book Critics Circle Award Nominee for Fiction (1987)", "Premi Llibreter de narrativa Nominee (2009)"], "places": ["Pennsylvania", "New Mexico", "Wisconsin", "Vermont"], "character_names": ["Sally Morgan", "Larry Morgan", "Sid Lang", "Charity Lang"], "language": "English", "publish_date": "2002-04-09 00:00:00", "ISBN": "037575931X"},
{"url": "https://www.goodreads.com/book/show/56077.Sweet_Thursday", "num_ratings": "10,819", "num_reviews": "691", "avg_ratings": 4.09, "genres": ["Fiction", "Classics", "Literature"], "title": "Sweet Thursday", "description": ["In Monterey, on the California coast, Sweet Thursday is what they call the day after Lousy Wednesday, which is one of those days that are just naturally bad. Returning to the scene of ", ", the weedy lots and junk heaps and flophouses of Monterey, John Steinbeck once more brings to life the denizens of a netherworld of laughter and tears from Fauna, new headmistress", "In Monterey, on the California coast, Sweet Thursday is what they call the day after Lousy Wednesday, which is one of those days that are just naturally bad. Returning to the scene of ", ", the weedy lots and junk heaps and flophouses of Monterey, John Steinbeck once more brings to life the denizens of a netherworld of laughter and tears from Fauna, new headmistress of the local brothel, to Hazel, a bum whose mother must have wanted a daughter."], "author": "John Steinbeck", "num_pages": "249", "awards": ["National Book Award Finalist for Fiction (1955)"], "places": ["United States of America", "Monterey Bay, California"], "character_names": [], "language": "English", "publish_date": "2008-07-29 00:00:00", "ISBN": "0143039474"},
{"url": "https://www.goodreads.com/book/show/10807.Recapitulation", "num_ratings": "935", "num_reviews": "105", "avg_ratings": 3.84, "genres": ["Fiction", "Literary Fiction", "Historical", "Historical Fiction", "Literature", "American", "American", "American Fiction"], "title": "Recapitulation", "description": ["The moving sequel to the bestselling ", ".Bruce Mason returns to Salt Lake City not for his aunt's funeral, but to encounter after forty-five years the place he fled in bitterness. A successful statesman and diplomat, Mason had buried his awkward and lonely childhood, sealed himself off from the thrills and torments of adolescence to become a figure who", "The moving sequel to the bestselling ", ".Bruce Mason returns to Salt Lake City not for his aunt's funeral, but to encounter after forty-five years the place he fled in bitterness. A successful statesman and diplomat, Mason had buried his awkward and lonely childhood, sealed himself off from the thrills and torments of adolescence to become a figure who commanded international respect.", "But the realities of the present recede in the face of the ghosts of his past. As he makes the perfunctory arrangements for the funeral, we enter with him on an intensely personal and painful inner pilgrimage: we meet the father who darkened his childhood, the mother whose support was both redeeming and embarrassing, the friend who drew him into the respectable world of which he so craved to be a part, and the woman he nearly married. In this profoundly moving book Stegner has drawn an intimate portrait of a man understanding how his life has been shaped by experiences seemingly remote and inconsequential."], "author": "Wallace Stegner", "num_pages": "288", "awards": [], "places": ["Utah", "Salt Lake City, Utah"], "character_names": [], "language": "English", "publish_date": "1997-11-01 00:00:00", "ISBN": "0140266739"},
{"url": "https://www.goodreads.com/book/show/150320.Thomas_and_Beulah", "num_ratings": "981", "num_reviews": "70", "avg_ratings": 3.87, "genres": ["Poetry", "Cultural", "African American", "Academic", "Read For School", "Literary Fiction", "Fiction"], "title": "Thomas and Beulah", "description": ["The poems in this unusual book tell a story, forming a narrative almost like a realistic novel. Read in sequence as intended, they tell of the lives of a married black couple (not unlike Dove's own grandparents) from the early part of the century until their deaths in the 1960s, a period that spans the great migration of blacks from rural south to urban north. But this is", "The poems in this unusual book tell a story, forming a narrative almost like a realistic novel. Read in sequence as intended, they tell of the lives of a married black couple (not unlike Dove's own grandparents) from the early part of the century until their deaths in the 1960s, a period that spans the great migration of blacks from rural south to urban north. But this is merely the social backdrop to the story of a marriage. Two separate sequences offer two views of the couple's lives: the first, \"Mandolin,\" consists of 23 poems giving Thomas's side, and \"Canary in Bloom\" gives Beulah's in 21 poems. Together they paint a detailed, poetically dense portrait of two lives in all their frailty, dignity and complexity. The collection was awarded the Pulitzer Prize for poetry in 1987."], "author": "Rita Dove", "num_pages": "80", "awards": ["Pulitzer Prize for Poetry (1987)"], "places": [], "character_names": [], "language": "English", "publish_date": "1986-01-01 00:00:00", "ISBN": "0887480217"},
{"url": "https://www.goodreads.com/book/show/1245021.North_of_Boston", "num_ratings": "690", "num_reviews": "54", "avg_ratings": 3.93, "genres": ["Poetry", "Classics", "Literature", "American"], "title": "North of Boston", "description": ["He moves in darkness as it seems to me, Not of woods only and the shade of trees. He will not go behind his father's saying, And he likes having thought of it so well He says again, \"Good fences make good neighbours.\""], "author": "Robert Frost", "num_pages": "50", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-03 00:00:00", "ISBN": "1406955442"},
{"url": "https://www.goodreads.com/book/show/1202732.Tropic_of_Capricorn", "num_ratings": "14,461", "num_reviews": "580", "avg_ratings": 3.85, "genres": ["Fiction", "Classics", "Literature", "Novels"], "title": "Tropic of Capricorn", "description": ["Tropic Of Capricorn"], "author": "Henry Miller", "num_pages": "318", "awards": [], "places": ["Brooklyn, New York City, New York"], "character_names": [], "language": "English", "publish_date": "1966-08-12 00:00:00", "ISBN": "0586020004"},
{"url": "https://www.goodreads.com/book/show/89322.Remembering_Laughter", "num_ratings": "1,091", "num_reviews": "198", "avg_ratings": 3.8, "genres": ["Fiction", "Historical", "Historical Fiction", "Literary Fiction", "Classics", "Novels"], "title": "Remembering Laughter", "description": ["Margaret Stuart, the proud wife of a prosperous Iowa farmer, sets high standards for herself and others. Happy in her marriage, she tries to look the other way when her genial husband, Alec, takes to the bottle. When Elspeth, Margaret's sister, comes to live with them, the young woman is immediately captivated by the beauty and vitality of the farm, and by the affection sh", "Margaret Stuart, the proud wife of a prosperous Iowa farmer, sets high standards for herself and others. Happy in her marriage, she tries to look the other way when her genial husband, Alec, takes to the bottle. When Elspeth, Margaret's sister, comes to live with them, the young woman is immediately captivated by the beauty and vitality of the farm, and by the affection she receives from those around her. But as summer turns into fall, and the friendship between Alec and Elspeth deepens, Margaret finds her spirit tested by a series of events that seem as cruel and inevitable as the endless prairie winters.Long out of print, ", " (1937) marked Wallace Stegner's brilliant literary debut."], "author": "Wallace Stegner", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-11-01 00:00:00", "ISBN": "0140252401"},
{"url": "https://www.goodreads.com/book/show/12678823-the-bluest-eye", "num_ratings": "130,555", "num_reviews": "5,687", "avg_ratings": 4.0, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Cultural", "African American", "Literature"], "title": "The Bluest Eye", "description": ["THE BLUEST EYE chronicles the tragic, torn lives of a poor black family in 1940s Ohio; Pauline, Cholly, Sam and Pecola. Pecola, unlovely and unloved, prays each night for blue eyes. Eyes like those of the white girls in her neighbourhood. Eyes without which she will never know her own beauty. And granted the strange, magical power of THE BLUEST EYE, little Pecola will have", "THE BLUEST EYE chronicles the tragic, torn lives of a poor black family in 1940s Ohio; Pauline, Cholly, Sam and Pecola. Pecola, unlovely and unloved, prays each night for blue eyes. Eyes like those of the white girls in her neighbourhood. Eyes without which she will never know her own beauty. And granted the strange, magical power of THE BLUEST EYE, little Pecola will have them..."], "author": "Toni Morrison", "num_pages": "192", "awards": ["National Book Critics Circle Award"], "places": ["United States of America", "Lorain, Ohio"], "character_names": ["Pauline Breedlove", "Cholly Breedlove", "Pecola Breedlove"], "language": "English", "publish_date": "1988-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1383351.Song_of_Solomon", "num_ratings": "70,115", "num_reviews": "2,637", "avg_ratings": 4.03, "genres": ["Fiction", "Classics", "Cultural", "African American", "Historical", "Historical Fiction", "Literature"], "title": "Song of Solomon", "description": ["In an effort to hide his southern, working class roots, Macon Dead, an upper-class northern black businessman, tries to insulate his family from the danger and despair of the rank and file blacks with whom he shares the neighbourhood. The plan leads his son, \"Milkman\"--a named he earned after his mother nursed him well past the proper age--onto a path exactly opposite the", "In an effort to hide his southern, working class roots, Macon Dead, an upper-class northern black businessman, tries to insulate his family from the danger and despair of the rank and file blacks with whom he shares the neighbourhood. The plan leads his son, \"Milkman\"--a named he earned after his mother nursed him well past the proper age--onto a path exactly opposite the one his father had hoped. Milkman is driven into the arms of a violent, lower-class woman, into a clandestine circle of blacks who repay white violence in kind and into an awareness that he can fulfil his own potential by understanding the mistakes of his ancestors as they relate to his own."], "author": "Toni Morrison", "num_pages": "363", "awards": ["Janet Heidinger Kafka Prize (1977)", "National Book Critics Circle Award for Fiction (1977)"], "places": [], "character_names": [], "language": "English", "publish_date": "1995-09-21 00:00:00", "ISBN": "1857152166"},
{"url": "https://www.goodreads.com/book/show/400455.Paradise", "num_ratings": "20,118", "num_reviews": "843", "avg_ratings": 3.78, "genres": ["Fiction", "Cultural", "African American", "Classics", "Literature"], "title": "Paradise", "description": ["Four young women are brutally attacked in a convent near an all-black town in America in the mid-1970s. The inevitability of this attack, and the attempts to avert it, lie at the heart of PARADISE. Spanning the birth of the Civil Rights movement, Vietnam, the counter culture and the politics of the late 70s, deftly manipulating past, present and future, this novel of myste", "Four young women are brutally attacked in a convent near an all-black town in America in the mid-1970s. The inevitability of this attack, and the attempts to avert it, lie at the heart of PARADISE. Spanning the birth of the Civil Rights movement, Vietnam, the counter culture and the politics of the late 70s, deftly manipulating past, present and future, this novel of mysterious motives reveals the interior lives of the citizens of the town with astonishing clarity. The drama of its people - from the four young women and their elderly protector, to conservative businessmen, rednecks, a Civil Rights minister and veterans of three wars - richly evokes clashes that have bedevilled American society: between race and racelessness; patriarchy and matriarchy; religion and magic; freedom and belonging; promicuity and fidelity. Magnificent in its scope, PARADISE is a revelation in the intensity of its portrayal of human complexity and in the sheer force of its narrative."], "author": "Toni Morrison", "num_pages": "318", "awards": ["Orange Prize Nominee for Fiction Shortlist (1999)", "Ohioana Book Award for Fiction (1999)", "International DUBLIN Literary Award Nominee (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "1999-08-12 00:00:00", "ISBN": "0099288044"},
{"url": "https://www.goodreads.com/book/show/13573223-washington-irving", "num_ratings": "7", "num_reviews": "1", "avg_ratings": 4.43, "genres": [], "title": "Washington Irving: A Treasury: Rip Van Winkle, The Legend of Sleepy Hollow, Old Christmas", "description": ["Beautifully printed and slipcased, this elegantly produced collection of three classic Irving masterpieces captures the magic of folktales and makes the perfect gift for the holiday season. All three of these time-honored Washington Irving tales first appeared in his best-selling The Sketch Book of Geoffrey Crayon, Gent. in 1819. The high-spirited tales Rip Van Winkle and", "Beautifully printed and slipcased, this elegantly produced collection of three classic Irving masterpieces captures the magic of folktales and makes the perfect gift for the holiday season. All three of these time-honored Washington Irving tales first appeared in his best-selling The Sketch Book of Geoffrey Crayon, Gent. in 1819. The high-spirited tales Rip Van Winkle and The Legend of Sleepy Hollow present memorable folk characters that have become part of America’s literary lexicon, while Old Christmas preserves the nostalgia, warmth, and joy of Merrie Olde English Christmas traditions.Each of the three hardcover cloth-bound books, adorned with ribbon markers and slipcased into a handsome set, are beautifully illustrated with original paintings and drawings: Rip Van Winkle (N.C. Wyeth); The Legend of Sleepy Hollow (Arthur Rackham); and Old Christmas (Randolph Caldecott)."], "author": "Washington Irving", "num_pages": "392", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-04 00:00:00", "ISBN": "0789318431"},
{"url": "https://www.goodreads.com/book/show/31327374-the-legend-of-sleepy-hollow", "num_ratings": "37,993", "num_reviews": "2,351", "avg_ratings": 3.73, "genres": ["Classics", "Horror", "Fiction", "Short Stories", "Fantasy", "Gothic"], "title": "The Legend of Sleepy Hollow", "description": ["\"The Legend of Sleepy Hollow\" was first published in 1820. ", "Sleepy Hollow is known for being home to ghosts and spirits, the most famous being the terrifying Headless Horseman. ", "The Legend of Sleepy Hollow is highly entertaining fiction. It has been adapted many times for stage, theatre, television and film, including the 1999 Tim Burton film starring Johnny Depp and Christi", "\"The Legend of Sleepy Hollow\" was first published in 1820. ", "Sleepy Hollow is known for being home to ghosts and spirits, the most famous being the terrifying Headless Horseman. ", "The Legend of Sleepy Hollow is highly entertaining fiction. It has been adapted many times for stage, theatre, television and film, including the 1999 Tim Burton film starring Johnny Depp and Christina Ricci, and the hit television show, Sleepy Hollow, starring Tom Mison, Nicole Beharie, and Orlando Jones."], "author": "Washington Irving", "num_pages": "44", "awards": [], "places": ["Tarrytown, New York"], "character_names": ["Ichabod Crane", "Katrina Van Tassel", "Baltus Van Tassel", "Abraham \"Brom Bones\" Van Brunt"], "language": "English", "publish_date": "2016-08-02 00:00:00", "ISBN": "1536847925"},
{"url": "https://www.goodreads.com/book/show/31197323-walden-and-on-the-duty-of-civil-disobedience", "num_ratings": "35", "num_reviews": "3", "avg_ratings": 3.86, "genres": [], "title": "Walden, And On The Duty Of Civil Disobedience: And The Thoreau Essay, Walking", "description": ["In 1845, Henry David Thoreau left Concord Massachusetts and moved to a cabin that he built by himself near Walden Pond in Massachusetts. Walden, is an account of his stay in the woods and his experience. Shedding the trivial ties that he felt bound much of humanity, he pursued truth in the quiet of nature. Thoreau believes that such an experience enables one to gain true e", "In 1845, Henry David Thoreau left Concord Massachusetts and moved to a cabin that he built by himself near Walden Pond in Massachusetts. Walden, is an account of his stay in the woods and his experience. Shedding the trivial ties that he felt bound much of humanity, he pursued truth in the quiet of nature. Thoreau believes that such an experience enables one to gain true enlightenment. ", "Even as Thoreau disentangled himself from worldly matters, his musings were often disturbed by his social conscience. On the Duty of Civil Disobedience, also included in this book, expresses his antislavery and antiwar sentiments, as well as his protest against the government’s interference with civil liberty. His writings have inspired many to embrace his philosophy of individualism, and has influenced non-violent resistance movements worldwide. ", "As a bonus, this book contains the essay by Thoreau, “Walking”. Originally given as part of a lecture in 1851, \"Walking\" was later published posthumously as an essay. Now being a chief text in the environmental movement. Thoreau's essay describes the ever beckoning call that draws us to explore and find ourselves lost in the beauty of the forests, rivers, and fields."], "author": "Henry David Thoreau", "num_pages": "248", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-07-21 00:00:00", "ISBN": "1535086467"},
{"url": "https://www.goodreads.com/book/show/11341.Jazz", "num_ratings": "18,476", "num_reviews": "969", "avg_ratings": 3.79, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Cultural", "African American", "Literature"], "title": "Jazz", "description": ["In the winter of 1926, when everybody everywhere sees nothing but good things ahead, Joe Trace, middle-aged door-to-door salesman of Cleopatra beauty products, shoots his teenage lover to death. At the funeral, Joe’s wife, Violet, attacks the girl’s corpse. This passionate, profound story of love and obsession brings us back and forth in time, as a narrative is assembled f", "In the winter of 1926, when everybody everywhere sees nothing but good things ahead, Joe Trace, middle-aged door-to-door salesman of Cleopatra beauty products, shoots his teenage lover to death. At the funeral, Joe’s wife, Violet, attacks the girl’s corpse. This passionate, profound story of love and obsession brings us back and forth in time, as a narrative is assembled from the emotions, hopes, fears, and deep realities of black urban life."], "author": "Toni Morrison", "num_pages": "229", "awards": [], "places": ["Harlem, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2004-06-08 00:00:00", "ISBN": "1400076218"},
{"url": "https://www.goodreads.com/book/show/1411617.Beloved", "num_ratings": "265,669", "num_reviews": "8,673", "avg_ratings": 3.79, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Literature", "Magical Realism"], "title": "Beloved", "description": ["In the troubled years following the Civil War, the spirit of a murdered child haunts the Ohio home of a former slave. This angry, destructive ghost breaks mirrors, leaves its fingerprints in cake icing, and generally makes life difficult for Sethe and her family; nevertheless, the woman finds the haunting oddly comforting for the spirit is that of her own dead baby, never", "In the troubled years following the Civil War, the spirit of a murdered child haunts the Ohio home of a former slave. This angry, destructive ghost breaks mirrors, leaves its fingerprints in cake icing, and generally makes life difficult for Sethe and her family; nevertheless, the woman finds the haunting oddly comforting for the spirit is that of her own dead baby, never named, thought of only as Beloved. ", "A dead child, a runaway slave, a terrible secret--these are the central concerns of Toni Morrison's Pulitzer Prize-winning Beloved. Morrison, a Nobel laureate, has written many fine novels, including Song of Solomon, The Bluest Eye, and Paradise--but Beloved is arguably her best. To modern readers, antebellum slavery is a subject so familiar that it is almost impossible to render its horrors in a way that seems neither clichéd nor melodramatic. Rapes, beatings, murders, and mutilations are recounted here, but they belong to characters so precisely drawn that the tragedy remains individual, terrifying to us because it is terrifying to the sufferer. And Morrison is master of the telling detail: in the bit, for example, a punishing piece of headgear used to discipline recalcitrant slaves, she manages to encapsulate all of slavery's many cruelties into one apt symbol--a device that deprives its wearer of speech. \"Days after it was taken out, goose fat was rubbed on the corners of the mouth but nothing to soothe the tongue or take the wildness out of the eye.\" Most importantly, the language here, while often lyrical, is never overheated. Even as she recalls the cruelties visited upon her while a slave, Sethe is evocative without being overemotional: \"Add my husband to it, watching, above me in the loft--hiding close by--the one place he thought no one would look for him, looking down on what I couldn't look at at all. And not stopping them--looking and letting it happen.... And if he was that broken then, then he is also and certainly dead now.\" Even the supernatural is treated as an ordinary fact of life: \"Not a house in the country ain't packed to its rafters with some dead Negro's grief. We lucky this ghost is a baby,\" comments Sethe's mother-in-law. ", "Beloved is a dense, complex novel that yields up its secrets one by one. As Morrison takes us deeper into Sethe's history and her memories, the horrifying circumstances of her baby's death start to make terrible sense. And as past meets present in the shape of a mysterious young woman about the same age as Sethe's daughter would have been, the narrative builds inexorably to its powerful, painful conclusion. Beloved may well be the defining novel of slavery in America, the one that all others will be measured by. --Alix Wilber"], "author": "Toni Morrison", "num_pages": "275", "awards": ["Pulitzer Prize for Fiction (1988)", "American Book Award (1988)", "Anisfield-Wolf Book Award (1988)", "National Book Critics Circle Award Nominee for Fiction (1987)", "Frederic G. Melcher Book Award (1988)", "National Book Award Finalist for Fiction (1987)"], "places": ["Delaware", "Ohio", "Kentucky"], "character_names": ["Baby Suggs", "Sethe", "Beloved", "Paul D Garner", "Denver"], "language": "English", "publish_date": "1999-01-01 00:00:00", "ISBN": "0099288052"},
{"url": "https://www.goodreads.com/book/show/133914.The_Ways_of_White_Folks", "num_ratings": "3,405", "num_reviews": "192", "avg_ratings": 4.41, "genres": ["Short Stories", "Fiction", "Classics", "Cultural", "African American", "Race", "Poetry"], "title": "The Ways of White Folks", "description": ["In these acrid and poignant stories, Hughes depicted black people colliding--sometimes humorously, more often tragically--with whites in the 1920s and '30s."], "author": "Langston Hughes", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1990-09-12 00:00:00", "ISBN": "0679728171"},
{"url": "https://www.goodreads.com/book/show/16300777-old-christmas", "num_ratings": "460", "num_reviews": "79", "avg_ratings": 3.75, "genres": ["Holiday", "Christmas", "Classics", "Fiction", "Holiday"], "title": "Old Christmas: From the Sketch Book of Washington Irving", "description": ["This illustrated facsimile edition of the 1875 version is comprised of five stories capturing the warmth, merriment and charm of nineteenth-century English Christmas customs."], "author": "Washington Irving", "num_pages": "166", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1977-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2357392.Tales_of_the_Alhambra", "num_ratings": "2,505", "num_reviews": "310", "avg_ratings": 3.71, "genres": ["Classics", "Travel", "Fiction", "Cultural", "Spain", "Historical", "Historical Fiction"], "title": "Tales of the Alhambra: A Series of Tales and Sketches of the Moors and Spaniards", "description": ["Written in 1831, Washington Irving's dreamlike description of the Alhambra, the beautiful Moorish castle that defined the height of Moorish civilization, and of the surrounding territory of Granada remains one of the most romantic and entertaining travelogues ever written of this region in Spain. Enhanced here with exquisite Spanish guitar music, the narrative is a heady m", "Written in 1831, Washington Irving's dreamlike description of the Alhambra, the beautiful Moorish castle that defined the height of Moorish civilization, and of the surrounding territory of Granada remains one of the most romantic and entertaining travelogues ever written of this region in Spain. Enhanced here with exquisite Spanish guitar music, the narrative is a heady mix of historical fact, medieval myth and mystery, sensual descriptions, and an appreciation for a civilization that valued beauty, philosophy, literature, science, and the arts on an equal level with warrior skills. Secret chambers, desperate battles, imprisoned princesses, palace ghosts, and fragrant gardens, described in a wistful and dreamlike eloquence, will transport listeners to a paradise of their own."], "author": "Washington Irving", "num_pages": "0", "awards": [], "places": ["Granada"], "character_names": [], "language": "English", "publish_date": "2004-11-01 00:00:00", "ISBN": "0786185171"},
{"url": "https://www.goodreads.com/book/show/12995.The_Hamlet", "num_ratings": "4,129", "num_reviews": "231", "avg_ratings": 3.87, "genres": ["Fiction", "Classics", "Literature"], "title": "The Hamlet", "description": [", the first novel of Faulkner's Snopes trilogy, is both an ironic take on classical tragedy and a mordant commentary on the grand pretensions of the antebellum South and the depths of its decay in the aftermath of war and Reconstruction. It tells of the advent and the rise of the Snopes family in Frenchman's Bend, a small town built on the ruins of a once-stately", ", the first novel of Faulkner's Snopes trilogy, is both an ironic take on classical tragedy and a mordant commentary on the grand pretensions of the antebellum South and the depths of its decay in the aftermath of war and Reconstruction. It tells of the advent and the rise of the Snopes family in Frenchman's Bend, a small town built on the ruins of a once-stately plantation. Flem Snopes -- wily, energetic, a man of shady origins -- quickly comes to dominate the town and its people with his cunning and guile."], "author": "William Faulkner", "num_pages": "409", "awards": [], "places": ["Yoknapatawpha County, Mississippi"], "character_names": ["Flem Snopes", "Will Warner", "Ab Snopes"], "language": "English", "publish_date": "1991-10-29 00:00:00", "ISBN": "0679736530"},
{"url": "https://www.goodreads.com/book/show/186369.The_Pastures_of_Heaven", "num_ratings": "5,451", "num_reviews": "361", "avg_ratings": 4.04, "genres": ["Fiction", "Classics", "Short Stories", "Literature"], "title": "The Pastures of Heaven", "description": ["Each of these delightful interconnected tales is devoted to a family living in a fertile valley on the outskirts of Monterey, California, and the effects that one particular family has on them all. Steinbeck tackles two important literary traditions here; American naturalism, with its focus on the conflict between natural instincts and the demand to conform to society's no", "Each of these delightful interconnected tales is devoted to a family living in a fertile valley on the outskirts of Monterey, California, and the effects that one particular family has on them all. Steinbeck tackles two important literary traditions here; American naturalism, with its focus on the conflict between natural instincts and the demand to conform to society's norms, and the short story cycle. Set in the heart of 'Steinbeck land', the lush Californian valleys."], "author": "John Steinbeck", "num_pages": "207", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-03-01 00:00:00", "ISBN": "0141186097"},
{"url": "https://www.goodreads.com/book/show/29744.Goodbye_Columbus_and_Five_Short_Stories", "num_ratings": "14,248", "num_reviews": "817", "avg_ratings": 3.86, "genres": ["Fiction", "Short Stories", "Classics", "Literature", "Literature", "Jewish"], "title": "Goodbye, Columbus and Five Short Stories", "description": ["Winner of the National Book Award", "Roth's award-winning first book--about Neil Klugman, Brenda Patimkin, and their relationship which tests the boundaries of suspicion, social class, and love--instantly established its author's reputation as a writer of explosive wit, merciless insight, and a fierce compassion for even the most self-deluding of characters."], "author": "Philip Roth", "num_pages": "320", "awards": ["National Book Award for Fiction (1960)", "National Jewish Book Award for Fiction (1960)"], "places": ["Newark, New Jersey", "Short Hills, New Jersey"], "character_names": ["Neil Klugman", "Brenda Patimkin"], "language": "English", "publish_date": "1995-05-02 00:00:00", "ISBN": "0679601597"},
{"url": "https://www.goodreads.com/book/show/11389.Arrowsmith", "num_ratings": "6,083", "num_reviews": "341", "avg_ratings": 3.81, "genres": ["Fiction", "Classics", "Literature"], "title": "Arrowsmith", "description": ["Originally published in 1925, after three years of anticipation, the book follows the life of Martin ", ", a rather ordinary fellow who gets his first taste of medicine at 14 as an assistant to the drunken physician in his home town.", "It is Leora Tozer who makes Martin's life extraordinary. With vitality and love, she urges him beyond the confines of the mundane to ris", "Originally published in 1925, after three years of anticipation, the book follows the life of Martin ", ", a rather ordinary fellow who gets his first taste of medicine at 14 as an assistant to the drunken physician in his home town.", "It is Leora Tozer who makes Martin's life extraordinary. With vitality and love, she urges him beyond the confines of the mundane to risk answering his true calling as a scientist and researcher. Not even her tragic death can extinguish her spirit or her impact on Martin's life.", "After years of work as a small town doctor and a research scientist, ", " heads for the West Indies with a serum to halt an epidemic. A tragic turn of events forces him to come to terms with his career and his personal life.", "As the son and grandson of physicians, Sinclair Lewis had a store of experiences and imparted knowledge to draw upon for ", "."], "author": "Sinclair Lewis", "num_pages": "428", "awards": ["Pulitzer Prize for Novel (1926)"], "places": ["New York (the state)", "North Dakota", "Vermont"], "character_names": [], "language": "English", "publish_date": "1953-06-01 00:00:00", "ISBN": "0451526910"},
{"url": "https://www.goodreads.com/book/show/14896.Wolf_Willow", "num_ratings": "596", "num_reviews": "93", "avg_ratings": 3.95, "genres": ["Fiction", "Cultural", "Canada", "Environment", "Nature", "Classics"], "title": "Wolf Willow", "description": ["Wallace Stegner weaves together fiction and nonfiction, history and impressions, childhood remembrance and adult reflections in this unusual portrait of his boyhood. Set in Cypress Hills in southern Saskatchewan, where Stegner's family homesteaded from 1914 to 1920, Wolf Willow: A History, a Story & a Memory of the Last Plains Frontier brings to life both the pioneer c", "Wallace Stegner weaves together fiction and nonfiction, history and impressions, childhood remembrance and adult reflections in this unusual portrait of his boyhood. Set in Cypress Hills in southern Saskatchewan, where Stegner's family homesteaded from 1914 to 1920, Wolf Willow: A History, a Story & a Memory of the Last Plains Frontier brings to life both the pioneer community and the magnificent landscape that surrounds it. This Twentieth-Century Classics edition includes a new introductory essay by Page Stegner."], "author": "Wallace Stegner", "num_pages": "306", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2000-12-01 00:00:00", "ISBN": "0141185015"},
{"url": "https://www.goodreads.com/book/show/246617.The_Dream_Keeper_and_Other_Poems", "num_ratings": "850", "num_reviews": "111", "avg_ratings": 4.34, "genres": ["Poetry", "Classics", "Cultural", "African American", "Childrens"], "title": "The Dream Keeper and Other Poems", "description": ["Illus. in black-and-white. This classic collection of poetry is available in a handsome new gift edition that includes seven additional poems written after ", " was first published. In a larger format, featuring Brian Pinkney's scratchboard art on every spread, Hughes's inspirational message to young people is as relevant today as it was in 1932."], "author": "Langston Hughes", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-12-03 00:00:00", "ISBN": "0679883479"},
{"url": "https://www.goodreads.com/book/show/11659.The_Early_Stories", "num_ratings": "1,602", "num_reviews": "61", "avg_ratings": 4.16, "genres": ["Short Stories", "Fiction", "Literature"], "title": "The Early Stories", "description": ["Gathering together almost all the short fiction that John Updike published between 1953 and 1975, this collection opens with Updike's autobiographical stories about a young boy growing up during the Depression in a small Pennsylvania town. There follows tales of life away from home, student days, early marriage and young families, and finally Updike's experimental stories", "Gathering together almost all the short fiction that John Updike published between 1953 and 1975, this collection opens with Updike's autobiographical stories about a young boy growing up during the Depression in a small Pennsylvania town. There follows tales of life away from home, student days, early marriage and young families, and finally Updike's experimental stories on 'The Single Life'. Here, then, is a rich and satisfying feast of Updike - his wit, his easy mastery of language, his genius for recalling the subtleties of ordinary life and the excitements, and perils, of the pursuit of happiness."], "author": "John Updike", "num_pages": "838", "awards": ["PEN/Faulkner Award for Fiction (2004)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-04-07 00:00:00", "ISBN": "0141016086"},
{"url": "https://www.goodreads.com/book/show/12307.Hawthorne_s_Short_Stories", "num_ratings": "1,166", "num_reviews": "41", "avg_ratings": 4.05, "genres": ["Short Stories", "Classics", "Fiction", "Literature", "Literature", "American"], "title": "Hawthorne's Short Stories", "description": ["Twenty-four of Hawthorne's best-known short stories plus many that are virtually unknown to the average reader. Introduction by Professor Newton Arvin of Smith College."], "author": "Nathaniel Hawthorne", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1955-05-12 00:00:00", "ISBN": "0394700155"},
{"url": "https://www.goodreads.com/book/show/10801.The_Big_Rock_Candy_Mountain", "num_ratings": "6,002", "num_reviews": "671", "avg_ratings": 4.14, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Literature", "Audiobook", "Literary Fiction"], "title": "The Big Rock Candy Mountain", "description": ["Bo Mason, his wife, Elsa, and their two boys live a transient life of poverty and despair. Drifting from town to town and from state to state, the violent, ruthless Bo seeks out his fortune—in the hotel business, in new farmland, and, eventually, in illegal rum-running through the treacherous back roads of the American Northwest. Stegner portrays more than thirty years in", "Bo Mason, his wife, Elsa, and their two boys live a transient life of poverty and despair. Drifting from town to town and from state to state, the violent, ruthless Bo seeks out his fortune—in the hotel business, in new farmland, and, eventually, in illegal rum-running through the treacherous back roads of the American Northwest. Stegner portrays more than thirty years in the life of the Mason family in this masterful, harrowing saga of people trying to survive during the lean years of the early twentieth century."], "author": "Wallace Stegner", "num_pages": "563", "awards": [], "places": ["North Dakota", "Saskatchewan", "Salt Lake City, Utah"], "character_names": ["Bo Mason", "Elsa Mason", "Chester Mason", "Bruce Mason"], "language": "English", "publish_date": "1991-03-01 00:00:00", "ISBN": "0140139397"},
{"url": "https://www.goodreads.com/book/show/48214.The_Song_of_the_Lark", "num_ratings": "6,788", "num_reviews": "741", "avg_ratings": 3.91, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Novels", "Literature", "Literature", "American"], "title": "The Song of the Lark", "description": ["Perhaps Willa Cather's most autobiographical work, The Song of the Lark charts the story of a young woman's awakening as an artist against the backdrop of the western landscape. Thea Kronborg, an aspiring singer, struggles to escape from the confines her small Colorado town to the world of possibility in the Metropolitan Opera House. In classic Cather style, The Song of th", "Perhaps Willa Cather's most autobiographical work, The Song of the Lark charts the story of a young woman's awakening as an artist against the backdrop of the western landscape. Thea Kronborg, an aspiring singer, struggles to escape from the confines her small Colorado town to the world of possibility in the Metropolitan Opera House. In classic Cather style, The Song of the Lark is the beautiful, unforgettable story of American determination and its inextricable connection to the land.", "\"The time will come when she'll be ranked above Hemingway.\" -- Leon Edel"], "author": "Willa Cather", "num_pages": "417", "awards": [], "places": ["Colorado", "Chicago, Illinois", "Arizona", "New York City, New York", "Denver, Colorado"], "character_names": ["Thea Kronborg", "Howard Archie", "Ray Kennedy", "Professor Wunsch", "Andor Harsanyi", "Madison Bowers", "Fred Ottenburg"], "language": "English", "publish_date": "1983-05-10 00:00:00", "ISBN": "0395345308"},
{"url": "https://www.goodreads.com/book/show/217518.The_Witches_of_Eastwick", "num_ratings": "13,413", "num_reviews": "1,057", "avg_ratings": 3.29, "genres": ["Fiction", "Fantasy", "Classics", "Paranormal", "Witches", "Literature", "Fantasy", "Paranormal"], "title": "The Witches of Eastwick", "author": "John Updike", "num_pages": "307", "awards": [], "places": ["United States of America", "Eastwick, Rhode Island", "Rhode Island"], "character_names": ["Jane Smart, Alexandra Spofford, Sukie Rougemont, Darryl Van Horne"], "language": "English", "publish_date": "1996-08-27 00:00:00", "ISBN": "0449912108"},
{"url": "https://www.goodreads.com/book/show/48468.The_Violent_Bear_It_Away", "num_ratings": "8,603", "num_reviews": "671", "avg_ratings": 4.14, "genres": ["Fiction", "Classics", "Gothic", "Southern Gothic", "Literature", "Novels"], "title": "The Violent Bear It Away", "description": ["First published in 1960, ", " is now a landmark in American literature. It is a dark and absorbing example of the Gothic sensibility and bracing satirical voice that are united in Flannery O'Conner's work. In it, the orphaned Francis Marion Tarwater and his cousins, the schoolteacher Rayber, defy the prophecy of their dead uncle--that Tarwater will beco", "First published in 1960, ", " is now a landmark in American literature. It is a dark and absorbing example of the Gothic sensibility and bracing satirical voice that are united in Flannery O'Conner's work. In it, the orphaned Francis Marion Tarwater and his cousins, the schoolteacher Rayber, defy the prophecy of their dead uncle--that Tarwater will become a prophet and will baptize Rayber's young son, Bishop. A series of struggles ensues: Tarwater fights an internal battle against his innate faith and the voices calling him to be a prophet while Rayber tries to draw Tarwater into a more \"reasonable\" modern world. Both wrestle with the legacy of their dead relatives and lay claim to Bishop's soul.", "O'Connor observes all this with an astonishing combination of irony and compassion, humor and pathos. The result is a novel whose range and depth reveal a brilliant and innovative writers acutely alert to where the sacred lives and to where it does not."], "author": "Flannery O'Connor", "num_pages": "256", "awards": ["National Book Award Finalist for Fiction (1961)"], "places": [], "character_names": [], "language": "English", "publish_date": "1960-01-01 00:00:00", "ISBN": "0374505241"},
{"url": "https://www.goodreads.com/book/show/218659.Everything_That_Rises_Must_Converge", "num_ratings": "16,095", "num_reviews": "984", "avg_ratings": 4.27, "genres": ["Short Stories", "Fiction", "Classics", "Literature", "American", "Southern"], "title": "Everything That Rises Must Converge: Stories", "description": ["Flannery O'Connor was working on ", " at the time of her death. This collection is an exquisite legacy from a genius of the American short story, in which she scrutinizes territory familiar to her readers: race, faith, and morality. The stories encompass the comic and the tragic, the beautiful and the grotesque; each carries her highly indivi", "Flannery O'Connor was working on ", " at the time of her death. This collection is an exquisite legacy from a genius of the American short story, in which she scrutinizes territory familiar to her readers: race, faith, and morality. The stories encompass the comic and the tragic, the beautiful and the grotesque; each carries her highly individual stamp and could have been written by no one else."], "author": "Flannery O'Connor", "num_pages": "269", "awards": ["National Book Award Finalist for Fiction (1966)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-01-01 00:00:00", "ISBN": "0374504644"},
{"url": "https://www.goodreads.com/book/show/11438.What_We_Talk_About_When_We_Talk_About_Love", "num_ratings": "37,545", "num_reviews": "2,409", "avg_ratings": 4.2, "genres": ["Short Stories", "Fiction", "Classics", "Literature", "American", "Literature"], "title": "What We Talk About When We Talk About Love", "description": [" ", "In his second collection, Carver establishes his reputation as one of the most celebrated short-story writers in American literature—a haunting meditation on love, loss, and companionship, and finding one’s way through the dark."], "author": "Raymond Carver", "num_pages": "159", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-08-12 00:00:00", "ISBN": "0679723056"},
{"url": "https://www.goodreads.com/book/show/11662.Couples", "num_ratings": "4,283", "num_reviews": "281", "avg_ratings": 3.58, "genres": ["Fiction", "Classics", "Literature", "American", "Literature", "Novels"], "title": "Couples", "description": ["Couples is the book that has been assailed for its complete frankness & praised as an artful, seductive, savagely graphic portrait of love, marriage & adultery in America. But be it damned or hailed, Couples drew back the curtain forever on sex in suburbia in the late 20th century. A classic, it's one of those books that will be read & remembered for a long tim", "Couples is the book that has been assailed for its complete frankness & praised as an artful, seductive, savagely graphic portrait of love, marriage & adultery in America. But be it damned or hailed, Couples drew back the curtain forever on sex in suburbia in the late 20th century. A classic, it's one of those books that will be read & remembered for a long time to come."], "author": "John Updike", "num_pages": "570", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-08-27 00:00:00", "ISBN": "044991190X"},
{"url": "https://www.goodreads.com/book/show/27999.Close_Range", "num_ratings": "13,253", "num_reviews": "901", "avg_ratings": 3.99, "genres": ["Short Stories", "Fiction", "Westerns", "Lgbt", "Literature"], "title": "Close Range", "description": ["Short-story collection from the Pulitzer Prize-winning and bestselling author of ", " and ", ".", "Annie Proulx's masterful language and fierce love of Wyoming are evident in these tales of loneliness, quick violence, and the wrong kinds of love. Each of the portraits in ", " reveals characters fiercely wrought with precision and grace.", " These ar", "Short-story collection from the Pulitzer Prize-winning and bestselling author of ", " and ", ".", "Annie Proulx's masterful language and fierce love of Wyoming are evident in these tales of loneliness, quick violence, and the wrong kinds of love. Each of the portraits in ", " reveals characters fiercely wrought with precision and grace.", " These are stories of desperation and unlikely elation, set in a landscape both stark and magnificent."], "author": "Annie Proulx", "num_pages": "285", "awards": ["Pulitzer Prize Nominee for Fiction (2000)", "Borders Original Voices Award for Fiction (1999)", "Ambassador Book Award for Fiction (2000)"], "places": ["United States of America", "Wyoming"], "character_names": [], "language": "English", "publish_date": "2000-02-10 00:00:00", "ISBN": "0684852225"},
{"url": "https://www.goodreads.com/book/show/11666.Rabbit_at_Rest", "num_ratings": "13,244", "num_reviews": "427", "avg_ratings": 3.97, "genres": ["Fiction", "Classics"], "title": "Rabbit at Rest", "description": ["Winner of the 1991 Pulitzer Prize for Fiction. In John Updike's fourth and final novel about ex-basketball player Harry \"Rabbit\" Angstrom, the hero has acquired heart trouble, a Florida condo, and a second grandchild. His son and daughter-in-law are acting erratically, his wife Janice wants to work, and Rabbit is searching his soul, looking for reasons to live."], "author": "John Updike", "num_pages": "606", "awards": ["Pulitzer Prize for Fiction (1991)", "William Dean Howells Medal (1995)", "National Book Critics Circle Award for Fiction (1990)"], "places": ["Brewer, Pennsylvania", "Deleon, Florida", "Pennsylvania", "Florida"], "character_names": [], "language": "English", "publish_date": "1996-08-27 00:00:00", "ISBN": "0449911942"},
{"url": "https://www.goodreads.com/book/show/46917.Rabbit_Redux", "num_ratings": "12,558", "num_reviews": "655", "avg_ratings": 3.79, "genres": ["Fiction", "Classics", "Literature", "American", "Literature"], "title": "Rabbit Redux", "description": ["In this sequel to ", " John Updike resumes the spiritual quest of his anxious Everyman, Harry “Rabbit” Angstrom. Ten years have passed; the impulsive former athlete has become a paunchy thirty-six-year-old conservative, and Eisenhower’s becalmed America has become 1969’s lurid turmoil of technology, fantasy, drugs, and violence. Rabbit is abandoned by his family, h", "In this sequel to ", " John Updike resumes the spiritual quest of his anxious Everyman, Harry “Rabbit” Angstrom. Ten years have passed; the impulsive former athlete has become a paunchy thirty-six-year-old conservative, and Eisenhower’s becalmed America has become 1969’s lurid turmoil of technology, fantasy, drugs, and violence. Rabbit is abandoned by his family, his home invaded by a runaway and a radical, his past reduced to a ruined inner landscape; still he clings to semblances of decency and responsibility, and yearns to belong and to believe."], "author": "John Updike", "num_pages": "440", "awards": ["National Book Award Finalist for Fiction (1972)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-08-27 00:00:00", "ISBN": "0449911934"},
{"url": "https://www.goodreads.com/book/show/11378.Elmer_Gantry", "num_ratings": "4,264", "num_reviews": "392", "avg_ratings": 3.99, "genres": ["Fiction", "Classics", "Religion", "Literature", "Literature", "American"], "title": "Elmer Gantry", "description": ["Universally recognized as a landmark in American literature, ", " scandalized readers when it was first published, causing Sinclair Lewis to be \"invited\" to a jail cell in New Hampshire and to his own lynching in Virginia. His portrait of a golden-tongued evangelist who rises to power within his church--a saver of souls who lives a life of duplicity, sensuality, an", "Universally recognized as a landmark in American literature, ", " scandalized readers when it was first published, causing Sinclair Lewis to be \"invited\" to a jail cell in New Hampshire and to his own lynching in Virginia. His portrait of a golden-tongued evangelist who rises to power within his church--a saver of souls who lives a life of duplicity, sensuality, and ruthless self-indulgence--is also the record of a period, a reign of grotesque vulgarity, which but for Lewis would have left no trace of itself. ", " has been called the greatest, most vital, and most penetrating study of hypocrisy that has been written since the works of Voltaire."], "author": "Sinclair Lewis", "num_pages": "352", "awards": ["Audie Award for Literary Fiction (2009)"], "places": ["Missouri"], "character_names": [], "language": "French", "publish_date": "1998-10-01 00:00:00", "ISBN": "2859405461"},
{"url": "https://www.goodreads.com/book/show/50776.The_Blithedale_Romance", "num_ratings": "4,493", "num_reviews": "323", "avg_ratings": 3.35, "genres": ["Classics", "Fiction", "Literature", "19th Century", "Literature"], "title": "The Blithedale Romance", "description": ["Abjuring the city for a pastoral life, a group of utopians set out to reform a dissipated America. But the group is a powerful mix of competing ambitions and its idealism finds little satisfaction in farmwork. Instead, of changing the world, the members of the Blithedale community individually pursue egotistical paths that ultimately lead to tragedy. Hawthorne's tale both", "Abjuring the city for a pastoral life, a group of utopians set out to reform a dissipated America. But the group is a powerful mix of competing ambitions and its idealism finds little satisfaction in farmwork. Instead, of changing the world, the members of the Blithedale community individually pursue egotistical paths that ultimately lead to tragedy. Hawthorne's tale both mourns and satirizes a rural idyll not unlike that of nineteenth-century America at large.", "About the Series: For over 100 years Oxford World's Classics has made available the broadest spectrum of literature from around the globe. Each affordable volume reflects Oxford's commitment to scholarship, providing the most accurate text plus a wealth of other valuable features, including expert introductions by leading authorities, voluminous notes to clarify the text, up-to-date bibliographies for further study, and much more."], "author": "Nathaniel Hawthorne", "num_pages": "204", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-10-25 00:00:00", "ISBN": "1406501336"},
{"url": "https://www.goodreads.com/book/show/85391.Rabbit_Is_Rich", "num_ratings": "14,273", "num_reviews": "541", "avg_ratings": 3.9, "genres": ["Fiction", "Classics"], "title": "Rabbit Is Rich", "description": ["Winner of the 1982 Pulitzer Prize for Fiction.", "Ten years after RABBIT REDUX, Harry Angstrom has come to enjoy prosperity as the Chief Sales Representative of Springer Motors. The rest of the world may be falling to pieces, but Harry's doing all right. That is, until his son returns from the West, and the image of an old love pays a visit to his lot...."], "author": "John Updike", "num_pages": "480", "awards": ["Pulitzer Prize for Fiction (1982)", "National Book Award for Fiction (Hardcover) (1982)", "National Book Critics Circle Award for Fiction (1981)"], "places": [], "character_names": [], "language": "English", "publish_date": "1997-10-30 00:00:00", "ISBN": "0140249435"},
{"url": "https://www.goodreads.com/book/show/47061.Twice_Told_Tales", "num_ratings": "2,478", "num_reviews": "105", "avg_ratings": 3.89, "genres": ["Classics", "Short Stories", "Fiction", "Horror"], "title": "Twice-Told Tales", "description": ["This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most impor", "This work has been selected by scholars as being culturally important, and is part of the knowledge base of civilization as we know it. This work was reproduced from the original artifact, and remains as true to the original work as possible. Therefore, you will see the original copyright references, library stamps (as most of these works have been housed in our most important libraries around the world), and other notations in the work. This work is in the public domain in the United States of America, and possibly other nations. Within the United States, you may freely copy and distribute this work, as no entity (individual or corporate) has a copyright on the body of the work.As a reproduction of a historical artifact, this work may contain missing or blurred pages, poor pictures, errant marks, etc. Scholars believe, and we concur, that this work is important enough to be preserved, reproduced, and made generally available to the public. We appreciate your support of the preservation process, and thank you for being an important part of keeping this knowledge alive and relevant."], "author": "Nathaniel Hawthorne", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-10-09 00:00:00", "ISBN": "0375757880"},
{"url": "https://www.goodreads.com/book/show/138193.Birches", "num_ratings": "169", "num_reviews": "29", "avg_ratings": 4.12, "genres": ["Poetry", "Childrens", "Picture Books", "Classics", "Literature"], "title": "Birches", "description": ["beautifully illustrates Frost's celebrated ability to blend observation, imagination, and poetry. Caldecott medalist Ed Young uses his own powers of observation and imagination to create an extraordinary series of paintings that complement and extend the poem."], "author": "Robert Frost", "num_pages": "32", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-01 00:00:00", "ISBN": "0805072306"},
{"url": "https://www.goodreads.com/book/show/169718.Babbitt", "num_ratings": "19,005", "num_reviews": "1,067", "avg_ratings": 3.65, "genres": ["Fiction", "Classics", "Literature", "Literature", "American"], "title": "Babbitt", "description": ["Babbitt is set in the modern Midwestern city of Zenith. George F. Babbitt, a 46- year-old real estate broker, enjoys all the modern conveniences available to a prosperous middle-class businessman, yet he is dissatisfied with his life. When the novel opens, Babbitt has begun to regularly indulge in fantasies about a fairy girl who makes him feel like a gallant youth.", "Babbitt", "Babbitt is set in the modern Midwestern city of Zenith. George F. Babbitt, a 46- year-old real estate broker, enjoys all the modern conveniences available to a prosperous middle-class businessman, yet he is dissatisfied with his life. When the novel opens, Babbitt has begun to regularly indulge in fantasies about a fairy girl who makes him feel like a gallant youth.", "Babbitt's closest friend Paul Riesling is even more dissatisfied with his life. He is also more vocal about it. Riesling and Babbitt try to ameliorate their dissatisfaction by taking a vacation in Maine together, but their enjoyment at their newfound freedom is short-lived. They eventually have to return to their lives as middle-aged married men. Both men experience a growing impulse to rebel against social conventions."], "author": "Sinclair Lewis", "num_pages": "348", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-05-29 00:00:00", "ISBN": "142640607X"},
{"url": "https://www.goodreads.com/book/show/11650.American_Pastoral", "num_ratings": "50,566", "num_reviews": "3,670", "avg_ratings": 3.92, "genres": ["Fiction", "Classics", "Literature", "Novels"], "title": "American Pastoral", "description": ["In ", ", Philip Roth gives us a novel of unqualified greatness that is an elegy for all the twentieth century's promises of prosperity, civic order, and domestic bliss. Roth's protagonist is Seymour 'Swede' Levov - a legendary high school athlete, a devoted family man, a hard worker, the prosperous inheritor of his father's Newark g", "In ", ", Philip Roth gives us a novel of unqualified greatness that is an elegy for all the twentieth century's promises of prosperity, civic order, and domestic bliss. Roth's protagonist is Seymour 'Swede' Levov - a legendary high school athlete, a devoted family man, a hard worker, the prosperous inheritor of his father's Newark glove factory - comes of age in thriving, triumphant post-war America. And then one day in 1968, Swede's beautiful American luck deserts him.", "For Swede's adored daughter, Merry, has grown from a loving, quick-witted girl into a sullen, fanatical teenager - a teenager capable of an outlandishly savage act of political terrorism. And overnight Swede is wrenched out of the longed-for American pastoral and into the indigenous American berserk. Compulsively readable, propelled by sorrow, rage, and a deep compassion for its characters, this is Roth's masterpiece."], "author": "Philip Roth", "num_pages": "432", "awards": ["Pulitzer Prize for Fiction (1998)", "Audie Award for Solo Narration - Male (1998)", "Prix du Meilleur Livre Étranger for Roman (2000)", "National Book Critics Circle Award Nominee for Fiction (1997)"], "places": ["Newark, New Jersey", "New Jersey"], "character_names": ["Nathan Zuckerman", "Seymour Levov", "Meredith Levov", "Jerry Levov", "Dawn Dwyer"], "language": "English", "publish_date": "1998-03-05 00:00:00", "ISBN": "0099771810"},
{"url": "https://www.goodreads.com/book/show/90192.The_House_of_the_Seven_Gables", "num_ratings": "30,919", "num_reviews": "1,836", "avg_ratings": 3.45, "genres": ["Classics", "Fiction", "Gothic", "Literature"], "title": "The House of the Seven Gables", "description": ["The sins of one generation are visited upon another in a haunted New England mansion until the arrival of a young woman from the country breathes new air into mouldering lives and rooms. Written shortly after The Scarlet Letter, The House of the Seven Gables re-addresses the theme of human guilt in a style remarkable in both its descriptive virtuosity and its truly modern", "The sins of one generation are visited upon another in a haunted New England mansion until the arrival of a young woman from the country breathes new air into mouldering lives and rooms. Written shortly after The Scarlet Letter, The House of the Seven Gables re-addresses the theme of human guilt in a style remarkable in both its descriptive virtuosity and its truly modern mix of fantasy and realism."], "author": "Nathaniel Hawthorne", "num_pages": "225", "awards": [], "places": ["Salem, Massachusetts", "Massachusetts"], "character_names": ["Alice Pyncheon", "Colonel Pyncheon", "Matthew Maule", "Hepzibah Pyncheon", "Holgrave the daguerrotypist", "Phoebe Pyncheon", "Clifford Pyncheon", "Venner Pyncheon", "Judge Jaffrey Pyncheon", "Ned Higgins", "Thomas Maule", "Matthew Maule, the younger", "Gervayse Pyncheon", "Scipio (Pyncheon slave)"], "language": "English", "publish_date": "2005-08-08 00:00:00", "ISBN": "0393924769"},
{"url": "https://www.goodreads.com/book/show/4631.A_Moveable_Feast", "num_ratings": "98,457", "num_reviews": "6,875", "avg_ratings": 4.04, "genres": ["Classics", "Nonfiction", "Autobiography", "Memoir", "Biography", "Travel"], "title": "A Moveable Feast", "description": ["Hemingway's memories of his life as an unknown writer living in Paris in the twenties are deeply personal, warmly affectionate and full of wit. Looking back not only at his own much younger self, but also at the other writers who shared Paris with him - James Joyce, Wyndham Lewis, Scott and Zelda Fitzgerald - he recalls the time when, poor, happy and writing in cafes, he d", "Hemingway's memories of his life as an unknown writer living in Paris in the twenties are deeply personal, warmly affectionate and full of wit. Looking back not only at his own much younger self, but also at the other writers who shared Paris with him - James Joyce, Wyndham Lewis, Scott and Zelda Fitzgerald - he recalls the time when, poor, happy and writing in cafes, he discovered his vocation. Written during the last years of Hemingway's life, his memoir is a lively and powerful reflection of his genius that scintillates with the romance of the city."], "author": "Ernest Hemingway", "num_pages": "192", "awards": [], "places": ["Paris"], "character_names": ["F. Scott Fitzgerald", "Ezra Pound", "Aleister Crowley", "Gertrude Stein", "Wyndham Lewis", "Hadley Richardson Hemingway", "Blaise Cendrars"], "language": "English", "publish_date": "2012-09-06 00:00:00", "ISBN": "0099285045"},
{"url": "https://www.goodreads.com/book/show/114230.Bartleby_the_Scrivener", "num_ratings": "35,991", "num_reviews": "2,341", "avg_ratings": 3.91, "genres": ["Classics", "Fiction", "Short Stories", "Literature", "Literature", "19th Century", "Literature", "American"], "title": "Bartleby the Scrivener", "description": ["Academics hail it as the beginning of modernism, but to readers around the world—even those daunted by ", " is simply one of the most absorbing and moving novellas ever. Set in the mid-19th century on New York City’s Wall Street, it was also, perhaps, Herman Melville's most prescient story: what if a young man caught up in the rat race of commer", "Academics hail it as the beginning of modernism, but to readers around the world—even those daunted by ", " is simply one of the most absorbing and moving novellas ever. Set in the mid-19th century on New York City’s Wall Street, it was also, perhaps, Herman Melville's most prescient story: what if a young man caught up in the rat race of commerce finally just said, \"I would prefer not to\"?", "The tale is one of the final works of fiction published by Melville before, slipping into despair over the continuing critical dismissal of his work after Moby-Dick, he abandoned publishing fiction. The work is presented here exactly as it was originally published in Putnam's magazine—to, sadly, critical disdain."], "author": "Herman Melville", "num_pages": "64", "awards": [], "places": ["New York City, New York"], "character_names": ["Bartleby", "Ginger Nut", "Turkey", "Nippers"], "language": "English", "publish_date": "2004-05-01 00:00:00", "ISBN": "0974607800"},
{"url": "https://www.goodreads.com/book/show/4796.The_Winter_of_Our_Discontent", "num_ratings": "33,250", "num_reviews": "1,694", "avg_ratings": 3.99, "genres": ["Classics", "Fiction", "Literature", "Literature", "American"], "title": "The Winter of Our Discontent", "description": ["Ethan Allen Hawley, the protagonist of Steinbeck’s last novel, works as a clerk in a grocery store that his family once owned. With Ethan no longer a member of Long Island’s aristocratic class, his wife is restless, and his teenage children are hungry for the tantalizing material comforts he cannot provide. Then one day, in a moment of moral crisis, Ethan decides to take a", "Ethan Allen Hawley, the protagonist of Steinbeck’s last novel, works as a clerk in a grocery store that his family once owned. With Ethan no longer a member of Long Island’s aristocratic class, his wife is restless, and his teenage children are hungry for the tantalizing material comforts he cannot provide. Then one day, in a moment of moral crisis, Ethan decides to take a holiday from his own scrupulous standards.", "Set in Steinbeck’s contemporary 1960 America, the novel explores the tenuous line between private and public honesty that today ranks it alongside his most acclaimed works of penetrating insight into the American condition. This edition features an introduction and notes by Steinbeck scholar Susan Shillinglaw."], "author": "John Steinbeck", "num_pages": "336", "awards": [], "places": ["New Baytown", "New England"], "character_names": ["Danny Taylor", "Mr. Baker", "Ethan Allen Hawley", "Joey Morphy", "Margie Young-Hunt", "Alfio Maurello"], "language": "English", "publish_date": "2008-08-26 00:00:00", "ISBN": "0143039482"},
{"url": "https://www.goodreads.com/book/show/16900.Civil_Disobedience_and_Other_Essays", "num_ratings": "14,508", "num_reviews": "255", "avg_ratings": 4.06, "genres": ["Philosophy", "Classics", "Nonfiction", "Politics", "Writing", "Essays", "History", "Literature", "Literature", "19th Century", "Academic", "School", "Politics", "Political Science"], "title": "Civil Disobedience and Other Essays", "description": ["Civil Disobedience and Other Essays is a collection of some of Henry David Thoreau's most important essays. Contained in this volume are the following essays: Civil Disobedience, Natural History of Massachusetts, A Walk to Wachusett, The Landlord, A Winter Walk, The Succession of Forest Trees, Walking, Autumnal Tints, Wild Apples, Night and Moonlight, Aulus Persius Flaccus", "Civil Disobedience and Other Essays is a collection of some of Henry David Thoreau's most important essays. Contained in this volume are the following essays: Civil Disobedience, Natural History of Massachusetts, A Walk to Wachusett, The Landlord, A Winter Walk, The Succession of Forest Trees, Walking, Autumnal Tints, Wild Apples, Night and Moonlight, Aulus Persius Flaccus, Herald of Freedom, Life Without Principle, Paradise (to be) Regained, A Plea for John Brown, The Last Days of John Brown, After the Death of John Brown, The Service, Slavery in Massachusetts, and Wendell Phillips Before Concord Lyceum."], "author": "Henry David Thoreau", "num_pages": "188", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "publish_date": "2005-01-01 00:00:00", "ISBN": "1420925229"},
{"url": "https://www.goodreads.com/book/show/17726.Go_Down_Moses", "num_ratings": "8,285", "num_reviews": "414", "avg_ratings": 3.93, "genres": ["Fiction", "Classics", "Short Stories", "Literature"], "title": "Go Down, Moses", "description": ["“I believe that man will not merely endure: he will prevail. He is immortal, not because he alone among creatures has an inexhaustible voice, but because he has a soul, a spirit capable of compassion and sacrifice and endurance.” —William Faulkner, on receiving the Nobel Prize", " ", " is composed of seven interrelated stories, all of them set in Faulkner’s mythic Yo", "“I believe that man will not merely endure: he will prevail. He is immortal, not because he alone among creatures has an inexhaustible voice, but because he has a soul, a spirit capable of compassion and sacrifice and endurance.” —William Faulkner, on receiving the Nobel Prize", " ", " is composed of seven interrelated stories, all of them set in Faulkner’s mythic Yoknapatawpha County. From a variety of perspectives, Faulkner examines the complex, changing relationships between blacks and whites, between man and nature, weaving a cohesive novel rich in implication and insight."], "author": "William Faulkner", "num_pages": "365", "awards": [], "places": ["Yoknapatawpha County, Mississippi"], "character_names": ["Boon Hogganbeck", "Theophilus McCaslin", "Amodeus McCaslin", "Hubert Beauchamp", "Hubert Beauchamp", "Sophonisba Beauchamp", "Tomey's Turl", "Isaac McCaslin", "Lucas Beauchamp", "McCaslin Edmonds", "Carothers \"Roth\" Edmonds", "George Wilkins", "Sam Fathers", "General Compson", "Major de Spain's", "Gavin Stevens", "Samuel Beauchamp"], "language": "English", "publish_date": "1991-01-30 00:00:00", "ISBN": "0679732179"},
{"url": "https://www.goodreads.com/book/show/15613.Billy_Budd_Sailor", "num_ratings": "13,069", "num_reviews": "758", "avg_ratings": 3.1, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction", "Literature", "American"], "title": "Billy Budd, Sailor", "description": ["A handsome young sailor is unjustly accused of plotting mutiny in this timeless tale of the sea."], "author": "Herman Melville", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-08-01 00:00:00", "ISBN": "1416523723"},
{"url": "https://www.goodreads.com/book/show/5308.The_Pearl", "num_ratings": "160,633", "num_reviews": "6,857", "avg_ratings": 3.43, "genres": ["Classics", "Fiction", "Literature", "Academic", "School"], "title": "The Pearl", "description": ["Like his father and grandfather before him, Kino is a poor diver, gathering pearls from the gulf beds that once brought great wealth to the kings of Spain and now provide Kino, Juana, and their infant son with meager subsistence. Then, on a day like any other, Kino emerges from the sea with a pearl as large as a sea gull’s egg, as “perfect as the moon.” With the pearl come", "Like his father and grandfather before him, Kino is a poor diver, gathering pearls from the gulf beds that once brought great wealth to the kings of Spain and now provide Kino, Juana, and their infant son with meager subsistence. Then, on a day like any other, Kino emerges from the sea with a pearl as large as a sea gull’s egg, as “perfect as the moon.” With the pearl comes hope, the promise of comfort and of security…", "A story of classic simplicity, based on a Mexican folk tale, ", " explores the secrets of man’s nature, greed, the darkest depths of evil, and the luminous possibilities of love."], "author": "John Steinbeck", "num_pages": "96", "awards": [], "places": ["Nayarit", "The Gulf", "La Paz", "Loreto", "Santa Rosalia"], "character_names": ["Kino", "Juana", "Coyotito", "Juan Tomas", "Apolonia"], "language": "English", "publish_date": "2002-01-08 00:00:00", "ISBN": "0142000698"},
{"url": "https://www.goodreads.com/book/show/12448.Look_Homeward_Angel", "num_ratings": "11,257", "num_reviews": "816", "avg_ratings": 3.94, "genres": ["Fiction", "Classics", "Literature", "Novels"], "title": "Look Homeward, Angel", "description": ["A legendary author on par with William Faulkner and Flannery O'Connor, Thomas Wolfe published ", ", his first novel, about a young man's burning desire to leave his small town and tumultuous family in search of a better life, in 1929. It gave the world proof of hi", "A legendary author on par with William Faulkner and Flannery O'Connor, Thomas Wolfe published ", ", his first novel, about a young man's burning desire to leave his small town and tumultuous family in search of a better life, in 1929. It gave the world proof of his genius and launched a powerful legacy.", "The novel follows the trajectory of Eugene Gant, a brilliant and restless young man whose wanderlust and passion shape his adolescent years in rural North Carolina. Wolfe said that ", " is \"a book made out of my life,\" and his largely autobiographical story about the quest for a greater intellectual life has resonated with and influenced generations of readers, including some of today's most important novelists. Rich with lyrical prose and vivid characterizations, this twentieth-century American classic will capture the hearts and imaginations of every reader."], "author": "Thomas Wolfe", "num_pages": "644", "awards": [], "places": ["Asheville, North Carolina", "Altamont, North Carolina"], "character_names": ["Eugene Gant"], "language": "English", "publish_date": "2006-10-10 00:00:00", "ISBN": "0743297318"},
{"url": "https://www.goodreads.com/book/show/11376.Main_Street", "num_ratings": "21,733", "num_reviews": "905", "avg_ratings": 3.76, "genres": ["Classics", "Fiction", "Literature"], "title": "Main Street", "description": ["With Commentary by E. M. Forster, Dorothy Parker, H. L. Mencken, Lewis Mumford, Rebecca West, Sherwood Anderson, Malcolm Cowley, Alfred Kazin, Constance Rourke, and Mark Schorer.", ", the story of an idealistic young woman's attempts to reform her small town, brought Lewis immediate acclaim when it was published in 1920. It remains one of the essential texts of the", "With Commentary by E. M. Forster, Dorothy Parker, H. L. Mencken, Lewis Mumford, Rebecca West, Sherwood Anderson, Malcolm Cowley, Alfred Kazin, Constance Rourke, and Mark Schorer.", ", the story of an idealistic young woman's attempts to reform her small town, brought Lewis immediate acclaim when it was published in 1920. It remains one of the essential texts of the American scene. Lewis Mumford observed: \"In ", " an American had at last written of our life with something of the intellectual rigor and critical detachment that had seemed so cruel and unjustified [in Charles Dickens and Matthew Arnold]. Young people had grown up in this environment, suffocated, stultified, helpless, but unable to find any reason for their spiritual discomfort. Mr. Lewis released them.\"", "Sinclair Lewis (1885-1951), was born in Sauk Centre, Minnesota and graduated from Yale in 1907. In 1930 he became the first American recipient of the Nobel Prize in Literature. ", " (1920) was his first critical and commercial success. Lewis's other noted books include ", " (1922), ", " (1925), ", " (1927), ", " (1929), and ", " (1935)."], "author": "Sinclair Lewis", "num_pages": "454", "awards": [], "places": ["Minnesota"], "character_names": ["Carol Milford", "Will Kennicott"], "language": "English", "publish_date": "2000-11-01 00:00:00", "ISBN": "0375753141"},
{"url": "https://www.goodreads.com/book/show/163977.Tortilla_Flat", "num_ratings": "37,508", "num_reviews": "1,975", "avg_ratings": 3.83, "genres": ["Fiction", "Classics", "Literature"], "title": "Tortilla Flat", "description": ["\"Steinbeck is an artist; and he tells the stories of these lovable thieves and adulterers with a gentle and poetic purity of heart and of prose.\" -- New York Herald Tribune", "Adopting the structure and themes of the Arthurian legend, Steinbeck created a \"Camelot\" on a shabby hillside above the town of Monterey,California and peopled it with a colorful band of knights. At the", "\"Steinbeck is an artist; and he tells the stories of these lovable thieves and adulterers with a gentle and poetic purity of heart and of prose.\" -- New York Herald Tribune", "Adopting the structure and themes of the Arthurian legend, Steinbeck created a \"Camelot\" on a shabby hillside above the town of Monterey,California and peopled it with a colorful band of knights. At the center of the tale is Danny, whose house, like Arthur's castle, becomes a gathering place for men looking for adventure, camaraderie, and a sense of belonging. These \"knights\" are ", ", men of mixed heritage, whose ancestors settled California hundreds of years before. Free of ties to jobs and other complications of the American way of life, they fiercely resist the corrupting tide of honest toil in the surrounding ocean of civil rectitude.", "As Steinbeck chronicles their deeds--their multiple loves, their wonderful brawls, their Rabelaisian wine-drinking--he spins a tale as compelling and ultimately as touched by sorrow as the famous legends of the Round Table, which inspired him."], "author": "John Steinbeck", "num_pages": "256", "awards": ["California Book Award for Fiction (Silver) (1935)"], "places": ["Monterey", "California"], "character_names": ["Danny", "Pablo Soler", "Pilon", "Jesus Maria Corcoran", "Pirate", "Torelli"], "language": "English", "publish_date": "2001-07-12 00:00:00", "ISBN": "0582461502"},
{"url": "https://www.goodreads.com/book/show/85386.Rabbit_Run", "num_ratings": "45,906", "num_reviews": "2,849", "avg_ratings": 3.58, "genres": ["Fiction", "Classics", "Literature", "Novels", "Literature", "American"], "title": "Rabbit, Run", "description": ["is the book that", "established John Updike as one of the major American novelists of his—or any other—generation. Its hero is Harry “Rabbit” Angstrom, a onetime high-school basketball star who on an impulse deserts his wife and son. He is twenty-six years old, a man-child caught in a struggle between instinct and thought, self and society, sexual gratification an", "is the book that", "established John Updike as one of the major American novelists of his—or any other—generation. Its hero is Harry “Rabbit” Angstrom, a onetime high-school basketball star who on an impulse deserts his wife and son. He is twenty-six years old, a man-child caught in a struggle between instinct and thought, self and society, sexual gratification and family duty—even, in a sense, human hard-heartedness and divine Grace. Though his flight from home traces a zigzag of evasion, he holds to the faith that he is on the right path, an invisible line toward his own salvation as straight as a ruler’s edge."], "author": "John Updike", "num_pages": "325", "awards": ["National Book Award Finalist for Fiction (1961)"], "places": ["Brewer, Pennsylvania"], "character_names": ["Harry “Rabbit” Angstrom", "Janice Angstrom", "Nelson  Angstrom", "Ruth Leonard", "Jack Eccles"], "language": "English", "publish_date": "1996-08-12 00:00:00", "ISBN": "0449911659"},
{"url": "https://www.goodreads.com/book/show/10979.Light_in_August", "num_ratings": "47,264", "num_reviews": "2,154", "avg_ratings": 3.94, "genres": ["Fiction", "Classics", "Literature", "Literature", "American"], "title": "Light in August", "description": [", a novel that contrasts stark tragedy with hopeful perseverance in the face of mortality, features some of Faulkner’s most memorable characters: guileless, dauntless Lena Grove, in search of the father of her unborn child; Reverend Gail Hightower, a lonely outcast haunted by visions of Confederate glory; and Joe Christmas, a desperate, enigmatic drifter con", ", a novel that contrasts stark tragedy with hopeful perseverance in the face of mortality, features some of Faulkner’s most memorable characters: guileless, dauntless Lena Grove, in search of the father of her unborn child; Reverend Gail Hightower, a lonely outcast haunted by visions of Confederate glory; and Joe Christmas, a desperate, enigmatic drifter consumed by his mixed ancestry."], "author": "William Faulkner", "num_pages": "507", "awards": [], "places": ["Yoknapatawpha County, Mississippi"], "character_names": ["Lena Grove", "Lucas Burch", "Byron Bunch", "Joe Christmas", "Joanna Burden", "Reverend Gail Hightower"], "language": "English", "publish_date": "1991-01-30 00:00:00", "ISBN": "0679732268"},
{"url": "https://www.goodreads.com/book/show/123845.Self_Reliance_and_Other_Essays", "num_ratings": "15,697", "num_reviews": "318", "avg_ratings": 4.14, "genres": ["Philosophy", "Classics", "Nonfiction", "Writing", "Essays", "Literature"], "title": "Self-Reliance and Other Essays", "description": ["Essayist, poet, and philosopher, Ralph Waldo Emerson (1803–1882) propounded a transcendental idealism emphasizing self-reliance, self-culture, and individual expression. The six essays and one address included in this volume, selected from ", " (1841) and ", " (1844), offer a representative sampling of his views outlining that moral idealis", "Essayist, poet, and philosopher, Ralph Waldo Emerson (1803–1882) propounded a transcendental idealism emphasizing self-reliance, self-culture, and individual expression. The six essays and one address included in this volume, selected from ", " (1841) and ", " (1844), offer a representative sampling of his views outlining that moral idealism as well as a hint of the later skepticism that colored his thought. In addition to the celebrated title essay, the others included here are \"History,\" \"Friendship,\" \"The Over-Soul,\" \"The Poet,\" and \"Experience,\" plus the well-known and frequently read Harvard Divinity School Address."], "author": "Ralph Waldo Emerson", "num_pages": "117", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-10-13 00:00:00", "ISBN": "0486277909"},
{"url": "https://www.goodreads.com/book/show/11656.Rabbit_Angstrom", "num_ratings": "1,491", "num_reviews": "146", "avg_ratings": 4.27, "genres": ["Fiction", "Literature", "Novels", "Classics"], "title": "Rabbit Angstrom: The Four Novels", "description": ["When we first met him in Rabbit, Run (1960), the book that established John Updike as a major novelist, Harry (Rabbit) Angstrom is playing basketball with some boys in an alley in Pennsylvania during the tail end of the Eisenhower era, reliving for a moment his past as a star high school athlete. Athleticism of a different sort is on display throughout these four magnifice", "When we first met him in Rabbit, Run (1960), the book that established John Updike as a major novelist, Harry (Rabbit) Angstrom is playing basketball with some boys in an alley in Pennsylvania during the tail end of the Eisenhower era, reliving for a moment his past as a star high school athlete. Athleticism of a different sort is on display throughout these four magnificent novels—the athleticism of an imagination possessed of the ability to lay bare, with a seemingly effortless animal grace, the enchantments and disenchantments of life.", "Updike revisited his hero toward the end of each of the following decades in the second half of this American century; and in each of the subsequent novels, as Rabbit, his wife, Janice, his son, Nelson, and the people around them grow, these characters take on the lineaments of our common existence. In prose that is one of the glories of contemporary literature, Updike has chronicled the frustrations and ambiguous triumphs, the longuers, the loves and frenzies, the betrayals and reconciliations of our era. He has given us our representative American story.", "This Rabbit Angstrom volume is composed of the following novels: Rabbit, Run; Rabbit Redux; Rabbit is Rich; and Rabbit at Rest."], "author": "John Updike", "num_pages": "1520", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-10-17 00:00:00", "ISBN": "0679444599"},
{"url": "https://www.goodreads.com/book/show/48467.Wise_Blood", "num_ratings": "22,318", "num_reviews": "1,856", "avg_ratings": 3.87, "genres": ["Fiction", "Classics", "Gothic", "Southern Gothic", "Literature", "Novels", "American", "Southern"], "title": "Wise Blood", "description": [", Flannery O’Connor’s astonishing and haunting first novel, is a classic of twentieth-century literature. It is a story of Hazel Motes, a twenty-two-year-old caught in an unending struggle against his innate, desperate faith. He falls under the spell of a \"blind\" street preacher named Asa Hawks and his degenerate fifteen-year-old daughter, Lily Sabbath. In an iro", ", Flannery O’Connor’s astonishing and haunting first novel, is a classic of twentieth-century literature. It is a story of Hazel Motes, a twenty-two-year-old caught in an unending struggle against his innate, desperate faith. He falls under the spell of a \"blind\" street preacher named Asa Hawks and his degenerate fifteen-year-old daughter, Lily Sabbath. In an ironic, malicious gesture of his own non-faith, and to prove himself a greater cynic than Hawkes, Hazel Motes founds The Church of God Without Christ, but is still thwarted in his efforts to lose God. He meets Enoch Emery, a young man with \"wise blood,\" who leads him to a mummified holy child, and whose crazy maneuvers are a manifestation of Hazel's existential struggles. This tale of redemption, retribution, false prophets, blindness, blindings, and wisdoms gives us one of the most riveting characters in twentieth-century American fiction."], "author": "Flannery O'Connor", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-03-06 00:00:00", "ISBN": "0374530637"},
{"url": "https://www.goodreads.com/book/show/46170.For_Whom_the_Bell_Tolls", "num_ratings": "220,084", "num_reviews": "5,153", "avg_ratings": 3.96, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction", "War", "Novels", "Literature", "American", "Cultural", "Spain", "Classics", "Classic Literature", "Literature", "20th Century"], "title": "For Whom the Bell Tolls", "author": "Ernest Hemingway", "num_pages": "471", "awards": [], "places": ["Spain"], "character_names": ["Mariecke", "Pilar", "Robert Jordan", "Anselmo", "El Sordo", "Pablo Saler"], "language": "English", "publish_date": "1995-08-12 00:00:00", "ISBN": "0684803356"},
{"url": "https://www.goodreads.com/book/show/4625.The_Complete_Short_Stories", "num_ratings": "31,538", "num_reviews": "738", "avg_ratings": 4.29, "genres": ["Short Stories", "Fiction", "Classics", "Literature"], "title": "The Complete Short Stories", "description": [" ", " In this definitive collection of Ernest Hemingway's short stories, readers will delight in the author's most beloved classics such as ", " and ", " and will discover seven new tales published for the first time in this collection. F", " ", " In this definitive collection of Ernest Hemingway's short stories, readers will delight in the author's most beloved classics such as ", " and ", " and will discover seven new tales published for the first time in this collection. For Hemingway fans ", " is an invaluable treasury."], "author": "Ernest Hemingway", "num_pages": "650", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-08-03 00:00:00", "ISBN": "0684843323"},
{"url": "https://www.goodreads.com/book/show/373755.Absalom_Absalom_", "num_ratings": "34,490", "num_reviews": "1,770", "avg_ratings": 3.96, "genres": ["Classics", "Fiction", "Literature", "Literature", "American"], "title": "Absalom, Absalom!", "description": ["Published in 1936, Absalom, Absalom! is considered by many to be William Faulkner's masterpiece. Although the novel's complex and fragmented structure poses considerable difficulty to readers, the book's literary merits place it squarely in the ranks of America's finest novels. The story concerns Thomas Sutpen, a poor man who finds wealth and then marries into a respectabl", "Published in 1936, Absalom, Absalom! is considered by many to be William Faulkner's masterpiece. Although the novel's complex and fragmented structure poses considerable difficulty to readers, the book's literary merits place it squarely in the ranks of America's finest novels. The story concerns Thomas Sutpen, a poor man who finds wealth and then marries into a respectable family. His ambition and extreme need for control bring about his ruin and the ruin of his family. Sutpen's story is told by several narrators, allowing the reader to observe variations in the saga as it is recounted by different speakers. This unusual technique spotlights one of the novel's central questions: To what extent can people know the truth about the past?", "(from bookrags.com)"], "author": "William Faulkner", "num_pages": "320", "awards": [], "places": ["United States of America", "Mississippi", "Yoknapatawpha County, Mississippi"], "character_names": ["Quentin Compson III", "Thomas Sutpen", "Jason Compson III", "Shreve", "Rosa Coldfield", "Ellen Coldfield", "Henry Sutpen", "Judith Sutpen", "Charles Bon", "Wash Jones", "Jim Bond"], "language": "English", "publish_date": "1991-01-30 00:00:00", "ISBN": "0679732187"},
{"url": "https://www.goodreads.com/book/show/80176.Winesburg_Ohio", "num_ratings": "26,751", "num_reviews": "1,974", "avg_ratings": 3.84, "genres": ["Fiction", "Classics", "Short Stories", "Literature", "Literature", "American"], "title": "Winesburg, Ohio", "description": ["Winesburg, Ohio (1919) is Sherwood Anderson's masterpiece, a cycle of short stories concerning life in a small town at the end of the nineteenth century. At the center is George Willard, a young reporter who becomes the confidant of the town's solitary figures. Anderson's stories influenced countless American writers including Hemingway, Faulkner, Updike, Oates and Carver.", "Winesburg, Ohio (1919) is Sherwood Anderson's masterpiece, a cycle of short stories concerning life in a small town at the end of the nineteenth century. At the center is George Willard, a young reporter who becomes the confidant of the town's solitary figures. Anderson's stories influenced countless American writers including Hemingway, Faulkner, Updike, Oates and Carver. This new edition corrects errors made in earlier editions and takes into account major criticism and textual scholarship of the last several decades."], "author": "Sherwood Anderson", "num_pages": "240", "awards": ["Premi Llibreter de narrativa (2009)"], "places": [], "character_names": ["Elizabeth Willard", "Doctor Parcival", "Louise Trunnion", "Jesse Bentley", "Louise Bentley", "David Hardy", "Joe Welling", "Alice Hindman", "Wash Williams", "Seth Richmond", "Tandy Hard", "The Reverend Curtis Hartman", "Kate Swift", "Enoch Robinson", "Belle Carpenter", "Elmer Cowley", "Ray Pearson", "Tom Foster", "Helen White", "George Willard"], "language": "English", "publish_date": "1999-11-11 00:00:00", "ISBN": "0192839772"},
{"url": "https://www.goodreads.com/book/show/545951.Death_Comes_for_the_Archbishop", "num_ratings": "25,026", "num_reviews": "2,138", "avg_ratings": 3.89, "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Literature"], "title": "Death Comes for the Archbishop", "description": ["There is something epic—and almost mythic—about this sparsely beautiful novel by Willa Cather, although the story it tells is that of a single human life, lived simply in the silence of the desert. In 1851 Father Jean Marie Latour comes as the Apostolic Vicar to New Mexico. What he finds is a vast territory of red hills and tortuous arroyos, American by law but Mexican and", "There is something epic—and almost mythic—about this sparsely beautiful novel by Willa Cather, although the story it tells is that of a single human life, lived simply in the silence of the desert. In 1851 Father Jean Marie Latour comes as the Apostolic Vicar to New Mexico. What he finds is a vast territory of red hills and tortuous arroyos, American by law but Mexican and Indian in custom and belief. In the almost forty years that follow, Latour spreads his faith in the only way he knows—gently, although he must contend with an unforgiving landscape, derelict and sometimes openly rebellious priests, and his own loneliness. One of these events Cather gives us an indelible vision of life unfolding in a place where time itself seems suspended."], "author": "Willa Cather", "num_pages": "297", "awards": ["William Dean Howells Medal (1930)"], "places": ["Santa Fe, New Mexico", "New Mexico"], "character_names": ["Jean Marie Latour", "Joseph Vaillant"], "language": "English", "publish_date": "1990-06-16 00:00:00", "ISBN": "0679728899"},
{"url": "https://www.goodreads.com/book/show/140963.O_Pioneers_", "num_ratings": "39,304", "num_reviews": "2,583", "avg_ratings": 3.85, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "O Pioneers!", "description": [" (1913) was Willa Cather's first great novel, and to many it remains her unchallenged masterpiece. No other work of fiction so faithfully conveys both the sharp physical realities and the mythic sweep of the transformation of the American frontier—and the transformation of the people who settled it. Cather's heroine is Alexandra Bergson, who arrives on the wind-", " (1913) was Willa Cather's first great novel, and to many it remains her unchallenged masterpiece. No other work of fiction so faithfully conveys both the sharp physical realities and the mythic sweep of the transformation of the American frontier—and the transformation of the people who settled it. Cather's heroine is Alexandra Bergson, who arrives on the wind-blasted prairie of Hanover, Nebraska, as a girl and grows up to make it a prosperous farm. But this archetypal success story is darkened by loss, and Alexandra's devotion to the land may come at the cost of love itself.", "At once a sophisticated pastoral and a prototype for later feminist novels, ", " is a work in which triumph is inextricably enmeshed with tragedy, a story of people who do not claim a land so much as they submit to it and, in the process, become greater than they were."], "author": "Willa Cather", "num_pages": "159", "awards": [], "places": ["Nebraska"], "character_names": ["Alexandra Bergson"], "language": "English", "publish_date": "1992-08-12 00:00:00", "ISBN": "0679743626"},
{"url": "https://www.goodreads.com/book/show/292408.Angle_of_Repose", "num_ratings": "45,492", "num_reviews": "3,825", "avg_ratings": 4.27, "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Literature"], "title": "Angle of Repose", "description": ["Wallace Stegner's Pultizer Prize-winning novel is a story of discovery—personal, historical, and geographical. Confined to a wheelchair, retired historian Lyman Ward sets out to write his grandparents' remarkable story, chronicling their days spent carving civilization into the surface of America's western frontier. But his research reveals even more about his own life tha", "Wallace Stegner's Pultizer Prize-winning novel is a story of discovery—personal, historical, and geographical. Confined to a wheelchair, retired historian Lyman Ward sets out to write his grandparents' remarkable story, chronicling their days spent carving civilization into the surface of America's western frontier. But his research reveals even more about his own life than he's willing to admit. What emerges is an enthralling portrait of four generations in the life of an American family."], "author": "Wallace Stegner", "num_pages": "569", "awards": ["Pulitzer Prize for Fiction (1972)"], "places": ["American West", "California", "Idaho"], "character_names": ["Lyman Ward", "Susan Burling Ward", "Oliver Ward", "Rodman Ward", "Frank Sargent", "Ada Topham", "Shelly Rasmussen", "Ellen Ward"], "language": "English", "publish_date": "1992-05-28 00:00:00", "ISBN": "0140169300"},
{"url": "https://www.goodreads.com/book/show/10799.A_Farewell_to_Arms", "num_ratings": "224,001", "num_reviews": "7,859", "avg_ratings": 3.79, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "War", "Literature"], "title": "A Farewell to Arms", "description": [" is the unforgettable story of an American ambulance driver on the Italian front and his passion for a beautiful English nurse. Set against the looming horrors of the battlefield—weary, demoralized men marching in the rain during the German attack on Caporetto; the profound struggle between loyalty and desertion—this gripping, semiautobiographical work ca", " is the unforgettable story of an American ambulance driver on the Italian front and his passion for a beautiful English nurse. Set against the looming horrors of the battlefield—weary, demoralized men marching in the rain during the German attack on Caporetto; the profound struggle between loyalty and desertion—this gripping, semiautobiographical work captures the harsh realities of war and the pain of lovers caught in its inexorable sweep. Ernest Hemingway famously said that he rewrote the ending to ", " thirty-nine times to get the words right."], "author": "Ernest Hemingway", "num_pages": "293", "awards": [], "places": ["Italy", "Milan"], "character_names": ["Frederic Henry", "Catherine Barkley", "Rinaldi"], "language": "English", "publish_date": "2004-08-12 00:00:00", "ISBN": "0099910101"},
{"url": "https://www.goodreads.com/book/show/133906.The_Collected_Poems", "num_ratings": "14,877", "num_reviews": "202", "avg_ratings": 4.33, "genres": ["Poetry", "Classics", "Cultural", "African American", "Fiction", "Literature"], "title": "The Collected Poems", "description": ["\"The ultimate book for both the dabbler and serious scholar--. [Hughes] is sumptuous and sharp, playful and sparse, grounded in an earthy music--. This book is a glorious revelation.\"--Boston Globe", "Spanning five decades and comprising 868 poems (nearly 300 of which have never before appeared in book form), this magnificent volume is the definitive sampling of a writer who h", "\"The ultimate book for both the dabbler and serious scholar--. [Hughes] is sumptuous and sharp, playful and sparse, grounded in an earthy music--. This book is a glorious revelation.\"--Boston Globe", "Spanning five decades and comprising 868 poems (nearly 300 of which have never before appeared in book form), this magnificent volume is the definitive sampling of a writer who has been called the poet laureate of African America--and perhaps our greatest popular poet since Walt Whitman.  Here, for the first time, are all the poems that Langston Hughes published during his lifetime, arranged in the general order in which he wrote them and annotated by Arnold Rampersad and David Roessel.", "Alongside such famous works as \"The Negro Speaks of Rivers\" and Montage of a Dream Deferred, ", " includes the author's lesser-known verse for children; topical poems distributed through the Associated Negro Press; and poems such as \"Goodbye Christ\" that were once suppressed.  Lyrical and pungent, passionate and polemical, the result is a treasure of a book, the essential collection of a poet whose words have entered our common language."], "author": "Langston Hughes", "num_pages": "736", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-10-31 00:00:00", "ISBN": "0679764089"},
{"url": "https://www.goodreads.com/book/show/284996.The_Complete_Stories", "num_ratings": "31,164", "num_reviews": "1,332", "avg_ratings": 4.44, "genres": ["Short Stories", "Fiction", "Classics", "Literature", "American", "Southern"], "title": "The Complete Stories", "author": "Flannery O'Connor", "num_pages": "555", "awards": ["National Book Award for Fiction (1972)"], "places": [], "character_names": [], "language": "English", "publish_date": "2005-06-17 00:00:00", "ISBN": "0374515360"},
{"url": "https://www.goodreads.com/book/show/10975.The_Sound_and_the_Fury", "num_ratings": "141,748", "num_reviews": "6,034", "avg_ratings": 3.86, "genres": ["Classics", "Fiction", "Literature", "Literature", "American"], "title": "The Sound and the Fury", "description": ["The text of this Norton Critical Edition is that of the corrected edition scrupulously prepared by Noel Polk, whose textual note precedes the text. David Minter's annotations are designed to assist the reader with obscure words and allusions.", "\"Backgrounds\" begins with the appendix Faulkner wrote in 1945 and sometimes referred to as another telling of ", "The text of this Norton Critical Edition is that of the corrected edition scrupulously prepared by Noel Polk, whose textual note precedes the text. David Minter's annotations are designed to assist the reader with obscure words and allusions.", "\"Backgrounds\" begins with the appendix Faulkner wrote in 1945 and sometimes referred to as another telling of ", " and includes a selection of Faulkner’s letters, excerpts from two Faulkner interviews, a memoir by Faulkner's friend Ben Wasson, and both versions of Faulkner's 1933 introduction to the novel.", "\"Cultural and Historical Contexts\" presents four different perspectives, two of them new to the second edition, on the place of the American South in history. Taken together, these works—by C. Vann Woodward, Richard H. King, Carolyn Porter, and Robert Penn Warren—provide the reader with valuable contexts for understanding the novel.", "\"Criticism\" includes seventeen essays on ", " that collectively trace changes in the way we have viewed this novel over the last four decades. The critics are Jean-Paul Sartre, Irving Howe, Ralph Ellison, Olga W. Vickery, Cleanth Brooks, Michael Millgate, John T. Irwin, Myra Jehlen, Donald M. Kartiganer, David Minter, Warwick Wadlington, John T. Matthews, Thadious M. Davis, Wesley Morris and Barbara Alverson Morris, Minrose C. Gwin, André Bleikasten, and Philip M. Weinstein. A revised Selected Bibliography also is included."], "author": "William Faulkner", "num_pages": "326", "awards": [], "places": ["Yoknapatawpha County, Mississippi", "Jefferson, Mississippi", "Cambridge, Massachusetts"], "character_names": ["The Compsons", "Dilsey Gibson", "Quentin Compson III", "Jason Compson IV", "Caroline Bascomb Compson", "Candace \"Caddy\" Compson", "Benjamin \"Benjy\" Compson", "Miss Quentin Compson"], "language": "English", "publish_date": "1990-10-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3876.The_Sun_Also_Rises", "num_ratings": "323,565", "num_reviews": "10,742", "avg_ratings": 3.82, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "The Sun Also Rises", "description": ["The quintessential novel of the Lost Generation, ", " is one of Ernest Hemingway's masterpieces and a classic example of his spare but powerful writing style. A poignant look at the disillusionment and angst of the post-World War I generation, the novel introduces two of Hemingway's most unforgettable characters: Jake Barnes and Lady Brett Ashley. The story f", "The quintessential novel of the Lost Generation, ", " is one of Ernest Hemingway's masterpieces and a classic example of his spare but powerful writing style. A poignant look at the disillusionment and angst of the post-World War I generation, the novel introduces two of Hemingway's most unforgettable characters: Jake Barnes and Lady Brett Ashley. The story follows the flamboyant Brett and the hapless Jake as they journey from the wild nightlife of 1920s Paris to the brutal bullfighting rings of Spain with a motley group of expatriates. It is an age of moral bankruptcy, spiritual dissolution, unrealized love, and vanishing illusions. First published in 1926, ", " helped to establish Hemingway as one of the greatest writers of the twentieth century."], "author": "Ernest Hemingway", "num_pages": "189", "awards": [], "places": ["Paris", "Pamplona", "San Sebastián", "Madrid"], "character_names": ["Jake Barnes", "Brett Ashley", "Robert Cohn", "Michael Campbell", "Bill Gorton", "Pedro Romero"], "language": "English", "publish_date": "1957-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/12204.The_Road_Not_Taken_and_Other_Poems", "num_ratings": "33,264", "num_reviews": "318", "avg_ratings": 4.27, "genres": ["Poetry", "Classics", "Fiction", "Literature", "American"], "title": "The Road Not Taken and Other Poems", "description": ["\"Two roads diverged in a wood, and I--", "I took the one less traveled by,", "And that has made all the difference.\"", "These deceptively simple lines from the title poem of this collection suggest Robert Frost at his most representative: the language is simple, clear and colloquial, yet dense with meaning and wider significance. Drawing upon everyday incidents, common situations and", "\"Two roads diverged in a wood, and I--", "I took the one less traveled by,", "And that has made all the difference.\"", "These deceptively simple lines from the title poem of this collection suggest Robert Frost at his most representative: the language is simple, clear and colloquial, yet dense with meaning and wider significance. Drawing upon everyday incidents, common situations and rural imagery, Frost fashioned poetry of great lyrical beauty and potent symbolism. Now a selection of the best of his early works is available in this volume, originally published in 1916 under the title ", ". Included are many moving and expressive poems: \"An Old Man's Winter Night,\" \"In the Home Stretch,\" \"Meeting and passing,\" \"Putting In the Seed,\" \"A Time to Talk,\" \"The Hill Wife,\" \"The Exposed Nest,\" \"The Sound of Trees,\" and more. All are reprinted here complete and unabridged.", "Unabridged Dover (1993) republication of ", ", originally published by Henry Hold and Company, New York, 1916. Note. Alphabetical list of titltes and first lines. 64pp. 5 3/16 X 8 1/4. Paperbound.", "Cover illustrations 1993 Andreas Feininger.", "\"The Road Not Taken\"", "\"Christmas Trees\"", "\"An Old Man's Winter Night\"", "\"A Patch of Old Snow\"", "\"In the Home Stretch\"", "\"The Telephone\"", "\"Meeting and Passing\"", "\"Hyla Brook\"", "\"The Oven Bird\"", "\"Bond and Free\"", "\"Birches\"", "\"Pea Brush\"", "Putting In the Seed\"", "\"A Time to Talk\"", "\"The Cow in Apple Time\"", "\"An Encounter\"", "\"Range-Finding\"", "\"The Hill Wife\"", "\"The Bonfire\"", "\"A Girl's Garden\"", "\"The Exposed Nest\"", "\"Out, Out--\"", "\"Brown's Descent, or The Willy-Nilly Slide\"", "\"The Gum-Gatherer\"", "\"The Line-Gang\"", "\"The Vanishing Red\"", "\"Snow\"", "\"The Sound of the Trees\""], "author": "Robert Frost", "num_pages": "49", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-04-19 00:00:00", "ISBN": "0486275507"},
{"url": "https://www.goodreads.com/book/show/77013.As_I_Lay_Dying", "num_ratings": "119,120", "num_reviews": "6,119", "avg_ratings": 3.72, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "As I Lay Dying", "description": [" is Faulkner’s harrowing account of the Bundren family’s odyssey across the Mississippi countryside to bury Addie, their wife and mother. Narrated in turn by each of the family members—including Addie herself—as well as others the novel ranges in mood, from dark comedy to the deepest pathos. Considered one of the most influential novels in American fiction in", " is Faulkner’s harrowing account of the Bundren family’s odyssey across the Mississippi countryside to bury Addie, their wife and mother. Narrated in turn by each of the family members—including Addie herself—as well as others the novel ranges in mood, from dark comedy to the deepest pathos. Considered one of the most influential novels in American fiction in structure, style, and drama, ", " is a true 20th-century classic. ", "This edition reproduces the corrected text of As I Lay Dying as established in 1985 by Noel Polk."], "author": "William Faulkner", "num_pages": "288", "awards": [], "places": ["Mississippi", "United States of America", "Yoknapatawpha County, Mississippi"], "character_names": ["Cash Bundren", "Anse Bundren", "Addie Bundren", "Darl Bundren", "Jewel Bundren", "Dewey Dell", "Vardaman Bundren", "Vernon Tull", "Cora Tull", "Peabody"], "language": "English", "publish_date": "1991-01-30 00:00:00", "ISBN": "067973225X"},
{"url": "https://www.goodreads.com/book/show/38296.The_Last_of_the_Mohicans", "num_ratings": "78,318", "num_reviews": "2,243", "avg_ratings": 3.7, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Adventure", "Literature", "Historical", "Literature", "American", "Novels", "Classics", "Classic Literature", "War"], "title": "The Last of the Mohicans", "description": ["The wild rush of action in this classic frontier adventure story has made", " the most popular of James Fenimore Cooper’s Leatherstocking Tales. Deep in the forests of upper New York State, the brave woodsman Hawkeye (Natty Bumppo) and his loyal Mohican friends Chingachgook and Uncas become embroiled in the bloody battles of the French and Indian War.", "The wild rush of action in this classic frontier adventure story has made", " the most popular of James Fenimore Cooper’s Leatherstocking Tales. Deep in the forests of upper New York State, the brave woodsman Hawkeye (Natty Bumppo) and his loyal Mohican friends Chingachgook and Uncas become embroiled in the bloody battles of the French and Indian War. The abduction of the beautiful Munro sisters by hostile savages, the treachery of the renegade brave Magua, the ambush of innocent settlers, and the thrilling events that lead to the final tragic confrontation between rival war parties create an unforgettable, spine-tingling picture of life on the frontier. And as the idyllic wilderness gives way to the forces of civilization, the novel presents a moving portrayal of a vanishing race and the end of its way of life in the great American forests."], "author": "James Fenimore Cooper", "num_pages": "410", "awards": [], "places": ["Upstate New York"], "character_names": ["Nathaniel Bumppo", "Chingachgook", "Magua", "Uncas", "Cora Munro", "Alice Munro", "Colonel George Munro", "Duncan Heyward", "David Gamut", "Tamenund", "General Marquis de Montcalm", "General Daniel Webb"], "language": "English", "publish_date": "1982-06-01 00:00:00", "ISBN": "0553213296"},
{"url": "https://www.goodreads.com/book/show/48464.A_Good_Man_is_Hard_to_Find_and_Other_Stories", "num_ratings": "33,452", "num_reviews": "1,813", "avg_ratings": 4.24, "genres": ["Short Stories", "Fiction", "Classics", "Literature", "Gothic", "Southern Gothic", "American", "Southern"], "title": "A Good Man is Hard to Find and Other Stories", "description": ["This now classic book revealed Flannery O'Connor as one of the most original and provocative writers to emerge from the South. Her apocalyptic vision of life is expressed through grotesque, often comic situations in which the principal character faces a problem of salvation: the grandmother, in the title story, confronting the murderous Misfit; a neglected four-year-old bo", "This now classic book revealed Flannery O'Connor as one of the most original and provocative writers to emerge from the South. Her apocalyptic vision of life is expressed through grotesque, often comic situations in which the principal character faces a problem of salvation: the grandmother, in the title story, confronting the murderous Misfit; a neglected four-year-old boy looking for the Kingdom of Christ in the fast-flowing waters of the river; General Sash, about to meet the final enemy. Stories include:", "\"A Good Man Is Hard to Find\"", "\"The River\"", "\"The Life You Save May Be Your Own\"", "\"A Stroke of Good Fortune\"", "\"A Temple of the Holy Ghost\"", "\"The Artificial Nigger\"", "\"A Circle in the Fire\"", "\"A Late Encounter with the Enemy\"", "\"Good Country People\"", "\"The Displaced Person\"", "©1955 Flannery O'Connor; 1954, 1953, 1948 by Flannery O'Connor; renewed 1983, 1981 by Regina O'Connor; renewed 1976 by Mrs. Edward F. O'Connor; (P)2010 Blackstone Audio, Inc."], "author": "Flannery O'Connor", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-10-15 00:00:00", "ISBN": "0151365040"},
{"url": "https://www.goodreads.com/book/show/5306.Travels_with_Charley", "num_ratings": "57,483", "num_reviews": "4,209", "avg_ratings": 4.07, "genres": ["Nonfiction", "Travel", "Classics", "Autobiography", "Memoir", "Biography"], "title": "Travels with Charley: In Search of America", "description": ["To hear the speech of the real America, to smell the grass and the trees, to see the colors and the light—these were John Steinbeck's goals as he set out, at the age of fifty-eight, to rediscover the country he had been writing about for so many years.", "With Charley, his French poodl", "To hear the speech of the real America, to smell the grass and the trees, to see the colors and the light—these were John Steinbeck's goals as he set out, at the age of fifty-eight, to rediscover the country he had been writing about for so many years.", "With Charley, his French poodle, Steinbeck drives the interstates and the country roads, dines with truckers, encounters bears at Yellowstone and old friends in San Francisco. Along the way he reflects on the American character, racial hostility, the particular form of American loneliness he finds almost everywhere, and the unexpected kindness of strangers."], "author": "John Steinbeck", "num_pages": "214", "awards": [], "places": ["United States of America"], "character_names": ["John Steinbeck", "Charley (Travels with Charley)"], "language": "English", "publish_date": "2002-02-05 00:00:00", "ISBN": "0142000701"},
{"url": "https://www.goodreads.com/book/show/4799.Cannery_Row", "num_ratings": "97,172", "num_reviews": "4,373", "avg_ratings": 4.03, "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Cannery Row", "description": [" is a book without much of a plot. Rather, it is an attempt to capture the feeling and people of a place, the cannery district of Monterey, California, which is populated by a mix of those down on their luck and those who choose for other reasons not to live \"up the hill\" in the more respectable area of town. The flow of the main plot is frequently interrupted b", " is a book without much of a plot. Rather, it is an attempt to capture the feeling and people of a place, the cannery district of Monterey, California, which is populated by a mix of those down on their luck and those who choose for other reasons not to live \"up the hill\" in the more respectable area of town. The flow of the main plot is frequently interrupted by short vignettes that introduce us to various denizens of the Row, most of whom are not directly connected with the central story. These vignettes are often characterized by direct or indirect reference to extreme violence: suicides, corpses, and the cruelty of the natural world.", "The \"story\" of ", " follows the adventures of Mack and the boys, a group of unemployed yet resourceful men who inhabit a converted fish-meal shack on the edge of a vacant lot down on the Row.", "Sweet Thursday is the sequel to Cannery Row."], "author": "John Steinbeck", "num_pages": "181", "awards": [], "places": ["California", "Monterey"], "character_names": ["Eddie", "\"Doc\" Bradley Stanwick", "Dora", "Lee Chong", "Mack", "Hughie", "Gay", "Hazel", "Eddie, Doc, Dora, Lee Chong, Mack"], "language": "English", "publish_date": "2002-02-05 00:00:00", "ISBN": "014200068X"},
{"url": "https://www.goodreads.com/book/show/2165.The_Old_Man_and_the_Sea", "num_ratings": "650,736", "num_reviews": "19,128", "avg_ratings": 3.74, "genres": ["Classics", "Fiction", "Literature", "Novels"], "title": "The Old Man and the Sea", "description": ["It is the story of an old Cuban fisherman and his supreme ordeal: a relentless, agonizing battle with a giant marlin far out in the Gulf Stream. Using the simple, powerful language of a fable, Hemingway takes the timeless themes of courage in the face of defeat and personal triumph won from loss and transforms them into a magnificent twentieth-century classic."], "author": "Ernest Hemingway", "num_pages": "132", "awards": ["Pulitzer Prize for Fiction (1953)", "Premio Bancarella (1953)", "National Book Award Finalist for Fiction (1953)"], "places": ["Cuba"], "character_names": ["Santiago", "Manolin"], "language": "English", "publish_date": "1996-08-12 00:00:00", "ISBN": "0684830493"},
{"url": "https://www.goodreads.com/book/show/153747.Moby_Dick_or_The_Whale", "num_ratings": "426,896", "num_reviews": "12,443", "avg_ratings": 3.48, "genres": ["Classics", "Fiction", "Literature", "Adventure", "Novels", "Historical", "Historical Fiction", "Literature", "American", "Literature", "19th Century", "Classics", "Classic Literature", "Abandoned"], "title": "Moby-Dick or, The Whale", "description": [" ", "So Melville wrote of his masterpiece, one of the greatest works of imagination in literary history. In part, ", " is the story of an eerily compelling madman pursuing an unholy war against a creature as vast and da", " ", "So Melville wrote of his masterpiece, one of the greatest works of imagination in literary history. In part, ", " is the story of an eerily compelling madman pursuing an unholy war against a creature as vast and dangerous and unknowable as the sea itself. But more than just a novel of adventure, more than an encyclopaedia of whaling lore and legend, the book can be seen as part of its author's lifelong meditation on America. Written with wonderfully redemptive humour, ", " is also a profound inquiry into character, faith, and the nature of perception."], "author": "Herman Melville", "num_pages": "720", "awards": ["Audie Award for Solo Narration - Male (2006)", "Премія імені Максима Рильського (1991)"], "places": ["Nantucket Island, Massachusetts", "Pacific Ocean", "Atlantic Ocean", "New Bedford, Massachusetts"], "character_names": ["Elijah", "Stubb", "Captain Ahab", "Ishmael", "Queequeg", "Starbuck", "Tashtego", "Dough-boy", "Flask", "Daggoo", "Fedallah", "Pippin (\"Pip\")", "Moby Dick", "Mapple Priest", "Peleg", "Bildad", "Fleece", "Perth"], "language": "English", "publish_date": "2003-02-21 00:00:00", "ISBN": "0142437247"},
{"url": "https://www.goodreads.com/book/show/17150.My_ntonia", "num_ratings": "107,650", "num_reviews": "6,366", "avg_ratings": 3.77, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "My Ántonia", "description": ["Through Jim Burden's endearing, smitten voice, we revisit the remarkable vicissitudes of immigrant life in the Nebraska heartland, with all its insistent bonds. Guiding the way are some of literature's most beguiling characters: the Russian brothers plagued by memories of a fateful sleigh ride, Antonia's desperately homesick father and self-indulgent mother, and the coy Le", "Through Jim Burden's endearing, smitten voice, we revisit the remarkable vicissitudes of immigrant life in the Nebraska heartland, with all its insistent bonds. Guiding the way are some of literature's most beguiling characters: the Russian brothers plagued by memories of a fateful sleigh ride, Antonia's desperately homesick father and self-indulgent mother, and the coy Lena Lingard. Holding the pastoral society's heart, of course, is the bewitching, free-spirited Antonia."], "author": "Willa Cather", "num_pages": "232", "awards": [], "places": ["Nebraska"], "character_names": ["Ántonia Shimerda", "Jim Burden", "Josiah Burden", "Emmaline Burden", "Ambrosch Shimerda", "Lena Lingard", "Otto Fuchs", "Jake Marpole", "Mr. Shimerda", "Mrs. Shimerda"], "language": "English", "publish_date": "2000-02-20 00:00:00", "ISBN": "1583485090"},
{"url": "https://www.goodreads.com/book/show/16902.Walden", "num_ratings": "130,943", "num_reviews": "4,123", "avg_ratings": 3.8, "genres": ["Classics", "Nonfiction", "Philosophy", "Environment", "Nature"], "title": "Walden", "description": ["Originally published in 1854, Walden; or, Life in the Woods, is a vivid account of the time that Henry D. Thoreau lived alone in a secluded cabin at Walden Pond. It is one of the most influential and compelling books in American literature. This new paperback edition-introduced by noted American writer John Updike-celebrates the 150th anniversary of this classic work. Much", "Originally published in 1854, Walden; or, Life in the Woods, is a vivid account of the time that Henry D. Thoreau lived alone in a secluded cabin at Walden Pond. It is one of the most influential and compelling books in American literature. This new paperback edition-introduced by noted American writer John Updike-celebrates the 150th anniversary of this classic work. Much of Walden's material is derived from Thoreau's journals and contains such engaging pieces as \"Reading\" and \"The Pond in the Winter\" Other famous sections involve Thoreau's visits with a Canadian woodcutter and with an Irish family, a trip to Concord, and a description of his bean field. This is the complete and authoritative text of Walden-as close to Thoreau's original intention as all available evidence allows. For the student and for the general reader, this is the ideal presentation of Thoreau's great document of social criticism and dissent."], "author": "Henry David Thoreau", "num_pages": "352", "awards": [], "places": ["United States of America", "Concord, Massachusetts", "Concord, Massachusetts"], "character_names": ["Henry David Thoreau"], "language": "English", "publish_date": "2004-04-18 00:00:00", "ISBN": "0691096120"},
{"url": "https://www.goodreads.com/book/show/890.Of_Mice_and_Men", "num_ratings": "1,643,767", "num_reviews": "27,536", "avg_ratings": 3.85, "genres": ["Classics", "Fiction", "Academic", "School", "Literature", "Historical", "Historical Fiction"], "title": "Of Mice and Men", "description": ["The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed", "The compelling story of two outsiders striving to find their place in an unforgiving world. Drifters in search of work, George and his simple-minded friend Lennie have nothing in the world except each other and a dream--a dream that one day they will have some land of their own. Eventually they find work on a ranch in California’s Salinas Valley, but their hopes are doomed as Lennie, struggling against extreme cruelty, misunderstanding and feelings of jealousy, becomes a victim of his own strength. Tackling universal themes such as the friendship of a shared vision, and giving voice to America’s lonely and dispossessed, ", " has proved one of Steinbeck’s most popular works, achieving success as a novel, a Broadway play and three acclaimed films."], "author": "John Steinbeck", "num_pages": "112", "awards": ["New York Drama Critics' Circle Award for Best American Play (1938)"], "places": ["Salinas Valley, California", "California"], "character_names": ["George Milton", "Lennie Small", "Candy", "Curley", "Curley's Wife", "Slim", "Crooks", "Whit", "Carlson"], "language": "English", "publish_date": "2002-01-08 00:00:00", "ISBN": "0142000671"},
{"url": "https://www.goodreads.com/book/show/4406.East_of_Eden", "num_ratings": "363,659", "num_reviews": "15,921", "avg_ratings": 4.36, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "East of Eden", "description": ["In his journal, Nobel Prize winner John Steinbeck called East of Eden “the first book,” and indeed it has the primordial power and simplicity of myth. Set in the rich farmland of California’s Salinas Valley, this sprawling and often brutal novel follows the intertwined destinies of two families—the Trasks and the Hamiltons—whose generations helplessly reenact the fall of A", "In his journal, Nobel Prize winner John Steinbeck called East of Eden “the first book,” and indeed it has the primordial power and simplicity of myth. Set in the rich farmland of California’s Salinas Valley, this sprawling and often brutal novel follows the intertwined destinies of two families—the Trasks and the Hamiltons—whose generations helplessly reenact the fall of Adam and Eve and the poisonous rivalry of Cain and Abel.", "Adam Trask came to California from the East to farm and raise his family on the new rich land. But the birth of his twins, Cal and Aaron, brings his wife to the brink of madness, and Adam is left alone to raise his boys to manhood. One boy thrives nurtured by the love of all those around him; the other grows up in loneliness enveloped by a mysterious darkness.", "First published in 1952, East of Eden is the work in which Steinbeck created his most mesmerizing characters and explored his most enduring themes: the mystery of identity, the enecplicability of love, and the murderous consequences of love's absence. A masterpiece of Steinbeck's later years, East of Eden is a powerful and vastly ambitious novel that is at once a family saga and a modern retelling of the Book of Genesis.", "--jacket flap"], "author": "John Steinbeck", "num_pages": "601", "awards": ["Audie Award for Classic (2004)", "National Book Award Finalist for Fiction (1953)"], "places": ["California"], "character_names": ["Mr. Edwards", "Ethel", "Lee", "Faye", "Tom Hamilton", "Cyrus Trask", "Mrs. Trask", "Alice Trask", "Adam Trask", "Charles Trask", "Aron Trask", "Caleb Trask", "Samuel Hamilton", "Liza Hamilton", "George Hamilton", "Will Hamilton", "Joe Hamilton", "Lizzie Hamilton", "Una Hamilton", "Dessie Hamilton", "Olive Hamilton", "Mollie Hamilton", "Cathy Ames", "Abra Bacon", "Joe Valery"], "language": "English", "publish_date": "2002-08-12 00:00:00", "ISBN": "0142000655"},
{"url": "https://www.goodreads.com/book/show/12296.The_Scarlet_Letter", "num_ratings": "605,340", "num_reviews": "12,474", "avg_ratings": 3.38, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Academic", "School"], "title": "The Scarlet Letter", "description": [" In Nathaniel Hawthorne's dark novel, ", ", ", ". None more so than Hester Prynne, a young, beautiful, and dignified wo", " In Nathaniel Hawthorne's dark novel, ", ", ", ". None more so than Hester Prynne, a young, beautiful, and dignified woman, who conceived a child out of wedlock and receives the public punishment of having to always wear ", ".", " She refuses to reveal the father of her child, which could lighten her sentence. Her husband, the aptly-named Roger Chillingworth, who Hester thought had died in a shipwreck but was actually being held captive by Native Americans, ", " of her deepest public shaming and vows to get ", ". Her lover, Arthur Dimmesdale, remains safely unidentified, but is wracked with guilt.", " Though originally published in 1850, the story is ", " among Hawthorne's Puritan ancestors. In ", ", he created a story that ", ". His knowledge of their beliefs and his admiration for their way of life was balanced by his concerns about their rigid and oppressive rules.", ", this elegantly designed, clothbound edition features an elastic closure and a new introduction by Mike Lee Davis."], "author": "Nathaniel Hawthorne", "num_pages": "238", "awards": [], "places": ["Boston, Massachusetts"], "character_names": ["Hester Prynne", "Arthur Dimmesdale", "Roger Chillingworth", "Pearl Prynne"], "language": "English", "publish_date": "2003-02-27 00:00:00", "ISBN": "0142437263"},
{"url": "https://www.goodreads.com/book/show/18114322-the-grapes-of-wrath", "num_ratings": "608,754", "num_reviews": "14,197", "avg_ratings": 3.94, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature"], "title": "The Grapes of Wrath", "description": ["The Pulitzer Prize-winning epic of the Great Depression, a book that galvanized—and sometimes outraged—millions of readers.", "First published in 1939, Steinbeck’s Pulitzer Prize-winning epic of the Great Depression chronicles the Dust Bowl migration of the 1930s and tells the story of one Oklahoma farm family, the Joads—driven from their homestead and forced to travel west to", "The Pulitzer Prize-winning epic of the Great Depression, a book that galvanized—and sometimes outraged—millions of readers.", "First published in 1939, Steinbeck’s Pulitzer Prize-winning epic of the Great Depression chronicles the Dust Bowl migration of the 1930s and tells the story of one Oklahoma farm family, the Joads—driven from their homestead and forced to travel west to the promised land of California. Out of their trials and their repeated collisions against the hard realities of an America divided into Haves and Have-Nots evolves a drama that is intensely human yet majestic in its scale and moral vision, elemental yet plainspoken, tragic but ultimately stirring in its human dignity. A portrait of the conflict between the powerful and the powerless, of one man’s fierce reaction to injustice, and of one woman’s stoical strength, the novel captures the horrors of the Great Depression and probes into the very nature of equality and justice in America. At once a naturalistic epic, captivity narrative, road novel, and transcendental gospel, Steinbeck’s powerful landmark novel is perhaps the most American of American Classics."], "author": "John Steinbeck", "num_pages": "479", "awards": ["Pulitzer Prize for Novel (1940)", "National Book Award for Fiction (1939)", "California Book Award for General Literature (Silver) (1939)", "Audie Award for Classic (1999)"], "places": ["Oklahoma", "California"], "character_names": ["Tom Joad", "Rose of Sharon Joad Rivers", "Ma Joad", "Pa Joad", "Uncle John Joad", "Jim Casy", "Al Joad", "Ruthie Joad", "Winfield Joad", "Noah Joad", "Grampa Joad", "Granma Joad", "Connie Rivers"], "language": "English", "publish_date": "2014-04-10 00:00:00", "ISBN": "067001690X"}
]