[
{"url": "https://www.goodreads.com/book/show/327321.The_Widow_s_War", "num_ratings": "5,157", "num_reviews": "720", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Literature", "18th Century"], "title": "The Widow's War", "description": ["Married for twenty years to Edward Berry, Lyddie is used to the trials of being a whaler's wife in the Cape Cod village of Satucket, Massachusetts—running their house herself during her husband's long absences at sea, living with the daily uncertainty that Edward will simply not return. And when her worst fear is realized, she finds herself doubly cursed. She is overwhelme", "Married for twenty years to Edward Berry, Lyddie is used to the trials of being a whaler's wife in the Cape Cod village of Satucket, Massachusetts—running their house herself during her husband's long absences at sea, living with the daily uncertainty that Edward will simply not return. And when her worst fear is realized, she finds herself doubly cursed. She is overwhelmed by grief, and her property and rights are now legally in the hands of her nearest male relative: her daughter's overbearing husband, whom Lyddie cannot abide. Lyddie decides to challenge both law and custom for control of her destiny, but she soon discovers the price of her bold \"war\" for personal freedom to be heartbreakingly dear.", "Includes the fascinating \"story behind the story\" of ", ", a map of colonial Brewster, and a driving tour of the village of Satucket."], "author": "Sally Gunning", "num_pages": "336", "awards": [], "places": ["Satucket, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2007-01-30 00:00:00", "ISBN": "0060791586"},
{"url": "https://www.goodreads.com/book/show/3249156-a-world-away", "num_ratings": "104", "num_reviews": "10", "avg_ratings": 3.27, "genres": ["Historical", "Historical Fiction", "Young Adult", "Romance", "Historical", "European Literature", "British Literature"], "title": "A World Away", "description": ["Ripped from her mother's bosom and shipped to England, Nadie, a Native American Indian, is thrust into the boiling pot of brutish Tudor life. Her only protector is Tom, a young blacksmith who falls in love with her. When Nadie is forced back to her exotic lands, to help the English colonize her people, Tom goes with her. But the New World holds uncharted danger - can Nadie", "Ripped from her mother's bosom and shipped to England, Nadie, a Native American Indian, is thrust into the boiling pot of brutish Tudor life. Her only protector is Tom, a young blacksmith who falls in love with her. When Nadie is forced back to her exotic lands, to help the English colonize her people, Tom goes with her. But the New World holds uncharted danger - can Nadie protect Tom in her world?"], "author": "Pauline Francis", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-08-12 00:00:00", "ISBN": "074608112X"},
{"url": "https://www.goodreads.com/book/show/59569.I_Am_Regina", "num_ratings": "967", "num_reviews": "95", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction"], "title": "I Am Regina", "description": ["The cabin door crashes open-and in a few minutes Regina's life changes forever. Allegheny Indians murder her father and brother, burn their Pennsylvania home to the ground, and take Regina captive. Only her mother, who is away from home, is safe. Torn from her family, Regina longs for the past, but she must begin a new life. She becomes Tskinnak, who learns to catch fish,", "The cabin door crashes open-and in a few minutes Regina's life changes forever. Allegheny Indians murder her father and brother, burn their Pennsylvania home to the ground, and take Regina captive. Only her mother, who is away from home, is safe. Torn from her family, Regina longs for the past, but she must begin a new life. She becomes Tskinnak, who learns to catch fish, dance the Indian dance, and speak the Indian tongue. As the years go by, her new people become her family . . . but she never stops wondering about her mother. Will they ever meet again?", "\"A first-person narrative based on the true story of a young woman held by Indians from 1755-1763, related with all the impact of a hard-hitting documentary . . .Wonderful reading.\" (", ")", "\"", " is an enthralling and profoundly stirring story, historical fiction for young people at its very finest.\" (Elizabeth George Speare, Newbery Award-winning author of ", ")"], "author": "Sally M. Keehn", "num_pages": "240", "awards": [], "places": ["Pennsylvania"], "character_names": [], "language": "English", "publish_date": "2001-12-31 00:00:00", "ISBN": "0698119207"},
{"url": "https://www.goodreads.com/book/show/794181.Trouble_s_Daughter", "num_ratings": "385", "num_reviews": "49", "avg_ratings": 4.02, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Childrens"], "title": "Trouble's Daughter: The Story of Susanna Hutchinson, Indian Captive", "description": ["A colonial girl comes of age as an Indian captive in this riveting and vividly detailed novel, based on a true story. First-rate historical fiction with terrific classroom potential, this dramatic novel explores the role of women in colonial and Native American society."], "author": "Katherine Kirkpatrick", "num_pages": "256", "awards": [], "places": ["United States of America"], "character_names": ["Susanna Hutchinson", "Anne Hutchinson", "Wam-pak", "Som-kway", "Sa-kat", "Peter Stuyvesant"], "language": "English", "publish_date": "2000-02-08 00:00:00", "ISBN": "0440415799"},
{"url": "https://www.goodreads.com/book/show/470175.The_Ransom_of_Mercy_Carter", "num_ratings": "1,710", "num_reviews": "160", "avg_ratings": 3.78, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Adventure"], "title": "The Ransom of Mercy Carter", "description": ["Deerfield, Massachusetts is one of the most remote, and therefore dangerous, settlements in the English colonies. In 1704 an Indian tribe attacks the town, and Mercy Carter becomes separated from the rest of her family, some of whom do not survive. Mercy and hundreds of other settlers are herded together and ordered by the Indians to start walking. The grueling journey --", "Deerfield, Massachusetts is one of the most remote, and therefore dangerous, settlements in the English colonies. In 1704 an Indian tribe attacks the town, and Mercy Carter becomes separated from the rest of her family, some of whom do not survive. Mercy and hundreds of other settlers are herded together and ordered by the Indians to start walking. The grueling journey -- three hundred miles north to a Kahnawake Indian village in Canada -- takes more than 40 days. At first Mercy's only hope is that the English government in Boston will send ransom for her and the other white settlers. But days turn into months and Mercy, who has become a Kahnawake daughter, thinks less and less of ransom, of Deerfield, and even of her \"English\" family. She slowly discovers that the \"savages\" have traditions and family life that soon become her own, and Mercy begins to wonder: If ransom comes, will she take it?"], "author": "Caroline B. Cooney", "num_pages": "256", "awards": [], "places": ["Canada"], "character_names": [], "language": "English", "publish_date": "2002-11-12 00:00:00", "ISBN": "0440227755"},
{"url": "https://www.goodreads.com/book/show/17707682-the-spirit-keeper", "num_ratings": "912", "num_reviews": "204", "avg_ratings": 4.01, "genres": ["Historical", "Historical Fiction", "Romance", "Fiction", "Fantasy", "Historical", "Young Adult"], "title": "The Spirit Keeper", "description": ["The thirteenth child conceived of miserable Irish exiles, Katie O’Toole dreams of a different life. Little does she know that someone far away is dreaming of her.", "In 1747, savages raid her family home, and seventeen-year-old Katie is taken captive. Syawa and Hector have been searc", "The thirteenth child conceived of miserable Irish exiles, Katie O’Toole dreams of a different life. Little does she know that someone far away is dreaming of her.", "In 1747, savages raid her family home, and seventeen-year-old Katie is taken captive. Syawa and Hector have been searching for her, guided by Syawa’s dreams. A young Holyman, Syawa believes Katie is the subject of his Vision: the Creature of Fire and Ice, destined to bring a great gift to his people. Despite her flaming hair and ice-blue eyes, Katie is certain he is mistaken, but faced with returning to her family, she agrees to join them. She soon discovers that in order to fulfill Syawa’s Vision, she must first become his Spirit Keeper, embarking on an epic journey that will change her life—and heart—forever."], "author": "K.B. Laugheed", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-24 00:00:00", "ISBN": "0142180335"},
{"url": "https://www.goodreads.com/book/show/499471.The_White", "num_ratings": "894", "num_reviews": "163", "avg_ratings": 3.4, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "The White", "description": ["In 1758, when Mary Jemison is about sixteen, a Shawnee raiding party captures her Irish family near Gettysburg, Pennsylvania. Mary is the only one not killed and scalped. She is instead given to two Seneca sisters to replace their brother who was killed by whites. Emerging slowly from shock, Mary--now named Two-Falling-Voices--begins to make her home in Seneca culture and", "In 1758, when Mary Jemison is about sixteen, a Shawnee raiding party captures her Irish family near Gettysburg, Pennsylvania. Mary is the only one not killed and scalped. She is instead given to two Seneca sisters to replace their brother who was killed by whites. Emerging slowly from shock, Mary--now named Two-Falling-Voices--begins to make her home in Seneca culture and the wild landscape. She goes on to marry a Delaware, then a Seneca, and, though she contemplates it several times, never rejoins white society. Larsen alludes beautifully to the way Mary apprehends the brutality of both the white colonists and the native tribes; and how, open-eyed and independent, she thrives as a genuine American."], "author": "Deborah Larsen", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-09-09 00:00:00", "ISBN": "0375712895"},
{"url": "https://www.goodreads.com/book/show/278656.City_of_Dreams", "num_ratings": "3,272", "num_reviews": "369", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "New York"], "title": "City of Dreams: A Novel of Nieuw Amsterdam and Early Manhattan", "description": ["In 1661, Lucas Turner, a barber surgeon, and his sister, Sally, an apothecary, stagger off a small wooden ship after eleven weeks at sea. Bound to each other by blood and necessity, they aim to make a fresh start in the rough and rowdy Dutch settlement of Nieuw Amsterdam; but soon lust, betrayal, and murder will make them mortal enemies. In their struggle to survive in the", "In 1661, Lucas Turner, a barber surgeon, and his sister, Sally, an apothecary, stagger off a small wooden ship after eleven weeks at sea. Bound to each other by blood and necessity, they aim to make a fresh start in the rough and rowdy Dutch settlement of Nieuw Amsterdam; but soon lust, betrayal, and murder will make them mortal enemies. In their struggle to survive in the New World, Lucas and Sally make choices that will burden their descendants with a legacy of secrets and retribution, and create a heritage that sets cousin against cousin, physician against surgeon, and, ultimately, patriot against Tory.", "In what will be the greatest city in the New World, the fortunes of these two families are inextricably entwined by blood and fire in an unforgettable American saga of pride and ambition, love and hate, and the becoming of the dream that is New York City."], "author": "Beverly Swerling", "num_pages": "592", "awards": [], "places": ["Manhattan, New York City, New York"], "character_names": [], "language": "English", "publish_date": "2002-06-18 00:00:00", "ISBN": "0684871734"},
{"url": "https://www.goodreads.com/book/show/79381.The_Vanishing_Point", "num_ratings": "1,058", "num_reviews": "169", "avg_ratings": 3.65, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance", "Romance", "Historical Romance", "Literature", "American"], "title": "The Vanishing Point", "description": ["In the tradition of Philippa Gregory’s smart, transporting fiction comes this tale of dark suspense, love, and betrayal, featuring two star-crossed sisters, one lost and the other searching.", "Bright and inquisitive, Hannah Powers was raised by a father who treated her as if she were his son. While her beautiful and reckless sister, May, pushes the limits of propriety in thei", "In the tradition of Philippa Gregory’s smart, transporting fiction comes this tale of dark suspense, love, and betrayal, featuring two star-crossed sisters, one lost and the other searching.", "Bright and inquisitive, Hannah Powers was raised by a father who treated her as if she were his son. While her beautiful and reckless sister, May, pushes the limits of propriety in their small English town, Hannah harbors her own secret: their father has given her an education forbidden to women. But Hannah’s secret serves her well when she journeys to colonial Maryland to reunite with May, who has been married off to a distant cousin after her sexual misadventures ruined her marriage prospects in England.", "As Hannah searches for May, who has disappeared, she finds herself falling in love with her brother-in-law. Alone in a wild, uncultivated land where the old rules no longer apply, Hannah is freed from the constraints of the society that judged both her and May as dangerous — too smart, too fearless, and too hungry for life. But Hannah is also plagued by doubt, as her quest for answers to May’s fate grows ever more disturbing and tangled."], "author": "Mary Sharratt", "num_pages": "369", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-06-02 00:00:00", "ISBN": "0618462333"},
{"url": "https://www.goodreads.com/book/show/23961392-tuckaseegee-river-rising", "num_ratings": "9", "num_reviews": "6", "avg_ratings": 3.89, "genres": [], "title": "Tuckaseegee River Rising", "description": ["TUCKASEEGEE RIVER RISING (Tuckaseegee Chronicles 1-7) is the first of several volumes that bundle the Tuckaseegee Chronicles into full-length novels. The chronicles may be purchased as singles or in multiples. Other multiple bundles will be available in the future, as well as single chronicles that further develop the story of the Scottish McNeills and their family, friend", "TUCKASEEGEE RIVER RISING (Tuckaseegee Chronicles 1-7) is the first of several volumes that bundle the Tuckaseegee Chronicles into full-length novels. The chronicles may be purchased as singles or in multiples. Other multiple bundles will be available in the future, as well as single chronicles that further develop the story of the Scottish McNeills and their family, friends, and enemies in the Tuckaseegee River Valley of the Cherokee Nation. ", "From Publishers Weekly____ ", "“Set in the American colonies in 1750, this is a tale of discovery, acceptance, war, love, and cultural awareness. A realistic historical piece, this novel is fraught with danger and heartbreak, but buoyed by romance and the hope for survival into future generations. A meticulously researched, exhaustive look at the uneasy coexistence of early settlers and native populations, the novel fully immerses the reader in a foreign world. Historical fiction buffs especially will want to know what happens to the MacNeills and the Cherokees in the next installment. The prose is flawless and the characters are robust and believable. Impressive.” ", "About the TUCKASEEGEE CHRONICLES____ ", "__Devastated by Scotland’s failed uprising against England in 1745, exiled highland warrior Ruary MacNeill transports his wife Elspeth, two children, and three orphaned nephews to America to operate a trading post and horse-breeding enterprise in the Great Smoky Mountains, the Southern Appalachian heartland of the large and powerful Cherokee Nation. ", "__Set in America’s first frontier during the French and Indian War, the TUCKASEEGEE CHRONICLES (1750-1764) is a multigenerational saga following the Scottish MacNeills as they interact with the Cherokee during a time of political upheaval when the Cherokee Nation is at war with other Indian tribes and has become a pawn in the conflict between England and France for control of the Atlantic seaboard. ", "__The MacNeills gradually discover that Cherokee clans are not unlike Scottish clans, both culturally and spiritually, and that friendship, love, and loyalty can cross cultural and racial boundaries. ", "__The chronicles should be read in chronological (numerical) order and may be purchased as singles or in volumes of multiples of chronicles. ", "About the Author____ ", "Betty Cloer Wallace is a tree farmer in Western North Carolina and a former instructor of writing and literature at a North Carolina community college that serves the Eastern Band of Cherokee Indians and the largest concentration of Scottish descendants outside of Scotland. Her British ancestors settled in the Great Smoky Mountains in the 1700s and intermingled with the Cherokee who have populated the region for thousands of years. A former school district superintendent and principal in North Carolina and Alaska, Wallace spent ten years in Eskimo villages in the Alaskan Arctic—Bering Strait, North Slope, and Northwest Arctic—which greatly influenced her interest in how indigenous populations are impacted by immigrant cultures. "], "author": "Betty Cloer Wallace", "num_pages": "478", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-07-26 00:00:00"},
{"url": "https://www.goodreads.com/book/show/3009435-a-mercy", "num_ratings": "17,350", "num_reviews": "2,414", "avg_ratings": 3.67, "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "African American", "Historical"], "title": "A Mercy", "description": ["In the 1680s the slave trade in the Americas is still in its infancy. Jacob Vaark is an Anglo-Dutch trader and adventurer, with a small holding in the harsh North. Despite his distaste for dealing in “flesh,” he takes a small slave girl in part payment for a bad debt from a plantation owner in Catholic Maryland. ", "This is Florens, who can read and write and might be useful o", "In the 1680s the slave trade in the Americas is still in its infancy. Jacob Vaark is an Anglo-Dutch trader and adventurer, with a small holding in the harsh North. Despite his distaste for dealing in “flesh,” he takes a small slave girl in part payment for a bad debt from a plantation owner in Catholic Maryland. ", "This is Florens, who can read and write and might be useful on his farm. Rejected by her mother, Florens looks for love, first from Lina, an older servant woman at her new master's house, and later from the handsome blacksmith, an African, never enslaved, who comes riding into their lives.", "A Mercy reveals what lies beneath the surface of slavery. But at its heart, like Beloved, it is the ambivalent, disturbing story of a mother and a daughter - a mother who casts off her daughter in order to save her, and a daughter who may never exorcise that abandonment."], "author": "Toni Morrison", "num_pages": "167", "awards": ["Orange Prize Nominee for Fiction Longlist (2009)", "James Tait Black Memorial Prize Nominee for Fiction (2008)", "The Rooster - The Morning News Tournament of Books (2009)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-11-11 00:00:00", "ISBN": "0307264238"},
{"url": "https://www.goodreads.com/book/show/14458975-quarantine", "num_ratings": "329", "num_reviews": "70", "avg_ratings": 3.51, "genres": ["Historical", "Historical Fiction", "Fiction", "Mystery", "Historical", "Medical"], "title": "Quarantine", "description": ["The year is 1796, and a trading ship arrives in the vibrant trading town of Newburyport, Massachusetts. But it's a ghost ship--her entire crew has been decimated by a virulent fever which sweeps through the harbor town, and Newburyport's residents start to fall ill and die with alarming haste. Something has to be done to stop the virus from spreading further. When physicia", "The year is 1796, and a trading ship arrives in the vibrant trading town of Newburyport, Massachusetts. But it's a ghost ship--her entire crew has been decimated by a virulent fever which sweeps through the harbor town, and Newburyport's residents start to fall ill and die with alarming haste. Something has to be done to stop the virus from spreading further. When physician Giles Wiggins places the port under quarantine, he earns the ire of his shipbuilder half-brother, the wealthy and powerful Enoch Sumner, and their eccentric mother, Miranda. Defiantly, Giles sets up a pest-house, where the afflicted might be cared for and separated from the rest of the populace in an attempt to contain the epidemic.", "As the seaport descends into panic, religious fervor, and mob rule, bizarre occurrences ensue: the harbormaster 's family falls victim to the fever, except for his son, Leander Hatch, who is taken in at the Sumner mansion and a young woman, Marie Montpelier, is fished out of the Merrimac River barely clinging to life, causing Giles and Enoch who is convinced she 's the expatriate daughter of the French king to vie for her attentions--all while medical supplies are pillaged by a black marketer from Boston. As the epidemic grows, fear, greed, and unhinged obsession threaten the Sumner family and the future of Newburyport itself."], "author": "John Smolens", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-05 00:00:00", "ISBN": "1605984183"},
{"url": "https://www.goodreads.com/book/show/18491964-woman-of-courage", "num_ratings": "432", "num_reviews": "107", "avg_ratings": 4.08, "genres": ["Amish", "Christian Fiction", "Fiction", "Historical", "Historical Fiction", "Christian", "Romance", "Historical Romance", "Historical"], "title": "Woman of Courage", "description": ["Jilted by her fiancé, Amanda Pearson gives up on romance and turns to her Quaker faith for reassurance. She becomes determined to follow the Rev. and Mrs. Spalding into the western wilderness to minister to the Nez Percé Indians.", "But a three-thousand-mile journey in 1837 is fraught with danger for anyone, and soon Amanda finds herself recovering from near death in a trapper", "Jilted by her fiancé, Amanda Pearson gives up on romance and turns to her Quaker faith for reassurance. She becomes determined to follow the Rev. and Mrs. Spalding into the western wilderness to minister to the Nez Percé Indians.", "But a three-thousand-mile journey in 1837 is fraught with danger for anyone, and soon Amanda finds herself recovering from near death in a trapper's cabin. His Indian wife becomes Amanda's first convert--and friend. But the trapper and his intriguing half-Indian friend want nothing to do with Christians.", "Buck McFadden has received nothing but pain from white men who claim Christ as their lord. He wants only to be left to his solitary life, but he can't seem to walk away from Amanda.", "Amanda fears she'll never reach the mission in the Lapwai Valley. This journey has become life-changing for her--and those she meets--and the choices she must make are almost unbearable."], "author": "Wanda E. Brunstetter", "num_pages": "316", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-04-01 00:00:00", "ISBN": "1616260831"},
{"url": "https://www.goodreads.com/book/show/5240887-on-maiden-lane", "num_ratings": "8", "num_reviews": "2", "avg_ratings": 4.38, "genres": ["History"], "title": "On Maiden Lane", "description": ["As the port city on Manhattan Island prospered, the de Kuyper dynasty rose to become merchant princes of a thriving new world. Under their English masters, they would build a commercial empire from Wall Street to Westchester. But over three generations, the wealth that gave them power and privilege also gave them a resolute loyalty to the land that was their home. They wou", "As the port city on Manhattan Island prospered, the de Kuyper dynasty rose to become merchant princes of a thriving new world. Under their English masters, they would build a commercial empire from Wall Street to Westchester. But over three generations, the wealth that gave them power and privilege also gave them a resolute loyalty to the land that was their home. They would fight the English war against the French and Indians, but they would never bend to the unjust tyranny of the Crown. The de Kuypers were New Yorkers now, their allegiance to the dawning glory of the American nation."], "author": "Bruce Nicolaysen", "num_pages": "536", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1981-08-01 00:00:00", "ISBN": "0380778009"},
{"url": "https://www.goodreads.com/book/show/1945184.Bound", "num_ratings": "2,156", "num_reviews": "332", "avg_ratings": 3.83, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Literature", "18th Century"], "title": "Bound", "author": "Sally Cabot Gunning", "num_pages": "320", "awards": [], "places": ["Satucket, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2008-04-01 00:00:00", "ISBN": "0061240257"},
{"url": "https://www.goodreads.com/book/show/628499.Lyons_Pride", "num_ratings": "3", "num_reviews": "2", "avg_ratings": 3.67, "genres": ["Historical", "Historical Fiction"], "title": "Lyons Pride", "description": ["They sailed from embattled England to America's shores, aristocratic exiles in the land of the common man. But not even an ocean could heal the breach of a house divided against itself, a family riven by hate.", "REBECKAH, the headstrong beauty, following her heart to its meeting with destiny in a majestic and lonely pl", "They sailed from embattled England to America's shores, aristocratic exiles in the land of the common man. But not even an ocean could heal the breach of a house divided against itself, a family riven by hate.", "REBECKAH, the headstrong beauty, following her heart to its meeting with destiny in a majestic and lonely place...AMOS, playing God with his family's future, until life played its cruelest trick...BEN, possessed by the guilty image of a ravaged mother that would haunt him to his dying day...BRUCE, giving his heart to Rebeckah only to lose her to another man - until desire brought them together again."], "author": "Mary Shura Craig", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1983-04-01 00:00:00", "ISBN": "0515052957"},
{"url": "https://www.goodreads.com/book/show/21539467-honor", "num_ratings": "201", "num_reviews": "73", "avg_ratings": 4.15, "genres": ["Historical", "Historical Fiction", "Christian Fiction", "Romance", "Historical", "Romance", "Historical Romance", "Christian", "Romance", "Christian Romance"], "title": "Honor", "description": ["When unexpected circumstances leave Honor Penworthy destitute after the death of her grandfather, she is forced to leave her Maryland plantation--and the slaves she hoped to free--and seek refuge with a distant relative. With no marketable skills, her survival hinges on a marriage arranged through the Quaker community to local glass artisan Samuel Cathwell. Samuel is drawn", "When unexpected circumstances leave Honor Penworthy destitute after the death of her grandfather, she is forced to leave her Maryland plantation--and the slaves she hoped to free--and seek refuge with a distant relative. With no marketable skills, her survival hinges on a marriage arranged through the Quaker community to local glass artisan Samuel Cathwell. Samuel is drawn to Honor, but he has been unwilling to open his heart to anyone since scarlet fever took his hearing as a child.A move west brings the promise of a fresh start, but nothing in Honor's genteel upbringing has prepared her for the rigors of frontier life with Samuel. Nevertheless, her tenacity and passion sweep her into important winds of change, and she becomes increasingly--though secretly--involved in the Underground Railroad. Samuel suspects Honor is hiding something, but will uncovering the truth confirm his worst fears or truly bring them together as man and wife?Set against the backdrop of dramatic and pivotal moments in American history, the Quaker Brides series chronicles the lives of three brave heroines, fighting to uphold their principles of freedom while navigating the terrain of faith, family, and the heart."], "author": "Lyn Cote", "num_pages": "375", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-09-01 00:00:00", "ISBN": "141437562X"},
{"url": "https://www.goodreads.com/book/show/23452743-wagon-train-reunion", "num_ratings": "113", "num_reviews": "20", "avg_ratings": 3.85, "genres": ["Historical", "Historical Fiction", "Romance", "Historical Romance", "Christian Fiction", "Romance", "Christian", "Category Romance", "Love Inspired", "Love Inspired", "Love Inspired Historical"], "title": "Wagon Train Reunion", "description": [" ", "Abigail Black had no choice but to break Ben Hewitt's heart years ago. Her parents had picked another, wealthier groom. Now widowed and destitute, she's desperate to leave her old life behind. The wagon-train journey to Oregon is full of dangers, but she'll face anything—even Ben—for a fresh start. ", "Ben knows better than to trust Abby again. Betwee", " ", "Abigail Black had no choice but to break Ben Hewitt's heart years ago. Her parents had picked another, wealthier groom. Now widowed and destitute, she's desperate to leave her old life behind. The wagon-train journey to Oregon is full of dangers, but she'll face anything—even Ben—for a fresh start. ", "Ben knows better than to trust Abby again. Between her family's snobbery and his family's protectiveness, avoiding her should be easy. Yet he's still moved by Abby's sweetness and beauty…along with a sadness and strength he never noticed in her before. Forgiving past wrongs would be a struggle—but the hardest struggle would be letting Abby go once more. "], "author": "Linda Ford", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-04-07 00:00:00", "ISBN": "0373283067"},
{"url": "https://www.goodreads.com/book/show/23411504-wagon-train-cinderella", "num_ratings": "249", "num_reviews": "41", "avg_ratings": 3.69, "genres": ["Romance", "Westerns", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Fairy Tales", "Cinderella"], "title": "Wagon Train Cinderella", "description": ["1851, Overland Trail to California. As a baby, Callie was left on the doorstep of an isolated farmhouse in Tennessee. The Whitaker family took her in, but have always considered her more a servant than a daughter. Scorned by her two stepsisters, Callie is forced to work long hours and denied an education. But a new world opens to her", "1851, Overland Trail to California. As a baby, Callie was left on the doorstep of an isolated farmhouse in Tennessee. The Whitaker family took her in, but have always considered her more a servant than a daughter. Scorned by her two stepsisters, Callie is forced to work long hours and denied an education. But a new world opens to her when the Whitakers join a wagon train to California—guided by rugged Indian, Luke McGraw…", "A loner, haunted by a painful past, Luke plans to return to the wilderness once his work is done. But he can’t help noticing how poorly Callie is treated—or how unaware she is of her beauty and intelligence. As the two become closer over the long trek west, Callie’s confidence grows. And when disaster strikes, Callie emerges as the strong one—and the woman Luke may find the courage to love at last…"], "author": "Shirley Kennedy", "num_pages": "259", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-03 00:00:00", "ISBN": "1616507012"},
{"url": "https://www.goodreads.com/book/show/1458597.Constance", "num_ratings": "628", "num_reviews": "71", "avg_ratings": 4.11, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Historical", "Romance", "Childrens"], "title": "Constance: A Story of Early Plymouth", "description": ["\"Pish!\" says Constance the day the \"Mayflower\" finally lands in America. Constance longs for her beloved London, but she does her share to help the pilgrim settles fight disease, tame the landscape, and befriend the natives. The village of Plymouth grows as more settlers arrive. Many of the young men have eyes for Constance. Could there possibly be room for romance in this", "\"Pish!\" says Constance the day the \"Mayflower\" finally lands in America. Constance longs for her beloved London, but she does her share to help the pilgrim settles fight disease, tame the landscape, and befriend the natives. The village of Plymouth grows as more settlers arrive. Many of the young men have eyes for Constance. Could there possibly be room for romance in this wild new place?"], "author": "Patricia Clapp", "num_pages": "256", "awards": ["National Book Award Finalist for Children's Books (1969)"], "places": ["Plymouth, Massachusetts"], "character_names": [], "language": "English", "publish_date": "1991-09-18 00:00:00", "ISBN": "0688109764"},
{"url": "https://www.goodreads.com/book/show/12469602-voices-beckon", "num_ratings": "38", "num_reviews": "8", "avg_ratings": 3.76, "genres": ["Historical", "Historical Fiction", "Romance", "Historical Romance", "Romance", "Fiction"], "title": "Voices Beckon", "description": ["It is 1783 and David Graham, a Scot indentured for the next six years to a Philadelphia printer, is pacing the Bristol quay, anxiously awaiting the call to board the brig Industry. Brimming with confidence, his thoughts waver between the gut-wrenching knowledge he is leaving his family behind, and the anticipation of the boundless opportunity awaiting him in America.", "As he", "It is 1783 and David Graham, a Scot indentured for the next six years to a Philadelphia printer, is pacing the Bristol quay, anxiously awaiting the call to board the brig Industry. Brimming with confidence, his thoughts waver between the gut-wrenching knowledge he is leaving his family behind, and the anticipation of the boundless opportunity awaiting him in America.", "As he watches the cabin class passengers board the transport, his eyes lock on Elisabeth, a beautiful young Englishwoman whose father will stop at almost nothing to keep her from consorting with the ‘lower sort.’ Sensing his scrutiny, she boldly meets his eyes, withering his new-found swagger.", "Shaking the sensation, he joins the boarding queue aside Liam Brock, a cocky Scot alive with an enthusiasm he finds contagious. Recently orphaned, Liam is making the passage with no misgivings or second thoughts, only a desire to escape his dubious past and a vision to claim his future.", "Set in late eighteenth-century Philadelphia, Voices Beckon spans seven years in the lives of three teens who form an unwavering bond of friendship, love, and loyalty while on a life-changing voyage to a new nation. Richly evocative of time and place, this sweeping romance chronicles their coming of age against the vivid backdrop of the emerging United States of America."], "author": "Linda Lee Graham", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2011-08-09 00:00:00"},
{"url": "https://www.goodreads.com/book/show/662183.This_Calder_Sky", "num_ratings": "1,338", "num_reviews": "41", "avg_ratings": 4.16, "genres": ["Romance", "Fiction", "Westerns", "Romance", "Contemporary Romance"], "title": "This Calder Sky", "description": ["The great Calder empire stretched across the Montana plains as far as the eye could see. Everyone knew a Calder's word was law and that one day Chase Calder would carry the family name to new glories. But for handsome, arrogant Chase Calder there was also beautiful Maggie O'Rourke, who came to him in innocence and stirred in him a deep, insistent longing. But Maggie was de", "The great Calder empire stretched across the Montana plains as far as the eye could see. Everyone knew a Calder's word was law and that one day Chase Calder would carry the family name to new glories. But for handsome, arrogant Chase Calder there was also beautiful Maggie O'Rourke, who came to him in innocence and stirred in him a deep, insistent longing. But Maggie was determined to be free from the harsh codes of hard men. And even Chase Calder's strong arms couldn't keep her. Still, in them both burned the raw passion of the land...where even the greatest love must fight to live beneath "], "author": "Janet Dailey", "num_pages": "496", "awards": [], "places": ["Montana"], "character_names": [], "language": "English", "publish_date": "1999-08-01 00:00:00", "ISBN": "0671040510"},
{"url": "https://www.goodreads.com/book/show/781110.Fever_1793", "num_ratings": "90,168", "num_reviews": "5,201", "avg_ratings": 3.9, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Childrens", "Middle Grade"], "title": "Fever 1793", "description": ["It's late summer 1793, and the streets of Philadelphia are abuzz with mosquitoes and rumors of fever. Down near the docks, many have taken ill, and the fatalities are mounting. Now they include Polly, the serving girl at the Cook Coffeehouse. But fourteen-year-old Mattie Cook doesn't get a moment to mourn the passing of her childhood playmate. New customers have overrun he", "It's late summer 1793, and the streets of Philadelphia are abuzz with mosquitoes and rumors of fever. Down near the docks, many have taken ill, and the fatalities are mounting. Now they include Polly, the serving girl at the Cook Coffeehouse. But fourteen-year-old Mattie Cook doesn't get a moment to mourn the passing of her childhood playmate. New customers have overrun her family's coffee shop, located far from the mosquito-infested river, and Mattie's concerns of fever are all but overshadowed by dreams of growing her family's small business into a thriving enterprise. But when the fever begins to strike closer to home, Mattie's struggle to build a new life must give way to a new fight—the fight to stay alive."], "author": "Laurie Halse Anderson", "num_pages": "252", "awards": ["California Young Readers Medal Nominee for Middle School/Junior High (2004)", "Rebecca Caudill Young Readers' Book Award (2003)"], "places": ["Philadelphia, Pennsylvania"], "character_names": ["Mattie Cook"], "language": "English", "publish_date": "2000-09-01 00:00:00", "ISBN": "0689848919"},
{"url": "https://www.goodreads.com/book/show/3002300-chains", "num_ratings": "39,367", "num_reviews": "4,691", "avg_ratings": 4.09, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Childrens", "Middle Grade"], "title": "Chains", "description": ["As the Revolutionary War begins, thirteen-year-old Isabel wages her own fight...for freedom. Promised freedom upon the death of their owner, she and her sister, Ruth, in a cruel twist of fate become the property of a malicious New York City couple, the Locktons, who have no sympathy for the American Revolution and even less for Ruth and Isabel. When Isabel meets Curzon, a", "As the Revolutionary War begins, thirteen-year-old Isabel wages her own fight...for freedom. Promised freedom upon the death of their owner, she and her sister, Ruth, in a cruel twist of fate become the property of a malicious New York City couple, the Locktons, who have no sympathy for the American Revolution and even less for Ruth and Isabel. When Isabel meets Curzon, a slave with ties to the Patriots, he encourages her to spy on her owners, who know details of British plans for invasion. She is reluctant at first, but when the unthinkable happens to Ruth, Isabel realizes her loyalty is available to the bidder who can provide her with freedom. ", "  Format: Hardcover \n   Publication Date: 10/21/2008 \n   Pages: 320 \n   Reading Level: Age 10 and Up \n "], "author": "Laurie Halse Anderson", "num_pages": "316", "awards": ["Scott O'Dell Award (2009)", "South Carolina Book Award Nominee for Junior Book Award (2011)", "Missouri Truman Readers Award Nominee (2011)", "Cybils Award for Middle Grade Fiction (2009)", "National Book Award Finalist for Young People's Literature (2008)", "Carnegie Medal Nominee (2010)", "Rebecca Caudill Young Readers' Book Award Nominee (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2008-10-21 00:00:00", "ISBN": "1416905855"},
{"url": "https://www.goodreads.com/book/show/1771987.The_Pride_of_Hannah_Wade", "num_ratings": "230", "num_reviews": "13", "avg_ratings": 3.67, "genres": ["Romance", "Historical Romance", "Romance", "Historical", "Fiction"], "title": "The Pride of Hannah Wade", "description": ["In the harsh New Mexico Territory, Hannah Wade was captured and enslaved by avenging Apaches. Only her steel-edged will to live kept her alive. ", "Finally rescued, she returned to a husband who shunned her touch, and to white women friends who found her stained and disgraced. But Hannah fought for her honor with the help of one man who valued her strength and spirit...one man", "In the harsh New Mexico Territory, Hannah Wade was captured and enslaved by avenging Apaches. Only her steel-edged will to live kept her alive. ", "Finally rescued, she returned to a husband who shunned her touch, and to white women friends who found her stained and disgraced. But Hannah fought for her honor with the help of one man who valued her strength and spirit...one man who walked by her side in a land strewn with hate and injustice."], "author": "Janet Dailey", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1994-01-02 00:00:00", "ISBN": "0671875108"},
{"url": "https://www.goodreads.com/book/show/8581015-deliverance-from-evil", "num_ratings": "396", "num_reviews": "84", "avg_ratings": 2.91, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Paranormal", "Witches", "North American Hi...", "American History", "Young Adult", "Literature", "17th Century", "Literature", "American", "Thriller", "Mystery Thriller", "Witchcraft"], "title": "Deliverance from Evil", "description": [" brings to life the Salem witch trials, one of the most uncanny times in our nation's history. Young girls in trances pointed out neighbors, leaders, relatives--over 150 people were arrested, with many hanged for their supposed sins. Frances Hill, author of ", ", brings her deep historical and political understanding together with her ho", " brings to life the Salem witch trials, one of the most uncanny times in our nation's history. Young girls in trances pointed out neighbors, leaders, relatives--over 150 people were arrested, with many hanged for their supposed sins. Frances Hill, author of ", ", brings her deep historical and political understanding together with her honed skills as a novelist to produce a picture of the trials both realistic and emotional. She has written an extraordinary and gripping novel of hysteria, power plays, and love in colonial America."], "author": "Frances Hill", "num_pages": "320", "awards": [], "places": ["Salem, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2011-03-03 00:00:00", "ISBN": "1590204700"},
{"url": "https://www.goodreads.com/book/show/2865717-queen-s-gift", "num_ratings": "29", "num_reviews": "4", "avg_ratings": 4.38, "genres": ["Historical", "Historical Fiction", "Romance", "Literature", "17th Century"], "title": "Queen's Gift", "description": ["This is the seventh novel in Inglis Fletcher's celebrated Carolina series, and the keystone volume in her large design to compass in story the 200 years history of North Carolina from first settlement to ratification of the Constitution. The year is 1788 and Albemarle folk who have been united in war are divided in peace. A Constitution has been shaped in Philadelphia. Fri", "This is the seventh novel in Inglis Fletcher's celebrated Carolina series, and the keystone volume in her large design to compass in story the 200 years history of North Carolina from first settlement to ratification of the Constitution. The year is 1788 and Albemarle folk who have been united in war are divided in peace. A Constitution has been shaped in Philadelphia. Friend stands against friend in the bitter dissension over whether North Carolina shall ratify it and join the new union of the states. Leaders like brilliant, farsighted James Iredell and staunch Governor Sam Johnston use all their eloquence and prestige to persuade fellow citizens of the advantage in strong central government. As in 'Raleigh's Eden,' the principal characters are Adam and Mary Rutledge. Mary's strong conviction that the Constitution will safeguard all she holds dear. . . is opposed to Adam's belief that the new plan of government ignores the rights of men. His vote at the Hillsborough convention could estrange him from Mary."], "author": "Inglis Fletcher", "num_pages": "448", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1976-06-01 00:00:00", "ISBN": "0892440058"},
{"url": "https://www.goodreads.com/book/show/24481952-along-the-far-shores", "num_ratings": "85", "num_reviews": "10", "avg_ratings": 4.02, "genres": ["Historical", "Historical Fiction", "Romance", "Historical Romance", "Adventure", "Literature", "12th Century", "Fantasy", "Epic Fantasy"], "title": "Along the Far Shores", "description": ["A 12th century Irish woman sets out on the legendary voyage to America of Prince Madog of Wales. Part of the Celtic Knot Series", "Aisling, despite her best efforts has failed to become the seer her mother desired, so when her mother dies leaving her alone, she departs Ireland for Wales to be with her brother, Cormac, at the royal court at Gwynedd. There she finds he is joinin", "A 12th century Irish woman sets out on the legendary voyage to America of Prince Madog of Wales. Part of the Celtic Knot Series", "Aisling, despite her best efforts has failed to become the seer her mother desired, so when her mother dies leaving her alone, she departs Ireland for Wales to be with her brother, Cormac, at the royal court at Gwynedd. There she finds he is joining Prince Madog’s voyage to the western lands in order to escape the threatening war. After Madog refuses to let her come with them she stows away, desperate to remain with her brother. A terrible storm arises and she is tossed overboard by a resentful Welshman and washes up on the shores of the Gulf Coast. Caxna, a Tlingit trader and former shaman, finds her and reluctantly agrees to let her join him on a trading journey to the Mayan city of Xicallanca, and later Etowah (in modern day Georgia) in the hopes she might find Madog and her brother. Caxna must succeed in this trading journey in order to free his clan but with Aisling along everything changes. ", "….Gleeson leaves us with a memorable and poignant love story and a vision of a wonderful culture, unique in my experience of literature.", "Karen Charlton, author of The Heiress of Linn Hagh and Catching the Eagle", "The underlying sexual tension is all the more powerful for the beautifully restrained writing, which makes the slightest touch electric; a medicinal massage becomes a moment of physical communion…. This is what Kristin Gleeson does best; portraying different cultures and showing how humanity can cross them.", "Jean Gill, author of Song at Dawn"], "author": "Kristin Gleeson", "num_pages": "312", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-11-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/2789800-the-proud-and-the-free", "num_ratings": "221", "num_reviews": "29", "avg_ratings": 3.62, "genres": ["Romance", "Historical", "Historical Fiction", "Romance", "Historical Romance", "Historical", "Fiction"], "title": "The Proud And The Free", "description": ["Set in the 1830s in the US state of Georgia, against a background of conflict between the native Cherokee Indians and the Georgians, this is a story of powerful love between Temple Gordon and the rebel Cherokee The Blade. Can their love survive the upheaval and destruction of their people?"], "author": "Janet Dailey", "num_pages": "392", "awards": [], "places": [], "character_names": [], "language": "Spanish", "publish_date": "1995-08-23 00:00:00", "ISBN": "075151179X"},
{"url": "https://www.goodreads.com/book/show/915933.The_Bride_of_the_Wilderness", "num_ratings": "183", "num_reviews": "21", "avg_ratings": 3.77, "genres": ["Historical", "Historical Fiction", "Fiction"], "title": "The Bride of the Wilderness", "description": ["In early 18th-century America, London-born Fanny and the French soldier Philippe (ancestors of McCarrys famous recurring spy Paul Christopher) brave savage Indians and other adventures."], "author": "Charles McCarry", "num_pages": "482", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1989-05-02 00:00:00", "ISBN": "0451159586"},
{"url": "https://www.goodreads.com/book/show/2865711-toil-of-the-brave", "num_ratings": "24", "num_reviews": "2", "avg_ratings": 4.33, "genres": ["Historical", "Historical Fiction", "Own"], "title": "Toil of the Brave", "description": ["Novel starts on the river plantation in North Carolina of Senator Ferrier. The Senator had married a Spanish woman with a child, an eighteen-year-old beauty named Angela. England and the colonies have been at war for four years, the year is 1779. But some of the freeholders in North Carolina are stil clinging to the hope that the war will be over soon. Trying to arrange a", "Novel starts on the river plantation in North Carolina of Senator Ferrier. The Senator had married a Spanish woman with a child, an eighteen-year-old beauty named Angela. England and the colonies have been at war for four years, the year is 1779. But some of the freeholders in North Carolina are stil clinging to the hope that the war will be over soon. Trying to arrange a suitable marriage for Angela is difficult because of her heritage and her rebellious nature."], "author": "Inglis Fletcher", "num_pages": "548", "awards": [], "places": ["North Carolina"], "character_names": [], "language": "English", "publish_date": "1986-08-01 00:00:00", "ISBN": "0553258753"},
{"url": "https://www.goodreads.com/book/show/1293410.Embrace_the_Day", "num_ratings": "27", "num_reviews": "3", "avg_ratings": 3.67, "genres": ["Romance", "Historical", "Romance", "Historical Romance", "Historical", "Historical Fiction"], "title": "Embrace the Day", "description": ["The author of The Mist and the Magic presents a sweeping saga of a passionate frontier family. Filled with dreams of a better life, 17-year-old Genevieve Elliot makes the perilous journey from England to colonial Virginia, where she and handsome frontiersman Roarke Adair tame the savage wilderness and survive the sorrows of war to make a home."], "author": "Susan Wiggs", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1993-01-01 00:00:00", "ISBN": "0061080500"},
{"url": "https://www.goodreads.com/book/show/5861129-ghost-horse-stallion-of-the-oregon-trail", "num_ratings": "23", "num_reviews": "3", "avg_ratings": 3.96, "genres": ["Fiction", "Animals", "Horses", "Historical", "Adventure", "Young Adult"], "title": "Ghost Horse Stallion Of The Oregon Trail", "description": ["'...They had many names for him - this stallion of the Pacific North-West. The mustangers called him Pahute because he was said to have been born on a mountain mesa of the same name. Others called him \"The Ghost\".'", "Jim Blaine's search for the legendary stallion is told by Joseph Chipperfield in this exciting Western story for older readers."], "author": "Joseph E. Chipperfield", "num_pages": "174", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1976-08-12 00:00:00", "ISBN": "0600340074"},
{"url": "https://www.goodreads.com/book/show/6104759-an-echo-in-the-bone", "num_ratings": "95,660", "num_reviews": "5,429", "avg_ratings": 4.43, "genres": ["Historical", "Historical Fiction", "Romance", "Fantasy", "Fiction", "Science Fiction", "Time Travel", "Historical"], "title": "An Echo in the Bone", "description": ["Jamie Fraser, former Jacobite and reluctant rebel, is already certain of three things about the American rebellion: The Americans will win, fighting on the side of victory is no guarantee of survival, and he'd rather die than have to face his illegitimate son--a young lieutenant in the British Army--across the barrel of a gun.", "Claire Randall knows that the Americans will wi", "Jamie Fraser, former Jacobite and reluctant rebel, is already certain of three things about the American rebellion: The Americans will win, fighting on the side of victory is no guarantee of survival, and he'd rather die than have to face his illegitimate son--a young lieutenant in the British Army--across the barrel of a gun.", "Claire Randall knows that the Americans will win, too, but not what the ultimate price may be. That price won't include Jamie's life or his happiness, though--not if she has anything to say about it.", "Meanwhile, in the relative safety of the twentieth century, Jamie and Claire's daughter, Brianna, and her husband, Roger MacKenzie, have resettled in a historic Scottish home where, across a chasm of two centuries, the unfolding drama of Brianna's parents' story comes to life through Claire's letters. The fragile pages reveal Claire's love for battle-scarred Jamie Fraser and their flight from North Carolina to the high seas, where they encounter privateers and ocean battles--as Brianna and Roger search for clues not only to Claire's fate but to their own. Because the future of the MacKenzie family in the Highlands is mysteriously, irrevocably, and intimately entwined with life and death in war-torn colonial America.", "With stunning cameos of historical characters from Benedict Arnold to Benjamin Franklin, ", " is a soaring masterpiece of imagination, insight, character, and adventure--a novel that echoes in the mind long after the last page is turned."], "author": "Diana Gabaldon", "num_pages": "820", "awards": ["DABWAHA Romance Tournament for Best Novel with Romantic Elements/Crossover (2010)", "Goodreads Choice Award for Romance (2009)"], "places": ["Fraser's Ridge, North Carolina", "Saratoga, New York", "Lallybroch, Scotland", "Philadelphia, Pennsylvania", "Wilmington, North Carolina", "Lallybroch, Scotland"], "character_names": ["Jamie Fraser", "Brianna Randall", "Roger MacKenzie", "Jeremiah MacKenzie", "Fergus Fraser", "Marsali Fraser", "Germain Fraser", "Ian Murray", "Tom Christie", "Lord John Grey", "Benedict Arnold", "Claire Randall Fraser", "Jenny Murray", "Young Ian Murray", "William Ransom", "Rachel Hunter", "Denzell Hunter", "William Buccleigh MacKenzie", "Amanda MacKenzie", "Lizzie Wemyss", "Jo Beardsley", "Kezzie Beardsley", "Laoghaire MacKenzie", "Joan MacKimmie", "Michael Murray"], "language": "English", "publish_date": "2009-09-22 00:00:00", "ISBN": "0385342454"},
{"url": "https://www.goodreads.com/book/show/17445305-detour-trail", "num_ratings": "11", "num_reviews": "9", "avg_ratings": 4.27, "genres": ["Animals", "Horses", "Westerns", "Adventure"], "title": "Detour Trail", "description": ["Westward bound on the Oregon Trail, Lorena Emerson is alone after her uncle is killed by a thief trying to steal his money belt. Ignoring the wagon master's advice to go home, she rounds up others needing help, and they join a later wagon train and are soon slogging through dust and mud and steep mountain passes. It's a long way to Oregon, and because another woman needs h", "Westward bound on the Oregon Trail, Lorena Emerson is alone after her uncle is killed by a thief trying to steal his money belt. Ignoring the wagon master's advice to go home, she rounds up others needing help, and they join a later wagon train and are soon slogging through dust and mud and steep mountain passes. It's a long way to Oregon, and because another woman needs her help, Lorrie again goes her own way, leaving the wagon train and the Oregon Trail to travel onward—off the beaten path—with her small group of wagons. She's helped by members of her wagon train, people she meets along the way, and the mule, Jake, an integral part of the story. You'll meet them as they join in her travels and encounters with enemies and as she searches for a new home and supplies as winter reaches out its icy hands.... Settling the frontier isn't easy!"], "author": "Joy V. Smith", "num_pages": "138", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-02-25 00:00:00", "ISBN": "1612355706"},
{"url": "https://www.goodreads.com/book/show/10900327-the-pilgrim", "num_ratings": "207", "num_reviews": "58", "avg_ratings": 3.19, "genres": ["Historical", "Historical Fiction", "Fiction", "Religion"], "title": "The Pilgrim", "description": ["Charles Wentworth, a heartbroken Puritan, comes to the New World from England in 1622 in search of salvation and a new beginning. Burdened with a lifelong struggle between his desire for faith and his doubts about God's love for him, he leaves the only land he has ever known after the death of his fiancée, in hopes of being freed of the temptations that torment him.", "A new m", "Charles Wentworth, a heartbroken Puritan, comes to the New World from England in 1622 in search of salvation and a new beginning. Burdened with a lifelong struggle between his desire for faith and his doubts about God's love for him, he leaves the only land he has ever known after the death of his fiancée, in hopes of being freed of the temptations that torment him.", "A new masterpiece from National Book Award and Pen/Faulkner Award finalist Hugh Nissenson, ", " explores the foundation myths of America, a country settled by people intoxicated by the pursuit of God and yearning for redemption and freedom."], "author": "Hugh Nissenson", "num_pages": "368", "awards": ["David J. Langum Sr. Prize Nominee for American Historical Fiction (Director's Mention) (2011)"], "places": [], "character_names": [], "language": "English", "publish_date": "2011-11-01 00:00:00", "ISBN": "140220924X"},
{"url": "https://www.goodreads.com/book/show/2572812-savage-spirit", "num_ratings": "33", "num_reviews": "6", "avg_ratings": 4.0, "genres": ["Fiction", "Historical", "Historical", "Historical Fiction", "Romance"], "title": "Savage Spirit", "description": ["Captured by Shawnee Indians and taken far from her home, sixteen-year-old Catherine Brant meets Blue Quail, a handsome warrior who captures her heart with his wild bravery."], "author": "Meg Cameron", "num_pages": "176", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1986-04-24 00:00:00", "ISBN": "0583309011"},
{"url": "https://www.goodreads.com/book/show/1549073.To_Share_a_Dream", "num_ratings": "27", "num_reviews": "5", "avg_ratings": 4.0, "genres": ["Romance", "Historical", "Historical Fiction"], "title": "To Share a Dream", "description": ["Massachusetts Bay Colony in 1699 was a rugged new land of freedom and hope for the Puritans. While church spires rose high above bustling cobblestone streets and majestic oaks turned to vibrant scarlet and gold, witch-hunting began to spread its cloak of suspicion from Salem to Ipswich.", "Desperate to escape", "Massachusetts Bay Colony in 1699 was a rugged new land of freedom and hope for the Puritans. While church spires rose high above bustling cobblestone streets and majestic oaks turned to vibrant scarlet and gold, witch-hunting began to spread its cloak of suspicion from Salem to Ipswich.", "Desperate to escape the dangers of their native Cornwall, three beautiful sisters became indentured servants for passage to the new land - and a new life...", "CHRISTINA. As sensible as she was beautiful, her heart and dreams belonged to the one man who desired another...", "ROXANNE. Wild, impetuous, defiant, she had black hair and suspicious glances...", "MEGAN. Her love for a young Puritan widower knew no bounds, but her terrifying secret forbade her from ever marrying..."], "author": "Willo Davis Roberts", "num_pages": "506", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1986-11-01 00:00:00", "ISBN": "0373970285"},
{"url": "https://www.goodreads.com/book/show/531914.A_Breath_of_Snow_and_Ashes", "num_ratings": "114,032", "num_reviews": "4,485", "avg_ratings": 4.43, "genres": ["Historical", "Historical Fiction", "Romance", "Fiction", "Fantasy", "Science Fiction", "Time Travel", "Historical"], "title": "A Breath of Snow and Ashes", "description": [" continues the extraordinary story of 18th-century Scotsman Jamie Fraser and his 20th-century wife, Claire.", "The year is 1772, and on the eve of the American Revolution, the long fuse of rebellion has already been lit. Men lie dead in the streets of Boston, and in the backwoods of North Carolina, isolated cabins burn in the forest.", "With chaos brewing", " continues the extraordinary story of 18th-century Scotsman Jamie Fraser and his 20th-century wife, Claire.", "The year is 1772, and on the eve of the American Revolution, the long fuse of rebellion has already been lit. Men lie dead in the streets of Boston, and in the backwoods of North Carolina, isolated cabins burn in the forest.", "With chaos brewing, the governor calls upon Jamie Fraser to unite the backcountry and safeguard the colony for King and Crown. But from his wife Jamie knows that three years hence the shot heard round the world will be fired, and the result will be independence — with those loyal to the King either dead or in exile. And there is also the matter of a tiny clipping from The Wilmington Gazette, dated 1776, which reports Jamie’s death, along with his kin. For once, he hopes, his time-traveling family may be wrong about the future."], "author": "Diana Gabaldon", "num_pages": "980", "awards": ["All About Romance (AAR) Annual Reader Poll for Most-Hanky Read (tie) & Best American Historical/Frontier Romance (2006)", "Corine Internationaler Buchpreis for Weltbild Leserpreis (2006)"], "places": ["United States of America", "North Carolina", "North Carolina", "North Carolina", "North Carolina"], "character_names": ["Jamie Fraser", "Brianna Randall", "Roger MacKenzie", "Jeremiah MacKenzie", "Fergus Fraser", "Marsali Fraser", "Germain Fraser", "Malva Christie", "Tom Christie", "Lord John Grey", "Jocasta Cameron", "Duncan Innes", "Claire Randall Fraser", "Stephen Bonnet", "Young Ian Murray", "William Ransom", "Lizzie Wemyss", "Jo Beardsley", "Kezzie Beardsley"], "language": "English", "publish_date": "2005-09-27 00:00:00", "ISBN": "0385324162"},
{"url": "https://www.goodreads.com/book/show/167069.Drums_Along_the_Mohawk", "num_ratings": "942", "num_reviews": "95", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Historical", "American Revolution", "American Revolutionary War", "North American Hi...", "American History", "Adventure"], "title": "Drums Along the Mohawk", "description": ["The seventy-fifth anniversary of the publication of Drums along the Mohawk reminds us not only that Edmonds’s masterpiece is the best historical novel about Upstate New York since James Fenimore Cooper but also that it was number one on the best-seller list until overtaken by Gone With the Wind.", "This is the story of the forgotten pioneers of the Mohawk Valley during the Rev", "The seventy-fifth anniversary of the publication of Drums along the Mohawk reminds us not only that Edmonds’s masterpiece is the best historical novel about Upstate New York since James Fenimore Cooper but also that it was number one on the best-seller list until overtaken by Gone With the Wind.", "This is the story of the forgotten pioneers of the Mohawk Valley during the Revolutionary War. Here Gilbert Martin and his young wife struggled and lived and hoped. Combating hardships almost too great to endure, they helped give to America a legend that still stirs the heart. In the midst of love and hate, life and death, danger and disaster, they stuck to the acres that were theirs and fought a war without ever quite understanding it. Drums along the Mohawk has been an American classic since its original publication in 1936. This Syracuse University Press edition reproduces the book in its entirety. ", "\"The best work of its kind. Throbs with life upon a hostile frontier ... doubly thrilling as Mr. Edmonds sets it down, touched with local color, lively with dialogue, bright with suspense\". -- The New York Times"], "author": "Walter D. Edmonds", "num_pages": "608", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-01 00:00:00", "ISBN": "0815604572"},
{"url": "https://www.goodreads.com/book/show/7764881-trail-boss", "num_ratings": "170", "num_reviews": "7", "avg_ratings": 4.31, "genres": ["Westerns", "Novels"], "title": "Trail Boss", "description": ["Since Thad Toon had put the \"injun sign\" in Ben Holland's spread, no cowhand would ride with the Rocking H's trail drive. Just to make sure, a rough-cut gang of killers had been hired to keep it that way. Then Dusty Fog and the Floating Outfit rode into Granite City, and Dusty decided to take up the dare...and teach the Double T what Texas trail-bossing was all about!"], "author": "J.T. Edson", "awards": [], "places": [], "character_names": ["Dusty Fog", "Ysabel Kid", "Mark Counter"], "language": "English", "publish_date": "1980-11-01 00:00:00", "ISBN": "0425046249"},
{"url": "https://www.goodreads.com/book/show/15780137-voices-whisper", "num_ratings": "19", "num_reviews": "2", "avg_ratings": 3.95, "genres": ["Historical", "Romance", "Historical", "Historical Fiction"], "title": "Voices Whisper (Voices, #2)", "description": ["David Graham, Elisabeth Hale, and Liam Brock crossed the Atlantic on a tumultuous, life-changing voyage seven years past. Thrown together by chance, bound by choice—their story continues.", "David and Elisabeth begin to build a life together in 1790 Philadelphia, defying both her father and the old standard of marrying within one's class. While David is caught up in documentin", "David Graham, Elisabeth Hale, and Liam Brock crossed the Atlantic on a tumultuous, life-changing voyage seven years past. Thrown together by chance, bound by choice—their story continues.", "David and Elisabeth begin to build a life together in 1790 Philadelphia, defying both her father and the old standard of marrying within one's class. While David is caught up in documenting the politics of post-Revolutionary America, Elisabeth takes a quiet, yet active role in the community, aiding women less fortunate than herself.", "Liam, on the other hand, continues to dally with a variety of Philadelphia's young women, including the insatiable and soulless Victoria Billings. When Elisabeth's attractive, intelligent, but tenuously married friend Rhiannon Ross arrives from England, she grabs Liam’s interest from the outset, in spite of the fact he sees her as yet another reminder of his limitations. His poor, rural Scottish roots and questionable parentage negate the possibility of a professional legal career in his mind—not to mention the love of a fine, yet fiery and independent woman like Rhiannon Ross.", "Voices Whisper, the second book in the Voices series, follows Liam’s struggles to make the most of this new country in which a man can create his destiny, regardless of his roots."], "author": "Linda Lee Graham", "num_pages": "367", "awards": [], "places": ["Philadelphia, Pennsylvania"], "character_names": [], "language": "English", "publish_date": "2012-07-30 00:00:00"},
{"url": "https://www.goodreads.com/book/show/629616.This_Side_of_Heaven", "num_ratings": "841", "num_reviews": "39", "avg_ratings": 3.88, "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Fiction"], "title": "This Side of Heaven", "description": ["Defiantly beautiful, Caroline Wetherby stepped ashore in a land so wild and fierce, she trembled.  She had come seeking refuge with the last of her family, but her sister was dead.  Waiting to greet her were pious Pilgrims, warring Indians, howling wolves, a boisterous household of men and boys...and ", ", her rugged, unwelcoming brother-in-law, Matt Mathieson.  Caroline wa", "Defiantly beautiful, Caroline Wetherby stepped ashore in a land so wild and fierce, she trembled.  She had come seeking refuge with the last of her family, but her sister was dead.  Waiting to greet her were pious Pilgrims, warring Indians, howling wolves, a boisterous household of men and boys...and ", ", her rugged, unwelcoming brother-in-law, Matt Mathieson.  Caroline wanted to hate Matt as she hated all men.", "After her father's death, she'd been eager to escape England.  But as daughter of a gambler and a gypsy, her flamboyant ways and healing skills tempted disaster in the sanctimonious Connecticut Colony.  And putting herself in the hands of a big, handsome stranger tempted something far more dangerous--emotions she couldn't resist, kisses she couldn't forget, and a future that could bring ruin...or a journey to heaven on earth in his arms."], "author": "Karen Robards", "num_pages": "442", "awards": [], "places": ["Saybrook, Connecticut"], "character_names": ["Caroline Wetherby", "Matt Mathieson"], "language": "English", "publish_date": "1991-07-01 00:00:00", "ISBN": "0440208270"},
{"url": "https://www.goodreads.com/book/show/17157640-the-last-runaway", "num_ratings": "26,202", "num_reviews": "3,616", "avg_ratings": 3.79, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Adult Fiction"], "title": "The Last Runaway", "description": ["When modest Quaker Honor Bright sails from Bristol with her sister, she is fleeing heartache for a new life in America, far from home. But tragedy leaves her alone and vulnerable, torn between two worlds and dependent on the kindness of strangers.", "Life in 1850s Ohio is precarious and unsentimental. The sun is too hot, the thunderstorms too violent, the snow too deep. The ro", "When modest Quaker Honor Bright sails from Bristol with her sister, she is fleeing heartache for a new life in America, far from home. But tragedy leaves her alone and vulnerable, torn between two worlds and dependent on the kindness of strangers.", "Life in 1850s Ohio is precarious and unsentimental. The sun is too hot, the thunderstorms too violent, the snow too deep. The roads are spattered with mud and spit. The woods are home to skunks and porcupines and raccoons. They also shelter slaves escaping north to freedom.", "Should Honor hide runaways from the ruthless men who hunt them down? The Quaker community she has joined may oppose slavery in principle, but does it have the courage to help her defy the law? As she struggles to find her place and her voice, Honor must decide what she is willing to risk for her beliefs.", "Set in the tangled forests and sunlit cornfields of Ohio, Tracy Chevalier′s vivid novel is the story of bad men and spirited women, surprising marriages and unlikely friendships, and the remarkable power of defiance."], "author": "Tracy Chevalier", "num_pages": "343", "awards": [], "places": ["Faithwell, Ohio"], "character_names": ["Honor Bright Haymaker", "Donovan Mills", "Mrs. Reed", "Belle Mills", "Jack Haymaker"], "language": "English", "publish_date": "2013-03-14 00:00:00", "ISBN": "0007350341"},
{"url": "https://www.goodreads.com/book/show/17375931-trail-of-hope", "num_ratings": "17", "num_reviews": "4", "avg_ratings": 4.0, "genres": ["Historical"], "title": "Trail of Hope", "author": "Heidi Vanlandingham", "num_pages": "86", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2012-12-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/18581191-puritan-witch", "num_ratings": "97", "num_reviews": "47", "avg_ratings": 4.07, "genres": ["Historical", "Historical Fiction", "Paranormal", "Witches", "Historical", "Fiction"], "title": "Puritan Witch: The Redemption of Rebecca Eames", "description": ["On a cold night in 1692, two young girls are caught up in the divining games of a slave woman—and then begin to act very strangely when the game goes wrong. Suddenly, Salem Village is turned upside down as everyone fears that witches may be involved.", "Six months later, as news of the girls’ strange behavior becomes known, fear and suspicion overwhelm a nearby farming communi", "On a cold night in 1692, two young girls are caught up in the divining games of a slave woman—and then begin to act very strangely when the game goes wrong. Suddenly, Salem Village is turned upside down as everyone fears that witches may be involved.", "Six months later, as news of the girls’ strange behavior becomes known, fear and suspicion overwhelm a nearby farming community, pitting neighbors against neighbors and turning friends into enemies. When Rebecca Eames makes one careless utterance during a verbal attack on her family, she is falsely accused of witchcraft. ", "After her fate is decided by three magistrates, Rebecca must endure a prison sentence during which she and her fellow captives have no choice but to valiantly struggle to find humanity and camaraderie among dire conditions.", "In this novel based on a true story, a woman wrongly imprisoned during the seventeenth-century witchcraft trials comes full circle where she must determine if she can somehow resume her life, despite all she has endured."], "author": "Peni Jo Renner", "num_pages": "242", "awards": ["Independent Publisher Book Award (IPPY)", "eLit Book Award for Historical Fiction - Bronze (2015)"], "places": [], "character_names": [], "language": "English", "publish_date": "2013-09-16 00:00:00", "ISBN": "1491705930"},
{"url": "https://www.goodreads.com/book/show/25146386-the-assiduous-quest-of-tobias-hopkins", "num_ratings": "92", "num_reviews": "71", "avg_ratings": 4.24, "genres": ["Thriller", "Mystery", "Suspense", "Fiction"], "title": "The Assiduous Quest of Tobias Hopkins: The Complete Novel", "description": ["The Assiduous Quest of Tobias Hopkins - The Complete novel ", "The first volume in the Tobias Hopkins series. ", "It is October in the year 1675. New England trader, Tobias Hopkins, arrives in Jamaica to discover the truth about his missing father. It transpires that, not only has the man been dead for six years, but he has left Toby with a half-brother and the clue to an inherita", "The Assiduous Quest of Tobias Hopkins - The Complete novel ", "The first volume in the Tobias Hopkins series. ", "It is October in the year 1675. New England trader, Tobias Hopkins, arrives in Jamaica to discover the truth about his missing father. It transpires that, not only has the man been dead for six years, but he has left Toby with a half-brother and the clue to an inheritance which promises to change the course of their lives. However, Toby's inquiries have attracted the attention of others who will stop at nothing to achieve their aims. Will the cryptic message written by his father lead him to a promised fortune, or will it lead him into the hands of those who aim to destroy him? ", "Haunted by nightmares from his past, Toby continues with his quest. But who can he trust? His faithful associate, John? the astute businesswoman Elizabeth? or Magdalena, mother of his half-brother Eduardo? Some of those around him are not what they seem to be, and it soon becomes clear that Toby and those closest to him are in imminent danger. ", "His quest leads him to the Island of Nevis where he reaps the fruits of his search. All appears well until he travels to Virginia. It is only at this point that Tobias Hopkins is forced to face the consequence of his actions."], "author": "James Faro", "num_pages": "281", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-07 00:00:00"},
{"url": "https://www.goodreads.com/book/show/11547870-the-messenger", "num_ratings": "2,093", "num_reviews": "204", "avg_ratings": 3.95, "genres": ["Historical", "Historical Fiction", "Christian Fiction", "Christian", "Romance", "Historical", "Fiction"], "title": "The Messenger", "description": ["Hannah Sunderland felt content in her embrace of the Quaker faith..until her twin brother ran off and joined the army and ended up captured and in jail. Suddenly Hannah's world turns on end. She longs to bring her brother some measure of comfort in the squalid, frigid prison where he remains. But the Quakers beli", "Hannah Sunderland felt content in her embrace of the Quaker faith..until her twin brother ran off and joined the army and ended up captured and in jail. Suddenly Hannah's world turns on end. She longs to bring her brother some measure of comfort in the squalid, frigid prison where he remains. But the Quakers believe they are not to take sides, not to take up arms. Can she sit by and do nothing while he suffers? ", "Jeremiah Jones has an enormous task before him. Responsibility for a spy ring is now his, and he desperately needs access to the men in prison, whom they are seeking to free. A possible solution is to garner a pass for Hannah. But while she is fine to the eye, she holds only disdain for him--and agreeing would mean disobeying those she loves and abandoning a bedrock of her faith. ", "With skill and sensitivity, Mitchell tells a story of two unlikely heroes seeking God's voice, finding the courage to act, and discovering the powerful embrace of love."], "author": "Siri Mitchell", "num_pages": "384", "awards": [], "places": ["Philadelphia, Pennsylvania"], "character_names": [], "language": "English", "publish_date": "2012-03-01 00:00:00", "ISBN": "0764207962"},
{"url": "https://www.goodreads.com/book/show/36295805-the-petticoat-letters", "num_ratings": "20", "num_reviews": "10", "avg_ratings": 4.5, "genres": ["Military History", "American Revolution", "Historical", "Historical Fiction", "War"], "title": "The Petticoat Letters (Rebels of the Revolution)", "description": ["At the outbreak of the Revolutionary war, Nora Bishop’s home is burned to the ground—along with her dreams, plans and all her family members except one. At 20-years-old and still unmarried, she moves to Manhattan to live with her Loyalist uncle, hoping to find her brother who has joined the Patriot cause against her late family’s wishes. But, battle breaks out and she find", "At the outbreak of the Revolutionary war, Nora Bishop’s home is burned to the ground—along with her dreams, plans and all her family members except one. At 20-years-old and still unmarried, she moves to Manhattan to live with her Loyalist uncle, hoping to find her brother who has joined the Patriot cause against her late family’s wishes. But, battle breaks out and she finds herself at the mercy of one American ranger, Alex Foster, who is the only person in a position to bring her to safety.", "Her growing feelings toward Alex and his passion for freedom help her reevaluate her stance on the case for independence and makes her question her loyalties further. When she is asked to spy for the rebels, she agrees. But can she partake in the act of treason and do what is asked of her when the sadistic Captain William Roth seems to watch her every move and threatens the life of her brother who has been captured? And how can she grow closer to Alex when the war threatens to tear them apart?"], "author": "Kelly Lyman", "num_pages": "346", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-11-06 00:00:00"},
{"url": "https://www.goodreads.com/book/show/26196357-billy-gogan-american", "num_ratings": "40", "num_reviews": "14", "avg_ratings": 4.47, "genres": ["Fiction"], "title": "Billy Gogan, American: A Novel", "description": ["The Billy Gogan story is a fictional memoir told by an old Army general of his adventures as a young man. Billy Gogan, American, opens with recently orphaned Billy Gogan fleeing Ireland on the eve of the Great Hunger — either because he is the son of a dangerous revolutionary, or because his cousin doesn't trust him around his daughter. Billy and his traveling companions,", "The Billy Gogan story is a fictional memoir told by an old Army general of his adventures as a young man. Billy Gogan, American, opens with recently orphaned Billy Gogan fleeing Ireland on the eve of the Great Hunger — either because he is the son of a dangerous revolutionary, or because his cousin doesn't trust him around his daughter. Billy and his traveling companions, an Irish peasant named Máire and her young daughter Fíona, endure the harsh passage to Gotham but get separated as they debark. Billy searches for them in the dangerous Five Points, ground zero in the collision of Americans, ex-slaves, and Irish refugees.", "Here, Billy completes his education. Already able to declaim Cicero and construe Aristotle, he learns voting fraud from Bill Tweed, the future head of Tammany Hall. Charlie Backwell teaches Billy the numbers game. Finally, Brannagh O’Marran, the beautiful mulatto daughter of the Irish madam of Gotham’s finest knocking shop, teaches him about love.", "Billy eventually finds Máire and Fíona, and the three of them plan their future together. But that future is taken in a cruel stroke, and Billy must flee for his life."], "author": "Roger Higgins", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2016-05-17 00:00:00", "ISBN": "1609521153"},
{"url": "https://www.goodreads.com/book/show/36652948-whispers-on-the-river", "num_ratings": "6", "num_reviews": "2", "avg_ratings": 4.5, "genres": ["Historical", "Historical Fiction"], "title": "Whispers on the River: A Whisper Falls Novella", "description": ["Forced to leave her childhood home, Abigail Clarke flees to the royal capital of North Carolina. She soon finds that there are few jobs for a girl who’s only been trained to be a gentleman's wife or a healer. Starting over as Abby, she lies her way into a position as a maid in the royal governor’s household.", "But her healing skills–and her magical talent for ", "–have dra", "Forced to leave her childhood home, Abigail Clarke flees to the royal capital of North Carolina. She soon finds that there are few jobs for a girl who’s only been trained to be a gentleman's wife or a healer. Starting over as Abby, she lies her way into a position as a maid in the royal governor’s household.", "But her healing skills–and her magical talent for ", "–have drawn the attention of the governor’s stepson. Nathaniel Eton is charming, mysterious–and completely forbidden to a servant. Yet Abby can’t resist her fascination with him…until his secrets threaten to put the fragile, new life she’s created into jeopardy."], "author": "Elizabeth Langston", "num_pages": "152", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2017-12-19 00:00:00"},
{"url": "https://www.goodreads.com/book/show/76462.Roanoke", "num_ratings": "1,428", "num_reviews": "144", "avg_ratings": 3.9, "genres": ["Historical", "Historical Fiction", "Christian Fiction", "Christian", "Historical", "Fiction", "Romance"], "title": "Roanoke: The Lost Colony", "description": ["Series premiere special price! \"Roanoke: The Lost Colony\" recounts the life of Jocelyn Colman, whose faith is tested and refined when she follows the husband she barely knows to an unexplored land. Jocelyn struggles with her husband's bitterness and guilt until God's forgiveness becomes a lifesaving reality."], "author": "Angela Elwell Hunt", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1996-02-27 00:00:00", "ISBN": "0842320121"},
{"url": "https://www.goodreads.com/book/show/16005251-keowee-valley", "num_ratings": "168", "num_reviews": "43", "avg_ratings": 3.84, "genres": ["Historical", "Historical Fiction", "Romance", "Historical Romance", "Historical", "Romance"], "title": "Keowee Valley", "description": ["Spring, 1768. The Southern frontier is a treacherous wilderness inhabited by the powerful Cherokee people. In Charlestown, 25 year-old Quincy MacFadden receives news from beyond the grave: her cousin, a man she’d believed long dead, is alive—held captive by the Shawnee Indians. Unmarried, bookish, and plagued by visions of the future, Quinn is a woman out of place… and thi", "Spring, 1768. The Southern frontier is a treacherous wilderness inhabited by the powerful Cherokee people. In Charlestown, 25 year-old Quincy MacFadden receives news from beyond the grave: her cousin, a man she’d believed long dead, is alive—held captive by the Shawnee Indians. Unmarried, bookish, and plagued by visions of the future, Quinn is a woman out of place… and this is the opportunity for which she’s been longing.", "Determined to save two lives, her cousin’s and her own, Quinn travels the rugged Cherokee Path into the South Carolina Blue Ridge. Defying her furious grandfather and colonial law, she barters for leverage against the Shawnee with a notorious Cherokee chief—and begins building a daring new home in the Keowee River Valley, a fiercely beautiful place.", "But in order to rescue her cousin, Quinn must trust an enigmatic half-Cherokee tracker whose loyalties may lie elsewhere. As translator to the British army, Jack Wolf walks a perilous line between a King he hates and a homeland he loves.", "Together they journey across the Appalachian Mountains and into the heart of Cherokee country. They encounter wily trappers, warring Indians, British soldiers, desperate settlers, and a contested backcountry on the brink of changing forever.", "When Jack is ordered to negotiate for Indian loyalty in the Revolution to come, the pair must decide: obey the Crown, or commit treason…."], "author": "Katherine Scott Crawford", "num_pages": "354", "awards": ["HOLT Medallion by Virginia Romance Writers Nominee for Historical (2013)"], "places": [], "character_names": [], "language": "English", "publish_date": "2012-09-27 00:00:00", "ISBN": "1611941725"},
{"url": "https://www.goodreads.com/book/show/28397359-the-savage-apostle", "num_ratings": "3", "num_reviews": "2", "avg_ratings": 5.0, "genres": ["Fiction"], "title": "The Savage Apostle", "description": ["In 1675, when the body of Christian Indian John Sassamon is dragged up from beneath the ice of Assowampsett Pond, speculation is rife as to who murdered the man. Sassamon was a man caught between two worlds, that of his Wamponaug ancestry and that of his adopted English society; people on both sides could find cause to kill him.", "John Eliot, missionary and founder of the Pra", "In 1675, when the body of Christian Indian John Sassamon is dragged up from beneath the ice of Assowampsett Pond, speculation is rife as to who murdered the man. Sassamon was a man caught between two worlds, that of his Wamponaug ancestry and that of his adopted English society; people on both sides could find cause to kill him.", "John Eliot, missionary and founder of the Praying Villages where Christianized Indians lived among the colonists of the Plymouth and Massachusetts Bay colonies is particularly grieved by his protEgE Sassamon's death. Eliot had converted the young Sassamon, educated him at Harvard, and trusted him as missionary to the Indians, especially to the Pokanoket and their sachem Metacom. Eliot knows that converting Metacom and his people could be the key to lasting peace between the colonists and the Indians, a fifty-year peace that is dangerously unraveling.", "Metacom finds his authority and sovereignty once again undermined by the Plymouth authorities when three of his closest advisors are arrested for the murder of Sassamon. Pressured by his people to retaliate, but knowing the disastrous consequences war with the English would bring, Metacom struggles to find a way out, just as Eliot tries to keep the two sides from falling into a war that could only end in ruin for English and Indians alike.", "Thoroughly grounded in years of research, The Savage Apostle, is an exciting and colorful account of the events leading up to King Philip's War, the costliest war per capita ever fought on American soil. Moreover, it is an exemplary lesson for today's world where divisiveness and conflict are so often brought about by racial and religious intolerance.", "The author has included a helpful Discussion Guide in the book for teachers and book clubs."], "author": "John B. Kachuba", "num_pages": "230", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2015-12-23 00:00:00", "ISBN": "1620066661"},
{"url": "https://www.goodreads.com/book/show/30041195-scattered-seeds", "num_ratings": "26", "num_reviews": "12", "avg_ratings": 4.5, "genres": [], "title": "Scattered Seeds", "description": ["In 18th century Ireland, drought forces Edward and Henry McConnell to assume false names and escape to the New World with the one valuable thing they still own–their ancestor’s gold torc.", "Edward must leave love behind. Henry finds it in the foul belly of ", ", only to lose it when an elusive trader purchases his sweetheart’s indenture.", "With nothing but their", "In 18th century Ireland, drought forces Edward and Henry McConnell to assume false names and escape to the New World with the one valuable thing they still own–their ancestor’s gold torc.", "Edward must leave love behind. Henry finds it in the foul belly of ", ", only to lose it when an elusive trader purchases his sweetheart’s indenture.", "With nothing but their broken hearts, a lame ox, and a torc they cannot sell without invoking a centuries-old curse, they head for the backcountry, where all hope rests upon getting their seed in the ground. Under constant threat of Indian attack, they endure crushing toil and hardship. By summer, they have wheat for their reward, and unexpected news of Henry’s lost love. They emerge from the wilderness and follow her trail to Philadelphia, unaware her cruel new master awaits them there, his heart set on obtaining the priceless torc they protect."], "author": "Julie Doherty", "num_pages": "339", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-04-27 00:00:00"},
{"url": "https://www.goodreads.com/book/show/24985673-homecoming", "num_ratings": "18", "num_reviews": "7", "avg_ratings": 4.61, "genres": ["Adventure", "Pirates", "Adventure"], "title": "Homecoming: The Assiduous Quest of Tobias Hopkins - Part One", "description": ["The Assiduous Quest of Tobias Hopkins", "It is October in the year 1675. New England trader, Tobias Hopkins, arrives in Jamaica to discover the truth about his missing father. It transpires that, not only has the man been dead for six years, but he has left Toby with a half-brother and the clue to an inheritance which promises to change the course of their lives. However, Toby", "The Assiduous Quest of Tobias Hopkins", "It is October in the year 1675. New England trader, Tobias Hopkins, arrives in Jamaica to discover the truth about his missing father. It transpires that, not only has the man been dead for six years, but he has left Toby with a half-brother and the clue to an inheritance which promises to change the course of their lives. However, Toby's inquiries have attracted the attention of others who will stop at nothing to achieve their aims. ", "Part One: Homecoming ", "Toby is determined to uncover the truth about his father. But who can he trust? Haunted by nightmares from his past, he continues with his quest, unaware his actions are being followed closely by others who will stop at nothing to get what they want. New disclosures concerning his father's past are revealed and a legacy is in the offing. Will the cryptic message written by his father lead Toby to a promised fortune, or will it lead him into the hands of those who aim to destroy him?", "PLEASE NOTE: This book comprises the first 10 chapters of The Assiduous Quest: The complete novel."], "author": "James Faro", "num_pages": "150", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-02-10 00:00:00"},
{"url": "https://www.goodreads.com/book/show/1936475.Bone_Rattler", "num_ratings": "1,538", "num_reviews": "194", "avg_ratings": 3.64, "genres": ["Historical", "Historical Fiction", "Mystery", "Fiction", "Historical", "Mystery", "Historical Mystery"], "title": "Bone Rattler", "description": ["Aboard a British convict ship bound for the New World, Duncan McCallum witnesses a series of murders and seeming suicides among his fellow Scottish prisoners that thrusts him into the bloody maw of the French and Indian War. ", "As the only man aboard with any medical training, Duncan is ordered to assemble evidence to hold another prisoner accountable for the deaths - or face", "Aboard a British convict ship bound for the New World, Duncan McCallum witnesses a series of murders and seeming suicides among his fellow Scottish prisoners that thrusts him into the bloody maw of the French and Indian War. ", "As the only man aboard with any medical training, Duncan is ordered to assemble evidence to hold another prisoner accountable for the deaths - or face punishment that will mean his own death. His conclusions suggest that the wave of violence is somehow linked to the \"savages\" of the American wilderness. Duncan's suspicions that the prison company is to be sacrificed in the war seem to be confirmed when he learns that they are all indentured to Lord Ramsey's estate in the uncharted New York woodlands, a Heart of Darkness where multiple warring factions are engaged in physical, psychological, and spiritual battle. ", "Following a strange trail of clues that seem half Iroquois and half Highland Scot, mesmerized by the Lord Ramsey's beautiful daughter, and frequently defying death in a dangerous wilderness populated by grizzled European settlers, mysterious scalping parties, and Indian sorcerers, Duncan McCallum, exiled chief of his near-extinct clan, finds the source of all evil at the site of an Indian massacre."], "author": "Eliot Pattison", "num_pages": "456", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-12-01 00:00:00", "ISBN": "1593761856"},
{"url": "https://www.goodreads.com/book/show/5777145-love-s-pursuit", "num_ratings": "1,190", "num_reviews": "155", "avg_ratings": 3.76, "genres": ["Christian Fiction", "Historical", "Historical Fiction", "Christian", "Romance", "Historical", "Fiction"], "title": "Love's Pursuit", "description": ["In the small Puritan community of Stoneybrooke, Massachusetts, Susannah Phillips stands out both for her character and beauty. She wants only a simple life but soon finds herself pursued by the town's wealthiest bachelor and by a roguish military captain sent to protect them. One is not what he seems and one is more than he seems. ", "In trying to discover true love's path, Su", "In the small Puritan community of Stoneybrooke, Massachusetts, Susannah Phillips stands out both for her character and beauty. She wants only a simple life but soon finds herself pursued by the town's wealthiest bachelor and by a roguish military captain sent to protect them. One is not what he seems and one is more than he seems. ", "In trying to discover true love's path, Susannah is helped by the most unlikely of allies, a wounded woman who lives invisible and ignored in their town. As the depth, passion, and sacrifice of love is revealed to Susannah, she begins to question the rules and regulations of her childhood faith. In a community where grace is unknown, what price will she pay for embracing love?"], "author": "Siri Mitchell", "num_pages": "329", "awards": [], "places": ["Massachusetts"], "character_names": [], "language": "English", "publish_date": "2009-06-01 00:00:00", "ISBN": "0764204327"},
{"url": "https://www.goodreads.com/book/show/24512890-letters-to-kezia", "num_ratings": "30", "num_reviews": "17", "avg_ratings": 4.27, "genres": ["Historical", "Historical Fiction"], "title": "Letters to Kezia", "description": ["It is 1693 in Hereford, Connecticut, when Mary Case, the spinster daughter of a Puritan minister, finds herself hopelessly smitten by the roguish thief, Daniel Eames. Betrothed to a man she does not like or love, she is soon compelled to help Daniel escape from jail. Suddenly, she finds herself on the run, not only accused of being Daniel’s accomplice, but also of murder.", "T", "It is 1693 in Hereford, Connecticut, when Mary Case, the spinster daughter of a Puritan minister, finds herself hopelessly smitten by the roguish thief, Daniel Eames. Betrothed to a man she does not like or love, she is soon compelled to help Daniel escape from jail. Suddenly, she finds herself on the run, not only accused of being Daniel’s accomplice, but also of murder.", "The fugitive pair soon finds solace-and a mutual attraction-among the escapee’s Algonquin friends until two men from Daniel’s dark past hunt them down. After Mary is captured and returned home to await trial, a tragedy takes the life of her younger sister, revealing a dark secret Mary’s father has kept for months. But just as Mary learns she is pregnant, she makes a horrifying discovery about Daniel that changes everything and prompts her to develop an unlikely bond with his mother, Rebecca, who soon saves Mary from a shocking fate. It is not until years later that her daughter, Kezia, finally learns the truth about her biological father and family.", "Letters to Kezia shares a courageous woman’s journey through a Puritan life and beyond as she struggles with adversity and betrayal, and discovers that loyalty can sometimes mean the difference between life and death."], "author": "Peni Jo Renner", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-01-14 00:00:00", "ISBN": "1491755369"},
{"url": "https://www.goodreads.com/book/show/8041574-lusty-wind-for-carolina", "num_ratings": "45", "num_reviews": "7", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Fiction", "Literature", "18th Century", "Historical", "Romance", "Clean Romance"], "title": "Lusty Wind for Carolina", "description": ["The journey from New Providence to the Cape Fear was a matter of weeks. Becalmed for days, followed by contrary winds, they made slow progress up the Florida coast, keeping well out to avoid Spanish ships of war. ", "Between Charles Town, on the Ashley, and the shoals that marked the tortuous entrance to Cape Fear River, they ran into the fringe of a hurricane, which blew them", "The journey from New Providence to the Cape Fear was a matter of weeks. Becalmed for days, followed by contrary winds, they made slow progress up the Florida coast, keeping well out to avoid Spanish ships of war. ", "Between Charles Town, on the Ashley, and the shoals that marked the tortuous entrance to Cape Fear River, they ran into the fringe of a hurricane, which blew them back almost to the Charles Town harbour. ", "Then one morning at sunrise, Mister Bragg manoeuvred the Delicia over Frying Pan Shoals into the channel. ", "The faint light of soft dawn lined the eastern horizon when Gabrielle awoke on that long-dreamed-of morning as the Delicia entered the river and found safe harbour behind the shoals and the protecting Banks. She got up quietly from the little cot behind the screen in her mother's cabin, where she had slept since the ship sailed from Nassau. She dressed hurriedly in the dark, moving softly so that she would not disturb her mother. Even though she did not waken, she would be restless and talk in her sleep of her old home in France. Celestine, sleeping on the floor on a pallet at the side of Madam Fountaine's berth, snored intermittently, her mouth half open in her full moon-face. ", "Gabrielle closed the cabin door and made her way up the companionway to the deck. She was eager to have her first glimpse of the river and the land at sunrise. She wanted to see the sun bring the river banks out of the deep shadows and flood the river with daylight. There was a portent in seeing a new land at sunrise. ", "Early as it was, there were others before her—dark shadows at the rail, facing shoreward, trying to pierce the gloom, waiting for the massed shadows to dissolve under the first light of the new day. A crimson glow through the dark sky marked the horizon. In a moment the sun would rise and she would see what her inner eye had long envisaged; the new world of the Carolinas. The sound of myriad song birds came from the near-by shore. But there was no vibrant cock's crow to mark a civilized world, only the song of the forest and wild places. ", "The muffled sound of voices and the creaking of the anchor chain sounded far away. She peered down the deck, only to find her vision blunted by a grey mist. She realized then that a low-flying fog shrouded the river and the shore. She felt a vague unrest, the weight of disappointment. She had always had the vision of a sun-drenched shore line, pointing the way to the forest. Fog belonged to the old world of sorrow. She must have spoken aloud in her disappointment, for a figure detached itself from the shadows and stepped to her side. From the height and carriage she recognized Roger Mainwairing."], "author": "Inglis Fletcher", "num_pages": "562", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1970-12-01 00:00:00", "ISBN": "0553256572"},
{"url": "https://www.goodreads.com/book/show/23171890-sophronia-l", "num_ratings": "16", "num_reviews": "7", "avg_ratings": 4.5, "genres": ["Historical", "Historical Fiction", "Historical", "Fiction", "Drama"], "title": "Sophronia L.", "description": ["Sophronia Lambert, a schoolteacher on the island of Martha's Vineyard, lives a quiet life; that is until Nantucket whaling captain James Folger comes ashore. Realizing he is the man who killed her deaf brother, she decides to pursue vengeance - first at home, then at sea-sailing to the far side of the world as his bride. As she grapples with madness and morality, Sophronia", "Sophronia Lambert, a schoolteacher on the island of Martha's Vineyard, lives a quiet life; that is until Nantucket whaling captain James Folger comes ashore. Realizing he is the man who killed her deaf brother, she decides to pursue vengeance - first at home, then at sea-sailing to the far side of the world as his bride. As she grapples with madness and morality, Sophronia's quest mirrors that of her island community: to find a way forward amidst the pressures of a brutal industry, a nation mired in Civil War, and a past darker than the ocean's abyss."], "author": "Tim Bridwell", "num_pages": "372", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2014-12-01 00:00:00", "ISBN": "1610191056"},
{"url": "https://www.goodreads.com/book/show/17934498-my-name-is-resolute", "num_ratings": "4,366", "num_reviews": "876", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance"], "title": "My Name Is Resolute", "description": ["The year is 1729, and Resolute Talbot and her siblings are captured by pirates, taken from their family in Jamaica, and brought to the New World. Resolute and her sister are sold into slavery in colonial New England and taught the trade of spinning and weaving. When Resolute finds herself alone in Lexington, Massachusetts, she struggles to find her way in a society that is", "The year is 1729, and Resolute Talbot and her siblings are captured by pirates, taken from their family in Jamaica, and brought to the New World. Resolute and her sister are sold into slavery in colonial New England and taught the trade of spinning and weaving. When Resolute finds herself alone in Lexington, Massachusetts, she struggles to find her way in a society that is quick to judge a young woman without a family. As the seeds of rebellion against England grow, Resolute is torn between following the rules and breaking free. Resolute’s talent at the loom places her at the center of an incredible web of secrecy that helped drive the American Revolution."], "author": "Nancy E. Turner", "num_pages": "608", "awards": ["Goodreads Choice Award Nominee for Historical Fiction (2014)"], "places": [], "character_names": [], "language": "English", "publish_date": "2014-02-18 00:00:00", "ISBN": "1250036593"},
{"url": "https://www.goodreads.com/book/show/800869.Accordion_Crimes", "num_ratings": "5,961", "num_reviews": "509", "avg_ratings": 3.59, "genres": ["Fiction", "Historical", "Historical Fiction", "Short Stories", "Abandoned", "Literature", "Music", "Literature", "American", "Novels", "Historical", "Adult"], "title": "Accordion Crimes", "description": ["Divided into nine sections and spanning a century and a continent, this novel illuminates the lives of the founders of a nation, descendants of Mexicans, Poles, Germans, the Irish, Scots and Franco-Canadians. Through the music of the accordion they express their fantasies, sorrows and exuberance."], "author": "Annie Proulx", "num_pages": "381", "awards": ["Orange Prize Nominee for Fiction Shortlist (1997)"], "places": [], "character_names": [], "language": "English", "publish_date": "1996-12-31 00:00:00", "ISBN": "0684195488"},
{"url": "https://www.goodreads.com/book/show/264778.Sacajawea", "num_ratings": "14,420", "num_reviews": "422", "avg_ratings": 4.24, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "North American Hi...", "American History", "Westerns", "Adventure", "Native Americans", "Classics", "The United States Of America", "Literature", "19th Century"], "title": "Sacajawea", "description": ["Clad ln a doeskin, alone and unafraid, she stood straight and proud before the onrushlng Forces of America’s destiny: Sacajawea. child of a Shoshoni chief, lone woman on Lewis and Clark‘s historic trek-beautiful spear of a dying nation.", "She knew many men, walked many miles. From the whispering prairies, across the Great Divide to the crystal-capped Rockies and on to the eme", "Clad ln a doeskin, alone and unafraid, she stood straight and proud before the onrushlng Forces of America’s destiny: Sacajawea. child of a Shoshoni chief, lone woman on Lewis and Clark‘s historic trek-beautiful spear of a dying nation.", "She knew many men, walked many miles. From the whispering prairies, across the Great Divide to the crystal-capped Rockies and on to the emerald promise of the Pacific Northwest, her story overflows with emotion and action ripped from the bursting fabric of a raw new land. ", "Ten years In the Writing, SACAJAWEA unfolds an immense canvas of people and events, and captures the eternal longings of a woman who always yearned for one great passion-and always it lay beyond the next mountain."], "author": "Anna Lee Waldo", "num_pages": "1424", "awards": [], "places": ["Carthage, United States"], "character_names": [], "language": "English", "publish_date": "1984-07-01 00:00:00", "ISBN": "0380842939"},
{"url": "https://www.goodreads.com/book/show/12999143-the-orphanmaster", "num_ratings": "2,259", "num_reviews": "485", "avg_ratings": 3.3, "genres": ["Historical", "Historical Fiction", "Mystery", "Fiction", "Historical", "Literature", "17th Century", "Abandoned", "Mystery", "Historical Mystery"], "title": "The Orphanmaster", "description": ["From a debut novelist, a gripping historical thriller and rousing love story set in seventeenth-century Manhattan", "It’s 1663 in the tiny, hardscrabble Dutch colony of New Amsterdam, now present-day southern Manhattan. Orphan children are going missing, and among those looking into the mysterious state of affairs are a quick-witted twenty-two-year-old trader, Blandine von Cou", "From a debut novelist, a gripping historical thriller and rousing love story set in seventeenth-century Manhattan", "It’s 1663 in the tiny, hardscrabble Dutch colony of New Amsterdam, now present-day southern Manhattan. Orphan children are going missing, and among those looking into the mysterious state of affairs are a quick-witted twenty-two-year-old trader, Blandine von Couvering, herself an orphan, and a dashing British spy named Edward Drummond.", "Suspects abound, including the governor’s wealthy nephew, a green-eyed aristocrat with decadent tastes; an Algonquin trapper who may be possessed by a demon that turns people into cannibals; and the colony’s own corrupt and conflicted orphanmaster. Both the search for the killer and Edward and Blandine’s newfound romance are endangered, however, when Blandine is accused of being a witch and Edward is sentenced to hang for espionage. Meanwhile, war looms as the English king plans to wrest control of the colony.", "Jean Zimmerman brings New Amsterdam and its surrounding wilderness alive for modern-day readers with exacting period detail. Lively, fast paced, and full of colorful characters, ", " is a dramatic page-turner that will appeal to fans of Hilary Mantel and Geraldine Brooks."], "author": "Jean Zimmerman", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2012-06-19 00:00:00", "ISBN": "0670023647"},
{"url": "https://www.goodreads.com/book/show/661347.Pocahontas", "num_ratings": "2,373", "num_reviews": "61", "avg_ratings": 4.01, "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Historical"], "title": "Pocahontas", "description": ["To her father, the Great Chief Powhatan, she was Pocahontas, \"Little Mischief\" - the cherished daughter destined to marry a mighty warrior from another tribe.", "To the English colonists at Jamestown, she was all that stood between them and starvation - and constant warfare with Powhatan's armies.", "To the aristocrats of London, she was Princess Rebecca, toast of the town, confid", "To her father, the Great Chief Powhatan, she was Pocahontas, \"Little Mischief\" - the cherished daughter destined to marry a mighty warrior from another tribe.", "To the English colonists at Jamestown, she was all that stood between them and starvation - and constant warfare with Powhatan's armies.", "To the aristocrats of London, she was Princess Rebecca, toast of the town, confidante of lords and playwrights, and a fierce defender of her people.", "To John Smith of the Virginia Company, she was the greatest love of his life..."], "author": "Susan Donnell", "num_pages": "404", "awards": [], "places": ["Jamestown"], "character_names": [], "language": "English", "publish_date": "1993-02-01 00:00:00", "ISBN": "0425136205"},
{"url": "https://www.goodreads.com/book/show/22736635-tidewater", "num_ratings": "1,324", "num_reviews": "179", "avg_ratings": 4.16, "genres": ["Historical", "Historical Fiction", "Historical", "Fiction"], "title": "Tidewater: A Novel of Pocahontas and the Jamestown Colony", "description": ["In 1607, three ships arrive on the coast of Virginia to establish Jamestown Colony. One girl’s life—and the lives of her people—are changed forever.", "To Pocahontas and her people, the Tidewater is the rightful home of the Powhatan tribe. To England, it is Virginia Territory, fertile with promise, rich with silver and gold. As Jamestown struggles to take root, John Smith know", "In 1607, three ships arrive on the coast of Virginia to establish Jamestown Colony. One girl’s life—and the lives of her people—are changed forever.", "To Pocahontas and her people, the Tidewater is the rightful home of the Powhatan tribe. To England, it is Virginia Territory, fertile with promise, rich with silver and gold. As Jamestown struggles to take root, John Smith knows that the only hope for survival lies with the Powhatan people. He knows, too, that they would rather see the English starve than yield their homeland to invaders. In the midst of this conflict, Pocahontas, the daughter of the great chief, forges an unlikely friendship with Smith. Their bond preserves a wary peace—but control can rest only in one nation’s hands. When that peace is broken, Pocahontas must choose between power and servitude—between self and sacrifice—for the sake of her people and her land."], "author": "Libbie Hawker", "num_pages": "485", "awards": [], "places": [], "character_names": ["John Rolfe", "John Smith, explorer", "Chief Powhatan", "Pocahontas"], "language": "English", "publish_date": "2014-07-17 00:00:00"},
{"url": "https://www.goodreads.com/book/show/7105002-the-rebellion-of-jane-clarke", "num_ratings": "1,459", "num_reviews": "267", "avg_ratings": 3.74, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Literature", "18th Century", "North American Hi...", "American History"], "title": "The Rebellion of Jane Clarke", "author": "Sally Cabot Gunning", "num_pages": "288", "awards": [], "places": ["Satucket, Massachusetts", "Boston, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2010-06-01 00:00:00", "ISBN": "0061782149"},
{"url": "https://www.goodreads.com/book/show/72848.Queen_of_Swords", "num_ratings": "8,220", "num_reviews": "328", "avg_ratings": 4.33, "genres": ["Historical", "Historical Fiction", "Romance", "Historical", "Romance", "Historical Romance", "Fiction"], "title": "Queen of Swords", "description": ["It is the late summer of 1814, and Hannah Bonner and her half brother Luke have spent more than a year searching the islands of the Caribbean for Luke's wife and the man who abducted her. But Jennet's rescue, so long in coming, is not the resolution they'd hoped for. In the spring she had given birth to Luke's son, and in the summer Jennet had found herself compelled to su", "It is the late summer of 1814, and Hannah Bonner and her half brother Luke have spent more than a year searching the islands of the Caribbean for Luke's wife and the man who abducted her. But Jennet's rescue, so long in coming, is not the resolution they'd hoped for. In the spring she had given birth to Luke's son, and in the summer Jennet had found herself compelled to surrender the infant to a stranger in the hope of keeping him safe.", "To claim the child, Hannah, Luke, and Jennet must journey first to Pensacola. There they learn a great deal about the family that has the baby. The Poiterins are a very rich, very powerful Creole family, totally without scruple. The matriarch of the family has left Pensacola for New Orleans and taken the child she now claims as her great-grandson with her.", "New Orleans is a city on the brink of war, a city where prejudice thrives and where Hannah, half Mohawk, must tread softly. Careful plans are made as the Bonners set out to find and reclaim young Nathaniel Bonner. Plans that go terribly awry, isolating them from each other in a dangerous city at the worst of times.", "Sure that all is lost, and sick unto death, Hannah finds herself in the care of a family and a friend from her past, Dr. Paul de Guise Savard dit Saint-dâ-Uzet. It is Dr. Savard and his wife who save Hannah's life, but Dr. Savard's half brother who offers her real hope. Jean-Benoit Savard, the great-grandson of French settlers, slaves, and Choctaw and Seminole Indians, is the one man who knows the city well enough to engineer the miracle that will reunite the Bonners and send them home to Lake in the Clouds. With Ben Savard's guidance, allies are drawn from every segment of New Orleans's population and from Andrew Jackson's army, now pouring into the city in preparation for what will be the last major battle of the War of 1812."], "author": "Sara Donati", "num_pages": "576", "awards": [], "places": [], "character_names": ["Andrew Jackson", "Nathaniel Bonner", "Hannah Bonner", "Runs-from-Bears", "Luke Scott Bonner", "Jennet Scott", "Julia Savard", "Paul Savard", "Jean-Benoit Savard", "Christian Pelham Wyndham", "Honoré Poiterin"], "language": "English", "publish_date": "2006-10-31 00:00:00", "ISBN": "055380149X"},
{"url": "https://www.goodreads.com/book/show/2865712-raleigh-s-eden", "num_ratings": "40", "num_reviews": "1", "avg_ratings": 4.13, "genres": ["Historical", "Historical Fiction", "Fiction", "Own"], "title": "Raleigh's Eden", "description": ["As the Storm of the Revolution swept across their world, they fought to save their land---and their love."], "author": "Inglis Fletcher", "num_pages": "598", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1980-10-01 00:00:00", "ISBN": "0553259504"},
{"url": "https://www.goodreads.com/book/show/542061.The_Sacrifice", "num_ratings": "1,314", "num_reviews": "237", "avg_ratings": 3.79, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "Paranormal", "Witches"], "title": "The Sacrifice", "description": ["In the year 1692, life changes forever for ten-year-old Abigail Faulkner and her family. In Salem, Massachusetts, witches have been found, and widespread fear and panic reign mere miles from Abigail's home of Andover. When two girls are brought from Salem to identify witches in Andover, suspicion sweeps the town as well-respected members of the community are accused of wit", "In the year 1692, life changes forever for ten-year-old Abigail Faulkner and her family. In Salem, Massachusetts, witches have been found, and widespread fear and panic reign mere miles from Abigail's home of Andover. When two girls are brought from Salem to identify witches in Andover, suspicion sweeps the town as well-respected members of the community are accused of witchcraft. It isn't long before chaos consumes Andover, and the Faulkners find themselves in the center of it all when friend turns themselves in the center of it all when friend turns against friend, neighbor against neighbor, in a desperate fight for the truth. At the heart of this gripping story are Abigail and her sister, Dorothy, who together must find a way to persevere during a period marked by terror, adversity, and ignorance.Told from Abigail's point of view and based on actual events in the author's own family histoy, \"The Sacrifice\" offers a unique perspective of the Salem witch trials by delving into the devestating effects the trials had not just in Salem but throughout Massachusetts."], "author": "Kathleen Benner Duble", "num_pages": "224", "awards": [], "places": ["Andover, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2005-09-06 00:00:00", "ISBN": "0689876505"},
{"url": "https://www.goodreads.com/book/show/414452.Susannah_Morrow", "num_ratings": "661", "num_reviews": "62", "avg_ratings": 3.59, "genres": ["Historical", "Historical Fiction", "Paranormal", "Witches", "Fiction", "Historical", "Witchcraft", "Literature", "17th Century"], "title": "Susannah Morrow", "description": ["Capturing the extraordinary drama of the Salem witch trials, one of the most horrific yet intriguing periods in American history, this novel offers a fascinating psychological insight into the sexual repression that spawned the witch hunts."], "author": "Megan Chance", "num_pages": "480", "awards": [], "places": ["Salem, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2003-11-01 00:00:00", "ISBN": "0446613231"},
{"url": "https://www.goodreads.com/book/show/372105.Mount_Vernon_Love_Story", "num_ratings": "4,202", "num_reviews": "526", "avg_ratings": 3.61, "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Historical"], "title": "Mount Vernon Love Story: A Novel of George and Martha Washington", "description": ["The role of leader came naturally to George Washington, the first president of the United States, and the man revered as the father of his country. But when it came to the social aspects of life in the mid 18th century, he was both awkward and insecure, and finally it was only through the love of a woman that he found happiness."], "author": "Mary Higgins Clark", "num_pages": "224", "awards": [], "places": [], "character_names": ["George Washington", "John Adams", "Martha Washington", "Mary Ball Washington", "Sally Fairfax", "George William Fairfax"], "language": "English", "publish_date": "2002-06-18 00:00:00", "ISBN": "0743229878"},
{"url": "https://www.goodreads.com/book/show/25114452-crow-hollow", "num_ratings": "8,017", "num_reviews": "577", "avg_ratings": 3.65, "genres": ["Historical", "Historical Fiction", "Fiction", "Mystery", "Historical"], "title": "Crow Hollow", "author": "Michael  Wallace", "num_pages": "345", "awards": [], "places": [], "character_names": ["James Bailey (Crow Hollow)", "Prudence Cotton", "Peter Church", "Governor Leverett", "William Fitz-Simmons", "Reverend Henry Stone", "Sir Benjamin Cotton", "Anne Stone", "Robert Woory", "Lucy Branch", "Alice Branch", "William Crispin", "Richard Cooper", "Captain Samuel Knapp"], "language": "English", "publish_date": "2015-06-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/13448495-to-have-and-to-hold", "num_ratings": "570", "num_reviews": "94", "avg_ratings": 4.0, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Historical", "Adventure", "Romance"], "title": "To Have and to Hold", "description": ["Virginia Company, Jamestown, 1621. The once struggling colony is now thriving, and the arrival of a ship full of potential brides has all the single men rushing to put on their best and meet the ladies in hopes of finding wives. Captain Ralph Percy, hardened soldier, gentleman farmer, and avowed bachelor, watches from the sidelines, marveling as his comrades make fools of", "Virginia Company, Jamestown, 1621. The once struggling colony is now thriving, and the arrival of a ship full of potential brides has all the single men rushing to put on their best and meet the ladies in hopes of finding wives. Captain Ralph Percy, hardened soldier, gentleman farmer, and avowed bachelor, watches from the sidelines, marveling as his comrades make fools of themselves over the women. He has no need of a wife and can’t understand the sense in asking a perfect stranger to marry him . . . until he catches sight of Jocelyn Leigh.", "Struck by her uncommon beauty, quiet grace, and regal bearing, he wonders why a woman such as she would need to brave the sea voyage and the wilds of the new world to find a husband. And then he finds himself doing the unthinkable, asking for her hand in marriage before another man can snatch her up! But he was right to suspect that Jocelyn was not as she seemed, and he soon discovers that his new wife fled England in a desperate attempt to escape an arranged marriage. Ralph vows to protect her, not knowing how soon he will be called upon to do so, or how dangerous it will be to him.", "Jocelyn’s jilted fiancée is coming to find her, and when Lord Carnal lands at Jamestown, he brings dubious tidings. A handsome lord with the wealth and power of the king at his disposal, he informs Ralph that he has married a ward of the king without the king’s permission, a treasonous offense. But all will be well—all Ralph has to do is hand her over and Lord Carnal will sail away with her as though nothing ever happened. But if Ralph does not comply, he is to be clapped in irons and bound for England and the Tower, and Lord Carnal will take Jocelyn by force. The choice seems clear enough—who is Captain Ralph Percy to go against the king’s orders? But one look at Jocelyn’s fear-stricken face decides his fate. This solemn and stoic woman has woven herself into the fabric of his life, and he’s not going to give her up so easily.", "Ralph and Jocelyn defy the king’s command and fight for their right to stay together, but it soon becomes evident that their only course of action is to flee. As they make their way through the dangerous wilderness, battling the king’s men, Indians, and even pirates, what started out as a marriage of convenience becomes a true love match, and Ralph discovers that what is worth having is worth holding, no matter the cost.", "Bonus Content: Introduction, Map, Glossary, Image Gallery including Party Like it's 1621!", "376 pages", "Legacy Vintage Collection Enhanced eBooks have been professionally edited for readability and professionally formatted for your favorite e-reader! View more on ", "."], "author": "Mary Johnston", "awards": [], "places": ["Jamestown, Virginia", "Jamestown, Virginia"], "character_names": ["Captain Ralph Percy", "Patience Worth"], "language": "English", "publish_date": "2012-02-14 00:00:00"},
{"url": "https://www.goodreads.com/book/show/16089100-maria", "num_ratings": "546", "num_reviews": "35", "avg_ratings": 4.06, "genres": ["Historical", "Historical Fiction", "Fiction", "Romance"], "title": "Maria", "description": ["A heroine you'll never forget. A woman who battles fiercely for survival and her own independence, but surrenders completely to the man she loves.", "This is Eugenia Price's inspiring story of a unique American heroine-a woman whose strength and resourcefulness overcome every obstacle to survival in an untamed and turbulent lands. Maria is a true pioneer, valiant, hard-working", "A heroine you'll never forget. A woman who battles fiercely for survival and her own independence, but surrenders completely to the man she loves.", "This is Eugenia Price's inspiring story of a unique American heroine-a woman whose strength and resourcefulness overcome every obstacle to survival in an untamed and turbulent lands. Maria is a true pioneer, valiant, hard-working, independent. But she is also a vibrant, flesh-and-blood woman, tempestuous in passion, steadfast in love."], "author": "Eugenia Price", "num_pages": "420", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1978-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/25685000-the-dutch-girl", "num_ratings": "309", "num_reviews": "55", "avg_ratings": 3.91, "genres": ["Historical", "Historical Fiction", "Romance", "Romance", "Historical Romance", "Historical", "Military History", "American Revolution", "Fiction", "Literature", "18th Century"], "title": "The Dutch Girl", "description": [" The British control Manhattan, the Rebels hold West Point, and the Dutch patroons reign in feudal splendor over their vast Hud", " The British control Manhattan, the Rebels hold West Point, and the Dutch patroons reign in feudal splendor over their vast Hudson River Valley estates. But the roads are ruled by highwaymen. Gerrit Van Haren, the dispossessed heir of Harenwyck, is determined to reclaim his inheritance from his decadent brother, Andries, even if that means turning outlaw and joining forces with the invading British. Until, that is, he waylays the carriage of beautiful young finishing school teacher Anna Winters…", "Anna is a committed Rebel with a secret past and a dangerous mission to secure the Hudson Highlands for the Americans. Years ago, she was Annatje, the daughter of a tenant farmer who led an uprising against the corrupt landlords and paid with his life. Since then, Anna has vowed to see the patroon system swept aside along with British rule. But at Harenwyck she discovers that politics and virtue do not always align as she expects…and she must choose between two men with a shared past and conflicting visions of the future."], "author": "Donna Thorland", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2016-03-01 00:00:00", "ISBN": "0451471024"},
{"url": "https://www.goodreads.com/book/show/1463280.The_Old_American", "num_ratings": "186", "num_reviews": "21", "avg_ratings": 4.01, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "United States"], "title": "The Old American", "description": ["In 1746, Nathan Blake, the first frame house builder in Keene, New Hampshire, was abducted by Algonkians and held in Canada as a slave. Inspired by this dramatic slice of history, novelist Ernest Hebert has written a masterful new novel recreating those years of captivity.", "Set in New England and Canada during the French and Indian Wars, The Old American is driven by its com", "In 1746, Nathan Blake, the first frame house builder in Keene, New Hampshire, was abducted by Algonkians and held in Canada as a slave. Inspired by this dramatic slice of history, novelist Ernest Hebert has written a masterful new novel recreating those years of captivity.", "Set in New England and Canada during the French and Indian Wars, The Old American is driven by its complex, vividly imagined title character, Caucus-Meteor. By turns shrewd and embittered, ambitious and despairing, inspired and tormented, he is the self-styled king of the remnants of the first native tribes that encountered the English. Displaced and ravaged by disease, these refugees have been forced to bargain for land in Canada on which to live. Having hired himself out as interpreter to a raiding party of French and Iroquois, Caucus-Meteor returns from New Hampshire the unexpected possessor of a captive, Nathan Blake.", "He decides to bring the Englishman to his own village rather than sell him to the French. Ambivalent about his former life, Blake gradually fits into the routine of Conissadawaga. Meanwhile, Caucus-Meteor struggles to protect his people from the rapacious French governor. Constantly plotting and maneuvering, burdened by responsibility, the Old American exhibits cunning and courage. A gifted linguist who was forbidden to learn to read or write; a former slave who is now a king; a native leader who has seen more of London and Paris than his English captive, who knows more of European politics than the French colonial administrators, Caucus-Meteor is a brilliant, cantankerous, visionary figure whom readers will long remember."], "author": "Ernest Hebert", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2001-11-01 00:00:00", "ISBN": "1584652136"},
{"url": "https://www.goodreads.com/book/show/17250.The_Crucible", "num_ratings": "274,060", "num_reviews": "6,055", "avg_ratings": 3.56, "genres": ["Classics", "Plays", "Fiction", "Historical", "Historical Fiction", "Drama", "Academic", "School", "Academic", "Read For School", "Historical", "Literature", "Young Adult", "High School"], "title": "The Crucible", "description": ["\"I believe that the reader will discover here the essential nature of one of the strangest and most awful chapters in human history,\" Arthur Miller wrote of his classic play about the witch-hunts and trials in seventeenth-century Salem, Massachusetts. Based on historical people and real events, Miller's drama is a searing portrait of a community engulfed by hysteria. In th", "\"I believe that the reader will discover here the essential nature of one of the strangest and most awful chapters in human history,\" Arthur Miller wrote of his classic play about the witch-hunts and trials in seventeenth-century Salem, Massachusetts. Based on historical people and real events, Miller's drama is a searing portrait of a community engulfed by hysteria. In the rigid theocracy of Salem, rumors that women are practicing witchcraft galvanize the town's most basic fears and suspicions; and when a young girl accuses Elizabeth Proctor of being a witch, self-righteous church leaders and townspeople insist that Elizabeth be brought to trial. The ruthlessness of the prosecutors and the eagerness of neighbor to testify against neighbor brilliantly illuminate the destructive power of socially sanctioned violence.", "Written in 1953, ", " is a mirror Miller uses to reflect the anti-communist hysteria inspired by Senator Joseph McCarthy's \"witch-hunts\" in the United States. Within the text itself, Miller contemplates the parallels, writing, \"Political opposition... is given an inhumane overlay, which then justifies the abrogation of all normally applied customs of civilized behavior. A political policy is equated with moral right, and opposition to it with diabolical malevolence.\"", "WIth an introduction by Christopher Bigsby."], "author": "Arthur Miller", "num_pages": "143", "awards": ["New York Drama Critics' Circle Award Nominee for Best American Play (1953)"], "places": ["United States of America", "Salem, Massachusetts", "Massachusetts"], "character_names": ["Rev. Parris", "Tituba", "Abigail Williams", "John Proctor", "Elizabeth Proctor", "Giles Corey", "Rebecca Towne Nurse", "Mary Warren", "Deputy Governor Danforth"], "language": "English", "publish_date": "2003-03-25 00:00:00", "ISBN": "0142437336"},
{"url": "https://www.goodreads.com/book/show/12296.The_Scarlet_Letter", "num_ratings": "605,340", "num_reviews": "12,474", "avg_ratings": 3.38, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Academic", "School"], "title": "The Scarlet Letter", "description": [" In Nathaniel Hawthorne's dark novel, ", ", ", ". None more so than Hester Prynne, a young, beautiful, and dignified wo", " In Nathaniel Hawthorne's dark novel, ", ", ", ". None more so than Hester Prynne, a young, beautiful, and dignified woman, who conceived a child out of wedlock and receives the public punishment of having to always wear ", ".", " She refuses to reveal the father of her child, which could lighten her sentence. Her husband, the aptly-named Roger Chillingworth, who Hester thought had died in a shipwreck but was actually being held captive by Native Americans, ", " of her deepest public shaming and vows to get ", ". Her lover, Arthur Dimmesdale, remains safely unidentified, but is wracked with guilt.", " Though originally published in 1850, the story is ", " among Hawthorne's Puritan ancestors. In ", ", he created a story that ", ". His knowledge of their beliefs and his admiration for their way of life was balanced by his concerns about their rigid and oppressive rules.", ", this elegantly designed, clothbound edition features an elastic closure and a new introduction by Mike Lee Davis."], "author": "Nathaniel Hawthorne", "num_pages": "238", "awards": [], "places": ["Boston, Massachusetts"], "character_names": ["Hester Prynne", "Arthur Dimmesdale", "Roger Chillingworth", "Pearl Prynne"], "language": "English", "publish_date": "2003-02-27 00:00:00", "ISBN": "0142437263"},
{"url": "https://www.goodreads.com/book/show/8246782-men-of-albemarle", "num_ratings": "41", "num_reviews": "1", "avg_ratings": 4.1, "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Historical Romance"], "title": "Men of Albemarle", "description": ["Lady Mary had hoped that forsaking London society would ease the pain of her terrible secret but the Carolina wilderness of 1710 provides little comfort."], "author": "Inglis Fletcher", "num_pages": "500", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1986-06-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/264963.Cape_Cod", "num_ratings": "1,159", "num_reviews": "106", "avg_ratings": 3.96, "genres": ["Historical", "Historical Fiction", "Fiction", "Mystery"], "title": "Cape Cod", "description": ["Two families, both carried by the ", "across stormy seas... both destined to generations of proud leadership, shameful intrigue, and passion for the sandy crest of land that became their heritage...", "This is the story of the Bigelow and Hilyard clans, from their", "Two families, both carried by the ", "across stormy seas... both destined to generations of proud leadership, shameful intrigue, and passion for the sandy crest of land that became their heritage...", "This is the story of the Bigelow and Hilyard clans, from their first years on America's shores, through the fury of her wars and the glory of her triumphs, to our own time when young Geoff Hilyard must fight to save both his marriage to a Bigelow heir and the windswept coast he loves. It is a struggle that will take him deep into the past, to a centuries-old feud that never died..And on a dangerous quest for a priceless relic of American history that has lain hidden in the Cape for over two hundred years."], "author": "William Martin", "num_pages": "713", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1992-07-01 00:00:00", "ISBN": "0446363170"},
{"url": "https://www.goodreads.com/book/show/1488966.Deepwater", "num_ratings": "43", "num_reviews": "4", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Military History", "Civil War", "Romance", "Historical"], "title": "Deepwater", "description": ["New York Times bestselling author Jekel delivers the second spectacular novel in her trio of southern sagas--the stunning story of a family that carves a sensuous and compelling life out of the untamed wilderness of the Carolinas, from the first settlement on Roanoke Island through the Civil War."], "author": "Pamela Jekel", "num_pages": "576", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-02-01 00:00:00", "ISBN": "0821748289"},
{"url": "https://www.goodreads.com/book/show/38296.The_Last_of_the_Mohicans", "num_ratings": "78,318", "num_reviews": "2,243", "avg_ratings": 3.7, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Adventure", "Literature", "Historical", "Literature", "American", "Novels", "Classics", "Classic Literature", "War"], "title": "The Last of the Mohicans", "description": ["The wild rush of action in this classic frontier adventure story has made", " the most popular of James Fenimore Cooper’s Leatherstocking Tales. Deep in the forests of upper New York State, the brave woodsman Hawkeye (Natty Bumppo) and his loyal Mohican friends Chingachgook and Uncas become embroiled in the bloody battles of the French and Indian War.", "The wild rush of action in this classic frontier adventure story has made", " the most popular of James Fenimore Cooper’s Leatherstocking Tales. Deep in the forests of upper New York State, the brave woodsman Hawkeye (Natty Bumppo) and his loyal Mohican friends Chingachgook and Uncas become embroiled in the bloody battles of the French and Indian War. The abduction of the beautiful Munro sisters by hostile savages, the treachery of the renegade brave Magua, the ambush of innocent settlers, and the thrilling events that lead to the final tragic confrontation between rival war parties create an unforgettable, spine-tingling picture of life on the frontier. And as the idyllic wilderness gives way to the forces of civilization, the novel presents a moving portrayal of a vanishing race and the end of its way of life in the great American forests."], "author": "James Fenimore Cooper", "num_pages": "410", "awards": [], "places": ["Upstate New York"], "character_names": ["Nathaniel Bumppo", "Chingachgook", "Magua", "Uncas", "Cora Munro", "Alice Munro", "Colonel George Munro", "Duncan Heyward", "David Gamut", "Tamenund", "General Marquis de Montcalm", "General Daniel Webb"], "language": "English", "publish_date": "1982-06-01 00:00:00", "ISBN": "0553213296"},
{"url": "https://www.goodreads.com/book/show/306086.From_Distant_Shores", "num_ratings": "16", "num_reviews": "3", "avg_ratings": 3.88, "genres": ["Historical", "Historical Fiction", "Fiction"], "title": "From Distant Shores", "description": ["This novel follows the adventures of one family, the de Kuypers, who came from distant shores to settle in a breathtaking forest eden: Pieter, explorer, builder, whaler, who knew from his first adventure - lost then rescued by friendly natives - that his destiny lay on the island; Christina, br", "This novel follows the adventures of one family, the de Kuypers, who came from distant shores to settle in a breathtaking forest eden: Pieter, explorer, builder, whaler, who knew from his first adventure - lost then rescued by friendly natives - that his destiny lay on the island; Christina, brave because she had to be, forced to bear arms as well as children, and determined to carve a place for herself in the fight for survival; and Jacob Adam, the bastard son, who ushered in a ruthless new breed of empire builders on the long island."], "author": "Bruce Nicolaysen", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1980-07-28 00:00:00", "ISBN": "038075424X"},
{"url": "https://www.goodreads.com/book/show/321459.Celia_Garth", "num_ratings": "2,778", "num_reviews": "298", "avg_ratings": 4.1, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance", "Literature", "18th Century", "Romance", "Historical Romance"], "title": "Celia Garth", "description": ["This is a story about a girl who wanted things to happen to her.", "Celia Garth lived in Charleston, South Carolina, during the American Revolution. She had blond hair and brown eyes and a sassy face, and she worked in a fashionable dressmaking shop.", "Things did happen to Celia, but not as she had planned. The king's army captured Charleston. The ravisher Tarleton swept through", "This is a story about a girl who wanted things to happen to her.", "Celia Garth lived in Charleston, South Carolina, during the American Revolution. She had blond hair and brown eyes and a sassy face, and she worked in a fashionable dressmaking shop.", "Things did happen to Celia, but not as she had planned. The king's army captured Charleston. The ravisher Tarleton swept through the Carolina countryside in a wave of blood and fire and debauchery. Caught up in the ruin were Celia and her friends -- the merry-minded Darren; Jimmy, whose love for Celia brought her into his tragedy; the fascinating Vivian, five times married; Godfrey, rich and powerful, who met disaster because he could control anything in town but the weather; the daredevil Luke.", "Most people thought the Revolution was lost. Many Americans, like Celia's handsome cousin Roy, joined the king's side. Then out of the swamps appeared Francis Marion.", "Marion was a little man. Marion was also crippled. But as Luke said of him, \"When that man's leading a charge, he looks nine feet tall.\"", "In the dressmaking shop, Celia became a spy for Marion. She sewed, she smiled sweetly, and in secret she risked her life sending information to this man that the king's whole army could not catch, the mighty little man to whom Tarleton angrily gave the name 'Swamp Fox'."], "author": "Gwen Bristow", "num_pages": "320", "awards": [], "places": ["Charleston, South Carolina"], "character_names": [], "language": "English", "publish_date": "1959-06-12 00:00:00", "ISBN": "0690183488"},
{"url": "https://www.goodreads.com/book/show/7933820-the-wolves-of-andover", "num_ratings": "3,546", "num_reviews": "604", "avg_ratings": 3.56, "genres": ["Historical", "Historical Fiction", "Fiction", "Literature", "17th Century", "Historical"], "title": "The Wolves of Andover", "description": ["In the harsh wilderness of colonial Massachusetts, Martha Allen works as a servant in her cousin's household, taking charge and locking wills with everyone. Thomas Carrier labors for the family and is known both for his immense strength and size and mysterious past. The two begin a courtship that suits their independent natures, with Thomas slowly revealing the story of hi", "In the harsh wilderness of colonial Massachusetts, Martha Allen works as a servant in her cousin's household, taking charge and locking wills with everyone. Thomas Carrier labors for the family and is known both for his immense strength and size and mysterious past. The two begin a courtship that suits their independent natures, with Thomas slowly revealing the story of his part in the English Civil War. But in the rugged new world they inhabit, danger is ever present, whether it be from the assassins sent from London to kill the executioner of Charles I or the wolves-in many forms-who hunt for blood. A love story and a tale of courage, ", " confirms Kathleen Kent's ability to craft powerful stories of family from colonial history."], "author": "Kathleen Kent", "num_pages": "305", "awards": [], "places": ["London, England", "Massachusetts"], "character_names": ["Martha Carrier", "Martha Allen", "Thomas Carrier"], "language": "English", "publish_date": "2010-11-08 00:00:00", "ISBN": "0316068624"},
{"url": "https://www.goodreads.com/book/show/1863655.Picture_Maker", "num_ratings": "510", "num_reviews": "68", "avg_ratings": 3.98, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "Picture Maker", "description": ["Across the ocean, the Crusades had ended. Three plagues devastated Europe, killing Europeans by the hundreds of thousands. But in North America, born into a powerful clan of women, Picture Maker is gifted with the ability to etch drawings that foreshadow the future. Her prophecy of war saves her beloved Ganeogaono people, but leads to her own brutal capture by the Algonqui", "Across the ocean, the Crusades had ended. Three plagues devastated Europe, killing Europeans by the hundreds of thousands. But in North America, born into a powerful clan of women, Picture Maker is gifted with the ability to etch drawings that foreshadow the future. Her prophecy of war saves her beloved Ganeogaono people, but leads to her own brutal capture by the Algonquins. Through her courage and resilient spirit, and aided by a remarkable storyteller, she escapes her captors and finds refuge with the Naskapi, a peace-loving tribe. Her journey does not end there, however; Picture Maker’s travels take her across North America and into the distant corners of the western hemisphere where she ultimately meets Halvard, a Norse hunter who holds the key to the riddle of her birth. Together, they sail to Greenland, where Halvard’s way of life comes under attack and Picture Maker is shunned as an outcast for her special gifts. Her fate comes full circle as she struggles to save her young daughter from being taken from her, as she was long ago torn from her own clan.", "A towering saga of adventure and survival, love and loss, ", " brings the fourteenth century to life…from the Iroquois Wars that marked a land forever, to the Norse Invasions, and through the bloody rise of Christianity. It is a stunning achievement from an award-winning historical writer."], "author": "Penina Keen Spinka", "num_pages": "464", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-01-01 00:00:00", "ISBN": "0525946241"},
{"url": "https://www.goodreads.com/book/show/1593807.Roanoke_Hundred", "num_ratings": "55", "num_reviews": "5", "avg_ratings": 4.16, "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Clean Romance"], "title": "Roanoke Hundred", "description": ["Sir Richard Grenville is the hero of this novel about the first attempted settlement of Roanoke Island (1585-1586), while Governor Ralph Lane is portrayed as a weak leader. Much of the action takes place in England before the expedition sails and after the explorers return. The reader gets a good sense of Elizabethan politics and the excitement that exploration held for we", "Sir Richard Grenville is the hero of this novel about the first attempted settlement of Roanoke Island (1585-1586), while Governor Ralph Lane is portrayed as a weak leader. Much of the action takes place in England before the expedition sails and after the explorers return. The reader gets a good sense of Elizabethan politics and the excitement that exploration held for well-born adventurers. Sir Walter Raleigh, Sir Francis Drake, John White, Richard Hakluyt, and Thomas Hariot all have roles in the novel. The lowly-born Colin provides additional human interest, as he becomes a trusted aide to Grenville and a suitor to one of Grenville’s wards."], "author": "Inglis Fletcher", "num_pages": "499", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1980-03-01 00:00:00", "ISBN": "0553256718"},
{"url": "https://www.goodreads.com/book/show/18693612-flight-of-the-sparrow", "num_ratings": "5,965", "num_reviews": "813", "avg_ratings": 3.93, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "Flight of the Sparrow", "description": [". Even before Mary Rowlandson is captured by Indians on a winter day of viol", ". Even before Mary Rowlandson is captured by Indians on a winter day of violence and terror, she sometimes found herself in conflict with her rigid Puritan community. Now, her home destroyed, her children lost to her, she has been sold into the service of a powerful woman tribal leader, made a pawn in the on-going bloody struggle between English settlers and native people. Battling cold, hunger, and exhaustion, Mary witnesses harrowing brutality but also unexpected kindness. To her confused surprise, she is drawn to her captors’ open and straightforward way of life, a feeling further complicated by her attraction to a generous, protective English-speaking native known as James Printer. All her life, Mary has been taught to fear God, submit to her husband, and abhor Indians. Now, having lived on the other side of the forest, she begins to question the edicts that have guided her, torn between the life she knew and the wisdom the natives have shown her.", " Based on the compelling true narrative of Mary Rowlandson,", " is an evocative tale that transports the reader to a little-known time in early America and explores the real meaning of freedom, faith, and acceptance."], "author": "Amy Belding Brown", "num_pages": "368", "awards": [], "places": [], "character_names": ["Mary Rowlandson"], "language": "English", "publish_date": "2014-07-01 00:00:00", "ISBN": "0451466691"},
{"url": "https://www.goodreads.com/book/show/6909568-the-heretic-s-daughter", "num_ratings": "29,688", "num_reviews": "3,795", "avg_ratings": 3.77, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Paranormal", "Witches"], "title": "The Heretic's Daughter", "description": ["Martha Carrier was one of the first women to be accused, tried and hanged as a witch in Salem, Massachusetts. Like her mother, young Sarah Carrier is bright and willful, openly challenging the small, brutal world in which they live. Often at odds with one another, mother and daughter are forced to stand together against the escalating hysteria of the trials and the superst", "Martha Carrier was one of the first women to be accused, tried and hanged as a witch in Salem, Massachusetts. Like her mother, young Sarah Carrier is bright and willful, openly challenging the small, brutal world in which they live. Often at odds with one another, mother and daughter are forced to stand together against the escalating hysteria of the trials and the superstitious tyranny that led to the torture and imprisonment of more than 200 people accused of witchcraft. This is the story of Martha's courageous defiance and ultimate death, as told by the daughter who survived.", "Kathleen Kent is a tenth generation descendant of Martha Carrier. She paints a haunting portrait, not just of Puritan New England, but also of one family's deep and abiding love in the face of fear and persecution."], "author": "Kathleen Kent", "num_pages": "332", "awards": ["David J. Langum Sr. Prize for American Historical Fiction (2008)"], "places": ["Salem, Massachusetts"], "character_names": ["Sarah Carrier", "Martha Carrier", "Thomas Carrier"], "language": "English", "publish_date": "2009-10-12 00:00:00", "ISBN": "031602449X"},
{"url": "https://www.goodreads.com/book/show/18114079-the-rebel-pirate", "num_ratings": "633", "num_reviews": "101", "avg_ratings": 3.69, "genres": ["Historical", "Historical Fiction", "Romance", "Romance", "Historical Romance", "Historical", "Adventure", "Pirates", "Military History", "American Revolution", "Fiction"], "title": "The Rebel Pirate", "description": ["1775, Boston Harbor. James Sparhawk, Master and Commander in the British Navy, knows trouble when he sees it. The ship he’s boarded is carrying ammunition and gold…into a country on the knife’s edge of war. Sparhawk’s duty is clear: confiscate the cargo, impound the vessel and seize the crew. But when one of the ship’s boys turns out to be a lovely girl, with a loaded pist", "1775, Boston Harbor. James Sparhawk, Master and Commander in the British Navy, knows trouble when he sees it. The ship he’s boarded is carrying ammunition and gold…into a country on the knife’s edge of war. Sparhawk’s duty is clear: confiscate the cargo, impound the vessel and seize the crew. But when one of the ship’s boys turns out to be a lovely girl, with a loaded pistol and dead-shot aim, Sparhawk finds himself held hostage aboard a Rebel privateer.", " Sarah Ward never set out to break the law. Before Boston became a powder keg, she was poised to escape the stigma of being a notorious pirate’s daughter by wedding Micah Wild, one of Salem’s most successful merchants. Then a Patriot mob destroyed her fortune and Wild played her false by marrying her best friend and smuggling a chest of Rebel gold aboard her family’s ship.", " Now branded a pirate herself, Sarah will do what she must to secure her family’s safety and her own future. Even if that means taking part in the cat and mouse game unfolding in Boston Harbor, the desperate naval fight between British and Rebel forces for the materiel of war—and pitting herself against James Sparhawk, the one man she cannot resist."], "author": "Donna Thorland", "num_pages": "416", "awards": [], "places": ["Boston, Massachusetts"], "character_names": [], "language": "English", "publish_date": "2014-03-04 00:00:00", "ISBN": "045141540X"},
{"url": "https://www.goodreads.com/book/show/9554882-into-the-wilderness", "num_ratings": "30,573", "num_reviews": "1,942", "avg_ratings": 4.11, "genres": ["Historical", "Historical Fiction", "Romance", "Historical", "Fiction", "Romance", "Historical Romance", "Adventure"], "title": "Into the Wilderness", "description": ["Weaving a vibrant tapestry of fact and fiction, ", " sweeps us into another time and place...and into the heart of a forbidden, incandescent affair between a spinster Englishwoman and an American frontiersman. Here is an epic of romance and history that will captivate readers from the very first page.", "When Elizabeth Middleton, twenty-nine years old and unmarr", "Weaving a vibrant tapestry of fact and fiction, ", " sweeps us into another time and place...and into the heart of a forbidden, incandescent affair between a spinster Englishwoman and an American frontiersman. Here is an epic of romance and history that will captivate readers from the very first page.", "When Elizabeth Middleton, twenty-nine years old and unmarried, leaves her Aunt Merriweather's comfortable English estate to join her father and brother in the remote mountain village of Paradise on the edge of the New York wilderness, she does so with a strong will and an unwavering purpose: to teach school.", "It is December of 1792 when she arrives in a cold climate unlike any she has ever experienced. And she meets a man different from any she has ever encountered--a white man dressed like a Native American, tall and lean and unsettling in his blunt honesty. He is Nathaniel Bonner, also known to the Mohawk people as Between-Two-Lives.", "Determined to provide schooling for all the children of the village--white, black, and Native American--Elizabeth soon finds herself at odds with local slave owners. Much to her surprise, she clashes with her own father as well. Financially strapped, Judge Middleton has plans for his daughter--betrothal to local doctor Richard Todd. An alliance with Todd could extract her father from ruin but would call into question the ownership of Hidden Wolf, the mountain where Nathaniel, his father, and a small group of Native Americans live and hunt.", "As Judge Middleton brings pressure to bear against his daughter, she is faced with a choice between compliance and deception, a flight into the forest, and a desire that will bend her hard will to compromise and transformation. Elizabeth's ultimate destiny, here in the heart of the wilderness, lies in the odyssey to come: trials of faith and flesh, and passion born amid Nathaniel's own secrets and divided soul.", "Interweaving the fate of the remnants of the Mohawk Nation with the destiny of two lovers, Sara Donati's compelling novel creates a complex, profound, passionate portrait of an emerging America."], "author": "Sara Donati", "num_pages": "898", "awards": [], "places": [], "character_names": ["Chingachgook", "Elizabeth Middleton", "Nathaniel Bonner", "Dan'l Bonner", "Julian Middleton", "Hannah Bonner", "Runs-from-Bears", "Many-Doves", "Robbie MacLachlan", "Falling-Day", "Alfred Middleton", "Richard Todd", "Kitty Witherspoon"], "language": "English", "publish_date": "2010-09-01 00:00:00"},
{"url": "https://www.goodreads.com/book/show/14761017-the-turncoat", "num_ratings": "1,488", "num_reviews": "274", "avg_ratings": 3.7, "genres": ["Historical", "Historical Fiction", "Romance", "Romance", "Historical Romance", "Historical", "Military History", "American Revolution", "Fiction", "Literature", "18th Century"], "title": "The Turncoat", "description": ["They are lovers on opposite sides of a brutal war, with everything at stake and no possibility of retreat. They can trust no one—especially not each other. ", "Major Lord Peter Tremayne is the last man rebel bluestocking Kate Grey should fall in love with, but when the handsome British viscount commandeers her home, Kate throws caution to the wind and responds to his seduction", "They are lovers on opposite sides of a brutal war, with everything at stake and no possibility of retreat. They can trust no one—especially not each other. ", "Major Lord Peter Tremayne is the last man rebel bluestocking Kate Grey should fall in love with, but when the handsome British viscount commandeers her home, Kate throws caution to the wind and responds to his seduction. She is on the verge of surrender when a spy in her own household seizes the opportunity to steal the military dispatches Tremayne carries, ensuring his disgrace—and implicating Kate in high treason. Painfully awakened to the risks of war, Kate determines to put duty ahead of desire, and offers General Washington her services as an undercover agent in the City of Brotherly Love. ", "Months later, having narrowly escaped court martial and hanging, Tremayne returns to decadent, British-occupied Philadelphia with no stomach for his current assignment—to capture the woman he believes betrayed him. Nor does he relish the glittering entertainments being held for General Howe’s idle officers. Worse, the glamorous woman in the midst of this social whirl, the fiancée of his own dissolute cousin, is none other than Kate Grey herself. And so begins their dangerous dance, between passion and patriotism, between certain death and the promise of a brave new future together."], "author": "Donna Thorland", "num_pages": "395", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-03-05 00:00:00", "ISBN": "0451415396"},
{"url": "https://www.goodreads.com/book/show/1525997.Speaks_the_Nightbird", "num_ratings": "7,608", "num_reviews": "857", "avg_ratings": 4.12, "genres": ["Mystery", "Historical", "Thriller"], "title": "Speaks the Nightbird", "description": ["The Carolinas, 1699: The citizens of Fount Royal believe a witch has cursed their town with inexplicable tragedies, and they demand that beautiful widow Rachel Howarth be tried and executed for witchcraft. Presiding over the trial is traveling magistrate Issac Woodward, aided by his astute young clerk, Matthew Corbett. Believing in Rachel's innocence, Matthew will soon con", "The Carolinas, 1699: The citizens of Fount Royal believe a witch has cursed their town with inexplicable tragedies, and they demand that beautiful widow Rachel Howarth be tried and executed for witchcraft. Presiding over the trial is traveling magistrate Issac Woodward, aided by his astute young clerk, Matthew Corbett. Believing in Rachel's innocence, Matthew will soon confront the true evil at work in Fount Royal.", "After hearing damning testimony, magistrate Woodward sentences the accused witch to death by burning. Desperate to exonerate the woman he has come to love, Matthew begins his own investigation among the townspeople. Piecing together the truth, he has no choice but to vanquish a force more malevolent than witchcraft in order to save his beloved Rachel and free Fount Royal from the menace claiming innocent lives."], "author": "Robert R. McCammon", "num_pages": "816", "awards": ["Independent Publisher Book Award (IPPY) for Historical/Military Fiction (2003)", "Alabama Author Award for Fiction (2004)"], "places": ["Fount Royal, Carolina"], "character_names": [], "language": "English", "publish_date": "2007-07-17 00:00:00", "ISBN": "1416552502"},
{"url": "https://www.goodreads.com/book/show/34137888-i-eliza-hamilton", "num_ratings": "1,893", "num_reviews": "353", "avg_ratings": 4.02, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance"], "title": "I, Eliza Hamilton", "description": ["In this beautifully written novel of historical fiction, bestselling author Susan Holloway Scott tells the story of Alexander Hamilton’s wife, Eliza—a fascinating, strong-willed heroine in her own right and a key figure in one of the most gripping periods in American history.", "“Love is not easy with a man chosen by Fate for greatness . . .”", "As the daughter of a respected gene", "In this beautifully written novel of historical fiction, bestselling author Susan Holloway Scott tells the story of Alexander Hamilton’s wife, Eliza—a fascinating, strong-willed heroine in her own right and a key figure in one of the most gripping periods in American history.", "“Love is not easy with a man chosen by Fate for greatness . . .”", "As the daughter of a respected general, Elizabeth Schuyler is accustomed to socializing with dignitaries and soldiers. But no visitor to her parents’ home has affected her so strongly as Alexander Hamilton, a charismatic, ambitious aide to George Washington. They marry quickly, and despite the tumult of the American Revolution, Eliza is confident in her brilliant husband and in her role as his helpmate. But it is in the aftermath of war, as Hamilton becomes one of the country’s most important figures, that she truly comes into her own.", "In the new capital, Eliza becomes an adored member of society, respected for her fierce devotion to Hamilton as well as her grace. Behind closed doors, she astutely manages their expanding household, and assists her husband with his political writings. Yet some challenges are impossible to prepare for. Through public scandal, betrayal, personal heartbreak, and tragedy, she is tested again and again. In the end, it will be Eliza’s indomitable strength that makes her not only Hamilton’s most crucial ally in life, but his most loyal advocate after his death, determined to preserve his legacy while pursuing her own extraordinary path through the nation they helped shape together."], "author": "Susan Holloway Scott", "num_pages": "444", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2017-09-26 00:00:00", "ISBN": "1496712528"},
{"url": "https://www.goodreads.com/book/show/22450833-mistress-firebrand", "num_ratings": "411", "num_reviews": "81", "avg_ratings": 3.9, "genres": ["Historical", "Historical Fiction", "Romance", "Romance", "Historical Romance", "Historical", "Military History", "American Revolution", "Fiction", "Literature", "18th Century"], "title": "Mistress Firebrand", "description": [" American actress Jennifer Leighton has been packing the John Street Theater with her witty comedies, but she longs to escape the provincial circuit for the glamour of the London stage. When the playwright General John Burgoyne visits the city, fresh from a recent success in the capitol, she seizes the opportunity to court his patronage. Bu", " American actress Jennifer Leighton has been packing the John Street Theater with her witty comedies, but she longs to escape the provincial circuit for the glamour of the London stage. When the playwright General John Burgoyne visits the city, fresh from a recent success in the capitol, she seizes the opportunity to court his patronage. But her plan is foiled by British intelligence officer Severin Devere. ", "Severin’s mission is to keep the pleasure-loving general focused on the war effort…and away from pretty young actresses. But the tables are turned when Severin himself can’t resist Jennifer Leighton…", "Months later, Jenny has abandoned her dreams of stage glory and begun writing seditious plays for the Rebels under the pen name “Cornelia,” ridiculing “Gentleman Johnny” Burgoyne and his army—and undermining the crown’s campaign to take Albany. By the time Severin meets up with Jenny once again, she is on a British hanging list, and Severin is ordered to find her—and deliver her to certain death. Soon, the two are launched on a desperate journey through the wilderness, toward a future shaped by the revolution—and their passion for each other…"], "author": "Donna Thorland", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2015-03-03 00:00:00", "ISBN": "0451471016"},
{"url": "https://www.goodreads.com/book/show/911868.Arundel", "num_ratings": "1,158", "num_reviews": "100", "avg_ratings": 4.22, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Military History", "American Revolution", "North American Hi...", "American History", "American Revolution", "American Revolutionary War"], "title": "Arundel", "description": ["This is the classic series from Pulitzer Prize-winning historical novelist Kenneth Roberts, all featuring characters from the town of Arundel, Maine. Arundel follows Steven Nason as he joins Benedict Arnold in his march to Quebec during the American Revolution."], "author": "Kenneth Roberts", "num_pages": "496", "awards": [], "places": ["Arundel, Maine"], "character_names": ["Benedict Arnold"], "language": "English", "publish_date": "1995-01-01 00:00:00", "ISBN": "0892723645"},
{"url": "https://www.goodreads.com/book/show/34412073-the-indigo-girl", "num_ratings": "1,741", "num_reviews": "330", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Historical", "Fiction", "American", "Southern", "Romance"], "title": "The Indigo Girl", "description": ["An incredible story of dangerous and hidden friendships, ambition, betrayal, and sacrifice.", "The year is 1739. Eliza Lucas is sixteen years old when her father leaves her in charge of their family's three plantations in rural South Carolina and then proceeds to bleed the estates dry in pursuit of his military ambitions. Tensions with the British, and with the Spanish in Flor", "An incredible story of dangerous and hidden friendships, ambition, betrayal, and sacrifice.", "The year is 1739. Eliza Lucas is sixteen years old when her father leaves her in charge of their family's three plantations in rural South Carolina and then proceeds to bleed the estates dry in pursuit of his military ambitions. Tensions with the British, and with the Spanish in Florida, just a short way down the coast, are rising, and slaves are starting to become restless. Her mother wants nothing more than for their South Carolina endeavor to fail so they can go back to England. Soon her family is in danger of losing everything.", "Upon hearing how much the French pay for indigo dye, Eliza believes it's the key to their salvation. But everyone tells her it's impossible, and no one will share the secret to making it. Thwarted at nearly every turn, even by her own family, Eliza finds that her only allies are an aging horticulturalist, an older and married gentleman lawyer, and a slave with whom she strikes a dangerous deal: teach her the intricate thousand-year-old secret process of making indigo dye and in return -- against the laws of the day -- she will teach the slaves to read.", "So begins an incredible story of love, dangerous and hidden friendships, ambition, betrayal, and sacrifice.", "Based on historical documents, including Eliza's letters, this is a historical fiction account of how a teenage girl produced indigo dye, which became one of the largest exports out of South Carolina, an export that laid the foundation for the incredible wealth of several Southern families who still live on today. Although largely overlooked by historians, the accomplishments of Eliza Lucas influenced the course of US history. When she passed away in 1793, President George Washington served as a pallbearer at her funeral.", "This book is set between 1739 and 1744, with romance, intrigue, forbidden friendships, and political and financial threats weaving together to form the story of a remarkable young woman whose actions were before their time: the story of the indigo girl."], "author": "Natasha Boyd", "num_pages": "343", "awards": [], "places": ["Charleston, South Carolina"], "character_names": ["Eliza Lucas", "Ben", "Quash", "Charles Pinckney", "Mr. Deveaux", "Togo", "Sawney"], "language": "English", "publish_date": "2017-10-03 00:00:00", "ISBN": "1455137111"},
{"url": "https://www.goodreads.com/book/show/10365.Where_the_Red_Fern_Grows", "num_ratings": "297,645", "num_reviews": "9,479", "avg_ratings": 4.05, "genres": ["Classics", "Fiction", "Young Adult", "Childrens", "Animals", "Historical", "Historical Fiction", "Academic", "School", "Childrens", "Middle Grade", "Realistic Fiction", "Academic", "Read For School"], "title": "Where the Red Fern Grows", "description": ["A loving threesome, they ranged the dark hills and river bottoms of Cherokee country. Old Dan had the brawn. Little Ann had the brains, and Billy had the will to make them into the finest hunting team in the valley. Glory and victory were coming to them, but sadness waited too. ", " is an exciting tale of love and adventure you'll never forget."], "author": "Wilson Rawls", "num_pages": "272", "awards": ["Massachusetts Children's Book Award (1987)", "North Dakota Children's Choice Award (1981)"], "places": ["Ozark Mountains", "Oklahoma"], "character_names": ["Billy Colman", "Old Dan", "Little Ann"], "language": "English", "publish_date": "2000-05-09 00:00:00", "ISBN": "0375806814"},
{"url": "https://www.goodreads.com/book/show/21971543-will-poole-s-island", "num_ratings": "83", "num_reviews": "41", "avg_ratings": 4.16, "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction"], "title": "Will Poole's Island", "description": ["New England, 1643. A meeting in the forest between a rebellious young Englishman and a visionary Wampanoag leads to a dangerous collision of societies, an epic sea journey, and the making of an unforgettable friendship. ", "“Immersive . . . This riveting portrayal of early Colonial New England shines a speculative but compelling light on the time and place.” — Kirkus Reviews", "“T", "New England, 1643. A meeting in the forest between a rebellious young Englishman and a visionary Wampanoag leads to a dangerous collision of societies, an epic sea journey, and the making of an unforgettable friendship. ", "“Immersive . . . This riveting portrayal of early Colonial New England shines a speculative but compelling light on the time and place.” — Kirkus Reviews", "“Tim Weed’s Will Poole’s Island is a doorway to an earlier world when the United States existed as a borderless tract of land whose dimensions could hardly be imagined. This is a superb novel, written with truth and daring at its core.” — Joseph Monninger, National Endowment for the Arts Fellow and author of The World as We Know It", "“It’s been so long since I felt like a little girl in love with books again. Treasure Island, Island of the Blue Dolphins, The Yearling, lazing around on a spot of sunshine totally engrossed in this other, historical world, that’s how I feel about Will Poole’s Island.” — Suzanne Kingsbury, author of The Summer Fletcher Greel Loved Me", "“Weed writes colorfully and with feeling, drawing readers into Will’s and Squamiset’s lives and making his characters believable and human . . . Will Poole’s Island does several things and does them well. It is a sweet coming-of-age story, a riveting adventure tale, an insightful analysis of a difficult time in American history and an eloquent plea for understanding among all peoples.” — The Recorder, Greenfield, Mass."], "author": "Tim Weed", "num_pages": "177", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2014-08-15 00:00:00", "ISBN": "1608981746"},
{"url": "https://www.goodreads.com/book/show/4836308-the-physick-book-of-deliverance-dane", "num_ratings": "47,122", "num_reviews": "5,725", "avg_ratings": 3.7, "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Witchcraft", "Contemporary", "Audiobook"], "title": "The Physick Book of Deliverance Dane", "description": ["A spellbinding, beautifully written novel that moves between contemporary times and one of the most fascinating and disturbing periods in American history--the Salem witch trials. Harvard graduate student Connie Goodwin needs to spend her summer doing research for her doctoral dissertation. But when her mother asks her to handle the sale of Connie's grandmother's abandoned", "A spellbinding, beautifully written novel that moves between contemporary times and one of the most fascinating and disturbing periods in American history--the Salem witch trials. Harvard graduate student Connie Goodwin needs to spend her summer doing research for her doctoral dissertation. But when her mother asks her to handle the sale of Connie's grandmother's abandoned home near Salem, she can't refuse. As she is drawn deeper into the mysteries of the family house, Connie discovers an ancient key within a seventeenth-century Bible. The key contains a yellowing fragment of parchment with a name written upon it: Deliverance Dane. This discovery launches Connie on a quest--to find out who this woman was and to unearth a rare artifact of singular power: a physick book, its pages a secret repository for lost knowledge. As the pieces of Deliverance's harrowing story begin to fall into place, Connie is haunted by visions of the long-ago witch trials, and she begins to fear that she is more tied to Salem's dark past then she could have ever imagined.", "Written with astonishing conviction and grace, ", " travels seamlessly between the witch trials of the 1690s and a modern woman's story of mystery, intrigue, and revelation."], "author": "Katherine Howe", "num_pages": "371", "awards": ["Goodreads Choice Award Nominee for Fiction (2009)"], "places": ["Salem, Massachusetts", "Cambridge, Massachusetts", "Massachusetts"], "character_names": ["Deliverance Dane", "Connie Goodwin", "Grace Goodwin", "Mercy Dane", "Sam Hartley", "Manning Chilton", "Janine Silva", "Liz Dowers"], "language": "English", "publish_date": "2009-05-22 00:00:00", "ISBN": "1401340903"},
{"url": "https://www.goodreads.com/book/show/8767125-dawn-s-early-light", "num_ratings": "1,118", "num_reviews": "134", "avg_ratings": 4.27, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Romance", "Romance", "Historical Romance", "Military History", "American Revolution"], "title": "Dawn's Early Light", "description": ["Colonial Williamsburg lives again in this rich story which is Elswyth Thane's first novel of American history in her bestselling series. Against a background of Williamsburg's quiet streets, the pomp and glitter of the Palace during the last days of British rule, and the excitement and triumph which swirled through the Raleigh Tavern, we see the people of Williamsburg whom", "Colonial Williamsburg lives again in this rich story which is Elswyth Thane's first novel of American history in her bestselling series. Against a background of Williamsburg's quiet streets, the pomp and glitter of the Palace during the last days of British rule, and the excitement and triumph which swirled through the Raleigh Tavern, we see the people of Williamsburg whom history has forgotten: aristocratic St. John Sprague, who became George Washington's aide; Regina Greensleeves, the spoilt Virginia Beauty; Julian Day, the young schoolmaster, just arrived from England; and finally, Tibby, the most appealing, irresistible creature Miss Thane has ever written about. Washington, Jefferson, Lafayette, Greene, Francis Marion, and the rest of that brilliant galaxy are portrayed not as historical figures but as men. We see de Kalb's gallant death under a cavalry charge at Camden, the swamp-encircled camp which was Marion's fastness on the Peedee, and the cat-and-mouse game between Cornwallis and Lafayette, which ended in Cornwallis's unlucky stand at Yorktown. ", "\"Dawn's Early Light\" is the human story behind America's first war for liberty, and of men and women loving and laughing through war to the dawn of a better world."], "author": "Elswyth Thane", "num_pages": "317", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "1973-08-12 00:00:00"},
{"url": "https://www.goodreads.com/book/show/816870.Johnny_Tremain", "num_ratings": "35,411", "num_reviews": "2,046", "avg_ratings": 3.63, "genres": ["Historical", "Historical Fiction", "Fiction", "Classics", "Young Adult", "Childrens", "Historical"], "title": "Johnny Tremain", "description": ["Johnny Tremain, a young apprentice silversmith, is caught up in the danger and excitement of 1775 Boston, just before the Revolutionary War. But even more gripping than living through the drama of Revolutionary Boston is the important discovery Johnny makes in his own life."], "author": "Esther Forbes", "num_pages": "322", "awards": ["Newbery Medal (1944)"], "places": ["Boston, Massachusetts", "Massachusetts"], "character_names": ["John Hancock", "Mrs. Lapham", "Dove", "Johnny Tremain", "Cilla Lapham", "Isannah Lapham", "Dorcas Lapham", "Madge Lapham", "Dusty Miller", "Lavinia Lyte", "Sam Adams", "Paul Revere", "Rab Silsbee", "James Otis"], "language": "English", "publish_date": "1987-04-01 00:00:00", "ISBN": "0440442508"},
{"url": "https://www.goodreads.com/book/show/9684523-caleb-s-crossing", "num_ratings": "54,157", "num_reviews": "5,920", "avg_ratings": 3.82, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Audiobook"], "title": "Caleb's Crossing", "description": [" ", " Once again, Geraldine Brooks takes a remarkable shard of history and brings it to vivid life. In 1665, a young man from Martha's Vineyard became the first Native American to graduate from Harvard College. Upon this slender factual scaffold, Brooks has created a luminous tale", " ", " Once again, Geraldine Brooks takes a remarkable shard of history and brings it to vivid life. In 1665, a young man from Martha's Vineyard became the first Native American to graduate from Harvard College. Upon this slender factual scaffold, Brooks has created a luminous tale of love and faith, magic and adventure. ", " The narrator of ", " is Bethia Mayfield, growing up in the tiny settlement of Great Harbor amid a small band of pioneers and Puritans. Restless and curious, she yearns after an education that is closed to her by her sex. As often as she can, she slips away to explore the island's glistening beaches and observe its native Wampanoag inhabitants. At twelve, she encounters Caleb, the young son of a chieftain, and the two forge a tentative secret friendship that draws each into the alien world of the other. Bethia's minister father tries to convert the Wampanoag, awakening the wrath of the tribe's shaman, against whose magic he must test his own beliefs. One of his projects becomes the education of Caleb, and a year later, Caleb is in Cambridge, studying Latin and Greek among the colonial elite. There, Bethia finds herself reluctantly indentured as a housekeeper and can closely observe Caleb's crossing of cultures. ", " Like Brooks's beloved narrator Anna in ", ", Bethia proves an emotionally irresistible guide to the wilds of Martha's Vineyard and the intimate spaces of the human heart. Evocative and utterly absorbing, ", " further establishes Brooks's place as one of our most acclaimed novelists.", "Watch a Video"], "author": "Geraldine Brooks", "num_pages": "306", "awards": ["Queensland Premier's Literary Awards Nominee for Fiction (2011)", "Chautauqua Prize Nominee (2012)", "David J. Langum Sr. Prize Nominee for American Historical Fiction (Honorable Mention) (2011)", "One Book One San Diego (2013)"], "places": ["Martha's Vineyard, Massachusetts"], "character_names": ["Bethia Mayfield", "Caleb Cheeshahteaumuck", "Makepeace Mayfield", "Joel Iacoomis"], "language": "English", "publish_date": "2011-05-03 00:00:00", "ISBN": "0670021040"},
{"url": "https://www.goodreads.com/book/show/703292.The_Witch_of_Blackbird_Pond", "num_ratings": "120,196", "num_reviews": "5,248", "avg_ratings": 3.98, "genres": ["Historical", "Historical Fiction", "Young Adult", "Fiction", "Classics", "Childrens", "Historical"], "title": "The Witch of Blackbird Pond", "description": ["Orphaned Kit Tyler knows, as she gazes for the first time at the cold, bleak shores of Connecticut Colony, that her new home will never be like the shimmering Caribbean island she left behind. In her relatives' stern Puritan community, she feels like a tropical bird that has flown to the wrong part of the world, a bird that is now caged and lonely. The only place where Kit", "Orphaned Kit Tyler knows, as she gazes for the first time at the cold, bleak shores of Connecticut Colony, that her new home will never be like the shimmering Caribbean island she left behind. In her relatives' stern Puritan community, she feels like a tropical bird that has flown to the wrong part of the world, a bird that is now caged and lonely. The only place where Kit feels completely free is in the meadows, where she enjoys the company of the old Quaker woman known as the Witch of Blackbird Pond, and on occasion, her young sailor friend Nat. But when Kit's friendship with the \"witch\" is discovered, Kit is faced with suspicion, fear, and anger. She herself is accused of witchcraft!"], "author": "Elizabeth George Speare", "num_pages": "256", "awards": ["Newbery Medal (1959)", "Dorothy Canfield Fisher Children's Book Award Nominee (1960)"], "places": ["United States of America", "Connecticut"], "character_names": [], "language": "English", "publish_date": "1978-05-15 00:00:00", "ISBN": "0440995779"},
{"url": "https://www.goodreads.com/book/show/36253.The_Winthrop_Woman", "num_ratings": "4,501", "num_reviews": "349", "avg_ratings": 4.08, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Literature", "17th Century", "Romance"], "title": "The Winthrop Woman", "description": ["First published in 1958 and set in the early 17th century, this bestselling novel—and follow-up to ", "—follows Elizabeth Winthrop, a courageous Puritan woman who finds herself at odds with her heritage and surroundings. A real historical figure, Elizabeth married into the family of Governor John Winthrop of the Massachusetts Bay Colony. In those times of hardship, fa", "First published in 1958 and set in the early 17th century, this bestselling novel—and follow-up to ", "—follows Elizabeth Winthrop, a courageous Puritan woman who finds herself at odds with her heritage and surroundings. A real historical figure, Elizabeth married into the family of Governor John Winthrop of the Massachusetts Bay Colony. In those times of hardship, famine, and Indian attacks, many believed that the only way to prosper was through the strong, bigoted, and theocratic government that John Winthrop favored. Defying the government and her family, Elizabeth befriends famous heretic Anne Hutchinson, challenges an army captain, and dares to love as her heart commanded. Through Elizabeth’s three marriages, struggles with her passionate beliefs, and countless rebellions, a powerful tale of fortitude, humiliation, and ultimate triumph shines through."], "author": "Anya Seton", "num_pages": "588", "awards": ["National Book Award Finalist for Fiction (1959)"], "places": [], "character_names": [], "language": "English", "publish_date": "2006-09-01 00:00:00", "ISBN": "155652644X"},
{"url": "https://www.goodreads.com/book/show/9367479-follow-the-river", "num_ratings": "15,883", "num_reviews": "2,045", "avg_ratings": 4.21, "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Adventure"], "title": "Follow the River", "description": ["Mary Ingles was twenty-three, married, and pregnant, when Shawnee Indians invaded her peaceful Virginia settlement, killed the men and women, then took her captive. For months, she lived with them, unbroken, until she escaped, and followed a thousand mile trail to freedom--an extraordinary story of a pioneer woman who risked her life to return to her people.", "Mary Ingles was twenty-three, married, and pregnant, when Shawnee Indians invaded her peaceful Virginia settlement, killed the men and women, then took her captive. For months, she lived with them, unbroken, until she escaped, and followed a thousand mile trail to freedom--an extraordinary story of a pioneer woman who risked her life to return to her people."], "author": "James Alexander Thom", "num_pages": "416", "awards": [], "places": ["United States of America"], "character_names": ["Mary Ingles", "Will Ingles", "Gander Jack", "Henry Lenard", "Otter Girl", "Mister Harmon", "Adam Harmon", "Captain Wildcat", "Johnny Draper", "William Ingles", "Blue Ridge", "Bettie Draper", "Colonel Patton", "Bettie Elenor", "Colonel Washington", "Captain Buchanan", "John Ingles", "Dunkard's Bottom", "Elenor Draper", "Mary Draper Ingles", "Philip Lybrook", "Casper Barrier", "Snake Stick"], "language": null, "publish_date": "2010-08-11 00:00:00"}
]