[
{"url": "https://www.goodreads.com/book/show/3284885-the-celebrated-jumping-frog-of-calaveras-county", "num_ratings": "5,735", "num_reviews": "166", "avg_ratings": 3.75, "genres": ["Classics", "Short Stories", "Fiction", "Humor"], "title": "The Celebrated Jumping Frog of Calaveras County", "description": ["The Celebrated Jumping Frog of Calaveras County” is a wild yarn involving a case of mistaken identity, a gambler who’d bet on anything, and a very unusual frog named Daniel Webster."], "author": "Mark Twain", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1965-10-01 00:00:00", "ISBN": "0318518899"},
{"url": "https://www.goodreads.com/book/show/2971.The_Autobiography_of_Mark_Twain", "num_ratings": "2,923", "num_reviews": "250", "avg_ratings": 4.07, "genres": ["Biography", "Nonfiction", "Classics", "Biography", "Autobiography", "Autobiography", "Memoir"], "title": "The Autobiography of Mark Twain", "description": ["Mark Twain's autobiography is a classic of American letters, to be ranked with the autobiographies of Benjamin Franklin and Henry Adams.... It has the marks of greatness in it--style, scope, imagination, laughter, tragedy.\"--From the Introduction by Charles Neider", "Mark Twain was a figure larger than life: massive in talent, eruptive in temperament, unpredictable in his acti", "Mark Twain's autobiography is a classic of American letters, to be ranked with the autobiographies of Benjamin Franklin and Henry Adams.... It has the marks of greatness in it--style, scope, imagination, laughter, tragedy.\"--From the Introduction by Charles Neider", "Mark Twain was a figure larger than life: massive in talent, eruptive in temperament, unpredictable in his actions. He crafted stories of heroism, adventure, tragedy, and comedy that reflected the changing America of the time, and he tells his own story--which includes sixteen pages of photos--with the same flair he brought to his fiction. Writing this autobiography on his deathbed, Twain vowed to he \"free and frank and unembarrassed\" in the recounting of his life and his experiences. Twain was more than a match for the expanding America of riverboats, gold rushes, and the vast westward movement, which provided the material for his novels and which served to inspire this beloved and uniquely American autobiography."], "author": "Mark Twain", "num_pages": "508", "awards": [], "places": [], "character_names": ["Mark Twain"], "language": "English", "publish_date": "2000-11-28 00:00:00", "ISBN": "0060955422"},
{"url": "https://www.goodreads.com/book/show/102565.The_Mysterious_Stranger_and_Other_Stories", "num_ratings": "1,374", "num_reviews": "124", "avg_ratings": 4.04, "genres": ["Fiction", "Short Stories", "Classics", "Literature", "Humor"], "title": "The Mysterious Stranger and Other Stories", "description": ["Nine tales showcase Twain's wit as he skewers greed and hypocrisy—and makes a memorable, tormenting statement on evil.", "The celebrated jumping frog of Calaveras County (1865)", "The facts concerning the recent carnival of crime in Connecticut (1876)", "The stolen white elephant (1882)", "Luck (1891)", "The £1,000,000 bank-note (1893)", "The man that corrupted Hadleyburg (1899)", "The five boons of", "Nine tales showcase Twain's wit as he skewers greed and hypocrisy—and makes a memorable, tormenting statement on evil.", "The celebrated jumping frog of Calaveras County (1865)", "The facts concerning the recent carnival of crime in Connecticut (1876)", "The stolen white elephant (1882)", "Luck (1891)", "The £1,000,000 bank-note (1893)", "The man that corrupted Hadleyburg (1899)", "The five boons of life (1902)", "Was it heaven? or hell? (1902)", "The mysterious stranger (1916)"], "author": "Mark Twain", "num_pages": "272", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-02-03 00:00:00", "ISBN": "0451529243"},
{"url": "https://www.goodreads.com/book/show/608288.A_Murder_a_Mystery_and_a_Marriage", "num_ratings": "781", "num_reviews": "123", "avg_ratings": 3.24, "genres": ["Fiction", "Classics", "Mystery", "Literature", "Humor", "Short Stories"], "title": "A Murder, a Mystery and a Marriage", "description": ["Set in the quaint hollow of Deer Lick, a mythical town resembling Mark Twain's Hannibal, Missouri, this bizarre tale chronicles the fortunes of humble farmer John Gray, determined to marry off his daughter Mary to the scion of the town's wealthiest family."], "author": "Mark Twain", "num_pages": "112", "awards": [], "places": ["United States of America"], "character_names": ["Mary Gray", "David Gray", "John Gray", "Hugh Gregory", "the Count of Fountainebleau"], "language": "English", "publish_date": "2001-09-04 00:00:00", "ISBN": "0393043762"},
{"url": "https://www.goodreads.com/book/show/333026.On_the_Damned_Human_Race", "num_ratings": "208", "num_reviews": "22", "avg_ratings": 4.2, "genres": ["Humor", "Classics", "Philosophy", "Classics", "Classic Literature", "Nonfiction"], "title": "On the Damned Human Race", "description": ["Magnificent collection of Mark Twain's topical writings, mainly and most eloquently concerned with the themes of social justice, the American Civilization"], "author": "Mark Twain", "num_pages": "259", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1962-01-01 00:00:00", "ISBN": "1566195268"},
{"url": "https://www.goodreads.com/book/show/2282061.On_Masturbation", "num_ratings": "476", "num_reviews": "28", "avg_ratings": 3.64, "genres": ["Humor", "Nonfiction", "Literature", "Literature", "American"], "title": "On Masturbation", "description": ["America's Master Humorist on Masturbation... One evening in Paris in 1879, Mark Twain rose to the podium and tackled the touchiest of subjects. His hilarious remarks rubbed Victorian society the wrong way and were censored for many decades. At long last, here is Mark Twain's complete treatise on 'The Science of Onanism,' along with many uplifting illustrations."], "author": "Mark Twain", "num_pages": "36", "awards": [], "places": [], "character_names": [], "language": null, "publish_date": "2007-09-20 00:00:00", "ISBN": "1419677624"},
{"url": "https://www.goodreads.com/book/show/2952.Huck_Finn_and_Tom_Sawyer_Among_the_Indians", "num_ratings": "236", "num_reviews": "33", "avg_ratings": 3.58, "genres": ["Classics", "Fiction", "Literature", "American", "Adventure", "Historical", "Historical Fiction"], "title": "Huck Finn and Tom Sawyer Among the Indians", "description": ["In 1885 while ", " was becoming one of the best-selling American classics of modern times, Mark Twain began this sequel in which Huck Finn, Tom Sawyer and Jim head west on the trail of two white girls kidnapped by Sioux warriors, learning the hard way that \"book Injuns and real Injuns ain't the same.\" Fifteen thousand words into the work, Twai", "In 1885 while ", " was becoming one of the best-selling American classics of modern times, Mark Twain began this sequel in which Huck Finn, Tom Sawyer and Jim head west on the trail of two white girls kidnapped by Sioux warriors, learning the hard way that \"book Injuns and real Injuns ain't the same.\" Fifteen thousand words into the work, Twain stopped in the middle of a sentence, never to go back; the unfinished story sitting on dusty shelves for more than a hundred years until The University of California cut a deal with Utah author Lee Nelson to finish it."], "author": "Mark Twain", "num_pages": "277", "awards": [], "places": [], "character_names": ["Tom Sawyer"], "language": "English", "publish_date": "2003-04-22 00:00:00", "ISBN": "1555176801"},
{"url": "https://www.goodreads.com/book/show/1045370.Mark_Twain_s_Civil_War", "num_ratings": "6", "num_reviews": "3", "avg_ratings": 3.33, "genres": [], "title": "Mark Twain's Civil War", "description": ["When the Civil War halted steamboat travel on the Mississippi River in 1861, an unemployed riverboat pilot named Samuel Clemens enlisted in the Missouri militia. After two weeks of service, Clemens abandoned his post and fled westward to begin a writing career -- a turn of events that precipitated the rise to fame of the man who would become known as Mark Twain. The circum", "When the Civil War halted steamboat travel on the Mississippi River in 1861, an unemployed riverboat pilot named Samuel Clemens enlisted in the Missouri militia. After two weeks of service, Clemens abandoned his post and fled westward to begin a writing career -- a turn of events that precipitated the rise to fame of the man who would become known as Mark Twain. The circumstances surrounding his departure are unclear; some view Twain as a deserter, while others call into question the nature of his commitment from the beginning. Twain defended himself in speeches and in print, offering varying accounts -- with varying degrees of truth -- of his confusion upon enrollment, his ignorance of the moral and political forces behind the war, and his claim to have killed a man while hiding in a corncrib. Regardless of the reason for his desertion, his personal experiences and the Civil War in general are recurring topics in Twain's speeches, fiction, and nonfiction. In addition to broaching the issue in longer works, such as Life on the Mississippi and The Gilded Age, Twain directly addresses it in shorter pieces such as \"The Private History of a Campaign That Failed\" and \"A Curious Experience.\" Editor David Rachels unites these selections in Mark Twain's Civil War, offering Twain fans and Civil War scholars the unprecedented opportunity to read the entire array of Twain's Civil War-influenced literature in one volume. In addition to Twain's own pieces, Rachels includes an account of Twain's war career by his official biographer as well as a story by Absalom C. Grimes, a Confederate mail runner who claims to have served with Twain early in the war. An introduction by Rachels completes the text, which analyzes Twain's military stint and assesses the war's profound influence on one of America's most celebrated authors."], "author": "Mark Twain", "num_pages": "220", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2007-11-09 00:00:00", "ISBN": "0813124743"},
{"url": "https://www.goodreads.com/book/show/3228046-the-facts-concerning-the-recent-carnival-of-crime-in-connecticut-fenimor", "num_ratings": "123", "num_reviews": "12", "avg_ratings": 3.89, "genres": ["Humor", "Classics", "Short Stories", "Fiction", "Literature", "American"], "title": "The Facts Concerning the Recent Carnival of Crime in Connecticut/Fenimore Cooper's Literary Offences", "description": ["Samuel Langhorne Clemens (1835-1910), better known by the pen name Mark Twain, was an American humorist, satirist, lecturer and writer. Twain is most noted for his novels The Adventures of Tom Sawyer (1876) and Adventures of Huckleberry Finn (1885). He is also known for his quotations. His first important work, The Celebrated Jumping Frog of Calaveras County, was published", "Samuel Langhorne Clemens (1835-1910), better known by the pen name Mark Twain, was an American humorist, satirist, lecturer and writer. Twain is most noted for his novels The Adventures of Tom Sawyer (1876) and Adventures of Huckleberry Finn (1885). He is also known for his quotations. His first important work, The Celebrated Jumping Frog of Calaveras County, was published in 1865. His next publication was The Adventures of Tom Sawyer, which drew on his youth in Hannibal. The character of Tom Sawyer was modeled on twain as a child, with traces of two schoolmates, John Briggs and Will Bowen. His next major published work, Adventures of Huckleberry Finn, solidified him as a noteworthy American writer. Some have called it the first Great American Novel. Finn was an offshoot from Tom Sawyer and proved to have a more serious tone than its predecessor. The main premise behind Huckleberry Finn is the young boy's belief in the right thing to do even though the majority of society believes that it was wrong."], "author": "Mark Twain", "num_pages": "48", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2008-02-01 00:00:00", "ISBN": "1406571237"},
{"url": "https://www.goodreads.com/book/show/2010710.The_American_Claimant", "num_ratings": "215", "num_reviews": "21", "avg_ratings": 3.57, "genres": ["Classics", "Fiction", "Humor", "Literature", "American"], "title": "The American Claimant", "description": ["\"The American Claimant is enormous fun. I'm here to celebrate the mad energy of this strange novel. In it we have the pleasure of seeing Mark Twain's imagination go berserk,\" writes Bobbie Ann Mason in her introduction. The American Claimant is a comedy of mistaken identities and multiple role switches--fertile and familiar Mark Twain territory. Its cast of characters incl", "\"The American Claimant is enormous fun. I'm here to celebrate the mad energy of this strange novel. In it we have the pleasure of seeing Mark Twain's imagination go berserk,\" writes Bobbie Ann Mason in her introduction. The American Claimant is a comedy of mistaken identities and multiple role switches--fertile and familiar Mark Twain territory. Its cast of characters include an American enamored of British hereditary aristocracy and a British earl entranced by American democracy. The central character, Colonel Mulberry Sellers, is an irrepressible, buoyant mad scientist, Mason writes, \"brimming with harebrained ideas. Nothing is impossible for him.... He's totally loopy.\" His voluble wackiness leaves the reader reeling in the wake of inventions that prefigure DNA cloning, fax machines, and photocopiers. Twain uses this over-the-top comic frame to explore some serious issues as well--such as the construction of self and identity, the role of the press in society, and the moral and social questions raised by capitalism and industrialization in the United States. A unique melange of science fiction and fantasy, romance, farce, and political satire, Twain's least-known comic novel is both thought-provoking and entertaining."], "author": "Mark Twain", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1997-03-06 00:00:00", "ISBN": "0195114124"},
{"url": "https://www.goodreads.com/book/show/62390.Tom_Sawyer_Abroad", "num_ratings": "1,746", "num_reviews": "169", "avg_ratings": 3.38, "genres": ["Adventure", "Young Adult", "Literature", "Humor", "Classics", "Literature", "19th Century"], "title": "Tom Sawyer Abroad", "description": ["Twain's sequel to his classic novels, The Adventures of Tom Sawyer and The Adventures of Huckleberry Finn."], "author": "Mark Twain", "num_pages": "108", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-03-25 00:00:00", "ISBN": "1587157047"},
{"url": "https://www.goodreads.com/book/show/98906.The_Gilded_Age", "num_ratings": "971", "num_reviews": "114", "avg_ratings": 3.56, "genres": ["Fiction", "Literature", "Humor", "Classics"], "title": "The Gilded Age", "description": ["Arguably the first major American novel to satirize the political milieu of Washington, D.C. and the wild speculation schemes that exploded across the nation in the years that followed the Civil War, ", " gave this remarkable era its name. Co-written by Mark Twain and Charles Dudley Warner, this rollicking novel is rife with unscrupulous politicians, colorful plu", "Arguably the first major American novel to satirize the political milieu of Washington, D.C. and the wild speculation schemes that exploded across the nation in the years that followed the Civil War, ", " gave this remarkable era its name. Co-written by Mark Twain and Charles Dudley Warner, this rollicking novel is rife with unscrupulous politicians, colorful plutocrats, and blindly optimistic speculators caught up in a frenzy of romance, murder, and surefire deals gone bust. First published in 1873 and filled with unforgettable characters such as the vainglorious Colonel Sellers and the ruthless Senator Dilsworthy, ", " is a hilarious and instructive lesson in American history.", "Introduction by Ron Powers", "Includes Newly Commissioned Endnotes"], "author": "Mark Twain", "num_pages": "528", "awards": [], "places": ["Tennessee", "Washington, D.C."], "character_names": [], "language": "English", "publish_date": "2006-03-14 00:00:00", "ISBN": "0812973569"},
{"url": "https://www.goodreads.com/book/show/18285685-not-so-innocently-abroad", "num_ratings": "9", "num_reviews": "2", "avg_ratings": 4.0, "genres": ["Cultural", "Russia"], "title": "Not So Innocently Abroad: Official State Department Tour or Sinister Government Plot to Disappear Me?", "description": ["From award-winning actor and playwright Ken Richters comes this original, irreverent, and funny travel memoir of his month-long U.S. State Department goodwill tour of Russia and Ukraine as Mark Twain. ", "After spending more than 30 years performing as Mark Twain, satirizing every government official and politician within earshot, American actor and playwright Ken Richters got", "From award-winning actor and playwright Ken Richters comes this original, irreverent, and funny travel memoir of his month-long U.S. State Department goodwill tour of Russia and Ukraine as Mark Twain. ", "After spending more than 30 years performing as Mark Twain, satirizing every government official and politician within earshot, American actor and playwright Ken Richters got a call from the U.S. Department of State asking him to leave the country for the former Soviet Union, causing the author to wonder if the proposed trip was an official State Department goodwill tour, or sinister government plot by one of the many politicians and government officials he offended during his career (including seven U.S. senators, fifteen past and present members of Congress, twenty-six state governors, countless local politicians from all fifty states and a sitting justice of the United States Supreme Court). Were they working to have him permanently disappeared? ", "Originally scheduled for two shows in Moscow, the mission was extended for nearly a month to retrace Twain's travels in Eastern Europe. The book chronicles performance stops in Moscow, Kiev, Odessa, Simferopol, Sevastopol, and the Livadia Palace in Yalta--almost causing a diplomatic incident involving the Russian Black Sea Fleet. Other highlights include hallucinating on a road trip to Crimea, seeing a naked Oprah Winfrey and matryoshka doll-juggling monkey riding shotgun after self-medicating in an attempt to cure the Crimean Croup. You'll enjoy reading how Richters unknowingly made the same observation about the beauty of Ukrainian women that caused Vice President Joe Biden public ridicule, and how that elevated Richters to a Ukrainian media cause celebré."], "author": "Ken Richters", "num_pages": "202", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2013-07-22 00:00:00", "ISBN": "0984720499"},
{"url": "https://www.goodreads.com/book/show/436569.The_Devil_s_Race_Track", "num_ratings": "78", "num_reviews": "3", "avg_ratings": 4.03, "genres": ["Fiction", "Religion", "Short Stories", "Classics"], "title": "The Devil's Race-Track: Mark Twain's Great Dark Writings", "description": ["Mark Twain explores the darker side of life in these lesser-known later writings dealing with personal tragedies, nightmarish world events, and a doubtful cosmic order. He views his own situation as that of a ship trapped in a fearsome Bermuda Triangle-like region, the ", "He sees history as a treadmill of endlessly and monotonously repeated events. And he", "Mark Twain explores the darker side of life in these lesser-known later writings dealing with personal tragedies, nightmarish world events, and a doubtful cosmic order. He views his own situation as that of a ship trapped in a fearsome Bermuda Triangle-like region, the ", "He sees history as a treadmill of endlessly and monotonously repeated events. And he conceives of a universal food chain, a vast round of devourers who in their turn become victims, humankind and God included. The tone of these writings is lightened considerably by Mark Twain's sagely ironic humor and his warmth, which together balance his tough-mindedness. And even when he shows the human race caught in some vicious circle, he may be seen courageously seeking a way out and at times believing he has found it."], "author": "Mark Twain", "num_pages": "405", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2005-03-17 00:00:00", "ISBN": "0520238931"},
{"url": "https://www.goodreads.com/book/show/642546.The_30_000_Bequest_and_Other_Stories", "num_ratings": "351", "num_reviews": "35", "avg_ratings": 3.51, "genres": ["Fiction", "Short Stories", "Classics", "Humor", "Literature", "American"], "title": "The $30,000 Bequest and Other Stories", "description": ["The $30,000 Bequest and Other Stories\" was the final collection Twain assembled in his lifetime, and it's a momentous volume indeed, including titles that come from every part of his career. It includes \"A Dog's Tale,\" \"Was It Heaven? Or Hell?,\" \"A Cure for the Blues,\" \"The Curious Book,\" \"The Californian's Tale,\" \"A Helpless Situation,\" \"A Telephonic Conversation,\" \"Edwar", "The $30,000 Bequest and Other Stories\" was the final collection Twain assembled in his lifetime, and it's a momentous volume indeed, including titles that come from every part of his career. It includes \"A Dog's Tale,\" \"Was It Heaven? Or Hell?,\" \"A Cure for the Blues,\" \"The Curious Book,\" \"The Californian's Tale,\" \"A Helpless Situation,\" \"A Telephonic Conversation,\" \"Edward Mills and George Benton,\" \"The Five Boons of Life,\" \"The First Writing-Machines,\" \"Italian without a Master,\" \"Italian with Grammar,\" \"A Burlesque Biography,\" \"How to Tell a Story,\" \"General Washington's Negro Body-Servant,\" \"Wit Inspirations of the 'Two-Year-Olds, '\" \"An Entertaining Article,\" \"A Letter to the Secretary of the Treasury,\" \"Amended Obituaries,\" \"A Monument to Adam,\" \"A Humane Word from Satan,\" \"Introduction to 'The New Guide of the Conversation in Portuguese and English, '\" \"Advice to Little Girls,\" \"Post-Mortem Poetry,\" \"The Danger of Lying in Bed,\" \"Portrait of King William III,\" \"Does the Race of Man Love a Lord?,\" \"Extracts from Adam's Diary,\" and \"Eve's Diary."], "author": "Mark Twain", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "140681296X"},
{"url": "https://www.goodreads.com/book/show/2967.Mark_Twain_s_Helpful_Hints_for_Good_Living", "num_ratings": "615", "num_reviews": "85", "avg_ratings": 3.85, "genres": ["Humor", "Nonfiction", "Classics"], "title": "Mark Twain's Helpful Hints for Good Living: A Handbook for the Damned Human Race", "description": ["Irreverent, charming, eminently quotable, this handbook—an eccentric etiquette guide for the human race—contains sixty-nine aphorisms, anecdotes, whimsical suggestions, maxims, and cautionary tales from Mark Twain's private and published writings. It dispenses advice and reflections on family life and public manners; opinions on topics such as dress, health, food, and chil", "Irreverent, charming, eminently quotable, this handbook—an eccentric etiquette guide for the human race—contains sixty-nine aphorisms, anecdotes, whimsical suggestions, maxims, and cautionary tales from Mark Twain's private and published writings. It dispenses advice and reflections on family life and public manners; opinions on topics such as dress, health, food, and childrearing and safety; and more specialized tips, such as those for dealing with annoying salesmen and burglars. Culled from Twain's personal letters, autobiographical writings, speeches, novels, and sketches, these pieces are delightfully fresh, witty, startlingly relevant, and bursting with Twain's characteristic ebullience for life. They also remind us exactly how Mark Twain came to be the most distinctive and well-known American literary voice in the world. These texts, some of them new or out of print for decades, have been selected and meticulously prepared by the editors at the Mark Twain Project."], "author": "Mark Twain", "num_pages": "221", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2004-10-18 00:00:00", "ISBN": "0520242459"},
{"url": "https://www.goodreads.com/book/show/380793.The_Man_That_Corrupted_Hadleyburg_and_Other_Short_Works", "num_ratings": "250", "num_reviews": "37", "avg_ratings": 3.52, "genres": ["Fiction", "Classics", "Short Stories", "Humor"], "title": "The Man That Corrupted Hadleyburg and Other Short Works", "description": ["Hadleyburg prides itself on a reputation of incorruptible citizens until an offended stranger vows revenge, trapping the most sanctimonious by letters promising a fortune. Also 14 short works of fiction and \"truth\": his reporter debut, rescue of shipwrecked sailors, his first lie comments on white lies, petition to Queen Victoria on taxes, \"Esquimau Maiden's Romance\", a de", "Hadleyburg prides itself on a reputation of incorruptible citizens until an offended stranger vows revenge, trapping the most sanctimonious by letters promising a fortune. Also 14 short works of fiction and \"truth\": his reporter debut, rescue of shipwrecked sailors, his first lie comments on white lies, petition to Queen Victoria on taxes, \"Esquimau Maiden's Romance\", a detective story, and others."], "author": "Mark Twain", "num_pages": "379", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2002-10-01 00:00:00", "ISBN": "1573929999"},
{"url": "https://www.goodreads.com/book/show/20240480-tom-sawyer-detective", "num_ratings": "1,605", "num_reviews": "115", "avg_ratings": 3.56, "genres": ["Classics", "Fiction", "Mystery", "Adventure"], "title": "Tom Sawyer, Detective", "description": ["Classic CD Books speaks new life into Mark Twain's greatest detective story. In this once-celebrated sequel of The Adventures of Tom Sawyer and Huckleberry Finn, Tom and Huck get rescued from spring fever by a serendipitous trip to visit Tom's Uncle Silas. But little did the family know, Tom would be the one to rescue Uncle Silas -- and from much more."], "author": "Mark Twain", "num_pages": "82", "awards": [], "places": [], "character_names": ["Huckleberry Finn", "Tom Sawyer"], "language": "English", "publish_date": "2012-08-13 00:00:00"},
{"url": "https://www.goodreads.com/book/show/333033.A_Tramp_Abroad", "num_ratings": "2,016", "num_reviews": "200", "avg_ratings": 3.86, "genres": ["Travel", "Classics", "Nonfiction", "Humor", "Literature"], "title": "A Tramp Abroad", "description": ["Twain's abundant humor waxes as freely as ever; this time, however, his amusement bears a more cynical cast, as he regards the grand tourist sights of 'Innocents' through older and more experienced eyes."], "author": "Mark Twain", "num_pages": "287", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2006-11-01 00:00:00", "ISBN": "1406813052"},
{"url": "https://www.goodreads.com/book/show/826706.Joan_of_Arc", "num_ratings": "5,011", "num_reviews": "664", "avg_ratings": 4.06, "genres": ["Classics", "Historical", "Historical Fiction", "Fiction"], "title": "Joan of Arc", "description": ["\"I like ", " best of all my books; and it is the best; I know it perfectly well. And besides, it furnished me seven times the pleasure afforded me by any of the others; twelve years of preparation, and two years of writing. The others needed no preparation and got none.\" --Mark Twain", "\"Mark Twain comes furtively like Nicodemus at night with this tribute to one of God'", "\"I like ", " best of all my books; and it is the best; I know it perfectly well. And besides, it furnished me seven times the pleasure afforded me by any of the others; twelve years of preparation, and two years of writing. The others needed no preparation and got none.\" --Mark Twain", "\"Mark Twain comes furtively like Nicodemus at night with this tribute to one of God's saints. In doing so he tells a secret about himself. It is as though the man in a white suit and a cloud of cigar smoke thought there just might be a place where people in white robes stand in clouds of incense.\" --Fr. George Rutler, Author, ", "\"Joan of Arc is the lone example that history affords of an actual, real embodiment of all the virtues demonstrated by Huck and Jim and of all that Twain felt to be noble in man, Joan is the ideal toward which mankind strives. Twain had to tell her story because she is the sole concrete argument against the pessimistic doctrines of his deterministic philosophy.\" --Robert Wiggins, "], "author": "Mark Twain", "num_pages": "455", "awards": [], "places": ["France"], "character_names": ["Joan of Arc"], "language": "English", "publish_date": "1989-09-01 00:00:00", "ISBN": "0898702682"},
{"url": "https://www.goodreads.com/book/show/8093987-personal-recollections-of-joan-of-arc---book-1", "num_ratings": "265", "num_reviews": "35", "avg_ratings": 4.15, "genres": ["Classics", "Historical", "Historical Fiction", "Fiction", "Feminism", "Historical"], "title": "Personal Recollections of Joan of Arc - Book 1", "description": ["This edition is the first book (of three) in Mark Twain's renowned story of Saint Joan of Arc. His novel is warm and heartfelt while still containing his classic humor and wit. This first book, \"In Domremy,\" covers Joan's childhood, her adolescence when she begins hearing the voices of saints, and her journey to see the King of France.", "This is a very good introduction to th", "This edition is the first book (of three) in Mark Twain's renowned story of Saint Joan of Arc. His novel is warm and heartfelt while still containing his classic humor and wit. This first book, \"In Domremy,\" covers Joan's childhood, her adolescence when she begins hearing the voices of saints, and her journey to see the King of France.", "This is a very good introduction to the life of Joan of Arc for readers of all ages. It is entertaining enough to hold the imaginations of children without delving too deeply into the harsher elements of war and imprisonment. For older readers, Mark Twain's Personal Recollections of Joan of Arc is also an extremely accurate account of her entire life. Twain spent twelve years researching in the libraries of Paris before he spent and additional two years writing.", "If you have not read this book before, you should read the novel that Mark Twain considered his best. It is perhaps the greatest example of courage in all the stories ARose Books may publish.", "About the original publication of Personal Recollections of Joan of Arc:", " When the book was originally published as a serial in Harper's Magazine with the April 1895 issue, it was unsigned and the public generally assumed that it was a translation done by Jean François Alden of the memoirs of Sieur Louis de Conte, a friend and constant companion of St. Joan of Arc during her lifetime. It was some time before the reading public found out that the author was Mark Twain, much to their surprise as mine. ", "Mark Twain's opinion of his work:", " \"I like Joan of Arc best of all my books; and it is the best; I know it perfectly well. And besides, it furnishedme seven times the pleasure afforded me by any of the others; twelve years of preparation, and two years of writing.\"", " ~ Mark Twain"], "author": "Mark Twain", "num_pages": "0", "awards": [], "places": [], "character_names": ["Joan of Arc"], "language": null, "publish_date": "2009-08-20 00:00:00"},
{"url": "https://www.goodreads.com/book/show/38747.Roughing_It", "num_ratings": "7,135", "num_reviews": "668", "avg_ratings": 3.88, "genres": ["Classics", "Travel", "Fiction", "Humor"], "title": "Roughing It", "description": ["Though known throughout the world for his fictional novels ", " and ", " Mark Twain was also a skilled chronicler of his own life and experiences. In his youth, Twain traveled extensively throughout the untamed American West with his brother, working his way from town to town in a variety of jobs, including gold prospector", "Though known throughout the world for his fictional novels ", " and ", " Mark Twain was also a skilled chronicler of his own life and experiences. In his youth, Twain traveled extensively throughout the untamed American West with his brother, working his way from town to town in a variety of jobs, including gold prospector, reporter, and lecturer. ", " is Twain's personal recollection of his wanderlust years. It is a wildly humorous adventure yarn that combines hard facts with a healthy dose of the author's unique perspective, one that helped define the course of American literature."], "author": "Mark Twain", "num_pages": "560", "awards": [], "places": ["Overland City", "Mount Davidson", "Coriantumr"], "character_names": ["Samuel \"Mark Twain\" Clemens", "Mr. Higbie", "Jules Beni", "Mr. Ballou", "Young Claggett <sic>", "Oliphant", "Col. Jack", "Tom Reeder", "Bill Noakes", "Kamehameha I.", "George Gumbert", "Ned Blakely", "Ollendorff", "Philip Lynch", "Kaahumanu", "Roop", "Alexander Davis", "Kalaimoku", "Mr. Blucher", "King Liholiho", "Mormondom", "J. Smith", "J. A. Slade", "John James Godfrey", "Scotty Briggs", "Buncombe", "Mrs. Beazely", "Buck Fanshaw", "Mr. Curry", "Judge Cradlebaugh", "Mr. Arkansas", "Winthrop L. Willis", "Mrs. O'Flannigan", "Mr. Van Dorn", "Marshall Rodgers", "Uncle Lem", "John H. Morgan", "Mr. Street", "Markiss", "SIMON ERICKSON", "William Kanui", "John B. Winters", "Mr. W.", "Dr. Owens", "Sile Hawkins", "Dollinger", "Mrs. C. V. Waite", "Miss Wagner", "Mr. Ben Holliday", "Miss Jacops", "Mr. Dimsdale", "Joe McGee", "Mr. Jules", "MARTIN HARRIS"], "language": "English", "publish_date": "2003-04-29 00:00:00", "ISBN": "0743436504"},
{"url": "https://www.goodreads.com/book/show/594984.Jumping_Frog", "num_ratings": "5,735", "num_reviews": "166", "avg_ratings": 3.75, "genres": ["Classics", "Short Stories", "Fiction", "Humor"], "title": "Jumping Frog", "description": ["Mark Twain's Notorious Jumping Frog of Calaveras County is a story of the crusty Jim Smiley, a man who so loved to bet on animals - horses, dogs, etc. - that he trained a frog to be the strongest jumper in his county. Twain's broad yet graceful humor is beautifully complemented by the elegant woodcuts of Alan James Robinson. Finely reproduced, these illustrations bring Twa", "Mark Twain's Notorious Jumping Frog of Calaveras County is a story of the crusty Jim Smiley, a man who so loved to bet on animals - horses, dogs, etc. - that he trained a frog to be the strongest jumper in his county. Twain's broad yet graceful humor is beautifully complemented by the elegant woodcuts of Alan James Robinson. Finely reproduced, these illustrations bring Twain's great comic tale to life. Twain's classic tale of the Notorious Jumping Frog of Calaveras County is in three parts: the original tale published in 1865, the first French translation of the story, and Twain's tongue-in-cheek verbatim re-translation into English."], "author": "Mark Twain", "num_pages": "80", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1998-09-10 00:00:00", "ISBN": "1559210974"},
{"url": "https://www.goodreads.com/book/show/37813.Letters_from_the_Earth", "num_ratings": "6,689", "num_reviews": "410", "avg_ratings": 4.23, "genres": ["Fiction", "Classics", "Humor", "Religion", "Short Stories", "Literature"], "title": "Letters from the Earth: Uncensored Writings", "description": ["Letters from the Earth is one of Mark Twain's posthumously published works. The essays were written during a difficult time in Twain's life; he was deep in debt and had lost his wife and one of his daughters. The book consists of a series of short stories, many of which deal with God and Christianity. Twain penned a series of letters from the point-of-view of a dejected an", "Letters from the Earth is one of Mark Twain's posthumously published works. The essays were written during a difficult time in Twain's life; he was deep in debt and had lost his wife and one of his daughters. The book consists of a series of short stories, many of which deal with God and Christianity. Twain penned a series of letters from the point-of-view of a dejected angel on Earth. This title story consists of letters written by the archangel Satan to archangels, Gabriel and Michael, about his observations on the curious proceedings of earthly life and the nature of man's religions. By analyzing the idea of heaven and God that is widely accepted by those who believe in both, Twain is able to take the silliness that is present and study it with the common sense that is absent. Not so much an attack as much as a cold dissection. Other short stories in the book include a bedtime story about a family of cats Twain wrote for his daughters, and an essay explaining why an anaconda is morally superior to Man. Twain's writings in Letters From the Earth find him at perhaps his most quizzical and questioning state ever."], "author": "Mark Twain", "num_pages": "321", "awards": ["Grammy Award Nominee for Best Spoken Word Album (2002)"], "places": [], "character_names": ["God"], "language": "English", "publish_date": "2004-02-17 00:00:00", "ISBN": "0060518650"},
{"url": "https://www.goodreads.com/book/show/2968.The_Complete_Short_Stories_of_Mark_Twain", "num_ratings": "5,813", "num_reviews": "178", "avg_ratings": 4.28, "genres": ["Classics", "Short Stories", "Fiction", "Literature"], "title": "The Complete Short Stories of Mark Twain", "description": ["For deft plotting, riotous inventiveness, unforgettable characters, and language that brilliantly captures the lively rhythms of American speech, no American writer comes close to Mark Twain. This sparkling anthology covers the entire span of Twain’s inimitable yarn-spinning, from his early broad comedy to the biting satire of his later years.", "For deft plotting, riotous inventiveness, unforgettable characters, and language that brilliantly captures the lively rhythms of American speech, no American writer comes close to Mark Twain. This sparkling anthology covers the entire span of Twain’s inimitable yarn-spinning, from his early broad comedy to the biting satire of his later years."], "author": "Mark Twain", "num_pages": "848", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1984-03-01 00:00:00", "ISBN": "0553211951"},
{"url": "https://www.goodreads.com/book/show/102564.The_Mysterious_Stranger", "num_ratings": "6,640", "num_reviews": "465", "avg_ratings": 4.15, "genres": ["Classics", "Fiction", "Fantasy", "Literature", "Short Stories"], "title": "The Mysterious Stranger", "description": ["In his last years, Mark Twain had become a respected literary figure whose opinions were widely sought by the press. He had also suffered a series of painful physical, economic, and emotional losses.", ", published posthumously in 1916 and belonging to Twain's \"dark\" period, belies the popular image of the affable American humorist. In this anti-religiou", "In his last years, Mark Twain had become a respected literary figure whose opinions were widely sought by the press. He had also suffered a series of painful physical, economic, and emotional losses.", ", published posthumously in 1916 and belonging to Twain's \"dark\" period, belies the popular image of the affable American humorist. In this anti-religious tale, Twain denies the existence of a benign Providence, a soul, an after-life, and even reality itself. As the Stranger in the story asserts, \"nothing exists; all is a dream.\""], "author": "Mark Twain", "num_pages": "121", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "1995-09-01 00:00:00", "ISBN": "1573920398"},
{"url": "https://www.goodreads.com/book/show/108202.The_Diary_of_Adam_and_Eve", "num_ratings": "10,976", "num_reviews": "1,059", "avg_ratings": 3.95, "genres": ["Classics", "Fiction", "Humor", "Short Stories", "Literature", "Religion"], "title": "The Diary of Adam and Eve", "description": ["This is Mark Twain's imaginative series of diary entries by Adam and Eve. At first, Adam is puzzled by this new arrival, Eve, in the garden, and he is suspicious of her disturbing appetite for fruit. Eve, believing herself to be some sort of experiment, is curious about another experiment in the garden,", "This is Mark Twain's imaginative series of diary entries by Adam and Eve. At first, Adam is puzzled by this new arrival, Eve, in the garden, and he is suspicious of her disturbing appetite for fruit. Eve, believing herself to be some sort of experiment, is curious about another experiment in the garden, perhaps some sort of reptile or possibly architecture. Eve gives names to everything, much to Adam's annoyance. He tries to ignore her, so she seeks companionship among the animals particularly with a certain snake. Adam and Eve grow to love each other and, in the end, an elderly Adam is filled with a realization of that love as he stands at Eve's grave."], "author": "Mark Twain", "num_pages": "95", "awards": ["Audie Award for Multi-Voiced Narration (2000)"], "places": [], "character_names": [], "language": "English", "publish_date": "2002-07-01 00:00:00", "ISBN": "1843910055"},
{"url": "https://www.goodreads.com/book/show/682793.Pudd_nhead_Wilson", "num_ratings": "14,516", "num_reviews": "923", "avg_ratings": 3.74, "genres": ["Classics", "Fiction", "Literature", "Humor"], "title": "Pudd'nhead Wilson", "description": ["At the beginning of ", " a young slave woman, fearing for her infant's son's life, exchanges her light-skinned child with her master's.  From this rather simple premise Mark Twain fashioned one of his most entertaining, funny, yet biting novels.  On its surface, ", " possesses all the elements of an engrossing nineteenth-century mystery:  reversed", "At the beginning of ", " a young slave woman, fearing for her infant's son's life, exchanges her light-skinned child with her master's.  From this rather simple premise Mark Twain fashioned one of his most entertaining, funny, yet biting novels.  On its surface, ", " possesses all the elements of an engrossing nineteenth-century mystery:  reversed identities, a horrible crime, an eccentric detective, a suspenseful courtroom drama, and a surprising, unusual solution.  Yet it is not a mystery novel.  Seething with the undercurrents of antebellum southern culture, the book is a savage indictment in which the real criminal is society, and racial prejudice and slavery are the crimes.  Written in 1894, ", " glistens with characteristic Twain humor, with suspense, and with pointed irony:  a gem among the author's later works."], "author": "Mark Twain", "num_pages": "160", "awards": [], "places": ["United States of America", "Missouri"], "character_names": ["David Pudd'nhead Wilson", "Roxanne"], "language": "English", "publish_date": "1984-08-12 00:00:00", "ISBN": "0553211587"},
{"url": "https://www.goodreads.com/book/show/99152.Life_on_the_Mississippi", "num_ratings": "11,050", "num_reviews": "621", "avg_ratings": 3.89, "genres": ["Classics", "Nonfiction", "History", "Travel", "Biography", "Autobiography", "Memoir"], "title": "Life on the Mississippi", "description": ["A stirring account of America's vanished past...", " The book that earned Mark Twain his first recognition as a serious writer... ", " Discover the magic of life on the Mississippi. ", " At once a romantic history of a mighty river, an autobiographical account of Mark Twain's early steamboat days, and a storehouse of humorous anecdotes and sketches, ", " is the raw", "A stirring account of America's vanished past...", " The book that earned Mark Twain his first recognition as a serious writer... ", " Discover the magic of life on the Mississippi. ", " At once a romantic history of a mighty river, an autobiographical account of Mark Twain's early steamboat days, and a storehouse of humorous anecdotes and sketches, ", " is the raw material from which Twain wrote his finest novel: ", ". ", " \"The Lincoln of our literature.\" (William Dean Howells)"], "author": "Mark Twain", "num_pages": "384", "awards": [], "places": ["United States of America", "Mississippi River"], "character_names": ["Samuel Clemens"], "language": "English", "publish_date": "2001-11-12 00:00:00", "ISBN": "0451528174"},
{"url": "https://www.goodreads.com/book/show/2443.The_Innocents_Abroad", "num_ratings": "9,804", "num_reviews": "817", "avg_ratings": 3.86, "genres": ["Travel", "Classics", "Nonfiction", "Humor"], "title": "The Innocents Abroad", "description": ["is one of the most prominent and influential travel books ever written about Europe and the Holy Land."], "author": "Mark Twain", "num_pages": "560", "awards": [], "places": [], "character_names": [], "language": "English", "publish_date": "2003-02-11 00:00:00", "ISBN": "0812967054"},
{"url": "https://www.goodreads.com/book/show/162898.A_Connecticut_Yankee_in_King_Arthur_s_Court", "num_ratings": "83,675", "num_reviews": "2,407", "avg_ratings": 3.77, "genres": ["Classics", "Fiction", "Fantasy", "Historical", "Historical Fiction", "Humor"], "title": "A Connecticut Yankee in King Arthur's Court", "description": [" ", "A concise introduction that gives the reader important background information; A chronology of the author's life and work; A timeline of significant events that pro", " ", "A concise introduction that gives the reader important background information; A chronology of the author's life and work; A timeline of significant events that provides the book's historical context; An outline of key themes and plot points to guide the reader's own interpretations; Detailed explanatory notes; Critical analysis, including contemporary and modern perspectives on the work; Discussion questions; A list of recommended related books and films to broaden the reader's experience "], "author": "Mark Twain", "num_pages": "480", "awards": [], "places": ["United Kingdom", "Hartford, Connecticut", "Connecticut", "England"], "character_names": ["Merlin", "Hank Morgan", "King Arthur"], "language": "English", "publish_date": "2007-05-01 00:00:00", "ISBN": "1416534733"},
{"url": "https://www.goodreads.com/book/show/6884701-the-prince-and-the-pauper", "num_ratings": "97,229", "num_reviews": "1,740", "avg_ratings": 3.84, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature", "Childrens", "Adventure", "Young Adult", "Historical", "Literature", "American", "Classics", "Classic Literature"], "title": "The Prince and the Pauper", "description": ["This is the story of two young boys, one a prince and the other a pauper, who look identical. They meet and on a whim trade places. Unfortunately each ends up trapped in the other's world. The result is a great adventure story told by the master storyteller Mark Twain. The text is unabridged and includes 114 vintage illustrations from the original 1882 edition."], "author": "Mark Twain", "num_pages": "166", "awards": [], "places": ["London, England"], "character_names": ["Tom Canty", "Prince Edward Tudor", "Miles Hendon", "Hugh Hendon", "Lady Elizabeth", "John Canty"], "language": "English", "publish_date": "2009-03-16 00:00:00", "ISBN": "0941599752"},
{"url": "https://www.goodreads.com/book/show/24583.The_Adventures_of_Tom_Sawyer", "num_ratings": "649,359", "num_reviews": "8,004", "avg_ratings": 3.9, "genres": ["Classics", "Fiction", "Adventure", "Young Adult", "Historical", "Historical Fiction"], "title": "The Adventures of Tom Sawyer", "author": "Mark Twain", "num_pages": "244", "awards": ["Lewis Carroll Shelf Award (1967)"], "places": [], "character_names": ["Huckleberry Finn", "Tom Sawyer"], "language": "English", "publish_date": "2006-02-28 00:00:00", "ISBN": "0143039563"},
{"url": "https://www.goodreads.com/book/show/2956.The_Adventures_of_Huckleberry_Finn", "num_ratings": "1,054,269", "num_reviews": "13,455", "avg_ratings": 3.81, "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Literature", "Young Adult", "Adventure"], "title": "The Adventures of Huckleberry Finn", "description": ["A nineteenth-century boy from a Mississippi River town recounts his adventures as he travels down the river with a runaway slave, encountering a family involved in a feud, two scoundrels pretending to be royalty, and Tom Sawyer's aunt who mistakes him for Tom."], "author": "Mark Twain", "num_pages": "327", "awards": [], "places": ["United States of America", "St. Petersburg, Missouri", "Hannibal, Missouri", "Missouri", "Mississippi River"], "character_names": ["Huckleberry Finn", "Tom Sawyer", "Jim Upton", "Tom Sawyer", "Jim Upton"], "language": "English", "publish_date": "2002-12-31 00:00:00", "ISBN": "0142437174"}
]